{"user_id": "110606257376357370534", "name": "Will & Kate P", "time": 1628774934294, "rating": 5.0, "text": "Exceptional service! It was my wife's and mine anniversary. Hunter was professional and courteous. We could not and have not had a better experience with a limousine service. Thanks Hunter would definitely recommend!", "pics": null, "resp": {"time": 1628816551000, "text": "Thank you for letting us be a part of your anniversary evening! Thank you for the review!"}, "gmap_id": "0x889bb382878a2c8b:0xe0dd833edaefb4e9"}
{"user_id": "110291693918153931807", "name": "ted schmidt", "time": 1628130330119, "rating": 5.0, "text": "William responded to every request very quickly and professionally.  He was early and treated us all to a red carpet service!  Highly recommend William and Hunter  Livery....Top shelf!", "pics": null, "resp": {"time": 1628816471313, "text": "Mr Schmidt, so glad you and your family enjoyed the evening! Thank you so much for the positive review!"}, "gmap_id": "0x889bb382878a2c8b:0xe0dd833edaefb4e9"}
{"user_id": "117837272315037822985", "name": "L Graddick", "time": 1617129211881, "rating": 5.0, "text": "Great veteran owned company! Made the rental experience worth going back.", "pics": null, "resp": {"time": 1617131190003, "text": "Thank you, Mr Graddick, for taking the time to leave us a review and especially thank you for the 5 star review! It was a pleasure to serve you and your family at the wedding!"}, "gmap_id": "0x889bb382878a2c8b:0xe0dd833edaefb4e9"}
{"user_id": "117843785439318237527", "name": "Tommy Vaughan", "time": 1604415234454, "rating": 5.0, "text": "Wonderful experience with Hunter Livery. Totally professional well-dressed driver and on time for each pickup and drop off. It's nice to see a business go the extra mile for you. Will be calling Hunter again for our next \"night out on the town\" in Mobile, Alabama.", "pics": null, "resp": {"time": 1617131515486, "text": "Thank you Mr Vaughan for the 5 star review, we look forward to serving your future business travel needs!"}, "gmap_id": "0x889bb382878a2c8b:0xe0dd833edaefb4e9"}
{"user_id": "100323410172490482340", "name": "Sam Pomier", "time": 1607865414228, "rating": 5.0, "text": "This place has amazing customer service!  Very professional and prompt in communication. Would highly recommend to anyone.", "pics": null, "resp": {"time": 1617131356262, "text": "Thank you for the opportunity to serve you at your wedding! Thank you for the 5 star review, we wish you the best!"}, "gmap_id": "0x889bb382878a2c8b:0xe0dd833edaefb4e9"}
{"user_id": "109255922959469182788", "name": "Marcie Edwards", "time": 1524624581997, "rating": 5.0, "text": "Hunter Livery is awesome. Their vehicle fleet is well maintained. Their drivers are always polite, punctual, and professional.  And, they always go above and beyond to take care of their clients!  I highly recommend their services.", "pics": null, "resp": {"time": 1524628372206, "text": "Mrs Edwards,  Thank you for your review, it was a pleasure serving you at the wedding! We look forward to any opportunity to serve you in the future!"}, "gmap_id": "0x889bb382878a2c8b:0xe0dd833edaefb4e9"}
{"user_id": "107266726952390149834", "name": "Daniel Nichols", "time": 1423520863888, "rating": 5.0, "text": "My wife and I used Hunter Limousine on our wedding day to get her and her bridesmaids from Mobile to the Grand Hotel, then on to Oak Hollow Farm. All I can say is William is a class act and we could not have asked for better service. He was extremely professional, timely, courteous and also helpful when we needed to add additional services. I highly recommend.", "pics": null, "resp": {"time": 1432132573877, "text": "Mr Nichols,\n\nThank you for allowing us to be a part of your wedding, and thank you for taking the time to leave a review of your experience!"}, "gmap_id": "0x889bb382878a2c8b:0xe0dd833edaefb4e9"}
{"user_id": "109150362218092659017", "name": "John Wolf", "time": 1494618486748, "rating": 1.0, "text": "TLDR: Double booked my wedding car after assuring me it was available.\n\nI booked the 1950 Chevy as a wedding get-away car over a month ago, after calling to confirm availability because I knew there were a lot of weddings our particular weekend in Mobile. After confirming the availability, I immediately booked online as I felt more secure using the online portal to give payment information. I was assured the vehicle and driver would be in place at least thirty minutes before pickup.\n\nI received a call 9 days before the wedding from the owner, informing me that they had another reservation earlier that night, and he didn't think the timing would work out.  I find it exceptionally unprofessional that the booking was confirmed beforehand (the online booking portal specifically requires a confirmation). No bride expecting a vintage automobile as a getaway will ever be satisfied with an Escalade as an alternative.", "pics": null, "resp": null, "gmap_id": "0x889bb382878a2c8b:0xe0dd833edaefb4e9"}
{"user_id": "115792306887967401246", "name": "Jonathan Bolson", "time": 1463825786026, "rating": 5.0, "text": "Punctual Professional service, with a beautiful fleet to choose from", "pics": null, "resp": {"time": 1463837305255, "text": "Thank you, Mr Bolson, we are glad you were happy with the service and look forward to serving you in the future!"}, "gmap_id": "0x889bb382878a2c8b:0xe0dd833edaefb4e9"}
{"user_id": "116624594615363742545", "name": "Alexandria Adams", "time": 1619220967579, "rating": 1.0, "text": "Called to try and get a taxi ride, was going over details with friends and asked how long it will take to get to us, as we were looking at other ride services trying to find the fastest route. He cussed at me and hung up in my face. Went with lyft instead and had a much better experience", "pics": null, "resp": null, "gmap_id": "0x889a0502d72f7ef9:0xfa386bbd90cda5a"}
{"user_id": "103678456628802219855", "name": "Erica Asble", "time": 1627147106853, "rating": 5.0, "text": "Our driver was super nice, picked us up even though we were staying in the not so tourist part of town on a busy night. Give them a call first, and if there is a wait. I suggest to take it they we be there, and won't give you the \"I'll be there in 15......\" an hour later your still waiting...", "pics": null, "resp": null, "gmap_id": "0x889a0502d72f7ef9:0xfa386bbd90cda5a"}
{"user_id": "100733187213278980832", "name": "Tommy Miller", "time": 1617242873879, "rating": 1.0, "text": "Whatever man works customer service should be fired instantly. I didn’t know the address of where we were going and I asked for a second to look it up and he said “oh my god....” then hung up. Once Uber and Lyft reach this town, good luck.", "pics": null, "resp": null, "gmap_id": "0x889a0502d72f7ef9:0xfa386bbd90cda5a"}
{"user_id": "113976121440104020579", "name": "Christy Czapla", "time": 1509034040091, "rating": 5.0, "text": "Best taxi service in the area!!! These guys are AMAZING!!! They arrived with smiles and on time. Could not ask for better service. I HIGHLY recommend. I manage a hotel in the area and my guest and I always use Modern Taxi. We know we won't be disappointed. Thank you so much for always being there and providing top notch service! :)", "pics": null, "resp": null, "gmap_id": "0x889a0502d72f7ef9:0xfa386bbd90cda5a"}
{"user_id": "115391032785139066111", "name": "Wes Fulgham", "time": 1510279876523, "rating": 5.0, "text": "These guys are the best taxi service that I have ever used!  I live in a college town and I use taxis all the time, but I have never come across a company like this!  They are super responsive and always on time.  They even give great advice for restaurants and bars!  If you need a taxi... only call them.  You will love them as well.", "pics": null, "resp": null, "gmap_id": "0x889a0502d72f7ef9:0xfa386bbd90cda5a"}
{"user_id": "113405348411375398252", "name": "Spenser Frank", "time": 1470426693020, "rating": 5.0, "text": "Reserved the party bus and MAN was it a fun night! The new look with the fresh interior was awesome! The limo wrap seating had us all able to laugh and talk and we almost forgot we were en route to the bars! Great night! Quality service! Love them!", "pics": null, "resp": null, "gmap_id": "0x889a0502d72f7ef9:0xfa386bbd90cda5a"}
{"user_id": "113773426029634682065", "name": "Jennifer Daniels", "time": 1470521723597, "rating": 5.0, "text": "I love this taxi service!!!!! During our stay we had woman, named Haley, and she was fantastic. Take us where we needed to go and very helpful the following day with recommending places to go and taking us there. Always on time. Her boyfriend is a driver as well and we enjoyed our time with!!! You guys are great! I HIGHLY reccommend them.", "pics": null, "resp": null, "gmap_id": "0x889a0502d72f7ef9:0xfa386bbd90cda5a"}
{"user_id": "118269714264923802954", "name": "Allisa Belcher", "time": 1470466517045, "rating": 5.0, "text": "Brian was awesome. He was able to tell us where all the awesome places were in Gulf Shores. He picked us up from our condo,\nBrought us to dinner, then to another bar and then home. Brian was nothing but pleasant to talk to the entire time. Such great customer service! Another plus is he is a retired serviceman! Support our veterans!", "pics": null, "resp": null, "gmap_id": "0x889a0502d72f7ef9:0xfa386bbd90cda5a"}
{"user_id": "117681941863748455068", "name": "Paul Saputo", "time": 1501424495873, "rating": 1.0, "text": "We called this guy, he promised to come to pick us up in 30 minutes. He didn't come and never answered the phone again. As it turns out, we found out from people that he has this reputation. If you have less than 4 people he will promise to pick you up and then not come.", "pics": null, "resp": null, "gmap_id": "0x889a0502d72f7ef9:0xfa386bbd90cda5a"}
{"user_id": "106423173223880018554", "name": "Nicholas Crownover", "time": 1470278189184, "rating": 5.0, "text": "My boyfriend and I had an amazing time thanks to Modern Taxi.  They were prompt and attentive and always on time.  Thank you so much to Haley and Steve our two favorite drivers.", "pics": null, "resp": null, "gmap_id": "0x889a0502d72f7ef9:0xfa386bbd90cda5a"}
{"user_id": "105923466648296369308", "name": "matt long", "time": 1459845849219, "rating": 5.0, "text": "Great service. These Guys come highly recommend and now I see why. Thank you.", "pics": null, "resp": null, "gmap_id": "0x889a0502d72f7ef9:0xfa386bbd90cda5a"}
{"user_id": "107588004501901242581", "name": "Jon Blough", "time": 1470418190992, "rating": 5.0, "text": "I've used Brian and Haley several times. Awesome awesome cab. Very helpful on where to go and what to do in Gulf shores.", "pics": null, "resp": null, "gmap_id": "0x889a0502d72f7ef9:0xfa386bbd90cda5a"}
{"user_id": "112828275971089499807", "name": "sarah hunter", "time": 1476501906480, "rating": 5.0, "text": "Awesome...thanks Haley...great service..come on guys share..honest dependable and tolerate of Dog...", "pics": null, "resp": null, "gmap_id": "0x889a0502d72f7ef9:0xfa386bbd90cda5a"}
{"user_id": "105515159875215762419", "name": "B Chev", "time": 1493417016145, "rating": 5.0, "text": "Great service. Best drivers in this zip code.", "pics": null, "resp": null, "gmap_id": "0x889a0502d72f7ef9:0xfa386bbd90cda5a"}
{"user_id": "102566002986571498954", "name": "Audra Renae", "time": 1511619491868, "rating": 5.0, "text": "Officially the only taxi service in the area I will use!! Highly recommended!!", "pics": null, "resp": null, "gmap_id": "0x889a0502d72f7ef9:0xfa386bbd90cda5a"}
{"user_id": "101699811638066924787", "name": "Timothy Bond (Your Publishing Partner)", "time": 1469996368299, "rating": 1.0, "text": "The guy who answered  the phone was sarcastic and acted aggitated that I even called. Told me he would have a driver to me in 20 minutes. The driver never came. As i post this 90 minutes after i called. They dont even deserve the 1 star im giving them.", "pics": null, "resp": null, "gmap_id": "0x889a0502d72f7ef9:0xfa386bbd90cda5a"}
{"user_id": "112685939883495688856", "name": "Misty White", "time": 1470361697210, "rating": 5.0, "text": "Always fast and professional!  I always choose Modern!", "pics": null, "resp": null, "gmap_id": "0x889a0502d72f7ef9:0xfa386bbd90cda5a"}
{"user_id": "110413733325553336523", "name": "Connie Drake", "time": 1478194742396, "rating": 1.0, "text": "What a rip off used this service to go from Gulf Shores to floraBama this weekend and was ripped off driver didn't even run the Meter state's it was broke 45$ for 2 people !! Won't use this company again !!! There meters are over calculated it's a scam company!", "pics": null, "resp": {"time": 1474926159402, "text": "Our rates go by the stated rates posted in our taxis.  I am sorry if you feel that you were over charged.  But none of our meters are broken so you may have taken another company."}, "gmap_id": "0x889a0502d72f7ef9:0xfa386bbd90cda5a"}
{"user_id": "117612484903452830505", "name": "Jason Thomas", "time": 1520631523908, "rating": 1.0, "text": "Rip off", "pics": null, "resp": null, "gmap_id": "0x889a0502d72f7ef9:0xfa386bbd90cda5a"}
{"user_id": "116227332575548396686", "name": "Majestic Jamaica", "time": 1468595923425, "rating": 1.0, "text": "Horrible Taxi Service, and Racist!", "pics": null, "resp": null, "gmap_id": "0x889a0502d72f7ef9:0xfa386bbd90cda5a"}
{"user_id": "101922418602475305523", "name": "Robert McGoey", "time": 1619537268514, "rating": 5.0, "text": "Tiger Limousine is our go-to for special event transportation.  I have used the service for holiday tours of area Christmas lights and for special birthday dinners, and using Tiger Limo always enhances our enjoyment of the event.  The drivers are punctual and professional, and the service offers a good value for the price.   Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888cf3e0d47834f5:0xad391d854c4cc509"}
{"user_id": "108859368694277904248", "name": "Dana Rogers", "time": 1620696458443, "rating": 1.0, "text": "My husband rented a limo for our 25th anniversary. He wanted the night to be fabulous for us. We had a 2 hour drive to the restaurant we chose for the evening and decided it would be so nice to have a limo take us so we could enjoy our time together. When the limo came and we entered into the limo the car was disgusting. Apparently they had taken prom students over the weekend and our date was on Tuesday. It seems no one could clean the car between the the 2. The radio was broken the windows were all smeared up, glitter all over and the floors had mud on them. There was a knife with cake icing on it sticking out of the seat which in turn got icing on my dress. The driver was okay and drove very well  but the car was absolutely horrible. We were tempted to just cancel and drive ourselves but we had paid ahead of time and were afraid we wouldn’t get our money back.", "pics": null, "resp": null, "gmap_id": "0x888cf3e0d47834f5:0xad391d854c4cc509"}
{"user_id": "109802472567920569608", "name": "Marianne McCarley", "time": 1620071433909, "rating": 5.0, "text": "Tiger Limousine is the best service in the Auburn area. We've used them for years. Brett always takes care of us. He's courteous and always has an interesting story for us. Would recommend!", "pics": null, "resp": null, "gmap_id": "0x888cf3e0d47834f5:0xad391d854c4cc509"}
{"user_id": "106552812919816655091", "name": "Marianne McCarley", "time": 1619534344357, "rating": 5.0, "text": "I love this company, and rave about it every chance I get! Very professional and always go the extra mile as they did for my birthday party. This company is my go-to for all my family’s special events in Auburn/ Opelika!", "pics": null, "resp": null, "gmap_id": "0x888cf3e0d47834f5:0xad391d854c4cc509"}
{"user_id": "117578032569773948686", "name": "Sam Cooper", "time": 1619470245352, "rating": 5.0, "text": "Great service. A lot cheaper than the other companies I called. I would recommend this company because of how easy it was to book.", "pics": null, "resp": null, "gmap_id": "0x888cf3e0d47834f5:0xad391d854c4cc509"}
{"user_id": "111746744735140166978", "name": "Bobby Lancaster", "time": 1620097319950, "rating": 5.0, "text": "Great limo service.  Provided us with charter buses to transport our guests then a nice get away limo for the bride and groom. On time and clean.", "pics": null, "resp": null, "gmap_id": "0x888cf3e0d47834f5:0xad391d854c4cc509"}
{"user_id": "101845029013178827578", "name": "Mifune's Life", "time": 1624922259712, "rating": 5.0, "text": "Want to give a  BIG thanks to Paul, our driver for his patience!!  Would request him next time!!", "pics": null, "resp": null, "gmap_id": "0x888cf3e0d47834f5:0xad391d854c4cc509"}
{"user_id": "105557534958865483158", "name": "Glenn Robertson", "time": 1620070965237, "rating": 5.0, "text": "Professional service. We rented a limo, shuttle bus, and horse and carriage from them. Everything was flawless.", "pics": null, "resp": null, "gmap_id": "0x888cf3e0d47834f5:0xad391d854c4cc509"}
{"user_id": "108990400888851164773", "name": "Mackenzie Poole", "time": 1613062552702, "rating": 5.0, "text": "Highly recommend Tiger Limousine! Kevin is very professional and they are extremely fair priced. Look no further for limousine services in the Auburn-Opelika area.", "pics": null, "resp": {"time": 1613068186296, "text": "Thank you for your kind words.  We hope we can be of service to you in the future. Thank you for your business."}, "gmap_id": "0x888cf3e0d47834f5:0xad391d854c4cc509"}
{"user_id": "111843632746895348924", "name": "Ben Hagin", "time": 1620934409953, "rating": 5.0, "text": "The driver of the limo went beyond what I expected him to do. Usually they just open the door but he helped us with a few things in the wedding. Use David if you can.", "pics": null, "resp": null, "gmap_id": "0x888cf3e0d47834f5:0xad391d854c4cc509"}
{"user_id": "105736294896681277643", "name": "Linda McLaughlin Johnson", "time": 1619081433402, "rating": 3.0, "text": "Not real friendly, expensive 15$ for a 1.5 mile ride.", "pics": null, "resp": null, "gmap_id": "0x888cf3e0d47834f5:0xad391d854c4cc509"}
{"user_id": "116741373699518650931", "name": "Hay Dawk", "time": 1619398302078, "rating": 1.0, "text": "This crook overcharged me $30 for 1.3 miles .once I made it to my truck the taxi driver became aggressive in a threatening tone saying to stay in his taxi until I pay him.I asked him ,how was I going to pay him if I need to grabbed the money out the truck .this guy is a crook and violent and should not be trusted unless you want him to con you out your money and make you feel unsafe while riding with him.he looks homeless and like he sleep in his vehicle", "pics": null, "resp": null, "gmap_id": "0x888cf3e0d47834f5:0xad391d854c4cc509"}
{"user_id": "101353509274108666689", "name": "Dan Ulrich", "time": 1625425595243, "rating": 5.0, "text": "So great to hire a service with high integrity in a day and age when it’s in short supply. Barry and Bobby (our driver) we’re both great to work with.  Best out there!\n\nI highly recommend Prestige Limousine Service of Tuscaloosa when you need to be somewhere important, and need a company you can trust.\n\nI did, and things I could not predict happened on our side, and they stayed with us!\n\nFrom our driver to the owner, who worked with me directly also, I had a great experience.  This is our go-to company.\n\nYou will not regret hiring them!", "pics": null, "resp": {"time": 1625426732095, "text": "Thanks Dan!! Bobby is Top Notch!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "116016426651345107311", "name": "Laguapauno Finkley", "time": 1624281764498, "rating": 5.0, "text": "From start till finish the entire process was easy and they were super professional! Driver Anthony was amazing! We rented the Hummer, seats about 10 comfortably, we couldn’t stand up but it was really nice and luxurious. We enjoyed every min will definitely be using them again!", "pics": null, "resp": {"time": 1624285851166, "text": "Thanks Laguapauno!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "108757905240873368820", "name": "Briel Dudley", "time": 1620949042652, "rating": 5.0, "text": "Barry and the driver (forgot his name) were awesome! I wanted to surprise my boyfriend for his 30th with a stretch hummer ride. I had specific details on how I wanted everything to operate and they killed it! Barry must have relayed all the details perfectly because the driver was punctual, patient and very kind. He did everything just right and even helped me get my blindfolded boyfriend to the limo door...while holding an umbrella for us, which he didn't have to do! The driver was a great sport and Barry was very down to earth, professional and helpful. Customer service was a ten out of ten, and I would totally recommend Prestige Limo Service to any and everyone. Unforgettable night and totally worth the price!", "pics": null, "resp": {"time": 1620951318135, "text": "🥰 Thanks for that wonderful review!! Anthony Thomas was the driver that night. Top notch Chauffeur!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "109049484494708857894", "name": "Julia Deters", "time": 1618088392449, "rating": 5.0, "text": "Prestige Limo Service is hands down the best limo service out there! Very professional, on time and always fun! Barry is the best, he is so caring and never fails to give you the best life advice! Also, he never complains even if you need to make an extra stop. Thank you Prestige Limo Service and thank you Barry!!", "pics": null, "resp": {"time": 1618114804386, "text": "Thanks Julia!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "105977171044838278193", "name": "Piper Chans", "time": 1618110683483, "rating": 5.0, "text": "Barry and all the drivers are the best of the best! They ensure you have a good time in the limo or bus. They are always on time and have great communication! They also make sure you listen to the best music and have the best time during your ride. I would choose riding with Barry than an uber any day! 10/10 experience.", "pics": null, "resp": {"time": 1618114930391, "text": "Thanks Piper!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "116732723992550987839", "name": "April Williams", "time": 1610589517317, "rating": 5.0, "text": "Everything was nice. Mr. Anthony was such a gentleman and he made sure we was good and he was on time. I will be using prestige limo again. Thanks Mr. Barry for your services.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN-mClF8ZilN4EA9zI2XRzRFACHbuZ4xf3EureA=w150-h150-k-no-p"]}], "resp": {"time": 1610642051304, "text": "Thanks April!! Anthony is top notch!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "114464579284992103467", "name": "Emma Williams", "time": 1618180017352, "rating": 5.0, "text": "Barry is such a great driver and is always on time! Not only is he good at his job, but he’s a wonderful and caring person! He always makes me feel so welcome and safe. I highly recommend using Prestige Limo Service- you won’t regret it!!", "pics": null, "resp": {"time": 1618190033827, "text": "Thanks Emma!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "109595143549732002479", "name": "Lauren Lamb", "time": 1618261463506, "rating": 5.0, "text": "Prestige Limo service is extremely professional and reliable when it come to their driving services. Barry and many of the other limo service drivers have been some of the most understanding and flexible people I have ever met and they constantly work with their customers so that they can have the best experience possible. I enjoy using their services and do so almost every weekend - I would recommend this company to anyone!", "pics": null, "resp": {"time": 1618317283432, "text": "Thanks Lauren!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "115759704997375599410", "name": "Maddy Schwing", "time": 1617904250726, "rating": 5.0, "text": "Barry is the absolute best driver you might ever experience! Whether it is a short or long ride, it is such a great time. Barry is so nice to all of us and even blasts the karaoke to jam out! I HIGHLY recommend and it is so so fun!!!!", "pics": null, "resp": {"time": 1617928210728, "text": "Thanks Maddy!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "109041057920238724250", "name": "Alexis Bastoni", "time": 1617905794580, "rating": 5.0, "text": "Prestige limo service is very professional and extremely good quality! Barry is the best, he is so nice and very welcoming to everyone that he drives! He is always on time and makes the ride super fun with music! I 100% recommend this service!", "pics": null, "resp": {"time": 1617928141444, "text": "Thanks Alexis!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "102311420710018566365", "name": "Hannah Hiles", "time": 1617324390709, "rating": 5.0, "text": "Prestige limo is an awesome service! Barry is the best! He is always on time, opens the door, and gets us safely to where we need to be! He is very professional, and he even lets us sing karaoke. I would definitely recommend.", "pics": null, "resp": {"time": 1617325168639, "text": "Thanks Hannah!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "111028671265416422807", "name": "Caroline Asplen", "time": 1618195057368, "rating": 5.0, "text": "Prestige is the BEST!!! Barry is awesome. He is always on time, communicates pick up and drop off information well, and is a careful and attentive driver! He is so friendly and fun and lets us sing karaoke!! I'd recommend Prestige Limo to anyone looking for a driving service!!!", "pics": null, "resp": {"time": 1618237504975, "text": "Thanks Caroline!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "118088804504270583771", "name": "Shannon Huey", "time": 1618088145623, "rating": 5.0, "text": "Barry is THE best driver! very reliable, on time, and safe! would recommend Barry to anyone in need of a driving service! super fun karaoke too :)", "pics": null, "resp": {"time": 1618114787134, "text": "Thanks Shannon!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "115572297832890158838", "name": "Kathleen (Anne Bennett) Hammons", "time": 1618015184515, "rating": 5.0, "text": "Barry is the absolute sweetest person and best driver! He always communicates well with me about where he will be when he picks me up. He makes the ride to your destination a fun time and always gets you there in a timely manner!!! Definitely recommend using Prestige Limo Services!!!", "pics": null, "resp": {"time": 1618027226096, "text": "Thanks Kathleen!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "102340389062106964052", "name": "Molly Manale", "time": 1617996298892, "rating": 5.0, "text": "Prestige is the best limo service out there! Barry and Anthony are always on time, so friendly, and have the best customer service. I would recommend Prestige to anyone in need of their services. They make riding in their vehicles so enjoyable and memorable!!", "pics": null, "resp": {"time": 1618027162244, "text": "Thanks Molly!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "115300035708744153512", "name": "emily grace lemak", "time": 1618090732689, "rating": 5.0, "text": "My sorority uses Prestige Limo Service when we have events and we love it! The drivers are so nice, fun and safe. We can always count on them for a safe ride home while having a fun time. The karaoke is our favorite and we love Barry!!!", "pics": null, "resp": {"time": 1618114824964, "text": "Thanks Emily Grace!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "117543345879792146856", "name": "dani danks", "time": 1618026492077, "rating": 5.0, "text": "Barry and all the other drivers are so awesome!! Always on time and great communication about pick up locations! I always feel 100% confident that me and my friends are safe and will get to where we’re going quickly with them!", "pics": null, "resp": {"time": 1618027301183, "text": "Thanks Dani!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "109443404151935476508", "name": "Abbigale Waters", "time": 1618160195668, "rating": 5.0, "text": "Barry is the best! He is so sweet and professional. He cares a lot about everyone he drives! He is also SO fun and lets us do karaoke on the karaoke machine. He will also hype u up while your jamming out. He is the best ever!", "pics": null, "resp": {"time": 1618189770261, "text": "Thanks Abbigale!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101618436456383833657", "name": "Kathleen Adriano", "time": 1618242527518, "rating": 5.0, "text": "Barry and all his drivers are the best ones out there! Extremely reliable and the car is always clean. He is very friendly and professional and safely gets everyone to their respected locations.", "pics": null, "resp": {"time": 1618243252223, "text": "Thanks Kathleen!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "100015200579760630658", "name": "Jenna Groeber", "time": 1618252520061, "rating": 5.0, "text": "I loved my experience in the limo. The driver was extremely professional, and I felt safe. It was also a fun time! Would definitely recommend this limo service to my friends.", "pics": null, "resp": {"time": 1618317379167, "text": "Thanks Jenna!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "115333103498080487560", "name": "Avery Anderson", "time": 1618236643593, "rating": 5.0, "text": "Barry and Prestige Limo are the best! The shuttles are very clean and the drivers are great. They have great communication and always show up on time! Highly recommend!", "pics": null, "resp": {"time": 1618237366248, "text": "Thanks Avery!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "112898108794999773608", "name": "Taylor Boothe", "time": 1618101354441, "rating": 5.0, "text": "Barry is one of the most kind human beings and is always so willing to drive my friends and I whenever we need it!! He has been a huge help to the majority of my college experience and I would recommend him, as well as the rest of the Prestige Limousine Service, to anyone and EVERYONE!! <3", "pics": null, "resp": {"time": 1618114859500, "text": "Thanks Taylor!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "106460236105252388106", "name": "Will May", "time": 1618169311913, "rating": 5.0, "text": "Prestige limo has gotten me and my friends to our destinations safely on a consistent basis! Everyone who drives is so nice and make sure we have a good time while on the road. Thank you guys!", "pics": null, "resp": {"time": 1618189924867, "text": "Thanks Will!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "112245509330676561486", "name": "Paige Gruggett", "time": 1618258527424, "rating": 5.0, "text": "Barry and the rest of the Prestige Limo drivers are amazing. He is very kind and will take you wherever you need to go with no complaints! I will definitely use Barry and Prestige Limo services again in the future!", "pics": null, "resp": {"time": 1618317313634, "text": "Thanks Paige!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "100501794274502461422", "name": "Chase Compson", "time": 1618161134160, "rating": 5.0, "text": "Barry and the other drivers are all so amazing!!! They are so professional I always feel incredibly safe when using them! They are all unbelievably kind and hospitable. I love riding with them!", "pics": null, "resp": {"time": 1618189863103, "text": "Thanks Chase!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "108210226354326868954", "name": "Reba Moore", "time": 1615756212920, "rating": 5.0, "text": "They were actually early which worked out best for us bc we used it for a Child Of God Banquet and we got done sooner than I expected. The driver was very polite and professional. We had about thirty kids and he was great with them. We will be using them again next year!", "pics": null, "resp": {"time": 1615814666531, "text": "Thanks Reba!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "106756865288127463670", "name": "Mason Milner", "time": 1610934157041, "rating": 5.0, "text": "Nothing short of the best. The driver arrived ahead of time, loaded our stuff and made sure we had everything we needed. The limo was super clean and comfortable. I highly recommend using this company!", "pics": null, "resp": {"time": 1610935507748, "text": "Thanks Mr. And Mrs. Milner for calling on Prestige Limousine Service on your special day!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "106700027154965368853", "name": "Olivia Owens", "time": 1618101414361, "rating": 5.0, "text": "I have absolutely loved my experiences with Prestige Limousine! Barry was an absolute joy and was so kind to all of us! I felt very comfortable and safe during my ride (especially considering COVID times) Highly recommend Barry and Prestige Limousine for a special event!", "pics": null, "resp": {"time": 1618114895706, "text": "Thanks Olivia!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "104471989905593312102", "name": "Anna Duffy", "time": 1618101369907, "rating": 5.0, "text": "Barry is an absolute gem! He keeps the limo so clean and orderly! He is so sweet and makes the drive so much fun!! I would definitely book Barry for your next special event! 10/10", "pics": null, "resp": {"time": 1618114876757, "text": "Thanks Anna!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "115106130780069182091", "name": "Meredith Barnes", "time": 1616202182553, "rating": 5.0, "text": "Barry is one of the most kind-hearted, genuine people I have ever come across! Such a pleasant experience every time I ride with Prestige Limousine and am always treated so well! I have never had any issues and would definitely recommend!!!", "pics": null, "resp": {"time": 1616205377955, "text": "Thanks Barnes!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101544430505533046807", "name": "Grace Kyllo", "time": 1616886751654, "rating": 5.0, "text": "Barry is amazing!!! He is very professional and cares for everyone he drives. Loved doing karaoke as well!! I’ve only had great experiences with Prestige - I highly recommend to everyone!!!", "pics": null, "resp": {"time": 1616887978067, "text": "Thanks Grace!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "111778362351752008133", "name": "Caroline Boatwright", "time": 1618016805626, "rating": 5.0, "text": "100% recommend!! Barry is the best! He is so friendly and nice! He always get us where we need to be one time and he plays great music!", "pics": null, "resp": {"time": 1618027261252, "text": "Thanks Caroline!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "114172470526687225709", "name": "Mia Scarpino", "time": 1618244219685, "rating": 5.0, "text": "Barry and his team are the best Limo Service I have used. They make the whole experience feel safe and comfortable. They are very professional and always on time.", "pics": null, "resp": {"time": 1618317402414, "text": "Thanks Mia!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "107014313871695011967", "name": "Ashleigh Burroughs", "time": 1617913369601, "rating": 5.0, "text": "I love Prestige Limo Service! Barry is always so polite and makes sure we are always having a great night! It has become such a fun memory for me!", "pics": null, "resp": {"time": 1617928111228, "text": "Thanks Ashleigh!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "105123968146252841024", "name": "Stephanie Mitchell", "time": 1618181407527, "rating": 5.0, "text": "barry was such a good driver, the ride went smoothly and I felt extremely safe with him. he also was very efficient and timely. very good ride overall will be using him again!", "pics": null, "resp": {"time": 1618190066774, "text": "Thanks Stephanie!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "113946567457724080200", "name": "Jillian Groeber", "time": 1618271905352, "rating": 5.0, "text": "Prestige Limo Service is the best! Barry is my favorite driver and he does so much for his customers! All of the drivers are great, and I highly recommend them!", "pics": null, "resp": {"time": 1618317134904, "text": "Thanks Jillian!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101807144768237484721", "name": "mattie schwieger", "time": 1618194635695, "rating": 5.0, "text": "Prestige Limo is the best! They are very professional and are always on time. Barry is also amazing and is always super nice. 100% recommend.", "pics": null, "resp": {"time": 1618237525344, "text": "Thanks Mattie!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "107382611000674469455", "name": "Anna (Caroline) Varelli", "time": 1615007349376, "rating": 5.0, "text": "Barry has been my driver many many times and he is always the best! He opens the door for us, gives us hand sanitizer, gets us where we're going safely and is always so fun!! He even lets us sing karaoke in the car! He is so kind and friendly. Highly highly recommend, he's the best!!!!", "pics": null, "resp": {"time": 1615009029981, "text": "Thanks Anna!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "109554677671572886245", "name": "Addie West", "time": 1617839611235, "rating": 5.0, "text": "My experience with Barry was phenomenal! He is super fun and had a karaoke machine for us. He’s the nicest!", "pics": null, "resp": {"time": 1617855766804, "text": "Thanks Addie!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "100611502673344218594", "name": "Alyssa Cooley", "time": 1616442629118, "rating": 5.0, "text": "Barry is such a phenomenal driver! Super professional and always makes sure his riders are comfortable and happy. I always love riding with him", "pics": null, "resp": {"time": 1616463540888, "text": "Thanks Alyssa!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "103680029173058259599", "name": "Morgan Hixon", "time": 1617904208113, "rating": 5.0, "text": "Prestige Limo is the best shuttle service in Tuscaloosa/Birmingham area. I always get to where I am needing to go in a timely manner and safely. Barry and Anthony you rock!!!", "pics": null, "resp": {"time": 1617928277560, "text": "Thanks Morgan!! I will let Anthony know about your kind words!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "114846293680893407592", "name": "Leigh Allen", "time": 1577202951316, "rating": 5.0, "text": "Recently rented the White Hummer for 16yr birthday surprise. Awesome customer service on the phone when reserving. Anthony was the driver and he is GREAT!!! Very professional and prompt. And even posed in some pictured with the girls. The girls really enjoyed their time in a Prestige Limo. Highly recommend and will definitely use Prestige again!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPppm4OZPSMaYRlVhnNSs2K8mfVLxEU_xDU8-2R=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOVM9xTFdVlCR_gBq0fiW7bp3o1WQE9WYA3VNJ3=w150-h150-k-no-p"]}], "resp": {"time": 1582593143626, "text": "Thanks Leigh!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "108191152862567942071", "name": "Sara Davey Huckaby", "time": 1615006109221, "rating": 5.0, "text": "Prestige Limo Service is the most trustworthy, professional, and fun limo service I have ever encountered. Prestige limo service will always be my number one service I choose for any event. I highly recommend riding with Barry, the best limo driver out there.", "pics": null, "resp": {"time": 1615006979078, "text": "Thanks Sara!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "105788502900648623040", "name": "Abigail (Abby) Thompson", "time": 1617841566545, "rating": 5.0, "text": "I had an amazing experience with this service- Barry is the best driver!! He is so sweet and even lets us sing karaoke:))", "pics": null, "resp": {"time": 1617855748518, "text": "Thanks Abigail!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "107285608169009419812", "name": "M Morningstar", "time": 1619029610051, "rating": 5.0, "text": "Prestige Limo Service is the best there is. Always professional and courteous. Cannot say enough great things about them!!!", "pics": null, "resp": {"time": 1619031229481, "text": "Thanks Monica!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "104680820655652920784", "name": "Anna (Anna Kate) Creel", "time": 1618222025099, "rating": 5.0, "text": "My experience with Prestige Limo is always been great! Barry is the best and is one of my favorite drivers! Definitely book for any event or weekend needs!!!!", "pics": null, "resp": {"time": 1618237389110, "text": "Thanks Anna!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "102954809144750963258", "name": "Emma Thomas", "time": 1617684955205, "rating": 5.0, "text": "Barry and all of the drivers are some of my favorite people! They are all great people to get to know and talk to during the drive! I can’t wait to use Prestige Limos again in the future!", "pics": null, "resp": {"time": 1617830293102, "text": "Thanks Emma!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "114165315524146112812", "name": "Katie McDonough", "time": 1616546159778, "rating": 5.0, "text": "Prestige Limo is my favorite limo service! The reason they are my favorite is because of Barry. Barry is always so kind and professional whenever my friends and I get in the car!", "pics": null, "resp": {"time": 1616609612139, "text": "Thanks Katie!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101656471342040820905", "name": "Campbell A", "time": 1618276245934, "rating": 5.0, "text": "Barry had made ever ride shiver average and amazing! I can always count on him to have above and beyond service! Highly recommend!!", "pics": null, "resp": {"time": 1618317026644, "text": "Thanks Campbell!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "102972841364760747324", "name": "emily hayden", "time": 1617926701480, "rating": 5.0, "text": "Barry is AMAZING. Carpool karaoke is a 10/10 with Barry. If you want to have fun, use Barry no one else!!! I love Barry!!", "pics": null, "resp": {"time": 1617928057372, "text": "Thanks Emily!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "100498417280561575537", "name": "Lindsey Browning", "time": 1618184226964, "rating": 5.0, "text": "This limo service is very professional, safe, reliable, and always on time. The drivers are very social as well. 12/10 recommend!!", "pics": null, "resp": {"time": 1618190113477, "text": "Thanks Lindsey!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "108891014302160617197", "name": "Mya van Zanten", "time": 1618241937310, "rating": 5.0, "text": "Barry is the best thing to ever happen to Tri Delt! He opens the door for us every time we go in and out of the van, and he always makes an effort to greet everyone with a smile. He talks to everyone in the van and makes it a priority that everyone gets home safe. So so thankful for him!", "pics": null, "resp": {"time": 1618243301931, "text": "Thanks Mya!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "104715895174966659952", "name": "Karli Swearingen", "time": 1610746920153, "rating": 5.0, "text": "I rented this limo service for my sister's bachelorette party and it was SO much fun!!! Highly recommend!!! Barry, the owner, is very easy to contact and will answer any questions you have. Our limo driver, Anthony, was so kind and respectful. He always opened the limo doors for us, even if he had to sprint to beat us to it! I look forward to renting with Prestige again!", "pics": null, "resp": {"time": 1610747697887, "text": "Aww thanks Karli for those kind words. We do our best to put our clients first!! Anthony is a top notch chauffeur."}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "112608701620755302290", "name": "Tessa Valente", "time": 1616093192766, "rating": 5.0, "text": "Barry is one of the most amazing, caring people ever! Anytime I text him in need of a ride he replies immediately and always makes sure to help me in the car and provide hand sanitizer. Moreover, he makes the ride to you destination so fun! He plays music, carries on great convo, and even lets us sing karaoke. Thank you so much Barry!", "pics": null, "resp": {"time": 1616096428090, "text": "Thanks Tessa!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "114834953850485397720", "name": "Emma Hybl", "time": 1617647860811, "rating": 5.0, "text": "He is always on time and having a good time! Very cleanly! Would recommend his services to everyone I know!", "pics": null, "resp": {"time": 1617678750963, "text": "Thanks Emma!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "104349826898403130609", "name": "Alyson Burroughs", "time": 1618206821489, "rating": 5.0, "text": "I would 100% recommend Prestige!!!! Barry and all the other drivers are the absolute best!! They have the best service and you even get to sing karaoke!!", "pics": null, "resp": {"time": 1618237406748, "text": "Thanks Alyson!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "104641556208010357790", "name": "Faye O'Connell", "time": 1617842137350, "rating": 5.0, "text": "I love barry so much!! So sweet and so safe! Always on time and always making sure everything is okay!", "pics": null, "resp": {"time": 1617855729940, "text": "Thanks Faye!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "112677216267385415819", "name": "Morgan Reed", "time": 1618073676966, "rating": 5.0, "text": "Barry is awesome!! Always communicates well and makes the ride fun and safe. Would recommend to anyone!!", "pics": null, "resp": {"time": 1618114754911, "text": "Thanks Morgan!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "115169062643360302065", "name": "Taylor Smith", "time": 1617682105892, "rating": 5.0, "text": "I would highly recommend using this limo service!! Barry is so nice and always professional when getting us where we need to go!!", "pics": null, "resp": {"time": 1617830310373, "text": "Thanks Taylor!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "117790218994056171314", "name": "Emily (Carlisle) Gaston", "time": 1617684997406, "rating": 5.0, "text": "Best limo service ever. Would absolutely recommend to my friends!!! Made sure everyone was safe and still having a great time!!", "pics": null, "resp": {"time": 1617739960830, "text": "Thanks Emily!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "111481393518236347114", "name": "lydia jackson", "time": 1617853011884, "rating": 5.0, "text": "The best limo service in Tuscaloosa! Barry is so awesome and professional! Couldn’t ask for a better driver!", "pics": null, "resp": {"time": 1617855713228, "text": "Thanks Iydia!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "111865506830448214685", "name": "Zoe Cultra", "time": 1617672771807, "rating": 5.0, "text": "Highly recommend!! Best service and people. So quick and so much fun.", "pics": null, "resp": {"time": 1617678715598, "text": "Thanks Zoe!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "111952356299658109991", "name": "Emily Sirh", "time": 1618267058594, "rating": 5.0, "text": "The drivers at prestige limo are always so helpful and kind. The best service in town!", "pics": null, "resp": {"time": 1618317157064, "text": "Thanks Emily!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "102844869611094144818", "name": "Kendall Flake", "time": 1618175621169, "rating": 5.0, "text": "Every time I have rode with this service it is always a positive and great environment. I have always felt safe and that I will get to my destination on time.", "pics": null, "resp": {"time": 1618189991825, "text": "Thanks Kendall"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "105514297482352016598", "name": "Samantha Gregg", "time": 1616350582718, "rating": 5.0, "text": "Barry is such a sweet guy that really takes care of the people her is driving! Not only that, but makes sure they’re having a great time!! 10/10", "pics": null, "resp": {"time": 1616351796759, "text": "Thanks Samantha!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101505196469047014118", "name": "Stephen Darling", "time": 1616510648432, "rating": 5.0, "text": "our family used Prestige Limo service for the the homecoming of our love one and the service we received was second to none, it was grade A service, the vehicles was clean and the drivers showed courtesy and was  very professional. I would not hesitate to use  Prestige in the near future.", "pics": null, "resp": {"time": 1616540826031, "text": "Thanks Stephen!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "106958089323134918454", "name": "Alexandra FitzPatrick", "time": 1618258157908, "rating": 5.0, "text": "Prestige and Barry are the best! Got me to the airport safely and on time! Definitely recommend!", "pics": null, "resp": {"time": 1618317346137, "text": "Thanks Alexandra!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "112039948428499658298", "name": "Mary Lowery", "time": 1600454812416, "rating": 5.0, "text": "Barry was the chauffeur for a group of friends last Saturday night on September 12, 2020 from Tuscaloosa to Livingston for a dinner celebration. He walked each of us from our cars to the limousine and held an umbrella over each of us to protect us from the rain. He was quite the gentleman and professional toward all of us which was a fairly large group. He took time to speak and talk to each one of us individually and I felt he Genuinely cared for the safety and any needs that he could assist with. I would highly recommend him for any transportation services you might need! Mary Gail", "pics": null, "resp": {"time": 1600459088230, "text": "Thanks Mary for those wonderful words!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101986873716161708744", "name": "Ashley Frye", "time": 1615248978618, "rating": 5.0, "text": "Prestige Limo Service is always on time, safe, and an overall wonderful experience. They are always very helpful and go out of their way to make sure their costumers are happy!", "pics": null, "resp": {"time": 1615255315065, "text": "Thanks Ashley!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101981746545147802464", "name": "Randi Doherty", "time": 1610929911587, "rating": 5.0, "text": "We loved our experience with Prestige! Our limo driver arrived early & was so nice! We felt so safe with him driving us & will definitely use Prestige again! 💙", "pics": null, "resp": {"time": 1611070774017, "text": "Thanks Randi!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "107626913103718394260", "name": "Sheridan Galyon", "time": 1608165477391, "rating": 5.0, "text": "Mr. David was awesome!! He drove us to dinner and to look at Christmas lights around Tuscaloosa. We had the best time!! Will definitely be doing this again!!", "pics": null, "resp": {"time": 1608166295704, "text": "Thanks Sheridan for that wonderful review,Mr. David is top notch!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "113235716429809574142", "name": "Ella Meloche", "time": 1618239487334, "rating": 5.0, "text": "Amazing! so fun with the new karaoke addition, great way to get around town on weekends and very nice staff!", "pics": null, "resp": {"time": 1618317426139, "text": "Thanks Ella!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "109343124670915538018", "name": "Madison (Maddie) Gugger", "time": 1616441850900, "rating": 5.0, "text": "I can alway count on Prestige to get me safely home and always enjoy the conversations with the drivers! Highly recommend for any occasion!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "117693714851039223357", "name": "Alexis (Lexie) West", "time": 1616416615871, "rating": 5.0, "text": "Barry is the best!! He’s always so nice and helpful! Always have had a great time when using them!!", "pics": null, "resp": {"time": 1616463515620, "text": "Thanks Alexis!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "107237213876016701612", "name": "Stella Cummings", "time": 1618160458405, "rating": 5.0, "text": "Barry is the absolute best driver ever!!! He is very punctual, accommodating, and super fun!!! I absolutely recommended prestige limo services!!!", "pics": null, "resp": {"time": 1618189792784, "text": "Thanks Stella!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "102835535850427011099", "name": "Ardie Lieux", "time": 1618273237119, "rating": 5.0, "text": "I love barry so much. He is a great driver and very professional!", "pics": null, "resp": {"time": 1618317103728, "text": "Thanks Ardie!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "113377045981268461371", "name": "Madison (Maddie) Major", "time": 1617577000417, "rating": 5.0, "text": "Barry is the best! I would 10/10 recommended Prestige Limo, they’re so fun and professional!! The best!!!", "pics": null, "resp": {"time": 1617577666908, "text": "Thanks Madison!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "115263743666317909911", "name": "Community Relations Team", "time": 1615132374286, "rating": 5.0, "text": "Amazing drivers who care about your safety and are incredibly kind on every drive! 10/10, definitely recommend! Barry is my favorite!", "pics": null, "resp": {"time": 1615143489083, "text": "Thanks Community Relations Team!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "112342735684007067932", "name": "Kendall Willard", "time": 1615009691309, "rating": 5.0, "text": "Barry is the best driver ever! So fun and so courteous! Will always recommend:)", "pics": null, "resp": {"time": 1615016519370, "text": "Thanks Kendall!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "108447814391588035744", "name": "Heather McCullar", "time": 1608763955458, "rating": 5.0, "text": "Mr david was awesome.  We loved going to look at Christmas lights. He even helped my 3 year old out of the limo and held her hand into the gas station", "pics": null, "resp": {"time": 1608766361117, "text": "Thanks Heather for calling Prestige Limousine Service. Mr.David is a wonderful chauffeur!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "115972853946827361106", "name": "Meghan Macdonald", "time": 1610587969109, "rating": 5.0, "text": "Love this car service! They always show up super early before your pick up time and are so kind. Highly recommend :)", "pics": null, "resp": {"time": 1610717779089, "text": "Thanks Meghan!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "100402979423732434940", "name": "Tiffany Hagler", "time": 1610588632691, "rating": 5.0, "text": "Great experience with personalized service for my daughters birthday party. Driver was very prompt and friendly.  We will definitely use them again.", "pics": null, "resp": {"time": 1610672054333, "text": "Thanks Tiffany!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "102534948015430291637", "name": "Jillian Fields", "time": 1617676836654, "rating": 5.0, "text": "I scheduled a shuttle for my mom to arrive from the BHM airport, and Barry was absolutely incredible. Every single staff member treats their passengers with the utmost respect, every vehicle is clean, and I could not more highly recommend any service more.", "pics": null, "resp": {"time": 1617678696054, "text": "Thanks Jillian!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101105711683485082625", "name": "Blair Bruce", "time": 1618182081107, "rating": 5.0, "text": "All of the drivers are so great and really good about communicating pickup locations and times!! Barry is the best!!!", "pics": null, "resp": {"time": 1618190085789, "text": "Thanks Blair!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "111349353804132765852", "name": "Hannah Lyon", "time": 1615007082419, "rating": 5.0, "text": "The most friendly and fun drivers!!! Using Prestige is honestly the highlight of my week. Special shout-out to Barry and his karaoke machine!!!!", "pics": null, "resp": {"time": 1615009061856, "text": "Thanks Hannah!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "109569052191327489322", "name": "Amna Kovacevic", "time": 1615007364211, "rating": 5.0, "text": "very nice & friendly driver! made us feel super comfortable and got us to our destination safely!! definitely recommend!!!", "pics": null, "resp": {"time": 1615008995546, "text": "Thanks Amna!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "114460224696347674962", "name": "Mary (Mary Grace) McKeough", "time": 1617905768641, "rating": 5.0, "text": "Barry is the best!!!!!!!! He is so sweet and never lets you open the door yourself!! He is always on time!! It’s always a blast to ride with Barry with karaoke!! I love Barry!!!!", "pics": null, "resp": {"time": 1617928169050, "text": "Thanks Mary!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "114413903850951071461", "name": "Maria Creighton", "time": 1610633134396, "rating": 5.0, "text": "We got the white Hummer limo for my daughters 13th birthday party right before Christmas 2020. This is the best limo service around. Our driver Anthony was exceptional, he arrived early, made stops everywhere we asked and was very attentive to all of the girls. The owners are professional and make the process seamless. Thank you Prestige for making my daughters 13th one to remember!", "pics": null, "resp": {"time": 1610642005003, "text": "Thanks Marie!! Anthony is a great person and he is good with people!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "112708182338981469304", "name": "Emma Woodall", "time": 1618196423728, "rating": 5.0, "text": "Always feel so safe knowing their on the way to pick up:)", "pics": null, "resp": {"time": 1618237456349, "text": "Thanks Emma!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "106526328490540493159", "name": "Mackenzie Porter", "time": 1618239476020, "rating": 5.0, "text": "Amazing Service! Always respectful to me and my friends.", "pics": null, "resp": {"time": 1618317447974, "text": "Thanks Mackenzie!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101046500678090134683", "name": "Laura Boyd", "time": 1618093296726, "rating": 5.0, "text": "Barry is so amazing!! so kind to us whenever he drives and is so so much fun!", "pics": null, "resp": {"time": 1618114839451, "text": "Thanks Laura!!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "104337788709637303475", "name": "Lexi Huggins", "time": 1616551093666, "rating": 5.0, "text": "this company is amazing and barry is the best!! gets me around ttown safely and i have fun doing it.", "pics": null, "resp": {"time": 1616609658987, "text": "Thanks Lexi!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "110047163372757339582", "name": "Alicia (Lexie) Fowler", "time": 1618186586593, "rating": 5.0, "text": "Barry is the BEST!!! Super sweet and safe! If you are debating using Prestige Limo Service, DO IT!!!", "pics": null, "resp": {"time": 1618190137432, "text": "Thanks Alicia!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101441644150667314727", "name": "ashlyn glover", "time": 1618276332580, "rating": 5.0, "text": "Love Barry! Very Professional  and always on time.", "pics": null, "resp": {"time": 1618317047379, "text": "Thanks Ashlyn!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101263746224926638311", "name": "Debbie Benson", "time": 1600458254570, "rating": 5.0, "text": "My friends and I had a wonderful experience being driven by this company. The van (there were 9 of us) was very new, nice, and comfortable. The driver could not have been more accommodating, friendly, and courteous!  Overall, a wonderful experience!!!", "pics": null, "resp": {"time": 1600459156541, "text": "Thanks Debbie for those wonderful words!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "103301910790666166450", "name": "Reagan Gowen", "time": 1615132810735, "rating": 5.0, "text": "The drivers are incredibly kind and safe, especially Barry! They are always on time and very professional!", "pics": null, "resp": {"time": 1615143407189, "text": "Thanks Reagan!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101057270184104246130", "name": "Alicia Long", "time": 1610803980574, "rating": 5.0, "text": "Love their service. Our experience was great & would highly recommend. Can’t wait til next time.", "pics": null, "resp": {"time": 1610825937411, "text": "Thanks Alicia!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "105781204725634745576", "name": "Maddie Murray", "time": 1618077974804, "rating": 5.0, "text": "This is a great company I highly recommend this driving service!", "pics": null, "resp": {"time": 1618114770562, "text": "Thanks Maddie!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "102628982228667969698", "name": "Emily Smith", "time": 1616442961434, "rating": 5.0, "text": "They are the best! Very professional and always reliable.", "pics": null, "resp": {"time": 1616463559829, "text": "Thanks Emily!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "117466526231769002965", "name": "Margaret Hooker", "time": 1615008787886, "rating": 5.0, "text": "Amazing!!! All drivers are super friendly and make the rides so enjoyable. Definitely recommend Prestige Limo Service!", "pics": null, "resp": {"time": 1615008960462, "text": "Thanks Margaret!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "113211837682136403894", "name": "Shawn Gray", "time": 1615839407484, "rating": 5.0, "text": "Professional high-quality operation, extremely detailed oriented management.", "pics": null, "resp": {"time": 1616036213624, "text": "Thanks Shawn!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "117026477119028257460", "name": "Ronnie Whitaker", "time": 1610641555515, "rating": 5.0, "text": "Barry and Prestige limo made my Christmas so very special when they took us(my family )out for Christmas Decoration tour .it was awesome night that we will now\nDo annually .Thanks Prestige Limo", "pics": null, "resp": {"time": 1610641864640, "text": "Thanks Whitaker Family for calling Prestige Limousine Service Inc."}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "106609657704571199410", "name": "Ivy Sharp", "time": 1615219305922, "rating": 5.0, "text": "Barry is the best!! Such quality service", "pics": null, "resp": {"time": 1615220049872, "text": "Thanks Ivy!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "114488129848378795655", "name": "Mildred Starks", "time": 1596550909528, "rating": 5.0, "text": "The services that Mr. Barry provided were awesome. He was very professional, and prompt when communicating about the services that his company provided. Also, despite the circumstances of this pandemic, he promoted high quality and we got excellent quality !! On top of that, our driver was no stranger and made us feel very welcome. I would highly recommend his services to anyone !! 5 🌟’s", "pics": null, "resp": {"time": 1596554075743, "text": "Thanks Mildred!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "105822089276874719923", "name": "Beven Beckham", "time": 1615007786179, "rating": 5.0, "text": "Barry is the absolute best!! I have ridden with him several times and have NO complaints !!", "pics": null, "resp": {"time": 1615008939527, "text": "(Translated by Google) Thanks Trembling !!\n\n(Original)\nThanks Beven!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "115617583621370725321", "name": "Donna Lowery", "time": 1595681171796, "rating": 5.0, "text": "Prestige Limo was the best!  I have used other limo companies in the past that were fine but did not go out of the way to provide excellent customer service like Prestige did.\nAnthony was our driver and he was on time and professional.  The company went above and beyond what we expected!  I had relatives in town for the 1st time who are big Alabama fans.  Prestige Limo gave them a Roll Time welcoming!!!  I will definitely call on them again!!!\nThank you Barry and Anthony!!!\nRoll Tide Roll", "pics": null, "resp": {"time": 1595727546611, "text": "Thanks Donna!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "103378378411456039375", "name": "taylor stenz", "time": 1617914159890, "rating": 5.0, "text": "Always very clean and prompt when arriving! Love how friendly and kind to us they are!!", "pics": null, "resp": {"time": 1617928081181, "text": "Thanks Taylor!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "107845339722480973625", "name": "polly forrestall", "time": 1617686736738, "rating": 5.0, "text": "Barry is fantastic! He always makes the rides comfortable and enjoyable!", "pics": null, "resp": {"time": 1617739991567, "text": "Thanks Polly!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "110098033475992520762", "name": "Anna Woodson", "time": 1618196669307, "rating": 5.0, "text": "Love this limo service! Always look out for their riders!:)", "pics": null, "resp": {"time": 1618237440823, "text": "Thanks Anna!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "115518434422839643927", "name": "Caroline Jones", "time": 1618160679649, "rating": 5.0, "text": "Best Limo service!! Love Barry", "pics": null, "resp": {"time": 1618189807605, "text": "Thanks Caroline!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "112353591783265916733", "name": "Zoe Vanche", "time": 1616521503106, "rating": 5.0, "text": "The best transportation when it comes to efficiency and safety!", "pics": null, "resp": {"time": 1616540752262, "text": "Thanks Zoe!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "100708694493896865763", "name": "Ann Elaine (Lainey) Williams", "time": 1616547087967, "rating": 5.0, "text": "Barry is such an amazing driver!!!! Love having him be our driver!", "pics": null, "resp": {"time": 1616609631299, "text": "Thanks Ann!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "107743293057693966816", "name": "Kylee Popovich", "time": 1617761085180, "rating": 5.0, "text": "amazing company and always very friendly!", "pics": null, "resp": {"time": 1617762450661, "text": "Thanks Kylee!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "109345502904466544287", "name": "Madison Atkins", "time": 1618273840438, "rating": 5.0, "text": "Barry is very professional, kind, and always on time!", "pics": null, "resp": {"time": 1618317080348, "text": "Thanks Madison!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "106463762020430649426", "name": "Mary (Maddie) Drummer", "time": 1617717928896, "rating": 5.0, "text": "Barry is AMAZING!!! We love him.", "pics": null, "resp": {"time": 1617739978337, "text": "Thanks Mary!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "107465198715167253977", "name": "Lina", "time": 1590698216259, "rating": 5.0, "text": "We had the best time with our drivers Anthony and Barry. They were very patient and flexible making sure that we were able to go everywhere we needed to go. This is the best service for anyone needing safe transportation for large groups. We will definitely be using them again. We want to thank you for all the love and support from #Richeyfamily", "pics": null, "resp": {"time": 1590702068826, "text": "Thank you, we had a blast!!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "113718160594063604027", "name": "Brenay Weems", "time": 1596670145471, "rating": 5.0, "text": "My friends surprised me for my graduation from UA with a 3 hr ride from Prestige Limo Service and what a surprise it was! It was an awesome experience. Our driver, Mr. Chris, was very professional and made sure that we were comfortable! He even checked to make sure that we safely made it home afterwards! If you’re looking for top notch limo services, book Prestige! You won’t be disappointed!", "pics": null, "resp": {"time": 1596673839907, "text": "Thanks Brenay!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "113922634471561488106", "name": "Catherine Watson", "time": 1596551121131, "rating": 5.0, "text": "I enjoyed my ride with Prestige Limo Service! It was very clean. The owner was extremely nice and he made us feel very welcome. ❤️", "pics": null, "resp": {"time": 1596554524500, "text": "Thanks Catherine!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "112140994786494285073", "name": "Madeleine Manocchia", "time": 1618160816494, "rating": 5.0, "text": "Highly recommend this great company!", "pics": null, "resp": {"time": 1618189833760, "text": "Thanks Madeleine!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "110262602964176707603", "name": "Sami Swistak", "time": 1581790753131, "rating": 5.0, "text": "Prestige Limo is the best! I've had rides with Hunter, Chris, and Barry and they are all fantastic. They are easy to reach, reliable, and always communicate well. Every vehicle I've gone in has been spotless and most importantly my friends and I always feel safe while riding with Prestige. I highly recommend!!!", "pics": null, "resp": {"time": 1581794455289, "text": "Thanks Sami!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "115802158971367638546", "name": "riley a", "time": 1617644190669, "rating": 5.0, "text": "Prestige Limo is the best!! Safe and reliable, there’s no one better!", "pics": null, "resp": {"time": 1606367098216, "text": "Thanks Riley!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "106511526179073411620", "name": "William Bein", "time": 1624199918372, "rating": 5.0, "text": "Simply the best.", "pics": null, "resp": {"time": 1624285776945, "text": "Thanks!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "109652330658588876585", "name": "Reagan Robinson", "time": 1573688541145, "rating": 5.0, "text": "I have used Prestige Limo Service many times and they never fail to be reliable and personable. Everyone is always happy to help and make me feel safe while getting a ride! If you ever need a limo service in Tuscaloosa this is absolutely the one you should use.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "116543363603224131372", "name": "Alysia Spedale", "time": 1582642357873, "rating": 5.0, "text": "I have used Prestige Limo service many times and highly recommend to anyone! Barry, Chris, and Hunter are all wonderful and safe drivers. They are always on time and willing to go the extra mile. Thanks Prestige!", "pics": null, "resp": {"time": 1582647914768, "text": "Thanks Alysia!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "108739657682724789092", "name": "Sonya Cammon", "time": 1593306707496, "rating": 5.0, "text": "Would recommend this service to anyone in need of limo service. From the service to the driver(Anthony) everything was excellent!", "pics": null, "resp": {"time": 1593316961763, "text": "Thanks Sonya!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "107274497072815544141", "name": "Morgan Patterson", "time": 1582646920380, "rating": 5.0, "text": "I use Prestige Limo Services many times over the weekends to get around town. Barry, Hunter, and Chris are all wonderful drivers! I feel a lot safer driving with them than I would if I were to use Uber. They are always reliable to come get my friends and I, and they are fun and easy to talk to. I highly recommend their company!", "pics": null, "resp": {"time": 1582647998463, "text": "Thanks Morgan!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "104381678665902843167", "name": "Kamryn Carpenter", "time": 1569254653468, "rating": 5.0, "text": "Prestige Limo Service never fails to make me feel safe and comfortable when getting around town! The drivers are quick to respond and very professional. I would recommend this service to anyone -- no hesitation. Kindest and most reliable staff!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "107076948597480964827", "name": "Cassidy Leonard", "time": 1582760294535, "rating": 5.0, "text": "I have never had a better experience than Prestige Limo Service. They are timely, friendly, and safe. You can tell they really care for their passengers, too. Cannot recommend it enough!", "pics": null, "resp": {"time": 1582764216803, "text": "Thanks Cassidy"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "103014773968327655799", "name": "Skylar Devers", "time": 1586358508995, "rating": 5.0, "text": "Prestige is always so courteous and kind with their customers. They really care about their clients and make sure they are taken care of! Awesome company with awesome people!", "pics": null, "resp": {"time": 1592961587721, "text": "Thanks Skylar!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "117759340901180109342", "name": "Adison Welborn", "time": 1582643735704, "rating": 5.0, "text": "I have had Barry, Hunter, Chris and Anthony as drivers all of them being extremely friendly and prompt. They always help my friends and I get home safely while making a fun and safe atmosphere!", "pics": null, "resp": {"time": 1582647958310, "text": "Thanks Adison!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "105772279452907451652", "name": "Kelsi Bryan", "time": 1573578325810, "rating": 5.0, "text": "I use prestige limo for most social events on the weekends. I prefer this method of travel more than uber because you know exactly who will be getting you home. Barry is super nice and makes sure everyone in the car gets to their destination safely.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "108397179878194959331", "name": "Cassie Zak", "time": 1575264898622, "rating": 5.0, "text": "I have used Prestige Limo Service many times over the weekend to get around town. Barry, Hunter, and Chris are all wonderful drivers! They are extremely reliable, fun to talk to, and I always feel very safe. I highly recommend booking a trip with them they are the best!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101223955924067209373", "name": "Tracy Greene", "time": 1596124789777, "rating": 5.0, "text": "My friends and I had a great time with Prestige Limo Service.Thank you so much until next time ❤❤", "pics": null, "resp": {"time": 1596131431350, "text": "Thanks Tracy for calling our service!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "113864178799488671931", "name": "Margot Armayor", "time": 1617643578913, "rating": 5.0, "text": "Prestige limo is a service my friends and I use almost every weekend. The reason we love it so much is because of Barry! He is always on time, opens the door for us, and keeps us safe throughout the ride. I would reccomend him to anyone!", "pics": null, "resp": {"time": 1582292973848, "text": "Thanks Margot!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "115323410098448755673", "name": "Olivia Germond", "time": 1578973062260, "rating": 5.0, "text": "Hunter is amazing. He is so nice and funny and fun to talk to during the ride. Me and my friends had a very safe and enjoyable ride with him and got to our destination timely. I definitely recommend Hunter to anyone using this service!!", "pics": null, "resp": {"time": 1579088498162, "text": "Thanks Olivia!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "115541499845146629178", "name": "Abey Taylor", "time": 1568826937313, "rating": 5.0, "text": "Prestige limo service is absolutely incredible. They are efficient and clean. They are more than willing to listen to your life stories and provide excellent advice. 10/10 recommend", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "105216721561436392536", "name": "Hannah Hawker", "time": 1573510934902, "rating": 5.0, "text": "I always use Prestige Limo Service to get around town on the weekends! Barry is so friendly and makes great conversation. I always feel safe and the drivers are very alert to what’s going on around them! Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "109003010858327852191", "name": "Sarah Jensen", "time": 1569254009545, "rating": 5.0, "text": "Prestige Limo services is the absolute best! Barry and the rest of his drivers are so friendly and take you wherever you need to go safely.  I would highly recommend to everyone!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "102497075483290445100", "name": "Reagan Gowen", "time": 1578974247827, "rating": 5.0, "text": "Hunter has always been kind to me and my girls and we are so thankful for him!! He’s a great driver and we always have fun!! I highly recommend him!!", "pics": null, "resp": {"time": 1579088473041, "text": "Thanks Reagan!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "117474972104152897267", "name": "Jenna Riedel", "time": 1569291057889, "rating": 5.0, "text": "I have loved every experience I have had with Prestige Limo Service. I rely on them to get around town safely almost every weekend. Barry and the rest of the drivers are reliable, kind, and all around great people! I would definitely recommend to anyone looking for a professional driving service that really cares about your safety and satisfaction!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "114069730284621921687", "name": "Ashley Wells", "time": 1593408782582, "rating": 5.0, "text": "Very professional! Friendly staff! Everything was perfect! Will definitely patronize again!", "pics": null, "resp": {"time": 1593415143151, "text": "Thanks Ashley!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "104356229318745480109", "name": "Frances Buntain", "time": 1579016176435, "rating": 5.0, "text": "I love Prestige Limo! The best company with a great reputation, they have amazing costumer service. I recommend Hunter, he is the best!!", "pics": null, "resp": {"time": 1579088525517, "text": "Thanks Frances!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "118381459722243181020", "name": "Anna Thomas", "time": 1568818115847, "rating": 5.0, "text": "Prestige limo service is the best! I use it almost every weekend and have never been disappointed. Barry is so nice and awesome! The drivers are so friendly and reliable and I always feel very comfortable and safe.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "110027308136089600868", "name": "Ally Sapyta", "time": 1569448046945, "rating": 5.0, "text": "Prestige Limo Service goes above and beyond all of my expectations! My friends and I use them weekly to get around town and they are reliable, safe, and efficient.  The owner, Barry, goes out of his way to ensure the safety and comfort of his passengers.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "102782875118790057233", "name": "Maddie Bullard", "time": 1575315918708, "rating": 5.0, "text": "Barry is the best! Great limo service. Highly recommend. Always so nice and friendly and they are very fast!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "116754934949987210195", "name": "Staylor1913", "time": 1511035032872, "rating": 5.0, "text": "We used Prestige Limousine for our wedding back in January 2016. Our ceremony lasted a little longer and our time was up for the services we requested. The Groom and Groomsmen were able to take some pictures with the Limo but that was it. Luckily, our driver was patient but had another client right after our set time. I was able to contact Mr. Barry to explain the dilemma. He was very professional and courteous about our situation. In fact, Mr. Barry told me that we could come back at any time to use the services. I was able to contact Mr. Barry to redeem our service. Mr. Barry remembered us!!!! I was elated. He kept his word and set up a date and time. I recommend Prestige Limousine for all of your personal and professional needs, even if you just want to ride around the town for little while. You will be very satisfied with the staff and customer service!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "111487254833285390629", "name": "Caitlyn (Catie) Meanor", "time": 1575388655161, "rating": 5.0, "text": "I use this shuttle every weekend & the drivers are SO great! I always feel safe, they are all super nice, and fun to talk to! I would highly recommend this to anyone!!", "pics": null, "resp": {"time": 1582593368338, "text": "Thanks Caitlyn!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "104001951550329771048", "name": "Brianna (Brianna Parrale) Parrales", "time": 1567973518808, "rating": 5.0, "text": "My husband and I used Prestige Limo service to pick us up after our exit at our wedding. Mr. Fields and his driver, David, went above and beyond to give us an amazing experience. We both highly recommend using them!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "111757787476468764922", "name": "Laurel Brannon-Parham", "time": 1555167585256, "rating": 5.0, "text": "Prestige was extremely professional. Our driver Kim was the best! I highly recommend using Prestige. I’m sure all the drivers are wonderful, but I will ask for Kim again next time I use Prestige! Suburban was extremely clean!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "104881721007902771707", "name": "Angela Harris", "time": 1589335962956, "rating": 5.0, "text": "My wedding day were all that I needed with the special service from Barry Fields (Prestige Limo) one call does it all !", "pics": null, "resp": {"time": 1589339696663, "text": "Thanks Angela!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "117552202495737366508", "name": "Katie Buzzard", "time": 1575397154071, "rating": 5.0, "text": "I use Prestige Limo Service almost every weekend and have never had a negative experience! The drivers are great! Very professional and nice. Would Highly Recomend to anyone.", "pics": null, "resp": {"time": 1582593307869, "text": "Thanks Katie!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "117088754001019542076", "name": "Annie McNeil", "time": 1569257782631, "rating": 5.0, "text": "Prestige limo service is so awesome! They provide an efficient and safe way to get around Tuscaloosa and the drivers are always so incredibly sweet and truly care about your experience! Would highly recommend to anyone looking for a way around Tuscaloosa!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101123621315793558290", "name": "Tiffany Moen", "time": 1568754591733, "rating": 5.0, "text": "Prestige Limo Service is clean, professional, and safe! Would highly recommend Barry as he is friendly, kind, and to top it off, funny. Drives me around almost as every weekend and he is the best!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "116852542332159918629", "name": "asia ware", "time": 1547853149823, "rating": 5.0, "text": "I booked this service for my 23rd birthday night on the town.. It was  Incredible! Anthony was very professional in exceeded all of our expectations! I recommend this service for any special occasion to put a little extra icing on the  cake! It really helped to make my day even more special! Thank you Anthony and Prestige Limo Service of Tuscaloosa! We'll be seeing  you again soon!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "110840873560438639609", "name": "Danielle Duffy", "time": 1573591618712, "rating": 5.0, "text": "I use Prestigo Limo almost every weekend and every experience I have had has been amazing. Barry has driven me many times and he, as well as all the other drivers, are so sweet. I always feel comfortable and they never fail to make sure I get home safe!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "110599248395094438914", "name": "Natali Yanok", "time": 1618266205280, "rating": 5.0, "text": "The Prestige limo service has been great every time I have used it. They are so accommodating and even with many different girls calling to be picked up at one time they manage to arrive as fast as possible and keep you updated on when they will be there. I always talk to Barry and he is so kind over the phone and in the car. Last week I forgot my purse in the limo and as much of a hassle as it may have been for them they were more than happy to take me to go get it-- life savors!! I love this service and would recommend it to anyone who asks!", "pics": null, "resp": {"time": 1618317239208, "text": "Thanks Natali, glad we could help."}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "109320056890941333485", "name": "Julie Boyd", "time": 1524496851168, "rating": 5.0, "text": "We used Prestige Limo Services for my son's prom. They had a wonderful experience with Prestige Limo!! The owner, Barry, was so nice. The limo driver was fantastic! He was funny and the kids really liked him. I would definitely use them again!! 5 Stars from us!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101969719268867932378", "name": "tory elliott", "time": 1568851477573, "rating": 5.0, "text": "Barry and his team are the best! They are always on time and never cancel a ride. I always have great conversations and always feel comfortable!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "111403450001927716337", "name": "Lauren B", "time": 1569252277770, "rating": 5.0, "text": "I use prestige limos every weekend to get around Tuscaloosa and it never disappoints! The drivers are amazing and care about getting people around safely. Such a great service, and Barry is the best!!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101628911195648780116", "name": "Caroline Walters", "time": 1573612716099, "rating": 5.0, "text": "Best service I have ever used. The drivers are so friendly and helpful. Great experience and looking forward to my next ride!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "112842802726601803573", "name": "Anita Samuel", "time": 1531189796243, "rating": 5.0, "text": "We rented the white Hummer from Prestige Limousine Service for my sister’s wedding on June 23, 2018. The service was wonderful!!!! Anthony Thomas, our limousine driver was very courteous, professional, friendly and patient.  He ensured the Bridal party were like treated like VIP, especially the bride. We highly recommend Prestige Limousine Service to others.  Thank you Barry (owner), Anthony and the entire Prestige Staff!!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "117934126929359776349", "name": "Justine Groeber", "time": 1548351212415, "rating": 5.0, "text": "I LOVE using Prestige Limos to get around Tuscaloosa every weekend. Barry and all of the drivers are so accommodating and make my girl friends and I feel safe even when it is late at night. I would recommend to anyone looking for these kinds of services!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "116681387893879995383", "name": "anna marks", "time": 1569352505177, "rating": 5.0, "text": "Highly recommend! The drivers are amazing and always make you feel welcome! I use this service all the time and I have never been disappointed!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "113746261222956351671", "name": "Balinda Shaffer", "time": 1528328222294, "rating": 5.0, "text": "I would  like to thank you all for a wonderful  service today! My twins really enjoyed the ride!  and their cousins  enjoyed the ride too!!\nMR. ANTHONY was  really nice and patient  with the kids he made sure we was good! I wish I can rate you all more than 5 stars!!! Mr. Anthony and prestige  thank  you all again!! Thank you Barry!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "112987516291858903121", "name": "Dylan Surber", "time": 1572968300683, "rating": 5.0, "text": "I love this service! So helpful and always nice and very up to date. 10/10 recommend!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "110131443235600883704", "name": "Amanda Kim", "time": 1581358173228, "rating": 5.0, "text": "I love this service! Barry and all the other drivers are always so kind. I always feel safe using this service. Highly recommend!", "pics": null, "resp": {"time": 1581427422298, "text": "Thanks Amanda!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "111878107842617816132", "name": "Jessica Scheer", "time": 1568742859141, "rating": 5.0, "text": "Prestige Limo is my go-to for every date party or social event! The drivers are so friendly and helpful, along with safe and reliable! I can always depend on them regardless of where I need to go.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "112703447216899133106", "name": "Kate Buchweitz", "time": 1571237977355, "rating": 5.0, "text": "The drivers are so nice and professional! The limo and shuttle are always clean! They always make you the priority! Would highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101661793495156564368", "name": "Jessica Scheer", "time": 1548919117367, "rating": 5.0, "text": "Prestige limo service is always my go to! I feel so safe taking late night trips and they are always so punctual and reliable. 10/10 would recommend to anyone looking for a limo service, all the drivers are amazing.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "102210293454626999839", "name": "Terra warrington", "time": 1582757154801, "rating": 5.0, "text": "The best and safest way to get around Tuscaloosa! Hunter and Barry are the best and always make the ride super fun! Super great people and make the ride way more fun than any Uber ever could! Plus your riding in style!", "pics": null, "resp": {"time": 1582593234927, "text": "Thanks Terra!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "117200402494570705278", "name": "Patricia Calkins", "time": 1549228658950, "rating": 5.0, "text": "Prestige Limo Service is the best transportation service in Alabama! I have been using this service for 4 years and am always so pleased with my experiences. Prestige has the best costumer service! All of the drivers are great, especially Barry. I would recommend this service to anyone.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "109718171745003362359", "name": "Riley Teague", "time": 1548180640301, "rating": 5.0, "text": "We use Prestige Limos every weekend to get around Tuscaloosa, and they are the best! Very reliable, punctual, and professional. The drivers are so nice and always make sure you get to where you need to go! Barry is awesome", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "113317743699998600301", "name": "Payton Pascoe", "time": 1569358432026, "rating": 5.0, "text": "Prestige Limo Service is the most reliable, safe and fun limo service! I use them every weekend to get around Tuscaloosa! Barry and all the other drivers are so kind to each and every person that rides with them!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "104262710147884552518", "name": "Sophie Schiff", "time": 1569090389802, "rating": 5.0, "text": "I love using Prestige Limo! The drivers are so nice and are always willing to pick you up. It is very important to feel safe here at night and they are so good at doing that.I highly recommend!!! Makes sure you need to get where you are going safely!!! Love Barry!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "115046848835808675770", "name": "Brooke Kennedy", "time": 1549309771336, "rating": 5.0, "text": "Prestige is incredibly reliable and punctual which is why they are by far the best transportation company in the Tuscaloosa area! The drivers are so nice and make riders feel super comfortable. Highly recommend!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "111407427572622042797", "name": "Rachael Grammer", "time": 1540824279089, "rating": 5.0, "text": "Prestige Limousine was contracted by my bride's family to transport the newlyweds, wedding party and family for multiple trips. The vehicle chosen was the white H2 Hummer (14 passenger). This vehicle is SO nice and it was very clean. Our driver, Anthony, was kind and enthusiastic about his job. He made a great addition to our vendor team for the wedding day and was right where I needed him to be for every transport. Communication with management was also great and I thoroughly enjoyed working with them. I will definitely be recommending their services to future clients!", "pics": null, "resp": {"time": 1540831947502, "text": "Thanks Rachael!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "117482370277623742017", "name": "Kelsie Killian", "time": 1569454043586, "rating": 5.0, "text": "This company is amazing. Very attentive and fast. They have always done a great job any time I or my freinds have used there services. Wouldn’t go anywhere else.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "115967111639249459220", "name": "Nicole May", "time": 1569254060646, "rating": 5.0, "text": "It’s so important to feel safe and comfortable when being out so late and Prestige limo does just that. Prestige limo always does a fantastic job of communicating and are always so positive about their job! Thank you so much for everything y’all do!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "111647642848458381061", "name": "Savanna Bolin", "time": 1549240000232, "rating": 5.0, "text": "I love Prestige Limo Service! They are always my go-to when I need a ride to the airport or when I need a ride in general.  The drivers are all so sweet and always make me feel comfortable! They are the first ride service I recommend to people!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "109579905587637035763", "name": "Abby Goldberg", "time": 1616445622188, "rating": 5.0, "text": "10/10 I totally recommend! The drivers are always so nice & welcoming. A very safe & trustworthy company!!", "pics": null, "resp": {"time": 1616463584245, "text": "Thanks Abby!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "115185478637892729156", "name": "Lucille (Celie) Harris", "time": 1568909313351, "rating": 5.0, "text": "I use this limo almost every weekend to get around campus! The drivers are wonderful, and always willing to do whatever they can to improve our experience with them. The limo is always clean, and I know I can trust them to take me where I need to go! We love Barry!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "103941469216726997609", "name": "Annabelle Beavers", "time": 1582060735397, "rating": 5.0, "text": "The drivers are always so nice and caring! I would recommend prestige to anyone!", "pics": null, "resp": {"time": 1582065563158, "text": "Thanks Annabelle!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "102848216732155480542", "name": "Maddie O'Neal", "time": 1573613044244, "rating": 5.0, "text": "Prestige Limo Service is CERTAINLY prestige! Love this crew. Safe drivers, personable & overall GREAT! :)", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "110512547921375378259", "name": "Olivia Jett", "time": 1568828429598, "rating": 5.0, "text": "Prestige Limi service is the absolute best! Barry is kind and professional and makes sure you get places safely! He goes out of his way to make you feel comfortable and get you to your destination in an efficient and fun way! Everyone should use him!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "111095469093401068289", "name": "Caroline Doehring", "time": 1549244899966, "rating": 5.0, "text": "I absolutely love Prestige Limo! They have the best employees and they always make the rides fun and enjoyable. You can tell they really care about our safety. The company is very fast and efficient. I love being able to shuttle home on a cold January night", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "104389312312348267619", "name": "Julia Habass", "time": 1569457289191, "rating": 5.0, "text": "It’s so comforting knowing who my driver is. Barry’s the best and always makes sure I’m home safe!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101287747282347271817", "name": "Erin Sullivan", "time": 1568646780779, "rating": 5.0, "text": "Highly recommend using!! I use prestige limo service every weekend to avoid using Ubers and to be extra safe! Barry is so nice and cares about his customers!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101633225154580092990", "name": "Alison Levine", "time": 1575240430832, "rating": 5.0, "text": "I have used Prestige Limo Services many times and would highly recommend. The drivers are so friendly and always make sure that you get to your destination safely and on time!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "117765226459341266332", "name": "Nicole Mulford", "time": 1618164435382, "rating": 5.0, "text": "The best always so fun and nice. Always on time and very polite. I definitely recommend using this limo service. Anthony and Berry are the best people ever!!!", "pics": null, "resp": {"time": 1618189895736, "text": "Thanks Nicole!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "109435359759241316910", "name": "Lindsey Meyers", "time": 1580942819697, "rating": 5.0, "text": "Prestige Limo is the best and safest way to ride around town! The drivers are the kindest people.", "pics": null, "resp": {"time": 1581427483432, "text": "Thanks Lindsey!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "111697040059759901282", "name": "Kaci Johns", "time": 1549156547217, "rating": 5.0, "text": "I use Prestige Limousine Service almost every weekend to get around town safely. Barry is the best driver and a great guy! Extremely reliable and safe. Highly recommend this service.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101758566826757888901", "name": "Tonya J", "time": 1528160566127, "rating": 5.0, "text": "Easy, Reliable, Friendly Car Service Experience!\nWe used Prestige Limo to transport a client coming to town for an event at our corporation. From start to finish Prestige provided the best service! Placing the reservation was effortless, the driver was on time for both pick up and return trip and the rate was by far the best rate in town! Our client even commented on how nice his driver and transportation  was. I highly recommend Prestige and will be calling them first for any car service needs!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "103147834752963306232", "name": "Emily Weichel", "time": 1569453261531, "rating": 5.0, "text": "I use this limo service almost every weekend! The drivers are timely and so sweet. I would highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "104047629632168699615", "name": "Lucy Barnett", "time": 1549057203393, "rating": 5.0, "text": "Very reliable, safe, and friendly staff! Prestige is always me and my friends first choice to get a ride. the vehicles are always clean and the rides are always great. All the drivers are safe and make you comfortable during your trip.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "107651331940686173706", "name": "Delaney Keneipp", "time": 1548696935674, "rating": 5.0, "text": "Prestige Limo Service is the best! Very important to feel safe when going to and from places and I always feel safe when riding with this service. Drivers are all very nice and very reliable. Would highly recommend, 10/10 service!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "107946291163046310123", "name": "Jermaine Jefferson", "time": 1553624348082, "rating": 5.0, "text": "I was highly satisfied with the drivers both times that I used this service. The drivers are on time whenever you need them and the owner of the company is very friendly and willing to work with your needs. I most definitely loved my experience with prestige limousine service and will use them again in the future.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "106600319263774352808", "name": "Hannah Davis", "time": 1548880986429, "rating": 5.0, "text": "Prestige is our go-to transportation service we use when getting around on the weekend and for special events on the weekdays in Tuscaloosa! All of the drivers are excellent, but if you’re in Tuscaloosa, then I would definitely recommend you choose Berry for your driver. He has given us many pleasant, reliable, and comfortable rides!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101146511489538828124", "name": "Elizabeth Kantzler", "time": 1548703946809, "rating": 5.0, "text": "Prestige Limo is a great company. They are always punctual, kind, accommodating, and the cars are always in top condition! Barry is especially an awesome driver. I would highly recommend this service to everyone.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "109225136017661318439", "name": "Sarah Carpenter", "time": 1616515511305, "rating": 5.0, "text": "It is very, very important to me to feel safe and comfortable in the modes of transportation I choose, and Prestige absolutely exceeds my expectations in terms of punctuality, reliability, and hospitality. I have nothing but good things to say. Highly recommend to anyone in the area.  Thank you so much!", "pics": null, "resp": {"time": 1616540777526, "text": "Thanks Sarah!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "113418901785082367868", "name": "Erin O'Brien", "time": 1554014393825, "rating": 5.0, "text": "Prestige Limo is one of a kind. I rely on them to get around safely every weekend and I am never disappointed. Barry provides an amazing service and incredible conversation! I 10/10 recommend for anyone or any event to call Barry - he’s the absolute best!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "115743120603817790797", "name": "Tyresha Edwards", "time": 1546492304030, "rating": 5.0, "text": "This limo service was amazing!!!! I used this service for my wedding in Birmingham, Alabama and they were so wonderful from start to end! The driver opened doors for wedding party, accommodated our needs with drinks and allowing us to control air and music. Wonderful hospitality and arrived even earlier then asked. I would definitely recommend this service to anyone looking for services, hands down! Oh and I almost forgot, the limousine was absolutely beautiful! I felt like a queen!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "111746106343456411189", "name": "Merin Wood", "time": 1548486952800, "rating": 5.0, "text": "Very reliable and safe.  I prefer Prestige Limos over any other ride service.  Barry is always so nice and my friends and I always feel safe.  It's very clean and the best way to get around Tuscaloosa!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "106005612373018526583", "name": "Kristen Glowacki", "time": 1549251245432, "rating": 5.0, "text": "prestige limo is the best transportation service by far. they are so friendly and reliable! Barry is awesome and he comes as soon as you call him!!! 10/10 would recommend!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101239128302328736851", "name": "Kamryn Carpenter", "time": 1548879805306, "rating": 5.0, "text": "Great Service! Would recommend Prestige Limo Service to anyone in the area. Reliable, punctual, patient, and so personable! If i could give Barry and his drivers greater than 5 stars I would!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "113883465219761330062", "name": "Madison Wolff", "time": 1548473440609, "rating": 5.0, "text": "Barry is the best guy out there and all of his drivers are also just as amazing. Our sorority uses this service on the weekends and we love him. Would recommend to anyone.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101582335616471775785", "name": "Elizabeth (Ellie) Tew", "time": 1571077094260, "rating": 5.0, "text": "Prestige Limo Service is the best! The owner Barry, and ALL of the drivers, are extremely reliable and pleasant to ride with. Highly recommend!!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101071496653509211229", "name": "Caroline Thomas", "time": 1616441758113, "rating": 5.0, "text": "Working with the Barry has been just incredible. He and the drivers are always willing to accommodate, the limos are so much fun, and overall just a great experience. I love Prestige Limos!! I would highly recommend this company.", "pics": null, "resp": {"time": 1616443308777, "text": "Thanks Caroline!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "100359339215157139560", "name": "Russell Hodgins", "time": 1520116539199, "rating": 5.0, "text": "Prestige Limo is the best for any occasion needing a limo, and especially for a special occasion. The owner, Barry Fields, the drivers, and the equipment are all superb! When you need a limo, don’t call anyone else but Prestige Limo Service!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "112860178878738586983", "name": "Alli Cara", "time": 1548697182300, "rating": 5.0, "text": "I love using Prestige Limo Service! I always feel so safe when riding with this service. The drivers are all very nice, reliable, and punctual. I would definitely recommend, 10/10 service!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "115146462238834800334", "name": "Hope Schoelkopf", "time": 1617721652177, "rating": 5.0, "text": "I use prestige limo in Tuscaloosa often and they are always very useful and reliable. The driver is always friendly and able to accommodate passengers.", "pics": null, "resp": {"time": 1617740012364, "text": "Thanks Hope!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "116516124856735796132", "name": "Shaneka Stepp", "time": 1590680243674, "rating": 5.0, "text": "It was a safe way to travel and everything just was great", "pics": null, "resp": {"time": 1590683979877, "text": "Thanks Shaneka!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "107260358988534049389", "name": "Avery", "time": 1567779461226, "rating": 5.0, "text": "My girl friends and I love using Prestige to get around town! The drivers are very reliable, professional, and kind. 10/10!", "pics": null, "resp": {"time": 1567882953745, "text": "Thanks Avery!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "106047710110995540386", "name": "traci burns", "time": 1527394113088, "rating": 5.0, "text": "We used this limo service for my daughter's 16th birthday. They were awesome. The limo driver was excellent! The owner was also excellent. I could not have found a better service than them. I would 110% recommend them and definitely would use only them!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "109271465310938730865", "name": "Anna Grace Habicht", "time": 1569359677324, "rating": 5.0, "text": "The drivers are so nice & accommodating! Super easy to communicate with. I wouldnt recommend any another company.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "105675637954933046998", "name": "Gabriella Alves", "time": 1569450402079, "rating": 5.0, "text": "Prestige limo service is my favorite way to get around on the weekends. Barry is always so sweet and timely. He answers his phone right away and goes out of his way to be helpful!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101178380892691128897", "name": "Camille Studebaker", "time": 1548305322064, "rating": 5.0, "text": "Getting to use Prestige Limos is an absolute treat. Barry provides outstanding, professional service and takes great care of his customers. I will always recommend Prestige!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "100571044442943510132", "name": "Aubrey Forbus", "time": 1569427423277, "rating": 5.0, "text": "I highly recommend this company! I always feel so safe while being transported by any of the drivers. This company’s staff is friendly and reliable and always go out of their way to make their services convenient and safe.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "109329695061416287277", "name": "J Ghaddar", "time": 1531505634649, "rating": 5.0, "text": "Amazing experience, only transport service to Birmingham airport that is open 24/7. It was the only service I could find for a last minute ride without paying a fortune. It was 55$ less than the only other place that was open and I called around a lot. Great car with AC water bottle and full service, driver was so friendly and kind, no hassles of any kind. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "115427830498183204835", "name": "Callie Wilhite", "time": 1582654543171, "rating": 5.0, "text": "Best service in the area! I always feel safe every ride by Prestige Limos!", "pics": null, "resp": {"time": 1582679255152, "text": "Thanks Callie!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "109492754410867048369", "name": "Haley Shatto", "time": 1548486695077, "rating": 5.0, "text": "I would recommend Prestige Limos over literally anything! They're more accommodating than you could ever imagine and always make me feel as safe as I can.  I love how I can rely on them whenever I want to get home safe and sound. Thank you for being the best, Prestige!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "104267641823849446732", "name": "Emily Weichel", "time": 1548957678305, "rating": 5.0, "text": "The drivers are always very friendly and make every trip enjoyable. Not once have I felt unsafe while using them. A great company ran by great people! Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "103051099973889994061", "name": "Jenna Riedel", "time": 1549323684088, "rating": 5.0, "text": "I've loved every experience I have had with Prestige Limos. Barry and the drivers are incredibly kind and easy to work with. They are punctual and make me and my friends feel safe every time we step inside! Highly recommend to anyone in the Tuscaloosa area looking for group transportation.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "115598087377882188515", "name": "Ashley Hutcheson", "time": 1575329158833, "rating": 5.0, "text": "I use Prestige every weekend and they are the best! Highly recommended", "pics": null, "resp": {"time": 1592961712164, "text": "Thanks Ashley"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "112225046316926017493", "name": "Eleanor Watson", "time": 1548965466031, "rating": 5.0, "text": "Prestige is the best car service in the Tuscaloosa/Birmingham area! They have exceptional customer service and will take you where ever you need. I have used them for 4 years and have never had a disappointed ride!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "103933230273251346784", "name": "Olivia Hammond", "time": 1549041671384, "rating": 5.0, "text": "Prestige is a great way to get around! I always feel so safe on my rides! Barry is the BEST!! 10/10 recommend to anyone :)", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "114581238986031790391", "name": "Chris West", "time": 1523238179546, "rating": 5.0, "text": "We rented the black Hummer limo for my daughter’s prom and I was not disappointed with my decision to go with this company!  Very professional and answered all of my questions.  Thank you for making this a night that my daughter and her prom group will never forget!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "108597399391399960740", "name": "Virginia Lowry", "time": 1548884676542, "rating": 5.0, "text": "Prestige Limo has been the best way I have traveled in Tuscaloosa! They are very reliable, and the staff is so nice. I have never had a bad experience. So thankful to have their services available!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "115224222218685117376", "name": "Noelle Haas", "time": 1569459291694, "rating": 5.0, "text": "The limos are so nice. and they're always so fun! Big enough to have all my friends in there and Barry is so nice and very professional.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "102059503180805585363", "name": "Claire Newton", "time": 1519602858811, "rating": 5.0, "text": "we had a blast with prestige! I highly recommend them to anyone looking for a fun night out. very professional and courteous. will absolutely use them again for luxury transportation needs.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "109371094918365632346", "name": "Reagan Robinson", "time": 1548895724351, "rating": 5.0, "text": "I have used this service many times and every time I am impressed with the service and friendliness that I receive!! Barry is always punctual and is very good at responding to calls as well as texting letting you know where he is/when he will be there to pick you up. The vans are always clean and I feel very safe whenever I am under their care!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "113171741065262584118", "name": "Jayli Dismukes", "time": 1573504770472, "rating": 5.0, "text": "Prestige Limo service is a great transportation option. The driver's are so friendly and energetic. Every driver has been talkative and kind to everyone that has called them for a ride. I highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "104022854970999728201", "name": "Dwight hagler", "time": 1545316618126, "rating": 5.0, "text": "Great professional service provided by Prestige! Had them pick up my brother in law from the airport and he complimented their service as top notch... thanks prestige.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "117195090858971065386", "name": "Claire Klumpp", "time": 1573573379316, "rating": 5.0, "text": "Prestige Limousine Service is amazing. I love Barry!! Such a nice guy!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "105954457289155330130", "name": "Madeleine (Maddie) Manocchia", "time": 1581630636592, "rating": 5.0, "text": "I use Prestige Limo Service almost every weekend to get around Tuscaloosa. Barry is the best!", "pics": null, "resp": {"time": 1581693755542, "text": "Thanks Madeleine!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "108086702058209036683", "name": "Maggie Flynn", "time": 1554959246479, "rating": 5.0, "text": "Barry and his staff go above and beyond to make my friends and I feel safe. A great company that I would recommend to anyone needing a comfortable and affordable service.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "112417091370075963350", "name": "Daniel Bourgoin", "time": 1530065814368, "rating": 5.0, "text": "Barry’s service to my wife and son on their recent late arrival into Birmingham was exemplary, above and beyond the call of duty, absolutely phenomenal service.  Would use them again, and would encourage anyone needing limousine or Town Car service in the Tuscaloosa or Birmingham area to definitely give Prestige or call", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "102101815173506203326", "name": "Alexa P", "time": 1568038674256, "rating": 5.0, "text": "barry & his crew are always so nice and professional!! they always go above and beyond to make sure we are safe and taken care of!! definitely recommend!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "105413460991370985452", "name": "Erin Glowacki", "time": 1549250607213, "rating": 5.0, "text": "Prestige Limo Service is fantastic! Barry and all the employees are great drivers, and I would highly recommend this company. I always feel extremely safe and comfortable when using Prestige Limo Service!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "109827711359441154310", "name": "Ryan Butler", "time": 1507401914830, "rating": 5.0, "text": "I would highly recommend Prestige Limo Service to any parent visiting their child at the University of Alabama. Barry was on time, trustworthy, and just a plain good man. The cars were very clean and safe. It's hard hiring a service coming from California, but this company is the best!! Barry also took my niece who was visiting our daughter to the Airport. She said Barry was the greatest!!. I will definitely use Prestige every time we visit our daughter at the University.\n\nNancy & Mike Butler", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "103011240898647002346", "name": "Erynn Zak", "time": 1568037370276, "rating": 5.0, "text": "Highly recommend! The workers are very kind and I have never had a bad experience with them", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "111597539683291951475", "name": "Carly Noel", "time": 1548177828992, "rating": 5.0, "text": "Amazing limo service! Have used several times, and the limo is always very clean and the drivers are so kind and helpful. Would recommend to anyone!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "104985332342634029503", "name": "Avery Vosen", "time": 1568042414243, "rating": 5.0, "text": "fun and easy way to get around! Barry is the best!!! Super friendly and always tries to get to you as fast as he can!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "102641704178055720759", "name": "Catherine (Cat) Clinton", "time": 1581017802698, "rating": 5.0, "text": "Love riding with Hunter! Always a wonderful experience and we so appreciate the safety he provides!", "pics": null, "resp": {"time": 1581087638398, "text": "Thanks Catherine!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "103300587383401051898", "name": "AC Graham", "time": 1567129946346, "rating": 5.0, "text": "Barry & his team go above and beyond always to make sure we have the best service and are safe. The best, most genuine people thank you thank you thank you so much!!", "pics": null, "resp": {"time": 1567131315762, "text": "Thanks AC!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "111338116648666118681", "name": "Gretchen Lee", "time": 1548345635826, "rating": 5.0, "text": "Prestige Limo Service drives my friends and I to our destinations on the weekends. The driver, Barry is very reliable and punctual.  We love using the service!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "118073176717803013689", "name": "kjmlvt", "time": 1536954873166, "rating": 5.0, "text": "We had a great experience. The driver, Anthony, was top notch. The radio went out and he did his best to try and fix it. Although he wasn’t able to, the kids still had a great time. Mr Barry called to make sure the limo had arrived and called the next day to apologize about the sound system going out.  Very nice people. Would definitely recommend and use again.", "pics": null, "resp": {"time": 1536955849817, "text": "Thanks Mrs. Moore again for your patience with us. We hope this problem doesn’t happen again but if it do, hope to have the kids for backup 😂"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "117367225013934955912", "name": "Katie Krebs", "time": 1549239659063, "rating": 5.0, "text": "Prestige Limo Service is my favorite source of transportation in the Tuscaloosa area! The drivers are always so friendly and welcoming! I always feel safe riding with them and would highly recommend them to anyone in the area!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "106506639733109160531", "name": "Kristi Harris", "time": 1522118820175, "rating": 5.0, "text": "Great service from start to finish! We used Prestige Limo to take 14 kids to prom in Birmingham. We couldn't have felt more comfortable with Anthony driving them. Thank you so much! See y'all next time", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "110964765878024914578", "name": "Julia Mantel", "time": 1548303261760, "rating": 5.0, "text": "Barry is the best driver! I am always excited to use his service. The limo is always clean and he's always so excited to drive us. I wouldn't use any other company.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "104528142425620850100", "name": "Misty Brown", "time": 1521428126186, "rating": 5.0, "text": "The driver Mr. flowers was amazing. The teenagers loved him, said he was great. The fact he prayed over the trip and the group was wonderful.\nCustomer service was excellent.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "118335275095091331291", "name": "Amanda K", "time": 1548885025460, "rating": 5.0, "text": "Me and my friends use Prestige Limo to get around town. Barry and the crew make us feel so safe, even late at night and make sure to get everyone where they need to go. They are so kind and the limos are always so clean! Highly recommend this limo service if you are looking for some great service.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "108346171676379299393", "name": "Mildred (Emmie) Stutts", "time": 1548881171990, "rating": 5.0, "text": "I love using Prestige Limo service to get around Tuscaloosa on the weekend! They have the kindest drivers who are all so accommodating! I always look forward to riding with them.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101541507291092644315", "name": "Caitlyn Cordova", "time": 1548355794832, "rating": 5.0, "text": "I would highly recommend Prestige Limo Service to anyone in the Tuscaloosa area! They are punctual, accommodating, and reliable ❤️. Not to mention I always feel safe when using their services!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "107081656306695931601", "name": "taylor dunlap", "time": 1548730191115, "rating": 5.0, "text": "Prestige is the best and most reliable limo service. Barry is so nice and fun to work with. 10/10 would recommend to anyone.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "105133401808218416241", "name": "Lauren Beck", "time": 1548799363817, "rating": 5.0, "text": "I love Prestige limo service! The drivers are so kind and would do anything to give us the best experience possible. I use it every weekend and definitely recommend.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "104193627704934419005", "name": "Allison Wilkey", "time": 1548301238929, "rating": 5.0, "text": "Prestige is the absolute best! Barry and all of the drivers are reliable and friendly. Highly recommend 10/10", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "115210988942926417359", "name": "Dana Gilliam", "time": 1538682511373, "rating": 5.0, "text": "We used Prestige Limo Service for a special occasion for our daughter.  Service was GREAT! The driver was at our location 20 minutes prior to his planned arrival time and the trip was phenomenal!  We will definitely be using them for the upcoming prom season!", "pics": null, "resp": {"time": 1538685748534, "text": "Thanks Dana, glad your daughter enjoyed our service. Thanks again!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "105292904603623286585", "name": "DJ Maverick", "time": 1520215775197, "rating": 5.0, "text": "This day and age in Limousine  Service partnership is so important. Barry of Prestige Limousine Service from Tuscaloosa Alabama has been a great connection and friendship one could ever hope for in this type of Industry. Prestige Limousine is a very reliable & dependable service. They know how to network also they are always on time!!!!God do not make people like Barry of Prestige Limousine of Tuscaloosa Alabama anymore. Willie Hudgins of Diamond Limousine and I have been in Limousine Industry since 1989. God Bless", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "118101428697388857522", "name": "Stengel Haus", "time": 1552531720189, "rating": 5.0, "text": "Barry and everyone at Prestige Limo Service are above and beyond amazing.  Without fail Barry has come through for me every time, even with last minute requests to take my son to and from the airport.  I highly recommend them if you have a student that attends University of Alabama.  They are kind, safe, and always on-time.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "114510420698275326872", "name": "stephania taylor", "time": 1562025371019, "rating": 5.0, "text": "I really enjoyed the service. Make u feel like family. The best service in town. Yall rock", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "100118105803619889610", "name": "Kylee Popovich", "time": 1573517381604, "rating": 5.0, "text": "I always use prestige limo service to get around on the weekends! I can always rely on them to get around safely :)", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "100505342126536773487", "name": "Marina Naranjo", "time": 1549308910742, "rating": 5.0, "text": "Prestige Limo is always a good choice for my friends and I on the weekends! They are always so accomodating and have the best drivers to make your tip as comfortable as possible. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "113235659818086100546", "name": "Becky Hacke", "time": 1549181649754, "rating": 5.0, "text": "Great conversation with Barry! He’s so sweet, one of the nicest drivers I have ever met! He opened the door for us and everything!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "109712290525446182095", "name": "Natalie Argentina", "time": 1581527759800, "rating": 5.0, "text": "I use Prestige Limo Service every weekend. Love Barry and Hunter!", "pics": null, "resp": {"time": 1581531437227, "text": "Thanks Natalie!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "117189376461432937222", "name": "jennifer deerman", "time": 1538930252150, "rating": 5.0, "text": "Great customer service. Great personality and was great with kids also. The Hummer was absolutely gorgeous and clean and was stocked with drinks for the kids   Best one we have used and we have used a lot. Will definitely be calling Barry back next time !! Best all around !!", "pics": null, "resp": {"time": 1538936175406, "text": "Thanks Jennifer, the kids was very good!!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "110597151185570707479", "name": "lauren keehr", "time": 1618169825725, "rating": 5.0, "text": "always easy to reach and very fast!! highly recommend :)", "pics": null, "resp": {"time": 1582679278276, "text": "Thanks Lauren!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "114525735248347828851", "name": "Lee Sayago", "time": 1561037475828, "rating": 5.0, "text": "With our plans changed at the last min, Prestige came to our rescue. Special thanks to Barry and Fred! Fantastic service!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "113218825094963624143", "name": "Sara Fest", "time": 1575342328671, "rating": 5.0, "text": "barry is the best driver! very good at communicating how much longer he will be! very reliable driver as well!", "pics": null, "resp": {"time": 1592961685638, "text": "Thanks Sara"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "107384677613775579044", "name": "Tiffany Moen", "time": 1573667895714, "rating": 5.0, "text": "Prestige limo service takes me around town almost every weekend and is always safe! Barry is the best!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "111848156504241570969", "name": "Maggie Samantha", "time": 1575388081398, "rating": 5.0, "text": "Great service always feel safe with Barry & Chris! Thank you Prestige Limo.", "pics": null, "resp": {"time": 1582593408981, "text": "Thanks Maggie!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "117522495408397859819", "name": "Lucia Turro", "time": 1569365798060, "rating": 5.0, "text": "I always have such an amazing experience using Prestige and highly recommend it to anyone that is in need of their services!! Barry is awesome and is always so kind when I see him.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "108632681176724509747", "name": "Melanie Marshall", "time": 1529443096608, "rating": 5.0, "text": "I used this limo service all last semester and they were wonderful. Mr. Barry and every driver are very kind and respectful and genuinely want to make your experience the best it can be. I definitely would recommend using their company. They are a great company to use and are a great group of people.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101456786175394264930", "name": "Juliana Vivenzio", "time": 1617306958458, "rating": 5.0, "text": "Highly recommend!! I have used prestige limo service to and from birmingham airport back to school. Always on time and very safe :)", "pics": null, "resp": {"time": 1605451610906, "text": "Thanks Juliana!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "112434561510249372223", "name": "Isabella Ramundo", "time": 1568847045578, "rating": 5.0, "text": "Always on time and nice. Contacted us multiple times to make sure he had the right location and time. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "118037589734212332561", "name": "Savannah Kirksey", "time": 1549217755977, "rating": 5.0, "text": "We use Prestige Limo Services every weekend to get around the Tuscaloosa area, and they are absolutely awesome.  Very professional, prompt, and always polite.  Barry is amazing!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "115545424466920512088", "name": "Kate Wimberley", "time": 1548206645080, "rating": 5.0, "text": "Five star experience! Prestige limo services is great. Very clean and reliable. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "116933990962792607249", "name": "Nicole Thrun", "time": 1578971759934, "rating": 5.0, "text": "Barry, Hunter and Chris have always made me feel safe and so reliable.", "pics": null, "resp": {"time": 1579088552902, "text": "Thanks Nicole!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "102219004972439313222", "name": "Rebecca Bell", "time": 1527346369742, "rating": 5.0, "text": "Great service, punctual courteous driver,\nflexible on rates depending on desired service. I highly recommend calling them if you do not see your exact package.\nRebecca Bell, Mother of the Bride", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "107432090264319963381", "name": "Randy Swartz", "time": 1542638193611, "rating": 5.0, "text": "Great experience.  Barry responds with in minutes.\nOur driver Doug could have not been more professional.\nJust great people to deal worth.\n\nRandy  S.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "116179789623760195706", "name": "Jordan Green", "time": 1549324796966, "rating": 5.0, "text": "The best limo service!!! Barry is an amazing and very nice driver who really cares about his clients. I would recommend to anyone!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "103522395074229175186", "name": "Ashley Barnes", "time": 1581630359261, "rating": 5.0, "text": "I use Prestige Limo almost every weekend when I go out to get around Tuscaloosa safely!", "pics": null, "resp": {"time": 1581693781528, "text": "Thanks Ashley!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "113808080493648849385", "name": "Jordan DeSantis", "time": 1548345636735, "rating": 5.0, "text": "This limo company is amazing! Barry is reliable, kind, and so generous! Thank you prestige limos for your amazing service.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "114421061062745291241", "name": "Julia Habas", "time": 1618252539806, "rating": 5.0, "text": "I use Prestige Limos every weekend to get around Tuscaloosa safely. Barry is the absolute best. He's always on time and make sure you get to where you need to go! I highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "115787988134824113156", "name": "Maribeth Miller", "time": 1507340178443, "rating": 5.0, "text": "Prestige was professional and timely.  I would recommend this company highly.  Berry was helpful and professional.  On time, professional, helpful and dependable!\nThank you!\nMaribeth Miller", "pics": null, "resp": {"time": 1507341020411, "text": "Thanks Maribeth!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "117160011724260009225", "name": "Jordan Eady", "time": 1548909381537, "rating": 5.0, "text": "Prestige Limo is the best service to use in Tuscaloosa! They genuinely care about the safety of their passengers. So safe and nice!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "116255736303841577711", "name": "Eloise James", "time": 1513629226723, "rating": 5.0, "text": "Awesome service!  James and Arlene Williams thank you for your excellent service and professionalism!  They recommend Prestige Limo services if you have a need!  They take care of their customers!  You get the red carpet treatment!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "113413122496021979657", "name": "Madison Murray", "time": 1568661658884, "rating": 5.0, "text": "This is a great service that I use often to get around Tuscaloosa. They are very timely and are perfect if you are looking for a safe and reliable option.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "107289070305193587280", "name": "Angie Cunningham", "time": 1545521276930, "rating": 5.0, "text": "Wonderful experience. Kim was our driver and she was exceptional. Our flight was delayed and the customer service was phenomenal.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "104481933020346125892", "name": "Sherry Carter", "time": 1520223388985, "rating": 5.0, "text": "Great hospitality!!! Loved their service! Very nice limousine with timely service! Accommodated our needs with an excellent overall experience! Would highly recommend them and looking forward to using them again!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "108605906869633933710", "name": "amelia ault", "time": 1548710314768, "rating": 5.0, "text": "Everything about this service is amazing! such nice people. I recommend them to all of my friends!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "102635804939452956231", "name": "Caroline Knight", "time": 1548290718578, "rating": 5.0, "text": "Prestige Limo Service is wonderful. Very easy to communicate with and very nice rides. The driver is extremely nice and helpful.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "116370771107043780206", "name": "A Javine", "time": 1529289325418, "rating": 5.0, "text": "We had a great time riding with this company. The driver was very nice and everything was very professional. I would highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "111104943821090969115", "name": "Anne McNeil", "time": 1548304940410, "rating": 5.0, "text": "Just an incredible service! We use this every weekend to get around Tuscaloosa and they are very realiable! Barry is also the absolute best driver!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "109071034076073458364", "name": "Brooke Kennedy", "time": 1573620332068, "rating": 5.0, "text": "Barry is always there to pick me and my friends up during the week and weekends. I couldn’t think of a more reliable and safe company to work with!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "106792272143883884548", "name": "Kate Fitzpatrick", "time": 1549252650128, "rating": 5.0, "text": "Have always had a wonderful experience with Barry and the Prestige Limo Service!! They always let us play our own music and have a great time on the way to any event!!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "116419622489107395681", "name": "Courtney Cooper", "time": 1548891268495, "rating": 5.0, "text": "I would definitely recommend Prestige Limo's to anyone looking to get around Tuscaloosa! The drivers are fantastic and go above and beyond to make me and all of my friends feel so safe! They are always punctual, considerate and reliable! 10/10!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "113199345152185755049", "name": "Lindsey Meyers", "time": 1568646919698, "rating": 5.0, "text": "Prestige limo service is amazing! They always come within a timely manner! Barry is the best and we always have a great time while riding!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "116897303041731263795", "name": "Cynthia Burleson", "time": 1521341891430, "rating": 5.0, "text": "Prestige was wonderful, we rented the hummer limo and had the added bonus of Mr. David.  He took excellent care of our children!  The next time we need these services we'll call Prestige!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "109585729715549917722", "name": "Tungie Bester Moore", "time": 1538659240742, "rating": 5.0, "text": "I want to thank you guys for your services on yesterday it was greatly appreciated. The limo driver was awesome. He was very sweet, intelligent and well dressed. My daughter couldn’t have had a better 13th birthday. I look forward to using Prestige Limo Service in the future🤗", "pics": null, "resp": {"time": 1538660656665, "text": "Thanks for calling Prestige Limo for your daughter 13th Birthday 🎂. We are happy that you call our service and thanks again!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "116227042565810954237", "name": "Hayden Killingsworth (hayk01)", "time": 1524350418906, "rating": 5.0, "text": "Anthony our limo driver was AMAZING!! He was nice, friendly, & had a good sense of humor. Dealings over the phone went great and they were happy to answer any questions about billing and the limo that I had. Fully intended on using them in the future!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "111505791156742567009", "name": "Chris Badura", "time": 1513436531090, "rating": 5.0, "text": "What a great company! Outstanding and caring service by the owner, Barry and his staff. He went way above and beyond to accommodate our students who were looking to get to the Atlanta airport after finals and chauffeured them in one of his beautiful limo busses! He was responsive, conscientious and very generous. Cannot say enough positive things about this company. Will look forward to using them for the next 4 years! Thank you Barry!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "112417509711928723886", "name": "Sarah Hammers", "time": 1548351078099, "rating": 5.0, "text": "Barry is the best!! So professional, checked in on us, made sure he opened and closed all the doors for all the passengers, and was a safe driver! The limo was also very clean!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "103567401504461408902", "name": "Valerie Smith", "time": 1523837580887, "rating": 5.0, "text": "We used Prestige Limo Services last year and this year for our son's prom. Both times, when we called to reserve the car(Cadillac XTL), the person taking the call was EXTREMELY helpful. When it came time for prom this year, my son only had one request and that was to have the same driver(Mr. Rod) from the previous year. I would DEFINITELY recommend this limo service to anyone.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "102434093950072794899", "name": "Alysia Spedale", "time": 1568777328987, "rating": 5.0, "text": "Amazing! Barry is so fun and nice. Prestige is the best. Highly recommend!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "112789510279778106734", "name": "Katherine (Kate) Fallon", "time": 1548795966426, "rating": 5.0, "text": "Excellent drivers. Safe and comfortable! Would recommend to anyone needing a ride around Tuscaloosa or to the airport!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "115212003650002597265", "name": "Joann Wallace", "time": 1520815697902, "rating": 5.0, "text": "I would highly recommend Prestige Limo of Tuscaloosa, we used their services for the prom for a group of kids.  They were punctual,  professional and excellent customer service.  The kids had a blast!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101487611714850888815", "name": "Bailey Davis", "time": 1549155006967, "rating": 5.0, "text": "The best limo service in Tuscaloosa! Barry is the best. Thank you for always being reliable, and fun!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "103004769212606010392", "name": "Reily Kotwasinski", "time": 1575317365728, "rating": 5.0, "text": "Prestige Limo's is the best! I use it every weekend to get around Tuscaloosa! It is always safe and very reliable. Barry is the BEST!", "pics": null, "resp": {"time": 1592961756788, "text": "Thanks Reily"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "117767379505284636990", "name": "Jess Lundy", "time": 1513970322298, "rating": 5.0, "text": "Barry is absolutely amazing. If you want a ride with excellent service, it has to be Prestige Limo. They make you feel like family. I had the opportunity to have a light tour of Tuscaloosa and it was beautiful in the limo. I will ALWAYS recommend prestige limo to everyone I know.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "105511033706834711748", "name": "Juliette Hirsch", "time": 1549299738290, "rating": 5.0, "text": "Every time I have used the shuttle I have had an amazing experience! Would highly recommend to everyone.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101182263691669597770", "name": "carolyn hutchinson", "time": 1521478124818, "rating": 5.0, "text": "I highly recommend Prestige Limo Services.The owner Barry Fields,the drivers was very patient and professional with our family.They let us know that there was cold soda pops and water in the cooler for us.Prestige Limo Service not only showed patient and professionalism.Mr.Barry Fields and his driver also showed my family and I that they cared about our family at our time of bereavement.I will forever use Prestige Limo Service for all my business.Thanks Prestige Limo Service Job Well Done!!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "114995559315895050118", "name": "Chad H", "time": 1516637638867, "rating": 5.0, "text": "You won’t find a more professional limo service than this one! I rented the H2 limo for my wife’s birthday. The driver was 30 min early and very professional and limo was in immaculate condition!  We had a great time and will definitely be using them again!!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "111798204033692083949", "name": "Helen (Oliver) Little", "time": 1548306417344, "rating": 5.0, "text": "Prestige Limo Service is amazing! They keep their cars very clean, are super accountable , and respond quickly. I would highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "118161495934171633840", "name": "Tennisha Fields", "time": 1521484190235, "rating": 5.0, "text": "I would highly recommend Prestige Limo Services to any & everyone. If you’re looking for on time, Respectful, Professional, and Friendly services I would most definitely tell you to call Mr. Barry Fields.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "114641863493078364868", "name": "Annie Moore", "time": 1569459046290, "rating": 5.0, "text": "Berry's van is always clean and is prepared for his riders. He takes such good care of everyone in the car. Always cares about his riders!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "113544257508887224233", "name": "Lashonda Calloway", "time": 1531947709965, "rating": 5.0, "text": "My husband and I used prestige Limo Service for our Wedding !!! They provided awesome service. They were very prompt and professional. We enjoyed every minute of our ride.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "104754389649925882073", "name": "Heather Whitley", "time": 1553625054338, "rating": 5.0, "text": "Our boys rented the hummer limo for prom. The service was excellent. We will definitely rent from Prestige again.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "113641037830772114849", "name": "Lily Calkins", "time": 1573672640409, "rating": 5.0, "text": "Prestige Limo Service is so great and gets us everywhere safely! Barry is the best!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "112003030457224377951", "name": "Megan Blank", "time": 1555638980991, "rating": 5.0, "text": "Barry is the BEST!! Super sweet and so caring! He makes the best atmosphere and makes sure we are safe always!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "104747658931535321409", "name": "Amelia Andrews", "time": 1548866532269, "rating": 5.0, "text": "Pick up where you want and when you want!\nThe drivers are so nice and call you when they’ve arrived! Great service", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "103273877638276337467", "name": "Madison Dyar", "time": 1548301107911, "rating": 5.0, "text": "By far the best limo service ever!! So sweet and easy to work with! We love prestige limo service!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "103766680550882175184", "name": "Emma (Emma Gaines) Reaves", "time": 1618177216569, "rating": 5.0, "text": "Barry and all of his drivers are always so kind and make the ride so enjoyable. I love having a safe ride home!", "pics": null, "resp": {"time": 1618190010018, "text": "Thanks Emma!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "103808781968094685990", "name": "Sarah E.", "time": 1618173335371, "rating": 5.0, "text": "Amazing service! I always feel confident that me and my friends will get to where we are going safe with them", "pics": null, "resp": {"time": 1618189960149, "text": "Thanks Sarah!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "106585272637730355242", "name": "ashlynn neal", "time": 1572216813977, "rating": 5.0, "text": "prestige limo service is the absolute best!! so thankful for barry always getting me where i need to go safely!!", "pics": null, "resp": {"time": 1572220562441, "text": "Thanks Ashlynn!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "109925080307540106081", "name": "Bailey Clemons", "time": 1548293567577, "rating": 5.0, "text": "Barry is the best! We use him for Tri Delta and he is always just a call away! He is very friendly and always goes the extra mile to make sure that all of our members get home safely from our events. Would highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "115627385671347620719", "name": "Mary Gdowik", "time": 1568846647936, "rating": 5.0, "text": "Barry is awesome and always gets me to my destination safe and sound!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "114007105019396515341", "name": "Tracey Pasteur", "time": 1528168450811, "rating": 5.0, "text": "I Love the services that Prestige limo services have. The services were used for my wedding. AWESOME!!!!  I LOVE THE HUMMER", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "117311203266889937897", "name": "Gina Schook", "time": 1531497706039, "rating": 5.0, "text": "Great experience! Barry is personable and makes you feel at comfort from the beginning to the end of the trip! I would recommend this service to my friends & family!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "113477081726987760848", "name": "diane shoger", "time": 1507389464361, "rating": 5.0, "text": "Simply the best!  I sent online rate requests to several limousine services;  they all answered, but Prestige Limo was the only one that called me back personally! It is that level of  personal service and attention to detail that sets Prestige Limo apart from the rest. Our ride to and from the Birmingham airport to Tuscaloosa was on time, in impeccably clean cars, and with professional drivers. We were especially pleased to meet the owner, Barry, on our return trip.  Prestige Limo is the type of  high quality small business that is the backbone of America – be sure to support them on your next trip to Alabama! Roll Tide!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "115766310214115593473", "name": "Jeanette Woods", "time": 1561997019626, "rating": 5.0, "text": "I use Prestige Limo Service from Tuscaloosa, AL for the first time me and all my co worker enjoyed everything the driver is an amazing person he took his time with us and was very patient with all of us.We are most definitely will be booking them again loved it!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "116621389455745636322", "name": "Patti Rhodes", "time": 1529681739512, "rating": 5.0, "text": "Great service for my son’s wedding. Very professional and timely. The driver was wonderful from Akron, AL to Tuscaloosa. Thanks!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "114988452750665871075", "name": "Nadia Khan", "time": 1548731254519, "rating": 5.0, "text": "My friends and I use Prestige to get around Tuscaloosa on the weekends!  Great service, very professional, and they make us feel very safe!! 10/10!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "114114225672323934870", "name": "Ayesia Lyles", "time": 1512929543895, "rating": 5.0, "text": "Mr Fields helped me plan the PERFECT birthday surprise. He was involved in choosing the best vehicle and even suggested locations for our evening out. Mr Fred, our driver, had the most pleasant spirit and made every effort to accommodate us. We will definitely be using Prestige Limo and Mr Fields again.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "113461578336053092099", "name": "Maryssa Ruster", "time": 1569445584844, "rating": 5.0, "text": "Amazing limo service within Tuscaloosa. 10/10 recommended.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "100413487855637742530", "name": "John Pircher", "time": 1543537564010, "rating": 5.0, "text": "Great service, very punctual and reliable. Great service for business and students needing a ride to and from Tuscaloosa.  I use them all the time!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "105999366236897619742", "name": "Haley Reynolds", "time": 1569432081878, "rating": 5.0, "text": "Barry is very friendly and I felt very safe riding around at night!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "108799818125775993909", "name": "Kerrigan Rogers", "time": 1617736708023, "rating": 5.0, "text": "Always super professional and pleasant when driving my friends and I around Tuscaloosa. Would highly recommend!", "pics": null, "resp": {"time": 1617740084171, "text": "Thanks Kerrigan!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "112702316469368672795", "name": "Georgia Edwards", "time": 1573503891289, "rating": 5.0, "text": "very reliable and safe! highly recommend", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "117456947386914509745", "name": "Avery Lee", "time": 1582592533953, "rating": 5.0, "text": "Prestige limo Is the best ever !! Drivers Chris and Barry are so awesome!! Highly recommend!!", "pics": null, "resp": {"time": 1582593089153, "text": "Thanks Avery!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "115012225088018267668", "name": "Jenny Edmondson", "time": 1529068970282, "rating": 5.0, "text": "We had a business trip in Jackson and hired Prestige Limo Service to drive us there. We rented the Sprinter. It was a great experience and the driver (Anthony) was very professional and nice. We will use this service again in the future.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "103240814809374202460", "name": "Shannon Healy", "time": 1569343155586, "rating": 5.0, "text": "Prestige is the absolute best! Barry is always so friendly and professional, I would highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "105299309969328622148", "name": "valerie moore", "time": 1529235236435, "rating": 5.0, "text": "We were offered the most excellent service! From the time of reservation until they dropped us off! The driver Anthony was very professional and Mr, Barry made sure everything was set and ready for us when he got there! I would recommend Prestige Limo Services to everyone! Thank you for making my husband surprise Father’s Day dinner trip to Texas de Brazil the best surprise ever!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "115771962102485749701", "name": "Joy Reynolds", "time": 1541382286616, "rating": 5.0, "text": "We used Prestige to celebrate our mother's birthday. Our driver, Anthony was wonderful! I highly recommend Prestige Limo Service!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "116737351842571594193", "name": "Sarah Hammers", "time": 1568646359967, "rating": 5.0, "text": "Amazing company! Thoughtful and kind drivers- especially BARRY!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "117051241662784098834", "name": "Carletta Sanders", "time": 1596550355642, "rating": 5.0, "text": "Would definitely recommend!", "pics": null, "resp": {"time": 1596554483022, "text": "Thanks Carlotta!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "106050162821775863073", "name": "Abbey Searing", "time": 1548798262521, "rating": 5.0, "text": "Prestige Limo Service is the best and safest way to get around Tuscaloosa! Thank you so much for your 5+ star service!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "109512245207894775540", "name": "Julia Spalding", "time": 1568040403819, "rating": 5.0, "text": "The limo was on time and was a great and cool way to get around!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "113867075474713024314", "name": "Alissa Salamone", "time": 1561231504253, "rating": 5.0, "text": "Excellent, on-time service. Nice people. Very accommodating.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "103057370472364428974", "name": "Kelsey Jones", "time": 1568655598131, "rating": 5.0, "text": "prestige limo service is the best!! barry is so awesome and i always feel so safe when i use it!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "117510991210030667469", "name": "Cecile Nicolson", "time": 1548290610208, "rating": 5.0, "text": "Barry and all of his drivers are the best! They are all wonderful and extremely professional.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "118279377271056643405", "name": "Lucie Flowers", "time": 1569459129313, "rating": 5.0, "text": "Barry is the coolest and cares so much about his clients", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "105082601745859556125", "name": "Jean Gray", "time": 1532714840722, "rating": 5.0, "text": "My daughter bought concert tickets for my birthday this year.  We decided to add a limo to make our adventure extra fun and convenient.  I called Barry at Prestige and chose the stretch Hummer.  It was clean and very comfortable.  Our awesome chauffeur, Anthony, pulled right up to the entrance of the venue and was waiting on us when it was over.  So convenient!  I just purchased tickets to another concert and I am already trying to pick out a limo for this event.  Hopefully, Anthony will be available again.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "108238540591141686497", "name": "Mary Abbott Crain", "time": 1569267175390, "rating": 5.0, "text": "It’s so awesome the drivers are always so nice!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "109112547412908175673", "name": "Caroline Kent", "time": 1568040503906, "rating": 5.0, "text": "Great company! The drivers are all professional and friendly!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "113676619169858278163", "name": "Lucy Morgan", "time": 1568647303599, "rating": 5.0, "text": "Amazing company, they are always very professional and so nice!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "108232554038940527814", "name": "Abby Goldberg", "time": 1580954449393, "rating": 5.0, "text": "I can't say enough good things about every drive for Prestige Limo Service! I always have an enjoyable, nice time. They are always reliable.", "pics": null, "resp": {"time": 1581427459571, "text": "Thanks Abby!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "107779927234694452323", "name": "Allie Desantis", "time": 1568037539983, "rating": 5.0, "text": "This service is so convenient and Barry is the best!! 10/10 recommend!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "117198417687834574726", "name": "Rodney Walker", "time": 1521131496718, "rating": 5.0, "text": "I have used Prestige  limousine service  at my business. Agnew Funeral  Home and Cahaba  Memorial Funeral  Chapel  for transportation services. They offer excellence  service at your need.  I recommend  them to anyone.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "108836044152637565455", "name": "Hannah Paccione", "time": 1548357497383, "rating": 5.0, "text": "We use Prestige Limo Service every weekend and it is the most accommodating service around Tuscaloosa. Barry is great and all the drivers gets us safely where we need to go.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "104892964266927654814", "name": "Amanda Huskey", "time": 1522320172286, "rating": 5.0, "text": "The owner - Mr. Barry Fields, dispatcher - Mrs. Kelli Hagler, and drivers are all compassionate with meeting the needs of their customers. The drivers are always so welcoming and friendly, especially Mr. David Flowers! We always feel “at home” with them. This company is phenomenal and highly recommended!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "105695165223405620568", "name": "Juistine DelMastro", "time": 1573531074299, "rating": 5.0, "text": "Prestige Limo provides excellent service from very friendly drivers!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "108269114027428478427", "name": "Laura Lee Malesh", "time": 1532452859416, "rating": 5.0, "text": "We used Prestige Limo many times last year for airport transportation for our son and will continue to use them this year. They give me one less thing to worry about when trying to get our son back and forth to campus.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "109575077186105117085", "name": "Alison Epstein", "time": 1568037359430, "rating": 5.0, "text": "Amazing service, would highly recommend to anyone asking!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "117926075860929686831", "name": "Natalie Argentina", "time": 1569252239484, "rating": 5.0, "text": "Love this service! Barry is the best.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "110663428873393059681", "name": "Natalie Echeverri", "time": 1548697055943, "rating": 5.0, "text": "I love Prestige Limo Service!!!! Barry drives everyone around! I feel so safe riding in the limo! Best service!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "106745133047023911382", "name": "Janet Swain", "time": 1523236623516, "rating": 5.0, "text": "My son senior prom exerience was great. Thanks to Prestige Limo. The driver was early and very kind. I am totally recommend their services to all my friends and other.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "102235634945739866083", "name": "Sally Hoffman", "time": 1549255617298, "rating": 5.0, "text": "Great experience over all! I highly recommend Prestige Limo service to all & appreciate they way they treat their customers.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "100354888098404760717", "name": "G Brown", "time": 1533530061760, "rating": 5.0, "text": "Prestige Limo truly provides a world class service.  i have not needed a limo or car service in the Tuscaloosa area sadly for a while, since my Mama's death, but I am now booking several trips for a happy occasion - my nieces wedding!\nAfter contacting Prestige Limo of Tuscaloosa for wedding car service arrangements I remembered I wanted to review and recommend Prestige based on my prior experiences with them.\nMy first experience with Prestige was when I needed a car service late night and last minute trying to get to Hale County from Birmingham Airport as my Mama was dying. I texted Prestige from my emergency flight from Mexico and Barry, the owner, was beyond compassionate and professional, and had a great driver waiting on me.\nThe car was immaculate but more importantly, was there early, and both the owner and driver so sensitive to my situation. The driver told me when we were nearing my Mother's house to just get out and run in and he would bring everything inside, which he did.  I literally do not know if I would have gotten all the way down to my Mother's house that night without Prestige.\nI had the same professional experience booking today for my niece's pre wedding events and look forward to using Prestige for the wedding as well. I have traveled all over the world, had my own driver for years in NYC, but have never had a better car service experience.  Thank you Prestige.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "114435066443941307048", "name": "Bo Mattingly", "time": 1534084924196, "rating": 5.0, "text": "These guys are top notch and do it right.  Got first class treatment from BHM airport to Tuscaloosa.  Much appreciated!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "111485308093002999477", "name": "Patrick Pritchard", "time": 1553626895711, "rating": 5.0, "text": "Hired Prestige for car service to the beach. Clean comfortable sedan with very excellent driver Fred. Will book again.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "106033206524702790087", "name": "Pam McNeil", "time": 1528335458824, "rating": 5.0, "text": "Thanks for the last minute scheduling for my daughters birthday party! The service was superior and I’ll definitely use them again. I even got a call from the owner afterwards to check on services! 👍🏼", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "102881704674690847518", "name": "Emily Kent", "time": 1548358722571, "rating": 5.0, "text": "I would recommend Prestige Limo Service to anyone needing these services! Barry is so friendly and makes taking the limo such a great experience in itself.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "113342649566384909314", "name": "Natalie Carson", "time": 1553625106880, "rating": 5.0, "text": "We used Prestige Limo for our son’s senior prom. They had the best time and the service was excellent.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "112275306935710847550", "name": "Savana Lightsey", "time": 1525355218041, "rating": 5.0, "text": "We used Prestige Limo for our corporate Grand Opening and LOVED them! They were so great about keeping us up-to-date on all of our guests' transportation and helping us get everyone to their destinations. We will definitely be using Prestige for our company's needs in the future. On behalf of SMP Automotive, thank you!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "106212641719815292241", "name": "Alexandra (Ally) Williams", "time": 1548192998619, "rating": 5.0, "text": "Mr. Barry was our driver on Saturday night, and he was so great! He called me when he arrived, got me right to my destination, and was so much fun to ride with!!!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "117462747217436849766", "name": "Kate Karson", "time": 1569267415101, "rating": 5.0, "text": "I’ve used Prestige Limo services multiple times, and it’s always a great experience! They’re always right on time and the drivers are very friendly!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "103496695558205161556", "name": "Avery A", "time": 1548370694277, "rating": 5.0, "text": "We use prestige every weekend to get around Tuscaloosa! Great group of people!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "105165549438196740320", "name": "Georgia E", "time": 1569342196626, "rating": 5.0, "text": "Prestige limo service has always been a very safe and reliable option for me! I would recommend them to anyone!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "114498856823941373103", "name": "Margaret (Maggie) Smith", "time": 1549322197796, "rating": 5.0, "text": "Best limo company! They are so nice and reliable.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101612581969242563650", "name": "Emily Darden", "time": 1567985883061, "rating": 5.0, "text": "Great people, great service, great experience! Highly recommend!!", "pics": null, "resp": {"time": 1567989113942, "text": "Thanks Emily!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "116798679858178814055", "name": "McKenzie Huckaby", "time": 1548811412278, "rating": 5.0, "text": "Prestige Limos has been a great service to my friends and I. The drivers are extremely nice and welcoming, and create a fun, safe environment for their riders. I would highly recommend them!", "pics": null, "resp": {"time": 1548812171849, "text": "Hello McKenzie, I didn’t forget your name 😂\nThanks for that wonderful review!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "115414896246122954428", "name": "Shakecol81", "time": 1499804169038, "rating": 5.0, "text": "I hired Prestige Limousine for my July 2017 wedding in Tuscaloosa, AL. Working with Barry and Mr. David was a complete pleasure. They were timely, responsive, efficient and transported us to and from our venues in a nice, clean, modern truck. The communication was well. Booking the limousine was easy as a few simple clicks online. Barry even suggested great ways to give me more for my money. The cost is minimal and affordable. Credit cards are accepted online.\n\nI would highly recommend this company for all of your limousine rental needs.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "106076699563513137085", "name": "Jennifer (Jenny) Peebles", "time": 1549320686869, "rating": 5.0, "text": "The drivers always go out of their way to accommodate your needs and are the nicest people! Definitely recommend for any event!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "113319963109242049976", "name": "Carsen Swallen", "time": 1618241590226, "rating": 5.0, "text": "The best car service there is! The drivers are always very nice and come on time. Great company!!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "108800313583399752830", "name": "Anna Henstrand", "time": 1575470543754, "rating": 5.0, "text": "Very reliable and such a fun time!", "pics": null, "resp": {"time": 1582593179045, "text": "Thanks Anna!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "111616788402629937638", "name": "Katie Davis", "time": 1549314240065, "rating": 5.0, "text": "Prestige Limi Service always makes sure my friends and I get home safe. Barry is such a great driver and makes the experience so enjoyable for everyone!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "103790455236494393287", "name": "georgia edwards", "time": 1548879373592, "rating": 5.0, "text": "Such a great service! So safe and reliable. Highly recommend!!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "117255539337268361051", "name": "Emma Averna", "time": 1548694574434, "rating": 5.0, "text": "Great company to use. The drivers are very friendly and have great customer service.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "113366443922118885336", "name": "Laura Uebele", "time": 1568305419000, "rating": 5.0, "text": "Such a great company!! Very nice and talkative!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "110996994354090890978", "name": "Abigail Taylor", "time": 1548301182521, "rating": 5.0, "text": "Barry Fields is great! Their drivers are very considerate and kind!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "104612922118105308802", "name": "Hannah Diehl-Routon", "time": 1549244562767, "rating": 5.0, "text": "They are so nice and are willing to work with you!! They make the riding expirience even more enjoyable!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "107183273714431837708", "name": "Emma Burnett", "time": 1549041510434, "rating": 5.0, "text": "Love this service! They have very safe drivers and it’s such a great fun and professional atmosphere!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "115047100699581363093", "name": "Mary (Callie) Anderson", "time": 1548883651021, "rating": 5.0, "text": "The drivers of Prestige Limos are always very kind and willing to go out of their way to make sure you have a ride!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "111274874403563131975", "name": "Neelanjana Ray", "time": 1509213834341, "rating": 5.0, "text": "Clean cars. Courteous drivers. Pickup from BHM had a slight glitch, driver apparently did not know about pickup, had to wait .5 hr. But good overall", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "103489275246820174394", "name": "Caroline Alvarado", "time": 1548283219064, "rating": 5.0, "text": "Love this company! They are so sweet & do so much to help out me and my sorority!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "111327207613663785842", "name": "Roger Anderson", "time": 1514342876227, "rating": 5.0, "text": "Wonderful service! Could not ask for a better time!!!!! If you want 1st class service - call Prestige Limo Services!  😊", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "114584194501248769589", "name": "Lisa Riley", "time": 1529442055840, "rating": 5.0, "text": "I only use Prestige Limo for my transportation needs. My Uncle visits from Los Angeles 3 or 4 times a year and always call my good friends at Prestige Limousine for pick ups and drop offs from the Birmingham Airport. Most recent we used Prestige’s Hummer Limo to take my son & 4 of his best friends to the Mother Son 5th Grade dance at Verner Elementary School in Tuscaloosa. I cherish having all my kids home for Christmas, so we call Prestige to drive us around to see the Christmas Lights. The service is always exceptional and the vehicles are spotless! They are the best in Alabama & Georgia!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "110991446933866142798", "name": "Madelyn (Maddie) Schmidt", "time": 1556130037832, "rating": 5.0, "text": "Barry is amazing! This is the best limo service BY FAR in Tuscaloosa!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "110795373639185800037", "name": "Karen Krukowski", "time": 1535301842781, "rating": 5.0, "text": "Barry at Prestige Limo came through when my son’s previous ride to the airport from UA fell out due to car troubles.  Called him at 7:15 on Sunday morning and he had my son picked up by 8:15 and to the airport on time for his 10:15 flight.  His demeanor made this anxious mom very reassured that all would work out and the cost was less than I had anticipated!  Thank you Prestige Limo, you saved the day!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "100608288876191665607", "name": "Kimberly Robertson", "time": 1584438843431, "rating": 5.0, "text": "The ultimate in customer service!  Opened doors, handled luggage amd beyond. We were so thankful for this company and their professionalism. I had a schedule an emergency next day flight from an airport 1hr. away in the early morning. They were the only company who was able to accomodate me with no problems!  Barry, the owner, is a great and honest leader. Call them!", "pics": null, "resp": {"time": 1587390650231, "text": "Thanks"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "107762503688679798032", "name": "Molly Manale", "time": 1573592739083, "rating": 5.0, "text": "I use this limo service to get around on the weekends!! Very convenient and friendly.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "114261143499388075746", "name": "Sarah Grace Houy", "time": 1548184143760, "rating": 5.0, "text": "I have had great experiences every time i’m with them!! all the staff and drivers are very nice and the limos are always in great condition!!!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "117101963421366512440", "name": "Latrika Woods", "time": 1551850439358, "rating": 5.0, "text": "I travel at least once or twice a month for work, and began to become overwhelmed with getting to  and from the airport, trying to find parking and then rushing to check-in. I reached out to other car service companies and others did not return the call, however Prestige answered on the first call and my flight was the next day. My driver Mr. Flowers had exceptional customer service, professionalism and punctuality. He was early to pick me up from home and the airport. He made sure to communicate with me the day before and when he was on his way. I look forward to continue doing business with Prestige. They have definitely gained a new loyal customers. I promise you can’t go wrong by calling them!!!! :-)", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101949814745052369451", "name": "Shannon Moore", "time": 1523276087718, "rating": 5.0, "text": "I would like to thank Prestige Limo Service for the wonderful and professional service on the night of my son's prom. Barry, my wife and I thank you for your professional and caring drivers...I highly recommend!!!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "115388983355524955064", "name": "Barbara Ford", "time": 1539889001866, "rating": 5.0, "text": "Thank you Prestige Limo(Barry Fields )for the exceptional service that you provided. You were able to accomodate all of our needs. My reservation vehicle was top of the line, roomy, and very comfortable .Your professionalism showed my guests and I that you really take pride in what do. I highly recommend Prestige Limo to anyone that is in need of prompt transportation, has courteus drivers, and offers a variety of quality vehicles to choose from. Thank you and I look forward to using your service again in the near future .", "pics": null, "resp": {"time": 1539889938479, "text": "Thanks for that wonderful review!!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "100416856693531280791", "name": "Marley Dunkin", "time": 1548893590357, "rating": 5.0, "text": "Highly recommend using Prestige Limo Service for any occasion! They were awesome.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "104547470344491481045", "name": "LaTesha Wells", "time": 1522636465250, "rating": 5.0, "text": "Rented a limo for my son's Sr. Prom. He loved the driver and was very pleased with the service. Will definitely be using Prestige again!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "104984004100332455503", "name": "Renee Jones", "time": 1535596418298, "rating": 5.0, "text": "I needed a car service from Tuscaloosa to Birmingham and I was extremely pleased with the professionalism and quality service from Prestige. Highly Recommend!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "100788588633304392802", "name": "Morgan Hixon", "time": 1578971127747, "rating": 5.0, "text": "Prestige limo service is so great! Hunter and Barry do a great job with getting us where we need to be safely!", "pics": null, "resp": {"time": 1579088584621, "text": "Thanks Morgan!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "103065821852990677364", "name": "Anna Henstrand", "time": 1548979429353, "rating": 5.0, "text": "really great company. very reliable as well.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "116262176477449966055", "name": "Kate Karson", "time": 1548883040795, "rating": 5.0, "text": "Prestige limo service is the best! Love Barry he’s awesome!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101783956480851315458", "name": "P Wesche", "time": 1544216438465, "rating": 5.0, "text": "Great company, great service, superb reliability, have known Barry and his team for over 6 years.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "108025355641337334227", "name": "lucie flowers", "time": 1575406960155, "rating": 5.0, "text": "Perfect service with great employees. We love you Barry!", "pics": null, "resp": {"time": 1582593277151, "text": "Thanks Lucie!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "110746127323415187783", "name": "Meagan Hicks", "time": 1522118270259, "rating": 5.0, "text": "we used this company for prom & it was great service w/ very kind people!! i would definitely recommend it (:", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "103637368484269098749", "name": "Madelyn Nowicki", "time": 1548806764850, "rating": 5.0, "text": "Such great service!! We use it every weekend, always reliable and super quick!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "107887625811133770789", "name": "Delaney Razo", "time": 1617839508033, "rating": 5.0, "text": "Great company, always so professional and a great company to work with.", "pics": null, "resp": {"time": 1617855782370, "text": "Thanks Delaney!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "102336475235160656328", "name": "emily ruder", "time": 1549248551326, "rating": 5.0, "text": "Barry is always super accommodating and friendly.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "113621027136820416400", "name": "Ashley Hutcheson", "time": 1549043606839, "rating": 5.0, "text": "Such a great company! Wonderful limo service!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "111242914448973378214", "name": "LC Bend", "time": 1523880380344, "rating": 5.0, "text": "Excellent service! Professional and courteous driver and staff! Timely!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "115522098804166232424", "name": "Bridget Bailey", "time": 1537992575948, "rating": 5.0, "text": "My family andI have been using Prestige Limo service for many years now going back-and-forth from the airport to Tuscaloosa when my brother and I were in school at Alabama- ROLL TIDE! All of their drivers are so considerate, safe drivers, and reliable!  Last weekend when I was there for the Alabama versus A&M game, I accidentally left a pair of nice sunglasses in the car and my driver so politely texted me and told me I left my sunglasses and even dropped them off for me back in Tuscaloosa...Talk about integrity! I would suggest Prestige Limo service to anybody!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "102297068395848052390", "name": "Annette Harris", "time": 1520816621919, "rating": 5.0, "text": "The service is awesome. Very professional.  Highly recommend..", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "111756668514375858291", "name": "Taylor Hubbs", "time": 1547955562829, "rating": 5.0, "text": "the BEST!!!!! we love it everytime <33 the sweetest AND in a timely manner", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "112758106308266814504", "name": "Caroline Gamble", "time": 1548965347171, "rating": 5.0, "text": "Barry is a great driver and always so kind!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "109517943070031704350", "name": "K G", "time": 1527623569145, "rating": 5.0, "text": "We had an amazing experience with Prestige Limo service and cannot wait to rent it again for our next friends birthday party next month!!! Best birthday party yet!!!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "110993567133871167722", "name": "George Purvis", "time": 1543539974614, "rating": 5.0, "text": "Great company highly recommend this to anyone traveling or in town", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101683253520111631654", "name": "patricia dyer", "time": 1582588207708, "rating": 5.0, "text": "Barry is always so friendly!!", "pics": null, "resp": {"time": 1582592440770, "text": "Thanks Patricia!"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "102133491190753313423", "name": "Nicole Putre", "time": 1549308207853, "rating": 5.0, "text": "My friends and I regularly use Prestige Limousine and always have a wonderful experience. Their drivers are very friendly and professional.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "115029875555113429778", "name": "Elizabeth (Ellie) Richard", "time": 1549323688277, "rating": 5.0, "text": "Had a great experience, Barry is so kind, efficient, and helpful!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "103015779529630984761", "name": "Elizabeth Fagundes", "time": 1548883520301, "rating": 5.0, "text": "Great customer service and quality vehicles!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "103868188913155666837", "name": "Charles Fields", "time": 1521482113034, "rating": 5.0, "text": "I highly recommend this service for any event no matter what's the occasion The owner , drivers and Rides are A1", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "113335607077865903373", "name": "kaitlyn trawick", "time": 1548306664726, "rating": 5.0, "text": "The best service and so friendly!! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "109077316713072143722", "name": "M Dohr", "time": 1505695475171, "rating": 5.0, "text": "Smooth and efficient service on game day shuttle from airport to stadium -- picked up in 15 and back at airport in 15 !  Comfortable ride in a new   And clean suburban .. better than an Uber !", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "112546621905980725380", "name": "Virginia Limbaugh", "time": 1568848054574, "rating": 5.0, "text": "Awesome service! Loved it very much!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "116182558336968220288", "name": "Alyssa Delia", "time": 1549322939762, "rating": 5.0, "text": "Great company with Friendly drivers!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "111440089060093193893", "name": "kristine", "time": 1510098477989, "rating": 5.0, "text": "The Prestige team has driven me more than 60 times this past year and has continued to exceed all my expectations on each trip. Mr. Fields (the owner) and his team are professional, pleasant, courteous, and safe drivers. They arrive on time, are up-to-date on any possible traffic delays with alternate routes ready, and know their client preferences (e.g., unique pick-up or drop-off locations; interior temperature; music, etc.). The team also are cognizant of any flight issues whether going to or leaving the airport. Several of my flights this past year have been delayed and I have been able to text/email/call to reschedule without further delay but in most cases, as soon as I knew of the schedule disruption, I received a text from the driver that they knew of the change already and would be there waiting for me as soon as I landed. Mr. Fields also is a wealth of assistance for transportation needs outside Alabama and has a network of colleagues with whom he can instantly connect you with. For example, when trying to get back to Alabama when a major airline had multiple disruptions and left thousands of travelers stranded in Atlanta, he was able to text within minutes of my request the names and numbers of several local companies who could get me back home. I appreciate this level of consistent service. Such proactive problem-solving and communication put me at ease knowing that my ride would be there – no matter how late the flight would arrive. I have made several last-minute requests (e.g., forgot to reserve a ride; had a game day request) over the year and they were able to accommodate them. The evening before each reservation, I receive an email confirming the pick-up time which is a helpful reminder and an opportunity to make any changes. I also receive a text or call from the driver a few minutes before each pick-up. That way, I know who to expect, if there will be any delays (never have been), or other changes in my reservation. Making a reservation with Prestige is easy to do with drop-down menus on my computer or phone. Also, the Prestige transportation fleet is clean and new with multiple options for any occasion. I have recommended Prestige to my colleagues and friends. Prestige offers an exemplary array of 24/7 services of which I will continue to use – in fact I already have multiple future reservations confirmed. Prestige, Mr. Fields, and his team are a true asset to those who need quality, safe, cost effective, and friendly transportation services.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "116122797168706968065", "name": "Beverly Bishop", "time": 1540831963624, "rating": 5.0, "text": "I enjoyed  servic.  I recommend  anyone  to use Prestige Limo Service.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "102307984660614626122", "name": "Lyndsey Knecht", "time": 1549068519847, "rating": 5.0, "text": "Barry is the best! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "111572217679111716321", "name": "Karley Wick", "time": 1548290633228, "rating": 5.0, "text": "Amazing service !!!! We love prestige limo service 🤩", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "109743944662118208966", "name": "Tess Miller", "time": 1555973061206, "rating": 5.0, "text": "berry is hands down the best!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "102053475871845929317", "name": "S Warner", "time": 1531755820783, "rating": 5.0, "text": "The best service, very professional drivers!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101447524707033350274", "name": "Julia (McLean) Ellisor", "time": 1548695814299, "rating": 5.0, "text": "Highly reccomend, Barry is the best!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101669478938108940806", "name": "Hannah Hogans", "time": 1548473167211, "rating": 5.0, "text": "Super nice service and really clean!!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "110047270129958283072", "name": "Josh C", "time": 1543537481498, "rating": 5.0, "text": "Great company with great drivers!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "107353572718782897494", "name": "Curtis Fletcher", "time": 1543609904342, "rating": 5.0, "text": "Great service, nice vehicles.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "109362030668579879802", "name": "Christy Fitz", "time": 1510623943189, "rating": 5.0, "text": "WITHOUT EVEN A QUESTION 5 STARS ALL THE WAY AROUND!!\n\nPRESTIGE LIMO IS THE BEST!!!  The owner BARRY is professional and goes above and beyond. He and his staff are professional, great communicators and on time and VERY RELIABLE. My first experience I called at 10 o'clock at night for a ride for my son and his friend from University of Alabama to Birmingham Airport. Not only did BARRY greet me so kindly, he made me feel so at ease that my son would make it to the airport the VERY NEXT MORNING ON TIME AND SAFE. He picked my son up on time, was waiting early and even texted me that he was in the car.. I have used several other services to get my son to the airport in the past but no more. I am loyal to BARRY AND PRESTIGE LIMO from here on out. I highly reccomended him today to another mother and she too was very impressed. Their pricing is great and for a mama who is 3,000 miles away in California I feel such ease knowing my son is in great hands. If you are a parent who needs a ride or a student I cannot reccomend this company more. You will not be sorry.. I promise.. this man is a Saint! I just hope when the word spreads we can still get a ride, that he won't be too booked. Fantastic BARRY sure knows how to be professional and treat a customer.\nThank you SO much! My heart is grateful.", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "113117613270197669205", "name": "Gary Ebert", "time": 1512932686326, "rating": 5.0, "text": "Excellent experience every time, highly recommended", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "105029357322003740956", "name": "Elizabeth Bentley", "time": 1548290579531, "rating": 5.0, "text": "Great experience with this company!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "102435565556917759271", "name": "Carolyn Gosa", "time": 1537220854402, "rating": 5.0, "text": "Awesome experience!!! Professional  & Very courteous service!!!", "pics": null, "resp": {"time": 1537222376001, "text": "Thanks 🙏"}, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "106985934493967873013", "name": "Emily Sirh", "time": 1548907176006, "rating": 5.0, "text": "The absolute best", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "112150574333642876436", "name": "Rachel Frost", "time": 1548284321523, "rating": 5.0, "text": "Very reliable service!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "105681733671989988931", "name": "Ella Watson", "time": 1547968833714, "rating": 5.0, "text": "trustworthy and awesome service", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "112705917555001706669", "name": "Sabby Glaser", "time": 1573590673869, "rating": 5.0, "text": "Good service", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "115564173932497435902", "name": "Dylan Surber", "time": 1548290590792, "rating": 5.0, "text": "great service!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "103453278114577284082", "name": "Evie Laney", "time": 1548369560572, "rating": 5.0, "text": "the best limo service!!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "109876255157284077916", "name": "Madeline Fest", "time": 1549319996506, "rating": 5.0, "text": "Love this company!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "107143371714968975920", "name": "Madeline Mills", "time": 1555955633129, "rating": 5.0, "text": "Absolutely the best!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "100640072122742088347", "name": "Dante Jelks", "time": 1528165933676, "rating": 5.0, "text": "Top quality service!!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "105235173029671623512", "name": "Courtney Walker", "time": 1528746520075, "rating": 5.0, "text": "Wonderful service!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "118261982194416126898", "name": "Catherine McClain", "time": 1548393538344, "rating": 5.0, "text": "Barry is the BOMB!!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "112832574010003389505", "name": "Katherine Hudson", "time": 1549611070443, "rating": 5.0, "text": "Best limo ever!!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x88861ca840eba2e3:0x5be2b74d18997623"}
{"user_id": "101378868368363721260", "name": "Anne-Marie Wester", "time": 1612820300539, "rating": 5.0, "text": "Thank you so much to Coats Classic for being a part of our big day! We left our NYE wedding reception in \"Elizabeth,\" the 1958 Rolls Royce Silver Cloud! It was stunning! Our guests were just as excited as we were! And Anil was the sweetest!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNCsUuHZpuTJ4oS6cn2w2mGGR6wKGBFBjjh0qmu=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891a1388f3b6e7:0xf97bba02cf1ab0b9"}
{"user_id": "111084910829818493216", "name": "Lynn Cummings", "time": 1607112069037, "rating": 5.0, "text": "I've been a full time professional photographer since 2010 and have used Coats Classic Cars for a number of photo shoots and have worked with them for a number of years and always refer them to my clients. When it was time my wedding day I knew I was going to use them for my special day. As always they were right on time and everything was perfect from the moment they arrived until the moment we ended our special day!! When the day was over my wife told me thank you and to make certain to think them because she felt like a princess from the beginning to the end of the day!\nThank you for being such a HUGE part of making our wedding day perfect!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOfNeMFsAlFdiTdDDxW_gkAkroHS0tZHPTvBmtU=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891a1388f3b6e7:0xf97bba02cf1ab0b9"}
{"user_id": "100812523400337848202", "name": "Zeigler Wedding", "time": 1611329776186, "rating": 5.0, "text": "Elizabeth, 1958 Rolls-Royce Silver Cloud, was so beautiful! James was so polite, helpful, and entertaining. While our wedding was during the pandemic, he also took that into consideration and wore a mask the entire time. He drove us all over the Biltmore Estate to take photos before and after the wedding. We really enjoyed ourselves! We decided the day of the wedding that we would like to extend our time for an hour and without hesitation, they made it happen! It was a beautiful touch for a send off!", "pics": null, "resp": null, "gmap_id": "0x88891a1388f3b6e7:0xf97bba02cf1ab0b9"}
{"user_id": "107437680829813748631", "name": "Heather Sexton", "time": 1579536670433, "rating": 5.0, "text": "We chose to have Maggie, the white rolls Royce, as our getaway vehicle and WOW its was beautiful! James, one of the partners of the company, was our driver. He arrived right on time with the car (hours before our getaway) which allowed for amazing pictures and had the car warmed up and ready for us to leave at the end of the night. He was very pleasant and quite knowledgeable about the cars. I would 100% recommend them to anyone!", "pics": null, "resp": null, "gmap_id": "0x88891a1388f3b6e7:0xf97bba02cf1ab0b9"}
{"user_id": "108832469554902032782", "name": "Alisha Crossley Photography", "time": 1599783112606, "rating": 5.0, "text": "No better car rental service in Birmingham, AL or the surrounding area. We have never had a disappointed client with James ... absolutely astounding.", "pics": null, "resp": null, "gmap_id": "0x88891a1388f3b6e7:0xf97bba02cf1ab0b9"}
{"user_id": "108978013536907372872", "name": "Katherine Gonzalez", "time": 1578605887335, "rating": 5.0, "text": "The staff at Coat's Classic Cars is so nice and friendly ... we had a last minute hiccup occur that caused us to have to change reception venues, and before I had even reached out to Coat's, they reached out to me asking if there was anything they could do to help! They were so accommodating when we had to make a change, and everything went perfect the night of the wedding. The car was the perfect touch to a wonderful evening! I was beyond happy with our choice of Coat's Classic Cars!", "pics": null, "resp": null, "gmap_id": "0x88891a1388f3b6e7:0xf97bba02cf1ab0b9"}
{"user_id": "108723596298931127847", "name": "Alaina Peterson", "time": 1571500044400, "rating": 5.0, "text": "Phenomenal company! It was a breeze to book them. They showed up right on time and stayed all evening for pictures. The chauffeur was was all dressed up, opened doors for us and was so professional. We rented Caroline. She is such a beautiful and well kept car. The experience with Coats Classic Cars was magical and priceless.", "pics": null, "resp": null, "gmap_id": "0x88891a1388f3b6e7:0xf97bba02cf1ab0b9"}
{"user_id": "107167984377823639547", "name": "Emily Wood", "time": 1560268909150, "rating": 5.0, "text": "Coats Classic Cars made our wedding day extraordinary. Our classic car was a hit, but the team made the experience even better. James was not only a kind and wonderful driver, but he held umbrellas, escorted us down hills, and made sure we were comfortable and taken care of all evening. Coats is the best!", "pics": null, "resp": null, "gmap_id": "0x88891a1388f3b6e7:0xf97bba02cf1ab0b9"}
{"user_id": "104726140243334275063", "name": "James Coats", "time": 1547259512184, "rating": 5.0, "text": "The Southeast's largest and best. Highly recommend, and not just because they're family. They treat EVERYONE like family!", "pics": null, "resp": null, "gmap_id": "0x88891a1388f3b6e7:0xf97bba02cf1ab0b9"}
{"user_id": "114223775767825613400", "name": "jean smith", "time": 1469158153661, "rating": 5.0, "text": "Thanks to JAMES and Coats Classic for being a hit at our son's wedding this summer. The car added the touch of old world elegance to a very modern day couple. The professional driver and attention to detail as we'd booked the car was very appreciated.", "pics": null, "resp": null, "gmap_id": "0x88891a1388f3b6e7:0xf97bba02cf1ab0b9"}
{"user_id": "113769442657128687150", "name": "Anita Casano Kanellis", "time": 1469115966647, "rating": 5.0, "text": "As a wedding planner of 17 years I have worked with numerous wedding vendors in this industry all over the country and can honestly say that James Coats with Coats Classic Cars and his entire team and staff do an amazing job at escorting our brides on their wedding days.  Brides will experience over the top service with all of their chauffeurs not to mention gorgeous, well maintained vintage cars from their very large fleet of vehicles.  Completely licensed and insured, Coats Classic Cars is an extremely professional and well established business which will deliver above and beyond their promised service.\n\nAnita M. Kanellis\nOwner - AK Brides - Wedding Planning Services", "pics": null, "resp": null, "gmap_id": "0x88891a1388f3b6e7:0xf97bba02cf1ab0b9"}
{"user_id": "110445101638458572419", "name": "Patricio Lopez", "time": 1581036748650, "rating": 5.0, "text": "From the pictures I have seen and seeing the car of our mutual bride, All I can say is WOW!", "pics": null, "resp": null, "gmap_id": "0x88891a1388f3b6e7:0xf97bba02cf1ab0b9"}
{"user_id": "103648781137014484330", "name": "Dylan Spencer", "time": 1518305771017, "rating": 5.0, "text": "No complaints at all. Beautiful Rolls Royce!", "pics": null, "resp": null, "gmap_id": "0x88891a1388f3b6e7:0xf97bba02cf1ab0b9"}
{"user_id": "115161213517413610591", "name": "Jackie Rowell", "time": 1469400257929, "rating": 5.0, "text": "As a planner, Coats Classic Cars is my go-to company when my clients want a classic car for their event.  CCC has the widest variety of choices of any other service in our area, and CCC provides the best all-around service.  The drivers are very professional, always dressed appropriately, and very well trained for the service they provide.  My clients are as special to Coats Classic Cars as they are to me.", "pics": null, "resp": null, "gmap_id": "0x88891a1388f3b6e7:0xf97bba02cf1ab0b9"}
{"user_id": "105194903403290511742", "name": "Da Dao", "time": 1531228404105, "rating": 5.0, "text": "incredible.  Catherine was amazing!", "pics": null, "resp": null, "gmap_id": "0x88891a1388f3b6e7:0xf97bba02cf1ab0b9"}
{"user_id": "108565906794766595903", "name": "J McDavid", "time": 1531018317793, "rating": 5.0, "text": "Classic car bridal limousine service", "pics": null, "resp": null, "gmap_id": "0x88891a1388f3b6e7:0xf97bba02cf1ab0b9"}
{"user_id": "116722354746811582342", "name": "Sally French", "time": 1560274103395, "rating": 5.0, "text": "Could not have asked for a better experience!", "pics": null, "resp": null, "gmap_id": "0x88891a1388f3b6e7:0xf97bba02cf1ab0b9"}
{"user_id": "102523100938497557158", "name": "Sheree Varnes", "time": 1461343879094, "rating": 1.0, "text": "I wish I could give this company a negative number of stars. Used this service for my wedding day. The owner, who was our driver, was extremely unprofessional! He was obviously intoxicated in some way (he said he took some pain meds with a glass of wine). He swerved all over the rode during our ride from the reception to our hotel. He got lost several times, and my husband had to sit in the front and give him directions. Then, after we arrived at the hotel, he asked me (the bride) how I was going to pay, after he had already spoken to my father about it. He then complained that I did not tip him. I literally feared for my life, and this guy said \"What? No tip?\"! I mean, who does that?!? He is rude, unprofessional, and a danger to anyone who uses his service. He almost ruined my wedding night. Please don't bother wasting time & money on this company.", "pics": null, "resp": null, "gmap_id": "0x889a42f5565d6833:0xd80fc387914e5b70"}
{"user_id": "113942647239842963735", "name": "JAMES MEADOWS", "time": 1460679335361, "rating": 1.0, "text": "The owner is rude and god forbid at 1st it was we had to make a deposit then it was the whole thing. I don't know more no them then they know me who pays up front the whole balance anyway? Then to hang up on you?", "pics": null, "resp": null, "gmap_id": "0x889a42f5565d6833:0xd80fc387914e5b70"}
{"user_id": "100509409034375954269", "name": "Monika McDonald", "time": 1605113487981, "rating": 5.0, "text": "Fun Fun Fun !!!!!! We celebrated my daughter's 21 birthday and yes we will be renting again. Mr. Jimmy was very professional", "pics": null, "resp": null, "gmap_id": "0x8889300cddd25391:0x6d6f3738af7dfd15"}
{"user_id": "105202082534644209953", "name": "Jason Blackmon", "time": 1452649423938, "rating": 5.0, "text": "We booked the PARTY BUS and i must say they have an awesome staff as well as prompt pick up timing. We had a blast on it during the birthday party. Best part was we were able to let loose on the bus with friends and had room to actually party. Great amenities that we took advantage of as well. Recommend them hands down for any real party.", "pics": null, "resp": null, "gmap_id": "0x8889300cddd25391:0x6d6f3738af7dfd15"}
{"user_id": "117069901625451416238", "name": "Ryan K Jones", "time": 1454474463001, "rating": 5.0, "text": "The inside of this bus is SICK!!! All sorts of lights, nice sound system, and best of all incredible customer service.  Highly recommend the 205 Party Bus", "pics": null, "resp": null, "gmap_id": "0x8889300cddd25391:0x6d6f3738af7dfd15"}
{"user_id": "107123484981202354001", "name": "Daniel Evans", "time": 1452940733706, "rating": 5.0, "text": "Had tons of fun. Definitely glad we used the party bus!", "pics": null, "resp": null, "gmap_id": "0x8889300cddd25391:0x6d6f3738af7dfd15"}
{"user_id": "107654666195980863394", "name": "Demia Perry", "time": 1524693656104, "rating": 1.0, "text": "On April 20th 2018 205 party bus canceled my reservations 5hours prior to them showing up at my event   which was a prom for high school children and they didn't offer to supply me with another means of transportation even. Though the deposit and reservations where paid two months in advance  ", "pics": null, "resp": null, "gmap_id": "0x8889300cddd25391:0x6d6f3738af7dfd15"}
{"user_id": "111542561962694265669", "name": "Ashley Beistline", "time": 1623030595591, "rating": 5.0, "text": "Rented the white Mercedes limo for Saturday night,  driver was very considerate and kind. Rates are great, car was clean, and it was an overall nice experience.", "pics": null, "resp": null, "gmap_id": "0x889293182bde413d:0x3e021b4964585716"}
{"user_id": "107333352156883880973", "name": "Evo solo", "time": 1612367288171, "rating": 5.0, "text": "Bay Limousine Service would be highly recommended in my opinion.  Amazing quality cars, amazing service, and amazing ownership.  Overall, this company is extremely professional and easy to work with.  Very professional and very high end, but for an affordable price.  11/10 in my book!", "pics": null, "resp": null, "gmap_id": "0x889293182bde413d:0x3e021b4964585716"}
{"user_id": "108990400888851164773", "name": "Mackenzie Poole", "time": 1613066076017, "rating": 5.0, "text": "Bay Limousine is incredibly professional. I highly recommend Bay Limousine if you want great quality and value. They have an excellent variety of vehicles and they are great at communication.", "pics": null, "resp": null, "gmap_id": "0x889293182bde413d:0x3e021b4964585716"}
{"user_id": "104908117225332527863", "name": "Paula James", "time": 1621859301103, "rating": 2.0, "text": "Sent a message to rent a limo but didn't get a reply until the day I needed it smh got to do better", "pics": null, "resp": null, "gmap_id": "0x889293182bde413d:0x3e021b4964585716"}
{"user_id": "105243623037828897627", "name": "Jessica Bereszniewicz", "time": 1554668611906, "rating": 5.0, "text": "Edwin was accommodating in every single way possible & was so easy working with making sure my party got everything we needed. Our bus driver was so amazing and was on time for our pick up & drop off. This bus was SO MUCH FUN. Definitely going to use it again in the future!!", "pics": null, "resp": null, "gmap_id": "0x889293182bde413d:0x3e021b4964585716"}
{"user_id": "107007863841168698248", "name": "Cam Hill", "time": 1565107826913, "rating": 5.0, "text": "BEST LIMOUSINE COMPANY EVER. Apart from personally knowing the owner, Bill, for the better part of 20 years; I've also used Bay Limo for all of my events the past decade. Would recommend to anyone!", "pics": null, "resp": null, "gmap_id": "0x889293182bde413d:0x3e021b4964585716"}
{"user_id": "100030144714179277910", "name": "Gaby Ruiz", "time": 1554667849005, "rating": 5.0, "text": "Edwin was very accommodating and made sure to work with all our requests. We appreciated how easy of a process this was. Our driver was also very communicative with us and we had a great time!", "pics": null, "resp": null, "gmap_id": "0x889293182bde413d:0x3e021b4964585716"}
{"user_id": "112096518870553944436", "name": "Catie Johnson", "time": 1554667887296, "rating": 5.0, "text": "A great company! They were so helpful and accommodating! They were on time, extremely clean bus, and great service overall! Would definitely recommend this company and will use them again!", "pics": null, "resp": null, "gmap_id": "0x889293182bde413d:0x3e021b4964585716"}
{"user_id": "117987513347898100693", "name": "Cristian Cortes", "time": 1553480757207, "rating": 5.0, "text": "My friends and I used Bay Limousine for our senior prom this year and we were very satisfied with the service. The limousine was cozy and the driver was really nice to us, didn’t treat us like children, opened/closed our doors and greeted us very welcomely.", "pics": null, "resp": null, "gmap_id": "0x889293182bde413d:0x3e021b4964585716"}
{"user_id": "110712613438939149856", "name": "Mackenzie Bauer", "time": 1554674982468, "rating": 5.0, "text": "Edwin and our driver were so great! They were extremely accommodating and went above and beyond our expectations! Would definitely use again in the future!! Thanks yall!", "pics": null, "resp": null, "gmap_id": "0x889293182bde413d:0x3e021b4964585716"}
{"user_id": "103790125731990179563", "name": "Andrea Deal", "time": 1550871541725, "rating": 5.0, "text": "Nice vehicles and wonderful drivers. The horse and carriage are amazing as well.  Very professional.", "pics": null, "resp": null, "gmap_id": "0x889293182bde413d:0x3e021b4964585716"}
{"user_id": "104117421855407769375", "name": "Connie Mitchell", "time": 1553405980265, "rating": 5.0, "text": "Excellent service was provided by Bay Limosine!  The party of nine was taken care of in a first class way. I would highly recommend Bay Limosine. We loved the Mercedes SUV!", "pics": null, "resp": null, "gmap_id": "0x889293182bde413d:0x3e021b4964585716"}
{"user_id": "105543547845138290163", "name": "Madison Cate", "time": 1554667633936, "rating": 5.0, "text": "Edwin was super helpful and accommodating through the whole planning process and worked with us to make sure we got everything we needed!! Our bus driver was awesome as well!!", "pics": null, "resp": null, "gmap_id": "0x889293182bde413d:0x3e021b4964585716"}
{"user_id": "112108645479188946806", "name": "Anna Lea Strickland", "time": 1554676781649, "rating": 5.0, "text": "Honestly the best ride of my life, would 10/10 recommend.", "pics": null, "resp": null, "gmap_id": "0x889293182bde413d:0x3e021b4964585716"}
{"user_id": "112296412950367946614", "name": "Robiann Gilbert", "time": 1504279757496, "rating": 5.0, "text": "We used Bay Limousine for our daughter's wedding, and we had to travel from Santa Rosa, FL to Dothan, AL.  Everything was perfect!   The driver was in place on time, he was gracious and accommodating, and the bus was clean and just what we needed to transport the whole wedding party.", "pics": null, "resp": null, "gmap_id": "0x889293182bde413d:0x3e021b4964585716"}
{"user_id": "106794699756603004597", "name": "Kya Brown", "time": 1523166277400, "rating": 5.0, "text": "I called last minute and was still able to get prom transportation for my son and his date. The driver was very friendly. I will use them from now on for any and all limo and transportation needs", "pics": null, "resp": null, "gmap_id": "0x889293182bde413d:0x3e021b4964585716"}
{"user_id": "110902690039945224177", "name": "Txxx Sxxx", "time": 1458122169759, "rating": 2.0, "text": "First off the carriage was amazing and the bride and groom loved it.  I would have given you 5 stars except for one thing.... the driver.  #1, he never got one foot off the carriage to help the bride and her father in or out of the carriage.  I was told beforehand that steps would be provided as I had explained when renting the carriage that the brides father had recently had knee replacement surgery.   #2, the brides father was running late due to unforeseen circumstances, which put everything running late and put the carriage rental past the end time before the carriage had returned the bride and groom to the reception venue.  Your company had my credit card on file and you had been paid well in advance so there was no reason to assume you would not get paid for the extra time, but your driver took it upon himself to start asking guest at the wedding for money.  I was very displeased with his actions.  He sat on the carriage looking like a miserable blown up toad.    I work in the hospitality industry and customer service is as important as the product you are offering.  A+ for the carriage and horse, both amazing!  Customer service needs a lot of improvement.  Your driver did have a very nice tip he would have received, had he not shown such horrible disrespect.  We have rented carriages several times in the past from a different company that has now retired, their service compared to this was worlds apart.  I'm only adding this so that there is no misunderstanding that I was expecting something different from renting a carriage.  I have rented carriages for my wedding and my son's proms, so I am very familiar with the process.\nYour driver acted like it was a inconvenience to be there, well trust me, he does not ever have to worry about being at any event I organize or anyone I can warm about him.  He even refused to shake the grooms hand when he tried, just turned his head like he didn't see him.  The video camera captures a lot.", "pics": null, "resp": null, "gmap_id": "0x889293182bde413d:0x3e021b4964585716"}
{"user_id": "111850228012289766259", "name": "Mallory Fox", "time": 1554667975964, "rating": 5.0, "text": "If I could marry Edwin I would. BEST COMPANY EVER !!!!!!! Xoxo", "pics": null, "resp": null, "gmap_id": "0x889293182bde413d:0x3e021b4964585716"}
{"user_id": "113430750682910877783", "name": "William Goff", "time": 1494631254192, "rating": 4.0, "text": "Nice cars and great and great drivers", "pics": null, "resp": null, "gmap_id": "0x889293182bde413d:0x3e021b4964585716"}
{"user_id": "116610645993595377547", "name": "Little Momma", "time": 1514479031057, "rating": 5.0, "text": "I do privet security for bay limo", "pics": null, "resp": null, "gmap_id": "0x889293182bde413d:0x3e021b4964585716"}
{"user_id": "110062806564417590376", "name": "Kevin Payne", "time": 1533645429480, "rating": 5.0, "text": "Best of the best", "pics": null, "resp": null, "gmap_id": "0x889293182bde413d:0x3e021b4964585716"}
{"user_id": "100237636093802422710", "name": "sexy mama", "time": 1468035134044, "rating": 3.0, "text": "Good", "pics": null, "resp": null, "gmap_id": "0x889293182bde413d:0x3e021b4964585716"}
{"user_id": "111939417687887981701", "name": "Renae Whigan", "time": 1540170014864, "rating": 5.0, "text": "Like it", "pics": null, "resp": null, "gmap_id": "0x889293182bde413d:0x3e021b4964585716"}
{"user_id": "111701260111313365931", "name": "Gene and Marilyn McFalls", "time": 1622947097077, "rating": 5.0, "text": "The Limo Service was impeccable. The driver was prompt, professional, courteous. The water and juice was cold and delicious. We felt safe and secure as we traveled on sight seeing tour of various places. The price was reasonable and we would definitely use this service again.", "pics": null, "resp": {"time": 1622948561630, "text": "Thank you God bless"}, "gmap_id": "0x88928de61f5087a5:0xa247f49282eecf27"}
{"user_id": "117210091872247952839", "name": "Kassie Torres", "time": 1618691829045, "rating": 5.0, "text": "Made contact with owner today(James) to schedule ride for a prom. Very professional and nice gentleman!! Looking forward to upcoming event and would recommend to many.", "pics": null, "resp": {"time": 1618692576439, "text": "Wow thank you so much. God bless"}, "gmap_id": "0x88928de61f5087a5:0xa247f49282eecf27"}
{"user_id": "110361858625667343707", "name": "Dennis Brown", "time": 1611161926093, "rating": 5.0, "text": "I was thoroughly impressed with Affordable luxury from the moment I called and spoke with Mr. Whitt. He worked with me through every special moment of the evening. He was so kind to my Wife and Children. The Limo was stunningly beauty and clean.\nThey helped make an absolutely beautiful night and was very reasonably priced! Thank you a million times!", "pics": null, "resp": {"time": 1611181710671, "text": "Thank you.  God bless you and your family.  Amazing people really enjoyed meeting you all"}, "gmap_id": "0x88928de61f5087a5:0xa247f49282eecf27"}
{"user_id": "115723073124918927136", "name": "Jennifer Moorer", "time": 1613852432524, "rating": 5.0, "text": "I used their services for my daughter’s 9th birthday party. I cannot say enough about how wonderful it was. Mr. James made this experience unforgettable for these girls. He was very professional, kind, patient, and truly awesome. I would absolutely recommend them to anyone.", "pics": null, "resp": {"time": 1613855268227, "text": "Thank you God bless"}, "gmap_id": "0x88928de61f5087a5:0xa247f49282eecf27"}
{"user_id": "113106989036322812403", "name": "William Wiant", "time": 1606740142645, "rating": 5.0, "text": "My family and I were involved in an accident while traveling. For a family of six, we didn’t have any options to get to a rental car facility. I received this company’s info from the hotel I was taken to. The owner drove to us and took us almost ninety miles to the airport. Very affordable and easy. Our family is very thankful for this service! Highly recommend", "pics": null, "resp": {"time": 1606742110627, "text": "Thank you God bless."}, "gmap_id": "0x88928de61f5087a5:0xa247f49282eecf27"}
{"user_id": "104908117225332527863", "name": "Paula James", "time": 1621859465063, "rating": 2.0, "text": "Still waiting on a reply from a week ago. Dont need the limo now but would have loved to see the prices for next time I need one smh", "pics": null, "resp": {"time": 1621889991334, "text": "Where did you message me? I never got the message.  I always respond quickly.  3343436094"}, "gmap_id": "0x88928de61f5087a5:0xa247f49282eecf27"}
{"user_id": "103735173694977427126", "name": "Aaron Beck", "time": 1606230351406, "rating": 5.0, "text": "The vehicle arrived early. Very accommodating company and Driver. Dealt with the madness of my large group which included 3 stops. Best in the area and would love to use their services again. Went out of his way to return items that were left in the limo.", "pics": null, "resp": {"time": 1606231312341, "text": "Thank you God bless"}, "gmap_id": "0x88928de61f5087a5:0xa247f49282eecf27"}
{"user_id": "116428390876297086285", "name": "Jason Pickett", "time": 1602524736761, "rating": 5.0, "text": "Took my daughter and her husband from their wedding in Dothan to Atlanta.  Driver was so nice and they had a great experience.  I highly recommend this company.  Easy to work with and cheaper than others I priced!", "pics": null, "resp": {"time": 1602542210176, "text": "Thank you God bless"}, "gmap_id": "0x88928de61f5087a5:0xa247f49282eecf27"}
{"user_id": "111786646857288226230", "name": "Christina Guynn", "time": 1594667165884, "rating": 5.0, "text": "We rented a stretch expedition for our childrens prom night & Affordable Luxury did not disappoint! The children were so excited & had a night they will never forget! The limo was beautiful, clean & stocked with sparkling champagne & water. They played music, had a toast together & just soaked in the luxurious experience together. The children said when  they arrived at prom, the driver got out & rolled out a red carpet for them & treated them like celebrities.  They were all beside themselves! It was a great experience & I definitely reccomend them. And they love Jesus, so that's always a plus in my book!! Blessings to you & your company James!!", "pics": null, "resp": {"time": 1594672694212, "text": "Thank you very much.  Hope to serve you again someday.  God bless"}, "gmap_id": "0x88928de61f5087a5:0xa247f49282eecf27"}
{"user_id": "101899979826332544778", "name": "Jafre Whitt", "time": 1590621454353, "rating": 5.0, "text": "What an amazing company.  They go the extra mile to make you feel like Royalty.  Great well maintained vehicles.  Courteous well mannered professional staff. Truly Affordable Luxury", "pics": null, "resp": {"time": 1583959683446, "text": "Thank you God bless"}, "gmap_id": "0x88928de61f5087a5:0xa247f49282eecf27"}
{"user_id": "112686095431890849314", "name": "alvin cabrera", "time": 1621783044281, "rating": 5.0, "text": "Wow what a deal.  Great vehicles larger and better than the Hummers.  Filled with ice bottles water and sparking juice.  Very friendly and early. Definitely get your money's worth.", "pics": null, "resp": {"time": 1590623805145, "text": "Thanks"}, "gmap_id": "0x88928de61f5087a5:0xa247f49282eecf27"}
{"user_id": "113287103100762268033", "name": "kimber messick", "time": 1601185666697, "rating": 5.0, "text": "Very nice people! We rented for a bachelorette party and had a great time!", "pics": null, "resp": {"time": 1601207432430, "text": "Thank you God bless"}, "gmap_id": "0x88928de61f5087a5:0xa247f49282eecf27"}
{"user_id": "115436228427501348437", "name": "Eathon Whitt", "time": 1601214106915, "rating": 5.0, "text": "10/10 would recommend good price, great service, he was on time and overall a lot of fun.", "pics": null, "resp": {"time": 1601213752128, "text": "Thank you God bless"}, "gmap_id": "0x88928de61f5087a5:0xa247f49282eecf27"}
{"user_id": "103345485670888514986", "name": "Stefanie Eutsey", "time": 1600587069142, "rating": 5.0, "text": "Driver was on time and very nice. Owner also easy to work with ❤️", "pics": null, "resp": {"time": 1600604369903, "text": "Thank you God bless"}, "gmap_id": "0x88928de61f5087a5:0xa247f49282eecf27"}
{"user_id": "117845709100022356039", "name": "Kelly Reynolds Taylor", "time": 1607341973667, "rating": 5.0, "text": "Very easy to work with, the limo was very clean on the inside and outside", "pics": null, "resp": {"time": 1607347021302, "text": "Thank you glad we're were of good service to you.  God bless"}, "gmap_id": "0x88928de61f5087a5:0xa247f49282eecf27"}
{"user_id": "106664621810724424728", "name": "J Wilson", "time": 1607194526013, "rating": 5.0, "text": "Great experience! Had a wonderful time!", "pics": null, "resp": {"time": 1607196189246, "text": "Awesome God bless 🙏"}, "gmap_id": "0x88928de61f5087a5:0xa247f49282eecf27"}
{"user_id": "115117616668797400937", "name": "Gilma Mateo", "time": 1583955353632, "rating": 5.0, "text": "Awesome service great vehicles.  Friendly knowledge respectful.  And truly Affordable", "pics": null, "resp": {"time": 1583959672706, "text": "Thank you God bless"}, "gmap_id": "0x88928de61f5087a5:0xa247f49282eecf27"}
{"user_id": "103614028690489449681", "name": "Kat Lundberg", "time": 1593027970402, "rating": 5.0, "text": "Great limo service in Dothan Alabama!  We love Affordable Luxury!", "pics": null, "resp": {"time": 1593989445120, "text": "Thanks"}, "gmap_id": "0x88928de61f5087a5:0xa247f49282eecf27"}
{"user_id": "116738281339329248875", "name": "Shaun Fietzek", "time": 1602624624634, "rating": 5.0, "text": "Great looking limos and awesome personality", "pics": null, "resp": {"time": 1602625969012, "text": "Thank you God bless"}, "gmap_id": "0x88928de61f5087a5:0xa247f49282eecf27"}
{"user_id": "104305285567088315029", "name": "Joe Sparks", "time": 1593027558381, "rating": 5.0, "text": "Great Limo service!", "pics": null, "resp": {"time": 1593031273075, "text": "Thank you God bless"}, "gmap_id": "0x88928de61f5087a5:0xa247f49282eecf27"}
{"user_id": "107291715110747915566", "name": "Jennifer Reece", "time": 1566259232317, "rating": 5.0, "text": "Wonderful experience!   Driver made it very easy for us as we had never been to the state.   He was professional and helpful.    He even gave us tour of the city so we could get more acclimated for our trip.   We would recommend 100%!", "pics": null, "resp": {"time": 1566261598492, "text": "Thank you for your kind words. We appreciate you taking time to let others know about your experience. Terry said he thoroughly enjoyed driving you to Tuscaloosa and back. We hope to see you again.\n\nMichael Adlesperger\nWe have"}, "gmap_id": "0x88891bcf81a193ad:0xcf2a62d26eed683d"}
{"user_id": "107448777592944007791", "name": "Stephanie Darnaby", "time": 1573598599060, "rating": 5.0, "text": "Personalized service, timely, and informative. Owner demonstrates REMARKABLE customer service. Thank you for a wonderful experience! Highly recommended!", "pics": null, "resp": {"time": 1573604426944, "text": "Thank you for the very kind words Ms. Darnaby. We hope to serve you again soon.\n\nMichael Adlesperger\nAlabama Sedan"}, "gmap_id": "0x88891bcf81a193ad:0xcf2a62d26eed683d"}
{"user_id": "100117737865864087404", "name": "A SF", "time": 1543188237501, "rating": 5.0, "text": "Professional and prompt service from the owner to the driver. Our driver was excellent and the owner was in communication with us from the beginning to the end to ensure all went well. I highly recommend Alabama Sedan.", "pics": null, "resp": {"time": 1543191385954, "text": "Thank you for your kind words. It's always a special pleasure to serve somebody who recognizes your efforts. We look forward to the next time."}, "gmap_id": "0x88891bcf81a193ad:0xcf2a62d26eed683d"}
{"user_id": "107541460089168285598", "name": "Ameer Hamza", "time": 1553356342522, "rating": 5.0, "text": "Such an amazing service. Ricky came to pick me up and it was my first time in Alabama and I met him and I was like oh sweet home alabama :D", "pics": null, "resp": {"time": 1553355662351, "text": "Thank you for the review Ameer."}, "gmap_id": "0x88891bcf81a193ad:0xcf2a62d26eed683d"}
{"user_id": "109944696491392771796", "name": "Keisha “Keish” Harris", "time": 1479497062654, "rating": 5.0, "text": "Very reliable and professional. He came to my rescue in a matter of minutes, I was extremely impressed. The vehicle was very clean and safe. I definitely recommend this company. Thank you so much", "pics": null, "resp": null, "gmap_id": "0x88891bcf81a193ad:0xcf2a62d26eed683d"}
{"user_id": "104545984490849191598", "name": "Jane Peterson", "time": 1440620756093, "rating": 5.0, "text": "What a great service and driver Michael!  He was so incredibly gracious and quick to respond to my needs to get to the airport.  His price was very competitive and the conversation was comfortable.  Great guy!  I would highly recommend his services!  Very clean and classy car for a great price - or better yet, the same as a cab!  Try him out he's GREAT!!", "pics": null, "resp": null, "gmap_id": "0x88891bcf81a193ad:0xcf2a62d26eed683d"}
{"user_id": "111313277774692910654", "name": "Bobby S.", "time": 1544201895900, "rating": 5.0, "text": "I've used this service twice & I would highly recommend them!  They were on time, very professional and helpful with my luggage.  Enjoyed a nice conversation with our driver both times.  I would use them again in a heartbeat!", "pics": null, "resp": {"time": 1544205814477, "text": "Thank you for the kind words! We enjoy hearing your perspective. We look forward to your next trip."}, "gmap_id": "0x88891bcf81a193ad:0xcf2a62d26eed683d"}
{"user_id": "116442444286902762561", "name": "Dan Zeleniak", "time": 1516488082582, "rating": 5.0, "text": "Fantastic!  Needed a car service on Christmas Eve of all days. Professional. Punctual. Kind. Could not have been more pleased with the service we received.  Well worth the very reasonable price. Worked for us and highly recommend Alabama Sedan. Safe way to get our daughter to the airport.", "pics": null, "resp": {"time": 1516488928560, "text": "Thank you for the Kind words. I enjoyed driving Ann\n\nMichael Adlesperger\nAlabama Sedan"}, "gmap_id": "0x88891bcf81a193ad:0xcf2a62d26eed683d"}
{"user_id": "102517490839332937038", "name": "Lh Franklin", "time": 1489499050789, "rating": 5.0, "text": "Our Department at UAB uses Alabama Sedan quite often.  Michael does a fantastic job.  We use Alabama Sedan Birmingham for all of our recruitment and travel throughout the state.  Michael and all of his drivers are very professional and always on time.  Our visitors always are very complimentary and look forward to seeing him on their next visit.", "pics": null, "resp": {"time": 1489503244867, "text": "Thank you Leslie for the kind words. I always look forward to working with you and the UAB guests. I believe we, as the transportation, are the first and last impression the visitors have of UAB and Birmingham! I love being a part of your process.\n\nMichael Adlesperger\nAlabama Sedan"}, "gmap_id": "0x88891bcf81a193ad:0xcf2a62d26eed683d"}
{"user_id": "116505767263435976656", "name": "Lisa Kendrick", "time": 1500824821410, "rating": 5.0, "text": "Great experience! Excellent customer service - extremely friendly and courteous. Would definitely recommend.", "pics": null, "resp": {"time": 1510528290249, "text": "Thank you Lisa. It was a pleasure to serve you."}, "gmap_id": "0x88891bcf81a193ad:0xcf2a62d26eed683d"}
{"user_id": "113802292514913455352", "name": "Christian M", "time": 1441213392496, "rating": 5.0, "text": "My experiences with Alabama sedan and its driver, Michael, have only been extremely pleasant and positive.  Mr. Michael is on time and courteous, plus his vehicle is always clean.  Mr. Michael always greets me and expresses an interest in my well being.  Thank you!", "pics": null, "resp": null, "gmap_id": "0x88891bcf81a193ad:0xcf2a62d26eed683d"}
{"user_id": "113753452398648501993", "name": "Tad Hill", "time": 1442350904292, "rating": 5.0, "text": "Not only are Michael's vehicles super nice and comfortable, he is a pleasure to be around. He is professional, prompt, and reliable. I can't imagine using anyone else. In fact, I was forced to use a taxi in another city a couple of weeks ago and I couldn't believe that is what I used to do all the time. It was smelly, bumpy and the driver deliberately took me the longest way just to pump up his fare.", "pics": null, "resp": null, "gmap_id": "0x88891bcf81a193ad:0xcf2a62d26eed683d"}
{"user_id": "101233706753110667240", "name": "Anais Ron", "time": 1476760025657, "rating": 5.0, "text": "I am very impressed with this company and it's service. The price was very affordable, the SUV was impeccable and Michael was not only extremely professional but he went above and beyond in customer service. From letting you know he is on his way to reminding you of important things at the airport- even remembering all of our names...truly fantastic experience. Thank you again! :)", "pics": null, "resp": null, "gmap_id": "0x88891bcf81a193ad:0xcf2a62d26eed683d"}
{"user_id": "101162931428615826468", "name": "Tm B", "time": 1499739606410, "rating": 5.0, "text": "I have been using Alabama Sedan for several years now. Excellent service. Very punctional. Always arrives early. They are usually waiting on me when it's time to go. Very professional.\n\nOn top of that, recently, I was severely injured. Had months of going to doctors and recovering. The Alabama Sedan drivers were very sensitive to my injuries, helping me in and out of the car, pulling up close to buildings for me etc. Not to mention their sincere concern. I really don't know what I would've done without them during that time.\n\nThere is not alot of reliable transportation in the Birmingham area. Alabama Sedan has really been a blessing to me.", "pics": null, "resp": {"time": 1499775161024, "text": "Thank you for the very kind words. It's always a pleasure to serve you we're all glad and you're healing from the injuries.  Look forward to seeing you the next time.\n\nMichael Adlesperger\nAlabama Sedan"}, "gmap_id": "0x88891bcf81a193ad:0xcf2a62d26eed683d"}
{"user_id": "118227172976711965598", "name": "Mike Davidson", "time": 1489010893787, "rating": 1.0, "text": "We had a pickup scheduled Sunday. They never arrived. We missed our flight. I guess uber would have been a better option.", "pics": null, "resp": {"time": 1489020372046, "text": "Mr. Davidson\n\nYou must have the wrong company. We have no record of you ever calling, emailing or texting. Please call 205-483-3400 and I will help you figure out which company you should review.\n\nMichael Adlesperger\nAlabama Sedan"}, "gmap_id": "0x88891bcf81a193ad:0xcf2a62d26eed683d"}
{"user_id": "115315071001884278574", "name": "Bryan Greenwald", "time": 1454881728024, "rating": 5.0, "text": "I I had to plan a three day business trip to Birmingham, Alabama.  Having never been there, I was not interested in having to drive between different locations and risk getting lost and being late to meetings.  I found Alabama Sedan on the internet, and reached out to them via email.  Michael called me shortly thereafter and when I explained the various car rides I would require, he was careful to check his calendar to make sure he could accommodate me.\nDuring the trip, Michael was very professional.  He always arrived early- including at the airport, at the hotel, and at the meeting locations.  He was always considerate to text me that he had arrived, but that there was no rush.  And most importantly, he did a great job planning the pickup times that would allow me to arrive at my destination in a timely manner.  There was one trip for which Michael was not available (and for which he had warned me in advance) and the person he arranged as backup was equally professional.\nI don’t plan on returning to Birmingham in the near future, but if I do the first thing I will do is arrange to use Alabama Sedan again.  I would not hesitate to recommend them to anyone who needs car transportation in that area.", "pics": null, "resp": null, "gmap_id": "0x88891bcf81a193ad:0xcf2a62d26eed683d"}
{"user_id": "115606027483971301890", "name": "Kurt Blackmon", "time": 1487814532338, "rating": 5.0, "text": "No complaints at all! The vehicle was very clean and the driver Michael was very professional even had a bottle of water waiting on me! Hands down if you need a ride service in Birmingham these are the guys to call!", "pics": null, "resp": null, "gmap_id": "0x88891bcf81a193ad:0xcf2a62d26eed683d"}
{"user_id": "105632276637231779343", "name": "Paula Faucett", "time": 1489499710586, "rating": 5.0, "text": "AL Sedan is at the TOP in car services.  I use AL Sedan regularly for our out of town visitors at UAB and they never fail to please.  They are always courteous and never have a problem w/ last minute changes (which I have quite often).  I will continue to use AL Sedan and encourage anyone who wants a reliable and courteous car service to do the same.", "pics": null, "resp": {"time": 1489502939663, "text": "Thank you Paula. It is always a pleasure to work with you, and your changes are never a problem.\n\nMichael Adlesperger\nAlabama Sedan"}, "gmap_id": "0x88891bcf81a193ad:0xcf2a62d26eed683d"}
{"user_id": "113006592828367705283", "name": "Thuy tran Nguyen", "time": 1489455744510, "rating": 5.0, "text": "Michael, has been picking me up and take me to Gadsden for years. His company is the ONLY ONE I will use.\n\nJamie.", "pics": null, "resp": {"time": 1489456977503, "text": "Thank you Jamie. It is a pleasure to drive you each time. Hope the new house is finished soon.\n\nMichael"}, "gmap_id": "0x88891bcf81a193ad:0xcf2a62d26eed683d"}
{"user_id": "100736419328646861524", "name": "Craig Hutchison", "time": 1446471063712, "rating": 5.0, "text": "Great professional service. Very comfortable vehicle. Very impressed.", "pics": null, "resp": null, "gmap_id": "0x88891bcf81a193ad:0xcf2a62d26eed683d"}
{"user_id": "109164960373125418958", "name": "Lonni Renee", "time": 1534374276346, "rating": 5.0, "text": "Appreciate your service.", "pics": null, "resp": {"time": 1534389539828, "text": "Thank you Lonni"}, "gmap_id": "0x88891bcf81a193ad:0xcf2a62d26eed683d"}
{"user_id": "101571496460046281231", "name": "Sherry Evans", "time": 1489498573077, "rating": 5.0, "text": "I have been using Michael for years to transport recruits, guest speakers, faculty, etc.  He is fantastic!  I will not use another service.", "pics": null, "resp": {"time": 1489503526741, "text": "Thank you Sherry. It was your kind recommendation regarding my service toward you and the doctor you supported  that got me and eventually Alabama Sedan involved with the UAB Department of Surgery. I appreciate your help and support.\n\nMichael Adlesperger\nAlabama Sedan"}, "gmap_id": "0x88891bcf81a193ad:0xcf2a62d26eed683d"}
{"user_id": "103384223582472956609", "name": "Lori", "time": 1489528638377, "rating": 5.0, "text": "Alabama Sedan is the most professional and efficient car service our office has ever used.  Michael goes above and beyond!", "pics": null, "resp": {"time": 1489529631915, "text": "Thank you for the kind words I wish I knew who to thank directly but I appreciate you taking the time to leave a review whoever you are\n\nMichael Adlesperger\nAlabama Sedan"}, "gmap_id": "0x88891bcf81a193ad:0xcf2a62d26eed683d"}
{"user_id": "109594877787235292657", "name": "Elizabeth Baugh", "time": 1441381262054, "rating": 5.0, "text": "Great service, timely, fair & friendly. I would highly recommend this car service!", "pics": null, "resp": null, "gmap_id": "0x88891bcf81a193ad:0xcf2a62d26eed683d"}
{"user_id": "110533539619270572994", "name": "Yolanda Hogeland", "time": 1489494846195, "rating": 5.0, "text": "Dependable, courteous, and always arrives early.  We will continue to use Michael.", "pics": null, "resp": {"time": 1489503623147, "text": "Thank you Yolanda. The positive support is appreciated.\n\nMichael Adlesperger\nAlabama Sedan"}, "gmap_id": "0x88891bcf81a193ad:0xcf2a62d26eed683d"}
{"user_id": "115689595289900885269", "name": "Pramod Pinnamaneni", "time": 1442258507903, "rating": 5.0, "text": "Great, friendly service!  Very reliable!", "pics": null, "resp": null, "gmap_id": "0x88891bcf81a193ad:0xcf2a62d26eed683d"}
{"user_id": "112049388084511648905", "name": "Steven Mccornack", "time": 1489331826331, "rating": 5.0, "text": "The negative review (\"they never picked us up and we missed our plane\") is FAKE!!!  I have used Alabama Sedan for TWO YEARS now - more than TWO DOZEN TIMES - and EACH and EVERY time they are EARLY!!  Their service is SUPERLATIVE: A+++.   They text me updates for the half-hour before pickup, to ease any possible uncertainty, and text upon their arrival (which averages about 10 minutes early).  Michael and his drivers are friendly, courteous, kind, and helpful, and their vehicles are clean and luxurious.  I use them for ALL my business travel (at least one trip a month), as does my wife, and I have recommended them to numerous colleagues (whose experiences mirror our own).  I also use them for personal travel as well - even in instances where I could just drive to the airport and park - because the experience is so positive.  Over the last two years I have gotten to know Michael well, and he is an honest, dedicated, high-integrity local entrepreneur.  I encourage everyone who needs a lift to the airport - or transport around or out of town in the Birmingham area (e.g., dinner dates out, etc.) - to use his service.  Anyone wishing to verify THIS review as legitimate is more than welcome to contact me - I am Dr. Steven McCornack, and I am a Professor in the Department of Communication Studies at the University of Alabama Birmingham.", "pics": null, "resp": {"time": 1489338985446, "text": "Dr. Mccornack\n\nThank you for the passionate defense of our company. Your loyalty and continued patronage is very appreciated.\n\nMichael Adlesperger\nAlabama Sedan"}, "gmap_id": "0x88891bcf81a193ad:0xcf2a62d26eed683d"}
{"user_id": "101531528861897178144", "name": "Frank Porter", "time": 1454930104966, "rating": 5.0, "text": "Prompt, clean, and friendly. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88891bcf81a193ad:0xcf2a62d26eed683d"}
{"user_id": "103425922334039278433", "name": "Coach Jimmy", "time": 1499722761076, "rating": 5.0, "text": "Great service. ..on time...above and beyond!", "pics": null, "resp": {"time": 1510528363358, "text": "Thank you for the kind words Coach Jimmy. Enjoyed serving your entire family.\n\nMichael Adlesperger"}, "gmap_id": "0x88891bcf81a193ad:0xcf2a62d26eed683d"}
{"user_id": "113351271681019436912", "name": "jdplatham", "time": 1439944068541, "rating": 5.0, "text": "Very professional and pleasant service, highly recommended.", "pics": null, "resp": null, "gmap_id": "0x88891bcf81a193ad:0xcf2a62d26eed683d"}
{"user_id": "102589349298161869975", "name": "Josh Haugse", "time": 1444871525605, "rating": 5.0, "text": "Friendly, on time, and a fair fare.", "pics": null, "resp": null, "gmap_id": "0x88891bcf81a193ad:0xcf2a62d26eed683d"}
{"user_id": "103815596186400535162", "name": "Ian Kinner", "time": 1412793164150, "rating": 5.0, "text": "Excellent service, clean-well maintained limos! Will definitely be calling them again!", "pics": null, "resp": null, "gmap_id": "0x88626b37203e9099:0x16e5b07d11976537"}
{"user_id": "108219386494435359024", "name": "Jamey Freeman", "time": 1596595628512, "rating": 5.0, "text": "Used them for our wedding last weekend.... very professional, very polite, and very accommodating.\nHighly recommend.", "pics": null, "resp": null, "gmap_id": "0x888a3a1fe30fddcd:0xe6b90ce773b63c22"}
{"user_id": "100735123577295228108", "name": "tawanda james", "time": 1590195168273, "rating": 5.0, "text": "Provided me with great adequate service. Will use them again in the near future.", "pics": null, "resp": null, "gmap_id": "0x888a3a1fe30fddcd:0xe6b90ce773b63c22"}
{"user_id": "108934952122598113882", "name": "Sandra B Bumgardner", "time": 1536629678370, "rating": 5.0, "text": "Classic Limo is very dependable for all of your formal event needs!  Highly recommended and always an excellent adventure from pick up to drop off!", "pics": null, "resp": null, "gmap_id": "0x888a3a1fe30fddcd:0xe6b90ce773b63c22"}
{"user_id": "106174630810481020182", "name": "Rachael Phillips", "time": 1536632666650, "rating": 5.0, "text": "Best limo in town! Great people and friendly service.\n5 stars!", "pics": null, "resp": null, "gmap_id": "0x888a3a1fe30fddcd:0xe6b90ce773b63c22"}
{"user_id": "103198149223233625049", "name": "Nathan Martin", "time": 1536627559853, "rating": 5.0, "text": "First class service!\nTruly professional staff!\nArrive safely and in style!", "pics": null, "resp": null, "gmap_id": "0x888a3a1fe30fddcd:0xe6b90ce773b63c22"}
{"user_id": "114123730789582011384", "name": "Brenda Wright", "time": 1567879500802, "rating": 5.0, "text": "Great Company to work with!", "pics": null, "resp": null, "gmap_id": "0x888a3a1fe30fddcd:0xe6b90ce773b63c22"}
{"user_id": "105876530382611308425", "name": "Amber Bickerstaff", "time": 1536629310103, "rating": 5.0, "text": "Best limo service around!", "pics": null, "resp": null, "gmap_id": "0x888a3a1fe30fddcd:0xe6b90ce773b63c22"}
{"user_id": "108607593986563305386", "name": "Gabriel Phillips", "time": 1536633193085, "rating": 5.0, "text": "Definitely recommend", "pics": null, "resp": null, "gmap_id": "0x888a3a1fe30fddcd:0xe6b90ce773b63c22"}
{"user_id": "102716372488678810720", "name": "Eubanks Quarters Farms", "time": 1591483814051, "rating": 5.0, "text": "Micah is awesome . great value", "pics": null, "resp": null, "gmap_id": "0x889a686c08dab557:0xaa517cd39e2e1f41"}
{"user_id": "102081287960428248112", "name": "Ginny Phillips Allen", "time": 1520676449738, "rating": 5.0, "text": "Both new and used pianos, variety of sizes and wood finishes, even exotic. Private lessons available, as well as concert rentals.", "pics": null, "resp": null, "gmap_id": "0x889a686c08dab557:0xaa517cd39e2e1f41"}
