{"user_id": "109035949185807481959", "name": "Leon Vickers", "time": 1622140572523, "rating": 1.0, "text": "Purchased vinyl they didn’t show up until too late to install. Had to call several times to have rescheduled. Finally showed up to install. Installed flooring over AC vent. Still waiting on a call as to when they CAN GET BACK OUT. Weeks now!!!!! Kitchen looks like a huge air pillow!! Terrible customer service. Terrible!!!", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "103697719551870720172", "name": "Victoria Hermann", "time": 1579625830621, "rating": 5.0, "text": "Rock Bottom Carpets was great to work with everyone was friendly. Prices were great and we're happy with how our floors turned out. They were able to install our floors quickly for a fair price. Would recommend.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPrjHKjOtUbxdcILIbGFStGjSj9Aiv4P4otMdno=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "111774413050567282058", "name": "anquiette100", "time": 1625068630739, "rating": 1.0, "text": "Don't use Rock Bottom!!! Never seen such poor quality carpet install.  Carpet wrinkled/buckled in every room they installed it.  looks horrible!", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "110295640646704837025", "name": "Charlotte Ragland", "time": 1618081696863, "rating": 5.0, "text": "THEY'RE THE BEST......I USE THEM ALL THE TIME I LOVE THEM THEY'RE ALWAYS THE ONE FOR ME ALWAYS.......WAY TO GO ROCK BOTTOM KEEP UP THE GOOD WORK 🌝", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "105863898325995251018", "name": "Blake Butler", "time": 1602514669823, "rating": 1.0, "text": "Everything was fine until it was time to do the work.  We wanted vinyl flooring removed and replaced and communicated from the beginning that there were several layers to be removed.  Andy said no problem and we ordered the vinyl and waited a week for the measuring.  After measure they said it would be a little more expensive, which isn't unreasonable.  However, a week later when the crew came to install, they flat out refused to do the work due to possible damage to the sub-floor.  They had a solution to sub-floor damage, but would not do it.  They only offered to put the vinyl down on top of the 4-5 other layers and cut the bottom of the doors.  So now I've wasted 2 weeks when I could've found somebody else to do it.  Extremely frustrated by the lack of communication between sales, measuring crew, and demo/install crews.  Now I own some useless vinyl after they refused to refund me.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "109893755339258672159", "name": "Tyron Newton", "time": 1622899359841, "rating": 5.0, "text": "I love my new luxury vinyl plank flooring.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "108342323075460420581", "name": "Mike Dominick", "time": 1572301318162, "rating": 5.0, "text": "Decent price quick install", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMEW0ckhuVCBj70dRMN_U7fiBdqN7Ak-oNIZg4c=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOj9tGqU3ktt07L-ATkHytvW7wmFjc3MMAoPSgF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOE1RRX-lH5MbfsRkQLBqPTf-giYv0haDhER0-3=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "115932440668585477723", "name": "Angela Schram", "time": 1602765626464, "rating": 1.0, "text": "Not a good place to get carpets. We bought flooring for our house a year ago and I’ve called and left messages several times but the manager will not return my calls to even hear my concerns and get a resolution. Our carpet is pulling everywhere and we’re not happy. Obviously they’re not interested in customer service since they can’t even return a phone call. That’s just bad business. I would not recommend or use them again. There’s plenty of other places around Huntsville that I’m sure would treat their customers better.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "100784408582232941807", "name": "A new life", "time": 1593186600684, "rating": 1.0, "text": "I'm not sure how they stay in business. I'm a small business owner myself. We were to have carpet installed Saturday the 20th when my husband was off work, they did not show up, even after many calls we were told they were still coming. Fast forward to 5:30pm I got home from work and no carpet. I left a message for them to call and let me know what was up. I worked Monday also but have access to my phone, no call. I called on one of my breaks, apparently they don't check their messages because nobody knew anything. I work my small business and a second job, so I work 7 days a week. They told me they could be here Tuesday the 23rd and have the carpet installed by 12 pm so I could be able to keep my appointments in my office in the afternoon as I was off the morning at my second job. That didn't happen. The 2 that came to install didn't have all the materials needed for installation. So they left to get it at 11am and didn't return until 1pm. The job was finished at 2:20pm and I am out $250 for the appointments I had to cancel. And no consideration for my time. I don't recommend using Rock Bottom unless you are at rock bottom.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "107328933852221992075", "name": "Bryan Minchew", "time": 1582036798933, "rating": 1.0, "text": "Do not do business with them. Check the Better Business Bureau first. Look at Face Book. I don't see how their still in business.", "pics": null, "resp": {"time": 1582655597996, "text": "My. Minchew is a disgruntled carpet installer who is no longer working for Rock Bottom Carpets. We wish him well at his next place of employment."}, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "118310378427339966706", "name": "Tyson DeAngelis", "time": 1569755346970, "rating": 5.0, "text": "Good prices. Quick service. Quality install", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "117488409327964166520", "name": "Jody Thomas", "time": 1582035058981, "rating": 3.0, "text": "Edit: they sent a very experienced gentleman out to fix the issues. He removed a\nTool from under the carpet and knocked the tack strips down much better than I could (they first told me to do it) there is something else under the carpet on the steps. But I guess we will have to live with it. Raising my score some after they sent a good person out for fix.\n\nTICKED OFF! THEY WON'T RESPOND OVER AN ISSUE OF SAFETY\n\nSHARP TACKS EVERYWHERE!\nMy 5 year old son can't even play without getting hurt! I'm so mad they don't even want to say anything to me out of the way. It's personal now after my son is bleeding!\n\nSTILL PICKING UP CIGARETTE BUTTS AND WHOLE CIGARETTES DROPPED. I even asked them to picked them up before leaving. We cant even walk through our house barefooted. They left tools and other objects UNDER THE CARPET. Carpet is coming up in areas.", "pics": null, "resp": {"time": 1557923527119, "text": "The issue of tack strip is common. There is tack strip around every wall and at every doorway. This is easily resolved be taking a mallet and knocking the strip down where you step."}, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "111710305579212947773", "name": "Terri French", "time": 1373308231485, "rating": 3.0, "text": "I wouldn't use them again.  They came and installed and left a bit of a mess.  Then when I vacuumed for the first time, my vacuum caught a \"nub\" they had not trimmed and the carpet ran.  They came and put a new piece in which was darker than the original carpeting.  Also, I noticed a dark spot after they left, it felt stiff like glue.  I called and they were supposed to send someone out to look at it but never did.\n\nOk, the mgr called and came out today.  They are going to try to remedy the situation.  So, that does give them major points and if they do a good job, I would certainly reconsider using them again.  Good customer service goes a long way in my book.\n\nThey came out today (a mere week after the mgr called and came out) and relayed the hallway, without piecing it this time. Everything looks good, like it should have the first time.  But, I am pleased and would recommend them.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "109794122877105258083", "name": "A G", "time": 1462465845472, "rating": 5.0, "text": "AWESOME!!! If it isn't right they will make it right! LOVE MY NEW FLOORS!! Thank you Rock Bottom Carpets!! Installers Todd and Clay were the bomb!  Big thank you to the manager Mr. Mark!!!  Thank you thank you thank you!!! Would definitely recommend RBC off Bob Wallace!", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "116758659387049198069", "name": "Marlyse Knezevich", "time": 1556987404922, "rating": 1.0, "text": "Poor customer service.  Was told by sales guy that my husband and I couldn't install the flooring ourselves. Because it was too complicated.  WTH? Shouldn't that be our decision if we pay for the flooring? But he wouldn't give us a price/without installation.", "pics": null, "resp": {"time": 1557922070980, "text": "We also think it would be poor customer service if we did not warn people that the product they were looking at was not a DIY product no matter how good of a handyman her husband thinks he is"}, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "112981894706665285363", "name": "Amelia Hreha", "time": 1434728393217, "rating": 5.0, "text": "I would absolutely use them again. I went in on a Thursday just before closing and our installation was completed the following Tuesday. I had gotten a quote from Lowe's and Home Depot and both were at least 2-4 weeks out and about $400 more expensive for lower quality products. I got a great deal from Rock Bottom Carpets on a quality carpet and with the money I saved was able to afford the best padding offered. Mark and Raj were such a pleasure to work with. They didn't pressure me to purchase anything and answered all my questions about the products. Raj helped me find the best carpet to fit our budget and needs and Mark was quick to respond to any questions or concerns that we had. I'm not sure why anyone would choose to not support their local businesses especially when they provide better products and services.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "101239368762917502384", "name": "Priscilla's African Apparel", "time": 1611366509299, "rating": 5.0, "text": "Great staff", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "109009435443034079445", "name": "Kandy Winsette", "time": 1500323286928, "rating": 1.0, "text": "Installer left a hugh seam visual. Left a mess.\nWhen installer drop carpet on the floor upstairs it caused sheet rock damage to my dining room on first floor under the bedroom. Took pics to RBC they had us email pics so they could turn them in to someone that handles this. He called today and said someone can come back out to fix seam which he agreed was bad. But said his insurance would not cover other damage the installer caused. I wish I could attach my pics so the public could see for yourselves. Would not recommend them to no one.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "107804050498252049842", "name": "Brandie Dorsett", "time": 1531833299683, "rating": 2.0, "text": "The initial customer service was good. But the follow up was not.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "116171310103117214806", "name": "William Gallo", "time": 1449335335618, "rating": 5.0, "text": "I was skeptical at first based on the BBB comments and reviews I saw. We decided to still try it out based on the competitive pricing and the installation timeframe. They did an amazing job. We carpeted two bedrooms and put wood laminate in the office and the guys who installed them were amazingly good. They were clean, well experienced guys. Paul kelley was the installation guy accompanied by klein. I would recommend rock bottom carpets to anyone if they keep using pro guys like the two who did our stuff.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "114443280234166189948", "name": "Sonya Mertz", "time": 1566587534403, "rating": 4.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "109956620326329016220", "name": "Rachel Kepler", "time": 1440102972977, "rating": 1.0, "text": "I will never use them again. Not only did they knowingly send a sick man to my house (he vomited RIGHT IN MY FRONT FLOWER BED!) My husband had to help move the carpet in and out of the house and move the furniture, which I was told moving furniture was only a courtesy and that was after the fact fyi and they left a mess of left over carpet in my bathroom and the tub?!?!. The manager told us, \"well the job he did was good,right?\" BUT YOU SENT A SICK MAN TO MY HOUSE,ALONE. We got nothing,a run around apology was pretty much it and an offer for a discount on future need, UMMMMM,NO. I will never use them again,my husband did half the work and,the installer(sub contractor) was very nice,yet he was sent to do a job even though he was sick and the manager was rude. So,next time,I will go with a company that has empathy for the people they work with and for.", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "105723543530831146087", "name": "Mark Bounds", "time": 1510582453283, "rating": 5.0, "text": "Inexpensive flooring store", "pics": null, "resp": null, "gmap_id": "0x88626cba32d0f155:0xa5b7b15f2e5ac395"}
{"user_id": "103939690930579465759", "name": "Joy Pintovidal", "time": 1624385651340, "rating": 5.0, "text": "We moved here from Colorado and bought an older house. We needed the floors to be completely redone before our furniture arrived within a week. We worked with David Cox and he got our flooring scheduled and completed within the week. The guys worked long hours and did an excellent job. The flooring looks beautiful and the staff was over the top friendly. I would highly recommend them for any flooring job that you need. You will get a high quality job and excellent customer service.", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "104140845922021883219", "name": "Dj Burls", "time": 1620216977938, "rating": 5.0, "text": "I highly recommend Prattville Carpet. They carry quality material which they stand behind and their staff is both friendly and knowledgeable. I purchased their 22mil vinyl flooring which is a commercial grade that you can't view on the floor at the chain stores.", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "107904501006619233408", "name": "Janet Kissane", "time": 1626292122729, "rating": 5.0, "text": "A big THANK YOU to David Cox and his crew of Prattville Carpet!  Great service, great work and I love my new carpet!", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "103748348622716496122", "name": "Tami Gorman", "time": 1619440759808, "rating": 5.0, "text": "Very friendly  great customer service, however my floors have not been installed so I will let you know after that.. I heard they do a wonderful job but I also was told  that they broke a friend of mine's lamp and she had to pay a lot of money to replace it , also they knocked stuff off wall let her to wire back up her tv they should have paid for the lamp !!! but that was her experience not mine...", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "117380284859075873616", "name": "Leah Taylor", "time": 1607484667202, "rating": 5.0, "text": "We had a great experience with Prattville Carpet. David was super friendly and not only helped us pick out exactly what we wanted but was able to help us coordinate a time to get our new flooring in. The staff & David communicated with us throughout the whole process. We absolutely love our new flooring. Thanks David & Prattville Carpet!", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "107553029175112296385", "name": "Jan Sticka", "time": 1585528622004, "rating": 5.0, "text": "The beautiful Mohawk laminate flooring installed by Prattville Carpet. Great customer service from start to finish. Highly recommend them for your flooring needs.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNeqxOXatHIDuJOtPLaoi8iymg8LVTIZHCOA43y=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "117120611443798787042", "name": "Victoria Lowman", "time": 1612460895014, "rating": 5.0, "text": "Great price and very happy with completed floor!!", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "110003917008369891311", "name": "Tina Taylor", "time": 1586140259620, "rating": 5.0, "text": "Terry and team went above and beyond to help me. Terry was able to work around my crazy schedule and  get the job completed, quick, and to perfection. I highly recommend Prattville Carpet. We will definitely be using them again on other projects.", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "105675921166083124568", "name": "Cathee Gipson", "time": 1495465121889, "rating": 5.0, "text": "A master bathroom renovation seemed more than daunting until we reached out to Ray Boles at Prattville Carpet.  His design expertise proved invaluable.  His installers were prompt, courteous, and professional.  His contacts and recommendations for the entire project were beyond helpful.  The process was stress free and fast thanks to Ray and Prattville Carpet.", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "116446196322829226465", "name": "Tracey Cannon", "time": 1558805712910, "rating": 5.0, "text": "Ronnie and David have been fantastic in helping me pick out my floors and shower tile.  I highly recommend Prattville Carpet", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "110172031862463209819", "name": "Chris Jarrett", "time": 1551707636750, "rating": 5.0, "text": "Barry and his team of installers where amazing. From start to finish great job. Barry came to my house after I got off work (well after 6) to show me the samples. Lots of option with zero pressure. They installed quickly and with very little interruption in our lives. On the day of the install I got home from work and thought they hadn't come that's how well they cleaned up. It wasn't even apparent they had been there until I walked in and saw my amazing floors. Zero interest payments for 12 months was a nice bonus.", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "100511141865234058846", "name": "J.K. Jones", "time": 1494463223851, "rating": 5.0, "text": "Prattville Carpet put new tile in our house and did a fantastic job!  From helping us select our tile to the installation,  everyone was great.  They even moved all the furniture!", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "113443639146901200226", "name": "Kelli Hill", "time": 1524758555602, "rating": 5.0, "text": "Prattville Carpet went above and beyond to help me after my house flooded.  New flooring in the living room and bedroom areas and it is gorgeous.  I couldn't be more pleased with the flooring and customer service.", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "109183369016725841693", "name": "Marty Sutley", "time": 1412274812838, "rating": 5.0, "text": "I have had multiple experiences with Prattville Carpet and the Boles family.  They have always been honest and reasonable to deal with.  In an industry such as Floor Covering, it is refreshing to find a business owned and operated by people you can trust to do what they say they will do.  It makes all the difference.", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "114041522895259255541", "name": "Angela Addison", "time": 1554224982456, "rating": 5.0, "text": "Super friendly staff. Prices are reasonable, actually better than competition up the road.", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "117579639395437397980", "name": "Robin Kitchens", "time": 1553362904656, "rating": 5.0, "text": "David was very nice about helping me pick out carpet for my house", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "105415956406803641400", "name": "Gaye Pelkey", "time": 1548365562228, "rating": 5.0, "text": "They put in all new carpet and flooring in rental home..great job and great service..", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
{"user_id": "110303723420445418753", "name": "adam pike", "time": 1545344913268, "rating": 5.0, "text": "Quality service, friendly sales staff!", "pics": null, "resp": null, "gmap_id": "0x888e8e4ab0d6ec1b:0x95c74fff6e9c57b8"}
