{"user_id": "107609359098103305837", "name": "Kristy Clark (Robinson)", "time": 1627005610752, "rating": 4.0, "text": "The apartments are old at least the low income ones are, their outdated i.e. dark paneling on walls, musty smell, etc.\n\nConsidering the price and that water and trash is included, maintenance man on site till 5pm during the week and pest control comes thru once a month and if you go thru the housing authority the rent is based on your income so you really can't beat it!", "pics": null, "resp": null, "gmap_id": "0x888a521b81be6233:0x38c29117d672c8db"}
{"user_id": "114622918028215161199", "name": "k.l. bryant", "time": 1607444067539, "rating": 4.0, "text": "Nice apartments, there are two parts. However this is a quiet complex mostly older people living here. Hickory Run I have just been modeled last year with all new appliances and heat/cooling systems.", "pics": null, "resp": null, "gmap_id": "0x888a521b81be6233:0x38c29117d672c8db"}
{"user_id": "114827089313593281871", "name": "Nigeria Parker", "time": 1592953783911, "rating": 1.0, "text": "I wouldn't dare suggest these apartments. I would rather you go to Jacksonville Housing Authority. The setup is almost the same except you get a front and back yard 1 1/2 bathroom, and no carpet at the housing authority.", "pics": null, "resp": null, "gmap_id": "0x888a521b81be6233:0x38c29117d672c8db"}
{"user_id": "113258994516441580778", "name": "Reign 1982", "time": 1572869227834, "rating": 1.0, "text": "Been here 4 years with my family. Within 4 years we have work orders from move in to date that hasn't been rectified.  Rent has went to $555.00 which is cheap, but not when you have to pay out of pocket to find someone to fix problems in your apartment that maintenance is supposed to fix. We've reached out to Gateway several times, one woman came down and wrote down our work orders.. guess what none are done.. excuses given were they will get to it, or they don't have the staff because they're short handed. When the woman was told about mold she shrugged and said use Clorox, Clorox doesn't remove mold nor stop mold. Currently, we have reached out to Gateway due to more hazardous living and asked them to come out and have someone from Gateway check the mold and they haven't responded. Finally, moving my family after reaching out to appropriate people about our hazardous living with mold, leaks, currently no air again, and oven not working. I promised my family I would move them and that's what I am doing. We are moving under the New Alabama Tenant Law due to hazardous living. This is a family that's been in remission of cancer, has Sarcoid, Lupus, seizures, and asthma. Which MGMT definitely knows. Finally found a way to upload the current pictures.", "pics": null, "resp": null, "gmap_id": "0x888a521b81be6233:0x38c29117d672c8db"}
{"user_id": "117698122113244559389", "name": "dianne hardy", "time": 1575653858903, "rating": 5.0, "text": "All the people are friendly and respectful,  I think that they really get the job done when you need something done, I love it here, the staff is wonderful .", "pics": null, "resp": null, "gmap_id": "0x888a521b81be6233:0x38c29117d672c8db"}
{"user_id": "110778642645137495680", "name": "B Flows", "time": 1496143760092, "rating": 5.0, "text": "Put stepson in apt and was great for him. Clean, inspection, and laundry room separate to avoid humidity or choice to add washer and dryer. Just needed some paint and screws tightened. Great area for quite. In City limits.", "pics": null, "resp": null, "gmap_id": "0x888a521b81be6233:0x38c29117d672c8db"}
{"user_id": "116407813129048879510", "name": "B. H.", "time": 1628124667603, "rating": 5.0, "text": "I have been here on 3 separate occasions, each time I was very impressed with the service & the way the employees treated me.\nI am hearing impaired & read lips, no problem, the employees pulled down their mask!\nI had to give them 5 stars!\nI got turned around today & couldn't find the  office.....\nI called and was given direct directions, street by street & the woman didn't hang up, until I arrived safely at the office!\nTalk about helpful,caring employees!\nThey need a raise!\nIf you want to be treated as a person, not just a number, visit the Anniston Housing Authority!", "pics": null, "resp": null, "gmap_id": "0x888bb3efa9262bd5:0x853cc66b849cfe1"}
{"user_id": "113508656761191983508", "name": "Tomeca Nichols", "time": 1624369626468, "rating": 5.0, "text": "The section 8 manager showed me kindness and assured me that he was there to help.", "pics": null, "resp": null, "gmap_id": "0x888bb3efa9262bd5:0x853cc66b849cfe1"}
{"user_id": "109207177870571727407", "name": "jabree ford", "time": 1623189824899, "rating": 5.0, "text": "Helpful and kind always", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMLeaOVvfRyv19zBZBqPX9NlshbJVv8XU2bCWp1=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888bb3efa9262bd5:0x853cc66b849cfe1"}
{"user_id": "107558611624122829746", "name": "Lilatisha Stef'florence Gunn", "time": 1593363880498, "rating": 5.0, "text": "I wasn't about to share a place bc I haven't gone anywhere. Just thought I'd post a few pics, that's all. Maybe I'll have something more to share later.", "pics": null, "resp": null, "gmap_id": "0x888bb3efa9262bd5:0x853cc66b849cfe1"}
{"user_id": "109872679237985493774", "name": "Tana S Payne", "time": 1597751980834, "rating": 5.0, "text": "Great friendly people to take your application and acts like they really care about you as a person", "pics": null, "resp": null, "gmap_id": "0x888bb3efa9262bd5:0x853cc66b849cfe1"}
{"user_id": "106707088787138828276", "name": "I.O.U", "time": 1465253758834, "rating": 5.0, "text": "They are working on improving the area and bring in revenue and it will be a great place to raise kids it also has a ER near and small stores", "pics": null, "resp": null, "gmap_id": "0x888bb3efa9262bd5:0x853cc66b849cfe1"}
{"user_id": "112400398238472480010", "name": "Chelsey full of life jenkins", "time": 1526414799482, "rating": 4.0, "text": "Great place friendly community affordable housing", "pics": null, "resp": null, "gmap_id": "0x888bb3efa9262bd5:0x853cc66b849cfe1"}
{"user_id": "103428120668233841034", "name": "Sonya Mann", "time": 1540923340808, "rating": 5.0, "text": "Loving atmosphere", "pics": null, "resp": null, "gmap_id": "0x888bb3efa9262bd5:0x853cc66b849cfe1"}
{"user_id": "106204328120920606998", "name": "Nathaniel Whitaker", "time": 1592979772914, "rating": 5.0, "text": "Good security, nice apartments, nice people", "pics": null, "resp": null, "gmap_id": "0x887d49d6575a1af1:0xa5fc199d2f2de122"}
{"user_id": "116533453837290217807", "name": "Traci Domergue", "time": 1626743554338, "rating": 5.0, "text": "I lived thereb3 years. Loved it.", "pics": null, "resp": null, "gmap_id": "0x888a4cd24c56600b:0x6ab73189885edd20"}
{"user_id": "108218162952985468153", "name": "Carolyn Rodgers", "time": 1588715965516, "rating": 1.0, "text": "I agree with some of the other people this is the worst place I've ever lived. You have no privacy 90 percent of the people who live there watch your every move and they run back to the office to tell everything they know. I thought you were only allowed to rent to adults but I was mistaking they act like children I wouldn't live there again if it was free!! There is so much more to say but I will keep it to myself. If you want privacy that isn't the place to live but go and judge for yourself you might like it but I doubt it", "pics": null, "resp": null, "gmap_id": "0x888a4cd24c56600b:0x6ab73189885edd20"}
{"user_id": "117214049383611005898", "name": "Sheryl Williams", "time": 1571551075499, "rating": 1.0, "text": "Worst place you could ever live. It is literally a living nightmare.", "pics": null, "resp": null, "gmap_id": "0x888a4cd24c56600b:0x6ab73189885edd20"}
{"user_id": "110095326063522928081", "name": "Cheryl Stever", "time": 1547000870946, "rating": 5.0, "text": "Nice, clean, great staff", "pics": null, "resp": null, "gmap_id": "0x888a4cd24c56600b:0x6ab73189885edd20"}
{"user_id": "105581295942315543014", "name": "Matthew Sheldon", "time": 1608134661393, "rating": 5.0, "text": "I've worked with quite a few property managers over the years, and I have to say, I genuinely enjoy working with Southern Homes.\n\nThe staff and owner have been nothing but accommodating and thorough in taking care of my properties. They have risen to the challenges as they come up and have gone out of their way in accommodating my properties needs.\n\nHighly recommend.", "pics": null, "resp": null, "gmap_id": "0x88926ef85cb9ee5b:0xf1f025da3bc02d72"}
{"user_id": "114399825191394190151", "name": "colleen merkins", "time": 1598229537557, "rating": 1.0, "text": "Our house has been destroyed under the (mis)management of this company twice. 2018 we paid $35,000 to repair damages and now, in 2020, it will cost another $5,000-$6,000. This does not include the months of rent we are owed. The \"manager\" has never checked on the home nor have the attempted to collect past due rents. The house, which was 2 years old when we turned it over to them is now dilapidated and infested with mice and roaches. The head of the agency is shady and refuses to accept responsibility for his neglect as the person being paid to manage the property. The neighbor's dog could have done a better job of managing my house and I regret ever entrusting our home to this agency.", "pics": null, "resp": null, "gmap_id": "0x88926ef85cb9ee5b:0xf1f025da3bc02d72"}
{"user_id": "105056378504614046560", "name": "William Sanders", "time": 1611091624217, "rating": 5.0, "text": "Would’ve gave him a 10 star review if possible I definitely recommend him for your tax needs", "pics": null, "resp": null, "gmap_id": "0x88926ef85cb9ee5b:0xf1f025da3bc02d72"}
{"user_id": "110177880780633637766", "name": "Carolyn Jones", "time": 1620528641941, "rating": 5.0, "text": "Found exactly what I was looking. Plus something I did not look for but needed.  Love going there. Prices are extremely low and sales are for a worthwhile cause.", "pics": null, "resp": {"time": 1620658280839, "text": "Glad you found some treasures at our store! We are grateful for your support."}, "gmap_id": "0x886285d4e1e1214d:0xf07b7aa2a166db93"}
{"user_id": "105289903123281713218", "name": "April Scott", "time": 1619296959230, "rating": 5.0, "text": "Love this store! I only spent $24.50 and got a whole lot of items that I needed for my kitchen.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPyqu9GKahSaOmZ8sFVz37zSN-YjrrXgnXvuRHk=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886285d4e1e1214d:0xf07b7aa2a166db93"}
{"user_id": "115961909358059827510", "name": "April Scott", "time": 1619297233074, "rating": 5.0, "text": "I love this place! I only spent $24.50 and got all of this stuff that I needed for my kitchen!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPaLzmITjbk3SDUo7JAEAarZhtDzLDUNNFk3x7O=w150-h150-k-no-p"]}], "resp": {"time": 1619446882161, "text": "That's awesome...thanks so much for your support!"}, "gmap_id": "0x886285d4e1e1214d:0xf07b7aa2a166db93"}
{"user_id": "104060632139581855432", "name": "CocoGacha 45", "time": 1614205767741, "rating": 4.0, "text": "Prices are somewhat reasonable for certain items and too expensive for others", "pics": null, "resp": {"time": 1614265079192, "text": "Thanks for shopping with us! Pricing is always a challenge as we seek to find the balance between being fair to our generous donors and providing good value for our customers. Keep in mind that dollars spent in our ReStore support our mission of affordable housing in Morgan County. We appreciate your business!"}, "gmap_id": "0x886285d4e1e1214d:0xf07b7aa2a166db93"}
{"user_id": "114073470475412514230", "name": "B Stanford", "time": 1593368329903, "rating": 5.0, "text": "How can anyone honestly not like this place?    There's random amazing stuff from time to time.   It's one of those places you go when you've got an ongoing project list--and just maybe you'll find something you need.  We've got a couple of fixer-upper bookshelves for under $20, a giant desk for $35, light fixtures and ceiling fans, spray paint, hinges, drawer pulls.", "pics": null, "resp": {"time": 1601913612691, "text": "Awesome! So glad you found some great deals...we really appreciate your support, especially during these challenging times!"}, "gmap_id": "0x886285d4e1e1214d:0xf07b7aa2a166db93"}
{"user_id": "110333071133921873736", "name": "Granny Collins", "time": 1601770465764, "rating": 3.0, "text": "It was a lot bigger than I thought it would be and I had a lot more items I was just looking with my daughter", "pics": null, "resp": {"time": 1601913708014, "text": "Thanks for stopping by. We hope you'll visit us again!"}, "gmap_id": "0x886285d4e1e1214d:0xf07b7aa2a166db93"}
{"user_id": "113457813627596406174", "name": "A Perry", "time": 1594495965346, "rating": 5.0, "text": "Masks and social distancing required. Looks like they have done some organizing.", "pics": null, "resp": {"time": 1594574545725, "text": "Thanks so much...we appreciate your support!"}, "gmap_id": "0x886285d4e1e1214d:0xf07b7aa2a166db93"}
{"user_id": "104138980538650105087", "name": "Brenda Abernathy", "time": 1610821086028, "rating": 5.0, "text": "A great place to go", "pics": null, "resp": {"time": 1611070374430, "text": "Thanks so much for your support. Come back and bring a friend! 😁"}, "gmap_id": "0x886285d4e1e1214d:0xf07b7aa2a166db93"}
{"user_id": "110712072107794998531", "name": "Adam Logan", "time": 1603302737663, "rating": 5.0, "text": "Great stuff for remodeling on a budget", "pics": null, "resp": {"time": 1605720226212, "text": "Thanks so much for your kind words. Please tell your friends and family to come shop with us as well!"}, "gmap_id": "0x886285d4e1e1214d:0xf07b7aa2a166db93"}
{"user_id": "104499831016646093332", "name": "Chris PENNINGTON", "time": 1612974412244, "rating": 5.0, "text": "Great deals!!", "pics": null, "resp": {"time": 1612976050635, "text": "Thank you! Shopping at the ReStore provides much-needed funds for building decent and affordable homes to improve the lives of families in in our community. We appreciate your support."}, "gmap_id": "0x886285d4e1e1214d:0xf07b7aa2a166db93"}
{"user_id": "106284889954206714374", "name": "Erika Mivens", "time": 1600947735010, "rating": 5.0, "text": "Staff is always kind and helpful", "pics": null, "resp": {"time": 1601913685112, "text": "Thanks so much for your kind words and your support!"}, "gmap_id": "0x886285d4e1e1214d:0xf07b7aa2a166db93"}
{"user_id": "104802012274212183481", "name": "Jenifer Beck", "time": 1610824152135, "rating": 1.0, "text": "Prices were high and inventory was low", "pics": null, "resp": {"time": 1611070680320, "text": "Inventory ebbs and flows depending on donations from the community. Pricing is always a challenge. Our goal is to raise funds for affordable housing in our community. We are trying to be fair to both the donor (to show we value their contribution) and to the customer (to provide a good product at a reasonable price). We hope you'll come back again; inventory changes on almost a daily basis!"}, "gmap_id": "0x886285d4e1e1214d:0xf07b7aa2a166db93"}
{"user_id": "115994116474275278578", "name": "Christopher Rainwater", "time": 1620509542360, "rating": 2.0, "text": "Overpriced", "pics": null, "resp": {"time": 1620658227940, "text": "Pricing is always a challenge, and we realize we can't please everyone. But keep in mind that funds from ReStore sales finance Habitat's mission of providing affordable housing to qualified applicants in our community. We appreciate your honest feedback and hope that you'll give us another chance. Inventory changes often, and sales are usually just around the corner!"}, "gmap_id": "0x886285d4e1e1214d:0xf07b7aa2a166db93"}
{"user_id": "102880354856255897784", "name": "Megan Lackey", "time": 1505765718312, "rating": 5.0, "text": "If you are rehabbing a house, or need to furnish one this is a great place to shop. They have everything from books, cds, movies, light fixtures, hardware etc.", "pics": null, "resp": {"time": 1559837557778, "text": "Appliances and furniture, too! Thanks so much for your kind words and support. (We are under new management and are trying to do a better job of replying to comments.) 🙂"}, "gmap_id": "0x886285d4e1e1214d:0xf07b7aa2a166db93"}
{"user_id": "115084040602869157778", "name": "L Marie", "time": 1568469856942, "rating": 1.0, "text": "Not worth going. Prices are ridiculous. I tell anybody that mentions the Restore to just save their time and money and go to Home Depot.", "pics": null, "resp": {"time": 1571664515942, "text": "I'm sorry that you didn't have a good experience at our store. We've had pricing issues in the past and are working to rectify those, but pricing is a \"work in progress\". We try to price things at 50 - 70% off retail, taking into consideration the age and condition of an item. We realize that we will never please everyone, but hope that our customers keep in mind that funds from the ReStore support our mission of providing decent and affordable housing to homebuyers in our community."}, "gmap_id": "0x886285d4e1e1214d:0xf07b7aa2a166db93"}
{"user_id": "101195216469263622946", "name": "james watts", "time": 1574963074732, "rating": 3.0, "text": "Used furniture and appliances", "pics": null, "resp": {"time": 1575315322931, "text": "Thanks for stopping by...we hope to see you again! Our mission at the Decatur Habitat ReStore is to give a new life to great merchandise and to provide a new start for deserving families by creating the necessary funds to supply and build Habitat homes in Morgan County. We appreciate your support of our mission."}, "gmap_id": "0x886285d4e1e1214d:0xf07b7aa2a166db93"}
{"user_id": "111323148693304046516", "name": "Melanie Hanna", "time": 1592579093627, "rating": 3.0, "text": "OVERPRICED!", "pics": null, "resp": {"time": 1592588078079, "text": "We are so sorry to hear that you feel our items are overpriced. Pricing is an ongoing challenge. Please keep in mind that purchases made in the Habitat ReStore are helping us accomplish our mission of building decent and affordable homes for families in need. We understand we can not please everyone with our efforts. We hope you will give us another try."}, "gmap_id": "0x886285d4e1e1214d:0xf07b7aa2a166db93"}
{"user_id": "102753365670222692437", "name": "Donald Jones", "time": 1552673474909, "rating": 4.0, "text": "Some of the things were a little overpriced", "pics": null, "resp": {"time": 1559836862290, "text": "Thanks for visiting our store and for your input. Pricing is an ongoing challenge. We do our best to price items in a way that is both a value to our customers and fair to those who donated the items. We realize we will never please everyone. Please keep in mind that purchases made in the Habitat ReStore are helping us to accomplish our mission of building decent and affordable places for people to call home. (We are under new management and are trying to do a better job of replying to comments.) 🙂"}, "gmap_id": "0x886285d4e1e1214d:0xf07b7aa2a166db93"}
{"user_id": "107703624662067034006", "name": "Kenny Jones", "time": 1531861743618, "rating": 1.0, "text": "They have all kinds of things but will not honor the price on things (found three bifold doors had $10.00 a piece on them guy told me$45.00 was what they was supposed to be like we changed the price) everything where they was at had $10.00 on it told me he was sorry and I told him he was too.", "pics": null, "resp": {"time": 1563467303207, "text": "We apologize for the confusion. We are under new management, and are working to make changes. We hope that you'll stop by again in the near future to check out some of our current deals."}, "gmap_id": "0x886285d4e1e1214d:0xf07b7aa2a166db93"}
{"user_id": "106663005460389939750", "name": "Angial Embry", "time": 1619451089161, "rating": 3.0, "text": "A nice place to stay.", "pics": null, "resp": null, "gmap_id": "0x888bb19897ada75d:0xaff3746c1856e3b1"}
{"user_id": "111553804465523251540", "name": "Benjamin Martin", "time": 1572306918754, "rating": 1.0, "text": "It's a great place to live if you like things falling apart or fixed completely wrong and when you report maintenance issues you get lease violations before you get tbe issues fixed or fixed correctly. One of tbe maintenance guys will take pictures in your home without permission. The office staff are completely rude, racially unfair, unprofessional , and run it like three high school students with petty attitudes towards whoever they feel li that week or in my girlfriend s case the whole time she lived there till 5hey cold heartedly amd unjustly evicted her. Whoever owns this complex should hire a whole different staff desperately.", "pics": null, "resp": null, "gmap_id": "0x888bb19897ada75d:0xaff3746c1856e3b1"}
{"user_id": "118045904818704646670", "name": "reshunna griffin", "time": 1477995064742, "rating": 5.0, "text": "I visit my daughter there and I love it for her and my granddaughter !! Quite environment , very clean and family oriented. Management is very friendly. Has security which puts my mind at ease. Overall great place to live!", "pics": null, "resp": null, "gmap_id": "0x888bb19897ada75d:0xaff3746c1856e3b1"}
{"user_id": "105024284391251311289", "name": "Sammie Crump", "time": 1541293706471, "rating": 5.0, "text": "Kind staff very clean and a pleasant place to live no riff Ralph here", "pics": null, "resp": null, "gmap_id": "0x888bb19897ada75d:0xaff3746c1856e3b1"}
{"user_id": "103100115111752171554", "name": "Alexis Wilson", "time": 1488772513507, "rating": 5.0, "text": "I absolutely enjoy working here and our residents are the best. The best part about working for the #1 property is the amazing staff", "pics": null, "resp": null, "gmap_id": "0x888bb19897ada75d:0xaff3746c1856e3b1"}
{"user_id": "101418477012913268432", "name": "Tamia Curry", "time": 1510611153532, "rating": 3.0, "text": "I live here and its great for quite older people", "pics": null, "resp": null, "gmap_id": "0x888bb19897ada75d:0xaff3746c1856e3b1"}
{"user_id": "104345103807129548004", "name": "Marsolette Gooden", "time": 1517362996647, "rating": 5.0, "text": "There great aprments when I use to live there", "pics": null, "resp": null, "gmap_id": "0x888bb19897ada75d:0xaff3746c1856e3b1"}
{"user_id": "108450186977472191229", "name": "william whitaker", "time": 1504223944901, "rating": 5.0, "text": "Very beautiful town homes very Economical.", "pics": null, "resp": null, "gmap_id": "0x888bb19897ada75d:0xaff3746c1856e3b1"}
{"user_id": "107404595314316563374", "name": "Sully Sammy", "time": 1481039193366, "rating": 1.0, "text": "I put in an application 3 1/2 years ago for me and my now 4 year old daughter, and never heard anything from them. They told me the wait was about 6 months to 1 year.", "pics": null, "resp": null, "gmap_id": "0x888bb19897ada75d:0xaff3746c1856e3b1"}
{"user_id": "116079984433280122312", "name": "Ebony young", "time": 1508413838910, "rating": 1.0, "text": "Old", "pics": null, "resp": null, "gmap_id": "0x888bb19897ada75d:0xaff3746c1856e3b1"}
{"user_id": "109252715032444668321", "name": "randy tidmore", "time": 1488727746447, "rating": 5.0, "text": "Lorri is the best!", "pics": null, "resp": null, "gmap_id": "0x888bb19897ada75d:0xaff3746c1856e3b1"}
{"user_id": "108193746655432847304", "name": "Kimiko Ware", "time": 1504732855472, "rating": 3.0, "text": "Just visiting my cousin.", "pics": null, "resp": null, "gmap_id": "0x888bb19897ada75d:0xaff3746c1856e3b1"}
{"user_id": "110707472248790142030", "name": "Diane “BossLadyDeAnn” Lawson", "time": 1480340813429, "rating": 5.0, "text": "Very quiet and peaceful", "pics": null, "resp": null, "gmap_id": "0x888bb19897ada75d:0xaff3746c1856e3b1"}
{"user_id": "110655280270155684287", "name": "Cat Wallace", "time": 1473017579699, "rating": 5.0, "text": "I love it here!!!", "pics": null, "resp": null, "gmap_id": "0x888bb19897ada75d:0xaff3746c1856e3b1"}
{"user_id": "109727766876248967272", "name": "Zac Benson", "time": 1479993613243, "rating": 5.0, "text": "(Translated by Google) Neibors even stay to them\n\n(Original)\nNeibors stay to them selfs", "pics": null, "resp": null, "gmap_id": "0x888bb19897ada75d:0xaff3746c1856e3b1"}
{"user_id": "106163429207187140163", "name": "Justin Roy", "time": 1452915969518, "rating": 5.0, "text": "(Translated by Google) Iyh\n\n(Original)\nIyh", "pics": null, "resp": null, "gmap_id": "0x888bb19897ada75d:0xaff3746c1856e3b1"}
