{"user_id": "109198003056538408346", "name": "Randy C", "time": 1620871754185, "rating": 5.0, "text": "By far the best therapist for Lymphedema care !\nThis group is the most caring and professional individuals that I have dealt with in many many years.\nIn less than a year they have gotten me back to a normal lifestyle.\nWith there knowledge, experience and always cutting edge techniques and equipment it is always a piece of mine when I visit them.\nI cannot say enough good things about this company and would highly recommend them to any family and friends.", "pics": null, "resp": null, "gmap_id": "0x889a43d7e7b2b7bb:0x94150791e42ed142"}
{"user_id": "114783299586508880856", "name": "Scott Williams", "time": 1619192787172, "rating": 5.0, "text": "I would recommend ETC to anyone. They are very professional and do a great job. They have helped me so much and are the nicest people you'll meet. Especially Amy. THEY  ARE THE BEST!!!", "pics": null, "resp": null, "gmap_id": "0x889a43d7e7b2b7bb:0x94150791e42ed142"}
{"user_id": "104587229118962059370", "name": "Michele Lanham", "time": 1619241103120, "rating": 5.0, "text": "When I came into the office my legs were looking bad.  My therapist got my legs going in the right direction and I feel alot better.  Amy the receptionist is so sweet.  She always say hello and always says something upbeat to me when I leave.  The therapist are like family.    I would recommend Edema Therapy in Daphne.", "pics": null, "resp": null, "gmap_id": "0x889a43d7e7b2b7bb:0x94150791e42ed142"}
{"user_id": "117001263365467342126", "name": "L.Kaiser Kaiser", "time": 1618896766451, "rating": 1.0, "text": "I would not recommend this place to the healthiest person alive, the customer service is absolutely horrific. They will make you wait a month for an appt and then cancel your appt the day before with no notice. The receptionist is incompetent when it comes to establishing new patients. Please please do yourself a favor and do not bother gambling with your health at this establishment....", "pics": null, "resp": null, "gmap_id": "0x889a43d7e7b2b7bb:0x94150791e42ed142"}
{"user_id": "101335517392983015935", "name": "carol hardy", "time": 1603540114979, "rating": 5.0, "text": "I have been going here for about two months now with the best results. My legs have never looked better and it’s due to the knowledge and care I get . Everyone in that office cares about my happiness and I could not be any happier. They are sweet and I enjoy going every morning and actually look forward to it. I could not say enough about this practice. Thank you so much for caring enough for me to be available to help me get better.\n\nCarol", "pics": null, "resp": null, "gmap_id": "0x889a43d7e7b2b7bb:0x94150791e42ed142"}
{"user_id": "108290089893977214466", "name": "patricia ohrt", "time": 1604177125487, "rating": 5.0, "text": "I  started therapy with another group but they were not addressing my edema. Within a month with Edema Therapy I was making awesome progress . Edema therapy knows how to get you on the road to recovery. They evaluate and are able to set up a plan of action so that everyone is working for the same goal. I'm a Registered Nurse and feel that they do outstanding work that is based on science. I would recommend Edema Therapy .", "pics": null, "resp": null, "gmap_id": "0x889a43d7e7b2b7bb:0x94150791e42ed142"}
{"user_id": "111621731038844285540", "name": "diane mauldin", "time": 1602858701707, "rating": 1.0, "text": "Very poor service. I have been waiting for 3 weeks for in home lymphatic drainage therapy w/no results. I indicated to Amy that I would need to reach out to a better home therapy group and she actually recommended to me Kindred Home Therapy. Which I did and I have asked my doctor to refer me to their home health therapy. I would never recommend Edema Therapy to anyone. They have no consideration for someone in pain.", "pics": null, "resp": {"time": 1603297937853, "text": "Our sincerest apologies that you had to wait so long. When you were initially contacted, you were informed that you could come to our clinic for an evaluation and that the wait for in home services would be longer as we are not a home health agency.  Due to COVID-19, the majority of clients are being treated in our Daphne location to ensure a controlled environment. Our company has been serving the local community since 2014 and take pride in our client relationships."}, "gmap_id": "0x889a43d7e7b2b7bb:0x94150791e42ed142"}
{"user_id": "112689336506685477932", "name": "Ray Collins", "time": 1596572186641, "rating": 5.0, "text": "They are an exceptional group of people who are thorough and caring in every aspect of customer care!! So grateful I found them", "pics": null, "resp": null, "gmap_id": "0x889a43d7e7b2b7bb:0x94150791e42ed142"}
{"user_id": "102606041247160515139", "name": "Jill Esterly", "time": 1621772213206, "rating": 5.0, "text": "I have gotten many massages over the years but this was absolutely the best massage I've ever gotten. Hailey listened to all my concerns and applied the amount of pressure I asked for. She focused on the areas I had mentioned were giving me issues. The ambiance was extremely calming, soothing, and relaxing. It was a great experience all around. I will definitely be coming back here.", "pics": null, "resp": {"time": 1621807386104, "text": "We're so happy to hear you had a great experience! We hope to see you back again soon :)"}, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "103899886446719253667", "name": "Brad G", "time": 1610900956078, "rating": 5.0, "text": "Michelle is a caring massage therapist. She's been helping me with my usual aches/pains resulting from a desk job for years.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOpo5LlkHuQMQf7XVT_2mhc062RFtXnz_yO5pE-=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "108246603695600383170", "name": "Leigh Cella", "time": 1617453404484, "rating": 5.0, "text": "I have had many massages over the years. My massage was unlike any massage I have ever received. IT WAS AMAZING! And that does not even come close to how I would describe my massage.\n\nIf you want to feel better contact Abiding Hands Therapy now. Even a day after I still feel the tranquility.\n\nThank you Abiding Hands, thank you\n-Leigh", "pics": null, "resp": {"time": 1617455377749, "text": "Thank you so much for you review! It was such a pleasure to have you in, we are so glad you enjoyed your experience with us!"}, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "110402219248399583429", "name": "Ladonna Allen", "time": 1617232549563, "rating": 5.0, "text": "WOW, what an amazing session I had with Hailee! I have had many, many massages but never one that addressed and relieved so many of my issues. Not only did I leave completely relaxed, but I no longer had a headache and could move my neck and hips without cringing. If you are in need of a therapist that knows how to listen to you and provide the best deep tissue massage ever, then Hailee is your person. I live an hour away but it is certainly worth the trip and can’t wait to return.", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "117535741098653029422", "name": "April Jossey", "time": 1613951062420, "rating": 5.0, "text": "I had the most wonderful massage with Hailee today. I went in with back pain & came out feeling so much better. She was a great listener when I told about my problem areas and she was able to easily find them and successfully work them out. I was so pleased with the experience that I’ve already scheduled my next appointment!", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "107826719736896943525", "name": "Kami Pearson", "time": 1618762295765, "rating": 5.0, "text": "Hailee did a wonderful job! Very convenient location and very relaxing room! Best massage I’ve EVER had! I will definitely be back and I highly recommend it!", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "101691136625489273509", "name": "Tristan Graham", "time": 1615402833718, "rating": 5.0, "text": "I had been driving to Birmingham to receive Myofascial Release Therapy once a week until I was referred to Hailee, and let me tell you that she is INCREDIBLE! I can walk in and just tell her to “fix me” and I leave feeling so much better. She is very knowledgeable, kind and calming. I highly recommend her.", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "110229326915270507552", "name": "Vanita Turner", "time": 1611766514452, "rating": 5.0, "text": "Michelle, thank you for an amazing and perfect massage. It was my first Ashiatsu but will not be the last, you have definitely mastered this technique. The ambience in your therapy room is beautiful and relaxing. I will definitely look forward to my next sessions on future visits to Huntsville.", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "109286593362832872090", "name": "Beth Heflin", "time": 1610895836653, "rating": 5.0, "text": "Michelle is amazing! Best massage I've ever had in my life. She listens and follows through. I don't feel like I've been beaten up. I feel fresh and new and energized! I recommend you make an appointment right away!", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "106993304328660580616", "name": "Jennifer Morgan", "time": 1611098366106, "rating": 5.0, "text": "Michelle gives the best massages! I never had a massage I enjoyed before going to her and now I am a regular customer. She will work just the spots I ask her to so I can get the exact relief and relaxation I need!", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "109699734426907570849", "name": "Fern Brazda", "time": 1611754752393, "rating": 5.0, "text": "I had one of the best massages. I have back problems and my back felt great, I was relaxed in this most comfortable relaxing atmosphere. Feeling relaxed without pain was my main objective and I came home pain free and relaxed! I can’t wait to get another ashiatsu  massage!", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "110666493731955852754", "name": "Travis Nixon", "time": 1614202469767, "rating": 5.0, "text": "I've been seeing Michelle at Abiding Hands for a while now.  When I was playing soccer and dancing regularly my muscles would get really tight and sore.  Michelle worked with me and after a couple of sessions the pain stopped.\n\nI've had massages at other places that hurt and I just figured \"pain = tight muscles leaving the body.\"  But with Michelle, I was surprised at how much release I got with almost no discomfort at all.  I would definitely recommend you give them a visit.", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "115905137686699917055", "name": "james elliott", "time": 1614395638497, "rating": 5.0, "text": "Michelle is absolutely amazing.  I went for a 75 minute ashiatsu and I wish it wouldn’t have ended.  I felt the best I have ever felt and it was an experience I wish everyone would experience.  I highly recommend it.  If you are on the fence then make the appointment and you will not regret it.", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "106781933072110247483", "name": "Rebecca Stephens", "time": 1612957926218, "rating": 5.0, "text": "Michelle is an amazing massage therapist! She's very professional and knowledgeable and cares about her clients. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "108209003081092586187", "name": "Misty Ortiz", "time": 1611628992928, "rating": 5.0, "text": "I have tried several types of massage from many different places over the years and this was one of the best! I saw Michelle for an Ashiatsu massage. The pressure was deep and it was very relaxing and therapeutic!!", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "111880978277115464851", "name": "Jalesia Semien", "time": 1624717118046, "rating": 5.0, "text": "This was an amazing experience and Michelle has wonderful spirit!", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "111445770893624500187", "name": "Lauren Honeycutt", "time": 1610903457823, "rating": 5.0, "text": "Michelle did an amazing job. I was so relaxed during and after the massage. I will be going to her from now on-highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "114609175870959966223", "name": "Mollie Garland", "time": 1610928212820, "rating": 5.0, "text": "Michelle is a wonderful massage therapist!  She has always provided an overall relaxing experience. I highly recommend her!", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "101466948488707156602", "name": "Stacy Pierce", "time": 1611087454120, "rating": 5.0, "text": "Michelle worked with me while I was pregnant. She gives great prenatal massages and is obviously committed to helping all her clients. I would highly recommend her!", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "110926369634597154356", "name": "Rachel Rushing", "time": 1611022415046, "rating": 5.0, "text": "Hailee’s intuitive ability to locate and work areas to release tension is amazing! Hailee combines her knowledge of the body with a flow that relaxes you while healing.", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "110367135919144393842", "name": "Amy Goddard", "time": 1610897725100, "rating": 5.0, "text": "Michelle is a true professional. She knows her field, she cares about her clients, and she provides a warm, enjoyable atmosphere for relaxation. Refreshing is the word best used to describe Michelle and a session with her.", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "105130606888953760622", "name": "Tanya McCune", "time": 1611116353842, "rating": 5.0, "text": "I received a phenomenal massage with Michelle.   Very professional and a superbly relaxing experience", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "118408391425675438986", "name": "Sandy Tebben", "time": 1615763426069, "rating": 5.0, "text": "Hailee is awesome! Very professional, friendly and caring", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "115115159794725074597", "name": "Stacey Hinson", "time": 1610919826848, "rating": 5.0, "text": "Michelle is an amazing Reiki practioner. In all my sessions she has taken great care to guide me through my healing process. She is intuitive and takes time to help me understand everything that comes through. If you are seeking am awesome Reiki practioner look no further...book now you won't regret it!", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "102559054457771174542", "name": "Shelly Carr", "time": 1618084659864, "rating": 5.0, "text": "I was very skeptical about going because of a bad experience a couple of years ago but in desperate need, so glad I went . Hailee was very professional and tended to my needs. I will be a repeat customer!!", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "108848238735565002308", "name": "Ashley Freeman", "time": 1610915475854, "rating": 5.0, "text": "Everyone needs to go see Michele at Abiding Hands Therapy! She is a miracle worker! Wouldn’t go to any other massage therapist!", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
