{"user_id": "110759185806250088438", "name": "Brandy Holladay", "time": 1600644950649, "rating": 5.0, "text": "I have been with Remington 5mnths in Facility Maintenance. I absolutely Love my Job & all the people I work with. I work directly with another lady Noreen who is Amazing. We walk the entire plant so we see people on assembly, production, Maintenance, Engineering & everyone is So nice! It makes a Big Difference when u like the people you work with! I get up in the morning Xcited to go to work! The 1 complaint I have is the attendance/punctuality policy. There is no forgiveness..\nIf your scheduled 6am..you clock in 6:01\nU are late & get 1/2 point! But otherwise I Love working at Remington!!", "pics": null, "resp": null, "gmap_id": "0x88627ab4417207ef:0xe7129644d4debb1f"}
{"user_id": "107823401040151480986", "name": "Fcoon JJ", "time": 1545329369983, "rating": 5.0, "text": "A great work environment, active and kind co workers mostly, and concise instructions on how to do the job overall with minimum co fusion.", "pics": null, "resp": null, "gmap_id": "0x88627ab4417207ef:0xe7129644d4debb1f"}
{"user_id": "105082369407690494638", "name": "cynthia carver", "time": 1544946135553, "rating": 1.0, "text": "I worked there for almost 3 years did my job to the fullest never was late always on time . They even had a board for recognition I was on it this year they hire temps it went downhill from there they fired me November 30 I don’t understand how did everything  They asked I don’t recommend you were there because the good people they don’t care", "pics": null, "resp": null, "gmap_id": "0x88627ab4417207ef:0xe7129644d4debb1f"}
{"user_id": "108169633133748998339", "name": "Carrie M.", "time": 1541349780171, "rating": 1.0, "text": "On September 10th 2018, was an unfair back stabbing day for me working at this place (Remington). An hour after working Mr. Odell came over asked me to follow him so I did, well he walked me up to the front where the Temp Agency Lady awaits to let me know that she ended my assignment with noewarnno of knowing that I'm not supposed to report a problem to the Head person over the company and also saying something about not meeting production which is a Very Big Story as she knew that because I've known her for awhile and for over 23years I've been working for temporary agencies I've not Ever had a Complaint, Write Up nor laid off for that reason. Mr.Odell made a Wonderful Compliment to me on my second full week of working there,i started on the Packing line about one week then I voluntarily moved to Assembly 770 line. I stayed on that line feeling better about the few ones that was working on the line being mature as a work place should be. Well after working on 770 Assembly line for two months or more, Matthew George a young man who has a awful past and was the only one signed up for the position was over that area I worked. He says alot about what he's going to do and doesn't always mark his words, well he heard that I was going to the Head person about him and also another young lady on 770 Assembly line had major issue with him so he came up to me helping with the machine that messes up alot saying out of the blue medleying about me going to the Head person but said nothing to the other young lady. ???? Make this shorter Matthew had me go back to Packing line for like four days training me to do Scopes different ones so I did okay no major mess up as a normal person training well he walked up to a few ones plotted on me the camera will show you that turned them against me and went behind my back and spoke against me in a meeting the same day the Temp Agency Lady ended my assignment,why wasn't I wasn't able to defend myself with the few people on the line I worked the longest on to speak about me. Then Mark Odell spoked against me because he's scared of Matthew George when he Complimented me about my good work. Mannnnn, DO NOT work for Matthew George unless you're going to kiss up to him. He has no Good Remembering Knowledge! He told me after moving me back on the Packing line the same day within 45minutes that \"He knew that I wadnwa going to like it over there', meaning he knew what he was doing to set me up. Second Shift work for Carlos he is a Very Positive Man! Matthew George second Shift, more power to you. I'm at a Better Workplace now Thank God! Temps shouldn't be treated differently!", "pics": null, "resp": null, "gmap_id": "0x88627ab4417207ef:0xe7129644d4debb1f"}
{"user_id": "111747818034066595619", "name": "brian patton", "time": 1484236912134, "rating": 5.0, "text": "Very courteous and professional people.", "pics": null, "resp": null, "gmap_id": "0x88627ab4417207ef:0xe7129644d4debb1f"}
{"user_id": "106004284084308013378", "name": "Jon Eppes", "time": 1523709652817, "rating": 5.0, "text": "Great American company.", "pics": null, "resp": null, "gmap_id": "0x88627ab4417207ef:0xe7129644d4debb1f"}
{"user_id": "107626857535764953639", "name": "Kenny Haynes", "time": 1503968468984, "rating": 5.0, "text": "Great place to work.", "pics": null, "resp": null, "gmap_id": "0x88627ab4417207ef:0xe7129644d4debb1f"}
{"user_id": "101991621586758992178", "name": "Brandon", "time": 1524637261455, "rating": 5.0, "text": "Good place to work", "pics": null, "resp": null, "gmap_id": "0x88627ab4417207ef:0xe7129644d4debb1f"}
{"user_id": "106056174519317318917", "name": "Josh Secrest", "time": 1617227606631, "rating": 5.0, "text": "Reliant from day of purchase communicated weekly update of status, was almost always available for questions every time I called and answered everything thoroughly when needed during the build. Only lack was the assembly manual was out of date but they are updating that and issues the rose from it were handled promptly. Once we finished assembling the oven they were with in the week for having a rep come tune and certify the build, again very thorough and even up to now they are readily available if needed. Oven works great, our business has increased production on a large scale. Thank you and look forward to continued business.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNSvRrbXHn9zjjGQfgtcZBWdW1dic-6dEB3yeks=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPT0KCklUk8RYn0O-kZbxHo1z35hJ2WTVOW3fQb=w150-h150-k-no-p"]}], "resp": {"time": 1617283722141, "text": "The oven looks great! We're glad to hear we were able to help you make a change for the better in your processes. Thank you.-Aaron"}, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "111239891794945525523", "name": "Steven Padilla", "time": 1616621576917, "rating": 5.0, "text": "From start to finish Aaron, with the highest quality customer service, Jeff, the best service tech in all the kingdom, and Reliant Finishing Systems as a whole have been nothing but extraordinary. Starting with delivery of equipment, everything arrived on time with no damage. We opted to put the spray booth and oven up ourselves and with the instructions that came with the equipment, help from Aaron and Jeff, the process was remarkably easy (time consuming, but easy). I can't say enough good things about Reliant Finishing Systems, and if I am lucky enough to expand my powder coating operations in the future, I will definitely call Reliant for my equipment.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNlE_32mrb0u1ZYXCcjr2tUz5Oarn3huIMS9lst=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN6XZp7NFSAIBaHyHsNQsyoPhZYZ0-GCkmRgEGV=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMpOX6eKEa0Wn7omRBYQ2jnmcOabuqiQPUuG-s3=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPjDNkU8c3arb_8VlEX0dR25O__t3B9Jv76C04B=w150-h150-k-no-p"]}], "resp": {"time": 1616694485328, "text": "The pleasure was all ours. Thank you for the kind words and good luck!-Aaron"}, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "106066745186610528861", "name": "David Collett", "time": 1625797860189, "rating": 5.0, "text": "Great experience with Aaron, Kevin, and the guys at reliant.\n\nDelivered a high quality product, sooner than promised, and their service after the sale has been exceptional!\n\nFar exceeded my expectations with how good this oven really is. The only thing I wish I had done different is buy it sooner!\n\nI highly recommend Reliant, you won’t be disappointed!", "pics": null, "resp": {"time": 1625837779027, "text": "It was a pleasure to work with you, David. If we can help with anything just give us a call. -Aaron"}, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "114765019658754335055", "name": "Carl Holden", "time": 1618857104014, "rating": 5.0, "text": "This company is top notch in the finishing equipment manufacturer. Their products have far more quality than competitors and they don't cut corners. I'd suggest that anyone looking to get into powder coating or curing to use this company if they want the best equipment and service.", "pics": null, "resp": null, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "101882668826727299160", "name": "MIKE HEMBREE", "time": 1617239821467, "rating": 5.0, "text": "Excellent company to work with.  Purchased and oven and booth from them. I was very impressed with their follow through from of time of shipping through delivery and support during the set up.\n\nOngoing service has also exceeded my expectations at every level.  Only company I'll buy from now.\n\nMike H.", "pics": null, "resp": {"time": 1617283603983, "text": "Thank you very much. We wish you the best of luck and hope to hear from you again.-Aaron"}, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "114927607310323307159", "name": "Kurt Freitag", "time": 1604791903572, "rating": 5.0, "text": "Reliant Finishing Systems is definitely a superior supplier that provides fantastic service and responsiveness to customers.  We recently made a significant investment of adding a series of new equipment for our company.  The Reliance team performed and delivered excellent service for our company and provided expert advice that assisted our organization to deliver high quality finished products to our customers.  I highly recommend for anyone to use this company and take advantage of the fantastic services and support.  Reliance Finishing delivers as promised and will exceed service expectations.  A true five star organization providing superior customer service to customers.", "pics": null, "resp": {"time": 1604930615666, "text": "It's been a pleasure to work with you, Kurt. Thank you.-Aaron Anderson"}, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "108709651306821741152", "name": "Centerline Steel", "time": 1597978868274, "rating": 5.0, "text": "We purchased our first oven from Reliant in 2016. Due to serious space constraints we needed a custom solution and Reliant delivered. The ovens run for about 10 hours per day, five days a week and they perform flawlessly.\n\nIn 2019, we moved into our new facility. We asked Reliant to move the ovens and powder booth from their original location. The moving crew was knowledgeable, professional and a pleasure to work with. They completely disassembled, moved and reassembled the double ovens and installed a brand new third oven and powder booth over the weekend. No downtime for our production. Impressive!!\n\nWe haven't had any major issues with performance or durability. For the few minor concerns the response and service from Reliant are always spot-on.\n\nWe trust them and recommend them.", "pics": null, "resp": {"time": 1604430772141, "text": "It was a pleasure to work with you and help you realize your business goals. Thank you so much for the review."}, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "112402337682334717729", "name": "JJ Dagorret", "time": 1539800751476, "rating": 5.0, "text": "Great service!  The guys who came to do the installation were great and had it all together in no time!  Very happy with our ovens, spray booth, and the service we get!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMEpb7RTZuXZ_5dgkFSJA_9rlxqz5r6yMxjyJRm=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNh4fru3fKpZf2m0wg51b7ZwutNjSASxX0xsIhi=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN7wdZ2UWVGqfcTMiKztXMvmMnvytOvpwhyC0ct=w150-h150-k-no-p"]}], "resp": {"time": 1600177173762, "text": "JJ, it's been great to see your business grow. Thank you for the kind words.- Aaron Anderson"}, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "114751480385632166954", "name": "Christopher Thompson", "time": 1602608827420, "rating": 5.0, "text": "Reliant Finishing Systems manufactures and sells premium powder coating systems and ovens. Our system has been almost flawless for 5+ years of daily usage. Doug, in the parts department, has helped me maintain and improve our filtration system. Aaron, in customer service, has taken care of us when resolving issues with filters being damaged in transit. Can't say enough about their level of professionalism. Very easy to contact with any issue or question. Highly recommend.", "pics": null, "resp": {"time": 1602609142590, "text": "Great to hear. Thank you for the kind words!"}, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "115340406465161440446", "name": "Kyle Box", "time": 1601254892295, "rating": 5.0, "text": "Great company.  Extremely helpful in configuring your equipment to be sure you have what you need to meet your requirements.  Good installation process and constant communication from start to finish.  Highly recommend!", "pics": null, "resp": {"time": 1601260866952, "text": "Thanks Kyle! We're always glad to be of service. - Bart"}, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "108325172920056683529", "name": "Matt Freitas", "time": 1597086217271, "rating": 5.0, "text": "Great Company, Great Products!  We purchased a large Oven and powder booth from them 5 years ago.  Everything is still running great and they call us on a regular basis to ensure everything is running 100% and always offer their help!", "pics": null, "resp": null, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "104958133150522756180", "name": "Mike Schiavone", "time": 1604429785326, "rating": 5.0, "text": "great people to work with, everything was as they described and on time, work with me to make the oven build very easy and directions were very easy to use, equipment works up to my expections and would use their product again.", "pics": null, "resp": {"time": 1604430703203, "text": "Thank you so much, Mike."}, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "103475531938900332775", "name": "Bill Uline", "time": 1594831785768, "rating": 5.0, "text": "We've had previous experience with other manufacturers prior to using Reliant Finishing Systems.   We had some specific needs and they were not only able to meet those needs but far exceeded our expectation.   Very competitive pricing, exceptional quality, on time delivery and installation and followup.  Everything you would expect from a first rate company.\n\nBill Uline, Signfaces", "pics": null, "resp": {"time": 1600178653564, "text": "Thank you so much, Bill. -Aaron Anderson"}, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "114929728768570549433", "name": "Thomas Welch", "time": 1583194362192, "rating": 5.0, "text": "We are a full metal fab shop in Fairfield, Maine that purchased a 10 ft x 10 ft x 15 ft powder coat oven, powder spray booth, and blasting booth from Reliant. We have been running this system for almost a year and we have absolutely NO complaints! They make a great product,  and more importantly the Customer Service is top notch! We assembled everything,  and whenever we ran into any issues, (which was our issues, not an issue with their product) they were on the other end of the phone with answers. If they didn't have the answers,  they would call back with the answers in a timely manner. Aaron is the man!!! I highly recommend Reliant products!!! When we expand our powder coating capabilities, and we will be, we will definitely be ordering from Reliant again!", "pics": null, "resp": {"time": 1600176700897, "text": "Thanks for the kind words, Tom. I'm glad we were able to help make the process a little easier for you. - Aaron Anderson"}, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "108439781485154435936", "name": "Tom Espo", "time": 1542067337489, "rating": 5.0, "text": "The best of the best! Have had my oven for 7 years now. No issues, great customer service.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPdvpT9Rea-Jk4rc4UslMqUUbIhGNrr4WSMoYeC=w150-h150-k-no-p"]}], "resp": {"time": 1600176959800, "text": "Thanks for the review, Tom!- Aaron Anderson"}, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "111270395018718646499", "name": "brandon seldomridge", "time": 1594940195730, "rating": 5.0, "text": "Relient has been a very professional and helpful company to get my powder coating equipment from.", "pics": null, "resp": null, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "106985624332398020004", "name": "Liquid Metal Concepts", "time": 1595259477997, "rating": 5.0, "text": "Great Company, The installation went just as planned and their machines are top of the line.", "pics": null, "resp": null, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "114859289262591293742", "name": "Jon Galland", "time": 1591794526467, "rating": 5.0, "text": "This company has high quality ovens and their training staff is top notch.", "pics": null, "resp": null, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "107180440501051915746", "name": "Justin Workman", "time": 1554318957043, "rating": 5.0, "text": "We are very pleased with the oven that we purchased. The customer service is outstanding! Reliant makes it a point to stay in touch with us, making sure we are happy. Couldn't ask for a nicer group to deal with.", "pics": null, "resp": null, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "117566993849112182206", "name": "David Lampell", "time": 1539715834370, "rating": 4.0, "text": "Our company operates with a Reliant paint booth and oven to process 100% of our powder coated product. The machines have proven to be reliable and efficient. We run 16 hours a day with minimal maintenance or breakdowns. I am happy with our purchase and the employees have no complaints working with Reliant Finishing equipment.", "pics": null, "resp": null, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "115397407109545781526", "name": "stevew Walker", "time": 1541542099361, "rating": 5.0, "text": "We started the powder coating portion of our business over ten years ago.  From day one, we have been using Reliant Finishing Equipment and have had a great experience with their products. The quality and customer service from Reliant is second to none. On the rare occasion we have had a mechanical issue (while most of the time through our own human error) Reliant has come through for us without fail. They have always gone the extra mile to make sure replacement parts ship the same day, and have consistently made themselves available with their expert troubleshooting advice to get equipment up and running again.\n\nI would recommend Reliant Finishing Equipment to anyone looking for high quality, industrial grade finishing equipment from a company that go above and beyond for their customers.\n\nThank you,\nSteve Walker\nChampion Powder Coating", "pics": null, "resp": {"time": 1600177085239, "text": "Always glad to help. Thanks for the review, Steve.- Aaron Anderson"}, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "103436289471919269614", "name": "wesley dotson", "time": 1521482528104, "rating": 5.0, "text": "I own and operate a reliant system. They are by far the go to system for powder coating. There customer support and helpfulness exceeds your expectations. If I ever have had a question they have always been there to help and follow though with getting me up and running. If you are looking to get into the powder coating business or upgrade your current setup Relient Finishing Systems would be the way to go.", "pics": null, "resp": null, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "114422735471317259425", "name": "Todd Fausett", "time": 1539714982545, "rating": 5.0, "text": "Reliant Finishing Systems was the right choice for our powder Batch Oven , We looked at many other Ovens before we purchased our Reliant Oven and have received nothing but excellent product support thru the whole process until our oven was up and running . we like the fact that all replacement parts are only a phone call away with Reliant's customer support. We purchased our 8x8x20 Batch Oven in 2013 and have 5 yrs of trouble free Operation and our Data Packs are done every six months with zero variations in temp, this Oven is the most accurate Batch system i have seen .When we are ready for bigger oven Reliant will be our only choice", "pics": null, "resp": null, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "112429551875525837099", "name": "Tim Brown", "time": 1554496176232, "rating": 5.0, "text": "Excellent quality and service.  Very good people to deal with when issues arise.", "pics": null, "resp": null, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "111646789650922021051", "name": "kevin green", "time": 1604511181601, "rating": 5.0, "text": "We currently own 3 units.  Easy setup and low maintenance.  What more could you ask for", "pics": null, "resp": {"time": 1600177193378, "text": "Thanks Kevin!- Aaron Anderson"}, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "106898551799563655863", "name": "Makala Gerland", "time": 1544131563972, "rating": 5.0, "text": "Absolutely incredible service. My favorite part is when you're trouble shooting over the phone and you've explained your problem, these guys respond in a professional, calm, and clear manner \"I understand, here's what I want you to do.\" You just can't beat that.", "pics": null, "resp": {"time": 1600176756427, "text": "It's always been a pleasure to work with you and your company. Thank you Makala! - Aaron Anderson"}, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "118098940334814603004", "name": "Mitchael Hernandez", "time": 1597167593961, "rating": 5.0, "text": "Trust that this company will come through when things don't go perfectly.", "pics": null, "resp": null, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "117887619730964011202", "name": "Jim Greene", "time": 1539721143536, "rating": 5.0, "text": "Reliant provided our first oven to use over 6 years ago.  When we needed to expand our operation, both our paint department and upper management agreed to stay with Reliant.  We do not believe nor could we find a company that provided a product with a better ROI.\n\nDr. Jim Greene, P.E.\nPresident\nRichland, LLC", "pics": null, "resp": null, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "106890834293816968931", "name": "Billy Tibbs", "time": 1555707444666, "rating": 5.0, "text": "I bought my first Reliant oven in 2012, my second in 2017, and I'm planning to add a third by 2020. Obviously I'm a happy customer.", "pics": null, "resp": null, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "106122399687137576309", "name": "Forrest Perry", "time": 1539637629110, "rating": 5.0, "text": "I've had the pleasure of working with the team at RFS for nearly 5 years, and I can confidently say that RFS is a true leader in the powder coating equipment manufacturing industry.  They're good people that are committed to treating you right.  Why?  Because, they understand the LIFETIME value of nurturing customer relationships.  Oh yeah... and they build badass equipment too!", "pics": null, "resp": null, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "106859917160645122447", "name": "Bill DePippo", "time": 1539712733965, "rating": 4.0, "text": "Purchased a powder coating oven from Reliant, oven is running great and overall it was a pleasure to do business with them.", "pics": null, "resp": null, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "101414566315205533708", "name": "Bill Gunter", "time": 1539727818910, "rating": 5.0, "text": "Reliant Systems built my large baking oven for my gun work - AWESOME!", "pics": null, "resp": null, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "102376605555831484878", "name": "Bruce DeBoer", "time": 1518625558996, "rating": 1.0, "text": "We purchased a two year old New 8' X 8' X 20' Oven from Gibson Fabrication in Wyoming MI. We love the equipment but at our install of the equipment this week we notice we don't have a manual for the oven to compete the install and testing the controls.\n\nI am very disappointed by the customer service when we called into\nRELIANT that they WILL NOT provide us a manual for us to compete our install of the used new oven. What a run around!!\nAfter calling seven times and getting answers like I have forward your request to a  manager or to a supervisor. Well it has been four days and still no one has called me back.\n\nEveryday i am told that Michael Schuerer (President) is to busy or is not available to take any calls!\nThis does not sound like good customer service in my book. Micheal do you work every day during business hours?\n\nI was planning to buy another oven 12 'X 12' X 30' next year in 2019 but this may have change my mind with RELIANT that dose not seem to have any integrity.", "pics": null, "resp": null, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "116279377745311121705", "name": "William Gregson", "time": 1519922340865, "rating": 4.0, "text": "Very helpful and professional group of people - McAllister Industries.", "pics": null, "resp": null, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "100074791382283365110", "name": "Jason Gallion", "time": 1363203761668, "rating": 5.0, "text": "Amazing delivery time and excellent customer service.", "pics": null, "resp": null, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "103113260619513344205", "name": "Rick Kucera", "time": 1554324078295, "rating": 5.0, "text": "Great to work with", "pics": null, "resp": null, "gmap_id": "0x88627f40b538b8bb:0x4a4853454cdac4f9"}
{"user_id": "103978847729559858335", "name": "fred snyder", "time": 1580341307722, "rating": 5.0, "text": "Thank you Mr. Carson for your friendly, fast and  professional service. I would recommend this to anyone with 5 stars.   It was suggested in the reviews to take exit 13 instead of exit 5A off of the 65 ;  this is a good suggestion.", "pics": null, "resp": null, "gmap_id": "0x889badf4a65960f3:0xf0e397f3434be2fc"}
{"user_id": "112386962132274835967", "name": "Justin Davis", "time": 1539220521005, "rating": 5.0, "text": "Friendly people work hear. Fast unload time. BUT no overnight parking. PS. don't come in off I-65 ext 5-a. Use ext 13.", "pics": null, "resp": null, "gmap_id": "0x889badf4a65960f3:0xf0e397f3434be2fc"}
{"user_id": "106358428413308186965", "name": "Thomas Tolliver", "time": 1592575325260, "rating": 5.0, "text": "Fantastic Machine Shop with great customer service and even better pricing.  Truly a wonderful addition to the Alabama machine and steel services.", "pics": null, "resp": null, "gmap_id": "0x888920781674b659:0xee08794e8ae6adcb"}
{"user_id": "103368122665428357303", "name": "Farontha Booker", "time": 1573844834997, "rating": 3.0, "text": "Super friendly staff was more than helpful to get a driver there.", "pics": null, "resp": null, "gmap_id": "0x888920781674b659:0xee08794e8ae6adcb"}
{"user_id": "109835449971148195538", "name": "James Fowler", "time": 1596352991665, "rating": 3.0, "text": "I deliver pizza for dominoes to this business about. It's honestly not a business that can be reviewed by normal means. Honestly the customers are all pretty big time names, probably sales representatives are the most common type of \"customer\" the place sees. The workers could possibly give it a review. It's a gigantic structure filled with various assembly lines mostly ran by computerized machines", "pics": null, "resp": null, "gmap_id": "0x888eb8917bf7504b:0xc616c51558c6a115"}
{"user_id": "113355103344743399408", "name": "Amy Albright", "time": 1597079982862, "rating": 1.0, "text": "This company says the AMERICAN flag is offensive!! They provide seats for Ford Motor...", "pics": null, "resp": null, "gmap_id": "0x888eb8917bf7504b:0xc616c51558c6a115"}
{"user_id": "105936279241149594093", "name": "Ranbir Singh Braham", "time": 1594637456328, "rating": 5.0, "text": "Very good unloading staff...no time wastage", "pics": null, "resp": null, "gmap_id": "0x888eb8917bf7504b:0xc616c51558c6a115"}
{"user_id": "112089290979473373144", "name": "Prime trucker W-Bailey", "time": 1610381918577, "rating": 5.0, "text": "Fast unload when on time", "pics": null, "resp": null, "gmap_id": "0x888eb8917bf7504b:0xc616c51558c6a115"}
{"user_id": "111435206162362674934", "name": "Jose Cantu", "time": 1594999599866, "rating": 5.0, "text": "Great people get you in and out quick..", "pics": null, "resp": null, "gmap_id": "0x888eb8917bf7504b:0xc616c51558c6a115"}
{"user_id": "103474987491233849088", "name": "Gurpreet Saini", "time": 1592316914848, "rating": 5.0, "text": "coming here from 2014\nvery Good for loading unloading", "pics": null, "resp": null, "gmap_id": "0x888eb8917bf7504b:0xc616c51558c6a115"}
{"user_id": "101648374975832916634", "name": "RAMIZ GUSEINOV", "time": 1613019906803, "rating": 5.0, "text": "Coils unloaded 24/7👍👍👍", "pics": null, "resp": null, "gmap_id": "0x888eb8917bf7504b:0xc616c51558c6a115"}
{"user_id": "110241803871788836371", "name": "*BiZNeSaMeNaCe*", "time": 1594399499358, "rating": 5.0, "text": "Love my job!", "pics": null, "resp": null, "gmap_id": "0x888eb8917bf7504b:0xc616c51558c6a115"}
{"user_id": "107841537697638986301", "name": "Forrest Teague", "time": 1530439885185, "rating": 5.0, "text": "Great place to do business with and an amazing place to work pay is very fair.", "pics": null, "resp": null, "gmap_id": "0x888eb8917bf7504b:0xc616c51558c6a115"}
{"user_id": "105956159203977490694", "name": "Jerez Ttocs", "time": 1529961632472, "rating": 5.0, "text": "Great place to work. Sheree P is the best!", "pics": null, "resp": null, "gmap_id": "0x888eb8917bf7504b:0xc616c51558c6a115"}
{"user_id": "113292305086343040917", "name": "Michael Ochieng", "time": 1567897865731, "rating": 1.0, "text": "Employees in this plant are lazy as hell. They’re never in a hurry to load or unload you.", "pics": null, "resp": null, "gmap_id": "0x888eb8917bf7504b:0xc616c51558c6a115"}
{"user_id": "109818903129880491584", "name": "lelo miliken", "time": 1553921464417, "rating": 4.0, "text": "It's one of our customers as we deliver there quite often. The people I encountered there are friendly.", "pics": null, "resp": null, "gmap_id": "0x888eb8917bf7504b:0xc616c51558c6a115"}
{"user_id": "111765232060070125755", "name": "LaDamian Goree (Goreeboy)", "time": 1464908043347, "rating": 5.0, "text": "This place is huge and it pays temps at a decent starting point.", "pics": null, "resp": null, "gmap_id": "0x888eb8917bf7504b:0xc616c51558c6a115"}
{"user_id": "108397599561463268387", "name": "Mark Hughes", "time": 1541209335147, "rating": 1.0, "text": "Slowest place i ever seen to load a truck and i go to all adients", "pics": null, "resp": null, "gmap_id": "0x888eb8917bf7504b:0xc616c51558c6a115"}
{"user_id": "111133491774639770013", "name": "Bobby Youngs", "time": 1528103492918, "rating": 1.0, "text": "I made a delivery here and I waited 3 hours and nobody showed up to unload me this place is a joke", "pics": null, "resp": null, "gmap_id": "0x888eb8917bf7504b:0xc616c51558c6a115"}
{"user_id": "112194410482579196236", "name": "Kevin Lee", "time": 1549570484586, "rating": 5.0, "text": "Good people work there", "pics": null, "resp": null, "gmap_id": "0x888eb8917bf7504b:0xc616c51558c6a115"}
{"user_id": "101711488484256118608", "name": "Cathy Sallas", "time": 1530128038169, "rating": 4.0, "text": "Work here.  They make metal part of car seats", "pics": null, "resp": null, "gmap_id": "0x888eb8917bf7504b:0xc616c51558c6a115"}
{"user_id": "105996115744666761323", "name": "WastelandWitch", "time": 1543270591142, "rating": 5.0, "text": "Good place for employment!", "pics": null, "resp": null, "gmap_id": "0x888eb8917bf7504b:0xc616c51558c6a115"}
{"user_id": "108047621724204064173", "name": "Muhammad Ali Farooq", "time": 1545145414146, "rating": 1.0, "text": "Denied for washroom", "pics": null, "resp": null, "gmap_id": "0x888eb8917bf7504b:0xc616c51558c6a115"}
{"user_id": "107925764892166020913", "name": "Christopher Grindle", "time": 1541174774263, "rating": 4.0, "text": "Great facility 😃", "pics": null, "resp": null, "gmap_id": "0x888eb8917bf7504b:0xc616c51558c6a115"}
{"user_id": "115918974815225080301", "name": "david lynn", "time": 1545219599847, "rating": 1.0, "text": "Take two to three hours in shiping an receiving its ridiculous should be no more than hour an half", "pics": null, "resp": null, "gmap_id": "0x888eb8917bf7504b:0xc616c51558c6a115"}
{"user_id": "109892551710281479730", "name": "President Kennedy", "time": 1521817478451, "rating": 1.0, "text": "Work There Before The Staff & Supervisors Are Horrible They Act If They Dont Wanna Train You As Being A Temp They Dont Fill You In On All The Information When They Tell Something", "pics": null, "resp": null, "gmap_id": "0x888eb8917bf7504b:0xc616c51558c6a115"}
{"user_id": "104878423745413283625", "name": "Demario Hart", "time": 1550202926304, "rating": 4.0, "text": "Good people", "pics": null, "resp": null, "gmap_id": "0x888eb8917bf7504b:0xc616c51558c6a115"}
{"user_id": "108896925498030598085", "name": "Brandon Cannon", "time": 1539993158949, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x888eb8917bf7504b:0xc616c51558c6a115"}
{"user_id": "115349376346421116348", "name": "Jozef Sekeres", "time": 1553907148679, "rating": 5.0, "text": "Busy I 65", "pics": null, "resp": null, "gmap_id": "0x888eb8917bf7504b:0xc616c51558c6a115"}
{"user_id": "111295657226820460502", "name": "Tim spradlin", "time": 1530089799469, "rating": 4.0, "text": "Good place to work", "pics": null, "resp": null, "gmap_id": "0x888eb8917bf7504b:0xc616c51558c6a115"}
{"user_id": "116874896580450795840", "name": "Greg Gentry", "time": 1531929346906, "rating": 5.0, "text": "(Translated by Google) Employed by Adient.\n\n(Original)\nEmployed by Adient.", "pics": null, "resp": null, "gmap_id": "0x888eb8917bf7504b:0xc616c51558c6a115"}
{"user_id": "117597677215840084740", "name": "Mark", "time": 1610398542755, "rating": 5.0, "text": "I was having problems with my 2014 Dodge 6.7 diesel.  Stopped at City Diesel while traveling from Kentucky to Florida.  They are normally very busy but they got me in the shop and back on the road in just a few hours.  Highly recommend this company if you want top notch work.  My turbo actuator is working perfectly now since it was replaced. The truck pulls great and the exhaust brake works better than ever.\nBig thanks to the crew at City Diesel!!", "pics": null, "resp": null, "gmap_id": "0x886284fc24084d2d:0x43d078e4239c6b69"}
{"user_id": "100605552303638970168", "name": "James Scarbrough", "time": 1612845213239, "rating": 4.0, "text": "Quality work done in a timely manner.", "pics": null, "resp": null, "gmap_id": "0x886284fc24084d2d:0x43d078e4239c6b69"}
{"user_id": "106767345355552591586", "name": "John Blankenship", "time": 1598118132997, "rating": 5.0, "text": "Awesome company to do business with..highly recommend", "pics": null, "resp": {"time": 1598488053648, "text": "Thanks for the feedback! Let us know if we can do anything to help you."}, "gmap_id": "0x886284fc24084d2d:0x43d078e4239c6b69"}
{"user_id": "118276654195508838414", "name": "John Bell II", "time": 1532571512308, "rating": 5.0, "text": "Outstanding work done on my 6.0, Bennett Clark, called and explained what work was done. He is very knowledgeable and explained my engine and it's repair in understandable terms.\nI have been doing business with City Diesel since 1999, they know Diesel engines! They are very honest and reliable , great mechanical business. I can not say enough about them being trustworthy and reputable, I highly recommend City Diesel.", "pics": null, "resp": {"time": 1532638000846, "text": "Thank you for the feedback.  We do appreciate hearing back from our customers.  I'll let Bennett know you were pleased."}, "gmap_id": "0x886284fc24084d2d:0x43d078e4239c6b69"}
{"user_id": "112001656092011680748", "name": "Jane Smith", "time": 1580347998417, "rating": 1.0, "text": "Were supposed to do an entire motor rebuild and instead replaced very few parts new resulting in an engine failure .. terrible costumer service.. just a plain rip off", "pics": null, "resp": {"time": 1580349930138, "text": "Jane Smith, is that the name you did business with us under?  I do not have any record of any transaction and we keep great records.  On the off chance that this is a real review under a pseudonym we keep excellent records and have a good warranty policy and any engine repair we did would be covered by warranty.   I would be happy to sit down with you and go over what was replaced and what warranty options you have.  Of course this would require this to be a legitimate review that has actually done business with us. Having only 3 reviews all of them one star and hundreds if not thousands of miles apart seems suspicious.  In the future I would recommend a more convincing fake name and maybe use a different profile for reviews in New York  and Alabama when you are leaving fictitious reviews."}, "gmap_id": "0x886284fc24084d2d:0x43d078e4239c6b69"}
{"user_id": "107473299568950568670", "name": "Nicfin36", "time": 1539833889996, "rating": 5.0, "text": "Jay did an awesome job fabricating a metal hydraulic line for my tractor. Top notch work. Highly recommended.", "pics": null, "resp": {"time": 1539911068264, "text": "Thank you for the review. We always enjoy feedback good or bad but it's especially nice to hear when we do a good job"}, "gmap_id": "0x886284fc24084d2d:0x43d078e4239c6b69"}
{"user_id": "117853888121919632030", "name": "Jerrid Seiler", "time": 1534009247601, "rating": 5.0, "text": "Best custom hoses to be had. Quality of materials and service is actually 6 star worthy. I have never waited more than  10 minutes for anything.", "pics": null, "resp": null, "gmap_id": "0x886284fc24084d2d:0x43d078e4239c6b69"}
{"user_id": "106932416127479009282", "name": "Jed Hadley", "time": 1548486969828, "rating": 5.0, "text": "Great business! Very nice and knowledgeable anything to do with diesel trucks and equipment.", "pics": null, "resp": null, "gmap_id": "0x886284fc24084d2d:0x43d078e4239c6b69"}
{"user_id": "100746878278120492366", "name": "wade harris", "time": 1548793980534, "rating": 5.0, "text": "Excellent service and great people", "pics": null, "resp": null, "gmap_id": "0x886284fc24084d2d:0x43d078e4239c6b69"}
{"user_id": "112214937909917140458", "name": "Randy Aldridge", "time": 1515847667588, "rating": 5.0, "text": "Been dealing with them over 2o yrs", "pics": null, "resp": null, "gmap_id": "0x886284fc24084d2d:0x43d078e4239c6b69"}
{"user_id": "105654504869960827926", "name": "Dewayne Bowie", "time": 1544187842268, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x886284fc24084d2d:0x43d078e4239c6b69"}
