{"user_id": "105043530135547201290", "name": "Erika Mareth", "time": 1629578388791, "rating": 5.0, "text": "Victoria is so knowledgeable and sweet. She takes the time to talk to my 7 year old and answer his 572973 questions about the same snake or skink. She has really boosted his interest in reptiles. Everybody is always very pleasant. Great displays and a good variety of products, they always have the best prices on frozen and live food. Cannot recommend enough.", "pics": null, "resp": null, "gmap_id": "0x888a2a31fdbea72f:0xbfbfe299c118df70"}
{"user_id": "100013787059366675993", "name": "Minni", "time": 1628600553291, "rating": 5.0, "text": "The employees are very nice and knowledgeable. The owner are very nice also.", "pics": null, "resp": null, "gmap_id": "0x888a2a31fdbea72f:0xbfbfe299c118df70"}
{"user_id": "114191842765215070982", "name": "Jan Johnson", "time": 1623063702776, "rating": 5.0, "text": "Love the people who work here, they make you feel so welcome and are very knowledgeable about all animals.", "pics": null, "resp": null, "gmap_id": "0x888a2a31fdbea72f:0xbfbfe299c118df70"}
{"user_id": "105521458247901721865", "name": "Randle Tibbs", "time": 1623338074284, "rating": 1.0, "text": "Placed order for mailbox on June 3rd. When I had not heard anything by 10th, was told I did not place order until June 8th.\nUntrustworthy company when they will not tell the truth", "pics": null, "resp": null, "gmap_id": "0x888a2a31fdbea72f:0xbfbfe299c118df70"}
{"user_id": "116454733286636631574", "name": "Ashby Jackson", "time": 1597204584127, "rating": 5.0, "text": "I was going to buy the killer bee ball python that they had but I waited to long and it was purchased before I got him.  I told them that I was very interested in getting a killer bee ball python, they immediately looked around and found one for me and I got him.  Customer service is great.  Thank you to all of the staff, they have been great and I will continue to do business with them.", "pics": null, "resp": null, "gmap_id": "0x888a2a31fdbea72f:0xbfbfe299c118df70"}
{"user_id": "114378167612881375067", "name": "Jordan Wise", "time": 1611011728028, "rating": 5.0, "text": "Great service and great selection. Would definitely recommend stopping in.", "pics": null, "resp": null, "gmap_id": "0x888a2a31fdbea72f:0xbfbfe299c118df70"}
{"user_id": "105524855027882469683", "name": "DaKota Franklin", "time": 1612480279938, "rating": 5.0, "text": "Incredibly nice staff and takes great care of their reptiles.", "pics": null, "resp": null, "gmap_id": "0x888a2a31fdbea72f:0xbfbfe299c118df70"}
{"user_id": "112346468317522113693", "name": "Brandy Lett", "time": 1615057985454, "rating": 5.0, "text": "Best store ever to buy your pets from", "pics": null, "resp": null, "gmap_id": "0x888a2a31fdbea72f:0xbfbfe299c118df70"}
{"user_id": "108542784752584907242", "name": "ginger brothers", "time": 1614479218539, "rating": 5.0, "text": "Always friendly", "pics": null, "resp": null, "gmap_id": "0x888a2a31fdbea72f:0xbfbfe299c118df70"}
{"user_id": "103982415511445423352", "name": "Ben Swartz", "time": 1577887547276, "rating": 5.0, "text": "Great customer service and great product.", "pics": null, "resp": null, "gmap_id": "0x888a2a31fdbea72f:0xbfbfe299c118df70"}
{"user_id": "113276620756576654211", "name": "April Wesson", "time": 1560467231012, "rating": 5.0, "text": "Visited today and wow!!! Friendly, helpful , knowledgeable staff.so much to see and great prices!!! We will surely be repeat customers!", "pics": null, "resp": null, "gmap_id": "0x888a2a31fdbea72f:0xbfbfe299c118df70"}
{"user_id": "100348926076167310762", "name": "HD Ryder", "time": 1619196413239, "rating": 1.0, "text": "I did business with New Market Iron Works several times in years past and the product and service was always excellent. Sadly, this is no longer the case.\n\nMy last order was in July of 2020 for small job at which time I paid a substantial deposit.As of mid April 2021 I had not  received the order or a final drawing showing what they designed in response to my comments.  This in spite of numerous requests for it.\n\nQuestions I had about my order status received responses of \"It's a small job\" so it is not at the top of their priorities, or \"We've had problems because of COVID-19\", or \"Your job is probably in powder coat\".\n\nLast year they said the order would probably be delivered in mid December 2020. That would have made delivery 5 1/2 months after the order was placed. Promised responses on status & drawing did not happened.\n\nI expressed my displeasure with my experience with them after waiting for nine and one half months to get what I ordered.  Their response was to cancel the job and refund my deposit.  I received the refund check - taped to the inside of the mailing envelope. Apparently they can't handle constructive criticism.\n\nOverall a terrible experience and I don't recommend this company.", "pics": null, "resp": null, "gmap_id": "0x886215db7a41bf5b:0x4b1dbbd94a7b06fc"}
{"user_id": "107468331730404067159", "name": "Christian Phillips", "time": 1597684866547, "rating": 1.0, "text": "The quality of their work is good, but it doesn't matter if they don't answer the phone or respond to emails.\n\nEdit:  I originally contacted you via phone July 8th.  I would have been in touch sooner, but nobody answered the phone until the third day I called.  The woman that answered the phone told me to Email photos of the mailbox needing replacement.  I did.  I was given a quote of $335 for a mailbox post.  I am not going to send a check for $335 without any form of receipt or order form.  That price information was passed to insurance for reimbursement for the damaged mailbox (a much more pleasant experience than dealing with whoever answers your phones).  The email that was sent on the 23rd was sent by me.  It was requesting that someone from your company call me, since over the course of 15 days I couldn't get through once.  They called back the next week while I was at a job site and unable to place an order.  I asked them to call me back later or the next day and was told \"No.  You'll have to call us back.  We're busy.\". I gave them one more chance when I left a voicemail on the 7th of August.  This was one of two times my call went through.  That was the end of any interaction I had with New Market Iron Works.  They didn't call back over the course of the next week, so I bought a mailbox and post from Lowes instead.", "pics": null, "resp": {"time": 1597675566211, "text": "We replied to your email on 7-23-20 with all the information you requested.  I have forwarded it to you again."}, "gmap_id": "0x886215db7a41bf5b:0x4b1dbbd94a7b06fc"}
{"user_id": "114040256198245066603", "name": "Joshua Irwin", "time": 1598558162558, "rating": 5.0, "text": "Purchased two mailboxes with posts, very helpful and great looking mailboxes.", "pics": null, "resp": null, "gmap_id": "0x886215db7a41bf5b:0x4b1dbbd94a7b06fc"}
{"user_id": "106733693970043113856", "name": "Keepn It reall", "time": 1526669207589, "rating": 5.0, "text": "Nice people. Great quality work.", "pics": null, "resp": null, "gmap_id": "0x886215db7a41bf5b:0x4b1dbbd94a7b06fc"}
