{"user_id": "115833016773315827734", "name": "allie cheek", "time": 1617730380271, "rating": 5.0, "text": "Dr. Ellis is the absolute best. She is so warm and kind. You can absolutely tell that she cares about you. She takes the time to remember little details about your life. Her nurse Lauren is awesome too! She is always smiling and so sweet. Every staff member I’ve interacted with at Bham OBGYN has been so friendly and welcoming. Can’t recommend this office enough.", "pics": null, "resp": null, "gmap_id": "0x88891bb620d590a5:0xc4243a0ec6c2704c"}
{"user_id": "116629090240547161421", "name": "Lisa Potter", "time": 1616171291055, "rating": 1.0, "text": "I have been a long time patient of this office and just had my baby 7 months ago. I love the doctor but I can’t tolerate the behavior of one of the staff named Wendy. I’m not sure why this office no longer wants to prescribe Diflucan but not everyone can take the same thing you want to offer and it be the only choice. Wendy was very rude to me with no manners or professionalism. She told me I had two choices and that was to get something over the counter or do a phone consultation and the second one isn’t an option since we are between insurances and then she hung up on me. It’s pretty bad when you have to go through a Teledoc service to get the medicine you know you have always taken and need. Do better.", "pics": null, "resp": null, "gmap_id": "0x88891bb620d590a5:0xc4243a0ec6c2704c"}
{"user_id": "117412300669522503478", "name": "constance mostillo", "time": 1599912616853, "rating": 1.0, "text": "As I lay in bed this morning with my heavy heart and wrenching gut. I am hurt to the core with visit yesterday with my sixteen year old daughter. She has had some issues with her cycle and I took her to see a doctor that I was not familiar with.  I don't understand how a parent can be a parent and have to go through what I have. I was asked by my daughter not to come in and I respectfully understood that request and stayed out. I also had an appointment so when I was out I asked where she was and my nurse pointed me in that direction.  I calmly walked down to where she and the tech were.  I asked for my daughter and the tech says that she is going to get her some water  she's a upset.  I say \"Water?\" I began to shake knowing what has happened.  I text and call. She answered and I asked to come in. She said no and my hands are tied.  I am asked to sit in the hall as others walked by crying my eyes out. I am told that I have to wait in the main waiting room.  I couldn't bare it so I walked in the hallway crying out to my husband. I am then asked back in so the doctor can try to convince me that I didn't know what is best for my child when I tried to suggest other options. I tried to express how I felt. In return I got a story about his daughter 20 years ago. I was told she's trying to please me.  I had already seen another doctor in that building that I asked questions about how a diet change, supplements, minerals,  and vitamins might be an effective way to help. Yet for this doctor wanting to know what doctor would ever say that.  I understand patient confidence and you were her doctor but I am the one who loves and cares for her on a daily basis. I don't understand how I wasn't even considered. I wasn't unreasonable. I have been a patient in this office for 10 years. And have never felt so belittled in my life. If I could give no stars I would.", "pics": null, "resp": null, "gmap_id": "0x88891bb620d590a5:0xc4243a0ec6c2704c"}
{"user_id": "114228479909545826824", "name": "Jane C", "time": 1596377750985, "rating": 5.0, "text": "Dr Roberts was amazing. He took time to listen to my concerns. The receptionists and the nurses were very friendly. I like the way they organized the patients to ensure a limited number of people in the praxis due to Corona.  Would definitely recommend.", "pics": null, "resp": null, "gmap_id": "0x88891bb620d590a5:0xc4243a0ec6c2704c"}
{"user_id": "116645512174978809693", "name": "Mary Carson Bond", "time": 1596032038676, "rating": 5.0, "text": "I love this place!!!  Dr. Ellis and her nurse are the absolute best and make annual visits a breeze.   The office staff is always welcoming.  They are also taking the best precautions during COVID-19.", "pics": null, "resp": null, "gmap_id": "0x88891bb620d590a5:0xc4243a0ec6c2704c"}
{"user_id": "103826603249889162715", "name": "Sarah Browne", "time": 1611009701465, "rating": 1.0, "text": "If you'd like to feel like you are at the DMV; rushed, spoken rudely to and feeling dismissed by the front staff and the nurses, then this place is for you", "pics": null, "resp": null, "gmap_id": "0x88891bb620d590a5:0xc4243a0ec6c2704c"}
{"user_id": "111996106663836146061", "name": "Abbie Rae", "time": 1575566690739, "rating": 5.0, "text": "Been using this practice for 4-5 years. Dr. McKee is the best hands down! He delivered my first pregnancy and also my second which was twins. Dr. McKee truly cares about his patients, and has always made me feel comfortable and helped with any problems I have had. I am so thankful for him because due to my high risk pregnancies from hypertension with his guidance and care, I now have 3 beautiful healthy babies and had safe deliveries with all.\nThe office staff, ultrasound techs, and nurses are all great too! Everyone is so nice and friendly and I’m so glad I chose this practice as my obgyn. Thank you Dr. McKee, office staff, nurses, and ultrasound techs for always making me feel welcomed and comfortable, you all are awesome!", "pics": null, "resp": null, "gmap_id": "0x88891bb620d590a5:0xc4243a0ec6c2704c"}
{"user_id": "114835478344248926940", "name": "Ashley McMillian", "time": 1597424722115, "rating": 5.0, "text": "Dr. Damrich and his staff was very welcoming and professional. I would highly recommend BOBGYN.....", "pics": null, "resp": null, "gmap_id": "0x88891bb620d590a5:0xc4243a0ec6c2704c"}
{"user_id": "116176496986525792407", "name": "Patti Burgener", "time": 1574841160429, "rating": 5.0, "text": "Everyone is so incredibly helpful.  I would highly recommend this practice to all females.  I am such a worry wart, and they have expedited some tests so I would have answers.  Dr. Orso was extremely nice and very knowledgeable!   I am blessed to have found them.", "pics": null, "resp": null, "gmap_id": "0x88891bb620d590a5:0xc4243a0ec6c2704c"}
{"user_id": "105661752898659364408", "name": "Franchesca Colon", "time": 1625000723692, "rating": 2.0, "text": "50 min wait for a mammogram", "pics": null, "resp": null, "gmap_id": "0x88891bb620d590a5:0xc4243a0ec6c2704c"}
{"user_id": "106449545940366595215", "name": "Rui Zhu", "time": 1570812180495, "rating": 2.0, "text": "Arrived at 9:30am for an appointment at 10am. Nurse got my vitals at 9:55am and send me back to the front waiting room. It is 10:30am and still waiting..... what's the point of making appointments if not sticking to the time?\nUpdate: got in within 5 min after talked to the front office at around 10:45. Dr. came in within 15min after in the room. The visit is over around 11am.", "pics": null, "resp": null, "gmap_id": "0x88891bb620d590a5:0xc4243a0ec6c2704c"}
{"user_id": "111953672264390991975", "name": "Zahida Hall", "time": 1573524977396, "rating": 5.0, "text": "The BEST OBGYN practice in Birmingham. Every doctor is wonderful and the staff is super friendly. I highly recommend this practice and doctors.", "pics": null, "resp": null, "gmap_id": "0x88891bb620d590a5:0xc4243a0ec6c2704c"}
{"user_id": "106313675420118400260", "name": "Lindsey Hamrick", "time": 1542057933925, "rating": 5.0, "text": "The entire staff was great! I didn't wait more than 10 minutes to be seen. I was very impressed. Dr. Carter and her nurse Kayla were wonderful! I would definitely recommend them.", "pics": null, "resp": null, "gmap_id": "0x88891bb620d590a5:0xc4243a0ec6c2704c"}
{"user_id": "106120215803627551336", "name": "Amanda Hill", "time": 1528203034476, "rating": 5.0, "text": "I've been using this office for 10 years. I love the staff and doctors. I think I've seen all the doctors here through checkups and the birth of my first son 10 yrs ago. For the past 9 months, I've been seeing Dr. Roberts. He delivered my son last Friday. Dr. Roberts is great.", "pics": null, "resp": null, "gmap_id": "0x88891bb620d590a5:0xc4243a0ec6c2704c"}
{"user_id": "111010106080914176436", "name": "A Robin", "time": 1569324752382, "rating": 2.0, "text": "The staff was very nice.  The physician I saw while I was pregnant was disappointing / disengaged.  I am currently looking for a surrogate because I have such a great of a similar experience in the future.", "pics": null, "resp": null, "gmap_id": "0x88891bb620d590a5:0xc4243a0ec6c2704c"}
{"user_id": "118436144181704917516", "name": "A. Loving", "time": 1576598076396, "rating": 1.0, "text": "I was an refferel by a co- worker who assured me Dr. McKee was an amazing and kind man. My experience was horrible. Dr. McKee didnt even look at my records that were transferred  over by my previous doctor and retook the same bloodwork she did . He was very negative and harsh. He looked at me as a another statistics. Another  Black, older, overweight, uneducated pregnant woman. He didnt look at me as a person. He assumed I would develop all these issues throughout my pregnancy ,seems like he just wants to do a cesarean to get more money. Little did he know that I eat healthy and exercise everyday and he was telling me nothing I didnt already know because I do my research which if  he would have actually gotten to know me and actually cared who i was as a person. The best experience i had was the staff and the nurse who did my ultrasound. Such a shame I had to tell my co worker that my experience  was nothing like hers and she was very disappointed and spent the whole day apologizing to me. Now my co worker is high risk pregnancy and overweight. Its funny that she said he never mentioned her being overweight.She was very surprised that he clearly jumped on me about being overweight. The sad part is my coworker is white so that leaves me to feel as if it was because of my race. I will not be returning. I would like to thank all of the staff for their support and kindness it made my visit not a complete loss being that it is my first pregnancy.", "pics": null, "resp": null, "gmap_id": "0x88891bb620d590a5:0xc4243a0ec6c2704c"}
{"user_id": "100368354016237392984", "name": "beth eleanor", "time": 1502571400604, "rating": 4.0, "text": "Parking at St. Vincent's is a nightmare, but that's not the office's fault. I've had only wonderful experiences with my doctor (Dr. Carter) and the staff. They are friendly, timely and helpful if you have any questions. My only qualm would be the fact that each individual doctor's nurse has to make their appointments, and more often than not they aren't around to answer your call right away, but they always get back in a timely manner.", "pics": null, "resp": null, "gmap_id": "0x88891bb620d590a5:0xc4243a0ec6c2704c"}
{"user_id": "102528021786179978338", "name": "Victoria Bearden", "time": 1500570504868, "rating": 1.0, "text": "The doctors are wonderful. However, the billing office will go through extraordinary lengths to get a payment from you. They are rude and they lie. The collection agency will give out your personal information to get in touch with you and then will lie on what the amount they will take. The collection agency was confronted by the business office and lied again. Also, the billing office will mark your chart where you can't be seen regardless of issue, even pregnant. Worst billing office I have ever had to deal with. The afternoon appointments waiting periods are awful too.", "pics": null, "resp": null, "gmap_id": "0x88891bb620d590a5:0xc4243a0ec6c2704c"}
{"user_id": "108547373885062876317", "name": "Ashley Mccaig", "time": 1524075685762, "rating": 5.0, "text": "Reading these reviews, the place seems horrible but I see Dr. Damrich and that man is a sweetheart. I am always very well taken care of and even when he was out of the office and I had to be seen by his partners, they were very kind. Parking is a nightmare but that's the hospital in general.  If you are looking into this practice I would 100/100 recommend David Damrich. He delivered my baby boy and a few of my friends babies and everything was as perfect as child birth can be.", "pics": null, "resp": null, "gmap_id": "0x88891bb620d590a5:0xc4243a0ec6c2704c"}
{"user_id": "115592825932312521879", "name": "Selena Rodriguez", "time": 1528485797333, "rating": 5.0, "text": "Dr. Leigh Wenzel Is The Sweetest! She Made Me Feel Very Comfortable. My First Time Here &’ Had A Great Experience, The Staff Was Very Friendly! I Recommend Dr. Wenzel!", "pics": null, "resp": null, "gmap_id": "0x88891bb620d590a5:0xc4243a0ec6c2704c"}
{"user_id": "104919257806695040158", "name": "Stacy Christensen", "time": 1455599217689, "rating": 5.0, "text": "I absolutely love my Dr.M Christine!  I had a bad experience with an other physician and she restored my faith in the group.  I have seen Dr. Christine for over 3 years now, never had an issue!  I guess it's all in who you choose!", "pics": null, "resp": null, "gmap_id": "0x88891bb620d590a5:0xc4243a0ec6c2704c"}
{"user_id": "108480126937506083374", "name": "Carol Churchill", "time": 1554814306069, "rating": 3.0, "text": "Felt like a car wash. Didn’t listen to any of my concerns or needs, just did the Pap smear and the doctor was proud of how quick the appointment went. I was not impressed that my yearly was so rushed and the doctor was condescending when I asked about different treatments. They only care about pushing numbers here not the actual patient.", "pics": null, "resp": null, "gmap_id": "0x88891bb620d590a5:0xc4243a0ec6c2704c"}
{"user_id": "116782789722297178238", "name": "K C (LakeLover)", "time": 1545078290800, "rating": 5.0, "text": "Loved Dr Davis. All of the staff were so nice and super efficient!", "pics": null, "resp": null, "gmap_id": "0x88891bb620d590a5:0xc4243a0ec6c2704c"}
{"user_id": "115391673813435344025", "name": "Jen Smith", "time": 1500303322967, "rating": 3.0, "text": "Parking is a pain. Christine is nice but always always late. I loved Dr. Ellis. My biggest frustration is that Dr. McKee was on call and delivered my son and yelled at me to shut up while I was giving birth then yelled at my Doula who is also a personal friend. Stay away from that guy.", "pics": null, "resp": null, "gmap_id": "0x88891bb620d590a5:0xc4243a0ec6c2704c"}
{"user_id": "112406276004277322172", "name": "lauren tancock", "time": 1498760357146, "rating": 5.0, "text": "I really don't understand how this place has a low rating. Baffling. The staff has never been anything but kind and courteous to me, they've even taken me back when I arrived to an appointment an hour EARLY (by accident, totally my fault but they were great and didn't make me feel like I was being a inconvenience at all). I'm an OB patient and I see Dr Przybysz who is  the most understanding and calming OB ever! Anything I've wanted or needed they provided to me and they've fit me in when I needed without frustration or judgement. Professional, courteous, and fun- I'm so glad I chose this place to bring my baby into the world!", "pics": null, "resp": null, "gmap_id": "0x88891bb620d590a5:0xc4243a0ec6c2704c"}
{"user_id": "117109777971042339383", "name": "Kelley Crowley", "time": 1513878015446, "rating": 5.0, "text": "The staff is knowledgable and friendly. Dr. Carter and Dr. Roberts are both excellent!", "pics": null, "resp": null, "gmap_id": "0x88891bb620d590a5:0xc4243a0ec6c2704c"}
{"user_id": "109288476366977094493", "name": "Britt Hendrix", "time": 1395433222773, "rating": 1.0, "text": "Terrible. I walked out after 2 hours and no one could figure out how to refund my copay that was collected up front. Ruined my day off. And got nothing done. Never even saw a doctor. Then they told me I'd better stay because I might have cancer. What???", "pics": null, "resp": null, "gmap_id": "0x88891bb620d590a5:0xc4243a0ec6c2704c"}
{"user_id": "102365415877729485560", "name": "Linda stewart", "time": 1530046744869, "rating": 2.0, "text": "I can’t reach the front desk to make an  appointment. I’ve left 2 msgs  and no one has returned my call", "pics": null, "resp": null, "gmap_id": "0x88891bb620d590a5:0xc4243a0ec6c2704c"}
{"user_id": "109270816658955721874", "name": "Katrina Bowie", "time": 1445653545274, "rating": 1.0, "text": "The absolute worst appointment I have ever had with a doctor. I had an appointment at 4:00pm. Dr. Orso tried to cancel my appointment six minutes before I arrived. Once I arrive at my appointment, I met a young lady in the waiting room that mentioned that she had been waiting 45 minutes for her appointment. After I was called back and the usual weight and lab, I was supposed to have a consult with Dr. Orso. He refused to have a consult with me. My entire appointment he kept looking down at his watch saying I have somewhere I have to be. I felt I was a inconvenience. No patient should ever feel this way. Especially for an appointment that has been made for over a month. He should have called and rescheduled my appointment since he was \"so busy\". Finally, the young lady from the lobby was seen by him, because the doctor she was supposed to see had left for the day.  This will probably get deleted. But this is my truth about Birmingham OBGYN.", "pics": null, "resp": null, "gmap_id": "0x88891bb620d590a5:0xc4243a0ec6c2704c"}
{"user_id": "113072160715120524030", "name": "Tatyana Frazier", "time": 1543689159680, "rating": 1.0, "text": "Was trying to get an appointment for a week, they don’t pick up the phone and don’t call back.", "pics": null, "resp": null, "gmap_id": "0x88891bb620d590a5:0xc4243a0ec6c2704c"}
{"user_id": "117408442074502621470", "name": "Anne Murray", "time": 1467155290123, "rating": 1.0, "text": "Bad. waited 4 mos for an appt. then the dr. spent less then 5 min. with me, tests were done but trying to get the nurse to respond to msgs  regarding results over patient portal was horrible. I will not go back", "pics": null, "resp": null, "gmap_id": "0x88891bb620d590a5:0xc4243a0ec6c2704c"}
{"user_id": "104149039205893119268", "name": "Jamesya Hasan", "time": 1536851436941, "rating": 1.0, "text": "Good luck trying to get an appointment", "pics": null, "resp": null, "gmap_id": "0x88891bb620d590a5:0xc4243a0ec6c2704c"}
{"user_id": "114298792267786980438", "name": "Gregory Nicholas", "time": 1419872556329, "rating": 5.0, "text": "They rock. Great  Dr's", "pics": null, "resp": null, "gmap_id": "0x88891bb620d590a5:0xc4243a0ec6c2704c"}
{"user_id": "105606727293312010457", "name": "Michael Johnson", "time": 1629303919274, "rating": 5.0, "text": "I needed to have two recent exams from this office and the staff and techs could not have been more courteous or helpful.  I was seen in a timely manner for both exams and was treated with care and respect by both techs I came in contact with.", "pics": null, "resp": {"time": 1629380944328, "text": "Everyone’s time is important so we strive to help our patients get back to their day quickly while still providing exceptional care."}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "108392362009937469151", "name": "Bradley Moss", "time": 1629489825911, "rating": 5.0, "text": "I interact with this staff on a daily basis and always find each staff member going above and beyond the call of duty to exceed the customer service expectations of those served. Feedback from patients served regarding the care and services delivered by this Team is amazing.", "pics": null, "resp": null, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "117339453867694611996", "name": "Meagan Hirt", "time": 1629123467515, "rating": 5.0, "text": "I had a chance to interact with their operations manager and administrator and they are beyond delightful! Their welcoming and willing personalities certainly permeate throughout their center because everyone is awesome!", "pics": null, "resp": {"time": 1629380840370, "text": "Our team puts patients first and we’re glad our team’s dedication to providing an elevated experience is showing!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "106562259216624605234", "name": "Chelsea Pickett", "time": 1621340371129, "rating": 5.0, "text": "A+ experience. Deborah called to let me know the cost a day ahead of time and was quick with the paperwork day of. Didn't wait too long before going back to prep for the CT scan. John went above and beyond to make sure I was prepared and comfortable (even offered a warm blanket!). Overall the process took about an hour, faster than my original estimate at Huntsville Hospital.", "pics": null, "resp": {"time": 1621626022184, "text": "We know everyone likes to save and every patient deserves to know, in advance, how much their healthcare will cost. We believe in price transparency and show our affordable imaging costs on our website at  https://odcalabama.com/value-finance/"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "117812405147533893989", "name": "Tammy Mendoza", "time": 1614375722728, "rating": 5.0, "text": "My mom, 78 years old, doesn't always get around well and doesn't hear well.  She came home and asked that I do a review and let everyone know how great Jerry was with her.. Patient and kind.  Thank you for being nice to the elderly and not just getting frustrated with them.  This daughter greatly appreciates it.", "pics": null, "resp": {"time": 1614714876852, "text": "It is our privilege to provide imaging services and our team works hard to make it a good experience. When we hear we’ve done it well, it makes our day!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "114106712849861228396", "name": "Beth Allen", "time": 1620353844038, "rating": 1.0, "text": "I went to my physician the morning of my mri of my brain to get a Valium and went to my appointment at 1:00 and there were at least 7 people in the waiting room!!!! Never have seen that before!!! I accidentally took my old Blue Cross card and the girl at the front was figuring my cost without Insurance(over $500.00)!!!! This has happened before and if there is a problem the offices call B/C B/S and should be handled within a couple of minutes!!! I guess her fingers were hurting because she never offered any help!!!! Even if I had the current card the Valium would would have worn off by the time I would have the MRI!!!!! Horrible experience especially driving 30 minutes to get there!!!!!!!!", "pics": null, "resp": {"time": 1620412441187, "text": "There’s nothing we value more than feedback – even if it tells us we didn’t meet expectations. That’s how we know where to focus our efforts. Our Administrator, Brad, can be reached at 256-534-5600 to discuss any patients’ specific concerns."}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "104093130989591707527", "name": "Robert Dixon", "time": 1616625643691, "rating": 5.0, "text": "The Administrative Staff and Amber, my\nX RAY Technician were highly professional and provided me outstanding customer service during my visit. They were very courteous and my visit was very pleasant.", "pics": null, "resp": {"time": 1617199285007, "text": "Our team puts patients first and we’re glad our team’s dedication to providing an elevated experience is showing!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "117685975875496988496", "name": "Benjamin Schwartz", "time": 1604689199707, "rating": 5.0, "text": "Scheduling was very easy, they let me know prior to my appointment how much it would cost, the wait time was short, and the staff was very friendly. My tech, John, kept my informed the entire time and made sure I was comfortable.", "pics": null, "resp": {"time": 1614714944726, "text": "We always love to hear positive feedback. Providing an elevated experience for every patient who chooses us is the goal of each of our team members."}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "109551950413791403300", "name": "Joe Suede", "time": 1556201367691, "rating": 5.0, "text": "Ms. Laura was fast and fantastic. I did not wait long at all and Ms. Laura ensured that we got the proper picture that she knew my specific doctor wanted to see. Highly recommend and will be back next time I need a x-ray.", "pics": null, "resp": {"time": 1557418756119, "text": "Thank you, Joe!! We really appreciate your positive feedback! Have an awesome day!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "114986822846832037109", "name": "Dianne Holder", "time": 1559009470941, "rating": 5.0, "text": "I had a CT Scan on 5-24-19 John was my Technologist he did a amazing job. The patient Care Coordinator was Cawanna , Excellent! You have a wonderful staff.", "pics": null, "resp": {"time": 1559073459340, "text": "Dianne, thank you for your kind words! We appreciate you!!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "110624729509294808672", "name": "N B", "time": 1541713226542, "rating": 1.0, "text": "Went for an ultrasound to diagnose a time sensitive condition.  Was told that the results would immediately be sent in for review and I would get a call from the doctor.  The next day, still no call.  After talking with three people, it was discovered that they never bothered to send the results in for review.  Staff friendly enough but that amounts to nothing when you cannot be bothered to do your job.", "pics": null, "resp": null, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "100513396439572917461", "name": "Janet Jones", "time": 1576885675590, "rating": 5.0, "text": "My daughter went in for a test and everyone was very friendly and professional and the appointment went quickly!", "pics": null, "resp": {"time": 1577379200250, "text": "Thanks so much for the kind review!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "113255707023435743415", "name": "Jaime 0212", "time": 1570558834508, "rating": 5.0, "text": "Amazing experience having my mammogram done by Amanda at the Hughes location.  I will never go back to the Breast Center.", "pics": null, "resp": {"time": 1571956602186, "text": "Thank you, Jamie!!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "114025028233521867557", "name": "Neil Young", "time": 1536782368783, "rating": 4.0, "text": "Went for an ultrasound and the staff was very nice and helpful.  The lady at the desk was nice and the lady that did the ultrasound was extremely nice as well. They got me in and out fast.", "pics": null, "resp": {"time": 1537369066718, "text": "Neil, thank you for taking time to give us your feedback. We appreciate you!!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "111527781428769942211", "name": "NoK Wolf", "time": 1544140823651, "rating": 4.0, "text": "They are good to call you and let you know stuff  but I'm tying confirm an appt based on their last call by calling them and I've been on 'hold' for 28 minutes,and been on hold 35 minutes earlier this morning before I gave up. They need more admin staff.\nEdit. After I arrived it was a very quick process, less than 1hr from start to finish.", "pics": null, "resp": {"time": 1544213473261, "text": "We appreciate your honest feedback. Thank you for taking the time to let us know how we can serve you better. Have a great weekend!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "108152041962050645342", "name": "Jayla Carter", "time": 1549904734704, "rating": 1.0, "text": "I called in and asked for about an appointment since I never received a call to get scheduled. I was told I didn’t need an appointment and to just walk in. I get there and watch 3 ppl go in before me. Got the excuse that ppl with appointments go before me. This is ridiculous and unfair. Others were called and scheduled, I have to wait and I’m having to suffer because I was apparently given the wrong information. My time isn’t valuable at all to them and I will be letting my doctor know that I never want to use them again.", "pics": null, "resp": null, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "103935452150546892825", "name": "Justice Writer", "time": 1493431949057, "rating": 1.0, "text": "Terrible service.  We will never, ever go back.  The front desk of any office is the most important part of an office as far as clients are concerned.  Unfortunately, however, Brook, the front desk employee was hostile, rude, nasty and just plain a  bad liar. Laura too was unhelpful initially; but not to the full extent of Brook who is a poser, a fraudster and unprofessional. Brook’s sour attitude will likely be the reason why many clients, like us, will go elsewhere. What a shame.", "pics": null, "resp": null, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "112316758943218986325", "name": "cloud s", "time": 1562621250472, "rating": 1.0, "text": "2 weeks and they still haven't sent the lab work. Terrible place.", "pics": null, "resp": {"time": 1562697705528, "text": "We appreciate the opportunity to resolve concerns and learn about ways we can improve our services and communication. We are sending your feedback to our Center Administrator. If you would like to speak to him as well, please call: 256-534-5600. Thank you"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "101468183209791880247", "name": "Linda Williams", "time": 1626450130526, "rating": 5.0, "text": "Wonderful experience.  No wait, friendly and professional service.  A refreshing experience after a few years with another center that ran me through like a cow.", "pics": null, "resp": {"time": 1626455252333, "text": "We always love to hear positive feedback. Providing an elevated experience for every patient who chooses us is the goal of each of our team members."}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "114922454331811465456", "name": "casey smith", "time": 1624998178826, "rating": 5.0, "text": "I have small veins so it is hard for anyone to get a line on me. I had actually just left a doctors office who had blown a vein before this appointment so it was harder on the tech. Christine and Chelsie did a wonderful job of getting a vein when there was limited options. She definitely took the time and care to make sure it was correct before proceeding with the Ct Scan", "pics": null, "resp": {"time": 1625176953131, "text": "It is our privilege to provide imaging services and our team works hard to make it a good experience. When we hear we’ve done it well, it makes our day!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "103179057775456857755", "name": "Kimberly Daniels", "time": 1618072685390, "rating": 5.0, "text": "this has got to be one of the most pleasant experiences I’ve ever had in a clinic where nobody knew me yet I was treated with respect and care as though they had known me for years! It was very refreshing to see the steps that were being taken for the Covid pandemic time. They made sure to make sure that I felt safe and that I was comfortable. That was the best part!", "pics": null, "resp": {"time": 1618331314949, "text": "The safety of our team and our patients is our highest priority. We have implemented processes to ensure enhanced sanitation and proper distancing while still maintaining exceptional compassionate care. https://odcalabama.com/about/images-and-results/"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "116114845123591766119", "name": "Kasper Sen", "time": 1615255964574, "rating": 1.0, "text": "I was billed an extra fee 3 months after paying up front in cash for the X-ray I needed. They are predatory and greedy trying to scam people and lying that they owe them money months after fully paying for their services. I won't ever be back.", "pics": null, "resp": {"time": 1615403572575, "text": "There’s nothing we value more than feedback – even if it tells us we didn’t meet expectations. That’s how we know where to focus our efforts. Our Administrator, Brad, can be reached at 256-534-5600 to discuss any patients’ specific concerns."}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "100089177153976223334", "name": "Maeve O'brian", "time": 1592764723307, "rating": 5.0, "text": "Last Friday was my second visit.  Elizabeth was the first person I interacted with and that was very pleasant.  I filled out all the forms and waited for my tech Lauren. It all was a good testing experience.  I didn't have to endure all that stretching and smashing anymore.  Also had the bone density test and that was painless too.  Will go back.", "pics": null, "resp": {"time": 1594845460770, "text": "Thank you for the review!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "116174305860905928218", "name": "Eula Evans", "time": 1610821545618, "rating": 5.0, "text": "Thank you for the service,it was great Deana and LaDanya were great.\n\nThank you, ms.evans", "pics": null, "resp": {"time": 1611063813664, "text": "Our team puts patients first and we’re glad our team’s dedication to providing an elevated experience is showing!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "111689151111505715764", "name": "Kelly Firestine", "time": 1579809437145, "rating": 5.0, "text": "I needed to have a mammogram and screening breast ultrasound because I have been told I have dense breasts.  They scheduled me right away.  I spent hardly any time at check in.  I was taken back for my exam so quickly I barely had time to sip the nice cup of coffee I got in the lobby.  The women's are is so private and cozy.  It is nice to have a separate, private area from the rest of the center.  I felt so relaxed for they entire visit.  Stacy did such a great job on the mammogram and Jordan did an excellent job on my US.  I got a letter with the results with 2 days!  Wow!  I will always return here for not only my mammograms but also if I ever need an MRI, x-ray, CT, etc for me or my whole family.  Nice change of pace in the medical world to have such great professional service!", "pics": null, "resp": {"time": 1579902368555, "text": "Kelly, Thank you so much for your kind words! We appreciate you taking time to give us your valuable feedback. Have a great weekend!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "101077220794400645130", "name": "D.Ann's Designs", "time": 1592685425403, "rating": 5.0, "text": "Newly remodeled center with care taken understanding Covid-19.  Fantastic staff, easy check in and Ladonya, my technologist is one of the best. It is a great place I would highly suggest to anyone. Brad Moss, the Administrator obviously cares about this center. Thank you", "pics": null, "resp": {"time": 1594845381166, "text": "We always love to hear positive feedback. Providing an elevated experience for every patient who chooses us is the goal of each of our team members."}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "103630314480407628730", "name": "Drew Rochelle", "time": 1574369426168, "rating": 5.0, "text": "The staff was professional as well as warm and friendly. I was very impressed with the staff and facility. They made an anxiety filled test a pleasant experience. If there was a six star rating I would have given that.", "pics": null, "resp": {"time": 1575310665766, "text": "We just wanted to thank you for the excellent review. Your kind words go a long way and will be shared with our staff. Have a fantastic week!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "115313267090571187858", "name": "Carol Drake", "time": 1617302058079, "rating": 5.0, "text": "Excellent tech, Anita!!", "pics": null, "resp": {"time": 1617386360822, "text": "Our team puts patients first and we’re glad our team’s dedication to providing an elevated experience is showing!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "100526156631664704104", "name": "Gene Welborn", "time": 1566328130599, "rating": 2.0, "text": "The technician was awesome!  She was polite and professional.  But I never got a report.  I called two weeks after my test and was told that reports \"typically\" go out within 4-5 business days.  I was told the only way I could get my report would be to drive 40-45 minutes one way back to the facility to pick it up.  After negotiating a bit, I got them to just mail me another one. I still have not received it.  A bit frustrating to go through the procedure and not be able to get my own results.", "pics": null, "resp": {"time": 1566423257124, "text": "We appreciate your feedback and the opportunity to improve our services. To ensure the privacy of our patients, our policy prevents us from responding to this matter in a public forum. Your comments are important to us and have been sent to our Center Administrator. We welcome further dialog. Please call 256-534-5600 to speak with someone in person. Thank you!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "117134850288144384472", "name": "Angie Alonso", "time": 1591196712093, "rating": 5.0, "text": "Very friendly and quick. Liked the atmosphere", "pics": null, "resp": null, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "107079917667617868336", "name": "Ron Burgundy", "time": 1530287463292, "rating": 5.0, "text": "As I was walking in a little early, they called my cell to confirm everything is ready and they're ready for me.  The MRI took just a couple days to setup and the results were almost instant. Easy, quick, painless imaging. Staff is super friendly and proficient.\n\nI can now walk without a cane or pain before 30!", "pics": null, "resp": {"time": 1530902820605, "text": "Thank you for your kind words and valuable feedback!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "112339104436206121690", "name": "Brian Bradley", "time": 1550800407353, "rating": 5.0, "text": "Had a Thursday apptmt at 12:45 and showed up on time. The Patient Care Coordinator at the desk was very pleasant and efficient taking my ID and insurance card, gave me a form to complete and withing five minutes of arriving was sent upstairs to wait for my diagnostic test. Filled out another one page form and again within 5 minutes the Technologist came and led me back to the room for the bone density test. She explained the procedure, answered my questions and was just super. Test was over in 10-15 minutes and she even walked with me back downstairs, said thanks for coming and wished me well. Excellent experience from my standpoint!", "pics": null, "resp": {"time": 1550853918824, "text": "Brian, Thank you so much for your positive feedback and 5-star review!  We appreciate you!!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "110190701805871028267", "name": "Michael Kelsey", "time": 1579029836644, "rating": 2.0, "text": "The check in staff was great, very friendly, professional and courteous. The technician(s) I had dealings with in back could use a refresher on how to deal with patients", "pics": null, "resp": {"time": 1579902811388, "text": "Michael,  We appreciate your feedback and the opportunity to improve our services. Your comments are important to us and have been sent to our center Administrator. If you would like to dialog further, please call 256-534-5600 to speak with someone in person. Have a great weekend!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "112741849417273987076", "name": "wanda Rhodes", "time": 1537821067043, "rating": 4.0, "text": "This was my first visit and i truly enjoyed the experience .Tia and Anita very friendly and very profoundly proficient at their job. The facility very clean and the atmosphete comfortable. Thanks Anita for making my bone scan comfortable for me.", "pics": null, "resp": {"time": 1537992530917, "text": "Thank you for your great review! We appreciate the time you took to give us your valuable feedback!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "101995665309129062728", "name": "Michelle Dixon", "time": 1465970089978, "rating": 5.0, "text": "Got there early and even though my appointment was awhile away, they still called me back fairly quickly. My x-ray tech was nice and respectful of my concerns and helped the process go by smoothly. Great people and great place!", "pics": null, "resp": null, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "101631688475996423872", "name": "Patty Bradford", "time": 1563235604118, "rating": 5.0, "text": "I have my mammograms done yearly at Outpatient Diagnostic Center. I am very pleased with my experience at ODC. Deana and Anita are very professional and courteous. I recommend my friends to ODC.", "pics": null, "resp": {"time": 1563296973658, "text": "Patty, Thank you for your kind words! We appreciate you!!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "104922496992841994262", "name": "Cathy Stevens", "time": 1575044274971, "rating": 5.0, "text": "This facility has been remodeled, and all testings are on one floor downstairs. Easy check in and all of the staff associates were friendly and professional.", "pics": null, "resp": {"time": 1575310229148, "text": "Cathy, Thank you for taking time to give us your feedback. We appreciate it! Have a great week."}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "111052244386056933598", "name": "Cheri Harr", "time": 1507748777724, "rating": 5.0, "text": "Wait time was good. My total visit was 45 minutes to get checked in, take images on 3 different locations of my body, then get images burned to a disc. Great customer service!", "pics": null, "resp": null, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "111921218530541996712", "name": "Adam Ray", "time": 1578335022779, "rating": 5.0, "text": "Friendly staff in a clean and newly remodeled facility.", "pics": null, "resp": null, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "117271675261091389136", "name": "Briana Wright", "time": 1541010737021, "rating": 1.0, "text": "Forget ever getting anyone on the phone or getting your results in a timely fashion. Frequently you'll be on hold for 10 minutes or more before the line just hangs up, and you basically have to come physically retrieve your results because they won't answer for your doctor's office either.", "pics": null, "resp": {"time": 1541084886830, "text": "Briana,  We appreciate the opportunity to resolve concerns and learn about ways we can improve our services and communication. We are sending your feedback to our Center Administrator. If you would like to speak with him as well, please call 256-532--2418. Thank you"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "117092143927874055192", "name": "Kristie Wetzel", "time": 1537825255603, "rating": 5.0, "text": "I've used Outpatient Diagnostics 4 times this year and just scheduled an appointment for an MRI (already had 2 xrays, a 3D mammogram, and 2 ultrasounds.  I HIGHLY recommend them.  From the office staff, imaging personal, wait time, swift results, and billing practices.  I have been incredibly pleased and will recommend them and continue to request them.", "pics": null, "resp": {"time": 1537992444999, "text": "Kristie, Thank you for your kind words! Your recommendation is our highest compliment. We appreciate you!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "115092293434191897005", "name": "NPC J", "time": 1498857825840, "rating": 1.0, "text": "Didn't have a wait that day payed my copay.  Turned around said I didn't pay and sent it to a collection agency.  All my other doctors have worked with me as I am fully disabled Vet and fighting for benefits with SSI.  What complete lack of care.  $32 dollars for collections. 1 phone call from them but already 3 or 4 from collections out of Texas. Still haven't gotten the results on my scans.", "pics": null, "resp": null, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "113444811636064714487", "name": "Beth Wood", "time": 1474313021973, "rating": 2.0, "text": "Although the staff here is phenomenal, the wait time is ridiculous.  My family doctor sent me here for x-rays .... I asked several times if I needed to make an appointment, but was assured x-ray need no appointment and I would be in and out fast.  This was Friday.  I came by and the person in front of me had extensive tests and it would be at least 2 hours before they got to me.  Understandable - said I would be back on my lunch break on Monday.  Again, was assured - this time by the check-in desk clerk - that daytimes were typically not busy and I probably would be in and out fast.  I have been here an hour and a half, after being told as I came in the wait would be about 15 minutes.  They do great work here, but I am very frustrated and unhappy with the wait time ...", "pics": null, "resp": null, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "101636786177103320956", "name": "asha lamy", "time": 1528722704369, "rating": 1.0, "text": "They left me standing in waiting room ( can't sit due to possible hip fracture) for 45 mins past scheduled appointment.  Tears streaming down my face from excruiating pain... I inquire: their tech no called no showed. Instead of telling me from onset so I could make a knowledgable decision they hid the fact as intensity of pain increased by the second. They had no care nor concern for patient trying ro stay upright in tears with extreme pain except to make a buck!  Now I lay here in my car in parking lot for the last 20 minutes waiting for pain to decrease so I can get home.  This place should be shut down by the state.", "pics": null, "resp": {"time": 1528737414050, "text": "We appreciate the opportunity to resolve concerns and learn about ways we can improve our services and communication. We are sending your comments to our Center Administrator. If you would like to speak with him as well, please call 256-534-5600. Thank you."}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "114349373647520835479", "name": "John Lary", "time": 1430175559811, "rating": 3.0, "text": "ODC Huntsville web page used to work perfectly and I could easily get my reports online. It appears that ODC has changed its web provider because their web page now works only sporadically. It is now a common occurrence that I cannot get my reports online while I am at the hospital. Quality of their reports is excellent, as usual, but I often CAN'T GET MY REPORTS ONLINE which creates a real problem for me.", "pics": null, "resp": null, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "100894051940458160874", "name": "Grace Taylor", "time": 1465853153191, "rating": 1.0, "text": "Yeah i was severely dussapointed in the treatment of the patients here. My mom has severe claustrophobia and they refused to et her have any antianxiety medication priory to MRI, nor would they letme sit with her while she had it done. In fact they forgot we were here and we had to wait an hour to even begin. Quite frankly I much prefer the BioImaging center as I waited a quarter of the time and was allowed company while i had the MRI done. Not to mention how much more polite the technicians were.", "pics": null, "resp": null, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "118157532268644402662", "name": "Stella Mitchell", "time": 1546267095073, "rating": 4.0, "text": "Staff are friendly and helpful.", "pics": null, "resp": {"time": 1546268052800, "text": "Hi Stella,\nThank you for your kind words and valuable feedback! Happy New Year!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "117036832357933335258", "name": "Jason S", "time": 1518797900163, "rating": 1.0, "text": "Got lost in the shuffle after I checked in so wasn’t given contrast on time for my scheduled scan.  Then they delayed the actual scan due to “insurance authorization” for a scan that was scheduled 3 days in advance.  They asked that I plan 2 hrs for the scan and I’m approaching 3 without being scanned.  (The actual scan takes less than 5 minutes)", "pics": null, "resp": {"time": 1519056885304, "text": "Jason, We appreciate the opportunity to resolve concerns and learn about ways to improve our services and communication. We are are sending your comments to our center Administrator, Chuck Miles. If you would like to speak with him as well, please call 256-534-5600. Thank you!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "109386384938170732485", "name": "Jerod Whisenant", "time": 1488898988986, "rating": 2.0, "text": "People are friendly but the wait time is outragous. I am sitting in the wait room now and have been here for 1hr and 15minutes and still haven't been called back.", "pics": null, "resp": {"time": 1488909613492, "text": "We know your time is valuable so we are so sorry that you waited longer than you should have in our center. We’ve identified the issue that led to your wait and we’ve resolved it so we appreciate you alerting us to the situation. We hope you’ll accept our apology for getting your day off to a slow start."}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
