{"user_id": "114202239689596491565", "name": "Rhonda Brown", "time": 1625868896059, "rating": 5.0, "text": "They where very good to me, and called and helped me unconditionally. I would refer anyone to to Regional Homes. They treat you like family.", "pics": null, "resp": null, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "102399918305323141048", "name": "Dawn Dyar", "time": 1598623854403, "rating": 5.0, "text": "They are awesome, sending workers out in record time for the tweaking of our home set up.   Truly honest people to deal with, Moe knows!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNeU8ltTq4v1fVVyXsAAWkdDc4BkM4RRqCs-yvc=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPqrZw_aRFHnqwoT3Yn1ODNDYsIVExjZ6msKUs0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMJei1-st8Z_wJfssr1OiztRYrdqploLXF7aWHO=w150-h150-k-no-p"]}], "resp": {"time": 1598638756827, "text": "Thank you so much Dawn! Your king words mean so much to us and we appreciate it!"}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "109405192248215446035", "name": "stacy miller", "time": 1611591330044, "rating": 5.0, "text": "There are not enough good words to say about David and the others there! My husband passed over a year ago and this was a big decision to make on my own. David was so patient with me and helped me make the right decisions for me and I am so thankful for that.  I had a good very good experience overall. Everyone is so nice there. I know God blessed me by using Regional homes!", "pics": null, "resp": {"time": 1611607042534, "text": "Stacy thank you so much for the kind words and great review! We are happy to hear that your experience with us was great and that you are enjoying your new home!"}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "109367571416591960849", "name": "John Brasher", "time": 1607202624581, "rating": 5.0, "text": "David at Regional Homes was a pleasure to deal with while trying to find a home. After visiting almost every dealer in Alabama they were the most welcoming to us. Their homes appear to be exceptional quality and we really like the metal roofs. We definitely recommend them.", "pics": null, "resp": {"time": 1607360471761, "text": "Thank you so much John for the awesome review and kinds words! We appreciate your feedback and happy to hear that your experience with us was great."}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "114767875709115862613", "name": "Justin Belding", "time": 1613668821669, "rating": 5.0, "text": "Purchased a home here several months ago. David went above and beyond answering any and all questions I had and was informative the whole way. I have had some problems here and there, as with any new home would, and they have been out there fast to resolve any issues!", "pics": null, "resp": {"time": 1613673412810, "text": "Thank you Justin for the kind worst. We are happy to hear that you are pleased with the services that you received at Regional Homes of Cullman!"}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "103365293124471817704", "name": "Olive Oyl", "time": 1612543217236, "rating": 1.0, "text": "If I could give NO stars, I would. Dealing with this company has been nothing but headaches from day one! Regardless of how many times one calls for service calls, the requests are ignored. From the time the down payment was made until today, the buyer is ignored. The salesman and the office manager made promises they knew they would not keep and the buyer is left out to dry. This experience has been a NIGHTMARE!  There is NO way that I would recommend Regional Homes!", "pics": null, "resp": {"time": 1612558334655, "text": "I'm sorry to hear you were unhappy with the services you received at Regional Homes Cullman. Our number one priority is to meet and exceed expectations at every interaction. Since we don't have much control over the manufacturer servicing, we do everything in our power to get issues resolved for you quickly but that's not always the case. We will keep working hard to get these issues taken care of more promptly!"}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "111103863952062364407", "name": "Hal Brad", "time": 1619294507685, "rating": 1.0, "text": "Be very careful.  They give one price and when you return add to price.  Different price.", "pics": null, "resp": null, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "113128070501002144045", "name": "Lynn Shankles", "time": 1613945065863, "rating": 5.0, "text": "We had a great visit with Pete at Regional Homes. Awesome customer service! Would recommend them to anyone!", "pics": null, "resp": {"time": 1614019771615, "text": "Thank you so much Lynn for the kind words and great review! We appreciate it and happy to hear you had a great experience with us!"}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "106000850441844167698", "name": "Steven Schrimsher", "time": 1603301190499, "rating": 2.0, "text": "Update - 5 months later\nThe A/C got installed on Memorial Day (major kudos to the guy who drove out to install the crossover on the holiday and for that I'm returning 1 star, however that situation should've never happened in the first place). Underpinning got installed approx 1 month later.\n\nThere are repairs that are needed now which should fall under warranty, however I am not confident they will do quality work (\"they gave us a bad review, so we'll do just enough\" type of deal). That said, who knows - maybe things have changed internally and they'd see this as an opportunity.\n\nA lot of the headache around our purchase (and the subsequent bad review) probably could have been avoided with better communication both internally (within their company) and externally (with contractors they hired and with us). Buyer beware is all I can say. If you go with them, I hope you have a better experience than we did. While I still don't necessarily recommend them I do hope that, in the months since we purchased, they have been able to fix whatever issues caused the hiccups with our experience and provide a better product for future customers.\n\nOriginal review:\nAVOID THIS PLACE. Our experience declined when they ceased to be Dream Home Outlet and became regional homes of Cullman. Been waiting months to get into our house because their installers can't do anything right (no AC in half our home because they forgot the crossovers, AC unit installed in an improper location, water crossovers improperly installed, missing door hardware, etc). We have been patient about waiting but enough is enough. The goalposts keep moving- first it was one day, then two days, then weeks. Shame that I can't even live in the house that I'm already making payments on. Moe, Wendy, and Les are all decent enough people but there's a major hangup somewhere for these types of issues to be so prevalent, and because of that (in addition to the lack of requested -repeatedly- communication) I cannot recommend anyone go here when looking for their new home.\n\nAVOID AVOID AVOID", "pics": null, "resp": {"time": 1590528128684, "text": "Hey Steven. I understand your frustration and we want you to know customer service is extremely important to us. We're putting pressure on the manufacturers and are doing everything we can to help your situation. Please give us a call as soon as possible so we can get any outstanding issues resolved."}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "110119135525129318733", "name": "David Puckett", "time": 1598052603223, "rating": 5.0, "text": "Moe and Wendy are great people to deal with. I would highly recommend them to anyone.", "pics": null, "resp": {"time": 1598638458739, "text": "Thank you David for the kind words and great review!"}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "100475967293469303441", "name": "Dustin Hardy xq", "time": 1527216426210, "rating": 5.0, "text": "Moe, Wendy and Les are absolutely Fantastic. After the past few years of being rejected on house after house my wife and I decided to go visit Moe, Moe Wendy Les and see what they had and how they could help. Moe went above and beyond to put my family in a beautiful brand new home. These guys are the absolute best in the business and truly care about getting people in their Dream Home. I wouldn’t go anywhere else for the products they specialize in. Like I said they care and are THE BEST! The homes are such incredible quality as well. Each one leaves you smiling and they make the buying process as smooth and painless as possible. They don’t give up until you get what you want", "pics": null, "resp": {"time": 1528467023722, "text": "Don’t give up, don’t get discouraged, get to Cullman and visit the largest Fleetwood Homes Dealer in the USA.  We really appreciate you Dustin and your kind words!"}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "114013128833097253356", "name": "Brent Stephens", "time": 1518096407346, "rating": 5.0, "text": "Wow, they gave me all there attention and had all the answers, great selection of homes.  I like how they explain everything and helped us.   When you make the biggest purchase of your life, you got to feel comfortable about it and they help all the way through.  (Is clear they are the right place to be after visiting a few others).  And roll tide.....", "pics": null, "resp": {"time": 1518103987646, "text": "Mr. Stephens, we really appreciate you and your business.  We are so glad you are happy and that you noticed how we try make you comfortable about your decisions."}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "114419576751641958546", "name": "Preston Joiner", "time": 1567355098713, "rating": 4.0, "text": "Dream home outlet is a great place to buy your next home if you're wanting a manufactured home they offer custom built homes where you order the house plan you want and change what you want they specialize in Fleetwood and Winston homes we ordered our home from them and it's turned out georgus can't wait to get in it", "pics": null, "resp": {"time": 1574174857585, "text": "Thank you for your business."}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "116697657550488380550", "name": "J White", "time": 1466481514352, "rating": 5.0, "text": "Moe and the gang was very helpful, knowledgeable, and trustworthy. They did exactly what they said they were going to do all the way through the process. I had a couple of small issues and each one was handled promptly and considerately. Good people to deal with.", "pics": null, "resp": {"time": 1466519246681, "text": "Thank you very much.  Let us know if you need anything.  Moe"}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "117774185708169152854", "name": "M. Griffin", "time": 1539114535790, "rating": 5.0, "text": "Les, Moe, and Wendy are amazing. Have been with us every step of our home-buying journey. Can't wait till we have our new home 🙂", "pics": null, "resp": {"time": 1539115279352, "text": "Thank you for your business and patience.  Your home is in!"}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "117940497965065344404", "name": "Keyome DT", "time": 1592070973468, "rating": 5.0, "text": "Great group of people with a quality product", "pics": null, "resp": {"time": 1597786637321, "text": "Thank you for the kind words!"}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "100590693283497252822", "name": "Reg Wells", "time": 1413293649957, "rating": 5.0, "text": "My wife and I were driving around looking at manufactured homes on Cherokee Avenue near I-65 in Cullman. We just stumbled upon their lot and walked in. They couldn't have been more friendly, professional and helpful. My wife was kind of blown away by all the interior design customization options they offered. Long story short ... within 48 hours, we had signed an agreement with Dream Home Outlet and we'll have our new home within a couple of weeks. Very impressed by the whole process so far ... we are excited!", "pics": null, "resp": {"time": 1478624428371, "text": "Wow - this is why we are the best!  We are professionals that will help you in every stage of the process.  From helping with credit to get a better mortgage to customizing the floor plan to accommodate your needs.  We want you to tell everyone!"}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "112260730025611279407", "name": "Jay Tide", "time": 1556213161948, "rating": 3.0, "text": "Before you buy a home from dream homes make sure to do your home work I'm a first time home buyer and I've learned a lot first hand from them they are not organized and when the set your home up you have to call them almost everyday to get someone out there to hook stuff up so if you buy a home make sure you know when they are going to come hook up everything or it will be a rollercoaster ride for you", "pics": null, "resp": {"time": 1597786732032, "text": "I'm sorry to hear your experience wasn't great. Our number one priority is to meet and exceed expectations at every interaction. We would love for you to contact us so we can learn how best to improve going forward. Thanks in advance!"}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "100500422978229788957", "name": "Dillon Taylor", "time": 1464303008194, "rating": 5.0, "text": "5 stars all the way!!!! If your looking or thinking about getting a new home make this your first stop, after almost a year of looking and being turned away  or not getting a serious effort To put us in something that we wanted .. We went to Dream Home and talked with Them and they helped us  in every way possible even with credit!! Not to mention the homes are EXCELLENT QUALITY and totally customizable!! We were able to sit down and get everything we wanted. So anyone looking make Dream Home Outlet your first choice!", "pics": null, "resp": {"time": 1477665214191, "text": "Thank you for your business.  We really enjoyed building your customized floor plan and we really strive to provide the best customer service both before and after the sale."}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "114688599162769963353", "name": "Juan Rodriguez", "time": 1591125509053, "rating": 5.0, "text": "Great people to do business with it", "pics": null, "resp": {"time": 1517932311605, "text": "(Translated by Google) Thanks for the review. I can not tell you how much I appreciate you.\n\n(Original)\nGracias por la revision. No puedo decirte lo mucho te aprecio."}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "105707030452499213309", "name": "Jay Green", "time": 1506519955306, "rating": 5.0, "text": "Absolutely perfect!  Dream Home Outlet focuses on customer satisfaction. Their Fleetwood homes are the best looking in town.", "pics": null, "resp": {"time": 1517931864171, "text": "Thank you for your review.  We strive to make our customers happy and believe Fleetwood delivers the best value home on the market."}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "109233107786178112254", "name": "Donald Goodwin", "time": 1544023357955, "rating": 5.0, "text": "Mo, Les, & Wendy are all very attentive and helpful during the whole process! Reliable and expeditious!", "pics": null, "resp": {"time": 1597843700557, "text": "Thank you for the kind words and great review Donald!"}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "102532256833101143271", "name": "Jimmy Cockrell", "time": 1415752730438, "rating": 5.0, "text": "The folks at Dream Home Outlet are the best...After shopping around at other lots, we found the guys and gal at Dream Home Outlet were willing to help us in every way, they talked us through the whole process, step by step, the home we picked was PERFECT for our families needs, the price was better than any other we had found, the process was painless and smooth, thanks to these guys my wife and I will enjoy our first brand new home of our 26 years together...we just wanna say THANK YOU to Wendy, Moe and Les...u guys r the best!!", "pics": null, "resp": {"time": 1477665323869, "text": "To one of our best customers, who has been nothing but kind and a pleasure to have as a customer and now my friend?  You and Amy have been fantastic!"}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "100465405418993388425", "name": "whitney hardy", "time": 1527216306511, "rating": 5.0, "text": "Moe and wendy are wonderful people. They went far and beyond to get us in our dream home. I would so recommend going here they are so wonderful. Thank yall so much for what yall have done for us.", "pics": null, "resp": {"time": 1528466851501, "text": "We really appreciate these wonderful reviews and strive to be the best - this is a huge decision for most people and your review should help people realize how important it is to buy from people like us, people who really care, people who will treat you like family and will stand behind what they sell."}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "105515596045836926495", "name": "DeWayne Heine", "time": 1502046532573, "rating": 5.0, "text": "Great people! Moe does what he can to get you in a house.", "pics": null, "resp": {"time": 1503586201959, "text": "Thank you DeWayne.  We are so thankful you and Darla decided to purchase here after shopping everywhere.  Our customers are our priority."}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "116418328017905904727", "name": "Sherry Bavar", "time": 1494770916894, "rating": 4.0, "text": "A little slow for finalising home set ups.", "pics": null, "resp": {"time": 1494975883683, "text": "We sent state inspection report in on 4/11/17 and they did not inspect the home until 4/26/17 is part of our delay.  I hope you tell people how we went out of our way to lower the price and even hook up your utilities for you to help get you a home.  I know that our HVAC and skirting crews are extremely busy this time of year, if that is the delay you are speaking of.  We want you to be happy!"}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "110638281223279059280", "name": "Bobby Wallace", "time": 1581904258141, "rating": 2.0, "text": "Not as good as Timberline homes", "pics": null, "resp": {"time": 1581947534498, "text": "Hey Bobby! Your customer experience is very important to us. I noticed you have not purchased from us so in what way could we have made this better for you?"}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "105680128202513694322", "name": "Jonathan Koehn", "time": 1484055740655, "rating": 5.0, "text": "These people are great to work with!", "pics": null, "resp": {"time": 1484061750231, "text": "Thanks Jon and we really appreciate you and your business."}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "108153645040115082532", "name": "Johnny Beckmann", "time": 1600699148592, "rating": 5.0, "text": "(Translated by Google) Grat\n\n(Original)\nGrat", "pics": null, "resp": {"time": 1600721238333, "text": "Thank you Johnny for the awesome review! We appreciate it!"}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "118101227635356217657", "name": "Joshua Creasman", "time": 1622744256618, "rating": 5.0, "text": "Great ppl and super nice", "pics": null, "resp": null, "gmap_id": "0x8861d7d88ba6afad:0x4949b2a7780af78a"}
{"user_id": "115032970089736629725", "name": "Linda Ingram", "time": 1605976274673, "rating": 1.0, "text": "Have called multiple times been promised calls would be returned. Was first tolded that he would look this weekend but the never heard back. O guess they don't need the work.", "pics": null, "resp": null, "gmap_id": "0x8861d7d88ba6afad:0x4949b2a7780af78a"}
{"user_id": "104598349455747143663", "name": "Porkchopranch", "time": 1600721441276, "rating": 5.0, "text": "Good people. Didnt have what I needed but they did order it for me.", "pics": null, "resp": null, "gmap_id": "0x8861d7d88ba6afad:0x4949b2a7780af78a"}
{"user_id": "116616448056973210520", "name": "Jim Powell", "time": 1574599183650, "rating": 5.0, "text": "Bought our first home here 34 year's ago still great people!", "pics": null, "resp": null, "gmap_id": "0x8861d7d88ba6afad:0x4949b2a7780af78a"}
{"user_id": "109180806567438642633", "name": "D R", "time": 1552613986001, "rating": 5.0, "text": "Paul will take great care of you.", "pics": null, "resp": null, "gmap_id": "0x8861d7d88ba6afad:0x4949b2a7780af78a"}
{"user_id": "114698994188370138469", "name": "El Guapo", "time": 1541609386606, "rating": 4.0, "text": "Old man that runs it it is good people.", "pics": null, "resp": null, "gmap_id": "0x8861d7d88ba6afad:0x4949b2a7780af78a"}
{"user_id": "109840017571481839328", "name": "Tammy Gray", "time": 1579893594293, "rating": 3.0, "text": "Good to look at Mobile homes", "pics": null, "resp": null, "gmap_id": "0x8861d7d88ba6afad:0x4949b2a7780af78a"}
{"user_id": "117990268475565500031", "name": "Harold Blythe", "time": 1548360897804, "rating": 5.0, "text": "Friendly guy willing to waste time with me will be back", "pics": null, "resp": null, "gmap_id": "0x8861d7d88ba6afad:0x4949b2a7780af78a"}
{"user_id": "103978847729559858335", "name": "fred snyder", "time": 1580341307722, "rating": 5.0, "text": "Thank you Mr. Carson for your friendly, fast and  professional service. I would recommend this to anyone with 5 stars.   It was suggested in the reviews to take exit 13 instead of exit 5A off of the 65 ;  this is a good suggestion.", "pics": null, "resp": null, "gmap_id": "0x889badf4a65960f3:0xf0e397f3434be2fc"}
{"user_id": "112386962132274835967", "name": "Justin Davis", "time": 1539220521005, "rating": 5.0, "text": "Friendly people work hear. Fast unload time. BUT no overnight parking. PS. don't come in off I-65 ext 5-a. Use ext 13.", "pics": null, "resp": null, "gmap_id": "0x889badf4a65960f3:0xf0e397f3434be2fc"}
