{"user_id": "105872783482157105903", "name": "Britney Wilson", "time": 1559870825121, "rating": 5.0, "text": "DMEI are amazing! Super knowledgeable and responsive. They are always willing to jump on a call with me to discuss my needs and help guide me through the best options for my business. They have a wide variety of resources that practically make them a one-stop-shop for digital marketing.", "pics": null, "resp": {"time": 1559918416945, "text": "Thank you so much Britney for your 5 star review!  We enjoy working with you and helping your business grow."}, "gmap_id": "0x88929283c5d02cf1:0xe869c936d714e8e5"}
{"user_id": "118141396624761693569", "name": "Proper townsend4", "time": 1560009035045, "rating": 5.0, "text": "I have seen sales more than triple in the insurance business and was truly impressed by DMEI’s work making this happen. The staff is professional, friendly, and there to help! I love this group and would recommend them for your business!", "pics": null, "resp": {"time": 1560009493815, "text": "Thank you!  We were happy to help your business get more phone calls and quality leads!"}, "gmap_id": "0x88929283c5d02cf1:0xe869c936d714e8e5"}
{"user_id": "107122164463029379537", "name": "Ashley Bagwell", "time": 1559861932277, "rating": 5.0, "text": "Love the group at Digital Marketing! Donnia has been wonderful!  She stops in or calls to check on us and always answers any questions I have as well as getting updates done to my webpage very promptly! Excellent customer service!!", "pics": null, "resp": {"time": 1559918512671, "text": "Ashley, we appreciate you choosing us as your marketing partners.  It has been a pleasure watching your business grow and working with such a great group of folks!"}, "gmap_id": "0x88929283c5d02cf1:0xe869c936d714e8e5"}
{"user_id": "112750960389083063147", "name": "Sharonica Daniels", "time": 1559759969590, "rating": 5.0, "text": "The professionals at DMEI brought my business out of a hole from another marketing agencies mishaps.  I am now swamped with business and having to find another building to work out of!  They offer great marketing services and offer a ton of FREE advice.  I was astounded at the results and tell everyone I know they need to choose them for any marketing!", "pics": null, "resp": {"time": 1559852237443, "text": "Thank you Sharonica! We were so happy to help you out.  If there is anything else we can help with just let us know!"}, "gmap_id": "0x88929283c5d02cf1:0xe869c936d714e8e5"}
{"user_id": "100785129227067095561", "name": "Maranda Harley", "time": 1560054581022, "rating": 5.0, "text": "One of the best marketing places around! They are sweet and always trying to do what is best for you! Thank y’all for all y’all do! 🙂", "pics": null, "resp": {"time": 1560081827920, "text": "Thank you Maranda! We are always happy to help!"}, "gmap_id": "0x88929283c5d02cf1:0xe869c936d714e8e5"}
{"user_id": "103431413243451431259", "name": "Harold Harvey", "time": 1550589106017, "rating": 5.0, "text": "I recently started a new ecommerce business and was struggling to market my it online.  After touching base with Donnia about marketing I signed up and now in my third month of advertising on the Google Shopping Network I have seen an influx of revenue.  Not only am I staying afloat but I am actually bringing home a paycheck!  I highly recommend the Digital Marketing Experts International team for any new ecommerce business! You will not be disappointed!", "pics": null, "resp": {"time": 1551102615066, "text": "Thank you! We appreciate your business. We love working with you."}, "gmap_id": "0x88929283c5d02cf1:0xe869c936d714e8e5"}
{"user_id": "111651968882769941385", "name": "Christian Harvey", "time": 1560003262720, "rating": 5.0, "text": "Great company with great people. Answered every question and met my every need.", "pics": null, "resp": {"time": 1560004055082, "text": "Thank you Christian!"}, "gmap_id": "0x88929283c5d02cf1:0xe869c936d714e8e5"}
{"user_id": "110879006570109544378", "name": "Blake Huey", "time": 1560014051403, "rating": 5.0, "text": "Love the marketing and the free advertising options .. not to mention the service is phenomenal", "pics": null, "resp": {"time": 1560016201994, "text": "Thank you Blake! We appreciate your awesome review!"}, "gmap_id": "0x88929283c5d02cf1:0xe869c936d714e8e5"}
{"user_id": "108499737291937337171", "name": "Kelly Ratcliff", "time": 1560002871352, "rating": 5.0, "text": "Great local marketing company that helped me get my website launched and after just a few months my calls went from 10 to 50 a month.  Now, I have more business and I have this company performing my social media management as well as Local SEO.  You cant ask for a better team of digital marketing professionals!", "pics": null, "resp": {"time": 1550589144292, "text": "Thank you Kelly for your kind words.  We appreciate your business!"}, "gmap_id": "0x88929283c5d02cf1:0xe869c936d714e8e5"}
{"user_id": "115382850304673092055", "name": "Tukker Watson", "time": 1506620090971, "rating": 5.0, "text": "I now have more business then I can handle because of my website !! Thank y'all .", "pics": null, "resp": {"time": 1506699197967, "text": "Thanks Tukker we enjoy working with you."}, "gmap_id": "0x88929283c5d02cf1:0xe869c936d714e8e5"}
{"user_id": "108473816858528271196", "name": "Chris Davis", "time": 1506617652347, "rating": 5.0, "text": "You want to grow you need to call these people !!!! I own several business and they def know what they are doing !", "pics": null, "resp": {"time": 1506699228720, "text": "Chris Davis your awesome and we appreciate your business."}, "gmap_id": "0x88929283c5d02cf1:0xe869c936d714e8e5"}
{"user_id": "108636074835586283638", "name": "Kelsey Barnard Clark", "time": 1560014959627, "rating": 5.0, "text": "Amazing local marketing agency, very professional.", "pics": null, "resp": {"time": 1560016249147, "text": "Thank you Kelsey! We love helping local businesses succeed!"}, "gmap_id": "0x88929283c5d02cf1:0xe869c936d714e8e5"}
{"user_id": "100877512771602896766", "name": "D Davis", "time": 1506989630256, "rating": 5.0, "text": "Great company to do business with very affordable!  $$$$$$ is key and they saved me a ton and made me a ton !", "pics": null, "resp": {"time": 1507655471458, "text": "Thanks Darcy we appreciate your business."}, "gmap_id": "0x88929283c5d02cf1:0xe869c936d714e8e5"}
{"user_id": "111356816794920467544", "name": "L.A. Jones", "time": 1566347150309, "rating": 1.0, "text": "Does not deliver what they promise and does not pay their employees.", "pics": null, "resp": {"time": 1566505248357, "text": "We are very sorry to hear that you feel this way. But you as well as we know the words are not true."}, "gmap_id": "0x88929283c5d02cf1:0xe869c936d714e8e5"}
{"user_id": "101390542394807765938", "name": "lecia turvin", "time": 1562091588561, "rating": 5.0, "text": "Awesome people", "pics": null, "resp": {"time": 1562592235183, "text": "Thank you Lecia!"}, "gmap_id": "0x88929283c5d02cf1:0xe869c936d714e8e5"}
{"user_id": "108365763151767114311", "name": "Katie Calhoun", "time": 1565191266737, "rating": 5.0, "text": "I loved working with Edge Web Consulting.  Erin is very knowledge on many topics that were helpful to me for use in promoting my jewelry business. She is always willing to take the extra steps to be of assistance in any way possible for the success of your company.   I highly recommend their services.", "pics": null, "resp": {"time": 1565201299978, "text": "Thank you so much, Katie!  I enjoyed learning more about your business and look forward to seeing it grow!"}, "gmap_id": "0x888921dc61e48f2f:0xf5e7acbffe8b4c85"}
{"user_id": "108496818278999082603", "name": "Mac Mac", "time": 1540070837786, "rating": 5.0, "text": "(Translated by Google) Very well\n\n(Original)\nMuy bien", "pics": null, "resp": null, "gmap_id": "0x888921dc61e48f2f:0xf5e7acbffe8b4c85"}
{"user_id": "109309023316739504851", "name": "Justin Farris", "time": 1621816699105, "rating": 5.0, "text": "I’ve worked with Brian for many years now with my company’s website. Dogwood has always been there to help us whenever we call, even if it’s just to help us get unstuck or to discuss options for a new project we are considering. Call these guys for your next web/marketing project. You won’t regret it.", "pics": null, "resp": {"time": 1621820842461, "text": "Thank you Justin for being there with us as we’ve grown. Always very appreciative of those who trusted us early on!"}, "gmap_id": "0x888c2d4433a2110b:0x207e5a349771fea0"}
{"user_id": "101640193017907276849", "name": "Baptist Collegiate Network", "time": 1619118003693, "rating": 5.0, "text": "Dogwood Media and Brian Harris have done a terrific job for us!  They are very responsive, helpful, and reasonably priced.  We would highly recommend them!", "pics": null, "resp": {"time": 1619123035791, "text": "Thank you Weaver! We have enjoyed working with all of you guys over the past few years. Looking forward to many more!"}, "gmap_id": "0x888c2d4433a2110b:0x207e5a349771fea0"}
{"user_id": "110201977509504404696", "name": "Joshua Fields", "time": 1608301800204, "rating": 5.0, "text": "I contacted Brian about just about everything I needed with my business start up. I sat down with the team and discussed my business process and needs. They brought the innovation to the table. They've created a streamlined website, hosting, branding & logo creation, and are helping me with professional photography as well. I'm so grateful to Brian, Thomas, and Matt. Very responsive and really have been a joy to work with. Highly recommend!", "pics": null, "resp": {"time": 1613432986918, "text": "Thank you Josh for the recommendation!!"}, "gmap_id": "0x888c2d4433a2110b:0x207e5a349771fea0"}
{"user_id": "113843048893861688903", "name": "Charlotte Crane", "time": 1619017402346, "rating": 5.0, "text": "Dogwood Media and particularly Brian Harris has been our source for website hosting and design for several years. I cannot recommend them highly enough. They respond immediately to requests for change or problems, and I look forward to using them for some of our other media development in the future.", "pics": null, "resp": {"time": 1619017990118, "text": "Thank you Charlotte for the kind words! We look forward to continuing to work together!"}, "gmap_id": "0x888c2d4433a2110b:0x207e5a349771fea0"}
{"user_id": "102634836480018813816", "name": "Kate Fleming", "time": 1591981143320, "rating": 5.0, "text": "We have had a lot of trouble finding reliable website help that doesn't demand a monthly contract fee for our small business. Dogwood has blown me away with how well they have filled our needs. Their work is impeccable, their knowledge is vast, and their communication is excellent. I submit projects to them regularly and always know they've received them, about how long it will take to complete, and the approximate cost. I would highly recommend them for anyone needing help with website management and other design work.", "pics": null, "resp": {"time": 1591985384485, "text": "Thank you Kate for the kind words! We’ve enjoyed getting to know you and your staff. Glad that we’ve been able to help! - Brian"}, "gmap_id": "0x888c2d4433a2110b:0x207e5a349771fea0"}
{"user_id": "102781704267098692341", "name": "Cleve Mallory", "time": 1583360208654, "rating": 5.0, "text": "Dogwood rebuilt our church website in January, 2019.  In early 2020, a family relocated from Michigan to Montgomery, Alabama, and began seeking a church home.  After visiting a few times, I asked the mother what factored into their decision to visit our church.  She responded, \"Your website did it... It was simple to use and answered all my questions.\"  Dogwood's creativity and functional design for our webpage is still proving to be an asset for our church family.  They host and manage our website and manage our various social media platforms.  We continue to find ways to use them in graphic design and more.  They're more than worth the investment.", "pics": null, "resp": {"time": 1594300027645, "text": "Thank you Cleve!"}, "gmap_id": "0x888c2d4433a2110b:0x207e5a349771fea0"}
{"user_id": "111574725344138715670", "name": "Jeremy Lynch", "time": 1566157440845, "rating": 5.0, "text": "They are prompt, creative, and lead with integrity!", "pics": null, "resp": {"time": 1566163589332, "text": "Thank you Jeremy!"}, "gmap_id": "0x888c2d4433a2110b:0x207e5a349771fea0"}
{"user_id": "115420156037973058693", "name": "Stacie Gilham", "time": 1610558642104, "rating": 1.0, "text": "After setting up my laptop, I was unable to change any settings requiring an administrator password due to Yeltek having themselves as the administrator.i emailed them an no response. I called and had a return called stating I could use my laptop without the administrator password. That is true, under the guest account they set up for me. I want full control over the laptop I purchased, not for Yeltek to have any account on it. I have since sent another email requesting the administrator password and left two more messages due to no one ever there answering the phone. Still no response. Bad service. I wouldn't recommend this company to anyone.", "pics": null, "resp": {"time": 1619652684700, "text": "The laptop was invoiced to Kennedy Galvanizing. YELTEK has reached several times to their office (Allen) and called Dollie/Stacie at home. We have spoken to Dollie (Stacie grandmother) and asked for her to contact us. We have attempted to guide Dollie over the phone what she needs to do. We have recommended dropping the device by the office to make this small change. We have not received follow up from Dollie or Stacie."}, "gmap_id": "0x8889cb81ae4d67bd:0x2dc92694148a3b64"}
{"user_id": "114829167387459644792", "name": "Matt 34 Ronald Holloway", "time": 1544845215774, "rating": 1.0, "text": "Haven't been", "pics": null, "resp": null, "gmap_id": "0x8889cb81ae4d67bd:0x2dc92694148a3b64"}
{"user_id": "106805795004778065305", "name": "Bess Wood", "time": 1580906676133, "rating": 3.0, "text": "Expensive", "pics": null, "resp": null, "gmap_id": "0x8889cb81ae4d67bd:0x2dc92694148a3b64"}
{"user_id": "107784652352833268963", "name": "Mary Sinche", "time": 1604674417989, "rating": 1.0, "text": "DO NOT DO BUSINESS WITH THEM. They contacted me to do business with them. I agreed at first. I then called and left a voice message to have them call me. They had sent me an e-mail with a contract that I never signed. I sent a response to the e-mail asking them to cancel. They never refunded my money. They never got my approval for the ad. I got in touch with them today after they tried to take money out of my account again. I was told that they do not give refunds that all sales are final. Even though I never signed the contract, tried to cancel before and never approved the ad. All they are interested in is taking your money and not dealing with you if you change your mind. The so called owner told me I never called and left a voice message and that I tried to cancel after they already had gone to print. All lies.", "pics": null, "resp": null, "gmap_id": "0x888922c045b2e139:0x79ff50769a631b67"}
{"user_id": "116043260555388536100", "name": "Liz Love", "time": 1605060408033, "rating": 5.0, "text": "Rated one of the best Company Owners under their umbrella Coast to Coast, and it's not hard to see why. Marvin at Mac Global has nurtured his team of leaders to excel at everything they do. He takes the time to listen and acknowledge their strengths while encouraging them to work on ways to improve. Each day begins with the basic principles toward success, but every day is still slightly different. From games to weekly competitions to promotions, rewards drop all along the way.\n\nThere's a lot of money to be made here if you are ready to work for it. Bring your energy, courage, and unwavering commitment, and you will find your path, purpose, and prosperity.", "pics": null, "resp": null, "gmap_id": "0x88626b3354dff64f:0xe7d7c012e50c7679"}
{"user_id": "103009183512928567622", "name": "Devon Harris", "time": 1604689432921, "rating": 5.0, "text": "Marvin is a great leader. I’ve learned and developed many skill sets while working at this job. The environment is very energetic and everyone tries their best to help each other out. Nicole is a great HR person as well", "pics": null, "resp": null, "gmap_id": "0x88626b3354dff64f:0xe7d7c012e50c7679"}
{"user_id": "100454115470343624564", "name": "Joe Conley", "time": 1608514733850, "rating": 5.0, "text": "The people are seriously the best part about working here. I am so stoked about working for these people. The awesome pay is just the cherry on top.", "pics": null, "resp": null, "gmap_id": "0x88626b3354dff64f:0xe7d7c012e50c7679"}
{"user_id": "109412910200233735420", "name": "Courtney Lane", "time": 1571531255292, "rating": 5.0, "text": "I had an interview with the business. They worked with me on getting an interview around my schedule. The owner is very nice and makes you excited to work for them! His demeanor made me more relaxed for the interview and it was probably one of the best interviews I've had. I decided to pursue other opportunities, but I definitely recommend them if you're wanting to get into sales. Good base pay plus commission.", "pics": null, "resp": null, "gmap_id": "0x88626b3354dff64f:0xe7d7c012e50c7679"}
{"user_id": "115586678350716265503", "name": "Quinn Turner", "time": 1603383384457, "rating": 5.0, "text": "Mac Global Marketing is my first job outside of a kitchen, and needless to say its the best thing I've ever done, This business builds your confidence, and communication skills, while still maintaining an upbeat and fun atmosphere! everyone WANTS you to succeed point blank period, YOU LEARN ABOUT INVESTING IN YOURSELF AND THEN GET TO SEE WHAT TIME OUTCOME LOOKS LIKE WHEN MAC GLOBAL INVESTS IN YOU AS WELL!! Its a no brainer job, its flexible, understanding, rewarding job, but you have to be willing, strong minded, and positive. I'd recommend this job to anyone who can speak and has eyes because its no doubt one of the best places to work in Huntsville!!\nworking should feel rewarding and enjoyable, if not i dont understand why you wouldn't try and work here!\nBIGG SHOUT OUTS TO MAC GLOBAL BE ALWAYS KEEPING IT REALLL!!!!", "pics": null, "resp": null, "gmap_id": "0x88626b3354dff64f:0xe7d7c012e50c7679"}
{"user_id": "103269410275323455614", "name": "BB2 Beauty & The Beast", "time": 1573590589704, "rating": 5.0, "text": "Very professional company, everyone is respectful.  Great company to work with, flexible schedule.  Must be a team player and have people-person skills.  They strive on pairing you with leaders to make one a better leader and/or create leaders.", "pics": null, "resp": null, "gmap_id": "0x88626b3354dff64f:0xe7d7c012e50c7679"}
{"user_id": "112304800512377548213", "name": "Daryl Parker", "time": 1570807888780, "rating": 5.0, "text": "Mac Global Marketing in Huntsville Al is a great company and very professional.. Great people and staff they really care about there employees and will make sure you get where your trying to go..a wonderful experience full of excitement ambition and drive one of the best places to work! Marvin is a great leader in the company if you wanna be somebody and you wanna go somewhere Mac Global Marketing is one of them places you need to go too.", "pics": null, "resp": null, "gmap_id": "0x88626b3354dff64f:0xe7d7c012e50c7679"}
{"user_id": "111967726822571972553", "name": "Montavious Ray", "time": 1567794152521, "rating": 5.0, "text": "All around great people and the staff is outstanding! One of a kind. It makes me feel good to know that there are people who still have great  customer service and who genuine care about the people who they help. I loved my experience, thank you for everything.", "pics": null, "resp": null, "gmap_id": "0x88626b3354dff64f:0xe7d7c012e50c7679"}
{"user_id": "101001820751645412624", "name": "Claire Ford", "time": 1553193197318, "rating": 4.0, "text": "I recently interviewed with MAC Global Marketing for a sales and customer service position. The MGM team was nothing but professional from our first contact. At the office Nicole was very nice and helped me not feel so nervous before meeting with Marvin. Marvin (the manager) was very professional, though on the younger side, and explained the position in detail. I appreciate the time they took with me and look forward to moving along in the interview process.", "pics": null, "resp": null, "gmap_id": "0x88626b3354dff64f:0xe7d7c012e50c7679"}
{"user_id": "116989138661834878171", "name": "MomiJuana Brat", "time": 1580752018181, "rating": 3.0, "text": "I applied for a position...was told I'd get a call back 'n a hiring packet n the new year after they moved to their NEW location. 😔 Sad to say, I still haven't heard from anyone. I was so EXCITED about the possibilities.", "pics": null, "resp": null, "gmap_id": "0x88626b3354dff64f:0xe7d7c012e50c7679"}
{"user_id": "104411094957559312893", "name": "Audrey Rhodes", "time": 1567998649778, "rating": 5.0, "text": "Mac Global Marketing is an amazing company that has personally given me the opportunity to work for a company that is full of energy, positive attitudes, opportunity to grow in the company, and support along the way.  Customer service is so important to every member of our team, and we are ultimately here to make any customer have the best experience possible.", "pics": null, "resp": null, "gmap_id": "0x88626b3354dff64f:0xe7d7c012e50c7679"}
{"user_id": "106428481457040326197", "name": "Martha Tibbs", "time": 1567791079159, "rating": 5.0, "text": "Marvin was very professional respectful and had a great attitude. Loved his excitement when he talked about the position he was offering. 😁", "pics": null, "resp": null, "gmap_id": "0x88626b3354dff64f:0xe7d7c012e50c7679"}
{"user_id": "116239907093273066446", "name": "TiKi Buttrey", "time": 1573670172939, "rating": 5.0, "text": "MAC Global has a high-spirited enviroment. The energy will capture you. Go in with an open mind and a dream big attitude, they will match your enthusiasm and make you a star. 💯 TiKay", "pics": null, "resp": null, "gmap_id": "0x88626b3354dff64f:0xe7d7c012e50c7679"}
{"user_id": "116670649245521793206", "name": "Chryl Yarbrough", "time": 1570212636372, "rating": 1.0, "text": "Far room is way colder than the rest of the restaurant. Salsa is way too spicy but they don't have milder. Queso dip is actually nacho dip served at room temp (probably because it was brought 5 mins or more after ordered). Not impressed, will not be back.", "pics": null, "resp": {"time": 1570214031655, "text": "Hey chryl! We actually are not a restaurant. I believe you may have the wrong company for this review."}, "gmap_id": "0x88626b3354dff64f:0xe7d7c012e50c7679"}
{"user_id": "113276942959847993122", "name": "Arresia Teague", "time": 1567834720773, "rating": 5.0, "text": "Marvin Williams was great and he gave me all the info I needed..I recommend him as your customer service go to rep to get you exactly what u need .. thank you so much.", "pics": null, "resp": null, "gmap_id": "0x88626b3354dff64f:0xe7d7c012e50c7679"}
{"user_id": "117397048779092691820", "name": "David Fish", "time": 1559426356139, "rating": 5.0, "text": "One of the best companies I have ever had the opportunity to work for..very family oriented and care about their employees..if not for medical conditions I would still be with them no question..Marvin is a super guy to work for..go see them today!!", "pics": null, "resp": null, "gmap_id": "0x88626b3354dff64f:0xe7d7c012e50c7679"}
{"user_id": "114741655748845737888", "name": "Gabrielle Jones", "time": 1553441572429, "rating": 5.0, "text": "I was only with the company for a short period of time but from the people to the business was the best experience in a job I have ever had I enjoyed every minute with them I had, couldn't ask for better opportunities in advancing. GET EXCITED!!!!", "pics": null, "resp": null, "gmap_id": "0x88626b3354dff64f:0xe7d7c012e50c7679"}
{"user_id": "112354114197162735822", "name": "Danyelle Stewart", "time": 1553882905853, "rating": 5.0, "text": "It was a pleasure meeting everyone today. They are all dedicated to making the business successful.", "pics": null, "resp": null, "gmap_id": "0x88626b3354dff64f:0xe7d7c012e50c7679"}
{"user_id": "109005552222699797904", "name": "Zhane' Glasper", "time": 1566927275370, "rating": 5.0, "text": "This is a great company with great people and wonderful opportunities.", "pics": null, "resp": null, "gmap_id": "0x88626b3354dff64f:0xe7d7c012e50c7679"}
{"user_id": "113182410860738353130", "name": "Coleman Webb", "time": 1574892946480, "rating": 5.0, "text": "Marvin and his team are great!", "pics": null, "resp": null, "gmap_id": "0x88626b3354dff64f:0xe7d7c012e50c7679"}
{"user_id": "117097096614005721190", "name": "Travis Sexton", "time": 1546556208727, "rating": 1.0, "text": "Went for an interview today. Showed up at 1140 for my 12oclock interview litteraly sat there till 1 until I got fed up of waiting and left. Not to mention they texted me multiple times making sure I was gonna be there at 12. Very unorganized!", "pics": null, "resp": {"time": 1553193782787, "text": "Travis, We deeply apologize for the inconvenience you experienced when you visited our office. We strive to put our best foot forward and failed during your interview. We have worked on streamlining our interview process and with the help of our new admin team are striving to be more organized and on top of our day to day. Again we deeply apologize and if there is anything our team can do to change your mind of our office or fix your experience, please do not hesitate to reach out to the office any time!"}, "gmap_id": "0x88626b3354dff64f:0xe7d7c012e50c7679"}
{"user_id": "107410918891199980665", "name": "Sylvia Sutton", "time": 1574083866959, "rating": 5.0, "text": "I hope 'n pray I get the job. ❤🖤💚😌", "pics": null, "resp": null, "gmap_id": "0x88626b3354dff64f:0xe7d7c012e50c7679"}
{"user_id": "118404626727537244068", "name": "Leslie Narvaez", "time": 1581922661996, "rating": 5.0, "text": "Great experience. The hotel stay was so worth it. Spent a good time in Orlando and the reps are so professional and fun. The product sells itself.", "pics": null, "resp": null, "gmap_id": "0x889a4dbc73fad201:0x9dd7c1557cb5bce7"}
{"user_id": "104654383446750411005", "name": "Kennady Mccandlish", "time": 1580788493927, "rating": 5.0, "text": "Most awesome place to work man best job j have ever had hands down been with the company almost a year now and I am beyond happy n thankful I love the product and the benefits it has and the whole hyla family wish I could give 10 stars honestly", "pics": null, "resp": null, "gmap_id": "0x889a4dbc73fad201:0x9dd7c1557cb5bce7"}
{"user_id": "109257919423011519566", "name": "Hanifah Abdullah", "time": 1577001827933, "rating": 1.0, "text": "I recieved a call from here to come in for an interview. What a joke! The lady basically lied on the phone about the pay and what the job was to get people to come in. Once we realized it was a commission based door to door sales job, people started dropping from the group interview like flies. As far as what shes selling....I'm not even sure what shes selling. She didnt even have an actual example to show just a prototype. On top of all of this she wanted employees to pay $27 for their own background check! Get real \"EST\", whatever that stands for.", "pics": null, "resp": null, "gmap_id": "0x889a4dbc73fad201:0x9dd7c1557cb5bce7"}
{"user_id": "107117426943737102502", "name": "Mr Mane", "time": 1576534112398, "rating": 1.0, "text": "I received a call from this \"company\" to come in and interview for a customer service position and they made it sound like the perfect job to supplement my income as I am a brand new Realestate agent. I walked in dressed in a suit because that's what you wear to most interviews and was surprised when I was moved into a room with two other applicants one in cut off shorts the other was wearing sweatpants. I truly do not wish to sound judgemental but I was quite surprised. The interviewer proceeded to attempt to sell us an air purifier. I am not joking we sat and listened to a long and obviously unrehearsed sales pitch then she requested a list of our friends and family that they could contact to sell air purifiers to. Needless to say I thanked them sarcastically for their time as they wasted my gas and time they had a copy of my resume for several days before this umm... \"job interview\" so they had a very good understanding the type of work I have been doing my entire life and it does not involve cut off shorts and air purifiers so I felt like they were not very courteous when it came to my time. I truly do not want to come off as a pompous jerk but this was a joke. I spoke with the other 2 young men both half my age gave them my phone number and now have a plan to help them create their resumes and hopefully help them find a decent job as I continue my quest. So to summarize if you are going for a job interview with this company shorts and tank tops or acceptable", "pics": null, "resp": null, "gmap_id": "0x889a4dbc73fad201:0x9dd7c1557cb5bce7"}
{"user_id": "100909680895920510258", "name": "Hannah Adams", "time": 1576030872564, "rating": 1.0, "text": "If I could rate this company 0 stars i would! Very unprofessional! My friend calls and asks me to make an app and so i did and no one showed up. I got stood up without even a phone call to let me know no one was coming. My friend calls and says they told her they dont go to renters and my home wasnt under my name... First I own my home and second the friend that they showed the product to that asked me to make an app with this company is a renter. No one called me to even ask if maybe they had the address wrong. Lots of deceiving going on... pretty sure these people are scammers or just an unproffesional company that lacks manners and common courtesy", "pics": null, "resp": null, "gmap_id": "0x889a4dbc73fad201:0x9dd7c1557cb5bce7"}
{"user_id": "104942902940608186018", "name": "Dylan Crane", "time": 1579248678068, "rating": 1.0, "text": "scam", "pics": null, "resp": null, "gmap_id": "0x889a4dbc73fad201:0x9dd7c1557cb5bce7"}
{"user_id": "109358703410103819962", "name": "Killa Young", "time": 1576201363057, "rating": 1.0, "text": "Scam", "pics": null, "resp": null, "gmap_id": "0x889a4dbc73fad201:0x9dd7c1557cb5bce7"}
{"user_id": "106716895432523693542", "name": "LUCIO PEREZ", "time": 1602036278601, "rating": 5.0, "text": "(Translated by Google) GOOD RADIO STATION\n\nTHE BEST\n\n(Original)\nBUENA ESTACION DE RADIO\n\nLA MEJOR", "pics": null, "resp": {"time": 1625850575939, "text": "(Translated by Google) Thank you so much! Regards!\n\n(Original)\nMuchas Gracias! Saludos!"}, "gmap_id": "0x88892417d7232ff5:0xc36b349cea56ebdc"}
{"user_id": "113049913096854974156", "name": "rodolfo Moreno", "time": 1564006930135, "rating": 5.0, "text": "(Translated by Google) The best radio station in Alabama\n\n(Original)\nLa mejor estacion de radio en Alabama", "pics": null, "resp": {"time": 1571258375157, "text": "(Translated by Google) Thank you! Cheers!\n\n(Original)\nGracias! saludos!"}, "gmap_id": "0x88892417d7232ff5:0xc36b349cea56ebdc"}
{"user_id": "110439176202165883264", "name": "Lobonation By El Lobito", "time": 1514943732700, "rating": 5.0, "text": "(Translated by Google) The best radio station in Birmingham Alabama, music variety regional Mexican and Latin\n\n(Original)\nLa mejor estación de radio en Birmingham Alabama, música variedad regional mexicano y latino", "pics": null, "resp": null, "gmap_id": "0x88892417d7232ff5:0xc36b349cea56ebdc"}
{"user_id": "110755040706073038110", "name": "Jennifer Gray", "time": 1612537454060, "rating": 5.0, "text": "Our partnership with Uptick has exceeded all our expectations. Everything they do is first-class, from communication to customer service to delivering a tailored marketing strategy with measurable results. It is clear they truly care about our business. Our consultant, Matt Spivak, is as knowledgeable, responsive, and kind as they come! We are very happy we made the decision to work with them.", "pics": null, "resp": {"time": 1614370229389, "text": "We love working with you guys.\n\nAs you mentioned, our number one goal is to help our client's see success. That means having a team of dedicated individuals like Matt who are all that you mentioned above. Here's to continued success!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "112121460122647765761", "name": "Kristin Waters Sullivan", "time": 1616425139728, "rating": 5.0, "text": "Everyone at Uptick has just been fantastic to work with, and their results speak for themselves. Cannot recommend them highly enough.", "pics": null, "resp": {"time": 1616711914653, "text": "Hi Kristin! We're glad to see you've seen results. You've been such a joy to work with and we're so glad to be a part of your success story. To continued years of success!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "104903308599738219941", "name": "Mark Lucas", "time": 1599669088709, "rating": 5.0, "text": "Uptick Marketing has an extremely knowledgeable and friendly staff. They understand the ins and outs of SEO, marketing and web development in ways we had previously overlooked. Uptick's team not only did a great job working with us to improve our existing website and web presence but they also educated us on the importance of maintaining a website that convey's our organization's message in  clear and concise manner. Uptick's client communication is great and they  are always willing to help!", "pics": null, "resp": {"time": 1599677842898, "text": "Mark, we've enjoyed every minute working with your organization.  You all provide a much needed service for our community!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "106320883002949539474", "name": "Paul Neville", "time": 1615417209694, "rating": 5.0, "text": "They are experts in the field of digital marketing and do excellent work for their clients.", "pics": null, "resp": {"time": 1615565330014, "text": "Thanks for your review, Paul!\n\nWe always try to stay on top of the latest trends in everything digital so we can help create success stories for our clients. We're glad to be able to work with great organizations like Northstar!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "101195919649157918969", "name": "Pam Sanderson", "time": 1581719139524, "rating": 5.0, "text": "I love working with Uptick! Superb team of professionals that work tirelessly to stay on top of the latest trends and google algorithm changes. I am constantly impressed by the high level of service and dedication to their craft. I highly recommend them to anyone looking for digital marketing services!", "pics": null, "resp": {"time": 1582046929324, "text": "Thanks, Pam!  We appreciate your kind words about trusting us with all digital marketing needs.  We look forward to continuing our work together!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "112529515590172999613", "name": "Claire Vaughn", "time": 1581083100060, "rating": 5.0, "text": "I have worked with Uptick on multiple projects across industries—both professionally and through volunteer efforts. The Uptick team is extremely professional and knowledgable. They are extremely easy to work with and I am particularly impressed with the data metrics they use to demonstrate the progress and success of each project. Highly recommend!", "pics": null, "resp": {"time": 1581362627459, "text": "Claire -  We love hearing about your success stories.  The best part is that we get to be a part of it.  We look forward to continuing working with you!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "114920873895393348306", "name": "Rod Palmer", "time": 1567093087205, "rating": 5.0, "text": "These folks are great. They took my team in and treat us great. Get our vision and they are truly excited about our business. Cant praise Jerry , Bo and the gang enough.", "pics": null, "resp": {"time": 1567546633374, "text": "Rod, we've loved watching your company start from the beginning and grow into what it is today.  It's such an amazing experience that we get to work alongside you!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "106578045777748880834", "name": "Danelle Murray Weaver", "time": 1566333923218, "rating": 5.0, "text": "It was a pleasure to work with Uptick Marketing on our keyword research for the Center for Educational Technologies housed within the College of Veterinary Medicine at Texas A&M University. They did an amazing job at the research and discovery of our industry, competitors and target markets. With this information they created a fool proof strategy that we could implement with ease. Lance Moore and Anna Sims were extraordinarily patient with my learning curve and shared so many tips and tricks to further benefit our success. They worked seamlessly with Pamela Sanderson at their sister company, Infomedia, who was also incredible to work with.  They all were very responsive and genuinely cared about making this a positive experience for myself and my colleagues. Don't worry if you aren't located in Birmingham, Alabama. I am located in College Station, Texas and Uptick made sure there were no challenges due to the distance.  If you are looking for a digital marketing agency, look no further - you have found them.", "pics": null, "resp": {"time": 1566398576110, "text": "Thanks so much for your kind words, Danelle. You were so communicative and engaged in our process, and we thoroughly enjoyed working with you on this project. We look forward to more opportunities to partner with you!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "107760700312770552370", "name": "Fred Henry", "time": 1566584097941, "rating": 5.0, "text": "Active, vibrant group that is customer focused.  They have worked hard to understand our business and are willing to adjust their approach as needed.  Matt Spivak is our contact and he does a great job!", "pics": null, "resp": {"time": 1567546368105, "text": "Thanks, Fred!  We try our best to be customer-focused!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "110945363804001987751", "name": "Amanda Carden", "time": 1566321109725, "rating": 5.0, "text": "We could not be happier with the services that Uptick has provided us. Jerry, Alan, and their crew are amazing! Give them a try and thank me later!", "pics": null, "resp": {"time": 1566324981539, "text": "Thanks, Amanda!  We appreciate your kind words about our marketing services.  We love working with you and look forward to many more years!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "109593740481406655371", "name": "Jessie King", "time": 1566853510093, "rating": 5.0, "text": "Uptick has been phenomenal to work with. They go above and beyond, time and time again. I could not be happier with the service they provide and the level of professionalism they help me achieve.", "pics": null, "resp": {"time": 1567546488895, "text": "We love working with you too!  Thanks for trusting us with your digital marketing needs!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "101089611626604183087", "name": "Clay Haley", "time": 1433085717542, "rating": 5.0, "text": "I have been working with Uptick Marketing for more than 2 years now and have been extremely happy with the results. I am not a tech savvy person but they have gone out of their way to make me feel confident in the decisions we have made and will always do everything they can to explain any questions I have. They work very hard to maximize my budget no matter what I am spending. They listen to me and put together plans and objectives that meet my goals. Nicole and her team have been tremendous to work with and I consider them part of my business.", "pics": null, "resp": {"time": 1433090452575, "text": "Clay,\n\nThank you for your review! We have absolutely loved working with LA Bikini and look forward to helping you as you venture into franchising for your business."}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "104200990689618231263", "name": "Melvin Upchurch", "time": 1429553418631, "rating": 5.0, "text": "Uptick Marketing has helped us launch a startup company and achieve almost instant credibility. Our online look is so impressive, many of our clients thought we were part of an established national network. We appreciate the creativity and expertise that have helped us achieve market success. Thank you Uptick Marketing!", "pics": null, "resp": {"time": 1429801943867, "text": "Thank you, Melvin! It has been a pleasure to work with LIST Birmingham."}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "102235113058008910991", "name": "Miles Worsham", "time": 1579708186611, "rating": 5.0, "text": "I have worked with \"W\" to help grow our Company's footprint through our website and on the internet. Uptick is a great Company and they have helped us to understand the importance of what they can do.", "pics": null, "resp": {"time": 1579729144884, "text": "Miles, we’ve enjoyed assisting you with the development and management of your company’s website! We look forward to hearing about your company’s continued success."}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "114185835321405580794", "name": "Kyle Moon", "time": 1566571986525, "rating": 5.0, "text": "Our experience with Uptick has been phenomenal! We have tried and failed with multiple marketing firms and we can officially say that Uptick has been the difference between our small business staying small and becoming an empire! They keep our phone ringing and thats all I need to say! Matt, especially, is a pleasure to work with. His attention to detail and his constant checkins and updates make this move well worth the money for us. He is a great human being and truly loves what he does, you can see it in his work. He deserves a raise!!!..Because, in the end, Matt's constant kindness and attention to detail is truly the deciding factor for us at Uptick. And employees like that are what separates their firm from the rest of the marketing groups in BHAM. UPTICK ALL THE WAY!", "pics": null, "resp": {"time": 1567546315595, "text": "Kyle, we appreciate you taking the time to leave a positive review about us.  We agree - Matt is a pleasure to work with.  We look forward to continued success!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "117607407654238016071", "name": "Elizabeth Ritter", "time": 1429543480317, "rating": 5.0, "text": "Uptick Marketing is assisting me with AdWords and SEO for my website.  They are extremely knowledgeable and are great at communicating the status of each project to me on a monthly basis.  They provide a customized solution that is tailored to my particular budget.  I would highly recommend Uptick to business owners that are overwhelmed by digital marketing and want to use their website and other platforms to generate leads and thereby increase revenue.", "pics": null, "resp": {"time": 1429546747413, "text": "Thanks Elizabeth! It has been great working with Ritter Law Firm and we look forward to continuing that relationship in the future!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "103971158521279636342", "name": "Avanti Polar Lipids", "time": 1566744589045, "rating": 5.0, "text": "What can we say?! Uptick Marketing is simply the best! The Avanti team has had the pleasure of working with Uptick Marketing on complete digital/social media marketing campaign from  PPC to CIA to SEO to social media/blog posts and everything in between! The customer service is second to none. They are experienced professionals who are experts at communicating complex concepts to non-expert audiences. The team is composed of well-organized, deadline-oriented individuals who not only get the job done - but get the job done well!  Uptick invests in each project with team members personally familiarizing themselves with aspects of the business in order to best meet the objective of the business and industry as a whole. They are committed to creativity and helping organizations stay on the cutting edge of the state of the art! Huge endorsement and thanks from the Avanti team! And, a big shout out to Matt, Anne, Madison, and Peyton for being the best team around! It is a truly a pleasure to work with you!", "pics": null, "resp": {"time": 1567546440238, "text": "Thank you for all your many generous comments about our team.  We strive to provide the best results and service!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "110932783308102650698", "name": "Shawna Boswell", "time": 1520528499277, "rating": 5.0, "text": "Uptick Marketing is incredible. We have been working with them for years here at ProcessBarron, and they continue to prove their expertise, professionalism, and effective marketing efforts. As Marketing Associate for ProcessBarron, I work with them directly. Not only are they respectful of our budget, but they create a plan to ensure we get those most effective services for our allotted spending. They are constantly improving and presenting new services that can be offered - truly showing their ability to be ahead of the game in the marketing industry. Uptick also takes the time to really understand our company, the industries and people we work with, and the best ways to communicate what we do. Working with them has proved to be extremely beneficial to our company. Not to mention, they are very personable and honestly a joy to work with!", "pics": null, "resp": {"time": 1521465745750, "text": "Thanks, Shawna!  We appreciate the kind words and love working with you too.  We look forward to many more years of working together!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "101686618701511713371", "name": "Jeffrey Solomon", "time": 1421790704804, "rating": 5.0, "text": "I perform marketing director duties for a client in Alabama, and we recently entered into an agreement with Uptick. Finally, a communication company that communicates, even when the contract isn't due for renewal! Thanks for an easy transition, the prompt replies and the honesty.", "pics": null, "resp": {"time": 1421791192122, "text": "Thanks for the kind words - we are glad to have you on board!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "106910718895030804650", "name": "Robert Montgomery", "time": 1450560819727, "rating": 5.0, "text": "Highly recommended!\n\nThese folks love what they do and they care about the clients that they work with.  If you are serious about driving traffic, generating more leads, and increasing sales then hiring Uptick Marketing to help grow your business is hands down one of the smartest decisions you can make.", "pics": null, "resp": {"time": 1455898785182, "text": "Robert, thank you so much for your kind words. It has been great working with you!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "103541380428516852404", "name": "Adam Zeidan", "time": 1529718790041, "rating": 5.0, "text": "Some of the best digital marketers that I have ever met period. They won't let you down!", "pics": null, "resp": {"time": 1530547500087, "text": "Thanks, Adam!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "109823540289268164612", "name": "Victours Travel", "time": 1589256375499, "rating": 5.0, "text": "She is the best person to work with ever", "pics": null, "resp": {"time": 1589923097648, "text": "(Translated by Google) Thanks, Fhionh!\n\n(Original)\nThanks, Phionah!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "110631147795590983633", "name": "Chris Roberts", "time": 1429803388664, "rating": 5.0, "text": "I have worked with Jerry Brown, Lance Moore and Jason Lovoy and they are absolutely TOP NOTCH!!  I have worked with 3 other digital marketing firms in the past, and these guys are 10 steps better than all the previous ones combined.  They follow up with me, they answer my questions, they are proactive in determining my needs, and most importantly, they treat me and my business with care and personal attention.  My business has grown exponentially since working them!", "pics": null, "resp": {"time": 1429805002718, "text": "Thank you for your kind word, Chris. It has been great to work with Two Trees Counseling and to see your business grow! We look forward to continuing working with you."}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "114990395873155706932", "name": "David Johnson", "time": 1419637687751, "rating": 5.0, "text": "I am the Executive Director for Doulos Partners and we have just entered into a partnership with Uptick in November. Even though we are only into our second month in working with them, we have been completely blown away with their professionalism and abilities. Working with Nicole Beachum has been such a pleasure and we are very excited about the progress we are already making in getting our name, vision, and stories out about our ministry to a broader audience.", "pics": null, "resp": {"time": 1421791262153, "text": "It has been an absolute pleasure working with David and Doulos Partners - which is an incredible organization that everyone should check out. Thank you, David, for your kind words."}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "112720366833108313716", "name": "Meredith Jones", "time": 1419865995989, "rating": 5.0, "text": "Uptick Marketing is phenomenal at what they do and are able to do it at a cost that makes sense for a small business.  They will come up with recommendations that are tailored to your needs and are not a one-size-fits-all firm.", "pics": null, "resp": {"time": 1421791229755, "text": "Thank you Meredith! It has been great working with your company."}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "105607574974222277153", "name": "Mary Dawson", "time": 1429542680438, "rating": 5.0, "text": "The people at Uptick know what they're doing, and treat each client like they're their only client. Anyone looking to grow their business needs to work with them - they're professional, dedicated, and their efforts always pay off.", "pics": null, "resp": {"time": 1429546705347, "text": "Thanks for the review, Mary! It has been great working with you."}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "104346181151373765817", "name": "Jason E.", "time": 1521568708806, "rating": 5.0, "text": "Solid, capable people who are committed to keeping their customers happy.", "pics": null, "resp": {"time": 1521584624124, "text": "Thanks, Jason!  We appreciate the generous words!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "113126886385517614426", "name": "Doug Hartman", "time": 1491345544042, "rating": 1.0, "text": "Waste of my time. When I sat down with Jenny I told her what I was spending and what I wanted to spend per month for SEO and PPC. We spent an hour going over the company and what I have done in the past 30 years. I'm not new to the internet marketing game. I have worked with yodel and reach local and several other big players in the internet marketing. She emailed me my proposal very quickly but obviously did not listen to anything I said as her estimate was almost three times what I told her I wanted to spend per month at a total cost of over $6000. In addition to that, I was also quoted almost $15,000 for other services. While I did not use their service I feel it was a waste of my time to even meet with them.\nI did receive a call under the guise of needing work done from their managing partner Nicole , asking why I left a negative review for them on Google if I did not pay them to do any work for me. I told her that I would go back on and I would modify my review so that people would understand I did not pay them but that my time was wasted in the phone calls, emails and meeting with them where obviously they did not listen to a word I had to say. This is why I left a negative review for them. They might do a wonderful job in marketing and advertising but I will never know because I will not use them.", "pics": null, "resp": {"time": 1491415354562, "text": "Doug,\n\nWe are disappointed to hear of your frustration with our consultation process and the speediness in which we sent the proposal.\n\nOur goal is to provide tailored strategies for every client based on their specific situation, needs, and goals. Our recommendations are always based on what we believe will specifically help your business achieve online success and may sometimes go beyond stated budgets.\n\nWe hope you're able to find a solution that is a better fit for your needs - and wish you luck in your business adventures!\n\nThank you for your input, your time in the call, and your revised review."}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "107975163611863655168", "name": "Doug Marshall", "time": 1456623003304, "rating": 5.0, "text": "As CFO of the Alabama Family Trust, we came to Uptick Marketing with an outdated website that was not mobile compatible, responsive, or easy to use.  In short, it needed an overhaul.  AFT is a 501c3 organization created under Alabama Statute to administer special needs trusts for children and adults with disabilities, protecting their assets in a SNT to help enable Medicaid eligibility. While this area of the law can be very complicated, the team at Uptick Marketing was invaluable in helping design our new website so that viewers could more easily navigate our website and better understand how AFT operates to serve individuals with disabilities.  Uptick provided us both the technical expertise to create the website and the marketing creativity to build it in the best way to reach those most in need of our services.\n\nAs the former VP/Controller of Alagasco, Chair-Alagasco IT Initiative Council, and Member-Energen Corporation IT Steering Committee, I have worked with many strong, talented IT professionals on multiple IT projects during my career at Energen/Alagasco, and the professionals at Uptick Marketing are right in there with them.  Nicole Beachum, Jerry Brown, and the entire Uptick team did a GREAT job and were EASY to work with.  Their pricing is very fair, and we are looking forward to a long-term partnership together as they are now completely handling our social media management.\n\nThese guys are true professionals - ON THEIR GAME, TOP OF SHELF TEAM, REALLY FUN TO WORK WITH, AND ALWAYS HAVE GREAT COFFEE FOR OUR STRATEGY MEETINGS!   ---- Doug Marshall, CFO of Alabama Family Trust", "pics": null, "resp": {"time": 1456762845057, "text": "Thank you very much for the kind words, Doug.  We enjoy working with your team and look forward to the future."}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "103701172021316493655", "name": "Jay R", "time": 1513089820243, "rating": 5.0, "text": "Jason and the marketing professionals at Uptick partner with you to advance your endeavors. They ask you questions so they can provide you great service and an informed response.", "pics": null, "resp": {"time": 1513173446667, "text": "Thank you, Jay!  We appreciate the time you took to leave positive feedback online.  We look forward to our continued marketing efforts in the future!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "111903491734485241011", "name": "Josh Watkins", "time": 1493262217475, "rating": 5.0, "text": "It's not just the culture, these guys really care about your business and it succeeding.", "pics": null, "resp": {"time": 1493320877986, "text": "Thank you for the kind words!"}, "gmap_id": "0x888918d97aff51b1:0x3bb0133a155853a7"}
{"user_id": "106419758308044876902", "name": "Triple Six", "time": 1588822085452, "rating": 5.0, "text": "I was looking for internet marketing services and social media marketing in hartselle, alabama and I was told about rogue business marketing from a friend.  Extremely knowledgeable and helpful people!  I have dealt with a marketing agency in the past but they didn't compare to these guys. Extensive knowledge of facebook marketing techniques!  I am glad to have contacted them.  Their social media marketing for my business has caused my business to grow like crazy.  I highly recommend anyone to try these guys out. You won't be sorry. I knew I was working with the right people right from the beginning when they told me that they had some questions for me to determine if they could make money for my business. They said they would not take me as a client unless they knew for sure they were going to be profitable for me.  No long term contract either. But with the results I have been getting, they dont need a contract!  Again, highly recommend.", "pics": null, "resp": {"time": 1590018212192, "text": "Thank you.  It's great working with you and your team. We are going to really explode your business this year!"}, "gmap_id": "0x8888290b5d58a03f:0x5e9a55fe2ca2bef8"}
{"user_id": "107883088480413860640", "name": "Rusty Osborn", "time": 1589415567790, "rating": 5.0, "text": "I hired Casey to do my business marketing and I could not be happier. He has brought business to me from Hartselle, Cullman, Madison, and Decatur AL. If you are looking for the best marketing company in North Alabama, Rogue Business Marketing is it!!!", "pics": null, "resp": {"time": 1590018085118, "text": "Thank you Rusty. Its great working with Innovative Fence Solutions. We want to bring you much more business in the future to help your business grow."}, "gmap_id": "0x8888290b5d58a03f:0x5e9a55fe2ca2bef8"}
{"user_id": "111078612166995827662", "name": "Hunter McGonagill", "time": 1613506056076, "rating": 5.0, "text": "V3 was a great investment for our company.  As a new small business we needed to make a solid first impression, and Chris and Trey really took their time to get to know the company and make our web presence match our goals.  We constantly get positive feed back on our site, and V3 Media is who we have to thank.  We are now repeat customers and consider them part of our team!\n\nHunter, President, Lex 7", "pics": null, "resp": {"time": 1613578487067, "text": "Hunter, we love working with you guys and are so glad to know that our work is an asset to you guys! Thank you for the great review!"}, "gmap_id": "0x888c933907287889:0x3ec922a922087a"}
{"user_id": "106038879658812170910", "name": "Ben Boyd", "time": 1612908867465, "rating": 5.0, "text": "Outstanding group of people! Top notch web design and digital marketing. Everyone I have dealt with is knowledgeable, professional and friendly! I’m always happy to support a local business", "pics": null, "resp": {"time": 1612914660470, "text": "Thank you for the nice message, Ben! We appreciate your support."}, "gmap_id": "0x888c933907287889:0x3ec922a922087a"}
{"user_id": "104240006345060471016", "name": "Eloise Stewart", "time": 1612917809580, "rating": 5.0, "text": "I have greatly enjoyed working with Chris, Trey, and Caleb at V3 Media. They are incredibly knowledgable of marketing, website design and functionality, and digital advertising. They have created and managed successful Facebook ad campaigns for us. I am thankful for their willingness to be creative and adapt the business grows.", "pics": null, "resp": {"time": 1612970217805, "text": "Thank you so much for the review Eloise, we have enjoyed working with you!"}, "gmap_id": "0x888c933907287889:0x3ec922a922087a"}
{"user_id": "115140744060065787093", "name": "Kerron Stewart", "time": 1612929213988, "rating": 5.0, "text": "I love working with V3 Media group, they are very professional, responsive, dependable, and there work truly speak volume. I will always recommend them.", "pics": null, "resp": {"time": 1612970287092, "text": "Thank you for the kind message, Kerron! We appreciate your support!"}, "gmap_id": "0x888c933907287889:0x3ec922a922087a"}
{"user_id": "117259083226014720704", "name": "Betty B", "time": 1592516679935, "rating": 5.0, "text": "V3 has been a pleasure to work with.  Knowledgeable and extremely responsive.  We have used several different companies in the past.  We should have gone with V3 the first time!  They completely revamped our website and our digital ad campaigns, which have all been a great success!  I would strongly suggest using this group!", "pics": null, "resp": {"time": 1592584194863, "text": "Thanks for the kind words, Betty! Glad we've been able to help grow y'all's business."}, "gmap_id": "0x888c933907287889:0x3ec922a922087a"}
{"user_id": "100891468811741520327", "name": "Tess Gibson", "time": 1560372186095, "rating": 5.0, "text": "V3 Media Group is such a pleasure to work with. They are professional, fast and have a wonderful creative eye. They are able to take vague design concepts and turn them into an amazing website. I highly recommend working with this group for any web-based needs.", "pics": null, "resp": {"time": 1560462274723, "text": "Thank you for the kind words, Tess!"}, "gmap_id": "0x888c933907287889:0x3ec922a922087a"}
{"user_id": "105464142396994757175", "name": "Ashley McCollister", "time": 1560371680894, "rating": 5.0, "text": "These guys are the best! They're always so helpful and quick to answer all of my questions. I could not ask for better SEO and site support. I will recommend V3 to anyone and everyone!", "pics": null, "resp": {"time": 1560462300244, "text": "Thanks so much, Ashley! Glad we can help."}, "gmap_id": "0x888c933907287889:0x3ec922a922087a"}
{"user_id": "102990583718674496471", "name": "Hayley Henderson", "time": 1560373620962, "rating": 5.0, "text": "I am so thankful for V3 Media Group. This company took our very bland and outdated website and gave it life and a modern brand that we could have never imagined. The team is so creative and they are willing to help the client at anytime. Additionally, their response time is incredible! Our company's website now creates a story and allows potential clients see our services before they even walk through our business doors! Check out their work at ColumbusTradeCenter.com.", "pics": null, "resp": {"time": 1560789230894, "text": "We're happy to help, Hayley! Glad y'all like the work we do! As always, if you ever need us, we're just a phone call away."}, "gmap_id": "0x888c933907287889:0x3ec922a922087a"}
{"user_id": "111842572480283820022", "name": "Sarah Martin", "time": 1560369015609, "rating": 5.0, "text": "We've had a wonderful experience with V3 in every way possible! Website design, marketing & real estate photography! They are very responsive and make the complicated very easy to understand!", "pics": null, "resp": {"time": 1560462386075, "text": "It's easy to do a good job when we're working with awesome people like you!"}, "gmap_id": "0x888c933907287889:0x3ec922a922087a"}
{"user_id": "108735868659348783310", "name": "Elizabeth White", "time": 1560438546631, "rating": 5.0, "text": "We have worked with V3 Media for years. Their service and knowledge is outstanding!  We have worked on several services and projects with them and each one has gone seamlessly.", "pics": null, "resp": {"time": 1560462216446, "text": "Y'all are the best!"}, "gmap_id": "0x888c933907287889:0x3ec922a922087a"}
{"user_id": "109427257635443327478", "name": "Carlo Romano", "time": 1560370653647, "rating": 5.0, "text": "The V3 group has been a vital asset to our company and the growth of our web presence; site design, SEO, and Ad campaigns. So grateful to have them as part of our team!", "pics": null, "resp": {"time": 1560462335563, "text": "This means a lot coming from you Carlo! We love working with y'all."}, "gmap_id": "0x888c933907287889:0x3ec922a922087a"}
{"user_id": "115587992282422791140", "name": "John Carney", "time": 1579817016962, "rating": 5.0, "text": "I have worked with V3 for many years and would highly recommend them for any website development, SEO, or digital marketing.", "pics": null, "resp": {"time": 1592584207973, "text": "Thanks John!"}, "gmap_id": "0x888c933907287889:0x3ec922a922087a"}
{"user_id": "117687456755566707355", "name": "Ryan King", "time": 1563564556494, "rating": 5.0, "text": "Great group of responsive problem solvers.", "pics": null, "resp": {"time": 1573574249497, "text": "Thanks for the review Ryan! Glad we were able to help!"}, "gmap_id": "0x888c933907287889:0x3ec922a922087a"}
{"user_id": "107776188780906284057", "name": "Corey Craig", "time": 1560370712731, "rating": 5.0, "text": "Professional, available, real world solutions to real world problems!", "pics": null, "resp": {"time": 1560462311132, "text": "You're the man Corey!"}, "gmap_id": "0x888c933907287889:0x3ec922a922087a"}
{"user_id": "106265069847651999573", "name": "Hal Walker", "time": 1560369834823, "rating": 5.0, "text": "Fantastic Group", "pics": null, "resp": {"time": 1560462343697, "text": "Thanks Hal!"}, "gmap_id": "0x888c933907287889:0x3ec922a922087a"}
{"user_id": "105645930334633328388", "name": "Jesse Janes Jewelry", "time": 1624651669119, "rating": 5.0, "text": "I love working with this company!  I have received so much value and the knowledge they have in this line of work is phenomenal.  I highly recommend! Tony has been extremely helpful.", "pics": null, "resp": {"time": 1625258580050, "text": "we glad to be working with you on google ads and online sales!"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "113547634633876894396", "name": "Lindsey Harrison", "time": 1624040996399, "rating": 5.0, "text": "Seriously the best at what they do!  I get an answer within minutes! When we switched to Pathfinder, our business changed!  we got more traffic and calls than we ever have.  Highly recommend!", "pics": null, "resp": {"time": 1624041837499, "text": "Thank you for having us for your google ads and website auditing, its great working with you! we always try to be as transparent and responsive as possible."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "114959177272765575974", "name": "StreetBreeds Co", "time": 1617038703106, "rating": 5.0, "text": "He’s a really skilled and knowledgeable guy, has helped me out a ton with Google and definitely knows his stuff when it comes to advertising on Google. Helped me get my accounts fixed before even hiring him. Would definitely recommend Tec Tony and Pathfinder DM to any small business looking to start working with an agency", "pics": null, "resp": {"time": 1617042137353, "text": "Thank you. We love to help small business advertise online."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "116774125450288224456", "name": "Melia McKean", "time": 1610722407749, "rating": 5.0, "text": "Looking to grow your business? Pathfinder Digital Marketing is the best! Tech Tony is the master and great to work with. Thank you Tony for all your help in getting our business page back on tract!", "pics": null, "resp": {"time": 1610723945429, "text": "Thank you so much, it's great working with you and helping small businesses grow using Google ads & all of Googles online free service for small businesses. #digitalmarketing"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "112061250114857025199", "name": "Support for Clients - Disaster and Disability Consultants", "time": 1610491664277, "rating": 5.0, "text": "It's been a pleasure to work with Pathfinder Digital Marketing the past several months. I came to them with my website a mess and they worked within my budget to get a great website that met all the compliance issues. They were responsive to my needs and knew that budget was an issue.", "pics": null, "resp": {"time": 1610491836582, "text": "its great working with your website build, and ironing out the problems. I am looking forward to continue working with you."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "104870499836615305202", "name": "Lavita Nuova", "time": 1606257976898, "rating": 5.0, "text": "Tony is great to work with! I like his cutting edge approach. Always introducing  new ideas and new tools to optimize  online marketing result! Thanks Tony!", "pics": null, "resp": {"time": 1606258934237, "text": "Thank you so much, working with your Google ads and seeing the success you are having is amazing!!!"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "103305575840508861696", "name": "Jernej Rutar", "time": 1603190347510, "rating": 5.0, "text": "Well, there are no words that will describe how happy I was working with Anthony and the whole Pathfinder team. If you want to improve your online presence on Google or YouTube, Pathfinder will find the right path for you! Totally recommend to reach out to them!", "pics": null, "resp": {"time": 1603493562654, "text": "Thank you, its great working with you"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "108422616384515701191", "name": "Christopher Wilson", "time": 1610534194137, "rating": 5.0, "text": "PLEASE USE THEM,,,,I WENT FROM A MAJOR MARKETING COMPANY THAT I HAD BEEN WITH FOR 6 MONTHS WITH ABSOLUTELY NO RESULTS,,,TO TRYING OUT TEC TONY,,AND GETTING LEADS THE FIRST WEEK!!!!\nIM A SMALL COMPANY,,,BUT WITH THE NEW WEBSITE BUILD I WILL SOON BE A LARGE ONE\nSHOUTS OUT TO TEC TONY AND RAY SMITH FOR GREAT WORK AND SUPPORT", "pics": null, "resp": {"time": 1610553243499, "text": "working with your small business google ads and website has been great. we are looking forward to continue helping you grow online."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "109654560847909075331", "name": "Joshua Bane", "time": 1607962472354, "rating": 5.0, "text": "Tony has the best knowledge for your business to get results with Google.", "pics": null, "resp": {"time": 1607974017578, "text": "Digital Marketing is important in Dothan. Thank you for leting us work with you."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "113701705506907073037", "name": "Serzh", "time": 1601395836096, "rating": 5.0, "text": "Tec Tony is a Google Ad expert who can do some amazing things to help you take your business to the next level! Tec Tony is a fun, professional and responsive individual who has helped our small Amazon business grow. I look forward to keep working with him. I would highly recommend for anything Google and or Youtube related!", "pics": null, "resp": {"time": 1601482185948, "text": "Thank you so much, its great working with you in the rank one program for amazon sales."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "107991997065353040189", "name": "Nick Guadagnano", "time": 1590180894459, "rating": 5.0, "text": "Pathfinder Digital Marketing is a great company and they really know what they're doing. I also run a marketing company so this is coming from someone who respects a marketing agency that knows their stuff + always treats their customers like royalty.\n\nYou're in good hands with this team, give them a try!", "pics": null, "resp": {"time": 1590188160100, "text": "Thank you so much."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "104685438833532252965", "name": "Historic Downtown Dothan Business Association", "time": 1602214523082, "rating": 5.0, "text": "Tony is a valuable asset to Downtown. He has helped us market our neighborhood and has gone above and beyond to help local businesses.", "pics": null, "resp": {"time": 1602262504748, "text": "Thank you so much its great working with you"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "109599975653332230644", "name": "Rafael Gil", "time": 1602249815325, "rating": 5.0, "text": "Highly recommend!!!!  I only trust Pathfinder for my digital marketing needs!!  They show me PROOF of increased business!  Tony is on top of his game!  Knows all the latest updates!", "pics": null, "resp": {"time": 1594063004029, "text": "Thank you so much😊😁❤️ It's a pleasure working with The Gil Law Firm. #Lawyers #dothanlaw #amazingclients"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "100286873766023866880", "name": "Biorsi Sula", "time": 1590247206553, "rating": 5.0, "text": "Tony is a champ! He is a honest person, does his job 100% correctly on what he says and on time always! Very knowledgeable and I have been very pleased to work with him! 🥇", "pics": null, "resp": {"time": 1593534127161, "text": "Thank you. It's great working with ur Amazon store"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "106101892032917880920", "name": "Gwendolyn Gilley Construction", "time": 1602182649965, "rating": 5.0, "text": "Tony does a great job listening to our needs and making it happen!", "pics": null, "resp": {"time": 1599580747212, "text": "Thank you so much its great working with you"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "103082567896734470523", "name": "Vanessa Upperman", "time": 1598038299161, "rating": 5.0, "text": "Had some issues with google not allowing me to verify my business. They took care of it right away with no issues!!! Great customer service!", "pics": null, "resp": {"time": 1598043206352, "text": "Thank you so much, glad we where able to help!!"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "107185996296008428550", "name": "Creation Carpentry", "time": 1556503812872, "rating": 5.0, "text": "Tony was able to take a bad situation I was in and totally redesign our website in order to have it up and running with no lost time.  They handle our marketing and have really been able to nail it as far as zeroing in on the best clientele for our business. We own Escape Enterprise and since there aren’t many escape rooms around Tony put in the extra effort to research and find out the best way to market for us. He is also willing to teach you how to do the small things and coach you along the way to make sure you are educated and know what he is doing. He doesn’t just do work behind the scenes and put a hand out for money he takes time to meet with you in person show you what he is doing and what he has done for other companies and then educate you to the level you want to be at. What a great team he has assembled to manage this digital world.", "pics": null, "resp": {"time": 1556905610892, "text": "Thank you so much"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "111658599458588167868", "name": "K B", "time": 1576863713207, "rating": 5.0, "text": "Pathfinder Digital Marketing is good,real and personal. The dictionary defines superlative as: of the highest kind, quality, or order, surpassing all else, or others. Supreme.  Excellent service, great sense of humor. An overall joy to work with. 6 stars.", "pics": null, "resp": {"time": 1576868515884, "text": "Thank you so much."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "105963276509132066814", "name": "Robert Grier", "time": 1602183691997, "rating": 5.0, "text": "Best digital marketer in dothan. best at google ads and working with your small company. Tony is amazingly good at what he does, to work with your small company and build your online presence effectively. #marketing #googleads #dothan #tectony", "pics": null, "resp": {"time": 1595951648404, "text": "Thank you so much."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "100633279424861758127", "name": "Arthit Singh", "time": 1590141848714, "rating": 5.0, "text": "Working with tony has been great, extremely knowledgeable individual who took care of my google ads really well for my amazon business, appreciate it alot Tony!", "pics": null, "resp": {"time": 1590153312609, "text": "Thank you so much! Always a pleasure to brainstorm with you."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "101869380722082337567", "name": "Courtney Quinn", "time": 1567797302771, "rating": 5.0, "text": "Tony knows his stuff!  He is kind and helpful, and just a good person.  He will take the time to do everything he can to help others grown their business.  I am happy to know him.", "pics": null, "resp": {"time": 1567878226773, "text": "Thank you, i enjoy educating businesses"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "101771394071767482876", "name": "alex cole", "time": 1591648288212, "rating": 5.0, "text": "tec tony has been a big amazing help to my company. #digitalmarketing #smallbiz #googleads", "pics": null, "resp": {"time": 1593534145901, "text": "Thank you. It's great working with a small home business"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "100275818214115293060", "name": "Aaron Wyse", "time": 1566583358629, "rating": 5.0, "text": "Anthony has put a lot of effort into learning his trade and his dedication to seeing through with getting his customers results is second to none.. If you want to get to the next level. The best way to invest in your business is to let Pathfinder do the work.", "pics": null, "resp": {"time": 1559847120852, "text": "Thank you Aron"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "103726772895086585235", "name": "Candice Hemenes", "time": 1560449068339, "rating": 5.0, "text": "Tony is a top notch professional in what he does. His genuine sincerity and professionalism in everything he does, shows through the work that he does for his clients. I highly recommend him to anyone who is in the market to improve their online presence and in turn their business.I highly recommend Tony!", "pics": null, "resp": {"time": 1560450153979, "text": "Thank you so much for your review!"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "106394610950008531716", "name": "Aaron Gartlan", "time": 1562181211382, "rating": 5.0, "text": "Tony and the Pathfinder Digital Marketing team are highly trained, skilled and experienced with digital marketing and developing and implementing plans that connect local businesses with their customers in a meaningful way making a positive impact on our community. Even better, he’s an honest hardworking family man and friend.", "pics": null, "resp": {"time": 1562458838822, "text": "Thank you Aaron Gartlan of the Gartlan Law Firm. It is great working with you."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "116512348784750064206", "name": "Peter Milner", "time": 1567453681483, "rating": 5.0, "text": "Tony has helped our firm create a website and he was absolutely incredible! He walks you through everything and is extremely helpful! Thanks again Tony!", "pics": null, "resp": {"time": 1567455659947, "text": "It been great working with you. Looking forward to working on more projects. Glad i was able to get your business on Google Maps, and create your free Google Site."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "106009283042201995687", "name": "Connor Metcalf", "time": 1539898356031, "rating": 5.0, "text": "Anthony Lloyd is by the far the most knowledgeable on digital marketing in the Dothan area. Unlike most professionals who claim to be digital marketers, Tony knows how to make his clients understand what services they are paying for and how it could benefit their companies. Not only is his integrity is unquestioned but he will go the extra mile to make sure his clients gets the results they want. I recommend Pathfinder Digital Marketing LLC to any business owner that wants better results in generating more clients.", "pics": null, "resp": {"time": 1539900287588, "text": "Thank you so much! It's great working with your company and everything you have done for my company."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "110775366445527456893", "name": "Yesenia Leslie", "time": 1603138987735, "rating": 5.0, "text": "Very knowledgeable and easy to talk to.", "pics": null, "resp": {"time": 1603493575217, "text": "Thank you its is great working with you and your store"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "116865032719751666016", "name": "Brandon Shoupe", "time": 1599960504598, "rating": 5.0, "text": "Tony helped us get our location updated on Google Maps, as well as our phone number, which was critical to getting our constituents in the door.", "pics": null, "resp": {"time": 1599960813282, "text": "Thank you so much, it's great working with you."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "112578653179841028220", "name": "Ashley Brishke", "time": 1547071943615, "rating": 5.0, "text": "Really enjoy working with Tony @ Pathfinders. He has helped us tremendously and taken away so much of the guess work when it comes to Google advertising. Thanks Tony! See you again next week.", "pics": null, "resp": {"time": 1547073491260, "text": "It's great working with you and your company @eco heating and cooling. #supportyourlocalbusiness #hvac #acrepair #heatingrepair"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "100241370442659980489", "name": "Ed Lewis", "time": 1571860305950, "rating": 5.0, "text": "\"Tec\" Tony has done an awesome job in helping me with my online presence, website, and online advertising !!! Go see him , I highly recommend him for the job you may have !!!", "pics": null, "resp": {"time": 1571864667987, "text": "Thank you Ed."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "112576034106484717804", "name": "AR Workshop Dothan", "time": 1569610479087, "rating": 5.0, "text": "Tony continues to bring literally hundreds of new customers to our web page   He knows his stuff, no fluff and backs it up with searchable facts.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNaI7MYP-0-1VWV81xhxF_n6MgKxjIhsZAybhL3=w150-h150-k-no-p"]}], "resp": {"time": 1569611849406, "text": "Thank you for letting me work with u."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "110687232656953076142", "name": "Harry Grier", "time": 1559843556592, "rating": 5.0, "text": "Tony understands how digital marketing really works. This is his only business, not selling other types of marketing with a little digital stuff thrown in. He stays abreast of all the changes that Facebook and Google make to their algorithms so he can maximize his clients marketing dollar.", "pics": null, "resp": {"time": 1559847072834, "text": "Thank you so much Harry, it has been great working with you."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "100429783229105380159", "name": "Jason Shepard", "time": 1566412948644, "rating": 5.0, "text": "Tony is always a pleasure to work with.  Very knowledgable and does a great job.", "pics": null, "resp": {"time": 1566417612356, "text": "Thank you so much, it is great to work with you"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "107108793173900605750", "name": "Rick Jenkins", "time": 1559844568495, "rating": 5.0, "text": "Tony takes the time to understand your business goals and works diligently to help you stand out above your competition. I highly recommend him and his services!!!", "pics": null, "resp": {"time": 1559847094440, "text": "Thank you Rick. It's great working with you, I am looking forward to working with you."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "115837635953130292720", "name": "Kelley York-Massingill", "time": 1559849472658, "rating": 5.0, "text": "Tony is incredibly knowledgeable and easily translates this into a digital marketing plan your business needs to grow!", "pics": null, "resp": {"time": 1560006416266, "text": "Thank you. It's great working with you."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "108445899413718067309", "name": "Kaytlan Herrin", "time": 1560006541498, "rating": 5.0, "text": "Very knowledgeable in the area of google ads and social media ads. Expert at website design and maintenance.", "pics": null, "resp": {"time": 1560280022817, "text": "Thank you"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "114436750348961557152", "name": "MUNIR ULHAQ", "time": 1546887306938, "rating": 5.0, "text": "Very knowledgeable,and friendly person. Highly recommended", "pics": null, "resp": {"time": 1546888073863, "text": "It is great working with you."}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "117641655909292696797", "name": "Whitney Sherling", "time": 1547754363062, "rating": 5.0, "text": "Tony is a great guy to work with and extremely knowledgeable. Do your business a favor and reach out to him for your digital marketing needs!", "pics": null, "resp": {"time": 1548618411405, "text": "Its been great working with you. looking forward to working with you some more"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "104328752808523125959", "name": "Chris Register", "time": 1536264705510, "rating": 5.0, "text": "The owner Tony truly knows what he is doing. My businesshas grown more than radio,tv or billboard.", "pics": null, "resp": {"time": 1536265356337, "text": "Thank you for the  great review 👍"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "116156058231170684913", "name": "Anthony Tec Tony Lloyd", "time": 1511975037173, "rating": 5.0, "text": "SEO/PPC SPECIALIST", "pics": null, "resp": {"time": 1511975372430, "text": "Thanks!"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "115383526427406646915", "name": "Michael Chancy", "time": 1567619111464, "rating": 5.0, "text": "Really knows what he is talking about.", "pics": null, "resp": {"time": 1567878202451, "text": "Thank you. It is great working with you"}, "gmap_id": "0x888d44b19b7d034f:0x6874da464d593ad7"}
{"user_id": "105931976750454029240", "name": "Bryan Carter", "time": 1623155067098, "rating": 4.0, "text": "Effective, Creative, Professional and Friendly.", "pics": null, "resp": null, "gmap_id": "0x888c2a5385a9ee7b:0x7c40110dd9243bb6"}
{"user_id": "112858475004646862511", "name": "J.L. Fisk", "time": 1533048744381, "rating": 1.0, "text": "Go Bell Media and Go Broke! Absolutely the worst investment I have ever made in Digital Marketing. Over my 13 years of hiring agencies I have had good ones and not so good. Bell Media LLC by far the worst. Certainly, the most expensive, saw the least amount of results. I left a good agency hoping to improve on my lead generation and my leads torpedoed digital and organic and never recovered. Nice slick presentations, videos and no results. It is as if they are learning and making it up as they go and experimenting with your ad dollars, and your livelihood.  Take note for a digital internet marketing company they have no place for reviews good or bad? They are not even a member of the BBB? That also keeps them from having to deal with unhappy clients and or reviews. These guys are awful and I can prove it.  Call me", "pics": null, "resp": null, "gmap_id": "0x888c2a5385a9ee7b:0x7c40110dd9243bb6"}
{"user_id": "116939636788288178614", "name": "Jon Doss", "time": 1558039654811, "rating": 5.0, "text": "My digital presence went from zero to hero with the help of BM!  I couldn’t be more excited except that keeping up with the new sales and traffic has been exhausting. My only regret is not becoming a customer sooner.\nJon D.\nBirmingham, AL", "pics": null, "resp": null, "gmap_id": "0x888c2a5385a9ee7b:0x7c40110dd9243bb6"}
{"user_id": "114204552143651632535", "name": "Dianna Lee", "time": 1533311123942, "rating": 5.0, "text": "We have been working with Bell Media for almost 10 years.  They have consistently been cutting edge, customer-service oriented and reasonably priced.  Bell Media is a great company with personnel who are very easy to work with!\nDianna Lee\nTroy Bank & Trust", "pics": null, "resp": null, "gmap_id": "0x888c2a5385a9ee7b:0x7c40110dd9243bb6"}
{"user_id": "109897514318275744504", "name": "Alan Craft", "time": 1533078506257, "rating": 5.0, "text": "Bell Media is a fantastic overall company from top to bottom. They’ve been instrumental to our business, during the startup phase and as we’ve grown. I’ve had the privilege of seeing the company grow and evolve over the years into a first class digital marketing company. I refer my small/medium size business clients to Bell Media without hesitation because I know they’ll receive top notch service delivered by professionals with an extremely high level of expertise.", "pics": null, "resp": null, "gmap_id": "0x888c2a5385a9ee7b:0x7c40110dd9243bb6"}
{"user_id": "108368421335316664470", "name": "Jessica Powell", "time": 1533327816703, "rating": 5.0, "text": "I love working with Bell Media!  My account managers are knowledgeable, personable and easy to work with. I could not recommend them more.", "pics": null, "resp": null, "gmap_id": "0x888c2a5385a9ee7b:0x7c40110dd9243bb6"}
{"user_id": "102857959969804383138", "name": "Ultraspy", "time": 1558072121936, "rating": 5.0, "text": "I’m very pleased with the support I received from the Bell Media team.  The response was fast and friendly. Thanks team!", "pics": null, "resp": null, "gmap_id": "0x888c2a5385a9ee7b:0x7c40110dd9243bb6"}
{"user_id": "101553463164070662355", "name": "stormtracker1", "time": 1558062771572, "rating": 5.0, "text": "The support team at Bell always does an awesome job helping me out with my website issues - I definitely recommend them!", "pics": null, "resp": null, "gmap_id": "0x888c2a5385a9ee7b:0x7c40110dd9243bb6"}
{"user_id": "108264065263985256386", "name": "Clay McInnis", "time": 1533086860984, "rating": 5.0, "text": "Bell Media is top notch! If you want an effective team and strategy behind your growth as a company or organization go with this company.", "pics": null, "resp": null, "gmap_id": "0x888c2a5385a9ee7b:0x7c40110dd9243bb6"}
{"user_id": "116941894678936395298", "name": "David Luddington", "time": 1558433440533, "rating": 5.0, "text": "Great service, Jake is always ready to help. Highly recommended", "pics": null, "resp": null, "gmap_id": "0x888c2a5385a9ee7b:0x7c40110dd9243bb6"}
{"user_id": "114358729809296924778", "name": "Julianna Kaye", "time": 1558114450800, "rating": 5.0, "text": "The help desk at Bell Media was polite and quick at fixing my issue!", "pics": null, "resp": null, "gmap_id": "0x888c2a5385a9ee7b:0x7c40110dd9243bb6"}
{"user_id": "104640243380005350590", "name": "Kimberly Mueller", "time": 1558225463307, "rating": 5.0, "text": "Was really happy with the service Jake Evans provided\nme!", "pics": null, "resp": null, "gmap_id": "0x888c2a5385a9ee7b:0x7c40110dd9243bb6"}
{"user_id": "106335980442213078128", "name": "Griffin Capps", "time": 1559251203200, "rating": 5.0, "text": "Bell Media makes fantastic websites and is extremely easy to work with.", "pics": null, "resp": null, "gmap_id": "0x888c2a5385a9ee7b:0x7c40110dd9243bb6"}
{"user_id": "106991314674904129131", "name": "Chip Gentry", "time": 1485311238337, "rating": 5.0, "text": "Unique advertising strategies with an ROI", "pics": null, "resp": null, "gmap_id": "0x888c2a5385a9ee7b:0x7c40110dd9243bb6"}
{"user_id": "110636705696727654118", "name": "pamela knight", "time": 1567557977415, "rating": 1.0, "text": "Annoying", "pics": null, "resp": null, "gmap_id": "0x888c2a5385a9ee7b:0x7c40110dd9243bb6"}
{"user_id": "117807557896104808508", "name": "Jason Kelly", "time": 1601574963836, "rating": 5.0, "text": "Strong Automotive works very hard for their clients, and have developed strong bonds with their media partners. Working with Strong, I am guaranteed detailed communications, and the items I need for a successful campaign are going to be delivered in a timely manner. I highly recommend working with them, if you need their services.", "pics": null, "resp": {"time": 1601647863712, "text": "Thank you for your review, Jason! Your kind words mean so much to us. We are so glad you have had a great experience working with us and we hope that never changes! Please let us know if there is anything we can do for you. Have a great weekend!"}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "118280099362659724572", "name": "Erika Rios", "time": 1574347688565, "rating": 5.0, "text": "I am thrilled to be part of this talented team that continually drives results for our clients. The work we do is valuable, and management recognizes us for our hard work. Not only does Strong value the importance of digital marketing, but we ensure our clients do through continuous learning. Our yearly Strong Digital Marketing Summit at Google's Headquarters is a prime example of it. We invite our dealers to come to learn about paid search, service marketing, YouTube pre-roll, and local marketing. I highly recommend working here or better yet hiring Strong to take your dealership to the next level.", "pics": null, "resp": {"time": 1574368118223, "text": "Thank you for your review, Erika!"}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "115066928371365438972", "name": "David McMath", "time": 1572385610581, "rating": 5.0, "text": "This place really knows what it's doing. In business since the 70s, STRONG has not shifted its focus to some distractingly shiny object and lost its way. STRONG has been helping individual car dealers advertise their businesses and they have just gotten better and better at it. From the Sunday papers in the way-olden days to the digital and social screens that are everywhere all day every day today, STRONG knows how to get the message out there. Good job, SAM.", "pics": null, "resp": {"time": 1572616874532, "text": "Thank you so much for your review and kind words! We're happy to have you on our team!"}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "108203104048157951893", "name": "Andrea M. Kring", "time": 1528944029715, "rating": 5.0, "text": "When we buy a car, we consider so many details that will reflect our individuality.  The make, model, color, price, even the tires are elements that ultimately reflect what is important to each of us.  Can you imagine not considering the engine?  What good is our vehicle if we don’t have structural integrity under the hood? It would be nothing more than a pretty yard ornament and certainly wouldn’t take you far.\n\nI was drawn to Strong Automotive because I could see it had structural integrity.  I watched the company for over a year before I decided to consider working with them.  On the exterior, it looked bright, energetic, and fun.  When I took a look under the hood, I found in this agency a diverse, highly creative, and dedicated group of people who want one thing:  to be kind of engine that drives customers to your product. Every department at this agency works closely together like a well-oiled machine (pun intended) that is always being tweaked and improved to make sure it runs smoother and faster than the day before.\n\nWhen you consider Strong to represent your business, you can know that the people who make up the company truly love what they do and they are excited about working for you.  Thanks to John Paul Strong, we have a work environment that allows us to be that high-quality engine you need to drive clients to your business. #WEARESTRONG", "pics": null, "resp": {"time": 1572530005412, "text": "Thanks for your review, Andrea!"}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "116027403893328586710", "name": "Luke Thomas", "time": 1530134089635, "rating": 5.0, "text": "To create the best product, you’ve got to have the best team. Strong Automotive Merchandising has got this down pat. The people behind this agency are friendly, creative, and diverse. Plus, the leadership understands how important it is to stay fresh with training, career development, and providing an awesome place to work.\nFor customers it’s a surefire way to drive traffic, for employees it’s a workplace full of opportunity. Either way, you can’t go wrong when you choose Strong.", "pics": null, "resp": {"time": 1572032482094, "text": "Thank you for your review and kind words, Luke!"}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "117772951541245199240", "name": "Michele Lee", "time": 1529615144614, "rating": 5.0, "text": "Strong Automotive Merchandising provides innovative, effective, and purposeful service to their clients. Not only does this company value their business with clients, but also with their employees - being named Birmingham's Best Place To Work. I highly recommend Strong to both client and future employee. Anyone would be lucky to develop a relationship with this great company.", "pics": null, "resp": {"time": 1572032497008, "text": "We appreciate it, Michele!"}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "105800213582110031720", "name": "Tony Lopez", "time": 1532004945941, "rating": 5.0, "text": "If you're an automotive dealer looking to drive results, look no further.  After 19 years of working to drive floor and web traffic for dealers,  I don't think I've worked with a team more dedicated to that.  They have a full understanding of what media needs to be used in each phase of the buying process.", "pics": null, "resp": {"time": 1572032444190, "text": "Tony,\nWe appreciate your review and kind words!"}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "100401235661534663638", "name": "Katherine Reeves", "time": 1527714843859, "rating": 5.0, "text": "Strong Automotive Merchandising is truly the only advertising agency of its kind. John Paul and his team’s deep knowledge and understanding of the Automotive industry make them uniquely qualified to service automotive clients. Strong is a full-service agency that is organized, efficient, and results oriented.", "pics": null, "resp": {"time": 1527778760951, "text": "Thank you so much for your review and kind words! We're happy to hear that you're pleased with the service we provide, and we love working with you."}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "101176373838177776957", "name": "Emily Johnson", "time": 1572616517917, "rating": 5.0, "text": "Strong Automotive is a great place to work that really cares about both their customers and their employees.", "pics": null, "resp": {"time": 1572706818964, "text": "Thank you for the review, Emily!"}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "112740085981900133702", "name": "Mimi Hoffman", "time": 1528402336355, "rating": 5.0, "text": "Strong Automotive Merchandising is not only an exceptional and very successful company, but an ideal place to work. Everyone here is very friendly, and works extremely hard to meet and exceed our client’s expectations!", "pics": null, "resp": {"time": 1572530022307, "text": "Thank you for your review and kind words, Mimi!"}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "109774611003589577684", "name": "Nathan Phillips", "time": 1470843168766, "rating": 5.0, "text": "Full service automotive merchandising solution company offering traditional marketing channels plus world-class Google Premier Partner certified digital marketing. I'm incredibly proud to be part of such a team and a movement that exceeds auto dealer's merchandising needs!", "pics": null, "resp": {"time": 1572530057703, "text": "Thank you for your review, Nathan. We love having you on the team!"}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "100014998391677947483", "name": "Scott Rossi", "time": 1422229801121, "rating": 5.0, "text": "I have been a client with Strong since 2006. They never have failed to produce.", "pics": null, "resp": {"time": 1572530072027, "text": "Thanks for your review, Scott!"}, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "112083818066161244987", "name": "Aritro Ghosh", "time": 1415792288784, "rating": 1.0, "text": "They suck!", "pics": null, "resp": null, "gmap_id": "0x8889197ea10c770f:0x6e1587b3de3bc789"}
{"user_id": "105531141080697559493", "name": "Erik Seymore", "time": 1481394736251, "rating": 4.0, "text": "Don't recall this place", "pics": null, "resp": {"time": 1477518996831, "text": "Thank you, Erik! We appreciate your feedback!"}, "gmap_id": "0x8888e04376da344f:0x3872310a753de94d"}
{"user_id": "106587539780836119855", "name": "Bradly Mullins", "time": 1490113953197, "rating": 5.0, "text": "Bay Area Events, Inc. is and exciting, challenging, fun environment to start, a great career. Your success is based on how much you are willing to put work in. You will be a part of a very goal oriented team who truly cares about where you individually want to go with the company. If you are motivated, have a positive attitude, and excel at people, this is the place for you.", "pics": null, "resp": null, "gmap_id": "0x889a4d1521a0a131:0x36caea4c419b9aab"}
{"user_id": "116939167509661517377", "name": "Graham Eric", "time": 1500334997067, "rating": 5.0, "text": "When I went, I didn't know what to expect. I was very skeptical, but it's a great positive environment to be around. The most attractive thing about the business is the opportunity it provides. Any place that allows me to further my career and grow morally and mentally as a person is a place I'm willing to do business at.", "pics": null, "resp": null, "gmap_id": "0x889a4d1521a0a131:0x36caea4c419b9aab"}
{"user_id": "114263120466072989276", "name": "exzavear", "time": 1490113443838, "rating": 5.0, "text": "One of the best places to work. You get to interact with great people every. Fun, competitive, and fast paced atmosphere. Very performance driven pay.", "pics": null, "resp": null, "gmap_id": "0x889a4d1521a0a131:0x36caea4c419b9aab"}
{"user_id": "102769011676365975112", "name": "Quavardis Morrell", "time": 1516480342965, "rating": 5.0, "text": "This is a striving and growing business I have busy this office and was very impressed with their clients and their work environment and their company goals! If I really live in Mobile Alabama I would definitely want to be a part of this company!", "pics": null, "resp": null, "gmap_id": "0x889a4d1521a0a131:0x36caea4c419b9aab"}
{"user_id": "109032429462771673668", "name": "Matthew Warden", "time": 1509988099471, "rating": 1.0, "text": "Don't waste your time on interviewing with this place it's a waste of time", "pics": null, "resp": null, "gmap_id": "0x889a4d1521a0a131:0x36caea4c419b9aab"}
{"user_id": "105405979512289964142", "name": "Walter Frazier", "time": 1499605525840, "rating": 1.0, "text": "Friendly people but not honest to your face!", "pics": null, "resp": null, "gmap_id": "0x889a4d1521a0a131:0x36caea4c419b9aab"}
{"user_id": "115562987390284807511", "name": "Jordan Davis", "time": 1504352961337, "rating": 5.0, "text": "Love this place what an amazing atmosphere!!!", "pics": null, "resp": null, "gmap_id": "0x889a4d1521a0a131:0x36caea4c419b9aab"}
{"user_id": "104957430513907337960", "name": "Aprilmayorjune Usrey", "time": 1546237421963, "rating": 5.0, "text": "Beautiful clean large lake.   Perfect for jet ski with tubing or skiing.  Jet skis are lots of fun.    Fishing is abundant with many small coves just made for a fishing boat.  Sandy areas for swimming & camping along islands on the lake.  Water is very clean. Several marinas on this large lake, lots of stores & restaurants.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOpFkBxQ4IGhSD3Ue-PrNbxAvFNfIB7Ool0qhoi=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOfJkW5j1ZmUJb9jGIGXNAa9CFwhiLXMGugSqNh=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNGBlz_NV30NLHvd59XsaM3swLBlktyCyznCNHX=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMV1wFeJ1SYpJhFJRnT_CMlTgIn3m5rFl--fcvX=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMgRpWxlpplc7eamJiLZjuWLuDHPIRpZ0IqEwVx=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPOzrcaPP1uAETsOfQSQdtRxg1Nd_dlSrsLLO3b=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNo6544OnI-cEfLgEU1xt64gLQ9rXp6PgfSy0ot=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMSFiFL1UFYoRAq7XuzEQsduz3AfCCN6KWWU5-j=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMWoea4Of24sa_Km_w_xDtfjJMxgTZS-yQMXGLd=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOuKYesGoekikQQ9gEJ0B24g_j_xRwjFtOxqa86=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN5tzlA9zFYpfrxQnE1krQbHvV6bhySUAVmMe_C=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMU6mbrXAsJY90I1FanBNzKgKU1mdDKzpBoxZVE=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPin3MEtO96G2vSHNgMeqEu5c-u9Kn_qk0Sjd7B=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNxts5xzALewZfjbhFJ8X8SryFCbcZ0Ug9S-Jaj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPGYwOT5kQvSTJztOhMbsVOz2nR_88nmya73682=w150-h150-k-no-p"]}], "resp": {"time": 1623866550963, "text": "Thank you for rating Lake Martin. Remember our website is www.LakeMartin.com."}, "gmap_id": "0x888c1225fe1bcdd9:0x5408efbd14bebcec"}
{"user_id": "109096020455247391771", "name": "R T", "time": 1500305955112, "rating": 4.0, "text": "Peaceful vacation spot.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMOuZigabkMC8bodLesBY9chZF-bpjfzFcy_h8_=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMEx7djmyHiITgcp3S79c38CbJFZVQDndUn_T62=w150-h150-k-no-p"]}], "resp": {"time": 1623866564825, "text": "Thank you for rating Lake Martin. Remember our website is www.LakeMartin.com."}, "gmap_id": "0x888c1225fe1bcdd9:0x5408efbd14bebcec"}
{"user_id": "101894572118301832321", "name": "Ken Kelly", "time": 1502642592788, "rating": 5.0, "text": "Great lake!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNp7a8fo7jDwJFnmTZjqgQDPtfPPyGiyXPM5jlg=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNTOPkT1eMzi7n4w1rN01it30ZZLv0fiJE_TB9y=w150-h150-k-no-p"]}], "resp": {"time": 1623866561319, "text": "Thank you for rating Lake Martin. Remember our website is www.LakeMartin.com."}, "gmap_id": "0x888c1225fe1bcdd9:0x5408efbd14bebcec"}
{"user_id": "108098973863904659928", "name": "Josh Mixon", "time": 1444181436480, "rating": 5.0, "text": "This is a fun family friendly place to go. My wife and I have a house here. There is plenty to do. You can swim and kayak. Our favorite place to eat is at chucks marina. My kids and I like to go to chimney rock. This is a for sure thing to do. You can just dock your boat and let the kids roam. I would definitely recommend going here for a family vacation.", "pics": null, "resp": {"time": 1623866572600, "text": "Thank you for rating Lake Martin. Remember our website is www.LakeMartin.com."}, "gmap_id": "0x888c1225fe1bcdd9:0x5408efbd14bebcec"}
{"user_id": "107632007687285362034", "name": "Timothy Blackmon", "time": 1526869618709, "rating": 5.0, "text": "Beautiful lake, great for boating, tubing, jetskiing or find a quiet cove and float and swim. Fishing can be hard since the water is clear but jsut cast away you might get lucky.", "pics": null, "resp": {"time": 1623866557384, "text": "Thank you for rating Lake Martin. Remember our website is www.LakeMartin.com."}, "gmap_id": "0x888c1225fe1bcdd9:0x5408efbd14bebcec"}
{"user_id": "104646243270043204304", "name": "Matt Hoffpauir", "time": 1564595174798, "rating": 5.0, "text": "Empowering Brands is doing amazing work in industrial marketing and local business marketing in Tuscaloosa. Their newest projects, which encourage and lift up women in industry are very exciting to see develop. They always get great results in everything they do and I recommend Empowering Brands to everyone I know in the industry.", "pics": null, "resp": null, "gmap_id": "0x8888a647f25fe707:0xc46b61c3a4b616d6"}
{"user_id": "107364717867735427538", "name": "Derrick Mcbride", "time": 1611432925827, "rating": 5.0, "text": "5 Star s rated outstanding Google maps online business and Google maps and Google photos and Google media and Google photos Shared Listed Nationwide Worldwide 💯 in Google News for I am. Listed Nationwide Worldwide 💯 True Story Rank 1 st in America", "pics": null, "resp": null, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "117591677003918640608", "name": "Qwazy Symbiote", "time": 1609219307538, "rating": 2.0, "text": "It is a good way to share experiences and help give people an idea of wether or not they want to visit or  use a particular business or place. However their ratings system does not really work and is actually quite inaccurate even misleading based on many of the reviews.", "pics": null, "resp": null, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "110286946582232714070", "name": "Lawrence Krug", "time": 1608676994064, "rating": 1.0, "text": "Sadly, Google Maps is toying with their reviews of restaurants. As a result, the ratings are corrupt and useless. Every place has four stars - unlikely.", "pics": null, "resp": null, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "106844670401626728329", "name": "Lil Joe", "time": 1601672958631, "rating": 1.0, "text": "Latey Google maps has been taking me out of the way and not just a little bit out of my way but miles out of my way in the town of Weatherford Texas I am a delivery driver so this is an inconvenience.", "pics": null, "resp": null, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "113520115723468203754", "name": "Carl Knuckles", "time": 1592331961166, "rating": 3.0, "text": "I use this app all the time and I like its updates but sometimes it freezes or just completely stops working and for the most part it finds the destination but a trucker edition or add on would be a much greater value. I can’t take every shortcut or every road through a business area. Thanks in advance", "pics": null, "resp": null, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "104766954244886264040", "name": "Robert Bentley Motors Inc.", "time": 1519901303550, "rating": 5.0, "text": "We used YP for 10 years and paid $7500 a year. Jangles offered their services which was several additional services for over half price. We gave them a shot and are very satisfied & are happy to recommend Jangles .\nJangles designed my business Digital & Print Business Cards. Designed a Custom Logo. Built Us A Website as well established us on over 5 of the mist popular Social Media Sites. They also added our business on all the search engines so that when potential customers search for our business field we pull up as 1 of the 1st you see. Our Business Base increased 2 fold.", "pics": null, "resp": {"time": 1519912620651, "text": "Thanks For the feedback!"}, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "109401182227832868027", "name": "Elite Contruction", "time": 1519901541281, "rating": 5.0, "text": "Great Service. Set our Business Up With The Right Plan 6 Months Ago Because Our Customer Base has Tripled..Thanks Jangles😀!", "pics": null, "resp": {"time": 1519912614207, "text": "Thanks For the feedback!"}, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "103242430163154685411", "name": "AIDEN STEELE", "time": 1597851939554, "rating": 5.0, "text": "I \"search(ed) google maps\".", "pics": null, "resp": null, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "105494166040366244057", "name": "Jenn Kessler", "time": 1519901670088, "rating": 5.0, "text": "Great Advertising Business ! really helped our business!", "pics": null, "resp": {"time": 1519912607477, "text": "Thanks For the feedback!"}, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "101687853376771324341", "name": "King Washington", "time": 1582413599721, "rating": 5.0, "text": "I love the experience!", "pics": null, "resp": null, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "109111478111229768649", "name": "Christy Moore", "time": 1625206851145, "rating": 5.0, "text": "Advertising", "pics": null, "resp": null, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "103551636969995835381", "name": "Arthur Coleman", "time": 1565356435119, "rating": 5.0, "text": "Great customer service 👍", "pics": null, "resp": null, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "100235552833826430929", "name": "Melanie Brumfield", "time": 1518495727747, "rating": 5.0, "text": "Great Advertising Biz!", "pics": null, "resp": {"time": 1518495888487, "text": "Thank You For Your Feedback."}, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "115735826387409390323", "name": "National Championship Photography", "time": 1536547624283, "rating": 5.0, "text": "👍👍", "pics": null, "resp": {"time": 1537469942857, "text": "Thank You For Your Feedback."}, "gmap_id": "0x888921d7ec5403cf:0x67775e996c14d3f1"}
{"user_id": "117669298193009305185", "name": "Brandie Sutton", "time": 1583852883109, "rating": 5.0, "text": "I was a guest on Talk of Alabama representing Opera Birmingham and we had a blast! Very organized and informative. We were in and out. A great experience!", "pics": null, "resp": null, "gmap_id": "0x8889225333558e6d:0x2f11814acacf9c23"}
{"user_id": "112240151867169304447", "name": "dg", "time": 1540395478695, "rating": 5.0, "text": "Love Talk of Alabama! Thanks for helping us, and other organizations, get the word out about our events. --A Taste of Louisiana Food Festival & Cook-Off", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMydVaUFqKQk3iO8FfMM7-AtnSripdvakjEEXN3=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889225333558e6d:0x2f11814acacf9c23"}
{"user_id": "101350491487595414085", "name": "Sandy Melton", "time": 1591135896323, "rating": 4.0, "text": "I was wondering if it would be possible when giving information on Covid 19, to also include those who have recovered as well? Thx for the great reporting!", "pics": null, "resp": null, "gmap_id": "0x8889225333558e6d:0x2f11814acacf9c23"}
{"user_id": "110841987451052463699", "name": "Crystal Smith", "time": 1492137415440, "rating": 5.0, "text": "I love ABC 33/40. This is the \"ONLY\" news channel that I will watch and only trust in the metrologists on 33/40. Thanks for all your hard work and dedication to use viewers from Millerville Alabama.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN5xv2dBDXVkR-FApwC2bDCMf_M1JyzyOL2VxFU=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889225333558e6d:0x2f11814acacf9c23"}
{"user_id": "112965227552800113209", "name": "Hammer Man", "time": 1571269690686, "rating": 5.0, "text": "What a great experience! We were there to promote our haunted house in Fultondale, nightmare at 3008. Everybody was very nice to us! Thank you guys for what you do!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN8NANQCFjM1CxQeDs0ByWPt_SRPtXgoVMfQ9OY=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889225333558e6d:0x2f11814acacf9c23"}
{"user_id": "110764751778668080850", "name": "Junea Childers", "time": 1573819163961, "rating": 4.0, "text": "Was here two years for a podcast interview. Was treated well by all involved in the process. Thank you!", "pics": null, "resp": null, "gmap_id": "0x8889225333558e6d:0x2f11814acacf9c23"}
{"user_id": "110549709722855806571", "name": "Kimberly Simmons", "time": 1591638817426, "rating": 5.0, "text": "Awesome crew!!!! Reports accurately no bias", "pics": null, "resp": null, "gmap_id": "0x8889225333558e6d:0x2f11814acacf9c23"}
{"user_id": "117864999955310640106", "name": "Alex Brockmann", "time": 1518634442827, "rating": 4.0, "text": "ABC 33/40 it's one of the best news stations in the Birmingham area. When I had to go here to go on the air, the staff was very friendly and showed me exactly what to do and was very helpful. I would definitely recommend this place to anybody who needs to go on the air for anything. All you have to do is to try to book an appointment.", "pics": null, "resp": null, "gmap_id": "0x8889225333558e6d:0x2f11814acacf9c23"}
{"user_id": "117225938644750013098", "name": "suzette sain", "time": 1510199565469, "rating": 5.0, "text": "This news organization is the best of the best!!\nThe people are so kind and made me feel comfortable when I was on Talk of Alabama.  Many thanks to Eric Land, Ms. Scofield, Gina Womack, Jacob, and Javante Ingram.", "pics": null, "resp": null, "gmap_id": "0x8889225333558e6d:0x2f11814acacf9c23"}
{"user_id": "117001024755645571975", "name": "Sabrina Brown", "time": 1451682502147, "rating": 2.0, "text": "Hey there is a very good and I have a good idea to have you been up for the first time I will send you the best time to do it for a", "pics": null, "resp": null, "gmap_id": "0x8889225333558e6d:0x2f11814acacf9c23"}
{"user_id": "112843004615013621209", "name": "TenSecondUniverse", "time": 1461866531638, "rating": 5.0, "text": "This is Erik perry at Jacksonville high school this is a cool news team and thx James spann for every thing that you have done for Alabama weather u keep us safe and I just wanna thank you", "pics": null, "resp": null, "gmap_id": "0x8889225333558e6d:0x2f11814acacf9c23"}
{"user_id": "103588707279929910665", "name": "Kimberly Harmon Miss Kim as Aretha", "time": 1580600045063, "rating": 4.0, "text": "Always have a nice time at ABC 33/40.", "pics": null, "resp": null, "gmap_id": "0x8889225333558e6d:0x2f11814acacf9c23"}
{"user_id": "113617803619101595280", "name": "Craig Casiday", "time": 1573502898316, "rating": 5.0, "text": "Best news station in Town", "pics": null, "resp": null, "gmap_id": "0x8889225333558e6d:0x2f11814acacf9c23"}
{"user_id": "106373646559566119281", "name": "CJ's Window Cleaning & Pressure Washing", "time": 1528212262662, "rating": 5.0, "text": "Awesome experience!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNhY1OPKVizwVKMHzCxqybhMI2Fe5KCjJR_Eyqq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPD88-5Yt9oyO1ekbP1WFvxoRMlgkeA9FBibZrS=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO4KTL8AViX_IX2_EsNKyVLTlH4KmRzTF14aP2m=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPHGR7d6YCeLz1fanj0ZQNIRKBAMaODpbl2Zz88=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO2bxTLgQWFm_9ePLIvQy3sFcwCgGrgEd4gGIqX=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMCngNptzWnMnB2osdiJ4OZyG1LoDW3ejtNsH1y=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889225333558e6d:0x2f11814acacf9c23"}
{"user_id": "102189474096878749012", "name": "Ed Fields", "time": 1468384680920, "rating": 4.0, "text": "Nice receptionist, waiting area and set. Not a convenient location for guests.", "pics": null, "resp": null, "gmap_id": "0x8889225333558e6d:0x2f11814acacf9c23"}
{"user_id": "117393085866253324133", "name": "Vondra Lane", "time": 1457706855952, "rating": 5.0, "text": "More accurate! For Alabama,this part (James Spann)", "pics": null, "resp": null, "gmap_id": "0x8889225333558e6d:0x2f11814acacf9c23"}
{"user_id": "117472264846449790586", "name": "Ella Hood", "time": 1493573913596, "rating": 5.0, "text": "Number 1 for Weather. James Spann stays with us all day when weather is dangerous. \"Respect the Polygon\"", "pics": null, "resp": null, "gmap_id": "0x8889225333558e6d:0x2f11814acacf9c23"}
{"user_id": "115126119038652269258", "name": "Candous Langston", "time": 1493688292293, "rating": 5.0, "text": "Wonderful people, great source of accurate information", "pics": null, "resp": null, "gmap_id": "0x8889225333558e6d:0x2f11814acacf9c23"}
{"user_id": "103750346457568919078", "name": "Remy Helu", "time": 1549510853563, "rating": 5.0, "text": "Yeah 33/40", "pics": null, "resp": null, "gmap_id": "0x8889225333558e6d:0x2f11814acacf9c23"}
{"user_id": "105292904603623286585", "name": "DJ Maverick", "time": 1516208778371, "rating": 5.0, "text": "Great People!!!", "pics": null, "resp": null, "gmap_id": "0x8889225333558e6d:0x2f11814acacf9c23"}
{"user_id": "115836337015574510260", "name": "Geneva Barkley", "time": 1501112630354, "rating": 4.0, "text": "I usually watch, since they are usually less inclined to bash Democrats", "pics": null, "resp": null, "gmap_id": "0x8889225333558e6d:0x2f11814acacf9c23"}
{"user_id": "113073472360171744616", "name": "Kevin Quijano", "time": 1515698934446, "rating": 5.0, "text": "great staff, awesome people.", "pics": null, "resp": null, "gmap_id": "0x8889225333558e6d:0x2f11814acacf9c23"}
{"user_id": "101652749007774882421", "name": "Kane Dawson", "time": 1501261464955, "rating": 5.0, "text": "The best station in town", "pics": null, "resp": null, "gmap_id": "0x8889225333558e6d:0x2f11814acacf9c23"}
{"user_id": "112480697808910258300", "name": "Greg Massey", "time": 1470146129634, "rating": 5.0, "text": "Great staff.", "pics": null, "resp": null, "gmap_id": "0x8889225333558e6d:0x2f11814acacf9c23"}
{"user_id": "103783917868974570411", "name": "Krystal Knox", "time": 1467289679122, "rating": 4.0, "text": "Charles", "pics": null, "resp": null, "gmap_id": "0x8889225333558e6d:0x2f11814acacf9c23"}
{"user_id": "108019001847459075516", "name": "Sabrina Seale", "time": 1422785219808, "rating": 5.0, "text": "Always been my number one channel with news an weather  👍 Thanks", "pics": null, "resp": null, "gmap_id": "0x8889225333558e6d:0x2f11814acacf9c23"}
{"user_id": "112205649613174055399", "name": "Monique Carr", "time": 1422996403164, "rating": 5.0, "text": "1go kjkkk it dyd d", "pics": null, "resp": null, "gmap_id": "0x8889225333558e6d:0x2f11814acacf9c23"}
{"user_id": "102672572275088400417", "name": "Pro Coat (Fabrication)", "time": 1568472017077, "rating": 5.0, "text": "Most of the advertising sales reps and web design wannabes we spoke with were more interested in showing off what they can do. Bizeeo was first and foremost concerned with providing us with the marketing services we needed to succeed. They spent a LOT of time at our shop learning about our products, services, equipment, and procedures BEFORE formulating an online marketing strategy or beginning development on our website. Their no-nonsense, systematic approach to business promotion was unique and refreshing. If you're only interested in a service provider who builds cool, trendy websites, look elsewhere. If you need a marketing professional, who knows how to promote your business on the Internet, contact Bizeeo Marketing Agency!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPWkqKLlarTcCWZG2m80s2bdwJlKnEoImxKK0rU=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "111794181733632536439", "name": "Steve Sanders", "time": 1620750996317, "rating": 1.0, "text": "We were promised we would own the website and domain name after our 1 year contract. 3 years later, we still don't own anything. HORRIBLE experience.", "pics": null, "resp": null, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "103788935114690151706", "name": "Chris Tarantino", "time": 1616900105544, "rating": 5.0, "text": "Vernon is knowledgeable and helped us transfer an old business we bought.  Very helpful and nice to work with.", "pics": null, "resp": null, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "107140978127037205310", "name": "Ariaa Jaeger", "time": 1604165024615, "rating": 5.0, "text": "Vernon Blake was amazing, he was able to guide me through the process of optimizing my search details which will really help increase my online profile. I am more than delighted with his professionalism and knowledge. I highly recommend Vernon and the team at Bizeeo Marketing for all your marketing needs!", "pics": null, "resp": {"time": 1604168554701, "text": "Hi Ariaa, thank you for a great review! We're always impressed when a friend has their own \"knowledge panel\" on Google's search engine results page (SERP). Glad to see you were able to claim, verify, and update your panel. It looks better than ever! One day we hope to be as famous and influential as you are to warrant our own Google Knowledge Panel. Shelley and I genuinely appreciate your kind words and for taking a moment from your busy schedule to publish a 5-star rating."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "116265173786253037833", "name": "Bailey Duos", "time": 1582048350726, "rating": 5.0, "text": "\"Bizeeo is knowledgeable, professional, caring and attentive. They created my online presence from scratch and far exceeded my expectations! I definitely recommend them for any of your marketing needs!\"", "pics": null, "resp": null, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "114002054062801087550", "name": "Ladonna Idell", "time": 1559079772561, "rating": 5.0, "text": "This is a follow up rating from my extensive experience interacting with Bizeeo. I don't know what I would have done without his help. He does a great job explaining what he is doing and how we can better manage our online presence.", "pics": null, "resp": null, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "114248760755282091601", "name": "Linda Preskitt", "time": 1569593072359, "rating": 5.0, "text": "I am completely connected to the \"Why\" of my business but as a startup sole proprietor I was desperate for someone that could help with how.  Vernon went beyond in expertise and for the first time I felt I had a partner, someone that believed in what I am doing, someone to provide the how.  If you are searching for excellence, knowledge, honesty, and a timely response, this is your Agency.  There is no better partner for your business.", "pics": null, "resp": null, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "101369889282048456920", "name": "Shelley Kim", "time": 1582062668847, "rating": 5.0, "text": "I can truthfully say that Vernon is the most honest and knowledgeable online marketing specialist I know. He keeps up to date with the latest ‘trends’ by doing research daily, and, having a project management background, can create and maintain websites - and manage their SEO, for ANY industry, from schools to law to restaurants to therapists.\n\nHe’s not about the “bells and whistles” - that doesn’t bring you business - he’s about driving business to you through his online marketing work.\n\nIf he doesn’t think he can improve your sales by driving customers to your business, he will tell you - and tell you which is the best route for you to follow.  It’s not often that you find someone that ethical these days.\n\nHonestly and trustworthiness, good work ethic and values are rare commodities these days and I’m so glad that Vernon and Bizeeo have these strengths.", "pics": null, "resp": null, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "108175476955979403510", "name": "Mila Ivanov", "time": 1567014409525, "rating": 5.0, "text": "He is very professional and excellent  job fixing my website and fcbk . And he can explain clearly, what need to be done. Thank you so much Bizeeo for helping me. You do Great!", "pics": null, "resp": null, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "108986317786183923860", "name": "Allison Shoemake", "time": 1566391068267, "rating": 5.0, "text": "Hey Everyone,\n\nRarely do I write reviews.  However, I did want to take time to acknowledge and show appreciation to our web designer and friend Vernon Blake.  He has done such a great job with our website.  One thing I like most about his work is that he takes the time to try and put in layman's terms the improvements that he is making.  Honestly, some times I get  it  and sometimes I just see the results!  Since partnering up with Vernon I definitely love how our website looks and functions but most of all I am seeing results with more people finding our business, more people contacting us through the website - which has resulted in more customers coming to the business!  And that is worth a thousand words.  Great job Vernon!\n\nThank you\nAllison Shoemake\n\n--", "pics": null, "resp": null, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "101901305400555139471", "name": "linda teel", "time": 1533221883149, "rating": 5.0, "text": "Vernon and Shelley @ Bizeeo are true webmasters!!  They have changed the face of our practice.  We are much more streamlined and efficient thanks to their guidance.  I cannot tell you how much we love them!", "pics": null, "resp": {"time": 1557590913159, "text": "Hi Linda, thanks for giving us a 5-star rating! It's a real pleasure working with you and your Montgomery staff. We really appreciate how you guys are always open to new ideas and receptive to change, which has paid BIG dividends for all of us. Who knew how a simple strategy of converting paper forms to online web forms would have such a tremendous impact generating new leads? Thanks again, we look forward to a long and prosperous relationship..."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "110986579158477488673", "name": "Ed Shoemake", "time": 1565482037996, "rating": 5.0, "text": "We have been using Vernon for sometime now.  We are very happy with our website and the way it is being handled.  We would recommend Bizeeo Marketing Agency for your business as well. ed--", "pics": null, "resp": {"time": 1557589509622, "text": "Hi Ed, thank you for the nice review! We appreciate you giving us the opportunity to provide online marketing services for your Montgomery business. It's a real pleasure working with local small business owners like yourself (and Allison), and we look forward to a long relationship."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "104776573168192410939", "name": "Peggy Raines", "time": 1559102140605, "rating": 5.0, "text": "Vernon is very knowledgeable, helpful, polite, and professional. I have been very satisfied with his recommendations and service.", "pics": null, "resp": null, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "115875958919930114222", "name": "PMMW Lewis", "time": 1551983286377, "rating": 5.0, "text": "Mr. Vernon Blake helped me in such a tremendous way!!!! Kindness is becoming very rarer theses days, especially in businesses but this proves that they’re still some good businesses out there with kind people!!!!", "pics": null, "resp": {"time": 1557589168969, "text": "Hi P Lewis, thank you for taking the time to leave a 5-star review! Good luck with your marketing plan and please let us know if we can assist you in the future."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "102950740138757252851", "name": "Train2Win Institute", "time": 1495898023883, "rating": 5.0, "text": "We hired Vernon to explore the possibility of creating a membership website for our company... Train2Win Institute. I can tell you this was a huge undertaking and Vernon was unwavering and patient in this process. If I could describe Vernon's greatest quality it would be patience, followed by a great desire to complete the job with excellence. Vernon does not settle for mediocrity. It was our pleasure to get to know Vernon and If you want excellence...Then Hire Vernon Blake!\n\nGreg Imhoff\nPresident\nT2W Institute", "pics": null, "resp": {"time": 1514318572562, "text": "Hi Greg & Suge, thank you for the kind words! The pleasure was all mine. You guys are a top-notch organization and provide a valuable service for your clients in Alabama (or wherever in the world they are located). I learned a lot while working with you and enjoyed being a part of your bilingual web design and marketing \"team,\" if only on a temporary basis. On behalf of Bizeeo Marketing, we genuinely appreciate you taking the time to leave your gracious review and 5-star rating!"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "100101481190782468781", "name": "William Runningwolf", "time": 1540996333260, "rating": 5.0, "text": "Vernon Blake is a real find! Competence, excellence, technical wizardry, and impeccable integrity. AND he produces real results. You won't find a better man out there. Stop looking, you've struck gold. He helped me out of a jam without asking for any compensation, just because he cared.", "pics": null, "resp": {"time": 1557590528570, "text": "Hi Will, thank you for the great review! I'm glad we were able to help you out of a sticky situation and very sorry that unscrupulous \"marketing consultants\" tried to take advantage of you. On the upside, we were thrilled to meet one of the most talented authors/content developers (Hi Maryla) we've encountered in a long time! Look forward to working with you on some content marketing projects in the future!"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "117872439740702695413", "name": "Linda Holmberg", "time": 1409024444241, "rating": 5.0, "text": "I approached Vernon after hearing him speak at at a counseling workshop.  He was approachable, kind and seemed knowledgeable about marketing online.  When I decided it was time to market my practice I turned to Bizeeo.  It has been a very pleasant experience!  Vernon asked questions about myself and the way I wanted to grow my practice.  I was impressed with the amount of research he conducted in order to present a professional presence. He appears to care about his clients, desiring to serve them the best way he can.  Best of all, his work began bringing in business almost immediately and paid for itself within just a few months! He and Shelley are warm, personal, professional, and serve up a great cup of coffee!  I highly recommend them!!", "pics": null, "resp": {"time": 1409033878375, "text": "Hi Linda! At Bizeeo Marketing, we make every effort to understand your business services and products, as well as your short and long-term goals. Hearing that our marketing services more than paid for themselves in such a short time-frame MADE OUR DAY! It confirms that strategic planning, recognizing the untapped potential of the web and applying targeted marketing techniques has the potential to produce quick results in many industries. We truly appreciate you and your business and look forward to serving you in the future. And we always enjoy our coffee breaks! Thank you for taking time out from your busy schedule to leave a review. Vernon Blake - Web Design & Marketing Specialist"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "102219555799163263597", "name": "Rebekah Clark", "time": 1470699866362, "rating": 5.0, "text": "Vernon and Shelley designed my web page a few years back and were great to work with. They listened to what I wanted on the site and then offered additional suggestions based on their knowledge and experience. The site turned out great and I would definitely use them again.", "pics": null, "resp": {"time": 1514319305532, "text": "Hi Rebekah! Bizeeo Marketing enjoyed designing your website and providing online marketing services for your Prattville, Alabama counseling and therapy practice. Our working relationship has been a long one, and it's been exciting to watch your business grow and prosper. Thank you very much for sharing your experience with us and posting your kind review!"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "108236639786184597708", "name": "Frances McGowin", "time": 1409703615728, "rating": 5.0, "text": "\"K-9s 4 Kids and Heroes\" is now #1 on the search engine results page in our category because of Bizeeo Marketing Agency. Bizeeo volunteered their Website Design and Internet Marketing Services beginning early in 2014. We now have a professional, functional website that is informative and directive. Any non-profit or business knows the value of an online presence that contributes to your overall mission, goals and success. Thank you so much Bizeeo!", "pics": null, "resp": {"time": 1514320263355, "text": "Hi Frances! Bizeeo Marketing considered it a privilege to donate our marketing services to such a worthy cause. Your organization provides a valuable and much-needed service for so many people (and Dogs) in Alabama, and in so many ways through your Service & Therapy Dog programs. Thank you for giving us the opportunity to play a small role in the process, and for writing your kind review!"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "115630109998380844224", "name": "Tiffany Youngblood", "time": 1557587188914, "rating": 5.0, "text": "Vernon is extremely knowledgeable, kind, & helpful. I recommend anyone in need of an expert to contact this company.", "pics": null, "resp": {"time": 1557588155305, "text": "Hi Tiffany, thanks for the kind review! I enjoyed collaborating with you regarding your e-Commerce website requirements and future online marketing plans. Feel free to contact us anytime in the future if we can be of assistance."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "114814581255436352692", "name": "Zac Williams", "time": 1532314036516, "rating": 5.0, "text": "Great experience in marketing. No nonsense, to the point, I highly recommend bizeeo. Very knowledgeable and always happy to help.", "pics": null, "resp": {"time": 1557591226727, "text": "Hi Zac, thanks for the kind words and 5-star review! We're excited about the quick results we obtained as a result of publishing your new website and applying an aggressive local SEO strategy. It was a team effort!"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "114798988453050027233", "name": "Ellen D", "time": 1397076457288, "rating": 5.0, "text": "Bizeeo Web Marketing & Design was referred to me by a mutual friend.\nVernon Blake, owner, is very knowledgeable, and very easy to work with.   He has designed an awesome website for my business always adding new and interesting articles in my specialized field .  My website is user friendly and up-to-date with the latest technology for smart phone viewing, and social media interactions.     I have been beyond satisfied with his work.    If you are considering his services I would highly recommend him.       Bizeeo Web Marketing & Design definitely gets my 5 stars!!   Thank you, Ellen Dutton", "pics": null, "resp": {"time": 1409030786787, "text": "Hi Ellen! It has been our pleasure to work with you over the past year and a half. We appreciate how you never lose sight of WHY we do what we do online, which is to find more customers for your business. Clients such as yourself allow us to ensure your marketing and advertising dollars are spent where they are most needed. We provide many marketing services, but we recommend and sell only those services that support the overall development and growth of your business. Thank you very much for taking time to leave a comprehensive review! Vernon Bake - Marketing and Business Development Services Specialist"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "115596480277714604367", "name": "Sasha Pulford", "time": 1514347967833, "rating": 5.0, "text": "Bizeeo Marketing in Montgomery provided effective, easy-to-understand marketing consulting and training services for my new business venture. They even explained SEO (search engine optimization) in a way that made sense to me. If you're in need of plain-spoken, jargon-free online advertising and quality marketing services from someone you can trust, these are the people to call. I highly recommend Bizeeo! Thank you Vernon and Shelley!", "pics": null, "resp": {"time": 1514349566739, "text": "Hi Sasha! S-E-O... We're impressed! Working with you was a pleasure! You picked up on all the marketing \"jargon\" like a real pro (even though we tried to avoid it as much as possible). I know your Pappy is proud (and so are we)! We appreciate you taking a moment to rate our services and leave a review."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "105558261031880821995", "name": "Aliesha Shepherd", "time": 1383935541321, "rating": 5.0, "text": "I have been so happy that I found Bizeeo Web Marketing & Design.  He has helped save me a lot of money and headache.  My websites and pages now rank on the first page and I am getting most of my business through Google searches and not just word of mouth!\nI asked for some advice on how to make my website more visible, I was given some excellent tips and things to do to help more people find me! I would highly recommend him to anyone who has a website and would like to have a web presence!!!\"", "pics": null, "resp": {"time": 1386091718280, "text": "Hi Aliesha! It was a pleasure to help you with your online presence. You had most of the web marketing puzzle pieces in place, all that was needed was some fine tuning - and you were a quick learner. We have been monitoring your rankings in the search engines and are thrilled to see that your small business (dog training) is thriving. Let us know if we can help in the future, and thanks for taking a moment to leave a review. Vernon Blake - Internet Marketing Specialist with Bizeeo Web Marketing & Design"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "105070166819056393683", "name": "Yvonne King", "time": 1461632747576, "rating": 5.0, "text": "Vernon and his staff are true business partners. Vernon is extremely knowledgeable concerning online marketing but unlike most online marketing companies he isn't going to recommend something unless it is a good fit for your business. Vernon takes the time to do a thorough needs assessment to learn about your business and your marketing needs-then he will make a recommendation. He is very patient and meticulous. I would recommend Bizeeo to any small business wanting a positive return on their marketing investment.", "pics": null, "resp": {"time": 1464977437818, "text": "Hi Yvonne, we REALLY appreciate you and your review! Online Marketing can be quite mysterious, even overwhelming, for most business owners. We think you probably \"get\" what we do and why we do it better than anyone we've worked with. Thanks again for submitting your review and comments."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "114566672165693307420", "name": "Billy Ferguson", "time": 1568484127011, "rating": 5.0, "text": "I hired Bizeeo to promote my DJ services for wedding, party, corporate and other local Montgomery events. They created a multimedia rich website and custom YouTube channel, including audio tracks and video clips representing the different music genres and other services I offer. They included a comprehensive booking form so potential customers could easily book an event from my website. I'm very pleased with Bizeeo's marketing services and my DJ services are now easily found in Google's search results. I highly recommend Bizeeo if you're in need of specialized online marketing and promotion services for your business.", "pics": null, "resp": null, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "111090829406892215866", "name": "Joseph Thomas", "time": 1461686368754, "rating": 5.0, "text": "I would like to Thank Vernon & Shelley for all their hard work creating a wonderful website for our company. Bizeeo Marketing Agency will go above and beyond your expectation in the research and development of your website and online searches for your business!! We have been very pleased with there services and and highly recommend their company. Thank you Bizeeo", "pics": null, "resp": {"time": 1464975886919, "text": "Hi Joey, we thoroughly enjoyed developing and designing your website. We learned so much about the \"Piano Business\" in the Montgomery River Region. We're looking forward to working with you in the future and are very happy to know you are pleased with our marketing services. But, as always, it is a team effort! Thanks for taking time to leave a review."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "100265935271884226756", "name": "Lana Grier", "time": 1386088539690, "rating": 5.0, "text": "It was refreshing to speak with a marketing agency that was completely transparent about their services. They took the time to explain what I would be paying for and precisely how they would perform their services - without using a bunch of techno-geek-babble. They even demonstrated what they had accomplished with their existing clients. This was an easy choice and one that has certainly paid dividends.", "pics": null, "resp": {"time": 1386090911243, "text": "Hi Lana,\n\nThank you for the nice review!\n\nWe do our best to educate our existing and potential clients. We have discovered that informed clients are the best clients. They know what to expect, how to hold us accountable, and work with us so that it becomes a team effort.\n\nThis enables Bizeeo to provide the best services possible and allows our clients to reap the full benefits of our efforts. It pays dividends for everyone involved. :-)\n\nThanks again for taking time to submit a review. We truly appreciate you and your business! Vernon Blake -\nInternet Marketing Specialist"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "101550549936669869722", "name": "Kyle Murchison", "time": 1514090352201, "rating": 5.0, "text": "Vernon Blake is an expert at SEO and online marketing. He revolutionized our online capabilities and allowed us to take our business to a whole new level. He's extremely knowledgeable and a pleasure to work with.  I would highly recommend.", "pics": null, "resp": {"time": 1514317393287, "text": "Hello Kyle! It's very gratifying when our clients understand the importance of \"local\" SEO and the role it plays generating new customer leads. Bizeeo Marketing looks forward to a long relationship, and we're excited to be a part of your marketing efforts in Montgomery. Thanks for your rating and review!"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "110485306258530375688", "name": "Brenda & David Duos", "time": 1582045443482, "rating": 5.0, "text": "UPDATE!!\nI just had to come back and tell you how much I appreciate the amazing difference you have made in jump starting our new business!  You had us growing the minute we opened the doors! Your insight and knowledge is incredible. There were so many details we would have never considered that make a huge difference in reaching new clients! Thank you for handling the overwhelming and super important job of marketing so we can focus on providing great service to the clients you helped us get!\n\nPREVIOUS REVIEW 2014:\nVernon has great ideas and he’s very knowledgeable! I love that he’s so patient when helping me or explaining how things will benefit our business. He also makes our overwhelming decisions much easier and that ultimately saves time and money!", "pics": null, "resp": {"time": 1386092671078, "text": "Hi Brenda! We always keep in mind that the purpose of our web consulting services is to save precious time for busy our clients, attract more customers, and promote profitability. Bizeeo handles the marketing and automation tasks which enable small businesses like yours to focus on actually running their business! Thank you for taking time to leave a review and feel free to call on us anytime. Vernon Blake - Internet Marketing Specialist"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "105792651197739397233", "name": "Gerri Taylor", "time": 1399384742120, "rating": 5.0, "text": "What a great group of professionals! Vernon Blake creates web designs/marketing plans that are effective and affordable. The Bizeeo team can build a new website or enhance an existing site; and your website will function across multiple platforms. I definitely recommend calling Bizeeo first, if you need help with web site design.", "pics": null, "resp": {"time": 1409031813082, "text": "Hi Gerri! It was great collaborating with you regarding your non-profit organization's Internet marketing project. Your knowledge and experience in your industry and thorough understanding of how the web \"works\" allowed us to cover a lot of ground in a short time-frame. We really appreciate you taking the time to leave a review. Vernon Blake - Marketing & Advertising Specialist"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "100613012383044548156", "name": "Ronald Man", "time": 1461152690628, "rating": 5.0, "text": "I met Shelly and Vernon on facebook, and decided to consult with them regarding my business. During the consultation, they gave me some excellent advice about the multitude of directories out there, and how to easily maneuver and utilize them.\nI followed there advice and saw a substantial uptick in phone calls and jobs in my local service industry business.\nVery, very helpful and knowledgeable people!\nI highly recommend!!", "pics": null, "resp": {"time": 1464975613640, "text": "Hi Ron, Online business directories are the \"new\" yellow pages. Submitting and/ or correcting your business details across the major business data providers, directory sites and review sites is an essential part of promoting your local business. Bizeeo practices what we preach, just perform a Google search for \"Bizeeo\" and you'll discover all of the Montgomery, Alabama listings, directories and social networks that we created (all for free).  It was a pleasure consulting with you. All we had to do is point you in the right direction and you took off! Thanks for taking time to leave a review."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "106553004895518822366", "name": "a.", "time": 1426858790057, "rating": 5.0, "text": "What I most appreciate about the services of Bizeeo Marketing Agency, is that they are very responsive. They've never hesitated to get back to me promptly in addressing my needs and concerns. I have also been very impressed that this group remains abreast of the latest trends and technologies which in critical in meeting customer demand.", "pics": null, "resp": {"time": 1433034381042, "text": "Hi Angie! Working with you on a variety of projects over the past 2 years has been a pleasure. What we appreciate most about you is your Project Management expertise - the ability to see the BIG picture while understanding all the moving parts. That's exactly what Bizeeo does as a Digital Marketing services provider and why I think we work well together. Thanks for taking time to leave a review and we look forward to our next collaboration. ~ Vernon Blake - Internet Marketing Consultant"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "106150811266029691174", "name": "Blake Grier", "time": 1514314864475, "rating": 5.0, "text": "Vernon provided excellent website design services for my Montgomery area business. Our site is clean and easily navigable, and it also ranks well in Google search results.", "pics": null, "resp": {"time": 1514316920941, "text": "Hi Blake! Working with you on your web design project has been a pleasure! Your Montgomery based aerial drone photography and video editing services will undoubtedly be in high demand throughout central Alabama. We're looking forward to providing additional web-related services over the next year. Thanks for taking time to leave your rating and review!"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "105243813640322533280", "name": "Leigh Mollet", "time": 1541786714883, "rating": 5.0, "text": "Bizeeo Marketing has partnered with our business for years and has always worked diligently to meet and exceed our expectations with innovative ideas and creativity.", "pics": null, "resp": {"time": 1557590115715, "text": "Hi Leigh, thank you for the kind review! It just occurred to me that our partnership is quickly approaching a 10 year anniversary, how time flies! We appreciate the opportunity to work with you and your Birmingham staff and look forward to providing web marketing services and website maintenance services for years to come."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "100587306914749864025", "name": "Kathryn Fletcher", "time": 1461257062406, "rating": 5.0, "text": "I throughly enjoyed working with Vernon and his lovely assistant Shelly. Vernon investigated every aspect of our website and business to get us the best results possible. If you need personal results for your business don't hesitate call them today!", "pics": null, "resp": {"time": 1464976189661, "text": "Hi Kathryn, your online marketing project was our biggest challenge to date. Oh, how we despise those penguins! We appreciate your patience during what was a LONG process of recovering from a Google algorithmic penalty. I still have nightmares about \"storage montgomery al\"! Just kidding... Thank you so much for taking time to leave a review."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "114588819587790455750", "name": "Z Man", "time": 1461524676067, "rating": 5.0, "text": "I have been working with Shelley and Vernon for a little over a year now and I need to give this talented duo  a huge round of applause.  They can handle everything and handle it with the urgency, creative and technical insight  that I need.  From baby shower graphics and invites to athletic challenges and into my personal business this creative couple has helped me increase internet presence, use social media more effectively and create a functional and friendly website.  Thanks again for all your help Shelley and Vernon!!!", "pics": null, "resp": {"time": 1464977182762, "text": "Hi Z Man, I don't think we have ever worked with anyone with so many irons in the fire! We could barely keep up! But we are so impressed with all you do, especially for others. Thank you for the kind review."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "112435256381244660171", "name": "Janice Prescott", "time": 1523323264743, "rating": 5.0, "text": "Shelley Blake helped me set up a Facebook business page for my handmade pottery operation (Wild Clover Studio) and connect it to Instagram. Now I only have to post the information once and it appears in both places.\n\nShelley is very knowledgeable about how the different social media applications work together. She is friendly and patient and able to explain things in plain English. And a bonus--I picked up so many tips and shortcuts for working with my phone and my computer!", "pics": null, "resp": {"time": 1524852101476, "text": "Social media marketing is an excellent online strategy for promoting your handmade pottery and other artwork, especially for potential customers in Montgomery and central Alabama.\n\nHi Janice, \"Thank you\" for taking time to leave a 5-star rating and review! You've done a great job with your Facebook promotional efforts and setting up your online store and featured products.\n\nWe thoroughly enjoyed working with you and wish you and Wild Clover Studio all the best. Let us know if we can help in the future. ~ Shelley Blake (Montgomery Social Media Marketing Specialist)"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "114588819587790455750", "name": "Z Man", "time": 1461524676067, "rating": 5.0, "text": "I have been working with Shelley and Vernon for a little over a year now and I need to give this talented duo  a huge round of applause.  They can handle everything and handle it with the urgency, creative and technical insight  that I need.  From baby shower graphics and invites to athletic challenges and into my personal business this creative couple has helped me increase internet presence, use social media more effectively and create a functional and friendly website.  Thanks again for all your help Shelley and Vernon!!!", "pics": null, "resp": {"time": 1464977182762, "text": "Hi Z Man, I don't think we have ever worked with anyone with so many irons in the fire! We could barely keep up! But we are so impressed with all you do, especially for others. Thank you for the kind review."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "112510985204794788171", "name": "Daniel Nielsen", "time": 1386183339474, "rating": 5.0, "text": "As a CEO of several public and private companies, I have over the years consulted with many marketing services providers, advertising companies and web designers. My experience in dealing with Bizeeo Web Marketing & Design has been thoroughly enjoyable. Bizeeo's personalized service is amongst the best I have known and their expertise and professionalism is of the highest standard. I have nothing but praise for what Bizeeo offers and would recommend their services to anyone looking for the best.", "pics": null, "resp": {"time": 1386639009944, "text": "Hi Daniel! I thoroughly enjoyed our consulting session and look forward to future collaborations regarding your upcoming web project(s). It is refreshing to work with a client that possesses an understanding of and appreciation for web marketing principles and strategies. Your well thought-out action plan coupled with your ability to execute makes my job MUCH easier. Thank you for your kind words and taking a moment to post a review. - Vernon Blake - Internet Marketing Consultant"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "118054869689627774011", "name": "Bob H.", "time": 1422397408823, "rating": 5.0, "text": "Vernon, and his staff have done a wonderful job for our company.  They have put in an extraordinary amount of time, and have guided us through the maze of knowledge needed to have a fully functional website and design.   His team is a dream to work with.  Thank you Vernon!", "pics": null, "resp": {"time": 1433033707813, "text": "Hi Bob! We had our work cut out for us, but you guys were great to work with! We started with a one-page website and ended up with a blog, eCommerce store, Social Media presence, online lead generation, email marketing and more. And you guys were just getting started! I really appreciate how you didn't just sit and wait for the phones to ring. You aggressively participated in Trade Shows & Conferences and actively pursued customers, something one must do in such a competitive industry like yours. It was my pleasure and a privilege to work with you and your staff for a year and help get the ball rolling. Wishing you all the success you deserve moving forward. Thanks for taking time to leave a review! ~ Vernon Blake - Web Marketing Consultant"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "112435256381244660171", "name": "Janice Prescott", "time": 1523323264743, "rating": 5.0, "text": "Shelley Blake helped me set up a Facebook business page for my handmade pottery operation (Wild Clover Studio) and connect it to Instagram. Now I only have to post the information once and it appears in both places.\n\nShelley is very knowledgeable about how the different social media applications work together. She is friendly and patient and able to explain things in plain English. And a bonus--I picked up so many tips and shortcuts for working with my phone and my computer!", "pics": null, "resp": {"time": 1524852101476, "text": "Social media marketing is an excellent online strategy for promoting your handmade pottery and other artwork, especially for potential customers in Montgomery and central Alabama.\n\nHi Janice, \"Thank you\" for taking time to leave a 5-star rating and review! You've done a great job with your Facebook promotional efforts and setting up your online store and featured products.\n\nWe thoroughly enjoyed working with you and wish you and Wild Clover Studio all the best. Let us know if we can help in the future. ~ Shelley Blake (Montgomery Social Media Marketing Specialist)"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "102201922843760610575", "name": "SAC's Gallery", "time": 1389307169756, "rating": 5.0, "text": "Vernon and Shelley have been wonderful. They rebuilt our website and are currently marketing it. We have seen improvements in traffic to our website and categories of customers for the Gallery. Thanks so much.", "pics": null, "resp": {"time": 1389652187586, "text": "Hi SAC's Gallery (Ladonna & Kathie)! Shelley and I thoroughly enjoy working with you guys, including all of your patrons and talented art exhibitors. When a client organization provides such high quality products and services as you do, our job of providing marketing and business development services is a piece of cake! Thank you for taking a moment to rate us and write a review. V. Blake - Internet Marketing Specialist"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "107917158782876540602", "name": "Sharon Bell", "time": 1468183198091, "rating": 5.0, "text": "Vernon Blake set up my website a couple of years ago, and he showed such patience and understanding with me since I am somewhat \"computer challenged\".   He and Shelley made great suggestions and helped me through the whole process.  His fee was more than reasonable, and he continues to check the website and help me with any changes I need.\n\nThe website is put together so nicely and is easy to maneuver.  I can not tell you how many clients who search the web, found my site, and have called to make an appointment with me.\n\nI just can not say enough positive about Vernon and Shelley and their work!!\n\nSharon W. Bell, M.S.\nLicensed Marriage and Family Therapist", "pics": null, "resp": {"time": 1469742476277, "text": "Hi Sharon! It has been a true pleasure to provide web design and website promotion services for your practice. Montgomery, Alabama is a great place for small, local businesses to market their products and services online, and your website project has certainly provided evidence of that. Of course, you have a LOT to do with that! We look forward to working with you in the future AND to your continued success! And thanks for taking the time to publish a rating & review!"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "112194497644220502983", "name": "Lisa Elliott", "time": 1392096865866, "rating": 5.0, "text": "Vernon has been a part of the Association for Play Therapy for years and has always been friendly and patient as he created our web presence.  Last fall, he went beyond the call of duty and he was our guest speaker for two lunch and learn meetings for the Central Alabama Play Therapy Network.  The presentations were polished, professional, and helpful to many therapists in Montgomery.  He provided valuable information to many private practitioners and agency counselors to manage their practices.  I highly recommend Bizeeo Web Marketing to any business seeking to establish or improve their web presence.  Bizeeo's customer service cannot be beat!", "pics": null, "resp": {"time": 1392097962227, "text": "Hi Lisa! It has been my pleasure working with AAPT... I really appreciate how active your organization has been over the years and your desire to make use of the web to both promote your cause and coordinate educational events. I am always available for future speaking engagements and other formal (or casual) presentations if you'd like to hear the truth about marketing your business online (that goes for any business or organization). Thank you very much for taking the time to leave a review, and I am looking forward to future projects! Vernon Blake - Marketing Specialist"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "114489763160957652511", "name": "John Courtney", "time": 1401713534252, "rating": 5.0, "text": "I was so intimidated by trying to build a website and all the information that went with it. I tried to talk to several people about the things that I needed but they all wanted to talk via email or text. When I finally found Vernon, he so kindly spent all the time I needed to help me. He solved my problem in record time. I will only use Vernon and his team in the future for all my web design and most importantly I know that I and my business are important to them. Thank You again Vernon, nothing but 5 stars from us.", "pics": null, "resp": {"time": 1409032558716, "text": "Hi John! Yes, your business IS important to us, as our success depends on the success of your business. One of our business development goals is to cut through all of the marketing techno-babble. This allows us to address and resolve marketing challenges in a manner that is understood and transparent to our clients. We constantly remind our clients that they should never accept anything we say without verifying our claims and shopping around. Ultimately, we want you to choose our marketing services NOT because we say we are one of the best, but because you have performed independent research and come to your own conclusion that Bizeeo is the right marketing service provider for your business. Thanks for taking the time to leave a review, and we look forward to working with you in the future. Vernon Blake - Bizeeo Marketing Agency"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "100006047040746085143", "name": "esala wueschner", "time": 1514330213315, "rating": 5.0, "text": "Gave me great advice over the phone. Highly recommended asking them for assistance.", "pics": null, "resp": {"time": 1514331903295, "text": "Hi Esala! We're glad we could point you in the right direction. Bizeeo Marketing uses WordPress software for all of our websites, and in your case we think WordPress.COM is an excellent choice for hosting your website. Remember to review their free themes at https://wordpress.com/themes/free and their tutorials at https://en.support.wordpress.com/start/. Good luck, let us know if you have additional questions, and THANK YOU for your rating and review!"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "108161717015002129451", "name": "Jonathan McKissack", "time": 1403633647911, "rating": 5.0, "text": "We really appreciate all the special attention and consideration provided by the Bizeeo team during our webpage construction.  They did a fantastic job helping us through the process and always treated us with professional service...a real class act!", "pics": null, "resp": {"time": 1409032829932, "text": "Hi Jonathan! When we work with clients such as yourself that possess a clear vision for your business development goals, our job becomes much easier. We thoroughly enjoyed working with you and your wife and look forward to future projects. Thank you for taking a moment to leave a review. Vernon Blake - SEO Marketing Specialist"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "116894094856529757653", "name": "Shelley Belly", "time": 1386084614567, "rating": 5.0, "text": "I'm so glad I found this company to handle a friend's marketing!  She had paid a few thousand dollars for \"web marketing\" and contacted me to complain that she couldn't be found on Google Search.\n\nI decided to Google \"Internet Marketing Services in Montgomery, Alabama\" and they are ranked #1!!  If they can do it for themselves, then they can do it for my friend / and THEY DID!!  They practice what they preach!!\n\nThank you, Vernon & Bizeeo Web Marketing.", "pics": null, "resp": {"time": 1386096193468, "text": "Hi Shelley! You know how much I appreciate you and your kind words. It pains me that small business owners spend their advertising and marketing dollars where they are ineffective. I hear horror stories like these from potential clients on a regular basis. I always advise them, whether they hire me or not, to \"do this and do that\" and \"ask this and ask that\" BEFORE selecting their next marketing agency. There are simply too many marketing service providers that over promise and under deliver, selling services that they know are not in the best interest of their clients. Even worse, many so-called \"web marketing\" agencies are experienced only with \"traditional\" marketing such as print, radio, or television, but expanded their services into the web arena in order to survive (or be more profitable). While most of these agencies are excellent at providing \"traditional\" marketing services, many of them are wholly unqualified to provide any type of online marketing services. They might be able to produce a \"pretty\" website, but that is a far cry from what is required to implement a successful, comprehensive web marketing campaign. Thanks again for leaving a review and allowing me to vent :-), Vernon Blake - Internet Marketing Specialist"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "100895179939230655573", "name": "Mickey Thompson", "time": 1582054595462, "rating": 5.0, "text": "I came back here again to thank Vernon and Shelley for the excellent work they continue to do for our business after all these years. We still have no need to do any other marketing or advertising other than the work they do for us, and I I can go about doing what I do best, and leave them to handle what they do best. I trust them implicitly and thank them for always being available when we need them.\n\nIn this day and age, it’s so nice to be able to do business with honest, decent, upstanding folks like these.\n\nFor the 7th year in a row, we have won the TripAdvisor award for best restaurant in Prattville.\n- - - -\nMy restaurant is off the beaten path in downtown Prattville, AL making it a challenge to attract new customers. In the past, I paid to advertise in the local newspaper, print magazines, print and Internet yellow pages and an online paid listing, with limited success. I hired Bizeeo over 2 years ago (October 2012) to market my restaurant online.\n\nThey manage my website, social media, business listings and online reviews (reputation management). Since then, growth has exceed 25% for 2 consecutive years.  Due to our success with Bizeeo Marketing, I've discontinued all other forms of advertising.\n\nAlso, this year (2015), our restaurant won TripAdvisor's Certificate of Excellence award (out of 99 restaurants). This is the 3rd year in a row we have won this award. I highly recommend Bizeeo - you can see for yourself online what they've done for us.", "pics": null, "resp": {"time": 1464976737257, "text": "Hi Mickey, we have learned so much about online marketing (we are ALWAYS learning) while maintaining your website and other web properties. The biggest take-away is for some industries (your Prattville business is an example), FAR more time and effort is devoted to marketing tasks \"off\" the website, like managing online reviews and promoting your brand via social media. Of course, the foundation of it all is we are fortunate enough to work with a business owner that KNOWS what customer satisfaction is all about. And... congratulations on your TripAdvisor \"Certificate of Excellence\" award for 2016... 4th YEAR IN A Row! And thanks for taking time to leave the nice review."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "111294172004688450473", "name": "Rodger Briley", "time": 1461093004289, "rating": 5.0, "text": "Really great and caring people.", "pics": null, "resp": {"time": 1464976838234, "text": "Hi Rodger, we appreciate brevity, and will respond in-kind. Thanks for the review!"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "118223902603771298516", "name": "Mack Dingler", "time": 1621921977341, "rating": 5.0, "text": "A favorite source of information and music for many years, thanks Mack", "pics": null, "resp": {"time": 1621922646439, "text": "Thanks Mack"}, "gmap_id": "0x8889cbc0817b646f:0x59c6c90a70f33d2e"}
{"user_id": "103752594097083194666", "name": "Robert Wilsford", "time": 1548447179997, "rating": 5.0, "text": "A very good station with great hometown people working there who cares about the community.", "pics": null, "resp": null, "gmap_id": "0x8889cbc0817b646f:0x59c6c90a70f33d2e"}
{"user_id": "106181953389329097582", "name": "Joseph Marsh", "time": 1517528146067, "rating": 5.0, "text": "Great radio station great music and owners", "pics": null, "resp": null, "gmap_id": "0x8889cbc0817b646f:0x59c6c90a70f33d2e"}
{"user_id": "111748162245278226325", "name": "Javon Daniel", "time": 1532797652608, "rating": 5.0, "text": "They bring entertainment with love!", "pics": null, "resp": null, "gmap_id": "0x8889cbc0817b646f:0x59c6c90a70f33d2e"}
{"user_id": "118329037276763865472", "name": "Carl Swann", "time": 1583879124692, "rating": 5.0, "text": "Awesome", "pics": null, "resp": {"time": 1584403099345, "text": "Thanks Carl"}, "gmap_id": "0x8889cbc0817b646f:0x59c6c90a70f33d2e"}
{"user_id": "111459904376144320418", "name": "richard odom", "time": 1552972326699, "rating": 5.0, "text": "Great!!!", "pics": null, "resp": null, "gmap_id": "0x8889cbc0817b646f:0x59c6c90a70f33d2e"}
{"user_id": "103574179415098269771", "name": "Valerie Chavez", "time": 1577985922560, "rating": 5.0, "text": "Its nice to have a advertising partner that helpful, knowledgeable and provides quality work.", "pics": null, "resp": null, "gmap_id": "0x888923b58aefc3f9:0x681b7ea9055cee17"}
{"user_id": "103750346457568919078", "name": "Remy Helu", "time": 1549510162548, "rating": 5.0, "text": "Helping out", "pics": null, "resp": null, "gmap_id": "0x888923b58aefc3f9:0x681b7ea9055cee17"}
{"user_id": "111799818645964975147", "name": "Michael Hemmings", "time": 1623632484877, "rating": 5.0, "text": "Great Experience with the trustway team. I would recommended their SEO services and social media marketing services.\n\nThank you guys for your help.", "pics": null, "resp": {"time": 1623707252328, "text": "So glad we could help.  Thank you for your kind words!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "118325115699826551597", "name": "Ulipur Freelancer Community", "time": 1602566710197, "rating": 5.0, "text": "They did an amazing job with our site. They have the best customer service. They always respond quickly also send updates. If there are any questions they always give me a call right away. They regularly monitor our website and let us know if there are any issues. Absolutely the best around. We are beyond thrilled that we found Trustway Marketing!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPiixmRTQI9qxt6rZKxQ-n9Vcw6nkI5pk_NtoIb=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "106646603212012069730", "name": "coleman greges", "time": 1624096863293, "rating": 5.0, "text": "The nature of the work appears to be awesome, and I'm sure it will help support my site.", "pics": null, "resp": {"time": 1624372926806, "text": "Thank you! Glad you are liking the work Trustway is doing for your company."}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "103614081520643675376", "name": "Dinis Rich", "time": 1603281899149, "rating": 5.0, "text": "Needed a company to handle social media marketing for my digital product launch last month. Got \"Trustway Marketing\" on board and I am glad I did. The team did a great job in making the launch so much easier and effective. They were continuously giving their 2 cents, which was kinda cool and helpful. Also they were very easy to get along with that made the whole experience good. Would love to work with them again.", "pics": null, "resp": {"time": 1613167376815, "text": "Thank you so much! Glad to hear you are pleased."}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "105381035313029952845", "name": "Joshep Smith", "time": 1603881944091, "rating": 5.0, "text": "I've had a fantastic experience working with David and the rest of the team at Trustway Marketing. They have been incredibly accommodating to our needs and have consistently met our expectations, if not exceeded them. They offer a ton of additional services and benefits that many of their peers do not which helps differentiate them from the crowd. I haven't had a negative experience working with the team at Trustway Marketing at all and look forward to continuing to work with them in the future", "pics": null, "resp": {"time": 1613167857406, "text": "So good to hear you are pleased. Thanks!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "114921912849906924414", "name": "David Roy", "time": 1602610752920, "rating": 5.0, "text": "So far so good! He is a true professional and obviously is passionate about what he does. He thinks outside of the box and has been instrumental in creating a great and well thought out plan to execute for my company. I am happy to hear that he is familiar with branding and website designs. To top things off, he saved me thousands of dollars on my printing needs! I would highly recommend this team for successful marketing strategies!", "pics": null, "resp": null, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "109393224633126734656", "name": "Shine Baker", "time": 1603342572565, "rating": 5.0, "text": "Trustway Marketing was SO helpful when building my boutique website! David and his team were helpful and took note of exactly how I wanted my site to look.  I always informed from start to finish. I would recommend working with them! I have not had any problems with my site since Trustway turned it over to me!", "pics": null, "resp": {"time": 1621867655632, "text": "Glad it's going well. Thank you for your review!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "116594199618997596474", "name": "William Henderson", "time": 1603391014763, "rating": 5.0, "text": "I've had a fantastic experience working with David Hall and the rest of the team at Trustway Marketing. They have been incredibly accommodating to our needs and have consistently met our expectations, if not exceeded them. They offer a ton of additional services and benefits that many of their peers do not which helps differentiate them from the crowd. I haven't had a negative experience working with the team at TM at all & looking forward to continuing to working with them in the future.", "pics": null, "resp": {"time": 1618607540636, "text": "Awesome to hear! We look forward to it. Thanks for doing business with Trustway Marketing."}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "116597932324589473080", "name": "Andrew Lytwyn", "time": 1603810034558, "rating": 5.0, "text": "I have over the years hired other large and small marketing firms and always felt disappointed with very few results.  Trustway Marketing has done more in the first two weeks then the other companies have done in the first two months.  Trustway has a different feel meaning they truly know what will help your organic rankings but that is just a small portion of their overall approach in driving business to our company.\n\nHi would highly recommend Trustway Marketing be on your list of companies you talk when looking for a can do marketing firm.", "pics": null, "resp": {"time": 1603810766008, "text": "Thanks Andrew!!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "107115639328174507306", "name": "Ira Taylor", "time": 1603260074931, "rating": 5.0, "text": "We had a good experience with Trustway Marketing when we hired them for a one-time SEO project a few weeks back. I loved how they go about with the projects… very well organized and coordinated. Talking about their work, it was good. After a few weeks now since they worked on our website and optimized it, we are seeing a substantial increase in website traffic and conversion. We were in constant touch with their manager and coordinator which made the whole process even smoother and easy. We will sure hire them again.", "pics": null, "resp": null, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "117648407536296027261", "name": "Micel Soney", "time": 1603757208414, "rating": 5.0, "text": "Trustway Marketing is hands-down an incredible SEO company. We worked together for nearly a year. They did a great job on our website, ranking it higher for many competitive keywords. They would report the progress every week. The communication level with them was always good. All in all, it was a very good experience with them. Would love to work with them in the future!", "pics": null, "resp": {"time": 1616424803741, "text": "Glad you are happy with our services!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "103395109509599771078", "name": "Adam Ken", "time": 1603369698235, "rating": 5.0, "text": "These guys are great! They do what they say. A breath of fresh air! David and his team are great to work with and a true professional. We track all leads that come in and have had many Facebook leads that led to projects. Wouldn't use anyone else. Great experience with Trustway Marketing! I Recommend them.", "pics": null, "resp": {"time": 1621867484994, "text": "Thank you so much!  Appreciate your kind words."}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "109571629842798636623", "name": "Michael Green", "time": 1611003324255, "rating": 5.0, "text": "Great experience with Trustway Marketing when we hired them for the second SEO project. We appreciate how they go about with the projects, very well organized and coordinated. We will sure hire them again.", "pics": null, "resp": {"time": 1611012030534, "text": "Thank you so much! We appreciate your business."}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "110626827412498255705", "name": "Edward Fox", "time": 1600005452823, "rating": 5.0, "text": "I've been using Trustway Marketing for about a year now, David and his team have really helped me grow my business, working with me on my Google my business page and my Linkedin Account, they are also doing some work for me on my Website, actually we ended up doing a complete redo as I was so impressed with the teams work.  Trustway marketing is also working with me on my facebook presence for my business. I really can't recommend them highly enough.  I have found over the years a lot of companies SAY the can do things, while only a few of them deliver. Trustway delivers.", "pics": null, "resp": {"time": 1599996774655, "text": "Thank you so much Ed!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "113088618238086506177", "name": "Jacky Jons", "time": 1603434235475, "rating": 5.0, "text": "Trustway Marketing was SO helpful when building my website! David and His Team were very helpful and took note of exactly how I wanted my site to look.  I was always informed from start to finish. I would recommend working with them! I have not had any problems with my site since trustway turned it over to me! Thanks David Hall!", "pics": null, "resp": {"time": 1618607488223, "text": "So glad it turned out well for you. Trustway Marketing was glad to help. Thank you for leaving such a nice review!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "102442077715235713976", "name": "praveenkumar paneti", "time": 1622622035873, "rating": 5.0, "text": "It's really nice experience with the trustway team. Thank you David Hall.", "pics": null, "resp": {"time": 1623707194068, "text": "You're so welcome and thank YOU!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "115837611771982914432", "name": "Liam Nathan", "time": 1603345629998, "rating": 5.0, "text": "The best marketing team. our company has been working with them for half a year now; they handle the SEO of our site; they have done a commendable job till now. much appreciation for all their hard work and efforts. Trustway Marketing is a great choice for small business owners like us. We recommend them!", "pics": null, "resp": {"time": 1621867577168, "text": "Thanks for your recommendation. We appreciate that."}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "117590251751832796517", "name": "Daniel Clark", "time": 1603735998427, "rating": 5.0, "text": "Trustway Marketing is a class act company. Work is always done promptly, very professional, and they always push us to stay at the forefront of technological changes to make sure we're getting the best bang for our buck.  Couldn't ask for a better group to work with. I recommend them.Thanks David Hall!", "pics": null, "resp": {"time": 1616424834374, "text": "You're so welcome!  Glad you are pleased."}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "110899789929432265378", "name": "Howard Miller", "time": 1603341666709, "rating": 5.0, "text": "I have only great things to say about Trustway Marketing and all of the team. Always impressed by the knowledge and information the staff has to provide. Beyond fantastic customer service and skills to produce exactly what you are looking for. I recommended them!", "pics": null, "resp": {"time": 1621867684309, "text": "Thank you so much for your review!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "113803848231121900367", "name": "Stephen Perry", "time": 1604389441592, "rating": 5.0, "text": "They did the job so beautifully and efficiently.  I have always watched from beginning to end.  I would recommend working with them!  There have been no problems on my site since Trustway handed it over to me!♥♥♥", "pics": null, "resp": {"time": 1613167835995, "text": "Awesome to hear!  Thank you."}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "112145067900260527488", "name": "Ryan Jeffery", "time": 1604390075018, "rating": 5.0, "text": "A few months back we finally decided to take social media marketing a bit seriously. One of my friends recommended Trustway Marketing. We’re very satisfied with the team... the communication and the way they are handling the project.At large, aside from a few gaps, we’re happy with Trustway Marketing.", "pics": null, "resp": {"time": 1613167804274, "text": "Thank you!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "104849593734720114219", "name": "Mia Sophia", "time": 1603370945927, "rating": 5.0, "text": "I’ve been doing business with Trustway Marketing for over two years now and cannot speak highly enough of the team they have assembled and the work they do. David Hall and his staff approach every project, meeting, seminar, and even phone conversations with professionalism while still being personable. They are a joy to work with & I plan on continuing to do so! I recommend them.", "pics": null, "resp": {"time": 1618607723347, "text": "Kind words! We at Trustway Marketing are glad to help you. Thanks for the recommendation!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "102599051918629492834", "name": "Ella Mem", "time": 1603282504147, "rating": 5.0, "text": "Trustway Marketing so far has been the friendliest, most knowledgeable web development company I have worked within our five-year business history.  I have been through several stages from \"do it yourself\" to our current website with Trustway & nobody that I've dealt with before comes close.  We could not be more pleased with our web presence than we are now and look forward to networking with them as our internet needs evolve. I highly recommend their services!", "pics": null, "resp": {"time": 1621867949358, "text": "Thank you so much for the recommendation! We appreciate your kind words."}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "111614697620364567349", "name": "Josh Powell", "time": 1603650131638, "rating": 5.0, "text": "Trustway Marketing is the best website company in the United States. David Hall has assembled a diverse team of highly intelligent women and men that understand the number one tenet of making a business successful - “Customer Service.” I have the pleasure of representing a vast number of highly acclaim figures & I moved all of their websites to TM because of the company’s institutional knowledge of technology & they have the tools to maximize global exposure. Thanks!", "pics": null, "resp": {"time": 1616424988279, "text": "Thank you!  Customer service is quite important to us."}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "112766211047372130434", "name": "Carl Snyder", "time": 1603390714461, "rating": 5.0, "text": "They did an amazing job with our site. They have the best customer service. They always respond quickly also send updates. If there are any questions they always give me a call right away. They regularly monitor our website and let us know if there are any issues. Absolutely the best around. We are beyond thrilled that we found Trustway Marketing!", "pics": null, "resp": {"time": 1618607646978, "text": "We're glad you found Trustway Marketing, too!  Thanks for this positive testimonials about our services."}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "117016714568943839176", "name": "Phillip Carlos", "time": 1603477195410, "rating": 5.0, "text": "ATrustway is on the cutting edge of what's happening in digital marketing and making sure the latest tech like Google View is available to their clients. Forward-thinking companies like Trustway marketing earn their great reputations every day by providing the expertise their clients don't always possess internally. Highly Recommended!", "pics": null, "resp": {"time": 1618607167748, "text": "Thank you, Phillip. Providing appropriate and up-to-date technology solutions is a goal of ours at Trustway Marketing. Glad you are pleased."}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "106359817721498422000", "name": "Kathleen Dumas", "time": 1603367320708, "rating": 5.0, "text": "Working with Trustway Marketing was a great experience. The team is very creative and professional. From start to finish they deliver on everything they promise and more. I would recommend them to all who worry about their Online Marketing. Thanks, David Hall 😀❤️😀❤️", "pics": null, "resp": {"time": 1621867511595, "text": "Glad you are happy with our services. Thank you!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "100167833003875166000", "name": "Amanda Callie", "time": 1603477343280, "rating": 5.0, "text": "Working with Trustway Marketing is always a fantastic experience! They truly go above and beyond to ensure their customer's needs are. I will never go anywhere else for my web performance. Thank you guys for all you do and for making me look good!", "pics": null, "resp": {"time": 1618607062385, "text": "Thank you so much!  We appreciate your kind words. At Trustway Marketing, we strive to provide the best customer service to all of our clients."}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "100609858068128119535", "name": "Ome Ma", "time": 1604407813376, "rating": 5.0, "text": "The Trustway Marketing team has been incredible to work with on many different projects we have had. They are always professional and very up to date on current and future trends coming along.  I would recommend them to anyone who is needing to boost what they are doing digitally.", "pics": null, "resp": {"time": 1613167785619, "text": "Thank you for your kind words!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "109672321666578672829", "name": "Lisa Crouch", "time": 1603773814451, "rating": 5.0, "text": "Trustway Marketing has done our last two websites and they do a great job. It's not just the technical work, but their whole project methodology that sets them apart from other techie firms. They get to know your business so they can present who you are the internet audience. I will keep my partnership with TM for the long term.", "pics": null, "resp": {"time": 1616424666404, "text": "Thank you for your kind comments."}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "116791842904425363795", "name": "Grace Ella", "time": 1604418898090, "rating": 5.0, "text": "OUR experience with trustway over the years  has been great. Their marketing  skills  have been so helpful. The staff we have worked with feel like friends and listen to our needs. Highly recommend \t!😘😘", "pics": null, "resp": {"time": 1613167735296, "text": "Great to hear!  Thank you so much."}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "114132430520045750136", "name": "Marck Ben", "time": 1604418505612, "rating": 5.0, "text": "OUR experience with trustway over the years  has been great. Their marketing  skills  have been so helpful. The staff we have worked with feel like friends and listen to our needs. Highly recommend \t!", "pics": null, "resp": {"time": 1613167757250, "text": "Thanks for your recommendation!  We appreciate it."}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "100163593008894531217", "name": "Nana Kante", "time": 1603732805637, "rating": 5.0, "text": "Trustway marketing agency is a class act. Work is always done on time, very professional, and they always push us to stay at the forefront of technological changes to make sure we're getting the best bang for our buck. The best agency to work with! I would highly recommend them to all small biz-owners...", "pics": null, "resp": {"time": 1616424894857, "text": "Thank you!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "112509618528465786409", "name": "Raul Devereaux", "time": 1605336811380, "rating": 5.0, "text": "We hired Trustway Marketing to redo our website for us. Mark is our account rep and hes done an outstanding job! Our website looks beautiful, its fast, works on mobile. He's optimized our website for SEO and done everything we asked and more.", "pics": null, "resp": {"time": 1611012376637, "text": "So glad you are pleased with our services. Thank you!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "111783541282708950155", "name": "sadman david", "time": 1592428387894, "rating": 5.0, "text": "Trustway Marketing is a great choice for small business owners like us. They offer complete digital marketing services under a single roof. It's really affordable. Been with them for a month now and they have done some great work on the site and social media. At present, happy with their work.. Highly Recommended!", "pics": null, "resp": {"time": 1613167655813, "text": "Glad you are happy!  Thank you!!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "110310830635181865572", "name": "Sarah Richardson", "time": 1603215321286, "rating": 5.0, "text": "For a one-time website design project, we contacted Trustway Marketing. And it was a good experience overall. The communication was nice. They listened to our requirements, pitched some ideas, and delivered way before the deadline. They were equally patient in taking up a few revisions. And above all, their pricing was quite affordable. Full points to them!!!", "pics": null, "resp": null, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "111683601999914278408", "name": "Tret Gromas", "time": 1603627061141, "rating": 5.0, "text": "After years of being with another web company that was less than attentive and did not seem to have answers to important web questions, it has been so refreshing and educating to work with Trustway Team. They are smart, responsive, helpful, and know what they are doing. Not only did they have my site up and running in a short amount of time, but they also made simple adjustments that made it more user friendly and more SEO friendly, plus they are easy to work with. Thanks, David Hall!", "pics": null, "resp": {"time": 1616425158692, "text": "Client education is a huge part of what we do.  Thank you for your kind words!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "114861062999801305454", "name": "Rok Jerry", "time": 1603344925934, "rating": 5.0, "text": "Trustway has done our last two websites & they do a great job.  It's not just the technical work, but their whole project methodology that sets them apart from other agencies. They get to know your business so they can present who you are to the internet audience. I will keep my partnership with Trustway Marketing for the long term.", "pics": null, "resp": {"time": 1621867613787, "text": "Thank you so much!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "102855722552949952674", "name": "Kleber Marcelo Campos", "time": 1589484634977, "rating": 5.0, "text": "Needed a company to handle social media marketing for my digital product launch last month. Got \"Trustway Marketing\" on board and I am glad I did. The team did a great job of making the launch so much easier and effective. They were continuously giving their 2 cents, which was kinda cool and helpful. Also, they were very easy to get along with that made the whole experience good. Would love to work with them again.", "pics": null, "resp": null, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "115382366622833695316", "name": "Morgan Guy", "time": 1604588297393, "rating": 5.0, "text": "I am Glad.David is an expert at SEO and online marketing. He revolutionized our online capabilities and allowed us to take our business to a whole new level. He's extremely knowledgeable and a pleasure to work with.  Highly recommend.", "pics": null, "resp": {"time": 1611012902208, "text": "Thanks, Morgan!  The whole team appreciates your kind words!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "101730569931923783002", "name": "Harley Jones", "time": 1603634986430, "rating": 5.0, "text": "We have worked with Trustwaymarketing, for two year. They work very fast, flexibly, and satisfy the requirements. Their attitude is always positive and constructive. They work as one of our team members! They can provide a wide range of alternatives and solutions according to the marketing budget.", "pics": null, "resp": {"time": 1616425057593, "text": "Yes!  Thank you so much."}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "115166160427883457221", "name": "Robert Martin", "time": 1608997977563, "rating": 5.0, "text": "Punctual company Trustway Marketing. They are loving guy and professional service. I love it and recommended", "pics": null, "resp": {"time": 1611012086106, "text": "Thank you, Robert!  Appreciate your kind words."}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "113623940314112119849", "name": "Alexander Molloy", "time": 1604732619354, "rating": 5.0, "text": "I talked to a number of other marketing companies before going with Trustway. They're a dedicated team & passionate about digital marketing. Our Facebook has really grown! We've gotten 300 new check-ins at our restaurant. They know their business.", "pics": null, "resp": {"time": 1611012766621, "text": "Thank you!  We appreciate your business."}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "104516637285427509175", "name": "Gavin Luka", "time": 1608200432459, "rating": 5.0, "text": "The team is friendly, highly informative, responsive and always result drive. I’m pleased to report that out of all the digital marketing agencies and social media agencies, the most fit for the job is Trustway Marketing", "pics": null, "resp": {"time": 1611012218586, "text": "Thank you so much for this!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "117676309518526417883", "name": "Rose Dawson", "time": 1603435110661, "rating": 5.0, "text": "Trustway delivered as promises they made & continue to do so. We have been working with them for some time now and are seeing a significant increase in organic traffic. After working with so many SEO agencies and being disappointed, working with Trustway Marketing is a delight. They have a great team that’s doing a good job. Thanks, David Hall!", "pics": null, "resp": {"time": 1618607390923, "text": "You're so welcome!  Trustway Marketing does its best to provide top notch service. Thank you for your kind review."}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "103553431879871169518", "name": "Don Johnson", "time": 1609773261364, "rating": 5.0, "text": "Excited to get to work with David and his crew and I’m looking forward to some really great things happening for me on the digital advertising world", "pics": null, "resp": {"time": 1611012064780, "text": "Thanks, Don!  We're excited to have you on board."}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "108436851577033500628", "name": "Ofse Roax", "time": 1603731953247, "rating": 5.0, "text": "I am using their services for local SEO purposes for my business. Trustway marketing has done this task very professionally. I am happy with hem. Highly recommended.", "pics": null, "resp": {"time": 1616424933025, "text": "Thank you for the recommendation!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "116771788780224095990", "name": "Rachelle Camoesas", "time": 1592263100757, "rating": 5.0, "text": "Everything put together, we’re extremely happy with the way Trustway Marketing has worked till now. We talk every week and discuss future strategies. Communication with them is smooth, friendly, and always interesting. Full stars to them for their great work. In the coming days, they would also be handling our social media marketing.", "pics": null, "resp": null, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "111083439737390360113", "name": "Megan Angelo", "time": 1603628571234, "rating": 5.0, "text": "Claiming and verifying your business on Google is a simple task, but when you have multiple locations it can get complicated and very time-consuming. The nice folks at Trustway Marketing helped me knock it out in a few minutes. They have the know-how and a lot of resources to take care of your online marketing needs. Thanks, David Hall.", "pics": null, "resp": {"time": 1616425111677, "text": "You're welcome!  Glad you're happy."}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "110856513784354563386", "name": "Rachel Appleton", "time": 1589833770855, "rating": 5.0, "text": "If you’re a small business owner who is looking for affordable website development. Trustway Marketing has to be your number one choice. There are some of the best professionals. I have developed at least 10 of our websites from them over the course of a year. Affordable, and always efficient and quick on delivery. Looking to continue working with them soon. I wish them big success and grandeur in the future. Trustway Marketing, double thumbs up!!! :)", "pics": null, "resp": null, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "107854494194334678736", "name": "Thelma Treece", "time": 1608831678868, "rating": 5.0, "text": "They offered top service Trustway Marketing . We are now working on SEO and making my Instagram have shopping buttons. Thank youTrustway Marketing for a great marketing service. Best service.", "pics": null, "resp": {"time": 1611012173342, "text": "Our pleasure to be of help to you.  Thank you!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "103584783396596795081", "name": "Leanne Docherty", "time": 1603461056658, "rating": 5.0, "text": "Highly recommend! great prices along with 5-star services, very efficient and had our new website and re-branding completed within days, Trustway team turned our ideas into a reality as well as keeping us informed every step of the way will definitely be recommending.", "pics": null, "resp": {"time": 1618607211645, "text": "So glad you are happy with our services here at Trustway Marketing. Thank you so much for your kind words!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "101611164630368089682", "name": "Elisabeth Crowe", "time": 1589567411672, "rating": 5.0, "text": "We had a good experience with Trustway Marketing when we hired them for one-time SEO project a few weeks back. Loved how they go about with the projects… very well organized and coordinated. Talking about their work, it was good. After a few weeks now since they worked on our website and optimized it, we are seeing substantial increase in website traffic and conversion. We were in constant touch with their manager and coordinator which made the whole process even smoother and easy. We will sure hire them again.", "pics": null, "resp": null, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "118424574978212976271", "name": "Max Glara", "time": 1604513245968, "rating": 5.0, "text": "I've had a fantastic experience working with David Hall and the rest of the team at Trustway Marketing. They have been incredibly accommodating to our needs and have consistently met our expectations, if not exceeded them.", "pics": null, "resp": {"time": 1611013023756, "text": "That's our goal ... to exceed your expectations. Glad you are pleased!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "118330818124216527498", "name": "Jonah Calvin", "time": 1603244116778, "rating": 5.0, "text": "Our website was ranking decent on Google. But we weren’t making any sales. It is then we collectively decided to hire Trustway Marketing. Initially, there were few hiccups with them. However, once the wheel was on the run and they took over our website, the result was visible. They focused on on-page optimization, which boosted our lead generation. This instantly increased our sales. Currently, Trustway Marketing handles our SEO, conversion, and branding. And we’re more than happy with them. Hopefully, they continue their good work. I would recommend them to all", "pics": null, "resp": null, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "118366843214650463920", "name": "Dave Ken", "time": 1603289173406, "rating": 5.0, "text": "I am a client of Trustway Marketing and we take their help in the SEO and SMO sectors and also the contents for our blog are provided by them. I have never seen a company so relaxed with their employees and yet so professional in the work they do. We are having an amazing experience working with them and I would recommend Trustway Marketing to all my peers who are into the business sector.", "pics": null, "resp": {"time": 1621867855838, "text": "Yes!  Relaxed and personal, yet professional service is what we strive for. Thanks for noticing and leaving a five-star review for Trustway!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "113831288394573065014", "name": "Mila Kotlarsky", "time": 1589566817310, "rating": 5.0, "text": "Trustway Marketing is a great choice for small business owners like us. They offer complete digital marketing services under a single roof. Its really affordable. Been with them for a month now and they have done some great work on the site and social media. At present, happy with their work.", "pics": null, "resp": null, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "112680954579027296314", "name": "Dyan Brown", "time": 1589833090787, "rating": 5.0, "text": "Trustway Marketing is hands-down an incredible SEO company. We worked together for nearly a year. They did a great job on our website, ranking it higher for many competitive keywords. They would report the progress every week. The communication level with them was always good. All in all, it was a very good experience with them. Would love to work with them in the future!!!", "pics": null, "resp": null, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "115185942202837972529", "name": "Gary Paul", "time": 1604588263898, "rating": 5.0, "text": "Trustway Marketing is the best website company in the United States. David Hall has assembled a diverse team of highly intelligent women and men।.Very Good Service..", "pics": null, "resp": {"time": 1611012916207, "text": "Thanks so much!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "115592251067369613639", "name": "Laurie Cutter", "time": 1602655854970, "rating": 5.0, "text": "I am so happy for there service.  They are so active them work. And they are so professionals.", "pics": null, "resp": null, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "104433371464897799134", "name": "Steven Brian", "time": 1604546910328, "rating": 5.0, "text": "Excellent people! Perfect help! Overall I was absolutely blown away by their Trustway Marketing service. I highly recommand. Thsnks", "pics": null, "resp": {"time": 1611012961961, "text": "Thanks so much, Steven!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "100797317021583018841", "name": "Robert Bergman", "time": 1598380277244, "rating": 5.0, "text": "I enjoyed working with David at Trustway.  He is very knowledgeable, and explained his program completely.\n\nI am using the program with great success.", "pics": null, "resp": {"time": 1613167539700, "text": "Thanks, Bob!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "101243372384789563578", "name": "Combo Richard", "time": 1603263226852, "rating": 5.0, "text": "We finally decided to give up DIY and take social media marketing a bit seriously. One of my friends recommended Trustway Marketing. Although it has been only a few months now, everything seems to be working fine. We’re satisfied with the team. The communication and the way they are handling the project. In terms of revenue, we see good returns on LinkedIn and Facebook. At large, aside from a few gaps, we’re happy with the Trustway agency!", "pics": null, "resp": {"time": 1624372974372, "text": "So glad to hear this!  Thank you so much for kind review."}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "116503532478427206824", "name": "Carlos de Alberto Moraes", "time": 1589484562193, "rating": 5.0, "text": "David Hall connected with me on Linked In and we recently had a consultation. David asked great questions, listened carefully, and was able to drill down to the heart of what I can do to improve my results. After this, he was able to give candid assessments and some great tools that have already had a significant positive impact on my business results. I would highly recommend and endorse David.", "pics": null, "resp": null, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "114498670989309357084", "name": "Diana Lakhchakova", "time": 1588097593922, "rating": 5.0, "text": "In my opinion they are definitely one of the best social media marketing companies. Since hiring them, we have seen good growth of our brand on social media. Love their team. They are easy to talk and quite accommodating. Highly Recommended.", "pics": null, "resp": null, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "110379256949757533650", "name": "Matthew Snowden", "time": 1592265856096, "rating": 5.0, "text": "Trustway Marketing handles social media marketing for our clothing wholesale business.. they have been doing’ a great work till now. We’re generating good leads from social channels. If you're looking for a good social media marketing company, trust the people at TM.", "pics": null, "resp": {"time": 1613167632293, "text": "Thank you so much!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "101495622755264869948", "name": "Helen Janes", "time": 1604496536488, "rating": 5.0, "text": "We hired Trustway Marketing to help with rebuilding our website, SEO and email marketing. They have gone above and beyond on our expectations. Talking to them feels like talking to family that wants to see us be successful. They have even helped with areas of the business we didn't know we had problems with.", "pics": null, "resp": {"time": 1611013106969, "text": "Yes! That's a true treasure of our team here. We're so glad you're pleased with our services. Thank you!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "100005809487666512660", "name": "Carole Daniel", "time": 1592265491300, "rating": 5.0, "text": "Whenever there’s a need for SEO-friendly content for our pharmacy websites, we always hire content writers at Trustway Marketing. Great team, great writers, and an incredible client relationship manager. Not only do they produce quality products, but it is their exceptional communication level that has won me over numerous times. Never disappointed, hopeful to continue the business ties with them in the future.", "pics": null, "resp": null, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "101530402374656689702", "name": "Devil Range", "time": 1604418267190, "rating": 5.0, "text": "We had a good experience. So good service. Highly recommend 😍😍", "pics": null, "resp": {"time": 1613167766934, "text": "Thanks!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "107711750435443624483", "name": "Jason Wehnar", "time": 1602669385864, "rating": 5.0, "text": "We have used Trustway marketing services for the last few years and have been extremely happy with its continuous improvement. In addition, we have used Trustway for marketing publicity in the form of publicity photographs and have been gratified with its sucess!", "pics": null, "resp": null, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "114868766689045717602", "name": "Wemyss Even", "time": 1604389694964, "rating": 5.0, "text": "Excellent customer service. They know what their customer wants.so i love to stay with Trustway Marketing", "pics": null, "resp": {"time": 1613167814446, "text": "Thanks so much!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "100822569934914911232", "name": "Marisa Cuevas", "time": 1592262060694, "rating": 5.0, "text": "Trustway Marketing is helping us optimize the Website & it's rankings across different search engines. We have been extremely satisfied with their overall services as they have surpassed our expectations. Their services are both cost-effective and outstanding. We would be happy to recommend them to anyone who is looking to improve their SEO rankings.", "pics": null, "resp": null, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "111897626746664910777", "name": "Hisu Fuli", "time": 1592265630232, "rating": 5.0, "text": "Hired Trustway Marketing for one-time on-page optimization. The pricing was very affordable. They did good work… even explained everything they are doing and how it will help our business. They seem like a great SEO company. I would hire them again.", "pics": null, "resp": {"time": 1613167606461, "text": "Thank you!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "106937604742345398356", "name": "Alexandra Baron", "time": 1592265309820, "rating": 5.0, "text": "A 360-degree solution provider for all digital marketing needs. TM team is very sincere towards work and never ever gave an opportunity to complain. Very pleased and would rank them as one of the best digital marketing companies in Alabama.", "pics": null, "resp": null, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "111144485808297633724", "name": "Ray Koopman", "time": 1585945958922, "rating": 5.0, "text": "David Hall connected with me on Linked In and we recently had a consultation. David asked great questions, listened carefully, and was able to drill down to the heart of what I can do to improve my results. After this he was able to give candid assessment and some great tools that have already had a significant positive impact on my business results. I would highly recommend and endorse David.", "pics": null, "resp": null, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "114712283616909009453", "name": "Sandra B. Hubbard", "time": 1604720811391, "rating": 5.0, "text": "Trustway Marketing\" is Alabama's leading digital marketing community and the go-to platform for learning.", "pics": null, "resp": {"time": 1611012789129, "text": "Wow! Thanks for that glowing recommendation!!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "112028892082581630684", "name": "Paul Martin", "time": 1602695091572, "rating": 5.0, "text": "Excellent customer service - very friendly staff.Trustway Marketing very professional.thank you so much😘", "pics": null, "resp": null, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "111418363244489847232", "name": "Gable Eaton", "time": 1579918412813, "rating": 5.0, "text": "David is an amazing talent and help, both professional and personable. The insight and information he provided to improve my business profile and presence were valuable and actionable. More than anything I appreciated how he got right to what I needed.", "pics": null, "resp": {"time": 1579922352844, "text": "Thanks so much Gable!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "105576039519185917881", "name": "James Nofziger", "time": 1589566179096, "rating": 5.0, "text": "A very good team... our company has been working with them for half a year now; they handle the SEO of our site; they have done a commendable job till now. Much appreciation for all their hard work and efforts.", "pics": null, "resp": null, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "117702443226466297607", "name": "Shane Wade", "time": 1604561836362, "rating": 5.0, "text": "Nice Company..... I Would Highly Recommended 👍", "pics": null, "resp": {"time": 1611012945193, "text": "Thank you!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "110506186757640927375", "name": "Anne Mari", "time": 1604582967546, "rating": 5.0, "text": "Very nice job to trustway marketing. They have the best customer service.", "pics": null, "resp": {"time": 1611012936258, "text": "Thank you!  Our clients are like family to us."}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "113721468227021105061", "name": "Joao dos Santos Rodrigues", "time": 1589484464607, "rating": 5.0, "text": "A few months back we finally decided to take social media marketing a bit seriously. One of my friends recommended Trustway Marketing. Although it has been only a few months now, everything seems to be working fine. We’re very satisfied with the team... the communication and the way they are handling the project. In terms of revenue, we’re seeing good returns on LinkedIn and Facebook. At large, aside from a few gaps, we’re happy with Trustway Marketing.", "pics": null, "resp": null, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "101237153604212020533", "name": "Miss july", "time": 1592262718816, "rating": 5.0, "text": "I am a client of Trustway Marketing and we take their help in the SEO and SMO sectors and also the contents for our blog are provided by them. I have never seen a company so relaxed with their employees and yet so professional in the work they do. We are having an amazing experience working with them and I would recommend Trustway Marketing to all my peers who are into the business sector.", "pics": null, "resp": null, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "103494351126516397458", "name": "SandyFlores Broker", "time": 1589838503444, "rating": 5.0, "text": "A digital marketing company in Alabama that we can genuinely trust. One of the best things about them is their team and how easily accessible they are. Always good to talk to them and discuss the scope of our website's SEO work. Overall, after 5 months we're quite happy working with Trustway Marketing.", "pics": null, "resp": null, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "108926996237521277219", "name": "Sharon Perez", "time": 1604498881896, "rating": 5.0, "text": "very good and professional service this company team.Highly recommend", "pics": null, "resp": {"time": 1611013040999, "text": "Thanks so much for your recommendation!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "112060372058418306507", "name": "DonDee Osburn", "time": 1580422452968, "rating": 5.0, "text": "David and his team are amazing! Knowledgeable and able to teach that knowledge in a very practical way. He has made us think about our business in different, more profitable ways. Highly recommend!", "pics": null, "resp": {"time": 1580500137221, "text": "Thanks so much DonDee!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "108690476535480491915", "name": "Chris Mcdaniel", "time": 1588974273555, "rating": 5.0, "text": "Trustway has been a true partner in developing and implementing marketing strategies to help my company. We highly recommend them.", "pics": null, "resp": {"time": 1591735643711, "text": "Thanks so much Chris! We have thoroughly enjoyed working with Sphere Audio Video and watching the amazing home and business automation you guys are doing."}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "112868342716954729105", "name": "Shelley Kim", "time": 1582749155356, "rating": 5.0, "text": "David is an expert at SEO and online marketing. He revolutionized our online capabilities and allowed us to take our business to a whole new level. He's extremely knowledgeable and a pleasure to work with.  I would highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "111396731877487680013", "name": "Russell Pattinson", "time": 1598023984767, "rating": 5.0, "text": "We are very happy to find Trustway Marketing as they responded to our issues professionally and quickly.", "pics": null, "resp": {"time": 1613167573761, "text": "Thank you so much! Glad you are pleased."}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "113148130401802527960", "name": "Michael Valentino", "time": 1588098227642, "rating": 5.0, "text": "One of the finest SEO agencies in Alabama that we have worked with. Understanding team and always accessible and responsive. They handle several of our projects and has done a good job. We would recommend them to all SMEs who looking for a good SEO company.", "pics": null, "resp": null, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "114048872890235188904", "name": "Clarke Jason", "time": 1604482135864, "rating": 5.0, "text": "Very knowledgeable and quick service ❤️❤️", "pics": null, "resp": {"time": 1613167719384, "text": "Thank you!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "114083593620308350272", "name": "Axel Meierhoefer (Diamond Formation Leader)", "time": 1579549588747, "rating": 5.0, "text": "David and his team are amazing when it comes to customer services and very quick to respond whenever I have an issue. It's great working with them.", "pics": null, "resp": {"time": 1579555458432, "text": "Thank you so much Axel! We have really enjoyed working with you as well."}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "104118707421109643245", "name": "Electrical Power and Control", "time": 1599874711823, "rating": 5.0, "text": "Working with David and his team at Trustway has really helped our business grow and helped us to wisely spend our Marketing budget. Do yourself a favor let Trustway Marketing handle it for you, you'll be glad you did.", "pics": null, "resp": {"time": 1580160411035, "text": "Thanks so much! We really love our amazing customers like, you Pat"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "114787351298584536754", "name": "universal diversified", "time": 1579593627554, "rating": 5.0, "text": "David Hall of Trustway Marketing guided us in a right direction. He highlighted the dark areas of our business, rather enlighten those areas. His valuable advise boost our confidence. And I'm sure his worthwhile advise definitely help us to grow our business, give a right direction which's undoubtedly a great support. Thank you David, God bless you.\nMohammed Younus Aamir - CEO Unidigmark", "pics": null, "resp": {"time": 1579705200579, "text": "Thank you so much Mohammed! We appreciate the vote of confidence."}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "115551716269522328448", "name": "Tony Spillman", "time": 1602694489379, "rating": 5.0, "text": "I highly recommend Trustway Marketing!", "pics": null, "resp": null, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "113661059328990200998", "name": "Freelancer Gaurob", "time": 1623628553115, "rating": 5.0, "text": "Amazing experience!", "pics": null, "resp": {"time": 1623707222444, "text": "Thanks for your 5-star review. We're glad you had a great experience!"}, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "102532145150635721037", "name": "matthew paris", "time": 1624623702030, "rating": 5.0, "text": "They are very attentive and listen to your business needs carefully. Their on-boarding process is very smooth. I had the first introductory call with David, who was very professional attentive.\n\nOn another note, the service charge is very reasonable for the work they do.", "pics": null, "resp": null, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "105763740456213159032", "name": "stagner scotty", "time": 1624621440111, "rating": 5.0, "text": "We have been pleased with the results of our Facebook campaign. David and his team have done an excellent job. They are very responsive and have earned our trust.", "pics": null, "resp": null, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "117549753793237168994", "name": "adkines jasons", "time": 1624549631288, "rating": 5.0, "text": "This person is next level, truly learned, and clarifies everything plainly and expertly. I would suggest them over and over...; Much appreciated, man.", "pics": null, "resp": null, "gmap_id": "0x88891f5c288d4a9d:0xb19e372ff889a836"}
{"user_id": "101116028422650653020", "name": "Deborah Boswell", "time": 1623761450328, "rating": 5.0, "text": "I have used Fusion One Marketing for approximately 10 years for SEO, social media, and online marketing for 2 businesses I own.  Glyna, Rob, and the team are very good at what they do. They are also pleasant and make doing business with them easy!  I don't advertise my business through any other means other than the marketing through Fusion One's efforts online. It is worth every penny I spend with Fusion One!\nDeborah Boswell\nPresident\nProfessional Speech Services of AL, P.C.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMMc5MMeBjtXwG5idcseIvAA04NxTiXv5Xiss9Z=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "102781938288080834775", "name": "Jamie Garzarek", "time": 1621516749307, "rating": 5.0, "text": "Fusion One is a great business to work with. Glyna has done such a good job working with my company.  We started using their services several months ago and I haven’t had any complaints. They were able to change up our website and I have gained business solely on how it looks and is presented. I can’t thank Fusion One enough for what they have done for our business.", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "115008367664782796332", "name": "Dave Stephenson", "time": 1621343099833, "rating": 5.0, "text": "We looked at several marketing firms and decided to go with Fusion One. We are very pleased with our results. Glyna ,Rob, Kelsey and Sarah go the extra mile and have increased our online presence and website traffic consistently every month. I have and will continue to recommend them to anyone considering online marketing!", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "113946942109079573624", "name": "Leonard Austin", "time": 1609869780908, "rating": 5.0, "text": "Glyna and her team are 2nd to none. It is incredible the difference in our call volume and website traffic since they have taken over. As Marketing Director for Crocker Moving Services, this is one of the best decisions made. Fusion One also handles our Facebook and other social media accounts. Kelsi is the best and keeping relevant and interesting posts. She also helps me with recruiting from our Facebook page. I highly recommend Fusion One Marketing.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNY5OiJIj0oOEPgb_CteQ3HT4od6LxyD_PRpaA=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPYoIjSkgr-phwneR9vkCszMnzVbN-0CxGniio=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "103035871281546124973", "name": "Lisa Guarino", "time": 1609894223064, "rating": 5.0, "text": "Best Team Ever! Very present and truly cares about your business! Best decision I ever made was to join Fusion One Marketing!", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "103178744773585078803", "name": "anthony boyd", "time": 1580055421254, "rating": 5.0, "text": "Fusion One has turned my marketing around completely. Rob and Glyna are very easy to talk to and work with . I would highly recommend them and their team of professionals to anyone who has marketing needs !", "pics": null, "resp": {"time": 1580059814554, "text": "Anthony thanks so much, it is a pleasure to work with you."}, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "112072675417612663375", "name": "Mike Parlier", "time": 1571163593416, "rating": 5.0, "text": "I’ve been using Fusion One for all of our web and SEO for the last year and a half. Glyna, Rob, Michael, Sarah and the rest of the gang do an amazing job for us.  I could not be more happy. I would highly recommend them to anyone that needs their services.  We went from a brand new start up company to a multi-million dollar company in our first year and we owe a lot of our success to Fusion One Marketing!", "pics": null, "resp": {"time": 1580060030743, "text": "Thanks Mike we are so glad to work with you and see your companies growth."}, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "107728638646866376500", "name": "Dr. Keith Hallingquest", "time": 1543543755366, "rating": 5.0, "text": "Fusion One Marketing is an amazing company full of skilled individuals who love to deliver!  Rob and Glyna have an eye for detail and know exactly how to get your business the visibility that it needs to be more profitable.  If you are trying to expand your business, this is definitely the place to do it.  They are amazing people, delivering amazing service, to create amazing results.  I highly recommend Fusion One Marketing for any digital marketing need!", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "102175912424785710537", "name": "William Collins", "time": 1545918255161, "rating": 5.0, "text": "Glyna helped us with our Search Engine Optimization and it was a great experience. She knows exactly what steps to take to make sure you're getting the most out of your search engine lead generation.  I look forward to working with her in future marketing strategies.", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "101865223993202122093", "name": "Heath Barnett", "time": 1528986474348, "rating": 5.0, "text": "First the website looks fantastic! Clean and professional with a style that matches our aesthetic and just the right amount of pizazz! The intuitive interface has given our customers a voice that keeps our finger on the pulse of their needs. The marketing is top notch as well and has certainly raised awareness in the community of our business and services as well as our job postings for the new location!", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "115642156001822879785", "name": "Andrew Wilkerson", "time": 1528570790656, "rating": 5.0, "text": "Fusion One Marketing - I cannot say enough amazing and wonderful praises about this husband and wife team. They have helped generate additional leads and closed business each month. Have also helped with creating a great website, social media, and getting more reviews.  I recommend FUSION ONE to anyone who is wanting a good return on their investment. most importantly Glyna and Rob truly care about your success and are such amazing people to work with.", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "114201120097701466914", "name": "Brandy Cook", "time": 1543854194276, "rating": 5.0, "text": "Fusion One Marketing will help grow your business. They will give you a fantastic website and help consumers find your business online with ease. I highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "100967558377306804538", "name": "Emily McGrath", "time": 1495657954268, "rating": 5.0, "text": "I've absolutely enjoyed working with Nick. I have received above and beyond what I expected! I wouldn't be doing any justice trying to describe the level of attention and professionalism I've experienced. As a small business owner every dollar counts and working with Nick at Fusion One Marketing is more than worth it.", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "102114088470396655242", "name": "Mitch Jones", "time": 1529411672954, "rating": 5.0, "text": "Our website had become somewhat stale and stagnant, and we weren't generating any new traffic to the site.  Glyna and her team totally reworked our page, gave it a new look, and instantly established a credible site with tons of traffic.  We have been so pleased with the reviews we have gotten from our customers about how good the site looks and how easy it is to navigate.  Fusion One really did a great job, and I would recommend them to any new or old business needing a fresh new website!", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "102886367946293474833", "name": "Santiago Hechart", "time": 1546543808462, "rating": 5.0, "text": "Fusion One helps businesses look great on the internet and they do it with a smile! Rob and Glyna put all their effort into their work and it truly shows. They deliver high quality results!", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "118169772875538703898", "name": "Deborah Ridderhoff", "time": 1446737933987, "rating": 5.0, "text": "Fusion One Marketing is a fantastic company to work with.  I wanted a logo and website that would not only reflect my personality but make my firm stand out from the competition.  Glynn and Rob went the extra mile to created a website and logo that is professional and unique.  In short, they nailed it!", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "110259089752431924396", "name": "nikki majewski", "time": 1540832317103, "rating": 5.0, "text": "Fusion One has been a wonderful asset to Child'sPlay Therapy Center. They are quick to give advice on how to improve our social media presence, they go over monthly trends and keep us informed on the best ways to reach prospective clients.", "pics": null, "resp": {"time": 1540903045020, "text": "Thank you for the kind words Nikki!  We appreciate your business and love working with you and ChildsPlay!"}, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "104781721129865982810", "name": "Shawn Troughton", "time": 1543846013067, "rating": 5.0, "text": "Thanks to Fusion One Marketing and all they do. The owners, Rob and Glyna, love their jobs and helping businesses to be found on the internet. If you are in need of a Marketing Team, look no further!", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "115165841266332848661", "name": "Sara N. Tower", "time": 1518121071318, "rating": 5.0, "text": "Fusion One Marketing is a fantastic company that puts their customers first. Nick is very passionate and extremely knowledgeable with how to market your business best. I highly recommend them if you are in need of boosting your online business exposure or need a new website!", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "103022501676923844872", "name": "Jeffrey Franklin", "time": 1526917878992, "rating": 5.0, "text": "Great company to work with, they have helped grow our business since the day we opened our doors. Very professional, and honest hard working company.", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "114182987158411567360", "name": "Alicia Mooney", "time": 1502819123525, "rating": 5.0, "text": "The team at Fusion One has been a pleasure to work with. They hit the ground running on our project and already have provided impressive results.  I couldn't ask for a better group of people to work with - Nick and Glyna are the real deal!", "pics": null, "resp": {"time": 1502828257550, "text": "Thank you Alicia!  We really enjoy working with you!"}, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "110438149585714064107", "name": "Stephanie Crocker", "time": 1453499362488, "rating": 5.0, "text": "Fusion One Marketing is an awesome company. I have really enjoyed working with these people .They are friendly, energetic and really do the work they say they can!!!", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "102672658792353078836", "name": "Cary Miller", "time": 1449688436935, "rating": 5.0, "text": "Over 10 years I struggled with SEO and Web issues.  Fusion One has simplified my business by letting me focus on what I'm good at while they handle the ever changing world of the internet.  In addition to being great at what they do they are always professional,  prompt, and super friendly...I highly recommend with out hesitation.", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "112811481809695353382", "name": "Michel Coleman", "time": 1407526441936, "rating": 5.0, "text": "I can't say enough about the integrity of Fusion One Marketing.  I have been associated with Glyna for over 4 years and would never consider trusting the internet presence of my company to any other company.  If you want the highest level of customer service and the best service to grow your business, meet with Fusion One Marketing today!!\n\nMichel Coleman\nColeman Construction, Inc.", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "110220750422783895705", "name": "Brian Adams", "time": 1529084962473, "rating": 5.0, "text": "At Mr. Bugg's we have used Glyna and Rob with FusionOne for close to 10 years and they do an outstanding job with our website and anything else we have had them do.  I would HIGHLY recommend them.", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "108920923591288886388", "name": "Greg Womble", "time": 1432925676669, "rating": 5.0, "text": "Glyna and Rob at Fusion One Marketing are outstanding digital marketers but also great people, too. They really help you understand the many online marketing options in a clear way and have a spirit of collaboration, not control. Their expertise is top-notch.\n\nI have worked with a lot of specialty marketing shops over the years and can honestly recommend these folks to anyone needing SEO and/or digital marketing help.", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "111092795227108123196", "name": "DAVID WAYMIRE", "time": 1487431134991, "rating": 5.0, "text": "I am starting a new business and Rob and Glyna at Fusion One came highly recommended from an inquiry I made on our local FB page. They did not disappoint!  Upon contact, Glyna promptly met with me to discuss my options and what they could do for me.  From simple ideas, examples, and feedback I provided, they created my company logo then got to work creating my company website.  It was wonderful to be able to communicate directly with them with my ideas and concerns.  Despite my many changes, they were almost spot on meeting the timeline they quoted for completion.  I am very pleased with both the logo and my new website and I look forward to a long and successful relationship with Fusion One Marketing.", "pics": null, "resp": {"time": 1489062327432, "text": "Thanks David, it was a pleasure to work with you.  Please let us know if there is anything else we can help you with."}, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "115886238599327982145", "name": "Brent Panell", "time": 1512050802541, "rating": 5.0, "text": "Bottom line...they will increase your business revenue and image quality!", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "115454289720838197298", "name": "Ron Eddings", "time": 1421093403378, "rating": 5.0, "text": "I highly recommend Fusion One Marketing for building your website construction and maintenance. Glyna goes the extra mile to ensure she understands the needs of her clients and help them to best optimize their website and outreach via internet marketing. She has been a pleasure to work with and has made a positive contribution to the success of my business.  I look forward to our continued business relationship and would recommend Fusion One to anyone.", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "111092795227108123196", "name": "DAVID WAYMIRE", "time": 1487431134991, "rating": 5.0, "text": "I am starting a new business and Rob and Glyna at Fusion One came highly recommended from an inquiry I made on our local FB page. They did not disappoint!  Upon contact, Glyna promptly met with me to discuss my options and what they could do for me.  From simple ideas, examples, and feedback I provided, they created my company logo then got to work creating my company website.  It was wonderful to be able to communicate directly with them with my ideas and concerns.  Despite my many changes, they were almost spot on meeting the timeline they quoted for completion.  I am very pleased with both the logo and my new website and I look forward to a long and successful relationship with Fusion One Marketing.", "pics": null, "resp": {"time": 1489062327432, "text": "Thanks David, it was a pleasure to work with you.  Please let us know if there is anything else we can help you with."}, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "100924781610605824371", "name": "Brooks Barron", "time": 1446420894385, "rating": 5.0, "text": "Awesome Company! Hired them to build a website and logo and they went far beyond expectations.", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "102518946299758516230", "name": "Bryan Bell", "time": 1438868381775, "rating": 5.0, "text": "If you have a business that's on the Web (which EVERY business should be) then you need to contact Glyna Humm with Fusion One Marketing.  Not only will she complete a \"health check\" to make sure your Web and social media presence is healthy but she will bring you tons of business!  Call Glyna and today thank me later! ☺", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "106733246036362941034", "name": "Susan Taylor", "time": 1407536531136, "rating": 5.0, "text": "We have been fortunate to rely on FusionOne and Glyna Humm for all our internet marketing needs for the past three years.  I have found our investment in web hosting and search engine optimization with FusionOne to be the most beneficial of all our marketing strategies.  I have been especially impressed with the attention to detail, and exceptional customer service that FusionOne and Glyna Humm embody.  I highly recommend FusionOne to any business owner looking for professional, personal and effective internet marketing.\n\nSusan Taylor", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "106294846547217048524", "name": "Scott Sutton", "time": 1527177292346, "rating": 5.0, "text": "Awesome at what they do!", "pics": null, "resp": {"time": 1527876016386, "text": "Thanks Scott, we love working with you and your team"}, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "103088374559297472035", "name": "Garry Garzarek", "time": 1408455600570, "rating": 5.0, "text": "Huge fan of Fusion One Marketing. Glyna gets it done!", "pics": null, "resp": null, "gmap_id": "0x88893e6950e78d65:0x2ecb09b69caf006b"}
{"user_id": "109712313376979401335", "name": "Brittany Brooks", "time": 1617126385541, "rating": 5.0, "text": "GREAT EXPERIENCE. I contacted the team to request a quote for Baby Shower invites. They were very nice and helpful. They had the invites printed and ready to go two days after I had first contacted them. They turned out GREAT. I will definitely be using them again in the future.", "pics": null, "resp": {"time": 1621966799810, "text": "Thank you Brittany for trusting us with your printing needs!"}, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "112730755608037090042", "name": "Juana M", "time": 1621016914257, "rating": 5.0, "text": "Outstanding service! They went above and beyond to get our flyers printed for a Conference in Hunstville on very short notice. We needed last minute prints because our marketing literature was lost in the mail when shipping from Houston. We are very grateful for them! Thank you!", "pics": null, "resp": {"time": 1621966759404, "text": "We're so glad you contacted us and that it worked out for you!"}, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "108141785636663852938", "name": "Lloyd Thompson", "time": 1612798592846, "rating": 5.0, "text": "I can't say enough good things about these folks. They are more than prompt, super friendly, very helpful, reasonably priced, centrally located, and just plain cool. Everyone who works there has a nice attitude and they obviously care about the quality of the work and the needs of their customers. I wish I could leave 10 stars.", "pics": null, "resp": {"time": 1621967271052, "text": "Thank you very much for trusting us with your printing Lloyd!"}, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "104947697651991216587", "name": "Emily Key", "time": 1609801088743, "rating": 5.0, "text": "Phenomenal service. Minuteman is always so helpful to me when I am doing odd projects and need to figure out the best way to do it. Even when the job might seem unimportant or small.\n\nI received incredible support from them today after I wanted small precise card sized stickers done of my art and they did everything they could to help me figure it all out, even helped me budget and cut my own costs with the needless things.\n\nI never feel deceived or oversold on anything and the work always comes out high quality. I love this company and the people here, they really do care about their work. Aways my preferred choice for printing!!", "pics": null, "resp": {"time": 1621967328723, "text": "Thank you for making us your goto for printing needs Emily, I'm so glad we could partner with you!"}, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "115665119594433046587", "name": "Amy McWilliams", "time": 1603458273713, "rating": 5.0, "text": "The team at Minuteman Press is wonderful! Highly quality products coupled with great staff makes Minuteman Press our go to printer.\n\nJonathan's team has assisted us with hundreds of projects for our company and our clients. We keep going back for competitive pricing, knowledgeable and responsive staff, and quick turnarounds.", "pics": null, "resp": {"time": 1604666893471, "text": "Thank you Amy!  It's always fun working with y'all!"}, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "103939048334353401700", "name": "Joseph Conwell", "time": 1606243732664, "rating": 5.0, "text": "Jonathan and his team are great at what they do!  Whether it is a small print job for stationary or a large commercial print job or vehicle wrap they are the best!  Theater handle all of my printing needs with quality and care!", "pics": null, "resp": {"time": 1606917192810, "text": "Thank you Joseph!  We really appreciate the relationship we've been able to build with you and your team!"}, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "109295715829904418318", "name": "emily long", "time": 1592852954732, "rating": 1.0, "text": "upon visiting the shop i witnessed some unprofessional mannerism from the owners from the beginning. It should have been a red flag that i should have not ignored. The owner and his wife were arguing. Which i later found out was a constant occurrence. He even went to tell me personal things about his wife that no man should say about his wife.  The owner Johnathan was very unprofessional and exuded the attitude that he was above everyone else. The signs i purchased were of poor quality and not the correct size. I later called to complain and Johnathan was very rude. Did not care to hear a customers concerns. And talked to me like i was scum on the bottom of his shoes. I would not recommend this place at all the owners are unprofessional and the quality of their products is not good either.", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "106772910973652518388", "name": "Kimberly Hardee", "time": 1602184398871, "rating": 5.0, "text": "Jonathan and his team go above and beyond to produce quality products with great customer service! I use them for all of my printing needs!", "pics": null, "resp": {"time": 1602247420720, "text": "Thank you!  We really appreciate your business!"}, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "114541687110494273846", "name": "Julie M", "time": 1378237169650, "rating": 5.0, "text": "We have used Minute Man for all of our school copying needs. Jonathan is wonderful to work with. He's very efficient and helpful. Every employee I have encountered there has been totally professional and very nice. It's always a joy to go in there. Plus, being able to utilize the website to upload documents for printing is so convenient. Everyone around me who has been in Minute Man comments on how nice everyone is. Copying is quick and great quality every time!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "117757841839748531934", "name": "Kristen Bowen", "time": 1458323995892, "rating": 5.0, "text": "We had a great experience with Minuteman Press! I recently became the Marketing and Advertising Manager of a local company. Almost immediately, I began searching for a new printing company to build a relationship with. I met with Johnathan and reviewed their pricing, 1/2 of the prices we were getting from other companies. That was not the best part though, Laura, completely revamped our large brochure. It looks incredible! They were cheaper, did a better layout, much friendlier and cheaper than anywhere else we looked!\nThey make us look great! So happy we switched!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "112063233924215051379", "name": "Lauren Jones", "time": 1508956394312, "rating": 5.0, "text": "I cannot speak highly enough or recommend them enough! From save-the-dates, to rehearsal invites, to the whole wedding suite invites and menus and programs etc etc etc -- they went above and beyond to make everything look perfect AND IT IS SO AFFORDABLE! They have the nicest, most accommodating customer service and the highest quality work from the graphic design to printing to mail merging for envelopes. Save your headaches and money and use them.", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "106708779202925730278", "name": "Carolyn Dietrich", "time": 1465483520596, "rating": 5.0, "text": "I own a real estate company and a property management company in Madison.  We have been using Minuteman Press for business cards, magnets, signs, etc. for years.  We use them because of the great relationship we have with Dawn McDonnell.  She is professional, knows her products, has timely delivery and is incredibly nice!  I never inquire about price, because to me, it doesn't matter.  I get quality products with excellent customer service, and that is most important to me.  She also did a great job on our wedding service programs!  We highly recommend Dawn McDonnell and the staff at Minuteman Press!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "111238639357124474343", "name": "Minuteman Press-Franklin", "time": 1540298077308, "rating": 5.0, "text": "Outstanding team! Jonathan has been tremendously helpful to our company and I highly recommend them for any printing / marketing design project you may have.", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "106749335324908338173", "name": "Bippen Electric, Inc", "time": 1501541331455, "rating": 5.0, "text": "Just had Minuteman design, print and install a full vehicle wrap on one of our company vehicles. It turned out great! Our logo and text are reflective. So at night they glow when headlights hit them. Looking forward to having another one done soon. Can't say enough about the staff at Minuteman. Thank you! 👍🏼", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "108753108714030688194", "name": "David Rice", "time": 1515609157046, "rating": 5.0, "text": "Always prompt, professional, and the best customer service you could ever ask for.\nI’ve been a customer for 4 years now and I am always pleased at how well the Huntsville team always handles my orders, regardless of how much or how little time I give them.  They routinely produce my orders and have them shipped to the locations of my choice, and always on time and perfectly completed.\nA huge thank you for always helping me look good and professional.", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "112143996543368815315", "name": "Shannon Harwell", "time": 1515613247587, "rating": 5.0, "text": "Minuteman Press has printed our company materials for the past few years.  They came highly recommended by someone else in the printing business and have created professional material for us in a timely manner.  I recommend them to anyone who needs something professionally printed.", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "101325687715950030996", "name": "Erin Bloxhamcurtis", "time": 1515613277599, "rating": 5.0, "text": "I LOVE working with the team at Minuteman Press. All of our items are printed in a professional and timely manner. From graphics to delivery - they do it all!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "106944561608081175142", "name": "Joshua McAlister", "time": 1484077460332, "rating": 5.0, "text": "Minuteman Press is great. They always complete orders in a timely and quality fashion. I've used them for quite a few things and have always been happy. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "102188842520207310290", "name": "A G", "time": 1363120347401, "rating": 5.0, "text": "Minuteman always does an above and beyond job with all of their printing jobs. Anything from one-off projects to thousands of items, Jonathan and the whole staff always make sure to end product is professional, clean, and cost-efficient. Even for (admittedly) last-minute jobs, I know I don't have to worry after I hand my artwork off to Minuteman--they'll get the job done! :)\n\nI will recommend them to anyone!!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "116958345781014600308", "name": "Allison McReynolds", "time": 1450279305046, "rating": 4.0, "text": "I have used Minuteman Press for many professional designs and prints as well as personal prints for my wedding. I appreciate their timeliness with communicating to their customers and the care they take with their work. They definitely make it easy to keep coming back!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "104942084764579884784", "name": "Alan Helms", "time": 1515601499471, "rating": 5.0, "text": "They are always willing to help and have a very fast turn around. They make doing business very easy with there delivery service!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "105622629993637745821", "name": "Wesley Moffett", "time": 1515605295883, "rating": 5.0, "text": "This was my first print job done via Minuteman Press, and I was very happy with both their customer service and the product they created for me. I will definitely use them again in the future!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "104679082656021647590", "name": "Tina Parker", "time": 1355782343678, "rating": 5.0, "text": "Jonathan and his stafff are helpful and easy to work with.  They provide exceptional service and always meet our demands, especially when we are in a hurry!! Thanks for all you do, the whole staff at Home Mortgage of America.", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "104693908342767835481", "name": "Josh Henry", "time": 1465483154593, "rating": 5.0, "text": "This is the place to go for all your printing needs!! Dawn has a great talent for understanding what is needed to get the job done and in a timely manner. The prices are very fair in todays market. Love this place!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "103960411672054648509", "name": "Brandon Morris", "time": 1515693874116, "rating": 5.0, "text": "Very helpful and friendly staff. Gave me good options and delivered great quality product.", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "113717721904274283439", "name": "ashley dunwoody", "time": 1515601137788, "rating": 5.0, "text": "The staff is awesome!  They are always so friendly and helpful when I need them!  I would highly recommend them to anyone!!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "103651917231488934159", "name": "William Warrington", "time": 1515623195644, "rating": 5.0, "text": "All jobs were on time and within budget.  All problems were resolved quickly.  Great people to work with.", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "105432166541899747740", "name": "Kallie Butler", "time": 1515606253759, "rating": 5.0, "text": "Great staff, amazing customer service and all the products that we've ordered have been exactly what we've asked for. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "104693908342767835481", "name": "Josh Henry", "time": 1465483154593, "rating": 5.0, "text": "This is the place to go for all your printing needs!! Dawn has a great talent for understanding what is needed to get the job done and in a timely manner. The prices are very fair in todays market. Love this place!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "107840104192505670312", "name": "Dr. Debbie Hargett", "time": 1515604276339, "rating": 5.0, "text": "Wonderful customer service and quick turnaround on their work. Would definitely recommend Minuteman Press!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "104679082656021647590", "name": "Tina Parker", "time": 1355782343678, "rating": 5.0, "text": "Jonathan and his stafff are helpful and easy to work with.  They provide exceptional service and always meet our demands, especially when we are in a hurry!! Thanks for all you do, the whole staff at Home Mortgage of America.", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "111830868184765628044", "name": "Bo Thomas", "time": 1378398165288, "rating": 5.0, "text": "We use Minute Man for all of our printing needs. They always take care of us and offer many other products besides print. When I have been in a time crunch I have talked to Jonathan directly and he has always come through to get the project done on time.", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "103040660697176088352", "name": "danny newton", "time": 1515601955372, "rating": 2.0, "text": "Used their services several times. Every single time, they tell me it will be ready at a time and date. I show up after that time to pick it up, walk in, and it is NEVER READY! THIS IS EXTREMELY FRUSTRATING. No, I do not want to return later. No I do not want to sit in the lobby and wait for you to make it happen. Have it ready when you say it will be ready.\n\nLast time I was there the manager said, \"I thought I told you it would be ready tomorrow\" I proceeded to read him the email he sent to me the day before saying it would be ready. He said \"oh, I'll have it in 5 minutes\"\n\nI have decided to go with another printer.", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "108089085910743765406", "name": "Linex Marketing", "time": 1515605577591, "rating": 5.0, "text": "Love the customer service, support and partnership that MInuteman brings to our business.", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "108670955347642886754", "name": "Stephen Rice", "time": 1315958937318, "rating": 5.0, "text": "Great service, great prices!  Jonathan and his crew are the best in town", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "114374722355092505230", "name": "Timekee Turner PhD", "time": 1520799050487, "rating": 5.0, "text": "Always on time. Always perfect. #excellentwork", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "117610076178447721976", "name": "Nichelle Fields", "time": 1375385337677, "rating": 3.0, "text": "They are great when you have a big Company name behind you, but if you are a small business owner, the service was very slow. No follow ups I had to follow up three times plus it finally took three weeks to get my order. Johnathon is not what he is cranked up to be either.", "pics": null, "resp": {"time": 1376688156810, "text": "Wow, I am very sorry that you had a bad experience with Minuteman Press and especially with me.  I am not aware of this situation.  Please contact me at your convenience so that I may be able to resolve the issues and hopefully provide a solution that will help.\nJonathan"}, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "102693635942299023596", "name": "Elizabeth Houssain", "time": 1371754060872, "rating": 5.0, "text": "Minuteman Press ALWAYS provides extraordinary service at a great price.  I recommend them to all of my clients, and they are so happy with their experience at Minuteman, they come back to me and thank me for the referral!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "100660179116163681659", "name": "chris denton", "time": 1515699366246, "rating": 5.0, "text": "Great customer service and a very detail oriented staff.", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "103061496153617449992", "name": "Jeff Lyons", "time": 1515601711521, "rating": 5.0, "text": "Everyone on the team is great - professional, friendly, attention to quality and detail, and always courteous and a pleasure to work with! Thank you!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "106095243764111417495", "name": "Karla Hawkins", "time": 1515610227014, "rating": 5.0, "text": "Very friendly and excellent work on our business cards. Thank you!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "116423399150491827737", "name": "Marcus Elliott", "time": 1515693484128, "rating": 5.0, "text": "I trust these guys with our printing needs. Always helpful!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "118414997703837653650", "name": "Stephanie Cash", "time": 1515605165461, "rating": 5.0, "text": "Easy to communicate with and finished product looked great!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "116618245838620930244", "name": "Brian Bellomy", "time": 1515623305618, "rating": 5.0, "text": "Great Quality and great staff!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "106248796164291440939", "name": "Jim Algie", "time": 1515625577522, "rating": 5.0, "text": "Had a short deadline to meet which was met with time to spare and all of this happening during the holidays.  Thanks.", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "117608643934852788872", "name": "Karen Sumerlin", "time": 1515682916320, "rating": 5.0, "text": "Great service, top quality work, excellent product!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "117689088833133845635", "name": "Malcolm Taylor", "time": 1515605207428, "rating": 5.0, "text": "They do good work here.", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "108299925021361460427", "name": "Adrienne Matthews", "time": 1515614490482, "rating": 5.0, "text": "Quick and quality products. A+++", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "108299925021361460427", "name": "Adrienne Matthews", "time": 1515614490482, "rating": 5.0, "text": "Quick and quality products. A+++", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "118287547268761178824", "name": "Jay Hixon", "time": 1515617298222, "rating": 5.0, "text": "Great folks and service!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "104552545058395716550", "name": "Aaron Lutz", "time": 1498959581880, "rating": 4.0, "text": "They helped me with what i need but expensive to print just 3 pages of paper!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "110320296564179304572", "name": "Brandi Mason", "time": 1515604840228, "rating": 5.0, "text": "Quick and accurate service", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "106583819761605020384", "name": "BamAlaBam", "time": 1515602408498, "rating": 5.0, "text": "Professional and on-time!", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "101764762922306199319", "name": "Torrey Price", "time": 1515617487343, "rating": 5.0, "text": "Friendly, fast, and reliable", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "104618065653989099647", "name": "Bryan Radcliffe", "time": 1400972656938, "rating": 5.0, "text": "excellent", "pics": null, "resp": null, "gmap_id": "0x88626b245b431b67:0x9e26c9d46b3e4199"}
{"user_id": "104093044306379614718", "name": "Johnnie Hooch", "time": 1615513215486, "rating": 1.0, "text": "Go cry covid we all wanna hear more of the same doomsday", "pics": null, "resp": null, "gmap_id": "0x889a4c4b8959cfb7:0x58c85b0c054b29ff"}
{"user_id": "114087658795157476103", "name": "John McKenzie", "time": 1619755814543, "rating": 5.0, "text": "Great people 👏 👍", "pics": null, "resp": null, "gmap_id": "0x889a4c4b8959cfb7:0x58c85b0c054b29ff"}
{"user_id": "114193460151658072334", "name": "David Jones", "time": 1615319885826, "rating": 1.0, "text": "I actually had called for advertising for my business and never got a call back", "pics": null, "resp": null, "gmap_id": "0x889a4c4b8959cfb7:0x58c85b0c054b29ff"}
{"user_id": "115627986747591244320", "name": "Cynthia Cowart", "time": 1571325411749, "rating": 1.0, "text": "What your station advertised on the issue of The Mobile County School Buses was very much uncalled for,,, NO CAMERAS ON THE BUSES,,, You put a lot of School Drivers & Children is harms way. You are basically telling the public to run a stopped bus ,,, GOOD CALL,,,, Our Bus Drivers & Children are in danger everyday ,, Due to the fact the public does not respect these drivers,,, Look at the accident that occurred due to a speedy driver which caused the life of a Bus Driver. Insure I speak for a lot of the public . Your station along with the other ones need to retract your stories ,,, as WELL AS NOT PUTTING SUCH ON TV", "pics": null, "resp": null, "gmap_id": "0x889a4c4b8959cfb7:0x58c85b0c054b29ff"}
{"user_id": "108380224181825661065", "name": "Michael King", "time": 1601177086369, "rating": 5.0, "text": "Easy way to get news from the gulf coast", "pics": null, "resp": null, "gmap_id": "0x889a4c4b8959cfb7:0x58c85b0c054b29ff"}
{"user_id": "108456167127992666516", "name": "Charlotte Hensarling", "time": 1591571096759, "rating": 1.0, "text": "Worst channel. We don't need an hourly review of rain. Thanks for ruining the race My family has banned this channel.", "pics": null, "resp": null, "gmap_id": "0x889a4c4b8959cfb7:0x58c85b0c054b29ff"}
{"user_id": "115727302336720591147", "name": "Kaquandria Johnson", "time": 1566145689968, "rating": 5.0, "text": "In my opinion Fox 10 is accurate and informative....I called to get the email address to send my son 1st day of school pic...It was so early in the morning...the operator forwarded me to the correct and the both of their attitudes was awesome and professional..", "pics": null, "resp": null, "gmap_id": "0x889a4c4b8959cfb7:0x58c85b0c054b29ff"}
{"user_id": "104857913810070639259", "name": "C W", "time": 1590811034496, "rating": 1.0, "text": "If you spent less time repeating the same stories over & over, then you could have saluted all the seniors that were sent in. Therefore, I'm done with fox 10 news!", "pics": null, "resp": null, "gmap_id": "0x889a4c4b8959cfb7:0x58c85b0c054b29ff"}
{"user_id": "116534245479834864658", "name": "Lord Benson", "time": 1591571449051, "rating": 1.0, "text": "God forbid we actually get a hurricane in the Gulf. We're having a rain event with wind gusting at little more than a windy day at the beach. Please chicken little stop interrupting the race. Have you guys ever heard of the saying\"don't making a mountain out of a molehill\"? You're guilty !", "pics": null, "resp": null, "gmap_id": "0x889a4c4b8959cfb7:0x58c85b0c054b29ff"}
{"user_id": "105405409715930864815", "name": "Becky Lawson", "time": 1609650780622, "rating": 4.0, "text": "Very friendly  get right to points", "pics": null, "resp": null, "gmap_id": "0x889a4c4b8959cfb7:0x58c85b0c054b29ff"}
{"user_id": "104052372353433579471", "name": "Karl", "time": 1605190049925, "rating": 1.0, "text": "More \"fake\" liberal news.", "pics": null, "resp": null, "gmap_id": "0x889a4c4b8959cfb7:0x58c85b0c054b29ff"}
{"user_id": "109007132771459474950", "name": "Becky Romano", "time": 1587670827467, "rating": 1.0, "text": "The breaking news reporter needs to learn how to read. She is stumbling through her report. It is redicicous.", "pics": null, "resp": null, "gmap_id": "0x889a4c4b8959cfb7:0x58c85b0c054b29ff"}
{"user_id": "113437576734614425234", "name": "Lisa Davison", "time": 1579034979105, "rating": 4.0, "text": "Great news station. News accurate.", "pics": null, "resp": null, "gmap_id": "0x889a4c4b8959cfb7:0x58c85b0c054b29ff"}
{"user_id": "101737590292971236695", "name": "Denise Dee Nelson", "time": 1567559178474, "rating": 5.0, "text": "Awesome caring people. Makes sure we the people are kept up with the news weather", "pics": null, "resp": null, "gmap_id": "0x889a4c4b8959cfb7:0x58c85b0c054b29ff"}
{"user_id": "115853470607710304132", "name": "Hornaday quickfire", "time": 1556937346803, "rating": 1.0, "text": "Fox 10 is becoming way too political. Instead of reporting news, they have jumped on the liberal bandwagon. Promoting racism and hatred.", "pics": null, "resp": null, "gmap_id": "0x889a4c4b8959cfb7:0x58c85b0c054b29ff"}
{"user_id": "116105769661178638199", "name": "Bernard Chapman", "time": 1582139315314, "rating": 5.0, "text": "Everyone have the nice attitude and have respect for everyone", "pics": null, "resp": null, "gmap_id": "0x889a4c4b8959cfb7:0x58c85b0c054b29ff"}
{"user_id": "111886213505066063454", "name": "Aimee Hotchkiss", "time": 1535216811968, "rating": 5.0, "text": "Wonderful crew! Bus stop forecast was very organized. Had fun!", "pics": null, "resp": null, "gmap_id": "0x889a4c4b8959cfb7:0x58c85b0c054b29ff"}
{"user_id": "109698919245530967197", "name": "RUSSELL PILLING", "time": 1552319206901, "rating": 5.0, "text": "Fox 10 is great on helping getting the word out for benefits and news", "pics": null, "resp": null, "gmap_id": "0x889a4c4b8959cfb7:0x58c85b0c054b29ff"}
{"user_id": "117644353901052888034", "name": "Sissy Geist", "time": 1571624140935, "rating": 3.0, "text": "Please tell the new weather woman to talk slowly and enunciate her words and not stand in front of weather map...don’t understand anything she says. Thank you....", "pics": null, "resp": null, "gmap_id": "0x889a4c4b8959cfb7:0x58c85b0c054b29ff"}
{"user_id": "102842996830957234172", "name": "Linda Parker", "time": 1530742733972, "rating": 5.0, "text": "Best time our tour was given by our beautiful granddaughter that's works there", "pics": null, "resp": null, "gmap_id": "0x889a4c4b8959cfb7:0x58c85b0c054b29ff"}
{"user_id": "108259019381558190450", "name": "Miss Shauntay", "time": 1582741268525, "rating": 5.0, "text": "Best news station in Mobile!", "pics": null, "resp": null, "gmap_id": "0x889a4c4b8959cfb7:0x58c85b0c054b29ff"}
{"user_id": "117390867511352877513", "name": "Stormi Paulk", "time": 1558549252629, "rating": 1.0, "text": "Fake news to distract from real events", "pics": null, "resp": null, "gmap_id": "0x889a4c4b8959cfb7:0x58c85b0c054b29ff"}
{"user_id": "102657731022331714831", "name": "June Spoon", "time": 1569954305381, "rating": 5.0, "text": "It was great", "pics": null, "resp": null, "gmap_id": "0x889a4c4b8959cfb7:0x58c85b0c054b29ff"}
{"user_id": "116354866446786710157", "name": "susan vinson", "time": 1557253609105, "rating": 5.0, "text": "They were very professional", "pics": null, "resp": null, "gmap_id": "0x889a4c4b8959cfb7:0x58c85b0c054b29ff"}
{"user_id": "112203066997871872473", "name": "Matt Mullis", "time": 1475059032776, "rating": 5.0, "text": "Beautiful campus. Very friendly staff.", "pics": null, "resp": null, "gmap_id": "0x889a4c4b8959cfb7:0x58c85b0c054b29ff"}
{"user_id": "100669673005814624011", "name": "Stacey Silvers", "time": 1569438539511, "rating": 5.0, "text": "Love the info", "pics": null, "resp": null, "gmap_id": "0x889a4c4b8959cfb7:0x58c85b0c054b29ff"}
{"user_id": "101181375279448519917", "name": "Willie Perryman", "time": 1588709789394, "rating": 5.0, "text": "Mobile", "pics": null, "resp": null, "gmap_id": "0x889a4c4b8959cfb7:0x58c85b0c054b29ff"}
{"user_id": "114966369554920618138", "name": "Bill Ryleigh Motley", "time": 1517928975655, "rating": 5.0, "text": "They are the best in Mobile Al.", "pics": null, "resp": null, "gmap_id": "0x889a4c4b8959cfb7:0x58c85b0c054b29ff"}
{"user_id": "109923343488671279062", "name": "Janet Quiggle", "time": 1492393542963, "rating": 5.0, "text": "Love it watch everyday!", "pics": null, "resp": null, "gmap_id": "0x889a4c4b8959cfb7:0x58c85b0c054b29ff"}
{"user_id": "100937166842528857152", "name": "Jarmark Thornton", "time": 1387941709820, "rating": 1.0, "text": "Fox10 was my grandma favorite show as a lil boy I pick it up now I'm grown now and I'm still watching it", "pics": null, "resp": null, "gmap_id": "0x889a4c4b8959cfb7:0x58c85b0c054b29ff"}
{"user_id": "100213922223259115771", "name": "Ryan Major", "time": 1449455642341, "rating": 4.0, "text": "fox10 News", "pics": null, "resp": null, "gmap_id": "0x889a4c4b8959cfb7:0x58c85b0c054b29ff"}
{"user_id": "116147718482325272230", "name": "jeraldine williams", "time": 1383569599631, "rating": 4.0, "text": "fox 10 is my favorite place to get local news they keep you up on all alerts especially on dangerous storms, and in most cases they are first on all breaking news", "pics": null, "resp": null, "gmap_id": "0x889a4c4b8959cfb7:0x58c85b0c054b29ff"}
{"user_id": "112978050854996770755", "name": "Matthew Riales", "time": 1569528543450, "rating": 3.0, "text": "(Translated by Google) Boooooooo !!!\n\n(Original)\nBoooooooo!!!", "pics": null, "resp": null, "gmap_id": "0x889a4c4b8959cfb7:0x58c85b0c054b29ff"}
