{"user_id": "106714065417311034723", "name": "Genoc Genesis", "time": 1628010366141, "rating": 5.0, "text": "I see Maggie Kellar and her nurse Mackenzie. They are both fantastic and very personable. I drive 45 minutes just to see them specifically. My experience with Mrs.Kellar is the best doctor/patient experience I have ever had. As long as the both of them are there I will always come back.", "pics": null, "resp": {"time": 1628011594099, "text": "We appreciate the five-star review. Thank you for taking the time. I share this with the team!\nKindly,\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "111088285127167682268", "name": "melody galloway", "time": 1626799700334, "rating": 5.0, "text": "Wonderful clinical staff.  Love love LOVE Dr. Lona!  She's intuitive and kind always.", "pics": null, "resp": {"time": 1626804381575, "text": "Melody, thank you for taking the time to leave us a review. We appreciate your kind words and I will share them with the team.\nKindly,\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "112747420689615813668", "name": "Mark Gotschall", "time": 1619647761047, "rating": 5.0, "text": "This place is so much the improvement over the Mobile location.  Miss Anita has always taken good care of me.", "pics": null, "resp": {"time": 1619704167460, "text": "We appreciate the review and value your feedback. Thanks for taking the time. I will share it with our team!\nKindly,\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "107238972653597520709", "name": "Bernard Doug Cook", "time": 1618246308024, "rating": 4.0, "text": "Seeing a therapist there, Barbara Lee, she's pretty good.", "pics": null, "resp": {"time": 1618253299486, "text": "Hi Bernard, thank you so much for the review. I am happy to hear you've had a positive experience at BayView. I will share your feedback with our team!\nKindly,\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "101933426791587473106", "name": "Paula D", "time": 1611276984306, "rating": 5.0, "text": "I love this office! I recently had my first appointment there in the office with Ms. kellar. The nurse mckenzie and ms Keller we’re both very kind and i could tell they really cared about me and my mental health. As long as dr kellar and McKenzie are there i will continue to come.", "pics": null, "resp": {"time": 1611328235036, "text": "So glad you had a great experience, Paula. I will share your feedback and praise with our team. Have a wonderful day!\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "105056974580107650670", "name": "Gail GULF SHORES", "time": 1598468288749, "rating": 5.0, "text": "So far so good for the excellent help I've got online with KATHERINE DAVIS. She is a very compassionate employee,  \"goes the extra mile \". So helpful with any questions.  A keeper.", "pics": null, "resp": {"time": 1598472946760, "text": "Hi, Gail! Thank you for the five-star review. We appreciate your kind words.\nSincerely,\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "107061948462776552968", "name": "Sandi Cushway", "time": 1581717258298, "rating": 2.0, "text": "They completely changed my medications that I have been stable on for over 15 years (with not ever having to increase ANYTHING).  I have only seen the PA twice and she was pretty nice.  There seems to be little concern for what I, as their patient, am going through every single day as a result of their decisions.  They are making matters worse for me mentally to where I am barely functional at home or work.  The only reason I gave two stars is for the nurse, Anita.", "pics": null, "resp": {"time": 1581721202681, "text": "Sandi, I am sorry to hear we did not meet your expectations. Your feedback will help us improve our services. If there is anything further you wish to add you can reach a member of our patient relations department at info@altapointe.org.\nKindly,\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "101617498648064415605", "name": "Billiam Quine", "time": 1575313763900, "rating": 1.0, "text": "They have an issue with making sure their records are up to date. Their staff isn’t helpful and I’m not sure they could be even if they wanted to. Lots of “Its not my problem” going on there. Find someone else to see. Just because they may be the biggest certainly doesn’t mean they are the best.", "pics": null, "resp": {"time": 1575403907628, "text": "Hi, Billiam. I am sorry to hear we did not meet your expectations of care. We appreciate the feedback because it will help us improve our care. If you would like to share more about your experience you can send an email to info@altapointe.org or reach our Patient Relations department at (833) 921-1811.\nKindly,\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "113201579604041302758", "name": "Serena kay", "time": 1565619809891, "rating": 5.0, "text": "I found a place where I could get help for my autistic son that's transitioning into adulthood. It's nice to have a place we can call and talk to and get help with medications without coming across as different or weird.  They deal with these things on a daily basis and it feels good to be understood.", "pics": null, "resp": {"time": 1566234746100, "text": "Hi, Serena Kay. Thank you for the five-star review. We appreciate you and your feedback.\nSincerely,\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "114717128277114793724", "name": "Shae McIntyre", "time": 1578512568798, "rating": 1.0, "text": "First of all it took 3 months to get in to see a nurse practitioner to try to get different medication for my anxiety. Second, I finally get to my appointment and because I have shingles (which is a. Only contagious when the fluid in the blisters are touched but b. All of my stuff was covered and wrapped up) they said they would need to do a full decontamination sweep and I would have to get the clearance from my doctor before I can be seen  . So I spent an hour there waiting just to hear I'm the plague basically. I've never felt so offended. I already cant go to my own brothers wedding because of it but now this. I'm furious.", "pics": null, "resp": {"time": 1578522055496, "text": "Shae, I am very sorry to hear we did not meet your expectations of care. Your feedback will help us improve our services. If you would like to provide us with additional information, you can speak to someone in our patient relations department by calling (833) 921-1810.\nKindly,\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "116324311210238740165", "name": "Juli Norman", "time": 1582921058880, "rating": 1.0, "text": "Some of the most unkind judgmental unprofessional human beings I’ve ever met. Worst money I ever spent looking for help. Went here due to my doctor no longer being in practice and instead of getting back on my regular medications I Was accused of being under the influence by the NP I saw, being two days post op. She stated “you seem drowsy and irritable” I’m tired and in pain (since I was driving I couldn’t take my pain medication). The woman who took me back for my weight and BP answered her phone and began screaming at someone about what only I can assume was her boyfriend cheating on her. Not a single employee looked at me with a smile or made me feel welcome in the slightest. These woman look at you and judge you, they didn’t even talk to me before I felt like I wanted to run out of that building. I just wish I had read reviews before giving them my money.", "pics": null, "resp": {"time": 1582924708391, "text": "Juli,  thanks for sharing your feedback. I am sorry your experience didn’t match your expectations. Your feedback will help us improve. Please feel free to reach out to our Patient Relations department (833) 921-1811 with any further comments, concerns, or suggestions you wish to share.\nKindly,\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "115186632278001103758", "name": "Ingrid Hartman", "time": 1555342724085, "rating": 5.0, "text": "My family’s experience has always great!  The location is convenient, the medical staff thorough and the clinicians spend the time needed. Thank you!", "pics": null, "resp": {"time": 1556111097279, "text": "Hi, Ingrid! Thank you for the five-star review. It is our goal to deliver the utmost in care to our patients and their families so they can live their best lives."}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "116630874358668399189", "name": "Christa Bailey", "time": 1519248559272, "rating": 1.0, "text": "People who come to BayView for help have issues. I was 2 minutes late and had to check in (wait for 6 minutes in line because a computer was down and I was standing there not knowing what to do and nobody would even look at me). I was told that I was 10 minutes late and my appointment is only 20 minutes long so I could reschedule or the doctor would work me in -of course I will have a no-show fee. I have never been here and not had to wait 15 minutes to see doc-I guess it’s a one way street.", "pics": null, "resp": null, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "105519067131511202481", "name": "Samantha Wade Caraway", "time": 1513282717030, "rating": 1.0, "text": "DO NOT GO TO BAYVIEW! THESE PEOPLE DO NOT CARE ABOUT THEIR PATIENTS! They can not even file insurance correctly. If you don't agree with them, they will refuse to do ANYTHING for you. Their only option is to increase meds that do not work or put the patient in the hospital. If I could put ZERO stars, I would!", "pics": null, "resp": null, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "112670653066595001898", "name": "Richard Vin Zant", "time": 1564409121515, "rating": 1.0, "text": "Yeah worst record keeping of any business I’ve been too.", "pics": null, "resp": {"time": 1564423971258, "text": "Hi, Richard. I am sorry to hear we did not meet your expectations. Your feedback will help us improve our services. If you would like to provide any further information, please email us at info@altapointe.org\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "105265207469834670103", "name": "Alana Marisin", "time": 1622917108016, "rating": 5.0, "text": "Dr Blanchard is an amazing counsellor, not just for me but my entire family. I recommend him any day. I’ve known Dr. Blanchard now for the past 10 years and he has made a tremendous counsellor, a great listener not just to me but for my entire family. He’s always available to listen especially when ur in need of his assistance. This is the best psychologist ever and I recommend him for the entire family. He’s very experienced in family dynamics even as an  international client, I applaud him for his availability to provide the therapy needed in my life.", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7e07e4066af877a2"}
{"user_id": "101149812088281748584", "name": "Malcolm", "time": 1619971636287, "rating": 5.0, "text": "Dr.Blanchard is an outstanding therapist! He cares deeply about his patients and their well being. I highly recommend him if you are looking for a professional, caring doctor!", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7e07e4066af877a2"}
{"user_id": "110883631770044517072", "name": "Que", "time": 1607892787236, "rating": 5.0, "text": "My experience with Dr. Blanchard has been outstanding. I'm so grateful that I've found him. He is professional, respectful, and non-judgmental, and most importantly he makes you feel like family. If you are looking for professional services, I highly recommend Dr. Blanchard, he is the best.", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7e07e4066af877a2"}
{"user_id": "104201926835272648640", "name": "Rosalind Townsend", "time": 1597464731980, "rating": 5.0, "text": "When all hope was gone.We met Dr. Blanchard. A Big glimmer of hope was restored. I highly recommend Dr. Danny for all of your counseling needs. He's very professional and proficient in all clientele matters. He actually cares about you as an individual. He also has a 97% successful rate in helping Veterans. uptain Disability Claims awarded.", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7e07e4066af877a2"}
{"user_id": "105082939991567363396", "name": "Donna Gaines", "time": 1554243529901, "rating": 5.0, "text": "My experience with Dr. Danny Blanchard is outstanding. He has really helped and helping me tremendously. : A good doctor who works hard to serve humanity and handle with care his/her patient always deserve appreciation Sending you my heartfelt thankfulness for caring and comforting. Your presence holds a positive vibe that is more powerful than your prescribed medicines.\n\nThank you so much for doing a great job for me.You’ve always been successful to keep my spirits up and maintaining good health.\n\nNo matter the illness is, against a doctor like you, they get no chance. Thanks for being such a kind doctor and being patient all the time.", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7e07e4066af877a2"}
{"user_id": "116736079883378808782", "name": "Blake Reynolds", "time": 1583177937464, "rating": 5.0, "text": "Dr. Blanchard is a good counselor and a caring man. I highly recommend you consider his services.", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7e07e4066af877a2"}
{"user_id": "101565238743296267077", "name": "Pamela Jenkins", "time": 1532448089637, "rating": 5.0, "text": "Dr. Danny Blanchard is superb. He is able to relate to his clients in a very personable manner. Dr. Blanchard cares deeply for the well-being of his clients. His staff is always courteous and ready to be of assistance. The office is always impeccable. I would highly recommend Dr. Danny Blanchard to anyone in need of a therapist.", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7e07e4066af877a2"}
{"user_id": "107139761829111289892", "name": "TheMoonfeather", "time": 1566237735347, "rating": 5.0, "text": "he will work with you. he is very helpful. i would recommend him to anyone. he cares for his patients.", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7e07e4066af877a2"}
{"user_id": "105761222035010535069", "name": "Shalanda White", "time": 1520054991698, "rating": 5.0, "text": "Dr. Blanchard and staff are exceptional at making customers feel welcome and cared about no matter where they came from,. Race, religion, status in life or what they’ve done doesn’t hinder excellent service.  Dr. Blanchard accepts everyone for who they are but is just when acknowledging when you’re right and when you’re wrong. I love that! He is a loving but just psychologist.", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7e07e4066af877a2"}
{"user_id": "104395843964256691339", "name": "Deandra Spears", "time": 1529620389176, "rating": 5.0, "text": "I highly recommend Dr. Danny Blanchard. He's very compassionate with his clients and will go above and beyond to help those in need. I love walking into his office and being greeted with care, concern, and respect from both him and his staff!! If you're looking for someone to help with your overall mental health, I'd highly recommend that you make an appointment to see Dr. Danny Blanchard!!", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7e07e4066af877a2"}
{"user_id": "100448531435877760959", "name": "Alexis Harris", "time": 1539274796225, "rating": 5.0, "text": "Dr Blanchard is an excellent marriage and family counselor. He is well known and very professional.  I strongly recommend him if u are seeking professional services.", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7e07e4066af877a2"}
{"user_id": "104631825312608306426", "name": "Stephen Washington", "time": 1549384477207, "rating": 5.0, "text": "A outstanding Mental Health Professional..I highly recommend him...My entire family ; Wife, Children & grand Children only go to Dr. Blanchard for Counseling and Guidance..We highly recommend him...STEPHEN D. WASHINGTON", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7e07e4066af877a2"}
{"user_id": "114368987268378466809", "name": "Kay Rogers", "time": 1530096335773, "rating": 5.0, "text": "Dr. Blanchard's was the best decision that I made for my son who has a mental illness. We searched and visited many professionals throughout Alabama and Georgia and Dr. Blanchard was the one who was able to understand my sons condition, relate to him, and educate me on his condition while providing us with tools to use at home. Dr. Blanchard is an excellent mental health professional.", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7e07e4066af877a2"}
{"user_id": "105472710461696545601", "name": "ll72hima", "time": 1550080396514, "rating": 5.0, "text": "Dr. Blanchard is very understanding and efficient when comes to patient care.\nI highly recommended Professional Facility.", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7e07e4066af877a2"}
{"user_id": "115986121239514554729", "name": "dana douglas", "time": 1547909570238, "rating": 5.0, "text": "My experience with Dr. Blanchard was a 5 star he is a man of his word I appreciate his hard work and patience. I strongly recommend him !!! 🙌🏾", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7e07e4066af877a2"}
{"user_id": "101285249125274111916", "name": "Chammy Deesnit", "time": 1521476666565, "rating": 5.0, "text": "Dr. Blanchard is an impressive person. He is very professional. He helped me to imrpove my mental situation. I highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7e07e4066af877a2"}
{"user_id": "110096979660538466126", "name": "Tyhara Rain", "time": 1523574719437, "rating": 5.0, "text": "Very professional, and well respected. Very dedicated to his practice and wellness of community. Goes above and beyond for patients and is accommodating to their needs.", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7e07e4066af877a2"}
{"user_id": "108852483974445082778", "name": "Gwendolyn Ragland", "time": 1533342725775, "rating": 5.0, "text": "I have known Dr. Blanchard for over twenty years and he has made a tremendous positive influence on my life and members of my family.  He is professional, knowledgeable and compassionate and really goes the extra mile for his patients.", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7e07e4066af877a2"}
{"user_id": "114609252030129085582", "name": "Peachees Eason", "time": 1503696106597, "rating": 2.0, "text": "Nice to talk to but when things are promised to be done they are never done on time or in a timely matter. Each time I needed paperwork submitted or prescription refill it was a hassle. Every single time I have had to drive from Bailey Cove to Sparkman anywhere 3-4 times in one day to get paperwork or refills. I try to support my black community but when it comes to doing things they are never done.", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7e07e4066af877a2"}
{"user_id": "115213863047414289828", "name": "JESSICA ALEXANDER", "time": 1531852933100, "rating": 5.0, "text": "Absolutely satisfied with Dr. Blanchard’s services.  I could not ask for a more professional caring experience.", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7e07e4066af877a2"}
{"user_id": "104393001410396213626", "name": "Brittany S", "time": 1520450611710, "rating": 5.0, "text": "I highly recommend Dr. Blanchard. He has away of building self esteem. Stop by and make an appointment.", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7e07e4066af877a2"}
{"user_id": "104662944056814806933", "name": "Mr Information", "time": 1520172455974, "rating": 1.0, "text": "The minute I walked in I knew it was trouble. His staff is poor, he never shows up for meetings he promises,and I even heard him lie to another client. The reason I know is because he promised me he would be there at the time he told that client he lied to. I sat outside his locked office  for a hour and he never showed up but told that person over the phone he was there at the times I was. Avoid this guy. If you want real help find someone else.", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7e07e4066af877a2"}
{"user_id": "103609220396290114682", "name": "Kyla Meed", "time": 1525983133464, "rating": 5.0, "text": "Dr. Blanchard is a great marriage and family counselor. He has a very nice and reliable staff.", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7e07e4066af877a2"}
{"user_id": "115885759763447624887", "name": "Yvonne Hamilton", "time": 1519835496688, "rating": 5.0, "text": "I highly recommend him. He is very passionate about his work . He staff is very helpful in helping you . He good beyond his duty to help you.", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7e07e4066af877a2"}
{"user_id": "108904016009895772249", "name": "Timothy Byrd, Sr.", "time": 1533169468859, "rating": 5.0, "text": "Dr. Danny Blanchard is a wonderful counselor. I have known Danny for more than 40 years; I was a freshman in college and Danny was one of the student organizations officers at that time. Danny showed great leader ship even as a student .   Dr Blandchard inspired me to run for office as a student leader at that university. Danny shows great compassion and allows the client to speak and express themselves.\n\nDr Blandchard has a special knack for allowing the client to relax and give total surrender to his way of asking questions and getting to the bottom of the real issues and then develop a plan to resolve these issues one at a time in such a way that the client does not feel intimidated. The sta dr Blandchard has a special knack for allowing the client to relax and give total surrender to his way of asking questions getting to the bottom of the real issues and then develop a plan to resolve these issues one at a time in such a way that the client does not feel intimidated. The staff at Dr Blandchard’s office is very professional and they always keep matters cup for dinner soo The staff at Dr Blandchard office is very professional and they always keep matters  confidential. Dr Blandchard knows exactly when to bring in other members of the family to resolve family issues and matters. He never rushes a client for a speedy answer that is to say before all the issues I brought forth. Dr Blandchard has a multitude of contacts and ways of helping clients mentally physically and financially. Sometimes clients don’t have the money to pay but Danny will help them anyway. I have total confidence in Dr Blandchard in everything that he does, he is a very strong  Community leader. Dr Blandchard never makes you feel small or unimportant or that your issues are trivial. He makes you feel as though you are closer than A family member.  Recommend Dr. Danny Blanchard as one of the best in his field and would recommend him to anyone who needs help. He’s a Christian man and a God-fearing man.", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7e07e4066af877a2"}
{"user_id": "114681463434124286904", "name": "hur hur", "time": 1519747504867, "rating": 5.0, "text": "Outstanding job! Dr. Blanchard cares for people and I highly recommend him!", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7e07e4066af877a2"}
{"user_id": "102509934145903956614", "name": "Shantell Pendleton", "time": 1521218089649, "rating": 5.0, "text": "Appreciate the great work Dr. Blanchard has done for us.", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7e07e4066af877a2"}
{"user_id": "115441206532596488249", "name": "sharene Martin", "time": 1519773668129, "rating": 5.0, "text": "I Highly recommend Dr. Blanchard. Very  professional.", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7e07e4066af877a2"}
{"user_id": "105715771079923520466", "name": "ravine bullock", "time": 1542392053480, "rating": 5.0, "text": "Dr Blanchard has helped me through my most toughest times in my life thus far . When I felt like giving up his counseling services gave me hope . I recommend him to anyone who is in doubt .", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7e07e4066af877a2"}
{"user_id": "113458117192652118632", "name": "Catina Douglas", "time": 1547909670947, "rating": 5.0, "text": "Careing understanding  patient  and professional", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7e07e4066af877a2"}
{"user_id": "114316788285896610067", "name": "Ralisa Jones", "time": 1519744886369, "rating": 5.0, "text": "Dr. Blanchard was there for me and my family when we really needed him the most!", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7e07e4066af877a2"}
{"user_id": "115104692281531926508", "name": "Dirty Shawn", "time": 1496962778191, "rating": 5.0, "text": "Dr. Danny Blanchard is the best at what he does", "pics": null, "resp": null, "gmap_id": "0x88626bbf454edaef:0x7e07e4066af877a2"}
{"user_id": "115487588220413766374", "name": "TOM JUNGKIND", "time": 1609593027285, "rating": 1.0, "text": "After 4 sessions with my 14yr old daughter, I requested a phone call to discuss her progress. I was essentially told that I wasn't privileged to any info without my 14yr [ minor] old's \"permission\". Had this therapist, and that's the limit of her  professional credentials, been more willing to discuss my minor daughters treatment, we might not be looking elsewhere for help!", "pics": null, "resp": {"time": 1615234775078, "text": "Thank you for letting us know about your experience and we are very sorry to hear you were not satisfied with our services.  IHS is committed to following all federal and state laws/regulations.  In the state of Alabama, a fourteen-year-old is given the right to consent to treatment which means it is up to them on what information is disclosed.  While this may seem unfair and may not make sense, we are obligated to follow all federal and state regulations."}, "gmap_id": "0x888919d2c5d424bb:0x6f8be66f3bd108e2"}
{"user_id": "106647467795942030758", "name": "Sean Bailey", "time": 1608301909657, "rating": 5.0, "text": "Kayla is awesome! She has helped me navigate some really challenging times, and I am so grateful.", "pics": null, "resp": null, "gmap_id": "0x888919d2c5d424bb:0x6f8be66f3bd108e2"}
{"user_id": "104270871889336239073", "name": "Hillary w", "time": 1605550034774, "rating": 5.0, "text": "Michelle has been a godsend. I don't know that we would have made it without her. She is open to working with unusual problems and is very knowledgeable about the lgbtq population. The techniques I learned were very helpful and she had been great at helping us keep on the right path.", "pics": null, "resp": null, "gmap_id": "0x888919d2c5d424bb:0x6f8be66f3bd108e2"}
{"user_id": "117428730598141109914", "name": "Jennifer Veitch", "time": 1594141000966, "rating": 5.0, "text": "I have worked with and known Michelle Knight for over a decade. She truly cares for others and the community. Her genuine helping spirit makes it easy to talk to her. She empowers others, is knowledgeable about different theories/approaches to helping, communicates well, and listens effectively! I highly recommend Integrated Health Services!", "pics": null, "resp": null, "gmap_id": "0x888919d2c5d424bb:0x6f8be66f3bd108e2"}
{"user_id": "107252098541698140838", "name": "Winnie Luna", "time": 1603131043517, "rating": 1.0, "text": "Their response to my last review (from Lola) was that they would make exceptions due to illness.... We were Ill and getting tested for COVID. They still not have made this right. I had to make another review because I could not respond to their response. Just know if you are sick during a pandemic, they will still steal your money.", "pics": null, "resp": null, "gmap_id": "0x888919d2c5d424bb:0x6f8be66f3bd108e2"}
{"user_id": "100073186368408465511", "name": "Alexandra Traviss", "time": 1605990824093, "rating": 5.0, "text": "Michelle deeply cares about her clients, has tremendous empathy, and is a truly professional counselor.", "pics": null, "resp": null, "gmap_id": "0x888919d2c5d424bb:0x6f8be66f3bd108e2"}
{"user_id": "109991412419340641275", "name": "Abbey Mitchell", "time": 1611200933550, "rating": 5.0, "text": "Michelle is very professional and seems to really care about her work and her clients!", "pics": null, "resp": null, "gmap_id": "0x888919d2c5d424bb:0x6f8be66f3bd108e2"}
{"user_id": "114738679741969650980", "name": "L K", "time": 1586726580794, "rating": 1.0, "text": "She values money over her client’s wellbeing. I missed one appointment for extenuating circumstances, and my credit card was charged $140. I very nicely asked for one grace period, and I was vulnerable to her about my situation. She said I could do a payment plan, and I agreed. I also emailed her though that I would prefer to find another therapist that cares more about their patient’s wellbeing over money considering there is a global pandemic, and everyone is struggling. Since then, she has not responded to my emails in order to help get the charge off my credit card for the payment plan.\n\nPart of working with people who are working on themselves should be showing grace in times of need.", "pics": null, "resp": {"time": 1594052446158, "text": "Integrative Health Services, LLC requires every client to sign an agreement stating they understand they will be charged for a no show or a later cancellation. We allow up to a twenty four hour notice for cancellations. Our policy also notes exceptions for medical issues such as being sick where we excuse a no show or late cancel but the client must meet the requirements for this as outlined in the policy. We want every client to be happy with our services and we give everyone the opportunity to decline working with us if they disagree with our no show late cancellation policy."}, "gmap_id": "0x888919d2c5d424bb:0x6f8be66f3bd108e2"}
{"user_id": "106872580423181225048", "name": "B K", "time": 1592345472119, "rating": 5.0, "text": "I love everything! The counselors are wonderful, front desk and everyone in between are incredibly kind and you can tell they really care. I feel very comfortable and actually look forward to my visits here.", "pics": null, "resp": null, "gmap_id": "0x8862842afda5536b:0xd43fed92934cb063"}
{"user_id": "117831178413984456527", "name": "Tommy Reynolds", "time": 1579723248399, "rating": 4.0, "text": "The counselors provide a caring, supportive atmosphere where folk can be safe, and heard.  Healing can take place here.\n\nThe office is on the second floor.  Not sure if there is an elevator there.  Call ahead and they can accommodate with one first-floor room.", "pics": null, "resp": null, "gmap_id": "0x8862842afda5536b:0xd43fed92934cb063"}
{"user_id": "103538778209738568808", "name": "Timothy Townsend", "time": 1561057813916, "rating": 3.0, "text": "Would be a five star review, but you have to climb a mountain to get into the office.", "pics": null, "resp": null, "gmap_id": "0x8862842afda5536b:0xd43fed92934cb063"}
{"user_id": "109265034924829905732", "name": "Tom S", "time": 1469449425486, "rating": 5.0, "text": "They genuinely care. You're not just a paycheck", "pics": null, "resp": null, "gmap_id": "0x8862842afda5536b:0xd43fed92934cb063"}
