{"user_id": "110965365965801869397", "name": "Frederic Lecut", "time": 1468982177771, "rating": 5.0, "text": "Best martial arts school in the Wiregrass offers classes in Yoshukai Karate,  Kenjutsu (samurai swordsmanship) and Taichi.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN3YTd0qdEo25krVqbaNwKIgd5GmyVRWEdddtjJ=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88929339bebda5b5:0x8b8f420499e5920"}
{"user_id": "102939604309623542494", "name": "Julia Daugherty", "time": 1504050826870, "rating": 5.0, "text": "This is the place to go if you want traditional karate. It's a great community and environment and you learn real karate. The teachers are great, people who want you to do your best.", "pics": null, "resp": null, "gmap_id": "0x88929339bebda5b5:0x8b8f420499e5920"}
{"user_id": "104787799010288464706", "name": "Laura Adkison", "time": 1504051201001, "rating": 5.0, "text": "Excellent training.  Offers adult and kid classes.  Mike Culbreth is a great instructor with over 30 years experience.", "pics": null, "resp": null, "gmap_id": "0x88929339bebda5b5:0x8b8f420499e5920"}
{"user_id": "111667927579918194842", "name": "Scott Daugherty", "time": 1504050083538, "rating": 5.0, "text": "If your looking for traditional karate look no further. Outstanding classes offered for both child and adult. Sensi is a 8th degree black belt and he other instructors are second to none. Great environment the strives for excellence and simple the best price in town.", "pics": null, "resp": null, "gmap_id": "0x88929339bebda5b5:0x8b8f420499e5920"}
{"user_id": "100384679367614358736", "name": "David Caddell", "time": 1504052193469, "rating": 5.0, "text": "Great place and great atmosphere!\nInstructors are passionate about the Yoshukai style which benefits all students.", "pics": null, "resp": null, "gmap_id": "0x88929339bebda5b5:0x8b8f420499e5920"}
{"user_id": "106454486712565345843", "name": "Carrie Ann Mattimore", "time": 1492110862067, "rating": 5.0, "text": "My boys love Yoshukai! It's a great dojo with friendly people that make you feel as if you have a second home.  And the Sensei's are very good with the children and they offer adult classes too!", "pics": null, "resp": null, "gmap_id": "0x88929339bebda5b5:0x8b8f420499e5920"}
{"user_id": "111332906279131039006", "name": "Gina Daniel", "time": 1628037224694, "rating": 5.0, "text": "Gracie my instructor is knowledgeable and awesome!!  Facility is very nice! I enjoy very much taking classes here.", "pics": null, "resp": {"time": 1628038051859, "text": "Thank you, Gina! We enjoy working with you and are glad you're enjoying your training. Keep up the hard work!"}, "gmap_id": "0x8862133f3db62217:0xed5e4dd047a46b20"}
{"user_id": "107997324537257648177", "name": "Laura Rivers", "time": 1604869005730, "rating": 5.0, "text": "I am ecstatic for the opening of this local Madison “gem”! Gracie and Isaac truly go above and beyond. They are both, very knowledgeable and very passionate about the self-defense style that they teach.\n\nIf you are expecting this to be a “wax on, wax off” type of karate, think again! The personalized lesson was practical and relatable without having to paint a fence. And a HUGE bonus, both instructors are patient and encouraging! It’s absolutely all you could ask for in when it comes to learning self-defense!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO_L8ri0cRA5trF_XDCrkVmQcHPnfsdZd0fjH5g=w150-h150-k-no-p"]}], "resp": {"time": 1604869727698, "text": "Thank you Laura! We enjoy having you in the studio and know you'll do great things."}, "gmap_id": "0x8862133f3db62217:0xed5e4dd047a46b20"}
{"user_id": "103047355424581508878", "name": "Bart Roegner", "time": 1626136203327, "rating": 5.0, "text": "Isaac is an excellent teacher. He approaches teaching martial arts with patience and dedication. I highly recommend trying Kenpo with MadCity.", "pics": null, "resp": {"time": 1626139160695, "text": "Thanks, Bart! We really enjoy teaching you and appreciate your dedication."}, "gmap_id": "0x8862133f3db62217:0xed5e4dd047a46b20"}
{"user_id": "107529617076208577491", "name": "Matthew Eady", "time": 1604596816606, "rating": 5.0, "text": "An amazing school that teaches a very effective system of self-defense.  Patient, caring instructors who take time to pay the necessary attention to each individual student.  Great for people of all ages and all levels of physical fitness.  I could not recommend a better Kenpo in the North Alabama area.", "pics": null, "resp": {"time": 1604601015859, "text": "Thanks, Matt! We really enjoy teaching you and love getting to share our art with this area."}, "gmap_id": "0x8862133f3db62217:0xed5e4dd047a46b20"}
{"user_id": "110646145441436298162", "name": "Randall Rivers", "time": 1601309518840, "rating": 5.0, "text": "Great experience.  I wanted personal training, not a big group.  They offer several different options so you can find the one that works for you.  Good central location, nice facility and friendly, experienced trainers. I really like their focus on practical self-defense.", "pics": null, "resp": {"time": 1601310257812, "text": "Thanks, Randall! We think you'll excel quickly in our private program. We can't wait to see your progress."}, "gmap_id": "0x8862133f3db62217:0xed5e4dd047a46b20"}
{"user_id": "113963061688585154564", "name": "Christopher Weaver", "time": 1615331608713, "rating": 5.0, "text": "Amazing place! The instructors are friendly and very detailed in what they reach you.", "pics": null, "resp": {"time": 1615334204302, "text": "Thanks Christopher! We're glad you're enjoying your training so far - we appreciate all the hard work you put in."}, "gmap_id": "0x8862133f3db62217:0xed5e4dd047a46b20"}
{"user_id": "114157347272356245455", "name": "Farida Rennie", "time": 1602706889412, "rating": 5.0, "text": "I just took my first self defense lesson and I absolutely loved it. I felt that the lesson was not only fun but also practical. I was able to get a good workout while leaving with skills and improving my balance. I've already signed up for my next session!", "pics": null, "resp": {"time": 1602708043656, "text": "Thanks, Farida!! We appreciate your desire to learn and can not wait to see your growth in Kenpo."}, "gmap_id": "0x8862133f3db62217:0xed5e4dd047a46b20"}
