{"user_id": "108365364258241059458", "name": "Edward Griffin", "time": 1603295192389, "rating": 1.0, "text": "Called, left message, never heard back", "pics": null, "resp": null, "gmap_id": "0x8886021122682a4b:0x5159e286ee7a13f3"}
{"user_id": "113185464226927752041", "name": "Mark K Hall", "time": 1541720255119, "rating": 5.0, "text": "Do business with them on a near daily basis. Always knowledge and courteous. Can’t recommend anyone better.", "pics": null, "resp": null, "gmap_id": "0x88891c501ab073b9:0x1459500de336bac7"}
{"user_id": "109290618859306870942", "name": "Jeremy Rogers", "time": 1531259256903, "rating": 5.0, "text": "Great pit fair gravel and aggregate pricing , I use them weekly . Smooth operation.\nA lot of Birmingham history on the Wade property , not open to the public unfortunately...", "pics": null, "resp": null, "gmap_id": "0x88891c501ab073b9:0x1459500de336bac7"}
{"user_id": "116108041120345962489", "name": "Earnest Gann", "time": 1554243582437, "rating": 5.0, "text": "It said post this and let others know what to expect, well, expect a train between the front scales and the load out yard", "pics": null, "resp": null, "gmap_id": "0x88891c501ab073b9:0x1459500de336bac7"}
{"user_id": "101849130237045950585", "name": "jack scott", "time": 1522368780827, "rating": 5.0, "text": "Very friendly and easy to get material delivered.", "pics": null, "resp": null, "gmap_id": "0x88891c501ab073b9:0x1459500de336bac7"}
{"user_id": "102154803274889201023", "name": "Joe Simmons", "time": 1559812297735, "rating": 5.0, "text": "Good people good product", "pics": null, "resp": null, "gmap_id": "0x88891c501ab073b9:0x1459500de336bac7"}
{"user_id": "108005459835332504341", "name": "Brandon McCray", "time": 1591817087727, "rating": 4.0, "text": "Shot a music video here.", "pics": null, "resp": null, "gmap_id": "0x88891c501ab073b9:0x1459500de336bac7"}
{"user_id": "105362341169772236659", "name": "Drew Edmondson", "time": 1547779296934, "rating": 5.0, "text": "Good place to work", "pics": null, "resp": null, "gmap_id": "0x88891c501ab073b9:0x1459500de336bac7"}
{"user_id": "100465066236482680726", "name": "Drew Edmondson", "time": 1505185390267, "rating": 1.0, "text": "Where I work", "pics": null, "resp": null, "gmap_id": "0x88891c501ab073b9:0x1459500de336bac7"}
{"user_id": "110326021796232120349", "name": "Danielle Morrison", "time": 1620143736006, "rating": 5.0, "text": "Foxcrete did a wonderful job from start to finish. We did a quick quote online and then decided we wanted to do something a little more detailed. I called and spoke with Blake and he walked me through all of the options. I then worked with Debra on scheduling. Debra also met me at a nearby home to show me a past job they had done to make sure I was 100% happy with the colors and style we picked out. Debra also came to our home for the color consultation. Everything was very smooth. Team arrived to form the patio and then a few days later Blake and team arrived to pour the concrete. He double checked with me and my husband every step of the way to make sure it was what we wanted. It turned out amazing and I wish we would have hired them sooner. We are already enjoying our patio so much and would absolutely recommend their services to others. Priced well, great communication, and great execution! Thank you, Foxcrete!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMixxPM9uKrl6I6ohBhb8pRDydSo7WzIshvQpbd=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO6r7Vx8khrqxA-D02JIaFLw78KXXvuA9geaK3u=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPP7Gsby0wCazoNmE5RSe7A8AcFdQjVFblhEa_i=w150-h150-k-no-p"]}], "resp": {"time": 1620144544858, "text": "Thank you so much for taking time out of your day to write  this detailed review!\n\nWe enjoyed working with you and we are also thrilled with the results!\n-Blake"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "109948715155159454899", "name": "David and Diana George", "time": 1629242939753, "rating": 5.0, "text": "Fantastic experience from the first phone call all the way through completion of the job.  They poured a concrete patio in our backyard.  Great quality at a fair price.  The crew was professional, friendly, and cleaned up the site when finished.  If you are in need of a patio, sidewalk, driveway, or any other concrete project, I highly recommend checking them out.", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "114989331436533396605", "name": "Andrea Osika", "time": 1622157014366, "rating": 5.0, "text": "Very happy customer!! From the user friendly website to the professional installation of patio. Blake and his team provided excellent craftsmanship and superior knowledge throughout the process.", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "110358103911201668366", "name": "Zachary Dinkins", "time": 1617919452186, "rating": 5.0, "text": "Blake and his guys finished my entire driveway in just one day. Everything from removing the old driveway to getting the new one perfect. They stuck around to clean up everything and paid attention to all the details. Every person I talked to with this company has been very nice and professional, and very responsive.  I never had a single question go unanswered during my business with Foxcrete. I definitely recommend Foxcrete to anyone looking for a company who specializes in this type of work.", "pics": null, "resp": {"time": 1618709098292, "text": "Thank you taking time out of your life to write us this review! It means so much to us! Thank you again!"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "115080663092061095518", "name": "Brent Bailey", "time": 1622243869011, "rating": 5.0, "text": "Foxcrete poured and finished a patio behind my pool.  It was a technically difficult job due to access and slope.  They did a great job. I would recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "116630994050966924919", "name": "Lynn Chavarry", "time": 1604697613231, "rating": 5.0, "text": "Professional, friendly, and trustworthy. Great work ethic and beautiful job on my floors ... I consider it art! I highly recommend Foxcrete.", "pics": null, "resp": {"time": 1604699401990, "text": "We have had so much fun working with you both! I am incredibly thankful you chose our company to install this custom flooring for you guys! Customers like you and Maurice are few and far between, and makes me want to do more of these style jobs! Who knows what the future holds!\n\nAgain, thank you so much!"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "110031074550921898559", "name": "John Eichner", "time": 1592866294519, "rating": 5.0, "text": "Foxcrete is one of the best.  They just finished a job for a concrete pad for a swimspa and our experience with them was amazing.  They are very professional and the work is top notch.   Josh was extremely responsive and great to work with.  I HIGHLY recommend this company!", "pics": null, "resp": {"time": 1592914204709, "text": "Thank you for the opportunity. It was a pleasure working on your project."}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "106644215430394359765", "name": "Carrol Basham", "time": 1586464292855, "rating": 5.0, "text": "Foxcrete is AWESOME!  They came out and poured a back patio for us. All of the guys were super nice and friendly. And the concrete work is the best I've ever seen. They went above and beyond for us. They encountered a couple surprises when digging out the area, but worked through them and were super reasonable.", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "104853320201209049413", "name": "linda Ziglar", "time": 1591019610640, "rating": 5.0, "text": "Foxcrete was recommended by a neighbor and when we saw the quality of work they did, we didn't bother to look elsewhere. Our patio is more than our greatest expectations! Josh and his crew did an amazing job!", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "110071034869608249605", "name": "Andy Marr", "time": 1581001883258, "rating": 5.0, "text": "Foxcrete construction was one of the easiest, most professional and downright fastest companies my wife and I have ever worked with, and we have done a Ton of home alterations and improvements.\n\nFirst of all, Josh is the guy to work with. He is professional, knows his craft, and came out to our house often. We wanted to put in a curved edge patio and he came out and measured the land, staked out the space and figured out what would work best. Our schedules didn't align at first but we made it work once we figured out a workable timeline. He came back a few more times and we discussed color of the concrete, size, dimensions, drainage, and a bunch of other details. He was patient and hear do us out, and you could tell he was excited about the project.\n\nWhen the crew showed up they were fast, professional, and methodical. They know their craft. They worked from 6am to 7pm some days, going over the details, re-laying sod, cleaning up spills or little messes (nothing major just normal stuff from the construction), and generally just making the backyard look good again.\n\nAnd the finished product is exactly what we wanted! Josh kept telling us to trust him, he had a plan, he was going to pour some creativity into our project and we wouldn't be disappointed. And he was right! Our once ugly backyard patio space now looks like something out of a magazine! The form is beautiful, it makes our yard flow, and it is just a fantastic job. I HIGHLY recommend these guys. They'll give you what you're looking for and their highlights and creative choices will only improve on your original idea! Great company, great employees, great final product! Thanks guys!", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "109357755128379619500", "name": "David Johnson", "time": 1597203867221, "rating": 5.0, "text": "All the guys were very professional and very happy with the final product. Would highly recommend", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "102944685546955656084", "name": "Bruce Streeter", "time": 1565908322693, "rating": 5.0, "text": "Foxcrete is highly recommended.\nCalled for a survey Saturday afternoon expecting a response later in the week. Received a call that same afternoon and had a survey scheduled early into the next week.\nJosh was fantastic walking me through all my options and listening to my requirements. Received a quote meeting my specs in short order.\nInstallation is complete and could not be happier. Everyone on the crew starting with Blake and Scott to each and every helper, were courteous and caring for needs and my yard. They worked quickly and efficiently but most importantly left with me satisfied. My back patio and driveway extension could not have turned out better. The mess was minimal and where there was any issue, it was taken care of before the crew was finished.\nI cannot thank Blake and Josh enough for the commitment to excellence they provided on my project.", "pics": null, "resp": {"time": 1566611761423, "text": "Thanks for allowing us the opportunity to serve you Bruce! This is a fantastic review! We greatly appreciate the time you took to write this! Hope you are enjoying your patio!"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "112931702073710870203", "name": "Kimberly Griffin", "time": 1580339110560, "rating": 5.0, "text": "We are one of the contractors that pumps concrete for Foxcrete. Very professional group of men and women. Their eye for detail and design skill should rank with the best of concrete contractors. I like to joke with them that their work should be required to have a warning label. If for any reason it needed to be demolished another contractor will never assume it built with that much integrity, even on simple projects. Their use of metal and custom concrete mix design far exceeds the code in our area.", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "113237987449126181411", "name": "cary pt", "time": 1588695934004, "rating": 5.0, "text": "Blake and his crew are top notch. They do great work on time and on price. I would definitely use Foxcrete again in the future.", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "110574801703724082241", "name": "CoolbeansXVI (CoolbeansXVI)", "time": 1580159771838, "rating": 5.0, "text": "I've worked with Foxcrete for almost a year now. Never have I worked for a company that cares so much about not only their clients, but their employees as well. I'm very proud to work along side such genuinely good people every day. I can't wait to see what the future holds for everyone here at Foxcrete. #FoxcreteFTW!", "pics": null, "resp": {"time": 1580329890475, "text": "I have always thought, you can tell a lot about a company by the way they treat their employees! The fact you went out of your way to drop a kind word, means the world to us! We are proud to have you and appreciate all you have done for us!"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "109466660462207695104", "name": "Stevie Cordts", "time": 1559177935136, "rating": 5.0, "text": "We loved working with Foxcrete! From the moment we contacted them to the finished product they were professional, on time (!), reasonably priced and just awesome. We are so happy with the work they did!", "pics": null, "resp": {"time": 1559185824311, "text": "Thank you guys for trusting us with such an important upgrade! You guys were hassle free to work with and we truly appreciate that! I know you guys will enjoy the new space!\nHappy Summer,\n-Blake"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "110494911923862327583", "name": "Larry S.", "time": 1511912343947, "rating": 5.0, "text": "Blake, Tommie and crew did an outstanding job.  From the first meeting to understand what we were wanting to wrapping up and explaining the upkeep they were nothing but a pleasure to work with.  We had a patio, seating walls and concrete fire pit.   Exceeds all expectations!  The area is awesome...can’t wait to use the firepit.  Thanks again!!", "pics": null, "resp": {"time": 1511969278251, "text": "Larry, thank you for allowing us to showcase our artistic ability at your families property! We had a great time working with you all and the hospitality you shown our crew was second to none!"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "109414030024803932595", "name": "Clay Thompson", "time": 1492660833715, "rating": 5.0, "text": "I exclusively use Blake at Foxcrete Designs for all of our decorative concrete pool decks. Blake surpasses my expectations when I throw any type of custom and very challenging concrete work. Everything we do is completely one off and they make it look so easy. I would not turn to anyone else for all of my concrete needs. Best in the business and class act guy. If you are looking for the best concrete contractor in your area then these are the guys. Thanks Blake.", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "116980684199466851467", "name": "Carol Frey", "time": 1522554489649, "rating": 5.0, "text": "I can't say enough about Foxcrete Designs and the fantastic job on my patio extension.  Blake was great to work with from beginning to completion.  Blake and his crew were professional and respectful, very neat from beginning to end, and their attention to detail was impressive.  I now have a beautifully finished patio which exceeded all my expectations.  Thank you, Blake.  Job well done!", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "111080865692754184169", "name": "Ellen Belcher", "time": 1563292811537, "rating": 5.0, "text": "Foxcrete Construction Group is one of the best companies I’ve worked with. They were professional, worked efficiently and did what they said they would do. We couldn’t be happier with our new driveway!", "pics": null, "resp": {"time": 1563293602073, "text": "Thank you for taking time out to write this! It is so very much appreciated! Online reviews are the new word of mouth, so we are honored you would vouch for us like this! Hope you guys are having a great summer!\n-Blake"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "113897357965276120311", "name": "Chat Rierdan", "time": 1571452404784, "rating": 5.0, "text": "Foxcrete is one of the best companies I have ever worked for. They not only showed me how to finish concrete but how to do it the right way.....If that makes any sense.", "pics": null, "resp": {"time": 1571457327259, "text": "Thanks for the kind words Mason, we wish you the best in your new endeavor and thank you for your time spent with us!"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "109794773887708670231", "name": "Elizabeth Butts", "time": 1515969559565, "rating": 5.0, "text": "The Foxcrete team is amazing! We have built many homes and by far they provided the best concrete service we have ever experienced. They are very professional offering a wide range of creative services. Our carport and workshop areas are really nice and our stamped interior floor and porch floor is going to be beautiful!", "pics": null, "resp": {"time": 1519434406943, "text": "Thank you Mrs. Butts! You both were amazing to work with and look forward to more projects in the future!"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "115620912767554848164", "name": "Warren Wood", "time": 1563754711772, "rating": 5.0, "text": "Anyone looking for a concrete contracting company should not hesitate to contact Foxcrete Construction Group. They are an exceptional concrete contracting company that most definitely puts the customer first. They went way out of their way to ensure they had a satisfied customer with our project and believe me, we were not an easy customer to please. They had to continuously answer questions and listen to our concerns but did so with nothing but professionalism. They take pride in their work and have been very professional throughout the entire process!\n\nWe went with the stamped concrete design with colors to blend well with our brick. We were unsure of the colors and how they would look next to the brick on our house, but with their experience and knowledge they were able to give us what we wanted. The colors are as close to perfect as you can get!\n\nWe've never known anyone personally that had a stamped concrete patio or have ever viewed a stamped concrete patio of this design, other than in pictures, so fully understanding the process and the amount of work it takes to build a patio, such as this, was beyond our full comprehension. It takes a lot of work, skill and somewhat of an artistic eye along with exceptional pride to produce a nice product. Foxcrete did just that!\n\nThe patio is designed with the appeal of a paver patio, but without stones that will move. The brick lined edge comes down the side walls of the patio giving it a realistic appearance of brick pavers. The colors are a mixture of browns and tans, with the brick edge being a darker color than the inner area of the patio giving it a distinct framed look. We love this design and the colors!\n\nThank you, Josh and Foxcrete Construction Group, for doing such a fantastic job on this patio! The final product proves that you care and take extreme pride in the work you do!  It's a beautiful patio that I'm sure we will enjoy for many years to come!", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "111401497113558733899", "name": "Sharon DeWitt", "time": 1374171909527, "rating": 5.0, "text": "Foxcrete Designs is the place to call for all of your concrete design needs.  Blake did an overlay for us and did a fabulous job!!!!  He called and kept in touch during the entire process.  He is so easy to work with and he does what he says he will do. We love our porches and he is now going to do a stain on our garage floor. Great experience!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "112450691688181935071", "name": "Chris Wilson", "time": 1617040590385, "rating": 5.0, "text": "These gentlemen are true craftsmen.", "pics": null, "resp": {"time": 1618709125644, "text": "Thank you for the kind words!"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "111043966621077885846", "name": "Juan Gastaliturri", "time": 1505842379221, "rating": 5.0, "text": "Before selecting Blake as the concrete contractor for my project, I interviewed and received bids from four other contractors. In the end, Blake earned my business for some very important reasons. He was completely upfront with the details and expectations of the job. He has a talent and a critical eye for details which he demonstrated through his diligence and hard work. He was very profesional, explained everything, showed up when he said, did an amazing job and we couldn't be happier with the finished product. I made the right choice with Blake and will absolutely recommend him for your project.", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "108882500101616455609", "name": "Kim Myers", "time": 1519432956281, "rating": 5.0, "text": "They did a wonderful job and we're able to do all work without someone at the house! He even came back and put grass back around the new concrete!  Best price by far", "pics": null, "resp": {"time": 1519434296684, "text": "Thanks for the kind words!"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "118158979068460049119", "name": "IthinkIfellupthestairs", "time": 1519689670625, "rating": 5.0, "text": "I had to have my driveway completely replaced and Foxcrete did a fantastic job. They were here in a timely manner. I would recommend them for all your concrete work. If I ever need any work done again they are who I will call.", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "113600908368801381175", "name": "Kristin Bourgeois", "time": 1525202983173, "rating": 5.0, "text": "I am flattered by the honesty and integrity this company stands for. They are always doing the best job they can with a smile on their face! Great people!", "pics": null, "resp": {"time": 1525211760781, "text": "With over 30 years experience we have always strived to be honest and have integrity. We greatly appreciate the review"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "101480190180397054178", "name": "Robert Baus", "time": 1334245610740, "rating": 5.0, "text": "We were very impressed with Blake and the work he did for us.  We thought we knew what we wanted and Blake made up a sample and showed it to us.  Turned out we wanted something different.  Blake made suggestions and patiently worked with us step by step and we were thrilled with the finished results.  Blake is a true professional and customer service and satisfaction are top priorities with him.", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "100903750800562166454", "name": "dukhunter1972", "time": 1538851941693, "rating": 5.0, "text": "Wow, I have to say we are super impressed and happy with the way our pool deck turned out recently. It looks fantastic. Our pool concrete and Kool Deck coating was performed by another company about 8 years ago and the Kool Deck began separating from the concrete recently. Blake and Josh came out to  look at it, determined the issues, and developed a plan to repair it.  I can hardly tell where the concrete issues were before and anyone that sees it now would never know there had been an issue. They did a great job not only repairing it but also blending it into the existing decking and color. Their professionalism and attention to detail is incredible. Customer service is their number one goal and in the business world today, that is truly hard to find. Give Foxcrete a call for your next project, you’ll be glad you did.", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "107317983663779951558", "name": "robert darnell", "time": 1498446179324, "rating": 5.0, "text": "Blake was very professional and did a great job on our sunroom conversion. He did great making the color match our floors throughout the rest of the house. It's amazing.  He always answered  or returned our phone calls/texts/emails and was always on time. He also finished our project on time even with weather delays by working extra. I can't say enough good things about the quality of work and overall great experience we had.", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "111760661708465695530", "name": "Marianne Cash", "time": 1521493269958, "rating": 5.0, "text": "I just called Foxcrete about coming out to repair a botched job at my home by a non-professional. The owner was so helpful that he gave me advise that saved me from $5,000-$8,000. He even went so far as to suggest the color of paint I need to make this project look decent. He offered to refer me to someone else who could work me in sooner than May if I did not want to follow through with his suggestions. He spent lots of time on the phone asking specific questions and was extremely knowledgeable about every single issue I had.\nHe did not make one cent from this phone call but was willing to offer many solutions to help us.\nIf I was not moving, I would hire them to re-do this entire project.\nI am extremely grateful for this company!", "pics": null, "resp": {"time": 1521508938212, "text": "Thank you so much for taking your time out to write this! This was completely unexpected!\nI tell folks this all the time! Advice is always free!\n\nHope my suggestion brings some comfort to your situation!\n-Blake"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "103915776161982385455", "name": "Louanda Gerard Henderson", "time": 1525142264753, "rating": 1.0, "text": "Called this am for a quote on concrete staining in my 2600 Sq ft home.  Wife answered and advised they could come today, but we wouldn't be home, so then advised they would come on Sunday after \"Church\". Husband called back not even an hour later asking if my home was new or existing construction.  I advised existing, and explained to him my wood laminate had been damaged and we just received money from insurance company. He then told me that they are very picky about the jobs they take on and that they don't like to do existing construction because of the damage THEY could cause to cabinets, or walls. He advised me we would be too much trouble.  Kept saying how picky they are with taking on jobs...could it be that we are black and THAT'S the REAL reason?  Why didn't the Wife tell me this initially?  Guess we'll take our 15,000.00 elsewhere. Very bad customer service.", "pics": null, "resp": {"time": 1525197116958, "text": "My wife is strictly office only and I handle the estimates. Our company at this time is not set up to do acid stains or dyes on interior Jobs unless they are new construction or remolding jobs. I apologize if I did not convey myself clearly.  We at Foxcrete take pride in giving great customer service and quality service.\nSincerely Scott Henning"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "101839177245416871854", "name": "Sherilyn Donnelly", "time": 1506724717707, "rating": 5.0, "text": "Blake and his crew at Foxcrete rock!! He did our entire house and front and back porches. It is all beautiful!! See photos for the super awesome design they did in the foyer!", "pics": null, "resp": {"time": 1506718776610, "text": "You guys are the real MVP! Thank you for choosing us and allowing us to be creative!"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "113093372699382236259", "name": "Brenda McCollum", "time": 1511815237580, "rating": 5.0, "text": "From design, to construction, through completion, Foxcrete did an outstanding job extending our patio. We enjoy it every day as it's a great place to entertain friends and  family, or just for the  quiet solitude it provides.", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "116758151994776345942", "name": "Sommer Lowry", "time": 1525204588536, "rating": 5.0, "text": "Remodeling can be a very stressful time, so it makes all the difference in the world when companies and there staff provide outstanding service, and that is exactly what I received from Debra and Scott Henning, not only did they ease my frustrations, but they went above and beyond their call of duty to make sure I had all materials needed to complete my project. I would highly recommend Foxcrete to ANYONE, ANYWHERE in the world, they were truly amazing.", "pics": null, "resp": {"time": 1525211368003, "text": "Thanks Sommer for the review we really strive to provide quality work and customer service"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "109410456131692593649", "name": "Josh Williams", "time": 1534194918085, "rating": 5.0, "text": "Super efficient and flexible to work with. They catered to our wants and come up with an very creative idea that was amazing.", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "107847295712547705318", "name": "Curtis Zimmerman", "time": 1596027843389, "rating": 3.0, "text": "Looking foward to getting things done.", "pics": null, "resp": {"time": 1596022949212, "text": "We look forward to working with you as well Mr. Zimmerman."}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "100299094162343896671", "name": "Al Simmons", "time": 1520126799599, "rating": 5.0, "text": "I had a massive root problem that destroyed my driveway. Blake and crew removed the old driveway, dug out the problem roots and poured a really nice and strong new driveway that even the neighbor kids like to play on. Thanks Blake for the great work.", "pics": null, "resp": {"time": 1520298104189, "text": "Thanks Al! Glad to see it’s getting some good service from the kiddies!"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "104605792411016688366", "name": "Michael McKown", "time": 1560789391239, "rating": 5.0, "text": "Foxcrete Construction is an outstanding concrete contracting company that takes great pride in their work, provide a exceptional quality product at a fair and reasonable price. I would highly recommend them for any concrete specialty work.", "pics": null, "resp": {"time": 1560851929348, "text": "Thank you Michael it was a pleasure working on your po project."}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "105086086227572104599", "name": "Mary Hempfleng", "time": 1478555346516, "rating": 5.0, "text": "Thank you FOXCRETE DESIGNS! I would highly suggest Foxcrete to anyone looking to get straight forward high quality concrete work.\nWe knew we wanted stained concrete floors prior to the start of our build however by the time it came to do floors there were SEVERAL issues with the concrete; footprints, broken out concrete, gouge marks, stains from red clay & cedar.  Our builder, Eric Craig Custom Homes (Fantastic builder/excellent experience) hired another company to score & stain the floors.  My husband & I stopped by the house during the scoring process from the first company and immediately stopped work & started brainstorming with our builder about other flooring options.  Eric had Blake from Foxcrete Designs come out & take a look at our \"complex concrete job\" & give us his professional opinion on the outcome of moving forward with stain/scored.  Blake walked us through the issue spots & his remedies for those areas & gave us his opinion on what the final outcome would look like; nervously we took a chance & so glad we did!  My floors look amazing, truly beautiful!  Blake/Foxcrete are a very professional service that take pride in their work.", "pics": null, "resp": {"time": 1478564483557, "text": "Thank you for the kind words! This floor was a true challenge for us! I couldn't be happier with the results!\nProfessionally yours,\nBlake Henning"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "116824118935125335094", "name": "Amber Dubuisson", "time": 1534194815651, "rating": 5.0, "text": "Me and josh used these professionally concrete guys and were very pleased with the quality.", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "111736768042110522293", "name": "Hannah Franklin", "time": 1399644852909, "rating": 5.0, "text": "I love They're work. They did a great job for my family's patio. The woodcrete look is just fantastic. My grandparents also received an acid satin that they are very happy with. Blake is a very busy person and very good hearted. He gives his best 100% everytime despite hardly ever getting a day off. He is a full time fire fighter and running His business Foxcrete full time. But all that aside he does great work! 👍 highly recommend", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "109656374695271117030", "name": "Tim Kearns", "time": 1494954793658, "rating": 5.0, "text": "Blake is outstanding. Extremely professional, very fair, excellent work.  The only concrete professional in the area that provides quality work. Highly recommended!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "112706835139296307982", "name": "Don Grice", "time": 1517531709536, "rating": 5.0, "text": "Foxcrete restored our floors and porches and exceeded our expectations in the process! Blake and his teams work was done both professional and well.", "pics": null, "resp": {"time": 1517532802751, "text": "We appreciate the kind words! It truly is a team effort for a great project. From great homeowners to the installation crew!  🙌🏻🙌🏻"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "104119586913542149421", "name": "Lauren Ellis", "time": 1525204486403, "rating": 5.0, "text": "Foxcrete is nothing but professional and does top quality work. The customer service is unbeatable and I would recommend them to all!", "pics": null, "resp": {"time": 1525211508703, "text": "Thanks for taking time out of your busy schedule to write us a review. It’s always a great pleasure working with great customers"}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "110799152472443180845", "name": "Skotty Smith", "time": 1540130739452, "rating": 5.0, "text": "Good people", "pics": null, "resp": {"time": 1540155034611, "text": "Thank you for the 5 star we greatly appreciate it."}, "gmap_id": "0x889a74d920650559:0xd64906006a9629f8"}
{"user_id": "112022007991916633597", "name": "Michelle Jones", "time": 1622594978257, "rating": 5.0, "text": "Schmidt Home Services was awesome to work with. Very responsive and great communication! We will definitely call them again in the future.", "pics": null, "resp": {"time": 1622597008058, "text": "Thank you.. we try our best to stay in touch with all out clients as much as possible.  I'm happy we where able to help you out. We look forward to working with you in the future."}, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "113373559091292995801", "name": "Annette Hardin", "time": 1614471657726, "rating": 5.0, "text": "Polite, on-time. Excellent work. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "110242958326644666701", "name": "Yingying Li", "time": 1614048480930, "rating": 5.0, "text": "very professional and helpful!", "pics": null, "resp": {"time": 1614051654942, "text": "Thank you 😊.. I'm glad we where able to figure out that headboard for you even though we where missing items for the assembly, Gotta love IKEA!😄"}, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "104119765343787468314", "name": "The Diva Mrs. Ash", "time": 1619216946665, "rating": 5.0, "text": "The gentlemen at Schmidt's were very professional, prompt, & informative. They installed a lock on my shed which was a complicated process. They were very diligent and kept me informed along the way.  I will definitely recommended their services to everyone & I will be using their services again!!", "pics": null, "resp": {"time": 1619217276326, "text": "Thank you very much. We are happy to help and are glad we where able to get your lock figure out."}, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "103209938140064926820", "name": "Peter M. Babnis", "time": 1622342120705, "rating": 5.0, "text": "Josh and Zack were awesome to work with. Easy to get in touch with, quick scheduling, and work was done to complete satisfaction. We’re new to Birmingham and are happy to have found Schmidt’s home services. I’d 100% recommend giving them a call and letting earn your business. We’ll definitely be working with them again on some larger projects.\n\nThanks guys!", "pics": null, "resp": {"time": 1622383806643, "text": "I'm glad we where able to be of assistance.  We pride ourselves on our customer satisfaction.  We look forward to working with you again in the future.  Welcome to birmingham We hope you like it here."}, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "114209927779929763129", "name": "Tennille Carter", "time": 1600910557720, "rating": 5.0, "text": "Joshua did an excellent job.  Very professional and reliable.  I live in another state so it was great to find a company I could trust to work on my rental property.", "pics": null, "resp": {"time": 1600906856722, "text": "Thank you for choosing Schmidt's Home Services.  The deck turned out great and look brand new. I look forward to any future projects you may have.  Call anytime and have a great day!\nJoshua Schmidt"}, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "113226486399779629131", "name": "E F", "time": 1615404106941, "rating": 5.0, "text": "Josh and everyone at Schmidts Home Services are really fast and professional. I called same day needing a door frame repaired and blinds hung and Zach came out got the job done that very day. This was very last minute and everyone was professional and thorough.\nThank you again, great service to use I highly recommend them!!!", "pics": null, "resp": {"time": 1616029727301, "text": "Thank you..I'm glad we where able to help you out with this project. Spread the word to family and friends that schmidt's Home Services can help with all your household needs."}, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "115378204361100570200", "name": "J Lewellyn", "time": 1625072028645, "rating": 5.0, "text": "Schmidt’s has been very easy to work with. They worked my job into their schedule quickly. As they would complete one job, I would ask if they could do another, and they got those done, too! I highly recommend!", "pics": null, "resp": {"time": 1625073276532, "text": "We were very happy to help. I'm glad everything turned out great.  If you need any help with any future projects feel free to contact us anytime. Thank you for your business."}, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "104092309535502054730", "name": "Toney Bartlett", "time": 1525991243227, "rating": 5.0, "text": "Very talented staff. Always do what they say they are going to do, always on time,competitively priced", "pics": null, "resp": null, "gmap_id": "0x888a0751e4c659fd:0x9a1a69bafc8d4736"}
{"user_id": "111642294568559029549", "name": "Kilo Charlie", "time": 1620765094001, "rating": 5.0, "text": "Great business and people running it.", "pics": null, "resp": null, "gmap_id": "0x886215ecc44c818d:0xba2cb441a3a56af8"}
{"user_id": "113170001855592911569", "name": "M M", "time": 1591301210960, "rating": 5.0, "text": "They came to our home began replacing some sod and bushes on our property that had died from the city doing some work. The city did send out a team to repair the damage, but the work was shoddy. We didn't realize it was shoddy until we saw SuperiorScape come out and fix everything. They properly planted the bushes and trees, instead of packing in clay dirt around the root. They placed the sod, fertilized it, rolled, and watered it. The lawn looks great now. The men were kind and when we spoke to the manager he even gave us tips on our other plants on proper pruning. He really listened to us and helped. The whole team did a fabulous job", "pics": null, "resp": {"time": 1594742360379, "text": "Thank you for the kind words; we sincerely appreciate your feedback. We shared your review with the team that came out to make the repairs in your yard.\nSuperiorScape, Inc. strives to provide excellent customer service. Therefore, it is nice to hear from our customers when the job is done well."}, "gmap_id": "0x888914623829cd6b:0x307158a1928c1cb3"}
{"user_id": "110359515344276713504", "name": "Linda Guetschoff", "time": 1589815495172, "rating": 5.0, "text": "Superior did a small job in my yard. I was impressed by their professionalism and the quality of their work. I would recommend their team of employees.", "pics": null, "resp": {"time": 1594742489334, "text": "Mrs. Guetschoff:\nThank you for the kind words; we sincerely appreciate your business, as well as your feedback. SuperiorScape, Inc. strives to provide excellent customer service. Please let us know if you need additional landscape construction work completed."}, "gmap_id": "0x888914623829cd6b:0x307158a1928c1cb3"}
{"user_id": "117493206350182024953", "name": "Amy Nesbitt", "time": 1565958437580, "rating": 5.0, "text": "We had an excellent experience with SuperiorScape. We needed a retaining wall built at the end of a sloping driveway, and they did an amazing job. Chris was easy to get in touch with and was able to come out and give an estimate within a few days. We were put on the schedule and not only did they actually come at the scheduled day, they were able to start a few days earlier! We had a few questions at the beginning of the project and Chris was very easy to get in touch with and was prompt to reply to our questions. The retaining wall is quality built and beautiful. The project was done precisely as discussed and we could not be happier with it. This company exceeded all of my expectations. I would highly recommend them.", "pics": null, "resp": {"time": 1594742553952, "text": "Mrs. Nesbitt:\nThank you for the kind words; we sincerely appreciate your business, as well as your feedback. SuperiorScape, Inc. strives to provide excellent customer service. Please let us know if you need additional landscape construction work completed."}, "gmap_id": "0x888914623829cd6b:0x307158a1928c1cb3"}
{"user_id": "107209389829011551764", "name": "Beth Law", "time": 1558715390265, "rating": 5.0, "text": "So impressed with this company!  We got several quotes for landscaping at our house - they were significantly less expensive than another local company.  Very easy to work with and the final work they did was wonderful.  Very honest and hard working - would highly recommend!", "pics": null, "resp": {"time": 1594742980280, "text": "Mrs. Law:\nThank you for the kind words; we sincerely appreciate your business, as well as your feedback. SuperiorScape, Inc. strives to provide excellent customer service. Please let us know if you need additional landscape construction work completed."}, "gmap_id": "0x888914623829cd6b:0x307158a1928c1cb3"}
{"user_id": "108691910154311646718", "name": "Elizabeth Long", "time": 1558732803878, "rating": 4.0, "text": "Chris was great to work with.  We needed work done at property we are selling (and we live out of state).  He did the estimate very quickly, worked with us on a payment plan and kept us updated on start, progress and finish.   Definitely would recommend this group.", "pics": null, "resp": {"time": 1594741758670, "text": "Mrs. Long:\nThank you for the kind words; we sincerely appreciate your business, as well as your feedback. We strive to provide excellent customer service. Please let us know if you have additional landscape construction needs."}, "gmap_id": "0x888914623829cd6b:0x307158a1928c1cb3"}
{"user_id": "117380344196876657370", "name": "Lindsey Fagan", "time": 1558558625089, "rating": 5.0, "text": "Superiorscape built a small retaining wall and sidewalk at my home.  They did an excellent job and I would highly recommend them!  They were also a pleasure to work with; they were accommodating when it came to scheduling and quite helpful with the information I had to turn into my HOA.", "pics": null, "resp": {"time": 1594743023094, "text": "Mrs. Fagan:\nThank you for the kind words; we sincerely appreciate your business, as well as your feedback. SuperiorScape, Inc. strives to provide excellent customer service. Please let us know if you need additional landscape construction work completed."}, "gmap_id": "0x888914623829cd6b:0x307158a1928c1cb3"}
{"user_id": "101899679334085631233", "name": "Kevin Weber", "time": 1558526940600, "rating": 5.0, "text": "I want to thank Chris for doing a fantastic job replacing my flagstone patio and steps!!  I wish I would have used SuperiorScape 10 years ago. Bottom line you get what you pay for. Would highly recommend.", "pics": null, "resp": {"time": 1594743090962, "text": "Mr. Weber:\nThank you for the kind words; we sincerely appreciate your business, as well as your feedback. SuperiorScape, Inc. strives to provide excellent customer service. Please let us know if you need additional landscape construction work completed."}, "gmap_id": "0x888914623829cd6b:0x307158a1928c1cb3"}
{"user_id": "112728551480887665743", "name": "Robert Chapman", "time": 1590238267403, "rating": 5.0, "text": "They do what they say there going to do. They show up as promised and do excellent work. A pleasure to work with.", "pics": null, "resp": {"time": 1594742459500, "text": "Mr. Chapman:\nThank you for the kind words; we sincerely appreciate your business, as well as your feedback. SuperiorScape, Inc. strives to provide excellent customer service. Please let us know if you need additional landscape construction work completed."}, "gmap_id": "0x888914623829cd6b:0x307158a1928c1cb3"}
{"user_id": "108329044835946594473", "name": "Blair Kelly", "time": 1537988764413, "rating": 5.0, "text": "We recently had Supeiorscape give our backyard a complete overhaul. They were very professional and their timeline was right on target. They were able to fix our ongoing flooding problem which was a huge relief. We now have a backyard we want to enjoy instead of ignore. Overall, we are very pleased and highly recommend their service.", "pics": null, "resp": {"time": 1596038720342, "text": "Thank you, Mrs. Kelly, for your business, as well as your feedback. We strive to always show professionalism and provide excellent customer service. Please let us know if you need additional landscape construction in your yard."}, "gmap_id": "0x888914623829cd6b:0x307158a1928c1cb3"}
{"user_id": "104165179825294701435", "name": "Ryan Henderson", "time": 1543081440771, "rating": 5.0, "text": "The Office Manager is wonderful. She has a terrific attitude, unselfish, and is very passionate about the company! Very dedicated and is a pleasure to work with.", "pics": null, "resp": {"time": 1596038464097, "text": "Mr. Henderson:\nThank you for the kind words; we sincerely appreciate your business, as well as your feedback. SuperiorScape, Inc. strives to provide excellent customer service."}, "gmap_id": "0x888914623829cd6b:0x307158a1928c1cb3"}
{"user_id": "115209955868794034889", "name": "Roland “Ron” Montgomery", "time": 1541628361110, "rating": 4.0, "text": "They did a good job for us.  Professional and polite.  Worked hard. Would recommend them.", "pics": null, "resp": {"time": 1594741798024, "text": "Mr. Montgomery:\nThank you for the kind words; we sincerely appreciate your business, as well as your feedback. We strive to provide excellent customer service to our customers. Please let us know if you have additional landscape construction needs."}, "gmap_id": "0x888914623829cd6b:0x307158a1928c1cb3"}
{"user_id": "114520468905177855492", "name": "Mark Haughery", "time": 1558974803235, "rating": 5.0, "text": "Right on time and Excellent work from start to finish.  Highly recommend Superiorscape!", "pics": null, "resp": {"time": 1594742570121, "text": "Mr. Haughery:\nThank you for the kind words; we sincerely appreciate your business, as well as your feedback. SuperiorScape, Inc. strives to provide excellent customer service. Please let us know if you need additional landscape construction work completed."}, "gmap_id": "0x888914623829cd6b:0x307158a1928c1cb3"}
{"user_id": "118259764199177206568", "name": "Sarah Beth Wertz", "time": 1528424425769, "rating": 5.0, "text": "We are beyond thrilled with our recent courtyard renovation by SuperiorScape. The guys worked hard, were professional and completed the project in just a few days. We were also really pleased that they took the time to clean up each day after a hard day of work. The process from start to finish was professional and easy. We highly recommend SuperiorScape!", "pics": null, "resp": {"time": 1596039112933, "text": "Thank you for your business, as well as your feedback. We strive to provide each customer with excellent customer service. Please let us know if you have any additional landscape construction projects; we will be happy to come out again."}, "gmap_id": "0x888914623829cd6b:0x307158a1928c1cb3"}
{"user_id": "116701168202425059416", "name": "phillip bromley", "time": 1547502601886, "rating": 5.0, "text": "This company is outstanding. They came when they said they would and did excellent work.", "pics": null, "resp": {"time": 1594743171503, "text": "Mr. Bromley:\nThank you for the kind words; we sincerely appreciate your business, as well as your feedback. SuperiorScape, Inc. strives to provide excellent customer service. Please let us know if you need additional landscape construction work completed."}, "gmap_id": "0x888914623829cd6b:0x307158a1928c1cb3"}
{"user_id": "103553431879871169518", "name": "Don Johnson", "time": 1558718913330, "rating": 5.0, "text": "Love the work and the great group of guys", "pics": null, "resp": {"time": 1594742666101, "text": "Mr. Johnson:\nThank you for the kind words; we sincerely appreciate your business, as well as your feedback. SuperiorScape, Inc. strives to provide excellent customer service. It is always good to hear that our team members are working to meet your expectations."}, "gmap_id": "0x888914623829cd6b:0x307158a1928c1cb3"}
{"user_id": "117057714328552790301", "name": "Jarrod Patterson", "time": 1510165860645, "rating": 1.0, "text": "1 star only because 0 stars is not an option.\n\nI just moved to the Birmingham area. The only item needing attention from our home inspection was a failed retaining wall. SuperiorScape provided a quote for the repair, which we used to close on our house (had money held in escrow based on SuperiorScape's quote).\n\nAbout a week prior to the scheduled start date for the work to begin, the sales agent came out with another team member to look at the existing wall. That afternoon, the sales agent called me and said that due to personnel issues they couldn't do the job. I tried to get back in touch with SuperiorScape to say we were willing to wait until they settled their personnel issues but that we would like them to honor the quote they gave us. They have not responded to any of my or my realtor's attempts to contact them.\n\nI believe the sales agent misquoted the job, came out with the actual worker who told him it was too cheap, and rather than owning the mistake, talking it out, and honoring the quote they backed out of the job and refused to speak with me again.\n\nTerrible customer service.", "pics": null, "resp": {"time": 1594741469357, "text": "Mr. Patterson:\nAlthough your review was posted in 2017, I would like to apologize for the experience you had with SuperiorScape, Inc. In March of 2018, we hired a new Sales Manager, with a great deal of knowledge in the landscape construction field. SuperiorScape, Inc. is dedicated to our customers and we strive to provide great customer service. I apologize for not being able to provide you with better service."}, "gmap_id": "0x888914623829cd6b:0x307158a1928c1cb3"}
{"user_id": "100719653768094018527", "name": "James E. Dean", "time": 1550843306966, "rating": 5.0, "text": "Great People!", "pics": null, "resp": {"time": 1594743139867, "text": "Mr. Dean:\nThank you for the kind words. We appreciate your help with our IT issues."}, "gmap_id": "0x888914623829cd6b:0x307158a1928c1cb3"}
{"user_id": "106887282112802248934", "name": "Sean Richards", "time": 1621524666129, "rating": 5.0, "text": "We really enjoyed working with Bryan and team. The worked on building an outdoor kitchen, flagstone path and rebuilding flagstone steps. They delivered on their commitments to high quality and ensuring we were happy with the project completion before asking for payment. They communicate upfront in an effective and frequent manner. They also improved on the ideas we had for the project and brought their knowledge and experience to help us make decisions that made sense. If you are considering them for a project you won’t find any better. I’m now looking for more opportunities to work with them!!", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "100302924416403322037", "name": "Steven Pearl", "time": 1620391904510, "rating": 5.0, "text": "Bryan and his team were fantastic to work with! They were responsive, hard working, professional and paid incredible attention to detail on the entire project. The completely exceeded our expectations as far as what the space would look like. What started as a boring backyard turned into a resort looking space that we never want to leave! Can’t thank Bryan and his team enough for delivering such a perfect outdoor space for us to enjoy!", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "113806037487411791567", "name": "Amanda Champion", "time": 1601944472979, "rating": 5.0, "text": "We had an awesome experience with The Backyard Auburn.  Bryan's crew did an amazing job on our flagstone sidewalk and sitting area.  They were prompt, professional and worked nonstop to get the job done.  Will definitely use them again for future projects.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPdTT7PuhGPZ5sRvcrW34kc_CF9IexTtlM_d-lL=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPnj28o4lsg7keKU1vrguqwJeI_xuakynlT1g30=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPEWQZn7QwfuASgSw9HEgXJoGPVwUsDE6NvA4iw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMf_zUv2Xm86zQAqQcrMMEAshNH2q_rBTGkYHDA=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "108069118802234025235", "name": "Lauren Mackey", "time": 1623333191907, "rating": 5.0, "text": "The Backyard just completed 2 flagstone patios, with a rock bench, and firepit in our backyard. It turned out better than we ever expected! They were exceptional with quality, communication, and worked quickly while paying close attention to detail. You can tell they take pride in what they do. We previously had a flagstone path done by another company and the end products don't even compare. The Backyard's patio is definitely a far superior finish. We really enjoyed working with our job's Forman Kensley and all of his crew they were fantastic to work with! If you need someone to update your outdoor space, then I highly recommend The Backyard in Auburn!", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "108751080818012247549", "name": "Cynthia Waldrep", "time": 1583867649203, "rating": 5.0, "text": "Excellent all around with outstanding service, communication and overall experience!  Brian and his team were awesome and easy to work with.  I called one afternoon to inquire about an outdoor stone fireplace and he was at my lake house the very next morning.  After sharing his ideas and his vision with me, we ended up adding an outdoor kitchen as well and I could not be happier!!  The price he quoted was reasonable and the work was done as specified in a timely manner.  So happy I found Brian and The Backyard and I will definitely use them again!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPYDPle8J13G0rRlqhVYP0T60CxugGTKm_rAEkj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM1NLlqfBpO8n6AEU-8nD6ojBnWLrl9yhDsyhW-=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM8ecDT3EX2rJs4sF3Jx_Be5_GYmv0JX355oDFO=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMOZUi4lXgTCOOQxubpdQ8lrm6mPZTUMkIrenKA=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOqIeiOWzes7cyalmPF3M3WD9-uvVvz62bG3wTY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMdPljLdd809pmr2o8r1I8iPD04Wf6_Rr2oDRCM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP7eI8fb6dF4Mewq8FhnR4pzOgb64mMUKOFZZvc=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "108646105988621845301", "name": "Eric Cross", "time": 1621956351478, "rating": 5.0, "text": "Outstanding quality and service! Nothing but praise for the entire company. Brian and Kendall made this such an easy process. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "103362858141003476064", "name": "Steve Toledo", "time": 1618235929860, "rating": 5.0, "text": "Brian the owner is amazing to work with. His stone is high quality and the delivery was simple and easy. 5 star overall very professional and would definitely use again!", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "104903110463946893542", "name": "Diana Catrett", "time": 1621168468224, "rating": 5.0, "text": "Great work, would highly recommend The Backyard.  They know what they are doing and the crew that did the work were great.  They finished the job in one day.  That arrived at 7 am and worked non stop except for a lunch break.  Kensley was very polite and reassuring that if I had any questions I thought of later, not to hesitate to call.  After the job was complete, I received a phone call from Bryan Waites asking if I had any questions and if I was happy with the work.  Can't say enough good things about this company!", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "108787729864209729328", "name": "Bob Parker", "time": 1606173061142, "rating": 5.0, "text": "Every person at The Backyard has been a pleasure in the way they conduct their business. Extremely professional and courteous with their customers interest and satisfaction as the focus of their business. We just finished an expansion of our porch to a patio with a new stone surface throughout and the finished product is perfect.  Bryan listened to our requests and offered some excellent input that helped us with our final decision.\nThey arrived on time and stayed until all the work was finished. The cleanup of our yard was excellent as well as the front street and sidewalk after all was finished. The yard, including grass and flower beds were as if nothing had been disturbed.\nWe could not be more pleased from start to finish. Polite and respectful crew members and excellent, quality workmanship means we will call Bryan again for more work as we continue our landscaping plans.", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "109610500592113321818", "name": "R Blanchard", "time": 1593439421850, "rating": 5.0, "text": "Hired Brian and his team to put in a patio and firepit to match our house on the lake.  Brian was patient as we tried to figure out the best way to situate the firepit.  He just completed the work and we couldn't be happier with the way it turned out.  Top quality work at a reasonable price.  Most importantly he communicated and showed up when he said he would.  Something I'm not use to living on the lake. Thanks again Brian. Highly recommend!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOb8EgxjP1W7uHHY62nG4UIPfN-gkOkoMbhWE7B=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMMxii0CkVTEXaSkoAGimWhYfgxguc6e3SRLQsi=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "111381522137460909630", "name": "Molly Wilson", "time": 1616449932714, "rating": 5.0, "text": "Love the new patio The Backyard installed today!  Already asked if they can install another one!  Very hardworking crew. I highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "113805130307814472058", "name": "Brian Weiss", "time": 1600800111258, "rating": 5.0, "text": "Bryan and his team at The Backyard of Auburn are absolutely the best in the business. Great communication, high attention to detail, and with a finished product that will WOW you for years to come. They completed a beautiful stone retaining wall with large stone steps up to our pool three years ago, and just last week capped our pool deck with stunning flagstone - breathtaking! This decision absolutely transformed our pool, and we cannot wait for family and friends to enjoy it with us. Bryan truly cares about his customers and stands by his work. We have \"one more\" project and with no hesitation it will be Bryan and his team with The Backyard.", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "103809649785562119075", "name": "Brittney Thaxton", "time": 1585239089407, "rating": 5.0, "text": "Our patio was finished yesterday and to say we are extremely pleased would be an understatement!!! Everything was completed on time and at the amount we were quoted. We will definitely reach out to get our front porch done later this year. Completely blown away with how much this has refreshed our yard!!! I highly recommend The Backyard Auburn!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNhsATy2-755aCRrjz_QiTpyQIi7LuEQgk2UUj1=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "102141664410102057242", "name": "Ken Tidwell", "time": 1550015936854, "rating": 5.0, "text": "Bryan Waits of The Backyard has done 2 projects for us in the last year. They installed a short height but long rock wall and several rock planters along with a flagstone walkway on the first project. It was done on time and budget. The work was quality and looked wonderful. The second project that they just finished was another walkway from our deck to the fire pit. It turned out wonderfully just like the other one did. His guys are very professional and nice to work with. I would recommend them highly.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO-LFkRcYuSK_jvNPrV06HCt_jpXW-pkVB4Ti5s=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPC4P-ehFEqfkF0tAqtm0sp1cEsn8h4P_Z4brmf=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP0midbw6CxXJfwKkrsWrfOflA5pF1kQWT651t0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP7s4r1kbHVMrXOXiDh_mVxl79zlkFVGcQM8Esy=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "118139629181297909286", "name": "jen jones", "time": 1621474958258, "rating": 5.0, "text": "I highly recommend Brian and Backyard Auburn. He listed to what our vision was and the finished patio is exactly what we wanted.", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "107590105223588633170", "name": "Hope Henderson", "time": 1605565035672, "rating": 5.0, "text": "We had a patio and a wall built at our house.  Bryan and the crew did exactly as promised.  They came here and worked hard for three days and finished.  We love the new patio and wall!  It transformed the front of our house into something beautiful!  Thank you so much!  Hope and Mark", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "107808474546889254553", "name": "Chuck Isbell, M.D.", "time": 1542725009560, "rating": 5.0, "text": "Bryan and his crew recently installed  this quarry stone wall for a raised flower bed in my sloped front yard. They got on the project quickly, completed it in a couple of hours, and the cost was very reasonable. The quality of workmanship is excellent and I am thrilled with the results. If I have any future work like this I know exactly who to call! I would recommend Bryan and his staff at The Backyard to anyone needing the services they provide.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOc509BwHU7iu-CDbfYiMMKvrtRdA8gfAY-a4W4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMO5a5D1saeFsDo55d47jdHKyllbkDh792aZdtc=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "109288224167729449798", "name": "latricia weatherford", "time": 1610911817510, "rating": 5.0, "text": "Extremely amazing place. The owner actually took my call and came in on a Sunday to help us. Thanks so much Backyard!", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "109538688551449064229", "name": "David Shropshire", "time": 1608240449701, "rating": 5.0, "text": "The Backyard in Auburn did a beautiful job laying stone over our existing concrete sidewalk, and extending our back patio. They are experts in working with natural stone, but I was equally impressed with the owner's (Bryan) commitment to customer service and follow-up to insure we were satisfied when the job was finished.", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "111415527397588130202", "name": "joe best", "time": 1603561271167, "rating": 5.0, "text": "This company is top notch!  They did a superb job and cleaned up afterwards after putting in a Flagstone patio for us. They exceeded all of my expectations I closing being responsibly priced. Will use them again for any other projects!", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "102997098686477970754", "name": "Laura Kincaid", "time": 1598642120016, "rating": 5.0, "text": "Bryan and his skilled team of professionals just completed a project for us that has exceeded our expectations in every way possible. The customer service and attention to detail are unmatched. The Backyard can completely transform your outdoor space. HIGHLY recommend!!", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "108601802982592790701", "name": "Bill Baas", "time": 1563551839465, "rating": 5.0, "text": "Bryan and his team are awesome.  It's incredible to watch them work, they are well oiled machine and produce awesome looking brick and stone work.\n\nThis is my third experience with Bryan and The Backyard Team.  Excellent communication, quality work and clean up after the job was complete.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMN46J2cJ9O3DPE2at3ioxHIDKe9-MtCErB1pG_=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "102749941841067026920", "name": "Foster White Jr", "time": 1621741155207, "rating": 5.0, "text": "Great place with great service.", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "117976561345154917430", "name": "Vicki Cross", "time": 1602220449236, "rating": 5.0, "text": "Mr. Bryan, Thank you so much for the outstanding job you and your wonderful staff have provided to us! Everything is so beautiful!  I love it!  From the moment you and your staff arrived, we have received the most outstanding services anyone could have ever wanted!  Everyone was so courteous, kind and the most professionally organized organization I have ever experienced!  You were always on time and each individual worked hard to achieve the highest level of quality in service and production of product satisfaction!  I could infinitely go on about you, your staff and the BEAUTIFUL FIREPLACE AND PATIO you designed and built in my backyard!  You are the Chick Fil-A in masonry construction!!!   Chick-Fil-A is known for their quality in service and delicious food.  You, Sir, are second to none with your quality of service and product satisfaction!  Each of you are artist when it comes to your work product.  Your signature has been permanently engraved in the beautiful fireplace in my yard!!! Thank you so much for allowing me the honor to receive one of your beautiful fireplace/patio signatures pieces !  Again, thank you for everything!   May GOD BLESS each of you in every way!  Y’all are the greatest!", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "113205066673654539706", "name": "Debbie Smith", "time": 1596341613564, "rating": 5.0, "text": "The Backyard crew installed a flagstone patio, walkway, and flowerbed surround for us and we couldn’t be happier!  The crew was very skilled, hard-working, careful and courteous and did a beautiful job. I highly recommend them for any such project!", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "115265173497281770720", "name": "Randel Whitehead", "time": 1591711635590, "rating": 5.0, "text": "Brian and his team were so great to work with and the product they provide is wonderful! We told Brian our budget for the project and he worked with us to design our patio and fire pit. His team was on time each morning and worked hard throughout the project to finish on time as promised. He is great to work with and I could not recommend him more!", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "104353142162628325737", "name": "Maria Gilleland", "time": 1594661466744, "rating": 5.0, "text": "Brian and his crew are fabulous! Prompt, professional, reasonably priced and a pleasure to work with! Had a stone walkway put in; looks great! I will be calling in Brian and his team again for the next project!\nMaria G.\nAuburn", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "109605428967965579635", "name": "Laurie Pearce", "time": 1592610008135, "rating": 5.0, "text": "About a year or so ago Bryan made us a flagstoned patio , so the other day I called him to help us again with a patio once again you could not have asked for anyone better. Always professional and his help is always nice and Courteous and the workmanship is the best around. Highly recommend. Will do business with him again.", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "109528386584956100526", "name": "Tamara Byal", "time": 1581642470828, "rating": 5.0, "text": "We had an amazing experience with The Backyard.  Brian and his team were exceptional. They showed up when they said they would and we’re very efficient. They arrived at 7:30am and completed the job by 2:30pm turning a worthless portion of our yard into a beautiful flag stone patio with a fire pit.  Brian had contacts to connect our gas line to the fire pit and was very knowledgeable about how to drain water away from the area.   Very reasonably priced. A seamless, wonderful experience and we wholeheartedly recommend this company!", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "115663887779333091243", "name": "Ben Pugh", "time": 1602099359010, "rating": 5.0, "text": "Great work and great communication! The Backyard is who you want to use for your all stonework or other hardscape needs.", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "100628587707207721007", "name": "Will Tampling", "time": 1585260996770, "rating": 5.0, "text": "What a professional job! We couldn’t be more pleased with the job Brian Waites and his crew did on our flower bed borders. They were prompt, worked a solid day, cleaned up after themselves and very reasonably priced. I would highly recommend, and will!! Thank you to “The Backyard”.", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "112082296423047374332", "name": "Helene Fincke", "time": 1583690277727, "rating": 5.0, "text": "Bryan and his team are very professional and talented at what they do. The team who installed my patio were very focused on their task which was completed in a timely manner and looks beautiful.They take great pride in their work. Everyone was very easy to work with. Their work is first class. I would highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "104595373951035494706", "name": "Sherri Rainer", "time": 1586260413714, "rating": 5.0, "text": "Bryan and his team do beautiful stone work!  I can not say enough about how easy Bryan made our project come together.  His years of experience, professionalism, and consideration of our needs made all the difference!  I look forward to future projects with The Backyard!", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "108431075780881671564", "name": "Jay Fain", "time": 1585409945769, "rating": 5.0, "text": "I couldn’t think of a better place to buy my Big Green Egg. The staff was very accommodating and made my decision very easy. They have every accessory for a Bug Green Egg you could ever ask for. Plus, they have a beautiful selection of planters and natural stone to choose from.", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "101603162512170138039", "name": "Paul Olsen", "time": 1578419788167, "rating": 5.0, "text": "We hired The Backyard to renovate an existing patio and install a new walkway and stone fire pit.  We found their work to be extremely high quality and performed on the schedule they committed to, and they demonstrated in a number of ways that they were clearly committed to making sure we were satisfied.  I'd absolutely, highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "100410279494506650488", "name": "Stephanie Simmons", "time": 1592592172262, "rating": 5.0, "text": "These guys were very easy to work with, and I was very happy with the end result. I would definitely work with them again!", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "108068725576923038176", "name": "LaDonna Thornton", "time": 1583549107129, "rating": 5.0, "text": "Backyard Auburn did a great job on my patio and walkway.  I love it!  They were extremely easy to work with and very accommodating.  I would definitely use them again.", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "101306935611847634467", "name": "david giegel", "time": 1595780779951, "rating": 5.0, "text": "Brian was very responsive and made sure every detail of our project was perfect.  I would highly recommend  them!", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "104365887609654185179", "name": "leigh nicks", "time": 1580688859112, "rating": 5.0, "text": "Brian and his team are nothing short of amazing. Their professionalism, efficiency, craftsmanship, and respect are top notch. They have constructed two slate patios and a rock garden drainage system for us, and we will continue to ask for their services for all future projects.", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "102935699050859156218", "name": "Blake Hobbs", "time": 1576794267091, "rating": 5.0, "text": "The Backyard Auburn does beautiful top quality work! They are always timely on projects and always produce exceptional work. We highly recommend using them for any projects you have in mind.", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "115872556208232023362", "name": "Taylor Rogers", "time": 1575424112244, "rating": 5.0, "text": "We highly recommend The Backyard Auburn.  Our job was done on time and on budget.  The work looks great and is done to very high standards.\n\nLooking forward to getting more work done!", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "110138795739706854355", "name": "T.C. Fincher", "time": 1558376753806, "rating": 5.0, "text": "We just had a small project completed by The Backyard and are pleased to say they did a beautiful job!  I will not hesitate to have them do other projects for us in the future.  Brian and his team were all very professional, polite, and helpful. If you ride out to their business you can see several examples of their workmanship and get ideas as well.   I highly recommend The Backyard.", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "109174687437292199280", "name": "Schuyler Watrous", "time": 1582077318045, "rating": 5.0, "text": "Look no where else for your patio construction needs.  Brian and his crew have done two jobs for me.  The first he came back to fix a job that was done incorrectly by another builder.  Had to rip it up and start over.  The second job was just completed and we are so happy.  They are in and out in no time.", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "116668390119541433194", "name": "Michael Rabren", "time": 1592412375772, "rating": 5.0, "text": "Brian and his employees have done several jobs for me and have always done a professional job! I would highly recommend The Backyard for any of your masonry needs.", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "116839732886687743190", "name": "Kimberly Munshower", "time": 1549910962830, "rating": 5.0, "text": "Excellent end product! The process was quick and simple. Brian worked with me and adjusted on the fly to accommodate my wishes. The workmanship is incredible and the pride of ones work apparent!!  Also, the clean up was meticulous!! Can't wait for our next project!! Thanks Brian", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "118377567588876798196", "name": "Reynolds Outdoors", "time": 1565825332871, "rating": 5.0, "text": "Bryan's team did a great job with our patio extension. They got the job done quickly and it looks great. I will definitely use them again in the future.", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "117998912862802050072", "name": "Matt Harrison", "time": 1572277957806, "rating": 5.0, "text": "Quality work done on time and at quoted price. Stone columns we had installed had small details that set them apart from others. Jobsite condition was spotless after completion.", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "105785313141991152391", "name": "Richard Himmer", "time": 1563905638056, "rating": 5.0, "text": "They did exactly what they said they would do.  I thought I had a problem with my walkway but it was done correctly.  He was willing to do whatever it took to make me happy.  Wish all contractors were like him", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "112092847502463140676", "name": "Benjamin Fagan", "time": 1571241800367, "rating": 5.0, "text": "We're thrilled with the work of Brian and his team. They installed a patio and front walkway of reclaimed brick pavers, in a herringbone pattern. The work was done on time and at the price quoted, and we will definitely be repeat customers if the need arises.", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "100369077904599423103", "name": "Edward Pearce", "time": 1555121497628, "rating": 5.0, "text": "Bryan and his crew were very professional and easy to work with , he built a 280 sq.foot flagstone patio with a table for a big green egg. Bryan made great recommendations to guide us with the right design. I highly recommend Bryan and his crew. Will do business with him again", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "117797057350048186951", "name": "Jennifer Robinson", "time": 1552314749754, "rating": 5.0, "text": "Brian and his crew did a fabulous job on a beautiful patio at my new house. I had been trying to figure out on my own exactly what I wanted and all my ideas just didn’t feel right. Brian came out and with his years of expertise was able to quickly come up with a plan that I immediately knew was just what I had been trying to come up with and failing miserable at. I get so many compliments on this patio and seating wall from all my neighbors.\n\nWould highly recommend!! Top quality work!!", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "105619512300118782258", "name": "Greg Carlson", "time": 1579645074539, "rating": 5.0, "text": "Fire pit patio constructed in 5 hours and is beautiful!  These guys were a well oiled machine.", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "105868512095738883104", "name": "Jacqueline Vaughan", "time": 1534461898633, "rating": 5.0, "text": "I'm so delighted with the quality of work Bryan and his crew performed on the flagstone patio & walkway. He was able to schedule project sooner and job completed in a timely matter. Additionally, I very much appreciated Bryan's professional demeanor as we worked a through a  minor design change.  Would highly recommend his services to others.", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "112410434743082032626", "name": "teresa page", "time": 1556141390030, "rating": 5.0, "text": "“The Backyard” out of Auburn, Alabama..\nI watched the ugly transform into the beautiful.\nBrian Wait’s team did a wonderful job!\nWay above my expectations,  Happy customer in Salem, Alabama.\nThank you!!☀️☀️", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "117695652639341693166", "name": "Theresa O'Steen", "time": 1550518744250, "rating": 5.0, "text": "Over the years we have had Brian and his crew work for us on several backyard projects at our properties.  These have included a fire pit flagstone patio and a walkway.  He has always been professional and easy to discuss what we wanted and his follow through has been excellent.  I highly recommend them.  I tried to do a patio once DIY style, big mistake.  Call Brian he's an artist with stone.", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "114024250799082295803", "name": "Chris Rehm, Sr.", "time": 1538247616588, "rating": 5.0, "text": "I had Backyard Of Auburn do a project in my backyard in Auburn.. They did a fantastic job. We had kudzu and bamboo and erosion with a drainage ditch through the yard.  Brian and his crew cleared the yard tiered the yard and put down a tarp and rocks and in the drainage ditch large rock and it looks wonderful. I could not be more pleased. I would highly recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "115849238402181917668", "name": "Michael Scifres", "time": 1525394779113, "rating": 5.0, "text": "Bryan and his guys did an astounding job at re-doing our covered patio. The old concrete was torn out and replaced with flagstone that looks amazing. All done in one day. Will definitely be using again in the future!", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "105219258632041310124", "name": "Philippe Scheys", "time": 1554237610717, "rating": 5.0, "text": "Bryan and his crew are great to work with on projects to enhance your outdoor space. The end product is beautiful and professionally built, and in a very short time-frame!", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "109033023271379762785", "name": "Dane Griffith", "time": 1549599348005, "rating": 5.0, "text": "I've worked with Bryan and The Backyard on three different projects.  They are always professional and the quality of their work is of the highest quality.  You can't go wrong with The Backyard!!", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "117153617726021590379", "name": "David Thomason", "time": 1532392514775, "rating": 5.0, "text": "Brian was friendly and proactive. He called several days ahead of the appointed installation date to confirm and was onsite exactly on time. As a retired construction manager I appreciated the high quality of the workmanship. Brian also called to follow up after the work was done. I highly recommend The Backyard to anyone wanting stone work done.", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "117860944921881599038", "name": "James Long", "time": 1473896799669, "rating": 5.0, "text": "Bryan and the folks at The Backyard were awesome! The prices were competitive and the quality was outstanding. I had them do a 290 square foot rock patio and I couldn't be happier. I would definitely use them again. Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "109539195071817405759", "name": "Chris Kearns", "time": 1452647396704, "rating": 5.0, "text": "Bryan and his crew haven't done a project for me lately, but at one time they rebuilt some entrance columns and a commercial sign for me a few years.  They looked good at the time, and they still look great years later.  Now they are doing outdoor kitchens too?  Maybe it's time for another project - a fun one.", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "104242668035007760776", "name": "Shannon Belletti", "time": 1560373502602, "rating": 1.0, "text": "Drove 40 minutes to their store. Arrived over an hour before closing time and no one here. (Wednesday afternoon in June) Sign on door said to call for assistance. Tried calling twice but no answer and no way to leave a message.", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "111741965203456271423", "name": "Larry Wilson", "time": 1564694777523, "rating": 5.0, "text": "Was in need of fireplace work and Backyard did a great job .", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "109577404960790552854", "name": "Jr Feild", "time": 1461340039148, "rating": 5.0, "text": "Brian Waits and the Backyard crew came to my house and completed a large flagstone patio for me.  His price was fair; their work was unbelievably quick and excellent!  The work was done on time and at the price Brian quoted.  I rate their work as 5 stars and we are very happy with our completed patio.\n\nJunior Feild", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "101521130930003823952", "name": "D", "time": 1533690684717, "rating": 5.0, "text": "Outstanding workmanship and looks great! I highly recommend The Backyard to anyone who wants it done right.", "pics": null, "resp": null, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "116089470950576799435", "name": "Cindy Fischer", "time": 1548525818672, "rating": 1.0, "text": "Web site says Sat 8am till 2pm drove from Evergreen Al to a closed store!! 😠. You lost a sale I wont come back!", "pics": null, "resp": {"time": 1549463636925, "text": "We are very sorry for the miscommunication about our Saturday hours. We are not open on Saturdays in the winter, but the Google hours were not updated. If you'd be willing to try us again we would love to help in the future!"}, "gmap_id": "0x888cf48cc9f6abc9:0x9e69d9ac01ef739d"}
{"user_id": "102008537685885345400", "name": "Gordon Banks", "time": 1617428136124, "rating": 5.0, "text": ">  I believe this company needs to improve its customer communications policies. They showed up late (without calling) to give me an estimate, and then showed up unannounced the day they came to work. But then things took a surprising turn..\n>   They were hired to fell one tree and heavily trim the lower branches of another. To save money and to give me a project involving strenuous exercise, they were not required to do any cleanup work. When they asked about my cleanup plans, I mentioned using my ATV trailer to move the debris to the street for pickup by the city. At their suggestion I moved the trailer into the work area. Suddenly the logs and branches magically found their way onto the trailer until it was full, with the remainder piled neatly nearby. Despite not being paid for it, they worked hard to minimize the cleanup work remaining for me, a fat 74 year old retired soldier.\n>  It was also interesting and entertaining to watch their tree climber work. He knew exactly where and how to make cuts to have the pieces fall right where he wanted them. And while 20+ feet up into the tree being trimmed, he asked me over and over what else I wanted cut. He never suggested being done until I was satisfied.\n>   Finally, when the work was done, they did a last minute walk-around to check for any tools left behind, and to pick up more debris so I wouldn't have to.\n>   The team's work (and work ethics) more than made up for the early communications problems. I highly  recommend Veterans Lawn Care for lawn and tree work.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMmSz26G3QTQam_HopA-jgTuoTbSnTXTMYbqPA-=w150-h150-k-no-p"]}], "resp": {"time": 1617720645913, "text": "Mr. Banks, thank you Sir for taking the time out to give us such a detailed honest review! We take all feedback, positive and negative, so we can adjust fire accordingly. We did forget that we were supposed to text instead of calling but we will be more detailed in our system to prevent this. We are happy that you were satisfied with our work, our teams strive for these 5 Star jobs. We will be passing this review out to the team! Thank you for your business and mostly thank you for your military service!"}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "112216906534252127245", "name": "Michele McQueeney", "time": 1620676810667, "rating": 5.0, "text": "The team did a great job of cleaning out the flower beds, pruning bushes, removing the ivy and overgrowth. I really appreciated them asking questions and making sure I was happy with the work being done.\nI will be using them again and recommend them to others.", "pics": null, "resp": null, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "102547121372349103028", "name": "Jim Blake", "time": 1618098547944, "rating": 5.0, "text": "These guys are awesome. Highly knowledgeable, professional, hard working and a heck of a lot of fun to watch if you have the free time.\n\nI had an oak tree that needed to come down. It was between the house, a garage and a driveway with a fence right under it. They had to take the whole tree down in pieces. It was a 3 day process.\n\nI would recommend them for any difficult task because, THEY ARE UP TO IT!", "pics": null, "resp": null, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "103456577638556194703", "name": "Katrina Wintermyer", "time": 1616979623581, "rating": 5.0, "text": "The owner was very nice and did our free estimate personally. The workers showed up and the work was done very quickly and effectively. I love my new yard. We got a full landscaping of our front yard and it was exactly what I envisioned.", "pics": null, "resp": {"time": 1617020770439, "text": "Ms. Wintermyer, Thank you for an awesome review! I will let the team know this, we appreciate your business!"}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "104445408272650905019", "name": "Jeri H", "time": 1618937964781, "rating": 5.0, "text": "Wonderful experience with Jarom today.\nVery professional & did a great job!!", "pics": null, "resp": null, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "106969302467287410274", "name": "Karen French", "time": 1601055855418, "rating": 5.0, "text": "Thank you - Randy, David, and Joe for planting my beautiful 15 gal Cherry Laurels in my backyard to hide a fence. Veteran's Lawn Care has the expertise of design and knowledge of plants along with hard working good people!!  Very pleased with their work. A shout-out to Amanda for helping redesign our yard. I will be back!!", "pics": null, "resp": {"time": 1601065367468, "text": "Mrs. French, we enjoyed your project and glad that you will get the green back drop that you were wanting! I'll will pass this feedback to the team. Thank you for taking time out to leave us such a positive review!"}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "104857715983841753206", "name": "Emma Hammonds", "time": 1617130022010, "rating": 3.0, "text": "It was good. Nice to mert some of the staff.", "pics": null, "resp": null, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "116334016326977940547", "name": "Hannah Moon", "time": 1601496270346, "rating": 5.0, "text": "These guys are amazing! They cleaned up my flower beds, removed shrubs, and placed new mulch down. I had to get new plants that I was not expecting since it was discovered that the old shrubs were diseased, but this was not an issue. I am so glad that I got them to come out. They are professional, and I felt like I was cared for the entire time. Definitely talk to them before you get anyone else to do your landscape work.", "pics": null, "resp": {"time": 1601602502578, "text": "Ms. Moon,\n\nWe are so happy to hear this! Thank you for your review of our company and the team. If there is anything else you need please don't hesitate!"}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "107934844707336976092", "name": "Cara Stein", "time": 1597874705327, "rating": 5.0, "text": "My yard was a jungle/disaster when I called these guys. They came and got everything looking tidy and sharp, and it was so fast! I felt cared for the entire time the guys were here, and they obviously take great pride in doing excellent work. I’m so glad I went with Veteran’s, and I’ll be calling them for more work in the future. Excellent job.", "pics": null, "resp": {"time": 1598718012930, "text": "Ms. Stein, we appreciate you taking time to write such an awesome review. Our teams enjoy providing services to our customers and it makes it so fulfilling to hear how happy you are! I will definitely be passing this on to our team that was on your property.\n-Jacob"}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "105372743585851465725", "name": "Dave Kimzey", "time": 1595705012138, "rating": 5.0, "text": "Veteran's Lawn Care & Landscaping did a fantastic job with our landscaping! They completed a rock border with landscaping rock and it looks really good, better than expected. Jacob, Amanda, and Randy were excellent to work with and we couldn't be happier! Thank you very much!", "pics": null, "resp": {"time": 1595712275751, "text": "Thank you Mr. Kimzey for this review. We appreciate awesome customers like you and your wife! Mostly, thank you and your wife for your service!!"}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "101192605695899300612", "name": "Danny Snodgrass", "time": 1590700969496, "rating": 4.0, "text": "Veterans lawn care is by far the best lawn care company I have dealt with. Their employees are very courteous and through. After mowing they clean the side walks and then follow up to make sure we are satisfied. They also have cut some trees for us and disposed of the debris and then raked the surroundings. Love their work ethic.", "pics": null, "resp": {"time": 1598718323441, "text": "Thank you Sir for posting this, I've enjoyed our relationship with you and your family over the years!\n-Jacob"}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "112926982978087445860", "name": "Mary Katherine Viall", "time": 1594730391478, "rating": 5.0, "text": "First, I had tried contacting several lawn services to get estimates on my yard and even made plans with no- shows. Veteran's Lawn Care was professional, timely, answered my questions, and gave me what I was wanting. Michael was great in planing out the landscape, and each crew that came out to complete the project worked hard and were friendly and professional. They even came out on a Saturday to complete the project. My husband and I were happy with the services.", "pics": null, "resp": {"time": 1594773055968, "text": "Mrs. Viall,\nThank you for your positive review. You and your husband have been awesome customers of ours! I'll pass this on to our team and let them know we have another happy customer!"}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "104511457161346203353", "name": "Joyner Livingston", "time": 1619479279539, "rating": 1.0, "text": "Installed a French drain and restocked a flowerbed with new topsoil. Installed shrubs. Shortly after the shrubs were installed I asked them to take a look at one that looked like it was not going to make it. Shortly meaning a few weeks after. These were full grown very expensive shrubs and they've ignored my calls for almost a year now.", "pics": null, "resp": null, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "101687311549099677374", "name": "Spencer M", "time": 1585764323045, "rating": 1.0, "text": "I inquired into their services recently and was told that they wont be able to service my yard due to not being able to utilize push mow in the back yard of about 25x25 size, not very large at all. I asked/called (repeatedly) for a rep to come out and get with me to get an estimate, I wasn't even sure it needed to be pushed at all I just assumed given my gate size. I wanted someone, a supposed professional, to tell me what they thought. However, after just simply driving by quickly out front of my yard they surmised (and didn't actually call to follow up) that they wouldn't be able to service my yard. It must be nice that you have plenty of business that you can not only turn away potential new customers but also treat them poorly with poor follow through and lackluster effort. I understand the eb and flow of your operations and how you can't push mow entire yards. I wasn't sure that it required that and if it did I would of possibly still been interested in the front yard being serviced which can be completed with a riding mower. You should evaluate your business operations and how you portray the business as a veteran ran organization (with I'm assuming good order and discipline, integrity, and work ethic) because I don't see that in your company right now.\n\nAgain to be clear your representative that \"stopped by\" rolled by for 20 seconds (we are all working from home and I watched him) and surely couldn't have gathered a full sight picture. Which is weird because I asked  your office rep if I could safely talk with him (at distance) and was told that wouldn't be an issue, clear lack of follow through there as well. Also, I was interested in other services your company might have provided but in light of this entire process lacking professionalism and follow through I wouldn't be confident in ANY work you could provide. You (the owner) should take a reflective look at your operation, from the person that takes the calls to the rep that spent 20 seconds here from the road, and see where to improve.", "pics": null, "resp": {"time": 1589832974764, "text": "Mr. McGalliard, I appreciate you bringing this to my attention. I take all reviews (positive and negative) to help better our company and our operations. I will meet with the team and let them know how this has impacted our company. Please let us know if there is anything we can do to remedy this relationship!"}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "111593987075597067040", "name": "Joy Watts", "time": 1593717404246, "rating": 3.0, "text": "The guys showed up and completed the job way faster than we could have ever expected. not only did they complete the job quickly, they were professional and efficient. They also did a heck of a clean-up job!\nUpdate 5/11/20:\nWe initially gave them 5 stars because we thought they ground the tree stumps, per the estimate they gave, but their clean-up job actually just consisted of them putting a lot of brush over the stumps instead. We went out a couple of weeks later to work on leveling the area and realized that all three tree stumps were still there. I have sent an email and called and left a voicemail, and have heard nothing back from the company. I understand that companies get busy during this season but they responded rather quickly to secure the job and aren't responding at all now to complete it and it's quite frustrating. All I want is for them to complete the work they were paid to complete. Doesn't seem like too much to ask.\nUpdate 7/1/2020:\nWe are still waiting for our stump grinding that was supposedly scheduled a month ago. Every time we call, we are told that we are on the stump grinding list, as if our job that has already been paid for does not take precedent over new jobs that are bringing in new income. Very disappointing to say the least.\n7/2/2020: We were able to have the stump grinding completed today and everything looks much better. I believe that the coronavirus situation threw everything off and, with that being said, the company does do quality work. I do believe, however, I will wait until things are relatively back to normal before thinking about reaching out for any additional services.", "pics": null, "resp": {"time": 1589832214166, "text": "Mrs. Watts, I apologize about dropping the ball on getting your stumps removed. We somehow weren't tracking that this was included in your estimate. We have you scheduled!"}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "108490931757175174419", "name": "Doug Bishop", "time": 1591900327924, "rating": 1.0, "text": "I am not one to leave reviews for anything but my situation warrants sharing for anyone searching for lawn service.\n\nOn 3/30/20 they mowed my lawn when it was too wet and left ruts in my lawn, my neighbors lawn and damaged my fence and down spout.\nThey did eventually come out to sod the ruts however my fence and downspout have not been fixed and have since stopped communicating.\n\n4/13/20 - received an email stating that they have the damage report and “are working on fixing it”\n\n4/27/20 - I offered to take care of the damage myself if they would mulch and/or lay sod in bare areas of my back yard. My offer was declined and again said they would repair the fence and downspout.\n\n4/30/20 - scheduled to make repairs on 5/5/20\n\n5/5/20 - no show with no communication until I asked why they didn’t come. Told they did not come due to rain and rescheduled for 5/13/20.\n\n5/12/20 - sent text asking if they were still planning to come and never replied.\n\n5/13/20 - no show with no communication\n\n- Followed up with a phone call a few weeks ago (don’t recall the date) and was told I would get a call back to reschedule the work.\n\nIt is now 6/7/20 with no call back and no repairs", "pics": null, "resp": null, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "113293242509289438095", "name": "Jauquin Holmes", "time": 1594763727412, "rating": 5.0, "text": "VETERANS LAWN CARE is a one stop service, with knowledgeable and effective working persons. ERIC and Brandon get a shout out as well.  My lawn was very out of control due to COVID 19 and the lack of maintenance on my landscaping. They came out and kicked butt! Landscaping is much better and ready for the next phase in my plans and needs.", "pics": null, "resp": {"time": 1594773147192, "text": "Mr. Holmes,\n\nThank you for your awesome review! We enjoyed getting your trees serviced and your landscape ready for the next phase. Ill pass it on to our team that you were happy with our services."}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "112059552916423998708", "name": "Kay Lewis", "time": 1596070684801, "rating": 5.0, "text": "Initially I had issues with the terrain sloping that was done on our French drain. Many delays in getting back, some of which were due to Covid crisis. In the end, Randy and Erick came out and did a superb job. Very pleased.", "pics": null, "resp": {"time": 1597197792975, "text": "Mrs. Lewis,\nI'm glad we have resolved your issue!"}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "109665644799734965914", "name": "aisha wright", "time": 1588257942377, "rating": 5.0, "text": "Ellis serviced my lawn today and himself and the other guy did a great job. They communicated very well with me and got to every specific detail that I mentioned in advance. Before even mentioning those details again, they were already aware and prepared to do so. Thank you!", "pics": null, "resp": {"time": 1589832374312, "text": "Ms. Wright, thank you for such a positive review! I am glad that our team was able to proficiently provide you with customized services!"}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "100592857992891674706", "name": "Petra", "time": 1587750065978, "rating": 5.0, "text": "Josh and his crew came out 21 April 20 to install our flagstone patio and walkway and did a great job! The crew even gave us ideas for plants to put around our new patio. From start, with speaking to Amanda to finish with meeting Jacob as he did his final check on the project, was an easy and professional process. We definitely recommend Veteran’s Lawn Care & Landscaping for any of your landscaping needs.", "pics": null, "resp": {"time": 1589832436518, "text": "Ms. Petra, I appreciate you taking the time out to leave us such a positive review! I will make sure and let the team know that you were pleased with their work."}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "108239882443142293436", "name": "PJ French", "time": 1580412248562, "rating": 5.0, "text": "If you want a project done right and on time and at a fair price, Veteran's is the choice.  These guys work their bums off and make sure you are satisfied.  I highly recommend Jacob and his crew.  You will not be disappointed with their service or product.", "pics": null, "resp": {"time": 1580431996020, "text": "Mr. Perry! Thank you for such an awesome review! This feedback makes a big difference for our team and company growth."}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "116933243183335824727", "name": "Mike King", "time": 1602720963705, "rating": 5.0, "text": "The crew that did my work were great could not have asked for a better bunch of people to do the job. I will be using them agin.", "pics": null, "resp": {"time": 1604863411383, "text": "Mr. King,\nThank you for your review, I will be passing this on to the tree team!"}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "110683356713988267414", "name": "jwiswoss", "time": 1594489860394, "rating": 1.0, "text": "Today was the first cut and it looks fantastic!\n\nUpdate: The last cut for my grass was back on 5/22. As of 7/11, they have not been to cut the grass. That is over a month and a half with no cut. I understand that there was some rain in June, but this is ridiculous. I’m not sure if they have too many customers or just forget my lawn. At first, back in June, I thought I missed an invoice and inquired about that. I didn’t get a direct answer, just that they were behind due to rain. This is unacceptable service.", "pics": null, "resp": {"time": 1589832568782, "text": "We are glad to hear that we have another happy customer! Thank you for rating us!!\n\nUpdate Response: I am sorry that  your lawn has been missed! I will look into this and get you taken care of. Sorry for any inconvenience we've caused.\n-Jacob Leavitt"}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "116345860007652766993", "name": "Nina Wesley", "time": 1593007235855, "rating": 1.0, "text": "I spent 2000.00 with these people last year to have bushes removed, new ones installed and to have a tree removed and replaced.  They require that they choose the items you want.  The crepe myrtle they installed in my yard last year is nothing but tree stems this year.  I have called several times and was told by Amanda she would have Micheal come by at a specified date and time and look at everything and discuss it with me .  On the scheduled day, i received a 'Health Check' email from Amanda explaining that Micheal had come by earlier than anticipated and then she went on to explain what he found regarding my tree and the bushs.  First off, if he came by, i did not know anything about it because he surely did not ring my doorbell; Secondly, if he did come by, he trespassed onto my fenced in backyard to look at the tree.  I find this highly unacceptable. When i called these people last year, the owner Jacob came out, whom i consider the 'money man.\"  i explained to him that i dont have a green thumb at all and need some kind of consultation regarding what i need to do to get my yard up to speed.  All he proceeds to do is write down how much everything is going to cost me without allowing someone who knows about horticulture to come out and discuss with me first about what would be the proper plants i need based on my unique environment. Needless to say, i'm back at the drawing board, trying to find a landscaper who will listen to my cries of help and actually help me.  I certainly will not spend another dime with these people at Veterans Lawn Care!!", "pics": null, "resp": {"time": 1593051505029, "text": "Ms. Wesley,\nI am sorry to hear about your tree and shrubs. I explained that not having a watering system on your property could have negative effects on your flowerbeds due to our hot summers with long periods of no rain. We don't have a horticulturist on our team yet but you did correspond with our master gardener who provided you with options available at our local nurseries. We strive to achieve superior results in the Green Industry and I apologize your unhappy with our services. Please call us if we can make it right.\nVery Respectfully,\n-Jacob Leavitt"}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "112656227680572327850", "name": "Tara Jean", "time": 1593454054378, "rating": 1.0, "text": "This business bills for lawncare services they don’t provide! They are weeks behind on lawn services,  they do a horrible job edging and miss huge patches of grass. The receptionist is a horrible person, she’s nasty and rude to customers who call with questions about missed and scheduled services. Once she found out I was a Veteran she knew she couldn’t use the Veteran card as a crutch and an excuse for a poorly run business. They make excuse after excuse because they can’t keep up with their clients or even keep a schedule. Get your lawncare from any other provider!", "pics": null, "resp": {"time": 1598718177626, "text": "Ma'am we apologized for this and have done what we can to make this right."}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "112949001604608460279", "name": "Monica Snyder", "time": 1585468404844, "rating": 1.0, "text": "As the neighbor of someone who used this company, I cannot speak of their services, but I can certainly attest to the lack of professionalism. While they were cutting my neighbors trees, part of one fell on part of my fence and damaged it. I was not upset, and as I told the owner, I understand, accidents happen. However, he wanted to do a patch job on my fence and I felt the length of the fence should be replaced to keep the fence uniform instead of part of it sticking out like a sore thumb, as was confirmed with my insurance company. So because he thought I was unreasonable he would not give me his insurance info. Poor business practices. Beware if you ever have issues with him, although I still appreciate his service to our country,I will at least give credit for that.", "pics": null, "resp": {"time": 1589834006439, "text": "Ms. Snyder, we attempted to repair the damaged fence with matching or new fencing but thought it was unreasonable to replace the entire fence line. Your husband and I agreed on what repairs were needed hours before your arrival. You then, approached irate by cussing and yelling at me in front of my employees. You stated that your adjuster would be in contact with us and I was willing to speak to him cordially but refused to engage any further especially after your husband started yelling with his fist clenched. We remained professional and courteous even while you were making a scene on our jobsite. I'm sorry that your fence was damaged and we are waiting to be contacted by your adjuster to see how we can move forward."}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "110235085800075771261", "name": "Michael Payne", "time": 1586963423663, "rating": 5.0, "text": "Great work! Ellis serviced my lawn and it was quick and neat. Look forward to having this company for years to come!", "pics": null, "resp": {"time": 1589832519357, "text": "Mr. Payne, Thank you sir for the awesome review!"}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "114957979140724604151", "name": "Edna Block", "time": 1580483822148, "rating": 5.0, "text": "Veterans Lawn Care is fabulous!!! We have had them cut down trees, trim bushes, remove leaves and they have been spraying for weeds for a couple of years. They do an excellent job and always come when they say they are.\nThey are professional and friendly and can do everything from planning you landscape design to cutting your grass!", "pics": null, "resp": {"time": 1580486637422, "text": "Mrs. Edna, thank you for taking the time out to leave us such an awesome review. You and David have been a blessing to our company!"}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "107039702363560032366", "name": "mlob5704", "time": 1587071176215, "rating": 5.0, "text": "Probably the best choice I’ve made in lawn care since I started hiring this kind of service. Ellis does a meticulous job and the lawn looks great!", "pics": null, "resp": {"time": 1589832495311, "text": "Thank you for leaving us this review! I will let the team know you were happy with our quality and service!"}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "108160633694285247259", "name": "Linda A", "time": 1589560436895, "rating": 4.0, "text": "Ellis was my provider, they always do a great job. Professional and neat!!! Highly recommend!!", "pics": null, "resp": {"time": 1589832155521, "text": "Thank you Ms. Linda for taking the time to provide us a positive review!"}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "107419238455226948416", "name": "Bryan Landreth", "time": 1580432778491, "rating": 5.0, "text": "Veterans Lawn Care & Landscapes always exceeds my expectations. Great company, great employees, and phenomenal work. Highly recommend!", "pics": null, "resp": {"time": 1580436802588, "text": "Mr. Landreth,\nThank you sir for such an awesome review! This helps more than you know. Hope all is well with you, Shelby and your new little one!"}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "110788377720921825646", "name": "Jeffrey Hilt", "time": 1558302588130, "rating": 5.0, "text": "Outstanding job! Happiest my wife has ever been with a lawn care service. Happy wife! Quality service by Tahj, a fellow veteran, at an extraordinarily affordable price   I will recommend them to everyone that I know.", "pics": null, "resp": {"time": 1561740208295, "text": "Excellent we are happy to hear this!\n\n-Jacob"}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "112759270252181360888", "name": "Alexander Waltenbaugh", "time": 1580412351214, "rating": 5.0, "text": "Jacob and his team are always professional, polite, and trustworthy when it comes to any job. You know they will do the best job the first time!", "pics": null, "resp": {"time": 1580431895414, "text": "Alex,\nThank you Sir for your 5 star review and feedback about our team. Mostly,  thank you for your continued service to our country!"}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "101326638714054235525", "name": "SkinWalkerz Entertainment", "time": 1589309648099, "rating": 5.0, "text": "Great service and very helpful with me never used a service before and they helped me out", "pics": null, "resp": {"time": 1589832264084, "text": "Thank you for your 5 Star Review!! I am glad that we were able to help you out and you had a great experience with our team!"}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "115296138206726083093", "name": "Vicky Kloock", "time": 1567302723266, "rating": 5.0, "text": "Excellent work, on time, on schedule and within budget!  Very professional staff to work with!  This company exceeded our expectations.  Highly recommend Veteran’s Lawn Care and Landscaping!", "pics": null, "resp": {"time": 1567305850899, "text": "Thank you, it was a privilege to serve at His house!!"}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "105832781597164688221", "name": "Scott B", "time": 1567715765623, "rating": 1.0, "text": "They were supposed to show between 1pm and 3pm. My spouse put off what she was doing because this is the time they specified. They no-showed. When my wife called for an explanation, the lady told her that she will get a call back with an explanation. Don't bother, because there isn't an explanation for no-showing and not calling.\n\nWill stick with who we have been with.", "pics": null, "resp": {"time": 1570857445957, "text": "Sir, I apologize that you were not contacted about us not being able to show up for an estimate at the scheduled time. We strive to be on time and I understand your frustration due to the lack of communication."}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "118396478160522706614", "name": "Jacob Henson", "time": 1580438238041, "rating": 5.0, "text": "Very professional and knowledgeable. I would recommend this company with confidence.", "pics": null, "resp": {"time": 1580444833210, "text": "Thanks Jake! I really appreciate you taking the time, especially with your extraordinary travel agenda, to leave us a  review!"}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "112276665219406545129", "name": "John Phillips", "time": 1586535171095, "rating": 5.0, "text": "Ellis did a phenomenal job. Will be using them again.", "pics": null, "resp": {"time": 1589832615099, "text": "Mr. Phillips, we appreciate your review and I am glad we were able to provide you with an exceptional job!"}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "110793106460157605142", "name": "Paul Scott", "time": 1561579579930, "rating": 2.0, "text": "1) Guy who answered my initial call didn’t realize he’d already answered, and I heard him angrily cursing yet another phone call before he greeted me.\n2) Hired this company for a bi-weekly service. Said they did my area on Friday only, and they didn’t do make-ups for rain. Ok, cool.\n3) They never showed. First Friday, no rain, no mow. Second Friday, no rain, no mow. They didn’t get a third Friday.\n4) Gave 2 stars for being vet owned", "pics": null, "resp": {"time": 1561740181198, "text": "Mr. Scott,\n\nI am unsure if you have the correct company. I checked our system and cannot find your name. There is other companies with a deceiving similar name as ours in Huntsville. We also have designated days for rain makeups as well. If you could please give us a call and we can discuss any issues you may have.\n\nThank you sir!\n\nJacob Leavitt\nOwner, Veteran's Lawn Care & Landscaping\nOffice: 256-812-9029"}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "109071664838984699218", "name": "Chris Nimmo", "time": 1573227619908, "rating": 5.0, "text": "Just bought a new home in Athens and needed help getting the landscaping and yard squared away. Called a few of the top rated companies on google and could not get a call back. Then Tahj and Pedro rolled by the house one day and handed me a pamphlet. I called them up and Mike responded quickly. Amanda at the office made the scheduling and transaction a breeze. Tahj and Dan started work promptly the day of the project and hammered out most of the clean out before lunch. After lunch Eric and Pedro joined the team and the entire crew finished the job. In 10 hours they had completely cleaned out and dug-up/removed the weeds and 12 over grown bushes from the front, back, and side beds, removed 5 stumps, cleaned out an over grown play area and had taken out 2 dying trees. By night fall, they had the yard mulched and ready for phase 2 - replanting in the spring. The following morning Tahj dropped by to mow the grass and edge the entire property, just as he had promised. You can tell Tahj gave a damn, and treated the place like his own. Eric brought the knowledge and had no problem answering my questions about plants and things while they worked. Pedro kept them honest, while Dan provided the laughs. As a veteran I appreciated that from all the guys. The price was fair for the work performed and worth every penny to us. Thank you guys for your service and for the service. Look forward to the next few phases in the coming months.", "pics": null, "resp": {"time": 1573819430173, "text": "Mr. Nimmo, thank you so much for this review! I appreciate you taking the time to go into detail how hard our teams work in the field and in operations. These guys deserve the recognition and our customers deserve the best service possible! Thank you for your military service and sacrifice! We are happy to have another awesome customer to provide services to.\n-Jacob Leavitt"}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "100297418159430812442", "name": "Shane Keirns", "time": 1573430518592, "rating": 4.0, "text": "Management is very easy to work with. They were quick to fix billing errors.", "pics": null, "resp": {"time": 1573818795300, "text": "Thank you for your review!"}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "112321633114611224196", "name": "Dark Alpha", "time": 1555732610043, "rating": 5.0, "text": "They have always been on time and overall reliable. The staff are courteous and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "109328523963336163459", "name": "Laurel Brown", "time": 1553861794083, "rating": 5.0, "text": "They responded quickly and professionally and were very reasonably priced. Tahj did an excellent job!", "pics": null, "resp": {"time": 1554117116873, "text": "Thank you for your review! I will make sure and tell the team!"}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "105008919257958608221", "name": "Joan Sargent", "time": 1556065368512, "rating": 5.0, "text": "I am very pleased with the services provided by Tahj from Veterans Lawn Care.  VLC can provide you with all your landscaping needs.", "pics": null, "resp": null, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "112847294841685114589", "name": "troy adams", "time": 1563716292967, "rating": 5.0, "text": "Did a great job. Came when they said they would.", "pics": null, "resp": {"time": 1565039174543, "text": "Thank you Mr. Adams!"}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "114955518907624932447", "name": "Zac Snodgrass", "time": 1537637056256, "rating": 5.0, "text": "Jacob and his team have done great work for us over the past couple years, highly recommend them.", "pics": null, "resp": {"time": 1573819651349, "text": "Mr. Snodgrass, thank you for this review! You have been an extraordinary customer and we appreciate all the referrals you have given us!!"}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "113317724257043131942", "name": "Derek Page", "time": 1532482523116, "rating": 5.0, "text": "Been with them 2 years or so. Great people, reliable service, excellent prices.", "pics": null, "resp": null, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "115389504073229900952", "name": "Erik Schmidt", "time": 1588778395294, "rating": 5.0, "text": "Great job by Ellis!", "pics": null, "resp": {"time": 1589832298155, "text": "Mr. Schmidt,  thank you for your review on our lawn care team. We look forward to your landscape project!"}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
{"user_id": "116311624459009490926", "name": "Stephen Youngblood", "time": 1582904601037, "rating": 4.0, "text": "Great customer service.", "pics": null, "resp": {"time": 1583415622037, "text": "Thank you for your review Mr. Youngblood!"}, "gmap_id": "0x88621b1d4c91108f:0xa50eafa3565cfd19"}
