{"user_id": "100149093868039476473", "name": "Leslie Marbutt", "time": 1593796050366, "rating": 5.0, "text": "BY FAR THE VERY BEST SALON/SPA EXPERIENCE I HAVE EVER HAD  THE STAFF IS EXTRA PROFESSIONAL, QUALITY SERVICE. .....WOULD RECOMMEND THIS BUSINESS  TO EVERYONE!! I WILL NOT GO ANYWHERE ELSE..BIG HUGE SHOUT OUT TO KRYSTAL AND ANGEL FOR YOUR EXCELLENCE!!! THANK YOU FOR A WONDERFUL DAY", "pics": null, "resp": null, "gmap_id": "0x887d49e3c2bfe3a7:0xee57c2a70eaddae9"}
{"user_id": "103538771520420632248", "name": "Chase West", "time": 1494902677218, "rating": 5.0, "text": "This is my go to spa! The massages really help me with any pains due to my high paced lifestyle. Also after getting some facials and their in house skin care products, my skin is the best it's been. I was having trouble with acne and they were able to help me finally get ahold of it. It's virtually gone!! The staff is always super nice and helpful, not to mention the environment is very relaxing!", "pics": null, "resp": null, "gmap_id": "0x887d49e3c2bfe3a7:0xee57c2a70eaddae9"}
{"user_id": "108437739005440958198", "name": "D. R. Hamner", "time": 1515516983723, "rating": 5.0, "text": "A wonderful place for a massage. I had a deep tissue massage by Dannon. He is very knowledgeable and professional. I highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x887d49e3c2bfe3a7:0xee57c2a70eaddae9"}
{"user_id": "109545951932240443072", "name": "Selena Daniel", "time": 1522529297049, "rating": 5.0, "text": "Can’t wait to return.", "pics": null, "resp": null, "gmap_id": "0x887d49e3c2bfe3a7:0xee57c2a70eaddae9"}
{"user_id": "106380987254871314644", "name": "ANaiya King", "time": 1478013815317, "rating": 5.0, "text": "It's like taking a nap on a cloud with candy falling from the sky", "pics": null, "resp": null, "gmap_id": "0x887d49e3c2bfe3a7:0xee57c2a70eaddae9"}
{"user_id": "109118613541331015981", "name": "Kathy Scott", "time": 1571857595075, "rating": 5.0, "text": "Lisa is great! Went for the first time last year just for a relaxation massage. Fast forward a year later and I have somehow hurt my lower back. I’ve been in quite a lot of pain. First person I thought of was Lisa. She was wonderful. She helped ease my muscle tightness while also being gentle enough not to exacerbate the issue. I trust her. She knows what she’s doing. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8889220a98b2305b:0x5d29045757dddaeb"}
{"user_id": "117693757154851128612", "name": "Laurie Goode", "time": 1570288930320, "rating": 5.0, "text": "Relax -therapeutic massage lives up to its name! A massage every two weeks has greatly reduced the stress & tension in my shoulders and neck. Faithful client for 4 years now! I was not one to take time for myself but with chronic pain I was convinced by my husband and a client of Relax to give massage a try. Now I can not live without them. I have learned that this is a way to take better care of myself. I highly recommend Relax and that you book your first appointment. I am so thankful I did! -Laurie", "pics": null, "resp": null, "gmap_id": "0x8889220a98b2305b:0x5d29045757dddaeb"}
{"user_id": "112490328747594550729", "name": "Cathy Carver", "time": 1386445025010, "rating": 5.0, "text": "I have been using Relax for years.  Lisa has given me massages off and on and specifically through both of my pregnancies and it helped tremendously.  She runs an honest business and works hard.  I am a physical therapist and I know her techniques are skilled.  She gets to know your body and how you respond and gives the massage accordingly.  She wants to know what is too hard or not hard enough.  I think her prices are reasonable.  The facility is simple which is what I like.  If you want a Spa experience, you can pay for that somewhere else.  I just like a good massage and then go about my business.  The staff is nice and kind and they seem like family to each other.  If I have to leave a message she always calls back as soon as she can and has reasonable options for appointments.  I highly recommend Relax!", "pics": null, "resp": null, "gmap_id": "0x8889220a98b2305b:0x5d29045757dddaeb"}
{"user_id": "115526624815826877897", "name": "Amanda H Johnigan", "time": 1490906346627, "rating": 5.0, "text": "LOVE LOVE LOVE this place and the people for 10 years now.  I buy their massage packages which are reasonably priced.  The staff is always so nice and friendly on the phone and they know me by name.  I have referred several friends to them and would recommend anyone to try them out.  It's NOT a chain and that is what I love about RELAX.  Lisa, the owner, is my therapist and has been for years.  If Lisa is on vacation, which is rare, I would not and do not hesitate to use any of the other therapists who are equally qualified.  You won't be disappointed.", "pics": null, "resp": null, "gmap_id": "0x8889220a98b2305b:0x5d29045757dddaeb"}
{"user_id": "110148521600571453744", "name": "russell haddock", "time": 1507919041028, "rating": 5.0, "text": "I would highly recommend Relax Therapeutic Massage. I have been a client for 18 months and they are just great people and great at their job, relaxing you ! You are always met with a warm (genuine) smile, and they are not just the best in town but very reasonably priced. Do yourself and go see them once and you will see what I mean !", "pics": null, "resp": null, "gmap_id": "0x8889220a98b2305b:0x5d29045757dddaeb"}
{"user_id": "112186283113365953258", "name": "Vera Sheffer", "time": 1546642796609, "rating": 5.0, "text": "I was highly pleased with the service and message at Relax Therapeutic Massage. The atmosphere was relaxing and pleasant and I felt very comfortable on the message table. I will definitely be back.", "pics": null, "resp": null, "gmap_id": "0x8889220a98b2305b:0x5d29045757dddaeb"}
{"user_id": "114733385240025502460", "name": "Tim Garmon", "time": 1557252401081, "rating": 5.0, "text": "I highly recommend Relax Therapeutic Massage. I have had 1000’s of massages around the world and Olivia is the best-BY FAR!", "pics": null, "resp": null, "gmap_id": "0x8889220a98b2305b:0x5d29045757dddaeb"}
{"user_id": "110992848389903426711", "name": "Bill Ringler", "time": 1539987284215, "rating": 5.0, "text": "Lisa and Amber are a great team!  Relax is a special place.  Highly recommend the massages that really do “relax” their clients.", "pics": null, "resp": null, "gmap_id": "0x8889220a98b2305b:0x5d29045757dddaeb"}
{"user_id": "104046221750214996308", "name": "Cindy Pratt", "time": 1491669419588, "rating": 5.0, "text": "I have been a client at Relax Therapeutic Massage for 10 years.  I have been dealing with arthritis in my neck and knees, an occasional bout of bursitis, and general muscle tightness, through the years.  My goal is to alleviate the pain, without resorting to pain meds or surgery.  Thanks to my bimonthly massages at Relax Therapeutic Massage,  I have been able to accomplish that goal.  I am a very pleased client!", "pics": null, "resp": null, "gmap_id": "0x8889220a98b2305b:0x5d29045757dddaeb"}
{"user_id": "106559548650221078615", "name": "Vickie Garner", "time": 1554561347240, "rating": 5.0, "text": "Excellent therapeutic massage. Helped lower back issues tremendously", "pics": null, "resp": null, "gmap_id": "0x8889220a98b2305b:0x5d29045757dddaeb"}
{"user_id": "117223461865425332178", "name": "Lyman Eric Perrine", "time": 1369354676535, "rating": 5.0, "text": "I recently got out of the military and had back problems. Relax really helped with my back pain. I still continue to use their services today. They are very skillful in their trade. I would highly recommend them to my friends or family.", "pics": null, "resp": null, "gmap_id": "0x8889220a98b2305b:0x5d29045757dddaeb"}
{"user_id": "112076250604959269513", "name": "Ashley Cordwell Medeiros", "time": 1478363138730, "rating": 1.0, "text": "There was a wreck that was out of my control n messed the traffic all up for me and mind you I WAS DRIVING AN HOUR AND A HALF AWAY And unfortunately I had to reschedule and I called to tell them and they were really rude and basically hung up on me what happened to customer service I WILL BE FIND SOMEWHERE ELS when I decide to go somewhere!!! 😡😡😡", "pics": null, "resp": null, "gmap_id": "0x8889220a98b2305b:0x5d29045757dddaeb"}
{"user_id": "102210213707445199242", "name": "Trisha Crain", "time": 1386804880986, "rating": 5.0, "text": "I have a neurological condition, cervical dystonia, which causes severe pain in my neck and shoulder area. I was diagnosed in 2004, and found Relax Therapeutic Massage in 2005. I have been a regular and faithful client for more than 8 years. Lisa has a gift for knowing how to release the pain generated by my dystonia. Many people suffer with chronic pain due to dystonia, but regular massage has kept my pain under control without the need for pharmaceutical pain relievers. I am extremely thankful to have found Relax Therapeutic Massage.", "pics": null, "resp": null, "gmap_id": "0x8889220a98b2305b:0x5d29045757dddaeb"}
