{"user_id": "117974620641627773910", "name": "Brian Lucas", "time": 1614194145658, "rating": 5.0, "text": "Best massage in town. The rooms are clean, they pay attention to you and really give a great massage. The girls there are legit and really know their craft. A+ . I would not visit another massage store in Huntsville after going here.", "pics": null, "resp": null, "gmap_id": "0x88626dc1290dea1b:0x519e500c7fbcfa51"}
{"user_id": "115057966642181500019", "name": "Hope G", "time": 1616607233168, "rating": 5.0, "text": "I got a massage today by Michelle I think her name was. She was so polite and friendly. She also made me feel extremely comfortable and the massage was amazing. I will absolutely be going there again.", "pics": null, "resp": null, "gmap_id": "0x88626dc1290dea1b:0x519e500c7fbcfa51"}
{"user_id": "115740771970887874113", "name": "Mr Ken", "time": 1613506595874, "rating": 5.0, "text": "I visited Massage Shang after reading their reviews. I must say i wasn't disappointed. One of the best massage i have ever had. Lily is good and professional. I would recommend her!", "pics": null, "resp": null, "gmap_id": "0x88626dc1290dea1b:0x519e500c7fbcfa51"}
{"user_id": "115809871685816633950", "name": "joel lightner", "time": 1614129530048, "rating": 5.0, "text": "My first ever full body massage did not disappoint! Excellent prices, super friendly staff, and left feeling like a million bucks.", "pics": null, "resp": null, "gmap_id": "0x88626dc1290dea1b:0x519e500c7fbcfa51"}
{"user_id": "113883741307465607053", "name": "Almosta Farm", "time": 1613198894736, "rating": 5.0, "text": "This is our first couples body massage. They made us feel very comfortable, and accommodated us however we needed. Loved it!", "pics": null, "resp": null, "gmap_id": "0x88626dc1290dea1b:0x519e500c7fbcfa51"}
{"user_id": "105247563307918262792", "name": "Adrian Abshire", "time": 1599256619004, "rating": 5.0, "text": "My visit was excellent - the masseuse was very good and friendly. She helped with all the sore spots and did not rush.  I feel great and reinvigorated.  The waiting room is nice and the rooms are clean and very comfortable.  Will recommend to my family and friends.", "pics": null, "resp": null, "gmap_id": "0x88626dc1290dea1b:0x519e500c7fbcfa51"}
{"user_id": "106786700266167435693", "name": "Mike Morris", "time": 1615486443549, "rating": 5.0, "text": "Great massage! Very professional at what they do and an extremely clean environment.", "pics": null, "resp": null, "gmap_id": "0x88626dc1290dea1b:0x519e500c7fbcfa51"}
{"user_id": "113587920983634474612", "name": "Phyllis Gibbs", "time": 1621171149264, "rating": 5.0, "text": "Was not impressed at all !!!! After you pay for your message they try to tell you how much to tip!!! Some of the things they said was very inappropriate!!! I will not go back there!!!!!!", "pics": null, "resp": null, "gmap_id": "0x88626dc1290dea1b:0x519e500c7fbcfa51"}
{"user_id": "117855170616509103953", "name": "Curt Bevington", "time": 1575113096697, "rating": 5.0, "text": "Outstanding!  Service, professionalism, atmosphere and price are great but the staff, Michelle, Heidi and Mia make this my go-to place to fix the knots whether from work, traveling or just sitting on the couch too much. The quality is top notch and compared to most, they rank at the top of a long list of providers. I've walked in without appointment and called ahead and always the same great service. You will not be disappointed with Shàng or the Ladies who will leave you relaxed and revitalized. My thanks Ladies and I'll see you again soon.", "pics": null, "resp": null, "gmap_id": "0x88626dc1290dea1b:0x519e500c7fbcfa51"}
{"user_id": "117575393912148835488", "name": "Tanveer Zia", "time": 1569034099427, "rating": 5.0, "text": "Amazing service every time, very professional staff, clean and tidy spa. Went for a couples massage twice now, once foot massage and once table massage. Heidi is amazing (wife’s favorite) and Mia is awesome too. You cannot go wrong at Massage Shàng!", "pics": null, "resp": null, "gmap_id": "0x88626dc1290dea1b:0x519e500c7fbcfa51"}
{"user_id": "108299688051520384962", "name": "MARGARET PENNY PTERNITIS", "time": 1569097311640, "rating": 5.0, "text": "I went because I had purchased a Groupon for a 60 minute foot massage. Place is nice and clean. Michelle is AMAZING! I have diabetes and she made my feet feel so much better. Cannot say enough good things about them, will be back soon!", "pics": null, "resp": null, "gmap_id": "0x88626dc1290dea1b:0x519e500c7fbcfa51"}
{"user_id": "102915381430925080577", "name": "S A", "time": 1569034282640, "rating": 5.0, "text": "The BEST and only massage spa I will go to in Huntsville Madison area. Nicest sweetest ladies work here, I always have a good time and feel like a new person walking out of Massage Shàng. They take care of you like real friends ❤️", "pics": null, "resp": null, "gmap_id": "0x88626dc1290dea1b:0x519e500c7fbcfa51"}
{"user_id": "104204199297402360674", "name": "Mike Williams", "time": 1567832917495, "rating": 5.0, "text": "Amazing massage therapy by Mia. Nice, friendly and very professional. She has the gentle hands of a delicate woman but the strength of a strong man. Can cater to any level of intensity. Would definitely go back again.", "pics": null, "resp": null, "gmap_id": "0x88626dc1290dea1b:0x519e500c7fbcfa51"}
{"user_id": "118358740373707670474", "name": "Scott G.", "time": 1583202431874, "rating": 5.0, "text": "Tried Massage Shang for the first time and have to say the massage I was received was outstanding.  Very clean and friendly establishment.  Prices are also unbelievably low over commercial massage establishments.  I will definitely be a repeat customer.", "pics": null, "resp": null, "gmap_id": "0x88626dc1290dea1b:0x519e500c7fbcfa51"}
{"user_id": "115402509376350526396", "name": "Aaron Hansen", "time": 1604173458008, "rating": 5.0, "text": "Very good massage, will be back", "pics": null, "resp": null, "gmap_id": "0x88626dc1290dea1b:0x519e500c7fbcfa51"}
{"user_id": "104489429952590012969", "name": "Dewane Mills", "time": 1583362456582, "rating": 4.0, "text": "Michelle is very nice !", "pics": null, "resp": null, "gmap_id": "0x88626dc1290dea1b:0x519e500c7fbcfa51"}
{"user_id": "101300367101481845144", "name": "Terry Cella", "time": 1619803616454, "rating": 1.0, "text": "Still waiting on a refund for a purchase I was drastically overcharged for. They wouldn't even sell me the actual product I wanted but charged me full price for a discounted similar item. At the current time I wouldn't even give 1 star but that's the lowest I can go. I was told by the staff I would receive a call Monday they took down a copy of my ID, name, and phone number still no calls.", "pics": null, "resp": {"time": 1619802880209, "text": "If you could provide more specifics about your purchase or come in to the store Monday - Friday 9AM - 5PM we would be happy to help resolve your issue. I am not understanding exactly what you are referring to with this comment."}, "gmap_id": "0x888e8689f23c902d:0x857b246eacd075cc"}
{"user_id": "105784267234566150029", "name": "Samantha Napoleon", "time": 1613319498361, "rating": 5.0, "text": "Very nice and clean. Seller was very funny and informative.", "pics": null, "resp": {"time": 1613495983242, "text": "Thank you for the 5 star review Samantha! We're glad you had a good experience at the store."}, "gmap_id": "0x888e8689f23c902d:0x857b246eacd075cc"}
{"user_id": "110527869020298682679", "name": "Ferris Thomas", "time": 1591871363562, "rating": 5.0, "text": "Great selection and prices, great staff that are always willing to help find what you need. Been shopping here for years and love this place!", "pics": null, "resp": {"time": 1591975796536, "text": "Thanks for the feedback and continued support Ferris. Let us know if we can do  anything to make to your shopping experience even better."}, "gmap_id": "0x888e8689f23c902d:0x857b246eacd075cc"}
{"user_id": "115434529722794569904", "name": "Julie Green", "time": 1615408011623, "rating": 5.0, "text": "A life saver for a single woman!", "pics": null, "resp": {"time": 1615409684730, "text": "Glad we could help. Thank you for shopping with us and for taking the time to leave a review!"}, "gmap_id": "0x888e8689f23c902d:0x857b246eacd075cc"}
{"user_id": "114109171865203456374", "name": "nikki thomas", "time": 1588996567795, "rating": 5.0, "text": "I went in there today me and my homegirl and we both purchase the pillow talk. The workers there was very knowledgeable and helpful. This was my very 1st time there and she lead me to a great toy ! Thanks ladies...", "pics": null, "resp": {"time": 1589299495098, "text": "We're glad you had a good experience at the store nikki. Thank you so much for the feedback. If there is anything we can do in the future to improve your experience don't hesitate to let us know."}, "gmap_id": "0x888e8689f23c902d:0x857b246eacd075cc"}
{"user_id": "106407991812143851713", "name": "Meemaw Brown", "time": 1597812166380, "rating": 1.0, "text": "Staff member forced me and my lady to wear masks, believe her name was MJ , while not wearing hers or making other customers wear a mask. I was told I wasn't going to be allowed to enter without mask yet the employee herself wasn't wearing hers nor were other customers forced as we were. Hypocrisy at its finest.", "pics": null, "resp": {"time": 1597842578351, "text": "Meemaw, we sincerely apologies for this incident. Our policy is to follow current government mandates and require that everyone in the store wears masks. If staff was not complying and enforcing this policy selectively we will be sure to look into it and make the necessary changes. I can assure you this will not happen again. Once again I'm sorry for your experience and thank you for the feedback, we hope you will give us another chance."}, "gmap_id": "0x888e8689f23c902d:0x857b246eacd075cc"}
{"user_id": "107059967802105596096", "name": "Tionya Jones", "time": 1563958374010, "rating": 5.0, "text": "I absolutely love this store. It has everything I need and the employees were super helpful! I will definitely be returning for another sale.", "pics": null, "resp": {"time": 1563975184665, "text": "Thank you Tionya; for taking the time to leave a review and the continued support. If there is anything more we can do for you be sure to let us know on your next visit. You are welcome back anytime, we are open 24/7!"}, "gmap_id": "0x888e8689f23c902d:0x857b246eacd075cc"}
{"user_id": "106966171133654240371", "name": "Julianne Nance", "time": 1560508745990, "rating": 5.0, "text": "Prices are cheap in comparison to the surrounding areas. The staff is always there to help. Very clean always. I've never felt uncomfortable going in this store because everyone is super friendly and the staff is really knowledgeable about their products. Will be returning and if you're reading this review you should go check it out.", "pics": null, "resp": null, "gmap_id": "0x888e8689f23c902d:0x857b246eacd075cc"}
{"user_id": "102739787443267890100", "name": "Sam Scruggs", "time": 1560524458175, "rating": 4.0, "text": "Great place.  I didn't feel judged while there, which is more than I can say for some places. Wonderful selection too.", "pics": null, "resp": null, "gmap_id": "0x888e8689f23c902d:0x857b246eacd075cc"}
{"user_id": "100999063402389561934", "name": "Melissa Carter", "time": 1572435295968, "rating": 1.0, "text": "OMG. I went to this store with one goal, a new toy that was blue tooth and would work with my music. Only problem, the clerk was not knowledgeable about the product or was just trying to make a sell. I purchased the Jive by We-Vibe. Not a bad product but the wrong product. So if they tell you this particular product works with your music, LIES. I paid $160 for it and you can get it on the We-Vibe site for $120, bc it doesn’t work with music. And of course you can’t return it. I think I deserve to have what I asked the clerk for.", "pics": null, "resp": null, "gmap_id": "0x888e8689f23c902d:0x857b246eacd075cc"}
{"user_id": "113446010191781592000", "name": "Kasey hall", "time": 1560464822589, "rating": 5.0, "text": "Wonderful selection, very clean and inviting. The staff are friendly and personable. Overall amazing experience. Will be back!!!", "pics": null, "resp": {"time": 1560525041925, "text": "Thanks for leaving a review Kasey! you are welcome back anytime, we are open 24/7!"}, "gmap_id": "0x888e8689f23c902d:0x857b246eacd075cc"}
{"user_id": "102446431137522953021", "name": "Carissa Jean", "time": 1485022563004, "rating": 5.0, "text": "My husband just took me to this store last night. They have a great variety of items and the store is very clean and well kept. The people there are nice, open, and willing to answer any questions you have about any of their products.\n\nI myself was looking for a natural lubrication because my skin is sensitive and most natural selections are sticky and you don't have many options, they had a good amount of options to pick from in the natural lubrication section and even asked a few questions that would help them find exactly what I was looking for.\n\nI definitely plan on purchasing from x-mart again because of this experience.", "pics": null, "resp": null, "gmap_id": "0x888e8689f23c902d:0x857b246eacd075cc"}
{"user_id": "112994557156180389779", "name": "TheHamburgier", "time": 1560620385304, "rating": 5.0, "text": "I'm usually nervous when shopping by myself but Nikki made my entire experience so comfortable and fun! I lover her, She's the best!!", "pics": null, "resp": {"time": 1560790061040, "text": "Thank you for leaving a review Zurishiax14. We're glad you had a good experience at the store; We train all our staff to be as accommodating as possible. If you are ever nervous or have any questions whatsoever please be sure to let our clerks know. Once again thanks for the feedback and come back anytime, we are open 24/7!"}, "gmap_id": "0x888e8689f23c902d:0x857b246eacd075cc"}
{"user_id": "115035334532700226748", "name": "Rik Henry", "time": 1560465248476, "rating": 5.0, "text": "I loved how helpful and knowledgeable the staff was and the prices were reasonable too.\n\nSpecial shoutout to the cute goth \"9-N\"", "pics": null, "resp": {"time": 1560525005200, "text": "Rik, we're glad you had a good experience at the store. We train our staff with as much product knowledge as possible. You are welcome back anytime, we are open 24/7!"}, "gmap_id": "0x888e8689f23c902d:0x857b246eacd075cc"}
{"user_id": "110648235980868930324", "name": "Tangela Broaden", "time": 1560544461171, "rating": 5.0, "text": "Great staff. Excellent customer service 😉 and the availability is awesome", "pics": null, "resp": {"time": 1560792186793, "text": "Thanks for leaving a review Tangela. We're glad you had a positive experience at the store. Come back any time, we are open 24/7!"}, "gmap_id": "0x888e8689f23c902d:0x857b246eacd075cc"}
{"user_id": "112483904889716316167", "name": "A D", "time": 1560489702813, "rating": 5.0, "text": "Super clean and impressive selection. Very knowledgeable staff and a great location right on Birmingham Highway!", "pics": null, "resp": {"time": 1560520853333, "text": "Thanks for the positive feedback Amber! We are open 24/7 for whenever you want to come back!"}, "gmap_id": "0x888e8689f23c902d:0x857b246eacd075cc"}
{"user_id": "113220256825782786292", "name": "Robert May", "time": 1560480574891, "rating": 5.0, "text": "Staff is always friendly, helpful, and knowledgeable. Clean organized store and I always leave satisfied A++ winning", "pics": null, "resp": {"time": 1560521491153, "text": "Robert, thank you for the kind words. Our goal is to make sure all customers leave with the same satisfaction. If there's anything we can improve on further, please let us know. You are welcome back anytime, we are open 24/7 for your convenience!"}, "gmap_id": "0x888e8689f23c902d:0x857b246eacd075cc"}
{"user_id": "106795813543704533597", "name": "Autumn Cannon", "time": 1560463334734, "rating": 5.0, "text": "Great product selection.  Clean store.  Friendly staff.  Love the 24/7 hours .", "pics": null, "resp": {"time": 1560525705981, "text": "Thanks for the positive feedback Autumn, and that's right we are open 24/7 so come back any time!"}, "gmap_id": "0x888e8689f23c902d:0x857b246eacd075cc"}
{"user_id": "111570418337331482874", "name": "Shanae Williams", "time": 1564121073772, "rating": 5.0, "text": "Great Atmosphere...Everyone Is Very Helpful And Informative 🥰", "pics": null, "resp": {"time": 1564154392830, "text": "Thank you Shanae! We train our staff to be as helpful and accommodating as possible. Our staff is also constantly studying our products and receiving training on product knowledge to make sure we can help you find exactly what you need. Thanks again for the feedback and you are welcome back anytime, we are open 24/7!"}, "gmap_id": "0x888e8689f23c902d:0x857b246eacd075cc"}
{"user_id": "109953673269027224998", "name": "Fairy Sex Mutha", "time": 1560975572047, "rating": 5.0, "text": "Need ideas for an awesome sex party? Come to X Mart.", "pics": null, "resp": {"time": 1561046162924, "text": "Definitely! We have products of all kinds for parties, couples, and solo-use too. Thank you for taking your time to leave a review and please come back anytime, we are open 24/7!"}, "gmap_id": "0x888e8689f23c902d:0x857b246eacd075cc"}
{"user_id": "116784757807157281190", "name": "Zac “zactheawesome” woods", "time": 1560579329498, "rating": 5.0, "text": "Very clean and private. Huge selection of just about everything and the staff is super helpful.", "pics": null, "resp": {"time": 1560790166099, "text": "Thanks for leaving a review Zac. We're glad you enjoyed your visit at the store. If there is anything else you think we can improve on be sure to let us know and we'll try and work on it."}, "gmap_id": "0x888e8689f23c902d:0x857b246eacd075cc"}
{"user_id": "104705383072597544613", "name": "Baltazar C. Balthazar", "time": 1516426312875, "rating": 5.0, "text": "Very clean and professional. The one named \"Neko\" I believe was very courteous and helpful with information.\nThe store was clean. Friendly staff. Definitely will be back.", "pics": null, "resp": null, "gmap_id": "0x888e8689f23c902d:0x857b246eacd075cc"}
{"user_id": "117307894676922482362", "name": "Samantha Coley", "time": 1459754529054, "rating": 5.0, "text": "I love this store, great items, different and latest varieties. I was looking for a particular item and they didn't have it so they specially ordered it for me at no cost, took my number, and call when it arrives. They are also open 24/7!!!", "pics": null, "resp": null, "gmap_id": "0x888e8689f23c902d:0x857b246eacd075cc"}
{"user_id": "101559649614013171037", "name": "Samantha Herrington", "time": 1560487900437, "rating": 5.0, "text": "Awesome place and even nicer people!", "pics": null, "resp": {"time": 1560521059680, "text": "Thank you world, we train our staff to be as accommodating as possible. You are welcome back anytime, we are open 24/7!"}, "gmap_id": "0x888e8689f23c902d:0x857b246eacd075cc"}
{"user_id": "105969093245647579217", "name": "Buddy", "time": 1527581404749, "rating": 5.0, "text": "Neko was very helpful and nice\nNot to mention beautiful", "pics": null, "resp": {"time": 1529524675187, "text": "Glad you had a good experience at the store Frankie. But remember it’s what’s on the inside that matters, like great customer service!"}, "gmap_id": "0x888e8689f23c902d:0x857b246eacd075cc"}
{"user_id": "101211448664283649784", "name": "Virginia Terry", "time": 1588757586513, "rating": 5.0, "text": "A great store", "pics": null, "resp": {"time": 1588772585964, "text": "Thank you for the feedback Virginia. We are pleased you had a good experience at the store and hope to see you back soon. Thank you."}, "gmap_id": "0x888e8689f23c902d:0x857b246eacd075cc"}
{"user_id": "115271725856916511622", "name": "Ashley Burnette", "time": 1560469111267, "rating": 5.0, "text": "Friendly and helpful workers!", "pics": null, "resp": {"time": 1560524529199, "text": "Thanks for leaving a review Ashley. We train all staff to be as accommodating as possible. Please come back any time, we are open 24/7!"}, "gmap_id": "0x888e8689f23c902d:0x857b246eacd075cc"}
{"user_id": "116015824214065071216", "name": "Martie Stafford", "time": 1560467410679, "rating": 5.0, "text": "Very helpful staff!", "pics": null, "resp": {"time": 1560524709539, "text": "Glad we could help you find what you needed! Thanks for coming in, and leaving a review; you are welcome back any time, we are open 24/7!"}, "gmap_id": "0x888e8689f23c902d:0x857b246eacd075cc"}
{"user_id": "103052252290900527433", "name": "Samantha Hancock", "time": 1560464494455, "rating": 5.0, "text": "Excellent staff!", "pics": null, "resp": {"time": 1560525083987, "text": "Glad we could be of service! Thanks for the review and please come back anytime, we are open 24/7!"}, "gmap_id": "0x888e8689f23c902d:0x857b246eacd075cc"}
{"user_id": "108541047512603573241", "name": "Spamthulhu", "time": 1560483585418, "rating": 5.0, "text": "Amazing stock", "pics": null, "resp": {"time": 1560521371838, "text": "Glad you like our selection Spamthulhu; If there's ever something you want that you cant find, just let us know and we'll place an order for you. Special orders like this usually arrive that same week!"}, "gmap_id": "0x888e8689f23c902d:0x857b246eacd075cc"}
{"user_id": "114070785461215048936", "name": "Emily Maxwell", "time": 1494347515735, "rating": 5.0, "text": "Experienced staff and huge inventory.", "pics": null, "resp": null, "gmap_id": "0x888e8689f23c902d:0x857b246eacd075cc"}
{"user_id": "117475531347166728868", "name": "Maria Quenga", "time": 1490484975051, "rating": 5.0, "text": "Been to see store awesome items.", "pics": null, "resp": null, "gmap_id": "0x888e8689f23c902d:0x857b246eacd075cc"}
{"user_id": "108686551911143498319", "name": "Morticians Puppet", "time": 1560463260063, "rating": 5.0, "text": "Place is amazing!", "pics": null, "resp": {"time": 1560525750041, "text": "Thank you! Come back anytime, we are open 24/7!"}, "gmap_id": "0x888e8689f23c902d:0x857b246eacd075cc"}
{"user_id": "104471778299103579630", "name": "Chris Middlebrooks", "time": 1544676072889, "rating": 1.0, "text": "Worst service ever, they are rude and don’t care if you have an issue with one of their products.", "pics": null, "resp": {"time": 1544711095040, "text": "Hi Chris, Thanks for your feedback; if you could specify a little more when you visited we'd be glad to look into the service you were given and make necessary adjustments. I can assure you though, we train all staff to be as friendly and accommodating at possible. We also check all products before sale and will not sell it if there is an issue. Once again thank you for leaving a review and please visit us again, we are open 24/7!"}, "gmap_id": "0x888e8689f23c902d:0x857b246eacd075cc"}
{"user_id": "113139162735607711198", "name": "jai abercrombie", "time": 1487687445260, "rating": 5.0, "text": "always happy and knowledgable", "pics": null, "resp": null, "gmap_id": "0x888e8689f23c902d:0x857b246eacd075cc"}
