{"user_id": "108346923478261534226", "name": "David Pham", "time": 1610490016665, "rating": 4.0, "text": "Good", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMxl4hr7EKfV6E-TJJxZnyP_0m3SawaRhxwYjOF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOWAWskt-PwOIwDMMHaEPv8PdOb1ZY1pVBbMhkt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNqrpaAdq_h3yD6eyLljU8WgNnIhtmfy5pVX9At=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOBKoqwEf2J30bPpK889sjNoajyFTxdh0gUyzds=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a525b6c608a7f:0x8b9e41be592d6ba1"}
{"user_id": "100786060996082827787", "name": "John Pearson", "time": 1534363069021, "rating": 1.0, "text": "I used Briggs for years and my lift ran great.  Then they sold the rental I was using when they would have mine, so I tried Lilly.  Got a rental and they took my lift in for an annual service, header hoses and some oil leaks, primarily rear main seal.  Well, they had it for 6 weeks, broke the exhaust pipe, charged me 6000.00, that's right SIX THOUSAND DOLLARS, and fixed nothing.  All the same leaks were there, called, sent a mechanic out, did something, said all good, and left.  Nothing fixed.  The main seal leak has gotten worse and worse.  Finally Briggs got another suitable rental and have my lift right now repairing everything Lilly did not.  Not sure what Lilly did for 6 weeks other than an oil change, a couple of header hoses and breaking my exhaust.  This is the worst company I have EVER dealt with.  The icing on the cake?  I paid in full, and they keep sending me bills 6 months later.  Then I call, they say they will look into it, never hear back and next month get another bill.  This company deserves Negative 5 stars.", "pics": null, "resp": null, "gmap_id": "0x889a525b6c608a7f:0x8b9e41be592d6ba1"}
{"user_id": "105573303993468008706", "name": "Tony Martin", "time": 1486147700433, "rating": 1.0, "text": "As a buyer I went to Lily Company in Mobile to order some parts for a piece of equipment. Not having an existing account with them, I was looking forward to seeing how their customer service and ordering experience was. I had to call multiple times for a price quote just to order one part and have it overnighted. After not receiving the part today, I decided to call them back. I was just informed that the part wasn't even ordered; and they didn't even have the decency to let me know. To top it off, the customer service rep for the parts department was completely unprofessional and spoke to me as if it were my fault the part was not ordered, and that \"ill just have to deal with it not being shipped today\".\n\nI deal with multiple distributors, and have never had any issues like I experienced with this company. It is safe to say that after this trial run with The Lily Company, I will not be setting up an account and using them regularly. I will continue to use other retailers for my fork lift rentals and parts needs and urge anyone else to avoid them also; Thompson Cat never treats customers this way. They missed a big opportunity here.", "pics": null, "resp": null, "gmap_id": "0x889a525b6c608a7f:0x8b9e41be592d6ba1"}
{"user_id": "115357082588617752194", "name": "James Mulready", "time": 1509568962145, "rating": 5.0, "text": "Great service and parts by pros that know their field . Lots of years of experience", "pics": null, "resp": null, "gmap_id": "0x889a525b6c608a7f:0x8b9e41be592d6ba1"}
{"user_id": "117837028252210618998", "name": "Nelo", "time": 1505926710630, "rating": 4.0, "text": "I was in and out in a hour", "pics": null, "resp": null, "gmap_id": "0x889a525b6c608a7f:0x8b9e41be592d6ba1"}
{"user_id": "108271118206788427836", "name": "Project 97", "time": 1598969908912, "rating": 1.0, "text": "I like Grainger and have never had a problem until now. I just tried to call the mobile location and they woman that answered the phone said that there is no way to be transferred to an exact store. If that is true that’s the craziest thing I’ve ever heard. I asked her so if you can’t transfer me to them, then just give me the number to them and I’ll call. Her response was the store doesn’t have a number. I asked, so there is absolutely no way possible to communicate or get in touch with anyone at that location? And she said that’s correct. It has been that way for years she said. It blew my mind. Truly the craziest thing I have heard in quite a while.", "pics": null, "resp": {"time": 1599662254493, "text": "Hi, Chris. Thank you for the feedback. Our local branches do not take calls, allowing them to assist our customers who walk in the door. Our customer service team can be reached at 1(800)472-4643 and are available 24 hours a day, 7 days a week. They have access to the same information to ensure you receive the right information when you need it. ^Amber, Grainger Social Team"}, "gmap_id": "0x889a4d08a12ed661:0x3cc8afbd3b941e3a"}
{"user_id": "111502634022735341975", "name": "Stacy Upshaw", "time": 1544822076634, "rating": 5.0, "text": "I was surprised at how good the customer service is over the telephone, very helpful looking up part numbers and the shipping was very fast", "pics": null, "resp": {"time": 1545163640891, "text": "We're very happy we could help, Stacy! Thank you for sharing this and thanks for choosing Grainger!"}, "gmap_id": "0x889a4d08a12ed661:0x3cc8afbd3b941e3a"}
{"user_id": "114988107600509515931", "name": "Rock", "time": 1561508785685, "rating": 4.0, "text": "Not open on Saturday but the Grainger website says it IS open. It is NOT open on Saturday. I just drove a freaking hour to come buy work boots.\nWhy not be open on Saturday anyway? We work monday-friday in the normal world when we'd go here.", "pics": null, "resp": null, "gmap_id": "0x889a4d08a12ed661:0x3cc8afbd3b941e3a"}
{"user_id": "101792900332934580367", "name": "Goddbod. Junya “iceberg” Winston", "time": 1590697565070, "rating": 4.0, "text": "nice neighborhood..", "pics": null, "resp": null, "gmap_id": "0x889a4d08a12ed661:0x3cc8afbd3b941e3a"}
{"user_id": "107244655574647047186", "name": "Wes Allday", "time": 1488428689253, "rating": 4.0, "text": "Nice selection in inventory, staff is helpful with finding/ordering needed parts. Prices can be a bit steep.", "pics": null, "resp": null, "gmap_id": "0x889a4d08a12ed661:0x3cc8afbd3b941e3a"}
{"user_id": "112106130166363678074", "name": "Doug Fleming", "time": 1538504589244, "rating": 2.0, "text": "Why is this the only electrical supplier that WONT let you speak to a local store without jumping through hoops?", "pics": null, "resp": {"time": 1538510459000, "text": "Hi, Doug. Thank you for the feedback. Our local branches do not take calls, allowing them to assist our customers who walk in the door. Our customer service team is set up to assist our Customers 24 hours a day, 7 days a week, and has access to the same information to ensure you receive the right information when you need it. ^Amber, Grainger Social Team"}, "gmap_id": "0x889a4d08a12ed661:0x3cc8afbd3b941e3a"}
{"user_id": "111741622560407962448", "name": "Outhere", "time": 1628942542247, "rating": 5.0, "text": "Friendly staff,  reasonable pricing, conveniently located, had exactly what I needed. What more could anyone expect.", "pics": null, "resp": {"time": 1629217673733, "text": "Thanks, Outhere. We're glad to hear you got exactly what you needed. We appreciate your business and hope we can work together again soon."}, "gmap_id": "0x887d48cee80a2f2f:0xd92b416f0a2847d3"}
{"user_id": "100737964110068034138", "name": "Tim Walker", "time": 1623943180571, "rating": 5.0, "text": "Prompt delivery. Prompt service.", "pics": null, "resp": {"time": 1623966673931, "text": "Thanks, Tim. Looking forward to working together again soon."}, "gmap_id": "0x887d48cee80a2f2f:0xd92b416f0a2847d3"}
{"user_id": "101900826240177391592", "name": "Sherry Campbell", "time": 1621870614321, "rating": 5.0, "text": "Excellent customer service and good rates on equipment", "pics": null, "resp": {"time": 1621973861543, "text": "Thanks, Sherry. Looking forward to working together again soon."}, "gmap_id": "0x887d48cee80a2f2f:0xd92b416f0a2847d3"}
{"user_id": "107476026170060404018", "name": "Larry Parker", "time": 1604365545630, "rating": 5.0, "text": "Always helpful in helping find what we are needing if they do not have it on hand.", "pics": null, "resp": {"time": 1604693159577, "text": "Thanks, Larry. Let us know if there's anything we can do to help next time."}, "gmap_id": "0x887d48cee80a2f2f:0xd92b416f0a2847d3"}
{"user_id": "113810290052866295382", "name": "Ricky Nelson", "time": 1619576506608, "rating": 5.0, "text": "100% customer service on phone, in person, loading and unloading.  There was a problem as the battery to the lift we rented was not with the unit.  They brought the battery to our location, and let me keep for the weekend as our  workers had to leave before battery arrived.", "pics": null, "resp": {"time": 1619647629247, "text": "Thanks, Ricky. We appreciate the positive feedback and shout-out for our team. We're glad we were able to help you with your equipment needs and look forward to working together again soon."}, "gmap_id": "0x887d48cee80a2f2f:0xd92b416f0a2847d3"}
{"user_id": "100196022857558513907", "name": "Michael South", "time": 1617034478861, "rating": 5.0, "text": "The staff was welcoming and helpful!", "pics": null, "resp": {"time": 1617139372600, "text": "Thanks, Michael. We appreciate the positive feedback and shout-out for our team. Let us know if we can help out again soon."}, "gmap_id": "0x887d48cee80a2f2f:0xd92b416f0a2847d3"}
{"user_id": "102638609437248727614", "name": "Mark Wood", "time": 1623434236837, "rating": 5.0, "text": "Friendly and helpful associates", "pics": null, "resp": {"time": 1623696700100, "text": "Thanks, Mark. Looking forward to working together again soon."}, "gmap_id": "0x887d48cee80a2f2f:0xd92b416f0a2847d3"}
{"user_id": "114190821643010833686", "name": "MSG63b Retired", "time": 1625954866273, "rating": 5.0, "text": "My experience went well", "pics": null, "resp": {"time": 1626110611189, "text": "Thanks! Give us a shout if we can help again soon."}, "gmap_id": "0x887d48cee80a2f2f:0xd92b416f0a2847d3"}
{"user_id": "112348119441446982557", "name": "Jeff McCrary", "time": 1453001109681, "rating": 5.0, "text": "This branch is great! The reps are knowledgable and the service is great!", "pics": null, "resp": null, "gmap_id": "0x887d48cee80a2f2f:0xd92b416f0a2847d3"}
{"user_id": "111370390666756265201", "name": "Kim day", "time": 1503975236620, "rating": 5.0, "text": "Great bunch of guys.", "pics": null, "resp": null, "gmap_id": "0x887d48cee80a2f2f:0xd92b416f0a2847d3"}
{"user_id": "108062893508860136211", "name": "Kim Kimbrough", "time": 1531502587943, "rating": 5.0, "text": "I work here", "pics": null, "resp": null, "gmap_id": "0x887d48cee80a2f2f:0xd92b416f0a2847d3"}
{"user_id": "103299223737308141582", "name": "Jacob Pearce", "time": 1610983245413, "rating": 5.0, "text": "I bought a used unit from them. The process was smooth and the staff was friendly. The product was well maintained.", "pics": null, "resp": {"time": 1611690898048, "text": "Thanks, Jacob. We appreciate the feedback and hope we can work with you again soon."}, "gmap_id": "0x8886025e308da237:0xfc864612e2502022"}
{"user_id": "113964597954264673418", "name": "Collis Crafton", "time": 1529598149133, "rating": 1.0, "text": "Delivery is 2 hours late and still getting a run around. Should have went to herc.", "pics": null, "resp": {"time": 1529691542490, "text": "Thank you Collis for bringing this to our attention and we’re sorry you didn’t have a good experience with our team. Can you please email candrews@ur.com or jjaime1@ur.com with your name and order number so we can connect with the correct branch for more information?"}, "gmap_id": "0x8886025e308da237:0xfc864612e2502022"}
{"user_id": "109999657419468238239", "name": "J C", "time": 1515191472893, "rating": 3.0, "text": "Good selection but high prices on most items. However the have parts that you can’t get elsewhere. I need some aluminum angle and they beat Home Depot and Lowes prices by far.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOaH7KQYTM3UjJqaLMaQiaR4Wd4_SOeTQxjakB1=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOXBoNCZoVDWPilCPDUVDwcpcLA5LmmqztTdpRq=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626b970a10dd5b:0xed2e1cc77ccac5c"}
{"user_id": "109254897699473617949", "name": "Paul Streeter", "time": 1613599061090, "rating": 5.0, "text": "Great helpful advice on my project, thanks", "pics": null, "resp": {"time": 1614272396556, "text": "Thanks for the nice review! Our goal is to always be the best partner possible to our customers. Glad to hear we were able to help you out! ^Paul, Grainger Social Team"}, "gmap_id": "0x88626b970a10dd5b:0xed2e1cc77ccac5c"}
{"user_id": "105801370094422418483", "name": "Jack Lloyd", "time": 1603465367251, "rating": 1.0, "text": "Worst customer service.  Having people wait for hour to get service is unacceptable.", "pics": null, "resp": {"time": 1604090874093, "text": "Jack, we're sorry your Grainger experience wasn't satisfactory and would like to look into it further. Please email our customer service team at social@grainger.com with your name, the branch you visited, and a brief description of your experience. We appreciate you taking the time to provide feedback and an opportunity for us to improve your experience. ^Amber, Grainger Social Team"}, "gmap_id": "0x88626b970a10dd5b:0xed2e1cc77ccac5c"}
{"user_id": "106599034495074503300", "name": "Mac Thomas", "time": 1602037623736, "rating": 4.0, "text": "They didn't have what I was looking for but they gave it a hellava try!", "pics": null, "resp": {"time": 1604958537997, "text": "We're very happy we could help, Mac! Thank you for sharing this and thanks for choosing Grainger!\n^Paul, Grainger Social Team"}, "gmap_id": "0x88626b970a10dd5b:0xed2e1cc77ccac5c"}
{"user_id": "114343139355483639028", "name": "Richard Norwood", "time": 1536884038698, "rating": 5.0, "text": "Store personnel is extremely helpful and friendly. Sometimes the parts I order aren’t immediately available but they can usually get it in next day. Prices are somewhat competitive but I understand I’m shopping at an industrial supply house.", "pics": null, "resp": {"time": 1537463822004, "text": "Thanks for the nice review! Our goal is to always be the best partner possible to our customers. Glad to hear we were able to help you out!\n^Paul, Grainger Social Team"}, "gmap_id": "0x88626b970a10dd5b:0xed2e1cc77ccac5c"}
{"user_id": "104921985438822163578", "name": "Mike Heard", "time": 1534962397953, "rating": 1.0, "text": "I took a long list of tools I needed to purchase to the local store here in Huntsville, AL. The took the list and told me it would be a couple of days.  Here it is two weeks latter and I have heard nothing.  To top that, when I look to find their business phone number it is the corporate phone number and they cannot give you the store number.  I will not attempt to do business with them again.  If there was a zero star I would have selected it.  What poor customer service.", "pics": null, "resp": {"time": 1536688051086, "text": "Mike, we're sorry your Grainger branch experience wasn't satisfactory and would like to look into it further. Please email our customer service team at social@grainger.com with your name, the branch you visited, and a brief description of your experience (including order number, account number, or any other information you feel may be helpful). We appreciate you taking the time to provide feedback and an opportunity for us to improve your experience. ^Amber, Grainger Social Team"}, "gmap_id": "0x88626b970a10dd5b:0xed2e1cc77ccac5c"}
{"user_id": "107166697815402958226", "name": "Thomas McNutt", "time": 1594329585333, "rating": 5.0, "text": "They were very helpful considering what is going on with the virus.", "pics": null, "resp": {"time": 1594672855660, "text": "Thanks for the nice review, Thomas! Our goal is to always be the best partner possible to our customers. Glad to hear we were able to help you out!\n^Paul, Grainger Social Team"}, "gmap_id": "0x88626b970a10dd5b:0xed2e1cc77ccac5c"}
{"user_id": "110790955915675291004", "name": "Shane Gann", "time": 1468355900490, "rating": 1.0, "text": "I need an electric motor, I called the store and got a call center, the lady knew nothing about parts, read her multiple parts numbers off the motor and the fan it was attached to. She finally said we are just going to have to call tech support.......really? I just need to know if the motor is in the store before I drive all the way over there.", "pics": null, "resp": null, "gmap_id": "0x88626b970a10dd5b:0xed2e1cc77ccac5c"}
{"user_id": "104017794118878473808", "name": "Anthony Cornelius", "time": 1607204219231, "rating": 3.0, "text": "Nice staff. In and out quickly.", "pics": null, "resp": null, "gmap_id": "0x88892f764cb32709:0x25ede79c5214c8e6"}
{"user_id": "111455793275680422914", "name": "Sheley White", "time": 1550949250408, "rating": 5.0, "text": "Great company", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPaCBptnMVA-OeuM2jW9k1nagkxO-OklW5xsEZH=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPx95QdQEFjtHh_NbdgG9SkRcdStlwmmuPPCzuL=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88892f764cb32709:0x25ede79c5214c8e6"}
{"user_id": "108179446782967186542", "name": "Doug Mckinney", "time": 1450993453746, "rating": 4.0, "text": "We provided lodging for the technicians working at the steel mill in Calvert Al\nand found them to be a great bunch of guys.\nThey are most welcome to stay at any of our Geer properties.\nBates Creek RV and cabins\nDoug Mckinney", "pics": null, "resp": null, "gmap_id": "0x88892f764cb32709:0x25ede79c5214c8e6"}
{"user_id": "118082777050091636638", "name": "Fred Brown", "time": 1619550632922, "rating": 5.0, "text": "Great customer service. Willing to acclimate and change to help out getting the job done. As good as they get...would highly recommend to anyone needing a rental service", "pics": null, "resp": {"time": 1619647493340, "text": "Thanks, Fred. We appreciate the feedback and the recommendation. We look forward to working with you again next time."}, "gmap_id": "0x888c29ba44d4ad23:0x67309e276de9a415"}
{"user_id": "106857928667056407581", "name": "J Brown", "time": 1621906260019, "rating": 2.0, "text": "Dozier brought to job site w leaking hydraulic fluid n rt track popping and flapping in need of a new sprocket we were told.  Another hydraulic line broke again 2 days later. The clacking got worse n louder.  The Dozier became harder to turn causing a slow down in work, additional time, labor hours, fuel, and double use of excavator to do Dozier work.  Finally, Dozier operator could not take the clanging noise nor fighting to barely turn Dozier and walked off the job Sun May 23, 2021 after struggling w Dozier for 5 days w no repair or replacement of it.\nAlso rental excavator started leaking hydraulic fluid at bucket on Sunday May 23, 2021 causing a shut down of operations.  Contacted United and 7:30 am.  No one responded till mid afternoon to replace hose. A couple of hours later hydraulic fluid leaking from same spot.  Called again around 4:30 pm.  Reluctantly, service man came back out.  It was discovered that he had not tightened the hose that he installed.  Hence the 2nd leak.", "pics": null, "resp": {"time": 1621975729040, "text": "Thanks, J. We have escalated to the local management team and hope to resolve the issue with you quickly. Please let us know if there is anything we can do to help in the meantime."}, "gmap_id": "0x888c29ba44d4ad23:0x67309e276de9a415"}
{"user_id": "116628769647671665506", "name": "Garry Easterling", "time": 1617060473153, "rating": 5.0, "text": "The people are very professional and they always have the best and Updated equipment. Clean and reliable.", "pics": null, "resp": {"time": 1617139444983, "text": "Thanks, Garry. We appreciate the positive feedback and shout-out for our team. We look forward to working with you again next time."}, "gmap_id": "0x888c29ba44d4ad23:0x67309e276de9a415"}
{"user_id": "100084397433340653426", "name": "Phillip Hethcox", "time": 1614865657792, "rating": 5.0, "text": "Everyone was friendly and professional. Miss Norma helped me through my rental and done an excellent job.", "pics": null, "resp": {"time": 1616436581033, "text": "Thanks, Phillip. We appreciate the feedback and shout-out to our team. Let us know if we can help out again soon."}, "gmap_id": "0x888c29ba44d4ad23:0x67309e276de9a415"}
{"user_id": "108672661573084797996", "name": "Paul Shaffer", "time": 1620656433724, "rating": 4.0, "text": "Friendly sales. On time delivery and pick-up", "pics": null, "resp": {"time": 1620844272027, "text": "Thanks, Paul. Give us a shout if we can help again soon."}, "gmap_id": "0x888c29ba44d4ad23:0x67309e276de9a415"}
{"user_id": "109136852815654350673", "name": "claude hudson", "time": 1612492553962, "rating": 5.0, "text": "Equipment I rented was in good condition. The delivery  driver was helpful in instructions on use of the equipment.", "pics": null, "resp": {"time": 1612804782789, "text": "Glad to hear it, thansk Claude. We appreciate the feedback and hope we can help out again soon."}, "gmap_id": "0x888c29ba44d4ad23:0x67309e276de9a415"}
{"user_id": "103275777259568098000", "name": "Scott Slatten", "time": 1614244715541, "rating": 5.0, "text": "Price, selection, service are all good. Maybe not the best price but you get what you pay for.", "pics": null, "resp": {"time": 1615240295992, "text": "Thanks, Scott. Let us know if we can help out again soon."}, "gmap_id": "0x888c29ba44d4ad23:0x67309e276de9a415"}
{"user_id": "103957603154476987330", "name": "ron brown", "time": 1561135056895, "rating": 5.0, "text": "The people here are great. Safety first company. Always willing to help.", "pics": null, "resp": {"time": 1562434403726, "text": "Good afternoon.  We're glad that you had a positive experience with our Team. We appreciate your business and hope that you will consider us for your future projects. Thanks for choosing United Rentals."}, "gmap_id": "0x888c29ba44d4ad23:0x67309e276de9a415"}
{"user_id": "112939297021499187841", "name": "Trey Fredriksen", "time": 1615646133434, "rating": 5.0, "text": "Todd Turk is our sales rep. and he does a fine job of taking care of us.", "pics": null, "resp": null, "gmap_id": "0x889a4c9b927ac98d:0x7f9f051bb573b44"}
{"user_id": "110475295824654204137", "name": "Lee Conkin", "time": 1611857174718, "rating": 5.0, "text": "Courteous, prompt, and professional service. Thank you.", "pics": null, "resp": {"time": 1612383920407, "text": "Glad to hear it, thanks Lee. We appreciate it!"}, "gmap_id": "0x889a4c9b927ac98d:0x7f9f051bb573b44"}
{"user_id": "103164162666243524528", "name": "Dale Byrd", "time": 1587649498031, "rating": 5.0, "text": "I have been dealing with United for over two years now and have had great customer service from Hunter Ellenburg out of the branch on Laughlin Rd in Mobile AL. He has always gone above and beyond to make sure our needs are taken care of.", "pics": null, "resp": null, "gmap_id": "0x889a4c9b927ac98d:0x7f9f051bb573b44"}
{"user_id": "105983005854464388967", "name": "david lyndall", "time": 1517577801297, "rating": 1.0, "text": "Rent somewhere else!  They bragged about their equipment being better that others and theirs still  messed up. Man lift Would periodically stop working in rotation. Caused a huge delay in the job.  Returned  back, explained the problem  and they did a 1 minute test... How thorough can you be in thaybtime frame.  They said it's working fine. Didnt put a man in the basket, didn't raise it up and check much at all. A joke.  Waste of 380. Going to Sunbelt to get a decent piece of equipment. But hey at least they said thank you.", "pics": null, "resp": null, "gmap_id": "0x889a4c9b927ac98d:0x7f9f051bb573b44"}
{"user_id": "112102071206392387458", "name": "Quality Marine", "time": 1465398864012, "rating": 5.0, "text": "Great Company and Service!!! Thank You!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4c9b927ac98d:0x7f9f051bb573b44"}
{"user_id": "110253808106973230346", "name": "Matt Farmer", "time": 1378925380288, "rating": 5.0, "text": "Get people to work with. Always egear to help you with your needs.", "pics": null, "resp": null, "gmap_id": "0x889a4c9b927ac98d:0x7f9f051bb573b44"}
{"user_id": "102724773907416406862", "name": "Mark Vickers", "time": 1536942544593, "rating": 5.0, "text": "I not only looked at the inventory available but I took classes on forklift and scissor lift usage and also a class on fall protection. The courses were taught by Tim O'Donnell and he did a marvelous job. I would recommend this training to anyone using forklift or scissor lift or if you climb using a body harness.", "pics": null, "resp": {"time": 1537023674662, "text": "Thank you Mark! We're glad you had a great experience with us!"}, "gmap_id": "0x8892924e1998c169:0xb894ae75ba49e0f6"}
{"user_id": "116966172108830019933", "name": "Charles Paulk", "time": 1571088454684, "rating": 5.0, "text": "We have both purchased and rented equipment for them and they always have competitive pricing and great service every time.", "pics": null, "resp": null, "gmap_id": "0x8892924e1998c169:0xb894ae75ba49e0f6"}
{"user_id": "111615984052992867435", "name": "Melody L", "time": 1507165227293, "rating": 4.0, "text": "Great help", "pics": null, "resp": {"time": 1507321439160, "text": "Thanks, Shania. We're happy you had a good experience with our team. Hope to see you next time!"}, "gmap_id": "0x8892924e1998c169:0xb894ae75ba49e0f6"}
{"user_id": "113410844554686366621", "name": "Ronnie Ridlon", "time": 1610671828627, "rating": 5.0, "text": "Wanted to share my experience with United rentals in Foley Alabama. Absolutely amazing, every single person I deal with is awesome and extremely helpful! But I have to give the biggest thanks & Recognition to Sara Polansky! She is amazing, gets whatever I need no matter the hurtles. Always comes though with perfect service!  Great company and people I highly recommend them for anything you can rent.", "pics": null, "resp": {"time": 1611604218436, "text": "Thanks for the shout-out, Ronnie. We appreciate the feedback and hope we can help out again soon."}, "gmap_id": "0x889a0e3339173443:0x32913570a94694b6"}
{"user_id": "116446889405825928476", "name": "Jimmy Chivers", "time": 1615418548661, "rating": 5.0, "text": "I always receive the best service when I rent a piece of equipment. The people are very helpful and friendly.", "pics": null, "resp": null, "gmap_id": "0x889a0e3339173443:0x32913570a94694b6"}
{"user_id": "113237515850884011856", "name": "John Jr Blacksher", "time": 1622233771920, "rating": 5.0, "text": "When I pull in the yard, I never have to wait more than a minute to get waited on. Got to keep my head on a swivel because someone will be coming soon on a forklift to get the trailer off or to unload my truck.", "pics": null, "resp": {"time": 1622579634299, "text": "Thanks, John. Looking forward to working together again soon."}, "gmap_id": "0x889a0e3339173443:0x32913570a94694b6"}
{"user_id": "112561182036069999605", "name": "Kevin Maxwell", "time": 1616501952588, "rating": 5.0, "text": "Sales associate(Angie) from the Pensacola Branch has been a pleasure to work with. She always takes care of me and all rentals set up for delivery and pick up with no issues.", "pics": null, "resp": {"time": 1617134131539, "text": "Thanks, Kevin. We appreciate the positive feedback and shout-out for our team. We're glad we were able to help you with your equipment needs and look forward to working together again soon."}, "gmap_id": "0x889a0e3339173443:0x32913570a94694b6"}
{"user_id": "115486194241409294379", "name": "Tim Simpson", "time": 1608920867720, "rating": 5.0, "text": "Great place to rent equipment, very friendly staff.", "pics": null, "resp": {"time": 1609793608105, "text": "Thanks, Tim. We appreciate the feedback and your business. Let us know if there's anything we can do to help in the future."}, "gmap_id": "0x889a0e3339173443:0x32913570a94694b6"}
{"user_id": "111447997756065862365", "name": "Jake Plash", "time": 1569741024569, "rating": 5.0, "text": "Nice staff, very knowledgeable. There is this one mechanic named Jon, he went out of his way to help my crew understand the machine we picked up. We asked every question possible and he never once brushed us off or got irritated with us(and it was hot out). You don’t get many people that are so knowledgeable and professional. We will come\nback just for that one mechanic alone. Good job United", "pics": null, "resp": null, "gmap_id": "0x889a0e3339173443:0x32913570a94694b6"}
{"user_id": "105863266449619678846", "name": "Jeff Devine", "time": 1618980634870, "rating": 5.0, "text": "GREAT SERVICE", "pics": null, "resp": {"time": 1619042532177, "text": "Thanks, Jeff. We appreciate the positive feedback and shout-out for our team. Let us know if we can help out again soon."}, "gmap_id": "0x889a0e3339173443:0x32913570a94694b6"}
{"user_id": "100734923312528273151", "name": "Angela Wingard", "time": 1569741163806, "rating": 5.0, "text": "Very professional staff. They are always ready to help. The whole team seems to work well together. I love hearing around town how reliable United’s machines are. Great company to help with all your jobs, big or small!", "pics": null, "resp": null, "gmap_id": "0x889a0e3339173443:0x32913570a94694b6"}
