{"user_id": "109203841960754563746", "name": "Tara Frontz", "time": 1511972242460, "rating": 5.0, "text": "I'm only reviewing because there's people leaving reviews that are negative just because this is a baby/children's store! We love growing Trends. We shop and sell there!", "pics": null, "resp": null, "gmap_id": "0x888bb3ea932ecbc1:0x5d70837ad99b2dd"}
{"user_id": "101899366575661121329", "name": "Autumn Snyder", "time": 1511725835095, "rating": 5.0, "text": "I only buy consigned for my children. Love this place!", "pics": null, "resp": null, "gmap_id": "0x888bb3ea932ecbc1:0x5d70837ad99b2dd"}
{"user_id": "105744178993976318369", "name": "Jessica Dingler", "time": 1502476087909, "rating": 1.0, "text": "Baby clothes, maternity clothes, baby stuff", "pics": null, "resp": null, "gmap_id": "0x888bb3ea932ecbc1:0x5d70837ad99b2dd"}
{"user_id": "118170225243391103359", "name": "Megan Hendrick", "time": 1498094191658, "rating": 5.0, "text": "A variety to choose from with low prices.", "pics": null, "resp": null, "gmap_id": "0x888bb3ea932ecbc1:0x5d70837ad99b2dd"}
{"user_id": "102530152278874266180", "name": "O. F.", "time": 1614649931859, "rating": 5.0, "text": "Wow, I was so amazed at the variety of items 3 Storks and a Baby has. Neo-natal and premature baby clothing, Shower Girl and Cute Little Tuxedos for Boys, Modern Maternity, and Christening Gowns. Rain Coats...", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO6atgYdfCAMZzqSzlwht29VpbpU5G8kAB-tytJ=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626fae0af6dcef:0xf09cfd7cc5dcccbe"}
{"user_id": "104494856728386852077", "name": "jenn caceres", "time": 1600699367118, "rating": 1.0, "text": "Cute store, I went this weekend with my in laws. Employee was not wearing a mask, I was uncomfortable when the employee attempted to approach my baby to say Hi and give her a doll. The only reason we purchased something was because my mother in law wanted to buy her clothes. I love supporting local stores, but i will not coming back to this store. The clothes were cute but overpriced.", "pics": null, "resp": null, "gmap_id": "0x88626fae0af6dcef:0xf09cfd7cc5dcccbe"}
{"user_id": "107908769455410170338", "name": "Danielle Roberts", "time": 1616827395479, "rating": 1.0, "text": "Cashier wasn't wearing a mask, i didnt feel comfortable in there with my baby who is too young to wear a mask. Will not be back because of this.", "pics": null, "resp": null, "gmap_id": "0x88626fae0af6dcef:0xf09cfd7cc5dcccbe"}
{"user_id": "104910138693636414813", "name": "Ginny Roberts", "time": 1576251648582, "rating": 5.0, "text": "Largest selection of adorable children’s clothes that I have seen anywhere in Alabama. While they carry little boys clothes Their selection of dresses and play close for a little girls surpasses anything that I have seen. All this below normal retail prices. I also loved the selection of stuffed animals. Shopping her  is a wonderful experience:", "pics": null, "resp": null, "gmap_id": "0x88626fae0af6dcef:0xf09cfd7cc5dcccbe"}
{"user_id": "104964867922875326425", "name": "Lara Seamon", "time": 1575398659494, "rating": 5.0, "text": "3 Storks & A Baby is such a great baby store for all of your little ones needs. Whether it's baby gear, baby toys, baby accessories to children's clothing... You name it Mary and Laura have it. They have the name brand quality items at very afford prices. They even have diaper cakes. Which we all know that is a must for a baby shower and celebration. I loved that they also have an in house seamstress for custom embroidery and clothes. I genuinely appreciate the ability to go to their baby boutique for a one stop shop!", "pics": null, "resp": null, "gmap_id": "0x88626fae0af6dcef:0xf09cfd7cc5dcccbe"}
{"user_id": "106686994138725903315", "name": "Rachel Daubenmire", "time": 1575401375573, "rating": 5.0, "text": "If you are looking for cute and trendy kids and baby clothes you have to go to 3 Storks & A Baby! This childrens boutique has the cutest dresses, kids clothes, baby clothes, boys suits, hair bows, shoes, and so much more at prices you can afford! They even have a seamstress on site that will make custom halloween costumes and princess dresses for your little one! Plus, if you are looking for a baby boutique with a baby registry they offer this too! Stop in and see Mary and Laura today!", "pics": null, "resp": null, "gmap_id": "0x88626fae0af6dcef:0xf09cfd7cc5dcccbe"}
{"user_id": "101791370536104522575", "name": "Leon Burns", "time": 1580326214721, "rating": 5.0, "text": "Great place . Good great selection great people courteous and kind", "pics": null, "resp": null, "gmap_id": "0x88626fae0af6dcef:0xf09cfd7cc5dcccbe"}
