{"user_id": "110968230058712006861", "name": "Vicki Mangina", "time": 1625241423490, "rating": 4.0, "text": "I have been very disappointed with the service I have received. My Mother was buried in September, 2019 my parents graves have sunk in, washed and the ground surrounding the headstone has eroded. I have been there personally to report this and have called almost daily with no return call. I expressed my concern with the condition of the cemetery and was told it sold in December and hopefully changes will be made. I went by the graves today and no improvement’s have been made and in some areas the grass is almost knee high. This is not acceptable and I do hope this is taken care of before further action needs to be taken.EDIT:I have talked to the manager of the funeral home. He explained to me due to COVID and lack of workforce things have fallen behind. The headstone has been leveled and sand, new dirt, grass seed and new hay has been been put down on the grave sites. He was very nice and helpful even gave me his personal cell phone number if additional problems arise. He again assured me they are working hard to bring the cemetery back to the standards of the past. Very appreciative of his prompt actions and response. Thank you Eric.", "pics": null, "resp": null, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "102348285685644623431", "name": "Susan Jones", "time": 1624911430772, "rating": 5.0, "text": "Everyone there is very sweet and professional.\nRecently we had our third family funeral at Jefferson Memorial. The people are very nice. The grounds are beautifully kept and our experiences at Jefferson Memorial have been remarkable. I would highly recommend them to friends and family.", "pics": null, "resp": null, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "103182900160180634087", "name": "Frances Abrams", "time": 1620525149473, "rating": 5.0, "text": "Today my husband I went to the cemetery to place Mother's Day flowers on my mother's marker. After finding that the vase was missing, we also discovered that there was no vase on my father's marker either. After we called the office, they sent Eric to help us. He contacted maintenance and soon Cory and A. D. showed up. Not only did they bring vases, but shovels, dirt and other tools. They uncovered the markers entirely, then filled in with dirt to raise the markers higher, revealing the granite base to each marker that had been completely covered. These two men worked about 30 minutes and were so nice! Kudos to Cory and A.D.! The markers look great now!", "pics": null, "resp": null, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "115345798438685575110", "name": "Melanie George", "time": 1624035497030, "rating": 5.0, "text": "My family has always used Jefferson Memorial for funeral services, and now I know why. I was very intimidated by the whole process when my mom passed, but they kept it simple and thoroughly explained everything, so that my brother and I could make decisions without feeling pressured or \"sold\". We were able to honor my mother's wishes. Thank you to Bob and Richard and the rest of the staff for making our lives a little easier during this difficult time.", "pics": null, "resp": null, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "110631587490339394161", "name": "Deborah tolbert", "time": 1624144473143, "rating": 3.0, "text": "I have left numerous messages to move forward with ordering a marker, having a burial. I've yet to receive a return phone call to get this going.  The burial was paid in full several weeks ago.  Extremely unprofessional.  Update - The manager contacted me and is trying to make everything right.  We have had the burial.  Currently waiting on them to contact me when the marker comes in and is placed.   I will then go to see the marker, see if they placed the sod over the grave as promised and if they fixed the other markers that are covered with grass, dirt and overgrowth  and sunken.", "pics": null, "resp": null, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "114332828033383451842", "name": "Pat Hamilton McMurrey", "time": 1616889165648, "rating": 1.0, "text": "I have never been to a more poorly planned and executed funeral!!! There was NO direction provided by the funeral home staff. No one knew where to go or what to do. It was complete chaos. The family were scattered all over the chapel, not seated together as they should have been. The sound system was a complete joke as was the projection screen! You could barely see the pictures and they were very blurry.  There were/are NO PICTURES on the online obituary page after the family went to a tremendous effort to collect, scan and upload to the funeral home's planning webpage!  Those should have automatically transferred. Several attempts to upload pictures directly through the online site through the Share Memories section resulted in a locked up phone!!! The facilities are dated and drab, very depressing; in need of some serious renovations and updating. They had a last viewing for the family but before my husband could even get to the front they had already closed the coffin so he did not get a final chance to say goodbye to his Dad!!!!!! The whole thing felt rushed, as if they needed us to be gone so they could close the doors and go home. They did not even completely close the curtain. It was a disaster from start to finish. A very PRICEY disaster!! In summary; cheap quality, tacky and shoddy. I'm sure they are very busy, but then busy means more income, some of which needs to be applied to adding professional, trained staff and upgrading the facilities.  I do NOT recommend this funeral home!\n\nMr. Roper, there is no need for us to speak unless you plan to offer some kind of refund. I have clearly listed our complaints. If you work on those issues perhaps you can improve the services you offer.", "pics": null, "resp": {"time": 1616818150713, "text": "Ms. McMurrey, we take your concerns seriously. We want to extend our sincerest apologies for the experience you had with us. Our staff strives to meet the needs of each and every family we serve. We would like to discuss further details pertaining to your experience. Please contact Matt Roper at 205-322-0543."}, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "106723976517211918496", "name": "Melanie Brake", "time": 1616874620919, "rating": 5.0, "text": "Today while visiting the cemetery, we were greatly appreciative of AD, one of the cemetery maintenance staff! He was kind, courteous and extremely helpful! He gladly assisted us with our cemetery vases. He did a great job helping us and stopped what his was doing to assist my 86 year old Dad and myself as we were carrying several floral arrangements. Thank you again to AD", "pics": null, "resp": null, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "106894045718608700665", "name": "Tanya Tidwell", "time": 1598467778967, "rating": 5.0, "text": "This review is in relation to the Funeral Home Staff and specifically our funeral director, Ms. Sandra May.  When families are at their most vulnerable, it is at these time that a gentle, kind, and caring person becomes so important.  When my father passed away, Ms. May and the rest of the staff treated our family with respect and they worked very hard to help guide us through the most difficult time of my mother's life.  They did not try to push us to purchase things nor try to play on our grief, but instead they listened to what mattered the most to us and then helped us to achieve those goals.  Even though the funeral home was extremely busy and Ms. May probably had about 100 other things on her \"to-do\" list, she never rushed us or made us feel like we were bothering her.  The services provided by the funeral home and by the staff were above and beyond and I would highly recommend Jefferson Memorial Funeral Home and Gardens as your choice for funeral services.", "pics": null, "resp": null, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "117480396885096988585", "name": "Jerry Franklin", "time": 1591996431545, "rating": 1.0, "text": "My family’s experience with this funeral home has been mixed.  The services are top notch but the cemetery grounds are not.  My grandparents, my father, and now my mother have been buried there.\nMy father in 1981, my grand father a year or so later and my grandmother a few years after that.\nWe had a time trying to get grass planted and then the vases broke and when grass was finally put there my mother and my wife had to purchase and plant it.\nWell after all that time my mother was buried there in January and here we go again.  The marker has not been updated, the grave is still a chirt pit and it has been five months.\nMy sister and I have called to complain and they told us a work order has been filed.\nWell we will see how long it takes.", "pics": null, "resp": null, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "104674782787422072897", "name": "Craig Winn", "time": 1580683784793, "rating": 3.0, "text": "This review is strictly for the cemetery and grounds. It is a large relatively peaceful location even though it is next to the hustle and bustle of Hwy 11. It is generally clean but It could be maintained so much better. The roads need paving but at least the potholes filled in. Constantly asking for the grass to be cut and put out a little fire ant killer. The ant beds always seem to take over my mother-in-laws grave. I own a couple gravesites here. Anyone want a good deal on one?", "pics": null, "resp": {"time": 1580787432404, "text": "Hi Craig, thank you for the review.  We are always working to improve the conditions of the cemetery and are currently down a few employees on the cemetery maintenance team.  We are actively trying to hire for the spring so that we can get caught back up on as much maintenance and upkeep as we can.  Thank you!"}, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "106666703208207770992", "name": "Teresa Waine", "time": 1591547740920, "rating": 1.0, "text": "This review is only about the cemetery. My father as well as my father in law are buried there. I have put in work orders several times about my FIL’s grave. They do a half way fix spending as small amount as possible to appease me. The graves are washing and rutted with no grass, only weeds and headstones break because the cheap clay they haul in washes from under them.\nThe roads to where my dad is, in the mausoleum, are covered with red clay and rutted with holes. Way too much money was spent to buy those spaces that are supposed to be kept up and are not being. I feel this will be the next cemetery in horrible repair that makes the news. Do not buy a plot here without looking hard at the shape the cemetery is in.", "pics": null, "resp": null, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "108650853051157197034", "name": "Wanda Bordone", "time": 1557570869670, "rating": 5.0, "text": "Our family greatly appreciated the kindness that Ms. Cheri Roberts and the staff at Jefferson Memorial Gardens East showed to us. She immediately responded to our out-of-state assistance which we needed and went above and beyond in helping us. What peace of mind we have because of the respect and courtesy she extended to us, as well as to our loved ones resting there. Thank you so much.", "pics": null, "resp": {"time": 1557573744930, "text": "Wanda,\nThank you so much for the kind words and taking the time to leave this comment. We’ll let Cheri and team know, it’ll make their Saturday!  If you ever need help in the future or if there’s anything else we can do to help please be sure to reach out! Thank you and have a wonderful weekend!"}, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "106998638209615428038", "name": "P A Pennington", "time": 1556398421061, "rating": 5.0, "text": "Having dealt with more funeral homes than I care remember the past 5 years, I must say this one was the best experience by far. Victoria was very helpful, went above and beyond to accommodate the family. I didn’t feel the compassion was fake or forced. The cemetery is lovely. Prices are not competitive but funerals are not cheap anymore.", "pics": null, "resp": {"time": 1556466061585, "text": "Thank you Happy Trails!  We'll let Victoria know!  We appreciate your comments and review!  We work hard everyday to provide great service and go above and beyond to make things easier on the families we serve.  We're happy to hear we did a nice job for you.  Thank you for placing your trust in us."}, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "107799008549609916080", "name": "Celi MC", "time": 1591736038181, "rating": 1.0, "text": "I called to get some information about a marker but I was left on hold for more than 15 minutes. I hung up because I couldn't wait anymore.", "pics": null, "resp": null, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "108505203110164559362", "name": "Linda Jones", "time": 1547671998904, "rating": 5.0, "text": "We had my mom's funeral and burial at Jefferson.  It was unexpected and she and we (my sister and I) were not prepared for it.   We picked Jefferson because we live in the area, drive past and wanted mom to be close so we could visit. After calling some of the other funeral homes, we felt like the folks at jefferson treat you like family and the price was affordable and easier than going to one place for a funeral and another for the cemetery. They turned a difficult time into a nice event honoring our mom.  Thank so much for helping our family at a difficult time.  We appreciate it more than you all know.", "pics": null, "resp": {"time": 1563812717159, "text": "Thank you Linda!  We appreciate the kind words, it was our pleasure to help your family."}, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "105538676898201015203", "name": "Roger Hill", "time": 1546959239866, "rating": 1.0, "text": "Attended a service here last week for a church friend. I was very displeased with the way things went. When we arrived early that morning the flowers were not in the chapel, not even the flowers for the casket these were finally brought in while family and friends were already gathering. When going out to the cemetery the casket was left out from under the canopy and there was mud all over the canopy inside and out and all over the carpet. I understand it has been raining a lot however, to me you would have a way to clean this for each service. For the price that services cost I would think you could do a better job. I would also say that in your profession I don't think tattoos showing is a good thing on your employees.", "pics": null, "resp": {"time": 1546972758337, "text": "Roger, We are sorry to hear that the funeral service did not meet your expectations and we would like to learn more about the service you attended and how we could do a better job going forward.  Would you please let us know your contact information by calling the funeral home at 205-655-2536 and ask for Adam Seal or leave a message with Kennetha Massey who will have Adam reach out to you directly.  We take all of your points very seriously and would like to use the feedback to improve.  We look forward to discussing this matter with you and we thank you for your comment."}, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "107299808039449279994", "name": "Lindsey Seal", "time": 1522858583533, "rating": 5.0, "text": "Beautiful, updated facility in Trussville. Warm and welcoming atmosphere and staff. Professional and courteous.", "pics": null, "resp": {"time": 1547230322053, "text": "Thank you Lindsey!"}, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "101691518487366871567", "name": "Stephanie Evans", "time": 1499614241010, "rating": 1.0, "text": "Currently my family and I are devastated by the lack of dignity and respect my grandparents graves have been given. It has been almost a month since my grandfather passed away and the flowers from his funeral are STILL on the grave. The grave is such that one dig and you could EASILY touch the vault, and the head stone is still several feet from the graves upside down. I cannot explain how upset we are by this lack of respect. When my grandmother passed away in 2014 the funeral home did an amazing job. They were on top of everything, and very respectful. With my grandfathers funeral (June 2017)  we were not pleased at all. (* I will not post pictures of the grave out of respect for my family*)", "pics": null, "resp": {"time": 1499705135198, "text": "Stephanie,\n\nThank you for acknowledging your satisfaction with our funeral home back in 2014 for your grandmother's service.  We are very sorry to hear that we have not fulfilled the same expectation for your grandfather.  We do not want to make excuses but with the consistency of the rain that we have had in the area recently we are extremely behind on backfilling and the marker will not go back down until the grave is prepped.  We would like to state that we treat every grave now as we did back in 2014 but want to look into your grandfather's for you.  If you could kindly call us directly at 205-322-0543 so we can get your grandfather's name that would be greatly appreciated.  Again, our sincere apologies, we hope that we can resolve this for you in a timely manner.\n\nSincerely,\nJefferson Memorial Funeral Home & Gardens"}, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "106586165843165924095", "name": "Gina Huie", "time": 1492227766471, "rating": 5.0, "text": "It's very peaceful, and nice. The staff are warm and friendly, especially Shirley Carr. My daughter is laid to rest there.", "pics": null, "resp": {"time": 1547230358148, "text": "Thank you Gina, We appreciate the kind words!"}, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "100548863999534517060", "name": "Dagney Doodle", "time": 1547586096845, "rating": 1.0, "text": "Sandra was absolutely wonderful. I wish I could say that for the rest of the staff. Rude, unprofessional, lazy and the list goes on.", "pics": null, "resp": {"time": 1547670590305, "text": "Hello Dagney,\nSandra is appreciative of the compliment, Thank you!\n\nWe'd like to speak with you regarding your experience as it's difficult to understand the issue without additional insight into your situation.  If you could provide us with your real name, who you visited with, and what the issue was, we will be sure to use the information to improve our services.  We appreciate you reaching out to us and hope that you will contact us either via phone 205-655-2536 or email information@jmgardens.com so that we can try to better help you.  Thank you and have a great day!"}, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
