{"user_id": "113009980742019137961", "name": "Taylor Jeffreys", "time": 1620663813019, "rating": 5.0, "text": "Wonderful experience. They worked with me to help me get where I needed for payments and were very knowledgeable. Mario helped me and he was just so helpful. Will definitely be going back to him in the future. Plus Terrell helped me understand everything about the Mazda service side of things. Just wonderful people doing wonderful things. Very satisfied!", "pics": null, "resp": {"time": 1620738362085, "text": "Hi Taylor, we are happy to hear that you got exactly what you wanted out of your car-buying experience with us at Julio Jones Mazda. We wish you safe travels and look forward to seeing you again soon!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "114662918451938038558", "name": "PF PS", "time": 1623799854340, "rating": 5.0, "text": "Felecia was amazing! Her customer service skills are immaculate & made me feel very comfortable w/ Mazda taking care of my car needs. The car service was done within the specified time frame & I have zero complaints!", "pics": null, "resp": {"time": 1624296179951, "text": "Thanks for sharing your thoughts about your visit with Julio Jones Mazda. We are happy to hear that the team delivered such an excellent experience, we hope to see you again soon!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "116692053433244362041", "name": "Doreen Richardson", "time": 1621959594152, "rating": 5.0, "text": "Professional top notch service.Been a customer over 20 years (Quality Mazda until present) I'm a owner of a 2003 Mazda6, whenever my vehicle needs service or repair I'm in constant contact from the best service Advisor Felicia Laister.Felicia will call with\nupdates and detailed estimates before any\nrepairs are done.also Amy in parts are great and very knowledgeable.also I had the pleasure of using your shuttle service..the young man was so polite and engaging.\nOverall experience was great.Great customer\nService..great Service Department Team.\nThank you!", "pics": null, "resp": {"time": 1622035403617, "text": "Hi Doreen, thank you so much for the compliments! We're thrilled the staff and service have been nothing short of perfect. We hope to see you again soon, take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "114170441731245061529", "name": "Joey Colvin", "time": 1622830632593, "rating": 5.0, "text": "Great customer service. Will was honest and straight forward.  Very detail oriented and thorough with researching service records and getting to answers for questions. They also wash your care for you with each service appointment.", "pics": null, "resp": {"time": 1623251183584, "text": "Hi Joey, thank you so much for the compliments! We're thrilled the staff and service have been nothing short of perfect. We hope to see you again soon, take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "111271221811441106470", "name": "Frances G Rushton", "time": 1622919175954, "rating": 5.0, "text": "Desmond Windham greeted us with a smile and great attitude. Desmond was very thorough in answering our many questions and was very easy to work with. We will recommend Desmond to our friends.He has become a very good friend to us.", "pics": null, "resp": {"time": 1623251141205, "text": "Frances, on behalf of all of us at Julio Jones Mazda, I would like to thank you for sharing this great review about our dealership! We are thrilled that you enjoyed your experience with Desmond and we hope to see you again soon, take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "101814111542587674515", "name": "Donald Elswick", "time": 1624475402130, "rating": 5.0, "text": "Great car buying experience.  Salesperson (Desmond) focuses on delighting the customer.", "pics": null, "resp": {"time": 1624980321700, "text": "Hi Donald, we are happy to hear that you got exactly what you wanted out of your car-buying experience with us at Julio Jones Mazda. We wish you safe travels and look forward to seeing you again soon!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "100571343101144441237", "name": "Nicole Lovejoy", "time": 1624297333448, "rating": 5.0, "text": "Desmond was awesome and help me get the best deal!! Go see him if you need a new car", "pics": null, "resp": {"time": 1624980347784, "text": "Hi Nicole, we are happy to hear that you got exactly what you wanted out of your car-buying experience with us at Julio Jones Mazda. We wish you safe travels and look forward to seeing you again soon!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "115122816866075397948", "name": "Pamela Davis", "time": 1619115340256, "rating": 5.0, "text": "Everything was handled quickly and efficiently which I  appreciated because I'm an out of town customer. Felicia was polite, professional and kept me apprised of progress. Waiting area was clean. Overall an uneventful pleasant experience.", "pics": null, "resp": {"time": 1619486962595, "text": "Each and every day we strive to be excellent - reviews like yours are always the goal. Thank you for taking time out of your busy day to recognize us."}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "106141899195341283021", "name": "chris skoglund", "time": 1621602241160, "rating": 1.0, "text": "Really had a bad experience with these guys. For Julio to have such a great name in our area to have bad management working for him really took me by surprise. Had a deal on a car we agree on the price told the manager that we would be there first thing in the morning to pick the car up. Even offered to pay for it over the phone. Got a text at 9 pm that they had sold it for more money without even giving me a option to match the price. Just really bad customer service and won’t recommend dealing with them.", "pics": null, "resp": {"time": 1622036251072, "text": "Hi Chris, thank you for taking the time to leave us a review. We are disappointed to learn of your experience and want to apologize for our lack in communication about the vehicle that you were interested in. Customer satisfaction is very important to us and we will be sure to take this opportunity to improve. We hope you have a great day, take care."}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "107838936267125329741", "name": "Amy Phifer", "time": 1617243694970, "rating": 5.0, "text": "We purchased a Mazda CX-5 from Julio Jones Mazda  today. My salesman Chivas Meadows was one of the best I’ve worked with in terms of honesty, professionalism and kindness. I would definitely buy another car from him and would send my friends to purchase from him also. Thank you Chivas!!!", "pics": null, "resp": {"time": 1617801323140, "text": "Hi Amy, Thank you for sharing your 5-star review with us! We are happy to hear that Chivas was so helpful and informative, and helped you pick out your perfect car! We appreciate your business and hope to work with you again."}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "112811302651765231392", "name": "Flatcreek Farms", "time": 1622843702453, "rating": 5.0, "text": "Desmond did the best job hands down on buying my new truck he was the best anyone looking for a car or truck come to him he is awesome", "pics": null, "resp": {"time": 1623251168192, "text": "We are happy to hear that you got exactly what you wanted out of your car-buying experience with us at Julio Jones Mazda. Thank you for your feedback and we wish you safe travels and look forward to seeing you again soon!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "100731074656818874015", "name": "Angela Chelette", "time": 1612111376704, "rating": 5.0, "text": "Julio Jones Mazda kept impressing me each time I had contact with an employee. Felicia in Service was so professional and patient taking time to answer my questions and explain\nwhat was being done or what findings were made about my car. She arranged a loaner car that was totally unexpected and highly appreciated as I was essentially stranded in town. I apologize that I do not recall the gentleman in Sales who I spoke to briefly, very sympathetic to my situation; to the Service manager Matt, who advised he would allow my vehicle to remain on lot until picked up; to John who shuttled me to a car rental to leave town. Everyone, at every encounter, went above and beyond to make my experience as pleasant as possible; they were honest, upfront and exhibited complete trustworthiness, which was very refreshing to experience. Thank you all and keep up the great customer care! It really makes all the difference.", "pics": null, "resp": {"time": 1621535030719, "text": "Angela, on behalf of all of us at Julio Jones Kia, I would like to thank you for sharing this great review about our dealership! We are thrilled that you enjoyed your experience with us and we hope to see you again soon, take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "115136434795718386613", "name": "Reginia Callaway", "time": 1622749325896, "rating": 5.0, "text": "Come see Desmond at Mazda great salesman and can get the job done excellent people skills and all", "pics": null, "resp": {"time": 1623251212261, "text": "Hi Reginia, we are happy to hear that you got exactly what you wanted out of your car-buying experience with us at Julio Jones Kia. We wish you safe travels and look forward to seeing you again soon!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "102413804086805250926", "name": "Edward Phillips", "time": 1624131012633, "rating": 5.0, "text": "Everyone in the service department is so nice and make you feel really comfortable.", "pics": null, "resp": {"time": 1624296071428, "text": "Hi Edward, thank you so much for the compliments! We're thrilled the staff and service have been nothing short of perfect. We hope to see you again soon, take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "102965763092370657331", "name": "Lazonta Boykin", "time": 1622331129278, "rating": 5.0, "text": "I came to Julio Jones Mazda without a doubt trying to purchase a car didn’t know if it was possible but Desmond made my experience great on getting me in a brand new cx5 if anybody looking for a car come to Julio Jones Mazda and ask for Desmond he was awesome", "pics": null, "resp": {"time": 1622644431828, "text": "Lazonta, thank you for such a thoughtful review! We are thrilled to hear about your great sales experience with Desmond! We appreciate your business and look forward to seeing you again! Have a wonderful day!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "109162485980990075109", "name": "Ronald Kemper", "time": 1624061398002, "rating": 5.0, "text": "I just bought a car from Julio Jones in Tuscaloosa Alabama.Desmond was a very good salesman he worked with me all week to get me approved. He was very patient with my situation.", "pics": null, "resp": {"time": 1624296091658, "text": "Hi Ronald, we are happy to hear that you got exactly what you wanted out of your car-buying experience with us at Julio Jones Mazda. We wish you safe travels and look forward to seeing you again soon!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "107903381047709184803", "name": "julian george", "time": 1621975716252, "rating": 5.0, "text": "Come see Desmond at Julio Jones he was awesome In getting me great deal with my car", "pics": null, "resp": {"time": 1622035392481, "text": "Hi Julian, we are happy to hear that you got exactly what you wanted out of your car-buying experience with us at Julio Jones Mazda. We wish you safe travels and look forward to seeing you again soon!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "111981624177343960951", "name": "Jonathan Ford", "time": 1612114001358, "rating": 4.0, "text": "I had a unique situation where my local Mazda had no 2020 units of the CX5 Signature in stock. So I searched and found one 2.5 hours away at Julio Mazda.  I worked with Melissa and Matthew to get my SUV.  Melissa was excellent in her communications with me back and forth.  Matthew was the salesman that helped me once I arrived with the paperwork.  He made sure the vehicle was cleaned and full of fuel before I left.  Met with Mike the GM and even spoke with him on the phone prior to arriving to be sure the numbers worked were to my liking.", "pics": null, "resp": {"time": 1621534966091, "text": "Each and every day we strive to be excellent - reviews like yours are always the goal. Thank you for taking time out of your busy day to recognize us."}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "113159935819288159639", "name": "sharon Skoglund", "time": 1621601713104, "rating": 1.0, "text": "Horrible to have someone making an 8 hour trip to buy a car from you CASH only to get a text at 930 the night before telling you they got more money out of someone else so they sold it to them. That's a horrible way to do business!! Manager Chris should have not even allowed that to happen!", "pics": null, "resp": {"time": 1622036264850, "text": "Hi Sharon, thank you for taking the time to leave us a review. We are disappointed to learn of your experience and want to apologize for our lack in communication about the vehicle that you were interested in. Customer satisfaction is very important to us and we will be sure to take this opportunity to improve. We hope you have a great day, take care."}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "113289584172499659913", "name": "Ted Mcmullen", "time": 1621103417352, "rating": 5.0, "text": "Thanks Julio Jones Mazda for helping me achieve a dream of mines in buying an new car! You guys are amazing thanks.", "pics": null, "resp": {"time": 1621260741215, "text": "Hi Ted, we are happy to hear that you got exactly what you wanted out of your car-buying experience with us at Julio Jones Mazda. We wish you safe travels and look forward to seeing you again soon!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "102456101900453115692", "name": "Leslie Richardson", "time": 1619799022622, "rating": 5.0, "text": "These guys work HARD to get you the car specific to your needs! I walked in with a 2018 Camaro & was blessed with a 2021 CX-5 walking out. See Mario Garner for all of your automotive needs. He will take care of you!", "pics": null, "resp": {"time": 1620226818238, "text": "Hi Leslie, congratulations on you new 2021 CX-5! Delivering a memorable and enjoyable experience is exactly what we strive to be known for. Thanks so much for choosing us and we appreciate you taking a moment to let us know how everything went, take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "117725082720843009350", "name": "Lisa Dorr", "time": 1624059116633, "rating": 5.0, "text": "Desmond was fantastic. Knowledgeable and friendly", "pics": null, "resp": {"time": 1624296113583, "text": "Lisa, on behalf of all of us at Julio Jones Mazda, I would like to thank you for sharing this great review about our dealership! We are thrilled that you enjoyed your experience with Desmond and we hope to see you again soon, take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "114340577882604315305", "name": "April Dansby", "time": 1619906759205, "rating": 5.0, "text": "Desmond Windham is the best Thanks for a job well done please go see him he's the man", "pics": null, "resp": {"time": 1620226783031, "text": "Each and every day we strive to be excellent - reviews like yours are always the goal. Thank you for taking time out of your busy day to recognize us."}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "114177939572469330707", "name": "Kenya Beard", "time": 1615994470685, "rating": 4.0, "text": "I always have a wonderful experience with both the service department and sales team at Julio Jones Mazda. Fast and friendly service! Awesome job!!", "pics": null, "resp": {"time": 1616443060994, "text": "Kenya, on behalf of all of us at Julio Jones Mazda, I would like to thank you for sharing this great review about our dealership! We are thrilled that you enjoyed your experience with us and we hope to see you again soon, take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "109953721265510909248", "name": "Sayona Brown", "time": 1612073485537, "rating": 5.0, "text": "They were very professional and helpful. They went above and beyond to offer great customer service. They explained every issue that i had with my car. I will definitely be taking my Mazda to them from now on.", "pics": null, "resp": {"time": 1621535045140, "text": "Sayona, on behalf of all of us at Julio Jones Kia, I would like to thank you for sharing this great review about our dealership! We are thrilled that you enjoyed your experience with us and we hope to see you again soon, take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "118050087029701910305", "name": "Anthony Williams", "time": 1623952392498, "rating": 5.0, "text": "Very good experience. Desmond did a very good job at helping me find a new car", "pics": null, "resp": {"time": 1624296133183, "text": "Hello Anthony, We are happy to hear about your awesome car-buying experience with us. Thank you for the great feedback on our staff and leaving us a five-star review. We look forward to seeing you again in the future."}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "110657811392708482780", "name": "Lauren Robertson", "time": 1620493564210, "rating": 5.0, "text": "Bought my second car from Mazda! Had the best experience and it’s all thanks to my new forever car salesman, Matthew!", "pics": null, "resp": {"time": 1620738434458, "text": "Hi Lauren, our team at Julio Jones Mazda appreciates your 5-star rating and wonderful review! We are grateful for your business and loyalty. Congratulations on your 2nd car with us, and we look forward to working with you for many years to come!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "117917604858175711726", "name": "Sonja Manthey", "time": 1623520192017, "rating": 5.0, "text": "Had a great experience buying our first Mazda with Desmond.", "pics": null, "resp": {"time": 1624980361348, "text": "Hi Sonja, we are happy to hear that you got exactly what you wanted out of your car-buying experience with us at Julio Jones Mazda. We wish you safe travels and look forward to seeing you again soon!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "114249979837274937518", "name": "Alan Manning", "time": 1623710792773, "rating": 5.0, "text": "I absolutely love the service I received! Truly great, and very friendly staff. They do a wonderful job taking care of you and making sure all of your needs are met while you wait on your car to be serviced.", "pics": null, "resp": {"time": 1624296814938, "text": "Alan, on behalf of all of us at Julio Jones Mazda, I would like to thank you for sharing this great review about our dealership! We are thrilled that you enjoyed your experience with us and we hope to see you again soon, take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "105076049979154955099", "name": "Tabitha Payne", "time": 1604008829837, "rating": 5.0, "text": "I met Matthew Moss while looking at the Mazda 6’s. He introduced himself and asked some questions about my needs in a car. He pointed out the safety features, the roominess of the car, the amazing gas mileage and other features found in the Mazda 6.\nMatthew introduced me to Rick Cantrell. They were both extremely knowledgeable and in no way were “pushy” or made me feel the importance of buying a car that day. I felt a sense of trust in talking with both of them.\nI went home did my research and emailed Rick to send me a final cost breakdown. I was extremely happy with it and told him that I’d be there after work to pick it up.\nWhen I arrived, it had been cleaned and the gas tank was full! I drove off in the first new car that I’d purchased in over 20 years. I absolutely love my new car and would recommend Matthew and Rick to anyone who asks me about my car.", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "110616324616470920682", "name": "JauWana Dansby", "time": 1619906954052, "rating": 5.0, "text": "Thanks for your help and hardwork. Desmond Windham... I will be tell more people about you guys.", "pics": null, "resp": {"time": 1620226772907, "text": "Our reputation is one of our top priorities. Your positive review is what we are always striving for!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "113473660320350977435", "name": "Christopher (Chris) Gill", "time": 1613061202213, "rating": 4.0, "text": "If I had just dealt with the service department it would be a five star rating. The young lady that helped me with my service was friendly, professional, and was on top of the process the whole way!\n\nThey lose a star because the parts department left a lot to be desired. It was next to impossible to get them on the phone and after a while the system sends you to a voicemail that no one apparently ever checks. I left 8 or 9 messages and never got a call back. My part had been there for three days before I found out from someone in service (when I called) that it had arrived. They either need more people in parts to handle the load or better training.", "pics": null, "resp": {"time": 1621534940690, "text": "Hi Christopher, thank you for taking the time to provide us with your feedback. We are happy that you enjoyed your experience with us - but do want to apologize for the negative experience you had with our Parts department. This is not acceptable and it will be looked into and addressed immediately. We appreciate your business and hope to work with you again soon. Take care."}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "109299300103227828697", "name": "James Lee", "time": 1625041784086, "rating": 5.0, "text": "I was given caring professional service.", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "107651163472919475213", "name": "James Weiley", "time": 1615490597642, "rating": 5.0, "text": "Everyone there is so sweet.they make sure that you are taking care of.and if you sit and wait.they make sure that you are comfortable.thank y’all for being so nice and sweet.", "pics": null, "resp": {"time": 1617801356439, "text": "James, on behalf of all of us at Julio Jones Mazda, I would like to thank you for sharing this great review about our dealership! We are thrilled that you enjoyed your experience with us and we hope to see you again soon, take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "108896280567073478755", "name": "Iyana Strother", "time": 1617969686561, "rating": 5.0, "text": "Felicia in sales is very sweet and patient. Great service.", "pics": null, "resp": {"time": 1619487006240, "text": "Iyana, on behalf of all of us at Julio Jones Mazda, I would like to thank you for sharing this great review about our dealership! We are thrilled that you enjoyed your experience with Felicia and we hope to see you again soon, take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "112332947152959203083", "name": "tj 7847", "time": 1613498768711, "rating": 5.0, "text": "The sales associate Chevy was a great help and got me into a vehicle quickly and easy. Would recommend anyone to do business with them.", "pics": null, "resp": {"time": 1621534834609, "text": "Hi TJ, we are happy to hear that you got exactly what you wanted out of your car-buying experience with us at Julio Jones Kia with Chevy. We wish you safe travels and look forward to seeing you again soon!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "112170514225292018668", "name": "Arnold Takundwa", "time": 1606179702831, "rating": 5.0, "text": "The service department was excellent! My service advisor, Felicia Laister, was knowledgeable, professional, and kind. She made sure that my experience was a great one. I've had bad experiences with other area Mazda dealerships in the past. Thankfully, that wasn't the case here. Many thanks!", "pics": null, "resp": {"time": 1607528856642, "text": "Hi Arnold, thank you so much for the compliments! We're thrilled the staff and service have been nothing short of perfect. We hope to see you again soon, take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "109670237061631926119", "name": "Calvin Dennis", "time": 1615910015039, "rating": 5.0, "text": "The only thing they did that sticks out that was different than normal was the fact they did all they could to help me out and agree to reasonable prices . Friendly staff , very relatable . Recommend this dealership to anyone looking for a great car !", "pics": null, "resp": {"time": 1616443097696, "text": "Hi Calvin, thank you for sharing your feedback! At Julio Jones Mazda, our team strives to offer exceptional customer service and we are thrilled to hear that we hit the mark. We hope to see you again soon, take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "114275182014593797058", "name": "Smita S", "time": 1611401995513, "rating": 5.0, "text": "I was driving through Tuscaloosa on the way home, and the knocking sound in my car was driving me crazy. I’d just gotten my car looked at in my hometown and told nothing was wrong, but that just didn’t seem right. I called to make an appointment at Julio’s. They saw me immediately, found the problem within minutes (loose lug nuts), explained what must have happened, where it was, and fixed it + washed my car as part of their complimentary services. Lol got a tour of the place while I was waiting, too. Never been treated that nicely at a Mazda dealership in the 5 years I’ve been going to them in three different states.", "pics": null, "resp": {"time": 1611592584690, "text": "Hi Smita, thank you so much for your awesome review. We want nothing but the best for our customers, and we're so happy you had such a great experience with us! We will continue to bring you quality service and help you out with all your car needs. Take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "101639665771088316035", "name": "Julia Prince", "time": 1614274972280, "rating": 5.0, "text": "Chevy was very professional helpful Love that guy goes beyond the call of duty", "pics": null, "resp": {"time": 1616443157630, "text": "Julia, on behalf of all of us at Julio Jones Mazda, I would like to thank you for sharing this great review about our dealership! We are thrilled that you enjoyed your experience with Chevy and we hope to see you again soon, take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "113632413928015151439", "name": "debbie crocker", "time": 1609962308547, "rating": 5.0, "text": "They were the best! Matthew Moss and Jordan Sizemore we’re so helpful! They helped me whole way through the deal with all my questions and my grandkids! I would recommend them to everyone!", "pics": null, "resp": {"time": 1611592672635, "text": "Thank you so much for sharing your experience with Julio Jones Mazda, Debbie. Our goal is 100% customer satisfaction and it sounds like we achieved that goal with you. We appreciate your business and we hope to see you again soon. Take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "100215678104423744241", "name": "maggie lloyd", "time": 1615581471829, "rating": 5.0, "text": "Friendly people great prices, good services", "pics": null, "resp": {"time": 1616443112768, "text": "Thank you so much for taking the time to leave us a wonderful rating and review for our team! We'll be sure to pass your kind words along. We look forward to working with you again!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "117335114394910583136", "name": "Carlton Posey", "time": 1617862045580, "rating": 5.0, "text": "I just want to congratulate MAZDA for being #1 in \"Consumer Reports.\"  NOTE:  the beaten include BMW, MERCEDES, TOYOTA, HONDA, & 27 other car manufacturers!!!!!!!!", "pics": null, "resp": {"time": 1619487032544, "text": "Hi Carlton, thank you for leaving us such a great review! The team here at Julio Jones Mazda is thrilled to know we exceeded your expectations and it's wonderful to hear that your most recent visit with us is deserving of your 5-stars. We look forward to working with you again soon, take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "107566669260016853268", "name": "Aaron Cano", "time": 1602367388614, "rating": 5.0, "text": "I always receive the best service from Julio Jones Kia Mazda!! Their staff is so personable and helpful. Special thanks to Mr.Rivera and Felicia! I can always trust them to go above and beyond expectations.", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "109897473369779856878", "name": "Jill Felts", "time": 1601580121627, "rating": 5.0, "text": "The staff at Julio Jones Mazda are very friendly! Felicia Laister, the service advisor is always so helpful with answering any questions I have about my SUV I purchased there last year. She is very professional and pleasant! Keep up the great work!", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "105845546621809418653", "name": "Cathey Kidd", "time": 1591286562110, "rating": 5.0, "text": "The people there were very welcoming and friendly. Everyone that crossed my path greeted me with a smile and a hello, even the employee that came through the door that was just passing through while I was watching TV.\n\nThe receptionist has extremely helpful, very sweet lady. She kept me updated even though I don't think I was there 45 minutes. She made sure I knew where the necessities were, she even gave me the remote LOL.\n\nThe service were GREAT & FAST. I was told it may take an hour but like I said before, I don't think I was there 45 minutes. I even receive a complimentary car wash.\n\nThank you Julio Jones Mazda. I don't know when, but I will definitely be back.", "pics": null, "resp": {"time": 1592409736835, "text": "Thank you so much for your great review, Cathey! We're glad that our entire team provided you with such a positive experience. If you ever need anything in the future, please don't hesitate to let us know. Take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "112140737438539494589", "name": "Jazlyn Gaines", "time": 1616791310129, "rating": 5.0, "text": "Very nice and efficient! :) Thank y’all for the help!", "pics": null, "resp": {"time": 1617801365148, "text": "Each and every day we strive to be excellent - reviews like yours are always the goal. Thank you for taking time out of your busy day to recognize us."}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "101701031133188649351", "name": "Caitlin Burton", "time": 1601395008808, "rating": 5.0, "text": "Wonderful service and staff! The team provided accommodations to my needs as I waited! Also, they sent text updates regarding my appointment and called when they were finished with my vehicle. Will be coming back, thank you!!", "pics": null, "resp": {"time": 1601561277824, "text": "Hi Caitlin, thank you so much for the compliments! We're thrilled the staff and service have been nothing short of perfect. We hope to see you again soon, take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "107605097345219069219", "name": "Jerry Carter", "time": 1603468084604, "rating": 5.0, "text": "Great Service,  courteous staff.  I bought a 2015 CX5 there and I really enjoy the car. Also, I was having trouble with a 2002 VW Passat.  They asked me to bring it in and the certified technician fixed it.  Great place to do business!", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "106905249317041613313", "name": "Demetrius Peoples", "time": 1578951145010, "rating": 5.0, "text": "My Sales Consultant was Todd Herbert. Todd provided a very welcoming experience at Julio Jones Mazda. Todd was honest, transparent, and has extensive valuable knowledge of the automotive industry. Todd was very instrumental in providing me with a great deal. I would recommend Todd Herbert as a Sales Consultant to my friends and family. I would also recommend Julio Jones Mazda for anyone looking for a quality vehicle at an excellent deal.", "pics": null, "resp": {"time": 1579723194444, "text": "Hi Demetrius, thank you for taking the time to leave us this feedback. We truly appreciate that you chose Julio Jones Mazda and are happy to hear about your positive experience with us. If you need anything else, please let us know!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "111212538321209009942", "name": "Jacqueline Hood", "time": 1603911933837, "rating": 5.0, "text": "Julio Jones Mazda is the place to get ur vehicle’s.  The staff is very friendly and nice. This is my second vehicle I purchase frm them.\nThank you’ll.", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "115350999967540219137", "name": "Shelita Crowell", "time": 1596757526978, "rating": 5.0, "text": "Quick and Easy Process! Car Doctor made us feel welcome and got us the car we wanted. We will definitely be telling others to go to Julio Jones Kia!", "pics": null, "resp": {"time": 1597087017349, "text": "Hi Shelita, we are happy to hear that you got exactly what you wanted out of your car-buying experience with us at Julio Jonrd Mazda. We wish you safe travels and look forward to seeing you again soon!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "104583740666398781902", "name": "Leigh Persky", "time": 1597597104148, "rating": 5.0, "text": "My son is a student at UA and had a flat.  Usually no big deal except the key for his locking lugs snapped in two.   I called the service center at 2 and they said bring it on over and they would get it taken care of.  He had to have his car so he.could get to all of his Million Dollar Band practices which started the day after.   When I explained that they were more than willing to help.  Got it done with no problems.  Great crew and service writer.  If you need help you should visit Julio Jones Mazda.", "pics": null, "resp": {"time": 1599504256567, "text": "Hi Leigh, thanks for leaving us a review! We appreciate the opportunity to earn your business and are honored you trust your vehicle needs with us. Please do not hesitate to reach out if we can be of any further assistance until then take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "115972697703407323859", "name": "Callie Rhodes Outlaw", "time": 1601223878834, "rating": 5.0, "text": "I bought a vehicle here in May and had a great experience. Everyone was so friendly.", "pics": null, "resp": {"time": 1601561484880, "text": "Hi Callie, we are happy to hear that you got exactly what you wanted out of your car-buying experience with us at Julio Jones Mazda. We wish you safe travels and look forward to seeing you again soon!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "114576909580337517760", "name": "Suzanne Henson", "time": 1594167183984, "rating": 1.0, "text": "Prior to Friday, July 3, I would have given a 5 star rating to this dealership. However, on July 3, I found myself on the side of Hwy 82 for 3 hours with the oil light on, despite having the vehicle in for the 8,000 mile servicing the day prior. I was told Monday, July 6 the vehicle was 1 quart low on oil and the technician had been fired. The previous Friday I was told the technician had a long history of no problems. While the dealership manager listened and offered a complimentary service, I doubt anything I was told. I will be attempting to trade the vehicle soon.", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "116732407783948548467", "name": "Grace Schepis", "time": 1610602177569, "rating": 5.0, "text": "Outstanding, fast service! Thank you.", "pics": null, "resp": {"time": 1611592647095, "text": "Hi Grace, thank you so much for the compliments! We're thrilled the staff and service have been nothing short of perfect. We hope to see you again soon, take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "105506240208757249809", "name": "rushing concrete", "time": 1618939167554, "rating": 5.0, "text": "Desmond was a great salesman!!", "pics": null, "resp": {"time": 1619486964598, "text": "Each and every day we strive to be excellent - reviews like yours are always the goal. Thank you for taking time out of your busy day to recognize us."}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "104581824447317411136", "name": "Jill Lancaster", "time": 1611161273515, "rating": 5.0, "text": "Very good costumers service.", "pics": null, "resp": {"time": 1611592603318, "text": "Thank you for your 5-star rating, Jill. We truly appreciate you choosing Julio Jones Mazda for your automotive needs. We hope to see you again soon, take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "118171933776546794215", "name": "Preston O'Neal", "time": 1593729903914, "rating": 5.0, "text": "Great service and great people! Would highly recommend this place to anybody! Got in and out in a hurry.", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "116731088165523981872", "name": "Trina Busby", "time": 1578534716464, "rating": 5.0, "text": "I had been looking at Lexus and BMW for my new car purchase when I saw the new Mazda commercial and decided to check them out.  I was amazed that the number of amenities combined with the price blew the other brands away, and I left in a new CX-5!  My salesman Todd Hebert was so knowledgeable and enthusiastic that it made my car-buying experience easy!  The quality and affordability of the Mazda makes me recommend it to anyone looking for a new car!  From my salesman Todd to the sales manager Larry Taylor to the finance person James Otieno, the service at Julio Jones Mazda is amazing.  If you’re looking for a new car, I highly recommend Todd Hebert and the whole Mazda team.", "pics": null, "resp": {"time": 1578943885291, "text": "Hi Trina, thank you for choosing Julio Jones Mazda and for this feedback. We work hard to deliver great care to all our customers and we're happy to see that was reflected in your visit. Thanks again for your business and we hope to be here for you for miles to come!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "106208861822653374932", "name": "Samantha Ray", "time": 1578789234007, "rating": 1.0, "text": "I guess they are too busy to sell a car. I called early one day and never got a call back. Called again the next day and they were rude but took my number again. Still never heard back from them. It's probably best, I found the exact same vehicle with less miles for way less money in Birmingham.", "pics": null, "resp": {"time": 1578943661539, "text": "Hi Samantha, thank you for bringing this to our attention. Our goal is for everyone to only have positive experiences with us and so we apologize that you had a negative experience. We tried to see if we had any records of you in our system and we could not find you with your name, if there is anything more that we can do to address your concerns please send me an email to wecare@buyfromjulio.com. Thank you, take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "100017241809617989437", "name": "Robert Jones", "time": 1592613798812, "rating": 5.0, "text": "I could not have asked for more courteous or prompt attention. These are professionals.\nAn engine alert light appeared while we were on the interstate in route. We phoned ahead to Julio Jones and described our problem. They were waiting for us when we arrived, immediately attended to our problem, and  had us on our way in 30-40 minutes.", "pics": null, "resp": {"time": 1592945711070, "text": "Hi Robert, we couldn't be more grateful that you took the time to write this review about your last visit with us! Customer satisfaction is always our top priority, and it pleases us to hear of your experience! We look forward to working with you again down the road, take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "105855916967892342980", "name": "Lisa Nix", "time": 1578611937262, "rating": 5.0, "text": "Thanks Belinda for making our first visit to Julio Jones Mazda in Tuscaloosa amazing!!  I highly recommend this dealership!  Very professional and fun to work with!", "pics": null, "resp": {"time": 1578943816121, "text": "Hi Lisa, thank you so much for sharing your experience with us. Our goal is always 100% customer satisfaction and it sound like we achieved that goal with you. We appreciate your business and we look forward to working with you again next time!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "107490805219289183869", "name": "Steve Nix", "time": 1578613193905, "rating": 5.0, "text": "Dealing with Belinda at Julio Jones Mazda was pleasurable experience to say the least. Great staff throughout the entire dealership. Thanks for my new Mazda.", "pics": null, "resp": {"time": 1578943753999, "text": "Hi Steve, thank you for taking the time to leave us your feedback. We strive to ensure every customers experience is exception, and we are happy to hear that we delivered that for you. We hope to work with you again soon, take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "113319395098617394166", "name": "Beth Thomas", "time": 1567483942316, "rating": 3.0, "text": "Nice people but they don't stand behind the tires they sell. They charge for balance and rotation every time you go in. First place I have ever been that did that. In the past, balancing was always free when you bought the tires at other businesses.", "pics": null, "resp": {"time": 1568233408768, "text": "Hi Beth, we appreciate your feedback and you bringing this to our attention. Unfortunately, typically we still charge for this type of service but it is definitely something we can look into changing. We apologize for the inconvenience you experienced and if there is anything further you would like to discuss or something that we could do in order to recieve your future satisfaction please send me an email to wecare@buyfromjulio.com. Thanks, and have a great day."}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "112854034155489325277", "name": "Kristi Pierce", "time": 1611440306488, "rating": 5.0, "text": "Go see my buddy Desmond if you are looking for a Mazda!!!", "pics": null, "resp": {"time": 1611592548886, "text": "Kristi, on behalf of all of us at Julio Jones Mazda, I would like to thank you for sharing this great review about our dealership! We are thrilled that you enjoyed your experience with Desmond and we hope to see you again soon, take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "110631865142312771711", "name": "Austin Russell", "time": 1567526395834, "rating": 5.0, "text": "Corey Woddruff was a very fair and enthusiastic salesman. I live in Birmingham and Corey delivered my car to me at the bank so I could get some paperwork finalized without driving back to Tuscaloosa. No complaints and once again Corey went above and beyond.", "pics": null, "resp": {"time": 1568045099655, "text": "Austin, thank you for sharing your experience with us! Our team works incredibly hard to exemplify the commitment to customer care and we're so thankful that your time with us was well spent. Please feel free to reach out to us with any questions or future auto needs, as we are always here to help."}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "110216437581777697002", "name": "Lisa Bryant", "time": 1596904879286, "rating": 5.0, "text": "Great people great service and my car detailed! Who could ask for more!!??", "pics": null, "resp": {"time": 1597086966785, "text": "Hi Lisa, thanks for leaving us a review! We appreciate the opportunity to earn your business and are honored you trust your vehicle needs with us. Please do not hesitate to reach out if we can be of any further assistance until then take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "115363220133242480026", "name": "Juliann Winfree", "time": 1567278634222, "rating": 5.0, "text": "Belinda Bender was really enthusiastic and helped us into a new car! She led us through a complicated process and we ended up with a car we love. The renovations on the buildings are beautiful. Go to Julio Jones.", "pics": null, "resp": {"time": 1568045415100, "text": "Thank you for taking time out of your day to recognize us, Juliann. We apprecaite your business and are pleased you had such a fantastic experience with our team here at Julio Jones Mazda. We look forward to being here for you for miles to come, take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "102010925889323704417", "name": "Lisa Song", "time": 1595447689550, "rating": 5.0, "text": "Good place! Nice people!", "pics": null, "resp": {"time": 1597087045798, "text": "Thank you so much for taking the time to share your feedback with us, Lisa! We work hard to make sure our guests have an awesome experience. We will share your comments with our team and we look forward to working with you again down the road."}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "113687624730027979938", "name": "James Roper", "time": 1583693184505, "rating": 5.0, "text": "I have bought my last 3 cars from julio jones mazda(streak of bad luck) but I wouldn't buy anywhere or from anyone else but julio jones mazda and the car doctor ansharn glenn. He is hands down the most effective car salesman I have ever seen. If you need a new car head on over to julio jones and see the car doctor. The service staff is amazing. Dylan at Kia and Felicia over at mazda. The entire staff goes above and beyond at every opportunity. Thanks to all of you for the help you have given me.", "pics": null, "resp": {"time": 1588788722325, "text": "Hi James, thank you so much for being a continued loyal customer of ours here at Julio Jones Mazda. We appreciate your 5-star review and look forward to being here for you for many more years. Take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "108930870597024868832", "name": "Debra Gibson", "time": 1602097334943, "rating": 5.0, "text": "Great service as always.", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "106163407581101929295", "name": "Cassie Smith", "time": 1533757304189, "rating": 5.0, "text": "Excellent experience. Great customer service. Terrell took the time to find out what we wanted and found a vehicle to match. Pricing was fair and we got a great deal.", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "107502699567295500522", "name": "Randie Watkins", "time": 1592592513301, "rating": 3.0, "text": "Our salesman was great, price was great, disappointed in the rest.", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "104525142086017509911", "name": "DjE 3000", "time": 1578312018536, "rating": 5.0, "text": "Wonderfull dealership they want you to have a new car every year if possible lol!!", "pics": null, "resp": {"time": 1578426117436, "text": "Thank you for the positive feedback and for your business. We are dedicated to providing wonderful experiences to all of our guests, have a great day!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "105023299228483481913", "name": "Caroline Brown", "time": 1567028215263, "rating": 5.0, "text": "Ansharn Glenn (The CAR Doctor) was amazing! He got me in a car quick and easy! Hands down he’s the best!!!!", "pics": null, "resp": {"time": 1568045466237, "text": "Thank you for leaving us this great review, Caroline. I am very happy to hear that Asharn could provide you with such a seam-less car buying experience. Please come back and see us again in the future with anything else you might need. Take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "108701254960512716433", "name": "Tamika Malveo", "time": 1608137505318, "rating": 5.0, "text": "Great Service!", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "113046993304160440685", "name": "Ron Haskins", "time": 1594916918991, "rating": 5.0, "text": "Excellent service and customer care.", "pics": null, "resp": {"time": 1595019806741, "text": "Hi Ron, thank you for taking the time to write a positive review! We're thrilled to hear you're satisfied with the high level of customer service you received at Julio Jones Mazda. Please do not hesitate to reach out if there is anything else you should need, take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "108168527379854651463", "name": "Tim Tubbs", "time": 1568245332842, "rating": 5.0, "text": "AJ was our salesman and he is great this is the person who you want to sale you a car I have nothing but praise to the entire sales force", "pics": null, "resp": {"time": 1568323278283, "text": "Thanks so much for this great feedback and your business, Tim! We were happy to help you and give you a wonderful car-buying experience. We look forward to being here for you for any future automotive needs you may have, take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "118139534514086138507", "name": "Misty Weekley", "time": 1522875093746, "rating": 5.0, "text": "I bought my new Mazda CX-5 Saturday from Julio Jones Mazda and I had a great experience there. They beat the price of the dealership I had been looking at in Birmingham and the staff there was great to work with. If you need a new car, go see Mark or Terry at this dealership! Terry is a great honest guy and such a nice guy to work with. You won’t be disappointed! My finance guy was great too! Explained everything thoroughly to me and answered all the questions I had. I am glad I kept my business in Tuscaloosa and used Julio Jones Mazda to buy my vehicle!", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "102168534723563809007", "name": "Jesse Norris", "time": 1553441160255, "rating": 5.0, "text": "Quick for service.  Plus, they had boy scouts slot car racing in the main lobby.  Made the wait feel even shorter.", "pics": null, "resp": {"time": 1553699592826, "text": "Jesse, thanks for the 5-star review and your business! We are pleased to hear you had such a positive experience waiting for your car to be serviced, take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "114167220302985416269", "name": "Drew Huang", "time": 1566317483607, "rating": 1.0, "text": "No one ever answer the phone at parts department.  Call many times even left messages, no one calls me back.", "pics": null, "resp": {"time": 1566323540334, "text": "Drew, we are very sorry about this. Could you please send us your best contact info to wecare@buyfromjulio.com and someone will follow up with you right away. We have been having extensive phone issues and we appreciate your patience working through this. Thank you"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "117464223796229440349", "name": "Sandrine Hope", "time": 1522860422307, "rating": 4.0, "text": "The existence was very good. They took the time to talk to us about what we wanted and about the car. Upon purchase they even made sure we knew about all the features of the car by going over each one of them.", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "104315721711991955598", "name": "Lorin Floyd", "time": 1532292052222, "rating": 5.0, "text": "My mother purchased my dream car which is the Mazda CX-3 from Julio Jones Mazda in Tuscaloosa, Alabama. After she surprised me with the car, she told me that this was the easiest car buying experience that she has ever experienced. She began to tell me that their customer service was extraordinary and that she would highly recommend the dealership and using Jared Davis as the salesman. After my surprise I returned to the dealership for Jared to show me all of the car’s features. As soon I pulled up, he ran outside and was very excited to meet me. He was very nice, funny, and thoroughly went over how everything worked. He even folded all of the pages in the owner’s manual that I would need. As we were talking I found out that we are going to the same University and have the same major, and he even offered to give me advice for the school as well. With that, I would highly recommend Julio Jones Mazda and Jared Davis to any future car buyers.", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "104080252776009686656", "name": "E m Culp", "time": 1534990235632, "rating": 4.0, "text": "I have been using Mazda service for years. The service department needed to keep my old car overnight, they loaned me a brand new Mazda-3, great service but it gave me the new car bug. Highly recommend", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "110621833154202733349", "name": "Julia Mccain", "time": 1524672703219, "rating": 5.0, "text": "This is the place to go if you have any trouble with your vehicle. The Service Department went the extra mile to to help me!!  Five stars to the whole department!!  SUPER NICE!!", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "107540448311162823192", "name": "Robert W. Lewis", "time": 1558907459447, "rating": 5.0, "text": "Wasn't expecting to buy a car but these guys and gals up here are so nice and patient, I'm very undecisive and not used to buying new cars but they made it very pleasant and Belinda at Julio Jones went above and beyond to get me in my very first new Mazda 3 Grand touring manual trans at the best price possible!!! I'll will be back again.", "pics": null, "resp": {"time": 1559578995449, "text": "Thanks for the 5-stars, Robert! We are so glad Belinda was there to ensure you had a smooth and easy car-buying experience. Please feel free to give us a call, if you have anymore questions about your car. Take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "111247155433711293684", "name": "James Carr", "time": 1561684174564, "rating": 5.0, "text": "Mrs Belinda was very helpful very nice and also great service, I would recommend anyone to come to Julio Jones Mazda to see her (Mrs Belinda)\n😇😇😇", "pics": null, "resp": {"time": 1561744258034, "text": "Hi James, we couldn't be more grateful that you took the time to write this review about your last visit with us! Feel free to call or stop by if there is anything else we can do for you. Take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "112568517518701233532", "name": "Mike Black", "time": 1565137761295, "rating": 5.0, "text": "Harold Bishop is first class service advisor.  There is another young lady who greeted me and assisted me on my initial trip and I wish I had gotten her name.  Jeff consulted with Service tech Chad Cooper and correctly diagnosed my problem. Jeff ordered part and it arrived on day promised. Chad Installed and now I have my MAZDA back ! I was in this office several times from initial consultation until final repair.  Dealt with all same people but never all same each trip. Was impressed how they all worked together and knew what was going on.  Even repaired a recall that I did not mention.  Must admit I was little hesitant to bring my car here as this is brand new MAZDA service dept and have been going to Bham to have serviced but am totally satisfied.", "pics": null, "resp": {"time": 1565365212404, "text": "Hello Mike, we are grateful to receive your amazing review and rating! Our team enjoys going above and beyond for our customers and are happy to hear our entire team was a perfect example of what we stand for at Julio Jones KIA. It brings much joy to our team knowing you had a five-star experience with us, and that you chose us for your automotive needs. Have a great day!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "117482920690850691118", "name": "Marty Hoven", "time": 1537718344601, "rating": 5.0, "text": "I dropped by without an appointment for an oil change and had to be in and out within 2 hours. The service writer, Jamark, told me no problem. He got me right in and I was out within the hour.\nCertainly, I could have gone to one of those \"15 minute oil change\" places, but that is all you get. Here, your service is recorded and that adds to the value of the automobile when the time comes to sell or trade.", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "104379297720457898360", "name": "lamar Williams", "time": 1560900786804, "rating": 5.0, "text": "Ms Belinda & Shawn Was Very Very Helpful On Getting Me One Of My Dream Cars I Suggest You Come And Shop With Them", "pics": null, "resp": {"time": 1560954614549, "text": "Thanks so much for the 5-star review, Lamar. We are so happy we were able to put you in your dream car and look forward to helping you for miles to come! Take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "112414865227399811248", "name": "Brandon Arrigo", "time": 1539786348136, "rating": 5.0, "text": "Friendly and helpful staff. Service department is superb! This place beats Med Center Mazda in Pelham hands down in the service department. I highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "106682812945654233738", "name": "Gunars Cazers", "time": 1565372485288, "rating": 5.0, "text": "I purchased a 2018 Mazda 3 hatchback from Mr. T. Byrd at Julio Jones Mazda. Just had my cars serviced there. Mr. Bishop helped me out. I had an online coupon from the JJones Mazda website, and it was a little tricky to redeem the coupon, but we got it to work. The service was good and quick. Nice internet access and coffee while you wait. I will continue to get my Mazdas serviced there.", "pics": null, "resp": {"time": 1565632848959, "text": "Hi Gunars, we're happy to see our team provided you with the quality service you deserve when searching for your car. Welcome to the Julio Jones Mazda family and we can't wait to see you here for your next service visit!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "110643889726888058383", "name": "amanda mcdaniel", "time": 1527790243994, "rating": 5.0, "text": "Aj went above and beyond to make buying a new car fast and easy! All of the staff were very friendly and helpful. I would recommend this dealership to anyone looking to buy!", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "112648381139766217974", "name": "Drew Love", "time": 1547570589607, "rating": 5.0, "text": "Great service and buying experience! Would recommend it. Will return for next vehicle purchase.", "pics": null, "resp": {"time": 1588788755719, "text": "Hi Drew, thank you so much for this 5-star review. We are so glad to read about your positive experience with us here at Julio Jones Mazda and if you need anything else, we are always here to help!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "110561779116402753300", "name": "Ryan Wikle", "time": 1542057139127, "rating": 4.0, "text": "No complaints with the quality or price of services just how long it took to set up the appointment and get an estimate. Could be better", "pics": null, "resp": {"time": 1542073431498, "text": "Hey Ryan, we appreciate your feedback. I will send this to the correct department to address any issues you may have experienced while trying to get an appointment. Thank you!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "116720442788201221258", "name": "ryan silas", "time": 1541599177912, "rating": 5.0, "text": "Took the car there for recalls last friday. Had a tool come up missing while it was there. The manager looked into the incident and they are working to figure out what happened. They have been very helpful in resolving the matter and hopefully they can either figure out what went wrong or who took the tool. They were very prompt and professional in handling this situation and i look forward to doing business in the future. Theft makes everyone look bad no matter who did it and i hope they can find the person that did it.", "pics": null, "resp": {"time": 1588789024894, "text": "Hi Ryan, thank you for taking the time to leave us this review! We are so glad that you had such a positive experience with our team here at Julio Jones Mazda and we look forward to being here for you next time!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "117233389645950632800", "name": "Lee Thompson", "time": 1617725509871, "rating": 5.0, "text": "I went for an oil change and a tire rotation. They were very friendly and accommodating. I was in and out in 35 minutes. We have recently moved to this area so this was a relief to find a dealership so friendly.\n\nI purchased a vehicle April 5 and couldn't be happier. The dealership was very attentive to my needs. Phill Harman was my sales associate and I give him five stars for his attention. He was very knowledgeable and explained everything in detail. Phill made the whole process comfortable. I highly recommend this dealership if you are in search for a new vehicle.", "pics": null, "resp": {"time": 1522067105061, "text": "Thanks for the great review, Lee! We are so happy to see we were able to get you in and back on your way."}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "103754388958037905191", "name": "Chandricka Dunner", "time": 1535498464034, "rating": 5.0, "text": "Jared Davis Made things flow very nicely for us.He’s hilarious as well! Wouldn’t have wanted to have any other consultant help us. Thanks Julio Jones Mazda!", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "102084788163276048788", "name": "Cheryl Buchanan", "time": 1525885792343, "rating": 5.0, "text": "I arrived early for my appointment and they took my car right in. The waiting room was clean and pleasant. The service manager was helpful and attentive. He asked me what services I wanted for my car in addition to the airbag recall repair. A friendly, young salesman sat to chat with me for a few minutes as I waited. Jared asked about my Mazda and my experience with the dealership. He was genuinely interested and enthusiastic about working for Julio Jones Mazda. I learned that Tuesday’s are “Ladies Day” which meant 15% off oil changes AND free massages by a therapist from Nancy Taylor Day Spa!!! I have NEVER had such a pleasant car service experience. My car had the airbag repair, an oil change, tire rotation, 17 point inspection, and the headlight “glaucoma” polished in just over an hour. When this dealership was owned by Verta Barr, it had the reputation as the best service department in town. I think that under Julio Jones’ ownership, it will regain that reputation.", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "106178055392679707101", "name": "Larrian Tutton", "time": 1518216318712, "rating": 5.0, "text": "Just got my car serviced at the all-new Julio Jones Mazda. It was quick and the service advisor Jamark was very Knowledgeable. I recommend all Mazda customers to come here for your service, and also if you are in the market for something new.", "pics": null, "resp": {"time": 1521463766495, "text": "Thank you for the great review Larrian. We are so happy to see you had a great experience with us."}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "110460896525897247627", "name": "Vicki Allen", "time": 1529405276762, "rating": 5.0, "text": "We are from out of town and had an emergency that only the dealership could fix. They saw us right away and did everything they could to help us. We were very grateful for their prompt attention.", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "105370342057944162510", "name": "undertaker861", "time": 1524929442151, "rating": 5.0, "text": "Was there for routine service. Everything was taken care of in a timely manner. All employees that I had contact with were very nice and courteous.", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "117970140208467666992", "name": "Joseph Thomas", "time": 1553213573613, "rating": 5.0, "text": "I didn't end up getting the car but experienced nothing but exceptional service. Ronald was extremely accommodating and did everything he could to make a good deal.", "pics": null, "resp": {"time": 1553281948944, "text": "Thank you for the feedback about our team. We aim to be as helpful as possible and give everyone the best experience. We are happy to hear that in the end you got the attention you deserve while searching for a car. Take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "104933910215639614284", "name": "John Perry", "time": 1529529586876, "rating": 5.0, "text": "I was extremely pleased with the service given. Most willig to accomodate. I appreciated that they checked for any recalls on my vehicle. It's hard to say enough good things about my experience at Julio Jones Mazda. Thanks everyone.", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "111176530113872437077", "name": "Jerry Winegard", "time": 1580857346321, "rating": 5.0, "text": "Sales was great and we will certainly buy from them again.  We really like our 2019 Kia Forte S model. Service had one little hiccup but they were quick to correct it.  Julio Jones is the place to get your new Kia.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMEJYCGSeTVfv7JSvOPkbv-LnPX2YPUgk6QS8N2=w150-h150-k-no-p"]}], "resp": {"time": 1553699788415, "text": "Thank you for the 5-star review, Jerry. We are so happy to hear that you had a wonderful and smooth experience purchasing your new vehicle with Ansharn. Providing honest and efficient customer service is always our goal. Enjoy your new ride and feel free to reach out with any questions!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "109858826750511579936", "name": "Andrea Howell", "time": 1573175241121, "rating": 5.0, "text": "This is where my daughter bough her Kia.", "pics": null, "resp": {"time": 1573769348770, "text": "Hi Andrea, we appreciate the five star review and your business! We are glad you had such a positive experience and if you need anything at all, we're here to help!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "113037127657489363431", "name": "Dylan Davies", "time": 1551730940423, "rating": 1.0, "text": "What can I say? My husband and I went to look at the Mazda CX-5. We found one online, previously, and wanted to drive one before we drove all that way to Birmingham to see it. They made us a proposal, \"If we  can cut you a deal on a new one, can we have your business?\" Well, of course if the price is right then, yes. We drive a grey CX-5, everything is great, but they are calling this car \"new\" and it has 7500 miles on it. Well, it's never been owned they say its a \"demo\" car. Then my husband tells them he wants to be at $19,999 financed for this car (yes, we were putting several thousand down - we didn't expect a miracle deal). They only get it down to $20,010. Then he says, well if you throw in remote start, we will take it. They came back with each of us paying half so, we decided to buy the car.\n\nThey told us that they could get us a killer interest rate of less than one percent. When we got back to financing, it was another story entirely. We ended up wit ha 4.99 interest rate because \"less than one percent is only for \"new\" cars\" well when you were trying to negotiate this deal you said it was a new car and now that we are financing you've classified it as a \"used\" car.\n\nAfter we left, we began driving to my dad's house which is probably 100 miles away. The check engine light came on before we got there. We had O'Reily's check the computer and they said it was low oil pressure. We called and they has us call the Mazda tow truck to come pick it up and take it to the nearest Mazda which was in Birmingham. (They told me to get a rental during this time and they would pay me back.) They called for me to come pick it up three or four days later saying it was a computer problem and it was fixed. When we got there, 4 error messages were popping up on the dash. We left the car and called the sales manager at Julio Jones Mazda who never called us back and said he never got our message.\n\nI went in to talk to the Julio Jones Mazda sales manager about this problem on Monday. They had me sit there for a while and eventually said they spoke with the technician at the Birmingham Mazda and they said I must have taken my foot off the brake too early and it caused the car to throw up those error messages. So, they blamed me for the problem.\n\nLater, the technician from Birmingham called us personally and said they had screwed up and not fixed it properly to begin with. So, the sales manager at Julio Jones Mazda was either misinformed or blatantly lied to make me think it was my fault.\n\nWell, we finally got the car back and it has been running fine. No more issues. However, they still haven't paid me back for the rental and it's been almost a month. I called about this and they said they lost my receipt and asked me for the amount again. I still haven't been paid and they haven't bothered to call me back. That was a week ago.\n\nSimultaneously, I took the car in to the Julio Jones service center to get the remote start put in on a Thursday. They told me it would take a day, maybe two, to get this done. The service center is telling me that I owe our half of the remote start that was supposed to be included in the deal. Obviously, they didn't include it in the price like they said they would. Also, they had to give me a rental car because they couldn't get the remote start to work. It's now Monday and I have no clue when I am going to get my car back. I called today and they said they still couldn't get the remote start to work.\n\nNeedless to say, I don't wish this headache on anyone and I wouldn't recommend this dealership to anyone. It has been an absolute nightmare since we signed for this vehicle.", "pics": null, "resp": {"time": 1554413123364, "text": "Hi Dylan, thank you for your feedback. We sincerely apologize for your experience, as we strive to provide all of our guests with 5 star service. We understand that our management team has worked with you on this matter and has provided you with a reimbursement check for your rental charges. If there is anything further that we may do to assist you, or if there is any further feedback that you would like to provide, please feel free to email us at WeCare@BuyFromJulio.com. Thank you"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "103761635311690383119", "name": "Megan Dempsey", "time": 1531102195670, "rating": 5.0, "text": "Excellent customer service and they were quick too! We were on our way home from New Orleans to Pennsylvania and they had us back on the road in no time! Thank you!", "pics": null, "resp": {"time": 1531149115231, "text": "Thank you for the review! We appreciate your business and that we had a chance to service your vehicle :)"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "101686076340022993068", "name": "tonisha ford", "time": 1521906375245, "rating": 5.0, "text": "I had a Great Experience. The Staff was Awesome. Jamark Jones was very polite and professional. He explained everything to me very well.", "pics": null, "resp": {"time": 1522066509715, "text": "Hi Tonisha, we are so happy to see you had a great experience with us and that Jamark was able to help you out!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "108736292535301299541", "name": "Deb Jeffries", "time": 1531865396623, "rating": 5.0, "text": "Purchased a car from Jared and The Car Doctor at Julio Mazda he was really knowledgeable and answered all our questions, I would recommend him and this dealership to others and come back for future purchases.", "pics": null, "resp": {"time": 1531927185976, "text": "Thank you Deb! SO happy to hear the Car Doctor was able to help you out!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "113016672605434024601", "name": "Kristen W.", "time": 1533056779467, "rating": 5.0, "text": "Jared was awesome! I appreciated that he was honest and really cared about what my sister and I are looking for.", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "105498957935696086024", "name": "jeremy brand", "time": 1538154117547, "rating": 5.0, "text": "Very good customer service, great salesperson Belinda, Highly Recommend this dealership for your transportation needs.", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "113424603267202481383", "name": "TeLeah Byrd", "time": 1531241865029, "rating": 5.0, "text": "LOVE Julio Jones Kia/Mazda! & I Love My Mazda 6! Jamark Is Awesome & He & His Staff Keep My Mazda In TIP TOP Shape! Go By & See Them & Grab Your New Ride TODAY!", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "107732020678631071650", "name": "Andrew Kuhl", "time": 1545108791640, "rating": 5.0, "text": "They were able to order the parts I needed for my Volkswagen", "pics": null, "resp": {"time": 1588788847522, "text": "Thank you for your 5-star review, Andrew! We appreciate you picking Julio Jones Mazda and we look forward to working with you again down the road, take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "117202881873057315033", "name": "Deb Hudson", "time": 1545410754939, "rating": 5.0, "text": "Greeted right away by Belinda Bender who provided great service in explaining details of 2012 Mazda Miata and meeting my needs in working our deal. Thank you Julio Jones Kia Mazda!", "pics": null, "resp": {"time": 1545412855990, "text": "Thank you Deb. We hope you really enjoy your Mazda Miata!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "117613761072938698518", "name": "Stevie Crews", "time": 1539886912354, "rating": 5.0, "text": "Thanks to God First and foremost, Thanks to the Julio Jones family for helping my Daughter with her Mazda 3 Thanks to all that assisted us, God bless you with growth!!!", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "105547532383268685106", "name": "VITAL AUTO", "time": 1523388674372, "rating": 5.0, "text": "This dealership has turned from Night to Day big difference in customers service I enjoy all the greeting smiles and over the top service  GREAT JOB keep up the great work.A+", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "104922852288667015627", "name": "AJ Cox", "time": 1530565895930, "rating": 5.0, "text": "Thanks so much AJ Cox, Jordan, and Trey!!! I love my new Rio and I’ll be back in one year to trade it in lol, thanks again guys!", "pics": null, "resp": {"time": 1530567195278, "text": "Thank you for your business!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "105878502811321540903", "name": "Jason Rye", "time": 1528499106491, "rating": 5.0, "text": "Good people, nice cars, great prices. Easy to work with and very professional.", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "106436253961038867467", "name": "Alberto Perez", "time": 1555780619278, "rating": 5.0, "text": "Service was great, and Felicia did an outstanding job!", "pics": null, "resp": {"time": 1556036975741, "text": "Hi Alberto, thank you so much for taking the time to let us know how happy you are with your experience! Feedback from you is one way we know we are achieving our goals. Let us know if we can assist you again!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "111588060569062041582", "name": "Mitzi Dayball", "time": 1526943939689, "rating": 3.0, "text": "I bought a car here and a week later I still don't have all the paperwork to get my tag.  Everyone at the dealership was nice but not very motivated.", "pics": null, "resp": {"time": 1532718030935, "text": "Hi Mitzi, thank you for your feedback. It is our understanding that this has been fully resolved for you. If there is anything further that we can help you with, please feel free to reach out at the store, or you can send us an email at WeCare@BuyFromJulio.com"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "107010403852297112839", "name": "BJ Scott", "time": 1528644648379, "rating": 5.0, "text": "The best dealership I ever seen they go the extra mile to get things done for you", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "117831252984136162487", "name": "Holt McCray", "time": 1527559145638, "rating": 5.0, "text": "Great car buying experience from beginning to end with Kim & Bubba Christian..the team was very friendly and excited that I was there.  Bought a new 2018 Mazda 3.  Kim wouldn't stop with finance until we all reached an agreement!  She never gave up and that shows me that they really care!!!!  By the way, the Kia dealership is beautiful.  Super friendly, attentive, and caring!  Would highly recommend this dealership to anyone searching for a new or preowned vehicle .", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "111583510442958590909", "name": "Marcus Wilkerson", "time": 1526421703311, "rating": 5.0, "text": "The Car Doc was the best. All the way from Mississippi to put a smile on my face!!!  Hey thanks Kia!!", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "101777909456195574539", "name": "Barbara Goodwin", "time": 1524277506698, "rating": 5.0, "text": "Super nice people in all departments.  I interacted with most everyone there and had a great experience. I don't like having to buy a vehicle, but I appreciate all the effort this dealership made to accommodate my needs. Kim (sales), Bubba (sales), Rusty (finance),  Tres (finance), Terry (Mazda) and Johnny & Jennifer (Kia)...they were all very helpful and customer service oriented.", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "115685548848615842161", "name": "Nikki Ellis", "time": 1518309524369, "rating": 5.0, "text": "Thanks to the energetic and attentive salesmen at Julio Jones Mazda for making my new car buying experience one to remember.  Larri and Riley are the go to guys if you’re looking for worry free, efficient and professional service. They located the exact car, color and package of my personal preference, and had it delivered to me for an inspection. I was very excited to go back to delearship to sign and drive. #lovingmynewmazda🚗💨", "pics": null, "resp": {"time": 1521463726911, "text": "Thank you for the great review Nikki! We are so glad to see we were able to help get you in your New Mazda."}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "113859570598580005836", "name": "Traci Riddle", "time": 1526156697077, "rating": 4.0, "text": "Thank you CJ and Terrell for helping make the experience enjoyable.", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "116207335185373810458", "name": "Allie St John", "time": 1540049345967, "rating": 5.0, "text": "Always courteous and timely in completing maintenance and service.", "pics": null, "resp": {"time": 1588789147835, "text": "Hi Allie, we truly appreciate you choosing Julio Jones Mazda and for taking the time to leave us this review. Please let us know if you need anything else, take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "106243356330963316888", "name": "Valarie Deloach", "time": 1533474971559, "rating": 5.0, "text": "I feel like im home good service", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "108840726066555807417", "name": "Paul Samuel", "time": 1553277487268, "rating": 5.0, "text": "Great place 2 buy car", "pics": null, "resp": {"time": 1553699642664, "text": "We are so happy to hear you had a great car buying experience. Thank you for taking the time to leave us a 5-star review and for choosing Julio Jones Mazda!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "117389485038830479933", "name": "Keli Goodson", "time": 1545431082975, "rating": 5.0, "text": "Great experience with Belinda at Julio Jones Mazda/Kia!", "pics": null, "resp": {"time": 1588788919716, "text": "Hi Keli, we are very happy to hear that we were able to provide you with such a positive experience! Thank you for your business and we look forward to your next visit, take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "111716458514201989924", "name": "katrina smith", "time": 1603424859613, "rating": 5.0, "text": "Very professional.", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "116705411614658525524", "name": "Angela Kirkland", "time": 1594128532571, "rating": 5.0, "text": "Wonderful people", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "100584541597159227091", "name": "Ian McDonough", "time": 1531241665901, "rating": 5.0, "text": "Great service, especially after change in ownership. Very friendly.", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "112467123270199105417", "name": "James Barber", "time": 1528299010767, "rating": 5.0, "text": "I don't know why anyone would purchase from anyone other than Julio Jones Mazda! Sales and Service are very professional and efficient, great dealership!", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "115499606884728061099", "name": "John Samuel Gurtler", "time": 1541432451803, "rating": 1.0, "text": "These guys are a bunch of sharks! If you show up, be ready to stay longer than you planned. Don't let them sell you something that you don't want.", "pics": null, "resp": {"time": 1541435671810, "text": "Hi. My name is Chris Hall with Julio Jones Kia/Mazda. I'm sorry to hear about your experience at our Dealership. Would you please take the time to call me to discuss your experience?"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "108589069971362439643", "name": "Edwin H Kluge Jr", "time": 1532589984686, "rating": 5.0, "text": "Place is friendly but their vending machine never seems to work UBER LOL", "pics": null, "resp": {"time": 1532615413041, "text": "Thank you for the feedback! We will look into this vending machine issue.. :)"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "113182582665797682259", "name": "Suzanne Prevost", "time": 1532401375316, "rating": 4.0, "text": "The salesman and the manager were both very helpful and accommodating.", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "111858051245038498656", "name": "Helen Gay", "time": 1558299059167, "rating": 5.0, "text": "Loved. It..", "pics": null, "resp": {"time": 1558378729779, "text": "Hi Helen, we appreciate your 5-star rating and your business. Thanks so much for leaving us a review and enjoy the rest of your day!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "113328163203072461323", "name": "Tonya Cook", "time": 1535383219119, "rating": 5.0, "text": "Best customer service on the planet!", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "114374107068998053553", "name": "Jami Brown", "time": 1528644380412, "rating": 5.0, "text": "JaMark works well with his customers! Julio Mazda is one of the best!!!!", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "107170760019768623684", "name": "John Riddle", "time": 1526156821130, "rating": 4.0, "text": "Cj and Terell of the sales team went above and beyond", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "109041134639533413586", "name": "Sofia Logan", "time": 1546664568846, "rating": 5.0, "text": "Accurate and quick service!", "pics": null, "resp": {"time": 1588788794664, "text": "Hi Sofia, thank you for this 5-star review and letting us know about your positive experience with us. We look forward to working with you again soon, take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "102816917951253326761", "name": "Tramona Moore", "time": 1542071596993, "rating": 5.0, "text": "I went to see Julio Jones and came out with a car. Thank you guys...", "pics": null, "resp": {"time": 1534777423113, "text": "Thank you for your feedback!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "106663636635313036797", "name": "Rogelio Barraza", "time": 1545665283822, "rating": 4.0, "text": "Really good atention in service", "pics": null, "resp": {"time": 1588788823942, "text": "Hi Rogelio, thank you for taking the time to share your experience with us. We are glad to know that you had a positive experience with us and if you need anything else, we are here to help!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "108901519676890573652", "name": "James Shepherd", "time": 1542039250035, "rating": 2.0, "text": "Salesman didn't seemed to intrested trying to assist me in making a purchase, so I left.", "pics": null, "resp": {"time": 1542043029654, "text": "Hi James. My name is Chris Hall, I am the General Manager with Julio Jones Mazda. Your negative experience at our dealership is something we never want to hear and I am very sorry you feel as you do. Will you please take a few moments to call me on my cell phone @ 205-412-0711?\n\nHi James. I would still like to hear from you so I can resolve this for you."}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "113607245751782549003", "name": "Joe O'Bryant", "time": 1553110313904, "rating": 5.0, "text": "Very friendly and knowledgeable", "pics": null, "resp": {"time": 1553699851640, "text": "Thanks for the 5-star review, Joe! We're glad that you had a great experience with us. Take care!"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "107959718201705317866", "name": "Earl F", "time": 1523379365051, "rating": 5.0, "text": "Terry and Michael are excellent!", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "108218945982149421258", "name": "angela evans", "time": 1530458577671, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "112748430909203839226", "name": "Paul Bagwell", "time": 1532684994544, "rating": 1.0, "text": "They are two highpriced", "pics": null, "resp": {"time": 1532717897713, "text": "Hi Paul, thank you for your feedback. We always strive to provide competitive pricing, and would like to look in to the specific vehicle(s) that you were inquiring on to see if we need to make any adjustments to our pricing. Unfortunately, we are unable to locate you in our system, in order to look in to this further. At your earliest convenience, can you please send us an email with further details regarding your visit to WeCare@BuyFromJulio.com? Thank you, we look forward to hearing from you"}, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "116329499115652797442", "name": "John Miller", "time": 1529371598170, "rating": 5.0, "text": "Bubba & Kim are great!", "pics": null, "resp": null, "gmap_id": "0x8886020ca84a719d:0x5dd5c6a36a6fa91f"}
{"user_id": "109915837302393898323", "name": "Autumn Carlisle", "time": 1564194924939, "rating": 5.0, "text": "I had/continue to have a great experience with them. Andre had me in and out of this place in under an hour with keys in hand. He was very friendly to not only me but also my daughter as well. Every time I go in the office, they are always so friendly. They are also great working with you on payments if something comes up. When we decide to buy a second vehicle, it will be with A & M.", "pics": null, "resp": null, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "103452709305243726716", "name": "Kimberly Handley", "time": 1583464190519, "rating": 5.0, "text": "Great staff I saw ad on Facebook of a car I was interested in contacted them and was all set with my approval and ready to go before I visited I test drove and was very happy with vehicle selection all nice newer model cars with good mileage my car drives great they worked with me on my payments that I could afford and downpayment I would recommend them great team", "pics": null, "resp": null, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "114251264470119349309", "name": "Treba C. Harris", "time": 1584087981348, "rating": 5.0, "text": "They are so nice and let's you make your own decisions on the car you want", "pics": null, "resp": null, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "109249417149752786774", "name": "Viridiana Romero", "time": 1539960033080, "rating": 5.0, "text": "This place is the place to go for a car or truck. I worked with Andre and he went above and beyond to make sure I was satisfied with my truck and the loan process. He has great customer service and I was very pleased with him and the business. I will definitely be back and will refer people to them. Again thanks Andre for everything you did I am very grateful!!", "pics": null, "resp": {"time": 1547162348505, "text": "Thank you!"}, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "106271146800559566470", "name": "Andre Pires", "time": 1570478026010, "rating": 5.0, "text": "Excellent dealer, friendly people and nice inventory! I recommend this car lot.", "pics": null, "resp": null, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "108692520327022953211", "name": "jibreel mekdad", "time": 1567001958897, "rating": 5.0, "text": "the people there were friendly and great, they gave me a great deal and the car was in excellent condition. If i could give more than 5 stars i would.", "pics": null, "resp": null, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "101745681858457671888", "name": "Otis Lee Phillips Jr", "time": 1552581714990, "rating": 5.0, "text": "Great 👍 I brought a car months ago. And I tell my people to come check them out quickly get you riding", "pics": null, "resp": {"time": 1561045788120, "text": "Thank you Mrs Phillips!"}, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "107937627270683831724", "name": "Jonathan Bryant", "time": 1540853124574, "rating": 1.0, "text": "WORST EXPERIENCE OF OUR LIVES!!\nthese 4 and 5 star reviews have to be fake or paid for. have to be!\nI got a car from them a little while back , charged almost 6000$ over what the car was worth and was assuming I was getting a decent  car. NOPE!\nIt’s completely undriveable,I spent every penny our family had in the bank and everything I could borrow and I’m still paying payments and it’s sitting in a shop till I can pay the rest of the bill.\nThey knew about the problems and lied to my face !\nStay far away", "pics": null, "resp": {"time": 1602957321201, "text": "Hi Jonathan, I am sorry to hear about your experience with A&M Auto Sales. I can assure you that management has changed since then. We are very different now and strive to provide the best service possible!"}, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "113434331522858834327", "name": "Robert Bates", "time": 1521843932823, "rating": 1.0, "text": "Stay away! They are deceptive and cheats. I bought a truck from them at an outrageous price (had no options at the time and needed a truck A.S.A.P. for business) and I have spent over $5,000 fixing it in the 6 months I've owned it. I was told by Lee and the \"salesman\" that the truck was $11,000, only to charge me $13,000. Of course once I realized what they did and contacted them they play dumb and it is too late. I know if I should have taken more time to review and ask questions but it was the end of the day, past business hours already and I needed to leave with the truck that day. Regardless you should never practice those business ethics in any industry. I have had to change the rotors, brakes, brake drums, brake cylinder, master cylinder, calipers and brackets, hub assembly, CV axles, steering arm, I am in the process of changing the transfer case (over $2,000 on it's own) and it still needs a steering column, gear box, front differential, driveshaft and possibly the rear differential. When it's all said and done I will have put at least 5 times the value of this truck into making it run right and paying it off. I am a self employed remodeler and I have missed countless days of work, lost countless jobs and it's gotten to the point that I am having trouble paying for my daughters daycare and buying her essentials. This whole deal has radically ruined my life. These people knew the situation I was in and absolutely took full advantage. Beware!!!", "pics": null, "resp": {"time": 1602957637827, "text": "Hi Robert, I am so sorry to hear about the terrible experience you had with A&M Auto Sales. Our management has changed since then. We now have a great team behind us to help with any issues with the vehicles for future or current customers!"}, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "106711626749415683459", "name": "Marvin McCoy", "time": 1496330318287, "rating": 5.0, "text": "I highly recommend this place if you are looking for a car!!!! They had what I wanted, and did what was need to get me driving the same day!!! Thanks Mr. Lee and special thanks to Tommy", "pics": null, "resp": null, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "112181012940118527668", "name": "John Galliera", "time": 1609522419743, "rating": 3.0, "text": "Never been.", "pics": null, "resp": {"time": 1609524954351, "text": "Hello John, thank you for the 3 star review. You can come in and visit us at 518 1st Street North, Alabaster, AL. 35007 . We are close by the Shelby Baptist Hospital, we will be happy to help you find a new vehicle."}, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "108701766100171673736", "name": "Shalanda Hill", "time": 1503529170873, "rating": 5.0, "text": "Me an my Husband has had no problems at all so come in an purchase u a car👌", "pics": null, "resp": {"time": 1504113824178, "text": "Thank you Mrs Hill for everything!!!"}, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "111032226785266123123", "name": "Chris Davis", "time": 1551578021886, "rating": 1.0, "text": "Card not clean drove car came back smoking I think bad cars  but that's my thoughts", "pics": null, "resp": {"time": 1602957821745, "text": "Hello Mr. Davis, we are sorry about your experience with our vehicles. We are now under different managment and can assure that the vehicles are now thoroughly cleaned. I hope that you can give us another chance in the future!"}, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "105090458384427744071", "name": "John Hall", "time": 1490632298505, "rating": 5.0, "text": "Great sellers they really understood my situation and got me a great deal I recommend this business to everyone. Thanks you guys", "pics": null, "resp": {"time": 1492440965946, "text": "Thank you for rating A & M Auto Sales, Inc"}, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "105409612809342357156", "name": "Tommy Seals", "time": 1490632582938, "rating": 5.0, "text": "This lot has options no other lot has. Very friendly and will guarantee your approval", "pics": null, "resp": {"time": 1492440903640, "text": "Thank you for rating A & M Auto Sales, Inc"}, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "108643229336949282303", "name": "pga fortnite", "time": 1476824571868, "rating": 5.0, "text": "Staff is very nice; very knowledgeable; Auto Financ Specialist!", "pics": null, "resp": null, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "116928877823447233153", "name": "jeff brantley", "time": 1561409963878, "rating": 5.0, "text": "It's always good", "pics": null, "resp": null, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "113303951820508129435", "name": "BOBBIE RUSSELL", "time": 1534909069318, "rating": 4.0, "text": "Where we got our car😜😜😜", "pics": null, "resp": null, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "111323206290817482427", "name": "Greg Tatum", "time": 1543982671447, "rating": 5.0, "text": "good deals", "pics": null, "resp": {"time": 1561045840655, "text": "Thanks Greg!"}, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "113303951820508129435", "name": "BOBBIE RUSSELL", "time": 1534909069318, "rating": 4.0, "text": "Where we got our car😜😜😜", "pics": null, "resp": null, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
