{"user_id": "102672572275088400417", "name": "Pro Coat (Fabrication)", "time": 1568472017077, "rating": 5.0, "text": "Most of the advertising sales reps and web design wannabes we spoke with were more interested in showing off what they can do. Bizeeo was first and foremost concerned with providing us with the marketing services we needed to succeed. They spent a LOT of time at our shop learning about our products, services, equipment, and procedures BEFORE formulating an online marketing strategy or beginning development on our website. Their no-nonsense, systematic approach to business promotion was unique and refreshing. If you're only interested in a service provider who builds cool, trendy websites, look elsewhere. If you need a marketing professional, who knows how to promote your business on the Internet, contact Bizeeo Marketing Agency!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPWkqKLlarTcCWZG2m80s2bdwJlKnEoImxKK0rU=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "111794181733632536439", "name": "Steve Sanders", "time": 1620750996317, "rating": 1.0, "text": "We were promised we would own the website and domain name after our 1 year contract. 3 years later, we still don't own anything. HORRIBLE experience.", "pics": null, "resp": null, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "103788935114690151706", "name": "Chris Tarantino", "time": 1616900105544, "rating": 5.0, "text": "Vernon is knowledgeable and helped us transfer an old business we bought.  Very helpful and nice to work with.", "pics": null, "resp": null, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "107140978127037205310", "name": "Ariaa Jaeger", "time": 1604165024615, "rating": 5.0, "text": "Vernon Blake was amazing, he was able to guide me through the process of optimizing my search details which will really help increase my online profile. I am more than delighted with his professionalism and knowledge. I highly recommend Vernon and the team at Bizeeo Marketing for all your marketing needs!", "pics": null, "resp": {"time": 1604168554701, "text": "Hi Ariaa, thank you for a great review! We're always impressed when a friend has their own \"knowledge panel\" on Google's search engine results page (SERP). Glad to see you were able to claim, verify, and update your panel. It looks better than ever! One day we hope to be as famous and influential as you are to warrant our own Google Knowledge Panel. Shelley and I genuinely appreciate your kind words and for taking a moment from your busy schedule to publish a 5-star rating."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "116265173786253037833", "name": "Bailey Duos", "time": 1582048350726, "rating": 5.0, "text": "\"Bizeeo is knowledgeable, professional, caring and attentive. They created my online presence from scratch and far exceeded my expectations! I definitely recommend them for any of your marketing needs!\"", "pics": null, "resp": null, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "114002054062801087550", "name": "Ladonna Idell", "time": 1559079772561, "rating": 5.0, "text": "This is a follow up rating from my extensive experience interacting with Bizeeo. I don't know what I would have done without his help. He does a great job explaining what he is doing and how we can better manage our online presence.", "pics": null, "resp": null, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "114248760755282091601", "name": "Linda Preskitt", "time": 1569593072359, "rating": 5.0, "text": "I am completely connected to the \"Why\" of my business but as a startup sole proprietor I was desperate for someone that could help with how.  Vernon went beyond in expertise and for the first time I felt I had a partner, someone that believed in what I am doing, someone to provide the how.  If you are searching for excellence, knowledge, honesty, and a timely response, this is your Agency.  There is no better partner for your business.", "pics": null, "resp": null, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "101369889282048456920", "name": "Shelley Kim", "time": 1582062668847, "rating": 5.0, "text": "I can truthfully say that Vernon is the most honest and knowledgeable online marketing specialist I know. He keeps up to date with the latest ‘trends’ by doing research daily, and, having a project management background, can create and maintain websites - and manage their SEO, for ANY industry, from schools to law to restaurants to therapists.\n\nHe’s not about the “bells and whistles” - that doesn’t bring you business - he’s about driving business to you through his online marketing work.\n\nIf he doesn’t think he can improve your sales by driving customers to your business, he will tell you - and tell you which is the best route for you to follow.  It’s not often that you find someone that ethical these days.\n\nHonestly and trustworthiness, good work ethic and values are rare commodities these days and I’m so glad that Vernon and Bizeeo have these strengths.", "pics": null, "resp": null, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "108175476955979403510", "name": "Mila Ivanov", "time": 1567014409525, "rating": 5.0, "text": "He is very professional and excellent  job fixing my website and fcbk . And he can explain clearly, what need to be done. Thank you so much Bizeeo for helping me. You do Great!", "pics": null, "resp": null, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "108986317786183923860", "name": "Allison Shoemake", "time": 1566391068267, "rating": 5.0, "text": "Hey Everyone,\n\nRarely do I write reviews.  However, I did want to take time to acknowledge and show appreciation to our web designer and friend Vernon Blake.  He has done such a great job with our website.  One thing I like most about his work is that he takes the time to try and put in layman's terms the improvements that he is making.  Honestly, some times I get  it  and sometimes I just see the results!  Since partnering up with Vernon I definitely love how our website looks and functions but most of all I am seeing results with more people finding our business, more people contacting us through the website - which has resulted in more customers coming to the business!  And that is worth a thousand words.  Great job Vernon!\n\nThank you\nAllison Shoemake\n\n--", "pics": null, "resp": null, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "101901305400555139471", "name": "linda teel", "time": 1533221883149, "rating": 5.0, "text": "Vernon and Shelley @ Bizeeo are true webmasters!!  They have changed the face of our practice.  We are much more streamlined and efficient thanks to their guidance.  I cannot tell you how much we love them!", "pics": null, "resp": {"time": 1557590913159, "text": "Hi Linda, thanks for giving us a 5-star rating! It's a real pleasure working with you and your Montgomery staff. We really appreciate how you guys are always open to new ideas and receptive to change, which has paid BIG dividends for all of us. Who knew how a simple strategy of converting paper forms to online web forms would have such a tremendous impact generating new leads? Thanks again, we look forward to a long and prosperous relationship..."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "110986579158477488673", "name": "Ed Shoemake", "time": 1565482037996, "rating": 5.0, "text": "We have been using Vernon for sometime now.  We are very happy with our website and the way it is being handled.  We would recommend Bizeeo Marketing Agency for your business as well. ed--", "pics": null, "resp": {"time": 1557589509622, "text": "Hi Ed, thank you for the nice review! We appreciate you giving us the opportunity to provide online marketing services for your Montgomery business. It's a real pleasure working with local small business owners like yourself (and Allison), and we look forward to a long relationship."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "104776573168192410939", "name": "Peggy Raines", "time": 1559102140605, "rating": 5.0, "text": "Vernon is very knowledgeable, helpful, polite, and professional. I have been very satisfied with his recommendations and service.", "pics": null, "resp": null, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "115875958919930114222", "name": "PMMW Lewis", "time": 1551983286377, "rating": 5.0, "text": "Mr. Vernon Blake helped me in such a tremendous way!!!! Kindness is becoming very rarer theses days, especially in businesses but this proves that they’re still some good businesses out there with kind people!!!!", "pics": null, "resp": {"time": 1557589168969, "text": "Hi P Lewis, thank you for taking the time to leave a 5-star review! Good luck with your marketing plan and please let us know if we can assist you in the future."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "102950740138757252851", "name": "Train2Win Institute", "time": 1495898023883, "rating": 5.0, "text": "We hired Vernon to explore the possibility of creating a membership website for our company... Train2Win Institute. I can tell you this was a huge undertaking and Vernon was unwavering and patient in this process. If I could describe Vernon's greatest quality it would be patience, followed by a great desire to complete the job with excellence. Vernon does not settle for mediocrity. It was our pleasure to get to know Vernon and If you want excellence...Then Hire Vernon Blake!\n\nGreg Imhoff\nPresident\nT2W Institute", "pics": null, "resp": {"time": 1514318572562, "text": "Hi Greg & Suge, thank you for the kind words! The pleasure was all mine. You guys are a top-notch organization and provide a valuable service for your clients in Alabama (or wherever in the world they are located). I learned a lot while working with you and enjoyed being a part of your bilingual web design and marketing \"team,\" if only on a temporary basis. On behalf of Bizeeo Marketing, we genuinely appreciate you taking the time to leave your gracious review and 5-star rating!"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "100101481190782468781", "name": "William Runningwolf", "time": 1540996333260, "rating": 5.0, "text": "Vernon Blake is a real find! Competence, excellence, technical wizardry, and impeccable integrity. AND he produces real results. You won't find a better man out there. Stop looking, you've struck gold. He helped me out of a jam without asking for any compensation, just because he cared.", "pics": null, "resp": {"time": 1557590528570, "text": "Hi Will, thank you for the great review! I'm glad we were able to help you out of a sticky situation and very sorry that unscrupulous \"marketing consultants\" tried to take advantage of you. On the upside, we were thrilled to meet one of the most talented authors/content developers (Hi Maryla) we've encountered in a long time! Look forward to working with you on some content marketing projects in the future!"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "117872439740702695413", "name": "Linda Holmberg", "time": 1409024444241, "rating": 5.0, "text": "I approached Vernon after hearing him speak at at a counseling workshop.  He was approachable, kind and seemed knowledgeable about marketing online.  When I decided it was time to market my practice I turned to Bizeeo.  It has been a very pleasant experience!  Vernon asked questions about myself and the way I wanted to grow my practice.  I was impressed with the amount of research he conducted in order to present a professional presence. He appears to care about his clients, desiring to serve them the best way he can.  Best of all, his work began bringing in business almost immediately and paid for itself within just a few months! He and Shelley are warm, personal, professional, and serve up a great cup of coffee!  I highly recommend them!!", "pics": null, "resp": {"time": 1409033878375, "text": "Hi Linda! At Bizeeo Marketing, we make every effort to understand your business services and products, as well as your short and long-term goals. Hearing that our marketing services more than paid for themselves in such a short time-frame MADE OUR DAY! It confirms that strategic planning, recognizing the untapped potential of the web and applying targeted marketing techniques has the potential to produce quick results in many industries. We truly appreciate you and your business and look forward to serving you in the future. And we always enjoy our coffee breaks! Thank you for taking time out from your busy schedule to leave a review. Vernon Blake - Web Design & Marketing Specialist"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "102219555799163263597", "name": "Rebekah Clark", "time": 1470699866362, "rating": 5.0, "text": "Vernon and Shelley designed my web page a few years back and were great to work with. They listened to what I wanted on the site and then offered additional suggestions based on their knowledge and experience. The site turned out great and I would definitely use them again.", "pics": null, "resp": {"time": 1514319305532, "text": "Hi Rebekah! Bizeeo Marketing enjoyed designing your website and providing online marketing services for your Prattville, Alabama counseling and therapy practice. Our working relationship has been a long one, and it's been exciting to watch your business grow and prosper. Thank you very much for sharing your experience with us and posting your kind review!"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "108236639786184597708", "name": "Frances McGowin", "time": 1409703615728, "rating": 5.0, "text": "\"K-9s 4 Kids and Heroes\" is now #1 on the search engine results page in our category because of Bizeeo Marketing Agency. Bizeeo volunteered their Website Design and Internet Marketing Services beginning early in 2014. We now have a professional, functional website that is informative and directive. Any non-profit or business knows the value of an online presence that contributes to your overall mission, goals and success. Thank you so much Bizeeo!", "pics": null, "resp": {"time": 1514320263355, "text": "Hi Frances! Bizeeo Marketing considered it a privilege to donate our marketing services to such a worthy cause. Your organization provides a valuable and much-needed service for so many people (and Dogs) in Alabama, and in so many ways through your Service & Therapy Dog programs. Thank you for giving us the opportunity to play a small role in the process, and for writing your kind review!"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "115630109998380844224", "name": "Tiffany Youngblood", "time": 1557587188914, "rating": 5.0, "text": "Vernon is extremely knowledgeable, kind, & helpful. I recommend anyone in need of an expert to contact this company.", "pics": null, "resp": {"time": 1557588155305, "text": "Hi Tiffany, thanks for the kind review! I enjoyed collaborating with you regarding your e-Commerce website requirements and future online marketing plans. Feel free to contact us anytime in the future if we can be of assistance."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "114814581255436352692", "name": "Zac Williams", "time": 1532314036516, "rating": 5.0, "text": "Great experience in marketing. No nonsense, to the point, I highly recommend bizeeo. Very knowledgeable and always happy to help.", "pics": null, "resp": {"time": 1557591226727, "text": "Hi Zac, thanks for the kind words and 5-star review! We're excited about the quick results we obtained as a result of publishing your new website and applying an aggressive local SEO strategy. It was a team effort!"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "114798988453050027233", "name": "Ellen D", "time": 1397076457288, "rating": 5.0, "text": "Bizeeo Web Marketing & Design was referred to me by a mutual friend.\nVernon Blake, owner, is very knowledgeable, and very easy to work with.   He has designed an awesome website for my business always adding new and interesting articles in my specialized field .  My website is user friendly and up-to-date with the latest technology for smart phone viewing, and social media interactions.     I have been beyond satisfied with his work.    If you are considering his services I would highly recommend him.       Bizeeo Web Marketing & Design definitely gets my 5 stars!!   Thank you, Ellen Dutton", "pics": null, "resp": {"time": 1409030786787, "text": "Hi Ellen! It has been our pleasure to work with you over the past year and a half. We appreciate how you never lose sight of WHY we do what we do online, which is to find more customers for your business. Clients such as yourself allow us to ensure your marketing and advertising dollars are spent where they are most needed. We provide many marketing services, but we recommend and sell only those services that support the overall development and growth of your business. Thank you very much for taking time to leave a comprehensive review! Vernon Bake - Marketing and Business Development Services Specialist"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "115596480277714604367", "name": "Sasha Pulford", "time": 1514347967833, "rating": 5.0, "text": "Bizeeo Marketing in Montgomery provided effective, easy-to-understand marketing consulting and training services for my new business venture. They even explained SEO (search engine optimization) in a way that made sense to me. If you're in need of plain-spoken, jargon-free online advertising and quality marketing services from someone you can trust, these are the people to call. I highly recommend Bizeeo! Thank you Vernon and Shelley!", "pics": null, "resp": {"time": 1514349566739, "text": "Hi Sasha! S-E-O... We're impressed! Working with you was a pleasure! You picked up on all the marketing \"jargon\" like a real pro (even though we tried to avoid it as much as possible). I know your Pappy is proud (and so are we)! We appreciate you taking a moment to rate our services and leave a review."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "105558261031880821995", "name": "Aliesha Shepherd", "time": 1383935541321, "rating": 5.0, "text": "I have been so happy that I found Bizeeo Web Marketing & Design.  He has helped save me a lot of money and headache.  My websites and pages now rank on the first page and I am getting most of my business through Google searches and not just word of mouth!\nI asked for some advice on how to make my website more visible, I was given some excellent tips and things to do to help more people find me! I would highly recommend him to anyone who has a website and would like to have a web presence!!!\"", "pics": null, "resp": {"time": 1386091718280, "text": "Hi Aliesha! It was a pleasure to help you with your online presence. You had most of the web marketing puzzle pieces in place, all that was needed was some fine tuning - and you were a quick learner. We have been monitoring your rankings in the search engines and are thrilled to see that your small business (dog training) is thriving. Let us know if we can help in the future, and thanks for taking a moment to leave a review. Vernon Blake - Internet Marketing Specialist with Bizeeo Web Marketing & Design"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "105070166819056393683", "name": "Yvonne King", "time": 1461632747576, "rating": 5.0, "text": "Vernon and his staff are true business partners. Vernon is extremely knowledgeable concerning online marketing but unlike most online marketing companies he isn't going to recommend something unless it is a good fit for your business. Vernon takes the time to do a thorough needs assessment to learn about your business and your marketing needs-then he will make a recommendation. He is very patient and meticulous. I would recommend Bizeeo to any small business wanting a positive return on their marketing investment.", "pics": null, "resp": {"time": 1464977437818, "text": "Hi Yvonne, we REALLY appreciate you and your review! Online Marketing can be quite mysterious, even overwhelming, for most business owners. We think you probably \"get\" what we do and why we do it better than anyone we've worked with. Thanks again for submitting your review and comments."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "114566672165693307420", "name": "Billy Ferguson", "time": 1568484127011, "rating": 5.0, "text": "I hired Bizeeo to promote my DJ services for wedding, party, corporate and other local Montgomery events. They created a multimedia rich website and custom YouTube channel, including audio tracks and video clips representing the different music genres and other services I offer. They included a comprehensive booking form so potential customers could easily book an event from my website. I'm very pleased with Bizeeo's marketing services and my DJ services are now easily found in Google's search results. I highly recommend Bizeeo if you're in need of specialized online marketing and promotion services for your business.", "pics": null, "resp": null, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "111090829406892215866", "name": "Joseph Thomas", "time": 1461686368754, "rating": 5.0, "text": "I would like to Thank Vernon & Shelley for all their hard work creating a wonderful website for our company. Bizeeo Marketing Agency will go above and beyond your expectation in the research and development of your website and online searches for your business!! We have been very pleased with there services and and highly recommend their company. Thank you Bizeeo", "pics": null, "resp": {"time": 1464975886919, "text": "Hi Joey, we thoroughly enjoyed developing and designing your website. We learned so much about the \"Piano Business\" in the Montgomery River Region. We're looking forward to working with you in the future and are very happy to know you are pleased with our marketing services. But, as always, it is a team effort! Thanks for taking time to leave a review."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "100265935271884226756", "name": "Lana Grier", "time": 1386088539690, "rating": 5.0, "text": "It was refreshing to speak with a marketing agency that was completely transparent about their services. They took the time to explain what I would be paying for and precisely how they would perform their services - without using a bunch of techno-geek-babble. They even demonstrated what they had accomplished with their existing clients. This was an easy choice and one that has certainly paid dividends.", "pics": null, "resp": {"time": 1386090911243, "text": "Hi Lana,\n\nThank you for the nice review!\n\nWe do our best to educate our existing and potential clients. We have discovered that informed clients are the best clients. They know what to expect, how to hold us accountable, and work with us so that it becomes a team effort.\n\nThis enables Bizeeo to provide the best services possible and allows our clients to reap the full benefits of our efforts. It pays dividends for everyone involved. :-)\n\nThanks again for taking time to submit a review. We truly appreciate you and your business! Vernon Blake -\nInternet Marketing Specialist"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "101550549936669869722", "name": "Kyle Murchison", "time": 1514090352201, "rating": 5.0, "text": "Vernon Blake is an expert at SEO and online marketing. He revolutionized our online capabilities and allowed us to take our business to a whole new level. He's extremely knowledgeable and a pleasure to work with.  I would highly recommend.", "pics": null, "resp": {"time": 1514317393287, "text": "Hello Kyle! It's very gratifying when our clients understand the importance of \"local\" SEO and the role it plays generating new customer leads. Bizeeo Marketing looks forward to a long relationship, and we're excited to be a part of your marketing efforts in Montgomery. Thanks for your rating and review!"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "110485306258530375688", "name": "Brenda & David Duos", "time": 1582045443482, "rating": 5.0, "text": "UPDATE!!\nI just had to come back and tell you how much I appreciate the amazing difference you have made in jump starting our new business!  You had us growing the minute we opened the doors! Your insight and knowledge is incredible. There were so many details we would have never considered that make a huge difference in reaching new clients! Thank you for handling the overwhelming and super important job of marketing so we can focus on providing great service to the clients you helped us get!\n\nPREVIOUS REVIEW 2014:\nVernon has great ideas and he’s very knowledgeable! I love that he’s so patient when helping me or explaining how things will benefit our business. He also makes our overwhelming decisions much easier and that ultimately saves time and money!", "pics": null, "resp": {"time": 1386092671078, "text": "Hi Brenda! We always keep in mind that the purpose of our web consulting services is to save precious time for busy our clients, attract more customers, and promote profitability. Bizeeo handles the marketing and automation tasks which enable small businesses like yours to focus on actually running their business! Thank you for taking time to leave a review and feel free to call on us anytime. Vernon Blake - Internet Marketing Specialist"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "105792651197739397233", "name": "Gerri Taylor", "time": 1399384742120, "rating": 5.0, "text": "What a great group of professionals! Vernon Blake creates web designs/marketing plans that are effective and affordable. The Bizeeo team can build a new website or enhance an existing site; and your website will function across multiple platforms. I definitely recommend calling Bizeeo first, if you need help with web site design.", "pics": null, "resp": {"time": 1409031813082, "text": "Hi Gerri! It was great collaborating with you regarding your non-profit organization's Internet marketing project. Your knowledge and experience in your industry and thorough understanding of how the web \"works\" allowed us to cover a lot of ground in a short time-frame. We really appreciate you taking the time to leave a review. Vernon Blake - Marketing & Advertising Specialist"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "100613012383044548156", "name": "Ronald Man", "time": 1461152690628, "rating": 5.0, "text": "I met Shelly and Vernon on facebook, and decided to consult with them regarding my business. During the consultation, they gave me some excellent advice about the multitude of directories out there, and how to easily maneuver and utilize them.\nI followed there advice and saw a substantial uptick in phone calls and jobs in my local service industry business.\nVery, very helpful and knowledgeable people!\nI highly recommend!!", "pics": null, "resp": {"time": 1464975613640, "text": "Hi Ron, Online business directories are the \"new\" yellow pages. Submitting and/ or correcting your business details across the major business data providers, directory sites and review sites is an essential part of promoting your local business. Bizeeo practices what we preach, just perform a Google search for \"Bizeeo\" and you'll discover all of the Montgomery, Alabama listings, directories and social networks that we created (all for free).  It was a pleasure consulting with you. All we had to do is point you in the right direction and you took off! Thanks for taking time to leave a review."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "106553004895518822366", "name": "a.", "time": 1426858790057, "rating": 5.0, "text": "What I most appreciate about the services of Bizeeo Marketing Agency, is that they are very responsive. They've never hesitated to get back to me promptly in addressing my needs and concerns. I have also been very impressed that this group remains abreast of the latest trends and technologies which in critical in meeting customer demand.", "pics": null, "resp": {"time": 1433034381042, "text": "Hi Angie! Working with you on a variety of projects over the past 2 years has been a pleasure. What we appreciate most about you is your Project Management expertise - the ability to see the BIG picture while understanding all the moving parts. That's exactly what Bizeeo does as a Digital Marketing services provider and why I think we work well together. Thanks for taking time to leave a review and we look forward to our next collaboration. ~ Vernon Blake - Internet Marketing Consultant"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "106150811266029691174", "name": "Blake Grier", "time": 1514314864475, "rating": 5.0, "text": "Vernon provided excellent website design services for my Montgomery area business. Our site is clean and easily navigable, and it also ranks well in Google search results.", "pics": null, "resp": {"time": 1514316920941, "text": "Hi Blake! Working with you on your web design project has been a pleasure! Your Montgomery based aerial drone photography and video editing services will undoubtedly be in high demand throughout central Alabama. We're looking forward to providing additional web-related services over the next year. Thanks for taking time to leave your rating and review!"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "105243813640322533280", "name": "Leigh Mollet", "time": 1541786714883, "rating": 5.0, "text": "Bizeeo Marketing has partnered with our business for years and has always worked diligently to meet and exceed our expectations with innovative ideas and creativity.", "pics": null, "resp": {"time": 1557590115715, "text": "Hi Leigh, thank you for the kind review! It just occurred to me that our partnership is quickly approaching a 10 year anniversary, how time flies! We appreciate the opportunity to work with you and your Birmingham staff and look forward to providing web marketing services and website maintenance services for years to come."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "100587306914749864025", "name": "Kathryn Fletcher", "time": 1461257062406, "rating": 5.0, "text": "I throughly enjoyed working with Vernon and his lovely assistant Shelly. Vernon investigated every aspect of our website and business to get us the best results possible. If you need personal results for your business don't hesitate call them today!", "pics": null, "resp": {"time": 1464976189661, "text": "Hi Kathryn, your online marketing project was our biggest challenge to date. Oh, how we despise those penguins! We appreciate your patience during what was a LONG process of recovering from a Google algorithmic penalty. I still have nightmares about \"storage montgomery al\"! Just kidding... Thank you so much for taking time to leave a review."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "114588819587790455750", "name": "Z Man", "time": 1461524676067, "rating": 5.0, "text": "I have been working with Shelley and Vernon for a little over a year now and I need to give this talented duo  a huge round of applause.  They can handle everything and handle it with the urgency, creative and technical insight  that I need.  From baby shower graphics and invites to athletic challenges and into my personal business this creative couple has helped me increase internet presence, use social media more effectively and create a functional and friendly website.  Thanks again for all your help Shelley and Vernon!!!", "pics": null, "resp": {"time": 1464977182762, "text": "Hi Z Man, I don't think we have ever worked with anyone with so many irons in the fire! We could barely keep up! But we are so impressed with all you do, especially for others. Thank you for the kind review."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "112435256381244660171", "name": "Janice Prescott", "time": 1523323264743, "rating": 5.0, "text": "Shelley Blake helped me set up a Facebook business page for my handmade pottery operation (Wild Clover Studio) and connect it to Instagram. Now I only have to post the information once and it appears in both places.\n\nShelley is very knowledgeable about how the different social media applications work together. She is friendly and patient and able to explain things in plain English. And a bonus--I picked up so many tips and shortcuts for working with my phone and my computer!", "pics": null, "resp": {"time": 1524852101476, "text": "Social media marketing is an excellent online strategy for promoting your handmade pottery and other artwork, especially for potential customers in Montgomery and central Alabama.\n\nHi Janice, \"Thank you\" for taking time to leave a 5-star rating and review! You've done a great job with your Facebook promotional efforts and setting up your online store and featured products.\n\nWe thoroughly enjoyed working with you and wish you and Wild Clover Studio all the best. Let us know if we can help in the future. ~ Shelley Blake (Montgomery Social Media Marketing Specialist)"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "114588819587790455750", "name": "Z Man", "time": 1461524676067, "rating": 5.0, "text": "I have been working with Shelley and Vernon for a little over a year now and I need to give this talented duo  a huge round of applause.  They can handle everything and handle it with the urgency, creative and technical insight  that I need.  From baby shower graphics and invites to athletic challenges and into my personal business this creative couple has helped me increase internet presence, use social media more effectively and create a functional and friendly website.  Thanks again for all your help Shelley and Vernon!!!", "pics": null, "resp": {"time": 1464977182762, "text": "Hi Z Man, I don't think we have ever worked with anyone with so many irons in the fire! We could barely keep up! But we are so impressed with all you do, especially for others. Thank you for the kind review."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "112510985204794788171", "name": "Daniel Nielsen", "time": 1386183339474, "rating": 5.0, "text": "As a CEO of several public and private companies, I have over the years consulted with many marketing services providers, advertising companies and web designers. My experience in dealing with Bizeeo Web Marketing & Design has been thoroughly enjoyable. Bizeeo's personalized service is amongst the best I have known and their expertise and professionalism is of the highest standard. I have nothing but praise for what Bizeeo offers and would recommend their services to anyone looking for the best.", "pics": null, "resp": {"time": 1386639009944, "text": "Hi Daniel! I thoroughly enjoyed our consulting session and look forward to future collaborations regarding your upcoming web project(s). It is refreshing to work with a client that possesses an understanding of and appreciation for web marketing principles and strategies. Your well thought-out action plan coupled with your ability to execute makes my job MUCH easier. Thank you for your kind words and taking a moment to post a review. - Vernon Blake - Internet Marketing Consultant"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "118054869689627774011", "name": "Bob H.", "time": 1422397408823, "rating": 5.0, "text": "Vernon, and his staff have done a wonderful job for our company.  They have put in an extraordinary amount of time, and have guided us through the maze of knowledge needed to have a fully functional website and design.   His team is a dream to work with.  Thank you Vernon!", "pics": null, "resp": {"time": 1433033707813, "text": "Hi Bob! We had our work cut out for us, but you guys were great to work with! We started with a one-page website and ended up with a blog, eCommerce store, Social Media presence, online lead generation, email marketing and more. And you guys were just getting started! I really appreciate how you didn't just sit and wait for the phones to ring. You aggressively participated in Trade Shows & Conferences and actively pursued customers, something one must do in such a competitive industry like yours. It was my pleasure and a privilege to work with you and your staff for a year and help get the ball rolling. Wishing you all the success you deserve moving forward. Thanks for taking time to leave a review! ~ Vernon Blake - Web Marketing Consultant"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "112435256381244660171", "name": "Janice Prescott", "time": 1523323264743, "rating": 5.0, "text": "Shelley Blake helped me set up a Facebook business page for my handmade pottery operation (Wild Clover Studio) and connect it to Instagram. Now I only have to post the information once and it appears in both places.\n\nShelley is very knowledgeable about how the different social media applications work together. She is friendly and patient and able to explain things in plain English. And a bonus--I picked up so many tips and shortcuts for working with my phone and my computer!", "pics": null, "resp": {"time": 1524852101476, "text": "Social media marketing is an excellent online strategy for promoting your handmade pottery and other artwork, especially for potential customers in Montgomery and central Alabama.\n\nHi Janice, \"Thank you\" for taking time to leave a 5-star rating and review! You've done a great job with your Facebook promotional efforts and setting up your online store and featured products.\n\nWe thoroughly enjoyed working with you and wish you and Wild Clover Studio all the best. Let us know if we can help in the future. ~ Shelley Blake (Montgomery Social Media Marketing Specialist)"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "102201922843760610575", "name": "SAC's Gallery", "time": 1389307169756, "rating": 5.0, "text": "Vernon and Shelley have been wonderful. They rebuilt our website and are currently marketing it. We have seen improvements in traffic to our website and categories of customers for the Gallery. Thanks so much.", "pics": null, "resp": {"time": 1389652187586, "text": "Hi SAC's Gallery (Ladonna & Kathie)! Shelley and I thoroughly enjoy working with you guys, including all of your patrons and talented art exhibitors. When a client organization provides such high quality products and services as you do, our job of providing marketing and business development services is a piece of cake! Thank you for taking a moment to rate us and write a review. V. Blake - Internet Marketing Specialist"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "107917158782876540602", "name": "Sharon Bell", "time": 1468183198091, "rating": 5.0, "text": "Vernon Blake set up my website a couple of years ago, and he showed such patience and understanding with me since I am somewhat \"computer challenged\".   He and Shelley made great suggestions and helped me through the whole process.  His fee was more than reasonable, and he continues to check the website and help me with any changes I need.\n\nThe website is put together so nicely and is easy to maneuver.  I can not tell you how many clients who search the web, found my site, and have called to make an appointment with me.\n\nI just can not say enough positive about Vernon and Shelley and their work!!\n\nSharon W. Bell, M.S.\nLicensed Marriage and Family Therapist", "pics": null, "resp": {"time": 1469742476277, "text": "Hi Sharon! It has been a true pleasure to provide web design and website promotion services for your practice. Montgomery, Alabama is a great place for small, local businesses to market their products and services online, and your website project has certainly provided evidence of that. Of course, you have a LOT to do with that! We look forward to working with you in the future AND to your continued success! And thanks for taking the time to publish a rating & review!"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "112194497644220502983", "name": "Lisa Elliott", "time": 1392096865866, "rating": 5.0, "text": "Vernon has been a part of the Association for Play Therapy for years and has always been friendly and patient as he created our web presence.  Last fall, he went beyond the call of duty and he was our guest speaker for two lunch and learn meetings for the Central Alabama Play Therapy Network.  The presentations were polished, professional, and helpful to many therapists in Montgomery.  He provided valuable information to many private practitioners and agency counselors to manage their practices.  I highly recommend Bizeeo Web Marketing to any business seeking to establish or improve their web presence.  Bizeeo's customer service cannot be beat!", "pics": null, "resp": {"time": 1392097962227, "text": "Hi Lisa! It has been my pleasure working with AAPT... I really appreciate how active your organization has been over the years and your desire to make use of the web to both promote your cause and coordinate educational events. I am always available for future speaking engagements and other formal (or casual) presentations if you'd like to hear the truth about marketing your business online (that goes for any business or organization). Thank you very much for taking the time to leave a review, and I am looking forward to future projects! Vernon Blake - Marketing Specialist"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "114489763160957652511", "name": "John Courtney", "time": 1401713534252, "rating": 5.0, "text": "I was so intimidated by trying to build a website and all the information that went with it. I tried to talk to several people about the things that I needed but they all wanted to talk via email or text. When I finally found Vernon, he so kindly spent all the time I needed to help me. He solved my problem in record time. I will only use Vernon and his team in the future for all my web design and most importantly I know that I and my business are important to them. Thank You again Vernon, nothing but 5 stars from us.", "pics": null, "resp": {"time": 1409032558716, "text": "Hi John! Yes, your business IS important to us, as our success depends on the success of your business. One of our business development goals is to cut through all of the marketing techno-babble. This allows us to address and resolve marketing challenges in a manner that is understood and transparent to our clients. We constantly remind our clients that they should never accept anything we say without verifying our claims and shopping around. Ultimately, we want you to choose our marketing services NOT because we say we are one of the best, but because you have performed independent research and come to your own conclusion that Bizeeo is the right marketing service provider for your business. Thanks for taking the time to leave a review, and we look forward to working with you in the future. Vernon Blake - Bizeeo Marketing Agency"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "100006047040746085143", "name": "esala wueschner", "time": 1514330213315, "rating": 5.0, "text": "Gave me great advice over the phone. Highly recommended asking them for assistance.", "pics": null, "resp": {"time": 1514331903295, "text": "Hi Esala! We're glad we could point you in the right direction. Bizeeo Marketing uses WordPress software for all of our websites, and in your case we think WordPress.COM is an excellent choice for hosting your website. Remember to review their free themes at https://wordpress.com/themes/free and their tutorials at https://en.support.wordpress.com/start/. Good luck, let us know if you have additional questions, and THANK YOU for your rating and review!"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "108161717015002129451", "name": "Jonathan McKissack", "time": 1403633647911, "rating": 5.0, "text": "We really appreciate all the special attention and consideration provided by the Bizeeo team during our webpage construction.  They did a fantastic job helping us through the process and always treated us with professional service...a real class act!", "pics": null, "resp": {"time": 1409032829932, "text": "Hi Jonathan! When we work with clients such as yourself that possess a clear vision for your business development goals, our job becomes much easier. We thoroughly enjoyed working with you and your wife and look forward to future projects. Thank you for taking a moment to leave a review. Vernon Blake - SEO Marketing Specialist"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "116894094856529757653", "name": "Shelley Belly", "time": 1386084614567, "rating": 5.0, "text": "I'm so glad I found this company to handle a friend's marketing!  She had paid a few thousand dollars for \"web marketing\" and contacted me to complain that she couldn't be found on Google Search.\n\nI decided to Google \"Internet Marketing Services in Montgomery, Alabama\" and they are ranked #1!!  If they can do it for themselves, then they can do it for my friend / and THEY DID!!  They practice what they preach!!\n\nThank you, Vernon & Bizeeo Web Marketing.", "pics": null, "resp": {"time": 1386096193468, "text": "Hi Shelley! You know how much I appreciate you and your kind words. It pains me that small business owners spend their advertising and marketing dollars where they are ineffective. I hear horror stories like these from potential clients on a regular basis. I always advise them, whether they hire me or not, to \"do this and do that\" and \"ask this and ask that\" BEFORE selecting their next marketing agency. There are simply too many marketing service providers that over promise and under deliver, selling services that they know are not in the best interest of their clients. Even worse, many so-called \"web marketing\" agencies are experienced only with \"traditional\" marketing such as print, radio, or television, but expanded their services into the web arena in order to survive (or be more profitable). While most of these agencies are excellent at providing \"traditional\" marketing services, many of them are wholly unqualified to provide any type of online marketing services. They might be able to produce a \"pretty\" website, but that is a far cry from what is required to implement a successful, comprehensive web marketing campaign. Thanks again for leaving a review and allowing me to vent :-), Vernon Blake - Internet Marketing Specialist"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "100895179939230655573", "name": "Mickey Thompson", "time": 1582054595462, "rating": 5.0, "text": "I came back here again to thank Vernon and Shelley for the excellent work they continue to do for our business after all these years. We still have no need to do any other marketing or advertising other than the work they do for us, and I I can go about doing what I do best, and leave them to handle what they do best. I trust them implicitly and thank them for always being available when we need them.\n\nIn this day and age, it’s so nice to be able to do business with honest, decent, upstanding folks like these.\n\nFor the 7th year in a row, we have won the TripAdvisor award for best restaurant in Prattville.\n- - - -\nMy restaurant is off the beaten path in downtown Prattville, AL making it a challenge to attract new customers. In the past, I paid to advertise in the local newspaper, print magazines, print and Internet yellow pages and an online paid listing, with limited success. I hired Bizeeo over 2 years ago (October 2012) to market my restaurant online.\n\nThey manage my website, social media, business listings and online reviews (reputation management). Since then, growth has exceed 25% for 2 consecutive years.  Due to our success with Bizeeo Marketing, I've discontinued all other forms of advertising.\n\nAlso, this year (2015), our restaurant won TripAdvisor's Certificate of Excellence award (out of 99 restaurants). This is the 3rd year in a row we have won this award. I highly recommend Bizeeo - you can see for yourself online what they've done for us.", "pics": null, "resp": {"time": 1464976737257, "text": "Hi Mickey, we have learned so much about online marketing (we are ALWAYS learning) while maintaining your website and other web properties. The biggest take-away is for some industries (your Prattville business is an example), FAR more time and effort is devoted to marketing tasks \"off\" the website, like managing online reviews and promoting your brand via social media. Of course, the foundation of it all is we are fortunate enough to work with a business owner that KNOWS what customer satisfaction is all about. And... congratulations on your TripAdvisor \"Certificate of Excellence\" award for 2016... 4th YEAR IN A Row! And thanks for taking time to leave the nice review."}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
{"user_id": "111294172004688450473", "name": "Rodger Briley", "time": 1461093004289, "rating": 5.0, "text": "Really great and caring people.", "pics": null, "resp": {"time": 1464976838234, "text": "Hi Rodger, we appreciate brevity, and will respond in-kind. Thanks for the review!"}, "gmap_id": "0x888e81da0934f323:0xd6fbb2afcd00c8ab"}
