{"user_id": "107594182313251458655", "name": "Capt Nugs", "time": 1621966432379, "rating": 1.0, "text": "The receptionist is horrible, my first appointment she told me the wrong day, second appointment she lost my sign in sticker and after I waited 45 minutes I asked how much longer I had to wait and then she looked and found my sign in sticker. I left after waiting 2 hours. Would use anyone but this place!", "pics": null, "resp": null, "gmap_id": "0x888c2c0c572c4735:0x27cb5f09f548007a"}
{"user_id": "102522202329451004279", "name": "barbara brown", "time": 1597484568936, "rating": 1.0, "text": "This facility is incapable and lacks knowledge of imagining patients who have pacemakers compatible with MRI. They were all over the place in giving the reasons they could not see these type of patients which were inaccurate, eg., \"Pacemaker has to be shut off \"which is the wrong terminology on how patients with this compatible device are managed. This place is behind the times in comprehensive imaging.", "pics": null, "resp": {"time": 1597863533001, "text": "MRI centers accepting patients with MR-conditional implantable cardiac rhythm devices should refer to the SureScan Patient Scanning Process to find instructions for determining whether a patient with a Medtronic SureScan System meets the criteria to receive an MRI, as well as instructions to follow before, during, and after an MRI scan.\n\nAs indicated from the Medtronic web site, pacemakers and defibrillators are MRI CONDITIONAL, meaning all conditions must be met to perform the scan.  To safely scan a patient with one of these devices, proper monitoring must be performed during the exam, i.e. pulse oximetry or electrocardiography.  Please see below taken directly from their web site.  As you may notice, it is also required to have a defibrillator nearby when scanning patients with these devices.\n\nPacemaker and CRT-P Requirements: Proper patient monitoring*must be provided during the MRI scan.  An external defibrillator must be available nearby during the MRI procedure.\nICD and CRT-C Requirements: Proper patient monitoring*must be provided the entire time SureScan is programmed to On.  An external defibrillator must be immediately available the entire time MRI SureScan is programmed to On.\n*This includes visual and verbal contact with the patient and monitoring heart rate using instrumentation such as pulse oximetry or electrocardiography.\n\nAs an out-patient facility, we are not equipped to provide the level of monitoring required to perform MRI on patients with these devices.  This should give added comfort to prospective patients that we are considering all safety aspects of the exam rather than seeking to do all exams no matter the risk, just for financial gain."}, "gmap_id": "0x888c2c0c572c4735:0x27cb5f09f548007a"}
{"user_id": "117771020172809635711", "name": "Chance Cristwell", "time": 1576526941422, "rating": 1.0, "text": "Guy who bought the place actually ripped off the original owner, Suzanne Cristwell, who built the company, and paid her one installment of what was supposed to a multiple year contract. She's still trying to get it into court. Great quality equipment, especially considering the guy got it for next to nothing.", "pics": null, "resp": null, "gmap_id": "0x888c2c0c572c4735:0x27cb5f09f548007a"}
{"user_id": "108699333513666355151", "name": "Del Chick", "time": 1534280138963, "rating": 4.0, "text": "Closed MRI went great ! Had MRI on my lower back, only took 15 min. I went in feet first (thank goodness!) They gave me earplugs plus headphones to soften that horrific noise (it helped a lot). I also had Xanax. Put some pillows under me so I was comfy.  Had to keep eyes closed but at least my head was partially out. My arms were over my head on pillow holding my panic button, never used it.  Late in day seemed like better timeframe.  (At another place, they did this all wrong and I had instant panic attack, so I walked out!). This place is MUCH better.", "pics": null, "resp": null, "gmap_id": "0x888c2c0c572c4735:0x27cb5f09f548007a"}
{"user_id": "103190703707517351670", "name": "Peggy Chestnut", "time": 1508977991352, "rating": 5.0, "text": "Staff was very kind, punctual, and professional. I had a stress test performed within 24 hours of my physician's order. During the procedure every aspect was thoughly explained and monitored by the technician, and overseen by the doctor. I would definitely return for future services if needed, and will certainly recommend I M I.", "pics": null, "resp": null, "gmap_id": "0x888c2c0c572c4735:0x27cb5f09f548007a"}
{"user_id": "100783238213640100259", "name": "andrew moreland", "time": 1554359821070, "rating": 1.0, "text": "My brother had an appointment this past Tuesday at 2pm.  He was scheduled for a MRI.  When it was his turn we entered the room and she mentioned that his neck back and brain were being tested. I assisted the tech in getting my brother positioned on the table.  She put some type of head gear on him and she was having alot of trouble getting it on.  She kept trying to close it but it wouldn't close I thought it was too small but I wasn't sure she did finally get it closed (sidenote the headgear caused brusing under his chin).    Neither one of us had any idea on what was going to happen with this procedure.  She started the machine my brother nor I was told how long this procedure would take.   About an hour and a half went by we heard a banging in the room.  My brother was banging on the inside of the machine and yelling.  She pulls him out he is sweating profusely and he is shaking uncontrollably.  My brother is now refusing to finish the procedure.  We got him put back in his wheelchair he was crying uncontrollably as we left the clinic.  I'm not sure what happened in the MRI machine  to my brother but I would suggest that patients be told a little about the procedure and definitely how long the procedure will take.", "pics": null, "resp": null, "gmap_id": "0x888c2c0c572c4735:0x27cb5f09f548007a"}
{"user_id": "108835282275858384993", "name": "Solange Maury", "time": 1460065549887, "rating": 1.0, "text": "we were in  to get an MRI  waited for 2 hrs, when we asked how much time we had till our turn , they couldn't say... they said they werr running behind schedule. ... we ended up canceling our appointment. Don't schedule here waste of time! !!!", "pics": null, "resp": null, "gmap_id": "0x888c2c0c572c4735:0x27cb5f09f548007a"}
{"user_id": "107943412158637480608", "name": "SDavis Jones", "time": 1468599017702, "rating": 4.0, "text": "I went to IMI in Jan this year (2016) and again in July.  January, I had an echocardiogram; and in July, I had an MRI.  I had short wait times for both.  I was treated professionally for both, and have no real complaints for either.  Staff was courteous and professional.  I was referred both times by the same doctor.  I would not have any problems being referred again.  I gave them 4 out of 5 stars, because there is always room for improvement.", "pics": null, "resp": null, "gmap_id": "0x888c2c0c572c4735:0x27cb5f09f548007a"}
{"user_id": "113661709004820609383", "name": "Freya Renee", "time": 1611336944876, "rating": 1.0, "text": "I was very disappointed with my encounter here, the staff are awful.\nI was referred by my dermatologist to have an X-ray done. I do not have insurance but was fully prepared to pay out of pocket.\nThe admissions clerk made a spectacle out of me not having insurance, getting her boss to see if they would see me or refuse me service.\nHer boss tells me I need to get the specific code so she can look it up, which is literally her job.\nShe has all of my information and the dermatologist information in front of her and she tells me I have to do it myself, call her for a price, and then come back to get the X-ray.\nThis entire exchange was very loud and unnecessary, I left in tears.", "pics": null, "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "107555460630138821719", "name": "April Rowell", "time": 1610512172189, "rating": 3.0, "text": "Xx is Zaza zzzzzs zdx zzz cc zzz zzzz z. Z s.  Xxx", "pics": null, "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "118015363690752546490", "name": "Sister Sabotage13", "time": 1575673095972, "rating": 4.0, "text": "All of the staff have been caring and very attentive. I've never had a better stay in a hospital. The food leaves a but to be desired but I feel like I'll be great. It started in the er and now I've been in for 3 days. I'm getting great care. I couldn't ask for a better experience", "pics": null, "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "111698133747226116400", "name": "Lisa Marie", "time": 1592091531380, "rating": 1.0, "text": "DO NOT COME HERE FOR AN EMERGENCY. We were passing through and a family member had a serious seizure nearby. He was puking in the waiting room and no one cleaned it up. They said \"housekeeping is gone for the day.\" The nurse wasn't wearing scrubs or a mask. Patient was barely able to communicate and they kicked his spouse out of the exam room. They attempted to kick the spouse out of the hospital completely, saying \"no visitors.\" Refused to let family communicate with patient to gauge his decision-making abilities and kept saying he was fine, even though they had to come out to the waiting room to ask about meds and medical conditions because he couldn't communicate this information!! Place is filthy, please Alabama do something about your rural healthcare.", "pics": null, "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "106618823853064825050", "name": "classic rock Kelley", "time": 1582657534797, "rating": 5.0, "text": "I was so so sad to hear that this hospital 🏥 was closing. One of the best there was. Would have my loved ones there over Troy, Greenville and Luverne. Doctors and Staff were like Family.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNkQsYzLsSxm5LmZVJDEA2rXbTkTMmGawC8sIR2=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "101576102177085714499", "name": "Will Weider", "time": 1505944680630, "rating": 5.0, "text": "This community is lucky to have a quality local hospital and emergency room. They have great staff and provide personalized care.\n\nWhen I was there the hospital leaders were serving nachos to the employees. I think this reflects the caring culture of the organization.", "pics": null, "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "103405616010048516366", "name": "Talisa Reaves", "time": 1562519953268, "rating": 5.0, "text": "Although we had a 3 hour visit, the staff was  phenomenal!!!! We had the sweetest nurses that actually took the time to talk to my children to keep from being scared and to help them feel better about our visit. My boys we’re running high fever and hurting all over, the staff immediately tested them. Our nurse was very gentle with my children during the nose and throat swabs that my 4 and 7 yr old didn’t even cry or flinch.  They ended up having the flu and one of our nurses even brought them suckers. All during this time they were serving 6 other patients for way more serious conditions. It meant so much to me that even though they were working under a lot of stress they still treated my children like their pediatrician would have.", "pics": null, "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "117390850376473595606", "name": "Kiamonte Gulley", "time": 1613082181679, "rating": 1.0, "text": "THE WORST HOSPITAL IN THE STATE DO NOT GO IF YOU ARE IN EMERGENCY NEED !!!!!!!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "108438353552208448369", "name": "Thomas Schofield", "time": 1571608112940, "rating": 1.0, "text": "This review has been in waiting for years! Thank God for Google Dr Nami almost killed my dad in critical care due to neglect and negligence on her part I will not retire in Alabama instead Michigan thank God I will never see the inside of this band aid hospital", "pics": null, "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "100617447239344531628", "name": "Daniel Taylor", "time": 1534475023150, "rating": 1.0, "text": "Waited 4.5 hours for lower back pain from bulging disc flare up. Was never asked about my meds so I told the doctor that I was already taking nsaids and muscle relaxers daily as he rushed out of my room after 30 seconds. They bring me a muscle relaxer and an nsaid! When I asked the doctor about it, he said he NEVER gives anything more than that for pain. Uncaring ER staff who will not treat you pain.", "pics": null, "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "104683954469047129195", "name": "lee black", "time": 1513197416218, "rating": 1.0, "text": "Do not go here they will take you to court over the smallest amount of money and then if you still don’t pay they will garnish your wages. They are relentless when it come to pursuing you.", "pics": null, "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "113057614965601808743", "name": "Isabella S", "time": 1536089644124, "rating": 1.0, "text": "There is a nurse there named “Troy” who has no bedside manner whatsoever and is unapologetic when addressed.\nDefinitely shouldn’t be working there.", "pics": null, "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "117893397349599746666", "name": "Michael Owens", "time": 1535175722050, "rating": 1.0, "text": "This place doesn't even deserve a star. Been here almost 2 1/2 hrs and haven't even seen doctor for a large gash in my 3 yr olds head.", "pics": null, "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "109728912416387904793", "name": "Roger Mulnix", "time": 1552763685451, "rating": 1.0, "text": "Sitting here almost 3 hrs and ain't been seen yet, website says 30minute pledge..just wondering when that kicks in?", "pics": null, "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "118102863031197068413", "name": "kerri sanfilippo", "time": 1561523712533, "rating": 1.0, "text": "Taking forever to see my ole man he might of had an heart attack", "pics": null, "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "116675735112347470401", "name": "Brandon Hinson", "time": 1490221522564, "rating": 1.0, "text": "Horrible service and horrible attitudes I think I would rather take my chances on making it to Montgomery during a life threating experience", "pics": null, "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "108221143402496468912", "name": "JoAnna Hall", "time": 1513024908795, "rating": 1.0, "text": "Slowest hospital EVER.", "pics": null, "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "103420733516288253205", "name": "FRANBAR PRODUCTIONS", "time": 1474206617956, "rating": 5.0, "text": "Saved my Life", "pics": null, "resp": null, "gmap_id": "0x888e3c6950ba21fb:0x67958daacc8f6c2f"}
{"user_id": "116110006461265447672", "name": "Lisa Brown", "time": 1628258490613, "rating": 5.0, "text": "Great staff to take care of you!", "pics": null, "resp": null, "gmap_id": "0x8889cf2b4509c919:0xaa0e7fa6d44deb25"}
{"user_id": "100092290405605326367", "name": "Brenda Miller", "time": 1619633877770, "rating": 5.0, "text": "This was my first time visiting this center and also the first time having a CT scan.  Everyone was extremely helpful and friendly. Thank you!", "pics": null, "resp": null, "gmap_id": "0x8889cf2b4509c919:0xaa0e7fa6d44deb25"}
{"user_id": "107944332818652877461", "name": "William Jessip", "time": 1612126496150, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x8889cf2b4509c919:0xaa0e7fa6d44deb25"}
{"user_id": "107609359098103305837", "name": "Kristy Clark (Robinson)", "time": 1584173200941, "rating": 4.0, "text": "I went in to have a mammogram and a bone density scan and I was in and out of that place in about 45 mins and that was including filling out the paperwork. The women who work there are friendly, they weren't smiling nor did they greet me as I walked in the door. I'm not complaining about it as I'm sure it seems I am. It's just unusual to walk in somwhere like that and see 3 women behind the front counter and not be greeted by at least one of them but, they were in no way rude to me and I will recommend them in the future.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPRTYtshglHfy0NLiT05QNfzHz8fejCc6GQhAEp=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNdGpNN18RF26YDvHDfewa6hF1qppDLWLRwDeEJ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNgl1UNP2SGJmGbkehjiHAMdxT9KIbjVS_R_6H8=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOePY-fGeLFrqEngOoeEBrC1Pe827STLopdZMv0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMjFSdUvqVZ0Y2RXi7WGipsajMGrugCKxx1cmXk=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMmgK0hBblxt8jart-48RJ_hrBlbGzFM0SXAp-A=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888bb1f2a13d6cb3:0x69444459bbe4060e"}
{"user_id": "113079655758977663172", "name": "Shannon Gauldin", "time": 1613414101931, "rating": 5.0, "text": "It's a very nice building inside and out. The staff was very kind and helpful too! The Radiologist was able to find the problem with my spine that some had missed in previous years. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888bb1f2a13d6cb3:0x69444459bbe4060e"}
{"user_id": "100342318910300394049", "name": "Lajuna Reid", "time": 1610147518924, "rating": 5.0, "text": "I would like to praise the girl that did sonogram of my leg, she was absolutely the sweetest and compassionate person.  She helped calm my nerves immediately.", "pics": null, "resp": null, "gmap_id": "0x888bb1f2a13d6cb3:0x69444459bbe4060e"}
{"user_id": "106878261312411244085", "name": "zeravela1", "time": 1622129239715, "rating": 1.0, "text": "Very rude customer service.", "pics": null, "resp": null, "gmap_id": "0x888bb1f2a13d6cb3:0x69444459bbe4060e"}
{"user_id": "110276973623499826595", "name": "Susan Watson", "time": 1605546095558, "rating": 5.0, "text": "Short wait time and very courteous staff. Allison did my ultrasound and couldn't have been any sweeter!", "pics": null, "resp": null, "gmap_id": "0x888bb1f2a13d6cb3:0x69444459bbe4060e"}
{"user_id": "114472514454873045492", "name": "Karen Buck", "time": 1578524129296, "rating": 5.0, "text": "Had to have 3 tests done. Everyone was great and friendly. Was in and out in under an hour and a half. Love this place and will definitely Use them again", "pics": null, "resp": null, "gmap_id": "0x888bb1f2a13d6cb3:0x69444459bbe4060e"}
{"user_id": "100239681464813045800", "name": "Josey Wolfblood", "time": 1579561841422, "rating": 1.0, "text": "In short . I was treated awful. Basicly. Called a liar by one the ladies behind the counter.  Was told if I didn't fill papers out really fast then I couldn't be seen. In not giving her name out. Also I wasn't at fault for nothing. It was advance imaging. I should say more of way I was done an in front of other people.  Its been awhile since been to the Anniston office. But I wonder. Where the nice people go. That worked behind the counter.", "pics": null, "resp": null, "gmap_id": "0x888bb1f2a13d6cb3:0x69444459bbe4060e"}
{"user_id": "112793139206442120335", "name": "Lawrence Marksberry", "time": 1575567385517, "rating": 1.0, "text": "If I could I wouldnt give even one star! It was an awful experience. The mri tech was cold, rude and without ability, I guess, to even give a half-smile. But the worst part is that I was stuck SIX TIMES before my contrast IV was started. The first, rudest, tech stuck me twice then called in someone else who finally got it on the FOURTH try. Yes that makes SIX attempts. But she tried to get me to just stop and call it finished without the contrast on her second (4th total) attempt. I told her no, that I wanted to get the complete test that my doctor ordered. She said she could probably put the iv in the underside of my wrist but that it would “hurt real bad”. I asked her to please try my thumb first, which she did and finally got it. Not one apology from either tech about having to stick me so many times. They did not care at all that they were hurting me, just that it was taking so long. This was unacceptable to say the least. When they finally finished the test, I had been in that one position so long that I couldnt get up. The tech gave me a disapproving look and just stood there frowning till I finally got up. I had trouble walking for some time after this debacle. Horrible place! I will do anything I  can to avoid ever going there again.", "pics": null, "resp": null, "gmap_id": "0x888bb1f2a13d6cb3:0x69444459bbe4060e"}
{"user_id": "114665401759897159364", "name": "Whitney", "time": 1543537748017, "rating": 5.0, "text": "Have been several times for an MRI, and the staff is always great!", "pics": null, "resp": null, "gmap_id": "0x888bb1f2a13d6cb3:0x69444459bbe4060e"}
{"user_id": "104547102503378989192", "name": "Christina Johnson", "time": 1464787872564, "rating": 5.0, "text": "The girls at front desk were very nice and patient with me!", "pics": null, "resp": null, "gmap_id": "0x888bb1f2a13d6cb3:0x69444459bbe4060e"}
{"user_id": "111469848629939490090", "name": "Blake Burgess", "time": 1562092261016, "rating": 1.0, "text": "The \"greeter\" was very rude, some of the others were nice, the greeter appeared to be the boss, uh, wrong choice", "pics": null, "resp": null, "gmap_id": "0x888bb1f2a13d6cb3:0x69444459bbe4060e"}
{"user_id": "115934086254684630629", "name": "Latangela Gaston", "time": 1459455559047, "rating": 2.0, "text": "2016- Advance Imagining front desk staff, presented rude & disrespectful to very diverse clienital ! Sly giggles & jokes that appeared to a be familiar inside trade  of the all Caucasian staff!  This made them appear very unprofessional!  Staff members poked fun of clients names for laughs from her friends,  instead of asking client how do you prenounce your name! If your familur with the MRI,  the technician  usually tells you a little about contraption & the noisy happenings, provides u with a choice of earplugs  or headset of music; Not here! Only offered after I ask, After I was in for 20 minutes & halfway deaf! I suggest that the owner, if not a member of the staff,  hold an insevice on professionalism in the work place & cover all  things mentioned,  talk to the office manager about  diversifing her staff &  teaching the Lil High School  acting girls & boys what to do & what nonsense will  not be tolerated within the office! Oh yea there was one good aspect, the service was quick!😊 Hopefully I'll get professional results & not  have to return!  Now to the staff You Can't judge a book by its cover, you have to read it in its entirety!  Now Happy Imaging !", "pics": null, "resp": null, "gmap_id": "0x888bb1f2a13d6cb3:0x69444459bbe4060e"}
{"user_id": "108684484724957934471", "name": "DOGTV", "time": 1595443696359, "rating": 4.0, "text": "Nice people", "pics": null, "resp": null, "gmap_id": "0x888bb1f2a13d6cb3:0x69444459bbe4060e"}
{"user_id": "101575948064222543375", "name": "Kellie Terry", "time": 1517867151967, "rating": 5.0, "text": "This facility is amazing, super clean with large changing rooms. There are windows in the MRI room so you can see daylight.  The machine isn't too tight.  Even larger people can fit comfortably.  The staff is super sweet and easy to work with.  They do everything they can to schedule your MRI for a day and time that is convenient for you.", "pics": null, "resp": {"time": 1532627217957, "text": "Thank you, Kellie!"}, "gmap_id": "0x886286909a0c2b1d:0x4eb6c3fa4619dbcf"}
{"user_id": "107532281106470587621", "name": "Alyssa H", "time": 1572659801113, "rating": 5.0, "text": "I had a great experience with my first MRI.  The staff were all friendly and glad to answer all my questions.", "pics": null, "resp": {"time": 1572726903601, "text": "Thank you for the kind review, Alyssa!  We appreciate you and your support."}, "gmap_id": "0x886286909a0c2b1d:0x4eb6c3fa4619dbcf"}
{"user_id": "104855703330462193098", "name": "Rebekka Sharpe", "time": 1511961537226, "rating": 1.0, "text": "Friendly staff, comfortable environment, but SCAMMY! I paid a large copay about three weeks ago to get an MRI and still know nothing. They \"sent it off to Birmingham\" to be read where the results would then be sent to my doctor, but my doctor has heard nothing. First of all if you have a state of the art MRI facility in Decatur Alabama why can you not have someone in Decatur Alabama read the results? Secondly if the results cannot be read at the facility then why Birmingham? There are plenty of places in the area that have someone in house to read your MRI, or at least get the results back to you in a day or three.", "pics": null, "resp": {"time": 1514388261931, "text": "Good Morning, Rebekka Sharpe.  The results of your MRI were sent to your referring physician on 11/15/17 in under 24 hours. We have the fax confirmation on file of when and where it was sent.  Your referring physician is whom you need to speak with about those results. If you are having trouble still, please call us at 256-350-7779.  Just let us know! We will be happy to send the results again to your referring physician if they need us to. We partner with a group of Radiologists to read our scans out of Birmingham. This helps to provide accurate reads in a timely manner (24 hour results). I hope this information helps.  Have a great day and we wish you a Happy New Year."}, "gmap_id": "0x886286909a0c2b1d:0x4eb6c3fa4619dbcf"}
{"user_id": "103087262805385508069", "name": "Phillip Hand", "time": 1494967313238, "rating": 5.0, "text": "Best staff around! Easy to work with and always make sure to give you the best experience possible. Definitely a 5 star organization!!!", "pics": null, "resp": null, "gmap_id": "0x886286909a0c2b1d:0x4eb6c3fa4619dbcf"}
{"user_id": "103032759725416942896", "name": "Renee Knight", "time": 1517686146039, "rating": 5.0, "text": "Friendly staff with same day scheduling. Very comfortable place to have an MRI. Especially if you are claustrophobic.  It is open on all 4 sides which made it much easier for me to relax and complete the MRI.", "pics": null, "resp": null, "gmap_id": "0x886286909a0c2b1d:0x4eb6c3fa4619dbcf"}
{"user_id": "112644535797295232634", "name": "Susan Williams", "time": 1517757190830, "rating": 5.0, "text": "Absolutely wonderful experience the staff is very friendly and willing to work with you in any way. I suffered from back pain for years and the last alternative was an MRI but I was claustrophobic but they were patient with me and worked with me to help me be able to get one, the openness of the machine was soo much better the problem was found I had back surgery 2 months ago and now NO PAIN! Thank you to Heath Alford and his stafff I would recommend them to anyone in my situation 😊", "pics": null, "resp": null, "gmap_id": "0x886286909a0c2b1d:0x4eb6c3fa4619dbcf"}
{"user_id": "107886256715711815064", "name": "Bobby Holladay", "time": 1513016923831, "rating": 5.0, "text": "Open MRI's staff was unbelievably nice and courteous. I was in and out with a very short wait time.  Facility was immaculate.", "pics": null, "resp": null, "gmap_id": "0x886286909a0c2b1d:0x4eb6c3fa4619dbcf"}
{"user_id": "116521165396725705161", "name": "Whitley Alford", "time": 1512709142820, "rating": 5.0, "text": "Friendly staff with a clean facility and welcoming atmosphere.  Great place to go if you are claustrophobic. Results back within 24 hours.", "pics": null, "resp": {"time": 1514388293781, "text": "Thank you for the review, Whitley."}, "gmap_id": "0x886286909a0c2b1d:0x4eb6c3fa4619dbcf"}
{"user_id": "105606727293312010457", "name": "Michael Johnson", "time": 1629303919274, "rating": 5.0, "text": "I needed to have two recent exams from this office and the staff and techs could not have been more courteous or helpful.  I was seen in a timely manner for both exams and was treated with care and respect by both techs I came in contact with.", "pics": null, "resp": {"time": 1629380944328, "text": "Everyone’s time is important so we strive to help our patients get back to their day quickly while still providing exceptional care."}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "108392362009937469151", "name": "Bradley Moss", "time": 1629489825911, "rating": 5.0, "text": "I interact with this staff on a daily basis and always find each staff member going above and beyond the call of duty to exceed the customer service expectations of those served. Feedback from patients served regarding the care and services delivered by this Team is amazing.", "pics": null, "resp": null, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "117339453867694611996", "name": "Meagan Hirt", "time": 1629123467515, "rating": 5.0, "text": "I had a chance to interact with their operations manager and administrator and they are beyond delightful! Their welcoming and willing personalities certainly permeate throughout their center because everyone is awesome!", "pics": null, "resp": {"time": 1629380840370, "text": "Our team puts patients first and we’re glad our team’s dedication to providing an elevated experience is showing!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "106562259216624605234", "name": "Chelsea Pickett", "time": 1621340371129, "rating": 5.0, "text": "A+ experience. Deborah called to let me know the cost a day ahead of time and was quick with the paperwork day of. Didn't wait too long before going back to prep for the CT scan. John went above and beyond to make sure I was prepared and comfortable (even offered a warm blanket!). Overall the process took about an hour, faster than my original estimate at Huntsville Hospital.", "pics": null, "resp": {"time": 1621626022184, "text": "We know everyone likes to save and every patient deserves to know, in advance, how much their healthcare will cost. We believe in price transparency and show our affordable imaging costs on our website at  https://odcalabama.com/value-finance/"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "117812405147533893989", "name": "Tammy Mendoza", "time": 1614375722728, "rating": 5.0, "text": "My mom, 78 years old, doesn't always get around well and doesn't hear well.  She came home and asked that I do a review and let everyone know how great Jerry was with her.. Patient and kind.  Thank you for being nice to the elderly and not just getting frustrated with them.  This daughter greatly appreciates it.", "pics": null, "resp": {"time": 1614714876852, "text": "It is our privilege to provide imaging services and our team works hard to make it a good experience. When we hear we’ve done it well, it makes our day!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "114106712849861228396", "name": "Beth Allen", "time": 1620353844038, "rating": 1.0, "text": "I went to my physician the morning of my mri of my brain to get a Valium and went to my appointment at 1:00 and there were at least 7 people in the waiting room!!!! Never have seen that before!!! I accidentally took my old Blue Cross card and the girl at the front was figuring my cost without Insurance(over $500.00)!!!! This has happened before and if there is a problem the offices call B/C B/S and should be handled within a couple of minutes!!! I guess her fingers were hurting because she never offered any help!!!! Even if I had the current card the Valium would would have worn off by the time I would have the MRI!!!!! Horrible experience especially driving 30 minutes to get there!!!!!!!!", "pics": null, "resp": {"time": 1620412441187, "text": "There’s nothing we value more than feedback – even if it tells us we didn’t meet expectations. That’s how we know where to focus our efforts. Our Administrator, Brad, can be reached at 256-534-5600 to discuss any patients’ specific concerns."}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "104093130989591707527", "name": "Robert Dixon", "time": 1616625643691, "rating": 5.0, "text": "The Administrative Staff and Amber, my\nX RAY Technician were highly professional and provided me outstanding customer service during my visit. They were very courteous and my visit was very pleasant.", "pics": null, "resp": {"time": 1617199285007, "text": "Our team puts patients first and we’re glad our team’s dedication to providing an elevated experience is showing!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "117685975875496988496", "name": "Benjamin Schwartz", "time": 1604689199707, "rating": 5.0, "text": "Scheduling was very easy, they let me know prior to my appointment how much it would cost, the wait time was short, and the staff was very friendly. My tech, John, kept my informed the entire time and made sure I was comfortable.", "pics": null, "resp": {"time": 1614714944726, "text": "We always love to hear positive feedback. Providing an elevated experience for every patient who chooses us is the goal of each of our team members."}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "109551950413791403300", "name": "Joe Suede", "time": 1556201367691, "rating": 5.0, "text": "Ms. Laura was fast and fantastic. I did not wait long at all and Ms. Laura ensured that we got the proper picture that she knew my specific doctor wanted to see. Highly recommend and will be back next time I need a x-ray.", "pics": null, "resp": {"time": 1557418756119, "text": "Thank you, Joe!! We really appreciate your positive feedback! Have an awesome day!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "114986822846832037109", "name": "Dianne Holder", "time": 1559009470941, "rating": 5.0, "text": "I had a CT Scan on 5-24-19 John was my Technologist he did a amazing job. The patient Care Coordinator was Cawanna , Excellent! You have a wonderful staff.", "pics": null, "resp": {"time": 1559073459340, "text": "Dianne, thank you for your kind words! We appreciate you!!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "110624729509294808672", "name": "N B", "time": 1541713226542, "rating": 1.0, "text": "Went for an ultrasound to diagnose a time sensitive condition.  Was told that the results would immediately be sent in for review and I would get a call from the doctor.  The next day, still no call.  After talking with three people, it was discovered that they never bothered to send the results in for review.  Staff friendly enough but that amounts to nothing when you cannot be bothered to do your job.", "pics": null, "resp": null, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "100513396439572917461", "name": "Janet Jones", "time": 1576885675590, "rating": 5.0, "text": "My daughter went in for a test and everyone was very friendly and professional and the appointment went quickly!", "pics": null, "resp": {"time": 1577379200250, "text": "Thanks so much for the kind review!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "113255707023435743415", "name": "Jaime 0212", "time": 1570558834508, "rating": 5.0, "text": "Amazing experience having my mammogram done by Amanda at the Hughes location.  I will never go back to the Breast Center.", "pics": null, "resp": {"time": 1571956602186, "text": "Thank you, Jamie!!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "114025028233521867557", "name": "Neil Young", "time": 1536782368783, "rating": 4.0, "text": "Went for an ultrasound and the staff was very nice and helpful.  The lady at the desk was nice and the lady that did the ultrasound was extremely nice as well. They got me in and out fast.", "pics": null, "resp": {"time": 1537369066718, "text": "Neil, thank you for taking time to give us your feedback. We appreciate you!!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "111527781428769942211", "name": "NoK Wolf", "time": 1544140823651, "rating": 4.0, "text": "They are good to call you and let you know stuff  but I'm tying confirm an appt based on their last call by calling them and I've been on 'hold' for 28 minutes,and been on hold 35 minutes earlier this morning before I gave up. They need more admin staff.\nEdit. After I arrived it was a very quick process, less than 1hr from start to finish.", "pics": null, "resp": {"time": 1544213473261, "text": "We appreciate your honest feedback. Thank you for taking the time to let us know how we can serve you better. Have a great weekend!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "108152041962050645342", "name": "Jayla Carter", "time": 1549904734704, "rating": 1.0, "text": "I called in and asked for about an appointment since I never received a call to get scheduled. I was told I didn’t need an appointment and to just walk in. I get there and watch 3 ppl go in before me. Got the excuse that ppl with appointments go before me. This is ridiculous and unfair. Others were called and scheduled, I have to wait and I’m having to suffer because I was apparently given the wrong information. My time isn’t valuable at all to them and I will be letting my doctor know that I never want to use them again.", "pics": null, "resp": null, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "103935452150546892825", "name": "Justice Writer", "time": 1493431949057, "rating": 1.0, "text": "Terrible service.  We will never, ever go back.  The front desk of any office is the most important part of an office as far as clients are concerned.  Unfortunately, however, Brook, the front desk employee was hostile, rude, nasty and just plain a  bad liar. Laura too was unhelpful initially; but not to the full extent of Brook who is a poser, a fraudster and unprofessional. Brook’s sour attitude will likely be the reason why many clients, like us, will go elsewhere. What a shame.", "pics": null, "resp": null, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "112316758943218986325", "name": "cloud s", "time": 1562621250472, "rating": 1.0, "text": "2 weeks and they still haven't sent the lab work. Terrible place.", "pics": null, "resp": {"time": 1562697705528, "text": "We appreciate the opportunity to resolve concerns and learn about ways we can improve our services and communication. We are sending your feedback to our Center Administrator. If you would like to speak to him as well, please call: 256-534-5600. Thank you"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "112369825691218293826", "name": "Lisa Mudrow", "time": 1607620987743, "rating": 1.0, "text": "Finally someone said it! At first I didn't want to say anything, but I saw the previous review and I had a similar experience. Good office and friendly staff but they seem to not realize or not understand that there is a pandemic going around and Gadsden is one of the worst places in the nation - because of people like this. I come in regularly and I see your staff dropping like flies. I wonder why? Just this week I saw pictures from their public Christmas party wear NO ONE was wearing a mask. Do they not understand the risk they are putting themselves and others at or are they just too selfish to care? Shame on AIG. I'd rather go to Gadsden Regional. At least they know how to wear a mask.", "pics": null, "resp": null, "gmap_id": "0x888a3eacbe0a06d7:0xc71bd2f0e6b84a6b"}
{"user_id": "100671101641115792496", "name": "Steve Praytor", "time": 1619818057840, "rating": 1.0, "text": "Have been waiting 24 hours plus for the results on an ultra sound. I was told that day or next afternoon.", "pics": null, "resp": null, "gmap_id": "0x888a3eacbe0a06d7:0xc71bd2f0e6b84a6b"}
{"user_id": "100797446851396606469", "name": "Harrison Wilson", "time": 1607620204557, "rating": 1.0, "text": "I've been coming to this office for years and the staff is friendly and it's generally a good experience, but they have really let me down over the past few months. I came in the other day for an appointment and NONE of the staff were wearing masks behind the plexiglass and then I heard the head DOCTOR talk openly about his recent positive COVID test. Without a mask! Around all of his employees and patients. And these people are allowed to practice medicine? They're not even smart enough to not put their own employees at risk. Shame on Advanced Imaging for shirking their responsibility to keep their staff and customers safe. Shame on Advanced Imaging and Dr. Ken Hager for knowingly endangering people. These people should not be allowed to treat others until they figure out how to 'first do no harm.' Go back to med school, quack.", "pics": null, "resp": null, "gmap_id": "0x888a3eacbe0a06d7:0xc71bd2f0e6b84a6b"}
{"user_id": "107069517672061011828", "name": "Marie Razvaliaeff", "time": 1582339637793, "rating": 5.0, "text": "I had an awesome experience. I was very anxious and the MRI tech was so comforting and pleasant. I wish that I could remember her name to give her a shout out, thank you so much.", "pics": null, "resp": null, "gmap_id": "0x888a3eacbe0a06d7:0xc71bd2f0e6b84a6b"}
{"user_id": "107025965562238834695", "name": "Warthaddous Morris", "time": 1601747832873, "rating": 5.0, "text": "Very nice staff. Efficient and professional.", "pics": null, "resp": null, "gmap_id": "0x888a3eacbe0a06d7:0xc71bd2f0e6b84a6b"}
{"user_id": "113141364655039573483", "name": "Drbarry Burns", "time": 1420550779676, "rating": 5.0, "text": "Excellent staff and so comfortable,,, not like a Hospital . You come out feeling hopeful and grateful for the staff that work there.  It is not an unpleasant experience as in a Hospital, it is like an informal trip to 6 Flags !  I highly recommend them for all types of tests. Although my Bone Density scan was , not good, my experience at Advanced Imaging was outstanding and comfortable.", "pics": null, "resp": null, "gmap_id": "0x888a3eacbe0a06d7:0xc71bd2f0e6b84a6b"}
{"user_id": "108697402995072845505", "name": "Sam Simmons", "time": 1568676205902, "rating": 1.0, "text": "I can't put into words!! Absolutely horrible staff from office personal to medical employees!! Do Not waste your time!! Find somewhere else to go!!!", "pics": null, "resp": null, "gmap_id": "0x888a3eacbe0a06d7:0xc71bd2f0e6b84a6b"}
{"user_id": "102692759886329827895", "name": "James Hutchinson", "time": 1545394883151, "rating": 5.0, "text": "They took me in at almost closing time. Had wrong time of appointment.  I drove from Talladega.  THANKS", "pics": null, "resp": null, "gmap_id": "0x888a3eacbe0a06d7:0xc71bd2f0e6b84a6b"}
{"user_id": "112701495330735914777", "name": "Olivia M", "time": 1622148807502, "rating": 2.0, "text": "Check in was easy, the staff were kind. However, they charged me the day of my service and then tried to bill me a second time through their outside billing company. It took mulitple phone calls with 30 minute holds to clear this up and prove that I had already paid it. Total waste of my personal time. The whole situation felt shady and I think they just hope people don’t notice or give up. I won’t use them again and I wouldn’t recommend them.", "pics": null, "resp": null, "gmap_id": "0x886213536eb6ed0d:0xb379f470f66b9844"}
{"user_id": "106408770114890613382", "name": "Allison McCormick", "time": 1613084002405, "rating": 5.0, "text": "Easy check in process for my CT scan. Everyone was friendly. The gal doing my CT was wonderful. I didn't even feel her start the IV for the contrast.", "pics": null, "resp": null, "gmap_id": "0x886213536eb6ed0d:0xb379f470f66b9844"}
{"user_id": "115355600122508372319", "name": "Sheila Thompson", "time": 1614728885165, "rating": 1.0, "text": "They can't give me my own results..... this makes NO sense. I have never encountered this EVER", "pics": null, "resp": null, "gmap_id": "0x886213536eb6ed0d:0xb379f470f66b9844"}
{"user_id": "108555151326817041423", "name": "Ashlee Pearson", "time": 1609175912528, "rating": 5.0, "text": "The MRI Center of Imaging was very professional and a special shout out to Greg in the Captain America top was super entergetic and fun person!", "pics": null, "resp": null, "gmap_id": "0x886213536eb6ed0d:0xb379f470f66b9844"}
{"user_id": "110145497811780393662", "name": "Yun Ku Pak", "time": 1617794067506, "rating": 5.0, "text": "Professional  staff.", "pics": null, "resp": null, "gmap_id": "0x886213536eb6ed0d:0xb379f470f66b9844"}
{"user_id": "106166113725049941965", "name": "Patricia Johnson", "time": 1581361354092, "rating": 5.0, "text": "Very kind and explained everything they were doing", "pics": null, "resp": null, "gmap_id": "0x887d48d20c865609:0x12df83a3905fc323"}
{"user_id": "101422987151476785641", "name": "vonda stutts", "time": 1552410737098, "rating": 1.0, "text": "This office is listed here online as an open mri. I an claustrophobic.  I went for an mri on my head and guess what,i couldnt stand to even get all the way in before i was losing it. If you cannot stant to be confined this is not the place for you.\nThey really need to change the name online because it is very deceiving.They do not have an open MRI !\nBy the way the people who work there were extremely nice and polite.", "pics": null, "resp": null, "gmap_id": "0x887d48d20c865609:0x12df83a3905fc323"}
{"user_id": "111924507194827241810", "name": "fatboy6022", "time": 1408460627188, "rating": 5.0, "text": "Super Folks!!", "pics": null, "resp": null, "gmap_id": "0x887d48d20c865609:0x12df83a3905fc323"}
{"user_id": "103367816966623413898", "name": "Syeda Ruksana", "time": 1614780233836, "rating": 5.0, "text": "I were feeling a Heart problem so at urgent basis i visited to MedHealth & Oh my dear Lord they provided the best possible urgent care to me. great staff .plus they are fully following all the sops related to covid these days.", "pics": null, "resp": null, "gmap_id": "0x888e802f2b9ed49b:0x8a5be4ea48ca25e9"}
{"user_id": "101505670296431299656", "name": "Adreana jhons", "time": 1614487729609, "rating": 5.0, "text": "Great reliable care. Very supportive staff take good care of you.", "pics": null, "resp": null, "gmap_id": "0x888e802f2b9ed49b:0x8a5be4ea48ca25e9"}
{"user_id": "107838390942706878520", "name": "Alexander Jhon", "time": 1614781150724, "rating": 5.0, "text": "I searched about Covid testing nearby and found Medhealth. They are just great (Environment,Staff) everything is spot on. I will Suggest all of you living nearby Montgomery to Visit MedHealth specially for Covid Testing.", "pics": null, "resp": null, "gmap_id": "0x888e802f2b9ed49b:0x8a5be4ea48ca25e9"}
{"user_id": "100970515978167274886", "name": "Leader Raza", "time": 1614919752522, "rating": 5.0, "text": "Medhealth urgent care is best urgent care in Montgomery Albama. If you need any urgent care, then visit medhealth urgent care.", "pics": null, "resp": {"time": 1614925389075, "text": "Thanks for the feedback & glad we help you in any sort"}, "gmap_id": "0x888e802f2b9ed49b:0x8a5be4ea48ca25e9"}
{"user_id": "108029861274743801829", "name": "Syeda Amal", "time": 1614780621540, "rating": 5.0, "text": "Great place and very cooperative staff.Provides reliable urgent care.", "pics": null, "resp": null, "gmap_id": "0x888e802f2b9ed49b:0x8a5be4ea48ca25e9"}
{"user_id": "115613219543521687930", "name": "Laiba Khan", "time": 1614872820817, "rating": 5.0, "text": "Great doctors and friendly staff ..loved it❤️", "pics": null, "resp": null, "gmap_id": "0x888e802f2b9ed49b:0x8a5be4ea48ca25e9"}
{"user_id": "117548232518408896683", "name": "Collective Conscious", "time": 1599184690915, "rating": 5.0, "text": "Best Urgent Care in the city, from the staff, to the wait and to the office decor. I LOVE THE DOCTOR AND THEY TAKE GREAT CARE OF THEIR PATIENTS! Highly recommended facility.", "pics": null, "resp": null, "gmap_id": "0x888e802f2b9ed49b:0x8a5be4ea48ca25e9"}
{"user_id": "111974152995333697521", "name": "C DeLoach", "time": 1616786097443, "rating": 1.0, "text": "Closed on Fridays, not sure why it says it's open but the current office hours are:\nMonday: CLOSED\nTuesday: 9-5\nWednesday: 9-5\nThursday: 9-5\nFriday :CLOSED\nSaturday :CLOSED\nSunday:CLOSED", "pics": null, "resp": {"time": 1617013604967, "text": "Thank you so much for taking the time to review MedHealth Urgent Care. We are very sorry for the inconvenience regarding our temporary hours. We hope to return to our normal 5 day a week business structure however at this time both of our physicians have battled personal illness and have had to dedicate full-time hours on the front lines taking care of COVID patients at the local hospital. MedHealth wanted to provide some type of availability to our community. We thank you for your patience during this difficult time."}, "gmap_id": "0x888e802f2b9ed49b:0x8a5be4ea48ca25e9"}
{"user_id": "105221918840058894234", "name": "Tanner Vandertuig", "time": 1563753946588, "rating": 2.0, "text": "On my visit the Dr wasn't sure about the problem so she left the room to call someone else, was gone for 20 minutes, then came back and basically sounded like she flipped a coin. She had no confidence. She then didn't sign the prescription before she sent it and was unable to resend it before the pharmacy closed so now I'm without my medication and not confident that it is the right diagnosis anyways. Not impressed", "pics": null, "resp": null, "gmap_id": "0x888e802f2b9ed49b:0x8a5be4ea48ca25e9"}
{"user_id": "111879086085404872302", "name": "Jodie Wilson", "time": 1551201580766, "rating": 2.0, "text": "I'm not a big review giver, but I do read reviews and use them to make my decisions. I was totally fooled by the positive reviews given for this place. Hopefully I'm just here on a bad day, since I want to be able to still trust google reviews. That being said, I have been waiting for almost 2 hours and there isn't even a doctor at this facility. Most definitely did not see the pleasant atmosphere and friendly staff others spoke of. Based on what I've seen as a first time patient with plenty of other options for urgent care choices, I wont be coming back.", "pics": null, "resp": null, "gmap_id": "0x888e802f2b9ed49b:0x8a5be4ea48ca25e9"}
{"user_id": "101107653114187437131", "name": "zee clemons", "time": 1538823362422, "rating": 5.0, "text": "CUSTOMER SERVICE  could not have been better, from ENTERING to EXITING.  GREAT ATMOSPHERE to assist u in feeling better. STAFF was was very nice.  If you want to feel better-when you are feeling your worst-visit “MED-HEALTH-URGENT CARE” - McGhee Road. 🙌🏽", "pics": null, "resp": null, "gmap_id": "0x888e802f2b9ed49b:0x8a5be4ea48ca25e9"}
{"user_id": "115139461173621437608", "name": "EmJay Elle", "time": 1486055726564, "rating": 5.0, "text": "Prompt and friendly service. My husband was seen very quickly and the doctor was super helpful in making sure he was cared for properly. For anyone coming in on a referral would be happy to know it's' just a hop and a skip away from Maxwell AFB and easy to find.", "pics": null, "resp": {"time": 1487794167453, "text": "Moriah, thank you! We appreciate you being willing to leave a review and we thank you for choosing MedHealth Urgent Care."}, "gmap_id": "0x888e802f2b9ed49b:0x8a5be4ea48ca25e9"}
{"user_id": "110180984013523797686", "name": "Kiahna Vernon", "time": 1562855779715, "rating": 5.0, "text": "This place is great! They have an awesome staff and a nice environment.", "pics": null, "resp": {"time": 1562858171882, "text": "Thanks Kiahna"}, "gmap_id": "0x888e802f2b9ed49b:0x8a5be4ea48ca25e9"}
{"user_id": "111040875888811316584", "name": "Aunt Tee Ronda", "time": 1558464361021, "rating": 5.0, "text": "Mehealth on Mcghee road is a great clinic they are very nice and thorough. Every time i have called they have been patient and helpful", "pics": null, "resp": {"time": 1562858282578, "text": "Thank you"}, "gmap_id": "0x888e802f2b9ed49b:0x8a5be4ea48ca25e9"}
{"user_id": "109507727275404365885", "name": "Step J", "time": 1543330874462, "rating": 1.0, "text": "My visit to this Urgent Care was the worst experience at a doctor that I have ever experienced. I also learned that this office is not associated with the other Urgent Care facilities. This office is private owned according to the front desk. The front desk was a turn off with the greeting that I received which is a clear indication that I should have walked back out of the door. Once I escorted to the back with the doctor she wanted to diagnose me by looking at me instead of running tests because she was ready to leave for the day. No bedside manners at all. I will not be going back or recommending this facility to anyone else. Totally Unprofessional service", "pics": null, "resp": null, "gmap_id": "0x888e802f2b9ed49b:0x8a5be4ea48ca25e9"}
{"user_id": "113545947569618960489", "name": "Bettye Hodrick", "time": 1552765881827, "rating": 4.0, "text": "Medhealth, Urgent care  was a nice place to go, The staff  in the BACK WHERE THE WORK IS DONE WAS VERY NICE,  BUT THE STAFF AT THE FRONT DESK , TREATED ME LIKE THEY WAS DOING ME A FAVOR BY TALKING TO ME. WAS NOT VERY FRIENDLY AT ALL. IS ONE OF THE REASONS I DONT WANT TO EVER GO BACK,  BUT MAYBE I WILL GO BACK ONE DAY,", "pics": null, "resp": {"time": 1562858336643, "text": "Thank you Bettye we appreciate the business"}, "gmap_id": "0x888e802f2b9ed49b:0x8a5be4ea48ca25e9"}
{"user_id": "117785819939875699456", "name": "Twin Homes", "time": 1549383393389, "rating": 5.0, "text": "Dr. Lumpkin is so good and they are fast which beats the long wait time at the ER.", "pics": null, "resp": null, "gmap_id": "0x888e802f2b9ed49b:0x8a5be4ea48ca25e9"}
{"user_id": "114600105700725463518", "name": "Kim Ogletree", "time": 1550439819608, "rating": 5.0, "text": "Very pleased with the care I received for my 7yo daughter.", "pics": null, "resp": {"time": 1562858679289, "text": "Thank You Kim"}, "gmap_id": "0x888e802f2b9ed49b:0x8a5be4ea48ca25e9"}
{"user_id": "112839282128552176032", "name": "Emily Robbs", "time": 1467675261442, "rating": 1.0, "text": "Today, July 4th, I had a health issue. I called my insurance Nurse line, who suggested I see an urgent care facility. My insurance's appointment center called MedHealth at 5:45pm, and they told her they were open normal business hours today, until 7pm. So, I drove across town, arrived at 6:20pm, only to find the doors locked and ignored by desk personnel. They would also not answer the phone. I usually don't care about things like this, but I will make sure to let anyone I know to not ever visit this facility.", "pics": null, "resp": null, "gmap_id": "0x888e802f2b9ed49b:0x8a5be4ea48ca25e9"}
{"user_id": "110435829242309074222", "name": "Lametrice Brown", "time": 1506863553237, "rating": 5.0, "text": "I LOVE THIS PLACE!  Friendly, caring, and courteous staff!! Prompt service!! In and out!", "pics": null, "resp": null, "gmap_id": "0x888e802f2b9ed49b:0x8a5be4ea48ca25e9"}
{"user_id": "109451987041576390822", "name": "TJ Ripp", "time": 1480680383208, "rating": 5.0, "text": "The staff was extremely friendly and courteous. They got me in and out under an hour.", "pics": null, "resp": {"time": 1487794204365, "text": "TJ, thank you! We love hearing that our patients are happy with their visit. We appreciate you being willing to leave a review and we thank you for choosing MedHealth Urgent Care."}, "gmap_id": "0x888e802f2b9ed49b:0x8a5be4ea48ca25e9"}
{"user_id": "117047303364858617133", "name": "Tiffany Smith", "time": 1525029037533, "rating": 5.0, "text": "Wonderful staff just great environment. Only place i will visit in the future", "pics": null, "resp": null, "gmap_id": "0x888e802f2b9ed49b:0x8a5be4ea48ca25e9"}
{"user_id": "109501731135447512434", "name": "Dewey Whatley (UnrealMajor)", "time": 1550167567087, "rating": 1.0, "text": "If you have Medicaid don't waste your time going there they do not accept it", "pics": null, "resp": null, "gmap_id": "0x888e802f2b9ed49b:0x8a5be4ea48ca25e9"}
{"user_id": "116536787982895535694", "name": "James Warner", "time": 1562857770462, "rating": 5.0, "text": "Highly recommend Dr. Harris", "pics": null, "resp": {"time": 1562858156829, "text": "Thanks James"}, "gmap_id": "0x888e802f2b9ed49b:0x8a5be4ea48ca25e9"}
{"user_id": "101199241074272105224", "name": "Jace Vernon", "time": 1483997079596, "rating": 5.0, "text": "Awesome. I brought my son in because he had come down with a sinus infection and Dr. Lumpkin was so kind to him. No he loves going to the doctor.", "pics": null, "resp": null, "gmap_id": "0x888e802f2b9ed49b:0x8a5be4ea48ca25e9"}
{"user_id": "106671485400179489518", "name": "M Elharbi", "time": 1554922626923, "rating": 1.0, "text": "You will set and wait till your body changes his mind to be sick! Staff need to get smiling course", "pics": null, "resp": {"time": 1562858319288, "text": "Sorry on the long delay. We do get busy at times and do the best we can to speed things up."}, "gmap_id": "0x888e802f2b9ed49b:0x8a5be4ea48ca25e9"}
{"user_id": "102772635056560847797", "name": "Tiffany Williams", "time": 1498503347950, "rating": 5.0, "text": "Awesome place always professional.", "pics": null, "resp": null, "gmap_id": "0x888e802f2b9ed49b:0x8a5be4ea48ca25e9"}
{"user_id": "105810874991572091868", "name": "Kole Steve", "time": 1552747181882, "rating": 1.0, "text": "Don’t go here!! Doctor is very rude!", "pics": null, "resp": {"time": 1562858567467, "text": "Sorry Kole we may have been having a bad day. This can happen at times in the Health Care industry. We are allowed 2 bad days a year, and it looks like you came in on one of them. We would be happy to see you again and make up for our rudeness."}, "gmap_id": "0x888e802f2b9ed49b:0x8a5be4ea48ca25e9"}
{"user_id": "117949729921550909218", "name": "MedHealth Urgent Care", "time": 1467496530159, "rating": 5.0, "text": "Med Health Urgent care is dedicated to you and your time. Our goals is to get you in and get you out before most doctors get you in. We are here to help any way we can.", "pics": null, "resp": null, "gmap_id": "0x888e802f2b9ed49b:0x8a5be4ea48ca25e9"}
{"user_id": "116147693571793974844", "name": "Patti Sampson-Steeno", "time": 1625593728608, "rating": 1.0, "text": "It took be 3.5 hours to get what suppose to be an MRI, simple one to last 30 min.,on my lower back. I complete it, they then inform me that they now need to do contrast. It took 2 nurses, 5 stabs to finally get the IV. (I get blood drawn very often, so it wasnt me). I then wait to get what they say will only be 10 min more of the MRI and it's actually 20. Here's the kicker, I wait 2 weeks for the reading at my Dr., they never received the results from Tyler!! Now i have to wait LONGER, with pain for them to track down why and where they are!!!", "pics": null, "resp": null, "gmap_id": "0x888bb3c1675000ad:0x9da5298a5f20e7dd"}
{"user_id": "105759492286438490804", "name": "Artheria O'Neal", "time": 1605289624544, "rating": 5.0, "text": "Good!! Bedside manners💜", "pics": null, "resp": {"time": 1605903807760, "text": "Thanks for your review Artheria!"}, "gmap_id": "0x888bb3c1675000ad:0x9da5298a5f20e7dd"}
{"user_id": "105612516820126871830", "name": "Crystal Anderson", "time": 1491503571674, "rating": 5.0, "text": "My family loves the Tyler Center. Everyone is always nice and helpful. It is very clean and maintained well. We have never had any problems at all.", "pics": null, "resp": null, "gmap_id": "0x888bb3c1675000ad:0x9da5298a5f20e7dd"}
{"user_id": "107577792448455454403", "name": "ROLL TIDE", "time": 1526444623119, "rating": 4.0, "text": "Some of Anniston's Best Dr's have Office's in this building", "pics": null, "resp": null, "gmap_id": "0x888bb3c1675000ad:0x9da5298a5f20e7dd"}
{"user_id": "103200530891725595602", "name": "2k tips", "time": 1618012346410, "rating": 1.0, "text": "So sitting in the waiting room of St. Vincent’s Blount waiting on my appointment. All of a sudden the receptionist, patients and staff are running screaming at me to run down the hall. They scream over the intercom code silver. I get up and start going down the hall. The first waiting room I came to was x-ray. The staff inside locks the door and I’m tapping on the window to find out what’s going on. Just so happens I know one of the woman working there. A gentleman asks her if she knows me and she replies yes. They slip me a note through the door telling me to call them in 15 minutes. I hear a woman inside say get forceful and tell him to leave. I turn to look down the hall and every soul is gone except for me and the man who stole a gun out of a car in the parking lot. I had no idea where he was. No one would help me or tell me what was going on. I was locked out in the hallway that is at least 80 yards long by myself with no means to defend myself. The man was obviously sick and out of his mind. I saw him when I pulled up and he gave me an uneasy feeling. I was not scared for me but thought to myself what if an elderly/young woman or a child walked in the door behind him what would they do. The only thing I could think to use to defend my self was a chair that was sitting in the radiology waiting area. I said to myself he will probably shoot me but hopefully I can beat him enough with the chair that he couldn’t hurt anyone else. I was starring down the hall waiting for him to walk/run towards me and I was going to do my best to stop him with a chair. Another thought I had was if I had my gun on me I would at least be in a better position to defend myself. Luckily the police got there and disarmed the man. I was so mad at the hospital staff for telling me to run down the hall and then locking me out of EVERYTHING. I was nothing more than a target at that point. I could understand their policy a little better if I hadn’t been waiting for 45 minutes in the same chair they ask me to flee from while rushing other patients into offices to protect them from a possibility bad outcome. I asked the Administrator what was the big plan for me. Wait till he shoots me then scurry on over to the E.R. All he said was this is not supposed to happen here. Needless to say I am extremely, extremely disappointed in the way St. Vincent’s Blount handled things today!!!!!!!!!!!!!!!!!!!!!! Complete negligence for patient care!", "pics": null, "resp": null, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "110107334357839771073", "name": "Kandi Warnock", "time": 1623966030932, "rating": 1.0, "text": "I have had a bad experience with Dr Little every time I have been seen by him. He has horrible bedside manner , seems like he does not want to be there and you are wasting his time. I was sent by home health  care for fluids due to dehydration from Dysautonomia, he proceed to say here drink Gatorade , I politely told him I am allergic and he still insisted it was what I needed. I have Dysautonomia and require IV fluids , if Gatorade and water worked I would not be coming to the ER. It is a well  known fact that in the area,  he is a horrible doctor, most call friends to see if he is on call and avoid to go if he is there. I can say being an Army for many years , seen dozens of doctor’s he is the absolute worse I ever encountered. You have a 50 percent chance of getting a good nurse.", "pics": null, "resp": {"time": 1624022608777, "text": "Hi, we always appreciate the opportunity to improve, and we’d like to talk to you more about how we can do this. Please reach out to us at 205-930-2333 (Mon-Fri 8 am-4:30 pm) when you have a moment, so we may discuss your review. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "105480607770834416467", "name": "Richard Mccall", "time": 1619367795960, "rating": 5.0, "text": "The er here are slow and will not help any one... been waiting now for like 3 hours just for test to come back . As the er doctor. Just sitting and talks on phone. This place a is so bad I would not bring my dog here and on this vist they let my wife sit in pain the hole time and did not do any thing for her the hole 4 and half hours... this place wants you to give them a 10 star rating no thank more like a 0 rating", "pics": null, "resp": {"time": 1619321653387, "text": "We are here to listen and take all feedback seriously. Please reach out to us at 205-930-2333 (Mon-Fri 8 am-4:30 pm) so we may work with you directly. We hope to hear from you soon. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "118416325042813679543", "name": "Val Young", "time": 1620735955707, "rating": 5.0, "text": "Great doctors\nFriendly staff\nYou don't have to wait long.", "pics": null, "resp": {"time": 1620813840127, "text": "Hi, thank you; we appreciate your feedback! We will share it with our leadership. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "101132447735471011769", "name": "Asa Hughes", "time": 1620516502042, "rating": 1.0, "text": "This hospital is not as great as everyone says it is the er doctors are slow and will not do anything to help anyone my wife was in the er and all they sayed to do go to a different hospital because we can and will not help u . When my age has a UTI and is 37 weeks pregnant . The doctor looked at us like we was wanting meds to get high on but when she laying there in pain and crying because of the pain they still would not help her . So my rating in the hospital is like .0001 rating", "pics": null, "resp": {"time": 1620678366439, "text": "Thank you for your review. We'd like the chance to look into the situation you have described. Could you please reach out to us at 205-930-2333 (Mon-Fri 8 am-4:30 pm)? We look forward to hearing from you. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "116688446847070693195", "name": "Lynn Wray Dillard (Alabama Creeks)", "time": 1514304863937, "rating": 5.0, "text": "Family member admitted for extended stay for rehabilitation due to repair of broken hip. I spend 5 days here helping care for her. I am so impressed with the kindness, compassion and all around professionalism of the staff. The sweet folks that cleaned the room did excellent work. The dietary staff staff were so quick to bring a different item if we asked for it. The meals provided were well prepared and delivered with a smile. The RNs were precious: Madison, Haley, & Hazel showed pure loving care and were so patience even when we seems to be pressing that “call button” every 5 minutes. The case manager went above and beyond to keeps us informed about what needs we might have in the future. There is an obvious Godly spirit guiding the workers and medical staff here at St. Vincent’s Blount. I will never forget the kindness and love shown to my family. And they have free wi-fi.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMXTkMOsZpYOhd5UjuBguMEdT7TBuoEMjuxCAt2=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOROhBD4oztDukKYWLV7swDQ2SMCbbWcc0_G1q1=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPOn77OoQmA5qfiUhtCvWcPcyI8q7h_HllrwCXB=w150-h150-k-no-p"]}], "resp": {"time": 1513616302187, "text": "Hello Lynn Wray Dillard. Our hospital aims to deliver the highest quality patient care. We love to hear about these positive experiences. Thanks for sharing this feedback with us!"}, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "101322586379820433826", "name": "tiffany self", "time": 1619472826411, "rating": 1.0, "text": "Told me I had a stomach bug on Friday but turns out had to go to a different hospital Saturday because I felt 10 times worse come to find out I had covid the whole time.", "pics": null, "resp": null, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "110394898075411587328", "name": "Angela Jackson", "time": 1625163063431, "rating": 2.0, "text": "Long story but I should of never went.", "pics": null, "resp": {"time": 1625195577943, "text": "Thank you for taking the time to leave a review. Could you please contact us at 205-930-2333 (Mon-Fri 8 am-4:30 pm) so that we may have someone follow up? Thank you. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "106040263388773098572", "name": "Michael Hammett", "time": 1622552107746, "rating": 3.0, "text": "Ok I made it through", "pics": null, "resp": {"time": 1622553711853, "text": "Feedback is important to help us improve. Please contact us at 205-930-2333 (Mon-Fri 8 am-4:30 pm) at your convenience so we may discuss your review. We appreciate your time and hope to hear from you. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "112354201271377529297", "name": "Emily Harris", "time": 1595885563330, "rating": 1.0, "text": "Do not go to the Emergency Room. Intake nurses act like they hate their job and don't want to be there and Dr. Little has seen me have seizures several times and sends me away even when I am in status epilepticus, bc he thinks that anyone not acting \"normal\" is on drugs. Told the staff at SVE I was coming there and I was a drug addict. They took his word without so much as a drug test and nearly killed me. He refuses to give me medication when I have a bad migraine that lasts 9 days bc he thinks I am a drug seeker. Quick too judge and not quick to help. He needs to be fired.", "pics": null, "resp": {"time": 1595890255280, "text": "We are always looking for ways to improve. If you're willing to discuss this in more detail, please reach out to us at 205-930-2372 (Mon-Fri 8 am-4:30 pm). Thank you. -St. Vincent's Health System Community Manager"}, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "115687138792305651377", "name": "Tammie Lynn Anne Ceja", "time": 1590956013807, "rating": 5.0, "text": "Prompt, emphatic, professional and fast care. In other places it's not unheard of to wait hours.", "pics": null, "resp": {"time": 1594739380817, "text": "Thanks for the great feedback! We will be sure to pass it along to our team! -St. Vincent's Health System Community Manager"}, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "103800572491085155317", "name": "Mr.bones", "time": 1602795653761, "rating": 1.0, "text": "I went there because my knee was fractured and they said because I can move it there's nothing wrong and then they x-ray my wrist", "pics": null, "resp": {"time": 1602857635677, "text": "We work hard to provide high quality of care. We would like the opportunity to work with you directly regarding this review. Could you please reach out to us at 205-930-2333 (Mon-Fri 8 am-4:30 pm) at your earliest convenience? Thank you. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "103098378294939977567", "name": "Johnna Battles", "time": 1555598119732, "rating": 5.0, "text": "I absolutely love this hospital. They are always quick to respond to you and you or your family member is made to feel comfortable. The staff are always polite and friendly. The only time I have ever seen them be rude to anyone is when the patient demands medication for pain and tries to tell the staff how to do their jobs. Great Doctors and short wait time.", "pics": null, "resp": {"time": 1555948274450, "text": "Johnna Battles, we strive for 100% satisfaction, and it is great to see you had such a positive experience at St. Vincent's Blount."}, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "109743492730956913832", "name": "Allison Dickinson", "time": 1540606586909, "rating": 5.0, "text": "I received 10 star care in the ER recently while getting care for food poisoning.  They got me back quickly, awesome Rn got IV on first try (and I was dehydrated). Everyone who entered my room was very helpful! Even the lady who took my insurance info brought me warm blankets! Thank you for making an awful night a little more tolerable!", "pics": null, "resp": null, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "111264775105912043800", "name": "Genie Biondini", "time": 1548213778801, "rating": 5.0, "text": "I have relied on this hospital for 12 yrs. This is a super place. Down home place, and everyone that works there has a heart. This entire county+ replies on it. I recommend it to my Mom, she loves it.", "pics": null, "resp": {"time": 1548253306164, "text": "Genie Biondini, thank you for sharing your observations with us. Feedback helps us know what we’re doing right or where we need to improve."}, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "103485958605199891164", "name": "Amber Allen", "time": 1549688852761, "rating": 1.0, "text": "I would not suggest this hospice company to anyone who cares about the terminally ill patient. Our nurse hasn’t answered our phone calls on the first call yet. Thankfully my father was only on hospice 5 days before passing on. The morning he passed, we couldn’t even get someone to answer the “emergency” number. I got in touch with an operator and she transferred me to another extension, who  didn’t answer either. My father passed at 9:30am on a Thursday, so anyone who has a loved one pass at an odd time of day my heart breaks for you because you will be looking at your deceased loved one for an extended amount of time. Once my father passed (at a rather young age) naturally my mom wanted the hospice bed out of her living room. On day two after his passing, we called frequently throughout the day about the equipment being picked up, after being assured it would be. At 6:30pm on day two, my husband called again to ask when the equipment would be gone and the lady said not today and hung up on my husband after he explained to her the equipment would now be outside for them. This is not the kind of experience you want when losing your father.", "pics": null, "resp": null, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "106386729311194388732", "name": "Laura T", "time": 1559010854458, "rating": 1.0, "text": "Wish I could give 0 stars. The staff is very rude and quick to judge. They screwed up on me multiple times where I nearly lost my life and family members as well that have been there. If you want your life saved DO NOT go here. They deserve to be shut down. Maybe that will happen one day.", "pics": null, "resp": {"time": 1559136106489, "text": "We try very hard to meet expectations and we regret that we have not done so in this case, Pandi Bear. Please email us HospitalReviews@Ascension.org so we can address your concerns."}, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "113256502379083932883", "name": "Meme Jones", "time": 1518099871947, "rating": 3.0, "text": "The service has been great for my mom. Rated a three for the quality of the food in cafeteria and how expensive it is for food. Having to pay full price for three meals a day gets expensive. Wished they had at least a discount card for sitters that stay with loved ones while they are in hospital. We help out a lot in caring for loved ones to make it easier on you guys. We should be able to afford to eat here while we stay. Disappointed.", "pics": null, "resp": null, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "111756585894727998855", "name": "Brandi Underwood", "time": 1571242633776, "rating": 1.0, "text": "If I could give no stars, I would!\nI went to the emergency room there yesterday burning up with a fever, chills, sore throat, body aches, ALL FLU SIGNS. I was aching so bad I was in TEARS. They didn’t run a flu test, they pretty much laughed at me and told me to take some ibuprofen and sent me home. So I knew I had the flu and decided to go to boaz Er where what do you know, I was burning up and I have the flu.\n\nI’d seriously hate for anyone deathly sick to have to go to Oneonta emergency room because they would just laugh at you and send you home to die.\n\nSorry but if you can’t thoroughly check out your patients and give them correct treatment you do NOT need to be a nurse or doctor. I wish I knew how to call and properly complain on them.", "pics": null, "resp": {"time": 1571330444179, "text": "We try very hard to meet expectations and we regret that we have not done so in this case, Brandi Underwood. Please call (205) 939-7264 so we can address your concerns. -St. Vincent's Health System Community Manager"}, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "111490072548106139358", "name": "Lee Hardin", "time": 1551548980804, "rating": 3.0, "text": "The wait time in the ER wasn't too awfully bad.\nThe staff was very nice to my mother and my family.\nMy only real complaint is the hospital looks and feels unclean.\nThe place generally just feels and smells nasty.\n\nPeople friendly for the most part.", "pics": null, "resp": {"time": 1551716154205, "text": "Lee Hardin, thanks for taking the time to leave your rating. We'd like to learn more about your experience. Would you mind sending us an email to HospitalReviews@Ascension.org with your contact information?"}, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "100599955875598678433", "name": "Shannon Trammel", "time": 1573750559447, "rating": 1.0, "text": "The place smells dirty and always has leaks.\nSome of the staff in different areas are genuinely nice while the others are very rude.\n\nI don't see that it is managed very well but it never has from what I understand from older family members.\n\nWhen I have to come for anything, I feel like a cow being herded.\nIt's disappointing having to go to Birmingham because we live here.\nSad", "pics": null, "resp": {"time": 1573835382884, "text": "If there is feedback you'd like to share, feel free to reach us at (205) 939-7264 (Mon-Fri 8 am-4:30 pm). We're always open to feedback as it helps us improve. -St. Vincent's Health System Community Manager"}, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "105561398249716843335", "name": "Brandon Barkley", "time": 1581376259055, "rating": 1.0, "text": "Legit one of the worst hospitals out there. They would sooner let you die than actually treat you. Avoid this hospital if possible", "pics": null, "resp": {"time": 1581433312008, "text": "We try very hard to meet expectations and we regret that we have not done so in this case. Please call us at (205) 939-7264 (Mon-Fri 8 am-4:30 pm) so we can address your concerns. -St. Vincent's Health System Community Manager"}, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "112249418483351385197", "name": "Polly Nix", "time": 1532023871007, "rating": 1.0, "text": "Unless you are about to drop dead, you would be better off driving on to Birmingham. They are soooo slow! I take my elderly mother here for care and we always have to wait. Most of the doctors come up from Birmingham anyway. I don't think any of them ever look back at their records, we have to fill out the same forms and have had the same test run numerous times. Just try not to get sick in Blount co.", "pics": null, "resp": null, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "104886033850822096210", "name": "The Stuart Yeager", "time": 1544901552897, "rating": 1.0, "text": "Bad experience in admissions  dont belive they even attempted to file with insurance company was billed excessively for labs that insurance should have covered. Do not go here and get ripped off. Lady in the lab was great. Would not recommend go somewhere else that's interested in you not how much they can shake you down for.", "pics": null, "resp": {"time": 1545056727520, "text": "The Stuart Yeager, we'd like to look into your experience. Would it be possible for you to email us your name, details and date of visit? You can email us at HospitalReviews@Ascension.org. Thank you!   St. Vincent's Blount Community Manager"}, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "111249852744108415130", "name": "Avery Nichols", "time": 1566489491677, "rating": 1.0, "text": "Some of the staff in E.R. and Med Surg are very rude. They are definitely not attentive.\n\nPlace always feels nasty to me, smells unclean, public bathrooms are messy, and patients rooms do not get cleaned like they should.", "pics": null, "resp": {"time": 1566570650178, "text": "We try very hard to meet expectations and we regret that we have not done so in this case, Avery. Please call (205) 939-7264 so we can address your concerns."}, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "116932230839172833498", "name": "Chris Mahan", "time": 1557776572149, "rating": 5.0, "text": "They gave me great service at a reasonable price. The staff and doctors are caring people who put the patients needs first.", "pics": null, "resp": {"time": 1557840852645, "text": "Thank you for letting us know about your experience, Chris Mahan. Listening to our patients is important to us."}, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "102337481047275247495", "name": "Dalton Wester", "time": 1558725811338, "rating": 5.0, "text": "I had two  heart tests scheduled with the Birmingham Heart Clinic at St. Vincent's Blount as well as a stress test to be done at St. Vincent's Blount on April 29th.\nI reported to BHC for the two heart tests and was told the tech who did the tests was not available that day for some reason.  I came back to the hospital later that morning for my stress test.  Heidi did the stress test.  She learned that I had been unable to complete the other tests by the BHC tech that morning.  She said that the hospital had had a cancellation that day and asked me if I wanted the hospital tech to do my tests to save me another trip.  I agree and she called and set up the other tests for me and they were completed in a timely manner.  I wish to commend Heidi for the  way that she handled my stress test and also for going the extra mile to get my other tests handled the same day.", "pics": null, "resp": {"time": 1559136461988, "text": "Dalton Wester, thank you for sharing your observations with us. Feedback helps us know what we’re doing right or where we need to improve."}, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "111890490356484160797", "name": "Janet Holloway", "time": 1596071183005, "rating": 1.0, "text": "They need to ask for the visitors information when patient goes in the back room", "pics": null, "resp": null, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "103516557971898940912", "name": "Shannon Nappier Reynolds", "time": 1521225578294, "rating": 1.0, "text": "My son went in with a very itchy rash that kept spreading. He was sent home with prescriptions for three different diagnosis. He visited the health department with a friend and was diagnosed with scabies. Recently a close friend has had several abdominal pain, she was told she needed to loose weight after waiting 8 hours to be seen. I rushed my son to the ER for sizures he's started having with his diabetes he could barely walk. I was told had I called an ambulance they could have got him straight back sooner for us to take a seat. Thirty minutes went by and I had to show myself to get the nurse to come to the waiting room. The nurse flipped out when his sugars were so low that the readings didn't register. The lady at the desk just acted as if she just hates her job.", "pics": null, "resp": null, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "103711219917748805029", "name": "Chy Goodwin", "time": 1518650679859, "rating": 4.0, "text": "Would give 5 if nurses came around to check up on patients a little more often!  Usually don't see anyone (unless i call, that i don't like doing for everything little thing) sometimes 3 hours.   Great, friendly, and caring staff!!", "pics": null, "resp": null, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "104903868229753825527", "name": "kimberlina68", "time": 1529582666954, "rating": 2.0, "text": "Been here twice for outpatient services Radiology and Lab. Love it.  ***Edited because ER Dr Little is horrible, he does not even do any appropriate testing. He is so concerned about not Admitting anyone, under any circumstances. Then BILLING is making huge errors, BALANCE BILLING which is Insurance FRAUD!!", "pics": null, "resp": null, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "105461863978175369447", "name": "James C", "time": 1530046853595, "rating": 1.0, "text": "St. Vincent's Blount can now change the name to The Place You Go To Die just like the old hospital. They let another person die in the emergency room. My Friend would still be here if we could have gotten him to another hospital. You get a 1star because that's the only way I can post. Also I took my wife there about a year and a half ago we sat in the waiting room for 6 1/2 hrs only to be billed by the Dr. for treatment we never received. We are planning to report the Dr. To both Medicare and Medicaid and BC/BS for false charge's because the Dr. Refuses to fix the Bill.", "pics": null, "resp": null, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "104247038585044482969", "name": "Jairren Siffles", "time": 1533358460326, "rating": 5.0, "text": "Anytime I've had to go they have been great and I'm there for an hour at the most", "pics": null, "resp": null, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "101528106427850953146", "name": "Pat Pate", "time": 1475066982008, "rating": 1.0, "text": "LONG wait to get into ER . When finally in Dr Thomas was rude, unprofessional, uncaring after 6 hours we got to go home. Not even sure if her diagnosis was correct. Definitely won't go back if she is on call.Everyone else was kind no complaints against any nurses or aides.", "pics": null, "resp": null, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "112224625310095106637", "name": "Alicia Mena", "time": 1481796131840, "rating": 2.0, "text": "Came in about 1am, empty ER. Taken back immediately for my five year old.\n\nNurses were curteous and nice. However, Dr. Scott 'I'm an arrogant prick' Davidson seemed, very unconcerned about my daughter.\n\nOrdered Blood and urine analysis and CT, milk what you can from Medicaid, I guess.\n\nIt's currently 4am, and still no type of diagnosis or input from the doctor.\n\nIt's reasons like this people avoid hospitals🏥.", "pics": null, "resp": null, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "114680510378710180944", "name": "Kyle Willis", "time": 1564756698872, "rating": 1.0, "text": "Last time I was there I was there to be treated for severe burns due to a trash fire explosion, came in and admission took forever and was told to wait in the lobby until I could be seen. I had to keep a cold towel on my burns for what seemed like an eternity. Should be shut down", "pics": null, "resp": {"time": 1565015144603, "text": "Hello, Kyle. Please call (205) 939-7264 so we can address your concerns. We try very hard to meet expectations and we regret that we have not done so in this case."}, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "108892835434213118339", "name": "Amber Woodard", "time": 1511923557407, "rating": 1.0, "text": "Horrible place. Took my 5 month old daughter to the er last night for screaming and running a fever. Also mentioned she's had ring worm for 2 months now and her pediatrician won't prescribe her anything else. Doctor told me to change laundry detergent because that's how it spreads.😂😂 will never go there again.", "pics": null, "resp": {"time": 1511996597769, "text": "Hi, Amber. Thank you for taking the time to share this information. I have forwarded this comment to our leadership. Please feel free to send your contact information and any additional details to feedbackAL@ascension.org."}, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "105854368520242183541", "name": "Susan Spiker", "time": 1503953397431, "rating": 5.0, "text": "I have brought my sons to this ER multiple times for stitches, broken bones, and a concussion over the past few years.  We have always been treated nicely and have been in and out in a timely manner especially since this is an  ER and often someone with something more serious comes in while you are there.", "pics": null, "resp": null, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "112213500479342686863", "name": "Tony K", "time": 1483060469008, "rating": 1.0, "text": "Old lady at the ER check in needs to be educated on dealing with customer / patient asking questions before checking into ER !!! Just kept insisting that my wife sign in, sign in, sign in WITHOUT ANSWERING MY DAMNED QUESTION !!! Asked if they had an Catscan or MRI. She didn't know but really wanted us to check in to generate a bill for my insurance. Bad Old Lady 😈!!!", "pics": null, "resp": null, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "116731585815122854969", "name": "Dolly Munster", "time": 1497684582762, "rating": 1.0, "text": "There needs to be a negative rating. Long waits. Rude staff. Incredibly noncaring doctors. Dirty facilities. People deserve better than this.", "pics": null, "resp": null, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "102487422058918324572", "name": "Donna Segers", "time": 1524107972116, "rating": 1.0, "text": "I have been sitting in the ER for 3 & a half hours waiting to get my foot x-rayed.  Dr came out in the waiting room an hour ago and said they were going to get it x-rayed soon so I could have results if I ever do get in a room...still nothing. No triage no x-ray nothing going on 4 hours!!", "pics": null, "resp": {"time": 1524259482763, "text": "Hi, Donna. Thank you for taking the time to share this information. I have forwarded this comment to our leadership. Please feel free to send your contact information and any additional details to feedbackAL@ascension.org."}, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "109756480120352520728", "name": "Timothy Hacney", "time": 1498540963944, "rating": 1.0, "text": "have not been able to stay awake for days and nights, high temp, unable to eat. i am a diabetic. my sugar levels  have been 121 or lower for months. the first thing Dr Thomas asked was if i was diabetic. I said yes, she then replied \" Therein lies the problem\" . I have never known my sugar to cause me to run a fever of over 102 degrees. This ER is a JOKE and been for as long as I can remember. he Dr came back and said my sugar was fine that I needed to schedule a appointment with my PCP.  needless yo say I left saying a few choice words that the whole er could hear.", "pics": null, "resp": null, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "109382216749372516947", "name": "Melissa Graves", "time": 1524338570800, "rating": 1.0, "text": "My mother has COPD and it has been acting up and she has been coughing severely. I took her in yesterday to the er and all they did was give her a breathing treatment, prescribe her a steroid, and send her home. The only reason i took her there was it is the only one in the county. NEVER going back.", "pics": null, "resp": null, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "109626501618375154840", "name": "Brittany Schaffer", "time": 1486951004052, "rating": 1.0, "text": "Horrible ER! Do not waste your time coming here. Waited for over 5 hours in the waiting room while my husband had chest pains. By pass this hospital and go to East or Downtown!!!!", "pics": null, "resp": null, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "116337014221737525630", "name": "Debbie Bellamy", "time": 1516463682731, "rating": 5.0, "text": "Physician and Nursing care excellent, friendly staff.", "pics": null, "resp": null, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "116696045625925258988", "name": "Jaida Johnson", "time": 1513221222687, "rating": 1.0, "text": "The biggest joke of a hospital that I have ever seen. Don't waste your time here.", "pics": null, "resp": {"time": 1513345734293, "text": "Hi Jaida Johnson, thank you for taking the time to let us know about your recent experience. We are disappointed to hear that you are not satisfied with your visit. If you are willing to give us another chance, please contact us at HospitalReviews@Ascension.org so we can understand your situation better in order to try and turn your experience around."}, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "107969841061117710983", "name": "Eric Hunter", "time": 1483393217410, "rating": 1.0, "text": "One hr an forty-five minutes after arrival, that's how long it took before they took my wife's vitals. After that, we were sent back into the waiting room for another long wait.", "pics": null, "resp": null, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "114062085210166282167", "name": "Candy Donovan", "time": 1518625244638, "rating": 1.0, "text": "I will die at home before I go back to this place. This hospital is a joke.", "pics": null, "resp": null, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "118381613925003301284", "name": "HeatherL", "time": 1476246464698, "rating": 4.0, "text": "I did wait for 3 hours for the whole process to get in, get treated and on my way out. But I also had Netflix to occupy me.", "pics": null, "resp": null, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "114646517003536837348", "name": "Joshua Jackson", "time": 1517749900816, "rating": 1.0, "text": "My girlfriend sat there for three hours and all they gave her was instructions on seeing a primary care physician. Throughout the night her coughing and sneezing got worse and her throat hurts even more, she has almost completely lost her voice. She is clearly sick and they didn’t do anything for her. We will not be back.", "pics": null, "resp": null, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "110568722235629711268", "name": "Zachary Bennett", "time": 1489789729416, "rating": 1.0, "text": "Broke 6 bones in my foot/ankle and the doctor refused to see me a second time, but charged me $640 to wrap it in an ace bandage. Very horrible people", "pics": null, "resp": null, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "104577353021630491624", "name": "Raymond Kenna Jr", "time": 1494454959163, "rating": 1.0, "text": "Had an appointment for 3:50 pm , signed in at 2:20pm.\nFinally got called back to exam room at 4:20pm.\nDoctor came in exam room at 5:06,\nsaw his patient for a total of 5 minutes", "pics": null, "resp": null, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "116599242957292186459", "name": "Crazy Gamer", "time": 1483569866215, "rating": 1.0, "text": "I wish that I could give a negative rating we have been waiting on the doctor for 1 hr 45 minutes in the room and the doctor has been sitting at his desk not moving at that time", "pics": null, "resp": null, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "108897483629155372748", "name": "Britnie Owens", "time": 1483901682222, "rating": 1.0, "text": "Rude staff members!!!", "pics": null, "resp": null, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "106373108619607092491", "name": "Paula Valdez", "time": 1518809334524, "rating": 1.0, "text": "(Translated by Google) They take a long time, and that\nThat it is an emergency, one dies there\n\n(Original)\nTardan mucho, y eso\nQue es emergencia, uno se muere ahi", "pics": null, "resp": null, "gmap_id": "0x888990ac2c1e3af7:0x36486ae56cc03b07"}
{"user_id": "101468183209791880247", "name": "Linda Williams", "time": 1626450130526, "rating": 5.0, "text": "Wonderful experience.  No wait, friendly and professional service.  A refreshing experience after a few years with another center that ran me through like a cow.", "pics": null, "resp": {"time": 1626455252333, "text": "We always love to hear positive feedback. Providing an elevated experience for every patient who chooses us is the goal of each of our team members."}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "114922454331811465456", "name": "casey smith", "time": 1624998178826, "rating": 5.0, "text": "I have small veins so it is hard for anyone to get a line on me. I had actually just left a doctors office who had blown a vein before this appointment so it was harder on the tech. Christine and Chelsie did a wonderful job of getting a vein when there was limited options. She definitely took the time and care to make sure it was correct before proceeding with the Ct Scan", "pics": null, "resp": {"time": 1625176953131, "text": "It is our privilege to provide imaging services and our team works hard to make it a good experience. When we hear we’ve done it well, it makes our day!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "103179057775456857755", "name": "Kimberly Daniels", "time": 1618072685390, "rating": 5.0, "text": "this has got to be one of the most pleasant experiences I’ve ever had in a clinic where nobody knew me yet I was treated with respect and care as though they had known me for years! It was very refreshing to see the steps that were being taken for the Covid pandemic time. They made sure to make sure that I felt safe and that I was comfortable. That was the best part!", "pics": null, "resp": {"time": 1618331314949, "text": "The safety of our team and our patients is our highest priority. We have implemented processes to ensure enhanced sanitation and proper distancing while still maintaining exceptional compassionate care. https://odcalabama.com/about/images-and-results/"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "116114845123591766119", "name": "Kasper Sen", "time": 1615255964574, "rating": 1.0, "text": "I was billed an extra fee 3 months after paying up front in cash for the X-ray I needed. They are predatory and greedy trying to scam people and lying that they owe them money months after fully paying for their services. I won't ever be back.", "pics": null, "resp": {"time": 1615403572575, "text": "There’s nothing we value more than feedback – even if it tells us we didn’t meet expectations. That’s how we know where to focus our efforts. Our Administrator, Brad, can be reached at 256-534-5600 to discuss any patients’ specific concerns."}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "100089177153976223334", "name": "Maeve O'brian", "time": 1592764723307, "rating": 5.0, "text": "Last Friday was my second visit.  Elizabeth was the first person I interacted with and that was very pleasant.  I filled out all the forms and waited for my tech Lauren. It all was a good testing experience.  I didn't have to endure all that stretching and smashing anymore.  Also had the bone density test and that was painless too.  Will go back.", "pics": null, "resp": {"time": 1594845460770, "text": "Thank you for the review!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "116174305860905928218", "name": "Eula Evans", "time": 1610821545618, "rating": 5.0, "text": "Thank you for the service,it was great Deana and LaDanya were great.\n\nThank you, ms.evans", "pics": null, "resp": {"time": 1611063813664, "text": "Our team puts patients first and we’re glad our team’s dedication to providing an elevated experience is showing!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "111689151111505715764", "name": "Kelly Firestine", "time": 1579809437145, "rating": 5.0, "text": "I needed to have a mammogram and screening breast ultrasound because I have been told I have dense breasts.  They scheduled me right away.  I spent hardly any time at check in.  I was taken back for my exam so quickly I barely had time to sip the nice cup of coffee I got in the lobby.  The women's are is so private and cozy.  It is nice to have a separate, private area from the rest of the center.  I felt so relaxed for they entire visit.  Stacy did such a great job on the mammogram and Jordan did an excellent job on my US.  I got a letter with the results with 2 days!  Wow!  I will always return here for not only my mammograms but also if I ever need an MRI, x-ray, CT, etc for me or my whole family.  Nice change of pace in the medical world to have such great professional service!", "pics": null, "resp": {"time": 1579902368555, "text": "Kelly, Thank you so much for your kind words! We appreciate you taking time to give us your valuable feedback. Have a great weekend!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "101077220794400645130", "name": "D.Ann's Designs", "time": 1592685425403, "rating": 5.0, "text": "Newly remodeled center with care taken understanding Covid-19.  Fantastic staff, easy check in and Ladonya, my technologist is one of the best. It is a great place I would highly suggest to anyone. Brad Moss, the Administrator obviously cares about this center. Thank you", "pics": null, "resp": {"time": 1594845381166, "text": "We always love to hear positive feedback. Providing an elevated experience for every patient who chooses us is the goal of each of our team members."}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "103630314480407628730", "name": "Drew Rochelle", "time": 1574369426168, "rating": 5.0, "text": "The staff was professional as well as warm and friendly. I was very impressed with the staff and facility. They made an anxiety filled test a pleasant experience. If there was a six star rating I would have given that.", "pics": null, "resp": {"time": 1575310665766, "text": "We just wanted to thank you for the excellent review. Your kind words go a long way and will be shared with our staff. Have a fantastic week!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "115313267090571187858", "name": "Carol Drake", "time": 1617302058079, "rating": 5.0, "text": "Excellent tech, Anita!!", "pics": null, "resp": {"time": 1617386360822, "text": "Our team puts patients first and we’re glad our team’s dedication to providing an elevated experience is showing!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "100526156631664704104", "name": "Gene Welborn", "time": 1566328130599, "rating": 2.0, "text": "The technician was awesome!  She was polite and professional.  But I never got a report.  I called two weeks after my test and was told that reports \"typically\" go out within 4-5 business days.  I was told the only way I could get my report would be to drive 40-45 minutes one way back to the facility to pick it up.  After negotiating a bit, I got them to just mail me another one. I still have not received it.  A bit frustrating to go through the procedure and not be able to get my own results.", "pics": null, "resp": {"time": 1566423257124, "text": "We appreciate your feedback and the opportunity to improve our services. To ensure the privacy of our patients, our policy prevents us from responding to this matter in a public forum. Your comments are important to us and have been sent to our Center Administrator. We welcome further dialog. Please call 256-534-5600 to speak with someone in person. Thank you!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "117134850288144384472", "name": "Angie Alonso", "time": 1591196712093, "rating": 5.0, "text": "Very friendly and quick. Liked the atmosphere", "pics": null, "resp": null, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "107079917667617868336", "name": "Ron Burgundy", "time": 1530287463292, "rating": 5.0, "text": "As I was walking in a little early, they called my cell to confirm everything is ready and they're ready for me.  The MRI took just a couple days to setup and the results were almost instant. Easy, quick, painless imaging. Staff is super friendly and proficient.\n\nI can now walk without a cane or pain before 30!", "pics": null, "resp": {"time": 1530902820605, "text": "Thank you for your kind words and valuable feedback!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "112339104436206121690", "name": "Brian Bradley", "time": 1550800407353, "rating": 5.0, "text": "Had a Thursday apptmt at 12:45 and showed up on time. The Patient Care Coordinator at the desk was very pleasant and efficient taking my ID and insurance card, gave me a form to complete and withing five minutes of arriving was sent upstairs to wait for my diagnostic test. Filled out another one page form and again within 5 minutes the Technologist came and led me back to the room for the bone density test. She explained the procedure, answered my questions and was just super. Test was over in 10-15 minutes and she even walked with me back downstairs, said thanks for coming and wished me well. Excellent experience from my standpoint!", "pics": null, "resp": {"time": 1550853918824, "text": "Brian, Thank you so much for your positive feedback and 5-star review!  We appreciate you!!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "110190701805871028267", "name": "Michael Kelsey", "time": 1579029836644, "rating": 2.0, "text": "The check in staff was great, very friendly, professional and courteous. The technician(s) I had dealings with in back could use a refresher on how to deal with patients", "pics": null, "resp": {"time": 1579902811388, "text": "Michael,  We appreciate your feedback and the opportunity to improve our services. Your comments are important to us and have been sent to our center Administrator. If you would like to dialog further, please call 256-534-5600 to speak with someone in person. Have a great weekend!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "112741849417273987076", "name": "wanda Rhodes", "time": 1537821067043, "rating": 4.0, "text": "This was my first visit and i truly enjoyed the experience .Tia and Anita very friendly and very profoundly proficient at their job. The facility very clean and the atmosphete comfortable. Thanks Anita for making my bone scan comfortable for me.", "pics": null, "resp": {"time": 1537992530917, "text": "Thank you for your great review! We appreciate the time you took to give us your valuable feedback!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "101995665309129062728", "name": "Michelle Dixon", "time": 1465970089978, "rating": 5.0, "text": "Got there early and even though my appointment was awhile away, they still called me back fairly quickly. My x-ray tech was nice and respectful of my concerns and helped the process go by smoothly. Great people and great place!", "pics": null, "resp": null, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "101631688475996423872", "name": "Patty Bradford", "time": 1563235604118, "rating": 5.0, "text": "I have my mammograms done yearly at Outpatient Diagnostic Center. I am very pleased with my experience at ODC. Deana and Anita are very professional and courteous. I recommend my friends to ODC.", "pics": null, "resp": {"time": 1563296973658, "text": "Patty, Thank you for your kind words! We appreciate you!!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "104922496992841994262", "name": "Cathy Stevens", "time": 1575044274971, "rating": 5.0, "text": "This facility has been remodeled, and all testings are on one floor downstairs. Easy check in and all of the staff associates were friendly and professional.", "pics": null, "resp": {"time": 1575310229148, "text": "Cathy, Thank you for taking time to give us your feedback. We appreciate it! Have a great week."}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "111052244386056933598", "name": "Cheri Harr", "time": 1507748777724, "rating": 5.0, "text": "Wait time was good. My total visit was 45 minutes to get checked in, take images on 3 different locations of my body, then get images burned to a disc. Great customer service!", "pics": null, "resp": null, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "111921218530541996712", "name": "Adam Ray", "time": 1578335022779, "rating": 5.0, "text": "Friendly staff in a clean and newly remodeled facility.", "pics": null, "resp": null, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "117271675261091389136", "name": "Briana Wright", "time": 1541010737021, "rating": 1.0, "text": "Forget ever getting anyone on the phone or getting your results in a timely fashion. Frequently you'll be on hold for 10 minutes or more before the line just hangs up, and you basically have to come physically retrieve your results because they won't answer for your doctor's office either.", "pics": null, "resp": {"time": 1541084886830, "text": "Briana,  We appreciate the opportunity to resolve concerns and learn about ways we can improve our services and communication. We are sending your feedback to our Center Administrator. If you would like to speak with him as well, please call 256-532--2418. Thank you"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "117092143927874055192", "name": "Kristie Wetzel", "time": 1537825255603, "rating": 5.0, "text": "I've used Outpatient Diagnostics 4 times this year and just scheduled an appointment for an MRI (already had 2 xrays, a 3D mammogram, and 2 ultrasounds.  I HIGHLY recommend them.  From the office staff, imaging personal, wait time, swift results, and billing practices.  I have been incredibly pleased and will recommend them and continue to request them.", "pics": null, "resp": {"time": 1537992444999, "text": "Kristie, Thank you for your kind words! Your recommendation is our highest compliment. We appreciate you!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "115092293434191897005", "name": "NPC J", "time": 1498857825840, "rating": 1.0, "text": "Didn't have a wait that day payed my copay.  Turned around said I didn't pay and sent it to a collection agency.  All my other doctors have worked with me as I am fully disabled Vet and fighting for benefits with SSI.  What complete lack of care.  $32 dollars for collections. 1 phone call from them but already 3 or 4 from collections out of Texas. Still haven't gotten the results on my scans.", "pics": null, "resp": null, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "113444811636064714487", "name": "Beth Wood", "time": 1474313021973, "rating": 2.0, "text": "Although the staff here is phenomenal, the wait time is ridiculous.  My family doctor sent me here for x-rays .... I asked several times if I needed to make an appointment, but was assured x-ray need no appointment and I would be in and out fast.  This was Friday.  I came by and the person in front of me had extensive tests and it would be at least 2 hours before they got to me.  Understandable - said I would be back on my lunch break on Monday.  Again, was assured - this time by the check-in desk clerk - that daytimes were typically not busy and I probably would be in and out fast.  I have been here an hour and a half, after being told as I came in the wait would be about 15 minutes.  They do great work here, but I am very frustrated and unhappy with the wait time ...", "pics": null, "resp": null, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "101636786177103320956", "name": "asha lamy", "time": 1528722704369, "rating": 1.0, "text": "They left me standing in waiting room ( can't sit due to possible hip fracture) for 45 mins past scheduled appointment.  Tears streaming down my face from excruiating pain... I inquire: their tech no called no showed. Instead of telling me from onset so I could make a knowledgable decision they hid the fact as intensity of pain increased by the second. They had no care nor concern for patient trying ro stay upright in tears with extreme pain except to make a buck!  Now I lay here in my car in parking lot for the last 20 minutes waiting for pain to decrease so I can get home.  This place should be shut down by the state.", "pics": null, "resp": {"time": 1528737414050, "text": "We appreciate the opportunity to resolve concerns and learn about ways we can improve our services and communication. We are sending your comments to our Center Administrator. If you would like to speak with him as well, please call 256-534-5600. Thank you."}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "114349373647520835479", "name": "John Lary", "time": 1430175559811, "rating": 3.0, "text": "ODC Huntsville web page used to work perfectly and I could easily get my reports online. It appears that ODC has changed its web provider because their web page now works only sporadically. It is now a common occurrence that I cannot get my reports online while I am at the hospital. Quality of their reports is excellent, as usual, but I often CAN'T GET MY REPORTS ONLINE which creates a real problem for me.", "pics": null, "resp": null, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "100894051940458160874", "name": "Grace Taylor", "time": 1465853153191, "rating": 1.0, "text": "Yeah i was severely dussapointed in the treatment of the patients here. My mom has severe claustrophobia and they refused to et her have any antianxiety medication priory to MRI, nor would they letme sit with her while she had it done. In fact they forgot we were here and we had to wait an hour to even begin. Quite frankly I much prefer the BioImaging center as I waited a quarter of the time and was allowed company while i had the MRI done. Not to mention how much more polite the technicians were.", "pics": null, "resp": null, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "118157532268644402662", "name": "Stella Mitchell", "time": 1546267095073, "rating": 4.0, "text": "Staff are friendly and helpful.", "pics": null, "resp": {"time": 1546268052800, "text": "Hi Stella,\nThank you for your kind words and valuable feedback! Happy New Year!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "117036832357933335258", "name": "Jason S", "time": 1518797900163, "rating": 1.0, "text": "Got lost in the shuffle after I checked in so wasn’t given contrast on time for my scheduled scan.  Then they delayed the actual scan due to “insurance authorization” for a scan that was scheduled 3 days in advance.  They asked that I plan 2 hrs for the scan and I’m approaching 3 without being scanned.  (The actual scan takes less than 5 minutes)", "pics": null, "resp": {"time": 1519056885304, "text": "Jason, We appreciate the opportunity to resolve concerns and learn about ways to improve our services and communication. We are are sending your comments to our center Administrator, Chuck Miles. If you would like to speak with him as well, please call 256-534-5600. Thank you!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "109386384938170732485", "name": "Jerod Whisenant", "time": 1488898988986, "rating": 2.0, "text": "People are friendly but the wait time is outragous. I am sitting in the wait room now and have been here for 1hr and 15minutes and still haven't been called back.", "pics": null, "resp": {"time": 1488909613492, "text": "We know your time is valuable so we are so sorry that you waited longer than you should have in our center. We’ve identified the issue that led to your wait and we’ve resolved it so we appreciate you alerting us to the situation. We hope you’ll accept our apology for getting your day off to a slow start."}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "102841137785292148580", "name": "Leah Kirkemier", "time": 1614282802078, "rating": 5.0, "text": "I only send my patients to see Rob at this location.  Brandi and all staff have always been wonderful and very thorough.  The radiologist, Dr. Wagoner, is very personable and always right on target.  I sincerely trust everyone in this office.", "pics": null, "resp": null, "gmap_id": "0x888925dc70c820c1:0xe000a263f14330af"}
{"user_id": "104395015629272514781", "name": "Dana Molan", "time": 1501100469981, "rating": 5.0, "text": "FRIENDLY PERSONAL.GOOD TECHNICIAN WITH CHILDREN.  WORKED US IN DUE TO SPECIAL ISSUES.", "pics": null, "resp": null, "gmap_id": "0x888925dc70c820c1:0xe000a263f14330af"}
{"user_id": "108075626366346896864", "name": "Kat Morgan", "time": 1622811304173, "rating": 1.0, "text": "Worst office employees I've ever been unfortunate enough to deal with. The actual radiologists are great - but I've never seen more incompetent \"secretaries\". They keep a huge box of referrals and faxes just thrown everywhere and lost my referral repeatedly. My family had to call the doctor's office over and over to fax because every time they got it, the idiots in front would lose it with us standing right there. The only thing those morons could find were their snacks.", "pics": null, "resp": {"time": 1623074265612, "text": "We are sorry to hear this and truly value your feedback. The patient experience is important to us at American Health Imaging and we take your feedback seriously. I've shared your feedback with our team and they will investigate this matter."}, "gmap_id": "0x88891985d954e509:0xeb940f7ae2ba20ee"}
{"user_id": "117462299721082732029", "name": "JoAnn Ulmer", "time": 1615647472160, "rating": 5.0, "text": "Very professional, understanding and will use American Health Imaging for future MRI's. Having several issues on my back is hard to lay flat for any amount of time. It was just on one part, there are 4. The Dr will order more than 1 section but it takes a long time. So he decided I needed one section at a time. Worse first. I had ask to get 2 sections but I'm so glad he didn't.  Great place if you want professional, understanding and sympathetic\ntreatment.", "pics": null, "resp": {"time": 1615821989221, "text": "Hi JoAnn- Thank you so much for taking the time to share these thoughts. Our staff will pass along the kind words!"}, "gmap_id": "0x88891985d954e509:0xeb940f7ae2ba20ee"}
{"user_id": "103017059977426964356", "name": "Randy W. Harris", "time": 1615388488264, "rating": 5.0, "text": "I don’t know anyone who likes getting an MRI. The coffin-like experience can be overwhelming for many people including my wife. But the staff was wonderfully warm and kind. They obviously enjoy their work and it shows. This was a pleasant experience and I highly recommend AHI. Thanks to everyone!", "pics": null, "resp": {"time": 1615406933101, "text": "Hi Randy- Thank you so much for taking the time to share these thoughts. Our staff will pass along the kind words!"}, "gmap_id": "0x88891985d954e509:0xeb940f7ae2ba20ee"}
{"user_id": "113963710819926574105", "name": "Mandy Muffley", "time": 1608325824637, "rating": 5.0, "text": "Friendly, clean, and a wonderful place to get an MRI. I have panic attacks with MRI'S and the staff was so nice and friendly and really made me feel relaxed. I couldn't of made it without them. Highly recommend!!!", "pics": null, "resp": {"time": 1608750272645, "text": "Hi Mandy- Thank you so much for taking the time to share these thoughts. Our staff will pass along the kind words!"}, "gmap_id": "0x88891985d954e509:0xeb940f7ae2ba20ee"}
{"user_id": "116283861134517064066", "name": "Gwendolyn Gilmore", "time": 1611078795191, "rating": 5.0, "text": "It was great. Everyone was very nice. I think they are fantastic.", "pics": null, "resp": {"time": 1611256722598, "text": "Hi Gwendolyn- Thank you for the positive feedback.  We appreciate the kind words."}, "gmap_id": "0x88891985d954e509:0xeb940f7ae2ba20ee"}
{"user_id": "111637401145316566576", "name": "Trinton Warren", "time": 1612296893799, "rating": 5.0, "text": "It was a great place to have any exam done . From the front to the back,everyone was friendly, and curteous.Will certainly b back as my Dr.deams necessary. P.S.give everyone a Raise. B safe", "pics": null, "resp": {"time": 1612464905031, "text": "Hi Trinton- Thank you so much for taking the time to share these thoughts. Our staff will pass along the kind words!"}, "gmap_id": "0x88891985d954e509:0xeb940f7ae2ba20ee"}
{"user_id": "102350273590077509165", "name": "Brooke Bruner", "time": 1602526248259, "rating": 5.0, "text": "Wonderful service.  Very clean, staff is very nice and professional.  Great location!  Will definitely use again!", "pics": null, "resp": {"time": 1602527765638, "text": "Hi Brooke, Thanks for taking time to tell us about your experience!"}, "gmap_id": "0x88891985d954e509:0xeb940f7ae2ba20ee"}
{"user_id": "107131093427703688769", "name": "Shae Thomas", "time": 1615305395191, "rating": 5.0, "text": "I had a great experience! Very friendly staff and clean office!", "pics": null, "resp": {"time": 1615408866041, "text": "Hi Shae- Thank you for the positive feedback.  We appreciate the kind words."}, "gmap_id": "0x88891985d954e509:0xeb940f7ae2ba20ee"}
{"user_id": "116885323505901518215", "name": "Jacquetta Miller", "time": 1582922965596, "rating": 5.0, "text": "Very friendly staff, smells good and pleasing environment. Great waiting areas and very clean.", "pics": null, "resp": null, "gmap_id": "0x88891985d954e509:0xeb940f7ae2ba20ee"}
{"user_id": "104716428991406095634", "name": "clarence tentman", "time": 1592498400790, "rating": 5.0, "text": "Great staff very courteous and also very clean..", "pics": null, "resp": {"time": 1592502536961, "text": "Hi Clarence, we’re so glad you had a positive experience with ImageSouth. Thank you for taking time to let us know how you feel!"}, "gmap_id": "0x88891985d954e509:0xeb940f7ae2ba20ee"}
{"user_id": "101001026547348355109", "name": "Jillian Jordan", "time": 1611159955172, "rating": 5.0, "text": "Overall just wonderful", "pics": null, "resp": {"time": 1611256441227, "text": "Hi Jillian- Thank you for the positive feedback.  We appreciate the kind words."}, "gmap_id": "0x88891985d954e509:0xeb940f7ae2ba20ee"}
{"user_id": "115427943313760544820", "name": "Mary Martin McGill", "time": 1521309203633, "rating": 1.0, "text": "Waited an hour for my MRI. Couldn’t even speak to a receptionist to ask what was taking so long or how much longer it would be as she disappeared after I got there. Waited at least 20 min for her to return to tell someone I was leaving before I left. Never came back. Tried to call after leaving to tell someone I left but of course no answer. Absolutely unacceptable. Surely there’s a more professional/efficient place to get an MRI in Birmingham. Update: tech called back saying he called my name and I wasn’t there (duh) and asked if I wanted to get my scan done.... yes I did an hour and forty-five minutes ago but not anymore. Thanks.", "pics": null, "resp": null, "gmap_id": "0x88891985d954e509:0xeb940f7ae2ba20ee"}
{"user_id": "106824879739340215089", "name": "reginald.jackson.rj@gmail.com cortez2000", "time": 1550484933768, "rating": 5.0, "text": "The MRI machine was able to take my imaging foot first.", "pics": null, "resp": null, "gmap_id": "0x88891985d954e509:0xeb940f7ae2ba20ee"}
{"user_id": "101883158023861864827", "name": "joe bennett", "time": 1562966939417, "rating": 1.0, "text": "called and ask if I could move my appointment up they said ok and gave me a date drove 90 miles when I got their for appointment they never new me told them I drove 90 miles pretty much told me tuff luck will never use again", "pics": null, "resp": null, "gmap_id": "0x88891985d954e509:0xeb940f7ae2ba20ee"}
{"user_id": "111470211293321608657", "name": "Nicole Cook", "time": 1462205334099, "rating": 4.0, "text": "Nice clean atmosphere an friendly receptionist.", "pics": null, "resp": null, "gmap_id": "0x88891985d954e509:0xeb940f7ae2ba20ee"}
{"user_id": "107727462001097222341", "name": "Pam Curry", "time": 1624405007991, "rating": 4.0, "text": "Mom went to the ER because of symptoms related to COVID. She was admitted pretty soon after being seen and ended up in the ICU unit.  The nurses in the ICU were awesome!   Especially Hunter. He was her nurse for 4 days of her stay with them.  I never got his last name,  but he treated my mom and I both with such compassion and kindness. She got really good care while there.  I finally got to go in the hospital and see her on her last day with them and it was small and clean and really nice.  I recommend this hospital.", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "113976232174109666763", "name": "Nivada Spurlock", "time": 1615491998648, "rating": 5.0, "text": "I am a huge fan of Dr. Sophia Lal.  As an athlete, my goal is to never miss a workout.  Dr. Lal understands that mentality and takes the time needed to be sure I'm in a safe place for returning to physical activity.  The staff in her office made my visit pleasant and efficient.  Highly recommend Dr. Lal for your ortho needs!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPdVJhTG9ghkUyYj3tvCXGSaW_rqLRO73b1hFcR=w150-h150-k-no-p"]}], "resp": {"time": 1615593495516, "text": "Thanks for the great review! We are happy to see these comments! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "112005720175974440780", "name": "Dianne Varden", "time": 1623434282301, "rating": 5.0, "text": "Dr. Worthen is the best all around of any doctor I have seen as a patient. He is very courteous, easy to communicate with, has time to listen and very knowledgeable. I have had three knee surgeries by him and each time he has shown concern and compassion. I highly recommend him and his friendly and helpful office staff!", "pics": null, "resp": {"time": 1623504209256, "text": "Thank you for this great review, and have a fantastic day! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "112071646454823964851", "name": "Becky Garrison", "time": 1621972439009, "rating": 5.0, "text": "Kendall Roper is an excellent health care professional.  She clearly communicated the problem and offered different solution options.  Also, she was extremely patient and willing to answer all of my questions.  I would recommend her to anyone.", "pics": null, "resp": {"time": 1622023703732, "text": "Hi, thanks for the great feedback! We will be sure to pass it along to our team! We wish you good health and wellness. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "117983972624431893688", "name": "Carol H", "time": 1621636932015, "rating": 5.0, "text": "Dr. Worthen and his staff were very helpful. He discussed options with me and answered any questions I had. He has a great bedside manner, shows compassion and takes time with his patients, addressing their concerns. I would recommend him to anyone looking for an orthopedic doctor.", "pics": null, "resp": {"time": 1621640229849, "text": "Thank you for the great review! We are grateful to be able to deliver compassionate care for all. We hope your day is great! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "115778662097605201679", "name": "Jim Geiger", "time": 1623088200170, "rating": 5.0, "text": "This is a first class hospital.\nEveryone is friendly and professional and you can tell the staff loves working there.\nI feel respected and well cared-for, here.", "pics": null, "resp": {"time": 1623095059869, "text": "We think we have an incredible staff too! They work hard to deliver compassionate care. It's always nice to see messages like this. -Ascension St. Vincent's Community Manager."}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "103139430089351017102", "name": "Nicole Roper", "time": 1618337297249, "rating": 5.0, "text": "Everyone was so nice! I would highly recommend this orthopedic office! Dr Roper was thorough and answered all my questions without being in a rush. The front desk ladies are the sweetest and the x-ray team was super fast!", "pics": null, "resp": {"time": 1618494651955, "text": "Thank you; we appreciate your feedback! We will share it with our leadership. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "109113364497828128933", "name": "Elaine Chandler", "time": 1616455748364, "rating": 5.0, "text": "I visited Dr Bowman’s office to receive an X-ray  & a cortisone shot in my left knee. His staff was very polite & courteous. Dr Bowman is a nice, no-nonsense type of guy. He explained the X-ray to me & his nurse gave me the shot. Due to the use of lidocaine, the procedure was quick & not painful at all. I would recommend Dr Bowman to anyone w an A+ rating.", "pics": null, "resp": {"time": 1617630487867, "text": "Thanks for the great feedback! We will be sure to pass it along to our team! We wish you good health and wellness. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "109778019199091311691", "name": "michael thomas", "time": 1618857258651, "rating": 5.0, "text": "Dr. Worthen operated on my shoulder. I had zero pain in the days to follow. He was extremely thorough. The nurses and all the staff was top notch. Dr. Roper was great also and I highly recommend them.", "pics": null, "resp": {"time": 1618872515090, "text": "Thank you for the positive review! We work hard to provide high quality care. And we are committed to delivering compassionate care to the community. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "112195031861568267393", "name": "Tim Gaither", "time": 1615507374787, "rating": 5.0, "text": "Dr. Kissel is the absolute best! Very thorough and upfront about everything involved. His wealth of knowledge and experience is second to none.I feel very fortunate to have had him as my doctor. The whole staff is amazing as well. I have been extremely pleased.", "pics": null, "resp": {"time": 1615517201195, "text": "Thank you. We appreciate your positive review. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "116278516112318596561", "name": "allison mims", "time": 1621603004080, "rating": 5.0, "text": "Everyone we came in contact with (check in, nurses, doctors, and checkout) was so kind, efficient and patient! We were very pleased with our visit.", "pics": null, "resp": {"time": 1621604635762, "text": "Hi, thank you; we appreciate your feedback! We will share it with our leadership. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "104505245861465478339", "name": "lynn huffstutler", "time": 1610641446074, "rating": 5.0, "text": "Sara Thompson, nurse practitioner with St Vincent’s Orthopedics, is great. I’m so glad a friend told me about her and Dr smith. I went in to the practice with knee, hip and now back problems. Sara along with Dr Smith has helped me so much. Sara is so nice, pleasant, knowledgeable and prompt when I go on my appointments. I rarely have to wait to see her and she always makes me feel comfortable when discussing my problems. I trust and have faith in what she tells and prescribes for me to do. Thank you Sara.", "pics": null, "resp": {"time": 1610668908471, "text": "Our care team aims to deliver high quality compassionate care to the community. Thanks for sharing this feedback with us! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "107508703027978197169", "name": "Maggie Stafford", "time": 1621372670000, "rating": 5.0, "text": "It a very nice visit from seeing Ms. Brandi to seeing  Dr. Kendall Roper. I highly recommend them!!", "pics": null, "resp": {"time": 1621394371339, "text": "We appreciate you taking the time to leave us this feedback. We will pass it along to our leadership team. Thank you. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "105739162445427525324", "name": "Janet McDonald", "time": 1612830969272, "rating": 5.0, "text": "Dr. Bowman is a wonderful doctor. I would recommend him for your orthopedic needs. He has been so understanding and takes time to listen to his patients. I had a total knee replacement and he did everything to help me to  get back to my activities.", "pics": null, "resp": {"time": 1612911811387, "text": "Thank you for these comments. Your feedback is important to us and we will pass it along to our team! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "114969312410464804653", "name": "Sharon Denson", "time": 1615332572531, "rating": 5.0, "text": "Although I prefer to see Dr.J.Todd Smith since he's been my orthopedic doctor before he ever moved to St.Vincent's.  Sara is very efficient and listens to your feelings. They have done outstanding surgery's on me in the past. They all make a good team. I highly reccomend them all. Thank God for these gifted surgeons. Thanks for everything ya'll do.", "pics": null, "resp": {"time": 1615337296498, "text": "This is great to see, thanks so much for sharing your rating! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "115303078228132962776", "name": "Ezma Collier", "time": 1609868484277, "rating": 5.0, "text": "Dr. Hurowitz was very thorough in explaining what was going on with my foot/toes. He explained the different levels of treatment available. I was able to ask questions and he believed that we could start with the least obtrusive procedure and go from there. He is very knowledgeable and made sure I understood what he was explaining to me. I will certainly rely on him as we go through this process. Staff are incredible and made sure you were comfortable and taken care of.", "pics": null, "resp": {"time": 1609869109660, "text": "Thank you so much for the positive review! Our care teams are dedicated to delivering compassionate care.  -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "114379495953761566510", "name": "Suzy Usry", "time": 1616558501947, "rating": 5.0, "text": "Dr. Lal is so knowledgeable and thorough and always helps to get my back to running and triathlon. She is always so kind and really talks through my condition and treatment. As an athlete herself, she really understands.", "pics": null, "resp": {"time": 1616638282482, "text": "Thank you for this great review, and have a fantastic day! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "100574818252468162613", "name": "Tanya Twer", "time": 1614643420202, "rating": 5.0, "text": "When you're injured and in pain, the last thing you want to worry about is if you'll like and feel comfortable with your RN. You want someone who listens to you, takes you seriously, calms your nerves, and helps you throughout the difficult process. Sara Thompson is exactly that! She's wonderful! She made me look forward to going to the doctor (who actually says that?). I would almost (ALMOST) want to be injured forever if Sara could help me. But that won't ever happen, because their practice is fantastic and they'll have you out the door and healthy again in no time!", "pics": null, "resp": {"time": 1614818473719, "text": "Thank you for sharing this review! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "116575355993951998860", "name": "rick hudson", "time": 1614858450140, "rating": 5.0, "text": "Dr. Edward Kessel is kind, knowledgeable, and thorough. He has been my orthopedic Doctor for over 35 years and has kept me walking upright, healthy, and as pain free as I could expect during and after 7 surgeries on both legs. Needless to say I have been very rough on my lower body. Would not consider changing my Orthopedic Surgeon.", "pics": null, "resp": {"time": 1614921470527, "text": "Thank you for this great review, and have a fantastic day! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "108066860837048037143", "name": "Linda Watkins", "time": 1614229041823, "rating": 5.0, "text": "Dr. Worthen is wonderful. He explained everything to me in detail prior to my knee replacement and at each checkup following. He is warm and has a wonderful bedside manner. I highly recommend him. I think he rates higher than a five!!", "pics": null, "resp": {"time": 1614920466345, "text": "Thanks for taking the time to leave us positive feedback! Have a great day! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "109756816520526053369", "name": "Andrew Hand", "time": 1615312167997, "rating": 5.0, "text": "Dr. Adkison is the absolute best doctor ever. Not only is his skill set phenomenal, but he also has a wonderful bedside manner. I’ve never recovered so quick from a shoulder surgery like I did when Dr Adkison operated on me! I recommend him all day!", "pics": null, "resp": {"time": 1615336628938, "text": "Thank you for taking the time to leave us this positive review! Have a great day! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "104801231170496494152", "name": "Gary Smiley", "time": 1614273689107, "rating": 5.0, "text": "They were prompt, professional, and friendly.  I did not have to wait more than 5 minutes after completing the paperwork.  Moreover, they were able to schedule my MRI with the imaging company for that same day.  I was very satisfied!", "pics": null, "resp": {"time": 1614894879950, "text": "Thanks for the great review! We are happy to see these comments! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "105355166434474361760", "name": "Pamela Horne", "time": 1611876869936, "rating": 5.0, "text": "It was great! I didn’t have to wait but a few minutes to be seen. My stitches were removed without incident. My visit with Dr. Kissel was informative he left no questions unanswered!", "pics": null, "resp": {"time": 1611949081444, "text": "We’re happy to hear your positive feedback! Thank you. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "104358390025267309500", "name": "patrick mcmillian", "time": 1612563920456, "rating": 5.0, "text": "Although there was some confusion about my appointment time.  Dr. Bowman and all the staff are super friendly and helpful.  All questions were answered to my satisfaction.  Would definitely recommend St. Vincent's.", "pics": null, "resp": {"time": 1612641309022, "text": "Thank you for sharing this review! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "106373402408325883423", "name": "Sue Phillips", "time": 1622736905059, "rating": 5.0, "text": "Was in and out fast and Dr. Roper and everyone there is so nice.", "pics": null, "resp": {"time": 1607478459977, "text": "We appreciate your positive review. Thank you! -Ascension St. Vincent's Community Manager."}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "112360566581967807357", "name": "Eleanor F. Wright", "time": 1612829894611, "rating": 4.0, "text": "Dr James Worthen, St Vincent’s Hospital Nurses and my physical therapist Jonathan gate have been wonderful. Dr. James Worthing is a wonderful doctor . I am two weeks out from surgery and cannot say enough nice things .The nurse at Saint Vincents were great and my physical therapist Jonathan gates came to the house And could not have made things more convenient. Everyone made the replacement of a partial knee replacement with a new knee replacement and Realigning of the ligaments, muscles and tendons as easy as possible.", "pics": null, "resp": {"time": 1608436299240, "text": "Thank you! We appreciate your positive review. We are grateful to serve our community with compassionate care. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "112692855559539911255", "name": "Sarah Warburton", "time": 1615826966606, "rating": 5.0, "text": "Wonderful experience with Dr. Worthen. His staff was efficient and informative and Dr. Worthen has the best “bedside” manner. He made our 11 year old daughter feel comfortable and explained her injury and treatment in a way that she could understand.", "pics": null, "resp": {"time": 1615839842252, "text": "Our care teams aim to deliver high quality care. Thank you for sharing this feedback with us! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "110909433220448368563", "name": "Christina Martin", "time": 1618743746478, "rating": 5.0, "text": "Dr. Worthen and all of the staff were very friendly and helpful. Dr. Worthen explained everything to me and the plan for getting me better. That went a long way in helping with my anxiety. I would recommend him to anyone looking for an ortho doctor.", "pics": null, "resp": {"time": 1618840486376, "text": "We appreciate you taking the time to leave us this feedback. We will pass it along to our leadership team. Thank you. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "106026875503774788569", "name": "Diane Fulmer", "time": 1619453409117, "rating": 5.0, "text": "They were very through very knowledgeable. They took time to talk with me and explain things. Ok", "pics": null, "resp": {"time": 1619455215561, "text": "We appreciate you taking the time to leave us this feedback. We will pass it along to our leadership team. Thank you. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "102824617784383739136", "name": "Henry Mellen", "time": 1614037550720, "rating": 5.0, "text": "Jamie was very professional and personable; he took the time to explain the condition of my knees and what options were available for short term relief. Then gave me a “down the road” prognosis of where I need to be to warrant surgery. On a scale of 1 to 5 with 5 being highest, he was 5+. I will be back if and when that time comes.", "pics": null, "resp": {"time": 1614093916907, "text": "We appreciate you taking the time to leave us this feedback. We will pass it along to our leadership team. Thank you. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "113271497793164872647", "name": "Harry Jones", "time": 1606913934468, "rating": 5.0, "text": "Hospitalization was at St. Vincent's Birmingham. Surgery was for total right knee revision. Dr. Bowman has excellent surgical skills. He stays up to date with developments in orthopedics so that he can offer the best care for his patients. He is friendly with good bedside manners. Highly recommended.", "pics": null, "resp": {"time": 1607012112531, "text": "Thank you for the positive review! We work hard to provide high quality care. And we are committed to delivering compassionate care to the community. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "113406085841262536370", "name": "Patricia Carlisle", "time": 1612996759486, "rating": 5.0, "text": "Was seen promptly. Everyone was very friendly and accommodating Dr was very patient, understanding and explained everything to me. I was very happy with my experience.", "pics": null, "resp": {"time": 1613062718309, "text": "Thank you; we appreciate your feedback! We will share it with our leadership. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "105844423078748572679", "name": "Emily Kunkler", "time": 1616129926049, "rating": 5.0, "text": "We visited this wonderful hospital from out of town tonight as we were passing through to go to Florida for our vacation. My almost 4 year old was having an allergic reaction to something he shouldn’t have eaten and I have nothing but great things to say. We were greeted with a smile from the person checking patients temps at the door. Walked directly to the desk to get checked in and met another smiling face. Next the nurse doing vitals was very nice and friendly.  Our nurse Aida was SOOO sweet to my little boy and even gave him two prizes for being so good. He was so excited to give it to his brother when he got back to the hotel. (Reminded me of the old days when I went to the ER 25 years ago and got a stuffed animal that I still have to this day.) Dr. Gore was in the room before I even had time to sit down and was very kind, reassuring, and professional as well! Our little boy was okay too. Given some Benadryl and we were back to the hotel within an hour of leaving.\n\nThis experience was a great example of what people and hospitals should be like! Thank you!!!!", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "103493085522461499450", "name": "Sherri Eichhorn", "time": 1613152341233, "rating": 5.0, "text": "The office staff is great! Very pleasant with me and exact needs. Describe possible surgeries in depth! Highly recommend!!  No wait time at all!!", "pics": null, "resp": {"time": 1613165416437, "text": "Thank you; we appreciate your feedback! We will share it with our leadership. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "109113384088142346586", "name": "Aaron Fuller", "time": 1619810646580, "rating": 5.0, "text": "Dr. Worthen does a fantastic job and takes time with each patient and levels with them.", "pics": null, "resp": {"time": 1619873726299, "text": "Hello, we appreciate you taking the time to leave us this feedback. Thank you. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "105108763421935472490", "name": "Rickey Coker", "time": 1621966581104, "rating": 5.0, "text": "Kendall was very nice and professional, all employees I seen were great", "pics": null, "resp": {"time": 1622017087335, "text": "Hi, thanks for the great feedback! We will be sure to pass it along to our team! We wish you good health and wellness. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "113955643211892041900", "name": "Dile Brooks", "time": 1615323668033, "rating": 5.0, "text": "Dr. Cusmariu is a great doctor. He has a very caring and professional staff. I highly recommend this practice.", "pics": null, "resp": {"time": 1615337366292, "text": "Our care teams aim to deliver high quality care. Thank you for sharing this feedback with us! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "117690130565423756772", "name": "sharon evans", "time": 1616125950508, "rating": 5.0, "text": "Very successful knee replacement. Dr. Kissel has always been responsive with kindness and compassion. I have felt comfortable with everyone in his office. Thanks, Dr Kissel!", "pics": null, "resp": {"time": 1616127510631, "text": "Our care teams aim to deliver high quality care. Thank you for sharing this feedback with us! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "104629775349613891313", "name": "Jane McCann", "time": 1614196427319, "rating": 5.0, "text": "Dr. Worthen is that rare combination of excellent surgeon and compassionate human being.  He has replaced both of my knees and I don't have a single negative comment.  I have recommended Dr. Worthen to friends, who share my opinion.", "pics": null, "resp": {"time": 1614917823688, "text": "Reviews like this are inspiring. Our teams are committed to compassionate care. Thank you for sharing! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "111114865466675352557", "name": "Donna Box", "time": 1615401821479, "rating": 5.0, "text": "Dr. Worthen is hands down the BEST Orthopedic Surgeon. I have had so many injuries. (I’m an accident looking for a place to happen!) Every time I walked in the door, he was always deeply concerned and listened to me. He fixed all my broken parts and I can say that I am now pain free! He is thoughtful, explains in detail what his plan of action is, and he never made me feel rushed to get out. He took the time to listen and work with me as I was going through some really tough situations!\nThank you Dr. Worthen!", "pics": null, "resp": {"time": 1615415279320, "text": "We appreciate your positive review. Thank you! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "116658564376054910595", "name": "Jimmy Kelly", "time": 1612671951751, "rating": 5.0, "text": "After working in the medical field for 30 years, I was well aware of some surgeons attitudes and personalities. After visiting with Dr. Adkison I could not have been more happy with my  visit with him. He was very attentive and made me feel like family and i’m very thankful that I chose him to do my shoulder repair.", "pics": null, "resp": {"time": 1612810800191, "text": "We appreciate you taking the time to leave us this feedback. We will pass it along to our leadership team. Thank you. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "112864358168174376735", "name": "Mattie Hardy", "time": 1613410753191, "rating": 5.0, "text": "Very professional.  Did not have to wait.  Doctor asked and answered questions professionally.  Love the place.", "pics": null, "resp": {"time": 1613502291716, "text": "Thank you; we appreciate your feedback! We will share it with our leadership. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "105280043213351404086", "name": "James Mayfield", "time": 1616694247112, "rating": 5.0, "text": "Very professional group didn’t have to wait long to see Dr Kissel. He was through on his examination. I’m  pleased with this group of Doctors", "pics": null, "resp": {"time": 1616782445432, "text": "Thank you for the positive review! We work hard to provide high quality care. And we are committed to delivering compassionate care to the community. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "113004942864391331733", "name": "Susan Jackson", "time": 1607536197752, "rating": 5.0, "text": "I have been going to Dr. Worthen for knee and other joint and bone problems for several years.  Everything that could be fixed has been fixed with expert care and considerable kindness.  It is time now for a total knee replacement and I trust him and his terrific physician assistant Brent to take the same great care and expertise for this upcoming surgery.", "pics": null, "resp": {"time": 1607794892668, "text": "We are glad we were able to help! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "117490101189310927105", "name": "Richard Rowell", "time": 1613064435239, "rating": 5.0, "text": "Doctor Kissel was  very prompt into the examining room and straight forward.  He understood my situation, my previous treatments,  and shared his diagnosis in plain English zeroing in on the required path forward.", "pics": null, "resp": {"time": 1613065907628, "text": "Our care teams aim to deliver high quality care. Thank you for sharing this feedback with us! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "108719853180230330027", "name": "Larry Harris", "time": 1612556413199, "rating": 5.0, "text": "Met with Dr. Adkison today to discuss right shoulder replacement.  Great meeting as he explained a lot of the details of the surgery.  I have used him a couple of more times for other issues and continue to be very pleased with him and his staff.", "pics": null, "resp": {"time": 1612579723327, "text": "Thanks for the great feedback! We will be sure to pass it along to our team! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "114897670266236383879", "name": "Angela Harrington", "time": 1614112196833, "rating": 5.0, "text": "Dr Smith answered all my questions was honest and seemed knowledgeable. I would recommend him.", "pics": null, "resp": {"time": 1614179447674, "text": "Thanks for the great feedback! We will be sure to pass it along to our team! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "117774425608947473819", "name": "Chuck Carlisle", "time": 1608325393101, "rating": 5.0, "text": "Dr. Adkison and his staff in Birmingham are wonderful. I know I am in good hands with him. He is the best orthopedic surgeon there is. He has repaired both of my shoulders. Will definitely use him and the other doctors in the future.", "pics": null, "resp": {"time": 1608435777231, "text": "Thanks for the great feedback! We will be sure to pass it along to our team! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "115183231234647712954", "name": "Dwain Ellis", "time": 1613595985833, "rating": 5.0, "text": "Dr. Worthen was very personable and thorough with history of my issue as well as the exam. He took time and explained several treatment options for my course of care. Would recommend Dr. Worthen highly as well as his staff.", "pics": null, "resp": {"time": 1613600439004, "text": "We think we have an incredible staff too! They work hard to deliver compassionate care. It's always nice to see messages like this. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "107477457687185911132", "name": "eva wilensky", "time": 1615232971573, "rating": 5.0, "text": "I have only rave reviews for Dr. Worthen before, during and after knee replacement. His explanation of the surgery is easy to understand, without using too much medical terminology. He makes you feel like you're his only patient, does not rush thru an office visit., listens to your questions and answers accordingly. Highly recommend Dr. Worthen.", "pics": null, "resp": {"time": 1615333296043, "text": "We strive to provide high quality care, so your positive comments mean a lot to us! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "118409067860828909442", "name": "Brian Mims", "time": 1620351718114, "rating": 1.0, "text": "Waiting for over 4 hours out in the lobby even after they took x-rays. Keep giving the excuse that they don't know when she will be seen cause it depends on.....Shouldve driven to Shelbu", "pics": null, "resp": {"time": 1620435296535, "text": "We'd like to look into this. Would it be possible for you to reach out to us at 205-930-2333 (Mon-Fri 8 am-4:30 pm)? Thank you! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "102985244680889401331", "name": "Ricky Edwards", "time": 1616014420027, "rating": 5.0, "text": "Dr. Worthen took the time to explain what I was experiencing and what he felt would be our recovery course once I had my MRI. Very personable and the staff were great. Glad I came to him.", "pics": null, "resp": {"time": 1616024429996, "text": "We’re happy to hear your positive feedback! Thank you. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "106331785069542173722", "name": "Susann Mauldin", "time": 1613051514345, "rating": 5.0, "text": "Very happy with the experience. Was able to get the information I needed about my issue and treatment plan.", "pics": null, "resp": {"time": 1613064739756, "text": "So glad to hear your positive feedback! Thank you for taking the time to leave us this review. Our teams are committed to delivering compassionate care in our community. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "106434889188267995729", "name": "Ronnie Blakney", "time": 1616537084400, "rating": 5.0, "text": "Dr. Atkison is outstanding.  So far he has replaced 2 knees and operated on both shoulders.", "pics": null, "resp": {"time": 1616636556582, "text": "So glad to hear this! Our care teams are committed to compassionate care. Thank you for taking the time to leave us this review. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "111118915887127809224", "name": "Eastern Tree Service", "time": 1613583371106, "rating": 5.0, "text": "Great staff as well as very informative Dr Cushamriu ! I felt they were looking out for my best interest and not to just put me on operating table !", "pics": null, "resp": {"time": 1613584898228, "text": "We think we have an incredible staff too! They work hard to deliver compassionate care. It's always nice to see messages like this. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "111972881617651023855", "name": "Melanie Morris", "time": 1615303091480, "rating": 5.0, "text": "Absolutely amazing bedside manner. So happy I found him", "pics": null, "resp": {"time": 1615336465748, "text": "Thank you for this great review, and have a fantastic day! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "116537026878722195834", "name": "Lequene Simmons", "time": 1614362659094, "rating": 5.0, "text": "I was hospitalized for surgery on Lumbar area, November 24th. Dr. Fulmer, the nurses and all of the staff were so amazing and attentive to my needs!!  I am doing much better, now that I’m healed. I thank everyone at Ascensiion St. Vincent’s, Birmingham !!!", "pics": null, "resp": {"time": 1614894033717, "text": "Our care team aims to deliver high quality compassionate care to the community. Thanks for sharing this feedback with us! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "102988860428005018340", "name": "Naomi Robinson", "time": 1600886085651, "rating": 5.0, "text": "I had an awesome experience last night concerning ALL staff. Every single person i came into contact with were all very comforting,  helpful and extremely warm to me considering i was in pain and my husband couldn't come into the back with me!!  Amazing staff!! They were very efficient and courteous and i was seen and out of there in a timely manner!", "pics": null, "resp": {"time": 1600960271209, "text": "We think we have an incredible staff too! It's always nice to see messages like this. -St. Vincent's Health System Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "103420207669616971638", "name": "Birmingham bumble bee", "time": 1607084467189, "rating": 5.0, "text": "I very much recommend this doctor. He is a skilled and trustworthy professional that has taken care of my health for years.   5 stars is to little I give him 10 stars.", "pics": null, "resp": {"time": 1607454955790, "text": "Thanks for the great feedback! We will be sure to pass it along to our team! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "115289440925122949695", "name": "Jan Defnall", "time": 1612812385796, "rating": 5.0, "text": "Everyone was pleasant and competent..  I liked Dr. Worthen very much and it appears he was able to relieve my knee pain, for which I'm thankful", "pics": null, "resp": {"time": 1612814066049, "text": "Thank you! We appreciate your positive review. We are grateful to serve our community with compassionate care. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "104210827506523161309", "name": "a. phillip bouyer", "time": 1615336685817, "rating": 5.0, "text": "Dr. Cusmariu did a right knee replacement on me 10 years ago, he is now a seasoned physician whose bedside manner has improved a hundred fold; I trust his judgement when it comes to my healthcare!", "pics": null, "resp": {"time": 1615337522693, "text": "Thanks for the great review! We are happy to see these comments! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "114153740390321768968", "name": "Sandra Pope", "time": 1612385989369, "rating": 5.0, "text": "Dr Worthin was such a pleasure to work with. He was very patient and answered my concerns throughly. His office staff was great as well.", "pics": null, "resp": {"time": 1612472351194, "text": "Our care teams aim to deliver high quality care. Thank you for sharing this feedback with us! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "105623303069715474575", "name": "LYLE Carcione", "time": 1613677862391, "rating": 5.0, "text": "Dr.Bowman has  a great personality  and caring about the process of after care for his clients.. Each step of the recovery  process he has made me feel like it was goin to be o.k..", "pics": null, "resp": {"time": 1613680080495, "text": "We appreciate you taking the time to leave us this feedback. We will pass it along to our leadership team. Thank you. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "113299699055742773616", "name": "Ana pena blackburn", "time": 1615826363287, "rating": 5.0, "text": "Wonderful staff, make a great team, Dr. Worthen  is an awesome experienced and knowledgeable specialist and surgeon!!", "pics": null, "resp": {"time": 1615839789919, "text": "Thanks for taking the time to let us know how we're doing, and for leaving us a great rating! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "115394839351176700544", "name": "Vivian Jackson", "time": 1608571467694, "rating": 5.0, "text": "I highly rate Dr.. Kissel.. He is a great Dr.. shows a lot of concern.. He is a great Dr..you feel free to ask questions because he is such a friendly Dr.  His mannerism is great.. He is definitely a 5 star Dr.", "pics": null, "resp": {"time": 1608669649978, "text": "Thank you for your kind words! Reviews like this are so meaningful to us. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "110662347865755195776", "name": "B B", "time": 1611924489995, "rating": 5.0, "text": "The office staff and nurses were amazing. They facilitated everything to have the experience run smooth and as if you had been their patient for years. Dr. Hurowitz was professional yet easy to talk to. I was in and out within an hour which included X-rays, cast and schedule for another appt in 2 weeks. Thank to Dr. Hurowitz and staff for a great experience even with a broken ankle.", "pics": null, "resp": {"time": 1611951434480, "text": "Thanks for the great feedback! We will be sure to pass it along to our team! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "115426893117654014432", "name": "Ann McAnnally", "time": 1614964854864, "rating": 1.0, "text": "I will not be seeing Dr. Kissel again. Worse 'patient/dr. manners I have encountered' I have been having excruciating pain in left knee, sleepless nights and misery for about 3 weeks. He was highly recommended, upon arrival they made one front board x-ray of knee after I told them explicitly it was the right inside of left knee. I am a very healthy 84 yr old, just had raving reports from primary Dr. this week on my lab work, agility and very active lifestyle. Dr. Kissels words to me were that's an old 80 year old knee, some arthritis. Take tylenol and get an otc cream. I asked if it could be a torn miniscus he said probably but that knee is old with a lot of miles. No mention of mri or further ckg into it. I could walk 2-5 miles with no limp before this onset, don't take pain pills, have not been admitted to any hospital since 1976 ,clean my own gutters, horseback ride etc. He repeatedly referred to my old knee. Well I plan to use these 'old knees' for several more years to play t ball and dollhouse in the floor with my great grands. Needless to say I cancelled my appt. to go back in two weeks, I heard him loud and clear about my old knees.  Love St. Vincent's Hospital this is totally about the one doctor.", "pics": null, "resp": {"time": 1614986185729, "text": "Thank you for the feedback. We believe that compassionate care starts with listening. We would like to work with you directly, so could you please contact us at 205-930-2333 (Mon-Fri 8 am-4:30 pm)? Thank you. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "109474469147154217337", "name": "ed vance", "time": 1607479888073, "rating": 5.0, "text": "Short wait. Nice talk. She listened to my issues and did an eval that made me believe she knows her stuff. I'm happy....so far.", "pics": null, "resp": {"time": 1607793663827, "text": "Thank you for taking the time to leave us this positive review! Have a great day! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "114017394985942002986", "name": "Renee Smith", "time": 1607393991703, "rating": 5.0, "text": "From the receptionist, to the x-ray technician, to Dr. Worthen, to the PA - everyone was extremely pleasant, considerate and professional.  They all explained everything well.  I was very pleased with my visit and care.", "pics": null, "resp": {"time": 1607783030228, "text": "Thanks for the great feedback! We will be sure to pass it along to our team! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "116321943034341282114", "name": "Angelena Robinson", "time": 1614308618710, "rating": 5.0, "text": "Dr Edward Kissel is an excellent Orthopedic doctor. One of the best in his profession.  If you have anything wrong with your bones, especially your knees or shoulder, go and see Dr Kissel.  Dr Kissel cares about his patients and is kind and holds a conversation with you.\nThe wait time there is not long.\nThe staff is very courteous. I have been a patient of Doctor Kissel for many years.\nMany of my friend, co-workers and family are patients of Dr Kissel and they are doing well. You do not have to wait forever to get an appointment. So if you decide to pay them a visit, be kind to them, they deserve it.\nA Robinson", "pics": null, "resp": {"time": 1614914997377, "text": "Thank you for the positive review! We work hard to provide high quality care. And we are committed to delivering compassionate care to the community. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "116705896425299810554", "name": "Cathy Cummins", "time": 1607177019002, "rating": 5.0, "text": "I was very pleased with my experience..\nThe entire staff was friendly and helpful.\nDr Bowman was very helpful and I was pleased with his professionalism and my progress!", "pics": null, "resp": {"time": 1607523408602, "text": "We strive to provide high quality care, so your positive comments mean a lot to us! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "110638568997899591915", "name": "Janet Ort", "time": 1610577815177, "rating": 5.0, "text": "Dr Lahl is an amazing Dr. She always takes into consideration my life desires when designing a treatment plan.  She is inquisitive and genuinely cares for my health.", "pics": null, "resp": {"time": 1610646022657, "text": "Our care team aims to deliver high quality compassionate care to the community. Thanks for sharing this feedback with us! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "106255718983751770820", "name": "Beverly O’Neal", "time": 1617970741098, "rating": 5.0, "text": "It was a very good experience. Everyone was very friendly and efficient at there job.", "pics": null, "resp": {"time": 1618220095131, "text": "Thanks for the great feedback! We will be sure to pass it along to our team! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "103993673762755592005", "name": "Barbara Sloan", "time": 1615825973159, "rating": 5.0, "text": "Dr. Kissel is a great orthopedic doctor. I love the fact that he supports physical therapy for injuries, along with other treatments.", "pics": null, "resp": {"time": 1615839822908, "text": "Thank you; we appreciate your feedback! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "112197363031317850858", "name": "Angela Watson", "time": 1610645007422, "rating": 5.0, "text": "I see Dr.Bowman at St.Vincent’s Birmingham.He’s awesome  and makes  me really comfortable.It’s always good to have a doctor with a great sense of humor and outstanding bedside manners.", "pics": null, "resp": {"time": 1610668919670, "text": "Thank you for your kind words and this wonderful review! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "107428377834154333241", "name": "Kolette Pharris", "time": 1612915673791, "rating": 5.0, "text": "While going into doctor Smith office I was full of anxiety, not getting the proper rest from the night before I was concerned about a procedure that will soon take place, I spoke with Dr Smith about it, he was very understanding and answered all my questions. Dr. Smith and his staff we're very kind and patient, they assured me I had nothing to worry about that I will be taking care of, thanks:-)", "pics": null, "resp": {"time": 1612980531599, "text": "We sincerely thank you for the positive review! We are grateful to deliver compassionate care in our communities. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "104958413584965432957", "name": "Felicia Green", "time": 1614498533138, "rating": 1.0, "text": "Had to bring my daughter to er for non stop vomiting and diarrhea they gave her fluids and nothing else for her symptoms and sent her home still vomiting and didn't prescribe her anything to stop it and said they couldn't find anything wrong with her. Not very happy", "pics": null, "resp": {"time": 1614814629333, "text": "We would like the opportunity to address this. Please reach out to us at 205-930-2333 (Mon-Fri 8 am-4:30 pm). Thank you. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "117863311567560733169", "name": "Pete Jackson", "time": 1608581106298, "rating": 5.0, "text": "On time, efficient and more than qualified to handle my issue.  Did not feel rushed through the process.  Would highly recommend to my fellow athletes.", "pics": null, "resp": {"time": 1608668590256, "text": "Thank you for your kind words! Reviews like this are so meaningful to us. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "100231978948419656743", "name": "Nancy Cook", "time": 1615488902036, "rating": 5.0, "text": "Dr. Lal was prepared to explain my problem. She explained the 3 ways she thought would help.", "pics": null, "resp": {"time": 1615593480042, "text": "Thank you for the great review! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "110488861820486070763", "name": "Marc Beaumont", "time": 1611771701729, "rating": 5.0, "text": "Easy to get a timely appointment, check-in was a breeze, and clinical services were excellent across the board.", "pics": null, "resp": {"time": 1611798771712, "text": "We’re happy to hear your positive feedback! Thank you. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "117421530846911666210", "name": "Larry Turner", "time": 1607393413717, "rating": 5.0, "text": "A knee replacement is not a fun thing to do but with Kendall as my P A she is as good as there is, she’s smart,caring and a very good listener and l really appreciated that. Good luck to her and the entire team. LWT", "pics": null, "resp": {"time": 1607783017659, "text": "Thanks for the great feedback! We will be sure to pass it along to our team! We wish you good health and wellness. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "103727422050002573121", "name": "Lasandra Slaughter", "time": 1611283588984, "rating": 5.0, "text": "I had a great experience at the St. Vincent's downtown Birmingham. Everyone there was great and the service was wonderful.", "pics": null, "resp": {"time": 1611338198871, "text": "It made our day to read your nice review. Thank you for the kind words. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "110435788746614561698", "name": "Rebecca Persons", "time": 1605588598054, "rating": 5.0, "text": "Dr. Hurowitz is an excellent orthopedic surgeon and has a great personality. He is very patient and explained my surgery in great detail in an easy to understand manner, as well as what to expect post-op. The entire staff is fantastic from check-in to check-out. I highly recommend St. Vincent's Orthopedics.\n\n*** I'm not sure why this posted for St. Vincent's Chilton. I saw Dr. Hurowitz at St. Vincent's Hospital in Birmingham. ***", "pics": null, "resp": {"time": 1605611537043, "text": "Our care team aims to deliver high quality compassionate care to the community. Thanks for sharing this feedback with us! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "114868271269092590127", "name": "Marcia Hodges", "time": 1611272317027, "rating": 5.0, "text": "Dr Lal is very thorough and she takes time to explain the problem and gives detailed information to assist with healing and painting n relief.  I recommend her highly.", "pics": null, "resp": {"time": 1611337939038, "text": "Thank you! We appreciate your positive review. We are grateful to serve our community with compassionate care. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "117879435719519621690", "name": "Michael Hull", "time": 1611271265333, "rating": 5.0, "text": "Highly recommend. Such a nice guy and great nurses/staff.", "pics": null, "resp": {"time": 1611337923663, "text": "We appreciate your positive review. Thank you! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "100927756979647840490", "name": "Lindsey Middleton", "time": 1610489728444, "rating": 5.0, "text": "Dr. Lal was so incredibly kind, personable, and very in depth. I appreciated her and her nurse, Carley, so much!", "pics": null, "resp": {"time": 1610565455980, "text": "Our care teams aim to deliver high quality care. Thank you for sharing this feedback with us! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "112240318226880944745", "name": "Donna Kendrick", "time": 1612807672724, "rating": 5.0, "text": "I was very pleased with Dr. Worthen’s kindness, knowledge, answers for my knee pain.", "pics": null, "resp": {"time": 1612813979855, "text": "Our care team aims to deliver high quality compassionate care to the community. Thanks for sharing this feedback with us! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "110583976512451215481", "name": "David Cochran", "time": 1615406878189, "rating": 5.0, "text": "Very attentive and thorough.  Very pleased with care.", "pics": null, "resp": {"time": 1615415418167, "text": "Our care team aims to deliver high quality compassionate care to the community. Thanks for sharing this feedback with us! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "103701188333718145663", "name": "Gary Clayton", "time": 1608599767347, "rating": 5.0, "text": "Great patient care as well as very personable. Dr. Worthen is excellent at his craft and truly displays patience when on a visit and during surgical procedures.", "pics": null, "resp": {"time": 1608671487590, "text": "We strive to provide high quality care, so your positive comments mean a lot to us! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "111047840571456968696", "name": "Yorke Williams", "time": 1611182718550, "rating": 5.0, "text": "I met with Dr. Worthen today for a two week follow up after a total knee replacement. I feel very safe in his office. Dr. Worthen is part of the St. Vincent’s Orthopedic group at St. Vincent’s. Everyone in the office was wearing a face mask. There is plenty of sitting space in the waiting room so everyone can easily be safety distanced. Checkin was quick and efficient. I met with the doctor at my appointment time without having to wait. The practice has its own X-ray so I was quickly  x-rayed & Dr. Worthen was able to review it while I was there for my appointment. Dr. Worthen is a excellent orthopedic surgeon. He evaluated my knee and we discussed my physical theraphy schedule. He will have me come back in a month to check my progress.", "pics": null, "resp": {"time": 1611247589513, "text": "Thanks for the great feedback! We will be sure to pass it along to our team! We wish you good health and wellness. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "104414173294673966008", "name": "Sheri Anaforian", "time": 1608152095361, "rating": 5.0, "text": "I see Dr Worthen at St. V’s BHM. He has repaired both shoulders and I had total knee replacement surgery last December. He is not only an incredibly gifted physician, but a very kind and compassionate human being. He always takes time to explain everything in detail and has taken away my anxiety and fears numerous times. I just saw him today along with his wonderful staff. I will be undergoing another full thickness tear repair, January 5th. Again, my heart was much lighter after our talk. Brent, April and the staff are always attentive and so caring. I’m beyond grateful for this awesome doctor and staff.", "pics": null, "resp": {"time": 1608254397500, "text": "Our care teams aim to deliver high quality care. Thank you for sharing this feedback with us! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "115277883079238765352", "name": "Robin Melanie", "time": 1607365030062, "rating": 5.0, "text": "Hes the best Orthopedic  Dr. I've ever had treat me. Hes wonderful and precise\nI just love him!!", "pics": null, "resp": {"time": 1607478216357, "text": "Thanks for taking the time to acknowledge our team. We appreciate the review! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "113336490880915840357", "name": "Ginger Virden", "time": 1606176788766, "rating": 5.0, "text": "Dr Lal listens and is very caring. She is a great diagnostician. She is practical and honest, working with you until she gets to the root of your problem.", "pics": null, "resp": {"time": 1606248405759, "text": "Thank you for leaving us these kind comments. Our care teams are dedicated to delivering compassionate care. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "109916225841421702882", "name": "Aaron Tews", "time": 1606249256237, "rating": 5.0, "text": "Staff was professional/courteous.\nDr. was thorough with exam and questions.\nAll my questions satisfactorily answered.", "pics": null, "resp": {"time": 1606328938592, "text": "We strive to provide high quality care, so your positive comments mean a lot to us! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "111867251284517224823", "name": "hd374d", "time": 1606239415620, "rating": 5.0, "text": "Greatly Enjoyed working with Sophia Lal! A+++ She is conscious of time management and I never waited more than a few minutes on my appointment.", "pics": null, "resp": {"time": 1606326425579, "text": "Thank you for taking the time to leave us this positive review! Have a great day! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "107503950036645513274", "name": "Ml Peel", "time": 1608665486028, "rating": 5.0, "text": "Dr Lal was on time. Professional clearly Explained my next steps to be taken. 5 stars!!!!", "pics": null, "resp": {"time": 1608672918170, "text": "We’re happy to hear your positive feedback! Thank you. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "112628502867664032579", "name": "Danny Chesnut", "time": 1607043825492, "rating": 5.0, "text": "Good to see Dr Adkison’s face, since I started seeing him during the virus.   He’s great and has my greatest admiration.", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "110502155169965338680", "name": "Rosario Saya", "time": 1616357696555, "rating": 5.0, "text": "Dr. Adkison operated on my right shoulder in 2018 and when I needed surgery on my left shoulder this year I did not hesitate for a second.  I cannot recommend Dr. Adkison highly enough.", "pics": null, "resp": {"time": 1610943123941, "text": "Thank you for sharing this review! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "114181557690715359136", "name": "Jim S", "time": 1614113517502, "rating": 5.0, "text": "Excellent visit.  Very professional and knowledgeable.", "pics": null, "resp": {"time": 1614179436700, "text": "We appreciate your positive review. Thank you! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "107813356606016715208", "name": "Denise Farmer", "time": 1615318805183, "rating": 5.0, "text": "Awesome staff and PA!! Highly recommend!", "pics": null, "resp": {"time": 1615336723919, "text": "Thanks for the great feedback! We will be sure to pass it along to our team! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "102518764305297174296", "name": "Terry Tingle", "time": 1607543282139, "rating": 5.0, "text": "Dr. Worthen is the best. His staff is the best. Friendly, caring, and always professional.", "pics": null, "resp": {"time": 1607795268415, "text": "Thanks for the great feedback! We will be sure to pass it along to our team! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "106828982828475041596", "name": "Lavora Phillips", "time": 1621531978969, "rating": 5.0, "text": "Very good experience here in Clanton & so glad to have a great doctor close to home", "pics": null, "resp": {"time": 1610218482242, "text": "Thanks for taking the time to leave us positive feedback! Have a great day! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "108066244450394540069", "name": "Clarence Janes", "time": 1614026391072, "rating": 5.0, "text": "Dr. Worthen was thorough, plain speaking, and kind hearted.", "pics": null, "resp": {"time": 1614031545894, "text": "We strive to provide high quality care, so your positive comments mean a lot to us! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "108213206046802907724", "name": "Edward Still", "time": 1607357811583, "rating": 5.0, "text": "Fast service, cheerful (even funny) doctor visit. Great results.", "pics": null, "resp": {"time": 1607476693555, "text": "We’re happy to hear your positive feedback! Thank you. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "109779219675928575742", "name": "Glenn Davis", "time": 1606933144485, "rating": 5.0, "text": "Both my wife and I have used Dr. Worthen for arthritis issues in our knees  and found him to be kind, understanding, and very helpful.", "pics": null, "resp": {"time": 1607032128010, "text": "Thank you; we appreciate your feedback! We will share it with our leadership. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "115677011648430015601", "name": "Robin Cagle", "time": 1606277310002, "rating": 5.0, "text": "My shoulder surgery went well and my recovery has gone smoothly thanks to Dr. Worthen and Kendall Roper, Physician’s Assistant.", "pics": null, "resp": {"time": 1606338934445, "text": "We appreciate you taking the time to leave us this feedback. We will pass it along to our leadership team. Thank you. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "103757649504210794498", "name": "Jimmy Holliman", "time": 1615263494354, "rating": 5.0, "text": "Highly satisfied with the staff and the care that I received.", "pics": null, "resp": {"time": 1615331802564, "text": "Our care team aims to deliver high quality compassionate care to the community. Thanks for sharing this feedback with us! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "111910899208827034543", "name": "thom leinheiser", "time": 1607554257122, "rating": 5.0, "text": "Always the best. Loves to answer questions and super assistant, Carli!", "pics": null, "resp": {"time": 1607796004591, "text": "Thank you so much for this positive review! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "105217416900383277130", "name": "Jill Lowman", "time": 1618408227220, "rating": 4.0, "text": "She is still learning some aspects of orthopedics", "pics": null, "resp": {"time": 1618660535913, "text": "Hi, your feedback is important to us, and we appreciate you taking the time to share it. Thank you! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "104632846063900363440", "name": "Lauren Taylor", "time": 1596566016882, "rating": 1.0, "text": "If I could give zero stars I would. The staff in the waiting room don't seem to do anything at all except for tell people to stay back and wait for someone to come and take their temperature. After 3 hours of waiting and testing they said they'd have my results back soon. An hour later and I still haven't gotten my results. I will NEVER come back to this hospital.", "pics": null, "resp": {"time": 1597866590165, "text": "We try very hard to meet expectations and we regret that we have not done so in this case. We're here to listen, if there is any additional feedback you would like to share with our team, feel free to reach out to us at 205-930-2333 (Mon-Fri 8 am-4:30 pm). -St. Vincent's Health System Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "108393919494156105231", "name": "Debbie Bates", "time": 1611963467848, "rating": 5.0, "text": "Dr Worthen and his staff in the orthopedic department are the best!!", "pics": null, "resp": {"time": 1612070695302, "text": "Thank you for your kind words and this wonderful review! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "112001287954188449088", "name": "Jeanne Desmet", "time": 1621984933607, "rating": 5.0, "text": "She was very nice and helpful", "pics": null, "resp": {"time": 1622020004146, "text": "Hi, thank you; we appreciate your feedback! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "108682900397011978183", "name": "Diann Millar", "time": 1611003063852, "rating": 4.0, "text": "I have always been treated very good at this hospital. Today Donna in X-ray was the only problem", "pics": null, "resp": {"time": 1611157523797, "text": "Thank you; we appreciate your feedback! We will share it with our leadership. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "111845870943777947069", "name": "Sean Mckinney", "time": 1597090582906, "rating": 5.0, "text": "Their staff was very professional efficient courteous and very knowledgeable. Dr. Binkerd removed my gallbladder this morning I'm back home without any complications his staff the hospital staff all were excellent in my book", "pics": null, "resp": {"time": 1597172292753, "text": "We think we have an incredible staff too! It's always nice to see messages like this. -St. Vincent's Health System Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "117125843873466037157", "name": "Phillip Upchurch", "time": 1615415704288, "rating": 5.0, "text": "Excellent staff, meeting with Doctor went well", "pics": null, "resp": {"time": 1615512189565, "text": "Thanks for the great feedback! We will be sure to pass it along to our team! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "101654857374233000396", "name": "David Whitehurst", "time": 1606256727939, "rating": 5.0, "text": "Always quick in and out the doctor and on schedule.  My diagnosis and treatment plan is well communicated.", "pics": null, "resp": {"time": 1606330855529, "text": "Thank you for your wonderful comments! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "109588309422606906651", "name": "Robin Fulton", "time": 1616060064855, "rating": 5.0, "text": "The Doctor was very nice.", "pics": null, "resp": {"time": 1616124107841, "text": "We’re happy to hear your positive feedback! Thank you. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "106778533771507912575", "name": "Barry Elliott", "time": 1610645748762, "rating": 5.0, "text": "I have seen Dr. Kissel before and have been completely satisfied", "pics": null, "resp": {"time": 1610668770149, "text": "We’re happy to hear your positive feedback! Thank you. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "108036543176545957663", "name": "Gigi Love", "time": 1623183632089, "rating": 5.0, "text": "All good 🙂", "pics": null, "resp": {"time": 1623225212852, "text": "Hi, thank you; we appreciate your feedback! We will share it with our leadership. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "116965672698691144165", "name": "Eddie Cole", "time": 1608324883753, "rating": 5.0, "text": "My visit to St. Vincent's exceeded my expectations.  I am sure that I made a wise decision to see Dr. KISSEL.", "pics": null, "resp": {"time": 1608435766916, "text": "We strive to provide high quality care, so your positive comments mean a lot to us! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "114891978829989710706", "name": "Randy McCay", "time": 1613588153432, "rating": 5.0, "text": "Great staff and doctors.", "pics": null, "resp": {"time": 1613594638570, "text": "We appreciate your positive review. Thank you! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "100028991942002658293", "name": "James Lowman", "time": 1619539829974, "rating": 5.0, "text": "Excellent person.", "pics": null, "resp": {"time": 1618398620751, "text": "This is great to see, thanks so much for sharing your rating! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "107549492482465610099", "name": "Ann Collett", "time": 1614630386613, "rating": 5.0, "text": "Great doctor and staff.", "pics": null, "resp": {"time": 1614887384293, "text": "Thanks for the great feedback! We will be sure to pass it along to our team! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "106070013656123854128", "name": "Keenan Outdoors", "time": 1613690573585, "rating": 5.0, "text": "Dr Bowman is the BEST!", "pics": null, "resp": {"time": 1613752714361, "text": "Thank you; we appreciate your feedback! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "100125616943044370056", "name": "cynthia horton", "time": 1577995781377, "rating": 5.0, "text": "Had to have gallbladder surgery December 31.  I was in pain and nervous.  I had a large gallstone and swelling and the gallbladder was being difficult to remove.  The surgeon Dr Jon Binkerd was able to get it out.  The staff at the hospital was wonderful.  Everyone we came in contact with the moment we walked in the door was so pleasant.", "pics": null, "resp": {"time": 1578000682390, "text": "Our hospital aims to deliver high quality patient care. We love to hear about these positive experiences. Thanks for sharing this feedback with us! -St. Vincent's Health System Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "115292255818923588206", "name": "Danielle McElduff", "time": 1594049528526, "rating": 1.0, "text": "They are slow and I felt like they didn't care about my situation or how I was feeling. Bedside manner was non existent. I came in with numbness in my left arm and my left leg and pain in my neck and chest\nI sat in the lobby for almost an hour before they took me to the back.", "pics": null, "resp": {"time": 1594244376057, "text": "Thanks for taking the time to leave your rating. We'd like to learn more about your concerns. Would you mind reaching out to us at 205-930-2363 with more details? -St. Vincent's Health System Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "105781190739326681423", "name": "GluedBond", "time": 1559940241477, "rating": 5.0, "text": "I had some bad urology issues going on and this was the closest, easiest place for me to go with no insurance as it was right down the road. Normally when I go to a hospital, I'm in the waiting room for hours. Here? Within 15 minutes, I was checked in, went through triage and in front of a doctor.\n\nThe nursing staff and doctor I seen were great. The nurse was especially sweet, nice and super helpful. Most of my hospital experience being Shelby in Alabaster, everything in this facility was spotlessly clean and tidy. Very blown away by the level of service as an individual without health insurance.", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "110368141122997648822", "name": "Common Pestimist", "time": 1582969474864, "rating": 5.0, "text": "Very nice nurses, doctors, and staff! Saw me within 10 minutes, in 30 minutes I was on my way home! You guys are awesome!", "pics": null, "resp": {"time": 1583007234138, "text": "Thanks for the great feedback! We will be sure to pass it along to our team! We wish you good health and wellness. -St. Vincent's Health System Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "116623426673098042757", "name": "Angel Baby", "time": 1606006779261, "rating": 1.0, "text": "Long wait times, normally  takes 6 or 7 hours to be seen. I will never come to st Vincent  in chilton county  again. Horrible service..", "pics": null, "resp": {"time": 1606015769680, "text": "We are continually looking for ways to improve. If you're willing to discuss your review in more detail, please reach out to us at 205-930-2333 (Mon-Fri 8 am-4:30 pm). Thank you. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "116277180299210430796", "name": "Leslie Galvan", "time": 1583163793262, "rating": 1.0, "text": "Called 5 different times because I have several fractures that need to be looked at today. Each time they transferred me to literally everyone in that place who said the same thing over & over again “hm let me check” then they would put me on hold for 10 more minutes just to get told the same thing 5 more times. HORRIBLE customer service coming from a HOSPITAL!!! If they couldn’t see me today that would’ve been fine all they had to say was “Im sorry we cant see you today.” So I didn’t have to waste my time trying to find a close by hospital. I should’ve listened to everyone that says this hospital has the worst customer service.", "pics": null, "resp": {"time": 1583335171117, "text": "Thank you for taking the time to leave a review. Could you please contact us at (205) 939-7264 (Mon-Fri 8 am-4:30 pm) so that we may have someone follow up? Thank you. -St. Vincent's Health System Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "112386643852708317788", "name": "Sherrie Williams", "time": 1582844437870, "rating": 5.0, "text": "The nurses, pcs and Dr. Binkard were awesome. This was my first major surgery and I am grateful that God put me with the best.", "pics": null, "resp": {"time": 1582924582057, "text": "We strive to provide high quality care, so your positive comments mean a lot to us! -St. Vincent's Health System Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "117040747808528741272", "name": "ashley phillips", "time": 1599966687428, "rating": 1.0, "text": "This is the slowest place. I don't think anyone in there is actually doing their job. Been waiting going on 5 hrs.", "pics": null, "resp": {"time": 1600109656893, "text": "We try very hard to meet expectations and we regret that we have not done so in this case. We're here to listen, if there is any additional feedback you would like to share with our team, feel free to reach out to us at 205-930-2333 (Mon-Fri 8 am-4:30 pm). - Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "103601450348343366517", "name": "Judith Taggart", "time": 1607041331864, "rating": 5.0, "text": "Excellent care and staff.", "pics": null, "resp": {"time": 1607452655459, "text": "Thanks for the great feedback! We will be sure to pass it along to our team! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "104652720517671925433", "name": "Julie Carroll", "time": 1606948282688, "rating": 5.0, "text": "Very helpful, nice, and patient.", "pics": null, "resp": {"time": 1607106105424, "text": "Thank you; we appreciate your feedback! We will share it with our leadership. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "103728811246804689157", "name": "Va Watson", "time": 1559062638127, "rating": 1.0, "text": "I went to the emergency room there with pain and swelling of my nose. I had an x-ray. My nose was fractured. I was given a steroid for swelling,nothing for pain. I was given a prescription for 325mg Tylenol and more steroids. I went in there in pain. I left there in pain. I'm in even more pain today. I will NEVER GO BACK THERE.", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "100845233994710176209", "name": "Emily Spivey", "time": 1563707410726, "rating": 1.0, "text": "The only reason I went there was it was late Sunday night and I was very sick.  We only waited in the waiting room 10 minutes, in the other room about 15.  Girl came in, asked symptoms, said I had a sinus infection and she would prescribe something.  Left and never came back.  Total interaction, less than 3 minutes.  Tech came in and gave me a stack of paper work and said I could go.  No verbal instructions, nothing.  Came home and read stack of paper to find out a list of things I was supposed to take/do.  All they prescribed was Amoxicillin.  8 days later, still terribly sick.  The most ridiculous part was they billed my insurance $3090 for a 3 minute visit, that I found out was only a PA, not even a doctor!!!!!  I won't EVER go back there!", "pics": null, "resp": {"time": 1567629700659, "text": "Hello Emily, we'd like to look into this. Please reach out to our patient representative at (205) 939-7264. Thank you."}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "106147774407461685993", "name": "Jill Pate", "time": 1573655794365, "rating": 5.0, "text": "Here for a medical test and it's a nice new facility.  People are friendly and professional too.", "pics": null, "resp": {"time": 1573662396340, "text": "Your feedback is important to us, and we really appreciate you taking the time to share it. Thank you! -St. Vincent's Health System Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "104287099670411755972", "name": "Hannah Little", "time": 1505829513678, "rating": 5.0, "text": "I had to bring my child in to be monitored in the ER for a few hours. She is 2 years old and definitely did not want to be bothered with all of the monitors, etc. but ALL of the nurses, doctors and all staff were SO patient and GREAT with her and explained everything us so we understood what was going on. We had a wonderful experience. Great job STV Chilton!", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "112049357732164376131", "name": "Aurora", "time": 1573939714771, "rating": 5.0, "text": "They provided excellent, thorough, compassionate care! I’m so thankful they’re close, but I would bypass other hospitals to go here!", "pics": null, "resp": {"time": 1574026644852, "text": "Reviews like this are inspiring. Thank you for sharing! -St. Vincent's Health System Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "104663493572763240975", "name": "Jason Campbell", "time": 1526416272433, "rating": 5.0, "text": "We had an exceptional experience at St. Vincent's Chilton.  We brought our 9 year old son in and everyone was amazing - the physician, the nurses, the x-ray techs.  We could not have been more pleased with the care received.", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "107269401295817957837", "name": "Edwin Palmer", "time": 1584237204310, "rating": 5.0, "text": "Friendly staff at night, didn't have to wait long to be seen.", "pics": null, "resp": {"time": 1584311806380, "text": "Your feedback is important to us, and we really appreciate you taking the time to share it. Thank you! -St. Vincent's Health System Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "110214449288529585573", "name": "Tabiatha Murr", "time": 1490411364017, "rating": 5.0, "text": "First, we got there at 7:07pm on 3/23/17 by 7:15pm we were in a room nurse came right in to see what we were there for my 5 year old daughter had a possible broke arm, Nurse gave her some Tylenol, then doctor (very nice woman) came in examined her arm ordered X-ray done with portable machine, and found out it was broken. They put her in a splint and we left at 9 :30 . They care she received was exceptional and the love they showed her wasn't like she was  one of their children. Thanks to all the staff at St. Vincent's Chilton very thankful for this group of doctors and nurses!!!!!!", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "112134027504410802040", "name": "Clarence1957", "time": 1495298448899, "rating": 5.0, "text": "I cannot thank the staff of this new hospital enough. We were in our way from Indiana to Florida when I started experiencing stomach pains. For 3 hours my husband drove while I vomited in the back seat. It just got worse. He found this little hospital and I did wait in a gurney in the hall for a few hours but there were no open rooms in the ER, and although I felt like it I was not dieing. Tests were run and IV fluids and meds were administered. I was admitted and had to spend the night but I really am thankful for the ER Dr and nurses who helped me. I was treated with dignity & respect even though I was not an \"ideal patient\" (pulled my IV out once). So if you are in that area and need help, don't hesitate to go to this hospital. Thank you again for the excellent care and love you gave to me in my time of need!", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "115571788498284433817", "name": "charles boothe", "time": 1608598165564, "rating": 5.0, "text": "Awesome Doctor", "pics": null, "resp": {"time": 1608671352519, "text": "Thank you so much for this positive review! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "116821577713815960153", "name": "Stephanie Porter", "time": 1507304442393, "rating": 5.0, "text": "I recently had surgery and the staff is awesome, Dr Binkerd is great too! Great job all around! The staff were all very friendly,  caring, compassionate, and had excellent bedside manor. Great experience from beginning to the end!!", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "105300720832257007403", "name": "PAUL JONES", "time": 1527906633523, "rating": 1.0, "text": "Called 4 days this week with no answer all day each day in billing and finance. Paid in full in person and they applied to wrong account. No one there to assist. Very happy with the entire hospital but these 2 departments.", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "118198832318647928154", "name": "Jarrad Bates", "time": 1522627425249, "rating": 5.0, "text": "Luckily, we have not had to use this new hospital until this past week while the kids were out on spring break. Our 5 year old son cut the end of his finger off so I immediately loaded him up and without hesitation went to the ER at St. Vincents Chilton, not really knowing if they would be able to help with a pediatric patient. The staff never hesitated about treating him. Our nurse was Meagan, nurse practitioner was BJ and the physician was Dr. Elliott. EVERYONE went above and beyond to help him feel comfortable and comfort us parents. Meagan and BJ are the best! Thank you to everyone for the outstanding service!!", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "107771895454553070640", "name": "James H.", "time": 1553579592096, "rating": 1.0, "text": "2 people ahead of me.  Spent 3 hours here and seen doctor for about 5 minutes.  Where was she the other 3 hours. Didnt appear to be any casualties here. Same old Chilton hospital with poor service and long waits. Never again", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "115930009394438968118", "name": "Shanon Hamilton", "time": 1619811341942, "rating": 5.0, "text": "We took our son to the Emergency Department after he had hit his head and had a huge knot.  From the time we left our house until we returned home was an hour.  20 minutes of that was drive time.  Dr. Gore was great and so was the rest of the staff!", "pics": null, "resp": {"time": 1619873947881, "text": "Hello, our care team aims to deliver high quality compassionate care to the community. Thanks for sharing this feedback with us! -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "102404190043707160410", "name": "Lauren Frederick", "time": 1505743772960, "rating": 5.0, "text": "I brought my son to the hospital when he fell and knocked out his 2 bottom teeth. The staff was amazing and very accommodating. The doctor saw us quickly and addressed all of my concerns! I would highly recommend st vincents chilton!", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "109473570096489978443", "name": "Charlotte Mims", "time": 1537567943923, "rating": 5.0, "text": "I didn’t like it. I’ll take the extra time and go see the specialists at UAB in the future for my medical care needs.\n\nGave the ER a 2nd chance this time for my daughter. The experience was wonderful! From registration to the ER doctor, nurse, and techs. My daughter received exceptional care. Will be back for our emergency care needs.", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "115878040989125171964", "name": "Brad Talley Katherine Edmonds", "time": 1540849347146, "rating": 1.0, "text": "Nothing but a horror show. My fiance wen today for a thyroid problem an they treated her horribly. Called her fat and put her down the whole time. Waiting for a call back from the hospital administration. If I could give a negative I would.", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "110739251049177797998", "name": "Kathy Peoples", "time": 1478433461273, "rating": 1.0, "text": "Took my sister in early Sunday morning she had been up in crying pain with her tooth for over 13 hrs. Instead of offering some relief the young woman Dr. gave her a life lesson and told her she should take the money she buys cigarettes with and go to the dentist gave her an antibiotic prescription and walked away. I sincerely hope she never has a situation and is in so much pain and can't get help. I thought the new hospital would bring better care but it didn't just a new building. To the little Dr. With no bed side manner you want make it long in your career unless you figure out how to treat people like they matter and not down your nose at them.", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "100219133009772190565", "name": "Danielle Ware", "time": 1552974061945, "rating": 1.0, "text": "My Aunt was rushed out to St. Vincent we got her about 4:30 pm. First off they put her in a Room with no information on her board to say who her Dr. was or who her Nurse was either.. It was almost 2 hours before they even had blood work done ( mind you my Aunt is 81 years old) then it was 2 hours before they came and told us what they thought was wrong.. I had questioned the nurses & Dr. Why are we still here at 12:35 & she still don't have a Damn bed here nor in Shelby County.. They told us her condition was critical but she still laying in this bed.. One the nurses tried to be sacrastic with me about how long we been out here, her name was Olivia Shoemaker the Dr. was Dr. Elliette.. Im convinced that these people are only here for the money not to care for the patients.. This trully sad & this a new hospital fairly!! It's like what was the point of giving us a new hospital if your staff could care less..", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "108583947440760159043", "name": "Giant Slayer", "time": 1552154808501, "rating": 5.0, "text": "The radiology intake staff and nurses are quite extraordinary people! I’ve not met an unkind person behind those two doors yet!", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "103104085718188062126", "name": "Nikki Wells", "time": 1596407807187, "rating": 5.0, "text": "Clean, professional and personal", "pics": null, "resp": {"time": 1596596489926, "text": "We appreciate you taking the time to leave us this feedback. Thank you. -St. Vincent's Health System Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "110797529062108927615", "name": "Tim White", "time": 1528101977381, "rating": 1.0, "text": "Horrible. Nurses and Doctor decided my wife was faking or on drugs without tests. She was having seizures or convultions. We told them my wife's health and history was complicated but they didn't care. We had to leave and go to another Emergency Room. The 2nd E.R. ran blood tests that proved she was not on drugs. They ran several other tests that proved she wasn't faking. It was a reaction to a new prescription her doctor had given her. St. Vincent's Chilton is horrible and not to be trusted.", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "113388084554995685216", "name": "Jane Brooks", "time": 1533929206229, "rating": 1.0, "text": "Badly managed and super slow. The staff isn’t friendly if they don’t know you! 3 people who worked at this facility has tried to comment with good reviews. Sandy D. Laura F. Shannon H. Your not slick we know you work for STVS. My opinion I would go to Shelby Baptist or UAB. STVS probably doesn’t have the equipment you need anyway", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "100923192804300644880", "name": "Theresa Ridlespurge", "time": 1520262139358, "rating": 5.0, "text": "I am very thankful to have SV in Clanton. From the ER to the patient ❤ they are all wonderful. Their faith shines bright. Couldnt ask for better care. Thanks to you all. May God Bless you each and everyone.", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "107738797811757199891", "name": "Jo Anna Jordan", "time": 1486568122165, "rating": 4.0, "text": "I had a hospital stay of 4 days, they took very good care of me the staff was so helpful the only reason for 4 stars not 5 is i think my bathroom could have been kept cleaner and i should not have ran out of toilet tissue. I would absolutely recommend this hospital to everyone!", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "105392929504158857586", "name": "LIFTED SPIRIT MINISTRIES", "time": 1487520467935, "rating": 1.0, "text": "Doctor christen does not act proffessional. He looks at you like you are stupid when you try to explain a symptom......the rest of the staff is fabulous they would get 5 stars. Doctor christen would get nothing.", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "108619732685736051605", "name": "Craig Steen", "time": 1505829129000, "rating": 5.0, "text": "Great staff. Willing to help any way they can.", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "118131655254132540321", "name": "Melvin Lamons", "time": 1518197383982, "rating": 5.0, "text": "Carried my wife to the emergency room and was treated with utmost respect and everyone\nWas ceourteous and sought to accomadate the needs of my wife.the dr. Was also very polite\nAnd attentive to our questions and concerns.we have been going to st vincents down town\nBut we are going to enquire about specialty doctors to see if we can possibly transfer here.\nWe were very impressed with our 1st. Visit.", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "104974542623954529060", "name": "Mickei Archie", "time": 1505200704579, "rating": 1.0, "text": "I went to St.Vincent's because the previous day Brookwood Baptist Shelby I had been diagnosed with multiple kidney stones.\nThey told me to come back if symptoms worsen, or new symptoms begin.\nBut because gas was low we reluctantly went to this facility. And once again got affirmation of the reasons why we should have not even bothered.\nDr.T as she is known  in the er, came in 35 minutes after I had been put in a room. And they were not busy as I went straight back, the bedside manner was hideous, the,nurses are rude one even has really bad,broken English you can't understand her words when she talks.\nAnyway the doc came in, I told her about my hospital visit just yesterday and from that point she asked questions and we discussed it, she then listened to my chest and,back. Leaves the room about 15 mins after that a nurse (heavy Russian Accent!)  entered my room", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "115499412697874537325", "name": "Stephen “sknappster” Knapp", "time": 1480543552753, "rating": 5.0, "text": "Service an attitude were great all staff were helpful and diligent in their cane.", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "103070217695637704473", "name": "Shay Jordan", "time": 1485313246705, "rating": 1.0, "text": "So i have a cpl of foster children in my home and one had lice. We work all day so took our own children and foster children to get a perscription for shampoo to get rid of it before it spreads. The doc wrote over the counter shampoo (i explained it wasnt pay day and i could not at the moment afford to treat 6 children) and he flat out refused to write perscription strength so our insurance would cover it. (bcbs) He thought it better to just let it spread instead of actually assisting us to get it treated.", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "100378460772627731057", "name": "Stevie E.", "time": 1532391032258, "rating": 1.0, "text": "Poorly managed is not nearly enough to say about this hospital. Nurses are getting their hours cut on a regular basis and then told they shouldn't be \"in it for the money\" by hospital administrators who cut hours because they're in it for the money. Hypocritical.", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "106317349281882107451", "name": "Johnathan Dopson", "time": 1548996990122, "rating": 1.0, "text": "Literally the slowest hospital on this planet ive been here for 4 hours and no one else has been in here for the past hour and was told earlier that they had all the results in and now we're waiting for literally nothing", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "111968187368772603355", "name": "Wendylyn Geeslin", "time": 1483670149656, "rating": 4.0, "text": "I can't say I'm not pleased... Had an abcess and with the swelling being so bad and omg did it hurt, my dentist sent me to the er for antibiotics. Gave me two high mg antibiotics And an injection of toradol for the swelling. Took a lot of Advil, picked up the antibiotics that morning by the afternoon the swelling was down and it felt soooo much better. Was able to get to the dentist and get it taken care of that Wednesday. Only drawback was this was on new years eve and the wait was from 6pm-11pm. Guess that's to be expected though sometimes.", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "101920935093284690635", "name": "Rosalie Pearson", "time": 1489696152105, "rating": 2.0, "text": "My mom lives in nearby Thorsby while I live in Montgomery. She called me at 11:30pm to say she felt lightheaded, a little dizzy, and had what felt like a slight pressure in her chest. She called the ambulance and the EMT's took her to St. Vincent's to be checked out.\n\nI had left Montgomery immediately after receiving the call and arrived at the hospital minutes after her ambulance had arrived (the EMT's were just bringing out the gurney to their rig when I got there) I went into the Emergency Room, told them why I was there and gave them info on my mom (name, date of birth, address, phone, and reason for admittance). The woman told me they were going to get her in a room and then ask when I could come back. I was the ONLY person in the waiting room. About 20 minutes later she said again that they had her in a room and would see when I could go back. Fifteen minutes after that she said a woman had just gone back to see if I could go back. Needless to say it was over an hour before they let me go back. The worst part is that I had assumed they would at least let my mom know I was there. Even though she had been asking them and voicing concerns about how I had not yet arrived no one from the waiting room told her I was there and none of the nurses back with my mom bothered to check if I had arrived. This was not a far walk either, considering my mom was approx. 30 ft inside the doors from the waiting room I was in.\n\nWhen I finally did get back to see her she was hooked up to a heart and pulse/ox monitor and they had a fluid IV in. They took her out to get chest X-rays and a CT scan minutes after I got back there. When she returned to the room about 15 minutes later, the nurse that brought her back first said she didn't know how to hook my mom back up to the machine and the IV...then was going to try...then decided no, she would have someone come in and do it. A half hour went by and no one came in to hook her back up. I stepped outside the door and explained that she had not been hooked back up and the nurse at the station said thanks, and they would come in and do it...which they never did. The original doctor she saw was also standing there when I told the nurse and did nothing. You would think if you were monitoring someone who you think may have had a heart attack you would want them hooked up to a monitor.\n\nFinally, the doctor came in a little before 4am and said that the X-rays, and CT scan were just fine, but there were concerns with her blood work (PS no one had ever come in to hook my mom back up to the monitors). The doctor explained there are three types of cardiac enzymes. One that tells if there is actual muscle damage and that they use to determine if you've had a heart attack (which was normal and my mom did not), and two others. One of the extra two was normal and then the doctor said that the third was \"significantly higher.\" She said that could indicate that although she may not have had a heart attack that enzyme could mean there could be something brewing or big That could happen on the horizon. She wanted to admit my mom so she could see the cardiologist in the morning...which we did. Kicker is when the cardiologist came in and looked at the tests he said it was slightly elevated, but nothing that he found alarming.\n\nAll in all I just felt like even though the ER was extremely slow, and at times there were 4 or more staff members sitting at the desk area within the ER, the overnight crew seemed fairly insufficient at simple things, like communicating that family members are there, or rehooking a patient back up to monitors and IV's.", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "114861475194133736825", "name": "Jerome Johnson", "time": 1572119662554, "rating": 5.0, "text": "Went in for a toothache on a Saturday morning at 6am after being up all night with excruciating pain and they saved me I left in no pain from a dental emergency and I'm thankful to them because they are not dentist but they care enough to still help out", "pics": null, "resp": {"time": 1572266547979, "text": "This is great to see, thanks so much for sharing your rating! -St. Vincent's Health System Community Manager"}, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "116910410513429512455", "name": "Jennifer Kimbro", "time": 1505842027899, "rating": 5.0, "text": "great place!  Great Team", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "104962097206376352640", "name": "Sandy Driver", "time": 1515697248631, "rating": 5.0, "text": "Love this hospital and the compassionate care that is provided", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "114547718271627072144", "name": "KBR", "time": 1505831408579, "rating": 5.0, "text": "Great Hospital. Great staff.", "pics": null, "resp": null, "gmap_id": "0x888ec8f4e3dd0d69:0xabe5f655cd2e4f08"}
{"user_id": "104745664610196071691", "name": "Marla Sivell", "time": 1602900580992, "rating": 5.0, "text": "I was drawn to Bridgeway based on their advanced diagnostic techniques and their  radiologist expertise. The compassionate staff and their continued technology advancements have kept me as a patient. I have shared this with multiple family and friends because I want them to have the best care as well.", "pics": null, "resp": {"time": 1602952800968, "text": "Thank you for sharing your experience. The best marketing we have is happy patients, like you, sharing their experience with others. We appreciate the referrals and will do our best to meet their diagnostic needs, too!"}, "gmap_id": "0x888cf29cf68a2b3b:0xf6ad5f2eeb6ffd62"}
{"user_id": "112643311615342573367", "name": "Dominique Stephens", "time": 1600309735619, "rating": 5.0, "text": "The friendliest staff. They are so helpful & welcoming. They made the whole process so easy. I will definitely request this business in the future!! I will recommend everyone I know to go here!!", "pics": null, "resp": {"time": 1602952826512, "text": "Thank you so much for sharing!"}, "gmap_id": "0x888cf29cf68a2b3b:0xf6ad5f2eeb6ffd62"}
{"user_id": "113746397677053562396", "name": "Felecia Brock", "time": 1620050462665, "rating": 4.0, "text": "It was nice and clean and the staff is very friendly", "pics": null, "resp": {"time": 1620056322601, "text": "Thank you for the review!"}, "gmap_id": "0x888cf29cf68a2b3b:0xf6ad5f2eeb6ffd62"}
{"user_id": "109011730445788693289", "name": "Charles May", "time": 1602985155056, "rating": 5.0, "text": "I was injured in the line of duty in 2014 and was basically disabled for years. I had several MRI’s on my right shoulder and knee at Bridgeway that resulted in surgeries. I continued to have issues with instability and falling. Dr Hoover recommended an MRI of my hip after explaining to him my symptoms. After getting approved by my workman’s comp, the MRI showed an old fracture in my hip that was previously missed before going to Bridgeway. I was finally able to get the treatment I needed and after years of pain and suffering, I am finally able to start the process of doing what I love. Serving the public! I can not recommend Bridgeway enough!", "pics": null, "resp": {"time": 1603043919662, "text": "Charles, thank you for sharing your experience. Most of all, we are glad Dr. Hoover could be part of the team that determined a successful treatment plan for you!"}, "gmap_id": "0x888cf29cf68a2b3b:0xf6ad5f2eeb6ffd62"}
{"user_id": "111607627011926013629", "name": "Joy Pass", "time": 1603527297638, "rating": 5.0, "text": "How a good first experience.  People were very nice.", "pics": null, "resp": {"time": 1603720835738, "text": "Thank you for sharing your experience with us!"}, "gmap_id": "0x888cf29cf68a2b3b:0xf6ad5f2eeb6ffd62"}
{"user_id": "100270999996761017417", "name": "Nonna Deb", "time": 1605317926406, "rating": 5.0, "text": "From the front desk to the techs ( Lindsey and Taylor) and my CT tech everyone was awesome!!! This is the Auburn office!!", "pics": null, "resp": {"time": 1605559671620, "text": "Thank you for sharing your experience!"}, "gmap_id": "0x888cf29cf68a2b3b:0xf6ad5f2eeb6ffd62"}
{"user_id": "116382766697259572011", "name": "Lyndal Curry", "time": 1579618186477, "rating": 5.0, "text": "I have had nothing but fantastic experiences at Bridgeway Diagnostics at  Auburn. The staff is always so friendly and courteous, I’m always taken right in at my scheduled time, and it’s so easy to get an appointment. All of my clinicians have been ultra professional! Recently, my husband needed to schedule a CT test. The other local facility could not get him in for 2 1/2 weeks. So, I called Bridgeway and they were able to get him right in the next day. That’s a big deal for me. You do have a choice now that Bridgeway is here!", "pics": null, "resp": {"time": 1602953084323, "text": "Thank you! We strive to meet our patients' needs as much as possible. In your case, it looks like we did. Thanks again for sharing!"}, "gmap_id": "0x888cf29cf68a2b3b:0xf6ad5f2eeb6ffd62"}
{"user_id": "115257694054542284029", "name": "Kendel Mitchell", "time": 1583434468197, "rating": 5.0, "text": "I had a great experience at this location. I came in with a last-minute referral from a local Urgent Care. They were able to get me in within 30 minutes for an ultrasound. The ultrasonographer was polite, accommodating, and easy to talk to. I had a great time. They were then able to have their doctor evaluate my images, contact my primary doctor, discuss the images with her, and get back to me within 15 minutes while I waited in the lobby. It was determined I would need an MRI for further diagnostics and they got me in last-minute (again) within 20 minutes. At this point, the ultrasonographer came out to the lobby and offered me a coffee for my wait. Between the friendliness, punctuality, and consideration, this place deserve nothing less than a 5-star rating. For extra information, the facility itself is clean, open, well-lit, and offers plenty of comfortable seating along with restrooms and access to a water-fountain. I'm considering injuring myself again just so I can come back and  have this experience a second time - but that hinges on how much my insurance is able to cover.", "pics": null, "resp": {"time": 1602952994379, "text": "Please do not hurt yourself again. Just stop by and we will be glad to see you mended and happy! All joking aside, we are grateful for you taking the time to share your experience."}, "gmap_id": "0x888cf29cf68a2b3b:0xf6ad5f2eeb6ffd62"}
{"user_id": "110047653919467076813", "name": "Rhonda West", "time": 1584149437140, "rating": 5.0, "text": "The staff was friendly, the process was quick and Dr. Hoover is professional.", "pics": null, "resp": {"time": 1602952884441, "text": "Thank you! We agree with your assessment of Dr. Hoover. He cares deeply about the practice and his patients!"}, "gmap_id": "0x888cf29cf68a2b3b:0xf6ad5f2eeb6ffd62"}
{"user_id": "102895812259322978966", "name": "Dakota Rehberg", "time": 1594066366948, "rating": 1.0, "text": "Very rude and disrespectful pure lies from everyone and they do not care about anyone all of the locations are the same be safe use someone else", "pics": null, "resp": null, "gmap_id": "0x888cf29cf68a2b3b:0xf6ad5f2eeb6ffd62"}
{"user_id": "112244274471834215738", "name": "LaSheena Fields", "time": 1554771964371, "rating": 1.0, "text": "Went for my 38 week ultrasound and left there with only a photo of my son’s hand. Will need to contact my insurance because I was charged a $40 copay at which my insurance covers. The imaging was absolutely horrible, I just pray my sons results are accurate.", "pics": null, "resp": {"time": 1583195878784, "text": "Hello LaSheena, I hope that everything is going well with you and your baby! It was great to speak with you so long ago about your review. As we discussed, it is often quite difficult to obtain great ultrasound pictures of a baby at 38 weeks. Sometimes the baby is faced head down and is not as \"cooperative\" for pictures as he is earlier on in a pregnancy. We also discussed that visualization is limited at this stage because the ratio of amniotic fluid to the amount of baby is small. Fluid assists the  ultrasound technologist to see the baby's body parts more clearly. The ratio is better earlier on in the pregnancy during the time when we typically do the full anatomy scan (18-22 weeks). Later in the pregnancy (38-42 weeks) the doctors are looking at fetal movement, heart rate, amniotic fluid amount, and fetal presentation to determine the safety of a vaginal delivery. Although great pictures are difficult to obtain at this stage, the information they need to assess those items can be obtained. Thanks again for allowing me to discuss this with you. We do love our patients and we want you to know we will always strive to give you the best care and the greatest level of satisfaction with our services."}, "gmap_id": "0x888cf29cf68a2b3b:0xf6ad5f2eeb6ffd62"}
{"user_id": "103781724787300584697", "name": "Misty Dyer", "time": 1526432766355, "rating": 5.0, "text": "From the front desk to Hailey the experience was wonderful. Dr Jason Hoover is amazing. Bridgeway is awesome.", "pics": null, "resp": {"time": 1533327254630, "text": "This is a long overdue thank you for your review Misty! We are so happy you had a great visit here.  We appreciate you!"}, "gmap_id": "0x888cf29cf68a2b3b:0xf6ad5f2eeb6ffd62"}
{"user_id": "110016863742927968655", "name": "Doreen Kostelac", "time": 1551903287696, "rating": 1.0, "text": "Can not even begin to tell you how dissappointed I am with my experience at the Auburn location.\n1)  The operator set up my appointment with their other location in error.\n2)  Both restrooms were not clean.  There was no paper towels in one and the other had an overflowing wastebasket.  I brought it to the receptionist's attention and nothing was done about it.\n3) They mandated that I pay my co-pay for an office visit.  I explained this isn't an office visit it is for  testing and I am not required to pay a co-pay, but they demanded it anyway.  I have received my explaination of benefits from my insurance and a co-pay was not due.  When I called they said they would send out the refund.  They showed a credit balance on my account but I never received a credit statement.  Hmmm.  (This review is 4 months post visit).\n4)  NOW THE BIGGEST PROBLEM....I previously had kidney cancer and have had to have follow up CT scans due to my condition.  The radiologist stated  it appears that my kidney cancer is not only back but he couldn't rule out that it had spread to my liver.  This news was very concerning as you would imagine.  When I had my follow up appointment with my Oncologist, he did not like the very brief unprofessional report and suggested that he have my ct scan reviewed by the radiology team at my hospital as a second opinion.  Come to find out, my cancer was not back nor had it spread to my liver.  The radiologist must have mistaken scar tissue from my previous procedures as cancer.  Needless to say.  The 3 weeks prior to the 2nd opinion on my CT scan was not pleasant as I was preparing for metastisized kidney cancer.\n\nPLEASE HEED THIS WARNING AND GO ELSEWHERE FOR YOU MEDICAL NEEDS!!!", "pics": null, "resp": null, "gmap_id": "0x888cf29cf68a2b3b:0xf6ad5f2eeb6ffd62"}
{"user_id": "113277335217647512367", "name": "Ryan McWhorter", "time": 1504545088544, "rating": 5.0, "text": "Haley is the best. You will be well taken care of.", "pics": null, "resp": {"time": 1504723133557, "text": "Thanks for your review Ryan!  Haley and the rest of us here at Bridgeway love our patients, and we are happy that it shows!"}, "gmap_id": "0x888cf29cf68a2b3b:0xf6ad5f2eeb6ffd62"}
{"user_id": "113976249400914599138", "name": "Jill Turner", "time": 1516291301366, "rating": 5.0, "text": "I had been to Bridgeway  Diagnostics  i Phenix City  Al.  In 2015 so when my Dr. Tried to send me to Auburn Diagnostics  I tpld him I am mot going ANY  where but to Ya'll he said I think they  are in Phenlx City,  Al. I told him my Daughter Victoria Elizabeth ( Tori Beth) Thomps ame to you last week and Loved it as much as I did when I wenr to Phenix City ! Please get some moe PR out there ,I promise I am doing my best  to let Eberyone know !  So Happy  Ya'll are here  and WELCOME   !  THANKS  A MILLION  ! JILL TURNER  PS the  YOUNG LADIES at the Front DESK  AND TABITHA  WERE EXCEPTIONALY  EXCELLENT  !", "pics": null, "resp": {"time": 1516312037593, "text": "So happy you came to us Jill!  Many people don't realize it but all you have to do is ask your physician to send you to Bridgeway in Phenix City or Auburn.  Both locations, as you know, are quite easy to access and we strive to make you as comfortable as possible during every visit.  Both you and your physician will be happy you requested us. We really appreciate you and we are so grateful for patients like you who do the best kind of advertising for us! By the way, if you or any of your family or friends are due for a mammogram, you can request Bridgeway for that too. We are the only provider in the Auburn/Opelika area to offer 3D breast tomography (lowest dose 3D mammogram), and also the only provider in the area to offer 3D Automated Breast Ultrasound (an additional screening tool for women with dense breast tissue). Both of these are available in Auburn and Phenix City. Most people (myself included) will tell you it is the most comfortable mammogram they have ever had! We can get prior exam results from any facility.  Thanks again for your review Jill!"}, "gmap_id": "0x888cf29cf68a2b3b:0xf6ad5f2eeb6ffd62"}
{"user_id": "102854227613860086353", "name": "Mike Brooks", "time": 1557093613584, "rating": 5.0, "text": "Bridgeway is great.", "pics": null, "resp": {"time": 1602953095359, "text": "We agree! Thanks for sharing!"}, "gmap_id": "0x888cf29cf68a2b3b:0xf6ad5f2eeb6ffd62"}
{"user_id": "110075922311451999121", "name": "Niconico nii", "time": 1622602774973, "rating": 1.0, "text": "Tried calling to set up a payment plan for a bill. Told employee I don’t have good service and asked if I could set it up over the phone.\n\nPerson proceeded to tell me to go online AFTER I told her that. 😤\nShe didn’t want to help me AT ALL.\n\nAll she wanted was a payment but didn’t want to do the extra leg work to actually help me.\nShe told me it would be $25.00 today and I could call back to pay again.\n\nWhen I tried to get her to do said payment plan, she really wasn’t trying to do anything with me. It seemed like she was confused and wanted the full balance to stay how it was.\n\nNever ever calling to set up another payment plan with them EVER again.", "pics": null, "resp": null, "gmap_id": "0x8888a80083156345:0x7f45affaafeb864f"}
{"user_id": "106699249189914046930", "name": "Cassie Thompson", "time": 1605715788926, "rating": 5.0, "text": "Several months ago I had to go for my yearly mammogram and the receptionist Hannah was a true divine. She was so kind and so caring. Her personality was amazing. Today 11/18/20 I had to go to get an ultrasound for DVT and my technician was Kylie and she was just amazing. She was very caring and encouraging. Thank you Radiology Clinic for two amazing employees.", "pics": null, "resp": null, "gmap_id": "0x8888a80083156345:0x7f45affaafeb864f"}
{"user_id": "114631145049184938732", "name": "eleanor blackburn", "time": 1617138955863, "rating": 1.0, "text": "I had an MRI appointment on Wed, March 24th at 9:30. When I came to check in, the receptionist was very rude saying, \"you're late\" and that the appt was at 9:00. I told her that I'm not late & that my appt was for 9:30. She had a very nasty attitude & kept telling me that it was at 9:00 & that I should reschedule for another day. I decided to wait because I wasn't going to reschedule when I wasn't late in the first place. An hour or so goes by, patients AFTER me  are being seen. Finally, someone comes and brings me to the back, I sat in a hallway a little while, the lady (I don't remember her name) was very nice to me and told me as soon as there was an available room, that I would be seen. She was told that I was late and that's why I was waiting for so long. I showed her my appointment paper, and in fact it said 9:30. She apologized. That rude receptionist never apologized.", "pics": null, "resp": null, "gmap_id": "0x8888a80083156345:0x7f45affaafeb864f"}
{"user_id": "103276109737115274230", "name": "PATRICIA BARR", "time": 1599765677318, "rating": 5.0, "text": "Everyone was very friendly and professional. The doctor performing my test was really nice and I felt safe in his hands. I had a gall bladder test which required an IV for a radioactive fluid. It took an hour and a half (it could take a much as 4 hours) and I slept through it. Didn't have to wait long got my appointment either. I've had other appointments there and had the same courteous treatment.", "pics": null, "resp": null, "gmap_id": "0x8888a80083156345:0x7f45affaafeb864f"}
{"user_id": "115364027387770278413", "name": "Shelley Wood", "time": 1603133824554, "rating": 5.0, "text": "Crystal in Medical Records is very polite and has the best customer service skills.   She went above and beyond to help.  I highly recommend The Radiology Clinic!", "pics": null, "resp": null, "gmap_id": "0x8888a80083156345:0x7f45affaafeb864f"}
{"user_id": "102929488959397966439", "name": "Lisa Savage", "time": 1598016096842, "rating": 5.0, "text": "I came for my first mammogram and was very anxious. Heather was awesome! She explained exactly how everything was going to go, and helped calm my nerves. It was not bad at all. We need more people like Heather in the world!! 😊", "pics": null, "resp": null, "gmap_id": "0x8888a80083156345:0x7f45affaafeb864f"}
{"user_id": "105857631309264071207", "name": "Theresa Johnson (Terri)", "time": 1618190946812, "rating": 5.0, "text": "Great people..", "pics": null, "resp": null, "gmap_id": "0x8888a80083156345:0x7f45affaafeb864f"}
{"user_id": "101224051979977044157", "name": "Natalie Strother", "time": 1594298883669, "rating": 1.0, "text": "Husband waited over a hour to get a X-RAY and when was asked what took so long the receptionists was very sarcastic. Never had this problem before!!!!", "pics": null, "resp": null, "gmap_id": "0x8888a80083156345:0x7f45affaafeb864f"}
{"user_id": "104115210583405993515", "name": "Jeff Colvin", "time": 1568243509046, "rating": 5.0, "text": "I was in and out in no time at all. Staff was friendly and welcoming.", "pics": null, "resp": null, "gmap_id": "0x8888a80083156345:0x7f45affaafeb864f"}
{"user_id": "104359177568285779829", "name": "Bridget Riley", "time": 1506525889160, "rating": 5.0, "text": "\"Everyone was very friendly, polite and professional. Everything was clearly explained and I felt reassured. The environment was very clean and presentable as well. I would recommend The Radiology Clinic.\"", "pics": null, "resp": null, "gmap_id": "0x8888a80083156345:0x7f45affaafeb864f"}
{"user_id": "110627446785398837441", "name": "Dan Birnstein", "time": 1603207633256, "rating": 5.0, "text": "They got me in, late afternoon with no appointment.\n(I was half an hour before closing time).\nWhen my X-ray were completed, they called my physician right away, again, around closing time!\nI wish everybody would be as courteous and professional!", "pics": null, "resp": null, "gmap_id": "0x8888a80083156345:0x7f45affaafeb864f"}
{"user_id": "114044683374805369374", "name": "Kat A", "time": 1562069310322, "rating": 5.0, "text": "I rarely give 5 but the staff was frkendly, clean, aost no wait.", "pics": null, "resp": null, "gmap_id": "0x8888a80083156345:0x7f45affaafeb864f"}
{"user_id": "108231960463446119234", "name": "Jeff Singer", "time": 1495639388507, "rating": 5.0, "text": "Excellent.  Friendly and efficient staff.  In and out very quickly.", "pics": null, "resp": null, "gmap_id": "0x8888a80083156345:0x7f45affaafeb864f"}
{"user_id": "102366114226571860283", "name": "Voodoo Actual", "time": 1498513515136, "rating": 5.0, "text": "Great staff! They are both caring and efficient.", "pics": null, "resp": null, "gmap_id": "0x8888a80083156345:0x7f45affaafeb864f"}
{"user_id": "117472264846449790586", "name": "Ella Hood", "time": 1493585869781, "rating": 5.0, "text": "It runs like a machine. Perfect in every way", "pics": null, "resp": null, "gmap_id": "0x8888a80083156345:0x7f45affaafeb864f"}
{"user_id": "116385531531207291766", "name": "Michael Clark", "time": 1524246261212, "rating": 5.0, "text": "Very nice and professional.", "pics": null, "resp": null, "gmap_id": "0x8888a80083156345:0x7f45affaafeb864f"}
{"user_id": "101321322966128198749", "name": "Aja Miller", "time": 1615402555802, "rating": 1.0, "text": "Unprofessional and unorganized. I came in for my appointment on March 9, and I was told that my appointment was scheduled for the next day. Which is ridiculous because I know I was told that my appointment was on March 9 because that’s my birthday. I come in the next day for my appointment, and I am told this time that my appointment was yesterday. The receptionist tells me, “Oh, she must have gotten you confused with someone else.” Like what? Save yourself the time and headache and go somewhere else because obviously they lack professionalism, organization, and communication skills.", "pics": null, "resp": {"time": 1615414735751, "text": "Thank you for your review. We'd like the chance to look into the situation you have described. Could you please reach out to us at 205-930-2333 (Mon-Fri 8 am-4:30 pm)? We look forward to hearing from you. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888919257e0ece15:0x7e15ea5f82861795"}
{"user_id": "103369028400349044646", "name": "Charmonika Smith", "time": 1618426197620, "rating": 1.0, "text": "The representative that answers the phone is very rude. I called over 5 times before getting an answer. The representative gave me  incorrect information, put me on hold for 15 minutes without returning to the phone after calling back she hung up in my face.", "pics": null, "resp": {"time": 1619636793551, "text": "We understand your frustration and would sincerely like to give this situation the time and attention you deserve. May we ask that you please call us at 205-930-2333 (Mon-Fri 8 am-4:30 pm) so that we can address your concerns? Thank you. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888919257e0ece15:0x7e15ea5f82861795"}
{"user_id": "117621979369825958523", "name": "Gabe Hayes", "time": 1605032490818, "rating": 1.0, "text": "The worst. Save yourself the time and go somewhere else. The asian Doctor is rude. He’s the main reason why it gets one star. If I could give him 0 starts I would.", "pics": null, "resp": {"time": 1605557422516, "text": "We try very hard to meet expectations and we regret that we have not done so in this case. If there is any additional feedback you would like to share with our team, feel free to reach out to us at 205-930-2333. -Ascension St. Vincent's Community Manager"}, "gmap_id": "0x888919257e0ece15:0x7e15ea5f82861795"}
{"user_id": "116932158475962315546", "name": "Becky White", "time": 1598413006840, "rating": 1.0, "text": "My husband called several times about coming in to review some requested medical information, was told 1 day prior he could come in and bring the  requested information.  He was assured he would be seen however when he got there was told he would have to have a complete physicial again  even though it had only been done 6 months earlier and only needed the requested paper work reviewed.No need for another full physicial so soon plus he would have to reschedule to be seen even though 1 day prior he was told he could be seen.  Extremely poor communications from the staff.  This cost him a day off work. Needless to say this is the last time he will ever go there.", "pics": null, "resp": {"time": 1598544790978, "text": "We understand your frustration and would sincerely like to give this situation the time and attention you deserve. May we ask that you please call us at 205-930-2333 (Mon-Fri 8 am-4:30 pm) so that we can address your concerns? Thank you. -St. Vincent's Health System Community Manager"}, "gmap_id": "0x888919257e0ece15:0x7e15ea5f82861795"}
{"user_id": "116451603041058035227", "name": "Jaime Garrett", "time": 1584454698963, "rating": 1.0, "text": "I went in for bloodwork required for my job, to get proof of immunization. While the front desk person was pleasant, as were the staff members I encountered, it took 2 different individuals, and numerous attempts to “find a vein”. I felt like a pincushion and looked like I had track marks when I left. I’m in the medical field, give blood regularly and know I have large, visible, good veins. This has been at least 3 weeks ago - my place of employment still has not received the paperwork needed for me to do my job, and I can’t reach anyone by telephone to follow up on my results.", "pics": null, "resp": null, "gmap_id": "0x888919257e0ece15:0x7e15ea5f82861795"}
{"user_id": "116794904349118509364", "name": "Nicki Conlon", "time": 1590780042884, "rating": 1.0, "text": "You need to look at the reviews before you ever go to this sorry excuse for a company! Completely miserable people working at this place and their intent is to project that on to anyone there! Called for a supervisor after the fact and they actually hung up on me and wouldn’t  answer my call! Save yourself and your company a miserable experience and go to a better company!!!l The manger of this place should actually be fired for allowing his or her employees to act in such an unprofessional manor!!!", "pics": null, "resp": null, "gmap_id": "0x888919257e0ece15:0x7e15ea5f82861795"}
{"user_id": "111352486342989578088", "name": "Chace Claborn", "time": 1589385470150, "rating": 1.0, "text": "Still waiting after two hours and I was the first person here. This place is terribly slow.", "pics": null, "resp": null, "gmap_id": "0x888919257e0ece15:0x7e15ea5f82861795"}
{"user_id": "113864551342093975578", "name": "R.e Mcknight", "time": 1549636520497, "rating": 5.0, "text": "Have been to this establishment many times over the. years. Great physician very competent. I would go as far as to say Dr. Micheal is a friend. I find it hilarious the negative comments posted here as for the staff I'd say average typical of a doctor's office I've never had a problem that would merit saying anything bad about the staff", "pics": null, "resp": {"time": 1549664485011, "text": "R.e Mcknight, thank you for sharing your observations with us. Feedback helps us know what we’re doing right or where we need to improve.  Social Media Community Manager HospitalReviews@Ascension.org"}, "gmap_id": "0x888919257e0ece15:0x7e15ea5f82861795"}
{"user_id": "101463994112912541940", "name": "Brandie Canaday", "time": 1509109539768, "rating": 3.0, "text": "The lady at the desk had a slight attitude however everyone in the back was professional and efficient. BUT if you ever need to call them for any reason be prepared to be treated poorly and probably not even answer the phone. Once you leave a message if you happen to have been a patient and not the company paying don't expect a timely response. Even after many attempts to call over the course of several days and a few messages left I didn't get a response for two weeks and that was only after an email I sent requesting the same info I had attempted to call about.", "pics": null, "resp": null, "gmap_id": "0x888919257e0ece15:0x7e15ea5f82861795"}
{"user_id": "114763997107301747830", "name": "Oliver C Jeffrey III", "time": 1570735097232, "rating": 1.0, "text": "The most unprofessional staff I've ever witness.  I'm sitting here listening to them talk about every person that comes in.  They act as if you are bothering them while they are on their personal phones at work.", "pics": null, "resp": {"time": 1570801566363, "text": "O. Curtis Jeffrey Iii, we'd like to look into this. Would it be possible for you to reach out to our patient representative at (205) 939-7264? Thank you! -St. Vincent's Health System Community Manager"}, "gmap_id": "0x888919257e0ece15:0x7e15ea5f82861795"}
{"user_id": "118434597182301143219", "name": "Jana Hamilton", "time": 1520609337892, "rating": 1.0, "text": "Dr. Michael Cloyd is the rudest doctor I have ever encountered. His horrible bedside manner is honestly astounding. I would recommended going anywhere else in the area rather than being his patient.", "pics": null, "resp": {"time": 1520635715253, "text": "Hi, Jana. I'm so sorry to hear about your experience. Thank you for letting us know. I have sent this information to our leadership team. Please send your contact information and any additional information to feedbackAL@ascension.org."}, "gmap_id": "0x888919257e0ece15:0x7e15ea5f82861795"}
{"user_id": "110090640454391413882", "name": "Tara Moore-Crumpton", "time": 1506029209763, "rating": 1.0, "text": "Rude incompetent and awful staff. Did not want to take the time to listen, and even had my company call to explain things to them, but they didn’t care, all they wanted was to do the easy way. Will not come back to this place unless I want to die.", "pics": null, "resp": null, "gmap_id": "0x888919257e0ece15:0x7e15ea5f82861795"}
{"user_id": "102914327895819196883", "name": "Steven Lord", "time": 1561381949245, "rating": 2.0, "text": "This place is horrible, long waits, people are becoming impatient. I have never waited this long for a drug test in 21 years of working. Be prepared to wait!", "pics": null, "resp": {"time": 1561470309833, "text": "Thank you for taking the time to leave your rating. We'd like to learn more about your experience. If you are interested, please call us (205) 939-7264 so that we can address your concerns. ."}, "gmap_id": "0x888919257e0ece15:0x7e15ea5f82861795"}
{"user_id": "109578793649298946003", "name": "Danielle LaBombarde", "time": 1548704082903, "rating": 1.0, "text": "Rude front desk staff! Still sitting in the waiting area after 2 hours! Several people have rescheduled appointments because they have been waiting so long. Should I have to come back, I would rather drive an hour out of my way to go somewhere else! Avoid coming here if possible!!!", "pics": null, "resp": {"time": 1548823382756, "text": "Hello - thanks for taking the time to leave your rating. We'd like to learn more about your experience. Please email us at HospitalReviews@Ascension.org with more details so that we can reach out to you directly."}, "gmap_id": "0x888919257e0ece15:0x7e15ea5f82861795"}
{"user_id": "112739102380536565774", "name": "Kim Cooper", "time": 1563808115590, "rating": 1.0, "text": "If could give -5 I would, and the receptionist so rude, wouldn't recommend this place at all.been here once a week 4 làst 4 weeks receptionist needs a lot of training in patient communication she is horrible.", "pics": null, "resp": {"time": 1563897725806, "text": "Kim Sherman, thank you for sending these details about your experience. We try very hard to meet expectations and we regret that we have not done so in this case. We will share your feedback with our leaders. Thank you."}, "gmap_id": "0x888919257e0ece15:0x7e15ea5f82861795"}
{"user_id": "116448814237599547287", "name": "Chauncey Sanders", "time": 1535478578326, "rating": 1.0, "text": "Terrible service, took 5 hours for me to have a drug testing and screening done, should’ve checked reviews beforehand.", "pics": null, "resp": null, "gmap_id": "0x888919257e0ece15:0x7e15ea5f82861795"}
{"user_id": "115295627927134389161", "name": "bentley Taylor", "time": 1530651246710, "rating": 1.0, "text": "Very rude, and unprofessional!!!", "pics": null, "resp": null, "gmap_id": "0x888919257e0ece15:0x7e15ea5f82861795"}
{"user_id": "102976362621219067300", "name": "Kristin Sims", "time": 1620149688510, "rating": 5.0, "text": "Today we had an appointment for an Ultrasound. Our ultrasound technician (Ashlynn) was amazing! She was kind, patient, friendly, professional, and efficient! We appreciated her hard work and kindness in getting the scan completed in a timely manner. She told us without asking what the next steps were and we will be glad to use this facility in the future! We also appreciated the sign on the door which read “Masks are welcome”. With this option people can make choices to wear them if they’d like but aren’t forced to mask. This is true freedom. I appreciate that!", "pics": null, "resp": {"time": 1620151120770, "text": "Kristin, thank you for the kind words. I will be sure that Ashlynn is told of your review. It is our pleasure to care for your needs and appreciate the opportunity to be of service to  you. We are happy that you chose us for your imaging procedure and hope that you are feeling better soon.\n\nRegards,\nBart Medlen\nOwner"}, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "109525164890678591853", "name": "Deborah Baker", "time": 1617841178058, "rating": 1.0, "text": "Terrible experience. Was referred here by UAB Oncologist. Had 5:30 appointment. At 7:25 still have not been seen!!!!", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "100825605495560702517", "name": "Tim Suttles", "time": 1614711030087, "rating": 1.0, "text": "Only 3 people in the office when I showed up for my xray....got out over 1.5 hours later! The xray f was fast. No one seems to care they make you wait with no update or reason.", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "114835485831896966460", "name": "Danny McMullins", "time": 1619816462853, "rating": 2.0, "text": "Had 330 mri appointment. It's 4 and I'm still sitting here. Not that busy but went to desk and was told they are running behind", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "105524263138121725149", "name": "M&M", "time": 1599844777551, "rating": 5.0, "text": "I came straight from my doctors office. The staff was amazing! They got me & out quickly. The tech was very nice. Would recommend.", "pics": null, "resp": {"time": 1599867458553, "text": "Thank you for the positive review. It is our pleasure to serve you and our community."}, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "109692486717096043649", "name": "Wendy McLellan", "time": 1600217397221, "rating": 1.0, "text": "This place is a hot mess. Didn’t tell me I needed to be fasting for my test until I called and asked because someoneI know told me I needed to fast for this test.  Then were over an hour behind schedule for my 7 o’clock test time.  Lied and told me that my appointment was really at 7:30.   Never called to let me know they were so far behind which would have been the professional thing to do.  I have to take meds for anxiety to get into the MRI tube and now they are wearing off because I had to wait so long.  This place sucks.  Will never come back.", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "109904392190103038153", "name": "Russell Pierce", "time": 1592230085655, "rating": 5.0, "text": "The lobby was open when I arrived at 6:48am.  I was able to fill out the relatively short patient information form and then waited about 10 min. to be seen.  I did not have an appointment.  The staff was courteous and fast.", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "100252732228887378951", "name": "Kimberly Nation Morton", "time": 1581098056685, "rating": 5.0, "text": "Me and my husband have both used them and very happy !\nBest MRI experience .. fast too !\nTheir staff is so friendly and very very caring !\nThey go out of their way for you in every way !!!\nAnd their radiologist are very good as well as their technicians , and the equipment is great to.\nSo nice to be greeted by smiling faces at the front desk and on the phone they were very accommodating even got us in a day earlier because of a cancellation!", "pics": null, "resp": {"time": 1581352869105, "text": "Kimberly,\n\nThank you for the kind words. We appreciate the opportunity to serve you. We realize that you have multiple facilities available to choose from and are very happy that you chose us. We want everyone that walks through our doors to feel comfortable in a sometimes uncomfortable situation. It is our pleasure to serve you and if you need imaging services in the future please consider us again.\n\nBart Medlen\n\nOwner"}, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "112979435535379308690", "name": "Tara Landrom", "time": 1579558123234, "rating": 1.0, "text": "Don't go here to get a mammogram. Incompetent fill-ins. Had an abnormal reading for the first time when they had a lady who clearly didn't know what she was doing. I've had 10 mammograms here and one person can ruin your day. I had to go to another facility to another one. Praise God it was negative. I will never go to this place again. Go somewhere else with updated equipment.", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "107736939214652522845", "name": "Shonna Davis", "time": 1579108585202, "rating": 1.0, "text": "We went to get a copy of an MRI yesterday to find they had closed at least 45 minutes early. I called a few hours before we left and was assured that I could come in person, before 7PM (the alleged closing time Monday through Friday). We drove for almost an hour and a half after work to get there before the next scheduled doctors appointment (in Birmingham). Will not use them again.", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "112896880909963403678", "name": "Leigh Cooper", "time": 1550686678588, "rating": 5.0, "text": "Awesome staff, thoroughly enjoyed our visit to this office. My daughter had to have ultrasound, wish I could remember our technicians name, she was great, very friendly and enjoyable! We had to come back the next day for a CT scan and Greg Nance was our technician and he was a pure joy. Daughter loved their conversation. Girls at front desk were great too, all around great experience!", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "117337554654179213796", "name": "Robert Kemper", "time": 1547847920281, "rating": 3.0, "text": "The quickest in-and-out for any CT scan I've had in a long time. Good place but be careful where you park. It's hard to back up on to a busy street.", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "115497417656439885628", "name": "Fidgets Sailing", "time": 1569284823847, "rating": 1.0, "text": "I'd give them negative stars if I could do so.  I have an incredible amount of pain - and live 40 min out from where this center is in Huntsville.  So my appt was made on a Thurs for a Monday at 6:30 pm.  I get there and get told their machine overheated that morning (first thing after a weekend???) then the receptionist tells me they tried to call me several times - no they didn't - they didn't even call one time.  So I waited 4 days, drive 40 min each way and deal with someone lying to me. I'll go to the imagine place on Franklin - they were professional (not rude nor lie) and their equipment works.", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "104535180196853562683", "name": "ni ki", "time": 1554544171696, "rating": 1.0, "text": "Was scheduled here for a MRI. The moment I walked in the front lobby was blown away how rude the receptionist by the name of Brooke was rude to the elderly woman that came in for questions. I refused to be serviced by any company who has staff that goes out of there way to be malice and unkind to their customers. Remember people kindness and love goes a long way. If you are in the position to serve people then do it to the best of your abilities. When you are easily frustrated and find yourself speaking rudely and rolling your eyes at the very people who help your business grow,  then do ALL of us a favor and FIND a NEW job! Unacceptable to treat people any kind of way!", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "110835021089551842111", "name": "Jana Terry", "time": 1572564575389, "rating": 1.0, "text": "My first experience with them was great.  I was in and out in a short amount of time--- no waiting at all.  The x-ray tech and the young lady who did the Doppler were very nice and both seemed very knowledgeable.  However my experience this week was horrible.  I notified them on Monday that I had just been told I needed an MRI. I  specifically requested they perform it because they were close to my office and I had a good experience the week earlier. I said I must get the MRI by midnight October 31 as my insurance changes.  I was told \"no problem\"  -lots of openings.  My physician faxed over the order and my physician had a confirmation that it was received.  I asked the imagine center if they would get a pre-certification for it and they said they would and that they would contact me to schedule. I heard nothing else on Monday. Nothing Tuesday.  Wednesday I called again.  They said they did not get the orders.  I called my physician again and they were re-sent.  My physicians office even the centered and verbally verified that they were received.  Still I heard nothing for the remainder of the day.  I found out later that they left a message on my home machine for me to call (never tried my cell --or my work number) .   I called again today and was told my orders were not specific enough and that a pre-certification was needed.   I attempted to tell them that I had asked that do it.  The office manager immediately came on the phone, was very rude and unprofessional. She preceded to tell me how I needed to call my physicians office and get them to call the center and get the specifics.  I re-enforced  kept saying that I really need to get this today.  Bottom line I did not get my MRI before my insurance changed.  A total lack of communication as one employee is leaving a message on my home phone to schedule and it will not be anything out of pocket while another employee is on the phone with me telling me it will be $1600 total.  They can't do the MRI today but would be happy to schedule me for another day at  $1600 out of pocket.   What would have been zero out of pocket for me will now be $1600.  Am I aggravated and disappointed? YES!  I called and asked that my orders be sent to me so \"maybe\" I could find an open all night MRI facility somewhere and get the MRI taken care of.  The office manager refused to fax the documents to me.  I was told that they could only fax them to another physician.\nThey were my records, a fax is HIPAA compliant but they still refused even after I offered to sign a release.  The office manager is incredibly rude and there does not seem to be communication from one employee to another.  I am very disappointed in them and will most likely never visit their facility again.", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "114405728520103274852", "name": "Karen Griffith", "time": 1493766009663, "rating": 5.0, "text": "I am so grateful to have found this place for an MRI of my knee.  I was treated with the utmost professionalism, respect, care and courtesy today by EVERY ONE I came in contact with from the front desk to the person who made my appointment yesterday (Christie). To the technician, Ben.  Unlike the first place (Bio Imaging) I was referred to yesterday by my doctor. It was like night and day in the treatment and professional care with Center for Imaging Excellence.  I will and would recommend them to ANYONE who wants to be treated with professionalism and excellent care!", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "101132674161576729932", "name": "Greg Hulgan", "time": 1560432017360, "rating": 1.0, "text": "don't use this place rude receptionist ,I was there 2 hours for a knee and hip mri old slow equipment,they only have 1 MRI machine so be prepared to wait,  TELL YOUR DR. to send you somewhere else", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "117530439054375282520", "name": "Kelly Haynes", "time": 1510677892895, "rating": 5.0, "text": "I went for two MRI's with contrast last night. They were open late enough so I didn't have to miss any work. The ladies at the front desk were very kind, prompt, and thorough. The tech assigned to me was very sweet and made me feel very comfortable during the procedure. She explained everything she was doing, each step of the way. They provided headphones during the test, since they're so loud. They had a private room for changing and leaving my valuables, which my tech locked once we went for testing. Will definitely go here for any future testing.", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "101132674161576729932", "name": "Greg Hulgan", "time": 1560432017360, "rating": 1.0, "text": "don't use this place rude receptionist ,I was there 2 hours for a knee and hip mri old slow equipment,they only have 1 MRI machine so be prepared to wait,  TELL YOUR DR. to send you somewhere else", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "102203118100619435738", "name": "Cindy Langford", "time": 1568732779993, "rating": 5.0, "text": "Was in there in May of 2019 for an MRI of my brain and eye orbits-had a very good experience with staff, the technician and scheduling", "pics": null, "resp": {"time": 1568734902302, "text": "Cindy, Thank you very much for your kind words and for trusting The Center of Imaging Excellence with your imaging needs. We value your business and are thankful that you had a good experience with us.\n\nRegards,\n\nBart Medlen\nOwner"}, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "106165999009303249338", "name": "Tiffany Jordan", "time": 1503429656613, "rating": 5.0, "text": "The manager is amazing! I was in extreme pain and she was able to fit me in the schedule earlier than my 5pm appointment. The staff was very friendly.", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "104598723464860896211", "name": "Jenny Geddie", "time": 1554919064980, "rating": 5.0, "text": "Very polite staff and competent .", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "109584108774783318435", "name": "Jon Bloomingburg", "time": 1488837344799, "rating": 5.0, "text": "i have had several scans done there and found them to be great. I am currently scheduling a MRI there now.", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "106077625132621386150", "name": "Barbara Moskow", "time": 1512677578592, "rating": 2.0, "text": "I have been here since 1pm for a 115 appt\nStill at 2:15 not seen for a 15 min scan\nStating I had another appt at 230. This is wrong.", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "112489658255163924384", "name": "Margaret H", "time": 1529693215668, "rating": 2.0, "text": "Don't switch appointment time if offered.", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "115764634037316605659", "name": "Dark Exotic", "time": 1522416782322, "rating": 1.0, "text": "The women who work there have a real bad attitude and are very rude", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "116071774745251546750", "name": "Heather Hanson", "time": 1553801945636, "rating": 1.0, "text": "rude and condescending staff!", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "115543939368999754503", "name": "charisa àt Hopewell Homestead", "time": 1522274891191, "rating": 1.0, "text": "Had to make a second unnecessary trip because the staff didn't do their job right the first time", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "102793879381636661444", "name": "Jacob", "time": 1472051894280, "rating": 1.0, "text": "Rude manager. Expensive.", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "107209862768406522478", "name": "Ann Myers", "time": 1623885754703, "rating": 5.0, "text": "Greg and Brittany were great!", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "102751931633215504979", "name": "Missy Powell", "time": 1597857418120, "rating": 5.0, "text": "Nice place with very fast, professional services. Hope they get enough referrals to stay in business in Prattville. Recommend you getting your Imaging services, including same day MRI, at this facility as you can usually choose where you want to go yourself! Utilize this place as we want to keep a place this nice in our \"Preferred Community\"!", "pics": null, "resp": null, "gmap_id": "0x888e8514b370d2ed:0x94881d76ccfb841c"}
{"user_id": "109864408456190779614", "name": "Jonathan Eric Headley", "time": 1560432909415, "rating": 5.0, "text": "Very nice facility. Easy to get to very nice and professional staff. Always easy to talk to and help in anyway possible. They try everyway to make you comfortable. I went in January 2018 for an MRI and I am about to have another one. I am requesting Sonos Imaging. They even have snacks and drinks for their patients. If I could give more stars I would.", "pics": null, "resp": null, "gmap_id": "0x888e8514b370d2ed:0x94881d76ccfb841c"}
{"user_id": "100539018064535778948", "name": "Leslie Pettway", "time": 1555542968592, "rating": 5.0, "text": "Really nice staff and the office and customer changing room was beautiful.", "pics": null, "resp": null, "gmap_id": "0x888e8514b370d2ed:0x94881d76ccfb841c"}
{"user_id": "102663347955159835345", "name": "Victor Parker", "time": 1621276978166, "rating": 4.0, "text": "It was ok. To me, the lady up front was the nicest of them all. Got my MRI done and they was helpful with that.", "pics": null, "resp": null, "gmap_id": "0x8892926221f7b011:0xc0c9aef80a85750f"}
{"user_id": "106199302979851569165", "name": "Sam Robinson", "time": 1602075578965, "rating": 1.0, "text": "This company is very unethical! I went and had an MRI done paid my deductible and went on my way. I get a collection letter from Holloway Credit Solutions stating I owed an additional $75.00 above what the insurance paid and if I did not pay the $75.00, they would report me to the credit bureau. This was the first correspondence I had from Dothan Diagnostic Imaging regarding this debt.  I paid the $75.00 and contacted Blue Cross to ask them why they did not pay the $75.00. Blue Cross informed me they paid the bill in full and that I should not have paid the $75.00. This is a gimmick for Dothan Diagnostic Imaging to get more money for their services. Once I paid my deductible that was all I owed when they accepted payment from Blue Cross the bill was satisfied. I wonder how many other people they've exstorted money out of!", "pics": null, "resp": null, "gmap_id": "0x8892926221f7b011:0xc0c9aef80a85750f"}
{"user_id": "107416359254565503670", "name": "Angel Gallegos", "time": 1600721980757, "rating": 1.0, "text": "I’m so disappointed I’m writing this review as I’m sitting here in their lobby, I was scheduled for my appointment last Friday, their machine was messed up so they called me 5 min before my appointment to cancel me, the lady said they would call later and reschedule for some day the following week, they never called I had to call the clinic to ask about it, the lady on the phone was rude, I finally was able to schedule my appointment, so I came in for my appointment which was a 3, the lady said be here 10 minutes before to fill out any forms, I showed up 20 min earlier, it is 3:50 and I’m just walking into my room for the appointment! So disappointed! The front desk guy was super nice, also the nurse who did my procedures was nice just the long time waiting.", "pics": null, "resp": null, "gmap_id": "0x8892926221f7b011:0xc0c9aef80a85750f"}
{"user_id": "116366016795854423548", "name": "Neil Martin", "time": 1593011602091, "rating": 1.0, "text": "I was scheduled for an MRI at my orthopedic's office and being that I had not met my deductible and I had an MRI at Dothan Diagnostic before I entered the information into my cost app and then followed up with a phone call to Dothan Diagnostic.  After speaking to a representative at Dothan Diagnostic I decided to have my doctor change the orders to this location.  Once I told the representative the price of the local orthopedic office she stated, \"that would be our price if you didn't have any insurance\"  Just so happens I got the bill and it was actually 30 to 40 percent more than I was quoted.  I called the office and the were no help.\n\nI am the Complex Manager one if not the largest private employer in Dothan and will not use Dothan Diagnostic for any reason privately or personally.  I am amazed at their dishonestly.", "pics": null, "resp": null, "gmap_id": "0x8892926221f7b011:0xc0c9aef80a85750f"}
{"user_id": "100202999694705221307", "name": "Danimaito ._.", "time": 1622240727124, "rating": 5.0, "text": "Y'all, when my women's doctor told me to go here for my mammogram, I thought she was maybe being a little extra, but I love my doctor and trust her, so I went along with it. Let me tell you, these people are awesome!  Every little detail, they treat you like an actual human being. You don't have to balance a clipboard on your lap to fill out paperwork, they have a table off to the side for that. You won't be changing into some flimsy paper gown, they have amazing, luxurious terry cloth lined robes. And, best of all, if you have time to wait (15 minutes) the doctor will read your mammogram right then and go over your results. Anything questionable, they can do additional testing right away. Such peace of mind, wonderful.", "pics": null, "resp": null, "gmap_id": "0x888923ac54102317:0xd019e3bd9643010f"}
{"user_id": "102610703432288959699", "name": "Suzanne McCreedy, Esq.", "time": 1610507271088, "rating": 5.0, "text": "This was my first visit to Camellia Women's Imaging. What a great experience! Everyone was so nice, efficient, and answered my questions. Dr. Tataria is wonderful. The best part? You have your results before you leave. No waiting until someone calls you several days later. Thank you to everyone there.", "pics": null, "resp": null, "gmap_id": "0x888923ac54102317:0xd019e3bd9643010f"}
{"user_id": "113684098623967949684", "name": "Mary Saidla", "time": 1590099413756, "rating": 5.0, "text": "This place is amazing. The staff is very friendly and makes you feel so at ease. We come from the western mountains of North Carolina annually to have my mammogram done. It is worth the long drive to be able to come, have a 3D mammogram and receive results while waiting for the radiologist to read the images. I was especially impressed with how seamless the process was even in the midst of Covid-19. They took extreme measures to protect their patients and themselves  I cannot say enough good things about this mammogram center. The bathrobes are an extra  cherry 🍒", "pics": null, "resp": null, "gmap_id": "0x888923ac54102317:0xd019e3bd9643010f"}
{"user_id": "103664735740742620571", "name": "Corey Hand", "time": 1593748765606, "rating": 5.0, "text": "I had to go in due to a lump. Not only was the staff super quick and efficient, they seemed like they genuinely cared about my emotional state. I never felt uncomfortable, which is really something when you’re getting a mammogram. They were also super serious about COVID-19 protection. I would definitely recommend this staff and doctor. Amazing.", "pics": null, "resp": null, "gmap_id": "0x888923ac54102317:0xd019e3bd9643010f"}
{"user_id": "109732033893818586289", "name": "Mary Chunn", "time": 1592320408861, "rating": 5.0, "text": "It had been several years since I had a mammogram and was a little nervous.  I found the doctor and the staff to be very professional and informative. They explained each step as it was taking place.  The entire process was much less stressful. I will definitely be returning.", "pics": null, "resp": null, "gmap_id": "0x888923ac54102317:0xd019e3bd9643010f"}
{"user_id": "112246996585195933630", "name": "amy ryan", "time": 1573665664836, "rating": 5.0, "text": "I’ve been to one of the local hospital places before and it was fine but no personal feel. Here you have warm friendly staff, warm environment and most remarkable a Dr that comes in and sits with you to go over your results.  I also had an MRI one year at the hospital and she called me personally with those results. I’ve never had such service. Will def keep going to her.", "pics": null, "resp": null, "gmap_id": "0x888923ac54102317:0xd019e3bd9643010f"}
{"user_id": "118251774696222573822", "name": "Nekita Clark", "time": 1584433251839, "rating": 5.0, "text": "I've had mammograms before and it was very clinical and cold. Going in, I was afraid and I was in good company. We women all know someone who has been diagnosed with breast cancer (some very recently), and going into these testings is never easy.\n\nI was greeted immediately with a kind front staff. Their energy was warm and affectionate. The nurses were pleasant. The process made me feel as if I'd joined a sisterhood. Dr. Tataria is warm and very informative. She made me feel active in my own healthcare and not bullied. I didn't feel like herded sheep or like another set of breast.\n\nLeaving the office, I felt empowered regarding my health and every woman needs that. And did I mention you get results right after imaging? Or the state of the art equipment with 3D modeling? Those are pros too!", "pics": null, "resp": null, "gmap_id": "0x888923ac54102317:0xd019e3bd9643010f"}
{"user_id": "108027728171660022315", "name": "Margaret Davis", "time": 1605565926291, "rating": 5.0, "text": "Great place, great people, great doctor!   Excellent!", "pics": null, "resp": null, "gmap_id": "0x888923ac54102317:0xd019e3bd9643010f"}
{"user_id": "115657831290682092542", "name": "Karen Kato", "time": 1565274470170, "rating": 5.0, "text": "Absolutely fabulous.  Quick they view everything there right away.  Was in and out in an hour!   Docs and technicians were excellent and very professional.   Loved it!", "pics": null, "resp": null, "gmap_id": "0x888923ac54102317:0xd019e3bd9643010f"}
{"user_id": "116013527295548623986", "name": "Michelle Morgan", "time": 1573600892865, "rating": 5.0, "text": "Absolutely the best experience I have ever had getting a mammogram! You meet with the radiologist the same day and the staff and facility were amazing. I will never go anywhere else.", "pics": null, "resp": null, "gmap_id": "0x888923ac54102317:0xd019e3bd9643010f"}
{"user_id": "118285891744634756690", "name": "Tabitha Corley", "time": 1569172217288, "rating": 5.0, "text": "Amazing! First time having a mammogram. They were friendly, professional and really put me at ease. Super quick too!", "pics": null, "resp": null, "gmap_id": "0x888923ac54102317:0xd019e3bd9643010f"}
{"user_id": "102655363715194683977", "name": "Mary Waldman", "time": 1560625655927, "rating": 5.0, "text": "I've been getting mammograms for many years at many facilities and Camellia is the best by far. The technicians are wonderful and work quickly. There are warm, fluffy robes to wear instead of those nasty hospital gowns. And having the results read and then explained to you afterwards is the cherry on the cake. Recommend very highly.", "pics": null, "resp": null, "gmap_id": "0x888923ac54102317:0xd019e3bd9643010f"}
{"user_id": "104925242323958316897", "name": "Christy Miller", "time": 1555067046443, "rating": 5.0, "text": "Had my first experience of getting a mammogram done here a year ago. I was extremely nervous to say the least. The entire staff made me feel so comfortable and the actual mammogram itself was not as I expected. I am scheduled for my annual exam today and am not at ALL nervous. WONDERFUL PLACE AND AMAZING STAFF!!!!", "pics": null, "resp": null, "gmap_id": "0x888923ac54102317:0xd019e3bd9643010f"}
{"user_id": "117985047716203730835", "name": "Elizabeth Morrow", "time": 1583274587899, "rating": 3.0, "text": "Although the staff and technician were very pleasant, the doctor was very condescending. I was told she would go over my risk factors however I got a lecture apparently because I didn’t have a wonderful experience at her facility.  My first mammogram and will be my last.", "pics": null, "resp": null, "gmap_id": "0x888923ac54102317:0xd019e3bd9643010f"}
{"user_id": "100207686507464431819", "name": "Leelee Gaissert", "time": 1572924592595, "rating": 5.0, "text": "Entire staff is friendly and compassionate.  In and out with same day results in about 1 hour.\nHighly recommend!!!!!", "pics": null, "resp": null, "gmap_id": "0x888923ac54102317:0xd019e3bd9643010f"}
{"user_id": "107631572583430928917", "name": "Alabama Jenny", "time": 1564579043450, "rating": 2.0, "text": "I felt welcome until the female Doc Tertaria came in. She was snippy, quick to cut me off when I spoke. I have had pain in one breast for a while. She couldn't see anything on imaging that I could feel. And while I am happy to know there was no mass, I felt as if she scolded me for feeling concerned. I won’t go back there. Ever!", "pics": null, "resp": {"time": 1564761661318, "text": "Dr. Tataria makes it her highest priority to ensure that all patients receive the highest level of personalized care and that patients feel cared for when receiving their same day results. If this did not happen, please call us at (205)-544-2828 so that we may address your concerns."}, "gmap_id": "0x888923ac54102317:0xd019e3bd9643010f"}
{"user_id": "117895509476195259052", "name": "Brittney M", "time": 1517069176884, "rating": 5.0, "text": "From start to finish Dr. Tataria and her staff made sure I was comfortable and knew exactly what being done. Follow up was great and I had my biopsy results in a very reasonable amount of time. The staff at the front desk welcomed me with smiles and the clinical staff had a very good bedside manner. I would definitely recommend Camellia Imaging.", "pics": null, "resp": null, "gmap_id": "0x888923ac54102317:0xd019e3bd9643010f"}
{"user_id": "105255526130010573840", "name": "Lindsay Harris", "time": 1516968091836, "rating": 5.0, "text": "As opposed to a sterile environment where you're treated like a number, this place is warm and welcoming and you feel like a VIP! Robes, snacks, drinks, and no wait. They also put me at ease for a very nerve racking appointment.  The doctor met me right at the beginning,  attended the ultrasound and delivered the results immediately.  State of the art equipment just like the hospitals. The staff was super friendly.  Can't say enough good things!", "pics": null, "resp": null, "gmap_id": "0x888923ac54102317:0xd019e3bd9643010f"}
{"user_id": "117555234278151705301", "name": "joe and kathi dunnam", "time": 1510959134610, "rating": 5.0, "text": "Love this place! Everyone is very friendly and professional. Michelle and Dr. Tataria had me in and out in no time with my results before walking out the door. And, they are equipped with the newest and best equipment available.", "pics": null, "resp": null, "gmap_id": "0x888923ac54102317:0xd019e3bd9643010f"}
{"user_id": "110472317276014598555", "name": "Alina Efremova", "time": 1502485092913, "rating": 5.0, "text": "Amazing Medical office . Nice , kind and very friendly stuff . Thank you so much for this unbelievable experience. I recommend everyone to come visit this facility . You guys are awesome!", "pics": null, "resp": {"time": 1502486616176, "text": "Thank you so much for your kind words Alina. We are so glad we were able to meet you!!"}, "gmap_id": "0x888923ac54102317:0xd019e3bd9643010f"}
{"user_id": "106200839604197640006", "name": "Trudy Johnson", "time": 1490821940038, "rating": 5.0, "text": "Caring, comprehensive patient care. So unique to have the doctor share your results with you before you leave. The best of the best!", "pics": null, "resp": null, "gmap_id": "0x888923ac54102317:0xd019e3bd9643010f"}
{"user_id": "108424968535953541625", "name": "April Rogers", "time": 1541176879826, "rating": 5.0, "text": "This was the BEST experience I have EVER had with a mammogram.  Fast, immediate results and super friendly staff.", "pics": null, "resp": null, "gmap_id": "0x888923ac54102317:0xd019e3bd9643010f"}
{"user_id": "106125140727384218686", "name": "tywanna maye", "time": 1541645766934, "rating": 5.0, "text": "They were very caring and professional. Dr Tataria(sp) covered everything and even scheduled my additional appointments", "pics": null, "resp": null, "gmap_id": "0x888923ac54102317:0xd019e3bd9643010f"}
{"user_id": "117614474175253263807", "name": "Beth E", "time": 1496334457079, "rating": 5.0, "text": "It was the best experience.  The staff is caring and easy to talk to.  Dr Tataria is Awesome and I love that I didn't have to wait for results!", "pics": null, "resp": {"time": 1501530485652, "text": "Thanks for coming to Camellia Imaging, Beth!"}, "gmap_id": "0x888923ac54102317:0xd019e3bd9643010f"}
{"user_id": "116471210849128433009", "name": "Ellen Mixon", "time": 1525362130511, "rating": 5.0, "text": "I have to recommend Camellia! I was treated like royalty. These sweet faces make the process so much better. Thank you, Carmellia!", "pics": null, "resp": null, "gmap_id": "0x888923ac54102317:0xd019e3bd9643010f"}
{"user_id": "100961343533983611811", "name": "Elizabeth Owings", "time": 1490210720068, "rating": 5.0, "text": "After an abnormal mammogram, Dr. Tataria performed an ultrasound.  It wasn't completely normal, so she recommended a biopsy.  Dr. Tataria and the staff made me and my husband feel completely comfortable, and the biopsy took only a few minutes.  She called me personally the next day to tell me it was totally benign!  I highly recommend Camellia Women's Imaging.", "pics": null, "resp": null, "gmap_id": "0x888923ac54102317:0xd019e3bd9643010f"}
{"user_id": "106147774407461685993", "name": "Jill Pate", "time": 1534335193575, "rating": 5.0, "text": "Good experience. You park right in front of the building and at the end of your appointment, meet with the physician on staff to review your results.  Professional and friendly staff.  Definitely recommend for 3D imaging mammogram.", "pics": null, "resp": null, "gmap_id": "0x888923ac54102317:0xd019e3bd9643010f"}
{"user_id": "112840348372505873852", "name": "Susan LeCroy", "time": 1507256179902, "rating": 5.0, "text": "I must admit that I have put off having a baseline mammogram for almost 10 years.  I finally broke down and decided I really needed to go.  I am so thrilled that I chose Camellia Women's Imaging. It was a great experience from the time I signed in until the time I left.  Everyone was so friendly and caring.  I love the fact that Dr. Tataria reads your mammogram while you are there so you don't have to wait and wonder for days on end.  She goes over everything and answers any questions that you might have.  If she feels you need additional testing it can be done the same day as well.  I also love the fact that I made my appointment and they handled the rest.  I gave them my MD's information and they called and got the prescription and handled everything with my insurance.  I am so glad I found this place and I have been telling everyone about Dr. Tataria and her wonderful staff!!", "pics": null, "resp": null, "gmap_id": "0x888923ac54102317:0xd019e3bd9643010f"}
{"user_id": "114203850605602278536", "name": "Rashida Reese", "time": 1496339716574, "rating": 5.0, "text": "1st Mammogram with much anxiety. The entire staff eased my worry and was very thorough during my exam. Highly recommended.", "pics": null, "resp": {"time": 1501530456489, "text": "We are glad we were able to help ease your anxiety!"}, "gmap_id": "0x888923ac54102317:0xd019e3bd9643010f"}
{"user_id": "107580260087256843844", "name": "S. A.M.", "time": 1516232622971, "rating": 5.0, "text": "Mom and I had heard, through the grapevine, about Dr. Monika Tataria and her lovely establishment. Sadly, even though they had great things to say about Dr. M and her outstanding team, I simply didn’t feel like they were as gung-ho about how amazing the experience actually is......hence, the reason for my review of Camellia Women’s Imaging on Valleydale Road, in Hoover.\nBefore we had even arrived, as we made our appt. over the phone, the gals at the front desk, sent me over an email while we were on the phone in order for them to get my digital signature, so that they could have all of my images and reports, transferred digitally from Brookwood Hospital, which we also have never had issues with.\nThat was done instantly, and that was that.\n\nMom needed a diagnostic appt. due to the fact that they had seen something at Brookwood and wanted to do further imaging/ultrasounding. They didn’t have an immediate appointment, and I was already coming in to Camellia, so the team at CWI  got mom in, immediately, with me. Dr. M even sent somebody from her office over to Brookwood the morning of mom’s appt, because it was with such short notice, that we didn’t have time to compile everything. AND this all before we even walked in the front door!\nDon’t let the exterior of the building fool you. Once you step into Camellia, you’ll feel so welcome and at ease, that you’ll have to keep reminding yourself that you’re there for imaging and not at the spa! Ha!\nAt the onset of our appt. BEFORE imaging, we were offered a beverage of our choice and we then sat down with Dr. M so that she could listen to our concerns. Such a pleasure to have a professional who is genuinely interested in us and our health. After Dr. M took all of the time necessary, we were then shown back to the dressing area where we were given the most luxurious and softest robes we’d ever had on! Ritz-Carlton and Four Seasons have nothing on these robes......no paper towel, opening at the back, degrading piece of paper around CWI.\nOnce changed, one by one, we were escorted to our imaging and ultrasounding.........ultrasounding performed by Dr. M, herself. Thorough, patient, kind and caring. Yes, ladies.....I’m talking about mammograms, here.....ha!\nListen ladies, we’ve been told that all mammograms are the same....well, they had been, until CWI came on the scene. This is not your same, run of the mill experience.\nAfter imaging is finished, Dr. M then met with us, AGAIN......To go over her findings and any other concerns and questions that we may have had. Not to divulge private info, but mom’s mammo wasn’t 100%, but nothing dangerous. You would have thought that mom was Dr. M’s mom. She really handled her with extra TLC and mom was almost crying with relief after all was said and done. Not to say that we all don’t get the same enhanced and personalized attention, but mom’s older and Dr. M really knew exactly how to care for each of us as individuals.\nA Forward-Thinking professional, such as Dr. M and her team players, make this world a better place. Mom and I are forever thankful, as our those who loves us, and is it crazy to say that we’re looking forward to our next appt??? Ha!!! Let’s put it this way........never again will we miss our appt’s, or make excuses for rescheduling or whatever. Every single woman  (and man) who wants to be treated with kindness and dignity, MUST only ever use Dr. Monika Tataria and her lovely, state of the art 3D imaging center. Her team supports her wholeheartedly, and they run a well oiled machine.\nThank you Dr. M......I sure hope our words have expressed how grateful we are for kind and caring professionals such as yourself. 😃", "pics": null, "resp": null, "gmap_id": "0x888923ac54102317:0xd019e3bd9643010f"}
{"user_id": "101083218619442845548", "name": "Delisa “Lisa” Chasteen", "time": 1534369873834, "rating": 5.0, "text": "Love this place! Nice, friendly and very thorough!!!", "pics": null, "resp": null, "gmap_id": "0x888923ac54102317:0xd019e3bd9643010f"}
{"user_id": "105813093649577603021", "name": "Sandra Lewis", "time": 1524234500286, "rating": 5.0, "text": "Everyone was very nice", "pics": null, "resp": null, "gmap_id": "0x888923ac54102317:0xd019e3bd9643010f"}
{"user_id": "110448456525733808901", "name": "MaMaG", "time": 1499439817412, "rating": 5.0, "text": "The best place ever handsdown!!!!💜💜💜💜", "pics": null, "resp": {"time": 1501530372914, "text": "Thank you for coming to Camellia Imaging!!"}, "gmap_id": "0x888923ac54102317:0xd019e3bd9643010f"}
