{"user_id": "106481287006020363431", "name": "Angie Judy", "time": 1608735550500, "rating": 3.0, "text": "Monique is the worst customer service representative i have ever spoken with, she says I'm glad I was able to assist you.  She did nothing, would not even let me talk, cut me off, was not helpful in placing an order. The driver TC in my area was exceptionally great service.  I wanted to give 1 star overall but TC deserves recognition (5star service) as well as nurses and physical therapy folks BUT Monique 0stars. The company needs to evaluate their office staff to get better ratings!!!", "pics": null, "resp": null, "gmap_id": "0x888e8fb7b36e8f7f:0x6f44d829e4ce8cd5"}
{"user_id": "102274253839485151595", "name": "Marche Gayle Cotney", "time": 1598042676219, "rating": 5.0, "text": "I have been a customer with Lincare for over a year I have nothing but praise for them the staff the equipment delivery the equipment delivery man they are all so nice and respectful to me and if i need a prescription for anything they get right on it even the people i talk to on the phone I recommend them to everyone I know Thanks you all for great service", "pics": null, "resp": null, "gmap_id": "0x888e8fb7b36e8f7f:0x6f44d829e4ce8cd5"}
{"user_id": "115883110347433953271", "name": "Drew & Alexis Dolan", "time": 1607390309253, "rating": 5.0, "text": "Very sweet people!", "pics": null, "resp": null, "gmap_id": "0x888e8fb7b36e8f7f:0x6f44d829e4ce8cd5"}
{"user_id": "114431608777161288508", "name": "Ashly Barlow", "time": 1580827850798, "rating": 5.0, "text": "The all new staff is fabulous! Very caring and goes out of their way for patients.", "pics": null, "resp": null, "gmap_id": "0x888e8fb7b36e8f7f:0x6f44d829e4ce8cd5"}
{"user_id": "102791219103777089384", "name": "Kay Mata", "time": 1554829370102, "rating": 1.0, "text": "Not a fan. I had an allergy to the mask I was given and was told they would order me another one. Four weeks later I had still not heard anything after calling multiple time. I finally had to go to Precision CPAP (they were amazing, and helpful), and had to buy another mask. Lincare still has not returned my calls regarding the mask and it has been over two months.", "pics": null, "resp": null, "gmap_id": "0x888e8fb7b36e8f7f:0x6f44d829e4ce8cd5"}
{"user_id": "115203366146139942628", "name": "Kris Conner", "time": 1549918219738, "rating": 1.0, "text": "Avoid dealing with this company AT ALL COSTS!  I would have given them zero stars if that was an option.  Lincare is still billing Medicare 7 months after we discontinued service with them.  They are still billing Medicare and harassing our family for payment 5 months after my mother DIED.  SHE DIED AND THEY ARE STILL BILLING MEDICARE and US!  We have spoken to numerous people in numerous Lincare locations, centers, billing offices, etc. and cannot get this resolved.  We have reported them for Medicare fraud and reported them to the Better Business Bureau.", "pics": null, "resp": null, "gmap_id": "0x888e8fb7b36e8f7f:0x6f44d829e4ce8cd5"}
{"user_id": "101313053968099220859", "name": "Felicia O.", "time": 1582637743364, "rating": 1.0, "text": "I was told that someone would call me to order parts as needed. It had been a year and no call. I called last week and was told I would get replacement parts. Nothing! I found out they were charging my insurance company for a year of equipment replacement parts that I’ve been buying off of Amazon. I’m reaching out to a lawyer and my insurance company.", "pics": null, "resp": null, "gmap_id": "0x888e8fb7b36e8f7f:0x6f44d829e4ce8cd5"}
{"user_id": "106839158471980603724", "name": "Mary Fortenberry", "time": 1562784479212, "rating": 1.0, "text": "For 3 weeks I have contacted this office a total of 5 times to come pick up my oxygen equipment that I no longer use. I have been promised repeatedly that they would take care of this. In the meantime I am being charged for  equipment rental that my dr has discontinued. I cannot recommend this company at all. Very frustrating.", "pics": null, "resp": null, "gmap_id": "0x888e8fb7b36e8f7f:0x6f44d829e4ce8cd5"}
{"user_id": "105808926920642197162", "name": "Kim Owens", "time": 1502742162825, "rating": 1.0, "text": "I truly can not even give a half a star for this company. And the only reason why I did because it would not let me post this comment..They do not care about your family members at all. They do not know what they are doing.", "pics": null, "resp": null, "gmap_id": "0x888e8fb7b36e8f7f:0x6f44d829e4ce8cd5"}
{"user_id": "115942410449226602145", "name": "Jenn Lavanish", "time": 1516742236415, "rating": 1.0, "text": "This company has the worst billing department I have ever encountered. Charging for equipment we never received and despite having our insurance they have never filed regarding bills from over 6 months ago.  Local office and billing office give us the run around and do not communicate between systems.  If we were not desperate for oxygen for my husband's medical health we would never use Lincare, and because of this I doubt we will patron them ever again.", "pics": null, "resp": null, "gmap_id": "0x888e8fb7b36e8f7f:0x6f44d829e4ce8cd5"}
{"user_id": "102753358113379978230", "name": "Gene Smith", "time": 1529372483822, "rating": 1.0, "text": "Avoid this company at all costs. Equipment ordered May 3, 2018, insurance approved. It is now June 17, 2018, no equipment, no return calls. Nothing. Truly a sorry excuse for a business. I hope they totally fail and go belly up!", "pics": null, "resp": null, "gmap_id": "0x888e8fb7b36e8f7f:0x6f44d829e4ce8cd5"}
{"user_id": "102198300706397409010", "name": "Tiffany Easterling", "time": 1547132327608, "rating": 1.0, "text": "I would hate to know I had to depend on these people!!!!  Always an excuse, rude, and not dependable!!!!!\nI really don’t have the words to describe how awful dealing with them has been!!!!", "pics": null, "resp": null, "gmap_id": "0x888e8fb7b36e8f7f:0x6f44d829e4ce8cd5"}
{"user_id": "108699333513666355151", "name": "Del Chick", "time": 1527623641671, "rating": 1.0, "text": "I agree with every single comment here! No need for me to add anything, terrible customer service.", "pics": null, "resp": null, "gmap_id": "0x888e8fb7b36e8f7f:0x6f44d829e4ce8cd5"}
{"user_id": "104413607461902032329", "name": "Ivy Abrans", "time": 1492697800472, "rating": 1.0, "text": "Even if you have a big home oxygen tank that cost way to much these people will not work with you to go out of town. Just need a smaller due to a death in family.", "pics": null, "resp": null, "gmap_id": "0x888e8fb7b36e8f7f:0x6f44d829e4ce8cd5"}
{"user_id": "106163523132077958924", "name": "Carol Ford", "time": 1514990996851, "rating": 1.0, "text": "They do not keep up with your equipment.  I left and they will no come get the machine.  They are still trying to charge me a monthly fee.  Awful service.", "pics": null, "resp": null, "gmap_id": "0x888e8fb7b36e8f7f:0x6f44d829e4ce8cd5"}
{"user_id": "112501841386294085491", "name": "chris taylor", "time": 1529956419314, "rating": 1.0, "text": "Rude customer service!!", "pics": null, "resp": null, "gmap_id": "0x888e8fb7b36e8f7f:0x6f44d829e4ce8cd5"}
{"user_id": "115115117289425882478", "name": "Gail Littrek", "time": 1509223754413, "rating": 1.0, "text": "They picked up the equipment in early 2016 but keep charging me like I have their very expensive concentrator.  They recently got paid $400.00 for one month by my insurance company but I called and that was quickly reversed. I don't know how to get them to stop the harassing bills for something I don't owe. Be warned - get a receipt if they pick something up. Don't be fooled by their cordial greetings.", "pics": null, "resp": null, "gmap_id": "0x888c2be5a398eb4f:0x8c8b02365558e739"}
{"user_id": "102753358113379978230", "name": "Gene Smith", "time": 1529371972937, "rating": 1.0, "text": "Equipment ordered and Insurance approved on May 3, 2018 - still waiting as of June 17, 2018. Do not use them. Will not return calls. No help. Avoid at all costs.", "pics": null, "resp": null, "gmap_id": "0x888c2be5a398eb4f:0x8c8b02365558e739"}
{"user_id": "108699333513666355151", "name": "Del Chick", "time": 1537820657232, "rating": 1.0, "text": "WORST Oxygen co. to deal with !  Good luck !!!  None of them seem to know what they’re doing over there! And you will most definitely get the runaround no matter if you call the local office or the billing department! They could care less about their stupid jobs!", "pics": null, "resp": null, "gmap_id": "0x888c2be5a398eb4f:0x8c8b02365558e739"}
{"user_id": "104210351373413402765", "name": "Stephanie Scherbel", "time": 1625695840129, "rating": 1.0, "text": "Frustration after frustration after frustration.  I don't leave reviews, but this company has wasted so much of my time.  They can't figure out how to bill things correctly and diabetic supplies never arriving on time.  Switched to a different company a few months ago, still trying to deal with this billing nightmare.  Hold times on the phone are always over an hour, and can't seem to get problems resolved, every customer service person says something completely different than the last.  Avoid if possible", "pics": null, "resp": {"time": 1625752007834, "text": "Hi Stephanie, we are very sorry to hear about your experience. In order to resolve the issue and to protect your private health information, please e-mail us at comments@byramhealthcare.com with your name, address and account number. Someone from our team will contact you to assist in a resolution."}, "gmap_id": "0x88891ec6c25ad78b:0x85fc06ad89b00c33"}
{"user_id": "114235895841615307996", "name": "Mary Bland", "time": 1624917526998, "rating": 1.0, "text": "Do not trust your Diabetic care to Byram Healthcare! My experience with Byram Healthcare has been very frustrating. I have not been able to depend on them to send my Dexcom g6 supplies consistently. I am a type 1 Diabetic with significant & frequent hypoglycemic episodes. I depend on my Dexcom g6 to keep my blood sugar stable. When Dexcom could no longer provide supplies for Medicare patients, I changed to Byram Healthcare on 8/2020. They have been late shipping my supplies several times resulting in me being without sensors for days & sometimes weeks. When I call to follow up on an order, I am told my doctor is late sending chart notes/Rx or Medicare has not paid. I requested Byram to give me a heads up when my order is delayed so I can intervene as appropriate. My last straw was with the last order that was confirmed by Byrham was 5/26/2021.  As of today, June 28/2021, the order status still says “order in progress”. So, over the last several weeks when I called Byram to find out why my order is delayed, depending on who I talked to, I got the following reasons:\n•\tNo chart notes (I called my doctor’s offices & they indicated they sent the requested documents)\n•\tByram admitted they got chart notes, but it was signed by the AARP not the doctor (I alternate between the physician & the AARP). Byram said they would clear up the confusion & call me back by COB. Never got a call back.\n•\tNext time I called they told me they were under Medicare audit & someone would call me back. They never called me back.\n•\tNext person at Byram I spoke to said Medicare has not paid since 2/2021. I called Medicare & they informed me that Byram has not filed a claim since 2/2021. I called Byram & told them Medicare does not have any open claims & my online Byram billing account says that my balance is $0.00. Byram said they would investigate & call me back. As of today, not 1 call back. I am done!\nI have been using Dexcom glucose monitoring supplies since 3/2019. When I was receiving my supplies from Dexcom, I never had any issues. They were always professional & most importantly on time with my supplies. I will call Dexcom & ask for a recommendation for a new Dexcom g6 supplier.", "pics": null, "resp": {"time": 1624965670807, "text": "Hi Mary, we are very sorry to hear about your experience. In order to resolve the issue and to protect your private health information, please e-mail us at comments@byramhealthcare.com with your name, address and account number. Someone from our team will contact you to assist in a resolution."}, "gmap_id": "0x88891ec6c25ad78b:0x85fc06ad89b00c33"}
{"user_id": "113927975945763344623", "name": "s franks", "time": 1577739553083, "rating": 1.0, "text": "took off ez refill but Byram continued to send and bill for  supplies we no longer needed....after long conversation explaining the error on their part the  supervisor refused to accept responsibility....do not use Byram Healthcare !\nAuto ship whether you want it or not !", "pics": null, "resp": null, "gmap_id": "0x88891ec6c25ad78b:0x85fc06ad89b00c33"}
{"user_id": "107797910402826000208", "name": "Janet Hadley", "time": 1615859709048, "rating": 5.0, "text": "Great customer service! They were so helpful and went out of their way to get my grandparents everything they needed when they were sick. They went above and beyond to make sure everything was taken care of. I highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x888bfd7d61c4f013:0x3de3eb66498fe339"}
{"user_id": "113235348262263907554", "name": "Falanda Huntley Bright", "time": 1615826494204, "rating": 1.0, "text": "This company doesn't even deserve one star. I'm a double amputee and because my wheelchair was 5years old, they wouldn't even try to order a seat replacement for it. I feel like I was lied to because I went right in same town and had one ordered! I personally feel like it was because of my race! If you have to get medical equipment do not use them if you are an African-American! They will do anything to get more money for new equipment instead of assisting in getting your old one fixed.", "pics": null, "resp": null, "gmap_id": "0x888bfd7d61c4f013:0x3de3eb66498fe339"}
{"user_id": "111213227075488154616", "name": "Kelli Mask", "time": 1601861508035, "rating": 5.0, "text": "The staff is wonderful and very helpful. They always make you feel welcome. I recommend them to everyone.", "pics": null, "resp": null, "gmap_id": "0x888bfd7d61c4f013:0x3de3eb66498fe339"}
{"user_id": "103448672138763008510", "name": "Melvin Miller", "time": 1603133689579, "rating": 5.0, "text": "Great service and always greeted with a smile and informative answers.", "pics": null, "resp": null, "gmap_id": "0x888bfd7d61c4f013:0x3de3eb66498fe339"}
{"user_id": "112258964478821765835", "name": "Mel Palmer", "time": 1598279996302, "rating": 5.0, "text": "Great office to work with for all of your Respiratory and Home Medical Equipment needs.", "pics": null, "resp": null, "gmap_id": "0x888bfd7d61c4f013:0x3de3eb66498fe339"}
{"user_id": "100390013968723929433", "name": "maranda Brice", "time": 1563289530334, "rating": 4.0, "text": "Very understanding and very helpful.", "pics": null, "resp": null, "gmap_id": "0x888bfd7d61c4f013:0x3de3eb66498fe339"}
{"user_id": "107782729610310629897", "name": "Richard Morgan", "time": 1577834998237, "rating": 4.0, "text": "Had the machine I needed!", "pics": null, "resp": null, "gmap_id": "0x888bfd7d61c4f013:0x3de3eb66498fe339"}
{"user_id": "109488722522593933309", "name": "Ebony Snodgress", "time": 1617742643808, "rating": 1.0, "text": "Should do better with customers and should not have to have a order for a nebulizer that the child has used all his life.", "pics": null, "resp": {"time": 1617804043355, "text": "Ma'am I'm sorry for your frustration but insurance sets the guidelines for being able to put out equipment. We will be glad to answer any questions you have about the nebulizer. Please understand that we at Downey Medical do not make the rules for putting out equipment insurance does."}, "gmap_id": "0x888bb3c0c3f43e15:0xe73cfaddaaea6060"}
{"user_id": "109821840205617824562", "name": "Mark Black", "time": 1612879013996, "rating": 5.0, "text": "Thinks for the help setting up my new cpap I got the Resmed cpap and very happy  it's the right sides for me we like to go camping in our camper and the sides is wright for us so thinks again", "pics": null, "resp": {"time": 1612880907626, "text": "Mark thank you for your kind words I means a lot to us. If you have any problems in the future don't hesitate to give us a call."}, "gmap_id": "0x888bb3c0c3f43e15:0xe73cfaddaaea6060"}
{"user_id": "107066207271167695747", "name": "DK Bright", "time": 1612018813644, "rating": 5.0, "text": "They took great care of my dad right up to the end.  Oxygen, walkers, wheelchairs and beds they did it all.", "pics": null, "resp": {"time": 1612020492925, "text": "Thank you for review! Sorry for your Loss you and your family is in our prayers."}, "gmap_id": "0x888bb3c0c3f43e15:0xe73cfaddaaea6060"}
{"user_id": "103700951050640023268", "name": "Barry Pitts", "time": 1605804461955, "rating": 1.0, "text": "Terrible customer service. They don’t follow up on anything. I have to continuously call them to get them act on anything. Will be looking elsewhere.", "pics": null, "resp": {"time": 1612880978734, "text": "Barry I just saw your post sorry you had trouble. Can you please tell what you were trying to get done?"}, "gmap_id": "0x888bb3c0c3f43e15:0xe73cfaddaaea6060"}
{"user_id": "101262627851525715229", "name": "Jackie Murry", "time": 1569023691609, "rating": 1.0, "text": "Won’t ever use ever again.  Repeatedly over the years, it has been a struggle to get good service.  Finally had enough.  In this day and time, you can get what you need without the personal hassle and disrespect.  Kindness and courtesy goes a long way.", "pics": null, "resp": {"time": 1570216439415, "text": "So sorry you had an issue when you came into our store. If you don't mind would you please let me know what happened when you came in? We've been in business for 50 years and we take great pride in providing good customer service."}, "gmap_id": "0x888bb3c0c3f43e15:0xe73cfaddaaea6060"}
{"user_id": "106628262851337596862", "name": "APRIL WILLIAMSON", "time": 1503781233702, "rating": 5.0, "text": "Friendly atmosphere!  The owner makes a point to say hello and to welcome all his customers.  He made the best impression!", "pics": null, "resp": null, "gmap_id": "0x888bb3c0c3f43e15:0xe73cfaddaaea6060"}
{"user_id": "117790821696013426653", "name": "T mo", "time": 1585390315327, "rating": 1.0, "text": "Just sad to see Downey's sells c-pap cartridge filters for up to 8 times the retail price on line.", "pics": null, "resp": {"time": 1604345465378, "text": "I'm sorry to see you say that. We don't sell anything in our store for 8 times the retail value. We sell the Soclean filter for $32.00 the highest its been was $49.95. As you know what we pay for the equipment dictates what we have to sell it for."}, "gmap_id": "0x888bb3c0c3f43e15:0xe73cfaddaaea6060"}
{"user_id": "116082540445931671520", "name": "Darrell Bradshaw", "time": 1547050290364, "rating": 5.0, "text": "Amazing Staff", "pics": null, "resp": null, "gmap_id": "0x888bb3c0c3f43e15:0xe73cfaddaaea6060"}
{"user_id": "106747464874174166333", "name": "D F", "time": 1589310809211, "rating": 5.0, "text": "Very Helpful and Polite", "pics": null, "resp": null, "gmap_id": "0x888923a4b397a51d:0xced7a03d3a1e3b80"}
{"user_id": "114809731111797588596", "name": "Nicole Smith", "time": 1621622069597, "rating": 1.0, "text": "If you care about your health and/or the health of your family, avoid this business. Tina loves to yell and belittle people who are simply needing information. Crystal was gossiping about my family one day and tried to deny it. This facility said my family member did not quality for a device they needed, and when we switched providers, they did indeed qualify for what they needed. The employees simply wouldn't take the time to look. We were always treated as if obtaining supplies was a hassle, and education on how to use something had to be begged for. In fact, Tina let out a frustrated sigh when I asked for help one day. This business also refuses to service equipment, even though Medicare policy states that equipment should be serviced every 6 months. This is a pitiful excuse for a business, and Tina, especially, treated my entire family like garbage. I have never visited a facility where its employees act as if they have a vendetta against you. I would get physically sick having to call or visit this place.", "pics": null, "resp": {"time": 1621971157569, "text": "Nicole, we are sorry that we were unable to help your family member.  Our manager Ken has tried several times to reach out to you to discuss the situation between your family member and the facility but was unable to reach you.  We invite you to call in to our Homewood location at your convenience to discuss further, (402) 281-4404.  Thank you"}, "gmap_id": "0x888860c430353c25:0x99202ae2db955b2c"}
{"user_id": "109351548809205817584", "name": "Carolynn Black", "time": 1605789430037, "rating": 5.0, "text": "Crystal was nice and helpful to me! I was having trouble with my cpap mask and needed some liners. Not only was I due for all new supplies (covered 100% by my insurance) but she mailed my liners to me and they were $10 cheaper than getting them online. I received my liners the very next day. I am very impressed with the customer care I received at Total Respiratory.", "pics": null, "resp": null, "gmap_id": "0x888860c430353c25:0x99202ae2db955b2c"}
{"user_id": "114675847954331926494", "name": "tyler johnson", "time": 1602537539416, "rating": 5.0, "text": "Crystal was very friendly and knowledgeable. She walked me through the setup of my new equipment. I left feeling well informed and confident in my ability to operate the equipment correctly.", "pics": null, "resp": null, "gmap_id": "0x888860c430353c25:0x99202ae2db955b2c"}
{"user_id": "104346058925919272635", "name": "Mark Mullins", "time": 1592867107118, "rating": 5.0, "text": "Was on Jasper for a church camp and had failed to pack my electrical cord for my c-pap machine. Being hundreds of miles from my home state, wasn't sure what to do. A friend recommended to stop by the Respiratory Associates center and see if they might be of help. Sure enough, Tina came up with a cord that they had stored in the back and wow it fit perfectly!!\nThank you for helping a stranded camp worker out right at the point of need\nBlessings, Mark M", "pics": null, "resp": null, "gmap_id": "0x888860c430353c25:0x99202ae2db955b2c"}
{"user_id": "105190936399741637854", "name": "William King", "time": 1596141547389, "rating": 5.0, "text": "Wonderful people to have had the pleasure of meeting. It had been years since I got my first cpap and had never had to replace it. They went beyond the limits to get me a new machine and make sure I was comfortable using it. Thanks to a wonderful staff.", "pics": null, "resp": null, "gmap_id": "0x888860c430353c25:0x99202ae2db955b2c"}
{"user_id": "109470430042344046053", "name": "Sarah Brooke Bell", "time": 1610919362319, "rating": 5.0, "text": "Great people that truly care! Thank you!", "pics": null, "resp": null, "gmap_id": "0x888860c430353c25:0x99202ae2db955b2c"}
{"user_id": "112314694953717351579", "name": "Dale Rhodes", "time": 1593098750293, "rating": 5.0, "text": "Very friendly, helpful and knowledgeable about there equipment they sale. Great people to work with", "pics": null, "resp": null, "gmap_id": "0x888860c430353c25:0x99202ae2db955b2c"}
{"user_id": "114576718036983915174", "name": "Shannon Williams", "time": 1592942102752, "rating": 5.0, "text": "Great experience with Crystal. She took all the time I needed to explain everything I had questions about my machine.", "pics": null, "resp": null, "gmap_id": "0x888860c430353c25:0x99202ae2db955b2c"}
{"user_id": "108778764790037875784", "name": "James Blankenship", "time": 1605406235501, "rating": 5.0, "text": "I deliver supplies here sometimes, excellent organization", "pics": null, "resp": null, "gmap_id": "0x88626ee79ad69ecf:0xe077a1851d2dcc98"}
{"user_id": "105722206433131555513", "name": "Beth Cates", "time": 1607715624750, "rating": 5.0, "text": "Woke me up unloaded me then told me where I could finish my break.", "pics": null, "resp": null, "gmap_id": "0x88626ee79ad69ecf:0xe077a1851d2dcc98"}
{"user_id": "116199963720693134566", "name": "Andy Johnson", "time": 1590966232153, "rating": 4.0, "text": "One of the best places to receive and ship your medical products.", "pics": null, "resp": null, "gmap_id": "0x88626ee79ad69ecf:0xe077a1851d2dcc98"}
{"user_id": "110632150595929279723", "name": "Avery Wood", "time": 1616994303637, "rating": 1.0, "text": "They were very rude to me. I will not be going to them and I will use Marshall at Specialized Medical Devices. I have used them several times and they were rude to me so it was not just one occasion. One incident they hung up the phone on me. My family and friends and patients will not be recommended here.", "pics": null, "resp": null, "gmap_id": "0x888602cd97f7f9a1:0xd267716062524663"}
{"user_id": "117673691955974665124", "name": "Malcolm Frase", "time": 1585193922053, "rating": 5.0, "text": "Friendliest and most helpful folks you'll Eve meet!😊", "pics": null, "resp": null, "gmap_id": "0x888602cd97f7f9a1:0xd267716062524663"}
{"user_id": "118340386213730733844", "name": "Nancy Kelley", "time": 1540504964140, "rating": 5.0, "text": "I went today to be fitted and receive my first CPAP. Everyone was so nice and professional.  I had called prior to my appointment and even on the phone they were polite and so very helpful.  I will be recommending them to everyone!!!\nMy comfort and knowledge of my machine was the priority...", "pics": null, "resp": null, "gmap_id": "0x888602cd97f7f9a1:0xd267716062524663"}
{"user_id": "109234700348709595283", "name": "Lynn Norris", "time": 1510101088274, "rating": 5.0, "text": "OxyCare Plus, Inc. In Tuscaloosa  always meets the C-Pap needs of my husband and me. The staff is so friendly and accommodating.  I recommend them to anyone who is trying to decide what business to use for their C-Pap needs.", "pics": null, "resp": null, "gmap_id": "0x888602cd97f7f9a1:0xd267716062524663"}
{"user_id": "104582193078725368269", "name": "Francis Herring", "time": 1531574081770, "rating": 4.0, "text": "They are very helpful and friendly.", "pics": null, "resp": null, "gmap_id": "0x888602cd97f7f9a1:0xd267716062524663"}
{"user_id": "104676389408574986322", "name": "Elizabeth Hill", "time": 1534961657541, "rating": 5.0, "text": "Great people and great service", "pics": null, "resp": null, "gmap_id": "0x888602cd97f7f9a1:0xd267716062524663"}
{"user_id": "107224779953510952884", "name": "Pat Killian", "time": 1619015945648, "rating": 5.0, "text": "The BEST place in fort Payne for supplies and the BEST staff - - -", "pics": null, "resp": null, "gmap_id": "0x8861d7d4ccd29ef9:0x31477a502f6f0d1c"}
{"user_id": "104497264889036358944", "name": "Richard Hartline", "time": 1492547651716, "rating": 5.0, "text": "They have a very good selection of just about anything a person needs for home health care. The prices are fair and the staff is very friendly and helpful.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMSGKhQvLSg7R6I_LXP-gtSHr3dfKmrD8-ATKQz=w150-h150-k-no-p"]}], "resp": {"time": 1499786202285, "text": "Thank you so much for the kind review. Hope to see you soon!"}, "gmap_id": "0x8861d7d4ccd29ef9:0x31477a502f6f0d1c"}
{"user_id": "101540822407172250453", "name": "Drew Taylor", "time": 1590766579330, "rating": 5.0, "text": "This family-owned business proves time and time again that they put their customer's first. They're the best Medical Supply company in Fort Payne, Al - Hands down!", "pics": null, "resp": {"time": 1526651168159, "text": "Thanks for the review Drew Taylor!"}, "gmap_id": "0x8861d7d4ccd29ef9:0x31477a502f6f0d1c"}
{"user_id": "117695963417381518386", "name": "Beverly Dean", "time": 1502216400929, "rating": 5.0, "text": "Have used them for years. Always very helpful. Highly recommend.", "pics": null, "resp": {"time": 1502218677127, "text": "We thank you so much for the kind words! Thank you!! See ya soon!"}, "gmap_id": "0x8861d7d4ccd29ef9:0x31477a502f6f0d1c"}
{"user_id": "106951458073798745489", "name": "Candice Wilbanks", "time": 1502454823346, "rating": 1.0, "text": "Caught them in a lie about something trivial like when they actually ordered what I needed. Its been over a week and a half and still haven't heard from them on item. I would not recommend these people at all.", "pics": null, "resp": {"time": 1502834009210, "text": "Candice,\n\nThank you so much for bringing this matter to our attention. I apologize for the unpleasant experience with our company. This is never our intention. I have followed up on the order and found your product was ordered on August 4th, (the morning after you were in) directly from the manufacturer. The item was backordered when our shipment arrived meaning it actually had to be made rather than just being packed and shipped. Unfortunately the backorder involved two weekends which did add time to the order. I sincerely apologize for your inconvenience and for our failure in communicating more specifically to you regarding your backorder. Again, thank you for your feedback and I apologize once again.    Beth Westmoreland owner"}, "gmap_id": "0x8861d7d4ccd29ef9:0x31477a502f6f0d1c"}
{"user_id": "103838813612043388523", "name": "Big R 504", "time": 1607526670557, "rating": 2.0, "text": "Make sure your not delivering or picking up Veteranary products. They don't go to 3316, they go to 3301.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOdXFpUu0N7A4Iz-T4qfjEyGyH_KmJ8brMBAHFm=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891baeb86ebaa7:0x482d35995f8dd444"}
{"user_id": "106079934116034691525", "name": "Jasen Castillo", "time": 1544910405398, "rating": 5.0, "text": "Love this company and the people I work with. From top management to HR, people here are top notch. Opportunities are limitless and challenges to help your customers are what make this a great place to work.", "pics": null, "resp": null, "gmap_id": "0x88891baeb86ebaa7:0x482d35995f8dd444"}
{"user_id": "109272553619739191783", "name": "White Death", "time": 1499567184713, "rating": 5.0, "text": "Great place to work with great benefits and awesome pay.", "pics": null, "resp": {"time": 1533654073422, "text": "We appreciate your hard work! Thank you!"}, "gmap_id": "0x88891baeb86ebaa7:0x482d35995f8dd444"}
{"user_id": "106929685292985023650", "name": "Rick Foster", "time": 1607624398411, "rating": 1.0, "text": "Very difficult people to deal with.  Ordered item for me without getting all needed info.  Tried to speak with General manager Roberson i think was his name, refused to speak with me.  Ask for someone over him lady named Marlyn would not give me name or number.  I see why their reviews are not very good.  I try to shop local but these people make it very hard.  If anyone knows who owns this rude place let me know please.  I cant believe anyone would allow this unprofessional manner to continue", "pics": null, "resp": null, "gmap_id": "0x8889c95293fb90a3:0x49a207b9a57afcfb"}
{"user_id": "106123410233896949258", "name": "kiss of Death", "time": 1585313798576, "rating": 4.0, "text": "The gentleman that brought out my mother's bed was great as of now no issues with them the iffice personal has been nice as the techs to me so i would recommend them", "pics": null, "resp": null, "gmap_id": "0x8889c95293fb90a3:0x49a207b9a57afcfb"}
{"user_id": "117604654081398334083", "name": "Deborah Blackwood", "time": 1548695265843, "rating": 5.0, "text": "They went out of their way to help me. Even though they didn't accept my insurance they called around till they found someone who did. And even fax my script and insurance card to the people who took it. So I didn't have to drive to Athens the night before my surgery. They were very caring and nice.", "pics": null, "resp": null, "gmap_id": "0x8889c95293fb90a3:0x49a207b9a57afcfb"}
{"user_id": "105276090315423167638", "name": "Connie Sparman", "time": 1600621907601, "rating": 3.0, "text": "They are working hard to help everyone get what they need.", "pics": null, "resp": null, "gmap_id": "0x8889c95293fb90a3:0x49a207b9a57afcfb"}
{"user_id": "104666117112523799191", "name": "Barbie Briscoe", "time": 1525830657142, "rating": 1.0, "text": "My husband recently started using oxygen and also needed a b-pap machine for severe sleep apnea. While this is all in a days work for the staff it was a life changing, life altering event for us that day. We were trying to wrap our minds around the fact that he needs the oxygen when we were told that his insurance would not pay for a b-pap machine or supplies, nor would it pay for his oxygen (it would pay at some level for oxygen but not at the level he is at currently, however, he still has to have it.)  Later he was, thankfully, able to get a donated b-pap machine (cost is over $1,000) but had to purchase the mask. The mask was over $200. When we purchased the mask, the staff person was not friendly, she sold us a mask that was too small and did not try to fit it on him. We did not know how to use the machine and we had trouble using the mask.  We took the mask back and asked for help. They exchanged it for another size mask and sent us on our way. Today we went back because he was still having trouble with the mask fitting correctly and were told their policy was 30 days for return and also that we could only return one and would have to purchase another one. We did not have over $200 to buy another mask. We were upset that policy was not explained to us at the beginning and we were upset because they said they could not find a record of the exchange but wouldn't exchange this one because we could only exchange once and we had already done that (but they still had no record of it).  The staff was not caring, not compassionate at all, and actually rude. When we said something about it we were told we should have  complained the first day if we were unhappy. My husband asked to speak to a manager but was simply given a message by the manager that they would go by policy....rude and insensitive staff.", "pics": null, "resp": null, "gmap_id": "0x8889c95293fb90a3:0x49a207b9a57afcfb"}
{"user_id": "101342104805051818580", "name": "Chris Kelso", "time": 1537142317904, "rating": 1.0, "text": "The staff was extremely rude and i was told I could go elsewhere.very unprofessional. The email listed also does not work. For a company that claims we don't rest till you do..need to change that motto to very rude and uncaring..we just want your money.", "pics": null, "resp": null, "gmap_id": "0x8889c95293fb90a3:0x49a207b9a57afcfb"}
{"user_id": "115476263556281172989", "name": "Jerry Erwin", "time": 1525828597861, "rating": 2.0, "text": "I went in for a bpap mask the customer service representative gave me a small didn’t try it on me or explain how to use it got it home and it was way to small I wore it that evening and called and brought it back the next morning was told I needed a different size at no time was I told 30 day return policy but if I was the right size how to use and shown how to use it I wouldn’t have to return it. Went in today and was told that I had to pay for one because of 30 day return policy my question to manager of corporate is that how you get people give them the wrong size then they bring it back very next day so then you use up your thirty day return policy then told them told about your policy. The meaning of customer service is to assist and help. You might want to take a look at your staff and figure it out why it happened. I’m a cash customer because my insurance won’t pay. Miss Betty said I should of said something about customer service when I came in and I did to her but she said she didn’t remember my wife and I if this is the way things work there, don’t you think as a manager you should personally talk to customer. The customer service representative was tallest out of all representatives. I was and am deeply feeling like I was ripped off and today the same lady told me that you had to buy brand new so I went to Resmed website and left same message after I ordered part. Please contact me ASAP my name is Jerry Erwin and it’s not first time your representative acted like she was to good to help me unless that’s how you expect your representatives to act.", "pics": null, "resp": null, "gmap_id": "0x8889c95293fb90a3:0x49a207b9a57afcfb"}
{"user_id": "103945896608154601152", "name": "Dana Vest", "time": 1484390837849, "rating": 5.0, "text": "Always friendly and eager to help. Great place for all your medical equipment needs", "pics": null, "resp": null, "gmap_id": "0x8889c95293fb90a3:0x49a207b9a57afcfb"}
{"user_id": "103349391647906486732", "name": "Amanda Pearce", "time": 1600088836484, "rating": 5.0, "text": "I recently bought scrubs for my new job. I have been a customer with them for 6 years. I love them! They will bend over backwards to help you get what you need. The are extremely kind and always have a smile on their face! They even have accessories that are unique! I will Continue to recommend them to everyone I know. If you live In or near Fairhope or Foley make your way out!", "pics": null, "resp": {"time": 1600186397026, "text": "This made my day! Thank you!"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "110037406428296036887", "name": "Susan Fitzpatrick", "time": 1603922844754, "rating": 5.0, "text": "The ladies working in the store greeted me as soon as I walked in and asked if I needed any help.  Very friendly and willing to help. Good variety of scrubs, socks, etc. I also received a nice discount. I will definitely return to this shop for future purchases.", "pics": null, "resp": {"time": 1603932607070, "text": "Thank you, Susan, for the awesome review. We appreciate the kind words! ❤️"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "100134923303098018719", "name": "Rhonda Thomas", "time": 1604969878370, "rating": 4.0, "text": "Clerk was knowledgeable about sizes and fit of all the different uniforms.  Very friendly and willing to help. Just wish they had my sizes in stock but they had no problem ordering and should be here soon.", "pics": null, "resp": {"time": 1604970586946, "text": "Thank you for the review, Rhonda! We appreciate it!"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "115161186670801634098", "name": "Jessica Kelley", "time": 1598916623656, "rating": 5.0, "text": "I Love uniforms Plus!!!! Susan in the Foley store and Heather in the Fairhope location are both Amazing and super helpful! They are both Always friendly, and make the shopping experience a Great was one!!", "pics": null, "resp": {"time": 1598927218945, "text": "Thank you, Jessica! We appreciate the awesome review! ❤️"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "103407196910012858029", "name": "Sara Whalley", "time": 1599139914705, "rating": 5.0, "text": "Super helpful people.! I haven't had to wear scrubs for a few years and went into the store clueless of size and fit. They picked out a few options for me. Also I'm six foot tall and its hard to find longs that fit a large person! They nailed it and I was out of there in 20 mins!", "pics": null, "resp": {"time": 1599152645142, "text": "Thank you for the sweet review, Sara! So glad that we could help you find the perfect fit!"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "104662186242470831288", "name": "lisa clark", "time": 1602422205883, "rating": 5.0, "text": "The clerk waa very helpful\nI got my pants i wanted in correct sz was iut the door quick because of the clerk being so helpful and friendly", "pics": null, "resp": {"time": 1602423850810, "text": "Thank you, Lisa! I’m so glad you had a great experience!"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "101147576749134941240", "name": "Kelly DeShay", "time": 1581183362819, "rating": 5.0, "text": "I had a great experience with this scrub shop.  Ordering my scrubs in the store was extremely easy and the person who took care of me was very friendly and knowledgeable.  My scrubs came in rather quickly and they had them embroidered in no time.  Amazing customer service, very friendly and they kept me up to date on my order.  I will most definitely continue to use Uniforms Plus in the future.", "pics": null, "resp": {"time": 1581187315766, "text": "Thank you, Kelly! We appreciate you taking the time to give us that amazing review! You have been awesome to work with as well!"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "115513419911143540484", "name": "Anne Miller", "time": 1599849395449, "rating": 5.0, "text": "Awesome place! Friendly and helpful staff in Foley and Fairhope!! Will definitely be back!", "pics": null, "resp": {"time": 1599868630412, "text": "Thank you, Anne! We appreciate the sweet review!"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "112071687552085641732", "name": "Ti “T” Ch", "time": 1577629311252, "rating": 5.0, "text": "This is my favorite uniform store! They have so many awesome products and brands to choose from, have awesome sales, good pricing, and the staff is always so sweet and kind.  Great place!", "pics": null, "resp": {"time": 1577639703264, "text": "Thanks so much for taking the time to give us such a sweet review! We appreciate it!"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "104268828416299255701", "name": "Sarah Carll - Fox", "time": 1579813756894, "rating": 5.0, "text": "Susan was awesome! She helped me find the perfect scrubs and was so kind and helpful with the prices. I will be a returning customer for sure! She even said they have a store in Fairhope! Awesome!", "pics": null, "resp": {"time": 1579821190833, "text": "Thank you, Sarah, for the awesome review! We appreciate it!"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "100719823297013078458", "name": "Kimberly", "time": 1570559494434, "rating": 5.0, "text": "I had the greatest experience. Casual, down to earth and very very helpful with no judgment at all. Super great prices and discounts. I will definitely be going back.", "pics": null, "resp": {"time": 1570566024411, "text": "Thank you, Kimberly. I’m so glad you had a great experience!"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "113786716708113576733", "name": "Sonya Blair", "time": 1569882583337, "rating": 5.0, "text": "They were great.  Went in for a jacket, ended up with it, set of scrubs, shoes, lanyard, socks, hemostats, coffee mug and more.  No pressure, they were just helpful.  Would definitely go back, and will.  Recommend them to anyone.", "pics": null, "resp": {"time": 1569889374600, "text": "Thank you for the review, Sonya! We appreciate it!"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "104473798164874363121", "name": "Maddie Hall", "time": 1563931842640, "rating": 5.0, "text": "Great experience! I practically didn’t have to do anything! Heather brought me multiple different items to try on and took care of everything I needed. I left with 5 pair of scrubs and two pair of compression socks! I WILL be back!", "pics": null, "resp": {"time": 1563933182387, "text": "Thank you, Maddie, for taking the time to write a review. We appreciate it! So glad you had a great experience!"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "103258624167646281774", "name": "Jan Adams", "time": 1565834099097, "rating": 5.0, "text": "The girls have been extremely helpful. They researched to find  exactly what I was looking for and ordered it. They are knowledgeable about current recommendations mandated by OSHA.", "pics": null, "resp": {"time": 1565866403649, "text": "Thank you, Jan. I’m glad that labcoat worked out for you!"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "103078293350578318950", "name": "Katheryn Raymond", "time": 1561569145918, "rating": 5.0, "text": "Wow! Customer Service. I was getting uniforms for my daughter and didn't have a clue what to get her. The staff found some excellent choices for us! After we left they went the extra steps and fixed her logo---we didn't have the right one. They got it worked out and we didn't even know we had an issue! I'd recommend Uniforms Plus to anyone wanting a quality product and super customer service!", "pics": null, "resp": {"time": 1561570051557, "text": "Thanks so much for the kind words! We appreciate it! I’m glad we could help!"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "105739498178931721830", "name": "Haley Levengood", "time": 1576064723569, "rating": 5.0, "text": "The staff was very knowledgeable and took the time to help me find exactly what I needed!", "pics": null, "resp": {"time": 1576070128060, "text": "Thanks so much for the awesome review! We appreciate it!"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "100786317387456233147", "name": "Barbara Martin", "time": 1583462136790, "rating": 5.0, "text": "Very friendly and always goes the extra mile to help you get what your looking for!", "pics": null, "resp": null, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "117647251410466225476", "name": "Rosemary Lee", "time": 1563036977676, "rating": 5.0, "text": "Awesome prices! Heather was so helpful n kind. I told everyone...they're definitely gonna check yall out. I will be shopping there again!", "pics": null, "resp": {"time": 1563040517181, "text": "Thank you, Rosemary, for taking the time to leave a review! We appreciate it!"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "116042527037725116469", "name": "Jennifer Parsons", "time": 1561557864427, "rating": 5.0, "text": "I had a hard time finding a style of scrubs I was comfortable in post baby. They were very friendly and super helpful and helped me find something that worked for me.", "pics": null, "resp": {"time": 1561560385709, "text": "Thank you, Jennifer! I’m happy to hear you found something comfortable!"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "107928578791546854553", "name": "Melanie bridges", "time": 1563923782266, "rating": 5.0, "text": "I went in ge to look around and see what they had as in uniforms(of course) and the prices(primarily) . I've been suffering abs lost 25 pounds since February and didn't realize(until today😉) that I was in a medium scrub pant (yay!!) The lady that was there, I like her personality and she made other uniform suggestions that would look great on me.. as in the feel, the dexterity, the price and color and I ordered my first set and felt great about it I can't wait to wear it to my job.", "pics": null, "resp": {"time": 1563925181820, "text": "Thank you, Melanie! I’m so glad that we were able to help you find your size and something comfortable. Congrats on wearing a medium pant! That’s awesome!"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "110782034714496666392", "name": "Jodi Sessions", "time": 1561988539604, "rating": 5.0, "text": "Shop local.  Best experience ever.  All the staff are super friendly and they have the cutest scrubs.", "pics": null, "resp": {"time": 1561989299625, "text": "Thank you, Jodi! I enjoyed seeing you on Saturday. I’m glad you ♥️ the Fairhope location!"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "111495145793935125963", "name": "ricky adkins", "time": 1548008277481, "rating": 5.0, "text": "Awesome place. She opened on Sunday for us after we drove 3 hours from Panama City. Very nice owner. We will be back.", "pics": null, "resp": {"time": 1548011439255, "text": "Thanks so much! Please let me know if you need anything."}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "102000109451007027068", "name": "Cherokee Chamblin", "time": 1564326051561, "rating": 5.0, "text": "A very enjoyable experience!!! The staff was extremely helpful and the price was right!! My new home for buying scrubs!!😀", "pics": null, "resp": {"time": 1564328860782, "text": "Thank you, Cherokee! It was so nice meeting you and I love your name :)"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "100738695085730511908", "name": "Laura Clark", "time": 1576876965216, "rating": 5.0, "text": "There are so nice and helpful!!!! Helped me with an idea for my nieces and nephews Christmas!!!! Thank you so much!!!", "pics": null, "resp": {"time": 1576880687329, "text": "Thank you for the review, Laura! I hope your nieces and nephews love their scrubs! Have a Merry Christmas! 🎄"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "114502656113793463329", "name": "Bobbie Castlen", "time": 1570932334685, "rating": 5.0, "text": "Wonderful service and super helpful but not pushy! I will purchase all my uniforms from here in the future.", "pics": null, "resp": {"time": 1570934018972, "text": "Thank you, Bobbie! I’m glad you had a good experience."}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "110255186029571936610", "name": "Emily Lackey", "time": 1563403456003, "rating": 5.0, "text": "Great selection and they are extremely helpful with finding scrubs that you're looking for.", "pics": null, "resp": {"time": 1563410978541, "text": "Thank you, Emily!"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "112312000002079522450", "name": "James Vilain", "time": 1561154643613, "rating": 5.0, "text": "Good selection of chef clothing, very helpful.\nGreat job", "pics": null, "resp": {"time": 1561157775887, "text": "Thank you, James, for taking the time to write a review! We appreciate it!"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "106847192665369872645", "name": "Lauren Hardman", "time": 1562698224933, "rating": 5.0, "text": "The store in Fairhope is great. Good variety of uniforms to choose from.", "pics": null, "resp": {"time": 1562708377986, "text": "Thank you, Lauren!"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "110832143542684078820", "name": "Jessie Mcsherdon", "time": 1551216994202, "rating": 5.0, "text": "Uniforms plus was awesome their prices were great in the staff knew exactly what I was looking for and what sizes I needed and had me In-N-Out less than 30 minutes!", "pics": null, "resp": {"time": 1551218259876, "text": "Thanks so much! We appreciate you!"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "117050499999317106008", "name": "Allison Self", "time": 1574272847327, "rating": 5.0, "text": "Love this place! Super helpful and knowledgeable!", "pics": null, "resp": {"time": 1574277559257, "text": "Thank you, Allison!"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "118215182580212338699", "name": "Wendy Ledbetter", "time": 1561906829528, "rating": 5.0, "text": "Everyone is so helpful and fantastic at what they do. Highly recommend!!!", "pics": null, "resp": {"time": 1561639529891, "text": "Thank you, Wendy!"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "107284513479306499835", "name": "Sandra Nolasco", "time": 1557852302213, "rating": 5.0, "text": "Very nice staff, always willing to help. Large variety of scrubs available.", "pics": null, "resp": {"time": 1557859382690, "text": "Thank you, Sandra!"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "118040039760053422062", "name": "Claudia Carley", "time": 1548074763780, "rating": 5.0, "text": "Always enjoying the Customer Service of the Ladies working there....feels like having Friends!Thanks for your assistance ☺", "pics": null, "resp": {"time": 1548075962199, "text": "Thanks so much for the review! We have the best customers!"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "116650259718042118088", "name": "Shelby Butler", "time": 1546985157084, "rating": 5.0, "text": "Very sweet and helpful. Great selection and good prices.", "pics": null, "resp": {"time": 1546987620152, "text": "Thanks so much!"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "104365411293129009685", "name": "Phyllis Benavidez", "time": 1548539120366, "rating": 5.0, "text": "Very friendly, helpful staff. Would highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "108545504210582499203", "name": "Christy Davis", "time": 1549396601116, "rating": 5.0, "text": "Love getting my scrubs for work from here. Different selections to fit any body shape.", "pics": null, "resp": {"time": 1549398019112, "text": "Thank you, Christy!"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "112478179155606612685", "name": "Sunny Smith", "time": 1566251366738, "rating": 5.0, "text": "I had a great experience.", "pics": null, "resp": {"time": 1566252850190, "text": "I'm so glad to hear that, Sunny! Thank you for the 5 stars!"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "105373645290253649937", "name": "Ryan Bell", "time": 1497564763030, "rating": 5.0, "text": "Largest selection of quality scrubs in the area. Friendly & helpful staff", "pics": null, "resp": null, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "108553787021682783079", "name": "Kristine Sanders", "time": 1584028561985, "rating": 5.0, "text": "Friendly and very helpful!", "pics": null, "resp": {"time": 1584032447006, "text": "Thanks so much for the 5 star review! We appreciate it!"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "106552712578041035692", "name": "Stephanie Ivie", "time": 1564285503211, "rating": 5.0, "text": "All around a wonderful experience!", "pics": null, "resp": {"time": 1564309147554, "text": "Thank you, Stephanie! I’m so glad you had a great experience with us! We look forward to seeing you again!"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "101813292305570904703", "name": "Southern Pour Artist", "time": 1561685195015, "rating": 5.0, "text": "Heather was amazing! Will be back!", "pics": null, "resp": {"time": 1561686106870, "text": "Thank you, Gina! I agree that Heather is amazing. So glad that she could help you!"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "103088575020664424419", "name": "Heather Johnson", "time": 1570843355660, "rating": 5.0, "text": "Heather was so helpful!", "pics": null, "resp": {"time": 1570848157181, "text": "Thank you for the 5 stars, Heather!"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "116132692322651630910", "name": "Lisa Cardwell", "time": 1512238106020, "rating": 5.0, "text": "They have a great selection, and the staff is very friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "100388566781054232260", "name": "Lee Phone", "time": 1454457652531, "rating": 5.0, "text": "Everyone in shop was very helpful. They always seem to have what I need.", "pics": null, "resp": null, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "103417954883831885971", "name": "leigh taylor", "time": 1559281011057, "rating": 5.0, "text": "Staff is knowledgeable and helpful", "pics": null, "resp": {"time": 1559296742374, "text": "Thank you for taking the time to post a review, Leigh! I’m so happy that you had a good experience."}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "117947413825422471925", "name": "Ellen Wallace", "time": 1555786480299, "rating": 5.0, "text": "Love this place !", "pics": null, "resp": {"time": 1555787313849, "text": "Thank you! We appreciate you!"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "107882970009851373319", "name": "Tracy Devine", "time": 1561212781611, "rating": 5.0, "text": "Friendly staff & plenty of scrubs to choose from!", "pics": null, "resp": {"time": 1561213487859, "text": "Thanks so much for writing a review, Tracy! We appreciate you!"}, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "113212196549204390059", "name": "joseph ortega", "time": 1472747364148, "rating": 1.0, "text": "Every single pair of chef pants I have purchased from Scrubs has came apart at the stitching and I'm not exaggerating at least 7 pairs and they charge me $30 a pair I would not recommend going here.", "pics": null, "resp": null, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "107148096158355889930", "name": "country girl", "time": 1438256318588, "rating": 2.0, "text": "Poor selection", "pics": null, "resp": null, "gmap_id": "0x889a0de42cba3df3:0xd618964fe1b86ae9"}
{"user_id": "107482311454769073379", "name": "N M", "time": 1614779540611, "rating": 1.0, "text": "No mask, no business. I cannot believe medical professionals go without masks when Alabama hospitals have requested that everyone continue to wear them. By your responses, you don't seem to care. Good luck.", "pics": null, "resp": null, "gmap_id": "0x88926c3aabfa1b25:0x3f0dd8266f95eb9a"}
{"user_id": "116008421754795951536", "name": "Paul Sherling", "time": 1622899908974, "rating": 5.0, "text": "Excellent Service!  Each employee treats you like family that you don’t get from chain drug stores and other pharmacies.", "pics": null, "resp": {"time": 1622913493962, "text": "Thank you so much Mr. Sherling for the kind words. Our staff tries so hard to make everyone feel welcome and appreciated. Have a great day!"}, "gmap_id": "0x88926c3aabfa1b25:0x3f0dd8266f95eb9a"}
{"user_id": "110598605561773046937", "name": "mario vantez", "time": 1605819182396, "rating": 1.0, "text": "Not a single pharmacist or employee wearing a mask. Please respect the safety of your customers in the future.", "pics": null, "resp": {"time": 1605835074650, "text": "While I do respect your ability to have an opinion on the wearing of masks, context certainly does get lost when our intent is to lecture someone instead of attempting to solve a problem no matter if it is real or perceived.  We strive to make ALL patients and employees comfortable but we also respect their personal decisions.  I do not feel as though immediately taking comments to the internet instead of addressing your concerns in a personal manner is necessary nor is this the appropriate forum for the airing of grievances.  You, Sir, have a wonderful day!  John N. Holley"}, "gmap_id": "0x88926c3aabfa1b25:0x3f0dd8266f95eb9a"}
{"user_id": "109433833530012531742", "name": "Leslie Grimes", "time": 1616268217243, "rating": 5.0, "text": "Nice and prompt.", "pics": null, "resp": {"time": 1616269241920, "text": "Thank you so much!"}, "gmap_id": "0x88926c3aabfa1b25:0x3f0dd8266f95eb9a"}
{"user_id": "100291437703887988049", "name": "Julie Schnabel", "time": 1558100642989, "rating": 5.0, "text": "Left a text message because I was having problems with there phone returned my call within minutes and they weren’t even open.. I had forgotten about time difference.. Staff has always been friendly and helpful on the phone Customer Service is A#1 Thanks.", "pics": null, "resp": {"time": 1558114761007, "text": "Thank you Ms Julie and have a great day!"}, "gmap_id": "0x88926c3aabfa1b25:0x3f0dd8266f95eb9a"}
{"user_id": "117295865147140159267", "name": "SuperSteve English", "time": 1583561781903, "rating": 5.0, "text": "Love Holley. Good people & a pleasure to go into.", "pics": null, "resp": {"time": 1583590143944, "text": "Thank you so much for the kind words."}, "gmap_id": "0x88926c3aabfa1b25:0x3f0dd8266f95eb9a"}
{"user_id": "116623717407645105879", "name": "Steve Milton", "time": 1576346800992, "rating": 5.0, "text": "S'where I git muh crack at, Joe Rogan! *scratchin my neck*", "pics": null, "resp": {"time": 1576353798639, "text": "Mr. Milton, Thank you so much for the 5 star review but I don't quite understand the crack reference since that is an illegal substance and this is a licensed pharmacy. We obviously do not have that in stock and I'm pretty sure that we can't even order it! I am familiar with the celebrity Joe Rogan, however. I do hope that your neck will stop itching since you scratched it. Have a great day!"}, "gmap_id": "0x88926c3aabfa1b25:0x3f0dd8266f95eb9a"}
{"user_id": "104659072692344453739", "name": "Dr Mike", "time": 1613494619313, "rating": 5.0, "text": "John and the staff are AWESOME!!!!", "pics": null, "resp": {"time": 1613496747752, "text": "You are too kind. Thank you so much!"}, "gmap_id": "0x88926c3aabfa1b25:0x3f0dd8266f95eb9a"}
{"user_id": "101052142436820662439", "name": "Ricky Nickolson", "time": 1497616695254, "rating": 5.0, "text": "I started using Holley Pharmacy in Enterprise shortly after it first opened in our city. The \"home town\" service just cannot be matched by the big box chain pharmacies! As a customer, it is nice to feel welcomed and appreciated in a place of business, rather than feeling like an intrusion.", "pics": null, "resp": {"time": 1607441500696, "text": "😎"}, "gmap_id": "0x88926c3aabfa1b25:0x3f0dd8266f95eb9a"}
{"user_id": "115203495935290214160", "name": "Lisa Harrison", "time": 1539007943759, "rating": 5.0, "text": "I appericate the patience and the kindness they show. They genuinely care...", "pics": null, "resp": {"time": 1539010222769, "text": "Thank you so much for recognizing our team's effort and it truly is about the patient. Please let us know how we can help!"}, "gmap_id": "0x88926c3aabfa1b25:0x3f0dd8266f95eb9a"}
{"user_id": "117608698150275689997", "name": "Diane Gabert", "time": 1505959076454, "rating": 5.0, "text": "They stayed open late for me to fill my prescription after exiting the hospital. I have found my new pharmacy.", "pics": null, "resp": {"time": 1607441463603, "text": "👍😎👌"}, "gmap_id": "0x88926c3aabfa1b25:0x3f0dd8266f95eb9a"}
{"user_id": "117309180677606228956", "name": "Carla Browning", "time": 1612886321944, "rating": 5.0, "text": "I have been dealing with Pro Health for over 2 years now for my CPAP machine and supplies.  The employees there have ALWAYS been very nice and helpful.  I will continue to use them as long as they are in business. :)", "pics": null, "resp": null, "gmap_id": "0x888e8fff3438039d:0x784ca570a591240f"}
{"user_id": "108560084525388490155", "name": "Shannon Dean", "time": 1611266539960, "rating": 5.0, "text": "I strained a knee and needed a pair of crutches.  The associate was very helpful and even adjusted them for my height.", "pics": null, "resp": null, "gmap_id": "0x888e8fff3438039d:0x784ca570a591240f"}
{"user_id": "112895208978012849935", "name": "KnS BBQ", "time": 1581635955219, "rating": 5.0, "text": "They were all very nice and explained thing to me a first time cpap user.", "pics": null, "resp": null, "gmap_id": "0x888e8fff3438039d:0x784ca570a591240f"}
{"user_id": "104146607796122412734", "name": "Kimberly Cole Zemke", "time": 1551764431233, "rating": 5.0, "text": "Very kind and helpful employees.  They filled a prescription for a hospital bed for my precious Mum.  The bed came with a mattress that was not sufficient to support my Mum with her horribly painful spinal damage so I called Pro Health and they immediately replaced the mattress with a thicker and more comfortable mattress.   Thank you Pro Health team.", "pics": null, "resp": null, "gmap_id": "0x888e8fff3438039d:0x784ca570a591240f"}
{"user_id": "103387974303930866016", "name": "Cassie Hamlin", "time": 1562467257371, "rating": 5.0, "text": "Absolutely love the team there. They know me snd my needs and make sure i am taken care of quickly and professionally and always asked how i gerl and how ate things. Love them all", "pics": null, "resp": null, "gmap_id": "0x888e8fff3438039d:0x784ca570a591240f"}
{"user_id": "102751931633215504979", "name": "Missy Powell", "time": 1523495163143, "rating": 5.0, "text": "Very friendly staff with plenty of stock available in store to choose from. This location {in the Moncrief's old Furniture Building} has been renovated beautifully. Having lived here since I was 10, I was quite surprised at just how nice their new facility is. In addition, what I purchased was priced reasonable.", "pics": null, "resp": null, "gmap_id": "0x888e8fff3438039d:0x784ca570a591240f"}
{"user_id": "109814775488205726734", "name": "Charlotte Barber", "time": 1451668147499, "rating": 4.0, "text": "Very helpful staff. Owner anxious to please, really caring. If they don't have an item he is willing to get it if possible. My husband gets his Cpap supplies here for 2 - 3 years. They try hard to keep him satisfied with masks.", "pics": null, "resp": null, "gmap_id": "0x888e8fff3438039d:0x784ca570a591240f"}
{"user_id": "103005492777125173549", "name": "Caroline LaMothe", "time": 1555653319865, "rating": 5.0, "text": "Very friendly and professional service.  I had just left my doctor's office after being told I will have to be on a nebulizer for the rest of my life.  I had no idea what a nebulizer was or what it did.  I choose ProHealth against my doctor's office recommendation.   I have had interaction with the owner of ProHealth before at a ball game.  He impressed me as someone who really cares about people.  The young lady who helped me, explained everything about the machine and how to use it.  If I need anything else, ProHealth will be my first choice.", "pics": null, "resp": null, "gmap_id": "0x888e8fff3438039d:0x784ca570a591240f"}
{"user_id": "107586977086539848999", "name": "Carla Cook", "time": 1444396490827, "rating": 1.0, "text": "Employees are treated like crap.....DO NOT WORK FOR THESE PEOPLE!!!! The owners fight all the time in front of staff and patients, the owner also cusses his employees during staff meetings. They can not keep anyone working for any length of time! Very poor and hostile work environment! They don't deserve one star!!! You're Welcome!", "pics": null, "resp": null, "gmap_id": "0x888e8fff3438039d:0x784ca570a591240f"}
{"user_id": "107763370980511861964", "name": "Lisa Morgan", "time": 1470494489250, "rating": 1.0, "text": "Need to update your website with new hours. Came up on Saturday because your site said you were open but your not. Wasted trip.", "pics": null, "resp": null, "gmap_id": "0x888e8fff3438039d:0x784ca570a591240f"}
{"user_id": "112093066812095035624", "name": "Devin lincoln", "time": 1544937283236, "rating": 1.0, "text": "Pro health sucks", "pics": null, "resp": null, "gmap_id": "0x888e8fff3438039d:0x784ca570a591240f"}
{"user_id": "105812487243298138202", "name": "Donnie Clinton", "time": 1401739656583, "rating": 1.0, "text": "Prohealth will not refund my payment on oxygen equipment even though they have\nreceived payments from Medicare and Blue Cross.", "pics": null, "resp": null, "gmap_id": "0x888e8fff3438039d:0x784ca570a591240f"}
{"user_id": "102601513339001885522", "name": "Reed York", "time": 1623168701201, "rating": 1.0, "text": "I received call after call from Deep South about ordering new supplies. After about a month I ordered my replacement supplies. This was 2 months ago and never received anything. Don't know if they filed with my insurance are not and just pocketed the funds. Definitely not a place I would trust with my health care needs.", "pics": null, "resp": null, "gmap_id": "0x88928d1988c193bd:0x3ef9a0ff1ff29937"}
{"user_id": "113573074296782237200", "name": "Melony Watson", "time": 1615238145138, "rating": 5.0, "text": "Excellent, friendly, & very efficient staff at Deep South DME!!! Jason takes all the time needed to explain & demonstrate the Bi-Pap that was ordered after my sleep study. I've read negative reviews on Jason before going in to meet him, but I found him to be a very nice & well informed gentleman.", "pics": null, "resp": null, "gmap_id": "0x88928d1988c193bd:0x3ef9a0ff1ff29937"}
{"user_id": "101218430627201903310", "name": "Mallory Richardson", "time": 1615298548672, "rating": 5.0, "text": "Excellent customer service. Staff is friendly and knowledgeable. I will continue to use these guys for years to come.", "pics": null, "resp": null, "gmap_id": "0x88928d1988c193bd:0x3ef9a0ff1ff29937"}
{"user_id": "111239269009463842439", "name": "Stephen Hamm", "time": 1592307410055, "rating": 1.0, "text": "Insurance will not cover the absurd amount they charge for equipment. They will foot you with the bill. You can buy the exact same CPAP for $500 and they charge $1500.", "pics": null, "resp": null, "gmap_id": "0x88928d1988c193bd:0x3ef9a0ff1ff29937"}
{"user_id": "104347566543000644252", "name": "Sarah Vickers", "time": 1615298652654, "rating": 5.0, "text": "Staff is very knowledgable.", "pics": null, "resp": null, "gmap_id": "0x88928d1988c193bd:0x3ef9a0ff1ff29937"}
{"user_id": "101718261132156505106", "name": "Old Mechanic", "time": 1562106765669, "rating": 5.0, "text": "Excellent service the past 4 times I've been in! They always get me set up with what I need minding the doctor's office has sent them the right paperwork so they can. Jason at the cpap store sat down with me and explained why sometimes insurance doesn't pay for what they should and I have to cover the rest but that's not their fault. Deep south is one of the few places left around here that actually take time to help you, not common around here anymore! Definitely recommend going to see the people at Deep South they will take care of you!", "pics": null, "resp": null, "gmap_id": "0x88928d1988c193bd:0x3ef9a0ff1ff29937"}
{"user_id": "110045064765223997679", "name": "Cindy Tingle", "time": 1561991041276, "rating": 5.0, "text": "The staff at Deep South are amazing! My family uses this company and have always been very happy with the service they received. They go above and beyond to meet the needs of their customers.", "pics": null, "resp": null, "gmap_id": "0x88928d1988c193bd:0x3ef9a0ff1ff29937"}
{"user_id": "100181291065023121454", "name": "White Snake", "time": 1559096335300, "rating": 1.0, "text": "This review is for the CPAP department only.  I have had no experience with any other department of this company.  With that being said the CPAP department is concerned only with a dime and customer service is a myth.  Stay away.  After dealing with them numerous times over the last year, the only thing that has been extremely clear is Jason believes and makes it known to his customers that their insurance never pays enough for his services.  Somehow you end up leaving feeling like this is your (the customer’s) fault and you should be proud to be in his mere presence, since you haven’t paid for it.  This is brought up every time you conduct business with him. If you don’t want to accept certain insurances, then don’t.  However, no one needs to hear your continuous unprofessional whining.  All of this can be tolerated until I am denied a report being emailed to me that is required for my job and my families livelihood, without paying them first for a report they already agreed to provide....for a report, my report that Jason told me I could call and get with no issues when I received my machine.  This issue has since been elevated through my insurance company and was informed this is not allowed.  In my experience, customer service doesn’t call Deep South Home Medical Equipment home.  However, in the off chance I’ve just had a bad experience with Jason, I’d recommend dropping him like he’s hot and getting someone who is a better fit for what I originally saw as a 5 star reviewed company.", "pics": null, "resp": {"time": 1561990510001, "text": "Mr. White Snake first off I would like to apologize for your inconvenience and would like to talk to you about this matter at 334-671-9484. Unfortunately, with the ever changing world of healthcare we have had to start charging $10.00 per download for some insurances."}, "gmap_id": "0x88928d1988c193bd:0x3ef9a0ff1ff29937"}
{"user_id": "110117057351985735080", "name": "Megan Hamm", "time": 1592307937957, "rating": 1.0, "text": "Lie to you and tell you that insurance covers more and then sticks you with the bill. Get from online with prescription. It will save $100s ($1500 vs $499). DO NOT GO HERE FOR CPAP!!!!", "pics": null, "resp": null, "gmap_id": "0x88928d1988c193bd:0x3ef9a0ff1ff29937"}
{"user_id": "100488078722806413695", "name": "Danny McLean", "time": 1562164954966, "rating": 5.0, "text": "I have been using Deep South Home Medical Equipment for years and have always been treated with the utmost respect and received my CPAP and supplies timely. Jason always goes above and beyond to get me the product(s) I need. I highly recommend Jason and Deep South HME for all of your CPAP and home medical needs.", "pics": null, "resp": null, "gmap_id": "0x88928d1988c193bd:0x3ef9a0ff1ff29937"}
{"user_id": "107828112505053209620", "name": "elvis aaron", "time": 1562163477330, "rating": 1.0, "text": "I have read other reviews that the CPAP department is a myth at deep south, terrible customer service and this I have to agreed with 100%...The very first person u see, that sits at the front desk in the CPAP department when u first walk in, is very rude and sarcastic, to say the least, and the managers or bosses of the CPAP department are jerks...They r all about the money with no real compassion or help with problems that may and will come about during the CPAP experience...We have some great medical supply places here in Dothan and I would suggest u try one of those, cause this is the worse I have ever been treated by any company...thank u....Oh I only gave it one star cause u had to, to post a review, cause they really should get 0 stars...I see 3 other prior customers with very bad reviews, really feel for them, cause no body should b treated so badly ever!!!! I WILL NEVER STEP FOOT IN THIS VERY POORLY RUN PLACE AGAIN!!!!!!!!!!!!!!!again thanks for reading and so sorry others have been treated terrible as well.....", "pics": null, "resp": null, "gmap_id": "0x88928d1988c193bd:0x3ef9a0ff1ff29937"}
{"user_id": "103601884948064078603", "name": "Stacy Cupples", "time": 1573922909036, "rating": 1.0, "text": "I have a cpap machine from them that I bought.   I’ve only had it for 4 months.  The first week I used it the mask bruised my nose I took it in they gave my a silicon flip to cover my nose needless to say it didn’t work.  They do not come to your home to help you have to go to them & take the machine.", "pics": null, "resp": null, "gmap_id": "0x88928d1988c193bd:0x3ef9a0ff1ff29937"}
{"user_id": "102187260148702664425", "name": "Bettysue Bruckner", "time": 1513879095831, "rating": 5.0, "text": "Wonderful service.  They go out of their way to accommodate your needs.  Have and will recommend to friends!", "pics": null, "resp": null, "gmap_id": "0x88928d1988c193bd:0x3ef9a0ff1ff29937"}
{"user_id": "113612358540686761378", "name": "Kim McKinney", "time": 1516827889637, "rating": 5.0, "text": "If I could give more stars I would. They are the best. They go above and beyond. I have used them for my mom, my brother and my husband, will never use anyone else.", "pics": null, "resp": null, "gmap_id": "0x88928d1988c193bd:0x3ef9a0ff1ff29937"}
{"user_id": "106131544824702812324", "name": "T3L3V1510N", "time": 1562021205047, "rating": 1.0, "text": "Jason in CPAP has no customer service skills at all. Will NEVER DO BUSINESS WITH THEM AGAIN", "pics": null, "resp": null, "gmap_id": "0x88928d1988c193bd:0x3ef9a0ff1ff29937"}
{"user_id": "113565938730440503980", "name": "Tammy King", "time": 1562705251040, "rating": 5.0, "text": "The very best staff!", "pics": null, "resp": null, "gmap_id": "0x88928d1988c193bd:0x3ef9a0ff1ff29937"}
{"user_id": "108100128057678021179", "name": "Ally G", "time": 1576362129314, "rating": 1.0, "text": "Horrible driver passed on a double yellow line", "pics": null, "resp": null, "gmap_id": "0x88928d1988c193bd:0x3ef9a0ff1ff29937"}
{"user_id": "112338606523514131167", "name": "Toni Bloom", "time": 1562019750338, "rating": 1.0, "text": "Giving 1 star because you cant go any lower.", "pics": null, "resp": null, "gmap_id": "0x88928d1988c193bd:0x3ef9a0ff1ff29937"}
