{"user_id": "109259694312711882458", "name": "Amy", "time": 1628022422011, "rating": 5.0, "text": "I’m so glad I chose Coby to be my attorney during one of the hardest times of my life. He was professional, yet very caring. He validated my concerns and emotions. He was upfront and honest. He helped me navigate this whole process, and had patience with me. He explained everything, which helped ease my anxiety. His paralegal, Cheryl is great too- very responsive with emails and thorough. The accounting staff was amazing as well. Definitely best experience I could have asked for. I’m very thankful.", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "100897799254963426866", "name": "Holly Wright", "time": 1623867297545, "rating": 5.0, "text": "Where do I start?! Kris is a GAMECHANGER for Family Law. She is organized, responsive, caring, and more importantly...she gets results! She listens and does her homework and cheers you along the way. Her paralegal Hannah is amazing as well...they tag team and get the job done! These ladies would even respond in the evening at times...well after hours if it was really important. She knows the key players in the court system which helps as well. I am so grateful to have met her. She is someone that you can tell your issue to once and she knows what you are thinking and how to fix it before you do. Nobody ever wants to go to court and I was a nervous wreck even though I was the one that filed. Kris was so compassionate, told me to relax...that she's got it and she was right. She will have your back! To achieve that level of trust that quickly when dealing with your family is priceless to me. I will forever be so grateful to have met her. Kris Sexton is definitely who you need to hire for custody issues, etc. Hopefully I will not need her again...but she offered to be on stand by if I needed anything else. What a great lawyer!", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "108513730800676341653", "name": "Sara Hardin", "time": 1627959011812, "rating": 5.0, "text": "We are working with Ms.Hickman love her so far!! She has kept her word and been very prompt!", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "114139051987769308257", "name": "Adrian Scruggs", "time": 1613011535166, "rating": 5.0, "text": "Kris and her staff are amazing. These ladies will take care of you from day one. I got a bill summary at the beginning of each week that included a break down of the work that was being done on my case. I was never left in the dark. They make sure that you get your money's worth out of every phone call and email. Not many people can confidently say they have the best lawyer in Huntsville. But Kris and her staff are definitely the best.", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "108546059238173694095", "name": "jennie nickel", "time": 1616098539808, "rating": 5.0, "text": "Very quickly into my consultation, I knew that Coby was the lawyer for me. He was direct, honest and prepared me for what to expect instead of just telling me what I wanted to hear. He came to the consultation fully educated on my case and was ALWAYS impressively prepared for every step along the way. He and his paralegal, Cheryl, went above and beyond. They made a miserable situation bearable. I would hire him again and recommend him in a heartbeat.", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "110208538591103585501", "name": "Mary Ann Justice", "time": 1612315683824, "rating": 5.0, "text": "Kris represented me in my custody case. She was extremely professional and knowledgeable about the law. Kris was truthful and fought hard for me every step of the way. She takes her job seriously and is understanding very stressful situations. Hannah and Kris work together and do amazing work. I would hire Kris again. It’s hard to find an honest, trustworthy attorney.", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "105837256949512737764", "name": "Kari Aschenbach", "time": 1612241690572, "rating": 5.0, "text": "I trust NXTSTEP for any family law matter. They are thorough, knowledgeable, and care about the people they represent. Kris Sexton is a straight shooter and fantastic to work with. I recommend contacting her to anyone in need of counsel.", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "100570382589702013566", "name": "Mark Moore", "time": 1623872561337, "rating": 5.0, "text": "Nora Hickman is an attorney I’d recommend without hesitation.", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "102885887290531749571", "name": "Amy Jean Hargrove", "time": 1612228646719, "rating": 5.0, "text": "I strongly suggest NXTSTEP!! Kris is an incredible attorney. She is so passionate about her clients and cases. I wouldn’t go anywhere else personally.", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "111141216012535577945", "name": "Tamisha Johnson", "time": 1616090294510, "rating": 1.0, "text": "I know someone who was represented by Coby Boswell. Had a very hard time speaking with him. Phone calls weren’t returned and also got an appointment 2 WEEKS OUT just to talk to him.(appointment set by his office). The day and time  of the appointment the office gave come to find out the office was CLOSED. THe office called back but she still wasn’t able to speak with him because he wasn’t available. It was a UNPROFESSIONAL experience. In my opinion, if  you want someone that will be responsive and get back with you in a timely manner seek elsewhere , do not go with him.", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "110286113664145940557", "name": "Katelyn Dinkel", "time": 1612226791846, "rating": 5.0, "text": "The first time I needed legal help I called Kristina at Next Step Family Law. She was professional and quick to respond! She knows her stuff and works hard. I would trust her as my attorney any day in court.", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "118049578662087825850", "name": "Lindsey Robbins", "time": 1612281947488, "rating": 5.0, "text": "Kris and her team are absolutely amazing! Their professional and compassionate work are such a benefit to HSV families.", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "108016574526139765417", "name": "Stephen Cassway", "time": 1612227494175, "rating": 5.0, "text": "The entire team is incredible and was the best decision I have ever made, thank you for all your hard work on my behalf.", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "116748759247214881222", "name": "Kristen Cooper", "time": 1616617054006, "rating": 5.0, "text": "Kristina Sexton is considerate of the needs of each individual and aims to be fair in mediation.", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "102187041248184296815", "name": "Mark King", "time": 1625285546169, "rating": 5.0, "text": "My go to lawyers every time i need one.", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "108183546888503058832", "name": "Juli Moore", "time": 1580485378442, "rating": 5.0, "text": "I recently hired Kris Sexton for a custody case. Kris and Hannah were absolutely the best decision my husband and I made in selecting a legal team. They took the time to get to know me as a person as well as the entire story and the case. They worked so very hard for me and it showed it court. I truly thank them from the very bottom of my heart ❤️ .", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "114596151599834019965", "name": "Jerica Anthony", "time": 1585680193638, "rating": 5.0, "text": "I called Next Step Family Law after hearing many friends talk about how good they are. I’m SO happy I did! With only two days until court I went in for a consultation with Coby Boswell. From the time I walked in the door, they were very welcoming and understanding. I felt better immediately after the consultation and decided to go with them.\nI am so grateful I did.\nMr Boswell and his team managed to get all of my scattered information together and build my case for me. They would call to check in and see how things were going. I felt like I had a support group outside of my support group.\nI was having a difficult time with everything before I had talked to Mr Boswell. He reassured me that everything was going to be fine and it was.\nMr Boswell and Cheryl did an amazing job.\nWe had discussed what I wanted to come from this custody case and they stood strong and made sure that’s exactly what I got.\nIf you need an attorney for family law I highly recommend Next step family law!!!!! This team of people are hardworking and dedicated individuals. I wouldn’t change my decision if I could. I want to say thank you to Next Step for working with me on such short notice. Thank you for standing by me and getting the job done. I’m truly blessed to have had a great team stand by me through this hard time. Definitely Five Stars!!!", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "100127134301825381025", "name": "Daniel DeLuca", "time": 1581001754057, "rating": 5.0, "text": "Above and Beyond. Hired them for a case recently. the level of communication and professionalism were vastly superior to other experiences. If i ever need an attorney for family law I already have the perfect firm.", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "112188133489290379287", "name": "Heidi Rose", "time": 1581518488912, "rating": 5.0, "text": "Excellent firm!  Staff was very professional and courteous. Communication was superb, never left in the dark wondering what was next.  Highly, highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "106181367301414497671", "name": "Mean Green", "time": 1546882144609, "rating": 5.0, "text": "I chose Kris because she came highly recommended by other attorneys in town. She helped me through the most difficult time in my life. Kris and her paralegal Hannah were always prompt, responsive and put me at ease every time we met. I was very pleased with how she handled everything.", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "100535971010878088287", "name": "Kristina “ying2” Hammonds", "time": 1570046771913, "rating": 5.0, "text": "Kris was amazing! She was confident and a beast in the courtroom, which is exactly what you want. She and her assistant Hannah were always there for us and went above and beyond any expectations I had.", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "112577447700223607393", "name": "Beverly Barker", "time": 1535181706819, "rating": 5.0, "text": "This entire office is awesome. They are all friendly and professional. My attorney Nora is always very sweet and caring. She is always there for me in this horrendous and very very stressful situation. It is so important to feel that someone understands how hard all of this is and that you at least know that someone is working in your best interest. Nora is awesome!Kristin, her paralegal does a fantastic job keeping everything straight. I couldn't have asked for a better team. They are the best!!", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "114491096562284933539", "name": "Jason Kiger", "time": 1531352242507, "rating": 5.0, "text": "Kris and Hannah are amazing!! From our first meeting throughout the 15 month process, they were welcoming, understanding, dedicated, knowledgeable, and committed to representing me to the best of their abilities. I could not have asked for a better team to present my case. I can’t speak about them highly enough. If you find yourself in need of family legal help, make the best decision possible and call Kris at NXTSTEP Family Law.", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "101476466097177808513", "name": "Sunshine Shumate", "time": 1522879297721, "rating": 5.0, "text": "When dealing with tough personal family situations, it helps to know that you have a legal team on your side willing to fight for you and ensure you are taken care of during such a hard time. Kristina Sexton and her entire staff worked hard to make me feel supported and comfortable, and I never had to worry that my legal needs would not be met. I highly recommend Kris and NXTSTEP Family Law!", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "102155108126204168066", "name": "Brittany Hall", "time": 1523494379388, "rating": 5.0, "text": "Best experience ever with an attorney. Kris and her staff go above and beyond. She is very knowledgeable and informative. We would recommend her and her team to anyone!  Thanks so much!!\n\nThe Copeland’s", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "113310309987384576126", "name": "John M", "time": 1497995800893, "rating": 5.0, "text": "Kris has been my attorney for over 3 years, and she is hands down one of the best in the whole state. I had a very complex case, and I can't imagine how it would have turned out if I didn't have her help. Divorce can affect you for many years, and you need somebody that can advocate and help you through the entire process. I highly recommend her.", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "115668500472518741865", "name": "Tiara Raycine", "time": 1496184664308, "rating": 5.0, "text": "This was a tough one but Kris and her team were there for me throughout the entire way. Hannah is a gem...there is no other word to describe her! Kris is hands down one of the best attorneys in family law.  If I could give their professionalism and transparency a 10 star I would. When I almost gave up, they stepped in. Forever grateful for EVERYONE at this law firm! God speed.", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "100123089911285592120", "name": "Amanda Hall", "time": 1528863777617, "rating": 5.0, "text": "I am so thankful that my friend recommended Nxtstep when I found out that I would be going through a divorce. Nora Hickman is so knowledgeable & is great at what she does. She not only gave me encouragement through such a hard time in my life but also fought for me when at times, I didn’t even feel like fighting for myself. You cannot go wrong with this law firm and their sweet, helpful & understanding staff.", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "112486761185541751329", "name": "Terrell White", "time": 1580951862228, "rating": 5.0, "text": "Coby did an outstanding job in my custody battle! He was very intelligent when it came to matters dealing with my case and I would highly recommend him to anyone in need of his services!", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "111508757832877353130", "name": "DeeDee Crawford", "time": 1562787632965, "rating": 1.0, "text": "If you want a firm that is to weak to stand up for your rights and represent you this is the firm for you.  I might as well represented myself.  Most non-caring people I've ever seen.", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "108810888217007208991", "name": "Erica Wilson", "time": 1548547394386, "rating": 5.0, "text": "I hired Kris Sexton to handle an emergency change to my custody agreement. She immediately took action to get the case started while keeping me informed throughout the entire process. Kris and her team are very attentive, kind, and encouraging. I felt prepared for every step of the process. She not only resolved the issue for the present circumstances but set up a process should problems arise in the future without starting the process again. All of this was done without me even having to step foot in a court room. I didn’t even know that was a possibility. The level of service and professionalism you receive at NXTSTEP is priceless. I thought I had a hopeless case with no real expectations of success to receiving an outcome of more than I’d even hoped for!", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "112435058145729193153", "name": "Bree Welch", "time": 1486039116382, "rating": 5.0, "text": "The best experience possible! Kris and her team put forth their best efforts for me and my daughter making her the first priority, but also being there for support though the hardest of times and walked me through every trying situation. Kris and Brandy always have an answer for any of my questions or concerns and being able to always ease my worries. They are always on top of what ever was throw our way, very proactive and were always one step ahead. I will never use another attorney and HIGHLY recommend Nxtstep Family if you are looking for an attorney and team that will genuinely have your best interest at heart.", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "110012702093102841025", "name": "Kelly Goff", "time": 1517859457998, "rating": 5.0, "text": "All the staff are friendly, knowledgeable, and take time to understand each situation individually. No matter how many questions I had, or how trivial I thought they seemed, they were always there with an answer, reassurance, and confidence. I recommend the firm, especially Kristina Sexton, to anyone!", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "103197610040899247555", "name": "Gary McGee", "time": 1523137324115, "rating": 5.0, "text": "Our family had a great experience with Ms. Sexton in our adoption case. She was well prepared and knowledgeable.  We definitely recommend her and her staff.", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "110422397288481708725", "name": "Tiffany Finney", "time": 1536167672205, "rating": 5.0, "text": "I highly recommend Coby Boswell and all staff at NXTSTEP Family Law for any custody case/ support modifications. Mr. Boswell was very knowledgeable and helpful in so many ways! It was truly a blessing to have him help guide me through my time in need!", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "105439682691919014652", "name": "Lisa Brizendine", "time": 1489552818357, "rating": 5.0, "text": "Words really can't express the gratitude I have for Kristina Sexton.  She has been with me every step of the way during my very difficult divorce.  Kris, as well as her paralegal Hannah, have been on top of every situation.   They've kept me informed during the entire process.  Kris has been \"spot on\" in providing her legal advice, and trust me, this wasn't a \"file for divorce and be done in 2 months\" situation! My situation has had many twists, turns, and complexities; yet, she never blinked an eye.  She is very strategic and highly experienced, well beyond her years.  I believe she's a very versatile attorney, whether you are needing an aggressive attorney or one that is suited for a more \"amicable\" situation.   I am more than pleased; I am very thankful to have chosen Kris, Hannah, and the rest of the team at NXSTEP Family Law to help me.", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "106023815956152287322", "name": "LaQueena Herrin", "time": 1539736709098, "rating": 5.0, "text": "Chris and Hannah are great! Very patient and very informative! Plus when you’re in a uncomfortable situation Chris really made me feel safe  and treated me like she had known me all my life!", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "111419346864514235851", "name": "Kathryn Garcia", "time": 1534471635378, "rating": 5.0, "text": "Nobody wants to go through a divorce, but Coby and Nikki made a tough situation as pain free as possible! Coby decoded the legal jargon for me and made it easy to understand. They responded quickly, were efficient, and very kind. I would definitely choose them again!", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "110142979541515347795", "name": "Dalton Brown", "time": 1487646152303, "rating": 5.0, "text": "I've dealt with several attorneys in the Huntsville area for years and Kristina Sexton and NXT Law where by far the best I have ever had. Whether I needed legal advice or just someone to talk too she was always their for me. I would more then highly recommend her and her firm. Thank you for everything you have done and continue to do Kristina!!!!", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "114905737315673878346", "name": "R Smith", "time": 1501345072758, "rating": 5.0, "text": "Kris and her staff are very professional, compassionate and smart. They treat you with dignity and respect. I will always use them for all of my legal needs!", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "101607260255416181234", "name": "raymond stemba", "time": 1525462448527, "rating": 5.0, "text": "Kris is a savage! I had one hell of a battle with my ex wife over custody, visitation and of course,$$$. It took 2 years to reach a settlement(out of court) but she was on my side every step of the way. I had fallen into the deepest pit of depression and despair I'd ever been in, but she didnt allow me to roll over and just eat it. She called out the mind games that were being played by my ex.  she wouldn't allow me to get anything less than what I deserved nor be made to look like the bad parent I was accused of being. Thanks again for everything. You rock.", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "110836938433016589018", "name": "jonathan hillis", "time": 1531291803943, "rating": 5.0, "text": "All the staff are friendly, knowledgeable, and take time to understand each situation individually.Kris knows how to get things done and  Hannah Coulter\nParalegal to Kris Sexton and Coby Boswell was always quick to email me back. I would definitely recommend NXTSTEP LAW!", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "100554616944924187758", "name": "Kelsey Black", "time": 1494183168318, "rating": 5.0, "text": "I used Kristina for a child custody case. She was very knowledge and extreamly professional. She is highly recommended for any child custody or child support case.", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "107333999383944163284", "name": "Roxana Zito", "time": 1529210562304, "rating": 5.0, "text": "We had a very sticky situation come up about a year ago. We were tasked with helping a young man get himself out of a very bad unstable family situation. Kris met with us as we had absolutely no idea how or what to do for him. Kris prepared us and helped us navigate the waters from our side. It couldn’t have went smoother.", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "104784278981324994591", "name": "CHRIS JARVIS", "time": 1468377537956, "rating": 5.0, "text": "I recently had need for legal council, something no one desires, but Kris and Coby were understanding, listened and provided great council. Through them I reached the outcome I was looking for. They treated my case with the utmost care and they will for you as well.", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "109442184622846206894", "name": "Kyla Lumpkin", "time": 1534430741229, "rating": 5.0, "text": "I've been represented by Coby for multiple disputes and have always been well represented.  He exudes passion for your case and displays professionalism in the court room.", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "109486635603631802643", "name": "Michelle Mikulka", "time": 1529955580964, "rating": 5.0, "text": "Wonderful people,they helped with with my case by making it fast and easy!", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "106931528053222977943", "name": "Alexis Kelly", "time": 1527770715481, "rating": 5.0, "text": "I didn’t know what would happen or what to expect when we had to enlist legal counsel for our sensitive case. The moment we walked in Nxtstep and spoke with Kris, we knew we were in great hands. Every time we left from speaking with Kris or Coby, we always felt like a weight had been lifted off of us. They both fought extremely hard on our behalf and we whole heartedly know that our outcome couldn’t have been better! We also can’t say enough about their paralegal, Hannah. She was such a blessing by keeping our minds at ease as well as standing beside us every step of the way! The whole Nxtstep team truly cares for you like a family. Nxtstep is all around amazing and we highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "101074778178726818174", "name": "kyle rubley", "time": 1524065212685, "rating": 5.0, "text": "hey has been a very good lawyer and is worth using haven't had any issues he dose what he says he will and won't lie to u", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "114083211033734952991", "name": "Robert Good", "time": 1538317611847, "rating": 5.0, "text": "They were very professional in handling our case and did a great job of breaking the tension", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "101303519887231439861", "name": "Melissa Stamer", "time": 1492479245433, "rating": 5.0, "text": "Knowledgable staff , great to work with.  Gets the job done.!", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "108132356189810594249", "name": "Anthony Gracia", "time": 1520261730570, "rating": 5.0, "text": "If it was not for the professional staff and Attorney's, my case would have been  alot more stressful than I expected.", "pics": null, "resp": null, "gmap_id": "0x88626bccbe9e042d:0x9efc150910bf9489"}
{"user_id": "103370171029155604273", "name": "Kareem McNeal", "time": 1627620767453, "rating": 5.0, "text": "First of all, I can't thank Heather Leonard enough for representing me concerning a serious matter.  She was so professional, thoughtful, caring and hard working on my case.  I could not have had better representation.  I would highly recommend her for anyone that needs representation regarding discrimination  issues in the workplace.", "pics": null, "resp": null, "gmap_id": "0x88892275ceaf6fb3:0x7b1df3061b14954f"}
{"user_id": "116591767391018907917", "name": "Glenda Taylor", "time": 1626440751853, "rating": 5.0, "text": "Heather is a very knowledgeable employment law attorney who works diligently for her clients and does not stop until there is a resolution.  She is kind, intelligent and a hard worker. I highly recommend Heather for your employment law issues.", "pics": null, "resp": null, "gmap_id": "0x88892275ceaf6fb3:0x7b1df3061b14954f"}
{"user_id": "106698333494008360820", "name": "Allen Arnold", "time": 1623081906010, "rating": 5.0, "text": "Heather Leonard is one of the most respected employment law attorneys in the State of Alabama.  She is passionate about pursing her client's claims and one of the most knowledgeable and conscientious attorneys' I know.", "pics": null, "resp": null, "gmap_id": "0x88892275ceaf6fb3:0x7b1df3061b14954f"}
{"user_id": "110655717319314538695", "name": "Ken Thomas", "time": 1606915061747, "rating": 5.0, "text": "If you haven't been down this path before you will be filled with questions.  With Heather, she is very responsive and takes time to answer your phone calls, emails and questions.  Her emphasis in her response is to educate you as to what she is doing and why.  She was always prepared for every meeting that we had but also made sure that I was fully prepared.  Her confidence, experience and knowledge are reflected in everything that she does and allowed me to be very appreciative of her representation.", "pics": null, "resp": null, "gmap_id": "0x88892275ceaf6fb3:0x7b1df3061b14954f"}
{"user_id": "106522503992420325190", "name": "Edward Thomas", "time": 1480434961578, "rating": 5.0, "text": "On a mission to satisfy her clients", "pics": null, "resp": null, "gmap_id": "0x88892275ceaf6fb3:0x7b1df3061b14954f"}
{"user_id": "103829580553929441542", "name": "Steven Davidson", "time": 1618064352881, "rating": 5.0, "text": "Very knowledgeable in wealth management and tax law", "pics": null, "resp": null, "gmap_id": "0x889a89f9036b7537:0xf73015760b3df37d"}
{"user_id": "106571893091190404994", "name": "Ron Koehler", "time": 1590696628810, "rating": 5.0, "text": "Mr. Holt is wise, caring and professional.  He puts his client's needs first and gets excellent results.", "pics": null, "resp": null, "gmap_id": "0x889a89f9036b7537:0xf73015760b3df37d"}
{"user_id": "107469710090456623065", "name": "Lindsey Holmes", "time": 1565964109759, "rating": 5.0, "text": "I would highly recommend LD to anyone looking for legal counsel. They have many years of experience and their success rate for their clients speak for them. They help make the world of legal language make sense to those of us without a law degree. Very happy to be able to work with them!", "pics": null, "resp": null, "gmap_id": "0x889a89f9036b7537:0xf73015760b3df37d"}
{"user_id": "111497691753349064579", "name": "Stockton Builders", "time": 1566430264967, "rating": 5.0, "text": "L.D. is someone you can trust with your important things in life. From business to personal, he helps with years of knowledge in the legal field. Great guy and very professional. I highly recommend L.D. Holt and Associates!", "pics": null, "resp": null, "gmap_id": "0x889a89f9036b7537:0xf73015760b3df37d"}
{"user_id": "108956492838397783134", "name": "Joshua Hembree", "time": 1565882121350, "rating": 5.0, "text": "Attorney L.D. Holt and his team are second to none. They are highly skilled, kind, and professional. I highly recommend them to all my friends and family!", "pics": null, "resp": null, "gmap_id": "0x889a89f9036b7537:0xf73015760b3df37d"}
{"user_id": "113146021585685043090", "name": "Mike & Kathy Estes", "time": 1611257285988, "rating": 5.0, "text": "The man keeps his word", "pics": null, "resp": null, "gmap_id": "0x889a89f9036b7537:0xf73015760b3df37d"}
{"user_id": "114318267869637637924", "name": "Calvin Pearce", "time": 1554053032990, "rating": 5.0, "text": "Awesome attorney and crew", "pics": null, "resp": null, "gmap_id": "0x889a89f9036b7537:0xf73015760b3df37d"}
{"user_id": "109798844665856840708", "name": "James Atkinson", "time": 1513437129452, "rating": 5.0, "text": "Brian is a great lawyer who does a fantastic job as a mediator.  I highly recommend his services.", "pics": null, "resp": null, "gmap_id": "0x887d4867031af54d:0x2d6b62b317d9b37e"}
{"user_id": "106282218690321493986", "name": "Jason Latham", "time": 1521166371481, "rating": 5.0, "text": "It is what it is", "pics": null, "resp": null, "gmap_id": "0x887d4867031af54d:0x2d6b62b317d9b37e"}
{"user_id": "102884497210438357671", "name": "K-BARR 1400 bLOCC", "time": 1553644712702, "rating": 5.0, "text": "Mrs. Ford is super professional and very thorough in her approach for justice. I highly recommend her. -Shawn Hammonds", "pics": null, "resp": null, "gmap_id": "0x88626919d250f559:0x65207342b9a68859"}
{"user_id": "110119210494621888180", "name": "Susan Reed-Killingsworth", "time": 1609831712943, "rating": 5.0, "text": "My favorite attorney in Huntsville!!!", "pics": null, "resp": null, "gmap_id": "0x88626919d250f559:0x65207342b9a68859"}
{"user_id": "105036202230840468441", "name": "Shawnna Williams", "time": 1565746225873, "rating": 5.0, "text": "Very thorough and attentive", "pics": null, "resp": null, "gmap_id": "0x88626919d250f559:0x65207342b9a68859"}
{"user_id": "100038613926463189267", "name": "McKenzie Meeks", "time": 1624032949804, "rating": 5.0, "text": "Nicole has been nothing short of wonderful. I was needing someone to get the ball rolling so my current husband could adopt my oldest son and no one wanted to make the first move but she never hesitated. Nicole has made this entire process smooth and easy and did it all in such a timely manner seriously she gone above and beyond in just two months. I cannot say enough good things about this woman and her crew at her office, next stop court and a name change and we couldn’t be more excited!!!!", "pics": null, "resp": {"time": 1624034312878, "text": "Thank you for allowing us to assist you with this matter. We really appreciate your kind review!"}, "gmap_id": "0x888e8fff97fcb4e9:0xb269649773a0083e"}
{"user_id": "100261508934301372622", "name": "Whitney Rosario", "time": 1600697037804, "rating": 5.0, "text": "I was looking to start the adoption process, and Nicole was referred to me by a friend. Nicole was very informative and did not hesitate to answer any questions I had throughout the entire process. She made it effortless and was reassuring the entire time that everything would workout perfectly, & it did. I am now mom to 3 beautiful little girls. I would not go to anyone else besides her after the experience we had. As poorly described in the review below, Nicole does what is in the best interest for the children and she will tell you that upfront.", "pics": null, "resp": {"time": 1600707520097, "text": "Thank you!"}, "gmap_id": "0x888e8fff97fcb4e9:0xb269649773a0083e"}
{"user_id": "104855443423686296040", "name": "Leah Gamel", "time": 1594472309158, "rating": 5.0, "text": "Nicole Clark was an attorney for my husband in child custody and then myself in the adoption of my husbands children. She went above and beyond for us! We sat down with many lawyers prior to meeting her. Some told us we didn’t have much of a chance and others told us we would have to settle but not Nicole. Nicole knew we had a good case and she fought for us. She was confident, smart, and eager. She made the courtroom setting less scary for us because she had no problem standing up to any lawyer she faced. She answered any questions we had in a timely manner and as soon as the court gave her any information she provided us with it. I am now the adopted mother of 3 beautiful girls! Nicole was worth every single penny spent. I will always 10 out of 10 recommend her.", "pics": null, "resp": {"time": 1597145648678, "text": "Thank you!"}, "gmap_id": "0x888e8fff97fcb4e9:0xb269649773a0083e"}
{"user_id": "104285027359998150050", "name": "Ashley Crim- Smith", "time": 1598146975474, "rating": 5.0, "text": "Nicole is hands down THE BEST!!! We'll never use anyone else again... HIGHLY recommend using The Clark Law Firm for any& all legal needs!!! She's passionate about the law& DEFINITELY will fight tooth& nail to help your case!!!", "pics": null, "resp": {"time": 1600432629069, "text": "Thank you for your review!"}, "gmap_id": "0x888e8fff97fcb4e9:0xb269649773a0083e"}
{"user_id": "106409108669716650373", "name": "ROXANNE MCNEIL", "time": 1613374672697, "rating": 5.0, "text": "I just absolutely loved my lawyer.... she is the BEST!!!!  Thank you Nicole!!!!", "pics": null, "resp": {"time": 1624034344654, "text": "Thank you for your review!"}, "gmap_id": "0x888e8fff97fcb4e9:0xb269649773a0083e"}
{"user_id": "106900611955904632179", "name": "Lisa King", "time": 1597180817454, "rating": 1.0, "text": "She's rude and takes up for people that shouldn't be takin up for. Believes everything that is told to her by  untruthful people. She doesn't believe in keeping family together rather see them torn apart.", "pics": null, "resp": {"time": 1597146063795, "text": "Thank you for your review of our services. However, after an extensive review of our records, it appears that you are not and have never been a client of The Clark Law Office, LLC. Due to confidentiality restrictions, we are unable to discuss your concerns on an open forum such as this. You are welcome to contact our office to discuss your concerns further."}, "gmap_id": "0x888e8fff97fcb4e9:0xb269649773a0083e"}
{"user_id": "112224174887269544464", "name": "Aaron Sprayberry", "time": 1567695940896, "rating": 5.0, "text": "Mrs. Clark provides nothing but top notch, professional service! I would recommend The Clark Law Office for any of your family law needs.", "pics": null, "resp": {"time": 1592588081449, "text": "Thank you!"}, "gmap_id": "0x888e8fff97fcb4e9:0xb269649773a0083e"}
{"user_id": "112436546463521102260", "name": "Kay Fleming", "time": 1619582540919, "rating": 1.0, "text": "This experience was ongoing for 1.5 years.     Very unresponsive lawyer who does nothing for your case.   His representation toward his client is very unprofessional and never called you back to let me know where my case stands.   After Covid hit it was like he took my money and left me high and dry with case.   This is the worst lawyer I’ve ever hired to represent me in a visitation of grandchild whom I had legal visitation file in court.  So now I’m left without seeing my granddaughter for over 1.5 years.   This lawyer should be disbarred from representing anyone.   Very incompetent in this profession.   I would never recommend him to anyone and even had another lawyer refer me to him which wasn’t any better than Mr. Smith.   I’m so unleashed with how this went.", "pics": null, "resp": null, "gmap_id": "0x8889227564f164c7:0x27248d728f74b2d4"}
{"user_id": "103206095998100104117", "name": "Deja Leonard", "time": 1609455615725, "rating": 1.0, "text": "Had a hard time remembering who I was even when he was the one initiating the call. When I called to terminate services, he said that  he had no record that I paid him any money when in fact I paid a little over $500. Not competent enough for cases; he had a hard time understanding and communicating.", "pics": null, "resp": null, "gmap_id": "0x8889227564f164c7:0x27248d728f74b2d4"}
{"user_id": "111803702494656341480", "name": "Tameka Fields", "time": 1481045598205, "rating": 5.0, "text": "This started off as a less than desirable  experience but I'm happy to say that there was a COMPLETE turn around. Mr. Smith did a great job of walking me through the process and getting things resolved. I can finally officially start the next chapter of my life! I would recommend Mr. Smith to anyone in need of a divorce attorney. Thanks again", "pics": null, "resp": null, "gmap_id": "0x8889227564f164c7:0x27248d728f74b2d4"}
{"user_id": "104603644905360742422", "name": "Andrea Mitchell", "time": 1493740610758, "rating": 5.0, "text": "Tim just finished helping me get my daughter back after her father had taken her away from me.  Tim was always so nice and he wasreally good in court.   I appreciated getting copies of everything he did and he even gave his cell phone number in case I needed him during the weekend.  If anyone is ever in the bind I was in get Tim Smith.  He is great.", "pics": null, "resp": null, "gmap_id": "0x8889227564f164c7:0x27248d728f74b2d4"}
{"user_id": "104248126637153268070", "name": "Jeremy Patton", "time": 1445981457830, "rating": 1.0, "text": "Absolutely can not reach him.  My company paid him to give my wife and I a living will, death will, and POA.  I have only received one and it has marks through it so guessing not fully legal.  Even after meeting my wife and I on 2 separate occasions at 1 appointment(there because he said it was all ready) he handed my wife and I divorce paperwork to fill out and walked off.  Had to chase him down once we realized how wrong he was.  My company paid him in March.  It is now October and still not done.  I have to call him every time.  So far have called him 4 times this week with no response.  Horrible lawyer.  Wouldn't use him ever again!  It shows how attention to detail he is.  Google still has him in Hoover.  He moved downtown at least 6 months ago, but he has no clue!!!", "pics": null, "resp": null, "gmap_id": "0x8889227564f164c7:0x27248d728f74b2d4"}
{"user_id": "104173037221253913100", "name": "Aneesh Chand", "time": 1456587585264, "rating": 1.0, "text": "Highly unethical attorney. We chose Tim since he was  a member of our legal plan to represent us in a civil case. After telling us that the plan would not cover our case, we paid Tim a $2500 retainer. During this time Tim would be proactive and mail us copies of whatever documents he would send or file with the courts. I looked over our legal plan and found that his charges should have, in fact, been covered by our plan.Our legal plan's counse determined that this was so and advised Tim of the same. Since being notified that his time would be covered by the plan and  to not use my retainer for covered charges, I stopped getting any correspondence from his office. No copies of any documents,  no phone calls, no more updates, nothing. Tim never even told us that there was a hearing for summary judgement. The  only reason we found out was from a copy of the order from the  court, itself.  After the hearing, we found out that Tim didn't even argue our case as we had discussed. We eventually lost our case. Tim didn't even bother to notify us until over a week later. When asked about our options, Tim determined that he no longer wanted to represent us and referred us to another attorney who wouldn't even return our calls. When asked about the refund of the $2500 retainer, Tim put us off for over 6 weeks until he finally acknowledged he was trying to \"come up\" with the money. Our legal plan counsel had also been contacting him to return our retainer without further delay. Throughout this time and during our case Tim would never initiate contact with us. We had to initiate contact with him. Even then, it would take anywhere from a week and a half to a month before he would respond.  Tim eventually decided after 46 days that he was no longer going to refund our money despite knowing that his charges were covered by our plan. I have yet to get a breakdown of how my retainer was spent, much less anything else. I would never refer him to anyone. Now he is running for circuit court judge. If Tim is representative of our judicial and legal system, then we, as citizens, have very little when it comes to faith in our legal system.", "pics": null, "resp": null, "gmap_id": "0x8889227564f164c7:0x27248d728f74b2d4"}
{"user_id": "107729262705039371430", "name": "susie adams", "time": 1620948567006, "rating": 5.0, "text": "Trustworthy..professional..recommend  Harlan Mitchell", "pics": null, "resp": null, "gmap_id": "0x88628b68060d8341:0x24d8137db7934f44"}
{"user_id": "112687341862671267035", "name": "Summer Tarpley", "time": 1531843918937, "rating": 5.0, "text": "Excellent Attorney! Mr Mitchell has helped me with a few different cases and has done a wonderful job with each of them! I strongly recommend him for all your legal needs!", "pics": null, "resp": null, "gmap_id": "0x88628b68060d8341:0x24d8137db7934f44"}
{"user_id": "105476612427213316376", "name": "laura carroll", "time": 1529953704655, "rating": 1.0, "text": "Hired him about two years ago he only went to court once didn’t do anything for me except make me pay an outrageous amount in child support and visitation one a week when visitation was being cancelled he wouldn’t go back to court nor call me back from the phone calls from me when fired for not doing what he promised. I was then told I couldn’t get any of my money back even though at the beginning I was told if he wasn’t doing his job I could get a full refund back think before you hire him he is the used car sales man in the lawyer community", "pics": null, "resp": {"time": 1531497150995, "text": "I was hired June 11, 2014 to get you visitation with your children after custody of them had been placed with your mother.  On November 18, 2015 a final order was entered giving you visitation and the right to obtain more visitation if you fulfilled certain requirements.  I did not hear from you until the end of June 2018 when you came in inquiring about a refund for a case completed three years prior."}, "gmap_id": "0x88628b68060d8341:0x24d8137db7934f44"}
{"user_id": "102692544222625901878", "name": "Carl Holden", "time": 1571074867341, "rating": 5.0, "text": "He knows his stuff!", "pics": null, "resp": null, "gmap_id": "0x88628b68060d8341:0x24d8137db7934f44"}
{"user_id": "100066162700243039934", "name": "WhiteRachel47 RachelWhiteMovies", "time": 1561077578163, "rating": 5.0, "text": "Great attorney l", "pics": null, "resp": null, "gmap_id": "0x88628b68060d8341:0x24d8137db7934f44"}
{"user_id": "104104324600795720306", "name": "Angela Hunstad", "time": 1558276719336, "rating": 5.0, "text": "Very nice", "pics": null, "resp": null, "gmap_id": "0x88628b68060d8341:0x24d8137db7934f44"}
{"user_id": "104354994163276542614", "name": "Ben Burney", "time": 1570733898893, "rating": 1.0, "text": "Trash lawyer.", "pics": null, "resp": null, "gmap_id": "0x88628b68060d8341:0x24d8137db7934f44"}
{"user_id": "110277738147519548250", "name": "Kingdom First", "time": 1535592783155, "rating": 5.0, "text": "The staff shows real interest in your case and seem like they care.", "pics": null, "resp": null, "gmap_id": "0x88628b68060d8341:0x24d8137db7934f44"}
{"user_id": "111719961422251414422", "name": "Henry Boozer", "time": 1480616743140, "rating": 5.0, "text": "Well experienced, and will get the job done.", "pics": null, "resp": null, "gmap_id": "0x888c2a500781f5c3:0xd1e47709640d2da4"}
{"user_id": "103175554785426972020", "name": "steve tolver", "time": 1552867029111, "rating": 5.0, "text": "Great people", "pics": null, "resp": null, "gmap_id": "0x888c2a500781f5c3:0xd1e47709640d2da4"}
{"user_id": "110192156719232636984", "name": "Johnnie Gray", "time": 1517687339841, "rating": 5.0, "text": "He's the man", "pics": null, "resp": null, "gmap_id": "0x888c2a500781f5c3:0xd1e47709640d2da4"}
{"user_id": "100797197793850253161", "name": "Trey Horton", "time": 1433982163218, "rating": 2.0, "text": "Went in, Very old guy.... I told him about some tax things I would like to take care of. Paid him $500 - he said he was going to the IRS to pull my transcripts (that can be pulled online) the next day so when I met him next I asked to see them. Since he said he spent all day down there getting them and used the $500 I paid him.. . He could not produce them. Never saw them. I asked him what I needed to do, he offered no sort of plan, no sort of advice. Said let's offer them xyz and see what they say.... Give me a break. I can do that myself...   Never went back. hate being lied to. Lost $500 beware...", "pics": null, "resp": null, "gmap_id": "0x888917df8c1c89dd:0x6669c005e7cb1a1e"}
