{"user_id": "118031059858570681304", "name": "Sheila Hensley", "time": 1579563767563, "rating": 5.0, "text": "Mitchell Lattoff took care of my case from day one. I didn't have to worry about anything. An he got me way more then I could of asked for. An always kept me informed and called to see how I was doing. I would recommend him to anyone and everyone. Awesome lawyer that went above and beyond even met me to pick up signed papers and gave me an advance to pay a bill. This is a Godly law firm!!! God bless all who work here and all the clients they encounter.", "pics": null, "resp": {"time": 1595569447934, "text": "Hi Sheila. Thank you for your feedback. We appreciate it."}, "gmap_id": "0x889a4fd76afc9f8f:0xddca84864e19490e"}
{"user_id": "114751973289424637353", "name": "Joyce Edgar", "time": 1554846509085, "rating": 5.0, "text": "The staff at Lattof & Lattof were great. My brother had passed away, and I I had to handle his affairs. Lattof & Lattof secretary walked me through the necessary paperwork that I needed to complete in order to receive his payout from BP. They were efficient and thorough. Thank you.", "pics": null, "resp": {"time": 1555424855649, "text": "Thanks for the review! Let us know if we can ever be of service to you. - Lattof & Lattof, P.C."}, "gmap_id": "0x889a4fd76afc9f8f:0xddca84864e19490e"}
{"user_id": "115755603851154139981", "name": "Kimberley Bosarge", "time": 1543167202131, "rating": 4.0, "text": "I would like to say that I regret writing a previous review of  Lattof and Lattof back in October. I was mistaken with which case they were handling for me. I have actually had one case involving The BP oil spill handled by Lattof and Lattof and was very pleased with the outcome.  Now they are again settling another one that is basically a continuation of the first, and I'm confident that Lattof and Lattof will be just as professional and helpful as the last. So Thanks for providing the level of service to me that I'm definitely pleased with and I would recommend y'all any time.", "pics": null, "resp": {"time": 1536593735206, "text": "Thank you."}, "gmap_id": "0x889a4fd76afc9f8f:0xddca84864e19490e"}
{"user_id": "114960452083175142215", "name": "Saphronia Smith", "time": 1550765627693, "rating": 5.0, "text": "Very professional and competent firm! You are well informed and I was very pleased with the seviices rendered to me. Thank you and God Bless!❤", "pics": null, "resp": null, "gmap_id": "0x889a4fd76afc9f8f:0xddca84864e19490e"}
{"user_id": "106179880889850344498", "name": "Beth Shoener", "time": 1520007327423, "rating": 5.0, "text": "Mitch Lattof Jr. provided outstanding service to our family when we needed to update legal documents.  He was readily available even though we were long distance. I would highly recommend him", "pics": null, "resp": null, "gmap_id": "0x889a4fd76afc9f8f:0xddca84864e19490e"}
{"user_id": "100874212107659325045", "name": "RUPERT English", "time": 1552395096661, "rating": 5.0, "text": "Received damage payments from the BP Oil Spill.  It was a professional experience from beginning to end,  would surely recommend your firm for any like problems.  Was pleased with all the timely correspondence.\n\nThanks, RHE", "pics": null, "resp": {"time": 1605848705995, "text": "Thank you, Rupert! We appreciate it."}, "gmap_id": "0x889a4fd76afc9f8f:0xddca84864e19490e"}
{"user_id": "100908443131008839981", "name": "Carlos Tomas", "time": 1550926585783, "rating": 5.0, "text": "You guys are awesome. Thank you for all you've done. Carlos", "pics": null, "resp": null, "gmap_id": "0x889a4fd76afc9f8f:0xddca84864e19490e"}
{"user_id": "113608505164037027097", "name": "Ivan Boatwright", "time": 1555984271246, "rating": 5.0, "text": "I WAS VERY SATISFIED WITH THE RESULTS", "pics": null, "resp": {"time": 1602759071767, "text": "Hi Ivan. Thank you for your feedback."}, "gmap_id": "0x889a4fd76afc9f8f:0xddca84864e19490e"}
{"user_id": "109528794046824389640", "name": "phil hart", "time": 1517941065835, "rating": 5.0, "text": "Responded to my inquiry in a very timely manner I was most impressed, and the consultation was very pleasant they put me in touch with who could help me best.", "pics": null, "resp": null, "gmap_id": "0x889a4fd76afc9f8f:0xddca84864e19490e"}
{"user_id": "104498316050244710190", "name": "George Dudek", "time": 1552407399608, "rating": 5.0, "text": "Made everything easy for me and efficient.", "pics": null, "resp": {"time": 1605848693863, "text": "Hi George. Thank you for your feedback. We appreciate it."}, "gmap_id": "0x889a4fd76afc9f8f:0xddca84864e19490e"}
{"user_id": "107776958147955024911", "name": "mazie ikner", "time": 1579829845038, "rating": 5.0, "text": "Great lawyer", "pics": null, "resp": {"time": 1590088983082, "text": "Hi  Mazie. Thank you for your review and kind words. We appreciate your feedback."}, "gmap_id": "0x889a4fd76afc9f8f:0xddca84864e19490e"}
{"user_id": "104548135265158111287", "name": "jimmy matthews", "time": 1549475200897, "rating": 5.0, "text": "Excellent", "pics": null, "resp": null, "gmap_id": "0x889a4fd76afc9f8f:0xddca84864e19490e"}
{"user_id": "110860448399331072407", "name": "Tanner-Gean Dowell", "time": 1627084015936, "rating": 5.0, "text": "Ian and Thomas ARE MY TEAM! They were amazing! Made my divorce quick and easy! Very responsive and professional! Will look to Ian for all my legal needs from now on! Held my hand through it all and still responds at the quickest call or E-mail!!! Cannot say how much I am at ease knowing I've got a lawyer team that works FOR me!", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "106808053877852743200", "name": "Lewis McCluer", "time": 1619279026738, "rating": 5.0, "text": "I'm involved in a landlord-tenant dispute and realized I was over my head and needed help. I contacted the Powell Law Firm and got a consultation with Thomas that day. He was very attentive and professional and let me know my options in plain, no nonsense terms. He also let me know that the firm was always available should the matter get to the point that representation became necessary. When I had further questions as the situation progressed, I called back, but was unable to reach Thomas immediately, as he was in court that day. I left a message with their front desk,  and received a call back from Melvin later that day as Thomas was still in court. He listened intently and further advised me as what I needed to do, and even returned another call in regards to my issue. Both Thomas and Melvin were extremely helpful in what was to me new territory as I had never been in a situation like this before. They stood ready to assist any way they could to include retaining their services should the need arise. As a retired Marine with 26 years service I know professionalism when I see it. Hope I don't need to retain an attorney for this current situation but I have full confidence in them should that need arise. I highly recommend that you contact them in the event you fell you may need the services of an attorney/", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "113487847135832316301", "name": "Lisa Edwards", "time": 1626804915412, "rating": 2.0, "text": "I had a 10am appointment to see Mr. Thomas today. It was the worst meeting i have ever had with this company. The young lady at the front desk was more interested in talking to her friend on the phone then greating me when i walked in. after standing there for a few minutes i was told to go have a seat in another room to wait again. as I'm waiting i can hear Mr. Thomas instructing another young associate to go and tell someone to do something and make sure they get it done because that was his money. I'm pretty sure that conversation should not have been discussed in front of a potential client. As I am sitting there explaining to Mr. Thomas why I am there seeking hes services he was more interested in picking the sores on his leg then paying any attention to anything i had to say, and while he was showing me the bruises from his recent jet ski accident all he could tell me was to seek an attorney immediately. I believe that's what I am here. What he ment was i needed a court appointed attorney because I could not afford him. So with Very unprofessional! My family has dealt with Powell Law firm for many years my aunt has know Mr. Thomas sence hes graduation year in 07. They have been wonderful people always willing to help with a smile. till now. So with no help from Mr. Thomas all I can do now is sit back and hope a friend doesn't pass away in lockup because she has a rare condition that causes her to have seizures. I am so disappointed in the actions of Mr. Thomas and the rudeness of the employees at Powell Law Firm.", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "100902628666946632693", "name": "Gregory Dalzell", "time": 1626453525916, "rating": 5.0, "text": "My sister-in-law and wife were trying to figure out what to do with issues related to their father’s estate. It was especially difficult because they are in Virginia and the estate is in South Alabama. They called several South Alabama law firms seeking help and the reactions ranged from lack of response to disinterest in their concern. They called Powell Law Firm and spoke with Mr. Melvin Dixon. Mr. Dixon listened with patient understanding to their problem and did what he could for them with direction from his senior partner. They are very grateful.", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "118330176431002688600", "name": "Karen Ulrich", "time": 1624466088769, "rating": 5.0, "text": "I just needed my questions answered to make sure I was making the correct decision on an eviction process.  He listened and answered all my questions and even offered to help me again.  I am so thankful he was willing to help me without the expectation of money.", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "107951597291764037125", "name": "Patric Landrum", "time": 1616011996713, "rating": 5.0, "text": "I would definitely definitely recommend Ian and the Powell Law Firm to anyone. Ian has assisted my business partners and I on several task for our company.\n\nThe professionalism and service level we reviewed from this team was outstanding. We will absolutely be doing future business with this awesome team.\n\nHighly recommend!\n\nRespectfully,\nGulf Coast Security LLC.", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "106691410347904209936", "name": "Cassandra Karcz", "time": 1616448238393, "rating": 5.0, "text": "I called the Powell Law Firm about a situation that had me in a panic. They were able to get me in quick, and handled my situation immediately! Thomas is great, and put my mind at ease (and gave me a good laugh, while doing so). Their staff is amazing!", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "106786266679158786639", "name": "Sarah Reynolds", "time": 1606271564946, "rating": 5.0, "text": "Thomas handled my case with utmost professionalism and concern for my needs and especially for my children's needs.  He was accessible and always willing to answer my questions directly and honestly, no sugar coating.  This law firm will fight for you as long as it takes. The office staff, especially Kimmie, was always ready to answer my calls and help me with whatever I needed to get accomplished at the time. During the most horrible time of my life, Thomas and Riley stood by my side until the end of this difficult process. I can't thank them enough.", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "109304266640833108957", "name": "Julie Roberts", "time": 1594672264622, "rating": 5.0, "text": "I really really like Thomas Hughes, after meeting with him, and the entire staff they all made me feel comfortable, straight to the point!\nAbsolutely THE BEST LAW FIRM I HAVE EVER DEALT WITH!!!!!! Needs a 10 Star! 👍🏼", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "101476228033013696220", "name": "Valerie Coulter", "time": 1602176984211, "rating": 5.0, "text": "Outstanding crew... They were very Professional, kind, and nice to work with!!", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "102289647367991014496", "name": "FRANK RENTZ", "time": 1584737985155, "rating": 5.0, "text": "The Powell Law Firm did wills for my wife and me. They were very professional and thorough. The work was done in a timely manner. I certainly would recommend them to others. I was very pleased.", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "110280103903710786743", "name": "Amber Middleton", "time": 1565722778130, "rating": 5.0, "text": "The Powell Law firm and their staff have been fantastic through out my divorce and custody issues. Riley Powell has been there to answer any questions I've had and I've sent plenty of emails to his firm and they have all been responded to and in detail.I am always kept up to date and I always feel comfortable in court and in knowing myself and my children's best interest are put first. They truly care and always make sure things are going okay for us!  Riley Powell and Thomas Hughes are hands down the best!", "pics": null, "resp": {"time": 1566253743656, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "112804854970169096855", "name": "Lydia Franz", "time": 1567184014137, "rating": 5.0, "text": "Riley told me the best thing I have ever heard about Attorney's.\n\"You pay an Attorney to worry for you\"\nNot only did he worry for me, he brought my case to the best possible outcome we could achieve. No one ever really wins when you have to take it to court, but the advice and representation that I received made my life better, and we were able to at least bring things to a acceptable conclusion.\nI would highly recommend the Powell Law Firm.", "pics": null, "resp": {"time": 1568451270274, "text": "Thank you for leaving us a review. We appreciate it!"}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "106260565649116410204", "name": "C.C. Moreno", "time": 1595297372723, "rating": 5.0, "text": "Both Thomas and Riley are consummate professionals. With their combined advocacy, I would trust them with anything I needed handled.", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "103890901319725228077", "name": "Doug Jacobs", "time": 1565726681016, "rating": 5.0, "text": "5-Star Performance!  I had a case that took over two years to get completed but it was all worth the effort. Riley Powell has a photographic memory and it pays off in the courtroom. Thanks again for a great job to Riley, Thomas and Kimme!", "pics": null, "resp": {"time": 1566253724942, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "117118563722722065792", "name": "Ashley Hall", "time": 1537728035194, "rating": 5.0, "text": "Riley Powell and staff are amazing. He is more than just an intelligent, skilled, driven, and experienced lawyer although those are noteworthy attributes; he is someone who cares and is passionate about fighting for you. He knows what to say and what to do, and I am grateful God saw fit to put him in my path. I highly recommend Riley Powell.", "pics": null, "resp": {"time": 1566253752448, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "111447719194241910969", "name": "Peggie Montgomery", "time": 1587768374913, "rating": 1.0, "text": "Costly and he did not represent our son as promised.  A lot of hot air!", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "112634507670671020646", "name": "Earl Suhre", "time": 1575327795549, "rating": 5.0, "text": "Mr. Powell & Thomas were Amazing in the case they were handling for us !!!! We cannot Thank Them enough ! They went above & beyond . The Best Attorneys Ever !", "pics": null, "resp": null, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "102927331386640173175", "name": "Serendipity Sharra", "time": 1529039036799, "rating": 5.0, "text": "Met with the owners on a job interview and I can honestly say they were two wonderful, friendly, honest, and smart men. I didn't get the job but they were kind and honest with that too. I would highly recommend them and will certainly go see them if ever I am in need of a lawyer.", "pics": null, "resp": {"time": 1566253778635, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "106713700146633879124", "name": "Amy Elliott", "time": 1565811262181, "rating": 5.0, "text": "Riley Powell and the attorneys at the Powell Law firm are professional, knowledgeable, honest and will fight for you!  I appreciated them being so caring, and keeping me informed during my case.", "pics": null, "resp": {"time": 1566253715758, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "111700835149697040103", "name": "Donna Michelle Wade", "time": 1528082860564, "rating": 1.0, "text": "Absolutely horrible representation . I gave them $1800 cash for a simple divorce, asked for no desperation of assets, no children involved. Simple divorce that was us mail paperwork, and showing up for final dissolution court hearing. Now they are trying to extort another $625 out of me. Maybe they are \"great\"  for their rich and privaledged clients, but have no heart or soul for your everyday person. I ran home from an extremely abusive relationship and chose them because they were close by. My mistake . Do your homework and chose a attorney based on your needs, not their's.t", "pics": null, "resp": {"time": 1566254154668, "text": "Thank you for taking the time to leave us a review. Although it is difficult to hear negative feedback, without receiving reviews we can't improve our services in order to provide the best legal services for our clients. From your review, we looked at how we communicate expectations of fees with clients in more detail so there are no surprise fees from filing. We truly appreciate you took the time to leave us a review and hope you are doing well."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "103180079001744797172", "name": "Arjen Meter", "time": 1529355941422, "rating": 5.0, "text": "The Powell Law Firm has always handled any issue, question, or legal concern my family and I have came to them with quickly. I couldn’t imagine using anyone else.", "pics": null, "resp": {"time": 1566253761952, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "110012305343759381325", "name": "Christi Wallace", "time": 1565723246415, "rating": 5.0, "text": "Highly recommend Powell Law Firm. And the staff is very friendly.", "pics": null, "resp": {"time": 1566253733407, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "104770225365755219357", "name": "Ray Ainsworth", "time": 1504141749277, "rating": 5.0, "text": "Awesome attorney!! Always there when you need them. Recommend to everyone we know.", "pics": null, "resp": {"time": 1566253809574, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "103194917123923915953", "name": "Sherry Lucas", "time": 1553786294559, "rating": 1.0, "text": "Absolutely horrible attorney for custody disputes. Made my case an absolute nightmare because of no communication with me unless he wanted more money.", "pics": null, "resp": {"time": 1566254006822, "text": "Thank you for bringing this to our attention. While no one likes to hear negative comments, we sincerely need to know when we fall short in our clients eyes. Our goal is to achieve Justice for every client and provide excellent representation. From your suggestion, we have looked at how we streamline communication with clients and this is why feedback is so important. Thank you for taking the time to leave us a review."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "111708988510646622173", "name": "Liberty Avera", "time": 1502310460290, "rating": 5.0, "text": "Very professional and helpful attorneys! Would recommend them to anyone!", "pics": null, "resp": {"time": 1566253816322, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "111245771268094104840", "name": "Judi Grant", "time": 1495462706390, "rating": 5.0, "text": "Great attorney!!! I would definitely recommend him!", "pics": null, "resp": {"time": 1566253827858, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
{"user_id": "112069465183014736856", "name": "Jennifer “Dixie” Phillips", "time": 1445644656960, "rating": 5.0, "text": "Great attorney", "pics": null, "resp": {"time": 1566253836686, "text": "Thank you for leaving us a review. We Appreciate it."}, "gmap_id": "0x889a05391561af1d:0xe79b710db5737374"}
