{"user_id": "102296620007327705333", "name": "Angie B", "time": 1609377193671, "rating": 1.0, "text": "I paid for a gift card and scheduled an appointment which was never rendered. There was no call or no show. I found out that the business had closed down and no longer in service, as well as the number listed is not associated with this company anymore.\n\nThe person that left a comment that she had a great experience 2 months ago is not telling the truth. This place is no longer at that location, I checked it out and I also left several messages unresponsive. I have a gift card I cannot use. If she has a location for this business please share it or remove your false post. Thanks!", "pics": null, "resp": null, "gmap_id": "0x88626bb8d14c7b93:0x9bbfde458e9ef633"}
{"user_id": "107117182783023330796", "name": "Brett Ball", "time": 1592944983775, "rating": 5.0, "text": "These guys are fantastic.  I used them for a pre-owned BMW x5 I bought that needed a little love.  Courteous, professional, and work fast.  Had the vehicle looking almost new in an hour.  Great value since I only ordered the Wash and Wax. I will be using them in the future for all my detailing needs.  Thank you Rocket City Mobile Detailing!", "pics": null, "resp": null, "gmap_id": "0x88626bb8d14c7b93:0x9bbfde458e9ef633"}
{"user_id": "108478258155224680091", "name": "Heather Bookout", "time": 1604003743963, "rating": 5.0, "text": "I am so impressed! My car looks better than when I bought it!  I even had dried slime putty my kids left in the backseat and it looks like new!!!!", "pics": null, "resp": null, "gmap_id": "0x88626bb8d14c7b93:0x9bbfde458e9ef633"}
{"user_id": "103736603479667299637", "name": "Stephanie Key", "time": 1546030069461, "rating": 5.0, "text": "These guys are awesome!! They picked up and returned my car exactly when they said they would. Each person that spoke to me was friendly and very professional. They made this so easy for me by bringing a tablet and accepting a credit card, and they did a fantastic job on my interior. It was a mess. It blew me away what they were able to do. Thanks, guys!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNnEUNOIBGIvDPs314C9F5EIq1rbd-zcNSXBm17=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626bb8d14c7b93:0x9bbfde458e9ef633"}
{"user_id": "116650759232968051317", "name": "Dawn Carignan", "time": 1594233598002, "rating": 1.0, "text": "I gave a one star because it would not allow me to not select at least one of them. I went online to schedule an appointment and got an email stating that they are reviewing my request and I would get another email confirming my appointment. Well I still haven't gotten an email and my scheduled appt was 38 minutes ago. No call no show no nothing. I don't know if there is an issue with the company or the scheduling online. I did call the number on my email and left a voice mail at 9:30 this morning. At 1:30 I got a text from that number saying wrong number. I will NOT be scheduling with this place again. I will use someone else if this is how you conduct your business.", "pics": null, "resp": null, "gmap_id": "0x88626bb8d14c7b93:0x9bbfde458e9ef633"}
{"user_id": "101811892910132521710", "name": "Megan S", "time": 1575817962601, "rating": 5.0, "text": "Cannot say enough good things about this place. The nicest staff, they work fast and efficient and my car is always beautiful! I tell friends and co-workers to go here because it is the best place around for car detailing. Thank you for the best service!", "pics": null, "resp": null, "gmap_id": "0x88626bb8d14c7b93:0x9bbfde458e9ef633"}
{"user_id": "116385553823265819259", "name": "Zachary Hamm", "time": 1569508665931, "rating": 5.0, "text": "Wanted to just give a quick run down of how attention to detail is a top priority with the guys here at Rocket City. They turned our 3 year old SUV (never been properly detailed) with wear and tear of two kids back to better than showroom shine. Went with the full detail including the engine clean and again was not disappointed. Can't say enough about these guys and will be making the drive back after the winter season in the south.", "pics": null, "resp": null, "gmap_id": "0x88626bb8d14c7b93:0x9bbfde458e9ef633"}
{"user_id": "114649154878169931797", "name": "ShannonKay", "time": 1601055989872, "rating": 1.0, "text": "They won’t answer the phone or Facebook messages or email back.", "pics": null, "resp": null, "gmap_id": "0x88626bb8d14c7b93:0x9bbfde458e9ef633"}
{"user_id": "103384901649577317902", "name": "Aaron Keen", "time": 1550188371672, "rating": 5.0, "text": "I received a gift card for an interior detail and now I wish I would have used it sooner! Do not let the location of this shop fool you! The service that I received was amazing and I definitely will return. I forgot to show the gentleman that cleaned my car what I was considering to be my worry spots, when I got my car back he clearly saw the same spots that I was seeing and the inside of my car looks brand new! Definitely check them out.", "pics": null, "resp": null, "gmap_id": "0x88626bb8d14c7b93:0x9bbfde458e9ef633"}
{"user_id": "114644419408324743444", "name": "Erika Brooks", "time": 1502735074027, "rating": 4.0, "text": "I'm by no means an expert at auto detailing so I'm unsure how to rate properly BUT when I received my car, I thought it looked very clean and well done. I was getting my car ready to sell so I got the complete detail. The vacuuming was very nice. The only places I saw any kind of debris were some spots under the seats that would require removing the seat in order to clean and that is unrealistic. The wash, wax, and wipe down of everything was nicely done. The seats were shampooed and the cleaning of the seats were great but I would suggest getting a plastic film to put on the seats in case they are still damp. Mine were slightly moist (which I understand they won't completely dry in 4 hours) and when I got home my clothes were also a little moist but this isn't a rating breaker for me. I have a white dog that sheds a lot so I was impressed that they were able to clean the car well enough to where I only saw a couple of straggler hairs around the car. The only thing I did not like was when I got there at 7:00 am, I was greeted by an employee that had no idea about my appointment so I had to re-explain everything and that wasn't a professional first impression in my eyes. Other than that, I think the car turned out great!", "pics": null, "resp": null, "gmap_id": "0x88626bb8d14c7b93:0x9bbfde458e9ef633"}
{"user_id": "105675513562346201349", "name": "Stephanie Newton", "time": 1479601289074, "rating": 5.0, "text": "I have never been to Rocket City Buffing & Auto Detailing or had my car professionally cleaned. I called ahead of time to ask some questions and spoke to Sylvester. He answered all of my questions and was very polite.\n\nWhen I arrived, the staff were all friendly and I left my car to have a full detail. I was very happy with the results! The car is super shiny! I had a lot of old stains in the seats and they were able to get most of them out and the others look much lighter. They even removed tar stains from underneath the car that had been there for over a year without me asking for it first. The interior is spotless and the wax looks awesome! They even cleaned the engine compartment and the wheel well.\n\nI have already recommended them to my friends and will definitely be back! Thanks!", "pics": null, "resp": null, "gmap_id": "0x88626bb8d14c7b93:0x9bbfde458e9ef633"}
{"user_id": "108361019236935127590", "name": "Siddharth Patel", "time": 1542830410995, "rating": 4.0, "text": "Sylvester and his buddy did a very good job in cleaning interior and exterior of my car. When I raised a concern regarding my car headlights a couple of days after my car was taken care of, they took it back for redoing it and returned with better results. Very soft spoken and responsive. They provided car pick up and delivery services.\n\nI would definitely go back there whenever I need their service next time.\n\nWhy I took 1 star off: A very minor residual stains in the interior of roof and passenger seat (which could very well be resistant to cleaning). But overall, a very good job.", "pics": null, "resp": null, "gmap_id": "0x88626bb8d14c7b93:0x9bbfde458e9ef633"}
{"user_id": "104604082884063363571", "name": "Cindy Green", "time": 1540740720210, "rating": 5.0, "text": "Talking about going the extra mile... I called from out of state to see about a gift card for my son which can be nerve wracking when you think about giving your credit card info to a place you don't know. I was also concerned about how I could get it to him in time for his birthday in 3 days. But I was so thrilled when Sylvester offered to hand deliver to my son's home (10 miles away) which he did on his birthday with a balloon no less.  Puts my faith back into humanity. Thanks again Sylvester, I hope your boss is reading this.", "pics": null, "resp": null, "gmap_id": "0x88626bb8d14c7b93:0x9bbfde458e9ef633"}
{"user_id": "101926267862813640950", "name": "Harmony F", "time": 1566308378870, "rating": 5.0, "text": "Great place!  Very honest and kind people.  I recommend their service.", "pics": null, "resp": null, "gmap_id": "0x88626bb8d14c7b93:0x9bbfde458e9ef633"}
{"user_id": "116812033913110210604", "name": "Crystal", "time": 1598630168789, "rating": 5.0, "text": "NO LONGER IN SERVICE. NUMBER ONLINE IS INCORRECT", "pics": null, "resp": null, "gmap_id": "0x88626bb8d14c7b93:0x9bbfde458e9ef633"}
{"user_id": "116342080308557513785", "name": "Franklin Jones", "time": 1464889485879, "rating": 4.0, "text": "This first car I took there it was an outstanding job from top to bottom engine and all. I believe Sylvester was the one that did it. The second car was done by someone else and it was not that great, what you would expect from asking your kid to clean out and vacuum the car. If you are going to go I would recommend making sure you get the right person", "pics": null, "resp": null, "gmap_id": "0x88626bb8d14c7b93:0x9bbfde458e9ef633"}
{"user_id": "111082629280001041449", "name": "Wendy Metia Gardner", "time": 1551125746640, "rating": 1.0, "text": "I had bought a groupon for a car detail today.  I finally found where it was 10 minutes prior to my appointment.  It’s a Texaco.  There was nobody there.  I called the number on the side of the old car wash part of the Texaco that doesn’t even face the road.  No answer.  I left where was I supposed to wait for my car.  The gas station?  I got duped!!!!  Very upset.  That’s definitely not anywhere I would leave my car!", "pics": null, "resp": null, "gmap_id": "0x88626bb8d14c7b93:0x9bbfde458e9ef633"}
{"user_id": "106943538195882311387", "name": "Liz Lawson", "time": 1554827655627, "rating": 5.0, "text": "My car looks like a new car!! They were professional and very nice. Will definitely be back and will recommend!!", "pics": null, "resp": null, "gmap_id": "0x88626bb8d14c7b93:0x9bbfde458e9ef633"}
{"user_id": "115376621772973518515", "name": "Elle Perkins", "time": 1497049554594, "rating": 5.0, "text": "Amazing!  Made my 11 year old SUV look virtually brand new!  Great work!  Great customer service.  My new go to for car cleaning needs.", "pics": null, "resp": null, "gmap_id": "0x88626bb8d14c7b93:0x9bbfde458e9ef633"}
{"user_id": "100816762974740777696", "name": "Brandon Wasdyke", "time": 1547315335831, "rating": 5.0, "text": "It might be a small Towne auto detailing shop but it's results are outstanding. I highly recommend going here for an affordable and fast auto detailing.", "pics": null, "resp": null, "gmap_id": "0x88626bb8d14c7b93:0x9bbfde458e9ef633"}
{"user_id": "111415364281953054248", "name": "Angelica -Angel- Elizabeth", "time": 1562263537404, "rating": 5.0, "text": "They do a really good job, charge a fair price and have good customer service.", "pics": null, "resp": null, "gmap_id": "0x88626bb8d14c7b93:0x9bbfde458e9ef633"}
{"user_id": "100811404276086458720", "name": "Annette Joplin", "time": 1407195007018, "rating": 5.0, "text": "I am so pleased with the work that Sylvester and his guys did on my vehicle to restore it's appearance, it makes me proud to drive it again. Awesome job guys...I will be back!", "pics": null, "resp": null, "gmap_id": "0x88626bb8d14c7b93:0x9bbfde458e9ef633"}
{"user_id": "111794797949727593465", "name": "angel starlin", "time": 1526928550467, "rating": 5.0, "text": "Excellent customer service  will go the extra mile to have your car looking brand new", "pics": null, "resp": null, "gmap_id": "0x88626bb8d14c7b93:0x9bbfde458e9ef633"}
{"user_id": "105807671804565530997", "name": "Oree Tanking", "time": 1483292388846, "rating": 5.0, "text": "These guys are super thorough with their cleaning. I brought a second hand car that needed a lot of help and they did a great job", "pics": null, "resp": null, "gmap_id": "0x88626bb8d14c7b93:0x9bbfde458e9ef633"}
{"user_id": "111284369930824114459", "name": "Dorothy Peters", "time": 1485463133433, "rating": 5.0, "text": "We took our car here and they did a great job! Will definitely come here again next time we need any of our vehicles detailed ☺️", "pics": null, "resp": null, "gmap_id": "0x88626bb8d14c7b93:0x9bbfde458e9ef633"}
{"user_id": "103257007356333806486", "name": "Stephanie Kloe", "time": 1563627389833, "rating": 1.0, "text": "Had to give a 1 star only because the guy never opened the shop for my apt. Waited 30 minutes with my husband.", "pics": null, "resp": null, "gmap_id": "0x88626bb8d14c7b93:0x9bbfde458e9ef633"}
{"user_id": "118081324238228548629", "name": "Jeff Hicks", "time": 1453208413073, "rating": 5.0, "text": "They did a fantastic job on my neglected LX470. I didn't know my paint could look so good!  Would recommend them to anyone!", "pics": null, "resp": null, "gmap_id": "0x88626bb8d14c7b93:0x9bbfde458e9ef633"}
{"user_id": "116027405772488062153", "name": "Grayson Everett", "time": 1520991915790, "rating": 5.0, "text": "Great service; high quality interior & exterior detail", "pics": null, "resp": null, "gmap_id": "0x88626bb8d14c7b93:0x9bbfde458e9ef633"}
{"user_id": "101034107367088560038", "name": "Laura Satcher", "time": 1411077856861, "rating": 5.0, "text": "got our car and SUV cleaned by Sylvester from a Living Social coupon- hard working guy and did a great job. I am taking our vehicles back for him to clean again after several months since he did so well initially.", "pics": null, "resp": null, "gmap_id": "0x88626bb8d14c7b93:0x9bbfde458e9ef633"}
{"user_id": "109607002176429444050", "name": "Mike Broman", "time": 1497973264438, "rating": 5.0, "text": "This is the place to go for detailing in Huntsville. They made my car look brand new!", "pics": null, "resp": null, "gmap_id": "0x88626bb8d14c7b93:0x9bbfde458e9ef633"}
{"user_id": "100749818678627341562", "name": "Mark Ballard", "time": 1572107663305, "rating": 5.0, "text": "I had my Sis clean in my Mustang convertible. They did an excellent job I will be back", "pics": null, "resp": null, "gmap_id": "0x88626bb8d14c7b93:0x9bbfde458e9ef633"}
{"user_id": "104954955049034964567", "name": "John Patrick Scully", "time": 1424441455917, "rating": 5.0, "text": "They did a fantastic job. I didn't know my van could get this clean.", "pics": null, "resp": null, "gmap_id": "0x88626bb8d14c7b93:0x9bbfde458e9ef633"}
{"user_id": "117736401438505521100", "name": "Kôrs Kiing M.T.B Family", "time": 1534535448804, "rating": 1.0, "text": "Horrible service only two people working and the quality of work below sorry ... Close up shop and try something else", "pics": null, "resp": {"time": 1534552691390, "text": "Sorry to hear that you had a bad experience. There was a 60% chance of scattered thunderstorms today (8/17/18) therefore we didn't staff as many people as normal. Feel free to give me a call directly at 256.665.6410 if you would like to discuss more about your experience.\n\nSylvester"}, "gmap_id": "0x88626bb8d14c7b93:0x9bbfde458e9ef633"}
{"user_id": "112134516023113586435", "name": "San", "time": 1513613013470, "rating": 5.0, "text": "Great hand wash for less", "pics": null, "resp": null, "gmap_id": "0x88626bb8d14c7b93:0x9bbfde458e9ef633"}
{"user_id": "113198811679643556521", "name": "BC CANTOR", "time": 1535937616064, "rating": 4.0, "text": "Fare for the money", "pics": null, "resp": null, "gmap_id": "0x88626bb8d14c7b93:0x9bbfde458e9ef633"}
