{"user_id": "117814971098142416289", "name": "Modular Nut", "time": 1601668528250, "rating": 5.0, "text": "By far the most responsive and honest dealer we have encountered.", "pics": null, "resp": null, "gmap_id": "0x88892f82bfffffff:0xe5ce71cf555a1329"}
{"user_id": "110500364744944453979", "name": "Martha Chastain-Womble", "time": 1590528219244, "rating": 5.0, "text": "They're awesome!", "pics": null, "resp": null, "gmap_id": "0x88892f82bfffffff:0xe5ce71cf555a1329"}
{"user_id": "105446184082013650092", "name": "Matt Corbin", "time": 1590601569617, "rating": 5.0, "text": "Rose is the best!!", "pics": null, "resp": null, "gmap_id": "0x88892f82bfffffff:0xe5ce71cf555a1329"}
{"user_id": "118090487163929673139", "name": "Jerry Vazquez", "time": 1563828056378, "rating": 3.0, "text": "Ok", "pics": null, "resp": null, "gmap_id": "0x88892f82bfffffff:0xe5ce71cf555a1329"}
{"user_id": "115468111801549939743", "name": "Mike Cofield", "time": 1624993388312, "rating": 5.0, "text": "We made the decision to purchase from Oxford Housing and we are so glad we did. These folks are good people to do business with; honest and trustworthy, they delivered on everything just as we expected. From sales, delivery/set-up to follow up and adjustments we are very satisfied with our new home as well as the process to have it constructed, delivered and set-up.  If you are considering the purchase of a manufactured home, I would highly recommend giving Oxford Housing Inc. the opportunity to serve you. This home-buyer is certainly glad he did.", "pics": null, "resp": null, "gmap_id": "0x888bb13ba4faced1:0x76ea95a96d80de16"}
{"user_id": "115231958418091318251", "name": "Samantha F", "time": 1615694994933, "rating": 5.0, "text": "Best customer service and help from this place.  We dealt with a lot of mobile home dealers and so did my family.  Choose Oxford housing!", "pics": null, "resp": null, "gmap_id": "0x888bb13ba4faced1:0x76ea95a96d80de16"}
{"user_id": "104595146916006685019", "name": "Amber Johnson", "time": 1605994715445, "rating": 5.0, "text": "Best group of guys anyone could ask for", "pics": null, "resp": null, "gmap_id": "0x888bb13ba4faced1:0x76ea95a96d80de16"}
{"user_id": "101071568236170059439", "name": "Cindy Herrell", "time": 1570036679238, "rating": 1.0, "text": "We bought a new House from Oxford housing in Oxford als Eric the owner did everything he Said he Would do they came out and Took care of Any concerns we Had. Totally Professional enjoyed doing Business with them i would definitely reccomend them", "pics": null, "resp": {"time": 1572716602427, "text": "Thank you for the kind words. But why only one star?"}, "gmap_id": "0x888bb13ba4faced1:0x76ea95a96d80de16"}
{"user_id": "107694216665476071043", "name": "Shelton Morrow", "time": 1514497128238, "rating": 5.0, "text": "Great people with quality homes", "pics": null, "resp": null, "gmap_id": "0x888bb13ba4faced1:0x76ea95a96d80de16"}
{"user_id": "108538566238630362722", "name": "Roma Na", "time": 1526130320659, "rating": 5.0, "text": "(Translated by Google) Excellent\n\n(Original)\nExcelente", "pics": null, "resp": null, "gmap_id": "0x888bb13ba4faced1:0x76ea95a96d80de16"}
{"user_id": "106542884609687224644", "name": "Meaghan Mccool", "time": 1626644922985, "rating": 5.0, "text": "I started my journey with Regional Homes and Mike Morris in 2020. I didn't purchase until 2021, but both times I worked with Mike. He was nice, willing to show my whatever I wanted to look at (both times), never rushed me, always responsive and has stayed on top of the contractors to make sure everything after the purchase gets completed (Plumbing, A/C, steel improvements, etc). I had already been pre-approved prior to coming back to Mike in 2021, but he recommended me do an app with another company because he felt like I would get a better deal - and I did. It made a HUGE difference in $$ down and my monthly payment. I can't say enough good things about Mike.", "pics": null, "resp": {"time": 1626704916860, "text": "Meaghan we are so happy to hear that you found your forever home with Regional Homes of Northport. We cannot thank you enough for the amazing review and kind words! We hope you enjoy your new home!"}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "100748682639598478127", "name": "Rocker Johnson18", "time": 1623635861419, "rating": 5.0, "text": "Good place to do business very fair and honest", "pics": null, "resp": {"time": 1623681584954, "text": "Rocker, thank you so much for the great review and kind words! We are happy to hear that you had an extraordinary experience with us."}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "108003567873242740327", "name": "Whisper Gray", "time": 1626045243765, "rating": 5.0, "text": "Great Sales and service", "pics": null, "resp": {"time": 1626116301851, "text": "Thank you so much for the awesome review and kind words. We appreciate it and happy to hear that you had an exceptional experience with Regional Homes of Northport."}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "110000838851750422870", "name": "flow Holloway", "time": 1583638397027, "rating": 4.0, "text": "They have a nice selection and a nice staff. Would like it a little better if I could look in peace and not be followed by an employee like I need a babysitter. My spouse and I would like to discuss these major decisions and what we like and dislike in private. But I will say they are friendly.", "pics": null, "resp": {"time": 1597778547981, "text": "Thank you Flow for your feedback! We appreciate learning how to better our customers experiences at Regional Homes."}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "106392735259004905417", "name": "Wanda Goolsby", "time": 1596130725286, "rating": 5.0, "text": "Great, professional representatives.  Spent over an hour with us showing us homes and giving us all types of good information about each hlme.", "pics": null, "resp": {"time": 1596134576724, "text": "Thanks so much for the kind review!"}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "111039789807974283337", "name": "Sarah Frances Long Wyatt", "time": 1618804950170, "rating": 4.0, "text": "Very helpful.", "pics": null, "resp": {"time": 1618863725331, "text": "Thank you Sarah for the kind words and great review! We appreciate it!"}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "113115848143914044926", "name": "Sonny Harbin", "time": 1614753966120, "rating": 5.0, "text": "Great place friendly staff", "pics": null, "resp": {"time": 1597778429009, "text": "Thanks so much for the awesome review!"}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "112165458397658378921", "name": "Jimmy Snider", "time": 1580771035181, "rating": 1.0, "text": "Salesman says there all the same.  Well  if that is so you should just have one home to look at. Bought my home elsewhere that didn't mind showing me different homes and asking questions about what I  wanted.", "pics": null, "resp": {"time": 1597778670888, "text": "I'm sorry to hear your experience wasn't great. Our number one priority is to meet and exceed expectations at every interaction. We would love for you to contact us so we can learn how best to improve going forward. Thanks in advance!"}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "103868440823013845805", "name": "Michael Musso", "time": 1591458469577, "rating": 5.0, "text": "James Jones will help you select the right home for your individual needs and wants. He is a great listener and wants to help people make their home ownership dream come true.", "pics": null, "resp": {"time": 1597778463199, "text": "Thank you Michael for the kind words! We appreciate your feedback!"}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "110772888340984072834", "name": "Hannah Lagrone", "time": 1562968853137, "rating": 1.0, "text": "I HIGHLY do not recommend going through Cumberland Homes. They put up a good front to get business from you but definitely do not care about your business. It took them almost a month and a half to set up our trailer; trim, fix cracks they put in the walls, etc. We literally had to beg, call every day, and do everything short of pulling to teeth to get them to finish setting up our trailer.  We were supposed to get a washer and dryer from them, they tried to con us out of it. We signed a contract that we had to get our own contractor to do the dirt pad.. the owner sent his family member to our house who 1. Did not know the measurements of our trailer, did a horrible job. 2. Just to try to con us out of money and we ended up having to pay another contractor to fix what they messed up. If I could give them 0 stars I definitely would. I highly suggest taking your business somewhere else. Save your money and just build a house y’all it is not worth it.", "pics": null, "resp": {"time": 1565209932210, "text": "When we trim a sheet rock house we wait until you get the power and water hooked up. it took you about 3 weeks to get the power and water to the house. When we began to trim the house, we discovered the factory did not ship all the parts, we had to order those parts. We ordered parts, received parts and trimmed your house out within two weeks of you getting power and water. You watched contractor build the site all day and at the end of the day you did not pay, and said you where not gonna pay. So that contractor did not finish. We waited on you to finish since you said that you wanted to do your own site prep. You did nothing to the site so we hired a contractor to finish the site prep. The second contractor cost about the same as what the washer and dryer cost. We asked you if you would trade the washer and dryer for site prep. So we tried to get you to pay for the site prep, you said that you would. We let you have the washer and dryer. You still have not paid for any portion of the site prep. So now you write a bad review after not paying from two different people. I would delete this review because it makes you look far worse."}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "105913870298086701782", "name": "David Mcdougal", "time": 1593480372593, "rating": 1.0, "text": "Purchased a double wide Clayton Home. We had only seen it on the video due to COVId 19. My wife spent a week (a solid 40 plus hours) trying to satisfy the requirements of the mortgage company. She couldn’t so she called to tell the salesman that we would be unable to purchase the home. He replied with, well send me what you have, I usually deal with them anyway. So the mortgage got approved. I was told by my salesman that he had gotten us approved with no payment for 90 days. One of the guys at the mortgage company actually laughed when I told him I was told 90 days no payment. We go sign papers 4/21 and cannot sign the papers in our home because they have started prepping it for delivery. We had to be out of the house we were renting so ok, this should be quick and easy. We were told a few weeks to MOVE in. It took a month just to deliver a ready home!That was 5/15. We moved in 6/10. I asked the salesman while looking him in the eyes if I would need to arrange to have the power, water, or septic tank connected. His reply to me was “no, we handle all that and it’s financed in”.\nSo Regional sends a man out to make our dirt pad. Supposed to be paid for in the mortgage. Guy says we need 17 loads of dirt and that we will have to either get the dirt or we could pay him around $2000 on top of what Regional was paying him for the pad work. Our lot is not that Unlevel to start with. We hired our own guy who did the pad and supplied the dirt for what Regional was going to pay their guy. They called our guy 4 times a day for a week till it got done. We are then told it was going to be another week before they delivered our home. That week comes and we are told for 5 straight days “ it’s gonna be delivered tomorrow, I promise” and it didn’t show till the end of the following week. And my wife drove an hour one way every day to meet them as she was told one of us would need to be there.So we get the septic tank installed and the water meter installed. We call our salesman to let him know and we are told that we have to provide someone to hook that up. So we get power and make the call to get our AC installed. No reply for over a week. We try to reach the general manager and can only leave messages because he is always busy and apparently doesn’t return calls between meeting (or ever). On day 3 of asking for him, the guy says, you keep calling, is there something I can help you with?. So we find out that he is the guy who arranges the AC and underpinning and finish work. He claims he hasn’t been told we had power and were ready for AC install and underpinning but he would get right on it even though three days before my wife had texted the salesman and he said he’d let them know.He called back 3 days later and said he had it set up for Monday. Monday comes and is almost gone so we call him back. He says he doesn’t know where they are and gives us the number to the AC company. They advised us that they had nothing scheduled for us to install. They simply told him they would have the unit in stock on Monday. Now the AC folks did a great job. They had a cancellation and came a day earlier than the appointment they made with us actually. I am about to make my second payment and the house is still not underpinned and we have heard nothing from the manufacturer as to when they are coming to fix all the broken drawers and the screwed up electrical. If you turn off the light outside the laundry room door to the outside, none of the lights in the living room will work.\nLong story I know but I will live in a cardboard box before I buy another home from Regional Mobile Homes in Northport. We are now being told it will be another 2 to 3 weeks before they come do our underpinning. Oh and there is absolutely nothing holding this home to the ground. No straps or anchors. The Alabama Mobile Home  commission  says that it acceptable , but I have never seen a mobile home in Alabama that wasn’t strapped and anchored. They will do the minimum they can do. Not above and beyond like they say on the website. I wish I could give them negative stars.", "pics": null, "resp": {"time": 1597778398373, "text": "Hey David - I’m sorry you were unhappy with the service you received at Regional Homes. Our number one priority is to meet and exceed expectations at every interaction. Since we don’t have much control over the manufacturer servicing, we do everything in our power to get issues resolved for you quickly but that’s not always the case. We will keep working hard to get these issues taken care of more promptly!"}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "114431329567154214632", "name": "Wynn Thornhill", "time": 1594843893214, "rating": 5.0, "text": "Great inventory to view. Friendly staff!! Highly recommend!!", "pics": null, "resp": {"time": 1597776526595, "text": "Thank you Wynn for the kind words!"}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "116481177641358374185", "name": "Jenna Madison", "time": 1554318482844, "rating": 5.0, "text": "Excellent experience when our family purchased our Deer Valley Home from Cumberland.  Couldn't be more pleased with the overall experience from designing our own floor plan, to delivery and set-up, to finishing with the Deer Valley trim-out crew.  Would highly recommend to anyone.", "pics": null, "resp": {"time": 1556630714454, "text": "Thank you Jenna for the review."}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "113613270801219195832", "name": "Ashley Peters", "time": 1616107612992, "rating": 5.0, "text": "Beautiful homes!", "pics": null, "resp": {"time": 1618863781752, "text": "Thank you so much Ashley for the amazing review and kind words. We appreciate it!"}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "105094727113250178203", "name": "Andrea Deason", "time": 1553712480321, "rating": 5.0, "text": "Mr. James Jones is an excellent salesman. From the time I stepped into his office in November until the final checklist of repairs was sent to him in March, he has made my buying experience extremely pleasant. He sat down with me and went over all financing options, helped me decide the best financing details and assisted me with all the intricate details as far as land prep and documents for the mortgage company. He has made himself available even on his days off for me to ask large and small questions. He has explained everything in detail and any time something went wrong, he contacted me to let me know. I appreciate everything he has done for me and will definitely recommend him and Cumberland Homes to anyone looking for a manufactured home.", "pics": null, "resp": {"time": 1556630253583, "text": "Thank You Ms. Deason. You have been a great customer"}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "109858826750511579936", "name": "Andrea Howell", "time": 1538246998493, "rating": 2.0, "text": "The homes are beautiful, well designed and good quality. But one of the salesman is very unpleasant. It seams as if he prejudge you on your ability to buy before he talks with you. If I were to purchase one of these homes,  it would not be from this particular location.", "pics": null, "resp": {"time": 1538410892947, "text": "I'm sorry Andrea,  we apologize if you felt this way.   We do not pre-judge however we do try to pre-qualify which is the normal thing to do.  Just like if you were talking with a real estate company, they want to know that you can actually buy a home otherwise it's just a waste of time for you as the customer and the company as well.  Again we apologize if you felt this way.."}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "117935874936742760869", "name": "TelyesumpinYeah", "time": 1554759114433, "rating": 1.0, "text": "Terrible Customer Service, from the salesmen talking over us and raising their voice to the finance guy saying he doesn't care about our business that they have enough that they can lose us. Also a few of the 5 star reviews look to be from employees. James Jones is one of the salesmen and a 5 star review.", "pics": null, "resp": {"time": 1565210110330, "text": "We choose not to sell you a house"}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "101174370927360112159", "name": "James Jones", "time": 1554472335349, "rating": 5.0, "text": "Cumberland Homes has a very knowledgeable and friendly staff. They have several energy efficient homes to choose from. Large selection of Deer Valley Homes that are set up and available to tour.", "pics": null, "resp": {"time": 1597779071804, "text": "Thank you for the kind words James. We appreciate it!"}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "104736554225076316965", "name": "The McDaniel Homestead show McDaniel", "time": 1559795232239, "rating": 1.0, "text": "We found our experience not so friendly. because we we're a young couple, we were taking for non-serious buyers. So the salesman acting irritated with us the whole time and was difficult about answering questions. We found a home we loved, but we felt like they didn't care to make a sale with us either way, so we ended up not buying from Cumberland.", "pics": null, "resp": {"time": 1561144644968, "text": "I am sorry one of our salesmen did not take you seriously. We never want to give that impression. If there is anything we can do for you let me know and I would be glad to help. I hope you are satisfied  with your choice."}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "114619227957988819179", "name": "Cassandra Upton", "time": 1520134494374, "rating": 5.0, "text": "I bought a beautiful home from them less than 6 months ago, and I couldn’t be more pleased! Any small things that may have come up was taken care of immediately. Don was a great help in helping with designing the perfect floor plan for us! If your looking for a well built solid home this is the way to go! I got to customize the whole thing, and was never told like other places you couldn’t do it. I love the huge tile walk in shower, large custom built kitchen, granite through out, and beautiful floors, and the best game room ever! Ask for Don he was great to work with!", "pics": null, "resp": {"time": 1556630586055, "text": "I am glad you are happy with you house. You have been a great customer. Thanks"}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "117556060822534955704", "name": "Bettie Boo U Davis", "time": 1577468776918, "rating": 1.0, "text": "I’m reaching out to the owner. Would love to speak with you,", "pics": null, "resp": {"time": 1597778797918, "text": "I'm sorry to hear your experience wasn't great. Our number one priority is to meet and exceed expectations at every interaction. We would love for you to contact us so we can learn how best to improve going forward. Thanks in advance!"}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "115330067502385047387", "name": "April Williams", "time": 1578895109775, "rating": 5.0, "text": "They have beautiful homes..Very friendly staff", "pics": null, "resp": {"time": 1597778725944, "text": "Thanks for the kind words April! We appreciate your feedback!"}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "117714117229695600839", "name": "calvin madison", "time": 1510680858752, "rating": 5.0, "text": "I bought a house from Cumberland in May 2017 and it has been great. The factory trim out crew made sure there were no issues before they left.  The power bill has been very low compared to my last house. I could not be more happy with the Service that Cumberland gave us.", "pics": null, "resp": {"time": 1597781153464, "text": "Thanks so much for the kind words! We appreciate your review!"}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "108132804714907422263", "name": "Sherry parker", "time": 1477423353821, "rating": 1.0, "text": "Feel like I have been lead on was told I was approved that the mobile home would be delivered on Tuesday called Monday before Tuesday and was told needed 8,000 to go along with what was already put down now this has been lingering since August 31st and now can't get down payment back cause they don't write out checks till Friday at 2:00 pm and have been telling them I have no where to live and now can't rent cause they have my down payment and can't get it back till Friday at 2:00 pm if you want a mobile home don't go to Cumberland in north port Al. And do not finance with 21st century mortgage bad Business all the way around!!", "pics": null, "resp": {"time": 1507657985875, "text": "I am sorry the bank did not approve your loan, but according to the bank you were approved if you met all conditions stated on application. Plus, it is true that Cumberland Homes writes checks only on Friday, I am sorry for the delay."}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "114096238895604523732", "name": "Brandy Brown", "time": 1593718519350, "rating": 1.0, "text": "Salesman didn't seem like he really wanted to show us homes. Felt like we weren’t taken serious and he only wanted to show us certain homes as if he thought we couldn’t afford nicer homes. We chose to spend our money elsewhere, never recommending.", "pics": null, "resp": {"time": 1597776547903, "text": "I'm sorry to hear your experience wasn't great. Our number one priority is to meet and exceed expectations at every interaction. We would love for you to contact us so we can learn how best to improve going forward. Thanks in advance!"}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "117605774316203066440", "name": "David B Ellard", "time": 1556574039677, "rating": 5.0, "text": "Went to check out a few manufactured homes. Spoke with James and he was extremely helpful and knowledgeable about the homes. Stop by and speak with James.", "pics": null, "resp": {"time": 1556629951946, "text": "Thanks for your review"}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "117500556112096274772", "name": "Brittany Graham", "time": 1555072021092, "rating": 5.0, "text": "James was the best! He was so kind and helpful and willing to do whatever was needed to help me out!", "pics": null, "resp": {"time": 1556630149728, "text": "Thanks for your rating and purchase. Lets us know if you ever need anything."}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "116521074781360729558", "name": "kayla gough", "time": 1569195902190, "rating": 1.0, "text": "0/5.\nVery uncoordinated and no communication between employees. Very frustrating! Our sales person, James, was not knowledgeable enough to be on his own yet and got openly angry and upset that we had questions and asked for clarification on important steps. Financial person, Heath, flat out stated that they didnt care about our business because they were busy already. Information about the buying process was not shared up front. And prices 'increase' suspiciously. We even called other companies to check this info and this was not the case. Beware! Buying a home is a HUGE decision that costs a lot of money! these people are not professional and are not trustworthy. Go somewhere else!\n\nThis company will waste your time and are sleazy as grease. dont let them get a hold of your money! We were almost ready to sign with them after months of strained communication and a growing uneasy feeling in my gut, when they threw out some pretty big requirements we were never told about over 6 months of talking and preparing for a real, serious home purchase. contractors were lined up and everything. We were told prices had increased magically per foot in the house the week prior and that it required a 10% deposit on the value of the home before building...we called around to other mobile home sites and they reacted like this was the normal, to get these phone calls about this company, Cumberland Homes. Evidently we are not the first people they have done this to. the other mobile home companies in Alabama STRONGLY cautioned us that no prices had changed due to the annual convention, everything was status quo, and what they are suggesting is an unethical and NOT practiced requirement of a 10% deposit on top of the down payment for your home mortgage. You have been warned, people.\n\n**update in response to company comment**\nno sir, I am simply being thorough in my review. i have not used any \"fictitious name\". i simply left the same review on facebook and google. what my review states is truth. you seem to be having the tantrum because people are responding to my review with similar experiences until you took down the reviews on facebook. Let me be clear. I am not worried about you. I have not given you a second thought. i simply shared my experience to warn others. looks like yall are still stuck on it. interesting. you can speak whatever things that make you sleep better at night. I am not bitter, I am not mad, i am simply sharing the truth. I am GLAD it didnt work out now. you can excuse what you did all the ways you wish, you cannot take it back. STOP WASTING MY TIME AND MAKING YOURSELF EVEN LESS PROFESSIONAL. learn from your actions. evidently yall have reputation  that follows your company name. so sad.\n\nAlso, the \"cousin\" you mentioned is aware of everything and has been very cautious with you. he stayed simply because of pricing, not because he was impressed by your business. i hope you treated him better, though! it seems like it. Learning from mistakes is great.\n\nLastly, something to note. I only add more detail to my review when you respond unprofessionally....", "pics": null, "resp": {"time": 1568215950176, "text": "Ok,   You have already left one Review under a fictitious name and used the same type rhetoric.  Concerning the price increases,  Different Manufactured home dealers have different business arrangements with the factories based on volume and other factors so you have no idea as to what you are talking about concerning our pricing or any other Manufactured Home dealership.  Look Kayla we made a decision not to do business with you based on your behavior is the truth of the matter and this type of response from you just validates our decision.  What it seems like you are doing is simply having a tantrum because you didn't get your way.  No company wants to turn down business for obvious reasons but in your case we felt we had no choice.  Yes deposits are required on special order homes that nobody else would ever want if for some reason you can't or don't go through with the purchase is not unreasonable in our opinion.  This is the type of behavior that helped us make a decision not to do business with you and we don't regret that decision by any means.   It seems like the timing of this review is very suspicious since your cousins home will be delivering very soon and they have been very reasonable and great to work with through the whole process and we truly hope they enjoy their new home for many years to come.  We also would like to thank you for referring them to us.  Once their home is delivered we will mail your referral check.   Good luck to you in the future,  best wishes.."}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "110341349681368990322", "name": "MIKE HEMPHILL", "time": 1493071471714, "rating": 1.0, "text": "Terrible experience, salesman only contacted us when we needed to pay, called and left messages for him and they weren't returned. Had to contact deer valley ourselves to get the information on what it took to get the contractor in to finish. I've been treated better by used car salesman than this group of disrespectful people.", "pics": null, "resp": {"time": 1507658302901, "text": "Mr. Hemphill I am sorry that the salesman did not communicate with you the details of when your house would be finished. We have spoken with him about always communicating with the customer, He has made a mistake and I hope this mistake will not be made again. I know you are proud of the quality of your house and the great service work Deer Valley provides, I wish our sales crew would have did a better job of taken care of you."}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "113666718120589762741", "name": "Anise Morris", "time": 1510266332123, "rating": 1.0, "text": "Terrible customer service. Our company buys lots of used mobile homes and we have never had an experience like this one. We wrote a check for the entire price of the mobile home based on promises made by Ron Davis. (1) He stated all appliances in good order but oven did not work-they replaced but we had to wait 1 month for replacement stove to be delivered because he apparently never ordered it; (2) Freezer worked but not refrigerator-they offered a used refrigerator but we had to pick up and install if we wanted it replaced; (3) We paid extra for skirting-took over a month for it to be installed; (4) All plumbing valves missing-out of pocket cost for repairs; (5) They lost keys to mobile home and promised to replace locks but never did; another out of pocket cost. This company seems to be only interested in making the sale but not servicing the customer. Buy elsewhere.", "pics": null, "resp": {"time": 1510680302095, "text": "I am sorry that you are unsatisfied with your used house. The house did not come with cut off valves when it was built 25 years ago. You told me the stove did not work even though we dont carry warranties on the appliances , we bought one from Lowes but they could not get in touch with you to deliver with the phone number you gave me. A month later you said the fridge did not work, so I replied that you could replace it with another if you wanted to pick it up. Send me a bill for the keys and I will refund your out of pocket cost. I did not know you did not have keys."}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "115898393133799436475", "name": "Compare and Save on Manufactured Homes", "time": 1550260427392, "rating": 5.0, "text": "We have found these home to be the most energy efficient and best priced.", "pics": null, "resp": {"time": 1556630268604, "text": "Thanks"}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "113150335174652877790", "name": "Cheryl Hunnicutt", "time": 1556686597849, "rating": 1.0, "text": "An awful experience that we want to put behind us! DeerValley has been helpful, just wish I could say the same about Wes Madison and Cumberland.", "pics": null, "resp": {"time": 1552490959980, "text": "Cheryl if you would have asked for a heat pump we would have gladly got one for you,  you did not ask for a heat pump, you were not charged for one. That is contracted out through a different company. Cumberland Homes does not install the heating and cooling systems. And yes your house did get a leak in the plastic when it was on the lot but the factory striped everything down to the studs and replaced what ever was damaged, there is no mildew in your house ever thing that was damaged was replaced, As far as delivery, YOUR COUSIN  delivered the house, he was in charge of scheduling when he could deliver your house and it was wet the entire time he was trying to deliver. Your house had to be pulled in with a skider and your entire site had to be matted because it was so wet, that is why it took him longer to deliver. I have been out to your house to see the issues that you are speaking of, and the factory is scheduled to take care of your issues. Deer Valley is the best built house on the market, Your house is energy star compatible, thermal zone III, heat shield on the roof, Low E gold seal thermal Croft Windows. Your house  is built to conserve on heating and cooling."}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "107129612335886670165", "name": "Heather Alford", "time": 1556458594688, "rating": 5.0, "text": "We tossed around the idea of a \"mobile home\" as it's far more affordable. However not all of these homes are created equal. They can be beautiful on the inside but very cheaply made. What's in the walls and structure counts big time. That being said, if you're considering this type of option, skip Clayton (subpar materials, building standards, still stuck in the 90s), and go here and opt for a Deer Valley home. Built w 2x6 beams, hella thick insulation, you can have recessed lighting, sheetrock walls, 9ft ceilings, the list goes on. In Alabama that wind rating is going to matter. In most brands if you want these options you're gonna pay the price like punishment for wanting a higher standard. I'll let my pictures speak for themselves on what you get for your money. Worth a look. And our salesman was no pressure but very professional. That matters bc they can usually be as bad as used car salesmen.", "pics": null, "resp": {"time": 1556630086129, "text": "Thanks for your rating and paying attention to how our homes are made.  Very educated buyer you are."}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "100813131477976603010", "name": "J nisoff", "time": 1554691636733, "rating": 5.0, "text": "Very informative,answered most questions  over phone.", "pics": null, "resp": {"time": 1556630197466, "text": "Thanks J, glad we could help"}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "112408153642105611969", "name": "TENA ENGLISH", "time": 1513638124284, "rating": 2.0, "text": "Would have rated them 5 stars until delivery.  Excellent service and ability to provide the custom plans we requested. Impressed with the great quality of the home.  Unfortunately, six months post delivery we have still been unable to get anyone to come out to do the post delivery touch up work.  We paid for upgrades that we did not get and we have cracked dry wall throughout the house (expected after transport) that they promised would be repaired.  Many of the lighting fixtures were not installed, were broken, or completely missing.  Outdoor faucet is leaking and needs fixed before freezing weather. Several small things that will get bigger if not fixed soon.  Very disappointed and frustrated with lack of follow through.", "pics": null, "resp": {"time": 1525899532036, "text": "I am sorry you have some issues but you did not contact us until Dec, After you notified us that you had some issues, I contacted the factory. The factory took care of all your issues by February according to you. I asked if there was anything else you needed and you said you were 100% satified."}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "100101473544161092810", "name": "greg da girraffe", "time": 1578379028929, "rating": 1.0, "text": "Rude service, didn't show many houses because he was \"cold\"...", "pics": null, "resp": {"time": 1597778772257, "text": "I'm sorry to hear your experience wasn't great. Our number one priority is to meet and exceed expectations at every interaction. We would love for you to contact us so we can learn how best to improve going forward. Thanks in advance!"}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "116539659190914311208", "name": "Don Kilgore", "time": 1514091881143, "rating": 5.0, "text": "Best built manufactured homes...better than homes...2x6 walls, 6\"crown & baseboard, etc. Very imfprmative staff.", "pics": null, "resp": {"time": 1597781190964, "text": "Thank you so much Don for the kind words!"}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "110261950669519546015", "name": "Shane B", "time": 1527776201020, "rating": 2.0, "text": "Bought a home earlier this year. Don was good with the purchase, no complaints there. The delivery crew broke a piece of siding on the home, I've contacted Cumberland for 2 months now and still haven't had anyone come replace it. Also, the crew that did the trim out left a huge pile of garbage in the yard as well as leaving screws in my yard, I should give 1 star just for that.  The faucet in the master bath needs to be replaced. Cumberland is well aware of this but has been putting it off for 2 months now. A plumber has come out twice now and keeps saying he needs the new faucet from the manufacturer. Basically the experience was good up until the home is actually delivery. Maybe if they see this review they will actually do their customer service, but I'm doubtful.", "pics": null, "resp": {"time": 1556630521812, "text": "I am sorry it took longer than it should to do the repair. buy Clayton the manufacturer of your home did take a long time in sending us the parts. We never received the correct part to fix your faucet so we had to  go purchase one on our own.  We should have bypassed the Manufacture to begin with but they are the one that is responsible for the warranty work. I am very sorry for your delayed service."}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "114337807738207041415", "name": "henry williamson", "time": 1510172176243, "rating": 1.0, "text": "Awful customer service. Paid for a home in full around Sept 30. After waiting a month for delivery was told the mover was not qualified to move the house they would have to find another one. Have been told delivery was Monday for the past 3 weeks and still no house. Do not waste your time here.", "pics": null, "resp": {"time": 1510679869164, "text": "I am sorry  that you had to wait, I tried to get you delivered sooner but the mover I lined up said he never moved a triple wide, so I lined you with our regular mover which is 4-6 weeks out. I have since hired a 3rd mover to get us caught up. The weather has also pushed your delivery back. but your house has been delivered. Again I apologize for the delay. You will be satisfied with the quality of service, the factory trim out is the best and Deer Valley builds the best house in the industry."}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "100398719179048014620", "name": "Toni Snow", "time": 1523887513254, "rating": 5.0, "text": "Love my house, Great Service", "pics": null, "resp": {"time": 1556630535756, "text": "thanks Toni"}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "110880383812337344535", "name": "Craig “Redneck” Pinion", "time": 1475094929005, "rating": 5.0, "text": "They are easy to get along with", "pics": null, "resp": {"time": 1556630665270, "text": "Thanks Craig. You were easy to get along also."}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "101910414201733663681", "name": "B&b Lockhart", "time": 1535320078104, "rating": 5.0, "text": "very nice people", "pics": null, "resp": {"time": 1535379877996, "text": "Thanks for your commit"}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "115557601797022449858", "name": "Gwendolyn McCurry", "time": 1575237986647, "rating": 3.0, "text": "Friendly customers service", "pics": null, "resp": {"time": 1597778865721, "text": "Thank you for your kind words! We would love for you to reach out to us so we could learn how to better your experience with us so we can improve moving forward."}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "108689092593218072526", "name": "Bill Dawkins", "time": 1582767601391, "rating": 5.0, "text": "Love it", "pics": null, "resp": {"time": 1597778601090, "text": "Thanks so much for the kind words Bill."}, "gmap_id": "0x88860354a69fb363:0x9dee5470811c1f82"}
{"user_id": "114202239689596491565", "name": "Rhonda Brown", "time": 1625868896059, "rating": 5.0, "text": "They where very good to me, and called and helped me unconditionally. I would refer anyone to to Regional Homes. They treat you like family.", "pics": null, "resp": null, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "102399918305323141048", "name": "Dawn Dyar", "time": 1598623854403, "rating": 5.0, "text": "They are awesome, sending workers out in record time for the tweaking of our home set up.   Truly honest people to deal with, Moe knows!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNeU8ltTq4v1fVVyXsAAWkdDc4BkM4RRqCs-yvc=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPqrZw_aRFHnqwoT3Yn1ODNDYsIVExjZ6msKUs0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMJei1-st8Z_wJfssr1OiztRYrdqploLXF7aWHO=w150-h150-k-no-p"]}], "resp": {"time": 1598638756827, "text": "Thank you so much Dawn! Your king words mean so much to us and we appreciate it!"}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "109405192248215446035", "name": "stacy miller", "time": 1611591330044, "rating": 5.0, "text": "There are not enough good words to say about David and the others there! My husband passed over a year ago and this was a big decision to make on my own. David was so patient with me and helped me make the right decisions for me and I am so thankful for that.  I had a good very good experience overall. Everyone is so nice there. I know God blessed me by using Regional homes!", "pics": null, "resp": {"time": 1611607042534, "text": "Stacy thank you so much for the kind words and great review! We are happy to hear that your experience with us was great and that you are enjoying your new home!"}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "109367571416591960849", "name": "John Brasher", "time": 1607202624581, "rating": 5.0, "text": "David at Regional Homes was a pleasure to deal with while trying to find a home. After visiting almost every dealer in Alabama they were the most welcoming to us. Their homes appear to be exceptional quality and we really like the metal roofs. We definitely recommend them.", "pics": null, "resp": {"time": 1607360471761, "text": "Thank you so much John for the awesome review and kinds words! We appreciate your feedback and happy to hear that your experience with us was great."}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "114767875709115862613", "name": "Justin Belding", "time": 1613668821669, "rating": 5.0, "text": "Purchased a home here several months ago. David went above and beyond answering any and all questions I had and was informative the whole way. I have had some problems here and there, as with any new home would, and they have been out there fast to resolve any issues!", "pics": null, "resp": {"time": 1613673412810, "text": "Thank you Justin for the kind worst. We are happy to hear that you are pleased with the services that you received at Regional Homes of Cullman!"}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "103365293124471817704", "name": "Olive Oyl", "time": 1612543217236, "rating": 1.0, "text": "If I could give NO stars, I would. Dealing with this company has been nothing but headaches from day one! Regardless of how many times one calls for service calls, the requests are ignored. From the time the down payment was made until today, the buyer is ignored. The salesman and the office manager made promises they knew they would not keep and the buyer is left out to dry. This experience has been a NIGHTMARE!  There is NO way that I would recommend Regional Homes!", "pics": null, "resp": {"time": 1612558334655, "text": "I'm sorry to hear you were unhappy with the services you received at Regional Homes Cullman. Our number one priority is to meet and exceed expectations at every interaction. Since we don't have much control over the manufacturer servicing, we do everything in our power to get issues resolved for you quickly but that's not always the case. We will keep working hard to get these issues taken care of more promptly!"}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "111103863952062364407", "name": "Hal Brad", "time": 1619294507685, "rating": 1.0, "text": "Be very careful.  They give one price and when you return add to price.  Different price.", "pics": null, "resp": null, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "113128070501002144045", "name": "Lynn Shankles", "time": 1613945065863, "rating": 5.0, "text": "We had a great visit with Pete at Regional Homes. Awesome customer service! Would recommend them to anyone!", "pics": null, "resp": {"time": 1614019771615, "text": "Thank you so much Lynn for the kind words and great review! We appreciate it and happy to hear you had a great experience with us!"}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "106000850441844167698", "name": "Steven Schrimsher", "time": 1603301190499, "rating": 2.0, "text": "Update - 5 months later\nThe A/C got installed on Memorial Day (major kudos to the guy who drove out to install the crossover on the holiday and for that I'm returning 1 star, however that situation should've never happened in the first place). Underpinning got installed approx 1 month later.\n\nThere are repairs that are needed now which should fall under warranty, however I am not confident they will do quality work (\"they gave us a bad review, so we'll do just enough\" type of deal). That said, who knows - maybe things have changed internally and they'd see this as an opportunity.\n\nA lot of the headache around our purchase (and the subsequent bad review) probably could have been avoided with better communication both internally (within their company) and externally (with contractors they hired and with us). Buyer beware is all I can say. If you go with them, I hope you have a better experience than we did. While I still don't necessarily recommend them I do hope that, in the months since we purchased, they have been able to fix whatever issues caused the hiccups with our experience and provide a better product for future customers.\n\nOriginal review:\nAVOID THIS PLACE. Our experience declined when they ceased to be Dream Home Outlet and became regional homes of Cullman. Been waiting months to get into our house because their installers can't do anything right (no AC in half our home because they forgot the crossovers, AC unit installed in an improper location, water crossovers improperly installed, missing door hardware, etc). We have been patient about waiting but enough is enough. The goalposts keep moving- first it was one day, then two days, then weeks. Shame that I can't even live in the house that I'm already making payments on. Moe, Wendy, and Les are all decent enough people but there's a major hangup somewhere for these types of issues to be so prevalent, and because of that (in addition to the lack of requested -repeatedly- communication) I cannot recommend anyone go here when looking for their new home.\n\nAVOID AVOID AVOID", "pics": null, "resp": {"time": 1590528128684, "text": "Hey Steven. I understand your frustration and we want you to know customer service is extremely important to us. We're putting pressure on the manufacturers and are doing everything we can to help your situation. Please give us a call as soon as possible so we can get any outstanding issues resolved."}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "110119135525129318733", "name": "David Puckett", "time": 1598052603223, "rating": 5.0, "text": "Moe and Wendy are great people to deal with. I would highly recommend them to anyone.", "pics": null, "resp": {"time": 1598638458739, "text": "Thank you David for the kind words and great review!"}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "100475967293469303441", "name": "Dustin Hardy xq", "time": 1527216426210, "rating": 5.0, "text": "Moe, Wendy and Les are absolutely Fantastic. After the past few years of being rejected on house after house my wife and I decided to go visit Moe, Moe Wendy Les and see what they had and how they could help. Moe went above and beyond to put my family in a beautiful brand new home. These guys are the absolute best in the business and truly care about getting people in their Dream Home. I wouldn’t go anywhere else for the products they specialize in. Like I said they care and are THE BEST! The homes are such incredible quality as well. Each one leaves you smiling and they make the buying process as smooth and painless as possible. They don’t give up until you get what you want", "pics": null, "resp": {"time": 1528467023722, "text": "Don’t give up, don’t get discouraged, get to Cullman and visit the largest Fleetwood Homes Dealer in the USA.  We really appreciate you Dustin and your kind words!"}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "114013128833097253356", "name": "Brent Stephens", "time": 1518096407346, "rating": 5.0, "text": "Wow, they gave me all there attention and had all the answers, great selection of homes.  I like how they explain everything and helped us.   When you make the biggest purchase of your life, you got to feel comfortable about it and they help all the way through.  (Is clear they are the right place to be after visiting a few others).  And roll tide.....", "pics": null, "resp": {"time": 1518103987646, "text": "Mr. Stephens, we really appreciate you and your business.  We are so glad you are happy and that you noticed how we try make you comfortable about your decisions."}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "114419576751641958546", "name": "Preston Joiner", "time": 1567355098713, "rating": 4.0, "text": "Dream home outlet is a great place to buy your next home if you're wanting a manufactured home they offer custom built homes where you order the house plan you want and change what you want they specialize in Fleetwood and Winston homes we ordered our home from them and it's turned out georgus can't wait to get in it", "pics": null, "resp": {"time": 1574174857585, "text": "Thank you for your business."}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "116697657550488380550", "name": "J White", "time": 1466481514352, "rating": 5.0, "text": "Moe and the gang was very helpful, knowledgeable, and trustworthy. They did exactly what they said they were going to do all the way through the process. I had a couple of small issues and each one was handled promptly and considerately. Good people to deal with.", "pics": null, "resp": {"time": 1466519246681, "text": "Thank you very much.  Let us know if you need anything.  Moe"}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "117774185708169152854", "name": "M. Griffin", "time": 1539114535790, "rating": 5.0, "text": "Les, Moe, and Wendy are amazing. Have been with us every step of our home-buying journey. Can't wait till we have our new home 🙂", "pics": null, "resp": {"time": 1539115279352, "text": "Thank you for your business and patience.  Your home is in!"}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "117940497965065344404", "name": "Keyome DT", "time": 1592070973468, "rating": 5.0, "text": "Great group of people with a quality product", "pics": null, "resp": {"time": 1597786637321, "text": "Thank you for the kind words!"}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "100590693283497252822", "name": "Reg Wells", "time": 1413293649957, "rating": 5.0, "text": "My wife and I were driving around looking at manufactured homes on Cherokee Avenue near I-65 in Cullman. We just stumbled upon their lot and walked in. They couldn't have been more friendly, professional and helpful. My wife was kind of blown away by all the interior design customization options they offered. Long story short ... within 48 hours, we had signed an agreement with Dream Home Outlet and we'll have our new home within a couple of weeks. Very impressed by the whole process so far ... we are excited!", "pics": null, "resp": {"time": 1478624428371, "text": "Wow - this is why we are the best!  We are professionals that will help you in every stage of the process.  From helping with credit to get a better mortgage to customizing the floor plan to accommodate your needs.  We want you to tell everyone!"}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "112260730025611279407", "name": "Jay Tide", "time": 1556213161948, "rating": 3.0, "text": "Before you buy a home from dream homes make sure to do your home work I'm a first time home buyer and I've learned a lot first hand from them they are not organized and when the set your home up you have to call them almost everyday to get someone out there to hook stuff up so if you buy a home make sure you know when they are going to come hook up everything or it will be a rollercoaster ride for you", "pics": null, "resp": {"time": 1597786732032, "text": "I'm sorry to hear your experience wasn't great. Our number one priority is to meet and exceed expectations at every interaction. We would love for you to contact us so we can learn how best to improve going forward. Thanks in advance!"}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "100500422978229788957", "name": "Dillon Taylor", "time": 1464303008194, "rating": 5.0, "text": "5 stars all the way!!!! If your looking or thinking about getting a new home make this your first stop, after almost a year of looking and being turned away  or not getting a serious effort To put us in something that we wanted .. We went to Dream Home and talked with Them and they helped us  in every way possible even with credit!! Not to mention the homes are EXCELLENT QUALITY and totally customizable!! We were able to sit down and get everything we wanted. So anyone looking make Dream Home Outlet your first choice!", "pics": null, "resp": {"time": 1477665214191, "text": "Thank you for your business.  We really enjoyed building your customized floor plan and we really strive to provide the best customer service both before and after the sale."}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "114688599162769963353", "name": "Juan Rodriguez", "time": 1591125509053, "rating": 5.0, "text": "Great people to do business with it", "pics": null, "resp": {"time": 1517932311605, "text": "(Translated by Google) Thanks for the review. I can not tell you how much I appreciate you.\n\n(Original)\nGracias por la revision. No puedo decirte lo mucho te aprecio."}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "105707030452499213309", "name": "Jay Green", "time": 1506519955306, "rating": 5.0, "text": "Absolutely perfect!  Dream Home Outlet focuses on customer satisfaction. Their Fleetwood homes are the best looking in town.", "pics": null, "resp": {"time": 1517931864171, "text": "Thank you for your review.  We strive to make our customers happy and believe Fleetwood delivers the best value home on the market."}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "109233107786178112254", "name": "Donald Goodwin", "time": 1544023357955, "rating": 5.0, "text": "Mo, Les, & Wendy are all very attentive and helpful during the whole process! Reliable and expeditious!", "pics": null, "resp": {"time": 1597843700557, "text": "Thank you for the kind words and great review Donald!"}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "102532256833101143271", "name": "Jimmy Cockrell", "time": 1415752730438, "rating": 5.0, "text": "The folks at Dream Home Outlet are the best...After shopping around at other lots, we found the guys and gal at Dream Home Outlet were willing to help us in every way, they talked us through the whole process, step by step, the home we picked was PERFECT for our families needs, the price was better than any other we had found, the process was painless and smooth, thanks to these guys my wife and I will enjoy our first brand new home of our 26 years together...we just wanna say THANK YOU to Wendy, Moe and Les...u guys r the best!!", "pics": null, "resp": {"time": 1477665323869, "text": "To one of our best customers, who has been nothing but kind and a pleasure to have as a customer and now my friend?  You and Amy have been fantastic!"}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "100465405418993388425", "name": "whitney hardy", "time": 1527216306511, "rating": 5.0, "text": "Moe and wendy are wonderful people. They went far and beyond to get us in our dream home. I would so recommend going here they are so wonderful. Thank yall so much for what yall have done for us.", "pics": null, "resp": {"time": 1528466851501, "text": "We really appreciate these wonderful reviews and strive to be the best - this is a huge decision for most people and your review should help people realize how important it is to buy from people like us, people who really care, people who will treat you like family and will stand behind what they sell."}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "105515596045836926495", "name": "DeWayne Heine", "time": 1502046532573, "rating": 5.0, "text": "Great people! Moe does what he can to get you in a house.", "pics": null, "resp": {"time": 1503586201959, "text": "Thank you DeWayne.  We are so thankful you and Darla decided to purchase here after shopping everywhere.  Our customers are our priority."}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "116418328017905904727", "name": "Sherry Bavar", "time": 1494770916894, "rating": 4.0, "text": "A little slow for finalising home set ups.", "pics": null, "resp": {"time": 1494975883683, "text": "We sent state inspection report in on 4/11/17 and they did not inspect the home until 4/26/17 is part of our delay.  I hope you tell people how we went out of our way to lower the price and even hook up your utilities for you to help get you a home.  I know that our HVAC and skirting crews are extremely busy this time of year, if that is the delay you are speaking of.  We want you to be happy!"}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "110638281223279059280", "name": "Bobby Wallace", "time": 1581904258141, "rating": 2.0, "text": "Not as good as Timberline homes", "pics": null, "resp": {"time": 1581947534498, "text": "Hey Bobby! Your customer experience is very important to us. I noticed you have not purchased from us so in what way could we have made this better for you?"}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "105680128202513694322", "name": "Jonathan Koehn", "time": 1484055740655, "rating": 5.0, "text": "These people are great to work with!", "pics": null, "resp": {"time": 1484061750231, "text": "Thanks Jon and we really appreciate you and your business."}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "108153645040115082532", "name": "Johnny Beckmann", "time": 1600699148592, "rating": 5.0, "text": "(Translated by Google) Grat\n\n(Original)\nGrat", "pics": null, "resp": {"time": 1600721238333, "text": "Thank you Johnny for the awesome review! We appreciate it!"}, "gmap_id": "0x8889ca6476a2e031:0x7b6b703e52627bb9"}
{"user_id": "105664671182517564962", "name": "Jason Welsh", "time": 1568756968525, "rating": 5.0, "text": "Great place to buy a home. The staff are friendly and knowledgeable of what you might want, how to get it, and how to get it financed.", "pics": null, "resp": {"time": 1577979203393, "text": "Thanks so much Jason, we really enjoyed working with you."}, "gmap_id": "0x888a1b6491b0fccd:0x3c2215c6a8c61f27"}
{"user_id": "102832794668298809411", "name": "Scotty Holloway", "time": 1566396678326, "rating": 5.0, "text": "They have very nice homes and it's a very friendly family run operation. They really care.", "pics": null, "resp": null, "gmap_id": "0x888a1b6491b0fccd:0x3c2215c6a8c61f27"}
{"user_id": "117605774316203066440", "name": "David B Ellard", "time": 1561944329704, "rating": 5.0, "text": "Interesting homes. If you are in the market for a manufactured home stop by and check out the homes. 👍👍👍👍", "pics": null, "resp": null, "gmap_id": "0x888a1b6491b0fccd:0x3c2215c6a8c61f27"}
{"user_id": "113099721565102990719", "name": "Angelic Holbrook", "time": 1581980011313, "rating": 4.0, "text": "I am anticipating my new home", "pics": null, "resp": {"time": 1581998961609, "text": "Angelic,\nThank you for your very good review.  We appreciate your business!"}, "gmap_id": "0x888a1b6491b0fccd:0x3c2215c6a8c61f27"}
{"user_id": "104403290399123278688", "name": "Art Vandale", "time": 1515299947283, "rating": 5.0, "text": "Place is cool. The sales lady is super friendly and helpful", "pics": null, "resp": null, "gmap_id": "0x888a1b6491b0fccd:0x3c2215c6a8c61f27"}
{"user_id": "117853524555052688359", "name": "Daniel Boone", "time": 1513965283327, "rating": 1.0, "text": "Mark in Sales: very helpful and so nice.\n\nDon: can’t get two words in and will help lose a sale in less than 2 minutes.", "pics": null, "resp": null, "gmap_id": "0x888a1b6491b0fccd:0x3c2215c6a8c61f27"}
{"user_id": "112628204430692844979", "name": "Amanda Freemon", "time": 1577408155791, "rating": 5.0, "text": "Very amazing", "pics": null, "resp": {"time": 1577456561649, "text": "Thank you !"}, "gmap_id": "0x888a1b6491b0fccd:0x3c2215c6a8c61f27"}
{"user_id": "109969460723052295873", "name": "Shannon Arledge", "time": 1505151584228, "rating": 4.0, "text": "Nice homes", "pics": null, "resp": null, "gmap_id": "0x888a1b6491b0fccd:0x3c2215c6a8c61f27"}
{"user_id": "104887669382971707339", "name": "Jeff Fitzgerald", "time": 1616625337614, "rating": 5.0, "text": "Bert was helpful, informative and kind. He was very patient and generous with his time", "pics": null, "resp": {"time": 1617396096640, "text": "Thank you for the kind words, it's always great making new friends."}, "gmap_id": "0x88626cd299364833:0xbf7ae59afd10c0a7"}
{"user_id": "112363030025956683185", "name": "Gabrielle George", "time": 1603235078987, "rating": 5.0, "text": "My husband and I stopped by Mundy Homes today to look at a home we seen online and were very happy with the visit. The man we spoke with immediately took us to his office and explained the entire buying process with us in great detail! He answered every question I had about purchasing a mobile home and gave us a lot of information I wouldn't of thought to ask. No pressure to buy but rather a friendly and informative environment. We left excited and we look forward to working with them in the future.", "pics": null, "resp": {"time": 1603475183203, "text": "Gabrielle, thank you so much for taking the time to write this about your experience with us. When you get ready for a new home we will be here to help you every step of the way. Again Thank you.we really appreciate it."}, "gmap_id": "0x88626cd299364833:0xbf7ae59afd10c0a7"}
{"user_id": "108110194935248599941", "name": "Ted Carson", "time": 1597027186621, "rating": 4.0, "text": "Very Well Informed on any info you could want, very professional and friendly no pressure to buy !\nwhen your ready they'll help with everything , even on finding lots for you..\nThey'll walk you through everything.\nplease stop by and tell Howdy for me..", "pics": null, "resp": null, "gmap_id": "0x88626cd299364833:0xbf7ae59afd10c0a7"}
{"user_id": "108760133588117393647", "name": "Mayra Pangborn", "time": 1601073362885, "rating": 5.0, "text": "David was great, he explained all the costs and times to consider. I will buy from here when the time is right!!", "pics": null, "resp": {"time": 1603475321022, "text": "Mayra thank you so much for the review and mentioning David. We really appreciate it and look forward to seeing you again in the future."}, "gmap_id": "0x88626cd299364833:0xbf7ae59afd10c0a7"}
{"user_id": "116267356272574081567", "name": "Daniel de Quesada", "time": 1579993306002, "rating": 5.0, "text": "My wife and I were just browsing at local mobile home dealers, so we decided to check out Mundy. We were instantly greeted and asked what we were looking for in a home. We explained what we wanted and were introduced to David, a sales rep. He was very kind, courteous and answered any and all questions we had. We were shown several, beautiful homes and David was very patient with us, as we were looking around. It was cold outside, but David still allowed us to see any home we wanted to see. We finished our tour of the homes, and he sat with us and broke down prices of the models we were interested in. We were extremely pleased with the experience there and with the professionalism of David and the staff at Mundy. I would highly recommend them if you are looking to buy a new or used mobile home.", "pics": null, "resp": {"time": 1580146864709, "text": "Daniel\nThank you for the positive review. We really appreciate it. David has been a part of the Mundy Home Center team since 1989. He really takes care of his customers before and after the sale. He is definitely family. We sure hope you become apart of our family of homeowners also.  Thanks again!"}, "gmap_id": "0x88626cd299364833:0xbf7ae59afd10c0a7"}
{"user_id": "111737177805739816085", "name": "I wood", "time": 1607810874197, "rating": 5.0, "text": "Nice people and nice trailers", "pics": null, "resp": null, "gmap_id": "0x88626cd299364833:0xbf7ae59afd10c0a7"}
{"user_id": "113224033434313589477", "name": "Melissa Fleming", "time": 1557278690831, "rating": 5.0, "text": "Thank you so much for help! Great people,  great fast work! My home was delivered today & set up within days of purchase! They make you feel like family! Help you in anyway they can!!!", "pics": null, "resp": {"time": 1557513782800, "text": "Melissa- Thank you for the review- we really appreciate the business and have enjoyed working with y'all."}, "gmap_id": "0x88626cd299364833:0xbf7ae59afd10c0a7"}
{"user_id": "110933451139657456693", "name": "Brittany Skinner", "time": 1557949036026, "rating": 5.0, "text": "We are in the process of buying a home from Mundy and they have been phenomenal! David and Judy have worked with us and really gone above and beyond to make our home-buying experience a good one. If there was anything I didn't understand, they were quick to explain without making me feel dumb for not knowing. They worked within our price range and didn't pressure us to buy anything out of it. The homes are high quality and reasonably priced. Overall I highly recommend Mundy Homes Center.", "pics": null, "resp": {"time": 1557950887549, "text": "Thank you for leaving a review Brittany. We look forward to working with you and really appreciate the business!"}, "gmap_id": "0x88626cd299364833:0xbf7ae59afd10c0a7"}
{"user_id": "101438095661502949187", "name": "Curtis Clemons", "time": 1561547492961, "rating": 5.0, "text": "Real nice homes I'm trying to a home", "pics": null, "resp": null, "gmap_id": "0x88626cd299364833:0xbf7ae59afd10c0a7"}
{"user_id": "112513518840148378205", "name": "James “Trey” Wilson", "time": 1518220534637, "rating": 5.0, "text": "Some really nice Mobile homes in stock right now and great customer service", "pics": null, "resp": null, "gmap_id": "0x88626cd299364833:0xbf7ae59afd10c0a7"}
{"user_id": "104628335328248407757", "name": "Dennis Mc", "time": 1534965211826, "rating": 3.0, "text": "Personable staff made looking at mobile homes pleasant", "pics": null, "resp": null, "gmap_id": "0x88626cd299364833:0xbf7ae59afd10c0a7"}
{"user_id": "100395055747935598112", "name": "Troy Brooks", "time": 1510753992651, "rating": 4.0, "text": "Everyone at Mundy's has really helped me out in getting my first home. Don helped me get my lot ready and Teresa with financing. I would recommend Mundy Homes to all my friends and family without hesitation.", "pics": null, "resp": null, "gmap_id": "0x88626cd299364833:0xbf7ae59afd10c0a7"}
{"user_id": "107208819352720155067", "name": "Kevin Hardy", "time": 1506472117622, "rating": 5.0, "text": "Great people to deal with- love my home and they took care of the few issues I had. Would recommend Mundy Homes.", "pics": null, "resp": null, "gmap_id": "0x88626cd299364833:0xbf7ae59afd10c0a7"}
{"user_id": "113280586529039506953", "name": "Tricia P", "time": 1513299629987, "rating": 5.0, "text": "Great selection of quality affordable homes.", "pics": null, "resp": null, "gmap_id": "0x88626cd299364833:0xbf7ae59afd10c0a7"}
{"user_id": "106304236414722917858", "name": "Angie Richardson", "time": 1510709440413, "rating": 1.0, "text": "Don't use Jane the realtor there at Mundy Homes, she is only after a sale and will not help you withloose ends after closing she is very unprofessional.", "pics": null, "resp": null, "gmap_id": "0x88626cd299364833:0xbf7ae59afd10c0a7"}
{"user_id": "103339543308230508647", "name": "Sandy Swauger - Upton", "time": 1498823794634, "rating": 5.0, "text": "Great selections and wonderful sales team!", "pics": null, "resp": null, "gmap_id": "0x88626cd299364833:0xbf7ae59afd10c0a7"}
{"user_id": "109930755287700902377", "name": "Weston Whitt", "time": 1506463407436, "rating": 1.0, "text": "Don't buy a home here !!! This is the worst company ever !!! Our home is only one year old and has been falling apart since the day we bought it! Munday homes tells us their coming out and fixing this or that and THEY NEVER SHOW !!!", "pics": null, "resp": null, "gmap_id": "0x88626cd299364833:0xbf7ae59afd10c0a7"}
{"user_id": "104140906636911258577", "name": "Monster Babe", "time": 1493345734578, "rating": 4.0, "text": "Nice staff. Not that eager to sell or answer questions.", "pics": null, "resp": null, "gmap_id": "0x88626cd299364833:0xbf7ae59afd10c0a7"}
{"user_id": "113174550674152384594", "name": "Furlough Wrecker Service", "time": 1509199248393, "rating": 5.0, "text": "DAVID IS AWESOME", "pics": null, "resp": null, "gmap_id": "0x88626cd299364833:0xbf7ae59afd10c0a7"}
{"user_id": "107785078391180031145", "name": "Manuel Lueras", "time": 1622933722811, "rating": 5.0, "text": "My wife and I have had an excellent experience from the start. Tara has been absolutely wonderful and helpful from the start. Answering all of our questions and following up with us.  I would highly recommend this company to anyone looking.", "pics": null, "resp": {"time": 1623435131717, "text": "Thank you so much for the kind words, Manuel!"}, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "108575246123971154550", "name": "Donald Barnes", "time": 1554666130843, "rating": 5.0, "text": "Looking at there homes was great.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOeMRAGQ-x-7-bfi-g1RDvlZjvbQr46mVkJq19p=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "115716761983084320190", "name": "Alana Fenn", "time": 1622932523290, "rating": 5.0, "text": "Tara is absolutely amazing! I couldn't ask for someone better to be helping us! I trust her with everything. She is great at her job and looks out for you every step of the way. She deserves a raise!!!", "pics": null, "resp": {"time": 1623435225770, "text": "Thank you so much for the kind words, Alana!"}, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "101707249872428059726", "name": "Shari Barfield Newman", "time": 1622331786735, "rating": 1.0, "text": "We came into this establishment today at around 4:15.  The lady that was in the office would not take us to see any of the homes until my wife filled out some information.   So this employee was either too lazy to show us or she was profiling us.  We came up in our 2007 Toyota and she probably thought we were not able to buy anything.   Well, my wife you meet is a retired Major of the US Army and has her Ph.D.  She has worked 30 plus years  and has never been unemployed.   I have been in the medical field for 38 years and make a good living.  If this is your policy,  it needs to change.  If this is her work ethic, she needs fired.  You missed a sale.....you are a Karen, karen", "pics": null, "resp": {"time": 1622582594089, "text": "Hi Shari, thank you so much for reaching out. We're sorry to hear of these concerns, and we'd like to learn more. Please contact our management team at 256-233-3101."}, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "102380346092517134945", "name": "Sam Gentle", "time": 1619804972089, "rating": 5.0, "text": "Tara has been exceptional, she has been very kind helping my mom find a home. Even after we got keys Tara still checks on her! Thank you", "pics": null, "resp": {"time": 1620221916659, "text": "Hi Sam! Thanks so much! We'll share this feedback with Tara!"}, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "105568883109160691814", "name": "Tara A. Skipper", "time": 1622933517771, "rating": 5.0, "text": "Tara was so helpful to us. Though we are difficult and change our minds often, she’s been very patient and hasn’t pressured us one way or another.", "pics": null, "resp": {"time": 1623434893121, "text": "We're happy to have a great team member like Tara! Thank you for the kind words!"}, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "110982199597696101124", "name": "Ben Cooper", "time": 1612413949740, "rating": 5.0, "text": "We are buying in TN, 6 hours from Athens. We didn’t realize we couldn’t buy here and move it there. Tara was very nice and still showed us a home, the big green house. It’s beautiful!", "pics": null, "resp": {"time": 1612476082564, "text": "Thanks for the awesome feedback, Ben! We're happy you found out we could move the home! We're happy to be your chosen home buyer retailer 😊"}, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "102568669109826194822", "name": "Debbie Kesmodel", "time": 1612470137478, "rating": 5.0, "text": "Kristie & Tara were very nice yesterday, my mom was looking for a home and Tara was very nice trying to help my mom who wasn’t being easy. While waiting for the first girl Kristi got us cokes. Drinks were free, I Love the big one up front we got to see, it’s so nice.", "pics": null, "resp": {"time": 1612545142510, "text": "Thank you for visiting with us, Debbie! We're so glad that you and your mom stopped by! And cokes are always on us 😉"}, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "106968263189843044658", "name": "Randy Kuby", "time": 1611706656727, "rating": 5.0, "text": "We have been working with Tara Birkla at Clayton homes in Athens . We are almost to the point of closing. She has been there for us when we had questions and concerns bout the whole process. Even after hours if something came up I could hit her up on the cell. If she didn't know answer she would find out and would get back to us asap. I especially like the fact that we have several times changed our minds on few things and Tara wouldn't get mad. Constantly told us this will be our home make it how we like it. Keep up the great work Tara and our family thanks u!", "pics": null, "resp": {"time": 1611956707394, "text": "Thank you so much for sharing your experience with us, Randy. We are so glad you chose Clayton Homes!"}, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "110122520863150034170", "name": "Tonya Taylor", "time": 1598675220518, "rating": 5.0, "text": "We purchased a home from Clayton homes and Tara was our sales rep. She is absolutely amazing! We went a few times to look at diff homes and trying to make sure we were making the right decision. She was very patient with us and answered any questions we had no matter what time of day it was. She took the time to ask us what we really wanted and what our budget was. We went back after doing our on research and thinking we knew exactly what we wanted until she said she had something she knew we would love and she was correct. Tara listen to us and really knew what we were looking for and showed us the perfect home. We fell in love as soon as we walked in. I also love the fact that she was never pushy and trying to talk us into buying something just to be buying. Overall it took us about two years to make a decision and she patiently waited and worked with us the whole time. Now we are just waiting for our new home to be built! We can’t wait! Thank you Tara for everything!!!", "pics": null, "resp": {"time": 1598905188325, "text": "Thank you so much for the kind words, Tonya!"}, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "102997749829209612622", "name": "Ronnie Austin Jr", "time": 1598662532421, "rating": 4.0, "text": "I have been looking for homes for many months in the housing market. Very tough market these days. But I decided to go a different route with homes. I had seen Clayton homes athes, and decided to give them a shot. And im glad I did. I had meet Tara witch was very knowledgeable, Easy to talk to, and attentive to question. I would recommend clayton homes, and send allbI kjowbto Tara, thank you Tara.", "pics": null, "resp": {"time": 1598905483992, "text": "Thank you so much, Ronnie!"}, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "106220426161244677990", "name": "Ben Hubbard", "time": 1601829196675, "rating": 5.0, "text": "Not a lot of homes but Tera was great. They were busy we didn’t have appointment but she helped us anyway. Another lady got us water as we waited in lobby for a sales person. Super nice. Tera knew her stuff, will be going to a Clayton in GA when we buy. Didn’t think about this Clayton not being able to sale us, I guess 320 miles is a long drive. My girlfriend loved her too and we both love the lulabell.", "pics": null, "resp": {"time": 1602085368754, "text": "Hi Ben! We're so glad you all stopped by! We hope to see you again soon! Please let us know if you have any questions!"}, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "108161890915381197247", "name": "Hannah Finnigan", "time": 1601909659774, "rating": 5.0, "text": "Al and Tara were very nice. We came in Saturday and Al got me a water. Then once Tara finished up she came and helped us. Very nice people here and very pretty homes. My sister is in the market she was very happy with the homes!!!", "pics": null, "resp": {"time": 1602084893928, "text": "Thank you so much for the kind words, Hannah! We really appreciate you all visiting us, and we look forward to speaking with you again!"}, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "116054475729651290895", "name": "Patricia Kerins", "time": 1601322645835, "rating": 1.0, "text": "Wow....not good. We came here to see homes here about a year ago. TARA was not very helpful or enthusiastic about her job, also they inventory was nearly 0 . We Came out here today and was hoping for a better experience.  I was actually worse! Upon entering Tara came at us saying we HAD to wear masks. We informed her that due to medical reasons we are exempt according to Alabama and CDC guidelines. My husband also pointed out that the secretary wasn't even wearing one! SMH!! Tara didn't care one bit and we left! We called the Decatur location and was welcomed with open arms", "pics": null, "resp": {"time": 1601901480088, "text": "We are very sorry to hear you had a negative experience at one of our Clayton retail locations.  Every state has different guidance when it comes to interacting with our customers during the pandemic, and we appreciate your understanding as we navigate these uncertain times.  If you would like to talk to one of our Customer Advocacy representatives about this situation further, please call 877-264-2812. Thank you very much for letting us know about your recent experience."}, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "101923763131569113213", "name": "Marla Wachter", "time": 1614119875789, "rating": 1.0, "text": "My husband and I bought a home from here about 7 years ago. Now it is falling apart due to poor workmanship. The first year when  it was still under warranty we called multiple times to get some one out to fix blatantly obvious problems and they never got back to us and when they finally did send someone out they “bandaid fixed” things then waited till the one year was up to say they could not do anything about it. Now we are stuck with a $40,000 junk money pit of a house.", "pics": null, "resp": {"time": 1614621046590, "text": "Hi Marla, thank you for reaching out. Customer experience is of the upmost importance to us, and we take this feedback very seriously. Clayton Homes of Athens strives to provide a world-class customer experience, and all our homes come with a one-year manufacturer's warranty to correct any issues. If you have questions, please contact us at 256-233-3101."}, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "101869768648907541918", "name": "Arielle Robinson", "time": 1593225150937, "rating": 5.0, "text": "We went to Clayton homes to look at  a home we saw online. We were greeted by a wonderful sales lady named Tara, she was fantastic in helping us getting the perfect home to suit or needs. She was very patient and thorough as well. Thank you for being awesome Tara. We can’t wait to have our home in august!\nThe Robinson’s", "pics": null, "resp": {"time": 1593465146155, "text": "Thank you so much, Alice! We are so glad that you all visited with us here at Clayton Homes of Athens! We are very excited for you! 😁"}, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "106125086315925502369", "name": "Gigi Killen", "time": 1602281088614, "rating": 5.0, "text": "We were meet by Tera who got us a drink and sat us down. She was very nice. Taylor helped my parents, she was very kind. Homes were great", "pics": null, "resp": {"time": 1602301457189, "text": "Thank you so much, Gigi!"}, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "103893864745513872544", "name": "Lori Sutherland", "time": 1593222471753, "rating": 5.0, "text": "Tara at Clayton Homes in Athens is awesome. She has such a happy and positive attitude. I could not ask for a better person to help us with our options and plans for our future. Awesome!", "pics": null, "resp": {"time": 1593465643636, "text": "Thank you so much, Lori! We really appreciate the kind words! Tara is a wonderful asset to our team!"}, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "107910291151854991671", "name": "Frank Pendergast", "time": 1605219959530, "rating": 5.0, "text": "The Clayton experience has been excellent so far! Tara is a professional and great to work with!", "pics": null, "resp": {"time": 1605650353278, "text": "Thank you so much, Frank!"}, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "113029449140332225046", "name": "Ben F", "time": 1602253580048, "rating": 5.0, "text": "I went with my daughter Wednesday but Tera was nice and tried to show us some online and a few in person. Wasn’t a lot to look at", "pics": null, "resp": {"time": 1602301756540, "text": "Hi Ben! We're so happy you all stopped by! We are always changing and we really hope to help you guys find a home!"}, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "116997723206061555613", "name": "carliauna cole", "time": 1593226382620, "rating": 5.0, "text": "Awesome service!!!! Can’t speak enough goodness about this group!!! Tara Berkla is a top notch sales person!! I’ll always use them for all my home purchases! Their prices are great and they have tons of homes to choose from!! If you are in the market for a new home this is the place to go!!! Ask for Tara and she will take care of the rest!!", "pics": null, "resp": {"time": 1593465071679, "text": "Thank you so much, Carliauna! We appreciate the kind words!"}, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "101999351839630114879", "name": "Patti Carter", "time": 1593222689996, "rating": 5.0, "text": "We were looking for a new home, we decided to stop at Clayton Homes in Athens Alabama. We walked in and were greeted immediately by Tara. She took the info we gave her and showed us all of the homes that had all of our requirements. Tara was very knowledgeable and informative. We couldn’t have been more satisfied. We are currently under contract and awaiting our new Clayton Home. We couldn’t be happier with the service provided by Tara!!!", "pics": null, "resp": {"time": 1593465508795, "text": "Patti, thank you for the kind words! We really appreciate your support!"}, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "107307439324704889262", "name": "Kimberly Gates", "time": 1593222688483, "rating": 5.0, "text": "Just wanted to thank everyone at Clayton of Athens.  Tara did a great job and always made us feel important.  We look forward to many great years in my moms new home ❤️", "pics": null, "resp": {"time": 1593465571713, "text": "Thank you, Kimberly, for being such an awesome customer! We are so happy for you all, and thank you again for choosing Clayton Homes of Athens!"}, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "115681285442575782312", "name": "April Wells", "time": 1583961541261, "rating": 5.0, "text": "My husband and I had looked at MH in Huntsville and since we passed Clayton Homes in Athens one day, we decided to stop in. I was scared at first due to hearing their prices were high. The saleslady, Tara, greeted us and asked all the right questions before showing us what they had to match our criteria. I thought this process was great so she wouldn't waste our time nor did we waste hers. We found the one we wanted. We left and got maybe a mile down the road and didn't know what our next step would be. With Tara not bring a pushy sales person she told her to think about it and get back with her when we decided what to do next. So she was surprised when we walked back in. We went through the pre approval, she assisted with any questions we had. We got a quick response and went back to do final paperwork. I wanted to make sure this is the one we wanted and asked to look at a few more. Tara didn't hesitate to show us others. We then found the PERFECT one. We hope to be closed within a month or sooner. Tara is really great to work with. She keeps us informed every step of the way. I would recommend her to my family and friends. Plus, she's down to earth and has a beautiful smile.", "pics": null, "resp": {"time": 1584294375297, "text": "April, we can't thank you enough for taking the time to share your experience! We're glad you became a part of our Clayton family!"}, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "116312668973321136918", "name": "T Davis", "time": 1612400538400, "rating": 5.0, "text": "Tara helped us in our home search, we weren’t able to buy but once we are we will be back to see her. If your looking for a home pick Clayton and Tara!", "pics": null, "resp": {"time": 1612476397990, "text": "Hey T Davis, we really hope to hear from you soon! We're always here should you want to visit with us again soon!"}, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "118302496457039873696", "name": "Joseph Bunton", "time": 1577559133229, "rating": 1.0, "text": "I just want there to look at some new homes. Seam like there just wanted to give me the run around about looking a the homes there.so I wen to the Decatur one didn't have no issue like it did at the Athens al one. It should not be that difficult to want to look at the house there.", "pics": null, "resp": null, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "104612194263741016338", "name": "curtis carter", "time": 1593222976680, "rating": 5.0, "text": "Tara helped us find our perfect home. I would recommend Tara and Clayton Homes in Athens Alabama.", "pics": null, "resp": {"time": 1593465468315, "text": "Thank you, Curtis! We really enjoyed working with you!"}, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "110022791534231973695", "name": "Faye Richards-Williams", "time": 1622227069893, "rating": 2.0, "text": "Lousy customer service", "pics": null, "resp": {"time": 1622581494030, "text": "Hi Faye, thank you for reaching out and sharing these concerns with us. Can you please reach out to our management at 256-233-3101 so we may address any issues? We look forward to speaking with you."}, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "117065168182018297544", "name": "Shaunteka Bell", "time": 1566459310492, "rating": 5.0, "text": "Mary Jane was great! She was very kind, professional and patient. From day one she made communication very easy and was available with all the answers to my questions. She goes above and beyond in the customer service department!", "pics": null, "resp": null, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "110698396288584445531", "name": "Daniel Webster", "time": 1580162776009, "rating": 1.0, "text": "My wife and I stopped here today to try and look at a few different models. With the kids gone we were unsure about how many bedrooms to get or what kind of house to do. We’ve been exploring modular, conventional as well as manufactured housing. We also needed to explore options for an in-law house on the same property so we were actually shopping for two houses. Today’s experience pretty well sealed the deal with staying away from a manufactured house. It was not a welcoming we expected and instead felt like a used car buying experience. The guy wanted to get info from us that we were not certain of yet and wasn’t happy with our time frame of inside of two years. When we told him we just wanted to look he replied back with, “ we only have two sales people and looking at all of them could take all day” being a business owner my self, if it takes me all day to make the customer happy, then so be it. We drove away, both telling each other that our business will stay far away from this place even if it means spending more money to do so.", "pics": null, "resp": {"time": 1580240807046, "text": "We are sorry to hear that your experience was not a positive one with Clayton of Athens. Our Sales Professionals want to understand as much about your home buying needs so we can provide you the best buying experience. If there is anything we can ever do in the future to meet your housing needs, please don’t hesitate to reach out us at 256-233-3101."}, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "110462907373858784299", "name": "Katherine Balcacer", "time": 1573531963640, "rating": 5.0, "text": "Top of the line mobile homes. Great design. Awesome staff. Will work with you.", "pics": null, "resp": null, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "110741703398635112582", "name": "Marcus", "time": 1580582459578, "rating": 5.0, "text": "Alex was definitelyntly very helpful and proffessional at showing us some beautiful homes that they have there and also with helpful information on buying from Clayton homes in the near future I will definitely be visiting him again when I am ready to make my big purchase!!!", "pics": null, "resp": {"time": 1581716670333, "text": "We appreciate that, Marcus! We can't wait to see you again at Clayton Homes of Athens!"}, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "104240552858850346349", "name": "Maurice Ruffin", "time": 1551984733105, "rating": 5.0, "text": "We have had such a wonderful experience dealing with Tara. She is very helpful in anyway she can help. Although sometimes they can be very busy they tend to get back with you as soon as possible. Very understanding and receiving as to what the customer needs and wants in their home..", "pics": null, "resp": null, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "110056186914671834401", "name": "Wendy Hall", "time": 1558140563615, "rating": 5.0, "text": "Walked in as they were closing but Tara was nice and let us look at the new home upfront. Is was so nice and the staff is friendly. Thank you", "pics": null, "resp": null, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "110083583706233748552", "name": "Sharon Wexler", "time": 1496992262894, "rating": 5.0, "text": "We were really desperately searching for options for a home as the one we had just purchased on 23 acres was unlivable. Taylor saw our distress and immediately gave us reassuring confidence that she would do anything to calm our fears and make the process worry free.  We are retired and wanted to have a comfortable, easy care home that was all inclusive. Taylor took care of everything. She showed us beautiful homes from which to choose. The buying process was made a superb experience. Every single detail was taken care of professionally and we felt genuinely as ease confident that we would be in a new home designed with every custom detail to our satisfaction.\nWe are now two nights in our beautiful new home.\nTaylor was wonderful. She took personal interest in us and we feel we made a friend not just a business relationship with Taylor.", "pics": null, "resp": null, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "107072480018692715101", "name": "Nicholas Ward", "time": 1457116690000, "rating": 5.0, "text": "This is a very professional establishment, all my needs were met with my interest in buying a home from them. Mary Jane Johnson was very informative and knowledgeable of the process and also the homes themselves. Couldn't have asked for a better experience when dealing with a manufactured home dealer. Thank you for your personal interest in my situation and what fit me best in my search for a home. I genuinely enjoyed the service and respect I was handled with.", "pics": null, "resp": null, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "115718607067184092905", "name": "Terry Butler (Butler Team Roping)", "time": 1456003610592, "rating": 1.0, "text": "Very bad customer service. Apparently you're not allowed to look at the homes without a salesperson opening every home for you one at a time. I've never seen that before. My husband and I waited in the office and walked around looking for someone. Of the several people that were in the office, no one acknowledged us. They just kept their eyes on their computer screens. We finally found another person on a tour and inquired about looking at houses. She gave us a quick reply that they were all locked and we couldn't look with out someone. There was no effort made to point us toward someone. I understand the houses being locked; however, if policy requires that someone open each house for perspective buyers, there should be sales people visible and available to speak with them. I've been to several Clayton Homes sales lots and have been given keys to open the homes and look at them at my own pace. They gave me a card and made sure I understood that they were there to answer any questions we had.  I personally do not like to have someone with me every step. I prefer to take my time and look at each home and weigh out the pros and cons and then speak with someone and ask questions. I can imagine this place had lost a considerable amount of business with this practice in place.", "pics": null, "resp": {"time": 1456158570570, "text": "Hi Terry,\n\nThank you for your feedback. At Clayton Homes of Athens, we try to make sure all of our customers are helped right away and are given tours of all of the homes so we are available to answer any questions.  Our sales consultants also point out quite a few helpful features of our homes that you might not be aware of, such as our energy efficient windows and water heaters.  We also always keep our homes locked so they are protected for their future owner—we want to make sure everyone has a beautiful home. I’m sorry that you did not have a good experience this time. I would be happy to talk to you more about it, so please give me a call at 256-233-3101 at your convenience. Thank you! Roddy, General Manager"}, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "105349899920632602099", "name": "Hannah Kimbrough", "time": 1559593834766, "rating": 5.0, "text": "Very nice lady, talked to fast but was very nice. Loved the big house!", "pics": null, "resp": null, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "102830280673828106267", "name": "Layne Steelman", "time": 1556456352752, "rating": 5.0, "text": "Looked at a Beautiful Home. Mary Jane extremely nice. She gave us a great tour of one of their homes.", "pics": null, "resp": null, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "106322960710588836324", "name": "Nicole McNeal", "time": 1534015496952, "rating": 5.0, "text": "Clayton Homes has to be the most painless homebuying experience I’ve ever had!  They are all so friendly and easy to work with!!  I hope I’m getting my forever home but if I’m not I will be a repeat customer!!", "pics": null, "resp": null, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "103361500818648940233", "name": "Deborah Hopkins", "time": 1546982666650, "rating": 1.0, "text": "Came in today to look at a double wide we'd seen online from another dealer when we seen they had the same one on this lot. Tara greated us. I explained that we would like to see a specific home and she said \"go ahead and have a seat over there and i will be with you in a little while.\" I said no actially we just want to see the home. She replied \"No we cant do that. We've got to sit down and talk to you and find out what youre looking for and what you want.\" I again explained that i just wanted to see the home. She flat out said she couldn't do that and dismissed herself. Ive never seen someone so rude and quick to dismiss doing business in my life. Her behavior is absolutely appalling! I will definitely not be doing any busy with your location because of her lack of professional behavior. She needs fired! How many more customers has she driven away?", "pics": null, "resp": {"time": 1547475351206, "text": "Hi Deborah-\nWe apologize that our location did not satisfy your expectations. We set a high standard for ourselves as far as customer service and are truly sorry to hear that standard was not met in your interaction with our location. I would love to discuss your experience at your earliest convenience. Please reach out to me personally at  256-233-3101. Thank you! -Roddy Wade, G.M. Clayton Homes of Athens"}, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "112146955447562710092", "name": "Lady T", "time": 1476724933427, "rating": 5.0, "text": "The salesman I had was very knowledgeable. He showed me everything and also owned a manufactured home himself. I prefer doing business with those that have or use the same product as they sale.", "pics": null, "resp": null, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "106051920263904798033", "name": "Kelli James", "time": 1451756390514, "rating": 1.0, "text": "Awful service stopped to looked at some single wide trailers explain to the sales person I would like to see a couple between 30k and 60k some with Sheetrock and others that were not. (Taylor) wanted to get information some from me I explain that we were under time restraints and was needing to get to the hospital due to a family member sick. She proceeded to show me one trailer and we started walking back to the office I asked if that was all she was gonna show me and she said yes. Of course at that time I left and thanked her for her time. If you want to make a sale you need to get more sales training. I had time to look at 5 or 6 six trailers and it seemed because I would not take the time to fill out there information and sit down and chat about exactly what I was looking for she had not time for me!", "pics": null, "resp": {"time": 1492537478850, "text": "Hi Kelli, Thank you for your review. I am sorry to hear that you did not have a good experience. We try get to know all of our customers before we tour homes with them to make sure we are showing them the best homes that fits everything they are looking for (home size, price, different features, etc). We know that purchasing a home is a huge decision and not something to be rushed--we want to be sure you find your dream home! I would be happy to talk to you more about it, so please give me a call at 256-233-3101 at your convenience. We want to make sure our customers are happy and informed. Thank you - Roddy, GM"}, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "111470031958284476984", "name": "Savannah Ziegler", "time": 1539291834179, "rating": 5.0, "text": "Hi my name is Savannah Ziegler me and my husband are going through them and I love them", "pics": null, "resp": null, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "103630993676638798092", "name": "Tina Crim", "time": 1561940528614, "rating": 5.0, "text": "Beautiful homes and very good customer service!", "pics": null, "resp": null, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "108726057152644093700", "name": "Tracey Dildine", "time": 1551549659792, "rating": 1.0, "text": "After walking through the of the sales office Terra said with notepad in hand. Good morning, have you been here before? We said no,and was going to say \" we just want to look around\"  and she immediately charged us through to an office, told us to fill out a form so we could see houses. We stated we had seen the houses on line and there was one in particular we wanted see, we were so excited to know there was one locally as we were possibly moving to VA in the near future Then she said, \"well if your not going to buy from Us then Im not showing you any homes, as we have to be here for our customers that are going to buy for us, we have had 7 customers this morning and dont have time for you if your not buying. My jaw hit the floor. My husband ripped up the form and said lets go. I thought for a minute she was joking, but the look on her face was that of disgust for us asking to view the home. He walked out, I asked her seriously you not going to show us 2 homes? She said no and walked out. All this happened within the first minute of the conversation.\nDisgusted and appalled at her lack of customer service skills and thoughtlessness  for people wanting ideas for their home, I can honestly say she should be fired. I have never been spoken to like that before. My husband, being in the AF for 21 years was looking for a place we could settle down in, but it won't be from your company. We then wandered around the lot, going over in our heads \"did we do something wrong\" and found Jennifer moving furnture we asked if we could poke our heads in the door and she was very kind enough to let us. We then saw another sales person, Mary Jane and she was unlocking the house we were so excited to see. I asked her if she minded us looking inside and she was most pleasant and said of course, not \"are you buying from us, not, sign this first\", just great customer service. Thank you for teaching that sales person some respect of others.\nWe then went over to the green house as Terra had just gone in, and I tried the door handle, and it was locked! She came to the door and held it so close to her that I couldnt see inside if I wanted too. She said if you go back to the office and sign the form I will let you see the houses, I asked \"did you seriously lock the door so I couldnt poke my head in the door\" she replied \"yes\". Again, floored by her attitude and I laughed out loud because it was just so childish. I hope her customers knew they were locked in with her!  She then said I have nothing more to say, and shut the door in my face!\nApparently at some point In the office I used the word \"darn or dam\" as I was so disgusted by our treatment, and she said you can go now, I won't have someone cussing at me. I'm from England and this isn't particularly a cuss word.\nTo summarise for those of you thinking of buying from Clayton Homes in Athens dont bother. You may get lucky enough to speak with Mary Jane or you may get Terra. Good luck. Yes, I have a call in to the boss Roddy and yes I will be notifying the better business bureau. We are no headed to Mundy homes to find our forever home...\nTracey.", "pics": null, "resp": null, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "109158017290780743548", "name": "N Arreola", "time": 1551971032473, "rating": 5.0, "text": "Can’t wait for my home very happy", "pics": null, "resp": null, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "111871981334201779648", "name": "Christa C.", "time": 1551929946671, "rating": 5.0, "text": "Our girl was great. Go see tara", "pics": null, "resp": null, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "107934214762836112017", "name": "F D", "time": 1551547870058, "rating": 1.0, "text": "We've lived in Alabama for 8 years. We are moving to Virginia the near term. We are working with a Clayton homes dealer in Va. We asked to be shown around the homes and Tara told us since we are not buying here they would NOT allow us to be shown around the homes.", "pics": null, "resp": null, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "112199430062682623021", "name": "Mike Campbell", "time": 1533224913695, "rating": 5.0, "text": "Great place to buy a home!  Have had many friends and customers buy from Clayton Homes!", "pics": null, "resp": null, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "115368892282112193223", "name": "Lisa Settles", "time": 1522081384390, "rating": 5.0, "text": "Very nice homes Clayton ' s has come a long way.", "pics": null, "resp": null, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "106958567987139203951", "name": "Amanda Adams", "time": 1528942766004, "rating": 1.0, "text": "Amanda A.\nHad a very bad experience, boyfriend and I spotted one we really liked and decided to stop and look. However, we had to go in main office amd met with a woman and she called us in office, she asked us bunch of questions and kept on making excuses refusing to show us any homes and called us immature. We rather live in a card board box rather than go back there and deal with them. She was very unprofessional by saying we was very pre immature not knowing what we was doing.", "pics": null, "resp": {"time": 1529418449425, "text": "Hi Amanda,\nThank you for taking the time to leave a review. I know that we have spoken since this, and I do apologize again that you had a less than satisfactory experience at our home center. We set a high standard for ourselves as far as customer service, and are truly sorry that was not your experience on your initial visit. I hope that we can help you in the future. Please let us know if you have any questions - we are happy to help! Thank you  - Roddy, GM."}, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "104796708186265901195", "name": "Terry Light", "time": 1457116679392, "rating": 5.0, "text": "I recently visited clayton homes in athens al.  The sales center seemed very professional. Maryjane Johnson was my sales rep. She was really interested in making sure all of my needs were taken care of when looking to buy a home. They had a lot of options and a great atmosphere as well. I am very happy I chose this center to look at buying a home, and would recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "112657564683817189498", "name": "Linda W.", "time": 1504470797568, "rating": 4.0, "text": "The sales reps were very nice , just not alot of inventory.", "pics": null, "resp": null, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "115287499227607791095", "name": "Farrah Cooper", "time": 1578536352384, "rating": 5.0, "text": "Amazing homes and decor", "pics": null, "resp": null, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "108829012623576233234", "name": "timothy stevenson", "time": 1484266846448, "rating": 1.0, "text": "Dishonest when it comes to contacts, still taking over a month to set up, will not obtain any permits. They claim they will take care of anything, I had to take care of everything, electrical hook up, septic, ect! If I could I would rate them an zero!", "pics": null, "resp": {"time": 1484666667213, "text": "Timothy, Thank you for your feedback. I definitely want to talk to you more about it, so please give me a call at 256-233-3101 so we can review the problem. We can't find a record of you purchasing from us, but I apologize that you had a bad experience, and I hope to talk to you soon. Thanks --- Taylor"}, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "100966139504737608193", "name": "Michael Dailey", "time": 1537303523689, "rating": 5.0, "text": "Great Homes Selection and Customer Service.", "pics": null, "resp": null, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "107939947914592648688", "name": "Shelly McMillan", "time": 1475084191962, "rating": 1.0, "text": "Taylor was very rude and refused to show us homes we asked about. She decided which ones to show us only two models off the whole lot . Worse lot within 50  miles.", "pics": null, "resp": {"time": 1492537370563, "text": "Hi Shelly, Thank you for your review. I am sorry to hear that you did not have a good experience. We try get to know all of our customers before we tour homes with them to make sure we are showing them the best homes that fits everything they are looking for (home size, price, different features, etc). I would be happy to talk to you more about it, so please give me a call at 256-233-3101 at your convenience. We want to make sure our customers are happy and informed. Thank you - Roddy, GM"}, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "101740766534215422685", "name": "KEITH GOINS", "time": 1555248441090, "rating": 5.0, "text": "Decent home", "pics": null, "resp": null, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "102199958797999331620", "name": "Nuke Life", "time": 1499815942343, "rating": 2.0, "text": "Extremely high prices for trailers, even the used ones. They have a lot of fees that add up.", "pics": null, "resp": {"time": 1499879957770, "text": "Thank you for your feedback.  Unfortunately, we do not show a record of your information at our location, Clayton Homes of Athens. Please give me a call at 256-233-3101 so we can further discuss. I hope to talk to you soon! – Roddy Wade, General Manager, Clayton Homes of Athens, AL"}, "gmap_id": "0x88628c8294abcf89:0x515d7db201f97467"}
{"user_id": "117425390824271790113", "name": "tim shorey", "time": 1598362889599, "rating": 5.0, "text": "The team at Decatur’s Clayton Homes, Bruce, Doug and Tim are awesome.  Eager to help at any length, very knowledgeable in the manufactured homes industry.  They take pride in their products the sell, do everything possible to give a good client the best experience in buying a home.  As a first time home/land buyer, Bruce went out of his way to make it as easy as possible for me.  Gave great advise on what steps needed done, and when to do them.  I recommend this team to anyone who is out to get a great home.  Job well done and thanks to each of you.", "pics": null, "resp": {"time": 1598377399762, "text": "Tim, we really appreciate your kind words, and we're so happy for you!"}, "gmap_id": "0x8862815d3dc4d5d7:0x20893552ded098d"}
{"user_id": "117056726147285230665", "name": "CHARTEASE CRITTENDON -CHAR STAR", "time": 1540585569657, "rating": 5.0, "text": "Really nice selection of homes. Go check them out!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMEJX0Wj2ZLL7mWlj_aJ8gLjBgG1bsQnoRR9AGP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOdR7qXmmxVH6vjDJI7ODxP3U6z-N5kS92u1g2V=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNinta9IF6VcT3Ed6uRr-Mg2vlPbYYlQ8WjkeR8=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN3ptyhVDCjCfcZHrvqiqAi0RP7OWh-hwAAwDbD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPD5QYvNjZc3JWqQbHMt9xMCxdtttgSqcaNzj5A=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8862815d3dc4d5d7:0x20893552ded098d"}
{"user_id": "114038403886426507300", "name": "Tiffany Hill", "time": 1619391285169, "rating": 1.0, "text": "Worst Place!  Go somewhere else. Will quote a price and the next thing you know they increase price $10,000. Will refuse to work with you when called out on what they do. The guy over, Doug, is rude. Go to Clayton of Cullman!", "pics": null, "resp": {"time": 1619553929185, "text": "Hi Tiffany, thanks for reaching out and sharing your feedback with us. Home models start with base pricing, and a number of factors, including customization options, setup and delivery, can and will increase pricing. We're sorry to hear you weren't satisfied with our location but we wish you all the best on your home buying journey."}, "gmap_id": "0x8862815d3dc4d5d7:0x20893552ded098d"}
{"user_id": "104636647555680638179", "name": "reedera4", "time": 1604604049192, "rating": 2.0, "text": "A few of the homes we wanted to look at weren't set up and several homes on the website weren't available, either.  Salesperson said she would contact us with a price on a particular home we were interested in, but we never heard from her.  Also, when we were presented with a price for another home, there was no explanation or breakdown for the price quoted.  I asked about it and never got a clear answer.  Very frustrating!!  So, we're not going with a Clayton home.", "pics": null, "resp": {"time": 1604933638340, "text": "Hi Reedera4, we're sorry to hear about your visit experience. Please contact us at 256-350-6058 so we may learn more. Thank you!- Doug Lesley, G.M."}, "gmap_id": "0x8862815d3dc4d5d7:0x20893552ded098d"}
{"user_id": "111643702158282088850", "name": "Heidi Kemery", "time": 1528568462186, "rating": 5.0, "text": "Awesome team to work with!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNUS2NrzsbHXt2euCbVW2-YDVVFDcY8CkBiPvmM=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8862815d3dc4d5d7:0x20893552ded098d"}
{"user_id": "100341891359483473498", "name": "Dale Brewer", "time": 1623585006369, "rating": 5.0, "text": "Great service Great buying experience", "pics": null, "resp": {"time": 1623855437451, "text": "Thank you so much for being a great customer, Dale!"}, "gmap_id": "0x8862815d3dc4d5d7:0x20893552ded098d"}
{"user_id": "103999733319357783158", "name": "Cecil Melson", "time": 1602080724542, "rating": 3.0, "text": "We signed on the home in January 2020. Finally moved in late May 2020. I understand weather but I was prepping the land daily, if I could work I'm sure they could. Then after sales and set up the Decatur manager told me that any dirt work  needed would be taken care of after a month of setting. It now has been 2 months and he only told a guy to fill in the septic. Field lines almost turns over my zero turn mower. I would not recommend anyone looking for a new home to deal with the Decatur group.\n\nUpdate: After talking with Doug a couple more times he and everyone at Clayton was more than happy to help me with any issues and I would be happy go back there in the future", "pics": null, "resp": {"time": 1593184922399, "text": "Hi Cecil, we appreciate your feedback, and we will be reaching out to you shortly to communicate with you on this. We apologize for the misunderstanding, as the field lines will be covered again when the rain stops."}, "gmap_id": "0x8862815d3dc4d5d7:0x20893552ded098d"}
{"user_id": "109359578312877086656", "name": "Jason Stricklin", "time": 1593446024008, "rating": 1.0, "text": "My home is the island breeze. And my exterior walls are not plumb so there for my door has daylight showing around the door,it has been replaced 3 times and the back door twice. I have staples sticking through the shingles windows are not square issues with my showers in both bathrooms. And Clayton homes says they aren't going to do anything about it,it's out of there control. They want never call me back and avoid me. So please dont let them take advantage of you to. If I could post pictures I would", "pics": null, "resp": {"time": 1593528615500, "text": "Hi Jason, we appreciate your feedback. We are sorry for the issues you're experiencing, however, we have attempted to the best of our abilities to accommodate you, however, we have been unable to come to an agreement regarding scheduling. We have asked that you contact us by phone regarding any further issues."}, "gmap_id": "0x8862815d3dc4d5d7:0x20893552ded098d"}
{"user_id": "104509519981210983311", "name": "Loretta Riddle", "time": 1589732091006, "rating": 5.0, "text": "Definitely would recommend people to come check out this place", "pics": null, "resp": {"time": 1589808643592, "text": "Thank you so much, Loretta! You are a star! 🤩"}, "gmap_id": "0x8862815d3dc4d5d7:0x20893552ded098d"}
{"user_id": "114892002043040259940", "name": "Carl", "time": 1573238870760, "rating": 1.0, "text": "Worst customer experience. Drove 2 hours with a screaming baby because we had an appointment with the manager cause we were ready to buy right then and he didn’t show up! Nobody would help us.", "pics": null, "resp": null, "gmap_id": "0x8862815d3dc4d5d7:0x20893552ded098d"}
{"user_id": "118302496457039873696", "name": "Joseph Bunton", "time": 1577564992744, "rating": 5.0, "text": "Very nice people there. I'll be back when I ready to put a new house.  Thankz for the help guy's. The one on hwy 31 in Decatur al", "pics": null, "resp": null, "gmap_id": "0x8862815d3dc4d5d7:0x20893552ded098d"}
{"user_id": "106712964223751479853", "name": "joshua gauntt", "time": 1546061838697, "rating": 1.0, "text": "Good luck with this place. Me and my wife came in to the lot ready to buy a new home. At first the service was great but after a month has gone by nothing has got started they do not return calls they seem like they don't want your business. If you really want to waste time while trying to get a home you found the rite place. The only positive is the staff are very friendly", "pics": null, "resp": {"time": 1546273108828, "text": "Hi Joshua-\nWe apologize that our location did not satisfy your expectations. We set a high standard for ourselves as far as customer service and are truly sorry to hear that standard was not met in your interaction with our location. I would love to discuss your experience at your earliest convenience. Please reach out to me personally at (256) 350-6058. Thank you! -Doug Lesley, G.M. Clayton Homes of Decatur"}, "gmap_id": "0x8862815d3dc4d5d7:0x20893552ded098d"}
{"user_id": "112796962025229948754", "name": "Austin Mann", "time": 1575721631357, "rating": 5.0, "text": "Great sales team, great selection,  the market leader. They stand behind what they sell.", "pics": null, "resp": null, "gmap_id": "0x8862815d3dc4d5d7:0x20893552ded098d"}
{"user_id": "116496831409425551917", "name": "Megan Thornton", "time": 1475524646796, "rating": 1.0, "text": "We went to Clayton Homes because of the good reputation and advertisement. The lady that helped us, Jeanie I think, was very nice and helpful. She wasn't a pushy salesperson; she let us look around and talk to each other and think about it with out trying to force anything on us. That being said, it went downhill after that. Once we paid and signed and were gone, customer service was not as good. They told us it would be 2-3 weeks before we got our home. Friday of the second week we still had not heard from them so called and left a message that was never returned. Tuesday we called again and they tell us that it is on the way while we're both at work. So he had to leave work since no one gave us a heads up. There are still drawers for the kitchen and light fixtures sitting in the living room floor, there are some minor flaws in the structure, the crew littered all over our yard (water bottles, bolts, screws, pieces of metal), we have no steps and it'll be a week tomorrow that it was delivered. We're having to climb in and out using a 5 gallon bucket. After the delivery we were told people would be back and we should get a phone call, that hasn't happened yet. We paid upfront and they acted like since they got their money we meant nothing any more. I would not recommend this place.", "pics": null, "resp": {"time": 1476219489594, "text": "Ms. Thornton, We are extremely sorry you have had this experience. We spoke with Mr. Sprague yesterday and are sending our service manager to the home on Friday. We typically wait until power and water are connected to the home to complete service. It's easier to see everything that needs to be corrected. We are happy to accommodate you guys if you feel it needs to happen before then. Again, sorry for any inconvenience. Please feel free to call me if you would like to speak further. Thank you--Mark, GM"}, "gmap_id": "0x8862815d3dc4d5d7:0x20893552ded098d"}
{"user_id": "118042210939297265848", "name": "Lallie Lucas", "time": 1569872809500, "rating": 5.0, "text": "Beautiful home that's were I bought my last home friendly people", "pics": null, "resp": null, "gmap_id": "0x8862815d3dc4d5d7:0x20893552ded098d"}
{"user_id": "105037768285579841494", "name": "Sissy P.Edwards", "time": 1567354947160, "rating": 4.0, "text": "Friendly people but they are there to sell. Nice homes", "pics": null, "resp": null, "gmap_id": "0x8862815d3dc4d5d7:0x20893552ded098d"}
{"user_id": "102866289735349843453", "name": "Teresa Cartee", "time": 1537267869513, "rating": 4.0, "text": "Took a while to get everything done but the people where great and made some friends", "pics": null, "resp": null, "gmap_id": "0x8862815d3dc4d5d7:0x20893552ded098d"}
{"user_id": "105277447745398752058", "name": "chris masters", "time": 1524229815372, "rating": 5.0, "text": "Doug Lesley  ,great guy want stop until your satisfied.", "pics": null, "resp": null, "gmap_id": "0x8862815d3dc4d5d7:0x20893552ded098d"}
{"user_id": "108859647785200805632", "name": "thomas dunnavant", "time": 1312413722395, "rating": 1.0, "text": "Clayton Mobile homes sold a double wide with an attached two car garage to friends of mine and the structure was poorly built and it is falling down.  They refuse to make restitution, they hide behind the Manufacture Home Commission of Alabama and have interfered with there ability to have the home repaired.  In my opinion, Clayton Homes is the last place on earth to buy a trailer house, that's what they are... initiation nice, high priced cow haulers.", "pics": null, "resp": null, "gmap_id": "0x8862815d3dc4d5d7:0x20893552ded098d"}
{"user_id": "106999945140380204580", "name": "Elixir Plays", "time": 1538962705752, "rating": 5.0, "text": "Great homes great atmosphere friendly staff", "pics": null, "resp": null, "gmap_id": "0x8862815d3dc4d5d7:0x20893552ded098d"}
{"user_id": "111400255057084011384", "name": "Matthew Merced", "time": 1468000176747, "rating": 1.0, "text": "I bought a brand new house and had the worst experience of my life with them. The home was falling apart quality was awful repairs were slow and when they got the color wrong on it they acted like it wasn't their fault or problem. Do not buy from here", "pics": null, "resp": {"time": 1468248047555, "text": "Matthew,\n\nThank you for your review. I'm sorry to hear that you didn't have a good experience. I know we have spoken about this several times, and tried to resolve all of the issues listed. I believe that we have taken care of everything at this point, but please give me a call at the store if you need any further help. Thanks, Mark-GM"}, "gmap_id": "0x8862815d3dc4d5d7:0x20893552ded098d"}
{"user_id": "103342302971572095931", "name": "Johnte Richardson", "time": 1492654799560, "rating": 5.0, "text": "Easy to find and has a good selection of homes.", "pics": null, "resp": null, "gmap_id": "0x8862815d3dc4d5d7:0x20893552ded098d"}
{"user_id": "100263393987829536183", "name": "Cassie smith", "time": 1506642408982, "rating": 1.0, "text": "Rude sales woman. Wasn't that happy with level of service.", "pics": null, "resp": {"time": 1507137947017, "text": "Cassie,\n\nThank you for your feedback. Excellent customer service is of the utmost importance to us and we apologize that this was your experience.  We would love the opportunity to learn more, so please call me at 256-350-6058 so we can discuss further. Thank you and hope to hear from you soon! – Doug Lesley, G.M. Clayton Homes of Decatur"}, "gmap_id": "0x8862815d3dc4d5d7:0x20893552ded098d"}
{"user_id": "105331317428851043493", "name": "Jojo", "time": 1572016787497, "rating": 5.0, "text": "Was just looking, and planning ahead!", "pics": null, "resp": null, "gmap_id": "0x8862815d3dc4d5d7:0x20893552ded098d"}
{"user_id": "108785251240567209494", "name": "Paula Godwin", "time": 1576343012638, "rating": 5.0, "text": "Just love it", "pics": null, "resp": null, "gmap_id": "0x8862815d3dc4d5d7:0x20893552ded098d"}
{"user_id": "105409780764716269554", "name": "Ethan Nail", "time": 1496939350768, "rating": 1.0, "text": "Not helpful", "pics": null, "resp": null, "gmap_id": "0x8862815d3dc4d5d7:0x20893552ded098d"}
{"user_id": "111238026621862213486", "name": "Krystal George", "time": 1620862609899, "rating": 5.0, "text": "Dave has been amazing. Moving is stressful, moving to a new area is even more stressful. Dave has helped so much. If I could give him more than 5 Stars I would. Things happen, time frames change, bumps in the road happen, but Dave has helped us with this transition. He has kept us up to date on everything to his best ability. He goes above and beyond to make sure the customer is happy and informed. I highly recommend this sales rep. If you are looking for a new home Dave is definitely who you want on your side.", "pics": null, "resp": {"time": 1621024714578, "text": "Thank you so much, Krystal! We're so happy that Dave was able to make your experience stress free and wonderful!"}, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "101930704639830813077", "name": "Deanna Hall", "time": 1623388802933, "rating": 5.0, "text": "After visiting other local dealerships we decided to drop in at Truvalue Homes just in case they might have something we like in stock. Dave Chesterman has been awesome from the moment we walked inside the office. He helped us more in two hours of time than the other places have helped us in over three months of working with us. Dave was helpful and knowledgeable and very patient with us and all of my questions. If he didn’t know the answer he found the answer. He’s been super flexible dedicating  his own personal time to answer my questions outside of his workday hours.  Because of Dave I give Truvalue Homes⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️\nBarbara D. Abercrombie (Deanna Hall)", "pics": null, "resp": {"time": 1623432878259, "text": "Thank you so much for all the stars, Deanna! 😍😍😍 We're so glad you've had such a great experience."}, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "114625137618583001786", "name": "Jessica Foster", "time": 1621468341658, "rating": 5.0, "text": "We first went to TruValue back in December. That’s when we first met Dave. He listened to everything we was looking for and showed us every mobile home on the lot lol. We left that day because we was waiting on our house to sell and told him we would be back once that got done. We went back in March and we asked for Dave again. That day we looked at mobile homes again and he listened to everything we wanted. I would highly recommend Dave to anymore looking for a mobile home. Any questions we have or had he would get right back with us.  Thank you so much to Dave.", "pics": null, "resp": null, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "115540680219606116465", "name": "Trina Hedquist", "time": 1620755523859, "rating": 1.0, "text": "Let me tell you all about how they flipped my mom's life upside down. Let me take a minute, just sit right there. I'll tell you how this business made my mom pull out her hair. (figuratively)\n\nLet's start with Wayne (who is apparently fired and so is his manager) who signed a deal with my mom assuring her they could purchase her property of choice and put the property and trailer together. My mother was approved for an FHA loan and we found the PERFECT property. They told us they got the property owner to lower the price to 20K but really and secretly Wayne had it to 15,500.... not sure if his shady ways was what got him fired but I would say it's a good bet..... anyway... Wayne \"forgot\" to send the money for escrow to the property owner. They were supposed to close on the property on a Thursday in the beginning of April of 2021. The DAY BEFORE CLOSING ON THE PROPERTY we find out that Wayne didn't fill out any information for the corporate office to take care of closing info and he just \"forgot\" all about the closing at all. So then the seller of the property raised his fee (understandably) back to original cost and made big demands for the runaround.\n\nThen we find out that Wayne is fired later and that his manager is too. Now we are told that they are going to put my mom with another guy named Austin (not the manager Austin) who allegedly is the FHA guy on the site. Well my mom already had a lender and was approved. This company INSISTS they will not buy the property unless she uses THEIR lender. And not to worry they do FHA. HA! Here's the rub this place is running the show like a used cars salesman and trying to wrangle deals that can't work for my mom. Her FHA was for 3.5% down...now they want 10% even though she is in the right score for the 3.5%. They tried to say she doesn't qualify or for the right amount her lender said she did. But my mom and brother were doing it together. In the meantime, they are REFUSING to buy this property they originally assured her they could buy with HER LENDER....suddenly that is no longer something they can do.\n\nThey want to force my mom off the FHA loan because they don't make as much and they can't add \"points\" to make money off of. I am not fooled. I worked in the housing industry. Most people buying modular and mobile are lower incomes and this company is using used car, predatory lending practices and it's gross. My mom had been looking for a house since FEBRUARY. It was going to be her very first home ever buying. She was so excited and this entire process has soured everything and she still doesn't have her home or her property and now has to just keep looking for a home because we refuse to let her do business with this shady company who was just looking to prey on my mom's limited knowledge on mortgages to their advantage. Do not go here. If you are lower income, this isn't the place for you. They have zero integrity and no transparency. Run as fast as you can the other way.", "pics": null, "resp": {"time": 1620940553804, "text": "Hi Trina, thanks for sharing your experience with us. Customer service is of the upmost importance to us and we take feedback very seriously. Can you please give us a call at 1-877-264-2812 so we can document your concerns? We'd like to loop in the appropriate parties here at the home office for support."}, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "102183195941567645176", "name": "Angela Reynolds", "time": 1578627920177, "rating": 1.0, "text": "I purchased my home October 9, 2019, I have been going back and forth with Tru Value Homes (Tony and Austin). Tony was wonderful at the beginning of my home purchase. So many broken promises on my move in date. On October 24, 2019 the first part of my home was delivered, and the second part was delivered a week later. The other part was set up on November 2, 2019. To this day I am not in my home. Several promises were made about when I was going to be in my home. The first date was Thanksgiving that was a fail, then it was a promise to move in by Christmas. So, Thanksgiving and Christmas has come and gone! With that being said, I am still not in my home and very dissatisfied with my home.\nThere are numerous defects and flaws in my home. I feel that you have let me down as a company. With me moving in that means that I am NOT satisfied with the work that is done at the home.\nI have exalted other means to communicate the importance of getting my home completed.\n\nATTACHED ARE SOME PICTURES OF MY HOME", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMxk-fxltzjOFx3-8jLS6M7pV_vQWZfkWEoZVHp=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN20SwLQAFw6f5fleayTgRtEn73_ZlIMeGWlDp0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMpqFtx8XuLS2auY_8kYZrcrLygednEAg0dLZwV=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMq8BsMrCEkkHMlBCgBK3_Jav2V_p7J4BnBAQru=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO_8ZNdNb5OjbVO1nyINKuRpUB_DwyOqApqNs74=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOYDWOTWo9_KDkZc5YBhRSRI-LZmS8-QHdwIl5J=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPAkSseROAZ_P5kG9m_bVPixoVPXblnlmozIW5D=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNe7F_FUH2U6txywLzHT57LkNs2el19FRIWs8zc=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMMfFLsF2YWBV3m33aQ0xlRW0uRw-WaGiBlayxw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPcj_noYBalo3AljUoblNqJRjTCrZkH11PH79Z5=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNwe8Q7z4kqa4MetFtQTFWlscoDEGLIB9dDS7UI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNBmRNQD2QqyBUQy_WqO08ONCJ2ecLg5n7KFwFY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPpPIBqUXwwVkf-4brJl0vD8nECpdnz_VBDCxgh=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPZr6y5XUB06fXXlz-y0LjWTztyGARRIhxd1j2H=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPKcz4LI2JmnIUyJ6bnNzwfEvXccucoUvhZv9R6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPnForwp4TqM1OP71cYnIVIe2hnsJogcTAUmWuD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMz63q0r_HijaiwKtLIly2B307LfR_Mi4MsqPNW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOgULArU_i4sVePooeB55XB2JUUMHVTCxhT2_BO=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM_dwKdcUF5_WmbOYJEPoRYbwBeSEKXNMgvPApZ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOs1GvHjqa4YsaFbCm-JXB-T1oJtl0wyCO1ODss=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOh2W4VZcSs-J2uVuRCcPEP5KaMln2t27y9cWQG=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipObIp0rwy67jDWjNS-6EdUTw_OX02iK2uXksoTC=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOL4K60Vofv9lxBI9HULxdfF65ekGX3Ac6zmcHk=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOHtlCsfGlv9s3HUKMvQhwB1AoZYKRCJjeI_U32=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOEH62VSXctQ-g3a59H1NOipqynz7Am-4UaPH7D=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPj6JBjXEbyO258D2XdHCl6xgWWFIEQpD5lm2-t=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNWUvhPnVoAXyPy79Aj3BkiYpOoE5wvbDaknjI2=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMol0VFsPWb60R2qNks-fmGw-GXxqMckdizKTWf=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPjfhsMfSfmm3F4xHUf6yobySW9syJu4DGXMYIf=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMGTxQBK6qqj5mMQP82IY1LRHf0u5HxXXIqBgpf=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMPKyv3z44Ae8l4vbMRYfj3orqG2T4LO3NSN72Z=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPIx-poCtAzbShm02o3nYq8A8xvj7QZGbg4gahS=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO1jKnP64X8qPjhXv7R3i18A8yps02Z2hOgVyFp=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNFjUJ3dFWca0AbGttzzDGxOk-rd55evubwEefy=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPPQql9ZqkzFyYRO9LjyXh4mhCPTZtOmaEemCqJ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPj0ef45gbVJNCs9XLPiPdq1bm-L8elpWwE50ke=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPunFlbaAzVSEtN8MAkNMj-GQw1wfkcAcArWI0k=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOdgEE2bSEd6o7mfnnYPgvKpPB7iXFEsJFzjW-5=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNQ2hE5_eIM7ZzdSZ-ZgNKS1fnPGc6Af31y7eay=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOIxwezgkDjJpge9yUTMB166ys6COlLgwbfjmwy=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN0OX0rFXLeCEx8Hl87xKKD7vJj9eeVmeAImOKz=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPGoW93q-S07AndxMTUxNG8q0d23oSWndcsr5Vs=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOwPT1DovPYP250iXNGZ7QnO0VqCHKwaWcsMiIO=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNftnaF0z86SCir_1SGxUAbsIdYWCUh0YXaHSGE=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPZci6mt4wFUEwbXzfmZ8Shw0nKY-R4SrEeFkDx=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOYv0bqWdgKALKDyBn5oABH-qqMzmJ2v0be4KNO=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPFLp4tascW944ziWLz0DBMP7OIKkLFfIAAbhnL=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOzZPnPJME6SanD8kheOWlHK4wO-jNbrIlFnjDQ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMOrHoM6he3TEQW4D6u7NN6T8qUlhfaP4XZtI_y=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMYYlC-Udz6VmJKkSKIyP0UWWnEW5tuBJN5vDst=w150-h150-k-no-p"]}], "resp": {"time": 1580330461104, "text": "Angela, I appreciate your feedback! I see that you've been in touch with the Home Buidling Facility and that there's a plan in place. If you need anything else, please don't hesitate to reach out!"}, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "108116621731043193173", "name": "hannah Bonds", "time": 1600099656091, "rating": 5.0, "text": "We had the best experience at true value. Dave was awesome! He helped us find a home and helped us close fast . He made our experience stress free and easy. I Definitely recommend him and true value. The staff is very helpful and friendly. Be sure to ask for Dave!", "pics": null, "resp": {"time": 1600182204420, "text": "Thank you so much for the kind words, Hannah!"}, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "107185601052887858555", "name": "April Shank", "time": 1610561786927, "rating": 5.0, "text": "My husband and I were looking for a manufactured home. We went to 3 different home centers. We finally ended up at Tru value homes. Dave Chesterman was great to deal with. He took a lot of time showing us the model homes. He had a lot of great suggestions on which homes to look at, based on the features we were looking for. The service we have received from Dave is second to none. We had never been through a construction loan process. He always tries to make sure all our questions are answered in a timely manner.", "pics": null, "resp": {"time": 1612196343624, "text": "Hi April, thank you for choosing TruValue Homes! We're so happy that you had a wonderful homebuying experience!"}, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "118209988054320527184", "name": "mike bemis", "time": 1609463300227, "rating": 5.0, "text": "All I have to say is, “Dave!”  That guy was was awesome! He was so fast and easy to deal with. Highly recommend this business as well as the rep. Ask for Dave.", "pics": null, "resp": null, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "101070153576828407382", "name": "Steven Kay", "time": 1613188369806, "rating": 5.0, "text": "I've been part of the TruValue & Clayton Home team for over a year & I've never worked for a Company that bent over backwards for their customers like the team @ TruValue. They truly care.", "pics": null, "resp": null, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "113572483394396106802", "name": "Shawn Kelsey", "time": 1598565436787, "rating": 5.0, "text": "It was easy and simple experience they treated me like I was a king and showed me the true value way. I enjoyed meeting everyone and with the warranty they offer everything is taken care of while I settled in to my new home.", "pics": null, "resp": {"time": 1598548950701, "text": "Thank you so much, Shawn! We really appreciate the kind words and feedback!"}, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "109979351259567971027", "name": "Allison Crosson", "time": 1610648122887, "rating": 5.0, "text": "TruValue Homes has a great group of people to work with. They do care about their customers and put hard work in from each department of the business.", "pics": null, "resp": {"time": 1612196479888, "text": "Hi Allison, thank you for reaching out and sharing your experience with us. We truly appreciate your feedback and we're so happy you chose TruValue Homes!"}, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "107698119907775199488", "name": "Charlie Christopher", "time": 1589071274981, "rating": 5.0, "text": "Austin Lesley is a truly professional and knowledgeable GM, even though he has a lot on his shoulders everything we have asked of him he has made sure we were satisfied. I would recommend this place to everyone. All the people who works there is super nice and professional!", "pics": null, "resp": {"time": 1589294829638, "text": "Thank you, Charlie. Your feedback means the world! 😀"}, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "115178186604919134514", "name": "Joseph McConnon", "time": 1598486660550, "rating": 5.0, "text": "All the salesmen were very knowledgeable on there product Patrick McConnon was extremely helpful a great listener we will be buying a home from him soon", "pics": null, "resp": {"time": 1598549144871, "text": "Thank you, Kim! We look forward to working with you!"}, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "101725489277381021244", "name": "billie sue", "time": 1589070031297, "rating": 5.0, "text": "My experience at TruValue homes has been very pleasant and i would fully recommend buying a home from here. Austin and staff are very knowledgeable and professional. Thank you all for a great experience!", "pics": null, "resp": {"time": 1589294872199, "text": "Thank you, Billie Sue. We value your feedback and hope you have a wonderful day!"}, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "117983922436500247314", "name": "Dave Chesterman", "time": 1598455425284, "rating": 5.0, "text": "Great customer service and was treated great and with care.", "pics": null, "resp": {"time": 1598472776239, "text": "We're so happy to hear that, David! We hope you have a great day!"}, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "118346136605751506484", "name": "Ricky Lester", "time": 1556302025824, "rating": 1.0, "text": "These guys don't even deserve a star period especially if your a cash buyer . It has been a nightmare from hell . I advise anyone that's in the market for a mobile home to keep on looking elsewhere . The quality , Craftsmanship and most of all honesty doesn't exist at all ! But you can get a better price here , but trust me in all aspects ....it will cost you a whole lot more in the long run. If your a out of state purchaser,  stay away from here please because when you've had enough of they're BS and your ready to hire an attorney,  you'll have to do so in the state of Al ! Luckily I found one that's very aware of they're way of conducting business and was more than happy to take on the case . I'll be posing the outcome of this issue as this matter is handled in court . And please , keep all your paperwork,  documentations as I luckily did and even if you have to wear a recording device  I strongly recommend it because you'll need it .", "pics": null, "resp": {"time": 1556549070907, "text": "Hi Ricky-\nThank you for your feedback. I would like to get more information about your visit to our location, Tru Value Homes. Please give me a call at 256-820-0510 at your earliest convenience. Thank you and I hope to hear from you soon! -Austin Lesley, G.M. Tru Value Homes"}, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "115777815173585595320", "name": "Jimmy Cotton", "time": 1590962058678, "rating": 1.0, "text": "Stay away from this place! Everybody that work there are biggest lier in Calhoun also! They you a lie to your face! NOTHING BUT LIER!!!! You save money anywhere else. And other places tell you the truth.", "pics": null, "resp": {"time": 1591025657514, "text": "Hi Jimmy, we appreciate your feedback. Unfortuantely, we do not show a record of sale or a visit from you to TruValue Homes of Alexandria. Please contact us at 256-820-0510 if you need more information. Thank you."}, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "115473713646305083144", "name": "Jamie chastain", "time": 1537980490617, "rating": 5.0, "text": "I stopped by TruValue to look at some home and surprisingly I was not bombarded by salesmen when I got out of my car. I filled out an application and the manager, Austin made sure i was comfortable while doing so. David helped me with any questions I had. Wayne went over the process with me and made sure i understood. Great place. I highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "110292051961248416786", "name": "Corey Moore", "time": 1583004290080, "rating": 5.0, "text": "This team really helps people. Great homes.", "pics": null, "resp": null, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "115834091467927734418", "name": "Alicia Glass", "time": 1565105357443, "rating": 5.0, "text": "So far everything is going as planned. David has been straight up and went beyond what he had to. We picked color out and carpet. I will update when it gets on my property and everything is done. As of now very pleased with Tru value and David.", "pics": null, "resp": null, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "107565406746308966601", "name": "TheLandMammal Foodiez", "time": 1584066605195, "rating": 5.0, "text": "Great deals w/ knowledgeable staff that let's you look around w/out hassling you, they patiently walk you through the purchasing process & seem to go above & beyond. I will update in the coming months on the warranty end.", "pics": null, "resp": {"time": 1584103711933, "text": "Thank you so much for the kind words and recommendation! We are so excited for you and hope you love your new home!"}, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "110792844700370707196", "name": "J D P", "time": 1578414042864, "rating": 2.0, "text": "They was not as nice as other ones I looked at. The one that was kind of nice looked like it was in a tornado", "pics": null, "resp": null, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "111557759611940290279", "name": "Gloom Ag", "time": 1579718185588, "rating": 1.0, "text": "We just purchase our home ....the process was horrible we were given false info...they told us things like we wont have a payment till feb ...they never installed our steps we had to get temorary steps made to move in ....even after they finished the underpin (which Took them forever to come and do ) they never installed our steps we still do not have back steps ..the inside of my home was put together Poorly ...it was just a mess everything from the beginning to the end ...i told my husband about the reviews before we closed but he felt we were in to deep and stuck ...but this was just the worse dec ever  ...do not use them", "pics": null, "resp": {"time": 1580233469859, "text": "Hello, we appreciate your feedback, and we are sorry to hear about your experience. We would like to learn more about this. Please contact us directly at 256-820-0510 so that we may assist, you. Thank you!"}, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "106875971175340083788", "name": "B B", "time": 1565228676289, "rating": 1.0, "text": "They trashed a sweet old lady’s yard and lie about fixing things. Austin lies and lies offering nothing but excuses. Shameful to treat the elderly this way.", "pics": null, "resp": {"time": 1565277540998, "text": "Hi TS,\nWe want to sincerely apologize for your negative experience at our location. We would like to learn more about your visit and what exactly happened. Please give us a call at 256-820-0510 so we can try to make things right. We look forward to hearing from you and earning back your business. -The Team at TruValue Homes of Alexandria"}, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "102719496335826558204", "name": "Rose Saxon", "time": 1569021836992, "rating": 1.0, "text": "Not very helpful in getting a home. They say they help people with bad or no credit. Told me my credit wasnt good enough, and they are repo trailors", "pics": null, "resp": {"time": 1569435932888, "text": "Hi Rose-\nThank you for your feedback. As discussed in our previous conversations, our team has done everything possible to help resolve these issues. Unfortunately, some factors, including financing, are beyond our control. Our hope is to help as many families as possible achieve their homeownership dreams and we are so sorry things did not work out this time. Please feel free to reach out to me if there is anything I can do to amend your experience. -Austin Lesley, G.M. Tru Value Alexandria"}, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "109489933973961863683", "name": "Tammy Baxter", "time": 1537816306500, "rating": 1.0, "text": "This place is an absolute JOKE. My mother recently purchased a new home from them and the entire experience was a total NIGHTMARE. We are now in the stage where her yard is nothing but uneven dirt, random metal, nails, ??? are all over the place. The manager Austin will tell you whatever you need to hear to not have to deal with you and should be absolutely ashamed of himself for running a \"business\" the way that he does. We wish we would have seen their google rating before we started down this road, as we are certainly not the only dissatisfied customers. JUST LOOK ELSEWHERE.", "pics": null, "resp": {"time": 1537986600702, "text": "Hi Tammy,\nI appreciate your review. Your feedback is extremely valuable to us, as we strive to improve with each and every day. I would like to talk to you more about it, so please give me a call at 256-820-0510 so we can review the problem. Thank you! -Austin Lesley, G.M."}, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "112131696533721268995", "name": "Tina Pierce", "time": 1545952581055, "rating": 5.0, "text": "I bought a single wide mobile home from them and they are the best place to get a mobile home and they are fast and nice very friendly and helpful will help you out anyway possible this place is the best place to get a mobile home at !", "pics": null, "resp": null, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "109836490971091291877", "name": "Brandy Farley", "time": 1538764404138, "rating": 1.0, "text": "We are buying a repo. We've had it since May and still haven't received the skirting and have found mold 2 months ago and our fireplace pours everytime it rains. The one that did our sale and the GM won't even respond about the mold and keep putting us off on the skirting, which was included in the price, was supposed to send someone about the fireplace and, of course, never did. Thank God for the mortgage company because they are going to have our stuff fixed where TruValue should have stepped up! The guys at Truvalue, overall are good people but they don't do what they should or say they will.", "pics": null, "resp": {"time": 1538763481086, "text": "Hi Brandy,\nThank you for taking the time to leave a review. I am so sorry to hear your experience with us was less than satisfactory. I would like to take the time to talk with you to learn more. Please call me at 256-820-0510 at your earliest convenience. Thank you! -Austin Lesley, G.M."}, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "115474189285468765712", "name": "Clint Murphy", "time": 1537980068485, "rating": 5.0, "text": "By far the lowest prices and best service in Alabama and Georgia for new and used Manufactured homes.", "pics": null, "resp": null, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "117109779524351489623", "name": "Tony Stone", "time": 1537989250357, "rating": 5.0, "text": "Knowledgeable sales staff with the best prices in town!!", "pics": null, "resp": null, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "111381046997857426599", "name": "L Poole", "time": 1513658487624, "rating": 1.0, "text": "Worst Home buying experience I have ever had.I have purchased 3 New manufactured homes in the last 6 yrs.I can honestly say this has been the worst transaction and service I have seen or been a part of.Promise's made,did not meet those.Follow up service has been a total nightmare. Lost a lot of work and took off alot expecting follow up work to get done or completed. Didn't happen.They just tell you what you need to hear to pacify you.But the work just gets put off. Total nightmare.Time to go to Corporate.", "pics": null, "resp": {"time": 1514566203236, "text": "L Poole,\nThank you for your feedback. I am sorry to hear you had a poor experience. I would like to get more information about this, so please call me at 256-820-0510 so we can discuss further. Thank you! – Austin Lesley, G.M. TRU Homes of Alexandria"}, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "108810979115788014740", "name": "Candi Crosson", "time": 1537980925971, "rating": 5.0, "text": "Very knowledgeable sales staff & very helpful.", "pics": null, "resp": null, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "104747716846131011511", "name": "Stan Nelson", "time": 1510676316057, "rating": 1.0, "text": "The movers they have are going to get ppl killed then cussed me like. A yard foh.I reported it and just hot blown off", "pics": null, "resp": {"time": 1511207305961, "text": "Stan,\n\nThank you for your feedback. Unfortunately, we do not have record of your information at our location, TRU Homes of Alexandria.  I would like to get more information about this, so please call me at 256-820-0510  so we can discuss further. Thank you! – Austin Lesley, G.M. TRU Homes of Alexandria"}, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "104341103900793415719", "name": "Richard Barber", "time": 1537999302807, "rating": 5.0, "text": "Great team, laid back, no pressure!!", "pics": null, "resp": null, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "106378539413556556185", "name": "Karen Pettus", "time": 1509871024996, "rating": 1.0, "text": "NEVER EVER AGAIN! Save yourself the headache and the money and go somewhere else... far far away from TruValue Homes of Alexandria!", "pics": null, "resp": {"time": 1510605381961, "text": "Karen,\n\nThank you for your feedback. I am sorry to hear you had a poor experience. I am glad I was able to get in contact with you today. Please call me at 256-820-0510 if you have any further questions. Thank you! – Austin Lesley, G.M. TRU Homes of Alexandria"}, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "100700718346691331117", "name": "Steven Mann", "time": 1558624838700, "rating": 5.0, "text": "These people work for you", "pics": null, "resp": null, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "108401521555455232687", "name": "Steve Buchanan", "time": 1579918394851, "rating": 4.0, "text": "Good people", "pics": null, "resp": null, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "106873381556105140593", "name": "Starr Sepeda", "time": 1535375957222, "rating": 1.0, "text": "I’ve never actually bought from here but after seeing one star in just about all the reviews I probably never will!", "pics": null, "resp": {"time": 1536167925657, "text": "I appreciate your review. Your feedback is extremely valuable to us, as we strive to improve with each and every day. I would like to talk to you more about it, so please give me a call at 256-820-0510 so we can review the problem. Thank you! -Austin Lesley, G.M. TRU Value Homes"}, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "106873381556105140593", "name": "Starr Sepeda", "time": 1535375957222, "rating": 1.0, "text": "I’ve never actually bought from here but after seeing one star in just about all the reviews I probably never will!", "pics": null, "resp": {"time": 1536167925657, "text": "I appreciate your review. Your feedback is extremely valuable to us, as we strive to improve with each and every day. I would like to talk to you more about it, so please give me a call at 256-820-0510 so we can review the problem. Thank you! -Austin Lesley, G.M. TRU Value Homes"}, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "110994238712686798924", "name": "Susan Abernathy", "time": 1560449446144, "rating": 1.0, "text": "I would have put negative 100 if i could have!!!!!!!!!!!!!!!!!!", "pics": null, "resp": {"time": 1560793497352, "text": "Hi Susan-\nWe apologize that our location did not satisfy your expectations. We set a high standard for ourselves as far as customer service and are truly sorry to hear that standard was not met in your interaction with our location. I would love to discuss your experience at your earliest convenience. Please reach out to me personally at 256-820-0510. Thank you! -Austin Lesley, G.M. Tru Value Homes"}, "gmap_id": "0x888a4aff43ed4d21:0xa6c630b0ea0c3ee4"}
{"user_id": "104067920158437528016", "name": "Valerie Beasley", "time": 1615229984200, "rating": 1.0, "text": "The sale rep.  Helen was excellent. Unfortunately she is not there now. She answered all calls day and night. Once they got my mom to sign on the dotted line, she was lied to repeatedly about someone coming out to fix the repairs that was done through manufacturing or during transport of the trailer. She has had the trailer since October or November of 2020 and I have been calling repeatedly to get someone to come out and make repairs. Who wants to live in a used trailer and paying for a new trailer.", "pics": null, "resp": {"time": 1615244495165, "text": "Hey Valerie, I'm sorry to hear that you were unhappy with the service you received at Regional Home of Mobile. Our number one priority is to meet and exceed expectations at every interaction. Since we don't have much control over the manufacturer servicing, we do everything in our power to get issues resolved for you quickly but that's not always the case. We will keep working hard to get these issues taken care of more promptly!"}, "gmap_id": "0x889bac50d0782b3f:0xc3a00ab7168b00b8"}
{"user_id": "101235902049760834020", "name": "candice harrison", "time": 1562855720693, "rating": 1.0, "text": "It is going on month three of owning my home and I can say that not one room in my home is complete. The sales rep Tiffany was helpful in the purchasing process but once your passed off emails & phone calls are returned at their convenience! however I took it upon myself to mail over 30 pictures of the horrible craftsmanship done to each home office. Because I have without a doubt fell through the cracks with Regional & Cappaert Homes!! Never Again!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNb3UWFAT6rLg9oKwiGspoJJZQyBnGrhbXezhda=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMCYt-ca-9u-IDXPSikmBQpJdj_BFaHy2Fm7Dpt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMaTV3jWxJogVftfCBPT4WpXMB6beHExPeWfvht=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPLm1OUEVk1Tw3AOHR9CHl6n36NRgL8JuCmm-qr=w150-h150-k-no-p"]}], "resp": {"time": 1562863663158, "text": "Hey Candice - we apologize for any inconvenience. Please give our main office number a call and ask to speak with the General Manager, Sean, and he will help you get this taken care of. Customer Service is our #1 priority."}, "gmap_id": "0x889bac50d0782b3f:0xc3a00ab7168b00b8"}
{"user_id": "110463943490799135716", "name": "Rhonda Edwards", "time": 1612045600049, "rating": 5.0, "text": "Quite a bit to choose from, but then we're in the middle of a pandemic, so to order what you want would take nearly 4 to 6 months. Also, they are in such demand, that they won't consider a cash discount...cuz they can get whatever price they put on 'em... And even if that's the case, why would you admit that? And while we're on the subject of a pandemic, I think this would be a good time to \"work\" out a good deal with us hard working folks who are struggling right now...not price gouging!!! Just sayin'!!!", "pics": null, "resp": {"time": 1614267533694, "text": "Thank you Rhonda for the good review! We are happy to hear that your experience with us was satisfactory."}, "gmap_id": "0x889bac50d0782b3f:0xc3a00ab7168b00b8"}
{"user_id": "111125533241683574733", "name": "Jimmy Mcneeley", "time": 1617210212488, "rating": 5.0, "text": "Great customer service Mr.Greg Miller!", "pics": null, "resp": {"time": 1617653182962, "text": "Thank you Jimmy for the kind words and great review! We appreciate it!"}, "gmap_id": "0x889bac50d0782b3f:0xc3a00ab7168b00b8"}
{"user_id": "117176364859831372836", "name": "Dr.David Callaway", "time": 1617293170124, "rating": 5.0, "text": "Great selection to chose from.", "pics": null, "resp": {"time": 1617653256032, "text": "Thank you for the amazing review and kind words! We are happy to hear that you had a great experience with us!"}, "gmap_id": "0x889bac50d0782b3f:0xc3a00ab7168b00b8"}
{"user_id": "115662601486669176583", "name": "Tonya Lockett-Shamburger", "time": 1598061272369, "rating": 1.0, "text": "I am completely not satisfied with how this process has went. We purchased our home in January it was delivered in February here it is August and they  regional or cappaert have not completed or tried to complete our beautiful home that wasn't cheap. We have been more than patient and understanding we haven't received not one phone call.  After letting them know our home  wasn't completed. After leaving messages. I have called, emailed, & sent pictures of the incomplete work. I can say that not one room in my home is complete.  Cappaert called  in July to see  if we were enjoying our new home. I told them its not completed.I sent  pictures of the horrible craftsmanship done. Walls separated, nails sticking out trimming coming apart . Didnt receive the kitchen Drawers cabinets coming loose from the wall. I have a 11 month old & this new home we purchased isn't safe .  Haven't heard anything else from them.I'm so disappointed with Regional & Cappaert Homes!! Never Again!! The only thing I'm satisfied with is The sales rep Helen was awesome in the purchasing process helped any way she could any time of day & night due to my work schedule to get me my HOME & in my home NO complaints with her. I thank her for her time. If everyone else would do what they suppose to do. Im not asking for anything extra. I just want my home completed correctly. I don't know what else to do. Who else to call & they don't give me the run around. please just complete the work.", "pics": null, "resp": {"time": 1598276251030, "text": "Hey Tonya, I’m sorry you were unhappy with the service you received at Regional Holmes. Our number one priority is to meet and exceed expectations at every interaction. Since we don’t have much control over the manufacturer servicing, we do everything in our power to get issues resolved for you quickly but that’s not always the case. We will keep working hard to get these issues taken care of more promptly!"}, "gmap_id": "0x889bac50d0782b3f:0xc3a00ab7168b00b8"}
{"user_id": "114234775173873190474", "name": "Louis Bird", "time": 1599486510008, "rating": 4.0, "text": "Nice homes but compared to Southern homes they are over priced and they don't seem to have the same customer service. Took them to long to give me the price of a trailer", "pics": null, "resp": {"time": 1599580194332, "text": "Thank you so much for the review and the feedback Louis. We would love to hear back from you and how we could have made your experience better here at Regional Homes!"}, "gmap_id": "0x889bac50d0782b3f:0xc3a00ab7168b00b8"}
{"user_id": "117339669706046946656", "name": "holly campbell", "time": 1583206913030, "rating": 2.0, "text": "We have had our manufactured home for a year now and I can say I am completely not satisfied with how this whole process has went.been lied to multiple time,and they had workers in our home making repairs,so they called it but made it ten times worse!! Our home does not look brand new it looks like a used home,it was in perfect shape when we looked at it on the lot.we have had people out here 5 times to work on it and fix it and it still is not done!!! Plus all the baseboards around the windows along the floor and ceiling are messed up and even cabinets look bad because someone decided to use flat paint on the shiny parts so we have patches throughout our whole house,plus our front door is not leveled and it is crooked. If we could go back in time I would definitely of not bought a home from here. I wish they would fix what needs to be done instead of saying they can't do it.", "pics": null, "resp": {"time": 1597781593860, "text": "Hey Holly - I’m sorry you were unhappy with the service you received at Regional Homes in Mobile. Our number one priority is to meet and exceed expectations at every interaction. Since we don’t have much control over the manufacturer servicing, we do everything in our power to get issues resolved for you quickly but that’s not always the case. We will keep working hard to get these issues taken care of more promptly!"}, "gmap_id": "0x889bac50d0782b3f:0xc3a00ab7168b00b8"}
{"user_id": "110895431822810529713", "name": "Jermain Manuel", "time": 1555694149759, "rating": 5.0, "text": "My husband and I had the best experience.. We just purchased our forever home two weeks ago. Tiffany and Vic are awesome. They went above and beyond in helping me choose the right home. I'm so glad I decided to stop there...", "pics": null, "resp": {"time": 1562945104110, "text": "Thank you so much for the great review!"}, "gmap_id": "0x889bac50d0782b3f:0xc3a00ab7168b00b8"}
{"user_id": "105797067379882929579", "name": "John Chessher", "time": 1541082255947, "rating": 5.0, "text": "My wife and I were treated like family from the time we got there. We met with our saleswoman and told her what we were looking for. It didn't take us long to find our new home but we wanted to change the inside colors and I wanted to change the outside color. And then the process began, Our 2019 28×56 was special ordered and built to what we like. Thank you Mrs.Tiffany (Our saleswoman) and Mrs. Connie and last but definitely not least Mr.Richie. All of you made our dream of owning a brand new home come true. Thanks again.", "pics": null, "resp": {"time": 1562945137697, "text": "Thank you so much John - it was a pleasure!"}, "gmap_id": "0x889bac50d0782b3f:0xc3a00ab7168b00b8"}
{"user_id": "108718138636373234117", "name": "Rebekah Richerson", "time": 1550003676026, "rating": 1.0, "text": "Do not recommend buying from them! They will lie and tell you exactly what you want to hear and promise you things that will not happen! All they care about is getting their money and then the lies come out. I have tried contacting the general manager but he has never called me back. Worst experience ever. Save your self some trouble and go somewhere else!!", "pics": null, "resp": {"time": 1550070515176, "text": "Hi Rebekah - We're very sorry about your experience. Would you mind calling our office at 251-649-2077?"}, "gmap_id": "0x889bac50d0782b3f:0xc3a00ab7168b00b8"}
{"user_id": "103322815010459197461", "name": "Sandy Stamper", "time": 1560808742612, "rating": 1.0, "text": "Would not recommend this place to anyone. They are not true to there word with fixing the things that have went wrong. My daughter bought a home from them and it has been nothing but a headache trying to get them to fix the problems . Home is very unlevel, the doors have inch gapps in them, rain water coming threw back door, one room has to have new paneling due to it being so unlevel. It's just horrible that my child works so hard for what she has and then you have sorry buisnesses like this that don't care...", "pics": null, "resp": {"time": 1561055844311, "text": "Sandy - we apologize for any inconvenience. Please give our main office number a call and ask to speak with the General Manager, Sean, and he will help you get this taken care of. Customer Service is our #1 priority."}, "gmap_id": "0x889bac50d0782b3f:0xc3a00ab7168b00b8"}
{"user_id": "105315203874407003506", "name": "Jodie McKinley", "time": 1562942704120, "rating": 4.0, "text": "We are shopping for a new mobile home and this is the first place we visited. After talking to Tiffany, she steered us in the right direction and gave us ideas on which homes we’d probably like to look at first. It was a Saturday and this place was super busy. We had made an appointment but it was apparent that Tiffany was overwhelmed with customers and she was unable to give us much of her time (although not her fault, she was there with only one other guy who didn’t seem to know much about anything). We were able to tour the homes at our leisure and their houses are all high end and very nice. There was no pressure to purchase anything.\n\nI deducted a point for the state of their sales “yard”. It is packed dirt pocked full of dips and holes and loose gravel so make sure you wear good comfortable shoes. If I was the owner I would make repairs to this area as it’s a liability waiting to happen (I almost sprained my ankle twice) and it doesn’t look nice.", "pics": null, "resp": {"time": 1562945076950, "text": "Hey Jodie - thanks for your honest opinion! We are aware that the lot yard needs some maintenance and are planning on having that fixed very soon!"}, "gmap_id": "0x889bac50d0782b3f:0xc3a00ab7168b00b8"}
{"user_id": "101833172236690853977", "name": "Christian Cunningham", "time": 1559076648688, "rating": 1.0, "text": "I only give one star because i have to in order to give a review. We heard so many good things about this company and thats why we went with them; however, I regret that every single day. We have been having our home going on 3 months and it has yet to be fixed. They bent our frame, the walls have buckles in them, our house isnt even leveled. Ive tried to contaxt them over and over and no one replies. Tiffany was an outstanding sales rep and she definitely made us feel at ease with everything. However, the depts above her including the general manager is only worried about money. Looks as if we will have to get a lawyer involved just to get our home repaired.", "pics": null, "resp": {"time": 1561055892084, "text": "Sandy - we apologize for any inconvenience. Please give our main office number a call and ask to speak with the General Manager, Sean, and he will help you get this taken care of. Customer Service is our #1 priority."}, "gmap_id": "0x889bac50d0782b3f:0xc3a00ab7168b00b8"}
{"user_id": "100796720308107402313", "name": "Michael Norris II", "time": 1592257045387, "rating": 5.0, "text": "Great Company and staff", "pics": null, "resp": {"time": 1597781495913, "text": "Thanks so much for the kind words Michael! We appreciate it!"}, "gmap_id": "0x889bac50d0782b3f:0xc3a00ab7168b00b8"}
{"user_id": "117343391878620576566", "name": "Rita Thompson", "time": 1599765881881, "rating": 3.0, "text": "Nice homes", "pics": null, "resp": {"time": 1599775353111, "text": "Thank you Rita for the kind words! We would love to hear back from you on how we could have made your experience better with us so we know how to improve moving forward. Thank you in advance!"}, "gmap_id": "0x889bac50d0782b3f:0xc3a00ab7168b00b8"}
{"user_id": "110973830018695117019", "name": "Maxie 43 Rob", "time": 1571317751360, "rating": 4.0, "text": "Love the homes top notch", "pics": null, "resp": {"time": 1597781760082, "text": "Thank you Maxie for the kind words!"}, "gmap_id": "0x889bac50d0782b3f:0xc3a00ab7168b00b8"}
{"user_id": "100817694348415246372", "name": "john lee", "time": 1609269805085, "rating": 4.0, "text": "Looking for prices", "pics": null, "resp": {"time": 1609272477382, "text": "Hey John, thank you for your review! If you are looking for prices on a home please visit our website (https://regionalhomes.net/) and click to find a branch nearest to you. Our associates will be happy to assist you with quotes and information on homes. Thank you!"}, "gmap_id": "0x889bac50d0782b3f:0xc3a00ab7168b00b8"}
{"user_id": "101951359497500988515", "name": "Savannah Jazzlin", "time": 1558620142447, "rating": 4.0, "text": "Nice place open and inviting", "pics": null, "resp": {"time": 1562945089264, "text": "Thanks for your honest review!"}, "gmap_id": "0x889bac50d0782b3f:0xc3a00ab7168b00b8"}
