{"user_id": "116678898632416869174", "name": "Lillian Bush", "time": 1594089853159, "rating": 1.0, "text": "They took our money but we’re still living out of boxes!  After more than a year of trying to get started with building a safe place for us to live we’re forced to move on. We are both over 70 and sick. Our home is more than one hundred years old so utilities and maintenance are very high. We went through winter using space heaters. When we turned the air conditioner on it caught fire after just two days of use!  Mobility issues mean we could not get out quickly in an emergency but they won’t even return calls or discuss the refunding of our money. They are dishonest and heartless so please don’t follow my lead. Do not trust these people to do what they say!", "pics": null, "resp": null, "gmap_id": "0x889bcb911ca32803:0x90635852b432bef"}
{"user_id": "106298035395434792055", "name": "Deborah Deskins", "time": 1566002529148, "rating": 1.0, "text": "They don't honor their contracts! Been dealing with this over a year now. They put a different roof on my home than the blueprints state and now my hvac system can't be put in the attic where I originally wanted it to go. Have had to redo practically everything from the roof down! Now having trouble getting inspections passed. I would not recommend this company.", "pics": null, "resp": null, "gmap_id": "0x889bcb911ca32803:0x90635852b432bef"}
{"user_id": "106559781597176960895", "name": "Michael Robinson", "time": 1536244965215, "rating": 5.0, "text": "If you want a new home just the way that you want and at a great price  stop playing around  and go now  and check other this new place and sit down  and let them fix you up getting  my daughter one first and then me one also theses  people are a blessing", "pics": null, "resp": null, "gmap_id": "0x889bcb911ca32803:0x90635852b432bef"}
{"user_id": "115681468747126051915", "name": "gaius thompson", "time": 1565233643590, "rating": 1.0, "text": "I'm taking bets to see how long they will be in business before the lawsuits and attorney general shuts them down. This place is just the absolute worst because they will take a $50,000 deposit and a year later you are still living in a camper. The houses don't meet code and this was just a good idea theoretically but in reality little Custom Homes sucks.", "pics": null, "resp": null, "gmap_id": "0x889bcb911ca32803:0x90635852b432bef"}
{"user_id": "107196772493505461871", "name": "Justin Massimo", "time": 1546955391121, "rating": 5.0, "text": "Unbelievably beautiful homes at a very affordable price, best part... Delivered to your door!", "pics": null, "resp": null, "gmap_id": "0x889bcb911ca32803:0x90635852b432bef"}
{"user_id": "116474096533176267822", "name": "Beth Kenny", "time": 1573696498003, "rating": 1.0, "text": "6 months since we put Downpayment and not a stick or brick on our property", "pics": null, "resp": null, "gmap_id": "0x889bcb911ca32803:0x90635852b432bef"}
{"user_id": "100842056070369372605", "name": "Jearl Robinson (The Great Ungabunga)", "time": 1549824414209, "rating": 4.0, "text": "Beautiful homes at a great price.", "pics": null, "resp": null, "gmap_id": "0x889bcb911ca32803:0x90635852b432bef"}
{"user_id": "104838104601440845287", "name": "Michelle Angle", "time": 1564970702300, "rating": 3.0, "text": "Charging way to much for those homes", "pics": null, "resp": null, "gmap_id": "0x889bcb911ca32803:0x90635852b432bef"}
