{"user_id": "109484273908267351707", "name": "Em Wa", "time": 1511880928167, "rating": 5.0, "text": "Our family and friends share a wonderful relationship with The Hillsborough School -- Dr. Bray, leadership, teachers and students. Although our two children do not attend Hillsborough because we live far away, you don't have to be at Hillsborough long to immediately feel the draw, peace, respect and enjoyable learning that's in the air! Thanks to Hillsborough, our children have enjoyed the opportunity to participate in FIRST LEGO League Robotics the last several years. The students and leadership at Hillsborough are LARGELY responsible for connecting our children to what has become a passion and joy for them. If you are considering Hillsborough, go spend some time with these wonderful people that help students and parents enjoy and love learning!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMntuTraLtwkC7XTjiIVWv826LzMAloV2M5SpjN=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889275c7afb9f0b:0x408383f0590c6e04"}
{"user_id": "112492103724302503239", "name": "LUKE TV 4 KIDS", "time": 1534614555743, "rating": 5.0, "text": "My preschooler had such an amazing experience at the Hillsboro school. From the first moment he walked in the door he was greeted by warm, gentle, friendly teachers. They guided him through the room and made him feel comfortable and at home. The environment of the school is one of calm and the atmosphere is peaceful. Just how a school should be! The Hillsboro school is also thoroughly equipped with a wide variety of learning tools that are creative and outside the box of normal learning methods.  The children are given independence to explore and learn on their own but also with gentle one on one guidance from the teacher when needed.  My child often talks about the Hillsboro school and wants to go back and each day when he was there he didn’t want to leave. The staff, vision, and educational methods are a cut above the rest.", "pics": null, "resp": null, "gmap_id": "0x8889275c7afb9f0b:0x408383f0590c6e04"}
{"user_id": "118253130957720172826", "name": "Jessica Estrada", "time": 1514075238295, "rating": 5.0, "text": "When I was looking for a school to renew my son's love of learning, the Hillsboro School was quickly the obvious choice! The creative learning and multi-faceted integration of all subjects is perfect for his learning style and has renewed his love of exploring our world. In fact, on days that they do not have school he misses it so much that he wishes they didn't have a break! The teachers and students are more like a family and the care and attention is nurturing and encouraging. It is a beautiful sight to see my son flourish!", "pics": null, "resp": null, "gmap_id": "0x8889275c7afb9f0b:0x408383f0590c6e04"}
{"user_id": "102155012338120805808", "name": "Sammie Robertson", "time": 1540833615424, "rating": 5.0, "text": "The Hillsboro School is so much more than a facility or curriculum.  To us, it's a family of supportive and understanding educators that truly care about our child and finding the best ways for him to enjoy learning and exploring the world.  In our first year they have already changed the way we look at education and community, in the most wonderful ways.", "pics": null, "resp": null, "gmap_id": "0x8889275c7afb9f0b:0x408383f0590c6e04"}
{"user_id": "113829359182991492263", "name": "Susan Schuman", "time": 1515432872124, "rating": 5.0, "text": "The Hillsboro School is an amazing place!  We're constantly impressed with the learning opportunities, student achievements, and the outstanding staff.   Coming from a public school environment we quickly saw a huge difference in my son's enthusiasm for learning and it hasn't slowed down at all.  I love the way the teachers work with the students to understand how each individual learns best and then gives them the tools and freedom to do so.  My son is thriving in ways I never expected!  Watching him rush out the door each morning to get to school is something I never thought I'd see.  It's truly a wonderful school environment where every single person feels like family.  We couldn't ask for more!", "pics": null, "resp": null, "gmap_id": "0x8889275c7afb9f0b:0x408383f0590c6e04"}
{"user_id": "114340607874229443875", "name": "Kurt Edwards", "time": 1515540876069, "rating": 5.0, "text": "The teachers at the Hillsboro School are truly exceptional with outstanding educational credentials.  The low student-to-teacher ratio means that my son's learning plan is custom-tailored to his individual needs.  He can progress in his learning at the speed that is best for him.  He is having truly creative learning opportunities including designing and building robots to participating in extended field trips at historic locations.", "pics": null, "resp": null, "gmap_id": "0x8889275c7afb9f0b:0x408383f0590c6e04"}
{"user_id": "103526703326787545512", "name": "Evan Koch", "time": 1516897701835, "rating": 5.0, "text": "We started out with our son in Hillsboro School and are happy to have both our daughter enrolled as well. The smaller class sizes allow the teachers to work with each of the children, delivering the material in a way that's based on the child. The interaction with other children of varying ages I believe has helped our children grow, and the feeling of community within the school helps us feel at home at Hillsboro.", "pics": null, "resp": null, "gmap_id": "0x8889275c7afb9f0b:0x408383f0590c6e04"}
{"user_id": "112310323455974015191", "name": "Amy Stump", "time": 1534464338216, "rating": 5.0, "text": "Our journey with The Hillsboro School was a gift.  I recognized the enthusiasm of the director but had no way of knowing the magnitude of our decision to enroll our kids.  I thought it was a good fit just because they would allow the kids to work at advanced levels in those subjects where they excelled and would make sure they didn’t fall behind in those subjects where they did not excel.  We got so much more.  Our kids were sponges for the hands-on methods.  They were encouraged to ask “why” and pursue where it went.  They were given the confidence to think for themselves.   The teachers worked with the kids, understood their learning styles and gave them personalized tools (organizational as well as processing) to help them focus on what is important. Because of those efforts that you just can’t find anywhere else, my kids can answer a question clearly, explain their opinions and defend their positions easily.  I am grateful to The Hillsboro School!", "pics": null, "resp": null, "gmap_id": "0x8889275c7afb9f0b:0x408383f0590c6e04"}
{"user_id": "106483365045713096569", "name": "Tammy Lax", "time": 1515429527621, "rating": 5.0, "text": "My niece began attending Hillsboro School this year as a Freshman.  Although apprehensive at first, she has embraced the routine and loves that her individuality is championed instead of discouraged. Living out of state, I appreciate that they create opportunities to include extended family.  The school hosted a Thanksigiving lunch for families, and the Christmas craft fair was so much fun!", "pics": null, "resp": null, "gmap_id": "0x8889275c7afb9f0b:0x408383f0590c6e04"}
{"user_id": "104542503560720057039", "name": "Jeff Hansen", "time": 1515428175830, "rating": 5.0, "text": "It has truly been a pleasure to watch my child bloom during their time at Hillsboro.  Coming from public school, there was a 180 degree change to a kid who actually enjoys school and appreciates learning.", "pics": null, "resp": null, "gmap_id": "0x8889275c7afb9f0b:0x408383f0590c6e04"}
{"user_id": "113611238282488352674", "name": "Jennifer Turner", "time": 1627397363143, "rating": 5.0, "text": "My daughter attended public school and was struggling in reading and the school kept pushing her along as she fell further behind. We were losing hope and came to tour the school and fell in love with the beautiful campus and classroom environment. At the time I knew little about the Montessori method of teaching but knew my daughter needed a different approach. My daughter has excelled in this environment and is now reading above grade level. I love this school and it was well worth the sacrifice to drive 30 minutes to get her to this school. The teachers are amazing and care about the success of each child.", "pics": null, "resp": null, "gmap_id": "0x88893d2553bb505f:0x7a041fc9ebf50993"}
{"user_id": "100028200474431300602", "name": "Carolyn G.", "time": 1624989854580, "rating": 5.0, "text": "Bruno Montessori is truly an incredible Montessori school.  The teachers and staff are both friendly and professional. The open campus is beautifully maintained and has multiple outdoor classrooms.  There is a wide range of enrichment activities offered. My two children received a top notch education that set them up for success. I highly recommend Bruno Montessori.", "pics": null, "resp": null, "gmap_id": "0x88893d2553bb505f:0x7a041fc9ebf50993"}
{"user_id": "114294522959417669081", "name": "K Smith", "time": 1569594761087, "rating": 5.0, "text": "We were incredibly fortunate that our son was able to attend JBMA from his enrollment in the toddler program at age two until his graduation from eighth grade. The faculty and staff are talented, compassionate, generous, patient, and endlessly supportive. The educational programs and class trips are first-rate. The facilities and grounds are wonderful. JBMA was—and always will be—an instrumental and profoundly positive component of our son's life, and we are forever grateful.", "pics": null, "resp": null, "gmap_id": "0x88893d2553bb505f:0x7a041fc9ebf50993"}
{"user_id": "109589493728875844803", "name": "easy e", "time": 1610780720348, "rating": 1.0, "text": "bad school its not safe for students", "pics": null, "resp": null, "gmap_id": "0x88893d2553bb505f:0x7a041fc9ebf50993"}
{"user_id": "109701567578557362161", "name": "Miriam Anderson", "time": 1460235704404, "rating": 5.0, "text": "I went to school here and the experience was wonderful! The teachers are patient, kind, and very helpful. Montessori teaches not just academics but important life lessons. I would definitely recommend this school to anyone! :)", "pics": null, "resp": null, "gmap_id": "0x88893d2553bb505f:0x7a041fc9ebf50993"}
{"user_id": "114439235087587669411", "name": "Ragav Baskar", "time": 1527221101832, "rating": 5.0, "text": "I can't even describe how amazing this school is. If you here you are really lucky. Best school I have ever been too.", "pics": null, "resp": null, "gmap_id": "0x88893d2553bb505f:0x7a041fc9ebf50993"}
{"user_id": "111418896220350394606", "name": "Dana Maxfield", "time": 1394735435102, "rating": 5.0, "text": "Both of my girls went here and the vision of Joseph Bruno Montessori Academy is to provide children and families with an education according to the Montessori philosophy and curriculum. JBMAs focus is not only to provide cognitive education for its students, but to also model a commitment to creating peace and care for the environment for years to come. In theory and practice, they explore how the traditional Montessori curriculum can be combined with current best practices in education as well as technological advances in order to develop a successful group of 21st century learners. JBMA treats each child as an individual, building on their strengths and abilities to become life-long global learners. I could not have been happier with the education and social skills my girls developed at JBMA.  They are now on their way to exploring what else the world has to offer them.", "pics": null, "resp": null, "gmap_id": "0x88893d2553bb505f:0x7a041fc9ebf50993"}
{"user_id": "111214276239609077278", "name": "RagavBaskar", "time": 1488242987706, "rating": 5.0, "text": "Best school ever", "pics": null, "resp": null, "gmap_id": "0x88893d2553bb505f:0x7a041fc9ebf50993"}
{"user_id": "100749967659467766357", "name": "F. Slate", "time": 1537926925579, "rating": 5.0, "text": "I absolutely love the Montessori Learning Center. Ms. Charlotte and Mrs. Amanda are the best teachers you could find for your children. They are so sweet and kind to children and their parents. My son has attended two years now and has learned so much! My son started counted his toys in Spanish last night. They offer one on one learning. They have animals and learn how to take care of a garden in the back. They teach the children the most important facts and truly care about the children. I would recommend The Montessori Learning Center to anyone with daycare age children up to 1st grade. They are wanting to expand to 3rd grade students and I really hope they do.", "pics": null, "resp": null, "gmap_id": "0x8862134da073a3bf:0x87d7f84ae67a656f"}
{"user_id": "109589772433324157073", "name": "Rick Fisher", "time": 1473179120009, "rating": 5.0, "text": "Best place for your child besides home! The staff is wonderful. The method is great! Don't send your children to the horrible government run schools. The individual attention helps every level of child and you can't and won't get that at public/government school.", "pics": null, "resp": null, "gmap_id": "0x8862134da073a3bf:0x87d7f84ae67a656f"}
{"user_id": "102496161002306910888", "name": "M3Studios", "time": 1415833537481, "rating": 1.0, "text": "My 3 year old son went for three months. They kicked him out because they said he was too hard to deal with. They said he may have autism but had no evidence other than \"he was hard to deal with\".  He is now in Premier Preschool in Research Park and is much happier. They help him and have professionals come in and evaluate the children. He is a normal 3 year old boy with no problems. The Montessori Learning Center just did not know how to handle him. They are looking for easy kids to watch so they can sit around and collect checks. Would not recommend them after my experience.\n\nI assume the 5 star ratings you are giving yourself are in response to my review. I am sorry if you do not know how to handle children.\n\nIf you are reading this and looking at schools please don't take convenience into account when choosing a school. I drive across town every day to take my son to Premier Preschool and it is 1000 times better for him.", "pics": null, "resp": null, "gmap_id": "0x8862134da073a3bf:0x87d7f84ae67a656f"}
{"user_id": "111483122094619910905", "name": "Lauren Dauro", "time": 1501862465620, "rating": 5.0, "text": "Fantastic teaching staff with a wonderful curriculum.  The Montessori method is truly amazing - it's impressive to see children teach and learn from each other, just like a family.  They serve healthy snacks and use non-toxic cleaning choices.  I am so glad I chose this preschool!", "pics": null, "resp": null, "gmap_id": "0x8862134da073a3bf:0x87d7f84ae67a656f"}
{"user_id": "105475328010119681209", "name": "PT Dudley", "time": 1406490072261, "rating": 5.0, "text": "My child just graduated from Montessori Learning Center and we just LOVED It!! I can't say enough about the outstanding and professional staff at the school.  My child now is very well prepared for his new school and I would highly recommend the school to parents who want a small private school where your child gets a lot one on one attention, love and care.", "pics": null, "resp": null, "gmap_id": "0x8862134da073a3bf:0x87d7f84ae67a656f"}
{"user_id": "112555036034384766136", "name": "Jacqueline Baldone", "time": 1406564343722, "rating": 5.0, "text": "Both of my children attended Montessori Learning Center.  The teachers were wonderful and kind.  They were well prepared to enter kindergarten.  Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8862134da073a3bf:0x87d7f84ae67a656f"}
