{"user_id": "103634446793194902846", "name": "JENNY GOSS DE SOUZA", "time": 1610817673178, "rating": 5.0, "text": "Kenan is trustworthy, reasonable and prompt. Here is what we like:\n1. He has a website - good for us people from out of town during the Pandemic\n2. He does what he says and makes helpful suggestions\n3. He cares\n4. One grave needed the death etched - it was perfect AND he applied a treatment that would self-clean within 5 months\n5. Another grave needed a tombstone uprighted. Unbeknownst to us, someone had done the job but badly. Kenan re-did it by shoring up the foundation and worked on the adjoining one beside it.\n6. He takes pictures and texts his work back to his clients.\nWe have worked with him twice and will do so for a third time (soon). You will not regret it.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP8dU02QFgU0TqsQ7p5H0nVPyGmE1MrObdJoHBO=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNDqRspnKuUmOaxWLa-47LOJt5X1Wyqbo5ZI9ZT=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889e67df8540ae5:0xe0f129a057ef25f"}
{"user_id": "112018369019282045616", "name": "Jessica Mckinney", "time": 1611216739936, "rating": 5.0, "text": "Kenan was so helpful and kind! My dad's stone is perfect and my family couldn't be happier. The price was extremely reasonable & everything was done quickly. Could not recommend more!!", "pics": null, "resp": null, "gmap_id": "0x8889e67df8540ae5:0xe0f129a057ef25f"}
{"user_id": "107875303789374973184", "name": "Rachel Hill", "time": 1594398645766, "rating": 5.0, "text": "Kenan was very responsive and good about keeping me updated on the progress of my mother's stone. He's very personable and tries to ensure you're happy with the final product. The stone looks great and my family is so happy with it. I would definitely recommend his services!!", "pics": null, "resp": null, "gmap_id": "0x8889e67df8540ae5:0xe0f129a057ef25f"}
{"user_id": "110379543420952438884", "name": "Criag Wade", "time": 1593337855336, "rating": 5.0, "text": "He did a great job and I'm very satisfied with the way he work with me and the work he did on my wife's headstone very professional and hometown kind.", "pics": null, "resp": null, "gmap_id": "0x8889e67df8540ae5:0xe0f129a057ef25f"}
{"user_id": "112167386706798747814", "name": "Laura Bond", "time": 1589755932744, "rating": 5.0, "text": "The customer service & craftsmanship that I received was outstanding. I live out of state and Kenan was able to work with me via email . He took my ideas and drafted a design for my momma’s headstone . He kept me updated and arranged it to be set while we were present .The headstone is very beautiful !❤️", "pics": null, "resp": null, "gmap_id": "0x8889e67df8540ae5:0xe0f129a057ef25f"}
{"user_id": "107428901485596351007", "name": "shelly oden", "time": 1594421261773, "rating": 5.0, "text": "Stone looks great.  Kenan went above and beyond.  Very professional.", "pics": null, "resp": null, "gmap_id": "0x8889e67df8540ae5:0xe0f129a057ef25f"}
{"user_id": "117741337179655959831", "name": "Nikos&Danielle Deves", "time": 1554037780162, "rating": 5.0, "text": "They just finished my Grandfathers bench and we couldn’t be more pleased with the turn out. They are very friendly people and always kept us up to date with how the process was going. They also have good prices. Couldn’t have picked a better business.", "pics": null, "resp": null, "gmap_id": "0x8889e67df8540ae5:0xe0f129a057ef25f"}
{"user_id": "107330326223718661320", "name": "Nancy Weycker", "time": 1562880938454, "rating": 5.0, "text": "My sisters & I are delighted we chose Arab Stone Works to make our family headstones.  Kenan was so friendly & personable, & gave us excellent advice.  He helped with every aspect of the stones from creation, design, & sandblasting to delivery.  We are very pleased with the results, & highly recommend Arab Stone Works to anyone who wants excellent, professional results.", "pics": null, "resp": null, "gmap_id": "0x8889e67df8540ae5:0xe0f129a057ef25f"}
{"user_id": "115546001978247127202", "name": "George Mascorro", "time": 1569464683215, "rating": 5.0, "text": "Thank you Keene for my Dads Headstone. You done a great job in a timely manner I'm am beyond pleased and greatful.", "pics": null, "resp": null, "gmap_id": "0x8889e67df8540ae5:0xe0f129a057ef25f"}
{"user_id": "118086773289789410898", "name": "adam glover", "time": 1496248881973, "rating": 5.0, "text": "great company!!  service is outstanding. The headstones i have seen and had done are beautiful . Staff is very professional and understanding of the bereavement their customers are going through.", "pics": null, "resp": null, "gmap_id": "0x8889e67df8540ae5:0xe0f129a057ef25f"}
{"user_id": "111394595871942893459", "name": "Stephen Williams", "time": 1533751865491, "rating": 5.0, "text": "Sometimes in my line of work I have to deal with folks going through tough situations. The only thing that can lighten the load is working with true professionals. I'm glad Kenan and his team at Arab Stone Works take such pride in their work and care so much about serving their clients.", "pics": null, "resp": null, "gmap_id": "0x8889e67df8540ae5:0xe0f129a057ef25f"}
{"user_id": "108749246863730699907", "name": "Gail Gibbs", "time": 1542853891030, "rating": 5.0, "text": "Very professional and easy to work with even under difficult times for our family.  The design and delivery of my Moms headstone was perfect and exactly what we wanted!", "pics": null, "resp": null, "gmap_id": "0x8889e67df8540ae5:0xe0f129a057ef25f"}
{"user_id": "112793230705662992881", "name": "Emily Roden", "time": 1602938133681, "rating": 5.0, "text": "Amazing people. They have put so much love and care into my sister's stone. They went above and beyond to make sure it was exactly what we wanted. They are so creative and talented!!! The prices are just unbeatable for such a personal, custom, beautiful piece and the customer service... I wouldn't consider using anyone else in the state of Alabama!!", "pics": null, "resp": null, "gmap_id": "0x888543a154741e71:0x5dd6b97f73c21c3c"}
{"user_id": "110080515369423088038", "name": "Wendy Roden", "time": 1602941860315, "rating": 5.0, "text": "Thank you so much for the loving customer services you provided for my daughters headstone. The pricing was great too. It is so beautiful and personally captures her personality perfectly!!! You will get my business from now on out. Thank you again!!!", "pics": null, "resp": null, "gmap_id": "0x888543a154741e71:0x5dd6b97f73c21c3c"}
{"user_id": "109924705458485984247", "name": "jessica skinner", "time": 1602978920891, "rating": 5.0, "text": "Losing a loved one is hard for any and everybody.  Fortunately I had the opportunity to have the folks at Williams Granite Memorials to help out. I highly recommend them, and am very appreciative for their hard word . They are some of the most caring ,compassionate people I have ever met. They made this rough time in my life a little easier with their kind hearts and hard work .", "pics": null, "resp": null, "gmap_id": "0x888543a154741e71:0x5dd6b97f73c21c3c"}
{"user_id": "107680330503449005784", "name": "Darlene Powell", "time": 1582476588718, "rating": 5.0, "text": "We all know the how hardship it is when losing a loved one. Both mentally and financially.  Williams Granite Memorials helped so much.  Their a loving precious couple.  They worked with us.  We had several specifics pictures we wanted on pur stone.  They literally had to draw in some of it.  The craftsmanship was amazing.  Such a beautiful job.  our family will cherish forever.  Teresa was so sweet and caring it made our decisions so much easier.  If you are looking to save this is the go to place.  Their prices are bye far the best in town.  It is worth the trip.  Williams Granite Memorial.  Thank you for all you have done for our family.\nDarlene Powell", "pics": null, "resp": null, "gmap_id": "0x888543a154741e71:0x5dd6b97f73c21c3c"}
{"user_id": "113730461620098882091", "name": "Helen Pugh", "time": 1602014433027, "rating": 1.0, "text": "This is a terrible place to do business with. I have had an very painful experience. Janet I believe is what she said her name was. (She said she was the owner)\nShe is very rude, impossible to talk to. She had my deposit every since March 2020. We went thru the pandemic. She didn’t call to make other arrangements or ask if I could mail the rest of the money or anything. After business started to open back up, I went back to take care of the rest of my bill. I paid the money in June. She said it will be after Father’s Day before she could get the head stone over here in Monroeville. I have been very understanding and waited. I would ride by the cemetery daily to see if the head stone was there. With so many distractions going on now a days I have been in touch. Today October 6, 2020, I called to inquire about the head stone. I was talking normal and she was very hostile. I told her I wanted a refund because she had more than enough time to have the head stone here. She the head stone was made but didn’t have a reason why it hasn’t been delivered. She said it was just sitting there and didn’t know why it wasn’t delivered, she was rude, insensitive, unsystematic, and to top it off....\nshe hung the phone up on me. I know money is the root to all evil.... but she was not woman enough to have a decent conversation with me. Who wants to do business with someone like that. She will never get anymore of my business, even in death. I will make sure my kid or anyone else in my family go there. DON’T DO BUSINESS WITH WILLIAMS GRANITE MEMORIAL EVER. I am not the only one\nwho has had problems. I wish I had read the reviews before I went over. Please do your homework when it comes down to your love ones. Tell people to take their business elsewhere. I will from now on. Don’t go there.", "pics": null, "resp": null, "gmap_id": "0x888543a154741e71:0x5dd6b97f73c21c3c"}
{"user_id": "107714808269038661637", "name": "Ann Carter", "time": 1582470799827, "rating": 5.0, "text": "I want to thank you so much for doing my sons stone I wanted it extra special in dedication to him and you achieved that. Tripps stone came out just like we planned from his homemade tattoo on his back to his hand writing and signature,the Auburn team emblem that he loved so, one of his favorite songs and best of all his picture is breath taking! You went the extra mile to make this family extra happy to even get it set on Christmas eve what company does that (A CARING ONE) It was a bittersweet day for our family but a most memorable one. Thank you again for going above and beyond for my family and my son!", "pics": null, "resp": null, "gmap_id": "0x888543a154741e71:0x5dd6b97f73c21c3c"}
{"user_id": "116519960543084325888", "name": "buffy luker", "time": 1582471310824, "rating": 5.0, "text": "WE love our Mother's headstone! It is perfect! The staff was terrific..had us a drawing within an hour of getting a quote and good price..they had it put down within 2 weeks of ordering !", "pics": null, "resp": null, "gmap_id": "0x888543a154741e71:0x5dd6b97f73c21c3c"}
{"user_id": "113628737915421658737", "name": "Pat Smith", "time": 1594330619036, "rating": 1.0, "text": "Had a terrible experience with Granite Memorial. After lie after lie or right at 3 months, I decided to just ask for refund. The the lady had the nerves, to text my phone. Saying that they're refunding my money out if the kindness of they're heart's. Granny always told me if I can't say anything good don't say anything at all. SMH", "pics": null, "resp": null, "gmap_id": "0x888543a154741e71:0x5dd6b97f73c21c3c"}
{"user_id": "116519960543084325888", "name": "buffy luker", "time": 1582471310824, "rating": 5.0, "text": "WE love our Mother's headstone! It is perfect! The staff was terrific..had us a drawing within an hour of getting a quote and good price..they had it put down within 2 weeks of ordering !", "pics": null, "resp": null, "gmap_id": "0x888543a154741e71:0x5dd6b97f73c21c3c"}
{"user_id": "107646400620998952865", "name": "Eva Champion", "time": 1582502702433, "rating": 5.0, "text": "I've known one of the owners , most of my childhood , we went to school together,  for me it was like having family there to help me choose and design my family grave markers.  I had terrible lost back to back. The cost  was  reasonable and delivery is good depending on the weather.", "pics": null, "resp": null, "gmap_id": "0x888543a154741e71:0x5dd6b97f73c21c3c"}
{"user_id": "102283530841984162771", "name": "Jessie Roden", "time": 1602941975201, "rating": 5.0, "text": "Great people  great service great prices", "pics": null, "resp": null, "gmap_id": "0x888543a154741e71:0x5dd6b97f73c21c3c"}
{"user_id": "102973245705115789532", "name": "Timothy Walker", "time": 1578687235326, "rating": 1.0, "text": "This place will steal your money. DO NOT GO HERE!!. I paid them $670 for a headstone and never heard from them again. Had to do a police report and spoke to a detective that said I am about the 15th person to file a complaint. He said he will talk to the DA to see about a criminal investigation.", "pics": null, "resp": null, "gmap_id": "0x888543a154741e71:0x5dd6b97f73c21c3c"}
{"user_id": "114017244201478289144", "name": "Debbie Sutton", "time": 1561154980088, "rating": 1.0, "text": "Extremely poor service. No one calls you back. I have been trying to get a marker for my son for over a month!! I live in Texas.  Finally today I get someone on the phone and told it has been ready for 3 days. I ask to have a picture sent to me and NOTHING sent.  Person I have had to deal with is Teresa.", "pics": null, "resp": null, "gmap_id": "0x888543a154741e71:0x5dd6b97f73c21c3c"}
{"user_id": "104291484095518579206", "name": "Melinda Gibson", "time": 1582478034822, "rating": 5.0, "text": "They are extremely wonderful. Will go back to them the next time I need something done. Thanks.", "pics": null, "resp": null, "gmap_id": "0x888543a154741e71:0x5dd6b97f73c21c3c"}
{"user_id": "109040415539927814572", "name": "Sarah Melissa Jones", "time": 1602958636117, "rating": 5.0, "text": "GREAT PEOPLE AND GREAT PRICES", "pics": null, "resp": null, "gmap_id": "0x888543a154741e71:0x5dd6b97f73c21c3c"}
{"user_id": "108567957087840596231", "name": "Virginia Dickey", "time": 1628527771724, "rating": 1.0, "text": "This place is closed", "pics": null, "resp": null, "gmap_id": "0x8888614ae3621fed:0x3ef245b18fc5bd85"}
{"user_id": "113731259646341901044", "name": "Keith Hodge", "time": 1626632110323, "rating": 4.0, "text": "Very knowledgeable.  Great customer service. I would recommend his services.", "pics": null, "resp": {"time": 1626658350749, "text": "Thank you for the review!"}, "gmap_id": "0x888a3c1ec2adf175:0x8c1b654faaac21fc"}
{"user_id": "105310278506434963297", "name": "Sheryl C Miller", "time": 1579355221129, "rating": 5.0, "text": "My experience with this company has been great. Jeff was very nice and patient with me in making a decision  on a final marker.  This is the final thing I will do for my Mom and he made the process easier. Thank You", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM8OkCX82CC85PJyJBlPIG8FHx92REgyt8U0hw1=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a3c1ec2adf175:0x8c1b654faaac21fc"}
{"user_id": "114014811146326497041", "name": "Marcia Headrick", "time": 1513895390533, "rating": 5.0, "text": "Very caring and professional. Mr. Mundi took the time to explain all details and pricing for the head stone that I chose.\nI recommend this company.", "pics": null, "resp": null, "gmap_id": "0x888a3c1ec2adf175:0x8c1b654faaac21fc"}
{"user_id": "108151177464362225410", "name": "TG R.", "time": 1535625969128, "rating": 5.0, "text": "I had to come back and edit my rating.\nThey delivered my mother's head stone and it was amazing and beautiful.\nThe family just broke down crying at how well Clark memorial honored my mom.", "pics": null, "resp": null, "gmap_id": "0x888a3c1ec2adf175:0x8c1b654faaac21fc"}
{"user_id": "107572228441194032088", "name": "Andy Jones", "time": 1475505774352, "rating": 5.0, "text": "Being from New Jersey I had no idea how to find someone to make a bronze marker on a granite base for my mother who had passed away in Alabama.  The cemetery was a small private place next to a remote church outside of Gadsden.  I had a lot of fears doing this since I was so far away.  Would my check be cashed and no marker made?  Would the company be able to find the cemetery?  Would they follow through and place the marker?   I found Clark Memorials on the web and decided to take a chance.  I got in touch with Sam Mundi via email and he immediately put my fears to rest.  He and everyone at Clark Memorials were wonderful and the marker was produced and placed in exactly the time frame promised.  In fact, Sam went back out to the cemetery to take a picture to show me the final product.  Since then my family got together in Turkeytown from all over the US to place my mother's ashes and to see the masterpiece from Clark Memorials.  We could not be happier and thankful to Sam and Clark Memorials.  Sam went out of his way to make sure that I was comfortable with this transaction every step of the way and the final product was outstanding.  Thank you Sam!  Thank you Clark Memorials!.", "pics": null, "resp": null, "gmap_id": "0x888a3c1ec2adf175:0x8c1b654faaac21fc"}
{"user_id": "112274537084842769989", "name": "Celena Garrett Dunn", "time": 1495546662055, "rating": 5.0, "text": "Outgoing sales person. Very considerate to our families needs.", "pics": null, "resp": null, "gmap_id": "0x888a3c1ec2adf175:0x8c1b654faaac21fc"}
{"user_id": "113671861781817355339", "name": "Virginia Ryals", "time": 1526407962332, "rating": 4.0, "text": "Inviting atmosphere and caring staff.", "pics": null, "resp": null, "gmap_id": "0x888d47840491c101:0x815a146143d2ba45"}
{"user_id": "113402956386640079045", "name": "Linda Kyzer", "time": 1619645449254, "rating": 1.0, "text": "Will not return phone calls nor answer calls. Placed a order for a monument in December 2020 contract stated monument would be delivered within 60 to 90 days. Family is now into 120 days of placing the order and was paid in full and still no monument placed on the grave as of today April 28,2021. Get nothing but the run around tell you to call back and never answer calls and can’t leave a message because voicemail box is full", "pics": null, "resp": null, "gmap_id": "0x8888789018e00699:0xe28e60a9aa18fac5"}
{"user_id": "112239557951957352667", "name": "Buddy Wilkinson", "time": 1620534282924, "rating": 1.0, "text": "Visited Patterson monuments in Jasper. Young lady in office acted like we were a bother.  Drove to Carbon Hill to purchase headstones.  Will never walk through your doors again.", "pics": null, "resp": null, "gmap_id": "0x8888789018e00699:0xe28e60a9aa18fac5"}
{"user_id": "107154068173344608852", "name": "Jacob Blackstock Sr.", "time": 1573575373982, "rating": 5.0, "text": "We ordered 2 vases to go on my mothers tombstone. They were accurately placed but they took nearly 6 weeks to complete. I would consider using them again in the future.", "pics": null, "resp": null, "gmap_id": "0x8888789018e00699:0xe28e60a9aa18fac5"}
{"user_id": "110965406003295881805", "name": "Jewell Aldridge", "time": 1515709831051, "rating": 5.0, "text": "THERE the nicest people I've ever met, and very price  Competitive ,I've enjoyed doing business with them,I would highly recommend them ,Carbon Hill ALABAMA,", "pics": null, "resp": null, "gmap_id": "0x8888789018e00699:0xe28e60a9aa18fac5"}
{"user_id": "115868941823819274445", "name": "Jeremy DeLay", "time": 1554925499740, "rating": 5.0, "text": "Patterson Monument is very professional and does quality wok for you and your family and goes above and beyond.", "pics": null, "resp": null, "gmap_id": "0x8888789018e00699:0xe28e60a9aa18fac5"}
{"user_id": "106113262152135676193", "name": "Martha Tucker", "time": 1549969609015, "rating": 5.0, "text": "Family owned and operated", "pics": null, "resp": null, "gmap_id": "0x8888789018e00699:0xe28e60a9aa18fac5"}
{"user_id": "113971882593396896113", "name": "Barbara Haynes", "time": 1545272206741, "rating": 5.0, "text": "Larry & Suzanne are great!!!", "pics": null, "resp": null, "gmap_id": "0x8888789018e00699:0xe28e60a9aa18fac5"}
{"user_id": "103431753476909399781", "name": "Jessica Nix", "time": 1517054977869, "rating": 5.0, "text": "very friendly establishment", "pics": null, "resp": null, "gmap_id": "0x8888789018e00699:0xe28e60a9aa18fac5"}
{"user_id": "111460678800364289295", "name": "lOUIS STRONG", "time": 1618520270986, "rating": 5.0, "text": "Sharing my experience with Clark Memorials.  Our salesman was terrific. He was older.  He told me from the start that it was going to take some time because of Covid. It took about 13 weeks to get my mother's head stone and was worth the wait!  My family and I are very pleased.  Thank You Clark Memorials!!", "pics": null, "resp": {"time": 1623963739839, "text": "Thank you for the 5 star review!"}, "gmap_id": "0x88891c1e62903891:0xe0161931457b661a"}
{"user_id": "114935766718686631764", "name": "Marie", "time": 1617880465577, "rating": 1.0, "text": "I wouldn't recommend this company at all. They don't care about the customers and the grief we are going through. I called four times before I finally talked to someone about adding the death date for my mom and they said I would be notified when it was completed...never notified. If I hadn't went to the cemetery I wouldn't have know it was completed. That's horrible for a business to lie and rather heartless knowing a loved one is waiting on an update about the completion of something that's important for a lost loved one and you've paid for it too. Unacceptable.", "pics": null, "resp": {"time": 1624397668612, "text": "Hello, I hated to read the review you wrote about Clark Memorials. We strive very hard to treat each customer as if they were family. We did not notify you because during the time the engraving was done, our offices were closed because of Covid 19.\nOur offices closed 2 days after you placed your order.  We were closed for about 45 days.\nOur sandblaster took it upon himself to add the date to your mother's headstone since that was something he could in the cemetery during the time our offices were closed even though he was not required to do so until we reopened. Upon re-opening, we learned that 3 date of passing had been added to monuments.  Again, I am very sorry you feel the way you do."}, "gmap_id": "0x88891c1e62903891:0xe0161931457b661a"}
{"user_id": "111710165441210553981", "name": "TW Hutchens", "time": 1626627107706, "rating": 5.0, "text": "My experience with Clark Memorials was excellent!!!  From start to finish!!!", "pics": null, "resp": null, "gmap_id": "0x88891c1e62903891:0xe0161931457b661a"}
{"user_id": "107025029883174108392", "name": "L Watters", "time": 1584979038076, "rating": 1.0, "text": "Why can’t I give no stars!\nNever again will I use this company. I’d rather learn to make my own marker than use them. They have the type of bad customer service that has you ordering from Walmart and Amazon instead of supporting local businesses.", "pics": null, "resp": null, "gmap_id": "0x88891c1e62903891:0xe0161931457b661a"}
{"user_id": "106670616160396470021", "name": "Lucretia Sumerel", "time": 1579044211351, "rating": 5.0, "text": "Friendly owner really helpful. Not pushy at all.", "pics": null, "resp": null, "gmap_id": "0x88891c1e62903891:0xe0161931457b661a"}
{"user_id": "115127119445056370346", "name": "Melinda McWaters", "time": 1564549000397, "rating": 5.0, "text": "Done a Beautiful job on my Parents head stone just Beautiful it’s at least 10 Stars ⭐️!!!\nThanks so much Mr. Chase.", "pics": null, "resp": null, "gmap_id": "0x88891c1e62903891:0xe0161931457b661a"}
{"user_id": "108821565586138781866", "name": "Meghan", "time": 1548975927416, "rating": 5.0, "text": "Family owned and great people. I would definitely recommend this place to anyone.", "pics": null, "resp": null, "gmap_id": "0x88891c1e62903891:0xe0161931457b661a"}
{"user_id": "118282263418871422636", "name": "LaKisha knight", "time": 1557782379481, "rating": 1.0, "text": "Words cannot express how disappointed I am. I was reassured several times over several months that my mother’s headstone would be delivered and placed before Mother’s Day. Even up to 3 days before, they lied and told me they were placing the headstone down. Needless to say, it didn’t happen. I was saddened that I wouldn’t get the closure of giving my mother her “last” gift for Mother’s Day. And all Clark Memorials said was “we’re sorry”. Unprofessional and unacceptable!!", "pics": null, "resp": null, "gmap_id": "0x88891c1e62903891:0xe0161931457b661a"}
{"user_id": "108124870159015461832", "name": "Barbara Stephens", "time": 1566317621251, "rating": 5.0, "text": "Courteous, responsible,  compassionate, good communication, excellent work.", "pics": null, "resp": null, "gmap_id": "0x88891c1e62903891:0xe0161931457b661a"}
{"user_id": "106586165843165924095", "name": "Gina Huie", "time": 1489943554272, "rating": 4.0, "text": "Well established business here in Birmingham. Pleasant employees and very knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x88891c1e62903891:0xe0161931457b661a"}
{"user_id": "107682549108732019984", "name": ". Harris", "time": 1523063782008, "rating": 5.0, "text": "The place to go. They will take care of you and handle the situation. That's why they have been in business for over 60 yrs...", "pics": null, "resp": null, "gmap_id": "0x88891c1e62903891:0xe0161931457b661a"}
{"user_id": "108718653358636931679", "name": "Angela Regulus", "time": 1533594363993, "rating": 2.0, "text": "Don't be in a hurry for service. Order a year in advance", "pics": null, "resp": null, "gmap_id": "0x88891c1e62903891:0xe0161931457b661a"}
{"user_id": "106183207506617719826", "name": "Bruce McClendon", "time": 1547154057496, "rating": 5.0, "text": "See Mike for help. A great guy.", "pics": null, "resp": null, "gmap_id": "0x888c0b47d22c462d:0xfbf5d1fcd74c2ba1"}
{"user_id": "112294481999789998885", "name": "Maria Mckee", "time": 1538027501020, "rating": 5.0, "text": "Always have had great results", "pics": null, "resp": null, "gmap_id": "0x888c0b47d22c462d:0xfbf5d1fcd74c2ba1"}
{"user_id": "117177880639483036811", "name": "Jonathan Oshields", "time": 1614965633548, "rating": 1.0, "text": "Way more expensive than most funeral homes", "pics": null, "resp": null, "gmap_id": "0x8861eedc4cf17c45:0x8a971404f7046d20"}
{"user_id": "105260766089318237677", "name": "Baxter Bax", "time": 1595102935549, "rating": 5.0, "text": "Respectful, accommodating,professional, wide selection, no pressure, awesome staff, the only way to go, Thanks, Mr. Roy.", "pics": null, "resp": {"time": 1595122267081, "text": "Thanks!"}, "gmap_id": "0x8861eedc4cf17c45:0x8a971404f7046d20"}
{"user_id": "107605234498924994673", "name": "Rebecca Wood", "time": 1428621116849, "rating": 5.0, "text": "Our daddy's headstone just came in and was set. It turned out absolutely beautiful. Roy was very helpful, patient and knowledgeable. Daddy's death was sudden so we were all very emotional but Roy never rushed us, he listened and knew just what to say and when to say it. Thank y'all so much for making a difficult, emotional time more manageable.", "pics": null, "resp": {"time": 1510266703992, "text": "Thank you. It is always a privilege to work with a family like yours."}, "gmap_id": "0x8861eedc4cf17c45:0x8a971404f7046d20"}
{"user_id": "113224186196669172279", "name": "Gary Young", "time": 1594860196585, "rating": 5.0, "text": "Good friendly service", "pics": null, "resp": null, "gmap_id": "0x8861eedc4cf17c45:0x8a971404f7046d20"}
{"user_id": "110930672462483700835", "name": "Courtney Parker", "time": 1541558891714, "rating": 5.0, "text": "Picked my mom's stone her. They done everything custom and made it exactly how I wanted!!", "pics": null, "resp": null, "gmap_id": "0x8861eedc4cf17c45:0x8a971404f7046d20"}
{"user_id": "105196423951391794549", "name": "Randy Mauldin", "time": 1602009585254, "rating": 5.0, "text": "Nice people.", "pics": null, "resp": null, "gmap_id": "0x888c933a4c57e219:0x7af303316f8119d6"}
{"user_id": "100555881691113775415", "name": "Ann Wooten", "time": 1619900625990, "rating": 5.0, "text": "Rachel was so welcoming, helpful and patient during this terrible time in my life", "pics": null, "resp": null, "gmap_id": "0x888c289e38435e51:0x218b6c1de6c9b6df"}
{"user_id": "111337954619617625522", "name": "L B", "time": 1597761545196, "rating": 5.0, "text": "Based on a recommendation from the funeral home, I called Amanda's company to help me with my father's grave marker.  Our discussions were held remotely due to both me being out of state and our respective states' Covid concerns.  She navigated a challenging installation (through no fault of hers) with the cemetery in yet another location and sent me high quality photos upon completion.  I appreciate her kindness and patience in getting this marker placed in honor of my father.", "pics": null, "resp": null, "gmap_id": "0x888c289e38435e51:0x218b6c1de6c9b6df"}
{"user_id": "100776458338155544594", "name": "Dylan Rushing", "time": 1572655142189, "rating": 1.0, "text": "Horrible customer service and not worth wasting your time trying to deal with them. Wanted to see into getting a newer memorial piece for my baby brother’s site, and even after agreeing to pay more due to it being out of their usual range, we were told they “didn’t really want to do it just for a baby grave” and when we asked if they knew anyone else we were told to “google it” and find someone else. We had no negativity or hostility towards them at all and continually agreed to pay extra for mileage and for the piece we wanted.", "pics": null, "resp": null, "gmap_id": "0x888c289e38435e51:0x218b6c1de6c9b6df"}
{"user_id": "115193605180766709598", "name": "Beth Johnson", "time": 1559402220571, "rating": 5.0, "text": "Amanda and her entire staff, from Gerri in the office to the guys doing the set up of a gravesite are outstanding. I have dealt with this company on a professional level and personal level and the service is always outstanding. I highly recommend this company for all your needs when it comes to the service and products they sell.", "pics": null, "resp": null, "gmap_id": "0x888c289e38435e51:0x218b6c1de6c9b6df"}
{"user_id": "108958813949269889240", "name": "Shelia Stokes", "time": 1512416240191, "rating": 5.0, "text": "The Farmer Memorial Company did a wonderful job with my husband’s memorial.  The staff was patient, kind and helpful when we went to pick it out, helping us to get exactly what we wanted.  The final result exceeded all our expectations!  It is beautiful and a fitting tribute to my husband and my children’s father.", "pics": null, "resp": null, "gmap_id": "0x888c289e38435e51:0x218b6c1de6c9b6df"}
{"user_id": "108941620613121422893", "name": "Judy Mills", "time": 1521500416490, "rating": 5.0, "text": "We used Farmer's Memorial when Dax Whitaker was killed in an accident on January 12, 2018. We could not ask for better assistance and support during this difficult time. They gave us suggestions and ideas which at the time we would have never thought of. They went above and beyond what we expected. If you are reading this review and have a love one that has passed, I am sure  you would be pleased with their service.  They are good caring family people.  Thank You   Amanda", "pics": null, "resp": null, "gmap_id": "0x888c289e38435e51:0x218b6c1de6c9b6df"}
{"user_id": "115212573519401461964", "name": "Colts Fan", "time": 1531151736237, "rating": 5.0, "text": "Amanda Farmer is a great person and humanitarian.\nThe installation and design on my father's gravestone was beyond my expectations.\nThe gravestone was damaged and she offered to replace it  with a significant discount . Great person to do business with! Carey Bieber", "pics": null, "resp": null, "gmap_id": "0x888c289e38435e51:0x218b6c1de6c9b6df"}
{"user_id": "104212353549348358129", "name": "Sergio Cavazos", "time": 1547147202200, "rating": 5.0, "text": "As the General Manager of Greenwood Serenity Memorial Gardens it great working with Amanda and her team.", "pics": null, "resp": null, "gmap_id": "0x888c289e38435e51:0x218b6c1de6c9b6df"}
{"user_id": "101736419115095294740", "name": "Eubie Kennedy", "time": 1504615356215, "rating": 5.0, "text": "Amazing people, they are very kind and helpful. I know we changed our plans of what we wanted several times and they were happy every time to redo it. They also helped us by letting us make payments. Just wonderful people and I would recommend them to any and everyone who is in need of their type of services.", "pics": null, "resp": null, "gmap_id": "0x889066ff965c958b:0xdc7900e2b07b6903"}
{"user_id": "108141064806154335531", "name": "Vicky Defee", "time": 1519048185165, "rating": 5.0, "text": "Great service friendly people with great prices.", "pics": null, "resp": null, "gmap_id": "0x889066ff965c958b:0xdc7900e2b07b6903"}
{"user_id": "104718868834246805893", "name": "Lois Miller", "time": 1562873460149, "rating": 5.0, "text": "Very polite and helpful staff.", "pics": null, "resp": null, "gmap_id": "0x889066ff965c958b:0xdc7900e2b07b6903"}
{"user_id": "116714046934552696029", "name": "Chelsea Harris", "time": 1590614006577, "rating": 1.0, "text": "Incredibly disrespectful", "pics": null, "resp": null, "gmap_id": "0x889066ff965c958b:0xdc7900e2b07b6903"}
{"user_id": "110968230058712006861", "name": "Vicki Mangina", "time": 1625241423490, "rating": 4.0, "text": "I have been very disappointed with the service I have received. My Mother was buried in September, 2019 my parents graves have sunk in, washed and the ground surrounding the headstone has eroded. I have been there personally to report this and have called almost daily with no return call. I expressed my concern with the condition of the cemetery and was told it sold in December and hopefully changes will be made. I went by the graves today and no improvement’s have been made and in some areas the grass is almost knee high. This is not acceptable and I do hope this is taken care of before further action needs to be taken.EDIT:I have talked to the manager of the funeral home. He explained to me due to COVID and lack of workforce things have fallen behind. The headstone has been leveled and sand, new dirt, grass seed and new hay has been been put down on the grave sites. He was very nice and helpful even gave me his personal cell phone number if additional problems arise. He again assured me they are working hard to bring the cemetery back to the standards of the past. Very appreciative of his prompt actions and response. Thank you Eric.", "pics": null, "resp": null, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "102348285685644623431", "name": "Susan Jones", "time": 1624911430772, "rating": 5.0, "text": "Everyone there is very sweet and professional.\nRecently we had our third family funeral at Jefferson Memorial. The people are very nice. The grounds are beautifully kept and our experiences at Jefferson Memorial have been remarkable. I would highly recommend them to friends and family.", "pics": null, "resp": null, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "103182900160180634087", "name": "Frances Abrams", "time": 1620525149473, "rating": 5.0, "text": "Today my husband I went to the cemetery to place Mother's Day flowers on my mother's marker. After finding that the vase was missing, we also discovered that there was no vase on my father's marker either. After we called the office, they sent Eric to help us. He contacted maintenance and soon Cory and A. D. showed up. Not only did they bring vases, but shovels, dirt and other tools. They uncovered the markers entirely, then filled in with dirt to raise the markers higher, revealing the granite base to each marker that had been completely covered. These two men worked about 30 minutes and were so nice! Kudos to Cory and A.D.! The markers look great now!", "pics": null, "resp": null, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "115345798438685575110", "name": "Melanie George", "time": 1624035497030, "rating": 5.0, "text": "My family has always used Jefferson Memorial for funeral services, and now I know why. I was very intimidated by the whole process when my mom passed, but they kept it simple and thoroughly explained everything, so that my brother and I could make decisions without feeling pressured or \"sold\". We were able to honor my mother's wishes. Thank you to Bob and Richard and the rest of the staff for making our lives a little easier during this difficult time.", "pics": null, "resp": null, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "110631587490339394161", "name": "Deborah tolbert", "time": 1624144473143, "rating": 3.0, "text": "I have left numerous messages to move forward with ordering a marker, having a burial. I've yet to receive a return phone call to get this going.  The burial was paid in full several weeks ago.  Extremely unprofessional.  Update - The manager contacted me and is trying to make everything right.  We have had the burial.  Currently waiting on them to contact me when the marker comes in and is placed.   I will then go to see the marker, see if they placed the sod over the grave as promised and if they fixed the other markers that are covered with grass, dirt and overgrowth  and sunken.", "pics": null, "resp": null, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "114332828033383451842", "name": "Pat Hamilton McMurrey", "time": 1616889165648, "rating": 1.0, "text": "I have never been to a more poorly planned and executed funeral!!! There was NO direction provided by the funeral home staff. No one knew where to go or what to do. It was complete chaos. The family were scattered all over the chapel, not seated together as they should have been. The sound system was a complete joke as was the projection screen! You could barely see the pictures and they were very blurry.  There were/are NO PICTURES on the online obituary page after the family went to a tremendous effort to collect, scan and upload to the funeral home's planning webpage!  Those should have automatically transferred. Several attempts to upload pictures directly through the online site through the Share Memories section resulted in a locked up phone!!! The facilities are dated and drab, very depressing; in need of some serious renovations and updating. They had a last viewing for the family but before my husband could even get to the front they had already closed the coffin so he did not get a final chance to say goodbye to his Dad!!!!!! The whole thing felt rushed, as if they needed us to be gone so they could close the doors and go home. They did not even completely close the curtain. It was a disaster from start to finish. A very PRICEY disaster!! In summary; cheap quality, tacky and shoddy. I'm sure they are very busy, but then busy means more income, some of which needs to be applied to adding professional, trained staff and upgrading the facilities.  I do NOT recommend this funeral home!\n\nMr. Roper, there is no need for us to speak unless you plan to offer some kind of refund. I have clearly listed our complaints. If you work on those issues perhaps you can improve the services you offer.", "pics": null, "resp": {"time": 1616818150713, "text": "Ms. McMurrey, we take your concerns seriously. We want to extend our sincerest apologies for the experience you had with us. Our staff strives to meet the needs of each and every family we serve. We would like to discuss further details pertaining to your experience. Please contact Matt Roper at 205-322-0543."}, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "106723976517211918496", "name": "Melanie Brake", "time": 1616874620919, "rating": 5.0, "text": "Today while visiting the cemetery, we were greatly appreciative of AD, one of the cemetery maintenance staff! He was kind, courteous and extremely helpful! He gladly assisted us with our cemetery vases. He did a great job helping us and stopped what his was doing to assist my 86 year old Dad and myself as we were carrying several floral arrangements. Thank you again to AD", "pics": null, "resp": null, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "106894045718608700665", "name": "Tanya Tidwell", "time": 1598467778967, "rating": 5.0, "text": "This review is in relation to the Funeral Home Staff and specifically our funeral director, Ms. Sandra May.  When families are at their most vulnerable, it is at these time that a gentle, kind, and caring person becomes so important.  When my father passed away, Ms. May and the rest of the staff treated our family with respect and they worked very hard to help guide us through the most difficult time of my mother's life.  They did not try to push us to purchase things nor try to play on our grief, but instead they listened to what mattered the most to us and then helped us to achieve those goals.  Even though the funeral home was extremely busy and Ms. May probably had about 100 other things on her \"to-do\" list, she never rushed us or made us feel like we were bothering her.  The services provided by the funeral home and by the staff were above and beyond and I would highly recommend Jefferson Memorial Funeral Home and Gardens as your choice for funeral services.", "pics": null, "resp": null, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "117480396885096988585", "name": "Jerry Franklin", "time": 1591996431545, "rating": 1.0, "text": "My family’s experience with this funeral home has been mixed.  The services are top notch but the cemetery grounds are not.  My grandparents, my father, and now my mother have been buried there.\nMy father in 1981, my grand father a year or so later and my grandmother a few years after that.\nWe had a time trying to get grass planted and then the vases broke and when grass was finally put there my mother and my wife had to purchase and plant it.\nWell after all that time my mother was buried there in January and here we go again.  The marker has not been updated, the grave is still a chirt pit and it has been five months.\nMy sister and I have called to complain and they told us a work order has been filed.\nWell we will see how long it takes.", "pics": null, "resp": null, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "104674782787422072897", "name": "Craig Winn", "time": 1580683784793, "rating": 3.0, "text": "This review is strictly for the cemetery and grounds. It is a large relatively peaceful location even though it is next to the hustle and bustle of Hwy 11. It is generally clean but It could be maintained so much better. The roads need paving but at least the potholes filled in. Constantly asking for the grass to be cut and put out a little fire ant killer. The ant beds always seem to take over my mother-in-laws grave. I own a couple gravesites here. Anyone want a good deal on one?", "pics": null, "resp": {"time": 1580787432404, "text": "Hi Craig, thank you for the review.  We are always working to improve the conditions of the cemetery and are currently down a few employees on the cemetery maintenance team.  We are actively trying to hire for the spring so that we can get caught back up on as much maintenance and upkeep as we can.  Thank you!"}, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "106666703208207770992", "name": "Teresa Waine", "time": 1591547740920, "rating": 1.0, "text": "This review is only about the cemetery. My father as well as my father in law are buried there. I have put in work orders several times about my FIL’s grave. They do a half way fix spending as small amount as possible to appease me. The graves are washing and rutted with no grass, only weeds and headstones break because the cheap clay they haul in washes from under them.\nThe roads to where my dad is, in the mausoleum, are covered with red clay and rutted with holes. Way too much money was spent to buy those spaces that are supposed to be kept up and are not being. I feel this will be the next cemetery in horrible repair that makes the news. Do not buy a plot here without looking hard at the shape the cemetery is in.", "pics": null, "resp": null, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "108650853051157197034", "name": "Wanda Bordone", "time": 1557570869670, "rating": 5.0, "text": "Our family greatly appreciated the kindness that Ms. Cheri Roberts and the staff at Jefferson Memorial Gardens East showed to us. She immediately responded to our out-of-state assistance which we needed and went above and beyond in helping us. What peace of mind we have because of the respect and courtesy she extended to us, as well as to our loved ones resting there. Thank you so much.", "pics": null, "resp": {"time": 1557573744930, "text": "Wanda,\nThank you so much for the kind words and taking the time to leave this comment. We’ll let Cheri and team know, it’ll make their Saturday!  If you ever need help in the future or if there’s anything else we can do to help please be sure to reach out! Thank you and have a wonderful weekend!"}, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "106998638209615428038", "name": "P A Pennington", "time": 1556398421061, "rating": 5.0, "text": "Having dealt with more funeral homes than I care remember the past 5 years, I must say this one was the best experience by far. Victoria was very helpful, went above and beyond to accommodate the family. I didn’t feel the compassion was fake or forced. The cemetery is lovely. Prices are not competitive but funerals are not cheap anymore.", "pics": null, "resp": {"time": 1556466061585, "text": "Thank you Happy Trails!  We'll let Victoria know!  We appreciate your comments and review!  We work hard everyday to provide great service and go above and beyond to make things easier on the families we serve.  We're happy to hear we did a nice job for you.  Thank you for placing your trust in us."}, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "107799008549609916080", "name": "Celi MC", "time": 1591736038181, "rating": 1.0, "text": "I called to get some information about a marker but I was left on hold for more than 15 minutes. I hung up because I couldn't wait anymore.", "pics": null, "resp": null, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "108505203110164559362", "name": "Linda Jones", "time": 1547671998904, "rating": 5.0, "text": "We had my mom's funeral and burial at Jefferson.  It was unexpected and she and we (my sister and I) were not prepared for it.   We picked Jefferson because we live in the area, drive past and wanted mom to be close so we could visit. After calling some of the other funeral homes, we felt like the folks at jefferson treat you like family and the price was affordable and easier than going to one place for a funeral and another for the cemetery. They turned a difficult time into a nice event honoring our mom.  Thank so much for helping our family at a difficult time.  We appreciate it more than you all know.", "pics": null, "resp": {"time": 1563812717159, "text": "Thank you Linda!  We appreciate the kind words, it was our pleasure to help your family."}, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "105538676898201015203", "name": "Roger Hill", "time": 1546959239866, "rating": 1.0, "text": "Attended a service here last week for a church friend. I was very displeased with the way things went. When we arrived early that morning the flowers were not in the chapel, not even the flowers for the casket these were finally brought in while family and friends were already gathering. When going out to the cemetery the casket was left out from under the canopy and there was mud all over the canopy inside and out and all over the carpet. I understand it has been raining a lot however, to me you would have a way to clean this for each service. For the price that services cost I would think you could do a better job. I would also say that in your profession I don't think tattoos showing is a good thing on your employees.", "pics": null, "resp": {"time": 1546972758337, "text": "Roger, We are sorry to hear that the funeral service did not meet your expectations and we would like to learn more about the service you attended and how we could do a better job going forward.  Would you please let us know your contact information by calling the funeral home at 205-655-2536 and ask for Adam Seal or leave a message with Kennetha Massey who will have Adam reach out to you directly.  We take all of your points very seriously and would like to use the feedback to improve.  We look forward to discussing this matter with you and we thank you for your comment."}, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "107299808039449279994", "name": "Lindsey Seal", "time": 1522858583533, "rating": 5.0, "text": "Beautiful, updated facility in Trussville. Warm and welcoming atmosphere and staff. Professional and courteous.", "pics": null, "resp": {"time": 1547230322053, "text": "Thank you Lindsey!"}, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "101691518487366871567", "name": "Stephanie Evans", "time": 1499614241010, "rating": 1.0, "text": "Currently my family and I are devastated by the lack of dignity and respect my grandparents graves have been given. It has been almost a month since my grandfather passed away and the flowers from his funeral are STILL on the grave. The grave is such that one dig and you could EASILY touch the vault, and the head stone is still several feet from the graves upside down. I cannot explain how upset we are by this lack of respect. When my grandmother passed away in 2014 the funeral home did an amazing job. They were on top of everything, and very respectful. With my grandfathers funeral (June 2017)  we were not pleased at all. (* I will not post pictures of the grave out of respect for my family*)", "pics": null, "resp": {"time": 1499705135198, "text": "Stephanie,\n\nThank you for acknowledging your satisfaction with our funeral home back in 2014 for your grandmother's service.  We are very sorry to hear that we have not fulfilled the same expectation for your grandfather.  We do not want to make excuses but with the consistency of the rain that we have had in the area recently we are extremely behind on backfilling and the marker will not go back down until the grave is prepped.  We would like to state that we treat every grave now as we did back in 2014 but want to look into your grandfather's for you.  If you could kindly call us directly at 205-322-0543 so we can get your grandfather's name that would be greatly appreciated.  Again, our sincere apologies, we hope that we can resolve this for you in a timely manner.\n\nSincerely,\nJefferson Memorial Funeral Home & Gardens"}, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "106586165843165924095", "name": "Gina Huie", "time": 1492227766471, "rating": 5.0, "text": "It's very peaceful, and nice. The staff are warm and friendly, especially Shirley Carr. My daughter is laid to rest there.", "pics": null, "resp": {"time": 1547230358148, "text": "Thank you Gina, We appreciate the kind words!"}, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "100548863999534517060", "name": "Dagney Doodle", "time": 1547586096845, "rating": 1.0, "text": "Sandra was absolutely wonderful. I wish I could say that for the rest of the staff. Rude, unprofessional, lazy and the list goes on.", "pics": null, "resp": {"time": 1547670590305, "text": "Hello Dagney,\nSandra is appreciative of the compliment, Thank you!\n\nWe'd like to speak with you regarding your experience as it's difficult to understand the issue without additional insight into your situation.  If you could provide us with your real name, who you visited with, and what the issue was, we will be sure to use the information to improve our services.  We appreciate you reaching out to us and hope that you will contact us either via phone 205-655-2536 or email information@jmgardens.com so that we can try to better help you.  Thank you and have a great day!"}, "gmap_id": "0x88890db94ffd306f:0xe9addfba459c1a9e"}
{"user_id": "103153256287268652726", "name": "Jamie Selman", "time": 1537969016232, "rating": 5.0, "text": "Brian was so helpful when my mother-in-law passed. He was extremely professional and trustworthy and made a beautiful monument for her grave. I believe his main office is in Montgomery, but since I live in Birmingham, he was more than willing to meet close to my home to make  it convenient for me. I can't say enough about my appreciation for his excellent customer service and kindness.", "pics": null, "resp": null, "gmap_id": "0x888e819b3acbe77f:0xf89c5ed8f19ac72f"}
{"user_id": "103136671934206178701", "name": "mz_ barnes", "time": 1559287817433, "rating": 5.0, "text": "Everything was done long distance Brian was professional considerate kind and most of all compassionate for my love ones remains and considering we’ve never meet he kept me informed and up to date with the process as if we had. I fully endorse this company. They really are about people.", "pics": null, "resp": null, "gmap_id": "0x888e819b3acbe77f:0xf89c5ed8f19ac72f"}
{"user_id": "112514029510960100462", "name": "Hattie Francis", "time": 1555379624018, "rating": 5.0, "text": "I  was treated with up most respect and professionalism. I am so grateful to Brian and his staff for  the awesome job ! I  prayed that  my son's grave marker  would  be installed  on or before  his birthday. Brian  and his crew made it happened. I  would  highly recommend Legacy  Memorials.", "pics": null, "resp": null, "gmap_id": "0x888e819b3acbe77f:0xf89c5ed8f19ac72f"}
{"user_id": "104604966006114973005", "name": "Majyst Thalsbane", "time": 1541388684543, "rating": 5.0, "text": "Excellent service. The staff and owner Brian are extremely helpful. Hey assisted and worked with me until I had the perfect headstone for my loved one.", "pics": null, "resp": null, "gmap_id": "0x888e819b3acbe77f:0xf89c5ed8f19ac72f"}
{"user_id": "101110464776920947915", "name": "Dave and Robin Lawson", "time": 1557447638403, "rating": 5.0, "text": "We cannot thank Brian enough ! My family had a situation that was not being handled properly causing much distress and heartache. Brian stepped in and was able to resolve the situation in a timely manner - solving an issue that was not handled properly by another party... Very professional.", "pics": null, "resp": null, "gmap_id": "0x888e819b3acbe77f:0xf89c5ed8f19ac72f"}
{"user_id": "110070863301600288668", "name": "kim price", "time": 1543896283936, "rating": 5.0, "text": "Best prices", "pics": null, "resp": null, "gmap_id": "0x888e819b3acbe77f:0xf89c5ed8f19ac72f"}
{"user_id": "108867606056616604556", "name": "Edna Nettles", "time": 1551995185132, "rating": 5.0, "text": "Courteous and very polite.", "pics": null, "resp": null, "gmap_id": "0x888e819b3acbe77f:0xf89c5ed8f19ac72f"}
{"user_id": "104340117177096402940", "name": "Trudy Dalton", "time": 1623733148248, "rating": 5.0, "text": "Very nice and reasonable. Wish I had of found this place sooner so I could have had my dads stone there before decoration.", "pics": null, "resp": null, "gmap_id": "0x8861e568e9fb5837:0xcf9901b9a4c889d2"}
{"user_id": "112498442570941051187", "name": "Jennifer Williams", "time": 1617209493399, "rating": 2.0, "text": "Me and a group of friends went to this establishment and had things made for a friend of ours that we had lost. We got these necklaces to hang in our cars with some of her memorial flowers in them, it’s been a year and mine had broke open and i have lost those petals, i paid $60 for this.. another girls did the same thing 6 months ago.. and another girls pin she had made broke. We paid “quality” price for these products and were not good quality, now the memorial of our loved one is now lost due to the poor craftsmanship put into these products. i will not be going back.", "pics": null, "resp": null, "gmap_id": "0x8861e568e9fb5837:0xcf9901b9a4c889d2"}
{"user_id": "104912880458049539774", "name": "Abby West", "time": 1617752600516, "rating": 1.0, "text": "I would not go here for anything. The quality of their products is sad. The products are made cheaply and will fall apart and break easily. The service was poor. The prices are outrageous. These people are taking advantage of people with broken hearts.", "pics": null, "resp": null, "gmap_id": "0x8861e568e9fb5837:0xcf9901b9a4c889d2"}
{"user_id": "102672534835060343594", "name": "Paulette Martin", "time": 1568573303612, "rating": 5.0, "text": "In your time of need these are the nicest people you could ever want to deal with. Their prices are more than reasonable. I checked around and nobody could even come close to what we received from them. You won't be disappointed.", "pics": null, "resp": null, "gmap_id": "0x8861e568e9fb5837:0xcf9901b9a4c889d2"}
{"user_id": "116377114387881125250", "name": "Tee West", "time": 1576381838480, "rating": 5.0, "text": "They did a wonderful job in creating a great momentum from things that belonged to my Mom.", "pics": null, "resp": null, "gmap_id": "0x8861e568e9fb5837:0xcf9901b9a4c889d2"}
{"user_id": "101830761468116205739", "name": "Jon Carden", "time": 1613345155591, "rating": 4.0, "text": "Nice place", "pics": null, "resp": null, "gmap_id": "0x8861e568e9fb5837:0xcf9901b9a4c889d2"}
{"user_id": "111290062950021451733", "name": "Debbie Fanning", "time": 1563218918056, "rating": 2.0, "text": "I cannot tell you the quality of the monument I have ordered..... because it still hasn't been delivered. I went in to choose a foot marker for my daughter's grave. I was Hoping it would be delivered for decoration.... this only gave them 2 weeks, but what upset me was HOW the order was taken. The gentleman was kind and brought me to the computer to scan in the picture and helped me with the wording etc... set it up cor my approval. Printed off a finished paper rendering cor me to sign after corrections were made, the cost was quoted and I was told I had to pay for all of it especially since it was a rush job. After my credit card was run. He told me they could not promise me anything, then he asked the gentleman that actually makes the markers if he thought it could be squeezed in between larger headstones since it was small. He said he thought so, but couldn't promise..... well it wasn't made or places by decoration. 2 weeks later I checked again.... it was 5th in line and would be placed that week..... that was 3 weeks ago.... still not placed.\nI prefer honesty to empty promises. I do like the memorial jewelry that I had made with the dried flowers from my daughter's funeral.  The jewelry took about 4 weeks. Paying 1/2 down and the other 1/2 at pick up. I will update when I finally see the marker.\nUpdate. 7/15/19\nCalled to check on foot marker.... now it is 3rd on the list and it may be ready for me to look at in 2 weeks.... cannot believe what they say after they have your money....lost 2 more stars..... DO NOT LIE TO CUSTOMERS AND PUT CHRISTIAN IN YOUR NAME.", "pics": null, "resp": null, "gmap_id": "0x8861e568e9fb5837:0xcf9901b9a4c889d2"}
{"user_id": "114379175819790648681", "name": "Robert Harvey", "time": 1555283798345, "rating": 5.0, "text": "Great people, they came through for us in the time of need.  May God greatly bless them.", "pics": null, "resp": null, "gmap_id": "0x8861e568e9fb5837:0xcf9901b9a4c889d2"}
{"user_id": "111114513835738194347", "name": "Donna Freeman", "time": 1540222629029, "rating": 5.0, "text": "They do an outstanding job. I highly recommend them", "pics": null, "resp": null, "gmap_id": "0x8861e568e9fb5837:0xcf9901b9a4c889d2"}
{"user_id": "103793693157006136261", "name": "Gayla Campbell", "time": 1553309206098, "rating": 5.0, "text": "Great store", "pics": null, "resp": null, "gmap_id": "0x8861e568e9fb5837:0xcf9901b9a4c889d2"}
{"user_id": "108026785997839051516", "name": "Nikki N", "time": 1533691756138, "rating": 5.0, "text": "Very nice,and helpful people", "pics": null, "resp": null, "gmap_id": "0x8861e568e9fb5837:0xcf9901b9a4c889d2"}
{"user_id": "100681222569225002624", "name": "Loretta Holland", "time": 1490085254957, "rating": 5.0, "text": "Great people ,gift shop", "pics": null, "resp": null, "gmap_id": "0x8861e568e9fb5837:0xcf9901b9a4c889d2"}
