{"user_id": "109555584893841441528", "name": "Corey Bryant", "time": 1600130750807, "rating": 5.0, "text": "Really enjoyed the visit over there Saturday they are professionals", "pics": null, "resp": null, "gmap_id": "0x889bca0fa4e55555:0x3ad69e86867c4a15"}
{"user_id": "103003220999270788471", "name": "Redline Stands", "time": 1571413484084, "rating": 5.0, "text": "My dealings with Charlie have been quite different than the other guy.  Charlie has always been honest to me and willing to help even when I wasn't offering to pay him anything for his time and knowledge.  Don't let the other guy fool you, you can't please everybody.", "pics": null, "resp": null, "gmap_id": "0x889bca0fa4e55555:0x3ad69e86867c4a15"}
{"user_id": "115975617685465084533", "name": "Petro Huff", "time": 1550445517252, "rating": 1.0, "text": "Charlie the con man not only makes deals then breaks agreements. But puts recent windows lives in danger\n1. Made several barter deals with my mother and I.\nA. Bought a Z71 for $6500 dollars from my mother and I. Instead of paying cash, he was suppose to fix my fathers 1987 corvette for the sum of $6500 and the remaining  sum, would be reimbursed to my mother . The involvement of the repairs between all parties was a replacement motor, install convertible top that we already had bought, just needed to be installed. The 1987 Corvette was suppose to be first thing fixed but instead took almost a year. There were issues, that not only put my mother a recent windows life in danger but other peoples lives as well.\n\nThe brakes had little to no brake fluid.\n\nThe oil was over a quart low\nThe body damage that was done while in Charlies shop leads me to believe they went off roading with the corvette.\n\nThe next barter deal was that Charlie was going trade a 1969 Chevelle which was recently on his website as a barn find. It was not a barn find. It was in a building that my mother and I own and I had previously got the 1969 Chevelle running about a year before we called Charlie to come look at the Chevelle to see if he would like to buy it.\n\nThe deal was the Chevelle for a 1954 Corvette my mother owned to be restored. Charlie promised that the 1954 Corvette would come back running and safe to drive to town,. When the 1954 Corvette came bac to my mothers, the corvette was unsafe and dangerous to be driving. It would not idle, it took three times the normal distance to stop.\n\nCharlie came over to my mother who recently had lost her husband of 30 years and scammed her. He did not honor any of the agreements that were agreed upon and if you would not like yourself or your family placed in danger do  not use Charlies Classics Car restoration . Message me if you would like more details and I will be glad to tell you the rest .\n\nOh yeah,. Charlie will use he is Christen as well as his family to gain your trust and then screw you over and try to kill you.", "pics": null, "resp": null, "gmap_id": "0x889bca0fa4e55555:0x3ad69e86867c4a15"}
{"user_id": "107472912101270201813", "name": "Agnes Jones", "time": 1578403757124, "rating": 4.0, "text": "Works on classic cars. The place to go .", "pics": null, "resp": null, "gmap_id": "0x889bca0fa4e55555:0x3ad69e86867c4a15"}
{"user_id": "106900652340554347350", "name": "Joseph Duran", "time": 1504026871792, "rating": 4.0, "text": "Decent lot, no complaints. Friendly staff.", "pics": null, "resp": null, "gmap_id": "0x88890c08e5503b15:0xfd5c614dbbc91edd"}
{"user_id": "102790060698410015124", "name": "Jackie Jackie", "time": 1626379252133, "rating": 5.0, "text": "This was the best car buying experience I have ever had. Debbie was very easy to work with, made the process easy and stress free.  Debbie was amazing to work with and went above and beyond to get me the vehicle I wanted.", "pics": null, "resp": null, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "105901353439528343524", "name": "Don Mabry", "time": 1597264551402, "rating": 5.0, "text": "Recently purchased a slightly used, pretty much brand new 2020 Toyota 4Runner from Eagle Automotive in Huntsville.   While the operation's location is spartan, who really needs a cappuccino machine in a lobby when you instead are getting a better-than-fair deal to market!  Debbie made the purchase process quick and painless. She is a consummate finance professional and knows the ins-outs of the library of paperwork required for an auto purchase nowadays, even for an out of state buyer like me.  I recommend seeing if they have something that will fit your needs and stop wasting time on the plethora of online car websites and worse.  You won't be disappointed.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOi_to0otxrcB7K9tT7-NVOk6qkEp4LenAtdXtu=w150-h150-k-no-p"]}], "resp": {"time": 1597342576722, "text": "Thank you for your feedback!  We strive for a simple, no hassle process, & we especially love happy customers!"}, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "103262236956993174705", "name": "Jan Logan", "time": 1617684108048, "rating": 5.0, "text": "Best place to buy your next car!!  Great selection of low-mileage, great condition, nearly new cars!!  You can't beat their prices!!  Debbie is a pleasure to work with! No high-pressure strategy here,.... just top-notch assistance!! I highly recommend that you check them out!!   :)", "pics": null, "resp": {"time": 1617746609066, "text": "Thanks so much for your feedback!  We love our customers- ESPECIALLY our repeat customers like you!!"}, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "101709946498513306247", "name": "Mary D", "time": 1619896477891, "rating": 5.0, "text": "Debbie was awesome! We traveled from Texas to buy an SUV and it was everything we dreamed of! Great customer, attentive to our needs and just an overall wonderful experience. Would recommend 10x over 😁😁", "pics": null, "resp": null, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "101181230753446770244", "name": "John Mee", "time": 1619899606566, "rating": 5.0, "text": "Drove 200 miles to buy 2020 Honda Accord. Great price, very low miles, mint condition.  Excellent service from Debbie.  Can't go wrong.", "pics": null, "resp": null, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "114516667903365467470", "name": "Dan Joffe", "time": 1625186948941, "rating": 5.0, "text": "Buying a car here is a pleasure. Debbie took care of business in a friendly and professional manner. This is the second car I've bought here, and they are light years ahead of the typical dealer experience.", "pics": null, "resp": {"time": 1625756475339, "text": "Thank you so much for your feedback!  We greatly appreciate your business!"}, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "117068268369789738347", "name": "Shannon Hardy", "time": 1617651378800, "rating": 5.0, "text": "Excellent car buying experience. Debbie McCrary was super. Very professional but friendly. No pressure whatsoever and very helpful. Excellent costumer service! She was very knowledgeable, answered all my questions and worked with me.  Had been to a dealership and left. Found Eagle Automotive and it couldn’t have been a better experience. Thank you Debbie!\nI’d recommend to anyone!", "pics": null, "resp": {"time": 1617746699186, "text": "Thank you so much for your feedback!  We are so lucky to have Debbie & thankful for great customers like you!"}, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "108610185876220029258", "name": "Kristy Powell", "time": 1614620654939, "rating": 5.0, "text": "We recently bought a car from Eagle, and Debbie was our sales consultant. She was awesome,  very nice and patient with us. She had the car inspected before the purchased and stayed on top of everything. I could text or call her for any questions. She did not hassle us to buy the car. We got a good deal on this car, below Kelly book value. Thanks Debbie and staff", "pics": null, "resp": {"time": 1614865180969, "text": "Thank you so much for your feedback!  We love hearing from our customers!"}, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "118139898604314106390", "name": "Megan Lynch", "time": 1603907749306, "rating": 5.0, "text": "Easiest car buying experience ever! I’m over 4 hours away, so getting to the dealership was not an option with 3 kids. Kelly and Debbie are fantastic to work with. They provided a video walk through, quick responses to questions via text or direct line, and provided the best customer service. The delivery/paperwork process was quick and painless. The vehicle was immaculate and in pristine condition. Would highly recommend!", "pics": null, "resp": {"time": 1603913161300, "text": "Thanks so much for your feedback!  We love making it an easy process for our amazing customers!"}, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "108858124979805012499", "name": "Alainna Holmes", "time": 1618065050839, "rating": 5.0, "text": "One of the most attentive and kindest sales rep I have encountered. Mrs. Debbie made my vehicle purchase a breeze, and had it ready to go before I got there. We drove from out of state and I would drive the 5+ hours again.", "pics": null, "resp": null, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "111246587628126014967", "name": "Lucinda Heatherly", "time": 1616852635109, "rating": 5.0, "text": "Debbie is awesome very patient. We had crazy schedule she worked with us. This is our third car we have purchased with her help. Fantastic Lady.5 stars all the way", "pics": null, "resp": {"time": 1617017147118, "text": "Thank you so much for your feedback!  Eagle is very lucky to have Debbie & amazing customers like you!"}, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "108246518139239341682", "name": "Harry Mensch", "time": 1610040570015, "rating": 5.0, "text": "I would definitely recommend Eagle Automotive to anyone looking for a used vehicle.  The cars & trucks are in great shape, the prices are very reasonable & you couldn't ask for a better salesperson than Debbie.  Debbie went the extra mile to make sure we were satisfied.  No pressure, no haggling, great experience!!", "pics": null, "resp": {"time": 1610364977464, "text": "Thank you so much for your feedback!  We have the BEST customers!"}, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "103808871102228409478", "name": "Alex W", "time": 1604373283662, "rating": 5.0, "text": "We had a WONDERFUL experience buying at Eagle Automotive!  Debbie and Kelly are incredible!  They're extremely nice to work with, and I highly recommend that you look here first before buying from larger dealerships.  They may be small, but they make up for it in quality and courtesy.  We were in-and-out of there in under 30 minutes.  They do not do their own in-house financing but that shouldn't hinder you from looking - you can get your own financing from a lender and simply show up and sign!  We thoroughly enjoyed our experience.  The cars are excellent quality, mostly low-mileage rental fleet turnover - still smell like brand new, but aggressively priced.  AND, ZERO extra fees!  Advertised price and tax - that's it!  A++++++++++ for this car buying experience. Thank you, Debbie and Kelly!!", "pics": null, "resp": {"time": 1604402610091, "text": "Thank you so much for your feedback!!  All the things we strive to bring our customers summed up!  We appreciate you!"}, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "100583751127480269402", "name": "Hannah Harrison", "time": 1620765736615, "rating": 5.0, "text": "Best car buying experience! No hidden fees, very to the point, and very nice. Debbie is great!", "pics": null, "resp": null, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "109880275730118275758", "name": "Bridget Ragland", "time": 1610088809147, "rating": 5.0, "text": "Easiest car buying process ever!!! Debbie is the BEST!!! She was so helpful, easy to talk with and worked around my work schedule to make sure I was able to pick up my car. I would recommend that everyone go and give Debbie a visit when you looking for your next car, you won’t be sorry.", "pics": null, "resp": {"time": 1610364919806, "text": "Thank you so much for your feedback!  We love hearing from our customers!!"}, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "107176562276048002800", "name": "Tiffini Dowdell", "time": 1611871675807, "rating": 5.0, "text": "Working with Ms.Debbie was a true joy. I told her what I was looking for and she made sure I found it. Even went the extra mile to try and help me maximize my trade-in. I would not only recommend her to friends and family but will keep her in mind when in the market for my next vehicle. Thanks Ms. Debbie!", "pics": null, "resp": {"time": 1613673778423, "text": "Thank you so much for your feedback!"}, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "112610963637267189375", "name": "Dorothy Merriweather", "time": 1604692632432, "rating": 5.0, "text": "I just purchased a car from Eagle Automotive Hertz.  The service I received was just excellent.  Debbie was the sales specialist.  She was very kind and friendly.  Her personality is just marvelous.  She went way beyond the call of duty to make sure I was satisfied with the car.  Debbie even picked me up from home and took me to Eagle Automotive.  I recommend her very highly to anyone looking to purchase a vehicle.  You will not regret it.  This is the second vehicle I have bought from Eagle Automotive.  Debbie was the sales person who helped me in 2015 when I purchased the first car.  Thank you Eagle Automotive for employing someone with the kind of personality Debbie has.  Again, thank you Debbie for all you have done to make the transition so smoothly.", "pics": null, "resp": {"time": 1604926559249, "text": "Thank you so much for your feedback!  We totally agree, Debbie is amazing.... and so are our customers!!"}, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "102524680728610995395", "name": "Misty Perkins", "time": 1619304169755, "rating": 5.0, "text": "I have been searching for a car for about a month. I have been to car dealerships where I wasn't feeling the car or the price and was pressured by the sales people over and over. I had been eyeing the Corollas on their website. I signed up to view the car at 5 AM. By 7 AM, before the store even opened, Kelly, the Director of Fleet had emailed me the Carfax and a rough estimate of the cost. When I arrived, Debbie had the car ready for us to try out, when we returned the paperwork was ready and I was ready to sign. I had to run to the bank to secure a loan and while we did that Debbie went and filled up the car for us. This was the quickest, painless, and best way to buy a car. I didn't have to haggle or anything. I honestly believe this car was an absolute steal and I am so happy with my purchase. I hope it will be a while, but my spouse and I will be repeat customers. Thank you, Debbie for being a total rockstar and go above and beyond! You are fantastic! If you need a car- I highly recommend Eagle Automotive!", "pics": null, "resp": null, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "111896152495441137398", "name": "Dewayne McCarver", "time": 1610155857203, "rating": 5.0, "text": "Kelly and Debbie were great!  They were both, extremely helpful and prompt.  It’s nice to buy a car from someone who doesn’t seem like a car salesperson!   I give my highest recommendation.", "pics": null, "resp": {"time": 1610364880400, "text": "Thank you so much for your feedback!  We truly appreciate our customers!"}, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "112422091242067298898", "name": "Reed Clay", "time": 1605699593107, "rating": 5.0, "text": "When it comes to buying a car I am all about the value. We drove from Atlanta, Ga. to Huntsville. We purchased a 2020 Toyota 4Runner. We saved about $5,000, over Atlanta prices, but more than that Kelly had taken the time to prepare a video of every inch inside and out. Debbie had all the paperwork ready to go so we were in and out in less than an hour. We would recommend Eagle to anyone.", "pics": null, "resp": {"time": 1605702692316, "text": "Thank you so much for your feedback!!  We greatly appreciate you!"}, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "112407487402758782317", "name": "Harley Steele", "time": 1599674885217, "rating": 5.0, "text": "I have purchased two vehicles from Debbie and Eagle Automotive.  Last year I purchased a 2019 VW Jetta and recently I purchased a 2029 Toyota Tacoma.  One of the best experiences I’ve had purchasing vehicles and I bought many! Debbie even permitted me to get a full inspection by the dealer on the Jetta.  The Tacoma was practically brand new with only 7000 miles on it.  The tiny bit of miles I gave up was well worth the thousands of dollars I saved over the Toyota dealer.  Both salesmen at VW and Toyota couldn’t believe the deal I was getting.  I highly recommend giving Eagle Automotive and Debbie a shot at your business.  Definitely worth it!!!", "pics": null, "resp": {"time": 1599753544319, "text": "Thank you so much for the feedback!  We greatly value your input & your business!!"}, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "112673736030924326409", "name": "Terry Mensch", "time": 1610028936932, "rating": 5.0, "text": "My husband and I had a great experience purchasing our Kia from Debbie. We got a great car for a great price. If you're  looking for a car, we highly recommend Debbie.", "pics": null, "resp": {"time": 1610038995170, "text": "Thank you so much for your feedback!  We love hearing from our customers!"}, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "111008289117938441028", "name": "Tom Milner", "time": 1614463392042, "rating": 5.0, "text": "Debbie was excellent! Transaction was smooth and quick! My 4th car to buy here!", "pics": null, "resp": {"time": 1614527399150, "text": "Thank you so much for your feedback & especially for your business!  We appreciate you!"}, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "103891901534080552723", "name": "Shelby Sandlin", "time": 1601340017866, "rating": 5.0, "text": "Not only did they have the best deal I could find, the process was made easy and quick. I was in and out in 30 minutes. These guys are great to work with and well informed! Definitely check here if looking for a new ride!", "pics": null, "resp": {"time": 1601396342923, "text": "Thanks so much for your feedback! We strive for a quick & easy process!"}, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "103964349150395156596", "name": "Danny Heltsley", "time": 1600109664831, "rating": 5.0, "text": "I had been looking for a 2019-2020 Kia Sorento for a few weeks and everytime I found one online that was any kind of a good deal it was gone before I could get to it. I found a 2020 Kia Sorento with only 11K miles on it at Eagle Automotive for what I thought was a GREAT price! I e-mailed Debbie and asked if I could put some money down and her hold it until I could get there? (I was out of state and 3 hrs away) She gladly took my $250 down payment and 3 days later on Saturday my wife and I drove down and Debbie gave us the keys and said \"go drive it and check it out\". We drove it, loved it and with a small amount of paperwork we were on our way home with a \"like new\" car. I had some issues with my DMV in my state and Debbie was GREAT to get me the extra paperwork I needed to get it licensed. I would HIGHLY recommend anyone who is looking for an almost brand new car for an AMAZING price to contact Debbie at Eagle Automotive in Huntsville AL, she will take care of you!!!", "pics": null, "resp": {"time": 1600118242290, "text": "Thank you so much for your feedback!!  We are so glad you found us!!  We love hearing happy customer stories!"}, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "116589045683416207008", "name": "Serge M'Sadoques", "time": 1597540780418, "rating": 5.0, "text": "Great place to shop. No pressure sales person \"in your face please buy a car from me\" stuff. Super nice person. No pressure to buy. Gave me the keys and said go drive it. I loved it. No haggle. Priced $1,000 below blue book value. Best car buying experience I ever had.", "pics": null, "resp": {"time": 1597588028076, "text": "Thank you for your feedback!!  All the things we strive to provide our customers in their buying experience summed up!  We appreciate you!"}, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "105090438365373122340", "name": "Joey W", "time": 1597327107686, "rating": 5.0, "text": "Kelly and Debbie were great to work with!  Very detail oriented.  The videos and vehicle information were professional and timely.  Everything was handled online with a simple delivery process 350 miles away.  I would definitely work with them again!", "pics": null, "resp": {"time": 1597342603767, "text": "Thank you so much for your feedback!!"}, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "108697178526005025164", "name": "B J Atnip", "time": 1597433297112, "rating": 5.0, "text": "I highly recommend this place to purchase an automobile. They are true full when dealing with you and no Hidden charges. It was the best experience I’ve have ever had, very courteous had all the information I was asking for. Debbie is the best person she made our purchase very enjoyable. I can’t say enough good things about our time at Eagle Automotive. Highly recommend if your looking for an automobile to purchase .", "pics": null, "resp": {"time": 1597495308571, "text": "Thank you so much for your feedback!  We strive for a pressure free experience, & we love happy customers!!"}, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "106785861866000107198", "name": "Jim Tewmey", "time": 1612217695773, "rating": 5.0, "text": "Easy to buy from. I highly recommend Eagle Automotive. Debbie is outstanding.", "pics": null, "resp": {"time": 1613673757094, "text": "Thank you so much for your feedback!  We love hearing from our amazing customers!"}, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "115232757057507937889", "name": "Pam Grantham", "time": 1599783631312, "rating": 5.0, "text": "We are so pleased with our service and family friendly service.  We LOVE our Tahoe and appreciate all the work Debbie and others did to provide us with our dream car.\nA great price and great service!!", "pics": null, "resp": {"time": 1599847867712, "text": "Thank you so much for your feedback!  We love satisfied customers!!"}, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "113714089740912376938", "name": "T Clanton", "time": 1596060853114, "rating": 5.0, "text": "From Kelly's shared videos to Debbie's post sale followup, this was one of the best and easiest car purchasing experiences ever. We did the entire transaction online and they coordinated delivery. No fees, no pressure, just exceptional service. We love our new van! Terry Clanton", "pics": null, "resp": null, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "106360226126660103935", "name": "John Alexander", "time": 1617585172444, "rating": 5.0, "text": "Didn't buy the car from here but this will always be the first place I go to look before checking everywhere else. Selection is limited.", "pics": null, "resp": {"time": 1617746850011, "text": "Thank you for your feedback!!  We are so glad you found the perfect vehicle for your daughter!"}, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "114896989467427036564", "name": "Kathy Wade", "time": 1597258952238, "rating": 5.0, "text": "Highly recommend!!  Debbie helped me find the perfect SUV for me at a great price!  Will definitely purchase my next vehicle here!", "pics": null, "resp": {"time": 1597342619140, "text": "Thank you so much for your feedback!"}, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "100055843985054548444", "name": "Scott W. Zottneck", "time": 1599309227178, "rating": 5.0, "text": "Debbie was great to work with.  The car we purchased was as advertised.  Highly recommended.", "pics": null, "resp": {"time": 1599494507067, "text": "Thank you for your feedback!  We love happy customers!!"}, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "110136322289097714831", "name": "James May", "time": 1601597695457, "rating": 5.0, "text": "Great service from Debbie LaTorre, she went above and beyond to make our car buying experience the best it could be! Great prices and  vehicles at Eagle Automotive LLC!!", "pics": null, "resp": {"time": 1601643469880, "text": "Thank you so much for your feedback!  We love to hear from our great customers!"}, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "111862276765223253643", "name": "Matt Manning", "time": 1605457196857, "rating": 5.0, "text": "Purchased a low mileage RAM truck from Eagle Automotive, LLC. Debbie(Car Sales Specialist) was very kind & helpful in the buying process. If your in the market for a vehicle give Debbie a call!", "pics": null, "resp": {"time": 1605531420199, "text": "Thank you so much for your feedback!  We appreciate you!"}, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "117742979046021749830", "name": "kateira allen", "time": 1604511070112, "rating": 5.0, "text": "I had a fast and great experience!!! Beyond satisfied!!!!", "pics": null, "resp": {"time": 1604582576222, "text": "Thank you so much for your feedback!"}, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "116872932275320510183", "name": "Jessica H", "time": 1604180761217, "rating": 5.0, "text": "Excellent service, atmosphere, and prices!", "pics": null, "resp": {"time": 1604236563248, "text": "Thank you so much for your feedback!  We greatly appreciate it!"}, "gmap_id": "0x88626dca5effd94f:0xeea89dd7fe67b2a1"}
{"user_id": "108466186421643491029", "name": "Rebekah Hamby", "time": 1623191656271, "rating": 2.0, "text": "I needed a car door for my car, they said they had about three of my cars out there. So I come all the way out there and they point to where it's at. And it's hot so looking all over for my car and I couldn't find it nor my uncle could find it. And I'm sun burnt now but no car door. I called them before I left to say I couldn't find them but no help at all. They said well we got three out there. Well help me find it then ugh. I'm so aggravated. Such terrible service.", "pics": null, "resp": null, "gmap_id": "0x888ccfe2f11dbdd9:0x8478cf8d7f5e82d7"}
{"user_id": "112946039091366232592", "name": "Tommy Clark", "time": 1622311791275, "rating": 5.0, "text": "Found what I needed very respectful people Bama is the place to go ..💯💯💯💙💪🏿", "pics": null, "resp": null, "gmap_id": "0x888ccfe2f11dbdd9:0x8478cf8d7f5e82d7"}
{"user_id": "118048914606616526006", "name": "Jimmy Culberson", "time": 1619005039911, "rating": 5.0, "text": "People were very helpful in giving out information and help", "pics": null, "resp": null, "gmap_id": "0x888ccfe2f11dbdd9:0x8478cf8d7f5e82d7"}
{"user_id": "101190289455826466651", "name": "Amber Mack", "time": 1627588100750, "rating": 1.0, "text": "They are one of the worst to go get a used car they do not check the cars out before they sale them at all", "pics": null, "resp": null, "gmap_id": "0x888ccfe2f11dbdd9:0x8478cf8d7f5e82d7"}
{"user_id": "105511539160933818149", "name": "Heather Mann", "time": 1612897023673, "rating": 5.0, "text": "Best junkyard around! They're always helpful & have a huge selection of cars!", "pics": null, "resp": null, "gmap_id": "0x888ccfe2f11dbdd9:0x8478cf8d7f5e82d7"}
{"user_id": "106943534747015675074", "name": "Nestor Roman", "time": 1602290920715, "rating": 5.0, "text": "Excellent. Always find something that you need for a great price. Great staff members!", "pics": null, "resp": null, "gmap_id": "0x888ccfe2f11dbdd9:0x8478cf8d7f5e82d7"}
{"user_id": "109216723842600240517", "name": "Eugene Smith", "time": 1604404211191, "rating": 1.0, "text": "About a transmission from bama Auto sales no guarantee no refund no returns $450 transmission is no good please stay clear of this place", "pics": null, "resp": null, "gmap_id": "0x888ccfe2f11dbdd9:0x8478cf8d7f5e82d7"}
{"user_id": "112043974743107467944", "name": "Maurquitta Hall", "time": 1595078743116, "rating": 3.0, "text": "Very unprofessional! I am a first time customer, and I felt the owner was very nonchalant and irritated. I arrived 5 mins after the establishment was ipen to find that is wasn't open so I waited an additional 15 minutes,  the owner said Brock wasn't there but I can pay soon as I get in the office he ridiculed me for wearing a mask due to COVID-19, I educated him on why it was necessary and I give him my $ he says he doesn't have any money to give me change then slams my $ on the desk and says \"Well you just gotta wait until he gets here!\"  RUDE! But eventually he arrived and got me situated.", "pics": null, "resp": null, "gmap_id": "0x888ccfe2f11dbdd9:0x8478cf8d7f5e82d7"}
{"user_id": "118065995178191828554", "name": "Carolyn McAlpine", "time": 1605915912029, "rating": 1.0, "text": "Didn't have my part never answers the phone either", "pics": null, "resp": null, "gmap_id": "0x888ccfe2f11dbdd9:0x8478cf8d7f5e82d7"}
{"user_id": "113012677011366997593", "name": "Hermal Hubbaard", "time": 1616514145139, "rating": 5.0, "text": "Good service", "pics": null, "resp": null, "gmap_id": "0x888ccfe2f11dbdd9:0x8478cf8d7f5e82d7"}
{"user_id": "112669818635150309969", "name": "matt hammock", "time": 1600317703765, "rating": 5.0, "text": "Corey is the best love this place", "pics": null, "resp": null, "gmap_id": "0x888ccfe2f11dbdd9:0x8478cf8d7f5e82d7"}
{"user_id": "107094564346916266814", "name": "Lixa Chasteen", "time": 1575206628098, "rating": 5.0, "text": "Never actually been here but I have to run by several times I love to talk to you about buying a new car", "pics": null, "resp": null, "gmap_id": "0x888ccfe2f11dbdd9:0x8478cf8d7f5e82d7"}
{"user_id": "108764529414261653875", "name": "Patricia Vanscoyoc", "time": 1513794328663, "rating": 5.0, "text": "We enjoyed our visits to Bama. When we go the  manager helped we with a few parts that we need to replace on our vehicle when we buy it. He made sure we where happy and pleased will our visit and could come anytime if we had any problems or concerns!", "pics": null, "resp": null, "gmap_id": "0x888ccfe2f11dbdd9:0x8478cf8d7f5e82d7"}
{"user_id": "113889183286349678735", "name": "Clue Wyatt", "time": 1560719667011, "rating": 5.0, "text": "Good selection fair prices easy to work with", "pics": null, "resp": null, "gmap_id": "0x888ccfe2f11dbdd9:0x8478cf8d7f5e82d7"}
{"user_id": "111995017077736100872", "name": "Dennis Jackson", "time": 1523308402432, "rating": 5.0, "text": "Super nice guy Rick I will go back", "pics": null, "resp": null, "gmap_id": "0x888ccfe2f11dbdd9:0x8478cf8d7f5e82d7"}
{"user_id": "113400204996716639043", "name": "Betty Hildebrandt", "time": 1591726176732, "rating": 3.0, "text": "Good for junk", "pics": null, "resp": null, "gmap_id": "0x888ccfe2f11dbdd9:0x8478cf8d7f5e82d7"}
{"user_id": "113830059920773464418", "name": "James Norwood", "time": 1564848104442, "rating": 4.0, "text": "The staff was real helpful", "pics": null, "resp": null, "gmap_id": "0x888ccfe2f11dbdd9:0x8478cf8d7f5e82d7"}
{"user_id": "118333763749330667475", "name": "Ritchie McCollum", "time": 1503434361029, "rating": 5.0, "text": "Thanks for your friendship hope to see you again soon", "pics": null, "resp": null, "gmap_id": "0x888ccfe2f11dbdd9:0x8478cf8d7f5e82d7"}
{"user_id": "104815307935017569761", "name": "Richard Baxley", "time": 1499995034346, "rating": 5.0, "text": "Let you roam the yard and find your own parts", "pics": null, "resp": null, "gmap_id": "0x888ccfe2f11dbdd9:0x8478cf8d7f5e82d7"}
{"user_id": "101230954774171360662", "name": "Jim Oneal", "time": 1488756877476, "rating": 5.0, "text": "Great to find parts for cars. Look for yourself", "pics": null, "resp": null, "gmap_id": "0x888ccfe2f11dbdd9:0x8478cf8d7f5e82d7"}
{"user_id": "106367481005018422786", "name": "Robert Schumaker", "time": 1494062651910, "rating": 4.0, "text": "Lots of cars and trucks. Found what I was looking for easily, and the owner was friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x888ccfe2f11dbdd9:0x8478cf8d7f5e82d7"}
{"user_id": "105463577123260675315", "name": "Stephanie S", "time": 1536686174678, "rating": 5.0, "text": "Friendly and reasonable prices", "pics": null, "resp": null, "gmap_id": "0x888ccfe2f11dbdd9:0x8478cf8d7f5e82d7"}
{"user_id": "112618872339192278060", "name": "Nathan Moseley", "time": 1603591190744, "rating": 4.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x888ccfe2f11dbdd9:0x8478cf8d7f5e82d7"}
{"user_id": "113853049506837975473", "name": "jerry cook", "time": 1570631480595, "rating": 1.0, "text": "No good to hard to get to parts", "pics": null, "resp": null, "gmap_id": "0x888ccfe2f11dbdd9:0x8478cf8d7f5e82d7"}
{"user_id": "117307160685020523758", "name": "Larry Salzman", "time": 1525834227218, "rating": 5.0, "text": "Very good auto sales", "pics": null, "resp": null, "gmap_id": "0x888ccfe2f11dbdd9:0x8478cf8d7f5e82d7"}
{"user_id": "112537437550036930388", "name": "Ttam Enroht", "time": 1556017552989, "rating": 4.0, "text": "If they have it you can get it", "pics": null, "resp": null, "gmap_id": "0x888ccfe2f11dbdd9:0x8478cf8d7f5e82d7"}
{"user_id": "107982008401451115352", "name": "Ricardo Hernandez", "time": 1553277717309, "rating": 5.0, "text": "Good service.", "pics": null, "resp": null, "gmap_id": "0x888ccfe2f11dbdd9:0x8478cf8d7f5e82d7"}
{"user_id": "112934573329460644157", "name": "Giovanna Castrogiovani", "time": 1408462292676, "rating": 1.0, "text": "bama auto sales are no longer were they used to be even if they are still a place", "pics": null, "resp": null, "gmap_id": "0x888ccfe2f11dbdd9:0x8478cf8d7f5e82d7"}
{"user_id": "113222619598375590984", "name": "Audrey Gertz", "time": 1512662723884, "rating": 2.0, "text": "they said they had the car but we only found one and it was buried in prickers and trees and they wouldn't help us. we went somewhere else .", "pics": null, "resp": null, "gmap_id": "0x888ccfe2f11dbdd9:0x8478cf8d7f5e82d7"}
{"user_id": "112099021776856399741", "name": "Absalom Shreves", "time": 1546602725577, "rating": 5.0, "text": "This is a auto salvage", "pics": null, "resp": null, "gmap_id": "0x888ccfe2f11dbdd9:0x8478cf8d7f5e82d7"}
{"user_id": "113168101835623692112", "name": "mark mitchell", "time": 1511803722129, "rating": 5.0, "text": "Great place", "pics": null, "resp": null, "gmap_id": "0x888ccfe2f11dbdd9:0x8478cf8d7f5e82d7"}
{"user_id": "104963809872982897877", "name": "Lynn Grissom", "time": 1502189338059, "rating": 5.0, "text": "Fast, friendly service. Good deals also.", "pics": null, "resp": null, "gmap_id": "0x887d37a150d2476f:0xc7b1cecf827915cb"}
{"user_id": "104856911640464578203", "name": "Sherry Lacey", "time": 1555019941949, "rating": 4.0, "text": "Nice man, seems to be honest.", "pics": null, "resp": null, "gmap_id": "0x8888f86af9dcc299:0x5baf047df6146852"}
{"user_id": "109199990438253057078", "name": "Dave D", "time": 1624982393406, "rating": 5.0, "text": "Awesome dealership. I recently purchased a tow truck there and could not be happier with the service. There was a problem with the tow lights when I picked up the truck, so the owner sent me a brand new set in the mail. Could not be happier!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNO1Hf6X6ptMk_gw-DSdOU5RdN-JXg54z0bF7xq=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888bb3dd937cc977:0x16e68eb7e24d4133"}
{"user_id": "106514008664382734306", "name": "Peter Fox", "time": 1615853259920, "rating": 5.0, "text": "purchased a service truck through Ebay from them. Sight unseen. Truck was correctly represented and seller was honest.", "pics": null, "resp": null, "gmap_id": "0x888bb3dd937cc977:0x16e68eb7e24d4133"}
{"user_id": "109979638028676647874", "name": "john sprague", "time": 1609186505645, "rating": 5.0, "text": "Very nice people. Picked up a truck for sale. Came from California.  Very helpful. Would buy another from them", "pics": null, "resp": null, "gmap_id": "0x888bb3dd937cc977:0x16e68eb7e24d4133"}
{"user_id": "104361923940974605727", "name": "Courtney Seals", "time": 1589223158029, "rating": 5.0, "text": "I purchased a 2016 F250 from Adam and his team and this is by far my best experience ever. I arrived past my appointment time due to traffic and they were there still waiting with the truck cleaned and detailed. I have NEVER been allowed to test drive a vehicle without a salesperson he asked for a copy of my drivers license and handed me the keys. I drove home over 4.5 hours without any problems. Thank you again for the great experience. I recommend buying your next truck from Heavy Metal Automotive LLC.", "pics": null, "resp": null, "gmap_id": "0x888bb3dd937cc977:0x16e68eb7e24d4133"}
{"user_id": "107087112095747956641", "name": "Kelly Jorgenson", "time": 1593223457737, "rating": 5.0, "text": "I just purchased a 2014 Ford F450 from Adam and his team. Great people to do business with and they sell solid trucks at a great price. The morning I was to pick up the truck that was paid for in full the water pump started leaking. Adam has it replaced with OEM parts and had the truck ready to go before I got there. I then drive the truck 1800 miles home with zero issues. Heavy metal has your back! Adam says what he does and does what he says... a rear bread in truck dealers. I will purchase my next truck from Heavy Metal no questions!!! Thanks Adam!!!", "pics": null, "resp": null, "gmap_id": "0x888bb3dd937cc977:0x16e68eb7e24d4133"}
{"user_id": "114351922704979020367", "name": "Shane Jordan", "time": 1589041374142, "rating": 5.0, "text": "Bought a 2013 bucket from heavy metal automotive.  Adam made it super comfortable  and easy transaction.  All promises were kept had this delivered to my door in such an impressive time 1400miles away.   Truck was just as shown on all pictures and video.  Highly recommend.  Thank you again", "pics": null, "resp": null, "gmap_id": "0x888bb3dd937cc977:0x16e68eb7e24d4133"}
{"user_id": "105000970510223841215", "name": "Brad Meucci", "time": 1595250540491, "rating": 5.0, "text": "My company purchased a vehicle from this company and they were very response. They represented the vehicle accurately and made the process easy. Would not hesitate to purchase from them again.", "pics": null, "resp": null, "gmap_id": "0x888bb3dd937cc977:0x16e68eb7e24d4133"}
{"user_id": "107942345780330053938", "name": "Luis Albee", "time": 1594513381151, "rating": 5.0, "text": "I Bought a 2014 Chevy 3500 wrecker from heavy Metal.  They shipped it to me in Orlando, no issues, truck had high miles but drove out perfect and looks like a 20k mile truck.  Easiest car buying transaction I have had.", "pics": null, "resp": null, "gmap_id": "0x888bb3dd937cc977:0x16e68eb7e24d4133"}
{"user_id": "116341738331008418418", "name": "Andrew Maney", "time": 1575748037753, "rating": 5.0, "text": "Adam and his crew were great to do business with. Bought an 09 F-550 and everything was as described. Extremely pleased with his communication and how well they were able to explain all details even after we made the purchase. I’m a little over 250 miles and would do business with these guys again. Truck was clean and they go beyond making sure the truck is tip top shape when it arrives to you. Thank you guys very much!!", "pics": null, "resp": null, "gmap_id": "0x888bb3dd937cc977:0x16e68eb7e24d4133"}
{"user_id": "108896196047682315248", "name": "United Tank", "time": 1591203280827, "rating": 5.0, "text": "We purchased a 2012 F550 from Adam and his team.    I would highly recommend Heavy Metal Automotive and will be working with them in the future for other purchases!!!", "pics": null, "resp": null, "gmap_id": "0x888bb3dd937cc977:0x16e68eb7e24d4133"}
{"user_id": "101519149566878095120", "name": "Daniel Ingram", "time": 1595004065698, "rating": 5.0, "text": "bought a 2006 F-550 Maintainer crane truck from Adam, he shipped  it to me in Oklahoma.  Truck is better than I thought it would be and adam is a nice guy to deal with", "pics": null, "resp": null, "gmap_id": "0x888bb3dd937cc977:0x16e68eb7e24d4133"}
{"user_id": "114007601089647233115", "name": "Aaron Leighton", "time": 1584463480424, "rating": 5.0, "text": "Picked up a 2009 Ram 5500 bucket truck from them, drove it back to WV 520 miles without an issue.  We will look to them for our next truck.", "pics": null, "resp": null, "gmap_id": "0x888bb3dd937cc977:0x16e68eb7e24d4133"}
{"user_id": "116347063297590688361", "name": "hannah knecht", "time": 1564234692005, "rating": 5.0, "text": "Heavy metal auto is who you want to call! Very polite, helpful, and knowledgeable people! Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x888bb3dd937cc977:0x16e68eb7e24d4133"}
{"user_id": "111329689907573110918", "name": "Sky star Towing", "time": 1594038776817, "rating": 1.0, "text": "The most stupid people I never ever see is this a place nobody go  there ...they are stupid", "pics": null, "resp": {"time": 1594042579898, "text": "I have no idea what you are talking about.  We have never sold you a truck or had any business dealings with you."}, "gmap_id": "0x888bb3dd937cc977:0x16e68eb7e24d4133"}
{"user_id": "105055239172792813888", "name": "Kevin Word", "time": 1619987707426, "rating": 5.0, "text": "Very friendly", "pics": null, "resp": null, "gmap_id": "0x888bb3dd937cc977:0x16e68eb7e24d4133"}
{"user_id": "110194001737531604610", "name": "Sean OBryan", "time": 1571070624050, "rating": 1.0, "text": "Tried to charge me $500 for not buying, was in a car accident in Nashville and had to back out.", "pics": null, "resp": {"time": 1574281755046, "text": "Yes, we did.  You bought a truck from us on eBay costing us $500 in eBay fees and never followed through with the transaction.  It still cost us $500 in fees no matter what happened to you.  You owe us that money and still do."}, "gmap_id": "0x888bb3dd937cc977:0x16e68eb7e24d4133"}
{"user_id": "114003948092190464569", "name": "Trevor G", "time": 1573781681154, "rating": 1.0, "text": "If I could give a negative feed back I would, we bought a bucket truck from heavy metal automotive and when it got here a week late it rolled off the trailer with 3 flat tires, tensioner was shot, water pump was shot, fuel filter was clogged up and it had a check engine light for camshaft position aculator, the air filter was TERRIBLE, and there was a 12” piece of pipe laying in the fan shroud, and the only thing the owner had to say was sorry about your luck", "pics": null, "resp": {"time": 1574282327751, "text": "The truck was in perfect condition when it left here.  If we had known about a bad water pump we would of replaced it, it's an hour job at most.  Putting air in 3 tires takes around 3 minutes.  You called me cussing acting like a complete fool.  We always help our customers if they have an issue, which most never do, but you went about it the wrong way.  Calling using foul language gets you no where with me.  I know for a fact the fuel filter in the truck is brand new, I replaced it myself so you can stop making up lies.  Yes, it takes 5-7 days for a truck arrive 1400 miles away, not sure what you expect.  Good luck with the truck and next time maybe you should watch how you talk to people."}, "gmap_id": "0x888bb3dd937cc977:0x16e68eb7e24d4133"}
{"user_id": "111103955781039557365", "name": "Perry Baxter", "time": 1547680437455, "rating": 5.0, "text": "Nice people to do business with  and friendly to", "pics": null, "resp": null, "gmap_id": "0x888bb3dd937cc977:0x16e68eb7e24d4133"}
{"user_id": "117499103897057007638", "name": "Kenneth Langley", "time": 1575036771308, "rating": 5.0, "text": "bought a 12 f550, everything as described.", "pics": null, "resp": null, "gmap_id": "0x888bb3dd937cc977:0x16e68eb7e24d4133"}
{"user_id": "109809219243406337745", "name": "Aaron Ryals", "time": 1622663842110, "rating": 1.0, "text": "I purchased a brand new vehicle from them April 29th. The service until the sell was made was nothing short of phenomenal. However, it ended there. It’s now been 5 weeks and they still haven’t sent my paperwork to my county for me to be able to purchase my tag. My wife and I have called multiple times and we get the same response. We will check and call you back. Guess what....no one ever calls back. I’m completely frustrated and have received warnings for no tag, so I now have a vehicle I can’t drive because I’m way beyond my 10 business days to have a tag. I recommend you shop somewhere else. I should have paid more and purchased local.", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "103643880705458625580", "name": "Mohammed ALKhateeb", "time": 1566228498704, "rating": 5.0, "text": "Love the service,  love the cars and every one friendly!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPGNSagluv3B0py9ba374ECBVjh2WjRFNms_GsT=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPLHHSLDxm--rj8gu1OZYQ9B-kqLsoOJvJmxD4R=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipORG4t2XEgn6iwGSZTaxjlhcvqymMyQe2Xsq_9w=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPO3537SBa-Y4jINW52ZQLAH99tlgeOGuQk4QMk=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN6P643pEh4ksSQQqGXar9DVUtOY9k0HIWbK3Mz=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMO-hT2rfYRMHyojBy_6KClVzpN8nJUcFCb_2U-=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP8LlGv8e2ivXQVD2wFzMXXiLrMj817I7wxGdPr=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO34JlC5eDbaROhjOX7pDxmqHZupV7e-lzAryJ2=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO8kZa1WSm0ZzNyqxmUAkkv9TMGcxmYLRK3PU19=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPF-sEq8o4dOOmqVlnCKvq-OSs7XOzPuOzy_wFm=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPktPk9rfr2h6iRVOrvWEBDslOZHf4mjB91WnoO=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPvYsbCdwDYJ7mEw-3ooTtZIrtTTkrjb5yd91rq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPukTgf92LBvLdOn2NE3IHbU0Fn-7szLpyaby1Z=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM6kdqxWQNSY3u7Dq8DsVL0lY6DmZLt5e6xG8iC=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPgr39CMJJeEuL9v4KcqaCI7U3PZxdSvRAp0SSZ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMPV0AJxZplSuhveGhMyu2yoFiVyJ9UOWyVKvwv=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOUr0L9lBTfeXbtol8IcEHjhL-be-iNIhx6bjdn=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "103260395814886110077", "name": "tina morgan", "time": 1611303509902, "rating": 5.0, "text": "We purchased a renegade from Mikail. He was very helpful and made it a very easy purchase.\nThe entire staff also made us feel welcome which we’ve had bad experiences at other dealerships. We will definitely buy from them again! Thank you Mikail!", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "114088601662358558592", "name": "A. Mck80", "time": 1601005817254, "rating": 5.0, "text": "My experience at Autonation was awesome. My service advisor was Jason Williams and he saw to it that I had awesome service. Not only did he greet me when I drove up to the service center, but he made sure I had beverages to drink, he checked in with frequently to keep me informed of the progress they were making on automobile, and he saw to it that I received the services I requested and I received them in a timely manner. He was absolutely awesome and I will come back again.", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "109010587275348180074", "name": "LaToya B", "time": 1609288124548, "rating": 1.0, "text": "This place was the absolute worse place I ever been to for car repair service. They were very unprofessional. They lied to me and told me my services would be covered under warranty. They said they called and then told me later warranty was not covering. My car went into the shop running and was there for 3 weeks. When I tried to go get it now they are saying it needs a whole new motor. It was so many levels to this, but I would never in my life ever buy a Dodge and I will never go to that dealership again. Everyone that work there is a complete joke.", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "112501161740577665276", "name": "Christopher Peters", "time": 1616507174889, "rating": 1.0, "text": "They have trouble wearing masks correctly. Also, the Service department treats customers like an after thought.", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "110114069376592249940", "name": "jan vickers", "time": 1605465653952, "rating": 5.0, "text": "automation is awesome! they bought my vehicle and found the exact suv I wanted!! Alexis was so sweet, and oh so helpful!", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "115159256303770865678", "name": "Jackie Camp", "time": 1579789971143, "rating": 5.0, "text": "When my 2014 Chrysler 200 needs service I take it to AutoNation because they are professional and they check everything to make sure no issues arise.  When it's going to be a long wait they come and let you know were they are on each step of repair.  They always have coffee and water if needed.  They also check on recall parts so you want have to come back they fix it doing your service visit.  They always offer other discounts on oil changes, tires and other necessities.  I wouldn't take my Chrysler anywhere else.", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "106442394310097873805", "name": "Matt Montenegro", "time": 1592348044435, "rating": 1.0, "text": "Some of the most sleezy people that give all car sales men a bad name. Purchased a used vehicle from this dealership in May of 2020. I was sold when I was told that my vehicle had an Auto Nation warranty of \"90 days or 4,000 miles.\" Sounds great doesn't it? Well after being hurried along in signing paperwork so the vehicle could be mine I was very happy with my purchase. However, less than a month later, and still well within my \"warranty\" coverage period I got a Christmas tree of lights on my dashboard. I was told to take it to its dealership and from there I could then make the claim. When I called to make the claim, Auto Nation's warranty service said there was no vehicle with my VIN in the system. I then called the manager there who told me, \"I never signed any contract stating I had a warranty and it doesn't matter what I was told because it isn't in writing.\" I realized the manager was right about this however, I was being told one thing then they intentionally rushed me through signing paperwork so that I wouldn't catch that I never signed anything for my \"warranty\". The deceptive methods of these people shows that they are talented at one thing and, one thing only and, that is lying to people. These people are clearly slimy and cannot be trusted, save yourself the hassle and do not purchase a vehicle from here. Learn from my mistake, don't come here. Where ever you do go, whatever you are offered make sure it is in writing!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "103877613261822060734", "name": "William Mott", "time": 1588350532868, "rating": 5.0, "text": "The two service advisors I usually deal with are Michael Robinson and Ken Baker; they are always friendly and helpful. I dropped off my truck for service (oil change, tire rotation, etc.) and Ken Baker called back to notify me that my vehicle was ready. As far I know, the work was done satisfactorily.", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "116369959805758920975", "name": "Charles Bailey", "time": 1588938335324, "rating": 5.0, "text": "I’ve never had any problems with them. Good quality work on time. They’ll tell you if something else needs to be looked at.", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "108716683244683500404", "name": "Samantha Stefan", "time": 1589464165982, "rating": 5.0, "text": "I have purchased 3 Vehicles from this Dealership with my Husband and have had the same salesman Austyn ! He is Humble and Honest and that means a lot these days when purchasing a vehicle. They met my expectations and we will continue to buy from here as long as he is there. The best experiences I have ever had at any Dealership and I have bought many vehicles in my lifetime!!! Thank you Austyn you Rock !!!", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "100114600493466189981", "name": "Alfonso Packer", "time": 1582120962665, "rating": 1.0, "text": "Consumer service was very poor. Upon arrival to pick up my car after recall work I had to stand in the lobby for 20mins before I was even acknowledged to get help. Then the service guy who said he had my paper so he would him me continued a phone call for an additional 30 mins. It didn’t bother me until I heard the conversation, which seemed personal not AutoNation business related, so I decided to go to parts while I waited to get so things. That department was great. After finishing up he still was on phone so I went to someone else to see if I could be helped then he decided to pull up my paperwork and noticed it was a recall job and only need a signature and to hand me my keys. I will never probably use the service department if that was a example of the customer service to expect.", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "106501365821899530787", "name": "Richard Dodson", "time": 1590594935268, "rating": 5.0, "text": "Had some warranty work done on my 2019 Ram 1500. Troy was very knowledgeable of what needed to be done, and the service technicians did a great with the small issues that had, andchad my truck ready to go in a timely manner. Great job Autonation team.", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "110371709193320215603", "name": "Ms. Kay", "time": 1574772827717, "rating": 5.0, "text": "Great service team. Ken was extremely patient throughout the journey. I experienced some flood damage in September 2019 that required major repairs to include a rental for a few weeks. Updates were offered and a complete thorough summary of what was serviced. Ken and the team wereprofessional. My vehicle was as showroom ready as the day I purchased it from them. Roll Tide.", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "102099670725834967750", "name": "Daijha Doss", "time": 1583878663453, "rating": 1.0, "text": "NONE of my experiences at autonation have been pleasant. I’m either here all day or have to leave my car for days at a time because they can’t seem to do their jobs. My car was there for 2 days just to get the battery changed (I kid you not). Now I’m waiting on a part for my car and dear lord you would think they had to actually build the part themselves. I’ve been told 3 different stories about this part. I’ve had my car for almost 4 years now and EVERY SINGLE TIME I’m in there someone is upset about how they run this place. Now I’m that someone. Thanks for nothing Autonation. Keep up the good work.", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "103233592136663931484", "name": "Rick McNeill", "time": 1589828281514, "rating": 5.0, "text": "I have dealt with Tommy Johnson on multiple occasions and he has always been courteous and professional.", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "112485851051086642945", "name": "Amir Sahori", "time": 1583419448360, "rating": 1.0, "text": "Very unprofessional staff. 7 hour oil change while I was stuck at the mall. No service or anyone to help get me anywhere. Was given a call 20 min before closing time and said that my ride was ready, got there 40 min later due to traffic and they said they closed. So honestly never doing business with this dealership ever again. I suggest everyone get oil changes at Honda rather than this dealership... buy your cars somewhere else, the bad service outweighs the quality of their trucks.", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "117305014874899298759", "name": "Samuel Alston IV", "time": 1582985784641, "rating": 5.0, "text": "I was completely satisfied with the Service Advisor, Mike Robinson’s eagerness and prompt service to my problem. I definitely enjoyed the awesome service. I will recommend him to friends and colleagues. Also, Autonation as somewhere to go for all their car related needs.", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "112268447847373436433", "name": "Janet Wright", "time": 1586200055646, "rating": 5.0, "text": "Great company, great atmosphere, and it was awesome working with Chris and Austin\nThey made us feel at easy and comfortable\nMy husband and I would definitely do business with this company again\nThanks guys", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "109949844808315351934", "name": "Natalia Hornbuckle", "time": 1576245864760, "rating": 5.0, "text": "Great experience from beginning to end!!! Salesman (Sondra) not overbearing, very professional, cordial and kind. Ralph in Finance great personality. Wonderful experience.", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "115074574149138348332", "name": "Scott Boyd", "time": 1589320171226, "rating": 5.0, "text": "The staff there worked out a great deal for me on my purchase of a 2020 Jeep Wrangler Unlimited Rubicon.", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "107794496310024231805", "name": "Dana Adcock", "time": 1569736078126, "rating": 2.0, "text": "10 years ago we bought a new Jeep Grand Cherokee.   No one has ever touched this car but Auto Nation.  A couple months age my husband took the car in for repair.  A new condenser had to be installed.  After the work was completed, when we picked the car up, the dash lights were out.   We were told there would be an additional $300 or more to fix it.  This was very shabby business as it was fine before the work was done.   I’ve had a couple of issues with this establishment but let it go but this is going to far to expect us to pay for something that was broken while a very expensive repair was being done on the car.", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "118360361705598392519", "name": "Daniel Eisrnhard", "time": 1579927144130, "rating": 5.0, "text": "Sid was very helpful throughout the whole process of repairing my wife’s vehicle through the extended warranty.  He spent time on the phone dealing with my warranty company and when it came time he even drove me in his own vehicle to the rental company.", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "103384736436147990182", "name": "Diane Krause", "time": 1569278265445, "rating": 3.0, "text": "I took my car in for repair of the power adjustment on the driver seat. The service rep who took care of me made the scheduling and check-in nice and easy and arranged for the shuttle service to take me home. I was disappointed that the AutoNation website didn't allow me to schedule an appointment for repairs online (only maintenance services could be done online). I got a diagnosis and repair quote within a day, but word that it would take a week to get the part in. It turned out to be an additional day for the part to arrive, and I was told the car would be done the following day, but  it took two more days for it to get done. We came from the Houston area where we were used to parts being accessible more quickly, so this wait time may be normal for the Mobile area. The pickup experience was a bit frustrating. I picked up on a Saturday and waited 1 hour 15 minutes to get checked out (was told the car was ready but paperwork had to be done). The service rep kept getting pulled away by walk-ins, phone calls, and I'm not sure what else, but it seemed I kept getting bumped to the back of the line. There may have been more legitimate reasons for the long wait time, but those weren't shared with me. Everyone was nice and helpful, and my car was repaired, but the wait times were a bit disappointing.", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "113879616302866266742", "name": "And P", "time": 1596038412663, "rating": 1.0, "text": "Parts department is a joke. Spent 10 minutes going in circles trying to reach someone there. Eventually just hangup.", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "111251877834781657562", "name": "Cinde Pocase", "time": 1581628841546, "rating": 5.0, "text": "I recently had a recall taken care of on my Jeep Renegade at Auto Nation Jeep in Mobile.  Troy took care of setting up my appointment and getting the repair done. They always do a great job there and take care of me and my car.", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "108378319832959603926", "name": "Darla Wheeler", "time": 1573512549878, "rating": 5.0, "text": "Awesome experience!!! Austyn Long gave us great service. We are very happy with our purchase and will be going there if we need anything in the future.", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "114436130127701282790", "name": "Michael Harris", "time": 1584022335234, "rating": 3.0, "text": "Service was good Michael was good at explaining what I needed. Not sure if I needed all of what I got,but overall I was satisfied.", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "111704146875443078490", "name": "Mr. A.D.", "time": 1585744085872, "rating": 5.0, "text": "Ron did a awsome job getting me in and out fast. He also explained a lot of things I didn't know that I could get for my vehicle.", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "118428096489468065193", "name": "Clausell Huff", "time": 1588118290034, "rating": 5.0, "text": "GREAT SERVICE VERY CLEAN QUALITY VALUE GREAT. THANK YOU", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "104701687704137683646", "name": "Will Powell", "time": 1569440392105, "rating": 2.0, "text": "Shamarcus Mack did his job well as the salesman and was very helpful and friendly. I recommend him completely but AutoNation as a whole, not so much. I bought a car from there on August 26th. I paid cash and was told that I would have the paperwork for the title and so I could get my tag, in about 10 days but to allow 20. It’s weird to me that I didn’t get the title that day but now it has been a month and I still don’t have the paperwork. I’m still driving around with no tag, just the temp tag.", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "112988026595971636137", "name": "John Boy Gordon", "time": 1609958831469, "rating": 5.0, "text": "I WORK THERE", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "102206542054031740698", "name": "Scott Ford", "time": 1571343972063, "rating": 5.0, "text": "I drove about an hour away from home to sell my car to Autonation because they were willing to give me substantially more than other car buying services.  To be realistic the price was still under the book value for the vehicle, but no messing around, just a reliable sale.  I would say from the time I drove in to the time I left with a check was less than an hour and they gave me 50% more than what Carmax offered.  Karen in the online department was great to sit with while the service guys did a quick inspection and prepared the paperwork and check.  If you're looking to sell a vehicle and don't want to mess with CL or haggle with another dealer, autonation was great for me.", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "104941597333729390873", "name": "Tomecia Watts", "time": 1569244643714, "rating": 5.0, "text": "I had the best experience ever. I went in to purchase one vehicle and walked out with 2 new vehicles. I'm very excited about my purchases and I would highly reccomend my salesperson Mykel. Charlie also made the experience  wonderful as well.", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "114737155905222204905", "name": "ADDIE LAWSON", "time": 1567086734619, "rating": 5.0, "text": "I love this place!  I have a 2018 Jeep Wrangler and I took it in for service early in the morning.  I had questions on the transmission and they checked that too.  Wonderful service department!", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "108130651998146329037", "name": "Dwayne Bartley", "time": 1574168504572, "rating": 4.0, "text": "Great service fast and reliable.  Wide selection of vehicles. Had to take a star off because they dont have the slushy machine no more. Bring it back.", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "103919665466459275089", "name": "NinjaSky012", "time": 1580175796925, "rating": 5.0, "text": "The customer service is fantastic, I bought my car from there last year with the gold warranty & everything has been awesome. A++++", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "114747131724542658680", "name": "Mark Maxwell", "time": 1566482573618, "rating": 5.0, "text": "The staff were great and answered all our questions. Our sales person, Austyyn, was professional, friendly and never pushy.  If you are looking for a vehicle, I would absolutely recommend AutoNation Chrysler Dodge Jeep Ram Mobile.", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "103919665466459275089", "name": "NinjaSky012", "time": 1580175796925, "rating": 5.0, "text": "The customer service is fantastic, I bought my car from there last year with the gold warranty & everything has been awesome. A++++", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "100740794872886868466", "name": "Chloey Williams", "time": 1579581492504, "rating": 5.0, "text": "Kel really helped us out and made our experience wonderful!", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "117283880878713518409", "name": "Frantrice Caine", "time": 1571440339616, "rating": 5.0, "text": "Mike Cejka at Autonation helped me tremendously! I came into Autonation with a very bad feeling of being taken advantage of bc i am a female, but after 2 tries and 4 days Mike made sure to get everything handled and me satisfied. Not sure if I'd give Autonation a thumbs up BUT I'd definitely give Mr. Cejka 2 thumbs up..", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "117364214446655800460", "name": "Jeremy Davis", "time": 1569951435410, "rating": 5.0, "text": "AutoNation made buying my Jeep quick and easy! They take the pain and dread out of buying a vehicle. I would highly recommend them to anyone!", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "105180150501868344035", "name": "Malcolm McLellan", "time": 1567728002281, "rating": 5.0, "text": "The service representative was extremely professional and patient. Superb customer service!", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "108794389108809684667", "name": "Tommy Johnson", "time": 1573321761993, "rating": 5.0, "text": "Talk to Troy or Ron and you will have the best service experience in mobile", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "105543098899896177560", "name": "Dynasti Greene", "time": 1541887631405, "rating": 5.0, "text": "I just purchased my first car from AutoNation and I have to say Mikail did an excellent job. Quick, fast, and simple. It was truly a unique experience. He managed to get me a 2017 Chevy Cruze when I was afraid I wasn't going to be approved for a car let alone a new one. Go to him with all your vehicle needs.", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "103720673149265358102", "name": "Mauryce Thomas", "time": 1590100025143, "rating": 5.0, "text": "Good Service by Mike on 2018 Dodge Ram for M. Griffin", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "100304633068047684855", "name": "Sean Patrick", "time": 1571771604768, "rating": 4.0, "text": "Everyone there, was extremely nice,, Tommy is a great salesman in my book, .", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "107774546089580605051", "name": "CHELSEA DUNNEL", "time": 1556020241588, "rating": 1.0, "text": "I agree with dominic they never answer the phone.  Horrible customer service", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "113067258157645984316", "name": "Bigpoppy 0331", "time": 1572289037311, "rating": 5.0, "text": "Only rating this a 5 because of Ken in the service department he is very friendly ... but overall this place needs to get it together.  Trying to get someone on the phone is damn near impossible especially if it almost quitting  time.   They forgot to put the cap back on my car from the oil chase and almost caught fire.", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "112205841987393502845", "name": "Michael Ramage", "time": 1579788965932, "rating": 5.0, "text": "Fast service! Friendly folks!!", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "110147517782233911454", "name": "Dominic Morrissette", "time": 1553710797021, "rating": 1.0, "text": "The service department is very rude and wont answer the phone", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "108418602284445425188", "name": "Will Payne", "time": 1574858103497, "rating": 5.0, "text": "Great place did exactly what I needed", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "117383710447225643333", "name": "Paul Vickers", "time": 1595102334533, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "103096630688154945986", "name": "Yolanda Curry", "time": 1584189068056, "rating": 5.0, "text": "Everyone was nice and very helpful", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "113898480451163400951", "name": "Chris Heth", "time": 1564267144313, "rating": 2.0, "text": "Dont know yet haven't received final bill.", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "117443490900556437091", "name": "M&K 4 Life", "time": 1565726098446, "rating": 2.0, "text": "They are slow as hell. They don't answer their phones you call and call.", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "105423442492122219039", "name": "Alan Baker", "time": 1584619328580, "rating": 5.0, "text": "Very satisfied", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "105551474018198168466", "name": "Constance Martin", "time": 1582686133470, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "105423442492122219039", "name": "Alan Baker", "time": 1584619328580, "rating": 5.0, "text": "Very satisfied", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "108826433448218013494", "name": "Aaron Riggins", "time": 1574200898586, "rating": 1.0, "text": "Bad management", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "109362059914036195126", "name": "mario tunstall", "time": 1574390596157, "rating": 5.0, "text": "Thanks for the service", "pics": null, "resp": null, "gmap_id": "0x889a4dad79f7ce2f:0x315d0851bfaa041e"}
{"user_id": "116231530247552932569", "name": "Allan Zbrhodeski", "time": 1619136622844, "rating": 4.0, "text": "The shop crew and service crew were great to work with. I'm a trucker and my delivery to this business, and their employees were very friendly and showed me their hospitality.", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "110834611128900944515", "name": "Chelsea Truett", "time": 1620604196761, "rating": 1.0, "text": "Service center is horrible! Brought our bike in... they had it for 5 months & didn’t do anything. Had it totally taken apart. Called all the time & they blamed it on Covid & problems getting calls back from the dealer & the parts places. Then blamed many other situations. We finally just picked it up because nothing was done. Will never go here again & wouldn’t recommend their service department. Unprofessional & communication is beyond horrible. We know now why it was the only shop in the area that didn’t have a wait list for servicing.", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "110560748610376698628", "name": "Chad Kidd", "time": 1597916473419, "rating": 2.0, "text": "I took a four-wheeler to get the carburetor fixed and also have the oil changed. They did not call and give me a quote ,would also not return a phone call. And they did not even bother to call and tell me that it had been done for a couple weeks. They did not change the oil they charged me $75 for it. Before I left the parking lot I went back inside to tell them the oil had not been changed. . The salesperson took it around back I waited about 30 minutes at least he said it was done I put it on the floor went home when I got home I checked it again and it still has not been changed. If you take something there you will have to be on top of what you paid for and will make sure that they changed the parts.", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "103780447254053301628", "name": "David Solar", "time": 1602363556872, "rating": 5.0, "text": "Very helpful folks. Definitely will be back.", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "111080985043202816341", "name": "Claudia Harlow", "time": 1602168222787, "rating": 5.0, "text": "Great place to do business. I took my Honda Goldmine  in for a running problem and they had me fixed up in no time!", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "105338676116576155643", "name": "Diane Feltner", "time": 1597791787160, "rating": 5.0, "text": "It was ok\nMan in parts was very nice and helpful.", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "113301103102781770215", "name": "donald jackson", "time": 1590256816022, "rating": 1.0, "text": "Horrible service dropped a jet ski off 1 year ago for carbs rebuild pick it up after no communication and now it won't run at all. I would never recommend this place not even to my worst enemy", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "107198297020398312835", "name": "Dewayne Childress", "time": 1617913758327, "rating": 2.0, "text": "The labor price was high.", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "104936410145483423068", "name": "Keith Serafin", "time": 1605395201657, "rating": 2.0, "text": "Cant order anything worth a dam and took forever...", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "117548081770748210613", "name": "Brandon gowan", "time": 1590522918455, "rating": 5.0, "text": "Best deals around and are a pleasure to do business with", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "104252508875875812086", "name": "Eddie Noblitt", "time": 1569513552993, "rating": 5.0, "text": "Great place, very nice folks there to help u with whatever u are looking for. Parts department and salesman very nice willing to help you and gives u good sound advice that will help u with whatever your looking for", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "101627771721430522608", "name": "Alpha and Omega The Creator", "time": 1595529565420, "rating": 5.0, "text": "The employees that run the place will go over and beyond to help their customer.", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "105375926808069436023", "name": "Ric Smith", "time": 1575589235294, "rating": 4.0, "text": "Great location, decent selection and friendly people.", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "116395009032996213719", "name": "Melinda Ridgeway", "time": 1518305531537, "rating": 5.0, "text": "I love this place. Great people working there and will help you until you find what you need. Thank you for helping me today.", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "108300197777795022408", "name": "Jonny Ball", "time": 1580589393825, "rating": 5.0, "text": "Got all my bike fluid change stuff looked at guns and bikes. What more would you need.", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "100452182739544049616", "name": "rs1960Sryan rs1960", "time": 1604180783725, "rating": 1.0, "text": "Not helpful at all.", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "110226651886038127744", "name": "Harold S", "time": 1558827282042, "rating": 5.0, "text": "Great place to shop in Guntersville.  Right close to the lake on 431 and a wide selection", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "112268808492054646719", "name": "Josh Harbin", "time": 1551999722832, "rating": 1.0, "text": "Went in for a throttle cable replacement instead they destroyed my bike! They put selftapping screws in my handle when that happened it cut my wires so now no turn signal or anything! I called 2 days in and I was told that they would call me back well noone did so i called the next day I was told that they will call me back well guess what didn't happen so i showed up with My trailer to get My bike and they were closed at 5:30 online it says 6. Then on day 7 I show up to get it and accordingly my tank leaked out all of the gas and the parts guy told me it was like that when i brought it in \"yea right\" it was full when I started to argue they went and put gas in it and said that they did it by accident that it leaked out during the night. I brought it in to them and the parts man told me 1-2 days instead it took them 7 days! I will never use this buisness again and I would not recommend this business to my worst enemy they will rip you off and lie to your face worst place in town!", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "112268808492054646719", "name": "Josh Harbin", "time": 1551999722832, "rating": 1.0, "text": "Went in for a throttle cable replacement instead they destroyed my bike! They put selftapping screws in my handle when that happened it cut my wires so now no turn signal or anything! I called 2 days in and I was told that they would call me back well noone did so i called the next day I was told that they will call me back well guess what didn't happen so i showed up with My trailer to get My bike and they were closed at 5:30 online it says 6. Then on day 7 I show up to get it and accordingly my tank leaked out all of the gas and the parts guy told me it was like that when i brought it in \"yea right\" it was full when I started to argue they went and put gas in it and said that they did it by accident that it leaked out during the night. I brought it in to them and the parts man told me 1-2 days instead it took them 7 days! I will never use this buisness again and I would not recommend this business to my worst enemy they will rip you off and lie to your face worst place in town!", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "109366510783772555980", "name": "james allen", "time": 1555146042074, "rating": 2.0, "text": "i had lgps do routine valve adjustment on my running yz 250 f  they called and said it had no compression and did i want thrm to tear it down. i han to take my tools and show them they put the wrong shims in one intake valve ...zero clearance.  but they did re work it and got it right.   i also had new tires put on my kx rims  the rear one was flat when i got home with it. pleeeease dont train people on my stuff", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "114670722279220675821", "name": "Phillip Lassetter", "time": 1533828831886, "rating": 5.0, "text": "Great place to buy from. Very friendly and with a professional attitude, unlike other stores.", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "113515118713028078462", "name": "Giorgio Torregrosa", "time": 1600641136870, "rating": 5.0, "text": "Excellent staff", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "111021109176115170460", "name": "adam st john", "time": 1501732138302, "rating": 3.0, "text": "Was looking for a helmet. Owner was helpful. Not much variety. But he did offer to order one. Unfortunately, I needed it then.", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "109875054185035666833", "name": "Crystal Ball", "time": 1513920005370, "rating": 5.0, "text": "My husband loves this place. Just bought a Harley fat boy, beautiful and like brand new, very reasonable price, I recommend checking this place out before making a purchase on leather, 4 wheelers, bikes, and even guns here too.", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "115575007253537774083", "name": "Larry Lambert", "time": 1569956003215, "rating": 5.0, "text": "Good place to do business HELPFUL", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "103147005064372166729", "name": "C W", "time": 1548968812123, "rating": 5.0, "text": "Excellent customer service and motorcycle maintenance staff.", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "107145427254432435542", "name": "Bill Stone", "time": 1561852531761, "rating": 5.0, "text": "Great\n\nWe pitched a new jet ski", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "105481227605912995764", "name": "ben-jam-in", "time": 1534592893823, "rating": 4.0, "text": "Only one experience here but it all went well. I had to buy a friend's young son a bday present that would complement the newly acquired dirt bike he was also getting on his bday and I forgot until only a couple days in advance. I rushed to this shop and even though they do more street driven power sports equipment and big side by side's for adults, they still had a cool pair of mx riding gloves for a young kid that even matched his new dirt bike.    It's located in a convenient location right on hwy 431 and not far from the gap going off Sand Mountain into Guntersville.", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "105931572962626369800", "name": "kenneth mote jr", "time": 1560534118629, "rating": 1.0, "text": "I will not be back!! It seems they had rather talk on the phone then deal with the person standing right in front of them.  Cut me off mid question to answer the phone.", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "110846326641618435109", "name": "J G", "time": 1459121590335, "rating": 1.0, "text": "Although they fixed the leaking rear seal, it took them 2 weeks to do it and my bike came with a cracked fender. Of course \"they didn't do it\" because, in 8 hours they reviewed 80 hours worth of video??? BS. I know it wasn't cracked before it went in because we had just removed the rear seat & saddle bags to detail the bike and that was when we discovered the leak. No apology, no offer to repair. Go to All Pro Powersports in Huntsville or Smith Bros on Oneonta. Both are worth the drive!", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "112369494022481508646", "name": "Arlen Moore", "time": 1525907505361, "rating": 4.0, "text": "The guys are knowledgeable and helpful. They take care of me and my bike very well", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "108045185118075031787", "name": "Ryan Prince", "time": 1518232672010, "rating": 5.0, "text": "Nice workers very helpful. Great bikes.(ask to see bikes for sale in garage in the back)", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "107629011638201458775", "name": "Todd Smith", "time": 1507246055705, "rating": 5.0, "text": "Scott and Lonnie take care of business.  If you want something for nothing though or are a snowflake that gets offended by the blue sky, shop elsewhere.  This is my kind of bike shop.  And they sell guns too.  I've bought three here!", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "106617057236006014190", "name": "mass mayhem", "time": 1491764072274, "rating": 1.0, "text": "This is the place to go if you want to be ripped off. Such a great place to throw dollar bills away. If you don't like money and have plenty of it, go to Lake Guntersville Power Sports.", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "114067156370948967115", "name": "jeromy johnson", "time": 1540057831376, "rating": 5.0, "text": "Nice staff. Nice atvs and bikes.", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "103644860606454523726", "name": "Cody Spencer", "time": 1479244446423, "rating": 1.0, "text": "I have been to power sport many times in the past. today i got my tires changed for my dirt bike. So I brought in the new tired and old set had to wait almost all day and was charged hundred two dollars. I race go through alot of tires never before have I been ripped off that bad. Let's hope I do not get flat first time out. Never again will I go there horrible customer service.", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "112327901503403682457", "name": "Kristin Watson", "time": 1509984012990, "rating": 5.0, "text": "When we go there for parts the staff is always helpful, friendly even if your not buying a lot like some other dealers treat you if you're not buying a 20,000 bike.  If they can't get it, they'll find out where you can.", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "115175812192679463690", "name": "Catfishing 918", "time": 1601492864232, "rating": 5.0, "text": "Awesome!", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "111256510786455772991", "name": "Tracy vandergriff", "time": 1571589251206, "rating": 1.0, "text": "Bought 2 from them, will never go back !\nBad service dept", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "116316273995988001110", "name": "Darrell Moats", "time": 1517995741165, "rating": 2.0, "text": "Not impressed with the place. Went in to buy a helmet for a young kid. Noone come over to help. After about 15 min I went over to employee and asked where kids helmets were. He more or lesd pointed and told me \" over there against the wall\" and walked off.", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "107498854211682232032", "name": "Isa Hl", "time": 1577314633569, "rating": 1.0, "text": "Took my bike in for a gas tank repair and it took months to be halfway ready to expensive they charge u for the tools they use too that's ridiculous never go back again,  wish i knew that before, ill not recommend this place they was juts keep telling me the next week, the next week be ready and so on", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "116186309090340318827", "name": "ursula roberts", "time": 1494379774965, "rating": 5.0, "text": "Do a great job and have Kool stuff too", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "118162757685516979897", "name": "Buck S", "time": 1498763427890, "rating": 1.0, "text": "Bad service and shady people. If I was you id find a better place to go.", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "110138612947778820243", "name": "Johnny Payne", "time": 1558311935130, "rating": 5.0, "text": "Great Service", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "107358002313911599602", "name": "allen Henry", "time": 1556843065774, "rating": 5.0, "text": "good place to a bike", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "107815783436507278508", "name": "Rick Jackson", "time": 1538864783147, "rating": 5.0, "text": "Nice clean place", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "111730142203531684045", "name": "Wolf Venable", "time": 1511624384491, "rating": 5.0, "text": "Friendly staff. Competitive prices.", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "108827779058964995114", "name": "Chris Breezy", "time": 1568488526838, "rating": 5.0, "text": "Very helpful!!!", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "107530362360410977468", "name": "Lee Engle", "time": 1554239258497, "rating": 5.0, "text": "Nice bike shop", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "116045179498483789227", "name": "Diane Gomillion", "time": 1502938518673, "rating": 5.0, "text": "A really good place", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "101626896018552102583", "name": "Johnny Corbin", "time": 1546021101644, "rating": 3.0, "text": "Real friendly people", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "107815783436507278508", "name": "Rick Jackson", "time": 1538864783147, "rating": 5.0, "text": "Nice clean place", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "107284626173831665125", "name": "Ivan Westmoreland", "time": 1492259175320, "rating": 5.0, "text": "Very good sales and service", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "110138612947778820243", "name": "Johnny Payne", "time": 1558311935130, "rating": 5.0, "text": "Great Service", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "117391711394834256794", "name": "Deserae Taylor", "time": 1498941575994, "rating": 1.0, "text": "Snooty!! Rude!! Very unwelcoming!! We are looking to get a side by side or 4 wheeler... WILL NOT BE BUYING IT FROM HERE!!", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "108827779058964995114", "name": "Chris Breezy", "time": 1568488526838, "rating": 5.0, "text": "Very helpful!!!", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "103668344972951388322", "name": "Chris Kitchens", "time": 1520953351825, "rating": 4.0, "text": "Good variety", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "117084776151340922860", "name": "Divell Bell", "time": 1501705578279, "rating": 4.0, "text": "Nice people", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "105516641528133519346", "name": "Michael Bowman", "time": 1500489279772, "rating": 4.0, "text": "Good service", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "117391711394834256794", "name": "Deserae Taylor", "time": 1498941575994, "rating": 1.0, "text": "Snooty!! Rude!! Very unwelcoming!! We are looking to get a side by side or 4 wheeler... WILL NOT BE BUYING IT FROM HERE!!", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "107284626173831665125", "name": "Ivan Westmoreland", "time": 1492259175320, "rating": 5.0, "text": "Very good sales and service", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "101494101647065960733", "name": "Tony Herring", "time": 1497453889896, "rating": 5.0, "text": "Selection", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
{"user_id": "106598979327387616904", "name": "A Google User", "time": 1624206382504, "rating": 1.0, "text": "Was told over the phone to change the oil in 2 jet skis would be $299 when I arrived it was $499. What a rip off", "pics": null, "resp": null, "gmap_id": "0x8889f84e51499a1d:0x47a1534a3753b64f"}
