{"user_id": "102661350993420294924", "name": "Joanna Cartwright", "time": 1623514552280, "rating": 5.0, "text": "Love this place!  We bought a small four wheeler for our 8 year old daughter.  They have been knowledgeable and helpful with our other ATV vehicles bought at different places.  We will definitely be buying more and bringing our business back to this place.", "pics": null, "resp": {"time": 1623631805633, "text": "Thank you very much. We will get them all going for you."}, "gmap_id": "0x889a6d36511216a1:0xc2d96601c4e6ca5"}
{"user_id": "108567733622760473324", "name": "PirateCaptain Jay (Captain Jay Tucci)", "time": 1621206537493, "rating": 5.0, "text": "Walked in to grab an atv for the family, walked out with 2 and a smile on my face.  What a great place!  The staff was super friendly.  They gave us plenty of info, even delivered the atvs for us.   My only suggestion would be to maybe make some bundles for accessories for folks that want the whole package!   Got home and had an issue and i called them up and they offered to come pick up the atv to check it out.   Offered to deliver battery chargers too!   We will be back to buy our next one and would highly recommend!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPzFf71FE5_NiF9BX2rmmErLOmTf6h_EnNy9IoH=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNcT4LabNiRMoiwDH6iaDjyTp67kCnTj620bjUB=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a6d36511216a1:0xc2d96601c4e6ca5"}
{"user_id": "112172480553451759043", "name": "Melissa L", "time": 1624743209159, "rating": 1.0, "text": "Stopped by this place to look at the little 4 wheelers that they had sitting outside.   The price on the tag of the blue webbed little 4 wheeler was $695.00.   Went inside and inquired about other that they had inside and some had a sticker price for $995.00 and $695.00 same style 4 wheelers.   Ask lady behind the counter why the price difference and she couldn't give a straight answer then proceeded to say that the OWNER wrote a 6 instead of 9 and they were $995.00 not $695.00 as written on the tags of the others.  Then the gentleman that was behind the counter came out on the showroom floor and says \"OH NO I CANT SELL THEM FOR THAT AND I CANT EVEN BUY THEM FOR THAT PRICE and proceeded to snatch the price tags off the ones that had a tag marked $695.00 on them in front of us.    Ask if he would sell for the price that was on it prior to him snatching the price tag off and he RUDELY said NO.  I am a small business owner myself, and would never have done this to a customer, especially pulling off price tags in front of a customer and telling them I can't honor the price tag that is on the item because of a mistake that was made by the owner of the busiess.  Honor the price that is on the tag and then correct the price issue after the customer has left the busines.\nSo buyer beware of this place of business.", "pics": null, "resp": {"time": 1624729985517, "text": "I'm sorry you feel the need to try to hurt our business due to a small error. I'm happy you brought it to our attention and we have corrected the issue. We are a small business and sometimes mistakes are made. We can't afford to sell merchandise at a loss. We have a perfect reputation in our community and customer service will always be number 1. So thank you for stopping by, and we hope you find what you are looking for elsewhere."}, "gmap_id": "0x889a6d36511216a1:0xc2d96601c4e6ca5"}
{"user_id": "107776769938618419287", "name": "jared Douglas", "time": 1616379976378, "rating": 5.0, "text": "Great place. The 4wheeler I bought was well priced and fast!", "pics": null, "resp": null, "gmap_id": "0x889a6d36511216a1:0xc2d96601c4e6ca5"}
{"user_id": "117358109584995452515", "name": "David Tinsley", "time": 1620830881378, "rating": 5.0, "text": "Put my new motorcycle tires on in a flash for a good price", "pics": null, "resp": null, "gmap_id": "0x889a6d36511216a1:0xc2d96601c4e6ca5"}
{"user_id": "104597481825154267069", "name": "Desiree Daughtry", "time": 1614130723624, "rating": 5.0, "text": "Very friendly & reasonable prices.. Hopefully we will see yall again when we get tax money bk", "pics": null, "resp": null, "gmap_id": "0x889a6d36511216a1:0xc2d96601c4e6ca5"}
{"user_id": "114116186602398982878", "name": "Austin Taylor", "time": 1619721191467, "rating": 5.0, "text": "My bikes from there is just one kick start and atv never hesitates", "pics": null, "resp": null, "gmap_id": "0x889a6d36511216a1:0xc2d96601c4e6ca5"}
{"user_id": "116583293489863273669", "name": "Yocelin Gallegos", "time": 1618626375948, "rating": 5.0, "text": "Kiss my gas  power sports made me happy", "pics": null, "resp": null, "gmap_id": "0x889a6d36511216a1:0xc2d96601c4e6ca5"}
{"user_id": "110717123435684107332", "name": "tiny tiddy", "time": 1610721801761, "rating": 5.0, "text": "Best place for chinese bike service and the owners are very friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x889a6d36511216a1:0xc2d96601c4e6ca5"}
{"user_id": "104139765487366544021", "name": "StayInFairhope", "time": 1598703073692, "rating": 5.0, "text": "Joachim Rocks !!! Hands-on owner who knows scooters and can diagnose and fix them ...none of the weeks waiting times of others ...I was lucky to get our scooter done immediately and got it done right ! Great friendly service by people that care !", "pics": null, "resp": {"time": 1599269467258, "text": "(Translated by Google) Many Thanks!\n\n(Original)\nVielen Dank!"}, "gmap_id": "0x889a6d36511216a1:0xc2d96601c4e6ca5"}
{"user_id": "106559781597176960895", "name": "Michael Robinson", "time": 1606155098232, "rating": 5.0, "text": "Great deals go check the out.  I did", "pics": null, "resp": null, "gmap_id": "0x889a6d36511216a1:0xc2d96601c4e6ca5"}
{"user_id": "116658192539177671952", "name": "Tammy Nance", "time": 1588650167580, "rating": 5.0, "text": "Very friendly staff. I will and do recommend them to anyone. GREAT PRICING too. We purchased 3 and my grandson got a dirt bike in March for his birthday, awesome gift.", "pics": null, "resp": null, "gmap_id": "0x889a6d36511216a1:0xc2d96601c4e6ca5"}
{"user_id": "112116957110628401479", "name": "Kelly Hadley", "time": 1588459370714, "rating": 5.0, "text": "Mr. Joe and Mrs. Shanna are awesome!! Super friendly and very knowledgeable  about their items they are selling. We bought a go cart from them, they explained everything to us. Helped us load the go cart. Excellent  service.I would highly recommend  them!!!", "pics": null, "resp": null, "gmap_id": "0x889a6d36511216a1:0xc2d96601c4e6ca5"}
{"user_id": "101678208894478957399", "name": "Chris Cassani", "time": 1590182831232, "rating": 5.0, "text": "5 stars all the way! To make a long story short, I had to pick up my vehicle from the tow lot next door to this place, and the car had a couple of issues that were preventing me from driving it right away. All the guys at KMG volunteered to help out and get me fixed up in a matter of minutes. They could not have been more helpful, and they turned what should have been a negative experience, into something indescribably positive! The owner in particular (wish I would have gotten his name) is one of the nicest, most helpful and professional people I have ever encountered. I cannot recommend them enough. I am so happy to know that people like this still exist in the world.", "pics": null, "resp": {"time": 1591057883981, "text": "My pleasure, glad I could help,\nJoe Berrer"}, "gmap_id": "0x889a6d36511216a1:0xc2d96601c4e6ca5"}
{"user_id": "111969068101625143322", "name": "Austin Lassitter", "time": 1584209632110, "rating": 5.0, "text": "Excellent customer service! Great people as well! Have one very minor issue with the fourwheeler we bought which happens from time to time. Especially how my son rides.  Brought it back up here to get it fixed and he tried not to charge me. but I'm not that type of person. Nothing is free in this world and I handed him some cash.  But all in all great business and will definitely continue to do business with them in the future.", "pics": null, "resp": {"time": 1586393831817, "text": "Thank you for the review. We will keep that quad running great for you."}, "gmap_id": "0x889a6d36511216a1:0xc2d96601c4e6ca5"}
{"user_id": "104314714530111729127", "name": "Pj Crain", "time": 1593441125737, "rating": 5.0, "text": "Verry good family oriented people would recommend v going through them before anyone else", "pics": null, "resp": null, "gmap_id": "0x889a6d36511216a1:0xc2d96601c4e6ca5"}
{"user_id": "115279453291364270650", "name": "Micah P", "time": 1616243997425, "rating": 5.0, "text": "Awesome staff!", "pics": null, "resp": null, "gmap_id": "0x889a6d36511216a1:0xc2d96601c4e6ca5"}
{"user_id": "104930478943282385450", "name": "jesse lindstadt", "time": 1564702932867, "rating": 5.0, "text": "The service I received on my moped was incredible. Great service with a remarkably reasonable price. I can’t recommend KissMyGas enough.", "pics": null, "resp": {"time": 1564713207810, "text": "Thank you for your business, we will keep that little Metro going for you."}, "gmap_id": "0x889a6d36511216a1:0xc2d96601c4e6ca5"}
{"user_id": "107957050333267970336", "name": "Brittany Hardy", "time": 1575667257591, "rating": 5.0, "text": "Very friendly service and great financing options! Cant wait to see my sons face when gets exactly what he wanted. Thank yall!", "pics": null, "resp": null, "gmap_id": "0x889a6d36511216a1:0xc2d96601c4e6ca5"}
{"user_id": "116964151969567200852", "name": "Joe K", "time": 1554682529179, "rating": 5.0, "text": "I was a first time scooter buyer and Joe was very helpful in answering questions and helping to find a scooter that fit my specific needs. They work with a wide selection of manufacturers so the options were definitely there! When I finally made my decision, we ordered the bike together, and  he had it ready for my by the end of that week. Couldn't be happier with my purchase, as well as mo overall experience at KMG. Would recommend their shop to anyone looking for a cost effective scooter bike.", "pics": null, "resp": {"time": 1556287510004, "text": "Thank you for the kind review, hope to see you soon for your 1st oil change."}, "gmap_id": "0x889a6d36511216a1:0xc2d96601c4e6ca5"}
{"user_id": "106791230877129769083", "name": "Katelynn Lee", "time": 1600750482672, "rating": 5.0, "text": "Great people! Great product!", "pics": null, "resp": null, "gmap_id": "0x889a6d36511216a1:0xc2d96601c4e6ca5"}
{"user_id": "104648917986309327577", "name": "Chuck Ellis", "time": 1590251810565, "rating": 5.0, "text": "Got some great ATV's at great prices.", "pics": null, "resp": null, "gmap_id": "0x889a6d36511216a1:0xc2d96601c4e6ca5"}
{"user_id": "108443357089662220294", "name": "Bethany Cassani", "time": 1590434904529, "rating": 5.0, "text": "Thank you to Joe for being a kind soul and helping when my husband and I  needed it most. We need more of you in the world!", "pics": null, "resp": {"time": 1591057917284, "text": "Thank you"}, "gmap_id": "0x889a6d36511216a1:0xc2d96601c4e6ca5"}
{"user_id": "107698261974152086757", "name": "Ron “The Traveler”", "time": 1579043117337, "rating": 5.0, "text": "Very helpful and knowledgeable staff, wouldn't do business anywhere else!", "pics": null, "resp": null, "gmap_id": "0x889a6d36511216a1:0xc2d96601c4e6ca5"}
{"user_id": "109323419979810677767", "name": "Ty Barton", "time": 1612907436287, "rating": 5.0, "text": "Very helpful", "pics": null, "resp": null, "gmap_id": "0x889a6d36511216a1:0xc2d96601c4e6ca5"}
{"user_id": "106445357588726538718", "name": "Elizabeth Beery", "time": 1563591266400, "rating": 5.0, "text": "Excellent customer service and great value !  They picked up my scooter, repaired it and returned it to me in under 6 hours for a very reasonable price.  They cleaned it too ! Thank you !", "pics": null, "resp": {"time": 1563596681642, "text": "We are happy to gain you as our customer. Thank you."}, "gmap_id": "0x889a6d36511216a1:0xc2d96601c4e6ca5"}
{"user_id": "113437735959289673795", "name": "Caleb Page", "time": 1586295723691, "rating": 5.0, "text": "The tech is awesome will be back would recommend to anyone!!!!!", "pics": null, "resp": null, "gmap_id": "0x889a6d36511216a1:0xc2d96601c4e6ca5"}
{"user_id": "116979026617672855958", "name": "Carl Foster", "time": 1566319373901, "rating": 5.0, "text": "Very nice customer service and went out of their way to fill up gas for my friend after he bought his new scooter.", "pics": null, "resp": null, "gmap_id": "0x889a6d36511216a1:0xc2d96601c4e6ca5"}
{"user_id": "115227529544562921819", "name": "Predator Hollywood", "time": 1562951496627, "rating": 5.0, "text": "Had been looking for a motor scooter for my 14 year old grandson; happened to see KMG on Facebook (gotta love that \"free\" advertising !!) and decided to check it out.  Upon arrival, saw displayed exactly the type of motor scooter we were looking for - and also saw this tall guy in a sun hat who greeted us.  Joe was EXTREMELY gracious, knowledgeable, friendly and laid back - he's just like a longtime friend that you haven't seen in awhile!  We decided on a white Wolf, full face helmet and alarm system.  The purchase process was very smooth and easy.  Joe answered all our questions and concerns and assured us that delivery could be expected in a few days.  Sure enough, 4 days later we returned to pick up the Wolf - it was all prepared and ready to go - just as Joe assured us it would be.  My grandson was so excited!  After break-in, we returned the Wolf to Joe for fluid changes and adjustments and again had a most pleasurable experience; the maintenance took only a few minutes; Joe even provided my grandson with several shaded sun shields.  It is with a great deal of pleasure and considerable pride that I highly recommend KMG Powersports and Joe Berrer and his staff to any and all who are in the market for a powersport.  You, too, will undoubtedly have the same pleasurable experience(s) that we had!\nJoe Drop\nSemmes, AL", "pics": null, "resp": {"time": 1563142880194, "text": "Thank you Joe. It has been a pleasure doing business with you."}, "gmap_id": "0x889a6d36511216a1:0xc2d96601c4e6ca5"}
{"user_id": "102444792117323099055", "name": "Lisa Andrews", "time": 1550766422448, "rating": 5.0, "text": "Extremely nice and knowledgeable. Highly recommend this shop to everyone.", "pics": null, "resp": null, "gmap_id": "0x889a6d36511216a1:0xc2d96601c4e6ca5"}
{"user_id": "117055160670282779917", "name": "Michael Bell", "time": 1603314433609, "rating": 5.0, "text": "great service", "pics": null, "resp": null, "gmap_id": "0x889a6d36511216a1:0xc2d96601c4e6ca5"}
{"user_id": "106232871618087607273", "name": "Confederate Broadcasting", "time": 1569547179542, "rating": 5.0, "text": "Great service", "pics": null, "resp": {"time": 1569548447657, "text": "Thank you!"}, "gmap_id": "0x889a6d36511216a1:0xc2d96601c4e6ca5"}
{"user_id": "109456613363753361799", "name": "Kennith Wilson", "time": 1616717041105, "rating": 5.0, "text": "Dropped off my bike today to be serviced. The owner was very friendly and knowledgeable. I told him what I wanted and he promised a bike I could ride all season. Looking forward to picking it up. Worth the visit just to see some of the cool bikes he has inside!", "pics": null, "resp": {"time": 1616799914906, "text": "Thanks for your 5-star review and positive feedback! Looking forward to making your summer riding experience a memorable one!"}, "gmap_id": "0x88929342583cbd9d:0xac2bc6e61b898a61"}
{"user_id": "114534928911016300934", "name": "J B", "time": 1615234274090, "rating": 5.0, "text": "Some of the coolest used bikes I have seen. All the bikes were a bit older, but immaculate.", "pics": null, "resp": {"time": 1616799972761, "text": "Thanks JB! Stop by anytime we greatly appreciate your 5-star review!"}, "gmap_id": "0x88929342583cbd9d:0xac2bc6e61b898a61"}
{"user_id": "109141225549473209285", "name": "Robert Van Vleck", "time": 1605978276155, "rating": 5.0, "text": "Great shop! Jody is an awesome mechanic! Always takes great care of my bike.", "pics": null, "resp": {"time": 1608066353613, "text": "Thanks Robert! We appreciate your trust and continued business!"}, "gmap_id": "0x88929342583cbd9d:0xac2bc6e61b898a61"}
{"user_id": "101560749508408368960", "name": "Stephanie Eidson", "time": 1605914908933, "rating": 5.0, "text": "Excellent customer service.  Very knowledgeable and kind.  100% recommend.", "pics": null, "resp": {"time": 1608066438201, "text": "Thanks Stephanie. We appreciate your business, and hope the family has a very Merry Christmas!"}, "gmap_id": "0x88929342583cbd9d:0xac2bc6e61b898a61"}
{"user_id": "101144379485420434437", "name": "Ted Thrash", "time": 1608058931845, "rating": 5.0, "text": "Purchased new 2020 KYMCO 450i SXS from circle city cycles!! Great machine, Jody was great to work with thru the whole transaction and very knowledgeable of machine!! Me and my family love the machine and couldn’t be more happier with our purchase!! Know where to go for our future purchases!!! Was worth the drive 2 hours from Reeltown Alabama!", "pics": null, "resp": {"time": 1608066308374, "text": "Thank you Ted! We greatly appreciate your business, kind words,  and look forward to a long lasting friendship.  Enjoy your new Kymco UXV450i.\nRegards,\nJody"}, "gmap_id": "0x88929342583cbd9d:0xac2bc6e61b898a61"}
{"user_id": "102661173133250566056", "name": "Mike Rock", "time": 1602287421514, "rating": 5.0, "text": "Nice selection of on and off road cycles at affordable prices. Very friendly and helpful owner, would recommend to all my friends and family go check them out.", "pics": null, "resp": {"time": 1608066812356, "text": "Thank you for the kind words Mike! We appreciate your business. Come visit anytime!"}, "gmap_id": "0x88929342583cbd9d:0xac2bc6e61b898a61"}
{"user_id": "118098855908146038174", "name": "Breality", "time": 1623210771202, "rating": 5.0, "text": "Service was amazing!!7⁶⁶⁶", "pics": null, "resp": null, "gmap_id": "0x88929342583cbd9d:0xac2bc6e61b898a61"}
{"user_id": "104621428174322345039", "name": "Jacob Bare", "time": 1589592294020, "rating": 1.0, "text": "Dropped off a bike I got for my Nephew to have 2 tires put on the bike and was quoted $30 per tire. Went to pick it up and they said it was $178. They also charged me for 2 new tubes I didn’t need or ask for. I brought a new one in a box I already had that was purchased there. When I asked for a breakdown the owner became instantly rude and just out right nasty. “Don’t buy one if you can’t afford the maintenance”. Then the other worker went and got the tech and said come here this guy is complaining and then said he’d roll it in the back and take it off. That’s were I put my foot down. The tech was the only person in there with a level head about him. I tried taking it to Dothan Power Sports 1st but the we’re too busy to get it in and out today. No customer service skills whatsoever. I literally thought I was going to end up in the parking lot with the 2nd guy and I wasn’t even dealing with him. I definitely will not be back.", "pics": null, "resp": {"time": 1589639113142, "text": "We’re sorry that your experience didn’t go as expected. The $30 per tire was a labor only quote that was made clear at the time the unit was quoted. Customer requested two new tires and when the tech disassembled the bike, noticed it was missing key safety strips on the rim, one tube was deteriorated, and replaced out of safety concern and the longevity of the repair. The additional items and Alabama mandatory tire sales fee were the only charges the customer wasn’t aware of. The customer was phoned to be informed, but didn’t  answer the phone during the servicing, so that we could make him aware of the extra needed items.  When the customer arrived to pick up the unit, and was presented the repair bill, he was adamant that he wasn’t going to pay for the extra items, so it was offered to remove the items and return his original equipment.  In the end the shop owner marked down the cost of the repair and the shop gave the customer a free tube to help ease the cost of the repair. It was noted to the customer when he was there, that we can’t estimate all unforeseen things needed in a repair until the actual job was being performed."}, "gmap_id": "0x88929342583cbd9d:0xac2bc6e61b898a61"}
{"user_id": "112795278293509219847", "name": "Sherrod Murray", "time": 1554002917690, "rating": 5.0, "text": "These fellas are pretty awesome.  Took my bike there to get some modifications done and they killed it, in a good way.  My bike looks amazing and rides even better.  Very helpful and knowledgeable staff as well.  👍🏾", "pics": null, "resp": {"time": 1608066981750, "text": "We appreciate your trust and business! We aim high, and your review let us know we hit that mark! Thank you!"}, "gmap_id": "0x88929342583cbd9d:0xac2bc6e61b898a61"}
{"user_id": "110684758773573968321", "name": "Josh Cole", "time": 1615302034920, "rating": 4.0, "text": "Very friendly and honest", "pics": null, "resp": {"time": 1616800065992, "text": "Thanks Josh we appreciate the positive feedback!"}, "gmap_id": "0x88929342583cbd9d:0xac2bc6e61b898a61"}
{"user_id": "110157344160472880297", "name": "Love Rivera", "time": 1572205979817, "rating": 5.0, "text": "Come check out this place guys...its really a good shop.,. Great people...", "pics": null, "resp": {"time": 1608066901771, "text": "Thank you for the positive review! We appreciate your business!"}, "gmap_id": "0x88929342583cbd9d:0xac2bc6e61b898a61"}
{"user_id": "112922296144553512223", "name": "Aaron Wells", "time": 1585404016027, "rating": 5.0, "text": "Great place to do business, service was outstanding", "pics": null, "resp": {"time": 1589639286931, "text": "Thank you Aaron we appreciate the glowing review!"}, "gmap_id": "0x88929342583cbd9d:0xac2bc6e61b898a61"}
{"user_id": "110037206281837451041", "name": "Nate Trav", "time": 1501613282128, "rating": 5.0, "text": "These guys take care of my V-Star every off-season and do a great job. From carb work to tires and spokes and routine stuff.  I appreciate their great service.", "pics": null, "resp": {"time": 1511907129111, "text": "Thanks Nate! We do appreciate your business, and look forward to keeping your two wheels rolling for many years to come."}, "gmap_id": "0x88929342583cbd9d:0xac2bc6e61b898a61"}
{"user_id": "104460069579800082162", "name": "Phillip Swanner", "time": 1544598467313, "rating": 5.0, "text": "Always friendly staff! Highly recommend for parts, service, and sales.", "pics": null, "resp": {"time": 1544620780646, "text": "Thank you Phillip for the kind words and 5-Star rating. We appreciate you taking the time to let others know we strive to be the one stop shop in the Wiregrass for all of your powersports needs."}, "gmap_id": "0x88929342583cbd9d:0xac2bc6e61b898a61"}
{"user_id": "114814679619491222403", "name": "Geseda M", "time": 1570304023112, "rating": 5.0, "text": "Very helpful and very knowledgeable!", "pics": null, "resp": {"time": 1608066921808, "text": "Thank you!"}, "gmap_id": "0x88929342583cbd9d:0xac2bc6e61b898a61"}
{"user_id": "113905301491666650390", "name": "jim hutchins", "time": 1578281988084, "rating": 1.0, "text": "I carried my Mule here to have a new battery installed , check voltage regulator, clean carb. They did these thing PLUS install air filters at $79 ( which were not requested)($39 on internet) charged me $130 for $40 battery. Voltage regulator $140 ( $39 ) on parts resources on the internet. Needle valve, just took off the float bowl didn't have to take off carb.  charges $20 for tiny needle valve. ($3  ) on internet. They said they cleaned out gas tank which they didn't, I've had to do it myself since I got it home. Won't ever take it back to them because they over charged me at $800 to do very little work and didn't do everything they said they did! Charge me 300% mark up on aftermarket parts. I was alarmed at the prices of parts and labor for such little work and then it not being done properly. Suggestion's, Make sure you get prices out front before they work on your bike!!!( The Mule work was in the name of Tim Hudson, check your work orders again! He Lives in Blakely Ga.)", "pics": null, "resp": {"time": 1542150933356, "text": "Mr. Hutchins,\nI reviewed our service repair tickets all the way back to June 2018, and we do not show ever working on a unit for you, listed as Jim Hutchins. Could you possibly be confusing our shop with Dothan Powersports(considering they sale and service Kawasaki product)?  If so, please kindly delete this unfavorable review of our facility, or inform us  to whom this unit was registered, for repair on the repair invoice, and date it entered the facility.\nThank you,\nJody Spann"}, "gmap_id": "0x88929342583cbd9d:0xac2bc6e61b898a61"}
{"user_id": "106788690919563964995", "name": "James Millwood", "time": 1551310925932, "rating": 4.0, "text": "Very helpful. Hoping to do business with them soon.", "pics": null, "resp": {"time": 1608067007489, "text": "Thanks for the great review James! Come back to see us soon!"}, "gmap_id": "0x88929342583cbd9d:0xac2bc6e61b898a61"}
{"user_id": "100337267112782103347", "name": "keith daniels", "time": 1535055444309, "rating": 5.0, "text": "Awesome service\nThe Spann guys know the business !", "pics": null, "resp": {"time": 1536692958870, "text": "Thanks for the 5 ⭐️  review, Keith!"}, "gmap_id": "0x88929342583cbd9d:0xac2bc6e61b898a61"}
{"user_id": "113836010817743790192", "name": "Eddie Terrell", "time": 1509995317744, "rating": 5.0, "text": "These guys always do great work and will take extra time to help with any questions.", "pics": null, "resp": {"time": 1511907310227, "text": "Thanks Eddie! We really appreciate your kind words, and that’s what makes real motorcycle shops great. Take time to create the magic and wonder of two wheel fun and the customer will always remember those days. We’re just blessed to be a part of it everyday! Again, thank you!"}, "gmap_id": "0x88929342583cbd9d:0xac2bc6e61b898a61"}
{"user_id": "115655798674988120180", "name": "Ted", "time": 1350273573002, "rating": 2.0, "text": "Was quoted 6000 dollars on a  bike with an msrp rating of 4800. I recommend driving to Ozark to Beasleys Kawasaki. That is just outrageous. I was also quoted 5000 dollars on bikes that were between 3,500 - 4000 dollars most other places. I said I was a new rider, not an idiot.", "pics": null, "resp": {"time": 1495034037482, "text": "Mr. Conner. We never presumed you to be an idiot,  but you have to also understand business are different independent franchises.  Our prices at the time you visited this dealership reflected the total price out the door with all applicable state and local taxes and freight charges for the particular unit you were interested in. At this particular time we also has packaged prices for machines that included 5 years worth of warranty, jacket, helmet, and gloves. When you call different dealers in different areas they have the ability to quote you a machine at a lesser price and once your in the closing office they introduce the total price including the added fees. Something you overlook when ranting about our prices in this review, I'm sure.  The same goes for where you choose to purchase your auto, boat, or RV. Its called free enterprise and I hope you understand that ranting about it doesn't change what made this country great. Thank you!"}, "gmap_id": "0x88929342583cbd9d:0xac2bc6e61b898a61"}
{"user_id": "103266598545411657447", "name": "Christopher Chambers", "time": 1511904146781, "rating": 5.0, "text": "Great people. Don't know how to even ride a motorcycle but want to know how to ride a busa. But jody stop me and told me hardly Davies doing cycle riding out there and showed me a ninja z-x6. 636 like the look just my style to trick out. Thanks jody and circle city cycles for great work and business for the wiregrass. 😀", "pics": null, "resp": {"time": 1511907186440, "text": "Thank you for the kind words! We do appreciate each and every customer! Hope to see you again in the future! Ride safe!"}, "gmap_id": "0x88929342583cbd9d:0xac2bc6e61b898a61"}
{"user_id": "101746190998191060163", "name": "Don Wolfe", "time": 1516910144100, "rating": 5.0, "text": "Fair price on parts very knowledgeable and helpful", "pics": null, "resp": {"time": 1536693071054, "text": "Thanks Don! Appreciate the 5 ⭐️ review!"}, "gmap_id": "0x88929342583cbd9d:0xac2bc6e61b898a61"}
{"user_id": "107999323140847205909", "name": "Phillip Smith", "time": 1542421969511, "rating": 5.0, "text": "Very friendly and very informative people", "pics": null, "resp": {"time": 1542428956103, "text": "Thank you for the 5 star review, Phillip! We really appreciate your business."}, "gmap_id": "0x88929342583cbd9d:0xac2bc6e61b898a61"}
{"user_id": "118277602430378924250", "name": "ThaRealSmo", "time": 1487437019900, "rating": 3.0, "text": "Everything there is way over priced, they have good service, but everything there is just way too much. The people are helpful though.", "pics": null, "resp": {"time": 1495034292323, "text": "Thank you for saying we're helpful, but If you think our prices are too high, did you at the very least point this fact to our attention so that we could discuss it?  Sure there are many different ways to derive at a particular price, and I'll be sure to share those metrics with you if you take the time to come back and ask to discuss this review. I will gladly share with you about value added price as well as the cost of cheaper."}, "gmap_id": "0x88929342583cbd9d:0xac2bc6e61b898a61"}
{"user_id": "105171772222703957799", "name": "Brenda Starboard", "time": 1590255665400, "rating": 5.0, "text": "Great prices", "pics": null, "resp": {"time": 1590270866370, "text": "Thanks for the 5 stars ⭐️ and positive feedback, Brenda."}, "gmap_id": "0x88929342583cbd9d:0xac2bc6e61b898a61"}
{"user_id": "117279776453187609797", "name": "Matthew Clayton", "time": 1550271789922, "rating": 5.0, "text": "Superb knowledge and service!", "pics": null, "resp": {"time": 1550279042618, "text": "We sincerely appreciate your business."}, "gmap_id": "0x88929342583cbd9d:0xac2bc6e61b898a61"}
{"user_id": "109191536526634488608", "name": "John Keppler", "time": 1533674255547, "rating": 5.0, "text": "Great folks", "pics": null, "resp": {"time": 1533677564995, "text": "Thanks John! Enjoy your new ride, and we really appreciate your business and friendly review!"}, "gmap_id": "0x88929342583cbd9d:0xac2bc6e61b898a61"}
{"user_id": "106778027220782397160", "name": "linda wolfe", "time": 1513113855553, "rating": 5.0, "text": "Very good service", "pics": null, "resp": {"time": 1536693016831, "text": "Thank you!"}, "gmap_id": "0x88929342583cbd9d:0xac2bc6e61b898a61"}
{"user_id": "103583047677371803761", "name": "Dionna Jensen", "time": 1526564393517, "rating": 5.0, "text": "Great customer service here", "pics": null, "resp": {"time": 1536693037506, "text": "Thank you for the kind review!"}, "gmap_id": "0x88929342583cbd9d:0xac2bc6e61b898a61"}
{"user_id": "108389759597668702951", "name": "Greg", "time": 1490701016304, "rating": 1.0, "text": "Told me out would cost $300-400. Picked It up and it was $600. Now I'm selling my bike for parts. Go to Beasley's.", "pics": null, "resp": {"time": 1495034991340, "text": "Greg,\nSorry this may have happened, unfortunately I don't have much in the way of information on your particular situation based on your unfavorable review.\n\nAs with an estimated guess,  looking at the crystal ball of problems, there is no way to accurately predict all situations, until the work is being performed. As well as, when a customer drops off a machine and doesn't complete reveal the entire back story. This may not be the case in this particular situation, but in many instances maintenance becomes a can of worms, and if the machine is to work properly (for which it was brought to the dealership) there are additional things to be performed. If those are not addressed, it can cause an unsafe machine and therefore cost yourself and the dealership more in the long run. We hope that you understand maintenance isn't an exact science."}, "gmap_id": "0x88929342583cbd9d:0xac2bc6e61b898a61"}
