{"user_id": "107594182313251458655", "name": "Capt Nugs", "time": 1621966432379, "rating": 1.0, "text": "The receptionist is horrible, my first appointment she told me the wrong day, second appointment she lost my sign in sticker and after I waited 45 minutes I asked how much longer I had to wait and then she looked and found my sign in sticker. I left after waiting 2 hours. Would use anyone but this place!", "pics": null, "resp": null, "gmap_id": "0x888c2c0c572c4735:0x27cb5f09f548007a"}
{"user_id": "102522202329451004279", "name": "barbara brown", "time": 1597484568936, "rating": 1.0, "text": "This facility is incapable and lacks knowledge of imagining patients who have pacemakers compatible with MRI. They were all over the place in giving the reasons they could not see these type of patients which were inaccurate, eg., \"Pacemaker has to be shut off \"which is the wrong terminology on how patients with this compatible device are managed. This place is behind the times in comprehensive imaging.", "pics": null, "resp": {"time": 1597863533001, "text": "MRI centers accepting patients with MR-conditional implantable cardiac rhythm devices should refer to the SureScan Patient Scanning Process to find instructions for determining whether a patient with a Medtronic SureScan System meets the criteria to receive an MRI, as well as instructions to follow before, during, and after an MRI scan.\n\nAs indicated from the Medtronic web site, pacemakers and defibrillators are MRI CONDITIONAL, meaning all conditions must be met to perform the scan.  To safely scan a patient with one of these devices, proper monitoring must be performed during the exam, i.e. pulse oximetry or electrocardiography.  Please see below taken directly from their web site.  As you may notice, it is also required to have a defibrillator nearby when scanning patients with these devices.\n\nPacemaker and CRT-P Requirements: Proper patient monitoring*must be provided during the MRI scan.  An external defibrillator must be available nearby during the MRI procedure.\nICD and CRT-C Requirements: Proper patient monitoring*must be provided the entire time SureScan is programmed to On.  An external defibrillator must be immediately available the entire time MRI SureScan is programmed to On.\n*This includes visual and verbal contact with the patient and monitoring heart rate using instrumentation such as pulse oximetry or electrocardiography.\n\nAs an out-patient facility, we are not equipped to provide the level of monitoring required to perform MRI on patients with these devices.  This should give added comfort to prospective patients that we are considering all safety aspects of the exam rather than seeking to do all exams no matter the risk, just for financial gain."}, "gmap_id": "0x888c2c0c572c4735:0x27cb5f09f548007a"}
{"user_id": "117771020172809635711", "name": "Chance Cristwell", "time": 1576526941422, "rating": 1.0, "text": "Guy who bought the place actually ripped off the original owner, Suzanne Cristwell, who built the company, and paid her one installment of what was supposed to a multiple year contract. She's still trying to get it into court. Great quality equipment, especially considering the guy got it for next to nothing.", "pics": null, "resp": null, "gmap_id": "0x888c2c0c572c4735:0x27cb5f09f548007a"}
{"user_id": "108699333513666355151", "name": "Del Chick", "time": 1534280138963, "rating": 4.0, "text": "Closed MRI went great ! Had MRI on my lower back, only took 15 min. I went in feet first (thank goodness!) They gave me earplugs plus headphones to soften that horrific noise (it helped a lot). I also had Xanax. Put some pillows under me so I was comfy.  Had to keep eyes closed but at least my head was partially out. My arms were over my head on pillow holding my panic button, never used it.  Late in day seemed like better timeframe.  (At another place, they did this all wrong and I had instant panic attack, so I walked out!). This place is MUCH better.", "pics": null, "resp": null, "gmap_id": "0x888c2c0c572c4735:0x27cb5f09f548007a"}
{"user_id": "103190703707517351670", "name": "Peggy Chestnut", "time": 1508977991352, "rating": 5.0, "text": "Staff was very kind, punctual, and professional. I had a stress test performed within 24 hours of my physician's order. During the procedure every aspect was thoughly explained and monitored by the technician, and overseen by the doctor. I would definitely return for future services if needed, and will certainly recommend I M I.", "pics": null, "resp": null, "gmap_id": "0x888c2c0c572c4735:0x27cb5f09f548007a"}
{"user_id": "100783238213640100259", "name": "andrew moreland", "time": 1554359821070, "rating": 1.0, "text": "My brother had an appointment this past Tuesday at 2pm.  He was scheduled for a MRI.  When it was his turn we entered the room and she mentioned that his neck back and brain were being tested. I assisted the tech in getting my brother positioned on the table.  She put some type of head gear on him and she was having alot of trouble getting it on.  She kept trying to close it but it wouldn't close I thought it was too small but I wasn't sure she did finally get it closed (sidenote the headgear caused brusing under his chin).    Neither one of us had any idea on what was going to happen with this procedure.  She started the machine my brother nor I was told how long this procedure would take.   About an hour and a half went by we heard a banging in the room.  My brother was banging on the inside of the machine and yelling.  She pulls him out he is sweating profusely and he is shaking uncontrollably.  My brother is now refusing to finish the procedure.  We got him put back in his wheelchair he was crying uncontrollably as we left the clinic.  I'm not sure what happened in the MRI machine  to my brother but I would suggest that patients be told a little about the procedure and definitely how long the procedure will take.", "pics": null, "resp": null, "gmap_id": "0x888c2c0c572c4735:0x27cb5f09f548007a"}
{"user_id": "108835282275858384993", "name": "Solange Maury", "time": 1460065549887, "rating": 1.0, "text": "we were in  to get an MRI  waited for 2 hrs, when we asked how much time we had till our turn , they couldn't say... they said they werr running behind schedule. ... we ended up canceling our appointment. Don't schedule here waste of time! !!!", "pics": null, "resp": null, "gmap_id": "0x888c2c0c572c4735:0x27cb5f09f548007a"}
{"user_id": "107943412158637480608", "name": "SDavis Jones", "time": 1468599017702, "rating": 4.0, "text": "I went to IMI in Jan this year (2016) and again in July.  January, I had an echocardiogram; and in July, I had an MRI.  I had short wait times for both.  I was treated professionally for both, and have no real complaints for either.  Staff was courteous and professional.  I was referred both times by the same doctor.  I would not have any problems being referred again.  I gave them 4 out of 5 stars, because there is always room for improvement.", "pics": null, "resp": null, "gmap_id": "0x888c2c0c572c4735:0x27cb5f09f548007a"}
{"user_id": "101575948064222543375", "name": "Kellie Terry", "time": 1517867151967, "rating": 5.0, "text": "This facility is amazing, super clean with large changing rooms. There are windows in the MRI room so you can see daylight.  The machine isn't too tight.  Even larger people can fit comfortably.  The staff is super sweet and easy to work with.  They do everything they can to schedule your MRI for a day and time that is convenient for you.", "pics": null, "resp": {"time": 1532627217957, "text": "Thank you, Kellie!"}, "gmap_id": "0x886286909a0c2b1d:0x4eb6c3fa4619dbcf"}
{"user_id": "107532281106470587621", "name": "Alyssa H", "time": 1572659801113, "rating": 5.0, "text": "I had a great experience with my first MRI.  The staff were all friendly and glad to answer all my questions.", "pics": null, "resp": {"time": 1572726903601, "text": "Thank you for the kind review, Alyssa!  We appreciate you and your support."}, "gmap_id": "0x886286909a0c2b1d:0x4eb6c3fa4619dbcf"}
{"user_id": "104855703330462193098", "name": "Rebekka Sharpe", "time": 1511961537226, "rating": 1.0, "text": "Friendly staff, comfortable environment, but SCAMMY! I paid a large copay about three weeks ago to get an MRI and still know nothing. They \"sent it off to Birmingham\" to be read where the results would then be sent to my doctor, but my doctor has heard nothing. First of all if you have a state of the art MRI facility in Decatur Alabama why can you not have someone in Decatur Alabama read the results? Secondly if the results cannot be read at the facility then why Birmingham? There are plenty of places in the area that have someone in house to read your MRI, or at least get the results back to you in a day or three.", "pics": null, "resp": {"time": 1514388261931, "text": "Good Morning, Rebekka Sharpe.  The results of your MRI were sent to your referring physician on 11/15/17 in under 24 hours. We have the fax confirmation on file of when and where it was sent.  Your referring physician is whom you need to speak with about those results. If you are having trouble still, please call us at 256-350-7779.  Just let us know! We will be happy to send the results again to your referring physician if they need us to. We partner with a group of Radiologists to read our scans out of Birmingham. This helps to provide accurate reads in a timely manner (24 hour results). I hope this information helps.  Have a great day and we wish you a Happy New Year."}, "gmap_id": "0x886286909a0c2b1d:0x4eb6c3fa4619dbcf"}
{"user_id": "103087262805385508069", "name": "Phillip Hand", "time": 1494967313238, "rating": 5.0, "text": "Best staff around! Easy to work with and always make sure to give you the best experience possible. Definitely a 5 star organization!!!", "pics": null, "resp": null, "gmap_id": "0x886286909a0c2b1d:0x4eb6c3fa4619dbcf"}
{"user_id": "103032759725416942896", "name": "Renee Knight", "time": 1517686146039, "rating": 5.0, "text": "Friendly staff with same day scheduling. Very comfortable place to have an MRI. Especially if you are claustrophobic.  It is open on all 4 sides which made it much easier for me to relax and complete the MRI.", "pics": null, "resp": null, "gmap_id": "0x886286909a0c2b1d:0x4eb6c3fa4619dbcf"}
{"user_id": "112644535797295232634", "name": "Susan Williams", "time": 1517757190830, "rating": 5.0, "text": "Absolutely wonderful experience the staff is very friendly and willing to work with you in any way. I suffered from back pain for years and the last alternative was an MRI but I was claustrophobic but they were patient with me and worked with me to help me be able to get one, the openness of the machine was soo much better the problem was found I had back surgery 2 months ago and now NO PAIN! Thank you to Heath Alford and his stafff I would recommend them to anyone in my situation 😊", "pics": null, "resp": null, "gmap_id": "0x886286909a0c2b1d:0x4eb6c3fa4619dbcf"}
{"user_id": "107886256715711815064", "name": "Bobby Holladay", "time": 1513016923831, "rating": 5.0, "text": "Open MRI's staff was unbelievably nice and courteous. I was in and out with a very short wait time.  Facility was immaculate.", "pics": null, "resp": null, "gmap_id": "0x886286909a0c2b1d:0x4eb6c3fa4619dbcf"}
{"user_id": "116521165396725705161", "name": "Whitley Alford", "time": 1512709142820, "rating": 5.0, "text": "Friendly staff with a clean facility and welcoming atmosphere.  Great place to go if you are claustrophobic. Results back within 24 hours.", "pics": null, "resp": {"time": 1514388293781, "text": "Thank you for the review, Whitley."}, "gmap_id": "0x886286909a0c2b1d:0x4eb6c3fa4619dbcf"}
{"user_id": "105606727293312010457", "name": "Michael Johnson", "time": 1629303919274, "rating": 5.0, "text": "I needed to have two recent exams from this office and the staff and techs could not have been more courteous or helpful.  I was seen in a timely manner for both exams and was treated with care and respect by both techs I came in contact with.", "pics": null, "resp": {"time": 1629380944328, "text": "Everyone’s time is important so we strive to help our patients get back to their day quickly while still providing exceptional care."}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "108392362009937469151", "name": "Bradley Moss", "time": 1629489825911, "rating": 5.0, "text": "I interact with this staff on a daily basis and always find each staff member going above and beyond the call of duty to exceed the customer service expectations of those served. Feedback from patients served regarding the care and services delivered by this Team is amazing.", "pics": null, "resp": null, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "117339453867694611996", "name": "Meagan Hirt", "time": 1629123467515, "rating": 5.0, "text": "I had a chance to interact with their operations manager and administrator and they are beyond delightful! Their welcoming and willing personalities certainly permeate throughout their center because everyone is awesome!", "pics": null, "resp": {"time": 1629380840370, "text": "Our team puts patients first and we’re glad our team’s dedication to providing an elevated experience is showing!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "106562259216624605234", "name": "Chelsea Pickett", "time": 1621340371129, "rating": 5.0, "text": "A+ experience. Deborah called to let me know the cost a day ahead of time and was quick with the paperwork day of. Didn't wait too long before going back to prep for the CT scan. John went above and beyond to make sure I was prepared and comfortable (even offered a warm blanket!). Overall the process took about an hour, faster than my original estimate at Huntsville Hospital.", "pics": null, "resp": {"time": 1621626022184, "text": "We know everyone likes to save and every patient deserves to know, in advance, how much their healthcare will cost. We believe in price transparency and show our affordable imaging costs on our website at  https://odcalabama.com/value-finance/"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "117812405147533893989", "name": "Tammy Mendoza", "time": 1614375722728, "rating": 5.0, "text": "My mom, 78 years old, doesn't always get around well and doesn't hear well.  She came home and asked that I do a review and let everyone know how great Jerry was with her.. Patient and kind.  Thank you for being nice to the elderly and not just getting frustrated with them.  This daughter greatly appreciates it.", "pics": null, "resp": {"time": 1614714876852, "text": "It is our privilege to provide imaging services and our team works hard to make it a good experience. When we hear we’ve done it well, it makes our day!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "114106712849861228396", "name": "Beth Allen", "time": 1620353844038, "rating": 1.0, "text": "I went to my physician the morning of my mri of my brain to get a Valium and went to my appointment at 1:00 and there were at least 7 people in the waiting room!!!! Never have seen that before!!! I accidentally took my old Blue Cross card and the girl at the front was figuring my cost without Insurance(over $500.00)!!!! This has happened before and if there is a problem the offices call B/C B/S and should be handled within a couple of minutes!!! I guess her fingers were hurting because she never offered any help!!!! Even if I had the current card the Valium would would have worn off by the time I would have the MRI!!!!! Horrible experience especially driving 30 minutes to get there!!!!!!!!", "pics": null, "resp": {"time": 1620412441187, "text": "There’s nothing we value more than feedback – even if it tells us we didn’t meet expectations. That’s how we know where to focus our efforts. Our Administrator, Brad, can be reached at 256-534-5600 to discuss any patients’ specific concerns."}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "104093130989591707527", "name": "Robert Dixon", "time": 1616625643691, "rating": 5.0, "text": "The Administrative Staff and Amber, my\nX RAY Technician were highly professional and provided me outstanding customer service during my visit. They were very courteous and my visit was very pleasant.", "pics": null, "resp": {"time": 1617199285007, "text": "Our team puts patients first and we’re glad our team’s dedication to providing an elevated experience is showing!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "117685975875496988496", "name": "Benjamin Schwartz", "time": 1604689199707, "rating": 5.0, "text": "Scheduling was very easy, they let me know prior to my appointment how much it would cost, the wait time was short, and the staff was very friendly. My tech, John, kept my informed the entire time and made sure I was comfortable.", "pics": null, "resp": {"time": 1614714944726, "text": "We always love to hear positive feedback. Providing an elevated experience for every patient who chooses us is the goal of each of our team members."}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "109551950413791403300", "name": "Joe Suede", "time": 1556201367691, "rating": 5.0, "text": "Ms. Laura was fast and fantastic. I did not wait long at all and Ms. Laura ensured that we got the proper picture that she knew my specific doctor wanted to see. Highly recommend and will be back next time I need a x-ray.", "pics": null, "resp": {"time": 1557418756119, "text": "Thank you, Joe!! We really appreciate your positive feedback! Have an awesome day!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "114986822846832037109", "name": "Dianne Holder", "time": 1559009470941, "rating": 5.0, "text": "I had a CT Scan on 5-24-19 John was my Technologist he did a amazing job. The patient Care Coordinator was Cawanna , Excellent! You have a wonderful staff.", "pics": null, "resp": {"time": 1559073459340, "text": "Dianne, thank you for your kind words! We appreciate you!!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "110624729509294808672", "name": "N B", "time": 1541713226542, "rating": 1.0, "text": "Went for an ultrasound to diagnose a time sensitive condition.  Was told that the results would immediately be sent in for review and I would get a call from the doctor.  The next day, still no call.  After talking with three people, it was discovered that they never bothered to send the results in for review.  Staff friendly enough but that amounts to nothing when you cannot be bothered to do your job.", "pics": null, "resp": null, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "100513396439572917461", "name": "Janet Jones", "time": 1576885675590, "rating": 5.0, "text": "My daughter went in for a test and everyone was very friendly and professional and the appointment went quickly!", "pics": null, "resp": {"time": 1577379200250, "text": "Thanks so much for the kind review!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "113255707023435743415", "name": "Jaime 0212", "time": 1570558834508, "rating": 5.0, "text": "Amazing experience having my mammogram done by Amanda at the Hughes location.  I will never go back to the Breast Center.", "pics": null, "resp": {"time": 1571956602186, "text": "Thank you, Jamie!!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "114025028233521867557", "name": "Neil Young", "time": 1536782368783, "rating": 4.0, "text": "Went for an ultrasound and the staff was very nice and helpful.  The lady at the desk was nice and the lady that did the ultrasound was extremely nice as well. They got me in and out fast.", "pics": null, "resp": {"time": 1537369066718, "text": "Neil, thank you for taking time to give us your feedback. We appreciate you!!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "111527781428769942211", "name": "NoK Wolf", "time": 1544140823651, "rating": 4.0, "text": "They are good to call you and let you know stuff  but I'm tying confirm an appt based on their last call by calling them and I've been on 'hold' for 28 minutes,and been on hold 35 minutes earlier this morning before I gave up. They need more admin staff.\nEdit. After I arrived it was a very quick process, less than 1hr from start to finish.", "pics": null, "resp": {"time": 1544213473261, "text": "We appreciate your honest feedback. Thank you for taking the time to let us know how we can serve you better. Have a great weekend!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "108152041962050645342", "name": "Jayla Carter", "time": 1549904734704, "rating": 1.0, "text": "I called in and asked for about an appointment since I never received a call to get scheduled. I was told I didn’t need an appointment and to just walk in. I get there and watch 3 ppl go in before me. Got the excuse that ppl with appointments go before me. This is ridiculous and unfair. Others were called and scheduled, I have to wait and I’m having to suffer because I was apparently given the wrong information. My time isn’t valuable at all to them and I will be letting my doctor know that I never want to use them again.", "pics": null, "resp": null, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "103935452150546892825", "name": "Justice Writer", "time": 1493431949057, "rating": 1.0, "text": "Terrible service.  We will never, ever go back.  The front desk of any office is the most important part of an office as far as clients are concerned.  Unfortunately, however, Brook, the front desk employee was hostile, rude, nasty and just plain a  bad liar. Laura too was unhelpful initially; but not to the full extent of Brook who is a poser, a fraudster and unprofessional. Brook’s sour attitude will likely be the reason why many clients, like us, will go elsewhere. What a shame.", "pics": null, "resp": null, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "112316758943218986325", "name": "cloud s", "time": 1562621250472, "rating": 1.0, "text": "2 weeks and they still haven't sent the lab work. Terrible place.", "pics": null, "resp": {"time": 1562697705528, "text": "We appreciate the opportunity to resolve concerns and learn about ways we can improve our services and communication. We are sending your feedback to our Center Administrator. If you would like to speak to him as well, please call: 256-534-5600. Thank you"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "101468183209791880247", "name": "Linda Williams", "time": 1626450130526, "rating": 5.0, "text": "Wonderful experience.  No wait, friendly and professional service.  A refreshing experience after a few years with another center that ran me through like a cow.", "pics": null, "resp": {"time": 1626455252333, "text": "We always love to hear positive feedback. Providing an elevated experience for every patient who chooses us is the goal of each of our team members."}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "114922454331811465456", "name": "casey smith", "time": 1624998178826, "rating": 5.0, "text": "I have small veins so it is hard for anyone to get a line on me. I had actually just left a doctors office who had blown a vein before this appointment so it was harder on the tech. Christine and Chelsie did a wonderful job of getting a vein when there was limited options. She definitely took the time and care to make sure it was correct before proceeding with the Ct Scan", "pics": null, "resp": {"time": 1625176953131, "text": "It is our privilege to provide imaging services and our team works hard to make it a good experience. When we hear we’ve done it well, it makes our day!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "103179057775456857755", "name": "Kimberly Daniels", "time": 1618072685390, "rating": 5.0, "text": "this has got to be one of the most pleasant experiences I’ve ever had in a clinic where nobody knew me yet I was treated with respect and care as though they had known me for years! It was very refreshing to see the steps that were being taken for the Covid pandemic time. They made sure to make sure that I felt safe and that I was comfortable. That was the best part!", "pics": null, "resp": {"time": 1618331314949, "text": "The safety of our team and our patients is our highest priority. We have implemented processes to ensure enhanced sanitation and proper distancing while still maintaining exceptional compassionate care. https://odcalabama.com/about/images-and-results/"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "116114845123591766119", "name": "Kasper Sen", "time": 1615255964574, "rating": 1.0, "text": "I was billed an extra fee 3 months after paying up front in cash for the X-ray I needed. They are predatory and greedy trying to scam people and lying that they owe them money months after fully paying for their services. I won't ever be back.", "pics": null, "resp": {"time": 1615403572575, "text": "There’s nothing we value more than feedback – even if it tells us we didn’t meet expectations. That’s how we know where to focus our efforts. Our Administrator, Brad, can be reached at 256-534-5600 to discuss any patients’ specific concerns."}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "100089177153976223334", "name": "Maeve O'brian", "time": 1592764723307, "rating": 5.0, "text": "Last Friday was my second visit.  Elizabeth was the first person I interacted with and that was very pleasant.  I filled out all the forms and waited for my tech Lauren. It all was a good testing experience.  I didn't have to endure all that stretching and smashing anymore.  Also had the bone density test and that was painless too.  Will go back.", "pics": null, "resp": {"time": 1594845460770, "text": "Thank you for the review!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "116174305860905928218", "name": "Eula Evans", "time": 1610821545618, "rating": 5.0, "text": "Thank you for the service,it was great Deana and LaDanya were great.\n\nThank you, ms.evans", "pics": null, "resp": {"time": 1611063813664, "text": "Our team puts patients first and we’re glad our team’s dedication to providing an elevated experience is showing!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "111689151111505715764", "name": "Kelly Firestine", "time": 1579809437145, "rating": 5.0, "text": "I needed to have a mammogram and screening breast ultrasound because I have been told I have dense breasts.  They scheduled me right away.  I spent hardly any time at check in.  I was taken back for my exam so quickly I barely had time to sip the nice cup of coffee I got in the lobby.  The women's are is so private and cozy.  It is nice to have a separate, private area from the rest of the center.  I felt so relaxed for they entire visit.  Stacy did such a great job on the mammogram and Jordan did an excellent job on my US.  I got a letter with the results with 2 days!  Wow!  I will always return here for not only my mammograms but also if I ever need an MRI, x-ray, CT, etc for me or my whole family.  Nice change of pace in the medical world to have such great professional service!", "pics": null, "resp": {"time": 1579902368555, "text": "Kelly, Thank you so much for your kind words! We appreciate you taking time to give us your valuable feedback. Have a great weekend!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "101077220794400645130", "name": "D.Ann's Designs", "time": 1592685425403, "rating": 5.0, "text": "Newly remodeled center with care taken understanding Covid-19.  Fantastic staff, easy check in and Ladonya, my technologist is one of the best. It is a great place I would highly suggest to anyone. Brad Moss, the Administrator obviously cares about this center. Thank you", "pics": null, "resp": {"time": 1594845381166, "text": "We always love to hear positive feedback. Providing an elevated experience for every patient who chooses us is the goal of each of our team members."}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "103630314480407628730", "name": "Drew Rochelle", "time": 1574369426168, "rating": 5.0, "text": "The staff was professional as well as warm and friendly. I was very impressed with the staff and facility. They made an anxiety filled test a pleasant experience. If there was a six star rating I would have given that.", "pics": null, "resp": {"time": 1575310665766, "text": "We just wanted to thank you for the excellent review. Your kind words go a long way and will be shared with our staff. Have a fantastic week!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "115313267090571187858", "name": "Carol Drake", "time": 1617302058079, "rating": 5.0, "text": "Excellent tech, Anita!!", "pics": null, "resp": {"time": 1617386360822, "text": "Our team puts patients first and we’re glad our team’s dedication to providing an elevated experience is showing!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "100526156631664704104", "name": "Gene Welborn", "time": 1566328130599, "rating": 2.0, "text": "The technician was awesome!  She was polite and professional.  But I never got a report.  I called two weeks after my test and was told that reports \"typically\" go out within 4-5 business days.  I was told the only way I could get my report would be to drive 40-45 minutes one way back to the facility to pick it up.  After negotiating a bit, I got them to just mail me another one. I still have not received it.  A bit frustrating to go through the procedure and not be able to get my own results.", "pics": null, "resp": {"time": 1566423257124, "text": "We appreciate your feedback and the opportunity to improve our services. To ensure the privacy of our patients, our policy prevents us from responding to this matter in a public forum. Your comments are important to us and have been sent to our Center Administrator. We welcome further dialog. Please call 256-534-5600 to speak with someone in person. Thank you!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "117134850288144384472", "name": "Angie Alonso", "time": 1591196712093, "rating": 5.0, "text": "Very friendly and quick. Liked the atmosphere", "pics": null, "resp": null, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "107079917667617868336", "name": "Ron Burgundy", "time": 1530287463292, "rating": 5.0, "text": "As I was walking in a little early, they called my cell to confirm everything is ready and they're ready for me.  The MRI took just a couple days to setup and the results were almost instant. Easy, quick, painless imaging. Staff is super friendly and proficient.\n\nI can now walk without a cane or pain before 30!", "pics": null, "resp": {"time": 1530902820605, "text": "Thank you for your kind words and valuable feedback!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "112339104436206121690", "name": "Brian Bradley", "time": 1550800407353, "rating": 5.0, "text": "Had a Thursday apptmt at 12:45 and showed up on time. The Patient Care Coordinator at the desk was very pleasant and efficient taking my ID and insurance card, gave me a form to complete and withing five minutes of arriving was sent upstairs to wait for my diagnostic test. Filled out another one page form and again within 5 minutes the Technologist came and led me back to the room for the bone density test. She explained the procedure, answered my questions and was just super. Test was over in 10-15 minutes and she even walked with me back downstairs, said thanks for coming and wished me well. Excellent experience from my standpoint!", "pics": null, "resp": {"time": 1550853918824, "text": "Brian, Thank you so much for your positive feedback and 5-star review!  We appreciate you!!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "110190701805871028267", "name": "Michael Kelsey", "time": 1579029836644, "rating": 2.0, "text": "The check in staff was great, very friendly, professional and courteous. The technician(s) I had dealings with in back could use a refresher on how to deal with patients", "pics": null, "resp": {"time": 1579902811388, "text": "Michael,  We appreciate your feedback and the opportunity to improve our services. Your comments are important to us and have been sent to our center Administrator. If you would like to dialog further, please call 256-534-5600 to speak with someone in person. Have a great weekend!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "112741849417273987076", "name": "wanda Rhodes", "time": 1537821067043, "rating": 4.0, "text": "This was my first visit and i truly enjoyed the experience .Tia and Anita very friendly and very profoundly proficient at their job. The facility very clean and the atmosphete comfortable. Thanks Anita for making my bone scan comfortable for me.", "pics": null, "resp": {"time": 1537992530917, "text": "Thank you for your great review! We appreciate the time you took to give us your valuable feedback!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "101995665309129062728", "name": "Michelle Dixon", "time": 1465970089978, "rating": 5.0, "text": "Got there early and even though my appointment was awhile away, they still called me back fairly quickly. My x-ray tech was nice and respectful of my concerns and helped the process go by smoothly. Great people and great place!", "pics": null, "resp": null, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "101631688475996423872", "name": "Patty Bradford", "time": 1563235604118, "rating": 5.0, "text": "I have my mammograms done yearly at Outpatient Diagnostic Center. I am very pleased with my experience at ODC. Deana and Anita are very professional and courteous. I recommend my friends to ODC.", "pics": null, "resp": {"time": 1563296973658, "text": "Patty, Thank you for your kind words! We appreciate you!!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "104922496992841994262", "name": "Cathy Stevens", "time": 1575044274971, "rating": 5.0, "text": "This facility has been remodeled, and all testings are on one floor downstairs. Easy check in and all of the staff associates were friendly and professional.", "pics": null, "resp": {"time": 1575310229148, "text": "Cathy, Thank you for taking time to give us your feedback. We appreciate it! Have a great week."}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "111052244386056933598", "name": "Cheri Harr", "time": 1507748777724, "rating": 5.0, "text": "Wait time was good. My total visit was 45 minutes to get checked in, take images on 3 different locations of my body, then get images burned to a disc. Great customer service!", "pics": null, "resp": null, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "111921218530541996712", "name": "Adam Ray", "time": 1578335022779, "rating": 5.0, "text": "Friendly staff in a clean and newly remodeled facility.", "pics": null, "resp": null, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "117271675261091389136", "name": "Briana Wright", "time": 1541010737021, "rating": 1.0, "text": "Forget ever getting anyone on the phone or getting your results in a timely fashion. Frequently you'll be on hold for 10 minutes or more before the line just hangs up, and you basically have to come physically retrieve your results because they won't answer for your doctor's office either.", "pics": null, "resp": {"time": 1541084886830, "text": "Briana,  We appreciate the opportunity to resolve concerns and learn about ways we can improve our services and communication. We are sending your feedback to our Center Administrator. If you would like to speak with him as well, please call 256-532--2418. Thank you"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "117092143927874055192", "name": "Kristie Wetzel", "time": 1537825255603, "rating": 5.0, "text": "I've used Outpatient Diagnostics 4 times this year and just scheduled an appointment for an MRI (already had 2 xrays, a 3D mammogram, and 2 ultrasounds.  I HIGHLY recommend them.  From the office staff, imaging personal, wait time, swift results, and billing practices.  I have been incredibly pleased and will recommend them and continue to request them.", "pics": null, "resp": {"time": 1537992444999, "text": "Kristie, Thank you for your kind words! Your recommendation is our highest compliment. We appreciate you!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "115092293434191897005", "name": "NPC J", "time": 1498857825840, "rating": 1.0, "text": "Didn't have a wait that day payed my copay.  Turned around said I didn't pay and sent it to a collection agency.  All my other doctors have worked with me as I am fully disabled Vet and fighting for benefits with SSI.  What complete lack of care.  $32 dollars for collections. 1 phone call from them but already 3 or 4 from collections out of Texas. Still haven't gotten the results on my scans.", "pics": null, "resp": null, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "113444811636064714487", "name": "Beth Wood", "time": 1474313021973, "rating": 2.0, "text": "Although the staff here is phenomenal, the wait time is ridiculous.  My family doctor sent me here for x-rays .... I asked several times if I needed to make an appointment, but was assured x-ray need no appointment and I would be in and out fast.  This was Friday.  I came by and the person in front of me had extensive tests and it would be at least 2 hours before they got to me.  Understandable - said I would be back on my lunch break on Monday.  Again, was assured - this time by the check-in desk clerk - that daytimes were typically not busy and I probably would be in and out fast.  I have been here an hour and a half, after being told as I came in the wait would be about 15 minutes.  They do great work here, but I am very frustrated and unhappy with the wait time ...", "pics": null, "resp": null, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "101636786177103320956", "name": "asha lamy", "time": 1528722704369, "rating": 1.0, "text": "They left me standing in waiting room ( can't sit due to possible hip fracture) for 45 mins past scheduled appointment.  Tears streaming down my face from excruiating pain... I inquire: their tech no called no showed. Instead of telling me from onset so I could make a knowledgable decision they hid the fact as intensity of pain increased by the second. They had no care nor concern for patient trying ro stay upright in tears with extreme pain except to make a buck!  Now I lay here in my car in parking lot for the last 20 minutes waiting for pain to decrease so I can get home.  This place should be shut down by the state.", "pics": null, "resp": {"time": 1528737414050, "text": "We appreciate the opportunity to resolve concerns and learn about ways we can improve our services and communication. We are sending your comments to our Center Administrator. If you would like to speak with him as well, please call 256-534-5600. Thank you."}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "114349373647520835479", "name": "John Lary", "time": 1430175559811, "rating": 3.0, "text": "ODC Huntsville web page used to work perfectly and I could easily get my reports online. It appears that ODC has changed its web provider because their web page now works only sporadically. It is now a common occurrence that I cannot get my reports online while I am at the hospital. Quality of their reports is excellent, as usual, but I often CAN'T GET MY REPORTS ONLINE which creates a real problem for me.", "pics": null, "resp": null, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "100894051940458160874", "name": "Grace Taylor", "time": 1465853153191, "rating": 1.0, "text": "Yeah i was severely dussapointed in the treatment of the patients here. My mom has severe claustrophobia and they refused to et her have any antianxiety medication priory to MRI, nor would they letme sit with her while she had it done. In fact they forgot we were here and we had to wait an hour to even begin. Quite frankly I much prefer the BioImaging center as I waited a quarter of the time and was allowed company while i had the MRI done. Not to mention how much more polite the technicians were.", "pics": null, "resp": null, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "118157532268644402662", "name": "Stella Mitchell", "time": 1546267095073, "rating": 4.0, "text": "Staff are friendly and helpful.", "pics": null, "resp": {"time": 1546268052800, "text": "Hi Stella,\nThank you for your kind words and valuable feedback! Happy New Year!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "117036832357933335258", "name": "Jason S", "time": 1518797900163, "rating": 1.0, "text": "Got lost in the shuffle after I checked in so wasn’t given contrast on time for my scheduled scan.  Then they delayed the actual scan due to “insurance authorization” for a scan that was scheduled 3 days in advance.  They asked that I plan 2 hrs for the scan and I’m approaching 3 without being scanned.  (The actual scan takes less than 5 minutes)", "pics": null, "resp": {"time": 1519056885304, "text": "Jason, We appreciate the opportunity to resolve concerns and learn about ways to improve our services and communication. We are are sending your comments to our center Administrator, Chuck Miles. If you would like to speak with him as well, please call 256-534-5600. Thank you!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "109386384938170732485", "name": "Jerod Whisenant", "time": 1488898988986, "rating": 2.0, "text": "People are friendly but the wait time is outragous. I am sitting in the wait room now and have been here for 1hr and 15minutes and still haven't been called back.", "pics": null, "resp": {"time": 1488909613492, "text": "We know your time is valuable so we are so sorry that you waited longer than you should have in our center. We’ve identified the issue that led to your wait and we’ve resolved it so we appreciate you alerting us to the situation. We hope you’ll accept our apology for getting your day off to a slow start."}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
