{"user_id": "108544759362249658775", "name": "Roland Vance", "time": 1569694817463, "rating": 3.0, "text": "revouyt", "pics": null, "resp": null, "gmap_id": "0x88906701af1225e5:0xce0952fb0f35452e"}
{"user_id": "104869124303485503827", "name": "Jerome “PirateKing” Johnson II", "time": 1581488086406, "rating": 5.0, "text": "Very clean building bathrooms and all the room temp is actually not to cold or to hot and they seem to get you in and out of traffic court very quickly the judge there is fair and actually very helpful the fines are step though but gotta pay the price of the violation they make it easy though and I'm thankful", "pics": null, "resp": null, "gmap_id": "0x888923b265b8fe53:0xe98d81f4f0ae30de"}
{"user_id": "101546454464555403723", "name": "Lucas Payne", "time": 1621892172640, "rating": 1.0, "text": "Officer almost Hit me running a red light no sirens no emergency lights. I went immediately to the court house to report it 30 mins later a Sargent calls me an says he can meet me later to talk about it. Now if I had put someone's life in danger they policewoman be all over me but since it was just another cop abusing he's powers nothing is handled. Been outside the courthouse for about 30 mins I requested a officer to co.e talk to me but yet all I get is a phone call from a Sargent saying he's getting  he's oil changed an he can meet me later. HPD where's the honor or dignity? Enjoy my footage of the cop from my go pro.", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "104468058432505263145", "name": "james m", "time": 1620664834993, "rating": 5.0, "text": "I can't believe how low their review is, they're great!", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "100736090779519183777", "name": "Nolan Burton", "time": 1593336466039, "rating": 5.0, "text": "I've been caged from society 4 times for non payments of misdemeanor moving violations. This organization of law enforcement was the only team or committed civil servants that treated me like a child of God. I pray He keeps them safe as they continue working to provide a safe and prosperous community for the City of Hoover.\n\n#tbtg🙌", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "114278491861479783636", "name": "Matthew Lambert", "time": 1570462033417, "rating": 5.0, "text": "Professional, The Hoover PD Should Be The Standard For Other Police Departments.\n\nI Want To Give A Shout Out To\n\nOfficer Barnes\nAnd Officer Lowery\nTwo Of The Most Professional And Courteous Officer You'll Ever Meet.\n\nThe Hoover Police Department Truly Redefines What It Means To Serve The Public.\nThanks For All That You Guys Do And God Bless You All", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "103697119300454007644", "name": "LilVi", "time": 1591200158443, "rating": 1.0, "text": "This is actually horrible. Sticking your hand through people’s cars without reason, is violation of privacy. When I ask you what I did wrong I expect you to answer, not to continue your unwanted and unneeded search.", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "114126321545216928040", "name": "matt barrett", "time": 1593264001709, "rating": 5.0, "text": "Most professional and well trained department I know!", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "106768665561912731127", "name": "Andrei Bombin", "time": 1541098069765, "rating": 5.0, "text": "I was trying to get to the car service on a flat tier. The officer helped me to change it for an extra one, so I would not damage a wheel. Very nice of him!", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "117417771825565275614", "name": "Dave niudsiodv", "time": 1548526258170, "rating": 5.0, "text": "I was arrested and taken to their jail for 5 days, we were feed hot pockets and hungerman meals, had a huge 4K tv mounted on the wall in our cell block and every cell had its own shower. Best jail iv ever been to! Hate to be in a jail but this one is the best.", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "116937905297008614736", "name": "mehul patel", "time": 1543167807677, "rating": 1.0, "text": "“Graham vs Connor” isn’t a license for you to shoot first and do your job later (protect and serve). I wonder what version of the “I feared for my life” defense you will use.", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "117241438197601348012", "name": "Aaron Hawkins", "time": 1562617983597, "rating": 1.0, "text": "One set of rules for them… One set a rules for us. Double standard… As long as they ride around in those Hoover Police vehicles they can do whatever they want. Just because you have a badge doesn’t make you right.", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "111697741321165592187", "name": "Brandi Roberts", "time": 1576934792929, "rating": 5.0, "text": "Love my new city!!", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "105606172631982902654", "name": "Taylor Roden", "time": 1514999314674, "rating": 1.0, "text": "Called about a neighbor having domestic violence, stayed up for two hours in case they needed to talk to me, eventually went to bed because I didn't want to stay up any longer. Don't know if they ever came.", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "107627520643556162197", "name": "Lindi Pearson", "time": 1526758039567, "rating": 1.0, "text": "I hate everything about Hoover. I used to live there and have moved out because it has gotten so bad. And the police are more of a hindrance than a help.", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "116217101740041719697", "name": "Shun albo", "time": 1370160008428, "rating": 2.0, "text": "I allowed my daughter to attend the Rave in Hoover with friends because it was a good clean place. My daughter and friends were kicked out as they should have been as they were making noise. The problem came in when the management asked the 12 year old girls to leave the property instead of them waiting for their parents to arrive to pick them up around 8 pm at night. I thought this was irresponsible and not very professional. No matter what the issue was the girls should have been looked after a little better until the parents arrived. My daughter was in a state of panic and crying uncontrollable by the time my wife arrived to pick her up. Also, a white Hoover police officer quickly reminded me that I was black in Alabama very quickly as he agreed with the management about kicking the young black girls off of the property @ 8 pm then telling me that I was being a disturbance.. WOW! God Speed is all I got to say. This bad experience happen on 6/1/2013.", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "108776147928649311771", "name": "dewey seymour", "time": 1544107433374, "rating": 1.0, "text": "If the tape showed A black man shooting a police Hoover would release the tape to every tv news", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "107275082901345161735", "name": "Drew Sharpe", "time": 1553547625739, "rating": 5.0, "text": "There’s a reason Hoover is a great place to live!!!!", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "104294551098919214317", "name": "Angela Valentine", "time": 1599700808640, "rating": 5.0, "text": "Thanks😇", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "113758960898751406506", "name": "Treyson Burder", "time": 1416358008029, "rating": 1.0, "text": "hoover gives me a ticket to fix my headlight but messed up the date he gave it to me so now i half topay the fine when i fixed it the day he pulled me over", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "115003561455312122566", "name": "Carl White", "time": 1371753699310, "rating": 2.0, "text": "This is the worst place to vist, its sad to say but its the truth. The only way i go to hoover is if i have no choice, and everybody i know feels this way!!", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "108290060883878376300", "name": "Lorenso Perez", "time": 1378759504674, "rating": 5.0, "text": "(Translated by Google) Agency portal in huwe\n\nr in alabama\n\n(Original)\nAgencia porta en huwe\n\nr en alabama", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
