{"user_id": "108654884351566354484", "name": "Ben", "time": 1613523783378, "rating": 5.0, "text": "She is a fantastic teacher! Very knowledgeable, accommodating, and kind. Highly recommend her.", "pics": null, "resp": null, "gmap_id": "0x8889211ccef3808d:0xbf542a100ec98ebc"}
{"user_id": "111082965585508898263", "name": "Blake Dimick", "time": 1626011698482, "rating": 5.0, "text": "Just an honest to goodness guitar shop with the best damn luthier in the river region for repairs! Matt approaches each guitar as he would his own and his attention to detail is phenomenal. He just re fretted my 65 Fender Mustang and its never played better!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMX3HCh8eIsuBI0qq_kCBrMuK5N-gWU_gdfj1Cd=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPIHzBJGqq7TLD9bQjLwCIOnKPX0en220vIlmht=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN1FEbeB_qhydlmVQnKdg54dfsEU4DNugUx8Bpb=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP_fOLRRQrrjohU9tbxsN9gGMQ03hbjbLxs1uFR=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMBW8LT2MHUK7tUuKz83Sj3SPeVgP2k1h-WemgD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP2Ph3FLDP_TO3hQjv_y35n8RE0_fAiKlTbMT-K=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMEAMty-0sVY2RZuRNeUgWWym0N4EoLBFAVqI3Z=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNIvzMgcPvLguKqX22DffOZXFWUNGs6FYBCMzsI=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e8f898010aa09:0x5a795c202941b40e"}
{"user_id": "114939669254900723157", "name": "D “LowAndFast” G", "time": 1618608444890, "rating": 5.0, "text": "Tweed music is stellar! This place is really something special. Matt is a wealth of knowledge when it comes to all things music and the environment itself is very unique and inviting.", "pics": null, "resp": null, "gmap_id": "0x888e8f898010aa09:0x5a795c202941b40e"}
{"user_id": "107896198043083976200", "name": "Berrey Art", "time": 1616178842889, "rating": 5.0, "text": "I had a Fender Acoustic fall of my wall and cracked guitar pretty badly.  Matt ordered the original wood/material and hand fixed it back to original quality. Highly recommend! Great communication.", "pics": null, "resp": null, "gmap_id": "0x888e8f898010aa09:0x5a795c202941b40e"}
{"user_id": "111362700430829864905", "name": "Cameron Heyward", "time": 1541611644486, "rating": 5.0, "text": "I’ve never been to a guitar shop I like more than tweed. Matt’s knowledge and skill as a luthier Is incredible. I’ve had 5 guitars setup at this shop and they always come out perfectly. Matt has always been friendly and helpful regarding any questions or advice I need, and has never tried to up-charge or oversell me. If you’re looking for a great deal on a guitar, I’d also recommend stopping by. I’ve bought both an electric and acoustic here, and have gotten a great deal on both.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNGVPOIDhwNwtT8UORAUid1pWDS8Fn0tg_0Qo7P=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e8f898010aa09:0x5a795c202941b40e"}
{"user_id": "113791341213157573289", "name": "Terrence Coleman (tcoleman701)", "time": 1581363621034, "rating": 5.0, "text": "I'm just getting into playing guitar and had three new guitars in need of professional setup. Was getting the run around from the store I bought them and I was fortunate enough to find Tweed's. Matt was and is awesome! He was able to get my guitars setup on the same day and did a phenomenal job! The store has this very welcoming aura in addition to Matt's friendly and down to earth demeanor, you know your equipment is in great hands. Definitely will be a repeat customer, if you're looking for an amazing music store experience....look no further than Tweed. Highly recommend over any big brand store in the area.", "pics": null, "resp": null, "gmap_id": "0x888e8f898010aa09:0x5a795c202941b40e"}
{"user_id": "114434761404379476441", "name": "Glenn Mize", "time": 1518796194516, "rating": 5.0, "text": "Just had a complete set up done on my Gibson ES-335 Government Model and it is perfect. Great job and friendly atmosphere. Best in town.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMkrSg1KJMpXFXgXwrlO5xe9oHdUNzWAaIW6T3d=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e8f898010aa09:0x5a795c202941b40e"}
{"user_id": "103280268436993251278", "name": "Aric Huffman", "time": 1603063242289, "rating": 5.0, "text": "Absolutely amazing store, love the atmosphere, the service is always top notch, and the pure quality of the store is absolutely phenomenal, best around", "pics": null, "resp": null, "gmap_id": "0x888e8f898010aa09:0x5a795c202941b40e"}
{"user_id": "102252274900193000370", "name": "Paul Baker", "time": 1603828686263, "rating": 5.0, "text": "Matt can usually fix it but if he can't he will be the first person to tell you and probably know someone that can.", "pics": null, "resp": null, "gmap_id": "0x888e8f898010aa09:0x5a795c202941b40e"}
{"user_id": "100793162251275268110", "name": "Willard Sitz", "time": 1544148731749, "rating": 5.0, "text": "Edit: Worth the drive back to follow up. This is what a guitar shop should look and feel like.  Cool gear, big plush seating to take your time getting to know the guitar in your hands.  That guitar, by the way, at a reasonable price, with a rotating stock so it's different every time and an open workbench up front keeps your visits interesting.\n\nI love coming by to window shop. They were closed down back and July (12th) and agin today. Maybe one day I’ll get to go inside!", "pics": null, "resp": {"time": 1539374176626, "text": "Sorry man.  This is a one man operation and we are on family vacation this week. Drop by soon."}, "gmap_id": "0x888e8f898010aa09:0x5a795c202941b40e"}
{"user_id": "111284266159861616750", "name": "Rodney Dwyer", "time": 1467854243708, "rating": 5.0, "text": "Super friendly, laid back atmosphere, but he definitely knows guitars. Expert, professional, and approachable; unlike the big chain places that make you feel like an outsider.", "pics": null, "resp": null, "gmap_id": "0x888e8f898010aa09:0x5a795c202941b40e"}
{"user_id": "101278988856006170572", "name": "Mike Gossett", "time": 1537288344737, "rating": 5.0, "text": "Matt is the man and still the only tech I let touch my guitars. We moved away but Tweed is one of the places I make a point to stop in at every time I'm back in town.", "pics": null, "resp": null, "gmap_id": "0x888e8f898010aa09:0x5a795c202941b40e"}
{"user_id": "117967897362507003823", "name": "Soccer Storm", "time": 1544819976538, "rating": 5.0, "text": "Nice shop", "pics": null, "resp": null, "gmap_id": "0x888e8f898010aa09:0x5a795c202941b40e"}
{"user_id": "115497661270592548539", "name": "Bill McNabb", "time": 1625339052468, "rating": 5.0, "text": "Awesome Shop. The folks are class A people and coffee is always on! If they don’t have an item in stock Tara will find it for you. If you need repairs Bruce & Lucas will take care of you. Lots of guitars, amps etc… and on occasion you’ll find a few vintage pieces too. One of the last true Mom & Pops shops left!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOAIsynavZG_ikzCTCuWPpJyIpGRkx1aTg_J1qr=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "114878028731899487845", "name": "stephanie mason", "time": 1613248690161, "rating": 5.0, "text": "My daughter was the one who found this place with my aunt. They offer lessons for affordable prices, one less for $25 and four for $80. My daughter has been doing lessons for three months now. The atmosphere when you walk into the shop is welcoming and laid back, and they let you feel like you are family. I highly recommend coming here and being apart of it.", "pics": null, "resp": {"time": 1613251706141, "text": "Thanks Stephanie! Always a pleasure!"}, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "110698243929470186285", "name": "David Butler", "time": 1620859812660, "rating": 5.0, "text": "Went to guitar pro's and had a set up done on my acoustic. I was well pleased with my guitar. This place has a great selection of guitars,amps and accessories. And most of all these folks were friendly and helpful.The prices were great too.I really enjoyed meeting these folks. I'll be sure to go back when I need something.THANKS GUITAR PRO'S#😁", "pics": null, "resp": {"time": 1620861460179, "text": "Thanks David!!"}, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "105312123091634172670", "name": "Jay Jordan", "time": 1616911307908, "rating": 5.0, "text": "Lovely small town guitar store. I’ve bought several guitars from here and never had a bad experience, great atmosphere for guitar lovers and a surprisingly large stock for such a small building!", "pics": null, "resp": null, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "103227329936303211425", "name": "Your Mom", "time": 1612999167702, "rating": 5.0, "text": "I’ve had all of my guitars worked on here and its always amazing work. very reasonable prices on gear AND repairs!! Thanks guitar pros :)", "pics": null, "resp": {"time": 1613073688065, "text": "Thank you. It's our pleasure to serve you!"}, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "107102369561358510410", "name": "ThumperDelta Resistance", "time": 1613065612181, "rating": 1.0, "text": "WAS our trusted source for guitars and gear.\nTook in a Seagull acoustic to have the battery and strings replaced at the end of December 2020(only having someone else do it because of the value of the guitar).\nThe battery went dead MUCH faster than normal (usually takes 6 months). We are very aware that leavi g guitars plugged in drai s the battery. That was NOT the case here. We took it out and found they had installed a promotional  Progressive Insurance smoke detector battery in it. Instead of what we are used to getting, Energizer or Duracell. I called and was told that we should have told them we wanted a better battery. It cost us more than $30 for the strings and a battery replacement. No offer to replace it. The lady said they just use whatever is \"handy\". I don't pay for what's handy. So much for being Pro's. If the lady had simply apologized, that would have been the end of it. I wasn't looking for anything other than to let them know that a substandard battery had been installed. When we brought it in initially, we asked for the strings to be changed and the battery replaced. No one told us at that time that we weren't being charged for the battery, just that what we asked for was $30, if I had been advised of that I would have either asked for a better battery or brought my own. I hung up when her tone told me how disgusted she was that I called with a problem. As for my other reviews of other businesses you mentioned, I review honestly and fairly. If you notice, I have many very positive reviews of several companies in the area. I managed customer service depts with 4 Fortune 500 Companies in my career. Again, I wasn't asking for anything except courtesy, which was unfortunately lacking. The lady I spoke with had a \"how dare you complain\" kind of attitude. (modified for clarity based on the reply from the company)", "pics": null, "resp": {"time": 1613061791399, "text": "We did not even charge you for a battery, however we did offer to replace the battery just before you hung up. We always strive to please ALL of our customers. Sorry about your bad experences with all the other bussinesses around town as well."}, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "109238400428018410613", "name": "XL A", "time": 1595694249657, "rating": 5.0, "text": "A fantastic, friendly guitar shop. I have taken my daughter's and my guitars there to be repair and adjusted, for some years now. Quality and price can't be beat by any other shop I have visited. They have a wide variety of instruments, amps, drums, electronics, accessories, at great prices. Don't miss out on such a great local business.", "pics": null, "resp": {"time": 1595738766311, "text": "Thank you so much! We love what we do, and we love helping nice people like you!"}, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "110479057903178365025", "name": "Daniel Entrekin", "time": 1608167086993, "rating": 5.0, "text": "Such a friendly and helpful staff! Made me feel like a VIP and I’ll be coming back! Shop local", "pics": null, "resp": {"time": 1611801880453, "text": "Thank you Daniel!"}, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "103656396919140354650", "name": "Ken Chaney", "time": 1595888321365, "rating": 5.0, "text": "Love this store and the people who own it.  I try to buy locally when I can.  This is a very friendly place to visit and I go there often.  This store is locally owned so please try to get by there instead of always ordering on line.", "pics": null, "resp": {"time": 1595892107853, "text": "Thanks Ken! See you soon!"}, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "111427525628536781185", "name": "Terry Butler", "time": 1605124125338, "rating": 5.0, "text": "Bruce and Tara are the most wonderful people you will ever meet, and I highly recommend Guitar Pro's LLC to everyone !", "pics": null, "resp": {"time": 1611801844297, "text": "Thank you Terry!"}, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "116920443114862704745", "name": "Scott Fleming", "time": 1593123868923, "rating": 5.0, "text": "I would recommend to everyone.\nThey offer a large selection of products, and services.\nBest of all they have an amazing staff that are:\nvery friendly, helpful, and knowledgeable.", "pics": null, "resp": {"time": 1593143496066, "text": "Thanks Scott! Please come visit us!"}, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "109190710441088664792", "name": "Justin Manis", "time": 1602442688006, "rating": 5.0, "text": "Went in just to look around and put a guitar in may away affordable prices along with an amazing selection of instruments to choose from not to mention the friendly staff no pressure to buy I was left alone to shop played several guitars I’ll definitely be buying again soon", "pics": null, "resp": {"time": 1602444675047, "text": "Thank you Justin!"}, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "116683736307500866098", "name": "Russell Rich", "time": 1603114394070, "rating": 5.0, "text": "Very nice people and helpful on the information I was seeking concerning a musical instrument", "pics": null, "resp": {"time": 1603116936138, "text": "Thank you Russel!"}, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "106464911465936321014", "name": "Dan Skinner", "time": 1570136888294, "rating": 5.0, "text": "Hey Chris, this is Daniel Skinner from AT&T. Leaving a 5 star review for your shop even though I'm in Dallas now. Haven't even been to your new store but I know you and your folks are doing an awesome job. Miss you sir!", "pics": null, "resp": {"time": 1611802052371, "text": "Thanks Dan but Chris has moved to South Al.  New owners now, thanks!"}, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "110528245155528944299", "name": "Judith Adamson", "time": 1583005887640, "rating": 5.0, "text": "We visited for the first time last week. These folks are awesome! My 16 year old son is taking up electric guitar. They are so friendly, knowledgeable and helpful.", "pics": null, "resp": {"time": 1583501248993, "text": "Thank you Judith!"}, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "104760699149621371466", "name": "Deez Balls", "time": 1591811038262, "rating": 4.0, "text": "Have a decent variety of all different kinds of cords and instruments and the guitars rule great prices too. And the lady in there is always super sweet", "pics": null, "resp": {"time": 1611801976903, "text": "Thanks for the kind review! (ha ha deez balls!)"}, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "111983041715815749331", "name": "Jeff D", "time": 1543367301637, "rating": 5.0, "text": "I like this store.  Good selection. Friendly folks.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPWSu-BJlniIvlG64P2ocnoYZduNPXnPdEBOGHk=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "108211169815049148258", "name": "Mason Howard", "time": 1618529374000, "rating": 4.0, "text": "Friendly staff they have a few harmonicas", "pics": null, "resp": null, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "100146978305415361363", "name": "Christopher Fink", "time": 1540252238721, "rating": 5.0, "text": "Very friendly staff and excellent customer service.\nMy guitar setup exceeded my expectations and she plays better than ever.  He does amazing work, and prices are very affordable!\n\nGood turn-around as well. Overall, a very good experience!", "pics": null, "resp": null, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "116880977641373127199", "name": "Lucas Clark", "time": 1568240410240, "rating": 5.0, "text": "Great family owned guitar store. The prices are amazing and so is the inventory. The repair work has a quick turn around and it’s phenomenal.", "pics": null, "resp": null, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "111198036056689853633", "name": "Kenny Johnson", "time": 1583471102068, "rating": 5.0, "text": "I bought an Epiphone les Paul special and a few things to get started again after a 4 year break of playing guitar. The woman that helped me listened to what i had to say  instead of trying to sell me things I didn't need or want. I came back a few days later because the overdrive on my amp quit working, the same woman helped me when i needed to decide whether i should buy a new amp or a distortion pedal. Once again she listened to me and my concerns instead of trying to get me to spend more money than i needed. I'd give this place 100 stars if i could but unfortunately 5 stars is the max. I'll be heading back in a few weeks  for more supplies even though i could just order online. Guitar Pro's LLC has made me into a loyal customer. Keep up the good service.", "pics": null, "resp": {"time": 1583501220444, "text": "Thank you Kenny! We are glad to help!"}, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "113038026120868303999", "name": "Joshua Spencer", "time": 1565818697988, "rating": 5.0, "text": "Awesome folks, and a nice guitar selection.   First time in the store but they really made me feel like family.   Go here.   Buy stuff.   🤘", "pics": null, "resp": {"time": 1583503732765, "text": "Thank you Joshua!"}, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "115954597366864397613", "name": "Billy Barron", "time": 1591400660506, "rating": 5.0, "text": "Great place people very friendly and willing to help.", "pics": null, "resp": {"time": 1591407032157, "text": "Thank you Billy! We are glad to have you visit us!"}, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "109953743011502740530", "name": "Josh Johnson", "time": 1543166348966, "rating": 5.0, "text": "Love this store!!! Everybody is very nice and super helpful!!! Everytime I need a new piece of equipment I come here first. If there was an option for 10/10 I would give it that rating", "pics": null, "resp": null, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "101914403592574792749", "name": "J. Marcus R.", "time": 1547783093540, "rating": 5.0, "text": "Another 5 stars. Bruce and his people took care of the when I was in a pinch (and he was already busy) . Great people, not to mention an awesome shop with some nice guitars", "pics": null, "resp": {"time": 1612836650737, "text": "Thanks! It is our pleasure is to help our people. Come visit us!"}, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "101510991491509072784", "name": "Jeff", "time": 1545623116666, "rating": 1.0, "text": "I bought a guitar for $2,875 from this shop online and they listed it as mint condition.  I had to take it to a local luthier to have the frets polished because they were so dirty the guitar was unplayable.  The shop refused to even split the cost ($50),  wow!  Incredible.", "pics": null, "resp": null, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "106482378290991970321", "name": "Caren Alexander", "time": 1464974560210, "rating": 5.0, "text": "Awesome store. They are super friendly and know their stuff. It's great for buying new or used guitars as well as accessories. They will also fix your old one up to sound new again. I wouldn't go anywhere else.", "pics": null, "resp": null, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "107939093335296542200", "name": "GoldTop556", "time": 1606504059830, "rating": 5.0, "text": "Good folks here", "pics": null, "resp": {"time": 1611801855903, "text": "Thank you!"}, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "109166713516932993242", "name": "Derek Jman", "time": 1558391404349, "rating": 5.0, "text": "Tara amd Bruce are great people and everyone should come here for their musical needs. Drums, amps, guitars, you name it!", "pics": null, "resp": {"time": 1583503763866, "text": "Thank you Derek!"}, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "108058189945823382593", "name": "Steve Taylor", "time": 1384455361459, "rating": 5.0, "text": "Had a 1980 Electra guitar worked on at Guitar Fx and man did it come out great. They straightened out the neck put new strings on it adjusted the pick ups fixed the tuners and now it plays like new again. Thanks Chris and staff. I highly recommend your store to all my friends and family.", "pics": null, "resp": null, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "116522864387449560056", "name": "Dawn Campbell", "time": 1513413948435, "rating": 5.0, "text": "Guitar Pros donated a guitar for a give away to one of the Wounded Warriors Christmas Party and I am the luck winner.  I am so grateful for my early Christmas present. Thanks so much.", "pics": null, "resp": null, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "102339187009916679443", "name": "Chaz Harrison", "time": 1504966583914, "rating": 5.0, "text": "This is where i go to buy anything music, We have even got our daughter into drum lessons. Every person in the store is nice and more than willing to answer questions and help out how they can.", "pics": null, "resp": null, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "109241306641530356581", "name": "Z Dawg", "time": 1557440102273, "rating": 5.0, "text": "Great service, great people, great gear. What more could you ask for.!", "pics": null, "resp": {"time": 1583503791628, "text": "Z Dawg! Our pleasure!"}, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "117827143956213278761", "name": "Biancah Mckinney", "time": 1592420631590, "rating": 5.0, "text": "Great customer service and very professional!!!", "pics": null, "resp": {"time": 1595892143373, "text": "Thanks Biancah!"}, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "117583788027914344480", "name": "Jason Gaiters", "time": 1504908100212, "rating": 5.0, "text": "I just went in to browse the guitars. This place has a very amazing selection and the guy that greeted me was super friendly. I'll be going back for lessons soon. 5/7 (10/10) would stop by again!", "pics": null, "resp": null, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "100269513336625560117", "name": "David Henning", "time": 1492099837074, "rating": 5.0, "text": "I've been there twice and both times I was treated better than I deserve.  They took special care with my vintage bass and did the repairs at a reasonable price.  Great selection.  Friendly, helpful staff.  So good to have a dependable music store in Trussville.  ** Don't miss the store.  You have to pull into the Dollar General parking lot to get to the store.  They are across from DG.", "pics": null, "resp": null, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "113749112964285330460", "name": "Hollie Perry", "time": 1474948803762, "rating": 5.0, "text": "I loved this place because the owner took time and effort to help me understand the differences between styles and sounds of the guitars and other musical instruments he currently had in store that my son is interested in. Most definitely will be returning customers.", "pics": null, "resp": null, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "107867058420891542942", "name": "Jerry Parmer", "time": 1507926811029, "rating": 5.0, "text": "Unlike the big high volume stores that are only there to push products the sales staff are always willing to take the time to offer assistance.", "pics": null, "resp": null, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "116073610905678569502", "name": "Scott Henderson", "time": 1501621887612, "rating": 5.0, "text": "Awesome staff. Great vibe", "pics": null, "resp": null, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "113075699454769757813", "name": "Darryl Gulley", "time": 1556924416309, "rating": 5.0, "text": "Great people great price", "pics": null, "resp": null, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "113772304621434450338", "name": "Jeron Albrets", "time": 1504908226824, "rating": 5.0, "text": "Good people, very nice environment, and great prices!", "pics": null, "resp": null, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "114122467121120674789", "name": "Marcy Sharit", "time": 1530319429465, "rating": 5.0, "text": "Nice folks!", "pics": null, "resp": null, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "117183858069853639631", "name": "Indigenous Squad", "time": 1502567210073, "rating": 5.0, "text": "👍👍👍👍", "pics": null, "resp": null, "gmap_id": "0x88890ce330095739:0x1dd78a25845e9c6f"}
{"user_id": "116424553708840109874", "name": "Michael G", "time": 1583767735842, "rating": 5.0, "text": "The Alabama Symphony continues to provide Alabama with a top-notch, professional and expressive body of musicians under the incredible leadership of Carlos Izcaray. We are so lucky to have this group enriching our artistic culture in central Alabama. If you haven't been out to see them yet, you are seriously missing out. Talented soloists all, incredible guest artists, and a wonderful volunteer choir make for a formidable entity that needs our continued support. Student tickets have been and hopefully always will be just $10!", "pics": null, "resp": null, "gmap_id": "0x88891a4dc45f8f17:0x502617aad881ff7d"}
{"user_id": "102524790876188729970", "name": "Dr. Cherie Johnson", "time": 1583196223694, "rating": 5.0, "text": "I absolutely love the ASO.  They have phenomenal guest performers at their POP series.  My child loves the symphony and it is a joy we can bring her to these concerts. Venues are great, performances are wonderful, and choices of music are outstanding.  Thanks ASO for all your hard work!", "pics": null, "resp": null, "gmap_id": "0x88891a4dc45f8f17:0x502617aad881ff7d"}
{"user_id": "117726157811820724649", "name": "Rochelle Simms", "time": 1583179025725, "rating": 5.0, "text": "We have subscribed to the ASO Super Pops concerts for several years.  We have enjoyed every performance we have attended.  The most recent one was on February 29, 2020 when the orchestra paid tribute to Nat King Cole. The guest performer, Denzal Sinclaire was OUTSTANDING! Hearing him sing \"Mona Lisa\" was in itself worth the cost of a ticket.", "pics": null, "resp": null, "gmap_id": "0x88891a4dc45f8f17:0x502617aad881ff7d"}
{"user_id": "115336395224189182640", "name": "Katherine McNeill", "time": 1568164566705, "rating": 5.0, "text": "We are blessed to have this amazing orchestra giftung us this both pops and classical offerings. Plus, many educational oporunities", "pics": null, "resp": null, "gmap_id": "0x88891a4dc45f8f17:0x502617aad881ff7d"}
{"user_id": "103590627958609030900", "name": "Steve Gentry", "time": 1557245061666, "rating": 5.0, "text": "ASO.. Fantastic music .", "pics": null, "resp": null, "gmap_id": "0x88891a4dc45f8f17:0x502617aad881ff7d"}
{"user_id": "100778477980612477012", "name": "Glenn Michael", "time": 1520995717007, "rating": 5.0, "text": "Excelente world class classical music", "pics": null, "resp": null, "gmap_id": "0x88891a4dc45f8f17:0x502617aad881ff7d"}
