{"user_id": "100713594595749726190", "name": "Captain Spalding", "time": 1628021559710, "rating": 5.0, "text": "The owners of this shop are more than friendly, extremely knowledgeable and helpful. I have been in a few times to buy Delta 8 and I am always greeted an helped in a manner that I have never experienced at a shop before.", "pics": null, "resp": {"time": 1628022649208, "text": "Thank you Captian Spalding!\nWe hope to see you soon."}, "gmap_id": "0x8892ed245eca9a8f:0xd54fd347d448abed"}
{"user_id": "113211358193009507222", "name": "Tammy Yerian", "time": 1626720603336, "rating": 5.0, "text": "The employees, husband and wife are very knowledgeable and will even give you a free sample. I have tried many things for my pain. I'm tired of all the prescription drugs and they don't really even help. So I have tried CBD and Delta 8 products, BUT, what  you buy here is  NOT the same as what you are buying at a convenience store.The CBD Salve helped me ALOT.I was skeptical to try it but I am glad I did!", "pics": null, "resp": {"time": 1626721925556, "text": "Thank you Tammy, we are happy to hear that you are doing well!"}, "gmap_id": "0x8892ed245eca9a8f:0xd54fd347d448abed"}
{"user_id": "114822964926096135350", "name": "Erasethesanity 2", "time": 1615098804744, "rating": 5.0, "text": "This place is amazing. I stopped by for the first time today and bought a couple grams of delta 8 flower. The prices are great and they were nice enough to throw in a few samples of some edibles that I've been curious about. I decided to try out the couple of cbd gummy samples tonight and have been very pleased with the effects. I've felt calm and mellow most of the night and definitely plan on stopping back by soon to get more of them!", "pics": null, "resp": {"time": 1615121283575, "text": "Thanks, we are happy you are happy. 😊"}, "gmap_id": "0x8892ed245eca9a8f:0xd54fd347d448abed"}
{"user_id": "105166591581587229938", "name": "Troy Warrior", "time": 1598656096045, "rating": 5.0, "text": "Let me start by saying the owner is a CBD king. He knows his stuff and explained everything in full detail. You can tell he’s passionate for helping others. I got a bottle of 500mg and a free samples pain salve. CBD helped With my back pain, trouble sleeping, anxiety and just makes me feel better overall.\n\nThe owner also gave me ride home since I walked to his store. He’s a really nice guy.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNQJyIWUg3j5BnWReEaFs-zuet5xB2FtPPTGa_o=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOklLJ3-xlSaqHX1X8gDq1UIxfGUQUFLarx9o5s=w150-h150-k-no-p"]}], "resp": {"time": 1598659513628, "text": "It was a pleasure to meet you today! Glad to help anytime. Thank you for your business!"}, "gmap_id": "0x8892ed245eca9a8f:0xd54fd347d448abed"}
{"user_id": "102932803674083283588", "name": "Jordan W", "time": 1628186718254, "rating": 5.0, "text": "I LOVE this place. Best prices in Dothan. VERY knowledgeable and professional staff. Clean, relaxing atmosphere", "pics": null, "resp": {"time": 1628188568281, "text": "Thank you Jordan!"}, "gmap_id": "0x8892ed245eca9a8f:0xd54fd347d448abed"}
{"user_id": "108348417263327398941", "name": "Nancy Lipford", "time": 1622762363763, "rating": 5.0, "text": "BEST CBD SALVE FOR PAIN .... ABSOLUTELY LOVE IT\nIT WILL ALWAYS BE MY GOTO STORE FOR CBD THANKS FOR THE GREAT SERVICE", "pics": null, "resp": {"time": 1622765718721, "text": "So happy to hear it! We appreciate you!"}, "gmap_id": "0x8892ed245eca9a8f:0xd54fd347d448abed"}
{"user_id": "108666697480486140055", "name": "Johnny Hellco", "time": 1615044547540, "rating": 5.0, "text": "Staff is always very friendly and knowledgeable. They have a good selection but they do sell out a lot because their prices are so competitive.", "pics": null, "resp": {"time": 1615045687276, "text": "Thanks Johnny!"}, "gmap_id": "0x8892ed245eca9a8f:0xd54fd347d448abed"}
{"user_id": "112578653179841028220", "name": "Ashley B", "time": 1602867014695, "rating": 5.0, "text": "Stopped into Natures Pointe to see about some CBD oil for our fur babies and the owner was so nice and informative.\n\nIf you’re looking to explore CBD options go check them out!", "pics": null, "resp": {"time": 1602869689964, "text": "Thank you Ashley it was a pleasure to meet you today. We appreciate your business."}, "gmap_id": "0x8892ed245eca9a8f:0xd54fd347d448abed"}
{"user_id": "101846508056979373111", "name": "Schyler McCrary", "time": 1629912540216, "rating": 1.0, "text": "I tried to call and they hung up in my face", "pics": null, "resp": {"time": 1629972678585, "text": "We would never hang up on a customer. I am sorry you had trouble contacting us. Please call anytime."}, "gmap_id": "0x8892ed245eca9a8f:0xd54fd347d448abed"}
{"user_id": "107914691723525740111", "name": "Shannon Turvin", "time": 1596579878167, "rating": 5.0, "text": "Very knowledgeable, as well as very kind when i go in. They showed me the right drops I needed for migraines. So thankful!!", "pics": null, "resp": {"time": 1596587823129, "text": "It was great to work with you and glad we could help! Thank you."}, "gmap_id": "0x8892ed245eca9a8f:0xd54fd347d448abed"}
{"user_id": "117207104772156306162", "name": "Meagan McAllister", "time": 1594912513526, "rating": 5.0, "text": "This place is awesome. If you have bad anxiety or insomnia these gummies help. Great people very informative...", "pics": null, "resp": {"time": 1594916280748, "text": "Thank you Meagan, glad to hear our gummies are helping you!"}, "gmap_id": "0x8892ed245eca9a8f:0xd54fd347d448abed"}
{"user_id": "111648537394537837201", "name": "Hilda Brown", "time": 1576018084423, "rating": 5.0, "text": "Super informative, I bought their pain salve after trying a sample. It really helps with my neuropothy.", "pics": null, "resp": {"time": 1576084778505, "text": "Thanks Hilda! Our pain salve is a great product, and we are happy that it is helping you with your neuropathy."}, "gmap_id": "0x8892ed245eca9a8f:0xd54fd347d448abed"}
{"user_id": "110967625143012436762", "name": "Matt", "time": 1605740794696, "rating": 5.0, "text": "Has exactly what I want, SUPER friendly! Delta 8 Carts!", "pics": null, "resp": {"time": 1605751333925, "text": "Glad we had what you needed! Thanks 😊"}, "gmap_id": "0x8892ed245eca9a8f:0xd54fd347d448abed"}
{"user_id": "105765771214453690075", "name": "Nancy Newman", "time": 1626451447536, "rating": 4.0, "text": "Great products", "pics": null, "resp": {"time": 1594490341386, "text": "Thank you and hope to see you soon!"}, "gmap_id": "0x8892ed245eca9a8f:0xd54fd347d448abed"}
{"user_id": "112977360905480999506", "name": "Justin A. Hammonds", "time": 1570655552919, "rating": 5.0, "text": "Raley and the Happy Healing team are a True beacon of hope in Thomasville, Alabama.\n\nI no longer have to \"self medicate\" with illegal drugs or continue to suffer financially after Medicare refused to continue to pay for Invega (I have schizophrenia bi-polar type Invega is $3,000 per shot w/o insurance and I used to take it monthly).\n\nThe entire team including Raley, took the time to PERSONALLY explain the health benefits.  They understood my smoker's background, and I immediately realized although I love smoking, the current \"war on drugs\" is obviously avoidable...\n\nI always pick smoke-able, and I like Southern Ape and one better kind but forgot the name.\n\nMany colored ppl I know (I'm also Black) shun this type of value, while they choose cr** instead.  I wish more people would realized how blessed we are to have SOME (very few) honest and ethical people in Thomasville.\n\nAnd they're priced 3x's less than \"street drugs\"...\n\nThank you. God Bless.  I needed them, they helped and supported even though my closest connections did not.", "pics": null, "resp": {"time": 1569874265662, "text": "Thank you so much for taking the time to leave a review.  We are happy to be a small part of helping you to feel better!  We look forward to seeing you many more times."}, "gmap_id": "0x888545ef31d01715:0xa518e1ac4bf80405"}
{"user_id": "107977750410342233386", "name": "Big EL", "time": 1566623298949, "rating": 5.0, "text": "Awesome people & a great selection of CBD products. If you have trouble sleeping, have aches & pains, or anxiety, go see these folks, they will find something to help you!!", "pics": null, "resp": {"time": 1566685921612, "text": "Thank you so much!  We believe in helping our customers find just the right product(s) that will work for them."}, "gmap_id": "0x888545ef31d01715:0xa518e1ac4bf80405"}
{"user_id": "107541997812362849726", "name": "Nikolas", "time": 1611250671777, "rating": 5.0, "text": "The clerk was very helpful. I'll definitely be back!", "pics": null, "resp": {"time": 1611444227310, "text": "Thank you Nikolas for your review 😊"}, "gmap_id": "0x8889cbc087eb3d75:0xb8652080346a55d0"}
{"user_id": "103054153749861473681", "name": "Haygood Farms", "time": 1583685529796, "rating": 5.0, "text": "Super friendly and knowledgeable people. Great looking store and products.", "pics": null, "resp": null, "gmap_id": "0x8889cbc087eb3d75:0xb8652080346a55d0"}
{"user_id": "114056144009073062916", "name": "Magan Johnson", "time": 1555560110843, "rating": 5.0, "text": "The staff is so helpful and knowledgeable. They have any product you can think of and will help you find the perfect one. Highly recommend", "pics": null, "resp": null, "gmap_id": "0x8889cbc087eb3d75:0xb8652080346a55d0"}
{"user_id": "108100778542682893272", "name": "Brandy Chambers", "time": 1554204755972, "rating": 5.0, "text": "Love this place! It's not just about having a ton of products. It's about knowing your products inside and out and how they affect your wellness. Every person is different and Aleah took the time to ask more questions to find the most beneficial products for me and I couldn't be happier with the experience. I will be back!", "pics": null, "resp": null, "gmap_id": "0x8889cbc087eb3d75:0xb8652080346a55d0"}
{"user_id": "105772568839110405675", "name": "Debora Veal", "time": 1559862435915, "rating": 1.0, "text": "Have purchased from this shop several times this past month. Each time I have been dismissed and left standing when other customers come in. Just because I'm coming by after work does mean I don't deserve respect as a customer. I always pay cash as well. I will be traveling out of Cullman and my money will be going with me or ordering online in the future.", "pics": null, "resp": null, "gmap_id": "0x8889cbc087eb3d75:0xb8652080346a55d0"}
{"user_id": "117183545213775183684", "name": "Lori Beyard", "time": 1618362208584, "rating": 5.0, "text": "Seaborn was so very helpful with my questions when I called before going up to the shop (which is super nice by the way). Based on the information he was able to relay to me and his ability to ease my worries on product quality, I immediately headed that way. Both he and the clerk working were just as wonderful and helpful in person. I haven't used the product long enough yet but I'm sure it will be great after finding out about the quality control they have and the fact that their product is organically grown. Thank you guys!\n\nEDIT: I have since had a chance to try their Delta 8 product. His formula and it being clean and organic makes it extra special. Helped with my pain level exponentially.  Highly recommend this shop. And they will answer and and all questions you may have. Wide range of CBD products besides Delta 8. Soaps and creams too. Wonderful experience!!", "pics": null, "resp": null, "gmap_id": "0x889293444f1a8183:0x542389c1a9a94630"}
{"user_id": "103873190250586192294", "name": "John Lott", "time": 1626445579429, "rating": 5.0, "text": "We have been to Denver, and other multiple dispensories, Well Rooted is by far the best. Knowledgable, courteous. Great to tell my testimonoy and hear how CBD is healing people. Thank you for helping people live fruitfull lives.", "pics": null, "resp": null, "gmap_id": "0x889293444f1a8183:0x542389c1a9a94630"}
{"user_id": "117578402723235778419", "name": "Travis Tew", "time": 1621079174554, "rating": 5.0, "text": "Top quality products and great selection!  Very friendly and knowledgeable staff!!  Highly recommend for all your CBD products!", "pics": null, "resp": {"time": 1621268686886, "text": "Thanks for coming in Travis!  We look forward to seeing you soon!"}, "gmap_id": "0x889293444f1a8183:0x542389c1a9a94630"}
{"user_id": "110850120635650303157", "name": "Jeff Atkins", "time": 1621208762252, "rating": 3.0, "text": "High prices. Products are good. Lady there said she was guessing on what product to recommend.", "pics": null, "resp": {"time": 1621268561319, "text": "Good Morning Jeff!  Thank you for your business!  We try our very best to recommend a product that is appropriate to each customer.  Sense we are all react differently to natural remedies,  sometimes our suggestion is simply taking our best guess at what might work best for you.  We pride ourselves in having the best pricing in town when it comes to high quality products & we hope you are having great results & we hope to see you again soon!"}, "gmap_id": "0x889293444f1a8183:0x542389c1a9a94630"}
{"user_id": "106593590443313740520", "name": "joyce lewis", "time": 1611020731135, "rating": 5.0, "text": "I’m so forever grateful for you guys at Well Rooted. I had to stay in Dothan for about 6 months with my dad while he was sick. My brother introduced me to these guys and it really help stimulate my mind. I started giving my dad a smoke of the Sour Space candy CBD at night, and eventually his kidneys started working over time. My left knee is healed, I no longer need a cane to walk with. My dad ended up passing away the last Saturday in, September of 2020. I’m back home in, Jacksonville and will forever remember you guys.", "pics": null, "resp": null, "gmap_id": "0x889293444f1a8183:0x542389c1a9a94630"}
{"user_id": "101355378916085046974", "name": "Dawn Finch", "time": 1616002602755, "rating": 5.0, "text": "Really friendly and knowledgeable. Wonderful products and cute store.", "pics": null, "resp": null, "gmap_id": "0x889293444f1a8183:0x542389c1a9a94630"}
{"user_id": "102565970191814935601", "name": "Rob Harrell", "time": 1584125514539, "rating": 5.0, "text": "Really cool little shop!  Very relaxing atmosphere with friendly and well informed customer service!  Different from all the other pop up CBD stores.  This place is legit and truly dedicated to enriching the lives of their customers. There is also cool, unique art and furniture for sale. I use the soaps and gummies isolate. Great natural way to take the edge off. They truly have something for everyone!", "pics": null, "resp": null, "gmap_id": "0x889293444f1a8183:0x542389c1a9a94630"}
{"user_id": "105154063048270807120", "name": "Grayson Wood", "time": 1584308751729, "rating": 5.0, "text": "Well Rooted has a warm and friendly atmosphere. The customer service is attentive and informative. They have a lot of unique art created by local artists. They also have vintage furniture. I have seen something new every time I go. They have a wide array of CBD products to choose from as well.\n\nI got a small cool sculpture for my coffee table and a vinyl. The CBD products I have gotten from them met all of my expectations, excellent quality.", "pics": null, "resp": null, "gmap_id": "0x889293444f1a8183:0x542389c1a9a94630"}
{"user_id": "105100529185547552384", "name": "Pamela Hallford", "time": 1584373459348, "rating": 5.0, "text": "The shop is just the cutest thing with awesome artwork, home decor items and vintage furniture! They have something for everyone with the friendliest staff in town.  Love it!", "pics": null, "resp": null, "gmap_id": "0x889293444f1a8183:0x542389c1a9a94630"}
{"user_id": "102774160552839920412", "name": "Jeffrey Ray", "time": 1624490891718, "rating": 5.0, "text": "This is the #1 place for Delta 8", "pics": null, "resp": null, "gmap_id": "0x889293444f1a8183:0x542389c1a9a94630"}
{"user_id": "111744272556037958094", "name": "Heather Peoples Wood", "time": 1586548726420, "rating": 5.0, "text": "Love this little shop. Quality CBD and the unique storefront is just so much fun.  Staff is very helpful and warm. Only place I plan to purchase my cbd!", "pics": null, "resp": null, "gmap_id": "0x889293444f1a8183:0x542389c1a9a94630"}
{"user_id": "110754191119352989444", "name": "brandesha potter", "time": 1593647743347, "rating": 5.0, "text": "Very knowledgeable about thier product and all staff extremely friendly and helpful!! Definitely a repeat customer!!", "pics": null, "resp": {"time": 1593653604370, "text": "Thank you so much!  We are glad we could help and look forward to seeing you again soon!"}, "gmap_id": "0x889293444f1a8183:0x542389c1a9a94630"}
{"user_id": "112973765664424450633", "name": "Jessica Givens", "time": 1584128903205, "rating": 5.0, "text": "We bought some of the lavender CBD cream and have been loving the results. Great atmosphere and very helpful staff. We love Well Rooted!", "pics": null, "resp": null, "gmap_id": "0x889293444f1a8183:0x542389c1a9a94630"}
{"user_id": "111563408022422133727", "name": "Megan Hopkins", "time": 1584129129376, "rating": 5.0, "text": "Not only is this the cutest store, but the owners and staff are very helpful and wonderful people! We are so glad we have such a well-informed CBD store to help answer any questions!", "pics": null, "resp": null, "gmap_id": "0x889293444f1a8183:0x542389c1a9a94630"}
{"user_id": "107241214591080447247", "name": "no one", "time": 1593286122884, "rating": 4.0, "text": "Totally cute with local artists work and fresh cbd flower and oils. Friendly staff and vintage womens clothing", "pics": null, "resp": null, "gmap_id": "0x889293444f1a8183:0x542389c1a9a94630"}
{"user_id": "107989365652977596273", "name": "Amanda Kay Whiddon", "time": 1582501953770, "rating": 5.0, "text": "Amazing CBD store!  The store's decor and atmosphere is simply breathtaking.  Peaceful and serene.   The store manager was very helpful, knowledgeable and thoughtful.  Not only do they have top quality CBD products but they are also the hub for local artists to showcase and sell their crafts.  The best smelling candles from a locally owned business are readily available to sample and you can even bring in your grandmother's favorite piece of crystal  or whatnot and they will make it into a one of a kind candle for you!  Music on vinyl from local musicians, artwork from local professional and little amateurs who are surely on their way to becoming pros in the future!  Where can you find that perfect vintage Coach bag?  Yes...right here.  Perhaps the Best Rooted place in Dothan in my opinion.  10 stars!!!", "pics": null, "resp": {"time": 1583874472547, "text": "Thank you so much for coming in and for your review!  We are glad you enjoyed your experience!"}, "gmap_id": "0x889293444f1a8183:0x542389c1a9a94630"}
{"user_id": "103773219848242101206", "name": "Kim Nunley", "time": 1603069541341, "rating": 5.0, "text": "The customer service was amazing", "pics": null, "resp": null, "gmap_id": "0x889293444f1a8183:0x542389c1a9a94630"}
{"user_id": "116868287891251879113", "name": "Stuart Ashworth", "time": 1506639190683, "rating": 5.0, "text": "Huge selection of top quality antiques. The lady who owns it is very nice.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNqEKnHP4GmtJ26iEfXjzlsnL-dRGsfZuOdLX22=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMaMr704sHVHRt6n_6gENwVW-Ca_91h2Q-PId0Q=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNtrY4E4Ag8tmKHMO8Q_4iL4bo0oUM8w2tGAjAj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOFL8xRUeLTQdCKaZG2LGVodfQMPGx7J0GdnHOA=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM5IIUr3r4nMG9jEwYEq_Pyg8b-WJpducKlwVVr=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOH6nvMgc47YZCKCEI1aeH9XE_ZK3tSkNmYc2uo=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMKFdzpCd9JcCXmmitr4WQXxvNuopT51lT0bCna=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88896d0ae95c7045:0xeb9a52b4b8ec3f56"}
{"user_id": "114332828033383451842", "name": "Pat Hamilton McMurrey", "time": 1605374114904, "rating": 4.0, "text": "I did not get to look around real good as the power was off but the man there was very helpful. I did purchase an old bed.\nReply: No problem, you can't control the power. I plan to be back.", "pics": null, "resp": {"time": 1605373270175, "text": "Thank you for your review...sorry for the power outage"}, "gmap_id": "0x88896d0ae95c7045:0xeb9a52b4b8ec3f56"}
{"user_id": "113617886827721500545", "name": "Danielle McKim", "time": 1601396867185, "rating": 4.0, "text": "Cool place. Nice guy. Just kinda small inside.", "pics": null, "resp": {"time": 1605373317248, "text": "Thank you for the review"}, "gmap_id": "0x88896d0ae95c7045:0xeb9a52b4b8ec3f56"}
{"user_id": "106066242958720340737", "name": "Richard Allison", "time": 1550267889659, "rating": 5.0, "text": "We had a fun time looking at all the different antiques and\nHome decor.", "pics": null, "resp": {"time": 1550271459322, "text": "Thank you for your Review. Please come again\nPamela Wright"}, "gmap_id": "0x88896d0ae95c7045:0xeb9a52b4b8ec3f56"}
{"user_id": "107961098871522339198", "name": "Carla Meloni", "time": 1530983202795, "rating": 5.0, "text": "Beautiful antique shop in the heart of Leeds. Lots of quality pieces at good prices.", "pics": null, "resp": null, "gmap_id": "0x88896d0ae95c7045:0xeb9a52b4b8ec3f56"}
{"user_id": "107100597369073257959", "name": "Nina Larsrn", "time": 1514428469850, "rating": 5.0, "text": "Great shop with all sorts of very nice things, including a  booth with beautiful Handmade Pottery at very reasonable prices. Just a lovely place to visit", "pics": null, "resp": null, "gmap_id": "0x88896d0ae95c7045:0xeb9a52b4b8ec3f56"}
{"user_id": "100201782719949809106", "name": "Pamela Wright", "time": 1489547522403, "rating": 5.0, "text": "I am the owner and manager. Let me know how I can help with that one of a kind item your searching for. General Store and over 20 vendors!", "pics": null, "resp": {"time": 1490933090470, "text": "Thanks"}, "gmap_id": "0x88896d0ae95c7045:0xeb9a52b4b8ec3f56"}
{"user_id": "103267918890608179063", "name": "Hal Scoggins", "time": 1500088036792, "rating": 4.0, "text": "They have a lot of stuff to look at at a good price", "pics": null, "resp": null, "gmap_id": "0x88896d0ae95c7045:0xeb9a52b4b8ec3f56"}
{"user_id": "110008674499261764582", "name": "Rob West", "time": 1542475034794, "rating": 5.0, "text": "Lots of cool stuff!", "pics": null, "resp": {"time": 1544548805992, "text": "Thank you for your great review!"}, "gmap_id": "0x88896d0ae95c7045:0xeb9a52b4b8ec3f56"}
{"user_id": "111886008783780808609", "name": "Evey Wilkins", "time": 1622037041982, "rating": 5.0, "text": "I absolutely LOVE this store and the employees there! They gave the most beautiful necklaces and all your incense needs, go check them out for all your spiritual healing needs 😍😍", "pics": null, "resp": null, "gmap_id": "0x8861d62c5c962087:0x85d200b24e399507"}
{"user_id": "103433974077053036769", "name": "Cotie Foshee", "time": 1561807770118, "rating": 5.0, "text": "Love this store. Has everything you could every want or need. Candles, soaps, gemstones. Etc. Good prices also. Wonderful people", "pics": null, "resp": {"time": 1561808488566, "text": "Thank you so much for being apart of the family"}, "gmap_id": "0x8861d62c5c962087:0x85d200b24e399507"}
{"user_id": "114817978216852590035", "name": "Victoria Christopher", "time": 1603228405751, "rating": 5.0, "text": "💛💛💛 Good vibes all around 💛💛💛\namazing people and products", "pics": null, "resp": {"time": 1603285114900, "text": "We are so happy you found the shop a smile maker. bug hug"}, "gmap_id": "0x8861d62c5c962087:0x85d200b24e399507"}
{"user_id": "106403638895796357370", "name": "Brandy Anderson", "time": 1582824847526, "rating": 5.0, "text": "Absolute lovely store with a variety of merchandise and excellent prices.", "pics": null, "resp": {"time": 1582835457788, "text": "Thank you so much we try so hard to please"}, "gmap_id": "0x8861d62c5c962087:0x85d200b24e399507"}
{"user_id": "102995292050597915617", "name": "Carrie E", "time": 1561577668350, "rating": 1.0, "text": "Was given a free sample of a topical CBD oil ointment to use for pain relief. The ointment caused a blistering chemical burn that caused the skin to peel off. I contacted the store to let them know that their ointment caused a chemical burn and I was told that it couldn't have possibly been caused by their product and that it was an allergic reaction. All I wanted was to let them know that their product caused harm so that they could test their sample before giving it out to anyone else. Instead of an apology or even saying they would check it out all I got was accusations that it couldn't possibly have been from their ointment. I should have known better because it was probably never tested or FDA approved but some homemade remedy they are just selling out of the shop. BUYER BEWARE! Don't buy from this store. Buy from only reputable sources!", "pics": null, "resp": {"time": 1561578683233, "text": "And we did tell you to quit using it because you definitely had an allergy to it. Sweet Jesus I've got to get a one-star review because you're allergic to something that we sell. It just doesn't seem right we were really nice to you even though you were allergic to something we made."}, "gmap_id": "0x8861d62c5c962087:0x85d200b24e399507"}
{"user_id": "101160134967956087262", "name": "Dusty Smith", "time": 1569003597989, "rating": 5.0, "text": "Have too promote the shop for it'ss wwwwholessome selection will be iinSoon", "pics": null, "resp": {"time": 1569022701765, "text": "Thank you!!!"}, "gmap_id": "0x8861d62c5c962087:0x85d200b24e399507"}
{"user_id": "114354599514276097363", "name": "Christopher Winston", "time": 1511748955882, "rating": 5.0, "text": "I love the cornerstone market you will always find something you need in there. The owner is vary nice and will help you if you need help finding a product you need.", "pics": null, "resp": {"time": 1533987143381, "text": "Thank you"}, "gmap_id": "0x8861d62c5c962087:0x85d200b24e399507"}
{"user_id": "113012172319689646114", "name": "Sky High", "time": 1558472415449, "rating": 5.0, "text": "I’m in incense heaven - owner lady was super friendly and very helpful. I will be back every time I need incense.", "pics": null, "resp": {"time": 1558482251903, "text": "Awesome!!!"}, "gmap_id": "0x8861d62c5c962087:0x85d200b24e399507"}
{"user_id": "116566389736531186399", "name": "Paris Topazi", "time": 1626848197466, "rating": 5.0, "text": "I’ve been visiting these folks for several months now and they have the best customer service & selection out of any CBD shop in Bham. Also, better prices than their competitors on select items. Their products have helped alleviate much stress/anxiety. I’m happily becoming a regular #shoplocal", "pics": null, "resp": {"time": 1626904533075, "text": "Thank you Paris!  We appreciate you so much!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "112685250729238794897", "name": "Logan Rasamee", "time": 1627220103913, "rating": 5.0, "text": "Fast and reliable. I highly recommend for the high quality products provided. Urb is my favorite.", "pics": null, "resp": {"time": 1627317894934, "text": "Thank you Logan!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "115398733720026752375", "name": "Austin Dean", "time": 1619578537880, "rating": 5.0, "text": "This store is awesome. Both the owners have been super helpful in guiding the right products for me. Delta-8 has made such a positive impact on my well-being and I wish I would’ve come here sooner. I’d recommend anyone come here if you’re on the fence, worth every cent you pay.", "pics": null, "resp": {"time": 1620539158591, "text": "Thank you so much Austin!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "110552976703856197153", "name": "James Tyler Clements", "time": 1627071291411, "rating": 5.0, "text": "The staff is very knowledgeable and friendly and I have enjoyed every visit. Very glad I found out about these guys!", "pics": null, "resp": {"time": 1627098531959, "text": "Thank you James!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "113091863933214793373", "name": "Ellie Banks", "time": 1617942229310, "rating": 5.0, "text": "I’m so glad that a friend told me about Magic City Organics. I was really impressed with the variety of products...the delta 8 edibles are great! Delta 8 has seriously changed my life for the better and has helped tremendously with my anxiety. Their online ordering and pick up is super convenient. The customer service is excellent. I have only good things to say about this place and highly recommend.", "pics": null, "resp": {"time": 1618152587058, "text": "We appreciate you!  Thank you"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "112548928278011730071", "name": "Arturo LaCruz", "time": 1625338137230, "rating": 5.0, "text": "The alternatives to pain relief are few. Medication and surgery should be the last in the list of options. Thankfully Mother Nature provides for natural ways to  soothe pain and offer much deserved rest. Thank you Magic City Organics for offering high quality full spectrum CBD products", "pics": null, "resp": {"time": 1625591940631, "text": "Thank you so much!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "109101506141248338343", "name": "Moises Hernandez", "time": 1617938435837, "rating": 5.0, "text": "Great products. Great variety. I trust their products. They have also been nice and informative every time. It helps it's in a nice area, not sketch like other shops. Wish I would have known about it pre pandemic so I could go in and browse", "pics": null, "resp": {"time": 1618152526944, "text": "Thank you so much Moises!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "101603266768212705525", "name": "Lu Brashaw", "time": 1616177076768, "rating": 5.0, "text": "If you haven't tried Delta-8, do so. I have yet to find, outside of prescription medication, a better, more organic way to relax from the stresses of the day. This product does NOT make you \"High\". It does take away anxiety and stress. It can cause drowsiness, but for me, not in a way that impairs or makes me have to nap. To say it can turn a bad day to a good day is no exaggeration. Perception is everything in dealing with day to day obstacles and foibles. This is a perception changer. It allows me to not let stress and anxiety rule the day. It relaxes me enough to deal with everyday stress in a positive and productive manner.", "pics": null, "resp": {"time": 1616758526506, "text": "Thank you Luan!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "108497497375821290048", "name": "Jessica Colby", "time": 1610815846942, "rating": 5.0, "text": "There’s not enough good things to say about this place. First of all, the owners are SO nice & so helpful. I use the delta 8 vape products and I have come off all of my anxiety and sleeping medicine because of them. I’m so glad I found this place. Best prices in Birmingham. The same day delivery option is awesome. Just everything about it I love. I’ve been telling everyone about it and a few of my friends also love the products now as well! Thanks for everything y’all do!", "pics": null, "resp": {"time": 1610908113308, "text": "Thank you so much Jessica!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "115678888460084998648", "name": "Squid 15 MEH", "time": 1624969623664, "rating": 5.0, "text": "Magic City is the only CBD store I know sales CBN & Delta8 products mixed together and I have been to plenty of retailer's. One thing for sure I thought no one could compete with Black Tie but they don't even have a mix in vapes, edibles. I asked them over 1vyr ago because I was so impressed with your CHI CBN:Delta8 they say\" We working on it nothing yet!! So hands down to Magic City Organics! Omg now CBN:Delta8:Delta10 what you guys doing trying to shut down the others 😆!", "pics": null, "resp": {"time": 1624986205153, "text": "Thank you for the valuable feedback!  We appreciate you. :)"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "109555798616883310518", "name": "Angelina Contella", "time": 1617940868966, "rating": 5.0, "text": "I can’t say enough good things about this company!! They’re always so nice and helpful and willing to answer questions. Fast delivery and some of the best quality products I’ve ever used. Couldn’t recommend enough!!!", "pics": null, "resp": {"time": 1618152578610, "text": "Aw, thank you so much!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "111518339992711159912", "name": "James Combs", "time": 1622084391666, "rating": 5.0, "text": "Super friendly service with a great selection and affordable prices. Most definitely recommend for any of your cbd needs.", "pics": null, "resp": {"time": 1622388925803, "text": "Thank you so much James!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "104445192587163360311", "name": "drea HARBIN", "time": 1612117002591, "rating": 5.0, "text": "Great experience! Great customer service! Best products of high quality. They take pride in working with small organic farms and make sure you have the safest products. Love their delta 8 caramels and Chocolates!", "pics": null, "resp": {"time": 1612326844712, "text": "Thank you so much!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "110155338205512686447", "name": "Lee Champagne", "time": 1621475712063, "rating": 5.0, "text": "I shop here for all of my Delta 8 and CBD needs! I get Delta 8 vape cartridges for anxiety, depression, or just to chill out and my friend bought period pain relief patches, which work very well!\nThey have such a wide variety of high quality products, from bath and topicals, pain relief, vapes, and so much more. The owner Jennifer is super nice and helpful, and I love and appreciate that the shop is woman owned and an LGBT+ ally!", "pics": null, "resp": {"time": 1621532097243, "text": "Thank you Lee! We appreciate you so much. 💃"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "107959808951083852307", "name": "Higher Living with Lance Jaynes", "time": 1599881603386, "rating": 5.0, "text": "I have been involved with and aware of CBD’s since 2012. It is a new industry that challenges traditional ‘health care’-Aka Disease management. I have been taking CBD’s for 8 yrs, I’ve also not been sick since that time.\nI have been out of work since March but doing odd jobs to make it by; and one of them has been such a blessing to help MCO! Jenni and Greg are helping people every day and I have been blessed to not only participate but I get my CBD oil from them and take it daily. Having worked in surgical/cardiac sales for 15 yrs, I realize it is natural remedies that we have available to us that make all the difference!  I would recommend Magic City Organics to anyone I know. An amazing variety of options for so many things, even pets.\nNot been sick since 2012!!! Order Your CBD’s and take them daily from Magic City Organics. Jenni and Greg have sacrificed so much because they are wanting to truly help others.\nPlease check out their offering. Take CBD daily, your cells are made for it.", "pics": null, "resp": {"time": 1599883742205, "text": "Wow, thank you Lance! You're help has been so appreciated with MCO. 🖤"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "107869229728761153172", "name": "Jessica Conger", "time": 1610738759191, "rating": 5.0, "text": "I love Magic City Organics! I first visited them about a month ago, and I think  I have made a return visit weekly since then. They have a fantastic selection of products, and are so helpful and kind if you are not quite sure what you want/need. I am so happy to have this shop so close to my house!", "pics": null, "resp": {"time": 1610768649554, "text": "Oh thank you so much Jessica!!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "107051756361411771133", "name": "Valerie Baker", "time": 1611845645033, "rating": 5.0, "text": "I don't have time to list all of the reasons I love this place.  They are absolutely amazing!   Excellent products and friendly staff. They clearly care about their customers.  And...they deliver!!  ❤😍", "pics": null, "resp": {"time": 1612022987247, "text": "Oh my - thank you so very much!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "108443277030290012003", "name": "Brooke Higginbotham", "time": 1610806838789, "rating": 5.0, "text": "Such a wonderful place.  The owners are always so kind and they have helped so many people, even through this pandemic.  Not to mention the variety and options they have to offer. Good quality and wonderful workers.  So nice to have a local store like this.  Brookie loves you :)", "pics": null, "resp": {"time": 1610908141798, "text": "Thank you soo much Brooke!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "102823930756458615973", "name": "Jennifer Lovell", "time": 1611450306146, "rating": 5.0, "text": "I'm surprised I haven't completed a review earlier. We have been supported this shop for over a year and have had good luck with relaxation products, gifts, pet supplies, and even my Valentine's flowers last year. They take all necessary covid precautions and then some.", "pics": null, "resp": {"time": 1612023027301, "text": "We appreciate you - thank you Jennifer!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "102573856854129391068", "name": "Mandy graffeo", "time": 1611450469211, "rating": 5.0, "text": "Not only are the products amazing, the customer service is too. Jenni went above and beyond when I got a bunk cartridge. I was willing to go to the shop the next day but instead she had some drop off a replacement cartridge that night. 10/10 I do recommend!", "pics": null, "resp": {"time": 1612023017171, "text": "Thank you so much Mandy!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "102879584164884370028", "name": "Melissa Anderson", "time": 1611013352234, "rating": 5.0, "text": "Exceptional customer service! Very clean and inviting shop. Products are great and really help with my anxiety. Placing my second order now and many more to come!", "pics": null, "resp": {"time": 1611032073196, "text": "Thank you so much Melissa 🙏🏼"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "107033833381701747186", "name": "Anna Killian", "time": 1612112401454, "rating": 5.0, "text": "Magic City Organics is the BEST! Friendly, knowledgeable, efficient. Shipping is always quick when ordering online, COVID friendly order packing. In store shopping is great because they have a COVID friendly walk-up shop! Miss their hours? They have products for sale at other local locations as well! 10/10 customer service 10/10 products. LOVE LOVE LOVE Magic City Organics", "pics": null, "resp": {"time": 1612326871518, "text": "Oh thank you Anna!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "100412626046065527602", "name": "Anna Shouse", "time": 1617945692379, "rating": 5.0, "text": "MCO has saved my life and I truly mean that. Without going into detail, my anxiety has worsened over the past few months. I was searching for a CBD shop that sold full spectrum tinctures, topicals, and delta 8. Immediately upon meeting Jenni, I knew I was in good hands. The shop has the most inviting feel and they truly SERVE their community! Even on days when my anxiety takes over—I’m able to order same day delivery without leaving my house. I could go on & on about how much I love MCO, but I’ll leave that for you to experience! ❤️ Thank you MCO for your products, hospitality, and your community involvement.", "pics": null, "resp": {"time": 1618152636140, "text": "Wow, what an incredible review - thank you for sharing!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "116255201603332693523", "name": "Laura Eason", "time": 1599857759486, "rating": 5.0, "text": "I LOVE Magic City Organics CBD.  This shop has so much to offer with phenomenal service to help you find what meets your needs.  I have had my orders delivered and stopped by the store for window pickup.  Both experiences were fantastic.  They have a tight sanitation regimen going which made it all comfortable for Covid-19 days.  I recommend this place 100%.", "pics": null, "resp": {"time": 1600145390597, "text": "Thank you so much Laura!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "109065760261641934081", "name": "VINEGAR", "time": 1611081012895, "rating": 5.0, "text": "We love our neighbors (and their products!) I am such a convert to CBD products! My favorite is the ALBIS drink on tap, both flavors are delicious. It literally calms me down when I need to calm down and has eased the tension with the migraine headaches that I encounter on a regular basis. MCO is such a treasure for our neighborhood and community. Both Jenni and Greg are so generous with their knowledge and want to truly help others feel better.", "pics": null, "resp": {"time": 1612023069863, "text": "We appreciate you all so much! thank you"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "110875930187898288577", "name": "Lisa Lane", "time": 1617975085586, "rating": 5.0, "text": "The products are superb and the staff is super helpful! I always have questions and they are always so friendly. Love this place!", "pics": null, "resp": {"time": 1613500906381, "text": "Thank you so much!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "112854268751282695410", "name": "p.", "time": 1617938821231, "rating": 5.0, "text": "Incredible people, incredibly customer service. Blessed to have these kind of folks in our city.", "pics": null, "resp": {"time": 1618152533814, "text": "Thank you :)"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "118206438689279281490", "name": "Susan W", "time": 1603239815330, "rating": 5.0, "text": "This place is amazing. They have so many options and non CBD items as well. The owner is very informative and extremely helpful. The delivery is also far beyond what was expected. I did not even think they would deliver to us because no one else locally will. Please, this place really is fantastic.", "pics": null, "resp": {"time": 1603382450444, "text": "Thank you so much Susan!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "101317855830374896049", "name": "Ben German", "time": 1609604967079, "rating": 5.0, "text": "I posted a five star review 3 months ago and now I wanted to come back and share in detail. No shocker, this shop continues to be amazing! The people are so friendly, their website is so professional (which makes the checkout process so easy) and the product is great and hella affordable!\n\nDefinitely check this place out if you’re in the bham area 🔥🔥🔥", "pics": null, "resp": {"time": 1606692042332, "text": "Thank you Ben!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "117714191155094652914", "name": "Michael Shelton", "time": 1599944402697, "rating": 5.0, "text": "Very knowledgeable and helpful staff. I recommend becoming a member and taking advantage of what they have to offer. I’ve been extremely satisfied with their products and service. They also deliver within a certain distance from the shop and offer shipping. This is a wonderful place to get your healing! Thank You MCO!", "pics": null, "resp": {"time": 1600007449542, "text": "Thank you so much Michael!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "111122251601463115582", "name": "Tricia Wikoff", "time": 1611067209596, "rating": 5.0, "text": "IN LOVE with these products.  I've been having trouble sleeping lately and these products have helped me sleep HARD.  I wake up feeling refreshed and ready to go.  I also have noticed my anxiety is lessoned and I dont even notice my sciatic pain when I use these products.  THANK YOU!! Super fast shipping too!  LOVE! - oh and one more thing - Jenni helped my mom with her order (75 year old who has trouble with online shopping :P) and she was very pleased with all the help!", "pics": null, "resp": {"time": 1612023103162, "text": "We appreciate you Tricia - thank you!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "109505415772623889365", "name": "Jessica Carmon", "time": 1599855569739, "rating": 5.0, "text": "Jenni is so knowledgeable and helpful. I feel I can talk to her about what I'm looking for from a CBD product & she always has great solutions.  This is not a one size fits all kind of place, there are tons of options! Love that she helps me navigate & make the best purchases for my needs.", "pics": null, "resp": {"time": 1600145429578, "text": "Thank you Jessica! You're too kind."}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "111319748374664876861", "name": "Hannah Danho", "time": 1599861838320, "rating": 5.0, "text": "MCO is hands down the best!! This is my favorite cbd boutique. The store showcases the best products on the market at such a reasonable price. I frequent the store often and leave with a smile on my face. They are so helpful and knowledgeable about the product and truly care about the customer.", "pics": null, "resp": {"time": 1600007514989, "text": "Ah thank you Hannah!!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "102725383208080527718", "name": "Deidra Danger", "time": 1617988006836, "rating": 5.0, "text": "The owners are fantastic people and they go above and beyond for their clients. You can even earn points with your purchases that will credit to future purchases!", "pics": null, "resp": {"time": 1618152682889, "text": "Thank you Deidra!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "111599115725823485994", "name": "Whitney Mork", "time": 1599702904816, "rating": 5.0, "text": "Quality! Quality! Quality! The owners are knowledgeable and vert personable. The website is easy to navigate. The safety measures they are taking during Covid are too noche. I can’t say enough great things. They have gained a long time customer in me.", "pics": null, "resp": {"time": 1599855093787, "text": "Thank you soo much!!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "105020406657771755275", "name": "Stewart Taubman", "time": 1613265054124, "rating": 5.0, "text": "Your product is  quality and so is your shipping time. Good work. Keep it up", "pics": null, "resp": {"time": 1613500891797, "text": "Thank you!!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "110529307952764524271", "name": "Shaun Mazur", "time": 1599855373034, "rating": 5.0, "text": "Be it shopping online or dropping in the store, you couldn’t ask for a better experience when dealing with MCO. They have the best products utilizing the best ingredients. I’m not worried about what I’m putting in my body bc I know Jenni has done her due diligence to make sure she is providing the very best CBD products. Keep up the great work!", "pics": null, "resp": {"time": 1600145439670, "text": "Ah thank you Shaun!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "116038205429049487133", "name": "Clyde Beppler", "time": 1610810697209, "rating": 5.0, "text": "Recently, I ordered an assortment of your CBD chocolates. Excellent flavor, and a nice dose of CBD, helps with getting through the day.\nMother ate one, she is over 90 yrs. old , moved around the house like she was 15 yrs. younger.\nThanxs.", "pics": null, "resp": {"time": 1610908125390, "text": "Thank you so much Clyde!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "113518223427020793144", "name": "hollyxrachalle123", "time": 1611451890539, "rating": 5.0, "text": "Jenni is amazing and her products are the best in Birmingham and the only products I trust.\nLove magic city cbd", "pics": null, "resp": {"time": 1612022998353, "text": "Thank you so much!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "101101169186336294342", "name": "Crystal Murphy", "time": 1578352178516, "rating": 5.0, "text": "Super friendly and knowledgeable staff. The owner Jennie is always willing to answer questions and help you find the right product. Also, their prices are amazing!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPFx4EVFuT-bQp4L-x0ONgcDHGdPr5NnolU88Id=w150-h150-k-no-p"]}], "resp": {"time": 1578347432729, "text": "Thank you so much Crystal!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "118278979335653106156", "name": "winterdr", "time": 1599700305810, "rating": 5.0, "text": "These guys are the best!  I am so glad I tried CBD!  It has helped in so many ways!  From sleeping to pain management to minimizing anxiety.  Jenni and Greg are awesome, knowledgable and such an amazing asset to our city!    If you haven’t tried it ask lots of questions and give it a go!", "pics": null, "resp": {"time": 1599855078778, "text": "Thank you so much Danny! You have been a pleasure to work with & we are thankful to have you as a customer."}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "111477014009802341586", "name": "Brandon", "time": 1610136965937, "rating": 5.0, "text": "Great products at good prices. Owner is fantastic and responded to an order mess up in minutes. Highly recommend", "pics": null, "resp": {"time": 1610201515329, "text": "Thank you Brandon!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "102406877658383263818", "name": "Nina Lance", "time": 1612796602357, "rating": 5.0, "text": "love MCO! jenni was super helpful, nice and accommodating. their products are A++", "pics": null, "resp": {"time": 1613500916003, "text": "Thank you so much!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "102681282631310621254", "name": "xprezeu", "time": 1610806781883, "rating": 5.0, "text": "Truly a gem ! Everything Jenni has done with this place is exquisite ! The work she and her husband put in during Covid kept their beautiful store open and more importantly people in pain could get relief. Highly recommend this store 😇", "pics": null, "resp": {"time": 1610908150042, "text": "Thank you so much!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "110648329830389582404", "name": "Anne McCormick", "time": 1611076312314, "rating": 5.0, "text": "Not only are they kind, helpful, and very knowledgeable (seriously they knowevery product backwards and forwards), they also go above and beyond to make sure everybody stays as safe as possible against COVID. My favorite touch is each item getting sprayed with hand sanitizer (and it smells really good) before being placed in the bag.", "pics": null, "resp": {"time": 1612023090361, "text": "Thank you Anne!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "117081802066496576382", "name": "Stephanie Logan", "time": 1611345118904, "rating": 5.0, "text": "I love Magic City Organics products.  I’ve told numerous friends as well who have also started ordering their products!", "pics": null, "resp": {"time": 1612023047146, "text": "Thank you so much Stephanie!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "100794858673759625236", "name": "Amie McCullough", "time": 1610848415325, "rating": 5.0, "text": "Love the variety of products! The owners are awesome and extremely knowledgeable about their products.", "pics": null, "resp": {"time": 1610908104549, "text": "Thank you Amie!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "110273283959865603368", "name": "Salina Sharp", "time": 1610730902899, "rating": 5.0, "text": "I love this store! They are very knowledgeable on all things cbd. Was so easy to order and pick up! I will be a customer for life now! I have tried the vape carts, the delta gummies! They are fabulous! The staff are always so nice.", "pics": null, "resp": {"time": 1608177458988, "text": "Aww thank you so much Salina!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "104912709231944861633", "name": "rlatulipe5591", "time": 1599857038924, "rating": 5.0, "text": "Only place I shop for CBD. Jenni and Greg are awesome. They take the time to help you find what product will suit you best, while at the same time making you feel like your a friend rather than just another customer. 💯 all they way", "pics": null, "resp": {"time": 1600145414552, "text": "We so appreciate that! Thank you"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "105310317735531644832", "name": "Brandon Harris", "time": 1600173185798, "rating": 5.0, "text": "The best CBD store ever because your not going to break the bank and the products are great. I just seen they are about to get better with 3chi products. See you guys tomorrow.", "pics": null, "resp": {"time": 1600007531794, "text": "You're the best Brandon! Thank you"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "103478124385472884615", "name": "Kate Merritt Davis", "time": 1611076827819, "rating": 5.0, "text": "Prompt delivery (glad to have covid safe options), quality merch! Thanks!", "pics": null, "resp": {"time": 1612023079213, "text": "Thank you so much Kate!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "111484813541065282761", "name": "Sharon DeVaney-Lovinguth", "time": 1595195949912, "rating": 5.0, "text": "Love the owners and the place! The website is easy to navigate, and my order is always ready quickly. Their Covid prevention methods are the best I've seen anywhere. I feel very safe shopping there. Great experience every time!!!", "pics": null, "resp": {"time": 1595211334952, "text": "Thank you Sharon for taking the time to leave us such a wonderful review!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "105869236776039328120", "name": "Billy Mitchell", "time": 1626471680341, "rating": 5.0, "text": "I have been a MCO customer since Dec 2020. I heard about Delta 8 about 6months before I finally tried it. I began by using 3CHI 25mg gummies and 3 CHI vape carts. I developed a tolerance quickly when I switched to 3CHIs Enhanced Oil D8THC 1200mg. That and the CBDPharms 50mg gummies are my fav but my tolerance is very high.\n\nJenni and Greg run a legit and professional business. Either one or sometimes both are there when I pickup and are always friendly. I have tried other brands and online shops but I really appreciate the fact that I can drive 30min down the road and have what I need or want. MCO is also very competitive on pricing. Their customer rewards and customer service are second to none. You can't go wrong with MCO. 💜", "pics": null, "resp": {"time": 1607685649825, "text": "Thank you so much Billy!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "104802417262424140893", "name": "Virginia Cox", "time": 1589995831055, "rating": 5.0, "text": "Cannot say enough great things about this company and the owners! They are super quick to reply, helpful to accommodate any budget, and even delivered to our front door within 24 hrs of ordering. Highly recommend!", "pics": null, "resp": {"time": 1590155921176, "text": "Thank you so much Virginia!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "110744646295968045878", "name": "Drew McCullough", "time": 1601999495564, "rating": 5.0, "text": "An excellent experience every single time.  The delivery is spot on and the selection is well curated.  Personable staff.", "pics": null, "resp": {"time": 1602123686490, "text": "Thank you Drew!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "102777431610879478468", "name": "Nick B", "time": 1612575899355, "rating": 5.0, "text": "Great people, service and a large supply of quality products!", "pics": null, "resp": {"time": 1612763954618, "text": "Thank you so much!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "109702727791319214456", "name": "C Womack", "time": 1595194955879, "rating": 5.0, "text": "Magic City sells top quality products. Greg and Jenni are awesome and always happy to help. Would not buy my CBD products from anyone else.", "pics": null, "resp": {"time": 1595291836441, "text": "Thank you so much!!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "102798107115041635333", "name": "Tae Bandz", "time": 1590082584897, "rating": 5.0, "text": "The workers so kind , they even let me try a sample.\nI totally loved their manners and kindness, they were so nice .\nI will definitely be purchasing more products from them they have the best service and their products are awesome‼️", "pics": null, "resp": {"time": 1590155908850, "text": "Thank you so much! Thrilled you found us. 🙌"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "116528828584643902161", "name": "Charlie Foster", "time": 1603238903635, "rating": 5.0, "text": "I just needed a good night's sleep and Jenni suggested I try CBD. I started with a low dose daily and worked my way up and before I knew it, I was sleeping through the night soundly! Another wonderful change that I've noticed is that I'm focusing better at work which means even less stress! I can't thank Jenni enough for turning me on to such wonderful products, ensuring that they are top quality and making them available at such great prices!", "pics": null, "resp": {"time": 1580789684364, "text": "Oh wow, that's awesome. Thank you so much Charlie!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "101992896999682834068", "name": "Eric Funderburg", "time": 1595227371151, "rating": 5.0, "text": "Expensive, and pointless, that is how every other CBD shop is described. Trying to get you to buy overpriced items and pressuring customers into more than they came to get with cheesy gimmicks. Not Magic City Organics. Not only myself, everyone I know says that this is the most accommodating business around that provides hemp medicine and knowledge to issues pertaining to purchase needs.\n\nIf you, personally, don't want a great experience Everytime you shop for premium CBD products.  Please shap elsewhere. We are tired of these premium products selling out.", "pics": null, "resp": {"time": 1595291861648, "text": "You rock Eric!  Thank you!!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "106229095994026229940", "name": "Clint Jones", "time": 1581513628021, "rating": 5.0, "text": "Superb customer service. Knowledgeable, prompt to reply, and friendly.\nBest prices in town. Great selection of every type of CBD product on the market. Lots of variety. Love it!", "pics": null, "resp": {"time": 1582152501907, "text": "Thank you Clint! We appreciate the feedback. :)"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "110615299973212612557", "name": "Cat Smith", "time": 1599917824944, "rating": 5.0, "text": "MCOs attention to detail, in both product and client need, is remarkable. Top tier company all the way around.", "pics": null, "resp": {"time": 1600007466943, "text": "Thank you Cat!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "113242569832625888061", "name": "Chris Hallmark", "time": 1610808096500, "rating": 5.0, "text": "Always fast shipping and the owners are top notch!", "pics": null, "resp": {"time": 1610908134210, "text": "Thank you Chris!!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "112427440355518495791", "name": "sarah randolph", "time": 1581966365515, "rating": 5.0, "text": "I’ve been a customer ever since Magic City Organics began! Highly recommend. Top quality products and customer service! Jenni is very knowledgeable and can help you find the right products for your needs.", "pics": null, "resp": {"time": 1582152472316, "text": "Thank you so much Sarah!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "114856547565831725093", "name": "Merritt Milam", "time": 1588010603707, "rating": 5.0, "text": "Amazing customer service (even when they’re technically closed) and amazing products! I’ve used for nausea, migraines, and just headaches. Also just for a boost in the day when needed. Can’t recommend enough! Love this way more than any other CBD product I’ve tried (and that’s quite a list!)!", "pics": null, "resp": {"time": 1588017120112, "text": "Ah, that's wonderful!  Thank you so much for sharing."}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "118404462908477079587", "name": "Little Savannah", "time": 1580785438019, "rating": 5.0, "text": "The absolute best in Birmingham...and even globally.  Knowledgeable and accommodating, Jenni has her finger on the pulse of finest CBD products available.  I trust her guidance and expertise without question!", "pics": null, "resp": {"time": 1580789641842, "text": "Thank you so much for this. 🙌"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "111984479108521719575", "name": "William Berry", "time": 1594487937425, "rating": 5.0, "text": "Customer service is a priority with this company; product knowledge is their staple. Quality inventory, from the fat frosty nugs to pre-roll grams, everything is fire.(Would trust their shake) 10/10 will buy again; 10/10 recommend to a phriend. Support local, because they do", "pics": null, "resp": {"time": 1594559071506, "text": "Thank you William! Much appreciated feedback. 🙂"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "110171147711925906773", "name": "BG BG", "time": 1587738707970, "rating": 5.0, "text": "Placed an order for delivery after the store closed for the day.  To my surprise it was delivered just a few hours later.  They even sent a text and pic of where they left the package.  Exceptional service from a local business.  Thank you!!", "pics": null, "resp": {"time": 1587994053706, "text": "Thank you for the kind review!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "106709198181904062834", "name": "Jay Barrett", "time": 1580325709002, "rating": 5.0, "text": "Placed my first order recently.  Their website and order tracking are amazing.   Received the product super fast and found the quality top-notch.  Highly recommend!", "pics": null, "resp": {"time": 1580412292685, "text": "Thank you so much Jay!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "108744247209101136958", "name": "David Fowler", "time": 1580793934593, "rating": 5.0, "text": "Great service and products. It is refreshing these days to deal with a solid local company that has a great interactive online presence. Fast shipping and follow up  ! Thanks", "pics": null, "resp": {"time": 1581197508256, "text": "Thank you David!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "105856973003308927864", "name": "Jeffery Schweizer (Jefcon1957)", "time": 1595247861214, "rating": 5.0, "text": "I was looking for Ablis CBD Ointment online due to the high cost locally and the inability to find any stores open because of the coronavirus. I had tried many brands and found Ablis to work the best. MCO proved to be less expensive by about $25 a bottle than the local stores.", "pics": null, "resp": {"time": 1595291925007, "text": "Thank you Jeffrey!  Happy to be there for you all. :)"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "117124759324655746967", "name": "Danielle Larkin", "time": 1594332690219, "rating": 5.0, "text": "MCO is amazing. Both Jenni and Greg are super helpful. There's a great selection of products. Some of my favorite are Trophy Wife- anything, Ablis blood orange water and the lavender bath bomb. I started buying my bff the cbd hemp rolls and I'm so proud of him, he hasn't smoked a cigarette in 14 days so far!!!", "pics": null, "resp": {"time": 1594491595623, "text": "Thank you so much Danielle!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "104244527896039133164", "name": "mary gaines", "time": 1595175393507, "rating": 5.0, "text": "Jenni at MCO is absolutely amazing. She recommend two CBD vapes that have helped with my chronic back issues so much. They were masked and had a plexiglass window upon pickup and were wearing gloves . So professional, knowledgeable, convenient, and clean. I’m so impressed every time I get a product from them. It’s always of the highest quality and always a great price. I’ve been in so much pain this last week or so and I wouldn’t have made it through without the CBD vape carts from MCO. Their CBD flower is also phenomenal. This is the only place in Birmingham I trust to get my CBD. You won’t regret it!", "pics": null, "resp": {"time": 1595211276543, "text": "Thank you so much Mary!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "100775041117429180563", "name": "Dollie Potter", "time": 1581005808397, "rating": 5.0, "text": "The owner/founder Jenni is very up on her game! She is informative and knowledgeable about her products and will tell you the truth about CBD uses and what may work or may not work for your particular use. She’ll tell what’s up not necessarily what you want to hear just to sell you her products. If there is something she has no info on, she’ll find some! She researches everything!", "pics": null, "resp": {"time": 1581197541460, "text": "Wow thank you!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "101515543455084131108", "name": "Suriya James Sena", "time": 1601183163002, "rating": 5.0, "text": "The owners are amazing peeps. Best in the biz", "pics": null, "resp": {"time": 1601344214654, "text": "Thank you so much!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "101525078803738562399", "name": "Jennifer Dorman", "time": 1579710584734, "rating": 5.0, "text": "MCO’s CBD is the most effective I’ve ever used!  I love the 1500mg which helps me sleep at night but also helps so much with back and joint pain.  I’m a huge fan!  Jenni is super knowledgeable and takes the time to really understand your needs.", "pics": null, "resp": {"time": 1579927060061, "text": "Thank you Jennifer for the feedback!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "103008618282723936916", "name": "Matt Vizcaino", "time": 1593205982993, "rating": 5.0, "text": "I'm usually not one to leave reviews but the service and products here are too good to be ignored. Absolutely fantastic all around!", "pics": null, "resp": {"time": 1593232594696, "text": "Oh thank you so much for taking the time to share your experience! We so appreciate you🙏🏼"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "106423023347773308949", "name": "Luan Brashaw", "time": 1580476267458, "rating": 5.0, "text": "Always prompt,  courteous service. Jenni is very knowledgeable about many CBD/hemp products and goes out of her way to provide good quality, organic, family-owned farms' hemp products to her customers. Everything I have purchased through MCO has been top-notch quality at a reasonable price. I have not been disappointed with any product I have bought from MCO.", "pics": null, "resp": {"time": 1580565616798, "text": "Thank you so much for your feedback Luan!!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "116051351931497814268", "name": "Abigail Toohey", "time": 1599874967259, "rating": 5.0, "text": "LOVE Magic City Organics! Fantastic products and amazing service!", "pics": null, "resp": {"time": 1600007505620, "text": "Thank you Abigail!! 🎉"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "117509654200536171651", "name": "Rachel Phillips", "time": 1579841366570, "rating": 5.0, "text": "Magic City Organics is amazing! They carry high quality products and the customer service is next level. Jenni has stepped in to help me with products in two high-need situations. The first time was with my dog who was having seizures. The second time was with a CBD balm to help with nerve pain. I highly recommend MCO!", "pics": null, "resp": {"time": 1579927018986, "text": "Thank you Rachel - we appreciate you!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "110053645442539665758", "name": "Trudie Murphy", "time": 1612069460976, "rating": 5.0, "text": "Great business with lots of selections!", "pics": null, "resp": {"time": 1612326882644, "text": "We appreciate you!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "109220081255829039909", "name": "Robbie McGiboney", "time": 1595349914598, "rating": 5.0, "text": "The owners of Magic City Organics were so kind and helpful. All of the products I have tried have Been beyond my expectations!", "pics": null, "resp": {"time": 1595430375980, "text": "Thank you so much Robbie!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "114968956800657350559", "name": "Giona Keefover", "time": 1584501443345, "rating": 5.0, "text": "Not only do they have the best selection of CBD products in Birmingham, but the costumer service is amazing!! Jenni takes the time to explain everything and she is incredibly knowledgeable!!", "pics": null, "resp": {"time": 1584503425526, "text": "Thank you so very much Giona!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "102978411071684002113", "name": "Stacey Dollar", "time": 1551878071757, "rating": 5.0, "text": "Great quality products at a affordable price! Also, Jenni is amazing! Very helpful, fast communication and extremely fast shipping. Overall a pleasure to do business with!", "pics": null, "resp": {"time": 1568201983997, "text": "Thank you Stacey for the feedback & taking the time to express how you're getting relief. I know our customers appreciate it! Thank you for being such a great customer!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "113611439525874561854", "name": "Amanda Simmons", "time": 1551568745459, "rating": 5.0, "text": "Best product around. I know the owner personally and she takes quality VERY VERY seriously, she’s spent a LOT of time doing her research to make sure that she is offering the best product on the market, she won’t settle for less and, as a result, you don’t have to either. I also know she and her family all use the products daily. If you do business with MCO you will absolutely be glad that you did. Prices are awesome and service is top notch. You cannot go wrong!!!!!", "pics": null, "resp": {"time": 1578347536325, "text": "Thank you so much!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "109885964231783234024", "name": "Aaron t", "time": 1580405683580, "rating": 5.0, "text": "Best CBD in Birmingham! Their products have helped me quit smoking and better regulate my sleep and my stress levels!!!  So thankful to have them in Birmingham!", "pics": null, "resp": {"time": 1580412345378, "text": "Oh thank you so much Aaron!  That's fantastic news."}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "115757662642331551812", "name": "Nathan Mays", "time": 1599876041204, "rating": 5.0, "text": "Jenni will help guide you on the journey through her shop. What ever ailments you may have, she’s got your back!", "pics": null, "resp": {"time": 1600007493354, "text": "Thank you so much Nathan!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "111274508877764391195", "name": "Melody Stanley", "time": 1584500034351, "rating": 5.0, "text": "I've never had the chance to visit, but have been able to order online. Jenni so graciously answered my questions through Facebook, and I felt confident making a purchase. I love the products and the customer service.", "pics": null, "resp": {"time": 1578347521354, "text": "Thank you for the feedback Melody!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "104550783913804349860", "name": "Daniel Walters", "time": 1579701239320, "rating": 5.0, "text": "Can't speak highly enough of Jenni and the MCO team. I was out of my Blood Orange/Cranberry goodness and not only did she have it delivered TO MY DOORSTEP, she also renewed my 1000mg CBD oil. Customer for life here. Can't wait to see what's next from MCO!", "pics": null, "resp": {"time": 1579927140227, "text": "Amazing, thank you Daniel!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "116559056756129511166", "name": "Ian Hunter", "time": 1612045346122, "rating": 5.0, "text": "Excellent and knowledgeable service.", "pics": null, "resp": {"time": 1612326894626, "text": "Thank you Ian!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "108646208258061668526", "name": "Christine Houlihan", "time": 1595193489081, "rating": 5.0, "text": "Always quality products and the customer service is top of the line.", "pics": null, "resp": {"time": 1595211298074, "text": "Thank you Christine, we so appreciate it!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "106111443678660600600", "name": "Michelle Pieroni", "time": 1599788942175, "rating": 5.0, "text": "As the chosen mother of a neurotic rescue dog, I will vouch for the calming effect that the CBD treats have had on Sami. Thanks Jeni and MCO!", "pics": null, "resp": {"time": 1600145464093, "text": "I'm so happy to hear that! Thank you Michelle"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "116378259815337190408", "name": "Brett Henderson", "time": 1592323629391, "rating": 5.0, "text": "Jenni Otwell (Owner), genuinely cares for you and wants to help you. She believes in what she does and it shows.", "pics": null, "resp": {"time": 1592422135123, "text": "Thank you so very much for the feedback!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "115218599120056396447", "name": "Cruz Young", "time": 1579707233742, "rating": 5.0, "text": "Jenni is always so helpful! My brother was hospitalized with GI issues when Jenni reached out to me to recommend the CBG product. She informed me that CBG is especially good for the intestinal tract and a very potent anti inflammatory. My brother was in the hospital a total of 38 days. When the CBG arrived he started taking it daily & within 3 days the doctor was telling us his inflammation markers had gone down, it was just a few more days after that and he was discharged! Thanks MCO & Flora Sophia for this amazing plant medicine & wonderful customer service!", "pics": null, "resp": {"time": 1579927087479, "text": "Wow Thank you so much Sara!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "107308112159342800626", "name": "Carl Brackett", "time": 1579706816395, "rating": 5.0, "text": "Large selection of quality products priced affordably as to not limit the customer on selection.  Staff is always welcoming and available to answer questions about the ever changing hemp derived cannabinoid products with various CBD, CBG, & CBN combinations. With variety of edibles, tinctures, and topicals Magic City Organics is bound to have a product for you!", "pics": null, "resp": {"time": 1579927162905, "text": "Thank you Carl!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "115587518921477997219", "name": "gabriel alfaro", "time": 1569878010833, "rating": 5.0, "text": "i purchased the oil online and it was delivered but it wasnt in my mailbox (missing or stolen) i contacted them and i immediately received an email from jenni. Her customer service is excellent and she was able to get me another bottle free of charge. This type of service is what earn any business a customer for life.", "pics": null, "resp": {"time": 1578347455878, "text": "Thank you Gabriel!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "114820494244710464079", "name": "laurie hames", "time": 1579712215332, "rating": 5.0, "text": "jenni and mco are the best!!!! jenni has to walk me thru things every month. she is caring and patient, and her recommendations are always exactly what i need!!! thanks jenni for being there for me and making me feel like i'm your only customer!!!!!", "pics": null, "resp": {"time": 1579927044316, "text": "Thank you so much Laurie!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "105075104844508921445", "name": "Stephanie Laird", "time": 1550970251968, "rating": 5.0, "text": "Great product with even better prices. Have relieved so much anxiety and been able to sleep without using prescribed medications that have had terrible side effects", "pics": null, "resp": {"time": 1568201913937, "text": "Thank you Stephanie for being such a great customer & we appreciate the feedback. I'm so happy to hear that you're getting relief. 🙌"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "117214933831095850375", "name": "Tony Diliberto", "time": 1561514771104, "rating": 5.0, "text": "Man that was fast. I recently hurt my back and have some tennis elbow. My shipment came fast and has knocked out the pain in my elbow. Just started on my back. I’m sold.", "pics": null, "resp": {"time": 1578347553161, "text": "Thank you Tony!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "113560002902525163853", "name": "Karen Jones", "time": 1611338419988, "rating": 5.0, "text": "Always a wonderful experience", "pics": null, "resp": {"time": 1612023055538, "text": "Thank you Karen!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "100362429767051742802", "name": "Nicholas Schilling", "time": 1579707105618, "rating": 5.0, "text": "Best CBD around and Jenni is very helpful with all of your questions and needs!", "pics": null, "resp": {"time": 1579927099890, "text": "Thank you Nicholas!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "115312090294750985126", "name": "Adolph Steele", "time": 1580421016277, "rating": 5.0, "text": "They were super nice and entertained all of my questions.", "pics": null, "resp": {"time": 1580565544983, "text": "Thank you Adolph!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "106748063503775245056", "name": "Jennifer Gaulden", "time": 1568959964835, "rating": 5.0, "text": "I really love the different products that MCO sells. I've used MCO's 1000mg CBD oil, as well as CBD oil by Humble Roots and Flora Sophia. All 3 brands are high quality and have helped me with my depression and anxiety. I also have fibromyalgia, so I have problems sleeping and pain. Using CBD has completely changed my life. Jenni is very knowledgeable and passionate about helping people find the right balance of products to make life better.", "pics": null, "resp": {"time": 1578347483690, "text": "Thank you Jennifer for the feedback!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "116230177606593689606", "name": "Mark Cummings", "time": 1599881210357, "rating": 5.0, "text": "Great staff and AWESOME products!!", "pics": null, "resp": {"time": 1600007485134, "text": "Thank you so much Mark!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "103803570087971041701", "name": "sean andrews", "time": 1550957305529, "rating": 5.0, "text": "Great people fast service. Definitely the place to go 🙏🏼🤗", "pics": null, "resp": {"time": 1568201861880, "text": "Thank you Sean! We appreciate you're feedback and love that we can help you with your needs!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "115628408183856432944", "name": "Sam Frazier", "time": 1580876658407, "rating": 5.0, "text": "Exceptional products and customer service!! Definitely recommend!!", "pics": null, "resp": {"time": 1581197524259, "text": "Thank you Sam for being such an awesome customer!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "108930070319798097469", "name": "KayLi Williams", "time": 1569032400726, "rating": 5.0, "text": "The store was amazing! Greg and Jennifer were so incredibly helpful and I could not be more pleased with the products and my entire experience with Magic City Organics!", "pics": null, "resp": {"time": 1578347473087, "text": "Thank you Kayli!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "105746345888002148916", "name": "Kid K.O.A", "time": 1595257498333, "rating": 5.0, "text": "One awesome place ‼️", "pics": null, "resp": {"time": 1595291805301, "text": "Thank you so much!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "116516112615451204908", "name": "Zach Zangeneh", "time": 1577469116604, "rating": 5.0, "text": "high quality CBD.  100% recommend.", "pics": null, "resp": {"time": 1578063448099, "text": "Thank you Zach"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "115166002186843004450", "name": "Kelsey Rocco", "time": 1566155389247, "rating": 5.0, "text": "I tried the 600mg blood orange oil. I have had horrible back pain and sciatica pain along with anxiety, depression and trouble sleeping. Since taking it I have less pain and not having to take pharmaceuticals as much. Thank you Jenni for all the help and knowledge. Can't wait to try others.", "pics": null, "resp": {"time": 1578347565165, "text": "Thank you Kelsey!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "105939832282920196519", "name": "Taylor Youngson", "time": 1616078640224, "rating": 5.0, "text": "Outstanding!", "pics": null, "resp": {"time": 1616758504806, "text": "Thank you so much!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "106851262790328250053", "name": "April Kearn", "time": 1581135921617, "rating": 5.0, "text": "This place is awesome! Wow", "pics": null, "resp": {"time": 1581197569732, "text": "We appreciate it April!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "108804126169527099002", "name": "Eee Bee", "time": 1568930575615, "rating": 5.0, "text": "Always responsive, very knowledgeable, great service!", "pics": null, "resp": {"time": 1578347501383, "text": "Thank you so much!"}, "gmap_id": "0x88890dc699a9775d:0x8d67dd2f03662835"}
{"user_id": "105136067017957283112", "name": "Jim Craig", "time": 1342232983917, "rating": 5.0, "text": "Wonderful to have an Earth Fare locally.   It's not as big as the Whole Foods in Birmingham, but it's nice to have.  So far (we just moved here), they've catered to our every rediculous whim.  The hot bar could use an expansion, and I'm hoping they begin carrying the glass-bottled half-and-half like the Huntsville store just started to, but I'm just happy they're here.  And they even offer a military discount of 10%!", "pics": null, "resp": null, "gmap_id": "0x888c2c6e0cda3e55:0x4080ac492146681f"}
{"user_id": "113480521179808743527", "name": "KJ Davis", "time": 1450068978847, "rating": 5.0, "text": "This place is excellent. If you are looking for good organic food then this is the perfect place for it. The prices are a little higher than other retail chains, but they sell better quality products.", "pics": null, "resp": null, "gmap_id": "0x888c2c6e0cda3e55:0x4080ac492146681f"}
{"user_id": "100620312405347188509", "name": "De'andre Shakur", "time": 1395712259393, "rating": 5.0, "text": "So Far So good. Ive come to earth fare with my family and Ive been highly impressed. my wife is a heath buff and she was extremely interested in going to check it out. i was highly impressed as was my wife. I'm not a vegan but the mock chicken at the deli was excellent. the hot bar was on point, after having a fear of this place being over priced i learn that that was nothing more then a myth. i will definitely be back and i will spread the word!", "pics": null, "resp": null, "gmap_id": "0x888c2c6e0cda3e55:0x4080ac492146681f"}
{"user_id": "110736619758529634387", "name": "Kids' Videos", "time": 1423753249146, "rating": 5.0, "text": "I love this place. The prices are high but you get what you pay for. Sometimes they have sales on fresh organic produce. I only find my favorite non-homogenized milk in here.", "pics": null, "resp": null, "gmap_id": "0x888c2c6e0cda3e55:0x4080ac492146681f"}
{"user_id": "113608776799531600275", "name": "Irene Lambert", "time": 1447703374948, "rating": 1.0, "text": "I used to love this store but they have seriously gone down hill! First I saw a cockroach near their kitchen and another in the bathroom. Seriously that's just plain nasty!! On top of that it seems like they keep getting new employees who are not trained and act like they hate their life. Who would want to shop at a place that has such a reputation??? I will NOT go back after this and recommend people just wait till we get a better place to shop at soon!! Like whole foods because in my opinion and all my other friends in town this place is beyond repair!", "pics": null, "resp": null, "gmap_id": "0x888c2c6e0cda3e55:0x4080ac492146681f"}
{"user_id": "110036448951568193053", "name": "Peggy Norris", "time": 1373150886714, "rating": 5.0, "text": "Was in here last night. Everything was above my expectations. Wonderful store.", "pics": null, "resp": null, "gmap_id": "0x888c2c6e0cda3e55:0x4080ac492146681f"}
{"user_id": "107314413882436741041", "name": "Lea Nicole", "time": 1439552790919, "rating": 5.0, "text": "I LOVE this store! some people dont understand the meaning of fresh and organic.", "pics": null, "resp": null, "gmap_id": "0x888c2c6e0cda3e55:0x4080ac492146681f"}
{"user_id": "102684862826538149188", "name": "Temika Robinson", "time": 1443496851098, "rating": 5.0, "text": "I Love this store! I was not eating healthy at all and my daughter became an employee at Earthfare. She  would share with me about the different types of healthy foods that this store offers their consumers. I decided to give this store a try and I love it. I have made a lot of better food choices due to finding out about Earthfare, losing weight and keeping the weight off. Thanks Earthfare for hiring my daughter because this is how I find out about this life changing store. I do understand that theirs a new store coming soon (WholeFood) but remember some customers are faithful especially when their is no need for a doctor but just healthier food. Faithful customers WILL continue to be a marketing tool for you.   Thanks Earthfare!", "pics": null, "resp": null, "gmap_id": "0x888c2c6e0cda3e55:0x4080ac492146681f"}
{"user_id": "117681422807882040721", "name": "Anna Franks", "time": 1616540621106, "rating": 5.0, "text": "Very Impressive CannaBama!!\nIf you are looking for an experienced CBD store with fantastic quality of customer service and a welcoming atmosphere this is absolutely positively the place to go!! Wish I could rate it a million stars!!\nNow, I must say Isaiah is totally on his game!! Although I arrived shortly before closing yesterday just knowing as I was full of questions as well as many concerns and I more than likely wasn't going to get much information and was probably going to be rushed out the door because we all know how it is when have been at work all day, we are tired and want to go home. However Isaiah was as nice as he could be and very much informative. There was not one question (trust me I was full of them) where he didn't have an answer nor give me that dumbfounded look as if I should have known the answer before I even asked. He took the time to explain to me in detail of each and every single question and concerns I had. (Other CBD stores I have went into in the past I was treated right the opposite as they tried pushing their products on me and not even really knowing much about the products. Needless to say I didn't purchase anything from them.) Isaiah not once tried pushing anything on me at all. He simply answered all the questions I had showed me the products as he explained each one to me.  I sure didn't mean to keep him after hours however I am glad he Did Not mind at all and didn't shove me out the door with just anything.  I am 100% satisfied with my visit as well as the products I purchased. Ms Jennifer, Isaiah is absolutely fantastic!! I appreciate the kindness and professionalism he possess..", "pics": null, "resp": null, "gmap_id": "0x889a57bfa4ab309d:0x9e7813b2117757a7"}
{"user_id": "103825509861657052011", "name": "Leah Rae Brazell", "time": 1597168723044, "rating": 5.0, "text": "Staff is always friendly prices are just right and they offer a loyalty program earn points get discounts 💕", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMQo234Rep4TtDeNDb4HJgF_r1tCDObDjjZ2RU5=w150-h150-k-no-p"]}], "resp": {"time": 1597175339562, "text": "We are so glad you get consistent, great service & are loyal to us! Thank you!"}, "gmap_id": "0x889a57bfa4ab309d:0x9e7813b2117757a7"}
{"user_id": "100295428454693099111", "name": "RTE", "time": 1608154628924, "rating": 5.0, "text": "These people are amazing. They are a buisniess with heart. They have tons of knowledge and can suggest you product that actually works for what you need it to. They are PET FRIENDLY as well. If you have an old dear 4 legged companion like I do, and you find she's not as spunky or in pain, talk to these folks. They can and will help. They will lead you to product that can make all the difference in how your 4 legged loved one faces the day. Hailey at the Downtown location is a pure gem. You can't go wrong with these loving, caring, friendly, Knowledgeable folks!", "pics": null, "resp": {"time": 1608155498602, "text": "Thank you so much! We are so thankful for you & your fur baby! Hailey is like a daughter to me & I adore how much people love her! She is a treasure to the mission! We appreciate your support!"}, "gmap_id": "0x889a57bfa4ab309d:0x9e7813b2117757a7"}
{"user_id": "114979571804200449281", "name": "kitty lang", "time": 1621903292196, "rating": 5.0, "text": "Very knowledgeable owner. They were awesome help and have great products!", "pics": null, "resp": null, "gmap_id": "0x889a57bfa4ab309d:0x9e7813b2117757a7"}
{"user_id": "112633265044614782366", "name": "Rosie Humbarger", "time": 1570904423157, "rating": 5.0, "text": "I loved the friendly customer service, welcoming atmosphere and so many different options! I got 3.5 grams of cbd bud tastes amazing and helps with back pain. I already opened this bag so it's missing some lol", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMeMKGj_L7PTa091PyVRQn3km1xvtQi-Q-00KuA=w150-h150-k-no-p"]}], "resp": {"time": 1573534776727, "text": "Thank you!"}, "gmap_id": "0x889a57bfa4ab309d:0x9e7813b2117757a7"}
{"user_id": "110985674233330436724", "name": "Kourtlyn Smith", "time": 1618946316771, "rating": 5.0, "text": "Very welcoming and educational I got exactly what I needed and I learned alot the place is also very pleasing to the eye. They have various product so I'm sure there is something for you 😉.", "pics": null, "resp": null, "gmap_id": "0x889a57bfa4ab309d:0x9e7813b2117757a7"}
{"user_id": "103435366504900034065", "name": "Tangi Holmes-Cummings", "time": 1619883094223, "rating": 5.0, "text": "Very very friendly and professional. The young man knows his stuff and great recommendations.", "pics": null, "resp": null, "gmap_id": "0x889a57bfa4ab309d:0x9e7813b2117757a7"}
{"user_id": "108728955321270776480", "name": "jason harsany", "time": 1603912496296, "rating": 5.0, "text": "They are simply the best and most friendly and knowledgeable cannabinoid company in the state! Great people and prices and of course, product", "pics": null, "resp": {"time": 1608155532826, "text": "Thank you so much!"}, "gmap_id": "0x889a57bfa4ab309d:0x9e7813b2117757a7"}
{"user_id": "101786362385471203827", "name": "Laurie Anne Armour", "time": 1570112788993, "rating": 5.0, "text": "The staff is always welcoming and are incredibly knowledgeable about their product. They won’t sell you something unless they know that you’re educated on what you’re buying. The products I’ve purchased have helped me deal with migraines and depression. Their CBD coffee is AMAZING. I love this place so much!", "pics": null, "resp": {"time": 1570114079014, "text": "Thank you so much, Laurie! We appreciate your support!"}, "gmap_id": "0x889a57bfa4ab309d:0x9e7813b2117757a7"}
{"user_id": "115706704719105624156", "name": "maria robinson", "time": 1570113098323, "rating": 5.0, "text": "Great selection, beautiful layout and super knowledgeable staff! So excited to have the new West Mobile location just minutes from my house!! Recommend this place to everyone who is curious about CBD - the staff takes time to answer questions and help you figure out the best product for what you need.", "pics": null, "resp": {"time": 1570114119006, "text": "Thank you for your kind words & your patronage! We are honored!"}, "gmap_id": "0x889a57bfa4ab309d:0x9e7813b2117757a7"}
{"user_id": "116207802407335851390", "name": "Thierry Roussel", "time": 1617993921498, "rating": 5.0, "text": "Super cool place, cool dog", "pics": null, "resp": null, "gmap_id": "0x889a57bfa4ab309d:0x9e7813b2117757a7"}
{"user_id": "106400226445239987097", "name": "Louis Shamburger", "time": 1594696463190, "rating": 5.0, "text": "The staff was friendly,and helpful.. Clara was very very patient with both myself and brother.. Cannabama forever..", "pics": null, "resp": {"time": 1594697846094, "text": "Thank you!"}, "gmap_id": "0x889a57bfa4ab309d:0x9e7813b2117757a7"}
{"user_id": "109725807023561751151", "name": "Martha Skinner", "time": 1570309792044, "rating": 5.0, "text": "Both locations have knowledge staff who take the time to sit down with you and talk with you to determine the best product (s) to meet your needs. Jennifer is the best mother hen over both stores! She is God passionate about these products and the fact that they can, have, will change lives. I drive to Mobile and shop Cannabama only.", "pics": null, "resp": {"time": 1570312070564, "text": "Thank you for your kindness & support...we don't take your trips here for granted! ❤"}, "gmap_id": "0x889a57bfa4ab309d:0x9e7813b2117757a7"}
{"user_id": "116609513568669921966", "name": "Roberto Singleton Jr", "time": 1582736184356, "rating": 5.0, "text": "Visited from Florida during Mardi Gras. Audrey was very helpful, it was my first time trying CBD and she politely and effectively answered my questions and made personal recommendations. Thanks.", "pics": null, "resp": {"time": 1582740505065, "text": "That's awesome! We are so glad you enjoyed our store & our city! Thank you!"}, "gmap_id": "0x889a57bfa4ab309d:0x9e7813b2117757a7"}
{"user_id": "106500122592912288923", "name": "Nick Sierke", "time": 1570211576788, "rating": 5.0, "text": "Super knowledgeable staff, very friendly. Excellent quality products!! Great flower 🌹", "pics": null, "resp": {"time": 1570224331520, "text": "Thank you!"}, "gmap_id": "0x889a57bfa4ab309d:0x9e7813b2117757a7"}
{"user_id": "102938251158308538906", "name": "Viviane Hentschel", "time": 1570404480478, "rating": 5.0, "text": "Awesome place, everybody is super nice and knowledgeable. I love that they also have products for pets!", "pics": null, "resp": {"time": 1570407970132, "text": "Thank you! We work hard to serve our customers & their fur babies!"}, "gmap_id": "0x889a57bfa4ab309d:0x9e7813b2117757a7"}
{"user_id": "114418057541576525636", "name": "Brian Fulmer", "time": 1570120019398, "rating": 5.0, "text": "The staff is incredibly knowledgeable and friendly. If you are looking for CBD products and live with 50 miles this is the place to go. Can’t recommend it enough!!!", "pics": null, "resp": {"time": 1570134474415, "text": "Thanks, Brian! We appreciate your trust & confidence!"}, "gmap_id": "0x889a57bfa4ab309d:0x9e7813b2117757a7"}
{"user_id": "107373314778101811183", "name": "nicholas sierke", "time": 1572198040368, "rating": 5.0, "text": "Great staff, great products, very knowledgeable staff. Awesome place for all of your CBD needs.", "pics": null, "resp": {"time": 1573534760917, "text": "Thank you!"}, "gmap_id": "0x889a57bfa4ab309d:0x9e7813b2117757a7"}
{"user_id": "102051829331397704589", "name": "Alisa Chestnut", "time": 1570859988105, "rating": 5.0, "text": "The best experience when I  introduce my mom to the store. My mom of course were not knowledgeable about CBD products. She has never been a smoking fan. The day I  took my mom to the Canna Bama shop. The staff were very knowledgeable and thier patience is amazing. they explained  to my mom about CBD products. We end up buying CBD oil.  all that day my blood pressure was up. I'm telling you when she try the product. Instantly her blood pressure went back  down  to normal. make the long story short. CBD Products is here to make you better.  Don't Knock it until you try it.", "pics": null, "resp": {"time": 1570863367491, "text": "That's so awesome! Thanks for sharing your mom's story & for your faith is CannaBama!"}, "gmap_id": "0x889a57bfa4ab309d:0x9e7813b2117757a7"}
{"user_id": "112601142441129181948", "name": "shantrail smith", "time": 1569791383140, "rating": 5.0, "text": "Great place. I recommend this place to any body. The staff is the best.", "pics": null, "resp": {"time": 1569793497881, "text": "Thank you! We love our customers!"}, "gmap_id": "0x889a57bfa4ab309d:0x9e7813b2117757a7"}
{"user_id": "105567453458816481183", "name": "Bruanesha Johnson", "time": 1594943028153, "rating": 5.0, "text": "Great place of business love the customer service!!!! 🤗", "pics": null, "resp": {"time": 1594959871170, "text": "Thank you!"}, "gmap_id": "0x889a57bfa4ab309d:0x9e7813b2117757a7"}
{"user_id": "108117184310585783142", "name": "Josh Sweet", "time": 1568828858911, "rating": 5.0, "text": "Great selection great prices friendly staff", "pics": null, "resp": {"time": 1570134522922, "text": "Thank you!"}, "gmap_id": "0x889a57bfa4ab309d:0x9e7813b2117757a7"}
{"user_id": "113448714800966378542", "name": "chad neal", "time": 1546564066806, "rating": 5.0, "text": "Very informative individuals operating this establishment, nice clean operation , I highly recommend stopping in and speaking with the owners , they’ll take as much time needed helping you understand how this now legal awesome plant can help you in so many ways .\nThanks so much for all the help !", "pics": null, "resp": {"time": 1546570774275, "text": "Thanks, I always enjoy your visits!! Happy to help you!"}, "gmap_id": "0x889a57bfa4ab309d:0x9e7813b2117757a7"}
{"user_id": "117035674140361877316", "name": "Angeleigh !", "time": 1570292620186, "rating": 5.0, "text": "AMAZING staff that knows what they’re talking about and super cute store!", "pics": null, "resp": {"time": 1570295647839, "text": "Thank you!❤"}, "gmap_id": "0x889a57bfa4ab309d:0x9e7813b2117757a7"}
{"user_id": "115953338053648734940", "name": "Rat Tail Toneworks", "time": 1597524602184, "rating": 5.0, "text": "Great people and great service!", "pics": null, "resp": {"time": 1597529400283, "text": "Thank you so much for your patronage & kind words!"}, "gmap_id": "0x889a57bfa4ab309d:0x9e7813b2117757a7"}
{"user_id": "105013437035407500168", "name": "Jessica Hamilton", "time": 1546529145858, "rating": 5.0, "text": "Love the knowledge these ladies pass on💜💙💜 they have helped me figure out just what I need!", "pics": null, "resp": {"time": 1546530834506, "text": "Thank you! We work hard to give you great products & even better education!!"}, "gmap_id": "0x889a57bfa4ab309d:0x9e7813b2117757a7"}
{"user_id": "103156926701887595251", "name": "John “Slaprock for real” Mcree", "time": 1558227449649, "rating": 5.0, "text": "Great people and wonderful life changing products. We will be visiting regularly.", "pics": null, "resp": {"time": 1559641572180, "text": "We are happy you had a great experience with our people & our products! Thank you!"}, "gmap_id": "0x889a57bfa4ab309d:0x9e7813b2117757a7"}
{"user_id": "110117027629249450753", "name": "allen young", "time": 1607832449138, "rating": 5.0, "text": "Alabama got real smoke I really doubt this CBD on 3🤘🤘🤘🤘🤘🤘🤘", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPHQQl8jRwzokoztw0BvwZycHr9JjInBtQ2nIHm=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a57bfa4ab309d:0x9e7813b2117757a7"}
{"user_id": "111233537035401871840", "name": "joselita kemp", "time": 1593812768826, "rating": 5.0, "text": "I love the atmosphere and the employees!", "pics": null, "resp": {"time": 1593817935794, "text": "Thanks for your support!"}, "gmap_id": "0x889a57bfa4ab309d:0x9e7813b2117757a7"}
{"user_id": "104474350069958040204", "name": "Martha Skinner", "time": 1546540665196, "rating": 5.0, "text": "These ladies are passionate about educating people about the awesome benefits of CBD. Awesome store, quality products!!!!!", "pics": null, "resp": {"time": 1546553079413, "text": "Thank you!! We count it a privilege to serve you!"}, "gmap_id": "0x889a57bfa4ab309d:0x9e7813b2117757a7"}
{"user_id": "104181279585198913974", "name": "Tony Tejas Ingram", "time": 1583779230337, "rating": 5.0, "text": "Great location for Hemp knowledge and products.", "pics": null, "resp": {"time": 1583784211219, "text": "Thank you!❤"}, "gmap_id": "0x889a57bfa4ab309d:0x9e7813b2117757a7"}
{"user_id": "115987315176917896066", "name": "Robert Lee", "time": 1594696657870, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": {"time": 1594697855237, "text": "Thank you!"}, "gmap_id": "0x889a57bfa4ab309d:0x9e7813b2117757a7"}
{"user_id": "102767821580608969396", "name": "Robin Perkins", "time": 1546535523323, "rating": 5.0, "text": "Knowledgeable genuine caring staff", "pics": null, "resp": {"time": 1546553100527, "text": "Thank you!"}, "gmap_id": "0x889a57bfa4ab309d:0x9e7813b2117757a7"}
{"user_id": "111924263577263949086", "name": "Tracy Wilgis", "time": 1606941001315, "rating": 5.0, "text": "Very Knowledgable about these products. Gummies are the bomb!", "pics": null, "resp": null, "gmap_id": "0x8892ed2adfb0dfd7:0x8a9388809f74a24e"}
{"user_id": "115899796761302148509", "name": "Nicole Holland-Hall", "time": 1619993376811, "rating": 5.0, "text": "Great people", "pics": null, "resp": null, "gmap_id": "0x8892ed2adfb0dfd7:0x8a9388809f74a24e"}
{"user_id": "116329889988890747155", "name": "Tec Tony", "time": 1569344776249, "rating": 5.0, "text": "Love me some Hemp, no let's legaliz the real stuff plz 😉❤️🤪🌿", "pics": null, "resp": null, "gmap_id": "0x8892ed2adfb0dfd7:0x8a9388809f74a24e"}
{"user_id": "102888868239040381729", "name": "Joseph Wilk", "time": 1612776979876, "rating": 4.0, "text": "Nice people", "pics": null, "resp": null, "gmap_id": "0x8892ed2adfb0dfd7:0x8a9388809f74a24e"}
{"user_id": "112608320832286788717", "name": "Ryan Cass", "time": 1620164516407, "rating": 4.0, "text": "Whole Foods is a really nice store as far as atmosphere and cleanliness go. They’ve got a good selection too and most everything I’ve purchased from here has been good. I only wish they could run sales more often, especially considering the Amazon buy out was supposed to make the products here more affordable but I haven’t seen much of a difference.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNEw8h2XcezTkPdVFUkd8RNw6WO2oa1wKkuwnG7=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOnipZmG8UoLuX4HSNWCyjcEjUaDwk5PFMOCKRy=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPdN0fYIooFb6IpI2c1XfgInI3tdoTzqOIPAkKb=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMs-PWZoE0yJ0Mpx45P4la0C1r5bcpBkP8KXsTq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMVuE5pJFadvU3m6WQNuvJGmBERc9Loow1z9AQO=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO_D8hxDoEiBEcnLt2_uHLx5C9Zt5n2_9bYDMby=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "117378950648451303023", "name": "Paul Smith", "time": 1620008928072, "rating": 5.0, "text": "I havent checked what other reviewers are saying about this place but to me it was impressive. A niche business that specializes in whole healthy sustainably foods so expect to pay more. Clean, well lit,  people friendly. I didn't interact with too many people but the lady that works at the seafood counter was very friendly and offered great service and those at the checkout were as well.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "116277307480015845948", "name": "Charlie Boy", "time": 1613063131297, "rating": 2.0, "text": "Oh Whole Foods, what has gone wrong? Whelp, the employees were great. Helpful, polite, and soft spoken. I greatly appreciate good customer service, which saved y'all from a one star.\n\nPros: Clean, well lit, good customer service.\n\nCons: The fact I could Smell cooked bacon and sausage throughout the store, but there was none to be found.\nThe prosciutto was grey and looked dried out.\nThe muffins were bland, and what's worse, the chocolate on the double chocolnate muffins had bloomed, which meant that it had gone bad and would taste disgusting.\nThe big bakery department was gone. No more wall of delicious breads to enjoy.\n\nAs Whole Foods go it's average. The selection is the same, the spaced out well lit isles are the same. It's the little things that set them apart for the better or worse. In this case there's room for improvement guys.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN-_OV4bVSM9Tamt2dnFN_SbwP3oxPX7wCyYuGJ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMUIaXU-ugZclYKwneCQmBUPM13SuGHnfpI01he=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPCJPw4a7mx9YCETyIKdG4c7vWQ9t0HNaki0bJn=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOhotCzdWxD66BkI5SGkpLyjkt0BNNXnw6acvc8=w150-h150-k-no-p"]}], "resp": {"time": 1613064238060, "text": "Hi Charles, thanks for your honest feedback regarding the Huntsville store. We've gone ahead and shared your experience with our internal team for their review. We hope to welcome you back again soon."}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102142586189958471290", "name": "Matt McKechnie", "time": 1619668147103, "rating": 2.0, "text": "I'm always drawn here as a source for unique and organic items. But ever since the amazon merge it's had less and less for what I am looking. Now I go to fresh market instead.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113906435421251253013", "name": "Leah Moss", "time": 1618646878457, "rating": 5.0, "text": "I went to return item from Amazon. It was a great experience.  Walked in gave opened item. They sealed it, scanned return code on my phone and I was done. Excellent!!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "118312505054316091256", "name": "John Traylor", "time": 1623123117053, "rating": 5.0, "text": "Excellent products, excellent service, great foods, fresh and unique produce.  Great asset to Huntsville.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "116379285216348491953", "name": "Alisha Collier", "time": 1610236640857, "rating": 5.0, "text": "Whole Foods is one me and my daughter’s favorite place to “hang out” since covid. We love going and perusing the aisles for new, healthy items like the fruit leather we just discovered and old favorites like the bird’s nest baklava, blue cheese stuffed olives, and cherry, cream cheese danish. The natural health care and beauty items are also fun too. Also, the Amazon Prime discount is great! I highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "108535045438030792309", "name": "Brian Hackathorne", "time": 1619363313102, "rating": 5.0, "text": "Super easy location for downtown and surrounding areas. Always stocked with what I'm looking for. Great people working there.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "116431655015737564777", "name": "Kelli T", "time": 1618792781191, "rating": 5.0, "text": "Stopped by for steamed pork buns 👩‍🍳 delish as usual.  Following Covid guidelines and masks are still required.  Hot bars still aren't open, but I did pick up a rotisserie chicken.  Pleasant experience :)", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "118002752014768839086", "name": "H S", "time": 1620682430374, "rating": 5.0, "text": "Nice shopping experience.  Found just what we wanted and associates were very helpful.", "pics": null, "resp": {"time": 1620683135773, "text": "We're so glad to hear! We hope you have a great day!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "114140239837564675095", "name": "Bradshaw Ridge Outdoors", "time": 1617826239580, "rating": 3.0, "text": "Its just not the same as it used to be... they all seem like zombies. Used too before the amazon take over there were local items, and the people seemed genuine. Now its just all corporate vibes. Its like I'm inside an organic more expensive walmart. There is no longer that vibe. BUT they do have fire sushi.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "110914718500825523926", "name": "G.", "time": 1614992404269, "rating": 1.0, "text": "Ordered two large pizzas on Wednesday Match 5th. One meat pizza , other veggie. Got home ready to enjoy our lunch. Disappointed to the max, my Wife and I commented it probably would have been tastier to eat the Pizza box. Very little pizza sauce, very little cheese. Called the manager, told her my story no problem come back in for a refund. Saved my $40. Talked to the Pizza Dept Manager expressed my feelings. Reason no taste they measure the save out and the cheese can't be over on account of their pizza ovens, guess bezo doesn't have enough funds to just layer the sauce and get the proper ovens. I would recommend stay away , waste of money there not cheap. They lost the soul of a pizza by measuring! Terrible waste of my time , do not order the pizza just ask for the box to go I'm sure it will taste far better.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "101492682373237896164", "name": "Mariessa Theno", "time": 1621035204016, "rating": 4.0, "text": "I love WF. They quit carrying several of my favorite items, but i love the produce.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "111276199794938266454", "name": "Don Williams", "time": 1618524821480, "rating": 2.0, "text": "although this place is clean and presentable, the prices are high and the selection is limited. the organization is very confusing.\nif you are looking for organic items you would probably prefer this place but if you are looking at saving money on groceries this is not the place.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102981865910519606897", "name": "James Toquero", "time": 1622313047128, "rating": 1.0, "text": "Normally have to wait about 10mins for someone to notice you at the Allegro coffee and bake shop. Gotta do better Whole Foods.", "pics": null, "resp": {"time": 1622313748907, "text": "We're so sorry you were disappointed on your recent visit, James. We'll go ahead and share your feedback with our internal team for review. We hope you enjoy the rest of your day!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104570704134393535825", "name": "Afro Dynamite", "time": 1611272742808, "rating": 5.0, "text": "Great selection of produce. And! They have in store, dry aged beef!! The staff is friendly and helpful. For those looking for for pork bellies, look no further. So many excellent options across the board.", "pics": null, "resp": {"time": 1611273620913, "text": "We enjoy bringing a large variety of products to our customers. Thanks for stopping by!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "115544687261012060087", "name": "Hector Murrieta", "time": 1619294408729, "rating": 4.0, "text": "Nice supermarket, you can usually find things that aren't available in other grocery stores.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "112830382790432705610", "name": "Sandra Guthrie", "time": 1604246227821, "rating": 4.0, "text": "Was my first time here great options everyone was helpful except 1person that worked there asked him for help and was told it was over on the next aisle never found what I was looking for. Everyone behind counters very attentive the workers on the floor should take note from them. That's why a 4 star instead of a 5.\nBut you really should try this place so many different options.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "103308290574492256689", "name": "柴田祐司朗", "time": 1613501995211, "rating": 5.0, "text": "We also have Japanese food.\nIt's a little expensive, but the quality is excellent.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNfqBs2Vl9X_0bCzoLnTDwTNCwGyYq2rhD-d5tF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPJexV-THQDqDGv809GZyMk1ksJzvKCvxu3sLdr=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM7k_rj1ywKKrsibo6MJk0GTnV5wiBrDJvyTc_W=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOU4q47IHEIipg99MJrzHnCqlXMt3a_SQdd8hni=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO3J2-Hpy7pbq3klXBrD7xYDBk9_HlCAiIoo5fS=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNGuHxHVzs0dJSnCpQW7KFezznbjdAtb4E5gycr=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOWwV12jS_k4llZsA6djec8m98X22ZN_sHBrXWL=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMDzWl42nmU3juaj0opTfJWhvlV89cpkuOQONup=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "115140325057427830347", "name": "Kayra Dunn", "time": 1621054824026, "rating": 5.0, "text": "Good food, clean, and helpful people.  Love the veggie sushi.  Plain roasted whole chicken is very good.  Enjoy the entire store.", "pics": null, "resp": {"time": 1620953081501, "text": "Thanks for the love and support, Kayra!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104476000657942923380", "name": "Jenna Burd Streeter", "time": 1619287819996, "rating": 5.0, "text": "Big and well stocked with pizza, sushi, and prepared food. Yum", "pics": null, "resp": {"time": 1619288289974, "text": "Thanks for stopping by, Jenna!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "116079900107372408943", "name": "Tim Allen", "time": 1614555318091, "rating": 5.0, "text": "Returning Amazon purchase. Super easy. Wonderful and friendly staff!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "115529195882152515868", "name": "Jay Zdonek", "time": 1623208252279, "rating": 5.0, "text": "Clean, friendly, had everything we needed.", "pics": null, "resp": {"time": 1623240305878, "text": "It's always a pleasure to have you in our store, Jay!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "110353406261446861999", "name": "Joseph Martin", "time": 1604429664085, "rating": 4.0, "text": "My initial reveiw was for a different store. This store is great, well lit and clean. My only issue is this particular store took away their store brand beer for 3.99.. its actually a fairly decent beer and for that price I would drive the 30 miles to get it.\nI realize this a slightly selfish review however I feel that most of their prices are a bit higher than local shop and stores so I tend to not shop here for that reason also.", "pics": null, "resp": {"time": 1603574048152, "text": "We appreciate your feedback about the lighting inside the store, Joseph. We'll pass this along to store leadership to look into. Thanks for bringing this to our attention."}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "111571322735983927293", "name": "david levine", "time": 1604861972892, "rating": 3.0, "text": "I asked the clerk where I might find creamed herring. He looked at me clueless but got on his radio and called up front to one of the managers who told him we don't carry any such thing. I spent another 20 minutes walking around till I finally located it myself. The store was quiet very few people there yet I waited a full six minutes waiting for someone to come and serve me a coffee. I sense a smug energy in the store, which was very unlike my Whole Foods back in California. For the prices they charge in today's Times, I don't think a cheerful attitude is asking for too much.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "109150680402462751844", "name": "susan glandon", "time": 1607539548120, "rating": 5.0, "text": "I love Whole Foods. Organic fruits and vegetables,  non-GMO, AND, you can find great juices, and foods, on sale, if you take the time. $4.99 organic cherry juice? Done!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "115682702823247146102", "name": "Jason Harrell", "time": 1622401268139, "rating": 5.0, "text": "Great selection of premium food items", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102325844154582109476", "name": "Tina Martinson", "time": 1610153693520, "rating": 5.0, "text": "Clean, safe environment. Friendly staff. Very helpful. Fresh produce.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "106746480869447977261", "name": "Mary Ingram", "time": 1611268661138, "rating": 5.0, "text": "Excellent customer service, great product selection, and more affordable nowadays if you have Amazon Prime, shop with coupons, and wait for sales", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "107039506998344897554", "name": "Jeremy Basden", "time": 1612892286108, "rating": 5.0, "text": "I love every visit!! Never fails to come out a happy customer!!", "pics": null, "resp": {"time": 1612893111119, "text": "Happy to hear you love shopping with us!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "105519276032769523936", "name": "John Foll", "time": 1608691897889, "rating": 3.0, "text": "The management have forgotten for some time now their base customers, who are vegan and sound health conscious, and follow after fads., it's getting harder and harder to find whole wheat products and some vegan products - you can no longer find some of them there by there anymor. It seems that it's they're changing a customer base. Cuz the people who buy what I buy are going to go somewhere else or have to buy some of their items there and the rest of what they need somewhere else. They might get new customers or those following unsound fad diets, but they're going to lose their other customers at some point, especially if another store opens up that sells what the sound health conscious people want.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "114140266841973607924", "name": "Jane Burns", "time": 1607317060670, "rating": 5.0, "text": "Perfect spot for getting my organic groceries and charging my car. The quinoa here is always fresh.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "103461324183032244647", "name": "William Smart", "time": 1620533016540, "rating": 5.0, "text": "Excellence place to buy water.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "117653385980994328578", "name": "Florence Taylor", "time": 1618696697448, "rating": 4.0, "text": "My first time going to this store. I just looked around. They have quality fruits and Veggies. I will try shopping there next time. The price is high but according to them, it's whole food", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "100671234871295848268", "name": "Zed Linger", "time": 1619973982730, "rating": 3.0, "text": "Selection is poor but workers are GREAT", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "109331867229518818331", "name": "Pat Jones", "time": 1620497000086, "rating": 5.0, "text": "Fast returns for amazon puchSes", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104706063959542241871", "name": "Richard Flood", "time": 1609380527430, "rating": 5.0, "text": "Not all vegan tastes like cardboard.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPy_68U-0_J69JouWRjL1IrzG-dNR7uGpmyOGVV=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "105436336940836078020", "name": "Chadwick Towry", "time": 1605042473192, "rating": 5.0, "text": "I absolutely loved this place. Great pizza, sushi and rice bowls....plus amazing service", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113553106695889720035", "name": "misty owens", "time": 1619221715504, "rating": 1.0, "text": "Alabama lifted the mask mandate yet they are forcing masks???  I'll shop elsewhere. Its a choice not a mandate!!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "103166172093242512309", "name": "Michelle Yates", "time": 1614114663397, "rating": 5.0, "text": "love this store!!\ngreat fresh seafood", "pics": null, "resp": {"time": 1614115100223, "text": "Thanks for the love, Michelle!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102311299525927736627", "name": "mike jones", "time": 1614477269543, "rating": 1.0, "text": "Really need someone from upper management to contact me I have never been disrespected by workers in my life before and two of them were the manager one with a ponytail and a female with dark hair they talked to me like I was nothing", "pics": null, "resp": {"time": 1614477477587, "text": "Hi Mike, we're sorry to hear about the experience you had with some of our team members. Please reach out to us at wfm.com/help so that we can follow up with you. We'd like to document it and make sure it gets to the appropriate leadership team. Thanks for bringing this to our attention."}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104362665486683113103", "name": "James Daughtry", "time": 1598665502788, "rating": 5.0, "text": "Love sales for Prime members.  Great, unusual selection, much organic.  Wild caught USA salmon.  Bread.  Cheese. Hot foods.", "pics": null, "resp": {"time": 1598665945885, "text": "We're glad to hear that you are pleased with our store selections and discounts, James. Thanks for shopping with us!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "108513730800676341653", "name": "Sara Hardin", "time": 1596112662041, "rating": 5.0, "text": "I didnt realize they have great prices,  I expected everything to be way overpriced but it wasn't,  actually if you are a prime member you get down right great prices!! Take your own bag and even get a little discount for that! Absolutely beautiful store with things you can't find at other stores!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "109879078950456917377", "name": "Jim Richards", "time": 1617506889712, "rating": 5.0, "text": "The service is always incredible.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113778443083392824974", "name": "Amy Mansell", "time": 1619013116292, "rating": 2.0, "text": "The door person mumbled and I couldn't understand a thing he was trying to say. I went to return an Amazon item and that cashier was kind of rude also. I was going to do a little shopping, but after all that, I just left. I hope my return goes through.", "pics": null, "resp": {"time": 1619013897502, "text": "We are sorry to hear about your experience with the customer service, Amy. Please forward your review over to us at wholefoodsmarket.com/help and an agent will be more than happy to assist you with these issues."}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "103974987911175032095", "name": "Darryl Thomas Jr", "time": 1615234071780, "rating": 5.0, "text": "Great food!  Good pricing!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "110660122339048534933", "name": "Angela Whitlock", "time": 1609367298127, "rating": 5.0, "text": "Kind of expensive... but if you're a vegan, they have some of the best vegan selections in the area!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "100268666179256985271", "name": "Cheryl Sapp", "time": 1604178234732, "rating": 5.0, "text": "Love the ambiance, the staff and the products. The price is nice too.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104900523615344892938", "name": "Kelley Hall", "time": 1593532640205, "rating": 2.0, "text": "I had a bad experience with the butcher.  He made smart remarks to me, not once, but twice in an effort to antagonize me.  I reported it to the manager but I did not feel he would do much.  The rest of the staff there were very friendly and asked me often if they could help me.  I am hoping my next visit would be more pleasant.", "pics": null, "resp": {"time": 1593629483426, "text": "We appreciate you bringing this to our attention, Kelley. We're sorry to hear about your customer service experience at our Huntsville location. Mind following up with us regarding this issue? Please use the provided link for additional assistance: www.wfm.com/help"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104660907043666156150", "name": "John Buckelew", "time": 1597020224626, "rating": 4.0, "text": "Great selection but a bit pricey.\nOlive Bar is fantastic. (When there's not a pandemic going on.)", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "107409997659882440771", "name": "shaun mclaughlin", "time": 1613867867929, "rating": 5.0, "text": "So much selection. I could wander around there all day", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "109876929732465867477", "name": "Paula Lindon", "time": 1528998553310, "rating": 5.0, "text": "Clean, great atmosphere and prices! We ate pizza by the dice and Stromboli from their in house pizza place, Spazios. Delicious!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipORcwrvtEIwcdTbBom5WUsY-cCLQ2Qnp2oY2mOP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNlrZIYZNHokC7PhOqyft7ed4N-Fo7AerRRaUnJ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMMhhg5F-20mNTPz3TPSjgyd6c96q-VKt5T27Ok=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOlaATw49llGfin3j2mD6uszSP82UJcLEFLKTCy=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN2ZBQBgKqXeg4HPFDkNpMSKDKiPaf8JI0qbTfw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMnj5ZsZ6uVZ5GMudOqtchBZEWSdAsuXXcD13Q4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMypGSBdVxXhZ-SOklhF3tjERqKNRNRBjKk-BOI=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "114678771439236343626", "name": "Anthony", "time": 1601072853392, "rating": 1.0, "text": "Watch out for incorrect pricing. On two occasions in the past couple of months, I have had to receive a refund for being overcharged. The first time was for ribs that were “on sale” and the second for regular priced ground chicken. The second time I supposedly received a refund, I did not see a credit back to my account. This location also doesn’t answer their phone", "pics": null, "resp": {"time": 1601074511931, "text": "We're sorry to hear about the difficulties you've had at our store, Anthony.  Please reach out to us at wfm.com/help regarding the refund of the ground chicken. We'd be happy to look into it to see if the refund was processed."}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "118223677659829833655", "name": "Matt Kennedy", "time": 1581022845107, "rating": 5.0, "text": "I see this place all the time going to Kickin My Habit and thought it was just another Earth Fare but man was I wrong.  Staff is nice and ready to help and prices are good.  They are REALLY good if you have an Amazon Prime account $$$$.  Check them out for a better healthier choice of foods.  Recommend the Kettle potato chips for sure.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "116366659688530208999", "name": "Robin Bennett", "time": 1604850013369, "rating": 5.0, "text": "I love whole foods for their japanese sweet potatoes", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "107260630568439854217", "name": "Desiree Whyel", "time": 1615166405087, "rating": 1.0, "text": "My husband went in to purchase water an was harassed by an associate about a mask the guy followed him around the store an told him he wouldn't let him check out if he didn't put a mask on that is not customer service inwoildnt recommend going there an we will not be back", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "117488670595013568469", "name": "Trent Pace", "time": 1604441934208, "rating": 5.0, "text": "One of the best places in town for clean food shopping.", "pics": null, "resp": {"time": 1604442158629, "text": "Thank you for the nice review, Trent!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "101667508879569859295", "name": "Ana Cruz", "time": 1612306867835, "rating": 5.0, "text": "Very good customer service.", "pics": null, "resp": {"time": 1612307460873, "text": "Our team loves to help!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104646036867509457126", "name": "Irrelevant info", "time": 1577303766424, "rating": 5.0, "text": "I love shopping here as they have selections that other stores do not commonly carry. The take-out bar is always great too. The cakes and pastries that are in the display case are a little...different in taste, but it depends on the individual I guess. The service is always fast and friendly, and it is a peaceful and respectable shopping experience that does not annoy me to no end.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "114429590628606961998", "name": "Erik Walsh", "time": 1619124343876, "rating": 5.0, "text": "Great all around", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "117320087732229190435", "name": "Charles Thomerson", "time": 1603309128492, "rating": 5.0, "text": "Friendly staff, great prices. Will be back", "pics": null, "resp": {"time": 1603310295152, "text": "Thanks Charles!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "105378241358331887321", "name": "Mr. Tree (MrTeeBuilder)", "time": 1612823766077, "rating": 1.0, "text": "Worst pizza in the entire world I am 99% sure of it.", "pics": null, "resp": {"time": 1612824631939, "text": "We're sorry to hear about the pizza. Please feel free to contact us a wfm.com/help and we'd be happy to assist."}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "110458861749183449629", "name": "Jessica Misenheimer", "time": 1597842205186, "rating": 5.0, "text": "Sorry for the long post. I  want to take a moment to say how grateful I am that whole foods delivers all the way out to my neighborhood. I did a pickup order from Walmart yesterday because there are a few things I just can't get at whole foods that I can at Walmart. The pickup window I chose was between 4:00 to 5:00 p.m. they sent me a message at 4:00 saying my groceries were delayed. 6: 00 p.m. they send me another email saying my groceries are ready to pick up so I sent my husband to go get them. After 30 minutes of him waiting I called Walmart and the poor department head (which I felt really bad for him) Said that he walked into a mess and he had been working 14 hours that day. I asked him how long he thought it would be for my groceries to come out to the car and he told me he honestly had no idea. I asked him to go ahead and just cancel my order and my husband came home. About 7:00 to 8:00 p.m. I went on to whole foods and placed my order and my groceries were here the next morning. Long story short I will not be shopping at Walmart anymore way to go whole foods!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "108635523050570577789", "name": "Owen Eason", "time": 1618364550534, "rating": 5.0, "text": "Helpful staff.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "117978028098213686384", "name": "Felecia Hives", "time": 1617285900257, "rating": 5.0, "text": "I can shop and charge my car, thanks", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "105669982662328256367", "name": "Peter H", "time": 1583172719566, "rating": 2.0, "text": "I like many of the options this store has to offer, however, the experience of checkout is always a hassle.  It makes me consider more convenient options. For example, I feel like they never have enough cashiers and the entire process has been a bottleneck or at the very least, a slow experience almost everytime I go.  Lunch time usually being the most difficult.", "pics": null, "resp": {"time": 1583387055129, "text": "We appreciate the feedback about the long lines at check out, Peter. We'll pass this along to store leadership so they can review staffing issues during busy times."}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "116424236329109685500", "name": "Melissa Escamilla", "time": 1550605702446, "rating": 5.0, "text": "Music, atmosphere, & delicious eats makes trying new foods exciting!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMMmwO0G1RkZrLU778b40CMPqVAm5tEAUjJtkkm=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNQGAZRL3zDEQAv-lbdZ2XKOA2O5VVYCNO5n6dz=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP7Am-i6KvlNhif0tCEZxGkwt7txKVBpJdpzD8f=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOc4lanrW7DKtmq4f7Z50e2utn_O4Odd3bRY2cM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNHE-zO-BVg_u_ETJ3vBvOPei_7F43G9ulL1JKl=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPKlp0g1MPF3aZa8cV-XIGQKxUQpnnmVyYO4jtf=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNbUMnmnW1Wgerw0cknjhmKRAkAtS3AZ92Wpxd6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMdk8jhkgPPxnFMGsn4_kuOwn9TYw_4ocw3nrVS=w150-h150-k-no-p"]}], "resp": {"time": 1550682769780, "text": "Thanks for the awesome review, Melissa!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104774078294776530293", "name": "Jeff McKinney", "time": 1590872338004, "rating": 5.0, "text": "Store was clean and orderly, as always, with a knowledgeable and helpful staff. On of the few grocers in Huntsville where you will find 100% COVID safety compliant staff and most customers who are smart enough to voluntarily comply with masking and sanitizing.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104162821817455176519", "name": "Andee D", "time": 1605904625992, "rating": 2.0, "text": "Too expensive. It is ridiculous", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "117697415578661716294", "name": "Marion Studer", "time": 1583725479143, "rating": 5.0, "text": "Very nice store.  Prices are a bit high, but very nice produce.  Store is very clean and staff very helpful.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "101826315466677514640", "name": "Paul Stoneking", "time": 1614651933516, "rating": 5.0, "text": "Always has what I am looking for.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "105589566879883477863", "name": "Kimberly Norris", "time": 1574829305340, "rating": 5.0, "text": "This grocery store in my place of choice for buying wine and meat. They have local and grass fed meat that you can really taste the difference and freshness. Much larger wine selection than other grocery stores in the area", "pics": null, "resp": {"time": 1574864780976, "text": "We appreciate the wonderful review, Kimberly!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "101567707149390801194", "name": "katandthefids everything2cellos", "time": 1583028171865, "rating": 4.0, "text": "I love this store. I just always spend too much money here. Disappointed in how they let their hot food bar decline. It used to have so much good stuff, now it seems to be all pork and chicken....", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "117593790248128865682", "name": "Christina Morgan", "time": 1535288948514, "rating": 5.0, "text": "This whole foods had an awesome pizza joint that makes custom order pizzas in a really cool pizza oven! Their selection is great, and the staff was awesome and friendly. I enjoyed their pretty extensive wine collection and the great olive bar. There are lots of prepared foods if you're looking for a quick lunch or an easy dinner.\n\nThis is one of my favorite Whole Foods that I've ever been to. It's in a fairly new shopping center and the store itself is bright and very clean. You can't go wrong with this store if you are into this type of store in general.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "100017699254844303147", "name": "AhRayah Raash", "time": 1566738102939, "rating": 4.0, "text": "Good service but not as over friendly as most Publix staff for a comparison.   Great selection of groceries and the buffets are top notch.   Butcher shop is not one to return calls for orders it seems (multiple occasions).  Good store.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "108316286061402229158", "name": "Paula Price", "time": 1593986603919, "rating": 5.0, "text": "Wonderful place to buy all my plant based diet needs!!!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "100464716479037591688", "name": "Leif L.", "time": 1554619465792, "rating": 3.0, "text": "I don't think this place is for me. Prices are beyond expensive, quality of products is very high however. Service was great and friendly. Attached pizza place is extremely good. Would recommend the freshly made foods at the location over buying the normal grocery products.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "109714748015811169209", "name": "Jesse Graham", "time": 1551676852589, "rating": 5.0, "text": "This Whole Foods is in a great location, close to a bunch of good restaurants and stores. Really like coming here for some harder to find items. They carry some great coffees and the prices are not as horrific as you hear. Not a fan of the self service food bar, extremely bland, but the pizza and sushi bars make up for it. Recommend this store.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "116576327026011409900", "name": "Paul M", "time": 1600099293542, "rating": 3.0, "text": "What I only have to say is that their parking lot smell like a dump, and that’s always. 🤢🤮", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "100695893588973193257", "name": "Brooke Stidham", "time": 1608060358058, "rating": 5.0, "text": "Love the staff at this store!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "110055573676873706607", "name": "Ariel Marie", "time": 1582638049445, "rating": 5.0, "text": "Love it!! Excellent prices and the best produce available in store!!! Love their food bars, love the beauty isle, love the spices!! Never been disappointed!!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "112888979153268697650", "name": "April Mathews", "time": 1517787944799, "rating": 5.0, "text": "I love this place!!!! The buffets that are available daily are wonderful.  The sushi bar is great,  the pizza is amazing... and that's just prepared food.  The produce department is absolutely beautiful.  There are so many organic options,  and so many things that you don't see in the \"normal\" grocery store. The health and beauty isles could be their own store because there are so many great products.  I'm so glad that Huntsville finally got a Whole Foods Market.", "pics": null, "resp": {"time": 1519049508620, "text": "Thank you for the review and kind words, April. We are glad you enjoy our store’s atmosphere and are happy that we are able to provide you healthy food options."}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "114053880471687721512", "name": "Taryn Horton", "time": 1575691274486, "rating": 5.0, "text": "Always have a great experience there.  People are super polite. I wish there was one closer to my home.", "pics": null, "resp": {"time": 1575760578444, "text": "Thank you for the nice review, Taryn!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "103203913295207613985", "name": "CGL Phattimus_Prime", "time": 1578164807030, "rating": 5.0, "text": "I love this store. Everything I need is here, customer service is excellent and the produce is top-notch.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "105327534863341033007", "name": "W3 S33 33", "time": 1579455620492, "rating": 3.0, "text": "Not impressed with prepared foods at all.  Not great for anyone plant-based.  Produce is nice, but many of the better products like broccoli raab, Romanesco broccoli, purple cauliflower, prickly pear, etc. are no longer available.  Some products, such as Bragg Nutritional Yeast, take a long time to restock.  This could be due to a lack of availability and food shortages though.", "pics": null, "resp": {"time": 1579568699229, "text": "We appreciate your honest feedback. We will pass this along to our team and hope that the prepared foods will meet your expectations on your next visit. Please feel free to stop by our customer service desk to chat about concerns regarding produce inventory with our team members. We hope you give us another chance."}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "105986767962686641430", "name": "Chelsea Madisetty", "time": 1572744535020, "rating": 2.0, "text": "Good cheese, bad beer. Went to get a specific blue cheese and they were out, however the lady at the cheese counter was very knowledgeable about her area, and told us when to call to see if they had gotten a shipment in. Afterwards we moved over to the beer area to purchase a growler and was ignored by the man working there. He actually walked past us to leave the counter, then came back a few minutes later and continued to ignore us for several minutes. We left without any beer.", "pics": null, "resp": {"time": 1572796113271, "text": "We appreciate you bringing this to our attention, Chelsea. We're sorry to hear about your customer service experience at our Huntsville location. Mind following up with us regarding this issue? Please use the provide link for additional assistance: www.wfm.com/help"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104270858089263821222", "name": "Stacey Besherse", "time": 1563638712836, "rating": 4.0, "text": "Great store.  Seems like prices on produce are getting more reasonable.  I don’t mind paying more to be able to trust in each item, but i have to have limits.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "109083281913456333650", "name": "Erik Moss", "time": 1566433546197, "rating": 2.0, "text": "My fiancee and I like to come and eat at the salad bar, it often has great healthy choices and we enjoy the options. However, after 6 pm the salad bar seems not to get refilled and I often end up showing up after work for dinner and leaving hungry...", "pics": null, "resp": {"time": 1566514460077, "text": "We're sorry you found an empty salad bar, Erik. Please contact us at wfm.com/help with any more details. We will be happy to look into this further!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "117125325622168905893", "name": "Aditya Gurushankar", "time": 1608861517342, "rating": 5.0, "text": "Nice place to shop", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102308150699218221675", "name": "Louiese Nelms", "time": 1607819240332, "rating": 3.0, "text": "Not helpful by staff. Clean store. Some customers not wearing masks.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "107611519782519868772", "name": "Carmen Williamson", "time": 1576986601249, "rating": 5.0, "text": "The this market, great healthy choices to choose from especially if you're trying to eat healthier, supplements etc. Great staff, very helpful abd kind.", "pics": null, "resp": {"time": 1577023806330, "text": "Thanks for the nice review, Carmen!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "107610415724086616569", "name": "Hawk Knight", "time": 1556969307149, "rating": 4.0, "text": "Always like visiting one of these markets wherever I travel. Good selection of harder to find items not in your local supermarket.\nStaff was very helpful each time I was there.\nPrices are a little higher than your local market so expect it with the quality you get. I do not mind spending a little more on fruits and veggies that actually have flavor instead of picked green shelf rippened products.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104314265451329038579", "name": "J Olíval", "time": 1574786854443, "rating": 5.0, "text": "This place was my lifeline while I was visiting from California 💗 very clean, very good selection, people working there were always very friendly", "pics": null, "resp": {"time": 1574870394356, "text": "That's music to our ears, Jay.  Thanks for the nice review!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102408727324991359517", "name": "Walker Dodson", "time": 1546713933704, "rating": 4.0, "text": "I love shopping here. They have so many gluten free options for my wife. So much easier to shop here for someone with a Gluten intolerance.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "105943486870820089722", "name": "Elizabeth Canty", "time": 1579617234181, "rating": 2.0, "text": "Struggling to understand what has happened with this WFM in the past two years, understaffing? The Amazon purchase?\nIntended to be a good option for plant-based Huntsville-ians, I can rarely complete my shopping trip for fresh produce without also going to Publix (i.e. yesterday there were no salad kits, no Sweet Potatoes, no basil, and the broccoli I purchased was already soft and spongy). There is only ever a few registers open - only TWO yesterday during the after work rush. We have completely given up on the hot bar as well - I can't remember the last time it appeared freshly stocked or hot, unless you want meat dishes - they are clearly catering to a specific demographic....", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113957194466983156106", "name": "Gabrielle Beverly", "time": 1587934862907, "rating": 5.0, "text": "I like the store layout, doesn’t feel crowded. Employees are friendly and helpful", "pics": null, "resp": {"time": 1588105061702, "text": "Thank you for the review, Gabrielle! We hope to see you again soon!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "117725132546619252477", "name": "Anita McCormick", "time": 1500402152169, "rating": 4.0, "text": "Good place to meet friends for lunch and do a little food shopping.\nMy only wish is...different chairs. Unless you're 12 yrs old or really small you have to sit forward or be smushed.\nThat being said so happy to now have a Whole Food.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM_GLGW4ACIHo5P7nymLA_fF7HZHq-ICwhj4QEU=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "118199057316351550657", "name": "dawn corsaw", "time": 1579906922761, "rating": 5.0, "text": "Could stay in here for hours looking at their neat stuff!", "pics": null, "resp": {"time": 1579897705036, "text": "Thanks for being an awesome customer, Dawn!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "112799600117127608132", "name": "Cindy Martin", "time": 1591556045641, "rating": 5.0, "text": "Great shopping experience! 👍", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "101862514464277879764", "name": "Shanita Mccullough", "time": 1571670255800, "rating": 5.0, "text": "I used the Amazon locked hub inside but the store was clean great atmosphere and very convenient when your on the go to pick up Amazon gifts.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102335306391812425867", "name": "Diane C", "time": 1603150697612, "rating": 5.0, "text": "Absolutely the BEST pizza around!!!", "pics": null, "resp": {"time": 1603150905907, "text": "We're glad you enjoy our pizza! We hope to welcome you back again soon."}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "103023726882824147165", "name": "Lee Madkin", "time": 1595388654133, "rating": 5.0, "text": "Good food. Healthy food.", "pics": null, "resp": {"time": 1595420369473, "text": "We're happy that you're happy, Lee!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102034064721673538269", "name": "Kait O", "time": 1580333905728, "rating": 4.0, "text": "Awesome store just so dang pricey", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "107240396747363140414", "name": "Nyla McCoy", "time": 1576932611375, "rating": 4.0, "text": "Great selection of fresh food at reasonable prices. Staple items are pricier than competition.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "110875815909364695473", "name": "Andrea Crowder", "time": 1532268581112, "rating": 4.0, "text": "I am really glad we have a Whole Foods here now. I don't shop for everything here. Some items can be found at other grocery stores and are overpriced here. The bakery is an amazing highlight. I have had some great cakes and other treats here. The environment is nice and I enjoy visiting.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "116541853821553500886", "name": "Allison Hammond", "time": 1563501493016, "rating": 5.0, "text": "Revising my review for the Huntsville location regarding communication. Someone got in touch with us soon after and we were able to resolve the issue. Great job from management!!", "pics": null, "resp": {"time": 1562866573057, "text": "Thank you for bringing this to our attention, Allison. We take all complaints and feedback seriously, so we would like to look further into this matter. Can you please contact us at www.wfm.com/help explaining any additional details and your contact information? Please also refer to this review in the email message, thanks."}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "101713650574333834195", "name": "Tracey Woolridge", "time": 1532877620330, "rating": 2.0, "text": "One bad apple can spoil everything. I have been been there a few weeks ago and the woman who rang up my items was distant and cold.\n\nShe was holding a conversation with the customer behind me she didn't put my items in a bag, and she couldn't look at me to hand me the receipt.  She just dangled it on the side making me reach for the receipt.\n\nThis isn't the first time I was looked down on in this store  I've smiled and said hello to one worker they just walked by rolled their eyes.  And another worker was telling me I couldn't pay for my items with my watch. I work with mobility for a living.\n\nNow I have had some good experiences there. People have smiled and greeted me. I would even say the people at the bakery are wonderful. I would just suggest the people who are the face of Whole Foods work a little on the attitude.", "pics": null, "resp": {"time": 1533052923450, "text": "Thank you for reaching out, Tracy. We expect our team members to be courteous and respectful to each and every customer and we apologize that was not your experience. Do you mind sending a follow-up email to customer.questions@wholefoods.com with this information? One of our team members will be in touch. Thank you."}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "110957321166363319393", "name": "DanaTrains", "time": 1453240272247, "rating": 5.0, "text": "Be aware: the pinpoint doesn't point to the correct location on the map. There are so many different products that I can't find anywhere else here. This store allows me to cook and eat a very clean and healthy diet. You still have to understand that just because it's sold in Whole Foods doesn't mean it's healthy. I also don't really like their selection of produce. I think Fresh Market and Publix have the best produce selections. If they don't have something you need, ask and they can probably order it for you.\n\nThe best part about this store is the food bar. They have hot food as well as a salad bar. All the ingredients are listed which allows me to stay away from things I should not eat. More than that, everything tastes good! It's $8.99/pound so you have to be careful about how much you load onto your plate. But, if you don't eat it all you can get a lid and take it home.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113597590106440353590", "name": "Martin Pollard", "time": 1598043109843, "rating": 5.0, "text": "It was a nice place and friendly", "pics": null, "resp": {"time": 1598043702196, "text": "We're happy to hear you had a pleasant shopping experience with us, Martin. Thanks for coming in!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "106479586194536857966", "name": "Alex McCool", "time": 1568057723677, "rating": 4.0, "text": "Prices can be steep, but they have a good variety of vegetarian substitutes, lots of hard to find fruits and veggies, a large bakery, good wine and beer selection, and short checkout lines.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "100366859534296775957", "name": "Amber J", "time": 1539312102763, "rating": 4.0, "text": "I wish whole foods offered more real organic/clean/non-gmo food options than it does, but this store location is great. I love the setup and the bath and body area! The staff is always friendly, and checkout is quick.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "111229298087177395417", "name": "Leah Camp", "time": 1549824766123, "rating": 5.0, "text": "Wide variety of organic and specialty foods. This location is newer, many options I haven't seen in other locations. Well organized, clean, and if you have difficulty finding an item, many employees are willing to help.", "pics": null, "resp": {"time": 1550773277747, "text": "We appreciate the positive review, Leah! We hope to see you shopping with us again very soon!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "116053293035413383678", "name": "John Fishman", "time": 1568083657620, "rating": 4.0, "text": "Not as good as when it first opened. Quality of food and esp breads has dumbed down to Huntsville Market. Every other Whole Foods I've ever been to us better.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "103001122791188175756", "name": "Dennis C. Sibit", "time": 1597470417008, "rating": 5.0, "text": "Never crowded great staff", "pics": null, "resp": {"time": 1597493753354, "text": "Thanks for the review, Dennis!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102824341714616567754", "name": "Paula Sirten", "time": 1571160462038, "rating": 5.0, "text": "Always great! Try the granola bar that they have up front at the registers!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "107136803441067849956", "name": "Chatsworth1979", "time": 1515637944666, "rating": 4.0, "text": "Great hot food bar, though not as good lately.  Wide selection of everything in the store.  Bulk grains and spices. Amazon Locker at this location!! Electric Vehicle charging station available too.  Fresh produce, some locally sourced.  Nice vibe here.", "pics": null, "resp": {"time": 1515689517928, "text": "Thanks for the great review!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "115562867785006912563", "name": "13k_lxies", "time": 1612146233361, "rating": 3.0, "text": "It's got food", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "109499585163194577971", "name": "Jon Sullivan", "time": 1612067635509, "rating": 3.0, "text": "Ok", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113388399959467870879", "name": "Kari Engle", "time": 1608315007209, "rating": 5.0, "text": "Love the wide variety of food.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "103609128347712926993", "name": "Robert Weaver", "time": 1567199891826, "rating": 3.0, "text": "Not for everyday shopping for regular people. Probably more for millenials. Lots of organic and whole grain foods.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "117578544000889120823", "name": "Georgia Grochowalski", "time": 1519218466260, "rating": 5.0, "text": "Very clean and organized.Staff was very helpful, friendly  educated on products and easy to find.  Prices are high but worth it for the verity of products and the service you receive.. I recommend to all my friends especially vegetarians and those on special diets.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "100666898941571576284", "name": "Patrick Fitzgerald", "time": 1508249657630, "rating": 5.0, "text": "I usually go here for quality meats, fruits and vegetables. They have dry aged ribeyes, which are absolutely fantastic. The chicken is amazing as well. The fruit and vegetables are the best in town. It's a bit more expensive but definitely worth the little extra. There's a big difference in texture and taste and I'd rather have quality over quantity any day of the week.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104245531968752705992", "name": "Daniel Shrider", "time": 1502394618956, "rating": 4.0, "text": "Whole Foods is a fantastic place to grab lunch,  especially if you're dieting. I gave them only 4 stars because I'm not so enthusiastic about buying groceries. Their prices are quite reasonable for lunch, but not so much for groceries.  However, there are very important items at Whole Foods that are very very hard to find elsewhere.  So my advise is to do most of your grocery shopping elsewhere, and go to Whole Foods for lunch,  supper, and those hard to find items that you need.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113902334258862546673", "name": "Rebecca Butz", "time": 1452129842718, "rating": 5.0, "text": "Fresh and in-season produce. Everything in a store for which I could ask:  cheese department, bakery, pizza restaurant, bar, coffee shop, growler-fill-up, sandwich shop, quick/fresh sushi, fresh meat and seafood departments, fresh buffet, local goods, trustworthy brands, boutique, and really great customer service. I love how the employees always seem to be sporting their most unique and individual styles too - very inspiring to see a company that allows/supports individuality in the work place.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "100186578377139399636", "name": "Arnell Austin", "time": 1601233750735, "rating": 5.0, "text": "We love this store", "pics": null, "resp": {"time": 1601233956443, "text": "Thanks for the love, Arnell!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104546925073007262724", "name": "chantal freeman", "time": 1569166206028, "rating": 1.0, "text": "Shop here all the time but lately its a mess. The fly situation at the buffet section is really bad and this is a constant problem. Used to get my dinner from the buffet but stopped doing that. This past week was going to get some cookies but inside the case where the cookies are kept saw small type of bugs crawling around and this is inside the case. That was it for me.", "pics": null, "resp": {"time": 1569248622076, "text": "We appreciate you bringing this to our attention, Chantal. We're sorry to hear about your experience with the prepared foods at our Huntsville location. Mind following up with us regarding this issue? Please use the provided link for further assistance: www.wfm.com/help"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113098471219868979646", "name": "Tonya Johnson (Sunshine)", "time": 1503593139063, "rating": 5.0, "text": "I love this place plenty of fresh meat and vegetables and fruits. The area with the hot and cold bars as well as the Bakery and Deli are pretty awesome.  The staff is very friendly, helpful, and will ensure you are able to find what you are looking for.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "118057316442565844488", "name": "Chelsea Parsons", "time": 1495475176449, "rating": 5.0, "text": "Nice selection. Love love love their fresh meat selection and prices especially when you catch a sale in that department. My husband and I love the discount cheese scrap basket. It's a nice way to try new cheeses without wasting cheese or money.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "114594160829638441590", "name": "larry jones", "time": 1594851797266, "rating": 5.0, "text": "Little on the expensive side, but but enjoy the food bars and pizza.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "108213787592251118727", "name": "M. A. (Martha Ashton)", "time": 1512066635887, "rating": 4.0, "text": "Nice store, good food, and nice employees, but I can't afford to shop there. On the plus side it's the only place in Madison County that I've found Dutch processed cocoa. Two of the five times I've visited, I've gotten to the register and had to put all of my items back. Pricing is very misleading: $$ per \"portion\" of fish (sold in packs of 4) & $$ per \"ounce\" for a prepackaged bath bomb? I don't understand, just put a direct price on the package so the consumer knows what it will be when they get to the register; I understand this is corporate policy. And I agree with others about sale prices, I've been overcharged before but customer service refunded the difference.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "101344881216069485902", "name": "David Mullins", "time": 1533318727524, "rating": 4.0, "text": "Great experience BUT EXTREMELY OVER-PRICED. they have some unique items BUT I WILL NOT RETURN. As I have heard said, name should be WHOLE PAYCHECK.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "118344936542863785724", "name": "Dadul Maharaj", "time": 1490310521824, "rating": 4.0, "text": "Thanks for the wide variety of vegan options. Keep in mind there are so many things that can be made vegan which even non vegans will love which targets a higher customer volume which creates bigger profits. Example; bakery products, nobody will refuse a cake, cookie or pastry that is missing eggs and dairy. \" does this cookie have eggs?\" Says no non vegan ever.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "103352267172707152175", "name": "Kimberly Kennedy", "time": 1558725082640, "rating": 5.0, "text": "Love this store. Check out the salad and hot bar while here.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "115513286349053579315", "name": "Nicholas Pate", "time": 1501636526817, "rating": 5.0, "text": "The extraordinarily wide beer selection was what we noticed first. Then the electric vehicle charger, making this the most convenient place for us to shop. Over time we found the produce is consistently extraordinary, and then noticed the bulk food bins... for the strategic and sometimes casual shopper/charger/feeling-like-a-pizza-and-pint-er, there's really a lot to like about Whole Foods.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "115590253572384971512", "name": "kim rosario", "time": 1549632263283, "rating": 5.0, "text": "Always find the organic food I need. For example Swiss chard. I can't find it anywhere else but here. Clean store and friendly staff", "pics": null, "resp": {"time": 1549759008535, "text": "Thanks for the positive review, Kim! We're glad you enjoyed your visit. We hope to see you soon!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "112225217964558046485", "name": "Chazz M", "time": 1508864210436, "rating": 4.0, "text": "Lots of fruit and vegetables, those looked great. Saw lots of options for snacks as well as individual and family meals. We went with an eye for easy things to serve for large groups and struggled to find anything ready to go. Lots of options for making things from scratch! But, this is not the best place to go for just picking up something already prepped for a large group.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "100288714132925714508", "name": "Ava Hines", "time": 1500502444844, "rating": 5.0, "text": "You need a pocket full of money if your going to buy a buggy full of groceries! Prettiest beef I've ever seen! Great looking seafood! Top notch products! Very friendly people ! Great experience over all but as I've said they are pretty expensive!!!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "105434186631533053297", "name": "Keri S", "time": 1493159488422, "rating": 5.0, "text": "My first trip here made it seem like I'd never been in a store before. It was full of all these things we don't have in this tiny city's Walmart and stocked full with these super healthy and high-quality looking items along with a nice looking place to eat inside.\n\nI've been many times since and Whole Foods always has what I can't find in other health food stores. They're always super friendly and helpful. The prices aren't as bad as I was expecting even though some things do cost more to be healthier. Everything I've gotten here has been of great quality and delicious.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102824341714616567754", "name": "Paula Sirten", "time": 1571160462038, "rating": 5.0, "text": "Always great! Try the granola bar that they have up front at the registers!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "112225217964558046485", "name": "Chazz M", "time": 1508864210436, "rating": 4.0, "text": "Lots of fruit and vegetables, those looked great. Saw lots of options for snacks as well as individual and family meals. We went with an eye for easy things to serve for large groups and struggled to find anything ready to go. Lots of options for making things from scratch! But, this is not the best place to go for just picking up something already prepped for a large group.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "114594160829638441590", "name": "larry jones", "time": 1594851797266, "rating": 5.0, "text": "Little on the expensive side, but but enjoy the food bars and pizza.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "106404245765484799071", "name": "Andrew Fandre", "time": 1476466630114, "rating": 4.0, "text": "10/13/2016 Whole Foods had a local beer tasting. All 9 Madison County breweries represented. Whole Foods community involvement makes me love their company. I also had a pizza I've never had before, a pulled pork bbk, roasted veggie pizza, drizzled with a spicy sauce. Very fun and delicious.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113119538330503986132", "name": "Preston Nance", "time": 1558995763350, "rating": 5.0, "text": "On my visit, the customer service was outstanding, Shari Taylor, jalen made my grandsons day a smile as big as the Sun, we were looking for a very specific item and they went over and beyond,.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "103352267172707152175", "name": "Kimberly Kennedy", "time": 1558725082640, "rating": 5.0, "text": "Love this store. Check out the salad and hot bar while here.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "114610798663657237046", "name": "Dave In Alabama", "time": 1568461140026, "rating": 5.0, "text": "Always a good deal for lunch prices and has good fresh food", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "108033662519355635205", "name": "Robin Hollander", "time": 1500599762928, "rating": 5.0, "text": "This market had wonderful whole fresh foods. A huge organic section,  delectable bakery delights.  A four steam table buffet with meats and vegetables. Definitely worth a visit", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "111996529520748426939", "name": "Michael Kulpa", "time": 1570583249083, "rating": 4.0, "text": "Nice and clean, great fruit selection. Nothing new with prices a little higher than most.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "110787956368260914523", "name": "Lori Bray", "time": 1499375493382, "rating": 5.0, "text": "My son-in-law is the Manager and he does a great job.  The store is clean, the staff is very friendly, and the cheese guy is awesome.  He knows what cheeses go together and how to serve the.  Great store!!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "100608748182797606157", "name": "Bruce Mitchell", "time": 1500462172556, "rating": 5.0, "text": "Great variety of food options. Super friendly staff great lunch and quick dinner spot. Pizza, sushi, deli hot and cold food barS. Great tasting and healthy options.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "110665944671726892625", "name": "Russ Howison", "time": 1515856549473, "rating": 5.0, "text": "Beautiful location, fantastic food selection, and a fun place to visit even if you're not shopping. They also have a coffee shop, hot food bar and gourmet pizza oven with craft beers on tap.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "114434033058270285358", "name": "Tia Wheeler", "time": 1538529190057, "rating": 5.0, "text": "Really good hot and cold food bar, along with a pizza place. And the eating areas are really nice.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102397603538640878175", "name": "B Mckel", "time": 1608257869976, "rating": 5.0, "text": "Yummm", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "111996529520748426939", "name": "Michael Kulpa", "time": 1570583249083, "rating": 4.0, "text": "Nice and clean, great fruit selection. Nothing new with prices a little higher than most.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "110787956368260914523", "name": "Lori Bray", "time": 1499375493382, "rating": 5.0, "text": "My son-in-law is the Manager and he does a great job.  The store is clean, the staff is very friendly, and the cheese guy is awesome.  He knows what cheeses go together and how to serve the.  Great store!!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "105935841689066612830", "name": "Kenneth Wrye", "time": 1622840258700, "rating": 5.0, "text": "Like shopping at Whole Foods", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "110878176388234861546", "name": "Perfectly Studios", "time": 1605827229662, "rating": 3.0, "text": "Nice place", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "112381759768328769363", "name": "Daryl Bauer", "time": 1574248524585, "rating": 1.0, "text": "Couldn't stand the store more than 5 minutes horrible horrible smell!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "108679212906558368647", "name": "C Baker", "time": 1551630299854, "rating": 1.0, "text": "My husband and I are from out of town and not sure if we just don't look like we have a lot of money or what, but I cannot have dairy due to health reasons and this establishment offers many vegan options. This was our first time at this store and while browsing, i noticed a worker followed us everywhere we went, even as we exited the store. It made me feel so uncomfortable that I put my basket down along with the contents and we left. You should not make customers feel like criminals just because they don't fit the criteria of your normal customers.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102332779897688220752", "name": "Gary Saunders", "time": 1537079892884, "rating": 5.0, "text": "Love this Whole Foods. Staff are always friendly and helpful. We go to get the Beyond Meat Burgers!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "101487126032010648956", "name": "C Brown", "time": 1565668837162, "rating": 3.0, "text": "The two young ladies that helped me were very helpful. Small section of product is the reason for my score more than anything.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104280488484244957682", "name": "Eduardo Saldana", "time": 1482077751592, "rating": 5.0, "text": "Love this place, staff is very helpful and polite. The deli has delicious and food! Also best variety of beer. Come here atleast once per week, should come more often. Keep an eye out for their specials.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "108411640472289600309", "name": "Renee Holder", "time": 1530314557298, "rating": 5.0, "text": "Not surprising considering the quality. Their selection is outstanding. Their customer service is better than most.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "117047264912561522055", "name": "Sonji Rainney", "time": 1472909307198, "rating": 1.0, "text": "While visiting from Nashville Tennessee, I was very much looking forward to enjoying a great meal. But was disappointed to discover this location doesn't  carry the \"vegan mock chicken\" for purchase or in the wrap, which I'm accustom to back Nashville Tennessee.  Whole Foods needs to be consistent with Vegan products at all locations.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113977434880537890269", "name": "Todd Henrichs", "time": 1499485618700, "rating": 5.0, "text": "Best fancy groceries in town. Good buffet for all 3 meals. Pizza place is solid too. The occasional beer dinners are a great value!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102645106081453551885", "name": "Nicky Beale", "time": 1574652611432, "rating": 4.0, "text": "Like all the supplements but need to get rid of the plastic at the hot food bar, be the example Whole Foods!!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "111940247820980109128", "name": "Charlotte M. Ellett (Charlaxy)", "time": 1486356236366, "rating": 4.0, "text": "Great people! I love their specials. Their roast chicken is great. The best place for grass fed milk in the area.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "115621451361233952450", "name": "Helga Weber-sledge", "time": 1597874752752, "rating": 5.0, "text": "ALL IN ORDER ! FRIENDLY EMPLOYEES", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113658556850348843044", "name": "Chandler Reynolds", "time": 1497451539983, "rating": 5.0, "text": "If you've been to Whole Foods before, then you know what to expect. If not, you will find lots of organic goods with price tags higher than their non-organic rivals at other stores.\n\nGrowler refills are cheap and they usually have a good selection of local beers to choose from!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "115204914077805968456", "name": "Justin Malone", "time": 1489876933806, "rating": 5.0, "text": "Their food bar is nothing short of amazing!  Exceptional quality and quite a variety.  Overall a wonderful grocery store with quality and fresh products.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "116139994248147883492", "name": "Greg Mattson", "time": 1517344559782, "rating": 5.0, "text": "Service was excellent. The staff went ahead of their way to get what I needed. Will definitely go back and Shop there again.", "pics": null, "resp": {"time": 1517437711143, "text": "Thanks for the great review, Greg! We hope to see you again soon!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "108855082224055871416", "name": "Contessa Hudson", "time": 1598367456603, "rating": 5.0, "text": "Large variety of vegan products.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113697074690320694233", "name": "Dave K", "time": 1511359891690, "rating": 4.0, "text": "Very nice, modern store; I feel like I am on the west coast when there. Lots of selection and lots of items one simply cannot get anywhere else in town. The prices are a bit lower now that Amazon owns the chain though still higher than anywhere not called \"Publix\"", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "118105324242668957906", "name": "GOLDBULLIONTREASURES", "time": 1540935894744, "rating": 5.0, "text": "I love to get herbal tea mixtures here and then make my own blend.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "106962238481467677802", "name": "Hightide89", "time": 1548442720940, "rating": 3.0, "text": "Clean big store. Lots to choose for lunch. The organic foods market makes me think the country is a bunch of pansies and we are doomed.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "116629090240547161421", "name": "Lisa Potter", "time": 1547529007638, "rating": 3.0, "text": "I really only come to WF for the grassfed beef and while I love that, I do not like your employees. They always act like you are bothering them and I can never understand why sometimes I go in and my phone number works and other times I’m told it doesn’t for the extra 10% off deal. I had an employee that was so hateful tell me it wasn’t going to take my number so I said forget it. Another time this girl packed ALL of my groceries in one bag and told me I better hold my hand under it so it doesn’t bust. It’s always something like that every time I go in. Also, you charge $6.99 for organic strawberries when I can get them at Publix organic for $3.99. That’s ridiculous and why I don’t come out with other items. Very overpriced.", "pics": null, "resp": {"time": 1547770523300, "text": "Hi Lisa, thank you for bringing this to our attention. We're sorry to hear about your experience and would like to look into this. Would you mind sending us an email at www.wfm.com/help?"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "109283663979970177190", "name": "Kreigan Hopkins (Antherian)", "time": 1551469476554, "rating": 5.0, "text": "Tea selection is nice, we also like the get sushi from here occasionally.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "114212607119342508664", "name": "Gregg Wright", "time": 1585611851121, "rating": 1.0, "text": "Very short and dismissive. Really? At those prices I'll order online. Sorry for asking a question..?", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "112241734023598317331", "name": "Susan Short", "time": 1574255491962, "rating": 5.0, "text": "Awesome products and awesome people!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "100821288659076872001", "name": "Mark Faine", "time": 1473981422134, "rating": 4.0, "text": "This is probably the only place in town where I can get a great vegan pizza.  They don't skimp on ingredients, they are willing to remake a pizza if it's not up to your standards, and every ingredient is the highest quality, no cheap ingredients at all. The whole wheat pizza crust is so good as to be almost as good as the white, it's a hardly noticeable difference for most pizzas.  I'm only holding back one star since I would like to see a few more options for vegans (vegan protein options for toppings, calzones, pan pizza, etc.)", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "114357510711048596386", "name": "Jeremy Concepcion", "time": 1542783545090, "rating": 5.0, "text": "Their buffet is one of the only consistent places in Huntsville to get healthy, organic food that rotates frequently and doesnt break the bank. Plus you can drink beer whilst shopping.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102209287951509006087", "name": "Mitze Dunn", "time": 1505506821704, "rating": 5.0, "text": "The store looked clean and smelled nice. I liked the way it was organized. The store associates were great.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104236893886327227397", "name": "Ashley K Oak", "time": 1570398532694, "rating": 1.0, "text": "Don’t come here for smoothies, they apparently don’t make them even though their website has a full menu", "pics": null, "resp": {"time": 1570455219218, "text": "We appreciate you bringing this to our attention, Ashley. We're sorry to hear about your experience at our Huntsville location. Mind following up with us regarding this issue? Please use the provided link for further assistance: www.wfm.com/help"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "101368384649801803885", "name": "Mitzi Farley", "time": 1571323314432, "rating": 5.0, "text": "Lunch there from salad bar was great!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104715292377122664334", "name": "Curtis Clemons", "time": 1608679950992, "rating": 5.0, "text": "Grape variety of food", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "111284369930824114459", "name": "Dorothy Peters", "time": 1486563060651, "rating": 5.0, "text": "Great Whole Foods!  They have a very large selection of basically everything you could need.  Also LOVE that they have an electric car charging station :)", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "105469942930670408104", "name": "Mr. Rock N' Roll", "time": 1542646475354, "rating": 4.0, "text": "Only went to try the pizza place in the store it was amazing and there are some beautiful woman that shop there too!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "108863588282576503244", "name": "vidalia jewel", "time": 1554249851071, "rating": 4.0, "text": "Nice store. Great bakery and coffee bar", "pics": null, "resp": {"time": 1554301755519, "text": "We're happy to hear that you enjoy our bakery and coffee bar! We hope to see you soon."}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "101043403109556930129", "name": "Teresa Fowler", "time": 1451662086755, "rating": 5.0, "text": "I love the selection of meats, to include lamb and buffalo, they have in store; they even dry-age beef on-site.  The bone-in grass-fed ribeye steaks I got there were absolutely delicious! They also have a beautiful selection of fruits and vegetables, some not found anywhere else in Huntsville.  I will definitely keep shopping there.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "101612647892365738294", "name": "Steph M", "time": 1486930655346, "rating": 4.0, "text": "The vegan options at the hot bar were so sad. It was sweet potatoes and an Indian dish. The menu seems to regional because there was a lot of meat. When I stay I the huntsville area I'll have to make sure to get a hotel room with a kitchen because of this.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "110427861020766618755", "name": "Tom Thompson", "time": 1558445182257, "rating": 5.0, "text": "Great place to get your vitamins and health products", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "103580337117083393039", "name": "J B", "time": 1542082490825, "rating": 1.0, "text": "This review is for Whole Foods at north parkway.\nHello everyone, today me and my wife went there to get some food and let me tell you the food is 100% tasteless. There is literally NOT ONE DROP OF FLAVOR...NOT ONE. we got ourselves a couple of food plates from the bar, I was hungry believe I pack the plate but I wished I had taste the food. I got myself a plate of beef brisket and lots of rice, it was so tasteless that I just threw it away in the second bite.  Whoever cooks back there need some cooking lessons BADLY....BADLY, SALT, PEPPER,.......WHAT'S HAPPENING PEOPLE??? cook with love or please go home. TERRIBLE EXPERIENCE.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "100447025835298915325", "name": "Thelonious Jazzman", "time": 1506221191062, "rating": 5.0, "text": "Vegan pizza is outstanding. Anna made our pizza. Brittany was our waitress. Both were EXCELLENT! I took a picture of Brittany and think that I posted it. (Google Maps platform odds not the easiest to figure out.] Both young ladies were the BEST! Brittany was attentive without being obnoxious. Thidenticalanks for a great casual dining experience! Craft beers were excellent. Try before you buy. I had Lawyers, Guns and Money. Just right. Not too bitter. And Molotov Cocktail. Almost identical\nBoth had great full-bodied taste. L,G and M was darker not not too heavy. Both lightly sweet. Excellent food, excellent beer, excellent service. FIVE STARS!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "105645471416941691420", "name": "John Warinner", "time": 1584400794027, "rating": 5.0, "text": "Great Store, good customer service", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "101660036953579139941", "name": "Jesika Bellefonte", "time": 1495695871234, "rating": 5.0, "text": "Sad to say I'll be leaving soon. This place has delicious foods and very helpful employees. Its been a long 1yr and 7months that I've worked here and i will sure miss my coworkers.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102175749557798318423", "name": "Mark Mohon", "time": 1507813779014, "rating": 4.0, "text": "A medium sized Whole Foods. Not as much choice in hot foods on the bar as some, but foes have a pizza restaurant with craft beers and a small Japanese vendor. Great quality of vegetables, fruits, and meats in grocery.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "106751652453377527951", "name": "Melissa Summers", "time": 1521159235930, "rating": 5.0, "text": "I am so so pleased. I wanted something healthy and the Food Preparer was beyond helpful. He recommended a \"bowl\" that was delicious. He accommodated all of my special requests of quinoa, daiya cheese and avocado. The bowl consisted of pinto beans, quinoa, jackfruit 'barbeque', avocado which he so kindly mashed up at my request, romaine lettuce and pumpkin seeds. DELICIOUS. Remarkable service.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM6SRsEbfKvc499Kd9ghXK38HQzjT5QHJ9AW7P4=w150-h150-k-no-p"]}], "resp": {"time": 1521328759667, "text": "We are glad to hear about your great experience! Thank you for the nice review, Melissa! 💚💚💚"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "117388296704250600129", "name": "Vishnu Kommineni", "time": 1513543302699, "rating": 4.0, "text": "Really friendly staff. Prices seem reasonable for the quality product. Spazio pizza is really good.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "105591468620441885744", "name": "Ashley Clem", "time": 1518996534727, "rating": 4.0, "text": "Loved the food bar but it's pretty pricey no matter what you get. Otherwise, the selection is fantastic.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "114173091820255295647", "name": "OLKIE", "time": 1511932051905, "rating": 3.0, "text": "It's whole foods. The facility is clean and the staff is friendly. However, whole foods is also know as whole check. They have lots of organic and healthy options but be ready to Shell out some serious dough for gluten free dough.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113392307809475521303", "name": "Adam Thomas", "time": 1536532847079, "rating": 5.0, "text": "Excellent food bar. I've only been for breakfast, but it was good for a quick run in option", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "114784026920081716856", "name": "Bill Thygerson", "time": 1499801531607, "rating": 4.0, "text": "Love the store, fantastic food, by-the-pound buffet, and usually great service. Today though, the sandwich line was glacial, due at least in part to a very uninspired--disinterested, even--sandwich maker. In addition, the pizza line was out of pepperoni and plain cheese pizzas.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "110052833950390852187", "name": "Robin Fussell", "time": 1558214109029, "rating": 5.0, "text": "High prices good foodstuffs.  Worth it.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104313119636942683008", "name": "Kim C", "time": 1499987995016, "rating": 4.0, "text": "Great selection of quality good items. On the pricey side, but worth it if you need something special or if healthy sustainable options are important to you.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113744111962457158147", "name": "David Estacio", "time": 1539727274797, "rating": 5.0, "text": "Great customer service, good selection and great lunch/dinner salad and hotbar.", "pics": null, "resp": {"time": 1539924714083, "text": "Thank you for the awesome review, David!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "115784499374812655473", "name": "Rick Goodwood", "time": 1551967986099, "rating": 4.0, "text": "A bit expensive and full of snobs, but they carry items not found anywhere else around this area. The staff is always courteous and helpful.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "106476636084088112799", "name": "Brent Cupp", "time": 1503679570577, "rating": 5.0, "text": "Best place to get lunch. Great atmosphere and really good food. Wish there was a whole foods in Cullman Al.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "103282598827344575069", "name": "Pixie Lent", "time": 1531249690152, "rating": 4.0, "text": "I Love the huge selection of groceries. Just wish it weren't so expensive.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102554203415586726277", "name": "Tanya Maples", "time": 1504504153067, "rating": 5.0, "text": "This place is amazing. They have the best FRESH food and healthy options if you are grocery shopping.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "109009457284641105160", "name": "Loves to Travel", "time": 1469412707352, "rating": 5.0, "text": "Love going here.  This is not a discount store, don't go looking for a bargain.  I enjoy all of the unique choices.  Prepared food area has lots of options.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "103282598827344575069", "name": "Pixie Lent", "time": 1531249690152, "rating": 4.0, "text": "I Love the huge selection of groceries. Just wish it weren't so expensive.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "116371475737741208232", "name": "Jordan Dilworth", "time": 1498529756941, "rating": 5.0, "text": "Excellent place to shop! A little high on regular groceries but there is a great selection of craft beer.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "109043429315410908253", "name": "Justin Cole", "time": 1492319141449, "rating": 5.0, "text": "This place is a great alternative to regular grocery chains. You can find specialty foods here and it is always clean.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "101838547935521105238", "name": "Daryl Beaman", "time": 1498454214027, "rating": 4.0, "text": "Excellent selection of organic food. Even had beer on tap. The food buffet looked scrumptious, and the pizza there was fantastic... Only reason I didn't give 5 stars was the baby food selection was bad. My son has GERD and I was looking for foods without citric or ascorbic acid, i.e. preservatives, and there was nothing that didn't contain that, or lemon juice concentrate. Other than that, the store was awesome", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "114212607119342508664", "name": "Gregg Wright", "time": 1585611851121, "rating": 1.0, "text": "Very short and dismissive. Really? At those prices I'll order online. Sorry for asking a question..?", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "118019790438729242140", "name": "Michael King", "time": 1540384477080, "rating": 1.0, "text": "Wal-Mart wannabee store. If I could give whole foods a negative star I would do that. This place is such a disappointment because it looks so good and is located in a great spot and they have unique offerings but the management is aweful. Why is that? Just go in a few times a week for a month and watch the flies landing on the fresh baked goodies. It is like nobody that works there cares except the guy making the pizza. He is awesome.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "117541495542658574240", "name": "Chris Balsters", "time": 1536298466651, "rating": 3.0, "text": "Glad Huntsville has a Whole Foods. Get there early if you want the salad/hot bar. It gets picked over pretty fast with slow replenishment.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "100580400909043881077", "name": "Mary Graver", "time": 1452717601909, "rating": 5.0, "text": "We enjoyed celebrating our niece's birthday at the new Whole Foods store in Huntsville in December.  The PIZZA was great ... as were the fresh flowers that we gifted her.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104651669910888602555", "name": "Dominique Hudson", "time": 1555540705695, "rating": 5.0, "text": "i love whole foods, all the staff are so friendly and the store is so clean! I just wish the prices weren’t so high", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "109043429315410908253", "name": "Justin Cole", "time": 1492319141449, "rating": 5.0, "text": "This place is a great alternative to regular grocery chains. You can find specialty foods here and it is always clean.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "115534002393895043325", "name": "Tati Monű", "time": 1481955613394, "rating": 4.0, "text": "It's a very nice place I don't shop here but eat at the food bars whenever i can i just take my client on Mondays it's a organic eater sweetest dream I however love the sweet bar and the fact you fix your own food the grocery part i don't care too much for but the food bars are amazing", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "118019790438729242140", "name": "Michael King", "time": 1540384477080, "rating": 1.0, "text": "Wal-Mart wannabee store. If I could give whole foods a negative star I would do that. This place is such a disappointment because it looks so good and is located in a great spot and they have unique offerings but the management is aweful. Why is that? Just go in a few times a week for a month and watch the flies landing on the fresh baked goodies. It is like nobody that works there cares except the guy making the pizza. He is awesome.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "109009457284641105160", "name": "Loves to Travel", "time": 1469412707352, "rating": 5.0, "text": "Love going here.  This is not a discount store, don't go looking for a bargain.  I enjoy all of the unique choices.  Prepared food area has lots of options.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "101170574615593578217", "name": "Diana Johnson", "time": 1545069097130, "rating": 5.0, "text": "I love this store ! I feel healthy every time i stop in there!", "pics": null, "resp": {"time": 1545253599678, "text": "We appreciate the positive review, Diana! We hope to welcome you back again very soon!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102721513605411846462", "name": "Tina Powell", "time": 1501590384844, "rating": 5.0, "text": "Needed info on a vegan diet. I have an extremely picky child and Robert helped me find everything on her list. He informed me and answered questions...not only telling me but showing me where to find everything. Customer service at it's best.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102338012427756708699", "name": "Josh Roberts", "time": 1502043584557, "rating": 5.0, "text": "Always great produce, meats, breads and packaged items.  Helpful staff and quick checkouts.  In a chicken little shopping area.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "115825053182215079534", "name": "MCP", "time": 1550499639493, "rating": 4.0, "text": "Good store. Usually has what you need.", "pics": null, "resp": {"time": 1550596356061, "text": "Thank you for the positive review, Mel. We appreciate your feedback and hope to see you again soon."}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "109301151997868645673", "name": "Wanda Rudder", "time": 1504206904456, "rating": 3.0, "text": "Maybe it's just me, when I pay 27.00 for a salad and sushi I would expect the salad not to have BROWN lettuce.  That being said I really like the layout and some of the hard to find items.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "107714970469711701990", "name": "KV", "time": 1515625196880, "rating": 3.0, "text": "We shop at Whole Foods mostly for difficult to find items elsewhere.  This is a nice store, with many grocery choices.  There's also a deli, and a buffet.", "pics": null, "resp": {"time": 1515689537475, "text": "Thanks for the review Keli!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "109649202057988467101", "name": "Rick Willmarth", "time": 1509398168747, "rating": 5.0, "text": "The mock chicken salad and the vegan sushi are wonderful. I love this place.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "101707378241275544527", "name": "Robert Gibbs", "time": 1485813271720, "rating": 5.0, "text": "Great selection of meat and seafood. The butcher is always willing to get the cut just right.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113733976880421568797", "name": "Olivia Demko", "time": 1504660766262, "rating": 5.0, "text": "A slightly smaller store but still a great variety. Since the partnership with Amazon prices have definitely gone down!  Friendly staff!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "110078664158506194243", "name": "James Hamilton", "time": 1486709100043, "rating": 4.0, "text": "I like to get the freshly made pasta, and specialty sea salts here. Also a great place to get non GMO food items.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "109646113784033320833", "name": "Scott Seeley", "time": 1519869094697, "rating": 4.0, "text": "As Whole Foods go, this one is not as pretentious as other locations. Might be Huntsville's low tolerance for over priced high end brands. Those brands don't fare well in Huntsville with the abundance of DiY engineers.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "109415096527066151347", "name": "RMartin Choate", "time": 1611781831498, "rating": 5.0, "text": "Friendly\nClean", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "116371475737741208232", "name": "Jordan Dilworth", "time": 1498529756941, "rating": 5.0, "text": "Excellent place to shop! A little high on regular groceries but there is a great selection of craft beer.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "117693926873966579065", "name": "Wade DeAngelis", "time": 1550701699216, "rating": 5.0, "text": "I only wish this place had more space for more product. Even if they reallocated their stock it'd be cramped.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "116579248982607896603", "name": "armin ahmadi", "time": 1525071600486, "rating": 5.0, "text": "High Quality, but very expensive. you will love shopping here. there is Amazon locker here", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "106589694404334749114", "name": "Bradley Dean", "time": 1517670154508, "rating": 5.0, "text": "Love having this option in Huntsville. Wonderful selection of hard to find groceries.", "pics": null, "resp": {"time": 1517885155420, "text": "Thanks for the review, Bradley!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113633173617910694231", "name": "Silvana Jenkins", "time": 1499735199346, "rating": 5.0, "text": "Great place to buy locally grown food.  The best buffet, organic, Paleo,  sushi, pizza and local beer on tap, with great a atmosphere and some entertainment.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "110645017465747411193", "name": "Kim B.", "time": 1501404768838, "rating": 5.0, "text": "Great food ... Smaller store than the one in Mountain Brook, AL but brand new & nice!! PLUS  ... Spazio ~ a while radiant dedicated to whole foods pizzas!!!🖤🖤", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "101838547935521105238", "name": "Daryl Beaman", "time": 1498454214027, "rating": 4.0, "text": "Excellent selection of organic food. Even had beer on tap. The food buffet looked scrumptious, and the pizza there was fantastic... Only reason I didn't give 5 stars was the baby food selection was bad. My son has GERD and I was looking for foods without citric or ascorbic acid, i.e. preservatives, and there was nothing that didn't contain that, or lemon juice concentrate. Other than that, the store was awesome", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "115187252126224326625", "name": "Kiliaen Anderson", "time": 1514572240312, "rating": 5.0, "text": "The team is super helpful, they walk you directly to the product when you ask them for help finding something . Fantastic deals on the fresh seafood and grass fed beef.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "111685599096711453412", "name": "Philip Busk", "time": 1510967682547, "rating": 4.0, "text": "Are lunch. Good selection. Pizza was pretty good.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "115745774942892056135", "name": "John Bearden", "time": 1451730152575, "rating": 1.0, "text": "The store and food selections are great, however, Every Time we check out, we get over charged. And so far, THREE other friends that we took to that store also got over charged. EVERY time and not at the same register or by the same person. I am beginning to believe it is the Company Policy to over charge.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113873038142255167250", "name": "Chad Woodard", "time": 1481508118106, "rating": 4.0, "text": "Missing some of the selection you might see on the west coast. Especially alcohol. Overall very nice and new.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "103631185027253780891", "name": "Cary Long", "time": 1582026476490, "rating": 4.0, "text": "Quality, expensive...is there a requirement to be a hippie to work there?", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "106303465018461841475", "name": "A C", "time": 1514889595189, "rating": 5.0, "text": "High priced organic food.  Not much else to expect. The main value lies in the trendy restaurants and clothing outlets, and Google Fiber nearby.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "100464903793447255815", "name": "kim smith", "time": 1513940165763, "rating": 4.0, "text": "Good choices but be prepared to spend extra for the products they sell. Bakery is my favorite section in the store.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "117638682424879853748", "name": "PieFieri", "time": 1482975580374, "rating": 1.0, "text": "I waited at the sandwich line for a solid 10 minutes with no service. The guy behind the counter (a short, tan, short haired, man) saw me, said he'd be back to help me. He then came back and proceeded to help someone else who came up after I had already been waiting for a while. I continued waiting and he continued serving other customers. So I left. Won't be trying that again.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "101967758190014378085", "name": "Ryan R", "time": 1500953476433, "rating": 5.0, "text": "deli bar had some great barbecue pork that was cheaper than local BBQ restaurants.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "100886664024661856987", "name": "zach smithson", "time": 1489602074059, "rating": 5.0, "text": "I wish it had a better lunch area", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO6tkpFwfe6sy3xm13xUQAOAAoS3dw2b6-qFGEs=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMTB9jWo9xSBvbpBhOdG5QeXDwpmcqENy8my6d9=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "101334507080916304984", "name": "Keiton", "time": 1514623612174, "rating": 5.0, "text": "One of the only places in town tnat you can find fresh mussels, none of them were open prior to cooking...great mussels in stock when available, just call ahead before going to get them to make sure they have them and if they dont, they will order however many poundd you want. Great experience", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "100794921712369529346", "name": "98 Wade", "time": 1503008310095, "rating": 4.0, "text": "I go there for the buffet. Great place to get a quick, super healthy and convenient meal. Takeout or eat in.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "100536411253117557991", "name": "MV Freeman", "time": 1531538868299, "rating": 5.0, "text": "Love the variety of foods. If I can't find certain ingredients, I can find it here.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "105703089018646652880", "name": "Lady K", "time": 1517702190397, "rating": 5.0, "text": "Good selection. Pricey but quality and staff are wonderful!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "103598172981340428286", "name": "Kimberly D. Clark", "time": 1535426396706, "rating": 5.0, "text": "My favorite grocery store. Unique quality items.", "pics": null, "resp": {"time": 1535590025619, "text": "Thanks for the great review, Kimberly!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "112327826840648498567", "name": "Krystal Pezzulo", "time": 1532040574635, "rating": 5.0, "text": "I love the food selection and customer service here!", "pics": null, "resp": {"time": 1532187755335, "text": "Thanks for the kind feedback, Krystal!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "105847324804520415986", "name": "Eric Ibarra", "time": 1460472341688, "rating": 5.0, "text": "Really nice grocery store. They have lots of options and unique things to try that you won't find anywhere else.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113414369495510205178", "name": "Allison Jones", "time": 1473991698847, "rating": 5.0, "text": "I love being able to shop for so many non GMO products in one place. I find myself in Whole Foods sometimes 3 times a week lol. Feeding my son the best foods I can find is important to me.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "101117498024276680129", "name": "Cesaly Grey", "time": 1498874334599, "rating": 4.0, "text": "I can buy many things there that aren't available at most grocery stores and I  enjoy the vegan options in the hot foods section. (The grilled tofu they had tonight was delicious!)", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113169327681705095041", "name": "Michelle D. Stallworth", "time": 1505535899066, "rating": 5.0, "text": "The WH in Huntsville, AL has the most helpful staff I have meet.  I generally feel that most WH staff are helpful, but these ladies and gents were a step above!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "117878732408209427154", "name": "Monika Glennon", "time": 1504360212169, "rating": 5.0, "text": "Freshest food in town. Love the support for local farmers and small businesses.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104343199098139548013", "name": "Al Bundy", "time": 1498916146876, "rating": 5.0, "text": "I get alkaline water refilled here for a dollar a gallon and their bakery is the best.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113056549536836120757", "name": "Eric Vosahlik", "time": 1497237581541, "rating": 4.0, "text": "I like the convenience of dropping in grabbing some sushi and a good beer or wine for a dinner at home.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "109419370370934956319", "name": "submarmon Robinson", "time": 1530312869955, "rating": 4.0, "text": "Love it just need more freeze dried peaches", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "100815288648319979613", "name": "Lindsay Wheeler", "time": 1505169577025, "rating": 5.0, "text": "I love whole foods! The sushi is good, love the rotisserie chicken, and love the buffet :)", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "101826176136763975562", "name": "Blue3y3d Br3", "time": 1519432126104, "rating": 3.0, "text": "It is a great store, but they're always out of stock of multipule things.", "pics": null, "resp": {"time": 1519701636655, "text": "Thank you for reaching out. Please send any feedback to social.questions@wholefoods.com on how we can make our store better. We would love to hear from you."}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113325319983716862166", "name": "KellyMarie Conlon", "time": 1522698805485, "rating": 5.0, "text": "Very nice whole foods. Grab a drink while you shop?", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113473926746042093007", "name": "Ray Toth", "time": 1484081267712, "rating": 4.0, "text": "Nice location, friendly staff, great selection.  Definitely recommended for great meat products and fresh produce.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "103742242235771693404", "name": "David L", "time": 1504032931387, "rating": 5.0, "text": "Been several times, although pricey (duh).. The quality and freshness of the produce is insanely good  . I get ALL my green leaves and fruit from here, now.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "110802001551104133482", "name": "Michael Kelley", "time": 1512412076964, "rating": 4.0, "text": "Okay visit.  Only went to the delicatessen.  Food is edible.  Always pricey but to be expected at Whole Foods.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "114187484091418409371", "name": "Christina page", "time": 1496525548662, "rating": 5.0, "text": "Quality food. Thoughtful sourcing. Entertaining oddities.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "118130948649072607860", "name": "Nicole Dziubanek", "time": 1507658325586, "rating": 4.0, "text": "Since amazon bought whole foods we went for the cheaper prices. BUT if you are craving mochi or macaroons be prepared to pay... some things are priced competitively and some are over priced. We loved the tea section and easily spent 20 minutes looking at everything they offer! Worth the visit. Also very eco-friendly!! Closest thing to trader Joe's we have in HSV.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "105020135192148470222", "name": "Holly Hewitt", "time": 1489548584970, "rating": 4.0, "text": "Parking lot isn't great but the store is nice and the people are helpful", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102163009821387927891", "name": "Emily B", "time": 1456435440851, "rating": 5.0, "text": "I love all the options and the food tastes fantastic. I highly recommend checking out the coupons, app, and weekly specials to get the best value for your money.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "100124889754516451626", "name": "Chuck Park", "time": 1488489584688, "rating": 4.0, "text": "Great selection of foods. Trends toward organic.  Also is pricey", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "107212337553056573441", "name": "Brad McClellan", "time": 1483792892763, "rating": 5.0, "text": "Very well organized. Large selection. Helpful and friendly staff", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "117513803577710395952", "name": "Lee Couch", "time": 1496839417533, "rating": 4.0, "text": "Good selection on organic and locally grown produce.  Prices are reasonable.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "103047646260436266157", "name": "Stephanie Casto Clark", "time": 1502652031354, "rating": 3.0, "text": "Love the vibe and customer service, but many identical products are pricier than at other stores.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "118189503451656665258", "name": "Rebecca Sweet", "time": 1504716700661, "rating": 5.0, "text": "An employee asked if I was finding everything okay. When I asked where the spices we're located, he led me to the location (he didn't just point me in the right direction). He also stayed with me until I found the product I was looking for. The spice prices are cheaper than Walmart! (Surprise)", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "117163779509723826868", "name": "Elizabeth Good", "time": 1490300193568, "rating": 5.0, "text": "GReat selection.  Our favorites are the fresh brewed coffee, Piper and Leaf tea, and the hot fresh noodle bowls.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "111932352413140339868", "name": "terri Smith", "time": 1476839614646, "rating": 5.0, "text": "State of the art healthy Market, it's my favorite place to shop, also encourages me To make better choices for my diet,, I love this place!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "108199169982075784671", "name": "MO Mules", "time": 1514852509441, "rating": 5.0, "text": "Nice store, clean and loved the layout.  Found everything we were looking for", "pics": null, "resp": {"time": 1514936399040, "text": "We're glad to know we were able to help you out on your visit! We hope to have back again soon!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "103656816416427733258", "name": "Robert Rivera", "time": 1490648094647, "rating": 5.0, "text": "Oficially! The nicest, well stocked Wholefoods I have been in the USA! This location is perfectly setup for people who want to have lunch, great coffee and well picked location (by highway).\n\nPros:\n- perfect place to go to lunch from work if you ate into healthy options.\n- Location\n- ample parking!\n- greaaat pizza!\n- great deli\n- excellent floor-plan flow\n\nCons:\n- found none!\n- Prices may scare some people away. But found prices fair for quality, organic, non GMO product options.\n\nWill be visiting very often.\n\nEnjoy!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "114183053244481376134", "name": "Kay Campbell", "time": 1507425581557, "rating": 5.0, "text": "Pricey, but terrific stuff. The hot bar is great for a healthy, quick meal at odd times.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "112150159040446037110", "name": "Patricia H", "time": 1493303420706, "rating": 5.0, "text": "This place is amazing... with the food and fresh vegetables and fruits and meats", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "101596706495626907369", "name": "Elizabeth Pate", "time": 1504108252533, "rating": 5.0, "text": "We love being able to charge our Nissan Leaf while shopping.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "115712510465986481428", "name": "Personal Gmail Acct Alabama", "time": 1516933148525, "rating": 4.0, "text": "Overpriced but awesome buffet, better selection than fresh market", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "105343930438137069315", "name": "Amanda Gabhart", "time": 1507760232559, "rating": 5.0, "text": "Love the food center! A little pricey but good", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "105986616010534285624", "name": "Nia C", "time": 1493742469376, "rating": 5.0, "text": "The absolute best and freshest food in Huntsville. Awesome and friendly employees.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "115443046470742946902", "name": "Leslie Lo", "time": 1500641683706, "rating": 5.0, "text": "The staff are always friendly and go out of their way to help.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "108334456682477544781", "name": "Brian Letts", "time": 1462899374317, "rating": 1.0, "text": "My family has been shopping at Whole Foods in over 6 locations for the last 15 years and this is the worst run store ever.  We ALWAYS get overcharged on an average of 6 items when shopping our weekly run, and many which are SALE items.  On average it is an unfriendly group working there, the store is empty compared to most Whole Foods right before lunch and one or two tellers open.  We used to eat on site at the salad bars and you have to wait forever to get help behind the counter. The bagger we had recently was horrible, broken eggs, cold stuff with dry products, heavy things on breakables, ripped bags, literally just tossing products in the bags no rhyme or reason.  We mentioned this to him and he stared into space.\nNo apologies if they mess up or cause inconvenience to us.\nMany things we purchase regularly are not on the shelves.  Overall a unpleasant experience and we are really disappointing in how this store is run.  Hope they straighten up soon or this store will not make it!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104101341208858940389", "name": "Shirley Aesthetic", "time": 1495291466027, "rating": 5.0, "text": "Great variety of healthy good options for all types of preferred meal plans", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "101438095661502949187", "name": "Curtis Clemons", "time": 1545005869123, "rating": 5.0, "text": "Prices are high in and out quickly", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "107191581545431200904", "name": "Sue Cummings", "time": 1549499117554, "rating": 3.0, "text": "Getting frustrated. It's increasingly common for WH to be out of stuff, especially ALL medium roast coffee in bulk. And now they've added a front pane to the bins that is filled with beans so you can't see which bins actually have coffee in them. Disappointing.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "106898732574227796161", "name": "J. B.", "time": 1544362887482, "rating": 5.0, "text": "Great staff wonderful selection", "pics": null, "resp": {"time": 1544661356147, "text": "Thank you, J!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "108578125669265192406", "name": "Adam Sheppard", "time": 1509517121275, "rating": 5.0, "text": "Excellent service, clean, great selection on everything from ear candles to wedding cookies!", "pics": null, "resp": {"time": 1509722419645, "text": "Thanks for the great review Adam!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "114585673555044441274", "name": "James W. Ricci, Jr.", "time": 1521226797010, "rating": 5.0, "text": "Excellent shopping experience and great choices for you to pick from.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "115894663832204128030", "name": "Kwamee Tillman", "time": 1571774691197, "rating": 5.0, "text": "Very clean. People are frendly", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104661060521617830091", "name": "Austin Bullard", "time": 1507435839952, "rating": 5.0, "text": "Super friendly service and quality food. A little pricy but you get what you pay for.", "pics": null, "resp": {"time": 1507589168569, "text": "Thanks for the review, Austin!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104853017757185356032", "name": "Amelia Taylor", "time": 1483658105666, "rating": 5.0, "text": "Good products have hard to find Stuff staff enjoy their job", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "112841488032418107504", "name": "Tanya Wilson", "time": 1497350706676, "rating": 5.0, "text": "just love whole foods and so happy they are finally here!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113321712841829220028", "name": "Gene & Chrisann", "time": 1507063118654, "rating": 5.0, "text": "It's a great place to shop for natural foods and supplements!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "115905624391025903008", "name": "Clark L", "time": 1474372393405, "rating": 4.0, "text": "Friendly people, quality products in an inviting venue.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOyxSuoCCNDBGOOHzaBNb5sHEZFbE4UJktQK111=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOLK3IX9VH_QCRB20pEnGnjGWmUQnfQv4hI2ubh=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "115844723611799281468", "name": "Brian Rodgers", "time": 1481455923807, "rating": 4.0, "text": "Great place to catch lunch or pick up a few wholesome groceries.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "103280209169034845697", "name": "Robbie S Wigginton", "time": 1508803147171, "rating": 3.0, "text": "Nice variety. Different items than usual grocery but pricey.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "115278093942689993793", "name": "Dewayne Browning", "time": 1541469180187, "rating": 4.0, "text": "I go there for the beer.  Great selection", "pics": null, "resp": {"time": 1541640441051, "text": "💚💚💚"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "117197396222841277510", "name": "Melody Evans", "time": 1506836527592, "rating": 2.0, "text": "Hot bar was very lacking in vegetarian options.  Seriously, you couldn' t leave the bacon off the top of the green beans?  Also, 4 kinds of soup and all were made with meat stock!   And, the Brussel's sprout were mislabeled.  Ingredients listed as having Brussel's sprouts only and they clearly had bacon throughout.  I have eaten at WF all across America but this one was disappointing.", "pics": null, "resp": {"time": 1507042085689, "text": "Thank you for your feedback and we're sorry to hear about this. Our team would like to follow up for you. Do you mind sending an email to social.questions@wholefoods.com with this and any additional information?"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "108844809509758398773", "name": "C Y", "time": 1515771879022, "rating": 4.0, "text": "Great selection of healthy food. Great service, too.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113966707433335926510", "name": "Sam Espy", "time": 1515270455639, "rating": 5.0, "text": "Well laid out. Nice and clean", "pics": null, "resp": {"time": 1515377043015, "text": "Thanks for the review, Sam!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "106815889423626959646", "name": "Tyler Steele", "time": 1554583036746, "rating": 4.0, "text": "Still pricy, but good sales", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "114331596391117536749", "name": "Lindsey Dilworth", "time": 1497459216414, "rating": 5.0, "text": "Great selection of products. Friendly and helpful staff.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "100824534771685014730", "name": "andrew hickman", "time": 1520736333278, "rating": 4.0, "text": "Best meats. Sushi good wow", "pics": null, "resp": {"time": 1520864369051, "text": "Thanks for the review, Andrew!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "100854706294343015539", "name": "boyanna woods", "time": 1533700278868, "rating": 5.0, "text": "The greatest customer service. Everyone should shop here.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "109458054940157019427", "name": "Katie Sunshine", "time": 1473946246056, "rating": 4.0, "text": "I LOVE this store. The staff is super stellar! Some of the cashiers know us and it's sometimes hard to decide which checkout line to choose...I want to say hi to all our WF friends! WF has this awesome policy that if a product rings up incorrectly, you automatically get the item for free. The cashiers sometimes take this one step further---any complaints we've had about something we've bought (we bought some expired hummus once...we were overcharged once...etc) have been taken care of with a replacement---no questions asked. Also, WF is willing to track down and order items you're interested in. Not only that, but they then tend to keep that item in stock! :) The only thing I can't give a positive review of is their buffet. While there are plenty of options at the buffet---even for vegans, the food just isn't that good. And it's a bit pricey. Twice we have eaten there, and twice we have been disappointed. Still, this doesn't take away from the WF experience. I love shopping here, I love finding new items, and I love the feeling of friendliness every staff member radiates.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "100352385949266855111", "name": "Edward Jimenez", "time": 1527991032344, "rating": 4.0, "text": "A little pricey, but good products.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "110526418704605250201", "name": "Cheri Kamel", "time": 1501610109033, "rating": 5.0, "text": "When I need to find and try the weird paleo, GF, Whole 30, keto, vegan, dairy free foods I see on Instagram, Whole Foods will have it in stock. They have a good selection of drinks, too.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "108751153595404940415", "name": "Emily C.", "time": 1486386181879, "rating": 4.0, "text": "When you think of Whole Foods,  you think crunchy granola wannabes,  right? Well if you don't feel like dying from a massive heart attack like virtually every other southerner,  I'd highly recommend trying out the interesting fruits and veggies they have to offer. *Also see below for another reason Whole Foods can save your life.*\n\nSometimes there are great deals (local items like premium shitake mushrooms and living lettuce) but then there are overpriced things that sound awesome but are out of a normal person's budget.\n\n*sidenote from above*: For single,  educated heterosexual men looking for a significant other (shoot I think there are options for homosexual men too),  there are many good looking, in shape, educated women who shop here.  They obviously already have their crap together and you know they will have a good body for reproducing (a lot better than women hanging out in nasty clubs in downtown Huntsville or strip clubs in Atlanta),  just start focusing your attention there.  Then muster up the courage to ask some questions about a weird fruit or vegetable.  You are very welcome.\n\nThe fifth star will be added when I can afford all the delicious vegan cheese.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "110585651178561799467", "name": "Matthew Mueller", "time": 1467911517403, "rating": 3.0, "text": "This probably wasn't the best place in the city for a Whole food and certainly not the most profitable.   The \"Organic\" nature of the food leads to tremendously high prices and honestly the quality isn't much better than Publix or Fresh Market.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "100516851049975496910", "name": "William S Perkins Jr", "time": 1486025040597, "rating": 3.0, "text": "Nice and clean place. Good food but pricey", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "107711761172439471832", "name": "Steven Bruffy", "time": 1484882257388, "rating": 5.0, "text": "Great selection of hard to find products. Yes it's pricey but some items you can't find anywhere else.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102161810766526698051", "name": "Angi Pease", "time": 1512879718114, "rating": 5.0, "text": "Love Whole Foods Market! Always find what I need.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "109573905303186685946", "name": "Kayreen Bellamy", "time": 1507432485180, "rating": 5.0, "text": "Clean organized store. Lots of options in deli type area.", "pics": null, "resp": {"time": 1507565768077, "text": "Thanks for the review, Kayreen!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113541808395170448649", "name": "Larry Henson", "time": 1526944057920, "rating": 5.0, "text": "Great clean store and nice customer service.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113132255834498127893", "name": "sianeh Jackson", "time": 1505244983068, "rating": 5.0, "text": "First time going there and love it. Will be coming back.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "117178660328630241779", "name": "annmarie mckay", "time": 1510006012936, "rating": 5.0, "text": "Staff pleasant helpful a good place to find wholesome  goods and the prices are compareable to other places if not better in  some cases.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "105614443099663691435", "name": "scot bradley", "time": 1519030009728, "rating": 5.0, "text": "Pricey but very good food.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "109027801538388077382", "name": "Sarah Crowell", "time": 1510422555136, "rating": 5.0, "text": "Love There food and there food always looks very yummy... prices are a little high for us but worth it", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "111670489960362585207", "name": "Michael Anderson", "time": 1504998398351, "rating": 5.0, "text": "Great service. Good food options.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "109847055798189265462", "name": "Paul Spell", "time": 1497100520334, "rating": 5.0, "text": "All natural food.  Better for you", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "116310624805679837992", "name": "Darryl Robinson", "time": 1555251627799, "rating": 2.0, "text": "GREAT FOOD BUT OVERPRICED ON EVERYTHING EVEN WITH MY AMAZON PRIME DISCOUNT THE SAVINGS ARE MINUSCULE!!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "117167332396114882700", "name": "Jailyn Stone", "time": 1495068408286, "rating": 4.0, "text": "Can't believe Huntsville has a whole foods. It was so nice.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "103836643123937647687", "name": "Gregory Bazile", "time": 1508472562076, "rating": 4.0, "text": "Food was very good and reasonably priced. I Like the idea of paying for lunch based on weight of the food I purchase.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113874657790089161872", "name": "Ron Huffman", "time": 1550734114439, "rating": 5.0, "text": "Great place to get good groceries", "pics": null, "resp": {"time": 1551221829696, "text": "Thanks for the review, Ron!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104460126383400669783", "name": "Jeremy West", "time": 1518097410563, "rating": 5.0, "text": "Shaded secluded parking deck for a decidedly neoliberal culture business. I spent many a night here.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102326571745092242920", "name": "Traiz", "time": 1506880328474, "rating": 5.0, "text": "Helpful and friendly staff, food bar caters to \"southern-style\" tastes w fried foods. Suggest non-fried tofu, etc.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "105457011462378268875", "name": "Carole Albyn", "time": 1492832907747, "rating": 5.0, "text": "Great selections. Lots of hot bar items.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102674435721718412828", "name": "John Woodfin", "time": 1503697597274, "rating": 5.0, "text": "Great craft beer and surprising good lunch and pizza.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "111189329093127792936", "name": "Joshua Waters", "time": 1504691363607, "rating": 5.0, "text": "Whole foods always has the best natural and organic options.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "112395981828893026114", "name": "Jean-Luc Burhop (Lambda Scientist)", "time": 1505588042000, "rating": 4.0, "text": "Lots of good food options, especially for vegans.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "111249484303007875714", "name": "Brandon Pratt", "time": 1504674501481, "rating": 4.0, "text": "Delicious mochi... Only gave 4 stars because I couldn't bring any back home", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "109795810936560013644", "name": "Ay_Its_Bella", "time": 1490913271308, "rating": 5.0, "text": "Yummy and healthy food! A great place to shop!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "110546923463085354417", "name": "Eleasa Wilson", "time": 1471402105890, "rating": 4.0, "text": "I eat dinner (and breakfast!) at the hot bar often. I have really enjoyed the bbq pulled pork, brussel sprouts with bacon, chicken pot pie, simply grilled chicken thighs (good smoky flavor), and soups. I love most foods, and their japanese station has some of the best sushi I have had in Huntsville, and the pork katsu on steamed buns is great, try it with cucumbers and green onions and ponzu if you have never tried it. Most folks don't know that they also serve breakfast, which is also good and a great selection from which to choose - the french toast with chocolate is a must have!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102586647317681122661", "name": "Sandra Hester", "time": 1567813257863, "rating": 5.0, "text": "Well the food because it's organic and that's basically what I grew up on", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "109999657419468238239", "name": "J C", "time": 1512933813820, "rating": 3.0, "text": "Expensive, but great food, bakery and produce.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNQ5uQTDDDYjlKOp3JCtqKFVoS_WLDOx_v9q3HG=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPXa90XvvZyJkaKHWNxbZH1PP_lZQAwKcHEiMRD=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113358261487037083149", "name": "Chris Browning", "time": 1490820656626, "rating": 3.0, "text": "Clean store, good food, happy employees, high prices.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "109504354402325526018", "name": "AlanR", "time": 1514067215236, "rating": 3.0, "text": "Ok place to buy a few items, but too expensive for complete grocery shopping.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102278320743063218892", "name": "Ed Preston", "time": 1485107130309, "rating": 4.0, "text": "Quality products and unique items. Sometimes a little pricey but mostly worth it", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "109987773594052508082", "name": "Scott Howison", "time": 1506478604979, "rating": 4.0, "text": "Probably my favorite store to visit. I like to walk around and pretend that can afford to shop there.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "115546462487614369000", "name": "Barbara Shirley", "time": 1466907705532, "rating": 4.0, "text": "Too expensive , especially on meat & seafood for my budget. I live too far away to shop here weekly, since I've fell out of the work force.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "103129875418589189532", "name": "Sofia Clayborne", "time": 1499376225683, "rating": 4.0, "text": "The clientele​ are amazing and have such a great attitude.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "103273050101088425886", "name": "E F", "time": 1511489402394, "rating": 5.0, "text": "My favorite store. Can’t wait that prices are more reasonable.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "112919425434784991993", "name": "Mrof Madison", "time": 1525809473048, "rating": 1.0, "text": "Burnt, cold, overpriced and tasteless is the best way to describe their pizza by the slice.", "pics": null, "resp": {"time": 1525982101124, "text": "Thank you for bringing this to our attention. We take all complaints and feedback seriously, so we would like to look further into this matter. Can you please send a follow up email containing any additional details and your contact information to customer.questions@wholefoods.com? Can you please also refer to this review in the email message? Thanks."}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "101664674660471012099", "name": "Jennifer Mc", "time": 1457057064344, "rating": 3.0, "text": "\"It's okay\" does indeed describe what is a below par Whole Foods Market.  By now, it's been open 4 months or so and I will assume has hit its stride.\n\nThe hot bar/salad bar area is definitely below average.  It's been the same dried out meat, sweet potatoes and other southern items ever since it opened and the variety is lackluster at best.  Did I mention the meat is always dried out?\n\nThe labels on the hot/salad bar are not always there and I don't trust the ingredients.  The stir fry obviously contained vegetables that weren't on the label - I believe bamboo shoots.  Coupled with missing labels, the degree of confidence in the food is mediocre.\n\nThe asian rice bowl and mexican food sections are decent as well.  It's a bit disappointing to me that they use dark meat chicken for both places.  Again, the meat did not look fresh either.  At the rice bowl, they couldn't answer questions as far as ingredients for people with food allergies.\n\nLastly, the selection in the actual store itself is significantly smaller than other Whole Foods in Atlanta and Nashville.  While not every special snowflake request can be satisfied for food allergies, their depth and breadth of gluten free products was disappointing.  No gluten free croutons and other limited options are not what I would have expected in a Whole Foods.  The new Walmart neighborhood market had an equally competitive selection for less price.\n\nSo overall, compared to other Whole Foods, this one is.. bleh.  The layout is significantly smaller than the Whole Foods in Franklin, TN and the selection is limited.  It is simply not that impressive for its reputation.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "114503189470419906549", "name": "Carrie Rutledge", "time": 1555913400592, "rating": 5.0, "text": "Love Whole Foods and glad it’s convenient!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "109334692358812401505", "name": "Jon Box", "time": 1518296549839, "rating": 4.0, "text": "Relaxing on a Saturday afternoon with my adult kids!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "111366296663051695032", "name": "Terry Wellington", "time": 1559417687666, "rating": 5.0, "text": "I love going to this store", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "115414164704544378936", "name": "潘峰威", "time": 1562037950559, "rating": 3.0, "text": "good choice of fruits and vegetables.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "108489878136509686108", "name": "cindy lindsey", "time": 1499185709405, "rating": 3.0, "text": "Just went in to look around,  liked the selection they had", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "100295958086137554709", "name": "Shae Greene", "time": 1467338041410, "rating": 2.0, "text": "People are nice but mama ain't gon pay $14 for peanut butter. Also their cupcakes are offensive.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "112753993801295343540", "name": "Chris Spalding", "time": 1484870512502, "rating": 2.0, "text": "Expensive.  Almost a cartoon of itself.  Organic, sustainable clothes... really?", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "100479880247034858884", "name": "Jana Russell Nails", "time": 1495764565391, "rating": 5.0, "text": "Great selection of healthy and healthier than normal options", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "107236686322677302140", "name": "Veronica Tessier", "time": 1512432138008, "rating": 5.0, "text": "So many options for conventional, organic, non GMO vegetables, rice, oats, spices, nuts, breads, milks etc... They even had goats milk. :)", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "112009758980644567580", "name": "Merry Kniest", "time": 1479137079828, "rating": 5.0, "text": "Love this store!! Service is always helpful.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113888452444735124841", "name": "Brian Kirk", "time": 1513474990770, "rating": 5.0, "text": "Great food. Good vibe", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "116088074114686942586", "name": "Killroy", "time": 1499701446866, "rating": 5.0, "text": "Very good selection of organic and hard to find items", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104876960948140890644", "name": "Brian Cameron", "time": 1558966091204, "rating": 3.0, "text": "Expensive, hardly any brand names I recognize.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "114056144009073062916", "name": "Magan Johnson", "time": 1572001896532, "rating": 5.0, "text": "I love the variety", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "101470461595207023077", "name": "Stephanie Marie", "time": 1518655274858, "rating": 5.0, "text": "Nice staff, good hot bar choices.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "109023927719407911214", "name": "J S", "time": 1500050798242, "rating": 5.0, "text": "Great quality of groceries and good customer service!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102275102484838316624", "name": "Jonathan Ouzts", "time": 1481255712135, "rating": 4.0, "text": "Very good selection of MANY different items.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "105069085202163134227", "name": "Brian Dunbar", "time": 1497453127178, "rating": 5.0, "text": "High quality groceries and great selection in the bakery.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "110845011701723684556", "name": "Drew R", "time": 1498170856506, "rating": 5.0, "text": "Smaller than most. Home grown feel.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102667091966118565178", "name": "possumking", "time": 1481610405940, "rating": 5.0, "text": "Great location and store with lots of specialty items.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "117754865191287794333", "name": "Bryan Goldsby", "time": 1552075944562, "rating": 5.0, "text": "Fantastic produce, meat, and seafood selection!", "pics": null, "resp": {"time": 1553200708431, "text": "Thanks for the review, Beyan!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "112039129145953698785", "name": "Aware of your red list", "time": 1498571635677, "rating": 4.0, "text": "Clean store and happy employees. A little steep on prices.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104098023670688337624", "name": "Steve Trentham", "time": 1498259145062, "rating": 3.0, "text": "There is a decent selection of items but the service is terrible", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "101417040828381263385", "name": "Wanda DeMott", "time": 1498742617726, "rating": 4.0, "text": "Nice variety. Some priced on the extremely high side", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "108576808546304120442", "name": "Tim Jackson", "time": 1488395010127, "rating": 5.0, "text": "Amazing choices for health food and wellness products.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "112187721470585585197", "name": "meow rich", "time": 1516053029625, "rating": 5.0, "text": "Enjoyed the ready made meal selection.", "pics": null, "resp": {"time": 1516301838262, "text": "We're happy to hear this, thanks for the review!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104244443560539341533", "name": "Akevia Kindle", "time": 1506279627249, "rating": 4.0, "text": "Love going any time we are in town", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "111333181171108530259", "name": "J C", "time": 1577222114839, "rating": 3.0, "text": "Average healthy grocery store.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "114985863048107468351", "name": "Michael Conniff", "time": 1526147230774, "rating": 3.0, "text": "Friendly people, clean and organized store.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "108948225715407734269", "name": "Keith Jackson", "time": 1481471852009, "rating": 5.0, "text": "Clean,  helpful,  and very good buffet. They don't carry Dr pepper though.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113691266594908410630", "name": "Sylvette Parker-Monroe", "time": 1511313552747, "rating": 5.0, "text": "They a have a great variety if items", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "112870634539920348953", "name": "JT", "time": 1519710509893, "rating": 4.0, "text": "Nice food bar and the deserts are yummy!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "108102431698530134411", "name": "Faithful Kimberly Parker", "time": 1510332093704, "rating": 5.0, "text": "One of my favorite place to stop.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102667867350305737741", "name": "Connor Ross", "time": 1513049796278, "rating": 3.0, "text": "Good products but quite pricy", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "105319461525525403009", "name": "Matt Greene", "time": 1490978017011, "rating": 5.0, "text": "Best place for craft coffee in the Tennessee Valley", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "100045765980853646334", "name": "John ROCHE'", "time": 1497821637969, "rating": 5.0, "text": "Healthy food and healthy atmosphere\nGreat selection of food!!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "116863073873112366359", "name": "Natalie Ross", "time": 1498311424354, "rating": 5.0, "text": "This store always have what I want. It is expensive though .", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "106211121542954571512", "name": "Charles Durrin", "time": 1498765059358, "rating": 5.0, "text": "Relatively new and always friendly store.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "116672249693735165579", "name": "Helen Harrand", "time": 1504189019214, "rating": 5.0, "text": "Love their salad and food bar!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "103274289613852806383", "name": "Brian Hairston", "time": 1565698770450, "rating": 5.0, "text": "I stop in for sushi every time I pass by!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "118353755527563105142", "name": "Tom V.", "time": 1509738852025, "rating": 5.0, "text": "Clean well lit with lots of great stuff but like all whole foods a bit over priced", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "107713492283642056930", "name": "Lindsay Wheeler", "time": 1498141361928, "rating": 5.0, "text": "Great store, I especially like the buffet!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "100373054126434050959", "name": "Aimee W", "time": 1517675073623, "rating": 4.0, "text": "Love the bakery, produce and meat department.", "pics": null, "resp": {"time": 1517885114479, "text": "Thanks for the review, Aimee!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "101271255305195209830", "name": "Buzz Brown", "time": 1546050615205, "rating": 5.0, "text": "Everyone nice and helpful.", "pics": null, "resp": {"time": 1546224081639, "text": "Thank you! We're happy to help! 💚"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "100464803881058875123", "name": "Trisha Davis", "time": 1495324842963, "rating": 5.0, "text": "I love it everything is clean and organized...", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "108079149383388745039", "name": "Paula Linthicum", "time": 1552304456055, "rating": 3.0, "text": "I only go there to but chicken wings", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "109288270631204425033", "name": "Anthony Jupiter", "time": 1544976351188, "rating": 3.0, "text": "Mediocre but the Amazon lockers are a nice addition.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "111345330603657878839", "name": "Vnb B Nbv", "time": 1484343120761, "rating": 1.0, "text": "There is a creepy perv that works in the prepared foods (i guess) his name is Richard Long. When i seen him i was grossed out because all his hair was all over the place. He said very innappropriate things to me. I felt so uncomfortable I left before my pizza was ready. I will not be back.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "111737177805739816085", "name": "I wood", "time": 1582209540994, "rating": 5.0, "text": "They have a large selection", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "108410842791292821127", "name": "Richard York", "time": 1497958372644, "rating": 4.0, "text": "Great place for all natural food...", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "110126022623217044740", "name": "CS Brown", "time": 1553884403125, "rating": 3.0, "text": "Just too expensive", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "118363290353674102713", "name": "Dempsey Marks", "time": 1509033978396, "rating": 5.0, "text": "Great Whole Foods store with a very helpful staff!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "110084860854762347953", "name": "Amanda Moore", "time": 1553540672511, "rating": 5.0, "text": "Clean store. Kind staff!", "pics": null, "resp": {"time": 1553636837183, "text": "Thanks for the review, Amanda! We hope to see you back soon."}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "115647624817413648147", "name": "Amber Arnold", "time": 1538226397582, "rating": 5.0, "text": "Clean, great selection.", "pics": null, "resp": {"time": 1538406304165, "text": "Thank you for the review, Amber!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "118401460845362867137", "name": "Rose Casterline", "time": 1564718446983, "rating": 5.0, "text": "Awesome", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "107159200534949650278", "name": "Rebecca Rideout", "time": 1563815676068, "rating": 5.0, "text": "super helpful staff", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "101082822118890532288", "name": "Julian Heimsness", "time": 1542598922364, "rating": 1.0, "text": "Poor  customer service", "pics": null, "resp": {"time": 1542639735192, "text": "Thank you for reaching out, Julian. We're sorry to hear about this. We'll share your feedback with store leadership and hope to improve your future experiences. Please contact us directly at www.wfm.com/help for further assistance."}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "103310465050070176404", "name": "McClendon Bakery/Deli", "time": 1526845839987, "rating": 5.0, "text": "Thid store is amazing", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "100486494779959038848", "name": "Jennifer Combs Minyard", "time": 1514907698603, "rating": 5.0, "text": "They had just what I was looking for which made my day!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104584112233073890912", "name": "Tom Xerri", "time": 1519009448217, "rating": 3.0, "text": "Nice variety of quality foods.", "pics": null, "resp": {"time": 1519089632923, "text": "Thanks for the review, Tom."}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "118309085514451184125", "name": "Carol Disney", "time": 1508721089287, "rating": 4.0, "text": "Employees where very helpful.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "111385021555611568356", "name": "Corey Johnson", "time": 1564272674055, "rating": 5.0, "text": "Good food", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "103149752610878155589", "name": "Walter Walker", "time": 1520123951492, "rating": 5.0, "text": "Great selection, bakery just so so and overpriced", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113347697708219610269", "name": "John Sherrick", "time": 1498764218219, "rating": 5.0, "text": "The Huntsville store always has the brands and organic fruits and vegetables I normally buy.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "112563070352438176404", "name": "Rosa Huntsville AL", "time": 1531088115628, "rating": 4.0, "text": "Healthy Food! Friendly staff!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "101853158988283528646", "name": "Mikey McHaggis", "time": 1504922474087, "rating": 4.0, "text": "Really nice shop but the prices are ridiculous. Example: Hatch green Chile $2.49 lb while over at Sprouts 99 cents lb.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "112964731099779747681", "name": "Cynthia Losco", "time": 1501444297672, "rating": 5.0, "text": "everyone was very helpful in your store", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104139593621635376214", "name": "Gordon Niessen", "time": 1536675083864, "rating": 3.0, "text": "Electric chargers were not working.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "112063266865011896466", "name": "Asher Berry", "time": 1564929342001, "rating": 4.0, "text": "Typical, but clean and friendly", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "108592971529766044868", "name": "Reginald Alex Whitening", "time": 1522548914507, "rating": 5.0, "text": "The store was very unique", "pics": null, "resp": {"time": 1522714478628, "text": "Thank you!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "118171404306523725149", "name": "Kenneth Powell", "time": 1492865998109, "rating": 5.0, "text": "Very clean, good selection.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "109705508945044437867", "name": "C B", "time": 1500994798258, "rating": 5.0, "text": "Love the hot bar and beer selection", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "107923771395531923121", "name": "Lori Jones", "time": 1481380413343, "rating": 5.0, "text": "Great selection and electric car chargers!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "108078903084636793923", "name": "william parmley", "time": 1596552843285, "rating": 5.0, "text": "Yummy", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "105008945916545333421", "name": "Toshia Hanson", "time": 1555653753998, "rating": 5.0, "text": "Good selection!", "pics": null, "resp": {"time": 1555782884172, "text": "Thanks for the review, Toshia!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "116323862920592936075", "name": "Amelia Macewicz", "time": 1500495194887, "rating": 5.0, "text": "Really great customer service.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "107983612592356979422", "name": "Dionka na", "time": 1543708271543, "rating": 5.0, "text": "I love this wholefoods", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "117599878656681107666", "name": "White Raven#5477", "time": 1565279422757, "rating": 4.0, "text": "High prices", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "106866789226782748150", "name": "Charlene Brueggman", "time": 1506215079091, "rating": 5.0, "text": "The fresh seafood at great prices", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "110444095692344088575", "name": "Ken Galyean", "time": 1515769392350, "rating": 4.0, "text": "Great place for quality food", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "109753064229513455353", "name": "Adam Landingham", "time": 1509061705273, "rating": 4.0, "text": "Great buffet and craft beers.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "100579682098996902993", "name": "Michael Ham", "time": 1510959825579, "rating": 5.0, "text": "Very friendly service.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "114922592626048521695", "name": "Josh Bowen", "time": 1559027041478, "rating": 4.0, "text": "It's lit!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102423973632019457706", "name": "Lisa Wright", "time": 1543425162908, "rating": 5.0, "text": "Love this place...", "pics": null, "resp": {"time": 1543887547233, "text": "Thank you for the nice review, Lisa!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "103636341865003541787", "name": "Jamie Martin", "time": 1546611119041, "rating": 5.0, "text": "Great store.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "110873306537306603207", "name": "Sara Robinson", "time": 1559450054651, "rating": 5.0, "text": "Hooray, a Whole Foods in Huntsville!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "112143399091642279383", "name": "Jim Hennessy", "time": 1544406571550, "rating": 4.0, "text": "except for the prices, it is the future", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "103024488752173639925", "name": "Marthenia Scruggs", "time": 1558440475819, "rating": 3.0, "text": "Decent", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "103817981539407787634", "name": "Alvin Solone", "time": 1546517496023, "rating": 4.0, "text": "Be healthy in 2019", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "105907278416385165933", "name": "Alex Graham", "time": 1538340114762, "rating": 3.0, "text": "Expensive", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102414790617604131217", "name": "Deborah Hunter", "time": 1536965222057, "rating": 5.0, "text": "Goodies!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "107885337156840944692", "name": "Alicia Krzyzewski", "time": 1546161265116, "rating": 2.0, "text": "Over priced.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102794227238364992003", "name": "Tee Archie", "time": 1533215651999, "rating": 5.0, "text": "Good experience.  As expected", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "110796567951854939800", "name": "lisa allen", "time": 1517749724820, "rating": 2.0, "text": "Staff wasnt as friendly as usually are", "pics": null, "resp": {"time": 1517935015900, "text": "Hi Lisa, thank you for reaching out. Can you please send a follow-up email to social.questions@wholefoods.com with additional information in reference to this review? We want to look into this."}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "112582628146639724940", "name": "Miranda Wallace", "time": 1510557786797, "rating": 5.0, "text": "Great selection, and wonderful sushi and bowls!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "118072833287545180267", "name": "Mallory O'Neal", "time": 1516564928657, "rating": 5.0, "text": "All my $$$ goes here!!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113179364256152083558", "name": "Kaylin Flores", "time": 1516513157877, "rating": 5.0, "text": "Amazing staff", "pics": null, "resp": {"time": 1516938231958, "text": "Thanks for the great review, Kaylin! When you have a moment please send us an email to social.questions@wholefoods.com detailing your experiences with the team members at this location. We will be happy to let their store team leader know what a great job they are doing!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113244565566195837818", "name": "Ace Cole", "time": 1533330957870, "rating": 4.0, "text": "Prices are somewhat high", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "116416268389132199793", "name": "Craig Lanphere", "time": 1518907501997, "rating": 4.0, "text": "Nice selection.", "pics": null, "resp": {"time": 1519082374273, "text": "Thanks for the feedback, Craig!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "115037426314836772892", "name": "J B", "time": 1489271134207, "rating": 3.0, "text": "Like a miniature Whole Foods if you've been to the ones in Birmingham or Nashville.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104299655345818806120", "name": "Alabama Reloader", "time": 1515725437604, "rating": 5.0, "text": "Great selection", "pics": null, "resp": {"time": 1515786322710, "text": "Thanks for the great feedback Judson!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "109935598958844656523", "name": "Denise McConico", "time": 1515503312329, "rating": 5.0, "text": "Love this place!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102128516049759978201", "name": "T. Barnes", "time": 1514424241785, "rating": 5.0, "text": "Great store", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "114840762267121380359", "name": "David P", "time": 1521066373880, "rating": 5.0, "text": "Awesome healthy food", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "116579448100433954265", "name": "Alex Townsend", "time": 1513603036113, "rating": 4.0, "text": "Good produce.", "pics": null, "resp": {"time": 1513802150364, "text": "Thanks for the review Alex!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "111559168389886117342", "name": "Sherry Banks", "time": 1530285987361, "rating": 5.0, "text": "Love this store", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "116390446182664171997", "name": "Steven McDowell", "time": 1513298814341, "rating": 5.0, "text": "Love this store!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "110085628628717940665", "name": "Michaela Myers", "time": 1512656309804, "rating": 5.0, "text": "Expensive but really good!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "117101718285263991951", "name": "Justa Hunch", "time": 1529326292268, "rating": 5.0, "text": "You can find everything you ever dreamed of.. but they don't call it \"whole paycheck\" for no reason.. ;)", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113866923854448583964", "name": "Kimberly Wilbourn", "time": 1527735327913, "rating": 5.0, "text": "Great place!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "101097460864331372679", "name": "Travis Halliwill", "time": 1510762330396, "rating": 4.0, "text": "Local produce and hard to find products", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "107841537697638986301", "name": "Forrest Teague", "time": 1509670910557, "rating": 3.0, "text": "Good", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "115963016636402166387", "name": "Christine Haye", "time": 1509308391032, "rating": 5.0, "text": "It was great", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "117521606322305172906", "name": "Michael Bryant Ryder", "time": 1508088283957, "rating": 5.0, "text": "Check out their chocolate selection!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "101828986165907131642", "name": "Theresa Merideth", "time": 1506450142075, "rating": 4.0, "text": "Clean,wonderful odors", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "103801859053472355654", "name": "Iris Altman", "time": 1505086794010, "rating": 5.0, "text": "Everyone is friendly.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "114151140130239425981", "name": "Aaron Mitchell jr", "time": 1504886858625, "rating": 5.0, "text": "Good prices", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104396390759749350098", "name": "Bethany Williams", "time": 1502005197739, "rating": 4.0, "text": "Yummy food , nice beverages.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "108253497587202554539", "name": "Charles Cole", "time": 1507617527177, "rating": 5.0, "text": "Mock chicken salad good!", "pics": null, "resp": {"time": 1507817464458, "text": "Thanks for the review!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102916749185922118953", "name": "Tyler Englestad", "time": 1504572969534, "rating": 5.0, "text": "Free EV charging stations!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104874034542382817429", "name": "Chuck Black", "time": 1504139849723, "rating": 4.0, "text": "Still Whole Paycheck until further notice...", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113834016555385661635", "name": "Brandie Robinson", "time": 1504098971804, "rating": 4.0, "text": "Very wide selection of healthy foods!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "105884054878116212074", "name": "De'Andre Washington", "time": 1503859345277, "rating": 3.0, "text": "To expensive for quality same quality at publix", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "111031006001162857228", "name": "Tina Edwards", "time": 1503781418056, "rating": 4.0, "text": "Love the variety of foods", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "112710320171058234363", "name": "Lahoma Manique Stoltz", "time": 1519851462943, "rating": 4.0, "text": "Can be a little pricey but love the options for all diets!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "106074272060054718964", "name": "Daron Winsett", "time": 1519953448494, "rating": 3.0, "text": "All i did was buy a gift card.  Store was not busy.", "pics": null, "resp": {"time": 1520049219371, "text": "Thank you for the review. Please send any feedback to social.questions@wholefoods.com on how we can make our store better. We would love to hear from you."}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "100021425142496223717", "name": "Johnny Waits", "time": 1502500161368, "rating": 5.0, "text": "Like it all organic foods", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "103375536188163031838", "name": "Greta Blackwood", "time": 1502290874851, "rating": 5.0, "text": "Great buffet.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "116480561621302410035", "name": "Pamela Hideko", "time": 1502215220792, "rating": 4.0, "text": "Would've gave 5 ⭐️ but sometimes I go in there for one thing specifically and they're out", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "100114142085683614566", "name": "Caleb Cunningham", "time": 1501788038000, "rating": 5.0, "text": "Clean store. Many options.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "115673018967844706551", "name": "Christie Chamberlain", "time": 1501780895881, "rating": 5.0, "text": "Love this store", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104110780143771753207", "name": "Clifton Mcnerney", "time": 1518030252502, "rating": 4.0, "text": "Great store", "pics": null, "resp": {"time": 1518988283910, "text": "Thank you for the review, Clifton!"}, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "115643885318066739760", "name": "Blackcloud Blackcloud", "time": 1500843763588, "rating": 1.0, "text": "Over priced hippie store.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "107539754194750024177", "name": "Sheila Norris", "time": 1500318533561, "rating": 5.0, "text": "Cool", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104497658329313074341", "name": "Joshua Lasseigne", "time": 1524863549418, "rating": 4.0, "text": "Friendly staff", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "114751505879585839252", "name": "Annie Lowman", "time": 1500154408010, "rating": 5.0, "text": "It is a nice environment, to shop at", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "108268062334910387405", "name": "Bob Stell", "time": 1523235414238, "rating": 5.0, "text": "Best food in town.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "100860115232782255692", "name": "KN", "time": 1499802277331, "rating": 5.0, "text": "Good food", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "100271447919181967026", "name": "Bill Edgil", "time": 1499527955527, "rating": 5.0, "text": "Lots a good stuff", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102962975750190141885", "name": "J Williamson", "time": 1524216264936, "rating": 3.0, "text": "EV chargers were broken.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "101868416386359059582", "name": "Will Trahan", "time": 1499205549151, "rating": 4.0, "text": "very friendly staff", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "110497665175929157930", "name": "S Fury", "time": 1516054333201, "rating": 5.0, "text": "Great food and nice people.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104935826439436160243", "name": "Richard J Kreutzer", "time": 1498917199465, "rating": 4.0, "text": "Fresh Food, Clean, Bulk", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "112828985326340319984", "name": "S Banks", "time": 1498502823491, "rating": 4.0, "text": "Good selection of expensive items. Look for specials.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "112274055546329193728", "name": "MEGHANA RAMESH", "time": 1498451789244, "rating": 5.0, "text": "Great for healthy diet", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "110296572324964767565", "name": "Ryan McClarty", "time": 1498319992050, "rating": 4.0, "text": "Expensive but good options.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "114462093690197994057", "name": "Shawn Roberts", "time": 1515290156252, "rating": 2.0, "text": "Over priced terrible selection.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "110730789857084929051", "name": "maisha gaillard", "time": 1514219837395, "rating": 5.0, "text": "Love this place", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "115642859865229414011", "name": "Crystal Cook", "time": 1495573881193, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "114403727347147663200", "name": "Freda Williams", "time": 1511981973936, "rating": 3.0, "text": "Very pricey", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "103539797647780834328", "name": "Connie's Nutrition and Nuggets (body & soul)", "time": 1511921804360, "rating": 3.0, "text": "Nice", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "114401549514329422185", "name": "Wanda DeMott", "time": 1511390971955, "rating": 5.0, "text": "Great selection and service", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "108741778249200069338", "name": "Nicole W.", "time": 1511298711427, "rating": 5.0, "text": "I love this store!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "111103448624712417306", "name": "Tim Harrison", "time": 1529679992909, "rating": 1.0, "text": "Not a fan of organic foods. Seems overpriced", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104874034542382817429", "name": "Chuck Black", "time": 1504139849723, "rating": 4.0, "text": "Still Whole Paycheck until further notice...", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "115643885318066739760", "name": "Blackcloud Blackcloud", "time": 1500843763588, "rating": 1.0, "text": "Over priced hippie store.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104982751777674681048", "name": "A N G", "time": 1452917179578, "rating": 5.0, "text": "I wish we had a Whole  Foods  store in Madison.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "101097460864331372679", "name": "Travis Halliwill", "time": 1510762330396, "rating": 4.0, "text": "Local produce and hard to find products", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "106752217582163528788", "name": "Suki Johnson", "time": 1453513482866, "rating": 2.0, "text": "It smells like a giant fart.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "118401460845362867137", "name": "Rose Casterline", "time": 1564718446983, "rating": 5.0, "text": "Awesome", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113965266450745135518", "name": "Berenice Serpas", "time": 1490447966187, "rating": 5.0, "text": "Love this place!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "111559168389886117342", "name": "Sherry Banks", "time": 1530285987361, "rating": 5.0, "text": "Love this store", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113885685847841286956", "name": "Ms. J", "time": 1488046002004, "rating": 5.0, "text": "Just clean..very healthy eating", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104935826439436160243", "name": "Richard J Kreutzer", "time": 1498917199465, "rating": 4.0, "text": "Fresh Food, Clean, Bulk", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "109363220374687851087", "name": "Ella Faulk", "time": 1505671626331, "rating": 5.0, "text": "Very good store.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113044255233691226150", "name": "Stephanie Morrison", "time": 1488028397877, "rating": 3.0, "text": "To expensive but they have bulk foods", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "106556640344048944565", "name": "Caitlyn Hoppe", "time": 1504193834806, "rating": 5.0, "text": "Clean, helpful staff, and great food!!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102329626919006060184", "name": "Soror Windley", "time": 1513029409435, "rating": 4.0, "text": "I don't shop here, but just once to look for something I couldn't find in other stores. The prices are super high but if you're looking for hard to find healthy items, you'll find them there.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "116400215505360568446", "name": "Rachel Haggard", "time": 1503363857478, "rating": 5.0, "text": "They have paleo meals here in the to-go section!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "101433575562710654578", "name": "Sonya Jordan-Manning", "time": 1486398688172, "rating": 5.0, "text": "I love this place!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "106744125140383618229", "name": "Squawk 7600", "time": 1485450406401, "rating": 4.0, "text": "Good, typical Whole Foods experience.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "110370410419197722046", "name": "Kirk McCann", "time": 1484889809788, "rating": 5.0, "text": "Healthy well priced lunch", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "114374964493520934172", "name": "Serena Steede", "time": 1501353415459, "rating": 5.0, "text": "Great place for healthy transitions", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113996523152197149258", "name": "bukkie", "time": 1484109640253, "rating": 3.0, "text": "Expensive but worth it", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "118316375657640881260", "name": "Democaliber", "time": 1484105914215, "rating": 5.0, "text": "It's Whole Foods. YUM", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113294051675985477114", "name": "Chris Gaddes", "time": 1483915118632, "rating": 5.0, "text": "Great store!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "117998566840531205298", "name": "Patricia Jackson", "time": 1500725471195, "rating": 5.0, "text": "I not only found what I came for, but another great surprise (pretzel buns). Clerk very friendly.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "106648659873910169624", "name": "Jeremy C Och", "time": 1483278212240, "rating": 5.0, "text": "Wow. What a store!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "117634499044393342564", "name": "Blkboard With Bee", "time": 1483151512375, "rating": 5.0, "text": "Love it", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "107867942237678073617", "name": "Cipher Willett", "time": 1482892137344, "rating": 5.0, "text": "A bit expensive, but a good place to find healthy food!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "105146490270723812187", "name": "Carl Miller", "time": 1482705686272, "rating": 4.0, "text": "Good food and service", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "101687486576283039835", "name": "N Smith", "time": 1502325579367, "rating": 4.0, "text": "I love the roasted artichokes.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "108910364078514243632", "name": "Kim Ziehlke", "time": 1498260923435, "rating": 5.0, "text": "Nice environment, healthy food choices", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104135258018752419536", "name": "Michael McGinnis", "time": 1498307758482, "rating": 3.0, "text": "Great selection but frankly overpriced", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "106174360659861345645", "name": "melvin brazier", "time": 1481334384033, "rating": 1.0, "text": "Way over priced.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "112122945503852262767", "name": "Carl Esch", "time": 1510769232952, "rating": 3.0, "text": "My wife is from Denmark. She goes there to find some things she can't find other places. I suppose you get what you pay for.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "117994558507439318447", "name": "Mister JSL", "time": 1493656220051, "rating": 5.0, "text": "Great selection of foods", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "107480206029257629884", "name": "Danica Antoine", "time": 1492086677801, "rating": 4.0, "text": "I like shopping here, the variety is awesome but its a little too expensive.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "105521042301021325141", "name": "Angela Christopher", "time": 1490199246031, "rating": 5.0, "text": "Just don't go to spend any $ Great place to walk around and see how the richer half lives...", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "115113949684279443937", "name": "Aaron Swearengin", "time": 1489505937840, "rating": 3.0, "text": "Not as much variety as I was hoping for here.  Prepared food is just okay.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104259061731616022054", "name": "William Neighborsjr", "time": 1488811762113, "rating": 5.0, "text": "Food is awesome", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "106573494482579209648", "name": "Streeter Michael", "time": 1488485662905, "rating": 4.0, "text": "Eggplant pizza is the best", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "100602202609748485021", "name": "Michael Tanner", "time": 1495977442829, "rating": 5.0, "text": "Nice store and people", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "113885685847841286956", "name": "Ms. J", "time": 1488046002004, "rating": 5.0, "text": "Just clean..very healthy eating", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104354188093720659425", "name": "Thomas Russell", "time": 1487605295818, "rating": 5.0, "text": "Expensive great food.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "105075038705965168381", "name": "A Todd Baker", "time": 1493492418292, "rating": 4.0, "text": "Pleasant shopping", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "110639705727142739211", "name": "Neal Hauser", "time": 1493294060419, "rating": 5.0, "text": "Another great Whole Foods", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "111678861738007327472", "name": "Brian Dunaway", "time": 1484314312085, "rating": 5.0, "text": "This place has everything you could ask for. I wish I lived closer.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "108158868189161477561", "name": "deborah blaylock", "time": 1484337870505, "rating": 5.0, "text": "Never been before But loved it", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "103802319689058411715", "name": "Amber Litteken", "time": 1483903917241, "rating": 4.0, "text": "Pricey, but I can always find the specialty items I need and can't find at publix.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102857992969265935402", "name": "Cary Mason", "time": 1493948292116, "rating": 4.0, "text": "Trivia nights at Spazio are awesome!", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "116448021133860625979", "name": "Roderick Howell", "time": 1481827629947, "rating": 5.0, "text": "Great food bar", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "110443708077143783373", "name": "John Stallings", "time": 1481548643374, "rating": 5.0, "text": "Looking for Cheeses,  this is the place.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "107904701175575930040", "name": "Waldwinthir Guillim", "time": 1485629900638, "rating": 4.0, "text": "Great selection BUT PRICEY", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "101926759638571857408", "name": "Tes raB", "time": 1486819901477, "rating": 5.0, "text": "Love the food here and the coffee.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "115594451362015522841", "name": "George Preussel", "time": 1483408809476, "rating": 4.0, "text": "Always a pleasant experience.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "106752217582163528788", "name": "Suki Johnson", "time": 1453513482866, "rating": 2.0, "text": "It smells like a giant fart.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "106752840419221290718", "name": "nico Ramos", "time": 1450117579033, "rating": 1.0, "text": "Not the location. Was way off", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102401747983934311764", "name": "Alex Baquerizo", "time": 1488581184993, "rating": 3.0, "text": "Good Experience at this Whole Foods. Prepared food Market did not have much variety ...", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104469853304811746817", "name": "Amber Merenda", "time": 1456932082636, "rating": 1.0, "text": "The whole place smelled horrible. Had to run out.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "104982751777674681048", "name": "A N G", "time": 1452917179578, "rating": 5.0, "text": "I wish we had a Whole  Foods  store in Madison.", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "108561173412730698752", "name": "Michelle Liu", "time": 1489982578827, "rating": 3.0, "text": "(Translated by Google) A little crowded, lots of people, food is fresh and clean\n\n(Original)\n有點擁擠，人很多，食物很新鮮乾淨", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102322377539951560626", "name": "Pastor Juan Ernesto Perez", "time": 1539469095682, "rating": 5.0, "text": "(Translated by Google) Excellent healthy food place\n\n(Original)\nExcelente lugar de alimentos sanos", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
{"user_id": "102928057575452917458", "name": "Jessica E Benitez A", "time": 1504007725480, "rating": 5.0, "text": "(Translated by Google) They have all kinds of healthy food\n\n(Original)\nTienen todo tipo de comida saludable", "pics": null, "resp": null, "gmap_id": "0x88626cbabd5191c3:0x16c5e3cca9032ebd"}
