{"user_id": "111772890272616101389", "name": "Martha Pickrell", "time": 1616857574969, "rating": 5.0, "text": "The staff was very helpful and knowledgeable.  I highly recommend them for your countertop needs.", "pics": null, "resp": {"time": 1618334521799, "text": "Hi Martha! Thank you for your kind words and support. We loved getting to assist you and create your dream countertops! Please let us know if you need anything in the future!"}, "gmap_id": "0x8886020b6a2c95c5:0xad5cbfffe3d6cd9d"}
{"user_id": "117839517324477641764", "name": "Esther Smith", "time": 1586001235509, "rating": 5.0, "text": "Excellent company to work with. Did a very professional job. Employees made sure everything was done properly and customer was satisfied. Recommend them highly!", "pics": null, "resp": {"time": 1618334403903, "text": "Thank you Esther! We loved getting to work with you and make your dreams into a reality! We hope you love your countertops as much as we did!! Please let us know if you ever need assistance in the future."}, "gmap_id": "0x8886020b6a2c95c5:0xad5cbfffe3d6cd9d"}
{"user_id": "115937575270344792491", "name": "Jason Polancich", "time": 1523894182862, "rating": 5.0, "text": "These folks have been great about helping us get our new kitchen done. They showed up, did professional work and are courteous and polite. They;'e even doing their best to speed up the delivery so we can finally stop eating out. Highly recommend if you want expert service,", "pics": null, "resp": {"time": 1618334270485, "text": "Hi Jason! We are so excited that you love your kitchen as much as we do! You were such a pleasure to work with and please let us know if there is ever anything you need in the future. Best wishes to you and your family!"}, "gmap_id": "0x8886020b6a2c95c5:0xad5cbfffe3d6cd9d"}
{"user_id": "117124106629065759769", "name": "Robin Katona", "time": 1553895923632, "rating": 5.0, "text": "Purchased River White granite to update my kitchen. Crystal helped me pick out a tile to do the backsplash and it is BEAUTIFUL. Everyone was helpful and install was painless. Very happy with counters and backsplash", "pics": null, "resp": {"time": 1618334146873, "text": "Hi Robin! Thank you for your review. We absolutely loved getting to work with you and help create a beautiful kitchen. Hope to see you soon!"}, "gmap_id": "0x8886020b6a2c95c5:0xad5cbfffe3d6cd9d"}
{"user_id": "104757779375503390395", "name": "Adam Beams", "time": 1563909340534, "rating": 5.0, "text": "J and L always does an amazing job.  They are competitive with pricing and they show up when they say they are!", "pics": null, "resp": {"time": 1618334346401, "text": "Adam, thank you for all of your support. We really appreciate it!"}, "gmap_id": "0x8886020b6a2c95c5:0xad5cbfffe3d6cd9d"}
{"user_id": "108009409584566300011", "name": "Matt Cook", "time": 1535043422839, "rating": 5.0, "text": "One of the gems in Tuscaloosa for home remodeling. J&L crew deliver on what they promise. Very professional and friendly staff. Will most definitely work with them again in the future.", "pics": null, "resp": {"time": 1618334212521, "text": "Hi Matt! Thank you so much for the kind review. We enjoyed working with you and are so happy you love your countertops!! Please let us know if there is ever anything we can help with in the future!"}, "gmap_id": "0x8886020b6a2c95c5:0xad5cbfffe3d6cd9d"}
{"user_id": "103601181969581557382", "name": "Pat Roberts", "time": 1555778787016, "rating": 5.0, "text": "J & L always provides superior service and a friendly environment.", "pics": null, "resp": {"time": 1618334084043, "text": "Thank you Pat for your kind words!"}, "gmap_id": "0x8886020b6a2c95c5:0xad5cbfffe3d6cd9d"}
