{"user_id": "110337069417871772116", "name": "Rita Robinett", "time": 1627673750364, "rating": 1.0, "text": "I went to him for severe back pain but I saw his practitioner nurse.  She showed me my MRI film but they weren't mine. I have seen mine and much worse  than that.They passed me off to his Associate Dr. Harmon saying Hadley didn't do the kind of surgery I needed so I had to go again an hour away. He said he couldn't help me. They are using other films and flat out lying to patients.  My Brother has treated the same way. These Drs.. Only want your money and don't care if us older people suffer and die. They never mentioned any other options which I now\nKnow is out t\nthere.  They all should be reported.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "118110488150991012207", "name": "Michellemd McElroy", "time": 1623703628500, "rating": 5.0, "text": "Dr Hadley,(and his team) has changed my life with his skills more than once. Three times actually. He's the only neurosurgeon I'd recommend, a true miracle worker! His team is truly amazing.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "102967202962842997064", "name": "Don Jackson", "time": 1604366880918, "rating": 5.0, "text": "I had back pain for 11 years.  Dr. Hadley did my surgery in July 2020 and I'm almost pain free.  I'd give him more stars if I could, he deserves more than just 5.  His staff is amazing and he treated me wonderfully.  It's amazing to finally feel great.  I had a fusion done and that's a serious surgery but I knew I was in great hands.  I had tremendous confidence all the way.  I highly recommend Dr. Hadley for spinal issues.  He is the best in his field!!!", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "102341787986506314050", "name": "Mark Nunnelly", "time": 1611876065864, "rating": 5.0, "text": "I have been blessed to be under the care of Dr. Hadley for the past 3.5 years.  He recently performed a laminectomy on 3 of my vertebrae because of a spinal cord tumor and I am recovering well.  Since my first meeting with Dr. Hadley, I have been confident that Dr. Hadley was the best of the best regarding his skills and knowledge.  My recent surgery results proved that to be true.   I would recommend him to anyone that asks.  Thank you Dr. Hadley!", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "100719011527393657733", "name": "Teresa Leatherwood Leatherwood", "time": 1620662141553, "rating": 5.0, "text": "I meet With Dr Hadley and David and They went over my mri and Talk about What They could do for me To give me some Relief and get my strength Back we decided Neck  surgury wood be The Thing To do and They were  great when i went Back and we Talk about what They wood be doing and They Explain everything To where i could understand and They Took Time with me and They were verry caring and concerned about my pain and what i hade been dealing with for 5 years i wish i could have found Them long Time ago i loved how Dr Hadley gives god all The praise That He knows and Recognized That. There  gift is from God Thats what put me at so much. at. ease  knowing He belives in our lord. I wood   give him and David more Then 5 stars if i could i Wood Recommend. Both of Them To anyone if i Ever Hade To go Through This again i wood    use Them again for sure and The staff and all of Uab was amazing To me i love That Hospital. I am. So blessed To say i give my Jesus and Dr Hadley and David and The Staff. and all my prayer warriors  all my praise  I went Back for my follow up  after The surgury and They said i was healing great and almost all my strentgh is Back. Praise God Just still have little hard Time swallowing from The surgury but im improving  with That each day That go By. My surgury was  april The 20th", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "104208621421982410229", "name": "Amy Petersen", "time": 1608567292266, "rating": 5.0, "text": "I cannot describe in a single review what a truly exemplary surgeon, diagnostician, healer, and human Dr. Hadley is. I have had 3 surgeries on my cervical spine so far. I wish I had gone to Dr. Hadley from the start and perhaps that number would be only one. I work in healthcare and was desperate for help. I surveyed my peers for some time across many levels and many modalities. The recommendation was unanimous. Dr. Hadley took the time to have a certain, clear diagnosis before he considered surgery. Surgical intervention with him and his entire team was exactly how they described and the outcome far exceeded my hopes. Dr. Hadley went above and beyond to help me get care from a specialist in a different modality when the pandemic made getting health services challenging. My affection and gratitude for what he has given to me and my family is profound.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "105100137209885998613", "name": "Joshua Carter", "time": 1613768584663, "rating": 5.0, "text": "World Class Care! Dr Hadley and his team gave me another chance at a pain free life. Truly a life changing experience. Dr Hadley, Ms Linda, and David Thank You!", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "106673247982329704761", "name": "Howard Bailey", "time": 1612979607772, "rating": 5.0, "text": "I went to Dr. Hadley after 2 surgeries in 2020 had left me in worse shape than I was before. The surgery that caused the real issue was a very sloppy fusion surgery that was performed, by an inferior surgeon, in July. When Dr. Hadley went in on November the 6th, he found 3 of the 6 screws either backing out or lose. He removed all of the existing hardware and did a fusion form L2 to S1. I feel better today than I did on any day of 2020. If you compare the post op CT scans of the first and second fusion, the first one looks like it was performed by a shop teacher whereas Dr. Hadley's work is perfectly symmetrical, the screw placement is exact with each one going in at the exact same angle and right in the middle if each vertebrae.\n\nAfter my first fusion left me in terrible pain that surgeon referred me out to a pain management clinic saying there was nothing more that could be done. I am so thankful that I cancelled that appointment and went looking for a referral to get a second opinion. I am not sure how I lucked into Dr. Haley's office but I am very grateful that I did. Because today I was released by Dr. Hadley with no further PT required. I am at work and capable of providing for and enjoying my family instead of numbed out on opiods for the rest of my life.\n\nThank you Dr. Hadley", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "102145729721769345772", "name": "beth sisco", "time": 1602694194024, "rating": 5.0, "text": "After going to the doctor thinking I had a simple pinched nerve, and finding out I had a severely herniated disc that had obviously been there for quite some time. The orthopedic i saw wanted me in surgery immediately and put me in bedrest until such time that I could have surgery. He also hinted that I may be facing multiple back surgeries. Knowing the complexity of back surgery I chose to seek a second opinion by a neurosurgeon. After several days of research I decided to see Dr. Hadley. At our first meeting he was very caring and explained the severity of my herniation. He calmed our worries that I would need multiple surgeries. He ordered a few tests to determine the severity of the damage done by the herniation and we scheduled surgery. His office worked extensively with us and the Red Cross to get our son home to help me after my surgery, and they have asked each time they have seen me about my son.\n\nThe surgery process was as painless as possible, and the fact that I saw Dr. Hadley on Saturday morning in the hospital before I went home warmed my heart. I can honestly say that Dr. Hadley is one of the few doctors that I have had the pleasure of being a patient of. He has truly been a blessing to my family, and two and a half weeks after surgery I can happily say that I feel great, have started going back to work, and feel like I have a new lease on life. I can't thank him and his staff enough for the care they have given me, and look forward to him being able to help those that I love.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "103119875506126833157", "name": "Doyn Epperson", "time": 1614800386914, "rating": 5.0, "text": "The first time I meet Doctor Hadely he said he reviewed my MRI’s that were sent and said your here because God brought us together. God knew you needed help and God has gifted/given me the ability to help people with your type back problems.  Then he explained in detail what needed to be done. I had the surgery on L1; L2; L3 & 4 vertebrate -8 screws and 2 rods. It’s been 3 months now and I feel great. No pain in my legs feeling back in my feet and no pain in my lower back. God Bless and Keep watch over Doctor Hadley.  Almost forgot to mention he prayes for God Guidance before surgery to help the patient he operates on. Thank God for bringing Doctor Hadley and me together.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "113309207150973572994", "name": "Kelli Peek", "time": 1602284116723, "rating": 5.0, "text": "I was referred to Dr. Hadley by a neurologist.  She had me thinking that I was about to undergo multiple back surgeries.  On my first visit, he took the time to review all of my images - one at a time. Although I had herniations, he explained thoroughly why surgery wasn't necessary at that time. I was also having some facial, arm, and hand numbness, tingling, and pain. After ruling out surgery wasn't necessary for my back at this time, he didn't stop trying to help me find answers for my pain. He referred me to other specialists at UAB and ordered other tests. He continues to help me find answers and shows compassion in every turn we take. I am so grateful to have found him and have more hope in the few months I've known him than I've had in over a year!", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "111335529648819992278", "name": "Wallace Hannon", "time": 1603125259631, "rating": 5.0, "text": "I had 3 fusions in lower back two years ago. I was having unbearable pain and usually not able to walk. Now I have pain on the average of 2.5 months and I know what helps and why I have the flare ups. Other specialists had agreed to 'keep me comfortable. I do have some of my life back and owe Dr, Hadley,\nThank you bless you. I'm 75 now and getting around with caution.\nHe is the BEST.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "117780069423103614042", "name": "Roger Moore", "time": 1610044838340, "rating": 5.0, "text": "Amazing Surgeon, Linda and David are amazing also, he took it personal to see my well being and what was best for me. Highly recommend him and his staff.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "111405228489220373958", "name": "Linda Evans", "time": 1613849162884, "rating": 5.0, "text": "Dr. Hadley, and staff were a life saver for me. They solved my issues that I had been suffering from for several years. I would highly recommend Dr Hadley, and his staff at Kirkland Clinic (UAB of Alabama) to anyone.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "101934866144057378917", "name": "David Brown", "time": 1602032275830, "rating": 5.0, "text": "From my initial visit to the post surgical visit, the professionalism, confidence, and caring bedside manner to me and my family from Dr. Hadley went beyond any of my expectations.  Dr. Hadley and his team diagnosed my issue, and had me try other non-surgical options before ultimately recommending surgery to address my back/leg pain.  The procedure was discussed, and every question or concern I had was addressed in the consultation before surgery.  It made the decision to move forward with the procedure an easy one.  I am now 5 weeks out of surgery, and have not had leg pain since prior to surgery.  I could not have asked for better results.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "112419550903428265331", "name": "Nancy Jordan", "time": 1603218173911, "rating": 5.0, "text": "I am so thankful to have been under Dr. Hadley's care as my neorosurgeon.  I had been enduring pain from my hip to my ankle for a long time.  I was told he was the best and through my experience from pre-testing and consultation through surgery and followup care - I believe that 110%.  I could not have asked for a better surgeon.  He is frank and a straight shooter, but he cares about his patients and is simply laser focused on your health and outcome as his patient.  A Godly man who is devoted to his patients and gifted with a staff of doctors who guide you through giving you absolute confidence.  I am forever grateful and made a friend for life in Dr. Hadley.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "115188700750402038021", "name": "J B", "time": 1605740797913, "rating": 5.0, "text": "Dr. Hadley has performed surgery on both my husband and myself, more recently on myself.  I went from debilitating pain to pain free immediately after surgery.  Dr. Hadley is the BEST!!!  November 2020", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "117039015308745222194", "name": "John Smyth", "time": 1605796037685, "rating": 5.0, "text": "Wife had back surgery. Great results. Wonderful staff. Pleasant to work with.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "116693239337071553979", "name": "Barbie Knopp", "time": 1603909165495, "rating": 5.0, "text": "Absolutely a great experience. From first visit, to surgery and everything in between. Can not thank Dr. Hadley,  Dr. David and the rest of their staff enough.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "108543886251355301433", "name": "Janice Carnes", "time": 1576777920421, "rating": 5.0, "text": "For the past two years being a patient of Dr. Hadley I have received great medical care.  I have established a phenomenal rapport with Dr. Hadley and the entire staff before and after my recent medical procedure. I can’t express how consoling and reassuring Dr. Hadley made me feel. His explanation simplified the process and technique.  He responded to all my inquiries and concerns. Dr. Hadley went over and beyond the day of my medical procedure, he led prayer with my family and I. He even made a special effort visiting me during my hospital recovery period, each day including Sunday before he went to church. At whatever point I contacted his office with an inquiry regarding my procedure and medication my calls were answered promptly from Dr. Aldrich & Dr. Linda.\n\nMy genuine appreciation to Dr. Hadley and his staff\n\nJanice Carnes\nMontgomery, Alabama", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "100335000300221545378", "name": "Allen McCain", "time": 1603725311992, "rating": 5.0, "text": "Terrific experience and 100% surgical success. Great staff.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "103397996412527458172", "name": "Tiny Dancer", "time": 1564008711647, "rating": 5.0, "text": "I have had several spine surgeries, by well- known, even famous, Neurosurgeons. Dr. Hadley trumped them all in proficiency, professionalism, thoroughness, and caring. Everyone on his staff was wonderful.\nMost importantly, my results were amazing! No matter the bedside manner, accolades and degrees a doctor has, the bottom line is results. My results were not only better than expected, my surgery fixed more than it was intended to.\nI am forever grateful🙏🏻.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "115636700408477025704", "name": "Tori Waters", "time": 1575480368511, "rating": 5.0, "text": "I could not have asked for a better surgeon, better surgical team, or better care overall than was provided by Dr. Hadley & his team.  His skill is remarkable. I had complete confidence in his abilities, & he was so well regarded & highly recommended by everyone I talked to.  In addition to his surgical expertise, I wish I could put into words how kind, thorough, patient, encouraging, & responsive they were. It meant the world to me, & I pray blessings on each of them.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "114247390789165230044", "name": "Greg Raymond", "time": 1566311064719, "rating": 5.0, "text": "If we could give Dr. Mark Hadley more than five stars we would do so without reservation. Dr. Hadley's exemplary surgical skill restored my husband's quality of life and physical strength. His knowledge and expertise have allowed my husband to once again sleep through the night and be free from the considerable and constant pain he'd been in. The complicated and healing surgery he performed without any complications, the kindness he's showed us, and the truly heartfelt care that Dr. Hadley has provided are gifts we can only repay with our deepest gratitude and highest respect. Dr. Hadley always focused on us, listened to our concerns, explained results and films, and answered questions. Showing the highest level of respect for the health and well-being of his patients, Dr. Hadley will \"tell it like it is\" and advise the best options. My husband has been under Dr. Hadley's care for several years and in that time, he's received the finest and most respectful care, not just from Dr. Hadley, but his entire team, including David Aldrich, PA-C and Linda Davis, CRNP. During surgery, my husband was in the finest of hands. It is difficult to find the words to express how thankful and grateful we are for Dr. Hadley, his life-changing surgical talents, and his team who work tirelessly to help patients.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "105851429705827882889", "name": "Jeff Andrews", "time": 1580776854309, "rating": 5.0, "text": "What a wonderful doctor he is gave me hope of living a normal life after a different surgeon at a different hospital messed me up. Dr. Hadley got me straightened out I’m 12 weeks post operation and doing and feeling great better than I have had n a long time. This time last year I thought I was going to be in bad bad shape the rest of my life. So thank you doc. And your staff", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "101676631712568639677", "name": "Ed Nahass", "time": 1591634494884, "rating": 5.0, "text": "I’m so glad I chose Dr Hadley to do my surgery . Very professional and caring.It’s been 7 months since my surgery and I’m feeling great. He has a great staff in Linda and Dave. Thanks again Dr. Hadley", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "110963929215913779635", "name": "Anna Reach", "time": 1583333003716, "rating": 5.0, "text": "I cannot say enough about the excellent care I received from Dr. Hadley and his team at The Kirklin Clinic.  Dr. Hadley personally called me to schedule my surgery, which I so desperately needed. My life had become fairly miserable because of severe back pain and just two weeks later, I am driving again, I can walk upright, and I can finally get back to work - all because of Dr. Hadley, Dr. Aldrich and all of the other doctors and nurses who cared for me at UAB.  I should also mention that Dr. Hadley operated on me 12 years ago, and I knew he was the only doctor I wanted to see this time as well.  Thank you, Dr. Hadley!!  You truly are the very best.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "109994393398788559393", "name": "Rick Owens", "time": 1594661865441, "rating": 5.0, "text": "Dr. Hadley and his staff are great. I feel as though I couldn't have been in better hands. Anterior cervical discectomy at C3-C4.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "115695950079014783364", "name": "Jennifer Morris", "time": 1575167608169, "rating": 5.0, "text": "I can’t say enough positive things about Dr. Hadley and his entire staff. I know without a doubt God led me to him. He and his staff genuinely care about their patients. His PA, David, is just amazing and his NP, Linda, is wonderful. I knew I was in the best hands and I know if I have further problems Dr. Hadley will take care of me!", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "114902775190528003470", "name": "Jim Hill", "time": 1579804036921, "rating": 5.0, "text": "Dr. Hadley has preformed back surgery on both my wife and me. The outcomes both of us have experienced is nothing short of miraculous. His skill and concern for our well being and recovery is truly remarkable. I was experiencing excruciating pain prior to my operation and now it’s gone. I wouldn’t wish back fusion on anyone but if you must have it Dr. Hadley is the one you want to do it.\nJim Hill", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "100555078481099962938", "name": "Carol Keeton", "time": 1583500382335, "rating": 5.0, "text": "We have been blessed to have Dr Hadley and his staff take care of my family Dr. Hadley, David and Linda have always treated us like family. His skills as a surgeon and professional care giver are the best you will find anywhere ! We are greatful for all they do and blessed to call them friends!", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "113370419364803207964", "name": "Shay Sutton", "time": 1515530107630, "rating": 5.0, "text": "Dr. Hadley is an amazing surgeon. I had spinal fusion/decompression in Dec 2017. It is just a month after surgery and I already feel better and stronger than I have in years. He is an excellent doctor and person. He seems very caring. He took time to answer any questions and made me feel at ease even right before going into surgery.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "117613981174721281542", "name": "David Riley", "time": 1546593671039, "rating": 5.0, "text": "I had 9 spinal fusion surgeries and 12 years of Morphine. I met Mark while he was volunteering at the Birmingham VA. After a lot of diagnostics, Mark said he could help me. He absolutely did. I haven't felt better in 12 years. Most importantly, I am off morphine and all opiates. Mark is the best I've seen", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "107424602795204375950", "name": "Vulcan oz", "time": 1569292207163, "rating": 5.0, "text": "The Doctor is simply the best Surgeon but beyond that he is a very good person. He was honest and also very supportive from the beginning to the end. He operated for Herniated Disk L5S1 surgery on me. I do not wake up with back pain anymore. My back pain is gone and physically I am improving every day. Doc's staff was very helpful and always tried to help me with any questions and concerns I had. Even to this day, I can call them and they will get back to me as soon as possible to make sure everything is going OK.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "100177874905802845311", "name": "Curtis Loew", "time": 1542849528795, "rating": 5.0, "text": "Dr Hadley shoots straight with you, but he also treats his patients the way he would want to be treated - including giving his patients contact info and returning calls in person when possible, which he did for me. AMAZING! It is so refreshing to have such a skilled physician also be so grounded and personable and be just as sure to address my wife's questions as he was mine. I went to sleep with weakness in all 4 limbs, and had an immediate improvement in strength even in recovery! Thank you, Dr Hadley - I hope I don't need your services again, but if anyone I know faces similar problems, I'm sending them your way!", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "113753631497054317017", "name": "Garrett Shaver", "time": 1576021384585, "rating": 5.0, "text": "Dr. Hadley and his team are truly exceptional. I was very nervous about the prospect of having spine surgery and after meeting him I was confident I was in the right place. My surgery was a complete success and I could not be happier with the results.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "108583947440760159043", "name": "Giant Slayer", "time": 1536519115695, "rating": 5.0, "text": "I knew from the moment Dr. Hadley entered the room that I was going to be in good hands. Never have I had a doctor take the time to truly sit and explain my condition and to make sure I was comfortable with the decision to have surgery. I went into his office after 6 months of almost being crippled....and today, I know without a doubt that God used Dr. Hadley's hands and gift to heal my spine. I'm so thankful for his entire staff - they were kind, patient, thorough, and knowledgeable. I was given A+ care from the first office visit, to the day of my last check-up, and I/m certain Dr. Hadley will be there for me should I need any future spinal care.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "114723425070421443976", "name": "Katheryn Jennings", "time": 1524847791741, "rating": 5.0, "text": "I cannot begin to explain the impact that Dr. Hadley has made to my dad’s quality of life.  He effectively diagnosed his condition, did his surgery, and has been by our side during a difficult rehab phase.  We have depended on him and his team for guidance, advice, and support.  He is direct, honest and professional and demanding in regards to providing the best care possible.  If you want a physician to tell you what you would like to hear verses what you need to hear then he may not be your guy, however if you want effective and professional treatment I highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "109169664634419808562", "name": "Jody Collins", "time": 1557983505615, "rating": 5.0, "text": "Dr Hadley and his staff of caring professionals are dedicated to giving his patients the very best care . They are wonderful. I was constantly dropping things, numbness and tingling in my arms and legs. I’m now able to walk a straight line, carry things without dropping them . I’m actually enjoying my life again. His top nurse called me to make sure I was ok the next day after I was released. He and his staff get the highest stars I can give !! Thanks to them and their dedication to their patients I can live my life again. Thank you so much Dr Hadley.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "103107480751227248845", "name": "Frazier Farm&Ranch LLC.", "time": 1581879279795, "rating": 5.0, "text": "I first met Dr. Hadley in 2012. My family primary physician recommended Dr. Hadley that knew my complicated condition . I have C.I.D.P. ,I was diagnosed back in 2004, it was treated and came back 8 times in a 1 half year period. CIDP eats the coating off the nerves starting at the brain stem. Each time I would get treatment,  the coating would grow back, leave scar tissue. Getting back to my primary physician. Which is well known and one of the best. I had told him about my back pain for the last 5 years. I was on a lot of pain medication that I knew I couldn’t keep taking. So I asked him if he had a back surgery, who would he have perform it. He spoke with no hesitation. Dr. Mark Hadley is the only Dr. that will touch my back. He referred me to Dr. Hadley. Had to have a resent MRI taken. Sent it to Dr. Hadley. His staff contacted me promptly. Met Dr. Hadley soon after and was blown away by he’s professionalism and kindness. I never met another Dr. that showed me without a doubt how much he cared about my situation.I had spinal to-gnosis, I forgot to mention another neurosurgeon had told me 4 years prior. I needed fusion surgery because my vertebrates was out of line. That surgery would have wasted my time. Dr. Hadley trimmed out my spinal canal at L6 down into 5 that change my life. A 100 percent fix.                                                                                     This past year in 2019, I had to have a much more serious and complicated surgery. Disc slipped to one side sitting on my sciatic never. Had to have spinal wall built up on L5 and 4. Not to mention I was born with and extremely small spinal canal shaped like a triangle. Got my surgery in Dec. 3rd 2019. I wouldn’t let no other Dr. perform this surgery.God is working through Dr. Hadley’s hand in my opinion.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "113939254054818211981", "name": "Alberta Williams", "time": 1552670950477, "rating": 5.0, "text": "I was so GRATEFUL that I was referred to Dr. Mark Hadley. I have always been afraid of surgeries because of prior surgical mishaps!!! Upon our first meeting, i knew that Dr. Hadley was an exception to my prior preconceived notion. He is a very knowledgeable, competent, courteous and a Professional doctor. After examining me and reviewing my records. He ordered some additional tests of his own so that every \" t\" was crossed and every \"i\" was dotted to ensure that I would be given the best treatment. He performed an ACDF surgery on me and I couldn't be more GRATEFUL!!!! Such a God Sent man that I will forever cherish. I am referring him to everyone that I know who is having spinal and/or back issues!!\nAlberta Williams", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "103910307145393490580", "name": "Camille Whitman", "time": 1469645701677, "rating": 5.0, "text": "My husband had a three month wait to see Dr. Hadley, but it was well worth it. Dr. Hadley is extremely intelligent, compassionate, caring person and a truly outstanding doctor. He took the time to explain my husband's diagnosis and tell us his opinion of what was the best action to help him. Honestly, what a wonderful thing to have a doctor who actually cares about your well-being, and takes the time to explain his thinking. We count ourselves truly blessed to have Dr. Hadley as my husbands doctor.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "102028716496040785945", "name": "Lydell Williams", "time": 1505182367513, "rating": 5.0, "text": "God know he blessed me when he sent me to Dr. Hadley. I had a previous surgery a year before my surgery by Dr. Hadley. That was the worst year I had in my life!!!! The main thing that I love about Dr. Hadley is that he makes it known that he is a tool for God's work. He is also very straight forward and that is another trait of his that I love. My first surgeon didn't give me the feeling I got, when I was in his office. His staff, OMG, are the best staff I have seen in my 40 years. From the start until now, they have been so helpful and caring. To me, that is very rare. I want to thank Dr. Hadley and his entire staff, because without them I would be in major pain. Now I can sit straight up and watch Major Payne, instead of being in Major Pain!!! Thank you Dr. Hadley and your entire staff and may God continue to bless all of you.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "105036236949787407659", "name": "Kathryn Strickland", "time": 1559182753988, "rating": 5.0, "text": "This man saved me 100%. He won’t rush to surgery but he will do what needs to be done. I am more than a decade out from major surgery by Hadley, and able to function like a normal human again.  I went from being in on a cane or wheelchair at 20 years old, to rock climbing at 30. Best Dr. around by far!", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "109668868280244055303", "name": "Bill Wootten", "time": 1564423809593, "rating": 5.0, "text": "Dr. Hadley engaged in 8 hour surgery on my lower lumbar 2 1/2 months ago. It was a difficult procedure and I am so pleased and pain free now, I felt compelled to write this review.\nGod Bless this talented Physician.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "114291439503333060660", "name": "brandon givens", "time": 1548975721498, "rating": 5.0, "text": "I had been dealing with  L5 S1 problems since 2012. Was told to deal with it as long as possible because a fusion was my only option. I can honestly say had I known about Dr. Hadley and his skillset in 2012, I would have had my fusion surgery in 2012.  So in October 2018 I had my fusion surgery performed by Dr. Hadley. One of the best decisions I have made, he gave me my life back.  I couldn't remember what it was like to live without back pain and now I cant believe I waited so long.  Very Professional, Very Courteous, always had time to answer any question I had for him. I will recommend him to anyone with spinal problems.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "107102752702208921177", "name": "Augusta Hassinger", "time": 1507237181913, "rating": 5.0, "text": "My husband has had neck pain for 5 plus years. It completely altered his lifestyle.  Dr. Hadley gave him the first bit of hope that he could live pain free. My husband woke up from the surgery feeling a thousand times better.  The pain he was experiencing was gone. Dr. Hadley is very knowledgeable and takes the time to explain and answer any questions you may have. I highly recommend Dr. Hadley and his team. They are very professional and friendly.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "108532612460556220087", "name": "Christy Cofield", "time": 1520777856228, "rating": 5.0, "text": "He done a great job on my husband he was up walking around after they put him in his room. I know God was guide Dr. Hadley hands he is a great surgeon. Thanks for everything you done for my husband and God bless you", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "111139402285863752978", "name": "Justin Bearden", "time": 1501607316242, "rating": 5.0, "text": "Dr. Hadley provided the utmost care and information regarding my surgery.  Entering into the procedure I was well-informed and had confidence that the procedure would be performed by someone that not only knew what they were doing but also took pride in doing the best work.  I am very grateful to Dr. Hadley and his staff for making this as easy as possible.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "104012002627164928499", "name": "Erica Haupert", "time": 1498600263320, "rating": 5.0, "text": "Dr. Hadley is not only an amazing, wonderful man but is extremely skilled at what he does. I am grateful for my time with him and recovered perfectly from C4/5 fusion. I have sent numerous people to him and would highly recommend him to anyone needing his expertise!", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "107169679194870942597", "name": "Dudley Berry", "time": 1492440111577, "rating": 5.0, "text": "Dr. Hadley and his staff are the BEST Dr.'s I've ever experienced! Having a 4 level fusion is scary and being in severe pain is too. Dr. Hadley was so kind, reassuring, very thorough and calming. He was truly awesome! I am no stranger to back surgery and I can say, Hands down, I will never go anywhere else. DR. MARK HADLEY is my Dr. from here on out, and that is refreshing knowing that he truly cares about my situation.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "111753666356948880595", "name": "bryan pike", "time": 1524581430226, "rating": 5.0, "text": "Awesome experience, and I would recommend Dr. Hadley to anyone!  Great bedside manners and speaks to you like he's known you forever.  No after surgery issues for me. I'd go back to him for anything.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "109864408456190779614", "name": "Jonathan Eric Headley", "time": 1503076589319, "rating": 5.0, "text": "If you have to be cut on beg for the best. I used Doctor Hadley at UAB. He is a professor as well. Really knows what he is doing. Puts your care ahead of even his own plans. Cancelled a flight to go out of town because I needed the surgery then. I was told by I group in Montgomery that they didn't want to touch me because of how bad I was. So if they know they aren't the best go to the best. All of his staff are wonderful. If I could give him a 💯 stars I would.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "117414904150444006898", "name": "Vickie Pocius", "time": 1563294322926, "rating": 5.0, "text": "Dr Hadley is a great doctor.  Very caring, attentive, informative and so glad he said I didn't need surgery.  A great asset to UAB.  ❤", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "100903255412618709879", "name": "Gray Vanderbilt", "time": 1579727447069, "rating": 2.0, "text": "Arrogant narcissist with a staff that does care. He silenced me when I asked post surgery questions and didn’t believe me when I told him I was still in pain. His staff is good though. They try.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "112228537711125262657", "name": "Hyung Kim", "time": 1540825695342, "rating": 5.0, "text": "Dr. Hadley is an amazing doctor and a nice friend.  The first microdiscectomy was done in 2012 and it was like a miracle. I had suffered with L5S1 disc herniation for over 8 months, but when I wake up from the surgery, the pain was completely gone.  I have had no problem whatsoever for over 6 years, but I had recurrent L5S1 disc herniation 2 months ago. The second surgery was done 2 weeks ago and just like last time,  I am completely pain-free now and a happy camper again. I am so touched by his kindness, expertise, and his friendship.   I thank God for Dr. Hadley and I would like to recommend him to for anyone seeking sciatic pain relief and improving their quality of life.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "101400977243044476585", "name": "Teresa Mann", "time": 1466432669827, "rating": 5.0, "text": "Before finding Dr. Hadley, I was in constant pain.  I could only walk for exercise.  Six months after having an Anterior Cervical Disk Fusion, I am running 2 miles a day and walking 2 miles a day.  I am able to lift weights again and I have lost 25 pounds.  I am grateful to Dr. Hadley and his excellent team for giving me a life again.  Everyone I came into contact with from the first evaluation to the post op appointment was pleasant and professional.  I had to stay overnight at UAB and the service was first class.  It was truly the best experience I have ever had in a hospital setting.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "104771406681859952009", "name": "Bethwes Walker", "time": 1470766871720, "rating": 5.0, "text": "I would like to say how blessed I was to be treated by Dr. Hadley. He was always friendly and professional in taking care of me. Answered all my questions before and after surgery and made me feel at ease. My surgery was successful and I appreciate all he has done for me. I would recommend him to anyone who is having back problems to make an appointment with Dr. Hadley for an honest and professional opinion. If you do need surgery in my opinion you could not be in better hands.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "106561865987158222859", "name": "Patsy Norenberg", "time": 1537717051250, "rating": 5.0, "text": "My first visit with Dr, Hadley I must admit I found him a bit intimidating, however, his knowledge, skill, honesty and concern blew the feeling of intimidation away.  I knew I was seeing the best Doctor for my back problems.  The entire team at the UAB hospital, and Dr. Hadley's office staff were professional, kind and caring.  Well worth the drive from Pensacola to get the help I needed.  I would (and will) recommend Dr. Hadley to any friends or family.  Thank you so much Dr. Hadley.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "103247807420196852997", "name": "Kristina Livingston", "time": 1565890945897, "rating": 1.0, "text": "Apparently the stigma of a bias dr. Is true. Dr. Hadley refused to see me because my BMI was too high. Never even laid eyes on me. He went soley off of what a piece of paper said. Not the medical need of two herniated discs.\nI guess because your over weight due to lack of movement because your spinal fusion 2 years ago was a joke and your in more pain now than before the surgery Doesn't matter. But a Dr. Will help a healthy addict so they can receive more money to send them to a rehab, and treat you if you are skinny and pretty.\nGreat job doc. No worries you aren't alone. Apparently getting treatment outside of the U.S. maybe a better route.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "115481948851328178700", "name": "bobby patterson", "time": 1548472458091, "rating": 1.0, "text": "He was the most arrogant Dr. I have ever met. I was in so much neck and shoulder pain. He told me I needed to join a gym. Every time I tried to ask him a question, he told me if I'd be quiet, he'd answer my question. I have never felt so helpless and disgusted with a Dr visit. He told me the gym would make me feel better. He made me a return appointment. But he told he hoped i didn't come back. I will never recommend him to anyone. I went to Dr. Dorchak at Hughston Clinic. I had the best experience, and now I'm pain free.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "102009228453343197479", "name": "Billymichael Warren", "time": 1592481198173, "rating": 5.0, "text": "I had 4 previous surgeries on my neck C4 5 &6 after all of those I finally found Dr Hadley my pain was a 12 on a scale of 10 met with him my first impression of him,I felt like I had met general Patton so professional so confident I felt like hey this guy knows what the hell he is doing and thank the good lord he did felt like somebody was pulling my left arm off it took 2 surgeries  he fixed me eternally grateful", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "109242865156261800147", "name": "Lucienne Grimes-Gaa", "time": 1535059126984, "rating": 5.0, "text": "Dr. Hadley is wonderful!  My son had pain, numbness, and tingling for 20 months.  Post op, all symptoms were relieved.  Dr. Hadley is also an exceptionally kind physician and explained everything in detail.  Highly recommend him to anyone with neck problems.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "115425456302002136123", "name": "Debra Van Hoolandt", "time": 1560554040402, "rating": 5.0, "text": "After 30 years of being in pain , many unsuccessful visits with military and VA doctors my husband is nearly pain free. Thank you Dr. Hadley for giving him his life back and enable us to be active again. Dr. Hadley is a God send.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "112444589102310526789", "name": "Melissa Hilton", "time": 1493397758376, "rating": 5.0, "text": "Dr Hadley changed my life for the better.  I'd had several back surgeries, 4 to be exact with the last one less than a year before I saw him for the first time.   I'd been in pain management for many years and started to feel like I'd be living in pain for the rest of my life.  I was in tears the day that I had my consultation with Dr. Hadley and he was so kind and compassionate. He assured me that he could help me and he kept his word.  I'm three months post surgery, a 4 level lumbar fusion, and other than still being a little sore and tight I feel like I have my life back.  Dr. Hadley is amazing and I thank God for him everyday.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "113093598958600969183", "name": "Michael Gass", "time": 1498498003844, "rating": 5.0, "text": "Dr. Hadley did my neck surgery back in 2006. Selecting Dr. Hadley was one of the best decisions I made for my Cervical Spinal Fusion. He's one of the top surgeons in his specialty.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "117504440158993106084", "name": "Theresa Shackelford", "time": 1564506543615, "rating": 5.0, "text": "I was in even worse pain after another neurosurgeon operated on L3. I had almost given up hope as 3 different neurologists and an orthopedic surgeon looked at the same pictures and saw nothing. Dr. H saw the issue immediately. He worked me in for surgery the following week. I woke up, and felt better than I had in almost 2 years. He gave me back my legs!", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "107794152725046320231", "name": "Jenny Skipworth", "time": 1524686195018, "rating": 5.0, "text": "Dr Hadley is one of a kind! I had the most wonderful experience under his care... I had severe spinal stenosis with a L4L5 facet fracture. Dr Hadley diagnosed me my first visit with him and I had been struggling to get answers for months. He listened to me and talked with me ... he took time to know me . I was scheduled for surgery that day. He fixed me completely I have no pain.. I was dealing with severe pain everyday... he saved my life!", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "117561748448774230715", "name": "Brian Mrr", "time": 1476982865766, "rating": 5.0, "text": "I was under the care of spine specialist in Florida.  In 3 visits,  i never even met to actual doctor.  In my first visit to Dr Hadley not only did i meet him,  but i received the type of exceptional care i had only heard about.  He is a very courteous professional and also a good man.  The entire visit made me change my opinion of Healthcare.  Not to mention,  he personally called me the next day for follow up.  Impressive stuff.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "114052376890013874730", "name": "Megan Hovater", "time": 1502824390125, "rating": 5.0, "text": "Dr. Hadley performed surgery on my mother originally around 2002 for Spinal Stenosis.   My mother was losing the feeling in both of her legs due to the narrowing of her spinal canal and Dr Hadley was able to relieve her of the pain and numbness she was experiencing.  Recently in 2017,  I took my mother back to see Dr Hadley because she was having a tingling sensation that started in her hip and ran all the way down to the top of her foot.  She was in constant pain and was unable to sit still for extended periods of time.  She never went anywhere and was never able to enjoy life because of the chronic pain she was experiencing.  Dr Hadley looked at her x-rays and felt confident he could give her relief from her pain by doing a fusion on her lower back (L2-L5).  My mother is 67 years old so I was nervous about her going under anesthesia but Dr Hadley assured me he wouldn't do anything to my mother he wouldn't do on a loved one of his own.  My mother went in for surgery on July 14th and had two rods and three screws put into her lower lumbar region of her back.  In a matter of days, she had relief from the pain she had been experiencing for years!  Today, she is 4 weeks out from her surgery, an inch and a half taller, and she is doing wonderful!  Dr Mark Hadley and Dr David Aldridge were incredibly nice and we are eternally grateful to both of them for their kindness and help!  We are so thankful that Dr Hadley chose to use his God-given talents to help people, such as my mother, feel better and to be able to have an active lifestyle!  Thanks again Dr Hadley for all your hard work! God Bless you and your wonderful staff!", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "103954969597442658606", "name": "Kimo Tedtaotao", "time": 1538148750061, "rating": 5.0, "text": "A gifted surgeon and a man of Faith & Excellence.  He came highly recommended by my neurologist!!!  I’d driven 6 hours to meet Dr. Hadley & was so impressed by his knowledge, expertise, credentials & His love for God to help people improve their quality of life.  I had suffered with neck and back pain for three years because of a near fatal head on collision from a drunk diver.   My life has changed for the best as a result of the ACDF surgery he performed on me July of this year. There is no more pain to my neck and back, no headaches, no weakness in my extremities and the constant tingling & numbing sensations.  I thank God for Dr. Hadley and he has my highest recommendation for anyone  seeking neck & back pain relief and improving their quality of life.\n\nDr. Tedtaotao", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "100192111874833300231", "name": "Tom Chandler", "time": 1509722905381, "rating": 5.0, "text": "Dr. Hadley is caring, compassionate and the consummate professional. Highly skilled and sought after, waiting to be seen by him was the smartest medical decision I have ever made.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "103479315422571714104", "name": "Glenn Ford", "time": 1518048230721, "rating": 5.0, "text": "Dr. Hadley gives you individualized care, his time, and he is all about doing what is best for his patients. If your problems can be solved without surgery he is all about that. He is never in a rush, and he listens to what you have to say.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "103956366064220538822", "name": "J Schleigh", "time": 1534862891585, "rating": 1.0, "text": "I was referred to Dr. Hadley by the neurosurgeon I've used on my last 3 surgeries for \"a higher level of care.\" What a joke this turned out to be. The joke was on me however.\nDr. Hadley's staff was rude and uncaring when I called for a status on my appointment. The staff had all of my records to give Dr. Hadley for 3 weeks before giving them to him for review. I've been in constant, severe pain from a ruptured T12-L1 disc.\nI called his office again this morning, August 21 2018. The doctor, at this point, has had my records since July 24, 2018. I was told that, \"Dr. Hadley doesn't do that kind of back surgery anymore.\" I was dumbfounded. This guy is supposed to be one of the top 10 spine surgeons in America! Then I was told he had referred my case to a Dr. Okor on August 8, 2018! Really!?!? Two weeks ago!?! I never received a telephone call from his office to inform of his decision to NOT do my back surgery. His office hasn't even sent my records to Dr. Okor. Communications at this highly recommended surgeon's office is pathetic. The entire staff at Dr. Hadley's office is either inept and unqualified for their jobs or they just don't give a damn about people like me that are in constant, severe pain. If I could give a rating of 0, I would and they're not deserving of even a zero.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "104981302912784268282", "name": "Nathan", "time": 1483830486052, "rating": 5.0, "text": "After a motorcycle accident and being flown to UAB, I was told I would never walk again. Dr. Hadley performed my surgery and I'm thankful to say I'm not only walking but I am back working, performing normal activities with my family, and yes even riding again! Thank you Dr. Hadley for giving me back a normal life.", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "113840797244420416198", "name": "Wendy Sandusky", "time": 1568084657924, "rating": 5.0, "text": "This Dr helped my mother! He is truly a great Dr and surgeon!", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "111465046901047271934", "name": "Peter Donohue", "time": 1470174335758, "rating": 5.0, "text": "Dr Hadley performed surgery on my lower back over 20 years ago and I have not had a problem since. He really lived up to his billing even though he went to Stanford (LOL).", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "117688990328221607419", "name": "Lanny Ransum", "time": 1506959005102, "rating": 5.0, "text": "Dr. Hadley is a great surgeon. I recommend him highly!!!!", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "111797232375601624004", "name": "paula wilson", "time": 1523303720579, "rating": 5.0, "text": "Very informative!", "pics": null, "resp": null, "gmap_id": "0x88891bc067b4388b:0xa06b6aea95b7ab8"}
{"user_id": "102568930467312367853", "name": "Alice Walker", "time": 1623885397567, "rating": 5.0, "text": "Dr. Menendez is a very caring, compassionate, skilled neurosurgeon. He explained all the options I had. I had a very positive experience with scheduling and was able to get the surgery date that I needed. He answered all my questions in the post op appointment and his staff is also very kind an helpful. I highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "116367584481283552238", "name": "Debra Winter", "time": 1623876323604, "rating": 5.0, "text": "Dr. Menendez is very engaging and takes time to answer questions.  I highly recommend his services to anyone in need of a neurosurgeon. My entire experience has been very positive.", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "100116324727886776878", "name": "Harriet Gee", "time": 1618934442367, "rating": 5.0, "text": "Dr Menendez is probably the kindest, most compassionate man I've ever met.  He assured me he could help me.  He has a complete understanding of my conditions and spent time explaining them to me.  I am thrilled that I have found him.", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "102004480481708929954", "name": "Susan Dainard", "time": 1626622234829, "rating": 5.0, "text": "Dr. Menendez is very compassionate and takes the time to answer questions and explain what is going on with my situation (need for surgery, recovery time, what to expect post surgery etc)", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "100388340783678727337", "name": "Vickie Smith", "time": 1620858071417, "rating": 5.0, "text": "Dr. Menendez is kind and caring.  He is very intelligent.  He explains things very well.  He always listens to me and answers every question (and I usually have a list of them)!  Best surgeon ever!!!", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "104468611594199122449", "name": "Cheryl T", "time": 1623979850042, "rating": 5.0, "text": "Dr. Menendez is AWESOME! He successfully does what he says he will do! Praise God & Thank You Dr. Menendez, my leg is pain free!", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "100445422351803982224", "name": "Tammy Adams", "time": 1625589796897, "rating": 2.0, "text": "First visit seemed like he cared but at that time it wasn’t to the point of needing surgery for insurances to pay had to be at a certain level I guess 2nd visit needed surgery wasn’t interested but sent to a nerve doc in the same office as he that was a waste of time he did nothing but ask a few questions but I had my mRI and also the referral to get my t11 and L4and 5  fixed my T11 is pressing on spinal cord I am swollen all over as well but was told to lose 50 lbs and stop smoking and he might consider it but doubtful I’ve since spoken to my insurance they do cover no matter of the smoking that is the doctors preference so I’ve smoked for 46 yrs and do not see the relevance but I’m no doctor and the 50 lbs 25 of it is fluid from swelling but he didn’t want to help me period was treated very badly as if I was beneath his clientele pretty much didn’t want to even talk to me", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "110554110564592545752", "name": "Sidney Hamrick", "time": 1619194027081, "rating": 5.0, "text": "Prompt appointment.  I felt very comfortable with Dr. Menendez.  He spent enough time with me to explain my MRIs and answer my questions.  He presented my options, the pros and cons of the various options and the risks of the surgery.  I was happy with my interaction with Dr. Me ended.", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "102596648134897640313", "name": "Theresa Hull", "time": 1615567960083, "rating": 5.0, "text": "I highly recommend Dr Menendez and the entire staff at St Vincent’s. Everyone was absolutely wonderful. No long waits, excellent care and pleasant staff!", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "101623764431918953941", "name": "Dale Fixler", "time": 1627450480895, "rating": 5.0, "text": "I was impressed with Dr. Menendez he took time to explain and show me what was wrong with my back and how he could correct the problem.", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "109134393335049899958", "name": "Rosie Canterbury", "time": 1615507974626, "rating": 5.0, "text": "I am so thankful for Dr. Menendez. He takes the time to explain what’s going on with my back and always is so respectful. Dr.Menendez, thank you so very much for easing my back pain.", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "109913932346571069963", "name": "George Speake", "time": 1608039179508, "rating": 5.0, "text": "L4/L5 herniated disc surgery was perfect!  Sciatic nerve pain was gone immediately after surgery.  Dr. Menendez and all of the St. Vincent's Hospital staff were great!", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "114297756229244288263", "name": "James Haskins", "time": 1602115546241, "rating": 5.0, "text": "Dr. Menendez was extremely knowledgeable of my injury issues.  He had obviously studied my MRI pictures prior to my appointment.  He took all the time I needed to carefully explain what I was experiencing, all my options for treatment, and and the time to contemplate those options.  He never pressed me to rush into a surgical decision, but he explained the procedure in detail along with the risks and everything to expect during post-op recovery.  If I choose surgery, Dr. Menendez will be the surgeon.  I have much confidence in his care for my neurological needs.", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "107431579475808151959", "name": "Heather Fore-Jones", "time": 1612925070391, "rating": 1.0, "text": "I was very disappointed. I was not able to go back with my child. I was told to FaceTime him in the public waiting room, I ask for a private room or to be able to speak with the dr after his visit with my son. The answer was no. I went out into the hall hoping to have some privacy to FaceTime. The hallway was full, I went across the hall to another surgery waiting room that only had two people, so I thought this will work. As I sat down a nurse approach me asking what was I doing or who was I waiting on. As I explained to her and she said I could not stay over there for the FaceTime visit. I knew I would not have time to make it 7 floors down before the dr came in. I just sat down cried. By the time the dr visit was over I was so ready to leave from there office. During my wait I did see a father get to go back with his daughter that looked to be the same age as my son. I will be making an appointment with a different dr in hopes of a better way to speak with the dr. In private.", "pics": null, "resp": {"time": 1612973575909, "text": "We are terribly sorry that we did not meet your expectations.  We will review your experience and work to make changes if we are able to, while keeping the safety of the patients and staff our top priority.   Our staff work hard during the appointment process to ensure that we have informed the patient that we do not allow anyone back with the patient and we encourage the significant other to call into the room during the visit.  There are certain circumstances when a patient would need assistance and we respect this need and make adjustments for that appointment during the scheduling process.  This approval allows us to design how the clinic flows while there are additional people back in the exam room. Thank you for sharing your experience as we continually examine our Practice and make changes where need be in an effort to provide the best experience for every patient that our Physicians have the privilege of providing care.\n\nRespectfully,\nManagement"}, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "103664252762659180937", "name": "Larry Hagood", "time": 1614654365059, "rating": 5.0, "text": "The visit went well and so far satisfied with the results.", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "111492205911145099757", "name": "TRACY LOONEY", "time": 1620865571719, "rating": 5.0, "text": "Dr. Menendez It’s one of the best doctors I have. He has excellent bedside manner, he is very thorough with his questions. He does not hesitate to get to the root of the problem and formulate a plan. I will never go to another neurosurgeon but Dr. Menendez.", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "114938090287271005261", "name": "Edith McLemore", "time": 1596942655835, "rating": 5.0, "text": "This was my first time going to Dr. Menendez. Everyone in the Office was nice and friendly. Dr. Menendez had great bedside manners as we say and seemed to be genuinely concerned and interested in what is going on with me.", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "114786105018905881265", "name": "Cynthia Anderson", "time": 1597270253734, "rating": 5.0, "text": "Dr Mendez  is great he is very  Thorough  to find out what is going on with my back when no on else  did I went to two other doctors before I went to  Dr Mendez the other doctors said there was nothing  wrong  with my back but he knew thank you Dr Mendez", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "105754376684544865518", "name": "R Crocker", "time": 1597109866361, "rating": 5.0, "text": "I have had a prior surgery by Dr. Menendez. He has excellent clinical skills and bedside manner. I highly recommend Dr. Menendez!", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "105094951413305695810", "name": "Jaide Barnett", "time": 1576809144086, "rating": 5.0, "text": "Dr. Menendez is very good. He was kind and explained everything to my understanding.  He worked me in between surgeries, however he was not rushed with me at all. That entire  office is very good.", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "102881912583414008971", "name": "pam ferguson", "time": 1603884910443, "rating": 5.0, "text": "This is the best Dr you will ever have", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "110400487645046029158", "name": "lucille carpenter", "time": 1563461848349, "rating": 5.0, "text": "He actually said he could help me!  I am thrilled and so thankful to have hope!  I had been to 5 other neurologist and orthopedic doctor that said there was no help for my pain!!  11 days after surgery now-  NO PAIN!! I thank God for using Dr  Menendez!! And he is a Christian!!\n3 mos now- no pain. Can’t wait to get back on horse next spring!!! He is my hero!!!", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "104551555163442438774", "name": "Gloria Young", "time": 1558388225836, "rating": 5.0, "text": "Dr. Menendez is a great physician!! I had a Spinal Fusion done two months ago and the pain in my right leg and lower back is gone. He has a great bedside manner and was always willing to explain everything in detail to me and my family. He made sure I was comfortable after my surgery while I was in the hospital and after I went home. I would definitely use him again and would recommend him to my family and friends. Thank God for Dr Menendez!!!", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "103343249849346667991", "name": "Pamela Moseley", "time": 1536633359249, "rating": 5.0, "text": "Today was my initial consultation and the entire operation impressed me.  I was taken back AT my appointment time by the friendly staff.  I loved that I could check in online the day before. From the check/sign in desk to leaving, it was a very nice experience. Dr. Menendez took his time with me and answered all of my questions and concerns.  He made me feel important and never made me feel like he was rushed. He had a very professional and categorically awesome bedside manner.  Very refreshing to see this type of caring from this industry.", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "102319297265645895857", "name": "David Battles", "time": 1558194833614, "rating": 5.0, "text": "Dr. Menendez Is extremely patient, attentive, and takes time to do a through evaluation. If at all possible, he will approach every patient with the most conservative treatment methods first. So far we are still in the evaluation stage of a cervical issue and he has requested I have two more tests for better clarity. He is quite confident he will be able to provide relief from pain.", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "101647283254356067566", "name": "Christi Fulmer", "time": 1563795085212, "rating": 5.0, "text": "He performed my surgery on Friday, July 19, 2019. He did such an amazing job I was also suffering from not being able to put any weight on my right leg.\n\nRight after surgery and I was able to get awake. This is when I realized leg pain was completely gone.\n\nHe is a very conservative and very patient neurosurgeon. Which I fell in love with during my first consultation. He knew I needed the surgery but allowed me to go home that day, talk with family and he even mentioned pray about. This was amazing news.\n\nWhen his office called me back a week later since I didn’t call them back immediately.\n\nI explained that my family had younger children and I would just wait and the office staff was very nice with my choice and gave me all the information once I was ready to schedule the procedure.\n\nWell July 11, 2019 I could not put any weight on my right leg at all. I called his office that morning hoping to get an appointment. They had one very late appointment. We make it to the appointment and he reminds of all the issues with my back. Long story short here. I had to be admitted into the hospital that night to help get pain under control and observation because I couldn’t use my right leg.\n\nThey did an MRI again and realized my back had significant changes in less than a years time.\n\nSomeone from his staff came by throughout the weekend and extended hospital stay.\n\nWe tried another conservative procedure on Monday and it didn’t help.\n\nI still could not use my right leg or go up stairs during therapy Tuesday.\n\nWednesday we discuss surgery possibilities.\n\nTo say all of this he and his office staff went above and beyond trying to help me get some relief.\n\nHad I known how then that surgery would have been a success I would have scheduled the first day of my first appointment.\n\nI cannot say enough words to express what an amazing Neurosurgeon he is.\n\nThank you again for all you do for all your patients!", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "116693131945173001007", "name": "Dan Cody", "time": 1569431774117, "rating": 5.0, "text": "Excellent bedside manner, answered all my questions about current medical condition and what the next step would be if my condition continues to worsen. Took the time to explain the medical procedure I might have to undertake and the post op period that would follow. Very informative!", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "117532980332452210131", "name": "Jan Wheeler", "time": 1569264735518, "rating": 5.0, "text": "Dr. MENENDEZ is amazing.  Helped me immediately . Very compassionate and concerned.  He jumped right on the problem and had the pain stopped. Excellent in all areas. I  would and have highly recommended him. CAROL WHEELER", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "105623083701740770452", "name": "Patsy Honeycutt", "time": 1574427462562, "rating": 5.0, "text": "It was a excellent experience. Nice room, excellent nurses and excellent care with Dr. Menendez. We really like him.", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "115888774744698861973", "name": "Vicky Craft", "time": 1574872513792, "rating": 5.0, "text": "Very nice young man. Answered all my questions and did not feel rushed. I will definitely go back to see Dr. Menendez.", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "117354225316968150045", "name": "Janet Hasty", "time": 1531246068812, "rating": 5.0, "text": "He is a fabulous physician. Did my surgery in November 2017.   Excellent results.   I have worked with Doctors for the past 25 years and I have the utmost respect for this surgeon.    His knowledge, bedside manor care and genuine concern for his patient/results.   Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "107421437760015599852", "name": "Amber Sullivan", "time": 1547036058126, "rating": 5.0, "text": "Referred to him by my primary Dr Drew Smith and he is very knowledgeable and efficient. Never had surgery before and he covered every pro and con before I had to ask. He was very up front and honest with me which I like. I like to expect the worst and things turn out better than to expect the best and things turn out bad!", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "105960542283064368930", "name": "Dara G Conkle", "time": 1557923542748, "rating": 5.0, "text": "If you are having back problems, Dr. Menendez is the man you should see! He doesn’t waste any time with his plan to help you and he does not make you feel rushed. To our family, he is truly sincere and we know you would feel this way, also - when you visit him. Trussville & Birmingham locations make things more convenient for us.", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "110655427658046399638", "name": "David Dingler", "time": 1550106292812, "rating": 5.0, "text": "Dr. Menendez went above and beyond in my opinion by stepping in when Dr. Wilson had a family emergency. He sat down with saying he reviewed my notes and chart, He explained the procedure, recovery and rehab. Assured me that the surgery was something he has had a lot of success with and didn't forsee any problems but explained possible complications anyway. He was by far one of the best doctors I've had the opportunity to work on me. Thank you for everything, Dr. Menendez!", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "106465063685811994637", "name": "Ron Carlson", "time": 1559258973322, "rating": 5.0, "text": "Dr. Menendez operated on my back on March 5, I believe it was. I went from almost debilitating pain to almost pain free after surgery. I am 72 and feel like I am 55 now. I highly recommend Dr. Menendez for serious back conditions.", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "113377642695232671483", "name": "david knight", "time": 1597873902458, "rating": 5.0, "text": "Dr Menedez is awesome, taking the time to explain everything. Very thorough and professional.  Excellent surgeon. Have referred my family and friends to him as well.", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "106203698580281325804", "name": "Vicki Frey", "time": 1539137527122, "rating": 5.0, "text": "Dr.Menendez is a Great Doctor!  He performed ACDF surgery on my neck. It was a success.\nHe is a very caring doctor. He takes plenty of time to explain things to you.\nI highly recommend him!", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "110085549493101598151", "name": "R “Kelz” Kelz", "time": 1571747094651, "rating": 5.0, "text": "Dr Menendez did an awesome job on my lower back spinal fusion surgery. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "111046763163853882233", "name": "Bertie Noah", "time": 1563367015670, "rating": 5.0, "text": "The place was fine. Had to wait too long to see doctor. Appointment was 1:00 PM got in at 2:30 PM. Scheduling needs some work.", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "101651060929554127864", "name": "Teresa Alvarado", "time": 1562768222768, "rating": 5.0, "text": "He is knowledgeable and Experienced;  He wants the Best possible solution to your situation and  very informative & will answer All of your questions . A Very Well Balanced Doctor All The Way!!!😁", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "108830205783659819945", "name": "Sivi Jerigan", "time": 1537234641064, "rating": 5.0, "text": "Today was my initial  consult with Dr. Menedez. The staff was pleasant from initial contact. Meeting Dr. Menendez for the first time I was impressed. After carefully reviewing my images he entered the room by introducing himself. Sat with me showing me the images and what was taken place. He shared the procedures and stated it can be done ways. Very honest about the sucess rate in stating how the procedure will be beneficial in getting some relief. He answered all my questions without hesitating. I will recommend Dr. Menendez.", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "100253668230881055086", "name": "Chuck Segrest", "time": 1573520969144, "rating": 5.0, "text": "Great Doctor! Fast and easy check in! Spends time as needed and entire staff is great!!", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "117486311451748791987", "name": "Rodney DeVine", "time": 1571161539660, "rating": 5.0, "text": "Dr. Menendez was very very thorough. He explained everything to me that could be done to fix the problem. The only option was surgery.", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "106355272553017938744", "name": "William Williams", "time": 1574987009927, "rating": 5.0, "text": "Very knowledgeable, easy to talk to, listens to you.  Very pleasant and great bedside manner.", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "112782400523231266443", "name": "Redshoes51", "time": 1569543329404, "rating": 5.0, "text": "Dr, Menendez is an outstanding physician ... I just regret that I didn't find him earlier... I wish that I had used Dr. Menendez and other St. Vincent's'  doctors  earlier in my medical crisis...", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "112749462802863727282", "name": "Re Ad", "time": 1563919374905, "rating": 5.0, "text": "Great interaction with my Mom.  Appreciate his communication style - very matter of fact!", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "112867424506913737799", "name": "rodney brakefield", "time": 1544495330846, "rating": 5.0, "text": "Dr. Menendez is an Amazing doctor.  Surgery was successful Very Happy with him.  He got my life back.", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "106228657791164055763", "name": "Rose GR Greene", "time": 1568817320689, "rating": 5.0, "text": "Very good doctor. Very thorough and detailed. Shows concern for his patients.", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "113109154105259785925", "name": "Brian Simmons", "time": 1582585063422, "rating": 5.0, "text": "Always straight forward and explains when you have questions.", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "100364705324620098359", "name": "Sharon Denoms", "time": 1555510367947, "rating": 5.0, "text": "Very direct and informative. Asks and answers questions without any confusion or doubt.", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "101139865852172943113", "name": "Connie Lepper", "time": 1570769235740, "rating": 5.0, "text": "Very professional and through! Great Dr and great experience.", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "117655109563426128254", "name": "R Kala", "time": 1562974687806, "rating": 5.0, "text": "Thank you Dr. Menendez for taking the time to explain things in detail.  Office staff, is as well, kind and courteous.", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "102168525340106301460", "name": "Marsha Campbell", "time": 1543588706861, "rating": 5.0, "text": "He is a very good surgeon. He also has bed side manners that Doctors could learn from!", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "103165485993508164144", "name": "Gary S.", "time": 1546537191966, "rating": 5.0, "text": "My first meeting with Dr. Joshua Menendez today was very positive.  He's friendly, knowledgeable, honest about the risks involved with my upcoming surgery, yet very reassuring.  I left feeling that I'm in good hands with him -- something that I needed desperately.\n\nUPDATE:  Thanks to Dr. Menendez, my spine surgery was a breeze, and, with the help of appropriate pain meds, so was my recovery period.  In three weeks' time, I was off the pain meds altogether and back to normal.  The two months leading up to my surgery, however, were pure hell.  I couldn't stand up long enough to brush my teeth and shave without the pain bringing me to my knees -- nearly in tears.  The first chiropractor I visited was treating me for Coccydynia -- a tailbone ailment.  When my PCP finally intervened, he ordered an MRI which revealed that I had a benign cyst growing on my lower spine -- just above my tailbone.  My PCP immediately referred me to Dr. Menendez at St. Vincent's (Birmingham) who, as far as I'm concerned, is a miracle worker.  Needless to say, the rest was history.  Dr. Menendez and the entire staff on all three shifts were SO NICE to me.  I hated to leave.  And, boy, the food at St. Vincent's (Birminham) is absolutely delish -- restaurant quality, in fact.  The morning of my discharge, they were serving Baked Ziti.  Because of the unusually large number of discharges that day, my nurse suggested that I order lunch just to be safe.  I was thrilled for the chance to experience one more of their amazing meals!  Imagine my disappointment when the nurse came to me that morning and told me I would be discharged at 11:00!  My heart sank!  As the hospital employee wheeled me outside to meet my ride home, the smell of fresh Baked Ziti filled the hospital corridors as they were delivering it to each lucky recipient.  I wanted to stay!", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "101199296796450843777", "name": "Lynn Myrick", "time": 1547729816880, "rating": 5.0, "text": "Wouldn’t go anywhere else.   Changed my life!", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "110761203334275741323", "name": "Mark Duncan", "time": 1569352387697, "rating": 5.0, "text": "Excellent communication about my upcoming procedures.", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "117205365101384032572", "name": "Norma Lilly", "time": 1564707577364, "rating": 5.0, "text": "Dr. Menendez was very kind and apologized for keeping me waiting.  He told me straight what I could expect from having or not having surgery on my neck. He pulled no punches and gave it to me as he saw it.", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "107286825353517827919", "name": "Stephanie Horton", "time": 1568242162961, "rating": 5.0, "text": "Great bedside manner and caring communication.", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "117176976256106558031", "name": "jose zavaleta", "time": 1565801954113, "rating": 5.0, "text": "excellent and very happy with my surgery", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "103208584054419928765", "name": "Annette Smith", "time": 1548380856412, "rating": 5.0, "text": "I have only seen Dr. Menendez once, in his office but he is very kind and professional.", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "113830714027386679317", "name": "Pam Everidge", "time": 1538513813844, "rating": 5.0, "text": "Would highly recommend Dr. Menendez", "pics": null, "resp": null, "gmap_id": "0x88891bc82c6f852b:0x1aeab62b48f8cf51"}
{"user_id": "113379152690100211507", "name": "Lisa Smith", "time": 1627665652086, "rating": 4.0, "text": "Staff was very friendly and they did not keep me waiting. Dr. Bruce was very personable and described the process briefly. The visit was too quick for me to ask more questions and I tried to get additional info from the nurse.", "pics": null, "resp": null, "gmap_id": "0x88928d9845aaaaab:0xae3656317a499365"}
{"user_id": "115396206807812024013", "name": "Kim Goodson", "time": 1626481497656, "rating": 5.0, "text": "My back went out in Aug 2020. Never experienced as much pain as I did at that time. I thought I was ruined. Dr. Woodham performed surgery on me. Went back to work in 4 months. He and his staff have been tremendous in their compassion, service, and words of encouragement. I didn’t have to go outside of my area to get the best care offered.", "pics": null, "resp": null, "gmap_id": "0x88928d9845aaaaab:0xae3656317a499365"}
{"user_id": "112250910685727792584", "name": "roger deese", "time": 1624469664507, "rating": 5.0, "text": "Dr Woodham is a very good doctor. I have been a patient for a long time. I trust him completely.  Everyone was nice any professional.", "pics": null, "resp": null, "gmap_id": "0x88928d9845aaaaab:0xae3656317a499365"}
{"user_id": "102631482647450171630", "name": "Gayle Marcos", "time": 1622828604453, "rating": 5.0, "text": "Love Dr Woodham...he's always been kind and patient with me. I feel that without him I wouldn't be here today because of  pain in my whole spine. Wish there were more like him.", "pics": null, "resp": null, "gmap_id": "0x88928d9845aaaaab:0xae3656317a499365"}
{"user_id": "113902404706435508299", "name": "Hunter Lafayette Farish", "time": 1619185095324, "rating": 5.0, "text": "Thank you Doctor Woodham for taking your time evaluating my condition.  Your expertise has given me hope and understanding that I can have a near normal life.  So many other doctors wanted to operate on my back,  but you were able to see that operating could have put me back in a wheelchair.  I highly respect and recommend you to everyone I know and meet. May the good lord bless you and yours always.\n\nSincerely...\n\nCharles Farish", "pics": null, "resp": null, "gmap_id": "0x88928d9845aaaaab:0xae3656317a499365"}
{"user_id": "104468118233441883362", "name": "Mary McCord", "time": 1621617922754, "rating": 5.0, "text": "Dr. Bruce Woodham rendered me excellent care when I was diagnosed with a brain tumor.  Very professional, caring and great bedside/office manners.   Thank You", "pics": null, "resp": null, "gmap_id": "0x88928d9845aaaaab:0xae3656317a499365"}
{"user_id": "114524679451988884596", "name": "Norma Riley", "time": 1617394205495, "rating": 5.0, "text": "Have never had a long wait. The staff is very nice and I love Doctor Woodham. He is also very nice and caring. Can be funny, has a wonderful sense of humor.", "pics": null, "resp": null, "gmap_id": "0x88928d9845aaaaab:0xae3656317a499365"}
{"user_id": "101275545464011128879", "name": "Tres Christmas", "time": 1617990109970, "rating": 5.0, "text": "I can’t say enough good things about this office.... the staff was super helpful and  Dr. Woodham was kind and very informative.  Definitely recommend!", "pics": null, "resp": null, "gmap_id": "0x88928d9845aaaaab:0xae3656317a499365"}
{"user_id": "102003689782090623215", "name": "Bessie Coach", "time": 1623261777976, "rating": 2.0, "text": "He didn't spend 5 minutes in the room with me. I wasn't very satisfied. I have neck problems and lower back as well he did order a MRI. of my neck.", "pics": null, "resp": {"time": 1623270817683, "text": "Thank you for making us aware of this experience. We will forward your comments to our office administrator so she can look into this. If you would like to reach her directly, please call (334) 944-7073. You may also send any additional feedback to marketing@flowershospital.com, and we will pass it along to the appropriate member of our leadership team."}, "gmap_id": "0x88928d9845aaaaab:0xae3656317a499365"}
{"user_id": "104522755184070702675", "name": "Ana G. RODRIGUEZ", "time": 1622050691859, "rating": 5.0, "text": "Very professional and exceptional service.", "pics": null, "resp": null, "gmap_id": "0x88928d9845aaaaab:0xae3656317a499365"}
{"user_id": "105279773171791675460", "name": "Susan Hutcheson", "time": 1598454952474, "rating": 5.0, "text": "Dr. Bruce woodham is very knowledgeable, he is a fantastic neurosurgeon and I would highly recommend him as I used him for surgery.", "pics": null, "resp": null, "gmap_id": "0x88928d9845aaaaab:0xae3656317a499365"}
{"user_id": "102864136848058704225", "name": "Michael Hipwell", "time": 1549284679799, "rating": 5.0, "text": "Dr. Woodham was very professional. He spent more than enough time with me, my first visit, explaining all my options pertaining to my back.\nI did not feel rushed. He answered every question I had, in full detail. Outstanding Doctor.", "pics": null, "resp": null, "gmap_id": "0x88928d9845aaaaab:0xae3656317a499365"}
{"user_id": "108943791565609805980", "name": "Ed Updegraff", "time": 1561988097101, "rating": 5.0, "text": "awesome doctor! and very professional.", "pics": null, "resp": null, "gmap_id": "0x88928d9845aaaaab:0xae3656317a499365"}
{"user_id": "113091091967378835863", "name": "C W", "time": 1539986128537, "rating": 1.0, "text": "Very very rude", "pics": null, "resp": null, "gmap_id": "0x88928d9845aaaaab:0xae3656317a499365"}
{"user_id": "108167304820557078990", "name": "Robyn Brown", "time": 1625160187433, "rating": 5.0, "text": "Dr Hrynkiw is very knowledgeable, very professional and very caring in his field of practice.  He is willing and able to assist his patients in any way necessary.  His chosen staff are second to none in knowledge of job details and friendliness.  I would highly recommend this physician to anyone, family or friends.   Thank you for what you guys do!  I am forever grateful.", "pics": null, "resp": {"time": 1625235566044, "text": "Thank you for your kind words and this wonderful review! Our staff strive to provide the best care and experiences. Thank you for your comment!"}, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "117905570428142348601", "name": "Donna Hughes", "time": 1626461993413, "rating": 5.0, "text": "Dr. Hrynkiw is a excellent Dr.  He listened to me and my concerns and ordered another test to try to find out why my head and neck hurts so much.   His staff is also excellent.   Very nice and compassionate.   I would recommend him to anyone looking for a neurosurgeon.", "pics": null, "resp": {"time": 1626463993439, "text": "Our staff strive to provide the best care and experiences. Your recommendation means so much to us.  Thank you for taking the time to share your comment. Have a great day!"}, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "110252959416450553362", "name": "Harriett Cooper", "time": 1626517375850, "rating": 5.0, "text": "I met Dr. Hrynkiw on this past Monday . The experience was wonderful. He was very professional and a personality that was very pleasant. He made me feel comfortable while explaining things to me. He’s the best I give him 7 ⭐️ 💫 stars.", "pics": null, "resp": {"time": 1626707581825, "text": "We strive to provide great experiences. Thank you for your feedback!"}, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "118195794782628886763", "name": "Tony Jewah", "time": 1624038154924, "rating": 5.0, "text": "The appointment was very nice and professional visit. The staff is extremely nice. I only waited about 5 minutes for the Doctor once  I was in the room. The doctor explained his findings and gave me multiple options. he ask twice if I had questions and he answered all my questions.", "pics": null, "resp": {"time": 1624040079693, "text": "Thank you; we appreciate your feedback! Our staff strive to provide the best care and experiences. Thank you for your comments!"}, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "108516194347643135520", "name": "Nancy Lynn", "time": 1617815994552, "rating": 5.0, "text": "Though very busy with many patients, he calmly took however much time I needed asking questions, sharing similar back pain experiences with him, etc. I was pleased he didn't push the idea of surgery as my only option. He provided several options. I felt very comfortable with him and felt I trusted what he told me. Was very happy with my office experience.", "pics": null, "resp": {"time": 1617821297145, "text": "We strive to provide great experiences. Thank you for your feedback!"}, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "118410010867985991910", "name": "Louise “Weezie” Weldy", "time": 1619805706125, "rating": 5.0, "text": "I am honoured to have this great Surgen by my side. I feel inapt to even do this survey and find it a bit of a disgrace to rate him. His staff are wonderful they are so pleasent, knowledgeable and make you feel comfortable in bad circumstances. I noticed while waiting people had come far and wide over Alabama for their appointments that should speak volumes.", "pics": null, "resp": {"time": 1619808669369, "text": "Thank you for your kind words and this wonderful review! Our staff strive to provide the best care and experiences. Thank you again for your comments!"}, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "106903011619679387487", "name": "dusty parker", "time": 1626394201770, "rating": 4.0, "text": "Sorry I put the previous negative comments on the wrong Dr Office.   Dr Hrynkiw was very attentive to the issues and was very nice.", "pics": null, "resp": {"time": 1626206358951, "text": "We would like the opportunity to address your concerns. Please reach out to us directly at 205-971-3348 when you have a chance. Thank you, and we look forward to hearing from you."}, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "106304379976551514011", "name": "Wayne Carden", "time": 1617916368716, "rating": 5.0, "text": "Dr Hrynkiw and his staff were all super. He worked me in because of my issues and immediately started seeking to get me help. God bless you all!", "pics": null, "resp": {"time": 1617922523152, "text": "Our staff strive to provide the best care and experiences. Thank you for your comment!"}, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "105765522455137299079", "name": "Jessica Wade", "time": 1600815580916, "rating": 5.0, "text": "I haven’t even been yet and already feel better.\nUpdate:\nAs of 9/21/2020. Thank you so much to\nDr. Hrynkiw, his nurse Ashley, Tamika, and Kita (I apologize if misspelled Kita) and one more staff member who’s name I didn’t catch.\nSo helpful and caring. Breath of fresh air after years of not being heard and being treated very poorly. I am so thankful for them and finally feel like I have part of a “care team”", "pics": null, "resp": {"time": 1600287426010, "text": "We appreciate your positive review!"}, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "105172122997727236531", "name": "Ben Kirkland", "time": 1618795948232, "rating": 5.0, "text": "Great Dr. to see doesnt waste your time.", "pics": null, "resp": {"time": 1618806723263, "text": "Thank you; we appreciate your feedback!"}, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "109105567170431200858", "name": "Christie Grimes", "time": 1605107890139, "rating": 2.0, "text": "I was really hoping this appointment would answer a lot of questions with the constant headaches I'm having and neck problems. But basically Dr.Zenko just made me feel like why was I there!? He treated me poorly and I drove from 2 counties away to see the best so I can finally get answers. Very disappointed. My primary care referred me to him after finding something on my ct scan which since it was causing symptoms she informed me that this could be very serious. Dr. Zenko called for a mri but basically told me if it was nerve damage there's nothing he will do. I'm still in pain and without any answers. However I will say the staff there is excellent! The nurse and receptionist were wonderful!", "pics": null, "resp": {"time": 1605219077874, "text": "We appreciate you bringing this experience to our attention. If you are willing, please contact us at 205-971-3348 so we can work towards a resolution. We look forward to hearing from you."}, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "117293382227078881148", "name": "K McKenzie Greene", "time": 1610379174203, "rating": 5.0, "text": "Dr. Zenko is a fair, ethical, and knowledgeable neurosurgeon. I was under his care for some time and he saved my life and was somewhat compassionate about it, in comparison to other neurosurgery practices ive experienced.", "pics": null, "resp": {"time": 1610395430955, "text": "Thank you; we appreciate your feedback!"}, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "107092208653997069232", "name": "Wanda Monti", "time": 1606493125521, "rating": 5.0, "text": "He is wonderful and very friendly and knows what he is doing. I have been a patient for years and I highly recommend him to anyone", "pics": null, "resp": {"time": 1606746798883, "text": "Thank you for your kind words and this wonderful review!"}, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "108409408861929082504", "name": "Louie Wright", "time": 1619033736135, "rating": 5.0, "text": "Great appointment was on timeDoctor was very informative", "pics": null, "resp": {"time": 1619060233184, "text": "Thank you; we appreciate your feedback!"}, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "108075814649794429342", "name": "Pat Conway", "time": 1605301615181, "rating": 5.0, "text": "We have been very pleased with Dr. Hrynkiw. He is very professional and and caring.", "pics": null, "resp": {"time": 1605536722969, "text": "Thank you for your kind words and this wonderful review!"}, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "104198370996656819289", "name": "Amy Lee", "time": 1593018601348, "rating": 5.0, "text": "Office staff was very accommodating & pleasant. Wait time was minimal. Dr. Hrynkiw was honest & while didn't give me any answers yet, he did order some tests. Hoping he can solve my neck problems!", "pics": null, "resp": {"time": 1593032897743, "text": "Thanks for your praise and kind comments about our team. Our staff strives to provide the best care and experiences. Again, thank you for your feedback."}, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "112844935601231185485", "name": "Marion Frey", "time": 1616166721166, "rating": 5.0, "text": "Everyone was polite, prompt and informative.", "pics": null, "resp": {"time": 1616196817369, "text": "Our staff strive to provide the best care and experiences. Thank you for your comment!"}, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "117971989814554672712", "name": "Heidi Gulino", "time": 1614021691550, "rating": 5.0, "text": "Medicare will not approve the MRI. What is my next step.", "pics": null, "resp": {"time": 1614023997491, "text": "We would like the opportunity to address your concern. Please reach out to us directly at 205-971-3348  when you have a chance."}, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "118334131460644646586", "name": "K Kugler", "time": 1579723649488, "rating": 5.0, "text": "Dr. Hrynkiw likes early appointments!   We had 7:30 appt.  walked in and there were lots of people waiting.  They asked us to be there at 7:15.   By 7:30 we were in a room and by 8:00 we were done.  He was very nice and went through everything in detail.   Patient could not hear well.  He made sure they could read his lips and understood what he was saying.  Staff was very friendly and helpful.", "pics": null, "resp": {"time": 1579727912441, "text": "K Kugler, thanks for your praise and kind comments about our team. We always strive to provide top quality service and are pleased that your experience  was a good one! Thank you again for taking the time to let us know how we did. We hope you have a great day!"}, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "113928180973454526152", "name": "Derald Montgomery", "time": 1578606146498, "rating": 5.0, "text": "Dr. Hrynkiw did surgery on me in 2001.\nHe was very kind to me and was very helpful when I had an insurance issue.\nHe made sure that my health came first. You don't always find that they true in the medical field.", "pics": null, "resp": {"time": 1578610699046, "text": "Derald Montgomery, thank you for your kind words and this wonderful review!"}, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "107166921731060871648", "name": "Mickey Pritchett", "time": 1582222048968, "rating": 5.0, "text": "Had a great experience on my 1st visit. Dr Hrynkiw & his staff were great. Very thorough & straight to the point.", "pics": null, "resp": {"time": 1582226433872, "text": "Mickey Pritchett, thanks for your praise and kind comments about our team."}, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "103204657894771043124", "name": "Andrea 35244", "time": 1554121059533, "rating": 5.0, "text": "Dr Zenko is an Amazing Dr.  He truly cares about his patients. He took time to answer ALL my questions never making me feel rushed.  Direct & to the point but kind & caring. Very knowledgeable & Expert in the USA. We are blessed to have him in Bham AL. Let’s just say,  if you needed emergency brain surgery, Dr Zenko would walk 6 miles in a snow blizzard to successfully save your life. True Story.\nLove my Doctor.......", "pics": null, "resp": {"time": 1554125467456, "text": "Andrea 35244, thank you for your kind review; we are happy to pass along your comments to Dr. Hrynkiw and his staff.  Your recommendation means so much to us and we're happy to have earned it. Thank you again for taking the time to share your positive experience. Have a great day!"}, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "115960361606698331114", "name": "EDDIE HAGOOD", "time": 1566131416141, "rating": 5.0, "text": "Outstanding staff and Dr. Hrynkiw is a straight-up guy that knows his job very well. He doesn't promote anything. At this time, I'm only five weeks out of surgery. I am doing great ten times better.", "pics": null, "resp": {"time": 1566308608326, "text": "Eddie Hagood, thank you for sharing your positive experience! We are happy to pass along your comments to Dr. Hrynkiw and his team."}, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "106294461744657332421", "name": "Cynthia Black Teague", "time": 1597079236517, "rating": 5.0, "text": "I already know of Dr.Hrynkiw service he is a man of few words because his work speaks for him . He did surgery on my Mom and Step Dad.", "pics": null, "resp": {"time": 1597098301234, "text": "Thank you for your kind words and this wonderful review!"}, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "106365436606829332968", "name": "Sara Parfait", "time": 1576544980799, "rating": 5.0, "text": "Dr. Hrynkiw is straightforward...I like that when it comes to my doctor. I feel very aware of my spine problem after speaking with him! He does NOT recommend unneeded surgery. I truly appreciate his expertise!", "pics": null, "resp": {"time": 1576598483708, "text": "Sara Parfait, your wonderful feedback and rating mean a lot to us. Our team strives to deliver an excellent experience, and are glad you found this to be the case during your visit.  Thank you again for taking the time to let us know how we did. We hope you have a great day!"}, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "116656153330549673792", "name": "James Mitchell", "time": 1575310128182, "rating": 5.0, "text": "I came all the way from Mississippi to see him. In just one visit he told me more than my dr for the last five have. He treated me like a human being instead of someone thinking you are just trying to get meds. He saw more damage in my back from the same MRI my old Dr was looking at. I was thinking I was still having issues with the old injury but I actually have more damage that causing me problems. It was well worth the 4 and a half hour drive. I appreciate him to the highest", "pics": null, "resp": {"time": 1575331164115, "text": "James Mitchell, thank you for your kind words and this wonderful review!"}, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "105839312944639480996", "name": "Mary Holmes", "time": 1579284317902, "rating": 5.0, "text": "I am sending a review on behalf of Mr. Arnold Brundige. I was in excruciating pain from the end of May 2019 until I had a lumbar fusion surgery December 5, 2019. I could  not walk without a walker, and had been working at a paper mill for over 20 years until my back problems. First, I was referred to a neurosurgeon who refused to see me due to my BMI being 38. I am 5' 9'' and weighs 260 lbs. Dr. Hrynkiw was God sent. He got me in, scheduled the necessary tests, and explained the entire procedure. Dr. Hrynkiw performed surgery and updated my family throughout  the process. You could not ask for a better surgeon. He checked in on me daily, and told me to call anytime. I didn't need rehab before leaving the hospital. My pain level went from 8/9 to 2/3 in 6 weeks. I am taking PT twice a week. I can walk around inside slowly without assistance. I would recommend Dr. Hrynkiw to anyone needing a neurosurgeon. He is the BEST!!!", "pics": null, "resp": {"time": 1579289959175, "text": "Mr. Brundige -   thank you for your kind words and this wonderful review! Your recommendation means so much to us and we're  happy to have earned it. Thank you again for taking the time to share your positive experience. Have a great day!"}, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "117850311682540035359", "name": "Nicole Pinson", "time": 1580771611473, "rating": 5.0, "text": "Dr. Hrynkiw removed the tumor from my brain (brain cancer) 15 years ago. He's wonderful!", "pics": null, "resp": {"time": 1580826652787, "text": "Nicole Pinson, thank you for sharing your positive experience!"}, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "108686427357050580437", "name": "D.B Hudson", "time": 1568660978149, "rating": 5.0, "text": "My mother had a growth on her frontal lobe . Dr Z removed it and have us 7 more years with mom . DrZ is a great Dr and even better human being. You need neurological help DrZ is your man ..", "pics": null, "resp": {"time": 1568672634621, "text": "D.b Hudson, thank you for your kind words and this wonderful review!"}, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "102430815528601045913", "name": "Mike Ashurst, Sr", "time": 1524883468335, "rating": 5.0, "text": "This doctor is IN the know! He diagnosed me somewhat different than expected but was the correct diagnosis nonetheless. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "114901215350519736166", "name": "Corey Mitchell", "time": 1522183628302, "rating": 5.0, "text": "I have been a patient since 2006.  Everyone at the clinic is fantastic and the health care is second to none.   You can not find a better doctor or staff.", "pics": null, "resp": null, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "117922942038781068979", "name": "Gary Hoover", "time": 1561744714176, "rating": 5.0, "text": "Dr Hrynkin I s a very good Doctor  did surgery on my wife pull a large mass out of her brain on the right side", "pics": null, "resp": {"time": 1561989237300, "text": "Gary Hoover, thank you for your kind review; we are happy to pass along your comments to Dr. Hrynkiw and  his team.  Thank you again for taking the time to let us know how we did. We hope you have a great day!"}, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "112000909107018122709", "name": "Carlene Ridgway", "time": 1566584238311, "rating": 5.0, "text": "He really took the time to understand what with my neck!! Excellent doctor!!!", "pics": null, "resp": {"time": 1566585871014, "text": "Hi Carlene Ridgway, thank you so much for your positive comments about Dr. Hrynkiw! We always strive to provide top quality service and are pleased to hear that your experience was a good one!  Have a great weekend."}, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "118359039834032559515", "name": "Regina Hardemon", "time": 1557345203487, "rating": 5.0, "text": "Dr.Hrynkiw & his staff are very caring & professional, clean & sanitary environment", "pics": null, "resp": {"time": 1557342316291, "text": "Regina Hardemon, thank you so much for your rating! We always strive to provide top quality service and are pleased your experience was a good one!"}, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "108851754148661226052", "name": "Mike O", "time": 1522092363759, "rating": 5.0, "text": "Very personable and friendly . Great staff. No long waiting  .Really wants what's best for patient.", "pics": null, "resp": null, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "104780457579722566172", "name": "Misty Caldwell", "time": 1545917132839, "rating": 5.0, "text": "He is a awsome doctor   he did a great job on my surgery and his staff are great as well... i would tell everyone to come see him . !!!!", "pics": null, "resp": {"time": 1546010792863, "text": "Misty Caldwell, thank you for the star rating! We appreciate you taking the time to leave us this feedback. Your recommendation means so much to us and we're so happy to have earned it. Thank you again for taking the time to share your positive experience. Have a great day!"}, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "110604377288947047857", "name": "Edward Parker", "time": 1486758266922, "rating": 5.0, "text": "Dr. Hrynkiw is one of the best neurosurgeons that I have had the pleasure of knowing. He is direct and to the point, and has your best interest at heart", "pics": null, "resp": null, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "107993150715066687345", "name": "Vanessa Holman", "time": 1560301688418, "rating": 5.0, "text": "Dr. Hrynkiw is the best neurosurgeon I've ever known.   He was straightforward and determined to find my problem.   I visited his office and he listened attentively to my symptoms.   He ordered tests and they were done the same day.  I'm very impressed with Dr. Hrynkiw and would recommend him to others.  I love Dr. Hrynkiw's  bedside manner because he explains things so I can understand.", "pics": null, "resp": {"time": 1560432874061, "text": "Ms. Holman - your recommendation means so much to us and we're happy to have earned it. We will pass along your comments to Dr. Hrynkiw. Thank you again for taking the time to share your positive experience. Have a great day!"}, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "101980791794346352647", "name": "Donna NeSmith", "time": 1495650251205, "rating": 5.0, "text": "Dr. Hyrnkiw is an amazing neurosurgeon. Wouldn't  think of going to any other neurosurgeon.", "pics": null, "resp": null, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "104676046095618592038", "name": "DANIELR", "time": 1537290367543, "rating": 5.0, "text": "Very matter to fact doctor and a awesome surgeon!!", "pics": null, "resp": null, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "105948738212355814335", "name": "Amanda Simpson", "time": 1565198463413, "rating": 5.0, "text": "He did a lower lumbar on me about a month an a half ago he will decuss all your options then decide what is best for you", "pics": null, "resp": {"time": 1565200511631, "text": "Amanda Simpson, thank you for sharing your positive experience! We are happy to pass along your comments to Dr. Hrynkiw. Again, thank you and have a great day."}, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "104957207123587525259", "name": "JP", "time": 1491934656955, "rating": 5.0, "text": "Dr. Hrynkiw performed surgery on my back. I was barely able to walk before I had the surgery. I was amazed at the result. I was actually walking the halls the night of my surgery which surprised me.  Very friendly staff who care.", "pics": null, "resp": null, "gmap_id": "0x88891a6df022d589:0x151152925ba77f7e"}
{"user_id": "114582247904262064306", "name": "Veletta Bristol", "time": 1621889898172, "rating": 5.0, "text": "I am a patient of Dr Hargett I am please with my visit with him he immediately sent me to pain management to receive injection for my lower back.  Unfortunately nothing helped I am always in pain and completely paralyze from this pain in my right side. He sent me for an x-ray & MRI I will be having surgery June 2, praying this resolved my problems overall am satisfied with everyone very nice and caring I love his nurses 🌹🌹Hope & Shelby they always call back when I need them too. ..", "pics": null, "resp": null, "gmap_id": "0x8892937a733c7c59:0x86660a654c2cf223"}
{"user_id": "105098874830769628354", "name": "McKenzie Ross", "time": 1480688512132, "rating": 1.0, "text": "I had a work related accident Mr. Voss gave me one option, after the surgerie was over I could not feel my right hand anymore and I had pain between my shoulder blades my left arm and shoulder. Mr. Voss Refuses to acknowledge he blames me for being overweight and angry his words not mine. When I asked what could be wrong with me he told me \"Google outcomes of pople on work comp and people not on work comp\" implying im there so i dont have to work. When all i want to know is what is causing my pain. He keeps telling me how bad my injuries were, like I've forgotten. He gave me another MRI no dye though, I wonder why? Before the accident I had never missed a day of work and I look forward to working again this whole experience had taken a toll on my family. And now my Doctor,  instead of trying to figure how to fix me is passing judgments.", "pics": null, "resp": null, "gmap_id": "0x8892937a733c7c59:0x86660a654c2cf223"}
{"user_id": "116437954577406761049", "name": "Tom Thompson", "time": 1623902781041, "rating": 1.0, "text": "My wife had a referral there. It has been 3 days and they still have not called back.", "pics": null, "resp": null, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "109180253177963104578", "name": "Tabitha Corr", "time": 1623806831176, "rating": 5.0, "text": "I had a wonderful experience this morning with Dr.Zywicke, her nurse Jarena, and her CRNP Amelia. I had a little bit of a wait but considering they make rounds at the hospital because they are surgeons was to be expected and totally understandable. They both listened to me and checked me out thoroughly. They explained what was going on with me and answered all my questions. I felt like I was their only patient while they were in my room. I am confident when she takes me to the operating room that I couldn't be in better hands. I highly recommend Dr.Zywicke.  she is very nice and she listens to what you have to say!", "pics": null, "resp": {"time": 1623856478647, "text": "Hello, Ms. Corr. Thank you very much for the 5-star review! We're so glad to read your impressions of Dr. Zywicke and her team and can't wait to share your comments with them. Thank you for trusting your surgery to Huntsville Hospital Spine & Neuro Center. We truly appreciate your support."}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "112666311922397875479", "name": "JJ Parsons", "time": 1611163652350, "rating": 5.0, "text": "Staff here is ALWAYS great. Friendly and well informed on individual cases and I always get top notch care when I'm there. Waiting room currently closed but they do have areas set up with social distancing in mind inside or you can wait in your call and they will call you.", "pics": null, "resp": {"time": 1611702900552, "text": "Hello, Mr. Parsons. Thank you for taking the time to let others know about your experience at Huntsville Hospital Spine & Neuro Center. We appreciate your support as well as your patience with our social distancing protocols."}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "107031076927503471455", "name": "robbie johnson", "time": 1618513874753, "rating": 5.0, "text": "Just returned home from having ACDF surgery by Dr. Jason Banks. First I want to thank Dr. Banks and his staff at the Spine@Neuro office for their professional and friendly help. Next I want to thank the staff at Huntsville Hospital pre-op , surgery and recovery for the care I received there. Its a shame that you cannot receive the same care at our local hospital North Alabama Medical Center.", "pics": null, "resp": {"time": 1618581497561, "text": "Hello, and thank you so much for taking the time to let others know about your experience with Dr. Banks, Spine & Neuro staff and Huntsville Hospital! We're so pleased to hear your impressions of our surgical services and will make sure Dr. Banks sees this. Thank you for choosing us for your procedure."}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "116728814267885485441", "name": "Amanda Callahan", "time": 1614809041046, "rating": 1.0, "text": "Too bad there is not a negative number I can enter. My mother had an appointment at 1:30pm it’s now 4:05 pm still waiting on Dr. This is beyond ridiculous.", "pics": null, "resp": {"time": 1614883306596, "text": "Hello, Ms. Callahan. We sincerely apologize for keeping your mother waiting and would like to talk with you more about your visit. Please call (256) 533-1600 and ask for the Practice Administrator."}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "102711193446330301085", "name": "Brice Johnston", "time": 1600712491323, "rating": 1.0, "text": "In regards to doctors/appointments:\n\nThis is my second visit and I have averaged well over 3 hours wait time with my actual doctor visit averaging less than 5 minutes. At this point it is almost laughable. I just don’t see any way they can justify this.\n\nDespite the incredibly long waits, the desk staff, technicians, and especially the PT staff have been exceptional. It is a shame they have to deal with these doctors hanging their patients out to dry like this.", "pics": null, "resp": null, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "104517749899085363901", "name": "Jenna Vescio", "time": 1598991061532, "rating": 1.0, "text": "If I could give Dr. Banks zero stars I would. I waited for an hour and he spent less than 5 minutes with me. He had his mind made up about me before he came in the room and he barely let me speak. He clearly has an agenda for who he wants to treat and I didn’t fit the bill. Before he left he told me just keep doing what you are doing, even though I clearly told him it wasn’t working. Thank god I saw another Dr. who is actually treating me like a person, and helping me heal.  I would never ever recommend Dr. Banks to anyone.", "pics": null, "resp": null, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "103903376943705208158", "name": "jeraca M", "time": 1612814875821, "rating": 1.0, "text": "If anyone is looking to get help this is not the place to go! The doctor and nurse will completely confuse you and tell you on one visit that they see things wrong on your mri then on the next visit after having a myleogram they tell you that nothing is wrong and that you are fine!", "pics": null, "resp": {"time": 1612992082811, "text": "Hello, Jeraca. We are so sorry to hear that you did not have a great experience with us. We would love to talk with you so we can personally address your concerns. Please call (256) 533-1600 and ask for the Practice Administrator."}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "115443067355041916057", "name": "tammy maples", "time": 1593063405687, "rating": 5.0, "text": "The best of the BEST.\nDr. Banks - changed my life when I met this man!!  Back and sciatic nerve pain \"ruled and ruined\" my life for several months.  He fixed me, he educated me and helped me to decide the plan of action.\nHe also has a wonderful team of people working for him 😊 Lisa is my favorite 😊\nDr. Newell - completely different breed of cat from Dr Banks but he knows his stuff!!  He's a physiatrist.   (I've never even heard of this profession before!!)  He's the guy helping me deal with this aging arthritic back, joint pain through injections, medication, exercises.\nThey get 5 stars.  They are Rock Stars!", "pics": null, "resp": {"time": 1593094066143, "text": "Thank you for the excellent review and your thoughtful comments!!!"}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "106605133344979900995", "name": "Vivian Wainscott", "time": 1597772841766, "rating": 1.0, "text": "My husband had an appointment to discuss an MRI that showed a problem. The appointment was at 11:00, we was on time, an hour and 45 minutes later we're still sitting here. There are no chairs, you can't go in the office, they will not bring chairs out for their patients, even though it is spine and neuro. They have called in 2 paitent with the same doctor in front of him. The bill was paid as soon as we got here so they have their money whether we stay or not", "pics": null, "resp": {"time": 1597856453707, "text": "Hello, Mrs. Wainscott. We apologize for your wait to see the physician. A manager from our office will be in contact with you about your concerns."}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "103464646884018644568", "name": "Patricia Mabe", "time": 1613359706326, "rating": 1.0, "text": "Are you going to be open tomorrow 2-15-2021 with this weather coming in tonight.....", "pics": null, "resp": null, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "105978179913318554946", "name": "Joe Atchley", "time": 1605732559499, "rating": 5.0, "text": "My fiance Angie was in a bad car accident and broke her back she doesn't remember the accident, Thank God,she woke up in the hospital after the surgery and Dr. Banks and his physician assistant were there and reassured her everything is ok that was a little over 2 weeks ago and she is doing GREAT she still has pain which is understandable considering what she went through but they saved her life and ability to walk", "pics": null, "resp": {"time": 1611260176781, "text": "Hello, Mr. Atchley. Seeing comments like yours reminds us why we come to work every day at Huntsville Hospital Spine & Neuro Center! We're so pleased to hear that your fiancee came through the surgery OK and is continuing to improve. We will share your very kind words with Dr. Banks and his physician assistant."}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "117930823872928031908", "name": "Ann Gates", "time": 1577986242726, "rating": 5.0, "text": "Dr Campbell is very professional and at the same time very warm and caring. She takes time o adequately explain things to the patient and help with understanding.", "pics": null, "resp": {"time": 1577993944838, "text": "Hello, Ms. Gates. We are pleased to hear that you had a wonderful experience.  We appreciate your kind words and great review. We will share your comments with Dr. Campbell."}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "107532281106470587621", "name": "Alyssa H", "time": 1574653856044, "rating": 2.0, "text": "I came here due to neck pain.  On the first visit the nurse practitioner looked at my x-rays and told me I had straightening of the natural curve of my neck.  He didn’t really explain what that meant or what it was caused by.\n\nI spent the next 2 weeks researching neck straightening and waiting for my MRI results.  I meet with Dr Tao and after sitting in the waiting room for 2 hours I finally get a chance to get some answers.  I was very confused when Dr Tao tells me I have a perfect MRI scan and no issues.  When I ask about what the NP told me and noted in my exam history he tells me that it’s wrong and my xrays were fine!\n\nTHEN to add to the confusion..two weeks later on the patient portal I read where Dr Tao made a diagnosis of degenerative disc!  I am very confused by all this and still have no answers to why my neck hurts like it does.  I never got to see any of my xrays or MRI results which would have been helpful but I don’t guess it even matters since I got  told so many different things and really given no solution.\n\nAnd I almost forgot to add...the lady who called to set up my MRI left a voicemail and apparently thought she had hung up when she hadn’t.  I got to hear her complaining about patients on the long voicemail she left.\n\nThe only reason I give 2 stars is because the front  desk lady was very courteous and friendly.", "pics": null, "resp": {"time": 1574698074789, "text": "Hello Alyssa,\nWe sincerely apologize for you unfavorable experience. We would welcome the opportunity to speak with you and try to address your concerns. Please call (256) 533-1600 and ask for Administration or Marketing. Thank you."}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "101617180584707167855", "name": "Sheila", "time": 1581504652218, "rating": 3.0, "text": "Update: I had another opportunity to visit. The process was much better but still delayed - another 3hrs. Still didn't get to see the doctor. I think this is my last visit. The staff yet remains friendly and professional. A much better experience. 2/23/19.\nNot exactly sure what or how to feel after arriving for a 10am appointment and not being seen for almost 1hr 40min. The delay I understand, was caused due to discrepancy in insurance verification. The staff did not verify before I came in. This process causes delay and disappointment. Also, my MRI record from ER had not been reviewed prior; so in attempt to open, the doctor could not read or make definite diagnosis/plan - a total waist of time. It was suggested I start with an epidural in my neck - that's not why I was there. On the upside, the front office staff was nice, looked professional and the facility was clean and comfortable. It could be I'm just used to care received from UW, CHI, Swedish groups. I'm just not used to tardiness and nonchalance.", "pics": null, "resp": {"time": 1548173806332, "text": "Hello, Ms. Fore-Williams. We're very sorry to hear that your visit didn't go as expected. We have made the practice administrator aware of your concerns, and she would be happy to speak with you. Please call her at your convenience. The number is (256) 533-8088. Thank you."}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "112948614283228136556", "name": "Valerie Jones", "time": 1551372763029, "rating": 2.0, "text": "This was my first time seeing a Dr here. The wait was not bad so that one positive. I have had back problems for almost 30 years and I have decided to try to get better. Primary Dr sent me for an MRI and then decided to refer me here. Took the disk I picked up from North Alabama Medical Center and was told by Dr. Cho that it wasn't done right so he couldn't see the images. He told me that he would try to get them to send it right and when he could look at it he would call me. He said he would probably send me somewhere else for shots. Didn't explain anything about my report. I thought they did all of the treatments there. Why would he send me to someone else? And why would shots be the only option mentioned? But I guess since he's a surgeon and I don't need and won't have surgery I don't matter to him. He was very abrupt and didn't seem to be concerned about me. I wasted my time driving 2 hours to have nothing accomplished. His nurse and PA were great so that's another positive. But the positives don't outweigh the negatives.", "pics": null, "resp": {"time": 1551472885420, "text": "Hello, Ms. Jones. We're sorry to hear that you did not have a great experience and would welcome the opportunity to work with you to address your concerns. Please call our practice administrator at your earliest convenience. Her number is (256) 533-8088. Thank you."}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "116094263338150680313", "name": "Kalee Sullivan", "time": 1529521623311, "rating": 5.0, "text": "Doctor Banks and his whole staff are simply amazing. I have never met a more caring surgeon. We are so thankful for all the help from him and his staff! Lisa is the primary nurse we have dealt with and she has done so much to keep us comfortable and calm. Thank you Dr Banks and Lisa for everything!!!!", "pics": null, "resp": null, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "113902582903881868966", "name": "Renee Richardson", "time": 1531927121497, "rating": 5.0, "text": "My experience with the Physicians and Staff at the Spine & Neuro Center are nothing more than  positive.  I received the most caring and prompt service/care all throughout my treatment and recovery.  I had to recognize the individual personalities and bed-side manners of my physicians and staff and listen as a patient - this helped me to not only listen but to actively participate in my treatment and recovery.", "pics": null, "resp": {"time": 1531950568294, "text": "Hello, Ms. Richardson. We are pleased to hear that you had a wonderful experience with our team! Thank you for taking the time to share your story and feedback with us."}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "117807754012068052650", "name": "Cricket Williams", "time": 1565185424181, "rating": 2.0, "text": "I had an appointment on 08/06/2019.  I had no problem with the doctor, however his nurse practitioner was very rude, and had no bed side manners at all.  I was very intimidated by this lady.  She acted as though I was faking my condition, and also made me upset.  She did spend a while in the room with me...I will give her that credit, but her bedside manners while in the room was not shown with compassion and care...she actually made me cry while she was in the room with me. Dr Murray was great the 5 min he was in the room with me, but his nurse practitioner treated me as though she was putting me through a military boot camp...Carmilita Kelly needs an attitude adjustment and learn to have better bed side manners. I know she is not my best friend...but she needs to treat pts with better care and a better attitude.", "pics": null, "resp": {"time": 1565211851001, "text": "We're sorry to hear that you did not have a great experience, Ms. Williams. Your feedback is important to us, and we have shared your comments with our practice administrator. If you would like to speak with someone about your visit, please call the Patient Advocate at (256) 265-9449."}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "116514511103498322218", "name": "Diane Hess", "time": 1516409276996, "rating": 5.0, "text": "I have never met a nicer, more friendly, congenial or more helpful staff. They have gone beyond and back to help me and I cannot say enough about them. I met Dr. Banks under very stressful circumstances for me & from the moment I met him, he put me at ease & answered all of my questions.  I have moved from Alabama since my first visit but this staff continues to help me more than I could ever imagine. I can never thank you all enough for everything you do!", "pics": null, "resp": null, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "109367346596981141106", "name": "Marla Y", "time": 1557269035385, "rating": 5.0, "text": "I went in with extreme anxiety and fearful over my condition.  Everyone I came in contact with was so nice and helpful.  Dr Banks took time with me and my sister, explaining my problem and the procedure he wanted me to have.  He and his staff are empathetic and caring.  I left there with a hopeful feeling.  Thank you Dr Banks and staff.", "pics": null, "resp": null, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "117242696210695020098", "name": "Kiki Margarita", "time": 1554221248754, "rating": 1.0, "text": "If you are looking for someone who will treat you with compassion and empathy. DO NOT see Dr. Banks he was so rude and dismissive towards me and I will never waste my time or money on seeing him. He was the rudest jerk and the person who happened to take me to the appointment was also a physician whom I am very close friends with. Needless to say she no longer refers anyone to Banks. She was horrified with his attitude towards me and I don’t know him and he had no reason to be that way.", "pics": null, "resp": {"time": 1554328492345, "text": "Thank you for making us aware of your feelings. We have shared your message with Dr. Banks and our practice administrator."}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "106252093436634638776", "name": "Sherry Wray", "time": 1563203624609, "rating": 5.0, "text": "Dr Banks operated on my husband after he broke his neck in a motorcycle accident.  I found him to be very professional and kind he done everything he could to make our journey to Sheppard's center happen.  If it wasn't for Dr Banks I don't know if my husband would have ever been able to walk again.", "pics": null, "resp": null, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "116258207180693851757", "name": "Melissa Miller", "time": 1544464644503, "rating": 1.0, "text": "While scheduling my appointment, the receptionist told me that it wouldn't take more than a week after my initial doctor's appointment for an epidural injection to be scheduled.  I have a herniated disc.  Extremely painful.  I can't even walk!  I can't walk.   It is debilitating.  I schedule my appointment for 7am.  Dr. Campbell doesn't even see me until 8:30.  Her nurse tells me that the earliest injection she can schedule is January 3.  Just told me I will have to do the best I can til then, because they are closing the office for a few weeks at Christmas.  So I'm suppose to suffer at the holidays.  Very disappointing,  especially since they came highly recommended.  Had the receptionist been honest, I wouldn't have wasted my time.   Now,  I've gotta find a place that can help me", "pics": null, "resp": {"time": 1545163644893, "text": "Hello, Ms. Miller. Thank you for bringing this to our attention. Our practice administrator would be happy to speak with you about your concerns. Please call her at your earliest convenience. The number is (256) 533-8088."}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "105872576107868240816", "name": "Poppa York", "time": 1546449580409, "rating": 4.0, "text": "The doctors and staff have always treated me with the utmost care. I really can't believe some of the snowflake comments. Someone complaining about the TVs in the waiting room. Really? These ratings are  used by people to select a doctor. Some of you people are so spoiled. The care that I received was exceptional. Would I like to have more chit chat time? Probably, but my primary concern was that they help me with my pain. Doctor Tao performed my ACDF and everything went great. Doctor Campbell performed the injections in my lower back. The quality of work was phenomenal. The staff was very friendly. The only issue I have with doctors is that they wouldn't provide me with documentation for the VA, but that has nothing to do with the work they did.", "pics": null, "resp": {"time": 1546543780463, "text": "Hello, and thank you for taking the time to share your insights about our practice. We're happy to hear that you have been pleased with your care and will make sure that Dr. Tao and Dr. Campbell see these comments. Our practice administrator may be able to help with your documentation request. She can be reached at (256) 533-8088."}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "111199185642526889909", "name": "Terry Jones", "time": 1562965859299, "rating": 5.0, "text": "A year ago I was losing the ability to walk or stand due to spinal stenosis. I spent 10 years going to chiropractors.  At 60 years old I knew i was facing surgery.  Doctors told me my condition was severe. i went to another doctor before I learned of Dr. Derrick Cho. I asked Dr. Cho  an important question, can you help me? without hesitation and with much confidence, he replied yes. I knew my prayers had led me to the correct surgeon.  I highly recommend Dr. Cho his staff and Huntsville Hospital to anyone who finds themselves in need of back surgery.  i have been truly blessed by his knowledge and the work he does.", "pics": null, "resp": {"time": 1563482346616, "text": "Wow! We appreciate you sharing your amazing story with others. We're so pleased to know that Dr. Cho gave you the hope and the help that you needed. We will make sure he sees your review and knows what a difference he made in your life."}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "108065114027241230113", "name": "Sandy Bentley", "time": 1547221718709, "rating": 5.0, "text": "My Mother who has a lot of medical issues, had spine surgery last Sept 2017, after recover she had no pain.  Dr. Cho was the surgeon.  He did an excellent Job and Meredith his nurse is amazing.  Little over a year later she is having additional back problems, but no fault of theirs, just part of aging and other medical issues.  I recommend Dr. Cho.", "pics": null, "resp": {"time": 1547224814209, "text": "Hello, Sandy. Thank you for taking the time to share your impressions. We will make sure Dr. Cho and his team see your very nice comments."}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "106126269514228390569", "name": "Charlotte Mulvihill", "time": 1546531626025, "rating": 5.0, "text": "I've had therapy and surgery of the L3/4 spine. I think the experience was a success because I'm much better than I was when I started. I do still have pain but not anywhere near like it was before surgery. I have my left leg working well. I'm now having therapy on my neck. There's no pinched nerve in my neck just terrible tightness. I am due for an evaluation with Dr Newell. Dr Murray, my back surgeon, referred me to Dr Newell after a MRI of my neck. Dr Murray has my complete confidence and his staff is just as wonderful from the receptionist to the nurses.", "pics": null, "resp": {"time": 1546544134198, "text": "Thank you for the excellent review and your thoughtful comments, Ms. Mulvihill. We're so glad that you are feeling better and will make sure that Dr. Murray and his team see your comments."}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "110718826489391825164", "name": "kevin parrish", "time": 1498766484034, "rating": 3.0, "text": "I had to bring my mother to see a doctor here and I can't understand why this place would spend money on TVs, pay for the power to operate them and the cable or satellite if we don't know what is being said on them. I understand not turning the sound on but they could use closed captioning. I ask a lady at the desk but she said they were not allowed to mess with them. DON'T EVEN HAVE THEM IT'S A WAST OF MONEY!", "pics": null, "resp": {"time": 1498830972042, "text": "Hi Mr. Parrish,\n\nThank you for the review.  We were unaware that the Closed Caption was no longer showing.  We will get it back up asap.  Thank you!!"}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "105351558426679425275", "name": "Heather Conigliaro", "time": 1569251262164, "rating": 1.0, "text": "They will send someone who has had 3 spinal neck fusion surgeries to pain management without performing proper testing such as an MRI or Millogram!!", "pics": null, "resp": null, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "112922878815169509110", "name": "Geneva Cole", "time": 1517709088000, "rating": 5.0, "text": "Dr Banks is the best surgeon I’ve ever known. He’s performed 2 major  Neuro surgeries on me and they were the best they could have been. Thanks, Dr. Banks, for all you’ve done for me. I’ll never forget it.", "pics": null, "resp": null, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "109999657419468238239", "name": "J C", "time": 1558796905063, "rating": 3.0, "text": "They take their time or overbook. Except Dr. Tao he is great and efficient.", "pics": null, "resp": {"time": 1559055867585, "text": "Thank you for your feedback, Mr. Cody. We're pleased to hear your impressions of Dr. Tao and will make sure he sees this review. We will share your other comments with our practice administrator."}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "101202505715232145514", "name": "barry reaves", "time": 1498920108261, "rating": 5.0, "text": "After an MRI I had a ruptured disc pressing on my sciatic nerve , the last month have been unable to walk , stand, or lay down without excruciating pain. They were able to make me an appointment with Dr Picket's nurse practitioner Tamika Hays on 6/30, even though everyone's work schedule was overwhelming she was able to work me in for an MRI and schedule me an appointment with Dr Picket two days later. During my appointment he accessed my problems and said he needed to work me in for surgery that afternoon. We went straight to admitting. The entire staff in every department was awesome , caring and so helpful. Dr Picket finished rounds came to the hospital and I was in the OR at 4:00 pm. I woke up in recovery completely pain free and was taken care of by the best recovery team I've ever dealt with. Two hours later I was released to go home , again this morning no pain pills and completely pain free. What a first class faculty everyone went above and beyond to take care of my needs. Dr Picket and his staff was and is an answered prayer. No way I can thank him for his services , his skills , and his dedication.\n\nBarry Reaves", "pics": null, "resp": null, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "106315375558603216159", "name": "Annette Thompson", "time": 1507543835017, "rating": 5.0, "text": "I can't say enough GREAT things about them of Physicians.  If they were not here I won't be alive today. I won't be walking.\nOnly negative is the wait time for Dr. Pickett but he is worth it. He is the best and caring about his patient s.  Thank you.😊", "pics": null, "resp": {"time": 1507652966217, "text": "Thank you for trusting us to care for you.  We really appreciate the kind words."}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "113186797075574843771", "name": "Jonathan Piper", "time": 1576795376660, "rating": 1.0, "text": "Appointment was at 2:45  they closed at 3:30 here it is 4:35 and still in the waiting room along with five other people they said he is running behind on seeing his patients his name is Dr Murray an they wonder why you get irritated I'm not the one who is seeing the Dr an my blood pressure is through the roof right now I'm about to blow a gasket and it's 15 minutes to five", "pics": null, "resp": {"time": 1576850107948, "text": "Hello John,\nWe're sorry to hear that you did not have a great experience and would welcome the opportunity to speak with you to address your concerns.  Please call (256) 533-1600 and ask for Administration or Marketing . Thank you."}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "102331551817297462236", "name": "Kasey Chamblee", "time": 1516263227454, "rating": 1.0, "text": "I never had to wait long so I guess I got lucky there. July 7th I had a car accident and was sent to Dr. Cho. He has no bed side manner and acts like he is inconvenienced when we ask a question. There has been so much to happen I don't even want to type it all. He even tried to argue with me about when my accident was. He tried to dismiss me way before I was ready without therapy or anything. I had to ask if I could try physical therapy. And no they don't even look at all those records you fill out. I won't go into the MRI accident. I think if I had have had surgery I would be better now but NO he is sending me to the pain clinic. BUT his nurse is very kind I don't know how she puts up with him. Everyone else has also been nice.", "pics": null, "resp": {"time": 1516283911654, "text": "Mrs. Chamblee,\nYour opinion is very important to us.  We apologize that you had a less that satisfactory experience at Spine & Neuro.  If you would like to discuss this further, please give our office a call and ask for the Marketing Department. Discussing the details of your experience may not only clear up any misunderstandings in relation to your situation, but may also help improve the experience of our future patient's.  Thank you."}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "106729293162860940880", "name": "Tommy Townsend", "time": 1508274058499, "rating": 5.0, "text": "I was living in Tuscaloosa before a brain hemorrhage. I woke up days later in Huntsville Hospital Neuro ICU. If not for the surgical skill of Doctor Jason banks as well as the dedication of doezens of staff members, I most certainly would be dead at age 25. I think that deserves a 5 star review.", "pics": null, "resp": {"time": 1508331469407, "text": "Thank you for sharing your experience Mr. Townsend. Taking call for the North Alabama area is something that we take a lot of pride in.  We are glad that we could be of service to you."}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "112016028064429900503", "name": "DeAnne Emerson", "time": 1561160694431, "rating": 1.0, "text": "Dr. Banks told my husband he should begin drinking to aleave his pain.  He was hateful and unresponsive to my husband's pain!  His license should be removed!  He's a hateful hak!", "pics": null, "resp": null, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "108236403928911386238", "name": "L T", "time": 1537820565831, "rating": 5.0, "text": "I had an appointment with Dr. Banks CRNP, Jason, first so I could get an MRI before seeing Dr. Banks. I only had to wait 30 minutes. He listened to my concerns and was empathetic. I told him I did not want to take pain meds so he offered me other options to make me more comfortable. He was very knowledgeable and answered my questions. I was hesitant about seeing a CRNP instead of the Dr. but I am glad I did. Hope my appointment with Dr. goes as well.", "pics": null, "resp": null, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "107681804547657812997", "name": "Mama Gee", "time": 1455894024724, "rating": 1.0, "text": "The spine and Nero came highly recommended yet when I tried to get an appointment it was next to impossible. The person in charge of making these appointments was extememly difficult to deal with & after a while it became apparent that clearly they don't need patients or else they would treat those who want and need appointments with respect & a helpful attitude. I will be going elsewhere.", "pics": null, "resp": {"time": 1463492541721, "text": "I am sorry that you had a bad experience.  Please call our office and ask to speak with our marketing representative if you would like to discuss further."}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "103365888692753525716", "name": "Emily Graham", "time": 1527171812794, "rating": 5.0, "text": "My husband was airlifted and brought to HH for a traumatic brain injury and open skull fracture. Dr. Zywicke can be credited with saving his life. She performed emergency brain surgery within minutes of him landing at the hospital and if it had not been for her quick actions, I’m afraid of what the outcome would have been. She was absolutely amazing and her bedside manner was excellent. She updated me every morning in the neuro ICU and then again after we got to the floor. I cannot say enough wonderful words about her as a physician and surgeon.", "pics": null, "resp": {"time": 1527172734017, "text": "Thank you so much for the kind words, and for sharing your story!"}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "115572624398743697200", "name": "Karen George", "time": 1493490560228, "rating": 5.0, "text": "Was and am very pleased with staff and Dr. Tao. Pray it all works and can be pain-free. Many thanks to all of you.", "pics": null, "resp": {"time": 1496256771962, "text": "Thank you Karen.  We hope that you can get back into the swing of things."}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "102152989241824213964", "name": "Steve Thunder", "time": 1533838681168, "rating": 5.0, "text": "Dr. Banks saved my life from N. Bacterial Meningitis, within hours if my death and/or living as a vegetable forever. Dr. Banks had just finished an emergency brain surgery on an automobile accident victim that was helow'd in at 10pm the doctor, our hero, began cutting opened spinal cord at my Lumbar all the way up to my neck-decompressing & fussing my spine while scrapping the infection out, them although he had a brain surgery scheduled at 7:30AM, he continued working to scrape the deadly infected pus out if my neck & brain for hours while he was exhausted-I had 6 different doctors/Specialists, but Dr. Banks & Dr. Leyroy Harris (an infectious  disease specialist) were the two docs that prevented me from entering  death's door, I owe my life to them!\n\nSteven Schwartz\nSUA SPONTE! From me\nBow-WOW!!! From Thunder, my\nGreaf and Mighty WWSERVICEDOG!", "pics": null, "resp": null, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "110335274613313086833", "name": "Stacey Gass", "time": 1489155666258, "rating": 5.0, "text": "I love my Dr which is Dr Murray and he has been my dr for years! He has helped me with pain! And also helped find out back in 2014 along side some other Drs that I had cancer! I love this man this place and I recommend it to everyone who needs anything done to you spine or your neck!!", "pics": null, "resp": {"time": 1496257018776, "text": "Thank you Stacey!  We appreciate your feedback."}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "111943028654997666040", "name": "Chris Skinner", "time": 1435148514509, "rating": 1.0, "text": "Worse experience with Doctor’s Office in my life; been two months of hell. Wife was hit head on by a drunk driver April 4th 2015. After being released from the hospital we went to see our family doctor. Our family doctor referred us to the Spine & Neuro Center due to her numerous injuries, back and neck pain. After your 1st appointment with the doctor, they recommend you do their in house physical therapy.  Don’t do your therapy there! Trust me go get your therapy done elsewhere. Michael the physical therapist will evaluate you then pass you off to one of his two aids to do the future therapy appointments. After fourteen physical therapy appointments the pain only is getting worst. So we went back to see our family doctor the 2nd of June. He wanted us to see the doctor again at the Spine & Neuro Center. GOOD LUCK GETTING IN AGAIN. Their appointments are six weeks out. Appointments receptionist gives you excuse we can only see new patients in sooner.  ---- That sounds like discrimination to me! ---- Very disappointed with the Doctor never following up with us after repeat calls talking to the nurse about pain and physical therapy.  Obviously the Doctor has no clue what is going on in the day to day routine in their office.\n\nFinally, they refused to transfer our physical therapy from their in house program to a different company in Huntsville.", "pics": null, "resp": null, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "106941691816916769092", "name": "Linda Schrader", "time": 1496237162340, "rating": 5.0, "text": "Compassionate and caring.  Dr. Banks is a great doctor as is he staff.", "pics": null, "resp": {"time": 1496256609730, "text": "Thank you so much for the compliment and for trusting us to take care of you!"}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "116247015327801121483", "name": "Tanya Penley", "time": 1420742926491, "rating": 5.0, "text": "wonderful staff and Dr Gaspard is great so thankful for everything he has done to help my daughter", "pics": null, "resp": null, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "118204447685796429180", "name": "My Stinkers", "time": 1472207872738, "rating": 1.0, "text": "Nov 23rd, 2013\nDr. Rhett Murray has no ethics. He doesn't follow the (doctor's medical oath of ethics) to help and treat his patients. Dr. Rhett Murray does not address his patient's questions, concerns, or pain. When asked questions he does not answer the asked questions or inform patient of their diagnoses. He is horribly rude. Dr. Rhett Murray does surgery and then he discharges his patients after their second follow up; without notifying the patient. Dr. Rhett Murray does not help or address patients that are having complications, severe pain, or in need of his medical knowledge. Dr. Rhett Murray's RNs are also rude on the phone. Dr. Rhett Murray has no concern other than making money from surgery. He is known in the medical community of dumping his patients that are having complications and pain on the patient's primary physician. He does not address or help his patients when they are the most vulnerable and of need of his medical help.", "pics": null, "resp": null, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "113476936199175212369", "name": "Jon Bierer", "time": 1503506604148, "rating": 1.0, "text": "The office lied to me about my appointment time, they told me 7:30 am and so I arrived at 7 am to fill out paperwork, Then another patient for Dr. Zywicke went ahead of me at 7:30 and I was told my appt was at 8 am. No one told me I'd have to pay for parking in the parking garage, they gave me 10 pages of questions only to ask me all the same questions once I got in the room. Did you even look at it? I raised my concerns to multiple nurses only to have them tell me they're sorry, but they never said they would look into it or fix it. Dr. Zywicke just told me i needed physical therapy. She didn't provide a diagnosis until I asked, didn't give me a recovery time until I asked. She didn't schedule a follow up visit even though multiple Physical Therapists have asked me when my follow up is because they expected a follow up with the doctor. I went to urgent care and a chiropractor before coming here thinking they would take care of me. I asked for an MRI and Dr. Zywicke refused. I'd rather drive to Nashville than deal with this clinic again.", "pics": null, "resp": {"time": 1503671368679, "text": "I apologize for the issues that you experienced during your appointment at Spine & Neuro.  Please understand that Spine & Neuro appreciates all reviews and considers all comments, complaints, and suggestions.  Unfortunately, because the review is posted anonymously, investigating the incident properly to resolve the matter is a bit more difficult.   If you would like to discuss this incident further, please call our office and ask for the marketing department.  If not, please consider setting up an appointment with one of the other 5 neurosurgeons in our office.  I assure you that the outcome of your appointment will differ.  Thank you."}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "116077914198443353810", "name": "Brandy Bright", "time": 1486142235193, "rating": 1.0, "text": "I was sent for back surgery and apparently they don't pay ur mri any attention just their xray which of course only shows bones..now I have to go for back injections which is only gonna cover up my pain. I also can't figure out how to get to the patient portal. Every time go they are rude even called me a liar cause the nurse didn't answer to tell them I was gonna be late, so the doctor left and they resheduled my appt. Called me a liar about calling. This is a 2 hr drive 4 me They are so rude. I can't believe the unprofessional behavior in this office", "pics": null, "resp": {"time": 1476387155100, "text": "Hi Brandy, I'm sorry to hear that you had a bad experience.   I am unable to find you in our records system.  Perhaps you are listed under a different name.   If you would like to discuss this matter, please call our office and ask for the marketing department."}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "116097327325721871674", "name": "Justin “GrumpyGamer” Herring", "time": 1455117683768, "rating": 1.0, "text": "Stay away from this place if you can help it! Just make the drive to Birmingham or Nashville where you can find experienced doctors who actually want to help you. I saw Dr. Cho here twice, he's also the new guy they have to write his name in on the appointment cards. The first time I saw him was to evaluate my neck pain and get a diagnosis, then a treatment plan. On the first day they send you to physical therapy, this is just a given with any surgeon exhausting the possibility of anything working before surgery. Then you will also be set up with a pain doctor in their office, which will take you a week to see the first time then a month or two the next time. I expressed that I had no interest in being on pain medication and taking shots to come to find out was not the answer, nor the prescribed treatment for my condition, the only used option was surgery which he will not do because i'm not the most perfect patient for surgery. The condition i have is forminal spinal stenosis and it is advanced to the point over the years that it, as it almost always does, has exacerbated old injuries to my lower back and put me in a ton of pain. Dr. Cho doesn't care if you have a loss of feeling in you limbs, or you are in sever pain, I mean he doesn't even go over your MRI with you in the office, he puts it in his very formal text book response he creates and sends to your pain doctor. If you do any shots don't expect him to evaluate the area because he won't, nor will he do any physical examination to further understand your condition. The most he will do is set there and tell you what he thinks without discussing anything with you and you are supposed to live with it. I had a second and third opinion after my first initial visit, and both out of respect for their profession asked that i return for the second visit with Dr. Cho before I came back to them, because they were sure that he would do the surgery at least on my neck, so I could heal and work on becoming this perfect patient so he could or they could fix my lower back. The second opinion I had wasn't by my choice, it came when I was hospitalized for loss of my bladder and bowl control at my primary physicians office which is concerning especially when I also was having a hard time walking or standing. The third opinion I had locally just to confirm his and the ER surgeons diagnosis. So when i went back i again expressed my extreme disinterest in being drugged up or shot up every week, because two opinions and multiple medical studies i had read by this time all say the same thing. The only thing that fixes my problem with (in any patient) a near 100% rate of success is surgery. You can imagine my surprise when he went totally in the opposite direction. In short i'm scheduled for my surgery next week in Birmingham after seeing one of the surgeons at the neurosurgery center there, who actually had some reservations as to doing it early but consulted with another physician in the room with me (nice to not be left in the dark) and told me the recovery may take a week or two longer but they can fix the issue. Again, In Short save yourself the time of seeing someone who only cares about the money and how long they can keep you taking shot's, pills, and collecting from you and your insurance company. Not to mention i couldn't be released to my job until i was fully medically cleared, and taking pills and shots doesn't get you cleared for normal duty at your job. I've learned to go with my instincts lately with doctors, some you can tell first off if they are genuinely interested in helping you or are just there to collect as much money as possible. (this was my first instinct with Cho, yet i ignored it) and the rest is history, just hope others heed my advice on this guy. REALLY WANT TO GIVE THEM NO STARS, BUT IT WON'T LET YOU!", "pics": null, "resp": {"time": 1463492972517, "text": "I apologize that your experience did not meet your expectations.  Please call our office and ask to speak with our marketing representative if you would like to discuss further."}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "106520353786664173648", "name": "Gary Rice", "time": 1499895619218, "rating": 5.0, "text": "I am very happy with the whole experience of Mr banks and staff", "pics": null, "resp": null, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "108906289588501003144", "name": "Sarah Maynor", "time": 1467906199639, "rating": 5.0, "text": "I love this place. I was rear ended Sept 18th 2015, Dr Tao, found out where the source of my pain was coming from and fixed it ONE BY ONE. First, I had a C 6-7 herniation, I had cervical surgery on that level Dec 1st 2015, didn't have to go to therapy or wear a neck brace. He used Glue to close my incision, no stitches, gauze or bleeding afterwards. Totally took away all of my neck issues.\n\nI lived in pain with sciatic and back pain in the si joint region for 8 months. He could have done back surgery and it would've failed, because, it wasn't in the upper spine, but in the si joint above my tailbone. He explained this to me, sent me for injections in the si joint, the injections relieved the pain for awhile. By doing this, he knew, this was the area that was damaged.\n\nI had been reading about the Triangular implants designed specifically to stabilize and fuse the heavily loaded SI joint.  which is called I FUSE. We discussed this procedure, and June 21st 2016 I had it done. It's now 7/7/2016 and I have no pain in my back or tailbone area or legs. The day of surgery, I was laying there before my surgery and thought I would cry from the back pain, when I woke up it was gone.\n\nI was on crutches less than 14 days after the surgery, It's fusing, and I am so glad I found Dr Tao and the Neuro Center in Huntsville Alabama. I would trust this group of Doctors, especially Dr Tao with my life. If you've had failed back surgeries, in pain, please go see him today. I'm glad I did. I am totally drug free! Didn't take any pain Killers after my surgery. Some bruising pain will happen for about 3 days, nothing like the pain I had before my surgery.\nDon't be afraid of the I-fuse surgery, at the moment I am walking around on both feet and can't even tell I had surgery June 21st 2015", "pics": null, "resp": {"time": 1468244078054, "text": "Thank you for trusting us with your care. We are so happy that you have had a positive experience, and we thank you for sharing your experience with us."}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "111654522687485913227", "name": "sherry dianne Burke", "time": 1480271326071, "rating": 2.0, "text": "Receptionist could not find mri in computer which had been sent. Actually rescheduled &left. 2 hr drive. Someone else found them &called me back. No treatment except offer recurring visits for \"pain management\" & rx for brace which was imposs to wear sitting, or laying down, or eating", "pics": null, "resp": null, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "107039401088898458784", "name": "Chuck Uhrich", "time": 1526330613662, "rating": 3.0, "text": "I have 2 numb fingers and had neck surgery to repair it.  The problem is no better and has been 2 years.", "pics": null, "resp": null, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "116752613405408282442", "name": "erik chalmers", "time": 1499786439944, "rating": 3.0, "text": "Eccellent doctors and nurses. The office staff isn't getting an appointment is the most gruelling and tedious process.", "pics": null, "resp": null, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "111779211127024554428", "name": "Bill Brownell", "time": 1488220367986, "rating": 1.0, "text": "Plan on spending half your day waiting.  Dr. Wasn't even there when our scheduled appointment was. He was on call.", "pics": null, "resp": {"time": 1488288414513, "text": "Your time is valuable to us, and we apologize if we made you feel the opposite.  Yes, our group does take trauma call for the North Alabama region, so there are times when emergencies come up that have to be taken care of.  However, we do our best to avoid scheduling conflicts whenever possible.  We encourage our schedulers to inform patients about any possible scheduling conflicts that may occur when scheduling appointments.  We also encourage our front desk personnel to keep our patients informed when emergencies arise on the day of their appointment.  Again, we apologize if you were not made aware of your physician's call status."}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "111301640691578807052", "name": "Madison Haven Apts", "time": 1494952270686, "rating": 5.0, "text": "Wonderful place Dr. Cho is awesome!!! He fixed me right up!!", "pics": null, "resp": {"time": 1496256693766, "text": "Thank you!! We love Dr. Cho too!  We appreciate you choosing us to care for you."}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "103098087089333039113", "name": "Nanci Greene", "time": 1576602025685, "rating": 5.0, "text": "Excellence", "pics": null, "resp": {"time": 1576611044660, "text": "Hello,  Ms. Greene. Thank you for the five-star rating! We're glad that you are pleased with our services."}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "115663888962062053473", "name": "Clay Baker", "time": 1575179029950, "rating": 5.0, "text": "Great doctor", "pics": null, "resp": {"time": 1593094094979, "text": "Thank you for the excellent review"}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "109005433209395047097", "name": "Patty Dill", "time": 1524068606849, "rating": 5.0, "text": "Dr. Tao Great doctor", "pics": null, "resp": {"time": 1528404484786, "text": "We appreciate your feedback, Ms. Dill."}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "114489057143751711786", "name": "Cathy Dill", "time": 1497370628670, "rating": 5.0, "text": "Great Dr.and Staff.", "pics": null, "resp": {"time": 1497378023331, "text": "Thank you so much Cathy, your opinion means everything to us!"}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "114947308736095469348", "name": "Augusto Panama", "time": 1492108613160, "rating": 1.0, "text": "HORRIBLE! Dr. Zywicke is the most unprofessional doctor I have ever seen! Tried to downplay my pain in my back and make it seem like it was no big deal!!!! SUCKS!!!", "pics": null, "resp": {"time": 1496256937180, "text": "We apologize that your experience at Spine & Neuro was less than satisfactory.  Thank you for posting the review.  Feedback, whether positive or negative is used improve service to our patients.  If you would like to discuss further, please call our office and ask for the marketing department.  Thank you!!"}, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
{"user_id": "101744590531577962475", "name": "Karen Prete", "time": 1490196198441, "rating": 2.0, "text": "Ridiculous that you have to wait over 2 1/2 hours just to see a doctor. Early morning appointment (7:45) meant nothing. Still waiting 2 1/2 hours later (10:25).", "pics": null, "resp": null, "gmap_id": "0x88626cacb071fcd3:0x878ea76c7c3ef289"}
