{"user_id": "102044633225368531973", "name": "David Eason", "time": 1615385249558, "rating": 5.0, "text": "I really enjoyed my first experience at Serra Nissan of Sylacauga. I was shopping for a Nissan Rogue. They had a very good variety in stock. My Salesperson was David Vaughn. He was outstanding to deal with. David was very helpful and took all the time I needed to look at the different options. There have only been a few car sales people who I would be willing to deal with again. David Vaughn is in that select group. From our looking, test drive, and eventually negotiating the deal, I could not have been more pleased with my experience. Besides David, his Floor Manager, Ricardo was also very helpful with helping make the deal work. Chad in Finance was great to deal with as well. I highly recommend Serra Nissan of Sylacauga. Ask for David Vaughn!", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "114517178791406659714", "name": "Debra Price", "time": 1627331614772, "rating": 5.0, "text": "Staff went out of their way to show common courtesy and kindness. Marty the sales manager and mattie the sales woman were super. I would highly recommend this dealership. They were fast and we never felt so comfortable.  Thankyou for everything M & M.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "113715260029830275161", "name": "Linde Williams", "time": 1623795613001, "rating": 5.0, "text": "Codie in the Service Department was great! She really cared about me as a customer and it showed. It's difficult to find great customer service but I received it today!", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "114835214530661533071", "name": "LaTonya Chatman", "time": 1623262293818, "rating": 4.0, "text": "The service staff were all very helpful and nice. I have visited another Nissan dealership for service and they tried to push products and services on me that I did not need but this was not the case. They suggested only services that I need. I did not have to wait all day for my service work to be completed.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "107797910402826000208", "name": "Janet Hadley", "time": 1621444098694, "rating": 5.0, "text": "I sent an email to Serra Nissan interested in looking for a new, used car. Frank Morris called me to ask me what exactly I was looking for. Within minutes he sent me pictures with options that met my description. I made an appointment to come see him later that afternoon. When we got there Frank had pulled the vehicles I was interested in. We went for a test drive and fell in love with a 2019 Kia Sonata. Frank was incredibly patient with me and never made me feel pressured to make a decision. He worked with his manager and finance to get me exactly what I needed at the price I wanted. He even called a few days later to make sure we were happy with our purchase. I highly recommend Serra Nissan, and ask for Frank!", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "102271283619473769036", "name": "Nancy Smith", "time": 1628610304173, "rating": 5.0, "text": "Great experience with Jaclyn. And sales manager Marty.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "110327693672062340566", "name": "Quisha Thomas", "time": 1624751536957, "rating": 5.0, "text": "I just want to thank Marty and Madi and everyone that was involved with helping me get my car. Great experience I would definitely recommend sierra Nissan in sylacauga to anyone who needs a car. I was so happy words can't explain.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "109618724300675922501", "name": "SHELIA JOHNSON", "time": 1627260298833, "rating": 5.0, "text": "Love it, great service from Madi and Hardy...love my new car", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "104330408458225825603", "name": "Eddie Jones (SalesSupermanEddieJones)", "time": 1622842847656, "rating": 5.0, "text": "Great people and awesome cars. Plus, Eddie Jones is there", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "103136524503823275788", "name": "David Fletcher", "time": 1613907022063, "rating": 5.0, "text": "The entire team at Serra Nissan of Sylacauga were a pleasure to work with. From the moment we stepped on the lot and we’re not swarmed by sales people, to when sales professional David Vaughn showed us the car we were interested in looking at and test driving, to negotiating on the vehicle with David’s manager ( we only had to make our original offer and one counter), to signing paper work with the F&I manager Hatcher. I was happy when we told Hatcher we already had financing, he only asked what our rate was. He then helped us select an extended warranty that was a better deal than what we had from our bank.\nMy wife hates all the B.S. that happens when you you purchase a car and would rather have a root canal. We would both highly recommend Serra Automotive and sales pro David Vaughn!", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "110896685455287726509", "name": "Tamara Riggins", "time": 1623467691742, "rating": 5.0, "text": "The stuff is very helpful and kind.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "109314151287263213233", "name": "Josh Cline", "time": 1621025879601, "rating": 1.0, "text": "Bought a Ford Explorer from them not even a month later the power lift gate would not work. I called them and they told me to take it to the Ford dealership. They worked hard to get my business but the lack of customer service is horrible after the sale. Wouldn’t advise dealing with these people. Won’t ever be back.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "102441737311270040641", "name": "Michael Harman", "time": 1614050041122, "rating": 1.0, "text": "Dont expect these uneducated mechanics to fix your nissan without replacing parts that It doesnt need before they figure out which part is wrong. They charge triple and are mean about it towards the customer! The girls at the front desk are great! But the mechanics are lazy and not nice.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "116348484949373106108", "name": "Robin", "time": 1613168303521, "rating": 5.0, "text": "I was in Sylacauga (2/10/21) for service for my vehicle.  Onna in the service department was FANTASTIC.  Onna had the best attitude that I've experienced in a long time. Her kindness and willingness to help was outstanding. Onna, YOU ARE AWESOME!!", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "108103408520137999149", "name": "John Mitchell", "time": 1623088037127, "rating": 1.0, "text": "Too lazy to rotate my tires when I had my oil changed! Will not be returning!", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "103169543581309339336", "name": "Stacey Thrasher", "time": 1617266309939, "rating": 5.0, "text": "Fast quick service and very nice employees to deal with.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "116420096793792439198", "name": "Katherine Brown", "time": 1616328582257, "rating": 1.0, "text": "No good they always trying to RIP you off and you never really  be able to get what you.wanted", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP_qglVnBnJhbR1cTOkamn_-rpi64XNFE80NvGE=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "107060994835671423523", "name": "Niki Robbins", "time": 1608069794759, "rating": 1.0, "text": "Well i bought a 2014 Nissan and it had warranties I also had got my key replacement during my warranty that they had neverrrrr program it to my car now I guess it’s my fault the reason they never got to it so now I have a key that can’t be programmed on their account I never had a issue here but this is my first and last time getting played by Nissan in sylacauga only thing I can say is the lady at the front desk was nice!!!", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "118295355225032817714", "name": "Freddie Gaddis", "time": 1614438970638, "rating": 3.0, "text": "Not really  impressed  I call yesterday and was told that the part department would be open(2-27-21) I go out there and part lady not there the Tech that came from shop to look up part done a great job and found the part I need. Part Can't be ordered until Monday(3-1-21)now. Thanks to the Tech who went above and beyond find the part I need.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "116395947441583456822", "name": "MARSHALL KING", "time": 1623173311553, "rating": 4.0, "text": "I had the oil changed in my truck.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "115233085813588500443", "name": "Brittany Norris", "time": 1616170570099, "rating": 1.0, "text": "If I could give NO stars I would! Do not purchase from here. Horrible!!!", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "106684719339798992189", "name": "Leslie Clark", "time": 1626726245276, "rating": 5.0, "text": "Above and beyond anything I ever expected", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "116385103526869621429", "name": "Jamie Lee", "time": 1605902359483, "rating": 5.0, "text": "I was shopping for a vehicle due to unrepairable damages to my car after a storm. The friendly and helpful staff made the experience easy.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "111888323106242968093", "name": "Lorine Jordan", "time": 1612702944108, "rating": 5.0, "text": "Good Car deal! Great Car Salesman!!", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "117461991744127424586", "name": "Detrick Cook", "time": 1615411819483, "rating": 5.0, "text": "Great place to go for service.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "108619230804933287068", "name": "Amanda Ebert", "time": 1604000002346, "rating": 5.0, "text": "Kurtis was a huge help! Thanks for helping us come home with a new car!", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "103638038594315595202", "name": "love heart", "time": 1617050096584, "rating": 1.0, "text": "Lying scammers is exactly what they are.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "110652514991201730426", "name": "mary reynolds", "time": 1570148469221, "rating": 5.0, "text": "My Rogue needed some work and the dealership where I purchased the car and the next closest dealership were too busy to help me in the time frame I needed. So my son-in-law called Sylacauga and they said bring it on in and we will take care of you. Super Super nice and very professional employees. They took care of my issues faster than we expected and I would highly recommend them to everyone.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "103034238464404796484", "name": "L G", "time": 1593268557631, "rating": 5.0, "text": "My experience was very pleasant I think the young lady name Miss Alana she is very friendly and courteous  she is always helpful to me everytime I come to get my oil changed the world need more people like her", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "100607314891307183369", "name": "Teresa Huff", "time": 1611846325614, "rating": 5.0, "text": "Sales reps were friendly and worked to make the deal happen.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "107212365030039202299", "name": "Daffney Holley", "time": 1594744565926, "rating": 5.0, "text": "I brought my suv in for a tire expection and I needed my tire patch tire rotation. And while I was there got a whole service for my suv as well. I really do appreciate how well they did everything that I needed done.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "111157734935932861714", "name": "Crystal Wilson", "time": 1589051815781, "rating": 3.0, "text": "CONVENTIONAL OIL & FILTER CHANGE    $39.95\nTIRE ROTATION & BALANCE                        $29.95\n\nI was told I needed windshield wipers. I ask how much and the service man said $18. I said ok, go ahead and change them. He did not say per blade. He misrepresented the item.  The price I was charged with discounts is not the problem. I now do not feel I can trust your service staff without questioning their ability to treat the customer fairly. I never had a problem with the Nissan in Carrollton, Ga with years of service.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "108179653376020747359", "name": "L. T.", "time": 1593124458874, "rating": 4.0, "text": "Great experience with them. They are very nice and very attentive to your issues.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "117087928327286652006", "name": "Lorraine Connell", "time": 1537048490783, "rating": 5.0, "text": "I was pleased with your very friendly and efficient service personnel.  Sharon made my waiting time pleasant, while my car was getting an oil change. She also informed me of what service needs my car will  need in the near future. No pressure just a nice \"heads up\" ! I wish all service personnel were as nice as Sharon !", "pics": null, "resp": {"time": 1537192719800, "text": "Thank you Ms. Connell for the great review! Alana and Sharon, our service writers here at Serra Nissan are amazing!!"}, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "117244227780229802453", "name": "Jeanne Smith", "time": 1534168272690, "rating": 4.0, "text": "We found the exact car we wanted. The sales part was seamless. There was a wait to get in with the finance office as there was only one for three dealerships. The follow-up on issues from our salesman was non-existent. He said he’d order things and never did. After two calls to him I spoke to the sales manager and I think we’re going to get satisfaction. Overall, the team was personable and mostly professional. I would recommend Serra Nissan.", "pics": null, "resp": {"time": 1534176019755, "text": "Ms. Smith, I just wanted to let you know that we have ordered your owner's manual and key fob. We will be calling you when it comes in. Thank you for being a valued customer of Serra Nissan of Sylacauga!!"}, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "106780005730774250541", "name": "Yakeshia Dates", "time": 1559430525994, "rating": 5.0, "text": "The lady took GREAT care of me at the Sylacauga Serra Nissan name Sharon. I was very pleased with her service. She is always very nice and polite.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "106864502423223964015", "name": "terese c", "time": 1551591497154, "rating": 3.0, "text": "I was not impressed with the hospitality, of the service department. In the pass I would take my cars here. When I bought my daughter a car she brings it here. So I do not come often. The staff is entirely different! The service department was the only reason I continued to purchase cars from this location in the past. Anyone can sale me a car, salesmen are all the same. But the service department keeps my new car in good condition. Service wasn't bad, just not what I was use to. Miss Kim, Ken.......Andrea❤!", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "104990118055481631483", "name": "Lisa G.", "time": 1542210496317, "rating": 5.0, "text": "It's a awesome place everyone was great in the service department and parts. Mrs Sharon , Tabitha and David are people that go out of there way to make me very pleased that I purchased my car here and that having my car serviced here is always in good hands. Thanks guys awesome job.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "111999961448396069256", "name": "Destiny Moon", "time": 1580928246359, "rating": 4.0, "text": "The tech was very resourceful and polite he gave great conversations just a very good experience", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "113445645416819353508", "name": "Melanie Nelson", "time": 1536759344603, "rating": 5.0, "text": "Although Jeff Adams wasn't our salesman, he spent 2 and 1/2 hours with me helping me get the vehicle that I really wanted.   Mr. Jeff Adams is a tremendous asset to this dealership, and if we ever look to trade or buy, I will ONLY do business with him.  He didn't benefit at all from those hours with me, but he never hesitated to be right there, available, by phone and text even after leaving the dealership that afternoon.  Offering advice, encouragement and kindness.  Sometimes you need more than a knowledgeable salesman, sometimes you need a compassionate, considerate human being with commission or profit not the first thought.  This was my first new car purchase in over 32 years, and I would definitely recommend friends to shop here.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "116918290111915402170", "name": "Tyler Norwood", "time": 1558623319006, "rating": 5.0, "text": "The girls behind the counter in the parts and service department have gone out of their way to help with warranty info, setting appointments, etc to try to get an ongoing problem with my truck fixed. They definitely deserve 5 starts. Now if only the mechanics could diagnose and fix the issue...but, that’s been a problem with every dealership  ive taken it to so that’s no really just on Serra Nissan.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "114026362779732988363", "name": "Philip Hopper", "time": 1534791699774, "rating": 5.0, "text": "Everyone at Serra made my buying experience flow easily. There was no pressure like I have had at previous car lots.  Each person in the process from the online account rep to the sales person to the finance team was knowledgable and helpful in making my purchase. They even brought my vehicle to me the next day after fixing one of the tires . Only negative thing was having to go down the road to another building to do all the finance work.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "102602983531232936990", "name": "Peggy Caine", "time": 1573600170198, "rating": 5.0, "text": "You all was very nice and did a good job on my car and truck..Thank you Peggy Wesson", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "116418213124129837480", "name": "Mindy Jones", "time": 1521224189545, "rating": 5.0, "text": "David Compton was the absolutely most helpful person.  My little Nissan need something and he knew exactly what I need and  even took the time to explain the steps for getting my Nissan looking great as always!  10/10 would recommend David  to another person in need.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "112043657133398857910", "name": "John E Clough", "time": 1535031480257, "rating": 5.0, "text": "Efficiency and knowledge seemed to be motto. Made an extra effort to show me a friendly pleasant service visit. All of the staff that I came in contact with acted as though my reason for visiting was important.", "pics": null, "resp": {"time": 1535034603169, "text": "Thank you so much for the great review, Mr. Clough. It was a joy talking to you this morning."}, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "103054888170886711823", "name": "Takeila T", "time": 1551477071629, "rating": 3.0, "text": "I have been to this service center before and it didn't take as long and I was semi prepared for a wait on a Friday....however I did not think it would be close to 2 hours. The lady that checked me in went to lunch for an hour and came back and was shocked that I was still waiting and no one had even acknowledged that it had been so long. A tip would probably be to update customers with an estimated wait time. But the staff were friendly and were pleasant just busy and overworked or either they lacked a system for managing the customers.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "106598797514072820995", "name": "Everything MsJae", "time": 1614465943564, "rating": 5.0, "text": "Thanks David so much. I love my new car.  😁😁😁😁😁😁😁😁😁😁😁😁😁😁😁😁😁😁😁😁😁", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "110023760715617039676", "name": "thyra harmon", "time": 1558626840191, "rating": 5.0, "text": "James was a Great salesperson. Nate was very helpful too- great experience. 3rd vehicle bought at Serra.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "115299725228324707691", "name": "Riley Coyote", "time": 1528392122744, "rating": 5.0, "text": "David in the Parts department went above and beyond with customer service! I needed to special order some hard to find parts and he couldn't have possibly been more helpful! Thank you Serra Nissan for your awesome knowledgeable staff!", "pics": null, "resp": {"time": 1533330895576, "text": "Thank you for such a nice review!!"}, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "112417788486642144932", "name": "Lauren Parker", "time": 1536853903487, "rating": 5.0, "text": "Jessica was awesome to work with! She was very friendly and helpful, not pushy like most car salesman. Very thankful for her and Serra Nissan! I love my 2018 Murano! 😍", "pics": null, "resp": {"time": 1536952078986, "text": "Lauren, thank you so much. We appreciate you, here at Serra Nissan of Sylacauga."}, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "107782729610310629897", "name": "Richard Morgan", "time": 1596822915365, "rating": 5.0, "text": "Got me in and found trouble while I waited and will fix when part comes in!!", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "114870984013551968457", "name": "jennifer williams", "time": 1605385311586, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "107816236196588942271", "name": "Demetrius Roston", "time": 1533393065437, "rating": 5.0, "text": "Awesome hospitality....awesome people...Ms. Sharon was an excellent addition to the staff....she assisted me in my car being seviced..she made me feel at home and had good conversation for the me as the customer... Ms. Dena was also great and Ms. Alana had great a great personality as well. I look forward to my next visit.", "pics": null, "resp": {"time": 1533397577295, "text": "Thank you for the positive review!! You are a valued customer at Serra Automotive. We appreciate your business."}, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "113488757385876335970", "name": "Matt", "time": 1561575895927, "rating": 5.0, "text": "This is a very nice place, people are friendly and professional. I highly recommend this Nissan dealership.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "113053844932148883339", "name": "Hoss Reyes", "time": 1538146971850, "rating": 5.0, "text": "Your tech Kenny, and earl were great!  Your service advisor Sharon was bubbly and great to be around. Y’all are awesome!! Thank you!", "pics": null, "resp": {"time": 1538410622615, "text": "Thanks so much, Mr. Reyes!!"}, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "103749088168467071390", "name": "Tongelia Thomas", "time": 1599160125190, "rating": 4.0, "text": "They were fast and friendly", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "112282689987239431195", "name": "Debbie White", "time": 1533307701079, "rating": 5.0, "text": "They were very friendly and helpful in everyway--returned my calls and talk to me a lengthy time and very knowledgeable. Great group of people to work with in the Nissan service department.", "pics": null, "resp": {"time": 1533328906154, "text": "Thank you so very much for such a great review. We truly do appreciate your business."}, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "115861384654568290589", "name": "Jeremy Jackson", "time": 1572024403785, "rating": 5.0, "text": "Really helpful staff and quick service.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "111856795836135871946", "name": "Daniel BUCKNER", "time": 1556816290478, "rating": 2.0, "text": "Sales was a great experience but when you have defect on your vehicle and have to get it fixed expect it to take several days for a simple fix and to be refused a loaner vehicle while waiting on your busy day to day life.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "118400982342407292034", "name": "Teresa Watts", "time": 1535587027705, "rating": 4.0, "text": "Rachael was great she went above and beyond to make sure I was taken care of. I love the car just wish they had cleaned it better there is still food crumbs and glue on the steering wheel", "pics": null, "resp": {"time": 1535636838697, "text": "Rachel is a wonderful sales person. I'm glad you had a great experience with us. Please call me so we can schedule a time for you to come in and get your car fully detailed."}, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "109950088317634901172", "name": "Jayme Moore", "time": 1521590182942, "rating": 1.0, "text": "If I could give zero stars, I would. Worst experience I have ever had with a car dealership. We test drove a new Titan and were quoted a price. After shopping around, and them blowing my phone up, we called/texted back and were told they would honor the quote given by two different people, including a manager. We made sure of this prior to going, as it is a bit of a drive. When we arrived, they had myseteriously lost our information and the quote they had just referenced on a call the day before from the manager. We refilled out everything, and suddenly the quote was $43k instead of the $38k we were offered previously and told over the phone they would honor. When I called them on the discrepancy, they suddenly started saying that the quote had been on a used Titan, even though they didn't have any used Titans on the lot, and we had driven and looked at four different new ones. The manager on duty (different from the one I had talked to multiple times on the phone), talked down to us and said it was a \"misunderstanding\". We presented the facts, but the manager blew us off, so we walked out.  They deliberately mislead us, lied, and tried to slide a higher price in on us, even though we had an agreement prior to arrival. I will never do business with Serra in any capacity after this experience.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "111091564911427375241", "name": "Shun Drake", "time": 1518907858103, "rating": 5.0, "text": "I have always had a great experience at Serra Nissan in Sylacauga Alabama. Morgan was very knowledgeable and helpful when I came into the dealership looking to trade vehicles. Morgan walked be through the entire process and she answered all my questions.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "116852633588145079932", "name": "cat_g 73", "time": 1552699575224, "rating": 5.0, "text": "They worked hard and got us the best deal, better than what we expected.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "103189678406922614935", "name": "Crimson Harper", "time": 1537016453579, "rating": 5.0, "text": "We love BIG COUNTRY (Jessica shell) SHES THE BEST. Jim Knight is such an amazing manager great work guys thanks for the beautiful new car and everything y'all did for us...", "pics": null, "resp": {"time": 1537017589901, "text": "Congratulations on the purchase of your new car!! We appreciate you, our valued customer, here at Serra Nissan of Sylacauga!!"}, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "112745137165894350009", "name": "leeleenewsome Newsome", "time": 1583174121047, "rating": 5.0, "text": "I had my car towed in due to the alternator going out. They got right to work on it and had it repaired in no time! Thank you to Kenny Stewart and Alana for your hard work!", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "109654830159531076184", "name": "Alfred Wahnish", "time": 1536682473531, "rating": 5.0, "text": "This was the easiest new car purchase experience I've ever had, and over the last 50 years, I've had many!  I was able to conduct the major part of the price negotiation over the phone with the Internet Specialist prior to my going to the dealership in Sylacauga.  Other dealerships I contacted were reluctant to do this and wanted me to be on their lot to \"show my commitment\".   I didn't want to spend the day haggling, so I went where I was able to have a meaningful dialogue.  Once on Serra's premises, I was treated courteously and they were very respectful of my time.  The whole process took just over 2 hours, and I was driving off in our 2018 Murano!  I would highly recommend giving them a call!  It's worth the drive!", "pics": null, "resp": {"time": 1536683401900, "text": "Thank you for the wonderful review. I will gladly pass this on to your salesperson."}, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "117178787498977838568", "name": "Antonio Davis Jr", "time": 1536846420461, "rating": 5.0, "text": "This place was very helpful and the lady at the desk is superb did a wonderful job thoroughly explained everything overall great experience", "pics": null, "resp": {"time": 1536952120600, "text": "Thank you, Mr Johnson. We sure do appreciate you, here at Serra Nissan of Sylacauga!!"}, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "108141397507785940725", "name": "Dori Turner", "time": 1534392419461, "rating": 4.0, "text": "Over all everyone was great.. my only issue was the red wasps nest in the rear hatch of the car you had me test drive..", "pics": null, "resp": {"time": 1534526019026, "text": "Mrs. Turner, it was a pleasure meeting you yesterday."}, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "103720998676782674692", "name": "Jason Towne", "time": 1524363854864, "rating": 5.0, "text": "The sales agent Deann Hall was very attentive and very thorough at finding out what we were looking for.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "105138764285945856652", "name": "Teresa Maxwell", "time": 1514407389973, "rating": 1.0, "text": "This place is full of biased and bigoted Management. I went there today because I supposedly won a $500 gift card from Walmart.  I was wearing tennis shoes, sweat pants and a tee shirt. No make-up and my hair was in a ponytail. I showed the \"Winning\" circular to the management and I sure  did win a card from Walmart. One for $5 not $500 like the circular said I had won. NO ONE tried to even sell me a car. I was dismissed by the person that told me I had only won $5. If , sometime in the future, I need a vehicle, I will NOT go to this place nor recommend  this place to anyone.\nI truly believe if I had been \"dressed to the nines\" I would have been treated better.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "104437100223768044605", "name": "Amy Maddox", "time": 1487172152116, "rating": 5.0, "text": "Extremely pleased with my purchase last year of a 2015 Altima from Serra Nissan.  My vehicle has been taken care of  in service by a friendly young man named Dustin.  I love my Nissan! Thank you!", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "112113181803887907435", "name": "Candice Payne", "time": 1541099225160, "rating": 1.0, "text": "Set appointment to see car. I live over an hour away, drove all the way there just to be told the car sold 3days prior. Horrible experience.No one thought to call .... just very unorganized for my first experience. Handled very poorly", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "104813810106440100254", "name": "Lexius lexichanbass@yahoo.com", "time": 1570837255439, "rating": 5.0, "text": "I had a great experience!", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "116437753292317935160", "name": "Hustle-ANN Heart", "time": 1537016800672, "rating": 5.0, "text": "Jim Knight and big country are unstoppable. They make promises they can actually keep. Thank you for going above and beyond for our family you guys rock.", "pics": null, "resp": {"time": 1537017513517, "text": "Thank you for the wonderful review for Country and Jim! We, here at Serra Nissan of Sylacauga, are thankful that we have such an awesome team to help our awesome customers, such as yourself!! Congratulations on the new vehicle!!!!"}, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "101247476273143175612", "name": "Mark Flanagan", "time": 1535221089258, "rating": 2.0, "text": "My son & I had some issues with the paperwork, our names listed incorrectly on the financial institution paperwork but on the title paperwork for the Alabama license dept was correct.  I had to call the financial institution we were using to purchase the vehicle to get it corrected.  The gentlemen completing our paperwork could never be reached & I found out later was fired.  I was never informed when my car matts would be in, I had to call multiple times.  Apparently several other managers were let go.  The one person who helped me and communicated with me was Laci Branch and helped get everything resolved.  Hopefully the new management is following through their commitments to the customer.  I would give them another shot on my next car because pricing was good, worth the hour drive, 2012 Nissan Murano purchased has been a good dependable vehicle so far, and Laci did a excellent job fixing the problems we had..", "pics": null, "resp": {"time": 1535231355921, "text": "Mr. Flanagan, my name is Dena Napier-George. I am the Owner Loyalty Manager here at Nissan. I'm touching base with you to make sure that everything is okay with your Murano now. Please get in touch with me via email at dnapiergeorge@serraautomotive.com or feel free to contact me at 256-5000 ext. 2518 I will be here until 5:30 today."}, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "105896187391606869919", "name": "Jacob Miller", "time": 1518235708509, "rating": 1.0, "text": "Corrupt.  Crooked.  Thieving.  Conniving.  12 month Grinch that never recants.  Stay away from this place.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "107173814729700743956", "name": "Jeri Sanford", "time": 1501799224909, "rating": 1.0, "text": "They called and asked me to come in for a great deal. I drove from Pell City. I was informed my credit would only allow for a new car when I had wanted a pre-owned car. They showed me a basic Versa with nothing extra. I'm thinking if the payment is low enough... $410 a month for 7 years. That included an extended warranty I didn't ask for. I would pay for the car in a year and a half with those payments. So what's the 7 years about? I left. Got a message, great news, we can work with you. I came back, same story and deal. Why waste my time? I didn't call you, you called me. This place is a joke.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "117714072793127300356", "name": "Penny Brooke", "time": 1524757935889, "rating": 4.0, "text": "Excellent deal on my truck. Paper work takes way too long. Deann was super.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "112643158802932970935", "name": "Brook McMillan", "time": 1549855063797, "rating": 1.0, "text": "NEVER BUY A CAR FROM THIS LOT!\nI recently bought a Nissan Vera Note. The car seemed well at first then 2 months later the transmission went out and when we went to tell the management about the incident they laughed in our faces and cursed us out of the building. The company gave NO effort to help pay for or help like a company should. I am a full time working college student and will have to take out a large loan to fix the WHOLE transmission.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "112427941229089035215", "name": "Eunicelynne Chavis", "time": 1546729862940, "rating": 1.0, "text": "Drove 2 hours give us one price over the phone in a totally different when we got there.. unreasonable!", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "100009130881071850653", "name": "James Kelley", "time": 1517873233194, "rating": 5.0, "text": "Had recall work done. Work was completed in a timely manner.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "105761354786360117532", "name": "Shenikia Malone", "time": 1510787902356, "rating": 5.0, "text": "I just bought a 2017 Nissan Maxima and I love it!!!! Great cars, great customer service", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "102576550580264115468", "name": "Jamie Martin", "time": 1450230637552, "rating": 1.0, "text": "Very disappointed!  I called Serra on Dec 12, 2015 to inquire about a car on their website.  It seemed like an awesome price.  However, I didn't want to drive to Sylacauga from Cullman without more info. The dealer I spoke to proceeded (as expected) to sell me a new car rather than the used one I called about.  He finally said he would go to the used lot across the street to check on the car I called about.  He called me back and said they haven't ever had the car that I called about and that their internet guy makes lots of mistakes.  I checked the internet today (Dec 15) and the car is still listed. Instead of the well priced $15999, it is now listed at a more logical $19900.  I don't appreciate being told a lie.  I would have probably bought the car Saturday at the advertised price.  I would have even appreciated being told the appropriate price more than being told a lie.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "106424229086997133185", "name": "Alan Potts", "time": 1533986200234, "rating": 5.0, "text": "Excellent service. Friendly staff", "pics": null, "resp": {"time": 1533994265871, "text": "Thank you Mr. Potts for a great review. We value you as a customer here at Serra Nissan of Sylacauga."}, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "117500969496736924022", "name": "Earnest harris", "time": 1590023418575, "rating": 5.0, "text": "Good business and great people!!!!", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "107498450820489289965", "name": "Susan Compton", "time": 1489164036140, "rating": 5.0, "text": "Parts Manager is awesome!  David was so helpful!", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "117418448093848611026", "name": "jayman1972", "time": 1535034036463, "rating": 5.0, "text": "Service and sales are fantastic! Highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "115308261584624078228", "name": "Markeece Swain", "time": 1538160815741, "rating": 5.0, "text": "Very Nice people and Great Service", "pics": null, "resp": {"time": 1538410601607, "text": "Thank you Mr. Swain!!"}, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "112613790368507948970", "name": "Leshia Russell", "time": 1550259879073, "rating": 3.0, "text": "Good people to work wirh", "pics": null, "resp": {"time": 1550263919622, "text": "Thank you, Leisha! Please let us know what we can do in the future to get a 4 or 5 star rating and we will endeavor to do so!"}, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "102790157225835086576", "name": "Henry Jones", "time": 1571631570692, "rating": 5.0, "text": "Very professional and polite", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "112782189940010088109", "name": "Johnny Davis", "time": 1602025739407, "rating": 2.0, "text": "Slow  service", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "104163913529776697777", "name": "Leonard McDaniel", "time": 1536427470462, "rating": 5.0, "text": "They where just on time put me in a 2016 car note low thanks serra Nissan", "pics": null, "resp": {"time": 1536599038364, "text": "Wonderful! Thank you for the great review!!"}, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "103951026006158667585", "name": "barbara mccullers", "time": 1557235927736, "rating": 1.0, "text": "The technician should not tell me that AC compressors just leak freon. THEY DO NOT!!!!!", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "113920861392222078736", "name": "Darlene Willis", "time": 1541416356029, "rating": 4.0, "text": "They tried to get us in a vehicle, but some we're not friendly", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "106458259566100263373", "name": "Shameka Jones", "time": 1497971398853, "rating": 5.0, "text": "Great customer service.", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "118032275159360757391", "name": "margaret white", "time": 1516497173878, "rating": 1.0, "text": "Absolutely horrible customer service needs reporting to better business bureaus", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "106041795177769034905", "name": "Shana Peters", "time": 1531669273737, "rating": 1.0, "text": "I talked with the online sales rep about a vehicle to verify if it was available was told it was. advised i could come test drive it same day. Drove an hour to get to the lot only to be told by another salesman that the vehicle was on test drive all weekend.", "pics": null, "resp": {"time": 1533412078370, "text": "I'm very sorry for your negative experience, here at Serra Nissan. I would love to have the opportunity to hear of your experience. Would you mind calling me at (256)245-5000 ext. 2518?"}, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "102221025294046400005", "name": "Christy Stone", "time": 1572980619741, "rating": 5.0, "text": "Excellent service", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "118418107995047534274", "name": "Natalie Morton", "time": 1497987088104, "rating": 5.0, "text": "Great from start to finish!", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "107744937567585352066", "name": "Adrian Marin", "time": 1498959880725, "rating": 5.0, "text": "Real awesome customers!", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "111385809110845207708", "name": "Deanna Helton", "time": 1533257064469, "rating": 2.0, "text": "Slow slow slow left without even getting what i came for which was a key", "pics": null, "resp": {"time": 1533304594443, "text": "Thank you for your review. I called you this morning to resolve the issue at hand. Please feel free to contact me at 256-245-5000 ext. 2518"}, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "105110484887313704221", "name": "Cindy Patterson", "time": 1533004568012, "rating": 5.0, "text": "Very professional business", "pics": null, "resp": {"time": 1533328971521, "text": "Thank you for such a great review. We really appreciate you as a customer of Serra Nissan."}, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "110862999984684051962", "name": "Meagon Cqrver", "time": 1497383141867, "rating": 5.0, "text": "They are great,fast and friendly", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "116581262973939460579", "name": "Steven Hayes", "time": 1529109455614, "rating": 5.0, "text": "Our salesperson was awesome", "pics": null, "resp": {"time": 1533329128907, "text": "Who was your salesperson? I would personally like to thank them for your wonderful review."}, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "115213123322913185420", "name": "Elizabeth Rocklewitz", "time": 1550496629784, "rating": 3.0, "text": "Brought 2 cars here..", "pics": null, "resp": {"time": 1550497896517, "text": "Elizabeth, thank you for your review. Please let us know what we can do in the future to make sure your satisfaction level is 5 stars!"}, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "100957186490106604273", "name": "Wendell Scott", "time": 1556235467384, "rating": 5.0, "text": "The staff is very professional", "pics": null, "resp": {"time": 1534525922838, "text": "Thank you Mr Scott for being a valued customer at Serra Nissan"}, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "105332461536494446574", "name": "Roger Kerr", "time": 1537226988361, "rating": 1.0, "text": "prompt and courteous", "pics": null, "resp": {"time": 1537548054435, "text": "Mr. Kerr, please call me at 256-245-5000 ext. 2518 so that we may discuss any problems you may have had."}, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "117530955807012898943", "name": "Zoie Cleveland", "time": 1535643642199, "rating": 5.0, "text": "helpful and kind", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "114397167281100414116", "name": "caden moore772", "time": 1521589486818, "rating": 1.0, "text": "They will screw you", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "115856131741733711205", "name": "Bob Hendrix", "time": 1582824486032, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "105247957240396939219", "name": "Tasha Duncan", "time": 1529459820116, "rating": 4.0, "text": "Great staff", "pics": null, "resp": {"time": 1533329034306, "text": "Thank you!!"}, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "106892713854663643721", "name": "Andrew Parrett", "time": 1575061422780, "rating": 1.0, "text": "GARBAGE", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "114127783279044462845", "name": "Michael Rowland", "time": 1503211081835, "rating": 5.0, "text": "Good people", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "106848772267844563132", "name": "James Dawson", "time": 1486939823574, "rating": 5.0, "text": "great people", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "112466053760378425172", "name": "Stacy Bridges", "time": 1531382276409, "rating": 5.0, "text": "Friendly and professional services", "pics": null, "resp": {"time": 1533329008228, "text": "Thank you for the review. We appreciate you as a customer of Serra Nissan."}, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "113706373260401682044", "name": "david hughley", "time": 1499343222804, "rating": 1.0, "text": "Not organized", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "108707581499947122863", "name": "kathleen jefferson", "time": 1499000807041, "rating": 2.0, "text": "Not organize", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "109639750912119864742", "name": "Ryan Vidischak", "time": 1535651204862, "rating": 5.0, "text": "(Translated by Google) Thanks Laci and Allanah for the great service! Very trustworthy and upfont!\n\n(Original)\nThanks Laci and Allanah for the great service! Very trustworthy and upfont!", "pics": null, "resp": {"time": 1535656888975, "text": "Thank you Ryan, for the great review!!"}, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "115706211239597546609", "name": "Sunday Swain", "time": 1585672566031, "rating": 3.0, "text": "(Translated by Google) It was me\n\n(Original)\nIt was ik", "pics": null, "resp": null, "gmap_id": "0x88895711af6bf395:0xf85e7c23a42a1fcc"}
{"user_id": "105175825798611923012", "name": "Kristina Podolnick", "time": 1626467349298, "rating": 5.0, "text": "Sonia was fabulous!  Our daughter needed a car quickly.  Sonia was able to find her the perfect car and get the deal done in 24 hours even though we are more than 900 miles away!  The easiest car buying experience we have ever had.", "pics": null, "resp": {"time": 1626970027828, "text": "We are so glad Sonia was really able to help you and your daughter out! It is great to know that we provided you with a positive experience. If there is any way we can be of further assistance please let us know. Thank you for the review and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "114671274537317932962", "name": "Terra Koen", "time": 1627423949342, "rating": 5.0, "text": "Met with Sonya, and she immediately just started showing me vehicles that were in my price range and the style I preferred. never once did she try the \"sales pitch\" on me, and there was not 1 harassing call/text. Finance guy was wonderful and very friendly. Made our vehicle purchasing a breeze!", "pics": null, "resp": {"time": 1627659357082, "text": "Thank you for the kind review! We are so glad to hear that Sonya was able to provide you with such a positive experience. If there is any way we can be of further assistance please let us know."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "108431628832867775739", "name": "ALICIA BERGA", "time": 1626273582793, "rating": 5.0, "text": "Best experience ever.  I have purchased two vehicles both from Kohl who is the best salesman ever!  Dan is amazing Sales Manager and Finance too!  Luckily I had him for Sales Manager and Finance.  My next vehicle will definitely be purchased from them.  There is nothing but great things I could say all day.  Not one bad thing.  Go see Kohl and Dan!!", "pics": null, "resp": {"time": 1626971528874, "text": "We strive for 100% satisfaction, and it is great to see you had such a positive experience with our staff! We hope that we can assist you again in the future. Thank you for the review and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "114110454088721951164", "name": "D Rogers", "time": 1623352722479, "rating": 5.0, "text": "Very impressed with the service and friendliness of the staff. Dealership waiting area was clean and comfortable with bottled water and coffee available.  Had a waiting area in showroom area (nice and bright) and a second area with a television in a viewer friendly area. TV had a remote available for choosing channels. Nice work space with charging stations available for those wishing to take care of business.  I had scheduled an oil change and tire rotation and feel it was done within a reasonable time frame.  Enjoyed chatting with other individuals my age and will be going back to this dealership.", "pics": null, "resp": {"time": 1623432314769, "text": "We are so glad everything was completed in a timely manner. It is great to hear about your positive experience during your service visit. We look forward to assisting you again in the future. Thank you for the review and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "100776329591669388682", "name": "Heather Manhart", "time": 1625315422462, "rating": 5.0, "text": "Our family of five lost our A/C traveling from Illinois to Gulf Shores in June. It was HOT. We knew we needed to get it fixed before we headed home so we called Sandy Sansing and they got our car in the next day! They had us fixed up and ready for the “cool” ride home by our departure date. Only thing that could have made it easier was if they had rental cars on site but two rental companies are just down the road so no problem. Thanks for your friendly service! A/C is still going strong!", "pics": null, "resp": {"time": 1627047644820, "text": "We are so glad we were able to get you back on the road! It is great to hear about your positive experience with us. If there is any way we can be of further assistance please let us know. Thank you for the review and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "107383347163601546333", "name": "Leah Salter", "time": 1626798534292, "rating": 5.0, "text": "We went around the 4th of July weekend to trade in our car for a Nissan Rogue. Our sales representative, Matt Cali, was amazing. Definitely made our experience wonderful.", "pics": null, "resp": {"time": 1626969888746, "text": "We are so glad to hear that Matt was really able to provide you with such a positive experience. If there is any way we can be of further assistance please let us know. Thank you for the review and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "116638241060178495183", "name": "Howard Korff", "time": 1620833459540, "rating": 5.0, "text": "After buying a Nissan someplace else, I started going to this dealership for my service and it has been awesome. They are friendly and though. They help me weigh my options and try their best to work with my busy schedule. They even vacuumed out my car for me. Jessee Sawyer has been the rep I usually deal with and he makes it so easy but I have really been impressed with all the staff. I am so glad I pulled in there the first time.", "pics": null, "resp": {"time": 1620844635930, "text": "We are glad we have been able to really help you out. It is great to hear about your positive experience with our staff. We hope we can continue assisting you in the future. Thank you for the review and have a great day"}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "102201982318804058164", "name": "Jim Sutton", "time": 1626353076183, "rating": 3.0, "text": "Rebuild brake system master cylinder, re-surface front rotors, new front brake pads, flush/replace brake fluid. Fixed \"mushy\" brake pedal feel, seems to be a competent brake job.\nNegatively, it took EIGHT BUSINESS DAYS to accumulate the parts needed for this routine kind of maintenance/repair.  In the meantime after we inquired about progress every day or so (we were never proactively informed), each time we were told the parts would be in the next day's delivery.\nI'm not saying all of this is the establishment's fault, just relating the overall frustration of the experience.\nOne star for the experience, four stars for what seems to be an effective repair.", "pics": null, "resp": null, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "102692875625123450094", "name": "Randy Moris", "time": 1622743721421, "rating": 5.0, "text": "Everything worked out exactly as I expected it to. I had an early morning appointment and your service department put my vehicle in right away and finished all the work quickly. Everything was explained clearly of the work done. The technicians were courteous and answered every question I had. I will return to Nissan in Foley the next time I need service work and routine maintenance", "pics": null, "resp": {"time": 1622839014601, "text": "We are glad everything was completed quickly and to your satisfaction! We look forward to assisting you again in the future. Thank you for the review and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "112247646016087512928", "name": "Lisa Jones", "time": 1620845823339, "rating": 5.0, "text": "My son bought his first brand new car from Glenda last week! She was so nice and treated him with respect. He is a young man starting out in life and really needed the boost of self esteem!! Everything was handled great and they got the car they wanted! Thank you so much Glenda for your help and being so professional!", "pics": null, "resp": {"time": 1621005350852, "text": "We are so glad to hear that your son had a positive experience with us! We will pass along the kind comments to Glenda and the rest of our staff. Thank you for the review and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "103022628324379222797", "name": "Evan Wilson", "time": 1619552978371, "rating": 5.0, "text": "I bought my very first new car from there, for a really fantastic price. I worked with Sam, he is a very knowledgeable as well as an easy person to work with. The employees there treated me very nicely and with respect while answering my many questions. I highly recommend visiting and talking to Sam if you are looking to buy a new or used vehicle.", "pics": null, "resp": {"time": 1619634699982, "text": "Congratulations on your new car! We are glad Sam was able to really help you out. If we can assist you further please let us know."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "114474535176621277396", "name": "Martha Custer", "time": 1621127900598, "rating": 5.0, "text": "Jessee Sawyer was extremely nice & kind and did exactly what he said he would do about notifying me if my vehicle was going to be ready at the time I needed.\nHe was very knowledgeable and explained everything that my Rogue needed and why it needed it.  He was very polite and I hope to see him the next time I bring my vehicle in for service.", "pics": null, "resp": {"time": 1621286712768, "text": "We are glad to hear that Jesse has been able to really help you out! We look forward to assisting you again in the future when the time comes."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "106211042510104784194", "name": "Izzy Watson", "time": 1616861510650, "rating": 5.0, "text": "Jesse was absolutely awesome! He was so knowledgeable and sweet. I went WAY over my out change without knowing it and he made me feel so much better! He was so polite, and even fixed the settings on my car and explained it all to me so that didn’t happen the next time! If you are ever going there for service ask for him!! They even vacuumed my floors!! I’m so thankful for the guys here!!", "pics": null, "resp": {"time": 1617031748953, "text": "We are plesaed to know our Service Department was able to assist you. We appreciate you taking the time to let us know how we did."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "110169345884016244935", "name": "Tiana Jones", "time": 1616905649346, "rating": 5.0, "text": "Would like to thank Timothy Holly for his excellent service today as he guided us through our steps into purchasing our new car!! We love it and we are forever grateful and blessed to have the best sales consultant/ cousin to help along the way. I would highly recommend you visit and purchase something that catches your eye. If he's not busy ask for Timothy he will most definitely help you if he can in any.", "pics": null, "resp": {"time": 1617031469806, "text": "Thank you for the review! We are so glad Timothy was able to help you out. If there is any way we can be of further assistance please reach out to us. Thank you again and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "113245609067277916623", "name": "Preston Whited", "time": 1625264137899, "rating": 5.0, "text": "Our experience was beyond words. We were on vacation in Gulf Shores and the day before we leave our Rogue was having trouble and we could not have traveled home - sounds like a commercial but i promise it is the way life works for us. I called and talked to Joe on Thursday evening just before close and he asked me to bring our car in as early as possibe on Friday. We arrived at 7:00 am - Joe greeted us and proceeded to figure out the issue.\nHe and his team were an absolute blessing! The staff and service are hands down the best!", "pics": null, "resp": {"time": 1627048050465, "text": "We are so glad we were able to help you out! It is great to know that we were able to get your vehicle back on the road. If there is any way we can be of further assistance please let us know. Thank you for the review and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "106572903807537806941", "name": "Kym Daniels", "time": 1619542231261, "rating": 5.0, "text": "Excellent experience! I brought my 2019 Frontier in for service and from my initial phone call to schedule to check out I was very pleased. Jessee was my service advisor and he was very efficient, knowledgeable, and friendly.The lobby and waiting area is clean and and has plenty of seating with coffee and WiFi. They communicate via text and email through the entire process which is very helpful. Will definitely be back.", "pics": null, "resp": {"time": 1619634872728, "text": "Thank you for the review! We are glad we were able to help you out. We look forward to assisting you again in the future."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "103842653333723134092", "name": "Sean Hinnenkamp", "time": 1625793873862, "rating": 5.0, "text": "Best Nissan dealership on the panhandle. Our sales representative was amazing. I would recommend Sandy Sansing Foley to all my family and friends.", "pics": null, "resp": {"time": 1627047228040, "text": "Your rating and feedback mean a lot to us. Thank you for the review and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "116748561263902372192", "name": "Angelique Sollomen", "time": 1623804751291, "rating": 5.0, "text": "James was so helpful and got me in the car that I fell in love with. I wasn't expecting to get what I wanted. And he made it happen. Dan was great too! Will highly recommend to anyone looking for a car.", "pics": null, "resp": {"time": 1623860045225, "text": "We are glad to hear that James was able to find a car that fit your needs! If there is any way we can assist you further please let us know. Thank you for the review and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "109078380434935276776", "name": "Kody Hart", "time": 1624292823198, "rating": 5.0, "text": "Steve Cutcher at Sandy Sansing made my car buying experience a breeze!  I picked out a car online on Saturday and was able to swing by the dealer the following Monday for a test drive and to pick up the car.  I completed the paperwork in about an hour and the car was mine.  No hassle, no unexpected costs, no b.s.\n\nNo need to look anywhere else for a professional and customer based car buying experience!  Thanks again Steve.", "pics": null, "resp": {"time": 1624984718072, "text": "We are please to hear that Steve was able to provide you with a positive experience. We appreciate you taking the time to let us know how we did. Thank you for the review and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "109701154308638995079", "name": "Charity Wilson", "time": 1625783402192, "rating": 5.0, "text": "The people here was awesome. They really worked with my situation to get me in a car. I'm so glad I decided to go here.", "pics": null, "resp": {"time": 1627047399199, "text": "Thank you for the review! We are so glad to hear that our staff was really able to help you out. If there is any way we can be of further assistance please let us know."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "112375993585520380421", "name": "Renee Lollie", "time": 1622593603365, "rating": 5.0, "text": "I had bad credit and only had 1000 down. They worked with me and got me in a car when no one else would. I highly recommend them! Thank you sandy sansing you are the best!", "pics": null, "resp": {"time": 1622839112354, "text": "We are so glad we were able to find a vehicle for you!  It is great to know that we were really able to help you out. If there is any way we can be of further assistance please reach out to us."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "102042016427176981241", "name": "Lynn Reeves", "time": 1618524047373, "rating": 5.0, "text": "Very happy with the people and the deal I got on my car. When they did not have the exact car I wanted they went to another dealer and got the car I wanted and swapped one of their cars for it, brought it to their lot and sold it to me. Very happy.", "pics": null, "resp": {"time": 1618593410790, "text": "We strive for 100% satisfaction, and it is great to see you had such a positive experience with our staff! We hope that we can assist you in the future."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "105767111406253011246", "name": "Ivan Correa", "time": 1613888449400, "rating": 5.0, "text": "Dennis my Sales Specialist was FANTASTIC! He did a wonderful job since we first met! He listened to me, and analyzed my needs to then find the BEST option for me. He always provide me with excellent clients service and maintained great professionalism and sincere care for my needs. The Management and financial department were also Amazing and very polite!", "pics": null, "resp": {"time": 1614024216511, "text": "We strive for 100% satisfaction, and it is great to see you had such a positive experience with our staff! We hope that we can assist you in the future."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "103013252943233683703", "name": "Sylvia Howland", "time": 1625862100346, "rating": 4.0, "text": "Thanks.  I was told my car would be vacuumed out. But it was not done. Other than that I was satisfied.", "pics": null, "resp": {"time": 1627047170259, "text": "Thank you for taking the time to let us know how we did. We hope you have a great day!"}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "113888461869045729847", "name": "Ashley Gray", "time": 1615218554927, "rating": 5.0, "text": "Outstanding experience!  Everyone at Sandy Sansing Nissan was helpful, courteous, knowledgeable, and made me feel like an appreciated, valued customer.  I was very apprehensive about the car buying experience - it was my first time purchasing a car through a dealership - and if I had known how easy and fun it was, I would have gone sooner!  Everyone, from the sales team to the finance advisors, made me feel welcomed and comfortable. I felt like I was engaged in the entire process, understood what was going on, and the values of honesty and integrity really shone through.  I really can't say enough about the entire team.", "pics": null, "resp": {"time": 1615219385099, "text": "We strive for 100% satisfaction, and it is great to see you had such a positive experience with our staff! If there is any way we can be of further assistance please let us know. We hope that we can assist you in the future."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "116117626481873225085", "name": "Jo Anna Wilson", "time": 1616169546944, "rating": 5.0, "text": "Mr Dennis was my sales associate and he was so friendly and polite. He made my shopping experience so smooth and easy. I truly enjoyed my time there. Mr. Larson was also very friendly and helpful.  Sandy Sansing truly deserves a 5 star rating !!!!", "pics": null, "resp": {"time": 1616171568723, "text": "Hi, we're happy you found our staff to be so supportive during your experience. Your satisfaction is our top priority. Thank you for your positive review and we hope to be of service to you in the future."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "106131236756743432544", "name": "jennifer hankins", "time": 1624719298891, "rating": 5.0, "text": "Highly recommend these guys if you are in the market for a car !! Extremely easy purchase and excellent customer service !! We worked with Steve and Nathan and I would recommend them both ! Super friendly and we’re able to find me a vehicle that had everything I was looking for !!! If you need a car THIS IS the place to go !!!", "pics": null, "resp": {"time": 1624983356959, "text": "Thank you for the review! We are pleased to hear that our staff was able to help you out. If there is any way we can be of further assistance please let us know."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "104453584994492042808", "name": "Pam Bryant-Schropshier", "time": 1610066984851, "rating": 5.0, "text": "What a great first impression!!  I could not be more pleased with Sandy Sansing Nissan of Foley in helping me with the purchase of my Rogue.  Special shout out to Tim Holly, who made the process fun and easy, you’re amazing, Tim!  And, huge thanks also to Kohl Gilbert who stepped in on our first visit when Tim had a prior appointment, picked up the car from Pensacola, and synced my phone for me.  From start to finish, everyone was professional, and had great attitudes.  It made purchasing a new vehicle painless!", "pics": null, "resp": {"time": 1610117605236, "text": "We are so glad you had a positive experience with our team! It is great to know you had a positive experience throughout your visit. We hope we can assist you in the future. Thank you and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "109211268738083710589", "name": "Katie Watson", "time": 1618966973442, "rating": 5.0, "text": "I went in with bad credit not really sure what I could get and Nathan really helped me out! I was able to walk away with a beautiful pre-owned car that I love. He kept me right under budget too and was very friendly and walked me through the whole process. Highly recommend.", "pics": null, "resp": {"time": 1619012669198, "text": "We are so glad to hear how we were able to provide you with a positive experience! If there is any way we can be of further assistance please let us know. Thank you for the review and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "101380683482663811124", "name": "Pat Hackl", "time": 1617895633728, "rating": 5.0, "text": "I had a wonderful experience at The Sandy Sansing Nissan service Department in Foley, AL.\nJesse, the Service Manager could not have been anymore friendly & helpful.\nSynthetic oil changed, & rotation of tires in a very timely matter.\nThank you so much for the outstanding service.", "pics": null, "resp": {"time": 1618409279724, "text": "Thank you for highlighting our Service Department! We are glad to hear that we were able to help you out. We hope we can assist you again in the future."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "103531664996628205166", "name": "Melissa Feller", "time": 1626209337586, "rating": 5.0, "text": "They did a great job fixing the issue with my Altima,very fast and friendly staff.", "pics": null, "resp": {"time": 1627047114788, "text": "We are so glad everything was completed quickly and to your satisfaction. We hope we can assist you again in the future."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "108795922252278580093", "name": "William Lohmiller", "time": 1611679422598, "rating": 5.0, "text": "Had a great experience purchasing a new Nissan Kicks at Sandy Sansing Nissan in Foley.  The General Manager, Ben Smith and our salesman, Timothy Holly were exceptionally courteous,  helpful, friendly, professional and easy to deal with.  Couldn't be happier.   This was our first time visiting this dealership and they have certainly earned my confidence.  If you are in the market for a new/used vehicle,  by all means visit these guys and be sure to ask for Timothy!", "pics": null, "resp": {"time": 1611687050233, "text": "Thank you for the positive review! We are so glad our team was able to assist you throughout your visit. If there is any way we can be of further assistance please reach out to us."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "112830579604257248499", "name": "Scott Hankins", "time": 1624732797053, "rating": 5.0, "text": "great experience steve and nathan were awesome as well as finance and sales managers.\n\nthanks so much", "pics": null, "resp": {"time": 1624983227933, "text": "We are so glad we were able to provide you with a positive experience! We are pleased to know that Steve and Nathan were able to assist you. Thank you for the review and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "116733247530370941602", "name": "Kelly Rhea", "time": 1623113575715, "rating": 5.0, "text": "Matt was awesome. Thank you so much. We will be seeing y’all again.", "pics": null, "resp": {"time": 1623342547297, "text": "Hello, we really appreciate your feedback! If we can be of further assistance to you please reach out to us. Have a great day!"}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "106865436418340231551", "name": "Lori Onjukka", "time": 1619535448769, "rating": 5.0, "text": "The facility was clean and nice.\nIt was not too noisy, there was plenty of space for me to spread out and do my work while I waited.\nthe time spent on the oil chane and inspection was just right.\nJesse Sawyer was helpful and polite, answered all my questions.\nLori Onjukka", "pics": null, "resp": {"time": 1619635039481, "text": "We are glad we were able to provide you with a comfortable and positive experience! We will certainly pass along the kind comments to our Service Department. We hope we can assist you again in the future."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "107461674292233747557", "name": "Erik Hess", "time": 1621607650755, "rating": 5.0, "text": "Very professional staff. My family and I were on vacation from Knoxville, TN and our 2012 Murano started running really high RPMs. Turns out the car needed a new transmission. The Sandy Sanding staff weren't able to get the parts they needed for the repair from their regular parts suppliers. However, they were able to locate another dealership that had the parts...in Atlanta. Jessie from their service department took an overnight drive to Atlanta to retrieve the parts while the service techs removed the old transmission. Needless to say they went above and beyond to get the work done quickly. The car was dropped off on a Monday morning and was back in my hands with a new transmission by the following Thursday afternoon. That's 4 days from diagnosis to work completion. I couldn't be happier with this turn around. Especially considering the trip to Atlanta for the parts. I highly recommend this team for any repair needs you might have.", "pics": null, "resp": {"time": 1621602666155, "text": "Thank you for the high star rating! We are glad we could help you out."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "112572641213424735334", "name": "Leigh Ann Glass", "time": 1623538778610, "rating": 5.0, "text": "Fast.. super nice & they go above & beyond to get the job done RIGHT THE 1ST TIME!", "pics": null, "resp": {"time": 1624982822875, "text": "We are glad everything was completed quickly and to your satisfaction! It is great to know that we were really able to help you out. If there is any way we can be of further assistance please let us know."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "113029638207857454319", "name": "Cari Blanton", "time": 1623791560520, "rating": 5.0, "text": "Jessee and the team were great as always! Thank you for taking great care of my car!", "pics": null, "resp": {"time": 1624984000344, "text": "We are so glad Jesse was able to assist you during your visit. If there is any way we can be of further help please let us know. Thank you for the review and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "107224301810428568506", "name": "Angie Scott", "time": 1615398362088, "rating": 5.0, "text": "Had a wonderful experience at Sandy Sansing Nissan Dealership in Foley, Alabama.\nSalespeople were very knowledgeable and polite. I told them what I was looking for and they had a certified 2019 Nissan Frontier  (Silver) brought in from a sister company the following day.  Everything flowed well from first visit through finalizing paperwork.\nWould highly recommend them from salespeople to management great job ya'll\nAngie Scott", "pics": null, "resp": {"time": 1615403439916, "text": "We are glad to hear that we were able to find a vehicle that fit your needs! It is great to hear about your positive experience. If there is any way we can be of further assistance please reach out to us. Thank you for the review and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "109466251102156100287", "name": "Amanda W", "time": 1619130364685, "rating": 5.0, "text": "James was an excellent salesman. The easiest car buying experience I've ever had. The entire team was great!", "pics": null, "resp": {"time": 1619185906600, "text": "Thank you for the review! We will certainly pass along your kind comments to our staff."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "106572413464763305806", "name": "john goran", "time": 1623905726359, "rating": 5.0, "text": "Service was excellent..  issue fixed .. rate was more than fair... Thank You", "pics": null, "resp": {"time": 1623937803807, "text": "We are glad we were able to get your vehicle repaired! It is great to hear that we were able to provide you with a positive experience. If there is any way we can assist you further please reach out to us."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "111090314818402720864", "name": "BOBBY LEIBFREID", "time": 1623408029141, "rating": 5.0, "text": "Could not ask for a better experience! Kohl came through on everything! Best car buying experience ever!!!Ya gotta go here..the staff is awesomeness!!♡♡♡♡..Stay away from the one in Pensacola!", "pics": null, "resp": {"time": 1623432205317, "text": "Thank you for the review! We are so glad to hear that we were able to help you out during the purchase of your vehicle. If there is any way we can be of further assistance please let us know."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "110346982018945691871", "name": "Jonathan Brown", "time": 1610669383328, "rating": 5.0, "text": "I’m initially going to put 5 stars here because I’m hoping that my issue was solved, however it’s a wait and see kind of thing.\n\nI say 5 stars because of how awesome they were at keeping me in the loop, the access to information, and their honesty during this process. My truck is my biggest investment and they seemed to care about it just as much as I did. I’m hoping that the results from this attention to detail reflects how well my truck was cared for and fixed.\n\nWill update!", "pics": null, "resp": {"time": 1610984362794, "text": "Thank you for the review! We are glad to know we have been able to help you out. If there is any way we can assist you please reach out to us."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "104559288853868896268", "name": "taye johnson", "time": 1616906067251, "rating": 5.0, "text": "I would like to give a big shout out the sales person who helped us today . Mr. Timothy Holly ! He was excellent and i highly recommend everyone to come\nto Foley and come let him hook you up! He’s willing to make excellent deals with anyone ! Again thankyou for helping us again❤️", "pics": null, "resp": {"time": 1617031311007, "text": "We are so glad to hear that Timothy was able to provide you with a positive experience. It is great to hear you had a positive experience with us. Thank you for the review and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "107785744556134241577", "name": "Cindy Mason", "time": 1610381808189, "rating": 5.0, "text": "This was my second oil change.at the Foley service center. Sales staff extremely professional. Time in shop was spot on. In and out as promised. First time my interior carpet was vacuumed. This time was not. Little disappointed but was very please with in and out as told! Keep up the excellent service!", "pics": null, "resp": {"time": 1610386827308, "text": "Thank you for the review! We are so glad our Service Department has been able to provide you with a positive experience. We hope we can assist you again in the future when the time comes."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "105792979463003223062", "name": "Phoenix Gaudin", "time": 1617674351672, "rating": 5.0, "text": "My salesman Kole made my car buying experience WAY easier than I thought it was going to be. It was such a pleasure to work with him and the team at Sandy Sansing Nissan of Foley. I had my eyes set on a cheaper car than what I actually got, because I thought I couldn't get financing for anything better; but they were able to get me a deal that I couldn't refuse on an even better car than what I thought I would be leaving with. Thank You Kole! Thank You Sandy Sansing Nissan of Foley!!", "pics": null, "resp": {"time": 1618410301647, "text": "We are so glad to hear that Kole was able to help you out! It is great to hear about your positive experience with our staff. If there is any way we can be of further assistance please let us know. Thank you for the review and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "100905136418338403765", "name": "Meghan Boudinot", "time": 1619526487836, "rating": 5.0, "text": "If you ever need help with getting a vehicle Mrs. Glenda is the one to go to!! She is an absolutely wonderful person who helped me and my husband tremendously! Can’t wait to get my new Nissan Kick!", "pics": null, "resp": {"time": 1619619579284, "text": "We are so glad to hear about your positive experience with our staff! It is great to know that we were really able to help you out. If there is any way we can be of further assistance please let us know."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "101878778654383851954", "name": "Nobody Cares Customs", "time": 1622738851511, "rating": 5.0, "text": "Excellent service. Great sales people. Go talk to James Presley!!!", "pics": null, "resp": {"time": 1622836491839, "text": "Your rating and feedback mean a lot to us. Thank you for the review and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "108329471609168862257", "name": "Douglas Clayton", "time": 1620484930994, "rating": 5.0, "text": "Would highly recommend Sandy sansing Nissan to my family and friends the sale people were help full worked  with me and my wife to get us in a car that fit or needs  thank you very much  I am a happy camper 😊", "pics": null, "resp": {"time": 1620681328030, "text": "We are so glad we were able to really help you out. Please let us know if there is anything additional we can do for you. Thank you for the review and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "110676321299363056184", "name": "Randal Steele", "time": 1618506200140, "rating": 5.0, "text": "Great service!!! The people there are so friendly and waited no time for them to fire our tire senor!! Will definitely be using them from now on!!!", "pics": null, "resp": {"time": 1618593285610, "text": "We are glad everything was completed quickly and to your satisfaction. We look forward to assisting you again in the future."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "101868616255680316388", "name": "Clay Fayard", "time": 1606241814070, "rating": 5.0, "text": "Great, great place! Go see Tim or Justin. You will not  find better guys anywhere, on both a professional and personal level. It was very much worth the 2 Hour plus one-way trip from Mississippi. Great vehicle, great price, great service, great people! Thanks guys and to everyone at Sandy Sansing in Foley!", "pics": null, "resp": {"time": 1606313857318, "text": "We are so glad we were able to help you out! It is great to see that Tim and Justin were able to provide you with such a positive experience. If there is any way we can assist you further please reach out to us."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "118154213171461505853", "name": "vivian wallace", "time": 1621265826948, "rating": 5.0, "text": "You had the exact car that I wanted and I paid exactly what I intended, thanks to Nathan working with me on pricing.", "pics": null, "resp": {"time": 1621270949351, "text": "We are glad to hear that we were able to find a great vehicle for you! If there is any way we can be of further assistance please reach out to us."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "103194063991613997593", "name": "Account Manager", "time": 1612824455166, "rating": 5.0, "text": "Leon was absolutely great.  Very nice & friendly & treated me with kindness & respect.  My vehicle was ready when promised.  I will definitely be back the next time my Rogue needs service!!!", "pics": null, "resp": {"time": 1612822586047, "text": "Thank you so much for the high rating! We are pleased to know we could provide you with a positive experience."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "101875802110994206564", "name": "The Howald's", "time": 1619565697477, "rating": 5.0, "text": "I'd have to say this is the best experience we have ever had at a dealership our salesman Kole was fantastic ! They took care of us, I'd highly recommend buying here.", "pics": null, "resp": {"time": 1619634615946, "text": "We are glad we were able to provide you with a positive experience! Your satisfaction is our top priority so we are glad Kole was able to help you out. If there is any way we can assist you further please let us know."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "102689042480182536890", "name": "Misty Moore", "time": 1617322436513, "rating": 5.0, "text": "Absolutely exceptional dealership! They go above and beyond! And they have a great selection of vehicles!", "pics": null, "resp": {"time": 1618409937422, "text": "We are so glad we were able to help you out! Please let us know if there is any way we can be of further assistance. Thank you for the review and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "117764079385978279143", "name": "Janie Masterson", "time": 1614814984833, "rating": 5.0, "text": "Everyone that I talked to here was very professional and extremely knowledgeable.  I had my suv towed there Friday night after hours and they called me first thing Saturday morning. They were timely with the estimate and repairs. I would recommend them to everyone!!!", "pics": null, "resp": {"time": 1615239010518, "text": "We are glad everything was completed timely and to your satisfaction. We hope we can assist you again in the future when the time comes."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "106516825985202731127", "name": "Jillian Pierce", "time": 1617989706120, "rating": 5.0, "text": "Dennis and Dan were so easy to work with. Thank you for a great car buying experience!", "pics": null, "resp": {"time": 1618409214354, "text": "Congratulations on your new vehicle! We are so glad we were able to really help you out. If there is any way we can be of further assistance please let us know."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "117426670180045861351", "name": "Gracelyn Peterson", "time": 1615675245775, "rating": 1.0, "text": "Pretty bad service. Had us sign a whole bunch a paperwork, got preapproved, stayed for HOURS getting everything ready. They said they would call in the morning when the car was ready to pick up and never called. After a while I had my husband call and again they asked for a little more time and would call back- they never did. Since final papers hadn’t been signed I just let it go. I definitely don’t recommend this dealership. You’re way better off heading to Daphne.", "pics": null, "resp": null, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "116699114121154569318", "name": "Denver Sellers", "time": 1617734699749, "rating": 5.0, "text": "Thank you Timothy Holly for the fast and friendly service and sale today of my new 2021 Frontier. Great salesman and great staff here. Anyone lookong for a new Nissan check them out and let Timothy set you up.", "pics": null, "resp": {"time": 1618409798953, "text": "We are so glad to hear that Timothy was able to provide you with a positive experience during your visit. It is great to hear that we were able to help you out. If there is any way we can be of further assistance please let us know."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "100950180772246734604", "name": "Robert Benton", "time": 1619277477654, "rating": 5.0, "text": "Perfect - friendly, attentive & fast service. I will continue to have my vehicle serviced here.", "pics": null, "resp": {"time": 1619462206722, "text": "We are glad our service department was able to provide you with a positive experience! We look forward to assisting you in the future."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "114853832361983801416", "name": "Destiny Shire", "time": 1616254005711, "rating": 5.0, "text": "Great shopping experience. Found my car quick and was in and out. Amazing experience all together.", "pics": null, "resp": {"time": 1616448128502, "text": "We are so glad we were able to provide you with a positive experience. It is great to know that our staff was able to help you out. Please reach out to us if there is any way we can be of further assistance."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "103787641365529289525", "name": "Elizabeth Michon", "time": 1603403314745, "rating": 5.0, "text": "I have bought many vehicles in my time, but this was absolutely the best experience I have ever had.\nJames and Chuck were awesome. They were patient, honest, informative and efficient.  I ended up leaving with my vet first brand new car! I would absolutely recommend them and look forward to using their service department. Thank you both so much!", "pics": null, "resp": {"time": 1603461903893, "text": "Congratulations on your new car! It is great to see you found our team to be so helpful and knowledgeable. We look forward to assisting you in the future. Please feel free to reach out to us if there is any way we can help you out. Thank you for the review and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "103993469840565797022", "name": "D P", "time": 1616206831465, "rating": 5.0, "text": "Dennis Montgomery was the best he found us the truck we was wanting and made buying the truck the best experience ever. I will buy from Dennis Montgomery in the future...Thank you so much Dennis", "pics": null, "resp": {"time": 1616190059099, "text": "We appreciate your positive review about your recent experience with us!"}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "113485698209143425780", "name": "madee Thompson", "time": 1620152932652, "rating": 5.0, "text": "So everybody knows the stress that comes with buying a car even when you're prepared you still get a little nervous but I will have to say that it went really smoothly you know we talk back and forth on the price and I left with what I wanted to pay and nothing over and he really took my situation I was in and he really made the best outcome for me and I'm very thankful I'm driving home in the car now and I will post again shortly and keep you updated on the performance of the vehicle #GilberttheGreat", "pics": null, "resp": {"time": 1621004420796, "text": "We are glad to hear that we were able to help you out during your visit. Please let us know if here is any way we can assist you further. Thank you for the review and have a great day!"}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "111656224209326183533", "name": "Brandy Page", "time": 1617590209232, "rating": 5.0, "text": "This car buying expensive was nothing shy of perfect. I went in Wednesday with my mind made up on what I wanted and Mr. Timothy Holly made sure that I got just what I wanted. The vehicle that I picked out was at the Pensacola lot but Timothy made sure I got the exact vehicle that I went for, he called the Pensacola lot and got the car delivered to the Foley lot. If your looking to buy a car go see Timothy at Sandy Sansing in Foley.", "pics": null, "resp": {"time": 1617653170009, "text": "We are glad to hear that we were able to help you out! Your satisfaction is our top priority so we are pleased that you found our staff to be so helpful. If there is any way we can be of further assistance please let us know."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "117128742566595023795", "name": "Lacey Wilkey", "time": 1598886093909, "rating": 5.0, "text": "Thankyou so much Adam Callaway for helping me get into the car of my dreams.! Mr. Callaway was so pleasant to work with, fun upbeat personality. Great conversation while waiting on the everything to be finalized. I got a great deal on my vehicle with no hassle. Highly recommend Sandy Sansing.! GO SEE ADAM CALLAWAY.!! He is great...!", "pics": null, "resp": {"time": 1598967144957, "text": "Congratulations on your new vehicle! It is great to see that Adam was able to assist you throughout the whole process. If you ever need anything else from us, please feel free to give us a call or stop by. Have an awesome day!"}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "117254926038578966290", "name": "Stacie Thornhill", "time": 1622470625059, "rating": 5.0, "text": "Dennis Montgomery is a fantastic salesman whose priority is his customers.", "pics": null, "resp": {"time": 1622839154814, "text": "Thank you for the review! We always want to hear back from our clients and we are glad you had such a positive experience with us."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "105947240266152154929", "name": "Michael Roney", "time": 1610990655508, "rating": 5.0, "text": "I purchased a 2020 Nissan Pathfinder yesterday. The salesman Nathan was very knowledgeable of the features of this vehicle, that made the purchase easy and efficient process. Nathan exceeded my expectations , he is a great asset to Nissan Foley dealership.", "pics": null, "resp": {"time": 1611009443867, "text": "Thank you for the review! We are glad to know that Nathon was able to assist you throughout your visit and we will certainly pass along your comments. If there is any way we can be of further assistance please reach out to us. Thank you again and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "103917722737233576144", "name": "Donita Cauley", "time": 1612395310243, "rating": 5.0, "text": "James really made the process quick and easy. He also helped us get the best deal possible! Definitely recommend!", "pics": null, "resp": {"time": 1612462738182, "text": "Thank you for the review! We are so glad James was able to provide you with a positive experience."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "102080268076789800544", "name": "Kayla Stevens", "time": 1621866280666, "rating": 4.0, "text": "Friendly staff. Got my car done quickly", "pics": null, "resp": {"time": 1621887691688, "text": "We are glad to know that we were able to assist you in a timely manner. If there is any way we can be of further assistance please let us know."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "108975849998042198462", "name": "Jacqueline Miniard", "time": 1619107203621, "rating": 5.0, "text": "Great, fast, reasonable service. Very pleased", "pics": null, "resp": {"time": 1619190457755, "text": "Your rating and feedback mean a lot to us. Thank you for the review and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "115369732653043987979", "name": "Omega Phillips", "time": 1611623090331, "rating": 1.0, "text": "The tech that worked on the truck was good, I suppose never seen him.\nBut Leon the service person that checked me in was rude.\nI asked him how long it would take,after he informed me my 8:40 appointment was not at all accurate, and only one person works on diesels.Leon said if you make your appointment online that's just a time they give you- to work you in. I said well if I knew that then I would not have made the appointment for that time.\nAll I was really there for was alignment(that takes about a hour)he asked why I said because we purchased new tires. Leon said well why didn't they do it then. I said we bought them in Cameron after the hurricane hit, we were lucky to get tires.\n(It should not matter why I wanted a alignment just put it in the computer)\nThen I said how long will it take, will he give me a update when he speaks to the tech-since he already told me the 8:40 really didn't mean anything.\nHe said if you would let me talk,\nLeon never came back and told me anything, so I went back up there after about 30 minutes of waiting. The other two guys were very polite and helpful, like I told the one- I just wanted to know, so I could walk over and get some breakfast.\nAfter my vehicle was finished,Leon was stand offish, but I guess that's better than rude.", "pics": null, "resp": {"time": 1612821165941, "text": "We regret to hear you did not have a positive experience with us. Please reach out to our General Manager to resolve your concerns."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "107426550376348760013", "name": "Boxcar Willy", "time": 1607368959745, "rating": 5.0, "text": "It was my granddaughters first visit with her new 2020 Versa we bought her for graduation - She wanted to do it herself so off we went - Went in on Saturday morning for the first oil change and tire rotation - The service rep. at the desk explained everything to her, showed us the waiting area and we were gone in 30 minutes! The rep. said they have express oil changes and you never need to call, just come on in - The service desk rep. was super nice to my granddaughter and made her feel at ease - Love the car we bought from Sandy and really like the dealership in Foley.", "pics": null, "resp": {"time": 1607436762014, "text": "We are so glad we could provide you with quick service! It is great to know our team was able to make your granddaughter feel comfortable. If there is any way we can assist you or your granddaughter please feel free to call or stop by. Thank you for the review and we hope to see you in the future."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "109642837494871215903", "name": "Joe Mansolino", "time": 1618792441967, "rating": 5.0, "text": "We had an outstanding experience at Sandy Sansing in Foley, due entirely to our salesperson, Nathon Pilkington.  In a bad situation because of the hailstorm totalling both of our cars, we had to get to new ones.  Nathon took his time with both of us, and we each had different wants in a vehicle.  He was absolutely awesome with us, even to the point of introducing us to the people in the service department, who explained what we needed to do when service is required.  Nathon was absolutely awesome.  We have already recommended him to others.", "pics": null, "resp": {"time": 1619034941556, "text": "Thank you for the review! We always want to hear back from our clients and we are glad you had such a positive experience with Nathon. If there is any way we can be of further assistance please let's know."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "101742553625487004966", "name": "Lacy Davis", "time": 1614625441792, "rating": 5.0, "text": "They were great! Went above and beyond for me! Definitely will recommend and use them again!", "pics": null, "resp": {"time": 1614627091788, "text": "Thank you for the review! We are glad to hear that we were able to provide you with a positive experience."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "101141403708975224287", "name": "Matthew Cali", "time": 1622052856890, "rating": 5.0, "text": "Best sales experience I have ever had!", "pics": null, "resp": {"time": 1622064002763, "text": "We are so glad we were able to help you out! Please reach out to us if there is any way we can be of assistance. Thank you for the review and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "111897835263453620895", "name": "Ben Jaffe", "time": 1603467084339, "rating": 5.0, "text": "Our experience at Sandy Sansing Nissan can only be considered as top of the line. Salesman Jeremy Martin  assisted us showing a low pressure professionalism we had not seen at other dealerships. His cordial personality and understanding of our needs helped us obtain a perfect fit for our replacement vehicle within our budget.", "pics": null, "resp": {"time": 1603479023435, "text": "We are so glad we were able to provide you with such a positive experience. It is great to see Jeremy was really able to help you out. Please reach out to us if there is any way we can assist you. Thank you for the review and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "114031052194929562828", "name": "Andrew Mcfadden", "time": 1615824635403, "rating": 5.0, "text": "In and out quickly for an oil change. Customer service was excellent. Thank you.", "pics": null, "resp": {"time": 1616014516175, "text": "We are glad we could get you back on the road! We hope we can assist you again in the future."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "108622418469200680217", "name": "shane felkins", "time": 1616456159812, "rating": 5.0, "text": "Friendly and attentive from the start, fast service to move things along quickly and a great car to boot!!", "pics": null, "resp": {"time": 1616420343704, "text": "Hello, we really appreciate your feedback! If we can be of further assistance to you please reach out to us. Have a great day!"}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "113584942444581642708", "name": "Debra Herring", "time": 1609380265279, "rating": 5.0, "text": "I bought a car from here days ago. Highly recommend. The entire staff was wonderful and accommodating. It made buying a car so easy!", "pics": null, "resp": {"time": 1609426921580, "text": "Thank you for the review! We are glad to hear you had a positive experience with our team. Please reach out to us if there is any way we can be of further assistance."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "116997104841264747889", "name": "sophie and jackson covington", "time": 1615080518286, "rating": 5.0, "text": "James had us ready to go no hassle whatsoever. Great experience in car buying.", "pics": null, "resp": {"time": 1615216008437, "text": "We are glad James was able to provide you with a positive experience. We hope we can assist you again in the future when the time comes."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "117893209914155522844", "name": "Alan Robinson", "time": 1616693075719, "rating": 5.0, "text": "Jesse was great to work with.  The gtr service tech new his stuff as well.  Thanks for the help guys!", "pics": null, "resp": {"time": 1616792980195, "text": "We are so glad we were able to help you out. It is great to hear that you had a positive experience with us. If there is any way we can be of further assistance please let us know."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "116116709975427851529", "name": "Michael Payne", "time": 1613937391811, "rating": 5.0, "text": "Had tire rotation and oil change. Everything was perfect and quick. Great customer care.", "pics": null, "resp": {"time": 1614015233475, "text": "Thank you for the review! We are so glad that our team was able to provide you with a positive experience. If there is any way we can assist you further please reach out to us."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "100240714452031686014", "name": "Steve Emrick", "time": 1611330409160, "rating": 5.0, "text": "This was my first time using the Foley Sandy Sanding dealership Service Dept.  It was a very good experience...friendly staff...comfortable customer waiting facilities...oil change and inspection completed in a timely manner...would highly recommend this dealership to friends and family.", "pics": null, "resp": {"time": 1611331786582, "text": "We are glad to hear that everything was completed quickly and to your satisfaction. We are glad to know we were able to help you out. If there is any way we can be of further assistance please reach out to us."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "100786317387456233147", "name": "Barbara Martin", "time": 1599834819240, "rating": 5.0, "text": "My experience was great my Salesman Adam Callaway big shout out to him he was AMAZING! He was honest from the get go, was not pushy like typical salespeople! I'd recommend Sandy Sansing Foley to anyone!\nASK FOR ADAM CALLAWAY..\n\n1", "pics": null, "resp": {"time": 1600725318075, "text": "We are glad to hear Adam was able to assist you! We strive for customer satisfaction so it is great to see you had a positive experience. Please let us know if there is anything we can do to assist you further. Thank you for the review and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "113891207600767206120", "name": "Dedrick Marks", "time": 1616530789380, "rating": 5.0, "text": "Nathan was amazing. Found a car that I 💘 love", "pics": null, "resp": {"time": 1616619752315, "text": "We are glad to hear that we could find a car that could fit your needs. It is great to hear about your positive experience with us. Please reach out to us if there is any way we can assist you further."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "100344918504749953311", "name": "Christy Crawford", "time": 1620324808701, "rating": 5.0, "text": "Amazing folks at Sandy Sanding Nissan.  Steve is the best!!", "pics": null, "resp": {"time": 1621005123005, "text": "Thank you for the review! We are glad to hear that our staff was able to provide you with a positive experience. Please do not hesitate to stop by or give us a call if there is any way we can assist you further."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "117430037901535367640", "name": "Kayla", "time": 1619928662065, "rating": 1.0, "text": "10/10 would NOT recommend. Horrible customer service!! They care about the sale not the customer and price their vehicles way over KBB value. Not worth it!", "pics": null, "resp": {"time": 1620856115628, "text": "We are sorry to hear that your experience did not meet your expectations. Please contact our customer service department to resolve your concerns."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "110265329318955790147", "name": "Stephanie Smith", "time": 1620157345009, "rating": 5.0, "text": "Great customer service. Jesse in service was great.", "pics": null, "resp": {"time": 1621005022600, "text": "We are glad we could provide you with great customer service! If there is any way we can assist you further please reach out to us."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "103797142372876031136", "name": "Paula Flores", "time": 1625933252047, "rating": 5.0, "text": "Steve Cutcher at Nissan of Foley was great to work with.", "pics": null, "resp": {"time": 1627047153274, "text": "Thank you so much for your high rating. We really appreciate your positive review."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "114626467465797329312", "name": "Gina Crescenzi", "time": 1603809677262, "rating": 5.0, "text": "If I could give 10 stars I would. All of your employees are very polite and amazing! A big thank you to Matthew for getting my daughter and I into our new car! I appreciate you all!", "pics": null, "resp": {"time": 1603814859453, "text": "We are so glad we were able to help you out. Thank you for highlighting our team! It is great to see Matthew was able to provide you and your daughter with a positive experience. Please reach out to us if there is any way we can assist you further. Thank you again and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "102703337969808528205", "name": "Jeremy tooley", "time": 1624036309821, "rating": 5.0, "text": "I got an oil changed. It was a quick service.", "pics": null, "resp": {"time": 1624984049655, "text": "Thank you for taking the time to let us know how we did. We hope you have a great day!"}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "103329265835049350625", "name": "Kelli S", "time": 1605727691968, "rating": 5.0, "text": "Went there for a truck, Kohl was awesome, helped me find something that I could afford. I was walked through every step of the way. Will definitely be recommending this place to friends and family in the future!", "pics": null, "resp": {"time": 1605824074994, "text": "Our entire team works hard to work with your budget and get you the best deal. We are always here with the same great service when your friends and family need a vehicle!"}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "112879763318610356570", "name": "Mike Lovell", "time": 1602857950122, "rating": 5.0, "text": "Recently moved to Gulf Shores from Nashville, and as we were driving from Fairhope home, the dreaded check engine light came on. Luckily for us we were very close to this dealership. We pulled into the service bay, and from that point on we knew we were in good hands. They made us feel special as if we were the only customers they had. They took our info and dealt with our extended warranty company. They repaired our car in a timely manner and cleaned it up and kept us posted on the progress. No sales pitches for extra services. I highly recommend this dealership!", "pics": null, "resp": {"time": 1602859500872, "text": "Hi, we're happy you found our staff to be so supportive during your experience here at Sandy Sansing Nissan of Foley, Inc. Your satisfaction is our top priority. Thank you for your positive review and we hope to be of service to you in the future."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "102366590246235829227", "name": "Eric Campbell", "time": 1619378566594, "rating": 4.0, "text": "The service was good and the waiting area is a top 10", "pics": null, "resp": {"time": 1619448694658, "text": "Thank you for the review! We are glad you found our service department to be enjoyable. We hope we are able to assist you again in the future."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "102767133562258636156", "name": "Brittany “IAmBritt.” Hall", "time": 1612544995912, "rating": 5.0, "text": "With the help of Nathon and Ben, I was able to make the purchase of my 2021 Nissan Sentra! I am so happy with my purchase, and the service I received during the process. Definitely feel like a part of the family there. Nathon even put air in my moms car tire. If that doesn’t scream customer service, I don’t know what does.", "pics": null, "resp": {"time": 1612821343668, "text": "We are so glad to hear that Nathon and Ben were able to assist you throughout your visit. Your satisfaction is our top priority so we are pleased to know our staff was able to provide you with a positive experience."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "110006594952811076604", "name": "Stephanie Skipper", "time": 1607808751426, "rating": 5.0, "text": "Justin was fantastic! Best experience I’ve ever had purchasing a new car. They went above and beyond to make it work for me.  I LOVE my new 2020 Sentra!", "pics": null, "resp": {"time": 1607984229258, "text": "We are so happy we were able to help you out. It is great to know we were able to provide you with such a positive experience. If there is any way we can assist you further please reach out to us."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "101189200663505094633", "name": "Kathy Chandler", "time": 1612462678505, "rating": 5.0, "text": "Only one thing to say, I will go back and buy another vehicle from them i was very very pleased!😊", "pics": null, "resp": {"time": 1612537701735, "text": "Thank you for the review! We are glad to hear our staff was able to help you out."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "103905367830554286337", "name": "sharon morris", "time": 1611711991937, "rating": 5.0, "text": "Excellent customer service ,very easy to work with and no pressure. Highly recommended !", "pics": null, "resp": {"time": 1611757758283, "text": "Thank you for the review! We are glad to hear you found our staff to be helpful during your visit. Please reach out to us if there is any way we can be of further assistance."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "114375612942825511016", "name": "Mike Whittenton", "time": 1607215371454, "rating": 5.0, "text": "Great place to buy a vehicle. Great customer service and Nathan was wonderful and really works hard for you. Go see Nathan at Sandy Sansing in Foley to get your next vehicle.", "pics": null, "resp": {"time": 1607441464830, "text": "Thank you for the review. We are glad Nathan was able to assist you during your visit. If there is any way we can help you out please feel free to stop by or give us a call. Thank you again and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "108272539234291451247", "name": "Ryan Ard", "time": 1596376566167, "rating": 5.0, "text": "I am 42 yrs old and have owned alot of cars.  This buying experience has been the easiest buying experience that my husband and I have had.  These people are professional and do not hassle you when you are on the lot just looking.  I enjoyed the personable staff and will be bringing all of our car buying business to them from now on.", "pics": null, "resp": {"time": 1596462825215, "text": "Hello, we're happy to hear you had such a positive experience with our team! We sincerely value your business and look forward to your next visit."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "102475013381655877885", "name": "Dawn Uraco", "time": 1611436427626, "rating": 5.0, "text": "Very happy with my buying experience at Sandy Sansing Nissan of Foley, thanks to Nathon Pilkington who answered all my questions, and made my trade in and purchase of new car seamless. No stress, no heavy sell, and went the extra mile to program my phone and navigation to new car! Thank you!", "pics": null, "resp": {"time": 1611609887824, "text": "It is great to know Nathon was able to assist you during your visit. We are glad we could provide you with a positive experience. If there is any way we can help you out please reach out to us."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "106371385132729312573", "name": "jael noriega", "time": 1599859135173, "rating": 5.0, "text": "Great people! Nice and clean bathrooms. TVs available when you gotta bring the kids. They took care of me pretty fast! Thankful for the new location closer to home!", "pics": null, "resp": {"time": 1600723233466, "text": "It's our commitment to ensure quality customer care by providing comfortable and relaxing facilities as well as friendly and professional service to our guests. Please come see us for any future needs."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "101728715114131193816", "name": "Jenn Knodel", "time": 1613100526356, "rating": 5.0, "text": "Solid knowledge from mechanics, courteous manner,  but mostly the tea, TV, and comfy chair with modern decor.", "pics": null, "resp": {"time": 1613496226028, "text": "Thank you for the review! We always want to hear back from our clients and we are glad you had such a positive experience with us."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "108033604451166493570", "name": "Art Houchins", "time": 1602709325732, "rating": 5.0, "text": "Service manager went over what was as going to be done and gave a thorough estimate.  All work completed in under 2 hours and at  a few dollars under the estimate..  I certainly would recommend the Service Department  T Sandy Sansing Nissan OF Foley", "pics": null, "resp": {"time": 1602772442414, "text": "Hi, we're happy you found our staff to be so supportive during your experience here at Sandy Sansing Nissan of Foley, Inc. Your satisfaction is our top priority. Thank you for your positive review and we hope to be of service to you in the future."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "109379303445130254211", "name": "Neil Davies", "time": 1605057434221, "rating": 4.0, "text": "Well, I have used Sandy Sansing Pensacola for years but The new Foley location is closer. Very disappointed they don’t have loaner cars- even for a recall.  Enterprise has them - why not Sansing?   They wanted to charge $60 for air clearer and $70 for cabin air filter.  I got them both at Autozone for $19 each and installed both in less than 20 min.  So while I like their oil change service - I felt other services were way overpriced", "pics": null, "resp": {"time": 1605640001179, "text": "Hello, we really appreciate your feedback! If we can be of further assistance to you please reach out to us. Have a great day!"}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "112401395001746160558", "name": "Ken Kichler", "time": 1599768599634, "rating": 5.0, "text": "I bought my truck at the Sandy sansing in Pensacola and March anticipating them opening in Foley so I could get my service done there by summer time. Anyway I called they said we have an express lane come on by it'll take 45 minutes or less. They were 100% accurate polite and friendly. Glad they are here local", "pics": null, "resp": {"time": 1600783435858, "text": "We are glad everything was done quickly and to your satisfaction. We look forward to assisting you again when the time comes. Please don't hesitate to reach out to us if there's anything more we can do."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "106726213065578539730", "name": "Niesha Jackson", "time": 1599872712927, "rating": 5.0, "text": "I went to this place today to get a routine maintenance done on my car and left there with a second vehicle. I am very happy I went to them today. They were very polite and thorough with everything. Thanks guys.", "pics": null, "resp": {"time": 1600722283560, "text": "We are glad we were able to help you out! Please reach out to us if there is anything we can assist you with."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "102731483729000715050", "name": "Lori Rapp", "time": 1614032631382, "rating": 5.0, "text": "Leon is always helpful, friendly and takes the time to explain everything.", "pics": null, "resp": {"time": 1614033632077, "text": "We are glad to hear that Leon was able to help you out. it is great to know we were able to provide you with a positive experience. If there is any way we can assist you further please let us know."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "114470710297555014191", "name": "Sheila Dear more", "time": 1617895136140, "rating": 5.0, "text": "Jessie was great in and out in no yime.", "pics": null, "resp": {"time": 1618409297677, "text": "We strive for 100% satisfaction, and it is great to see you had such a positive experience with our staff! We hope that we can assist you in the future."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "101299694215826263989", "name": "denise behling", "time": 1611674946702, "rating": 5.0, "text": "Professional, timely, well done. Very pleased w/ Sandy Sansing dealerships.", "pics": null, "resp": {"time": 1611685476199, "text": "We are glad everything was completed quickly and to your satisfaction. We appreciate you taking the time to let us know how we did."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "117882550847541226574", "name": "Tim Marcum", "time": 1624054133623, "rating": 5.0, "text": "Worked our pathfinder in for some emergency brake repair and got us back on the way to Kentucky. Thanks Jessee Sawyer and your service department.", "pics": null, "resp": {"time": 1624984059423, "text": "Hello, we really appreciate your feedback! If we can be of further assistance to you please reach out to us. Have a great day!"}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "106206880458206020365", "name": "Destiny Martinez", "time": 1599501190981, "rating": 1.0, "text": "Most unprofessional, disorganized car dealership I've ever dealt with. They make \"guarantees\" they have no intentions of keeping.. promised a car note at a guaranteed rate and after 7 hours of waiting tried to raise the monthly note over 100!!! Saleguys were pretty cool and understanding but beyond them (management, finance,etc.) Nothing but rude, disorganized and unprofessional... will never use this dealership again and the sad part is I love nissans but I will drive to pensacola or mobile for any future needs", "pics": null, "resp": {"time": 1599592171954, "text": "Hi, we regret to hear that you were displease with your recent experience with us. Please reach out to our General Manager (251) 989-1234, Ben Smith, to resolve your concerns."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "111198749573470566413", "name": "James Blevins", "time": 1614726224827, "rating": 5.0, "text": "The service was quick and Jesse was very pleasant to deal with.", "pics": null, "resp": {"time": 1615221474382, "text": "It is great to hear everything was done quickly and to your satisfaction. Thank you for the review and we hope to assist you again in the future."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "115661580216943745725", "name": "Joel Welk", "time": 1602856966270, "rating": 1.0, "text": "Parts department didn’t get part so car wasn’t done on the promised day. Had to leave on vacation later than was planning to. Asked for a loaner car. Said no because of COVID. GM told them to get us a rental but car was almost done. After all this the only thing they did was give us 12.00 off oil change. Was excited to get Nissan place near us. I don’t know now. Not a great start.", "pics": null, "resp": {"time": 1603209569558, "text": "We regret to hear that you had a negative experience with us, but would appreciate the chance to turn your experience around. Please reach out to customercare@sandysansing.com to resolve your concerns."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "100584590396656130065", "name": "giavonna fresh", "time": 1615506035928, "rating": 5.0, "text": "They treated me with such kindness work so hard to make sure I left with a car! So thankful for James Presley!!! Thank you!!!", "pics": null, "resp": {"time": 1615562617543, "text": "Hi, we're happy you found our staff to be so supportive during your experience. Your satisfaction is our top priority. Thank you for your positive review and we hope to be of service to you in the future."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "100187465856457417704", "name": "Michelle Murphy", "time": 1598731703084, "rating": 5.0, "text": "My experience was perfect during my visit. Everyone\nWas super friendly and very helpful. I will recommend\nEveryone I know to visit your business! Really happy!!", "pics": null, "resp": {"time": 1598969550586, "text": "Our team strives to deliver an excellent experience, and we are glad you found this to be the case during your visit. We are glad to hear you found everyone to be friendly and helpful. If there is any way we can assist you further please let us know."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "106982764580190063238", "name": "John Cook", "time": 1611595150937, "rating": 5.0, "text": "The Service Department at Sandy Sanding Nis Foley is the best I have ever experienced.", "pics": null, "resp": {"time": 1611599490222, "text": "Thank you for the review! We always want to hear back from our clients and we are glad you had such a positive experience with us."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "112379597549120936821", "name": "Leigh McPherson", "time": 1604273895584, "rating": 5.0, "text": "Prompt, courteous service.  Comfortable, convenient waiting area.  Willing to work around my time schedule.", "pics": null, "resp": {"time": 1604435530888, "text": "We are so glad you found our team to be helpful and courteous. It is great to hear everything as completed quickly and to your satisfaction. If there is any way we can assist you further please reach out to us."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "103560415199291054167", "name": "Woody Jones", "time": 1604329665534, "rating": 5.0, "text": "Fast and friendly service. Highly recommend them. It’s where we’ll take our car from now on. Even though we bought it at Matt Bowers.", "pics": null, "resp": {"time": 1604696886078, "text": "Thank you for the review. We appreciate you taking the time to let us know how we did. We look forward to assisting you in the future when the time comes."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "109924859679774828638", "name": "Alden Howell", "time": 1602625059824, "rating": 5.0, "text": "Purchased a small truck.  Probably the best experience I've ever had involving a vehicle purchase.  People were friendly, courteous, and professional.", "pics": null, "resp": {"time": 1602685111075, "text": "Congratulations on your puchase! We are glad you found our team to be professional and helpful. It is great to see we were able to help you out. Please let us know if there is any way we can assist you further. Thank you for the review and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "111283317270873436297", "name": "Victoria Jones", "time": 1600810692482, "rating": 5.0, "text": "Very helpful. Bought a car from another dealer had it towed to this location. Leon was very very helpful. Thank you for making today stress free", "pics": null, "resp": {"time": 1600868184322, "text": "We want all our clients to have a comfortable and stress-free experience with us! We are glad Leon was able to help you out. Please let us know if there is anything we can do for you."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "104312749023310947753", "name": "Lauren Smith", "time": 1625154436608, "rating": 5.0, "text": "Awesome customer service!", "pics": null, "resp": {"time": 1625155155507, "text": "Thank you for the review! We are glad we were able to provide you with a positive experience."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "115170551324022091869", "name": "Andrew Brymer", "time": 1600112326173, "rating": 5.0, "text": "I worked with Jeremy from the sales team to find a car that both fit my needs as well as my budget. I never felt pressured to purchase, and he went above and beyond to make sure the vehicle I went with was ready when I came in to do paperwork. Highly recommend taking a look at this establishment when looking for a new vehicle!", "pics": null, "resp": {"time": 1600711303973, "text": "Our entire team works hard to work with your budget and get you the best deal. We're always here with the same great service whenever you need service or another vehicle. Thank you so much for the review and have a great day!"}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "109528820437476510398", "name": "Dale Bayley", "time": 1604430380897, "rating": 5.0, "text": "I knew what I wanted and Jenny and the Sandy Sansing team help find common ground. They made the process of getting my new pickup smooth and hassle-free!", "pics": null, "resp": {"time": 1604588101356, "text": "Congratulations on your new vehicle! We are glad we were able to provide you with a positive experience. If there is any way we can assist you further please reach out to us. Thank you for the review and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "106851716625195826382", "name": "Kevin DeVault", "time": 1619145523866, "rating": 1.0, "text": "Felt like their advertising was not the truth. They were hard set on trying to get me to buy a 6,000 dollar 🚘 that was a little bit above my price.", "pics": null, "resp": {"time": 1620856091109, "text": "We appreciate you taking your time to leave your feedback, we will pass it along to our staff. If there is any way we could be of further assistance please reach out to our customer service department."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "117957948772037677248", "name": "Mary Higginbotham", "time": 1596626558359, "rating": 3.0, "text": "While the product is good, the staff fell short of my expectations! We waited hours to get to see the finance person despite making  the arrangements with the sales person a week in advance to purchase a new car. We had to wait after people that came in after us. I am assuming this was because we got our financing from our bank instead of  through the dealer. The finance officer after making us wait so long tried to pressure us into buying an extended warranty. We had to wait so long the detail crew had left so we had to bring our car back the next day to get it detailed and floor mats put in because they forgot them in the car. The sales crew had little knowledge of the features of the car. Sandy Sansing name has always represented professionalism to us although in the past we dealt with the Ford dealer in Daphne. This was our first time buying a Nissan as we usually get Fords. Only time will tell if I return to purchase a Nissan but if I do it will not be from the Foley Nissan crew.", "pics": null, "resp": {"time": 1597414203702, "text": "We are sorry to hear that your experience did not meet your expectations. We would love to be able to assist you further with your needs. If there is any way we could be of further assistance please reach out to our customer service department."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "117141602351841067070", "name": "Ann Nichols", "time": 1598989845149, "rating": 5.0, "text": "Very professional, very friendly, and very knowledgeable!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPdmdHLzrZkO9HHNGp4aj1-0_09z0_aiHvnSpkC=w150-h150-k-no-p"]}], "resp": {"time": 1599140717276, "text": "We are glad you found our team to be knowledgeable and helpful! It is our pleasure to be able to help you out. Thank you for the review and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "102044564503403719604", "name": "Bob Hardesty", "time": 1604596571773, "rating": 5.0, "text": "Great service, easy on line schedule for my appoint , clean and friendly and the coffee is good to A+ . Thank  you very much", "pics": null, "resp": {"time": 1604674591264, "text": "It's our commitment to ensure quality customer care by providing comfortable and relaxing facilities as well as friendly and professional service to our guests. Please come see us for any future needs."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "101144082620822753631", "name": "Katie Bailey", "time": 1606607796783, "rating": 5.0, "text": "Great selection of nice vehicles and some good salesmen. I didn't feel pressured and he listened to my budget, needs, and vehicle preferences.", "pics": null, "resp": {"time": 1607106022649, "text": "Thank you for the review! We are glad our team was able to assist you during your visit. Please feel free to stop by or give us a call if there is any way we can assist you."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "109092006586899248825", "name": "Robert White", "time": 1607534279492, "rating": 5.0, "text": "I found the facility very nice and they had exceptional services.", "pics": null, "resp": {"time": 1608241619396, "text": "We strive for 100% satisfaction, and it is great to see you had such a positive experience with our staff! We hope that we can assist you in the future."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "117059411290959999697", "name": "Brian Lovrey", "time": 1612981907923, "rating": 5.0, "text": "Easy to check in & out & the service tech was very personable", "pics": null, "resp": {"time": 1612990790394, "text": "We are so glad our Service Department was able to help you out. We strive for 100% satisfaction, and it is great to see you had such a positive experience with our staff! We hope that we can assist you in the future."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "103060301790829830334", "name": "Mills Hardin", "time": 1619725017754, "rating": 5.0, "text": "Great service\nFriendly staff", "pics": null, "resp": {"time": 1620681920721, "text": "Your rating and feedback mean a lot to us. Thank you for the review and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "113868727430863279003", "name": "Dennis F Potten", "time": 1614299837099, "rating": 5.0, "text": "Great service. Kind people.", "pics": null, "resp": {"time": 1614352037376, "text": "Thank you for the review! We are glad to know we could provide you with a great service experience."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "117662549422546956646", "name": "Lisa Snow", "time": 1622420731733, "rating": 5.0, "text": "paid for 49 point inspection and glad i did.", "pics": null, "resp": {"time": 1622839167607, "text": "Hello, we really appreciate your feedback! If we can be of further assistance to you please reach out to us. Have a great day!"}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "104672367034695210513", "name": "Angela Mason", "time": 1603738541569, "rating": 5.0, "text": "Sandy Sansing bought out our lease and put us in a brand new Nissan Murano Platinum. Matthew Cali went above and beyond to help us and we are very grateful. Thank you!!", "pics": null, "resp": {"time": 1596203591295, "text": "We are glad to see our team was able to help you out! We appreciate your review and if there is any way we can assist you please let us know."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "103851586249768274468", "name": "andy Sinclair", "time": 1601571919509, "rating": 5.0, "text": "I went for an oil change I was in and out real quick everything was nice,  new, clean and very professional. I will be going back.\n\nAndy", "pics": null, "resp": {"time": 1601575902705, "text": "It is great to hear everything was done quickly and to your satisfaction! We strive for 100% customer satisfaction so we are pleased to hear about your positive experience. Thank you for the review and have a great day!"}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "113503362642161333384", "name": "Sarah Langston", "time": 1598972237967, "rating": 5.0, "text": "Salesman was very helpful and friendly, as was the sales manager.  Very happy with the car we bought.", "pics": null, "resp": {"time": 1598978635148, "text": "We are glad to hear you found our team to be helpful and friendly! We hope you have a great day!"}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "106027401536906853236", "name": "James Parks", "time": 1603132612310, "rating": 5.0, "text": "Everyone was pleasant.  Professional.  And helpful.", "pics": null, "resp": {"time": 1603202220434, "text": "We are so glad you found our team to be helpful and pleasant. It is great to see we were able to help you out. Please reach out to us if there is any way we can assist you. Thank you for the review and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "114923801656075266414", "name": "Scott Livingston", "time": 1613401820205, "rating": 5.0, "text": "Awesome service dept and very friendly", "pics": null, "resp": {"time": 1613491259737, "text": "We are so glad our Service Department was able to provide you with a positive experience! If there is any way we can be of further assistance please reach out to us."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "114618348145415564123", "name": "Timmy Wilkerson", "time": 1602611369766, "rating": 5.0, "text": "Very friendly, professional and helpful sales associates and customer service here...", "pics": null, "resp": {"time": 1602689301489, "text": "Hi, we're happy you found our staff to be so supportive during your experience here at Sandy Sansing Nissan of Foley, Inc. Your satisfaction is our top priority. Thank you for your positive review and we hope to be of service to you in the future."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "113405254139796709972", "name": "Brenda Watson", "time": 1602279494954, "rating": 5.0, "text": "Justin Stanton was amazing! Definitely my new dealership!", "pics": null, "resp": {"time": 1602689572667, "text": "Hello, we really appreciate your feedback! If we can be of further assistance to you please reach out to us. Have a great day!"}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "100365059681080978036", "name": "Bruce Wayne", "time": 1602983131271, "rating": 1.0, "text": "Amateur hour.   You’ll be happier at the Pensacola dealership.", "pics": null, "resp": {"time": 1603207553610, "text": "We are sorry to hear that your experience did not meet your expectations. Please contact our General Manager, Ben Smith (251) 989-1234 to resolve your concerns."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "116397009841339154881", "name": "Crystal Calhoun", "time": 1617374222225, "rating": 5.0, "text": "Top Notch Service!", "pics": null, "resp": {"time": 1618409947901, "text": "Your rating and feedback mean a lot to us. Thank you for the review and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "100337033109939298899", "name": "Tasha Weakley", "time": 1595425516537, "rating": 5.0, "text": "I took my Pathfinder in to have warranty work done and the guys in the Service Dept were beyond helpful. I’m so glad I don’t have to drive to Spanish Fort any longer to get below par service.", "pics": null, "resp": {"time": 1595538063965, "text": "We are glad to hear you found our staff was so knowledgeable and helpful. Thank you for the positive review!"}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "114903633661874965732", "name": "Summer Collins", "time": 1608421231211, "rating": 5.0, "text": "Great experience thanks to Nathan Pilkington 👍👍👍", "pics": null, "resp": {"time": 1608560220285, "text": "Thank you for the review! We always want to hear back from our clients and we are glad you had such a positive experience with us."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "114902649024989933282", "name": "Paul Boodoian", "time": 1621446210130, "rating": 5.0, "text": "Good service, professional", "pics": null, "resp": {"time": 1621454683370, "text": "Hi there, we are very happy to have provided you with such a positive experience!"}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "114941899651172560113", "name": "Lonnie Tapp", "time": 1603209081562, "rating": 5.0, "text": "Had a new key made. 365.  Friendly service", "pics": null, "resp": {"time": 1603289034409, "text": "Thank you for sharing your recent experience! We are glad we were able to help you out. Please let us know if there is any way we can assist you further."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "100954575508356247743", "name": "RONNIE BROOKS", "time": 1612397269406, "rating": 5.0, "text": "Beautiful place and friendly staff", "pics": null, "resp": {"time": 1612461001045, "text": "Thank you for the review! We are so glad you found our staff to be friendly and our facility to be pleasant."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "107298712079426671198", "name": "Dale Lagan", "time": 1605572000834, "rating": 5.0, "text": "Excellent service and did the service promptly and correctly.", "pics": null, "resp": {"time": 1605639061801, "text": "We are glad everything was completed quickly and to your satisfaction. If there is any way we can assist you further please reach out to us."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "115722638442609957877", "name": "Steve Lanahan", "time": 1611686494165, "rating": 5.0, "text": "Walked in at 9:00 left with a new Rogue at 12:15", "pics": null, "resp": {"time": 1611690815292, "text": "Thank you so much for your high rating. We really appreciate your positive review."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "114338525172242954680", "name": "JANET SHELTON", "time": 1605902002746, "rating": 5.0, "text": "Very friendly staff. I was in and out in less than an hour.\nVery clean waiting area. Every staff member wearing a mask.", "pics": null, "resp": {"time": 1606504458208, "text": "We are so glad everything was completed quickly and to your satisfaction. If there is any way we can assist you further please reach out to us. Thank you for the review and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "112005849664424879437", "name": "Timoj Tgb", "time": 1604452366438, "rating": 1.0, "text": "No stars if I could we spent an hour in a half waiting to put up the car and no one was in the dealership but they told us someone would be", "pics": null, "resp": {"time": 1605639923748, "text": "We are sorry to hear that your experience did not meet your expectations. Please contact our General Manager, Ben Smith (251) 989-1234 to resolve your concerns."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "105243051635888978836", "name": "Dalton McAlister", "time": 1597502847492, "rating": 5.0, "text": "I absolutely loved the service department and how quick and how friendly the staff was!!!", "pics": null, "resp": {"time": 1598373897467, "text": "We are so glad to hear everything was done quickly and to your satisfaction! If there is any way we can assist you please let us know."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "107355239885451713529", "name": "Dream Builder Networkers", "time": 1616129063577, "rating": 5.0, "text": "Exelent", "pics": null, "resp": {"time": 1616163657820, "text": "Thank you so much for your high rating. We really appreciate your positive review."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "100636876426117551779", "name": "Ken Maraman", "time": 1596651070812, "rating": 5.0, "text": "Great experience. We are very pleased.", "pics": null, "resp": {"time": 1596808293805, "text": "We appreciate your positive review about your recent experience with us! We hope you have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "117018574818519038963", "name": "Danny Hazlewood", "time": 1606780712696, "rating": 5.0, "text": "Very friendly , prompt, and knowledgeable, great service", "pics": null, "resp": {"time": 1606933237127, "text": "We are so glad everything was completed quickly and to your satisfaction. If there is any way we can assist you further please reach out to us. Thank you for the review and have a great day."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "106715421491739113391", "name": "terrence farley", "time": 1619465572946, "rating": 5.0, "text": "friendly service", "pics": null, "resp": {"time": 1619467550217, "text": "Hello, we really appreciate your feedback! If we can be of further assistance to you please reach out to us. Have a great day!"}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "108563917380080581224", "name": "Kathy Sheppard", "time": 1595423433301, "rating": 5.0, "text": "Professional service tech, nice and comfortable waiting area.", "pics": null, "resp": {"time": 1595538128497, "text": "Thank you for the review! We always want to hear back from our clients and we are glad you had such a positive experience with us."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "112217444833161418391", "name": "Roger Waltman", "time": 1609694641487, "rating": 5.0, "text": "Great experience with Nathon", "pics": null, "resp": {"time": 1609773492183, "text": "Hello, we really appreciate your feedback! If we can be of further assistance to you please reach out to us. Have a great day!"}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "114828329977208376229", "name": "Audrey Smith", "time": 1598811589350, "rating": 5.0, "text": "Love my new 2019 Nissan Pathfinder", "pics": null, "resp": {"time": 1598969818965, "text": "Congrats on your new Pathfinder! We are glad we were able to assist you. If there's anything further we can do for you, we are happy to help."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "117137271887236044266", "name": "Wriston Helms", "time": 1594778309343, "rating": 5.0, "text": "Great people! Proud to work here!", "pics": null, "resp": {"time": 1595538158180, "text": "Hello, thank you for sharing your positive experience!"}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "104880452372319130292", "name": "linda garner", "time": 1616119867495, "rating": 5.0, "text": "Great experience", "pics": null, "resp": {"time": 1616163734014, "text": "Thank you for the review! We are glad we were able to provide you with a positive experience."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "103374291310304657811", "name": "Bonnie Glass", "time": 1616170463803, "rating": 5.0, "text": "Great service", "pics": null, "resp": {"time": 1616172216001, "text": "Hi there, we are very happy to have provided you with such a positive experience!"}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "100333321897117782612", "name": "Housekeeper CampBaldwin", "time": 1597759966185, "rating": 5.0, "text": "Service was good, quick and friendly!!!", "pics": null, "resp": {"time": 1598374240513, "text": "Thank you for the high star rating! We appreciate your feedback. Please let us know if there is anything we can do for you."}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "107109694591063554139", "name": "Alissa Miller", "time": 1615246157642, "rating": 5.0, "text": "👌👏", "pics": null, "resp": {"time": 1615240139113, "text": "We appreciate your positive review about your recent experience with us!"}, "gmap_id": "0x889a0fcfc2ef32a7:0x2619f03d170d0e3a"}
{"user_id": "109915837302393898323", "name": "Autumn Carlisle", "time": 1564194924939, "rating": 5.0, "text": "I had/continue to have a great experience with them. Andre had me in and out of this place in under an hour with keys in hand. He was very friendly to not only me but also my daughter as well. Every time I go in the office, they are always so friendly. They are also great working with you on payments if something comes up. When we decide to buy a second vehicle, it will be with A & M.", "pics": null, "resp": null, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "103452709305243726716", "name": "Kimberly Handley", "time": 1583464190519, "rating": 5.0, "text": "Great staff I saw ad on Facebook of a car I was interested in contacted them and was all set with my approval and ready to go before I visited I test drove and was very happy with vehicle selection all nice newer model cars with good mileage my car drives great they worked with me on my payments that I could afford and downpayment I would recommend them great team", "pics": null, "resp": null, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "114251264470119349309", "name": "Treba C. Harris", "time": 1584087981348, "rating": 5.0, "text": "They are so nice and let's you make your own decisions on the car you want", "pics": null, "resp": null, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "109249417149752786774", "name": "Viridiana Romero", "time": 1539960033080, "rating": 5.0, "text": "This place is the place to go for a car or truck. I worked with Andre and he went above and beyond to make sure I was satisfied with my truck and the loan process. He has great customer service and I was very pleased with him and the business. I will definitely be back and will refer people to them. Again thanks Andre for everything you did I am very grateful!!", "pics": null, "resp": {"time": 1547162348505, "text": "Thank you!"}, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "106271146800559566470", "name": "Andre Pires", "time": 1570478026010, "rating": 5.0, "text": "Excellent dealer, friendly people and nice inventory! I recommend this car lot.", "pics": null, "resp": null, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "108692520327022953211", "name": "jibreel mekdad", "time": 1567001958897, "rating": 5.0, "text": "the people there were friendly and great, they gave me a great deal and the car was in excellent condition. If i could give more than 5 stars i would.", "pics": null, "resp": null, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "101745681858457671888", "name": "Otis Lee Phillips Jr", "time": 1552581714990, "rating": 5.0, "text": "Great 👍 I brought a car months ago. And I tell my people to come check them out quickly get you riding", "pics": null, "resp": {"time": 1561045788120, "text": "Thank you Mrs Phillips!"}, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "107937627270683831724", "name": "Jonathan Bryant", "time": 1540853124574, "rating": 1.0, "text": "WORST EXPERIENCE OF OUR LIVES!!\nthese 4 and 5 star reviews have to be fake or paid for. have to be!\nI got a car from them a little while back , charged almost 6000$ over what the car was worth and was assuming I was getting a decent  car. NOPE!\nIt’s completely undriveable,I spent every penny our family had in the bank and everything I could borrow and I’m still paying payments and it’s sitting in a shop till I can pay the rest of the bill.\nThey knew about the problems and lied to my face !\nStay far away", "pics": null, "resp": {"time": 1602957321201, "text": "Hi Jonathan, I am sorry to hear about your experience with A&M Auto Sales. I can assure you that management has changed since then. We are very different now and strive to provide the best service possible!"}, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "113434331522858834327", "name": "Robert Bates", "time": 1521843932823, "rating": 1.0, "text": "Stay away! They are deceptive and cheats. I bought a truck from them at an outrageous price (had no options at the time and needed a truck A.S.A.P. for business) and I have spent over $5,000 fixing it in the 6 months I've owned it. I was told by Lee and the \"salesman\" that the truck was $11,000, only to charge me $13,000. Of course once I realized what they did and contacted them they play dumb and it is too late. I know if I should have taken more time to review and ask questions but it was the end of the day, past business hours already and I needed to leave with the truck that day. Regardless you should never practice those business ethics in any industry. I have had to change the rotors, brakes, brake drums, brake cylinder, master cylinder, calipers and brackets, hub assembly, CV axles, steering arm, I am in the process of changing the transfer case (over $2,000 on it's own) and it still needs a steering column, gear box, front differential, driveshaft and possibly the rear differential. When it's all said and done I will have put at least 5 times the value of this truck into making it run right and paying it off. I am a self employed remodeler and I have missed countless days of work, lost countless jobs and it's gotten to the point that I am having trouble paying for my daughters daycare and buying her essentials. This whole deal has radically ruined my life. These people knew the situation I was in and absolutely took full advantage. Beware!!!", "pics": null, "resp": {"time": 1602957637827, "text": "Hi Robert, I am so sorry to hear about the terrible experience you had with A&M Auto Sales. Our management has changed since then. We now have a great team behind us to help with any issues with the vehicles for future or current customers!"}, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "106711626749415683459", "name": "Marvin McCoy", "time": 1496330318287, "rating": 5.0, "text": "I highly recommend this place if you are looking for a car!!!! They had what I wanted, and did what was need to get me driving the same day!!! Thanks Mr. Lee and special thanks to Tommy", "pics": null, "resp": null, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "112181012940118527668", "name": "John Galliera", "time": 1609522419743, "rating": 3.0, "text": "Never been.", "pics": null, "resp": {"time": 1609524954351, "text": "Hello John, thank you for the 3 star review. You can come in and visit us at 518 1st Street North, Alabaster, AL. 35007 . We are close by the Shelby Baptist Hospital, we will be happy to help you find a new vehicle."}, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "108701766100171673736", "name": "Shalanda Hill", "time": 1503529170873, "rating": 5.0, "text": "Me an my Husband has had no problems at all so come in an purchase u a car👌", "pics": null, "resp": {"time": 1504113824178, "text": "Thank you Mrs Hill for everything!!!"}, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "111032226785266123123", "name": "Chris Davis", "time": 1551578021886, "rating": 1.0, "text": "Card not clean drove car came back smoking I think bad cars  but that's my thoughts", "pics": null, "resp": {"time": 1602957821745, "text": "Hello Mr. Davis, we are sorry about your experience with our vehicles. We are now under different managment and can assure that the vehicles are now thoroughly cleaned. I hope that you can give us another chance in the future!"}, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "105090458384427744071", "name": "John Hall", "time": 1490632298505, "rating": 5.0, "text": "Great sellers they really understood my situation and got me a great deal I recommend this business to everyone. Thanks you guys", "pics": null, "resp": {"time": 1492440965946, "text": "Thank you for rating A & M Auto Sales, Inc"}, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "105409612809342357156", "name": "Tommy Seals", "time": 1490632582938, "rating": 5.0, "text": "This lot has options no other lot has. Very friendly and will guarantee your approval", "pics": null, "resp": {"time": 1492440903640, "text": "Thank you for rating A & M Auto Sales, Inc"}, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "108643229336949282303", "name": "pga fortnite", "time": 1476824571868, "rating": 5.0, "text": "Staff is very nice; very knowledgeable; Auto Financ Specialist!", "pics": null, "resp": null, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "116928877823447233153", "name": "jeff brantley", "time": 1561409963878, "rating": 5.0, "text": "It's always good", "pics": null, "resp": null, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "113303951820508129435", "name": "BOBBIE RUSSELL", "time": 1534909069318, "rating": 4.0, "text": "Where we got our car😜😜😜", "pics": null, "resp": null, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "111323206290817482427", "name": "Greg Tatum", "time": 1543982671447, "rating": 5.0, "text": "good deals", "pics": null, "resp": {"time": 1561045840655, "text": "Thanks Greg!"}, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
{"user_id": "113303951820508129435", "name": "BOBBIE RUSSELL", "time": 1534909069318, "rating": 4.0, "text": "Where we got our car😜😜😜", "pics": null, "resp": null, "gmap_id": "0x888925dbbabdd9f5:0x7f1bb2bc2ce851d6"}
