{"user_id": "102032324944818337779", "name": "Bruce Trowbridge", "time": 1628343803976, "rating": 5.0, "text": "My 94 year old mom fell and fractured her L1 vertebra the day after Christmas.  She was bed ridden for a couple of months due to the pain, and after the fracture healed remained bed ridden and on oxygen due to progressing congestive heart failure.  This lasted almost 6 months until she passed, with the last 4 months under in-home hospice care.  My mom lived with me, since she (and the rest of the family) did not want her last days to be in a nursing home.  I am a single man and with the constant care my mom required, I could not handle it on my own, I needed caregiving help.  I contracted out 60 hours every week for caregiving and I took the other 128 hours myself.\n\nI contracted with BrightStar based on recommendations from friends, and I was not disappointed.   BrightStar provided qualified care givers, and if mom and/or did not relate well with a particular care giver, BrightStar would provide a different one.  We eventually evolved to a core set of 2 regular care givers, loved by my mom and I,  covering all 60 hours per week.  I don’t know if other companies would be this flexible and supportive.  If a regular caregiver could not come, BrightStar would notify me and fill the gap, so that I could always count on a caregiver at my home at the planned schedule.  Knowing that a caregiver will be there, rain or shine, is a major consideration when determining if you want to hire a known private individual or a company with lots of caregivers.  Additionally, BrightStar schedulers, nurse, business office personnel were always a pleasure to work with and very supportive of mom and I during these trying time.  BrightStar may not be the cheapest, but you can count on them, so you just set your hours to what you can afford.  I highly recommend BrightStar, and if the need for caregiving arises for me in the future, I will be calling them.", "pics": null, "resp": null, "gmap_id": "0x8862691000000001:0x6ce406a91cbe1e64"}
{"user_id": "115435683279121778426", "name": "Mary Cashulette", "time": 1605815190430, "rating": 5.0, "text": "I had a horrible infection. This group is unbelievably professional and caring. Christy Jones came up with the idea of using a vac. My surgeon didn’t think about that. I trusted Brightstar more than him and was able to heal well. Thank you so much! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8862691000000001:0x6ce406a91cbe1e64"}
{"user_id": "101067890724144030572", "name": "Anna Elizabeth Jones", "time": 1454361694232, "rating": 1.0, "text": "100% client oriented.", "pics": null, "resp": null, "gmap_id": "0x8862691000000001:0x6ce406a91cbe1e64"}
{"user_id": "115534002393895043325", "name": "Tati Monű", "time": 1517447395292, "rating": 5.0, "text": "Great place great staff and caregivers", "pics": null, "resp": {"time": 1517540339926, "text": "Thank you!  We are pleased to be able to provide our services to the local, Huntsville community!"}, "gmap_id": "0x8862691000000001:0x6ce406a91cbe1e64"}
{"user_id": "106732304407467933113", "name": "Lyman Holland", "time": 1613854838902, "rating": 1.0, "text": "Workers have not shown up two Saturdays in a row. No calls from company. I have called them, they promised me they would call back in 15 minutes. It has been 45 minutes and they have not called back. They will not answer their phone when I try to call them. My father is bed bound. Due to health issues I can’t change his diaper. Very frustrating I wouldn’t waste your time and money. They really don’t care! Last Saturday the excuse was snow and ice. This is Mobile we didn’t get any snow or ice.", "pics": null, "resp": null, "gmap_id": "0x889a4d1526c7e5cd:0x63f50e0167e05eb8"}
{"user_id": "111370876698018911290", "name": "Cota", "time": 1602867506998, "rating": 5.0, "text": "Great company with great service.  Would highly recommend to anyone.", "pics": null, "resp": null, "gmap_id": "0x889a4d1526c7e5cd:0x63f50e0167e05eb8"}
{"user_id": "106570938823520019133", "name": "William McHenry", "time": 1514520260003, "rating": 5.0, "text": "Very grateful for these people.", "pics": null, "resp": null, "gmap_id": "0x889a4d1526c7e5cd:0x63f50e0167e05eb8"}
{"user_id": "116776467660633840740", "name": "Steve Howe", "time": 1623540502726, "rating": 5.0, "text": "It’s rare to have a company who does what they say they are going to do, but we sure did with this company. When they said they would send someone out to get a new caregiver started and trained, they did. When a regular caregiver couldn’t come in they made sure a trained caregiver was there even if it was office professionals (who were former caregivers). They made sure we liked our caregiver and if we had complaints they would take care of it. George (the owner) was so personable and spent a lot of time with us explaining his philosophy on running the most honest, best caregiving experience.  We also enjoyed and appreciated our caregivers for my parents. They worked hard and loved them like their own. If we are ever in the position to need a caregiving service in the future, there will be no doubt who we will use, Your Choice Senior Care.", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "105521311697546769366", "name": "Heather Steel", "time": 1616790156292, "rating": 5.0, "text": "I'm very pleased with the service given by Your Choice Senior Care. George and his team are great, and have helped my dad so much. And they have brought me incredible peace-of-mind.  Not only do they bring him breakfast in the morning (he's at Somerby) but they make sure he gets his medicine 3x a day, talk with him (this has helped his speech tremendously) and help him keep up with some of his light chores and ADLs on the days he needs it. We have found them to be super accommodating with last minute changes and requests, and overall very responsive and caring. Thank you!", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "111765452972684313246", "name": "Catherine Hales", "time": 1611770989868, "rating": 5.0, "text": "This team is always very responsive in helping our seniors. George and Christina are extremely helpful in making sure prompt and quality care is always available. They are one of the few home care companies that require extended training for those with memory loss. A much needed training in this field!", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "113963477862069589286", "name": "Debbie Leirer", "time": 1576790533076, "rating": 5.0, "text": "I cannot say enough good things about \"Your Choice Senior Care\" and I highly recommend them to anyone that needs senior care assistance.  They have been a godsent for my father.  They are very kind, caring and patient as well as very professional.  They were always on-time for their appointments with my father.  They assisted and trained my father with taking his blood sugar readings and insulin injections.  They offer a variety of services and you can pick the service(s) that best suits your needs.  Their prices are very reasonable.  If you need a senior care professional for your elderly parent, \"Your Choice Senior Care\" is the first call you should make.", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "118158288105220348482", "name": "Richard Davidson", "time": 1559942863931, "rating": 5.0, "text": "I highly recommend Your Choice Senior Care for anyone needed help caring for somebody. We’ve relied on Your Choice for well over a year to help care for my 97 year old mother. The company’s owners/managers are conscientious, hard-working, and responsive to our concerns.\n\nOne caveat: the quality of individual caregivers varies considerably, from excellent too awful. The best are more than caregivers; they are friends, both with my mom and my wife and myself. A rare few were bad enough I ordered them to leave and not return. The owners and managers are careful with who they hire, and pass on our instructions for what is expected from the caregivers, but they cannot monitor everything happening in your home.  In the end, it is up to you to determine which caregivers meets your needs and which have to go.\n\nThat said, anytime there has been problem with a caregiver—no matter the time, day or night—the owners/managers have acted *immediately* to correct the problem, including personally caring for my mom until a replacement caregiver was found.  They strive to provide excellent care to the elderly, and their efforts have made it possible for my mom to continue living with us long after she surpassed our ability to care for her by ourselves.", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "111173524491269581553", "name": "Yvonne Simmons", "time": 1560870714991, "rating": 5.0, "text": "I am helping a friend who lives out of town with his 94 year old Dad.   We chose Your Choice Senior Care about 2 and a half months ago.  Best decision we have made so far.   He has needed 24/7 care up till about a week ago and we cut back to about 10 hrs and the owners helped us figure best times to have the care givers there.\nWe were so lost when we first realized we needed this type care and they took care of everything even down to picking up supplies.  They are so hands on and involved.\nI can go on and on about this being an A+ company!!!!\n\nYvonne", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "117492082925712874149", "name": "Valeria Farmer", "time": 1564659882538, "rating": 1.0, "text": "The 18 yr old they sent to help with my mother wanted to do nothing but sit there and watch tv.  We stopped using them and they keep sending invoices to be paid that we're already paid.  It's been months since we used them, but keep getting invoices each month.  The last conversation i had with them, i was informed they owe me money but here it is the next month and they want me to pay them again!  They owe us no money and we sure don't owe them!", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "118162148206786564250", "name": "Vanessa", "time": 1490797029286, "rating": 5.0, "text": "The care and compassion my mother received from Your Choice Senior care made me want to write a review to tell others. I have a busy life and wanted her to be taken care of by professional and caring people during the day and while I was on vacation. If you're looking for help, give them a call and they can do many things to make your life easier.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOeXsdy8J5-W-2vFBZfPMRJDQllN3twMGr_jj5X=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMDKYKgUni8xI-nT_9kqojytoFJu-n9ScAgZEZC=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "106762902737563814340", "name": "Jevon smith", "time": 1489425220646, "rating": 1.0, "text": "They sent me out 45 miles..an the facility dint allow male caregivers there to sit with woman...they promise me i would still get my 9 hours on my check..THEY SENT ME 16$..please. Stay away from them", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "113695462545965873732", "name": "Leigh Wright", "time": 1490880344064, "rating": 5.0, "text": "They were polite and professional. Definitely made a difficult time easier.", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "100271443291519475830", "name": "Leigh Wright", "time": 1490794533900, "rating": 5.0, "text": "They were friendly and professional. Made caring for my grandmother much easier.", "pics": null, "resp": null, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
{"user_id": "103574179415098269771", "name": "Valerie Chavez", "time": 1553548248356, "rating": 5.0, "text": "Such great people!", "pics": null, "resp": {"time": 1553548502503, "text": "Thank you so much for your kind words! Look forward to seeing Mrs. Chavez next week!"}, "gmap_id": "0x888918bb2920424b:0x24b64014e7e43fcf"}
