{"user_id": "114389766927368203747", "name": "Alisha A.", "time": 1619729110523, "rating": 5.0, "text": "The staff is awesome and the facility is well kept. Just love it!!!  Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "117176364859831372836", "name": "Dr.David Callaway", "time": 1556319208667, "rating": 5.0, "text": "Wonderful place,Very clean. Staff is very nice and helpful. The therapy is the best around.They look after all my needs.The food is really good as well. They treat there residents with respect, and honor.The rooms are nice too.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNQa96ZzdmPi-Dkoj7LohXi2ebDKxxkScAjewMH=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "117631130719516553225", "name": "Mary Folsom", "time": 1611845604700, "rating": 5.0, "text": "Such nice folks! I came here after my knee replacement and the therapy was top notch!", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "102263920896973996306", "name": "laura hough", "time": 1596644460890, "rating": 5.0, "text": "I've worked at this facility for 2.5 years and have loved it the entire time. The staff is very friendly, ED is very accommodating, therapies are excellent. The only reason for my resignation is because my husband is now travelling for work and I need to be closer to home. Otherwise, I would work here until retirement. The nursing staff is wonderful and accomodating. The ED has been updating the building and it looks very nice. Zero odors, ever. The food is good and hot when delivered on halls as staff completes test trays often to ensure palatability. The Food and Nutrition Manager is always implementing new programs to make the residents feel at home -- ice cream socials, homemade bread to make the dining room smell good, omelet and waffle stations. Overall this is a great facility and I would absolutely place my family member here if needed.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "104000478353233117572", "name": "Bill Werner", "time": 1576594786157, "rating": 5.0, "text": "Both my mother and father have been at this facility over the course of several years after falls at home.  Nice staff and a wonderful therapy team.  Best in Mobile.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "105400193774211500960", "name": "Susan Bell", "time": 1559856774428, "rating": 5.0, "text": "I moved my Mother from another facility to this one and am very glad I did.  Staff have been very nice and while we did have to wait on a private room, she has one now and they have been very accomodating in making it home like for her.  She has transitioned very easily and has made herself some friends that she visits with.  My family and I have been very pleased.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "115658923039819088937", "name": "Krystal Bean", "time": 1548270860797, "rating": 5.0, "text": "My grandmother was a patient here and she got great care.  The admissions staff was really nice and understanding and the nursing and therapy staff was amazing.  My family felt good knowing she was being taken care of.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "103014214943805286539", "name": "Julie Peyton", "time": 1538169916149, "rating": 5.0, "text": "This facility came highly recommended and it did not disappoint.  My mother was admitted after her hip surgery and the therapy was excellent.  I don't typically write reviews but was truly impressed with the care she was given.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "103755497433040134447", "name": "Shannon Harris", "time": 1559446985324, "rating": 1.0, "text": "We had a terrible experience with the night nurses. My 88 year old father was there for rehab and when I arrived at 5 am, I found his nurse call button in the chair where he couldn’t reach it. They had wrestled it away from him injuring (cutting)his finger and bruising him. They said that he kept pushing the button. Totally unacceptable. When I left the night before at 9 pm, I left his cell phone along with a pad that had my number and my brothers written down on the tray table next to his bed. When I got there, both had been moved to a desk in his room that again he couldn’t reach. I would hire a sitter if your loved one is ever has to be in this facility, especially at night. Beware of the night nurses. I have names of them if needed.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "116329584868827003341", "name": "Joseph Knight", "time": 1564425978471, "rating": 5.0, "text": "Nice people.  My siblings and I researched the facilities here in Mobile and this one is the best.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "101139146852779315346", "name": "Tom Steele", "time": 1581798586935, "rating": 1.0, "text": "Would not recommend. Nursing care was disappointing. The therapy was ok. Try another place.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "115400500601586851943", "name": "Wade Willis", "time": 1559570666240, "rating": 5.0, "text": "My Mom was at this facility for 20 days following her hip replacement.  The therapy was really good, everyone was friendly and she didn't have to share a room which she wouldn't like.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "106609501257747408726", "name": "Jamie MeMe", "time": 1443971796613, "rating": 1.0, "text": "Absolutely terrible experience; some staff is amazing only a small portion while other staff is horrific and shouldn't be taking care of people or anyone for that matter. Had an issue and staff never followed through. Without going into full details, I wouldn't put my worst enemy in this place. People incarcerated are treated better!  And how absolutely slow the staff is for emergency every minute counts! This place should shut down bottom line.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "102110632141562026879", "name": "Jasmine McMillian", "time": 1529970808001, "rating": 5.0, "text": "One of the best facilities in town!!! the staff were so helpful and kind. when i walked into this facility everyone greeted me as if ive known them a lifetime. The facility smelled wonderful and everything was so nice and pleseant. also the food was AMAZING and the Therapy department couldnt be any better , I would Highly recommend this facility !!!", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "114897683911666630784", "name": "Mike Jacobson", "time": 1525540876513, "rating": 1.0, "text": "DO NOT PUT A LOVED ONE IN THIS FACILITY!!!!! CARE OF RESIDENTS IS TERRIBLE.  STATE VIOLATIONS AGAINST THIS FACILITY FOR FOOD TEMPERATURE, RECURRENCE OF UTI's WAY ABOVE NORMAL; FINES ASSESSED AGAINST FACILITY. LOOKS GOOD FROM OUTSIDE BUT WHEN YOU GET TO ROOMS (UNLESS DIRECTOR THERE IS EXPECTING YOU) ARE FILTHY. RESIDENTS ARE NOT LOOKED AT FREQUENTLY BY AIDS/NURSES.  UNFRIENDLY STAFF.  CHECKED STATE WEBSITE FOR THIS FACILITY, LOOKS LIKE THERE ARE MANY WHO HAVE FILED A CLAIM OF NEGLECT AND ARE REQUESTING FACILITY TO BE SHUT DOWN.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "114045806176273978233", "name": "Betty Lassiter", "time": 1554931526216, "rating": 5.0, "text": "Great therapy staff, I enjoyed the food as well.  Overall a good experience after my hip replacement.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "108460276899931566656", "name": "Joyce Scarbrough", "time": 1523110984875, "rating": 1.0, "text": "My MIL had to be transferred from assisted living to a nursing home because she was having multiple falls, was declining daily, and needed skilled nursing care, so we chose this place. We told them from the beginning that we had gotten a 30-day notice from the assisted living facility to complete the transfer. Dedra, the admissions director, was never in when we called and never returned even ONE of my more than a dozen phone calls. When I went to the facility in person, she was never there and her assistant, Paula, acted as if she was bored to tears by everything I said and could not have cared less about our problems. Finally, when we were on day 24 of our 30 days and Dedra still had not done the face-to-face interview with my MIL to determine if they could take her, we gave up and chose another nursing home. I've known people who had relatives at Mobile Nursing and Rehab who were very happy with the nursing care, but the administration and admissions personnel are terrible. They made an already painful and stressful time for us even worse.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "108965206803018550099", "name": "Amanda Eubanks", "time": 1495304421673, "rating": 5.0, "text": "I work here in housekeeping and I love the environment and the co-workers I love the genuine hospitality we have here and I absolutely love how we all work together to access the need of our residents they are our top priority!", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "103984421904479323260", "name": "artgirl", "time": 1541791418543, "rating": 1.0, "text": "my husband mike was in mnr from mays 31st to june 18, 2018...for rehab...they put him at the end of a long hallway...i think it was room 327...i donot recommend this snf to anyone...on the first day after mike was admitted he ended up being unresponsive and em people took him to providence...we were there 8 hours and we came back...during that night mike couldnt breathe he was on oxygen...so i ran up to the nurses station and got the male nurse on duty...i think his name was vic...not sure...he came up...and checked his line and it had popped off the concentrator...because the line coming from the humidifer was too long...so he cut off a section of it and put it back on and mike could breath...vic...said this happens all the time...mike and i thought this is what might have happened to him and why he landed in the hospital...it is no telling when anyone checked on him...we had problems with some of the nurses espcecially a ms andry...she was so incompetent...i started coming in all the time because i was afraid something would happen to mike...there is a federal law stating that you can visit your loved one at anytime...they tried to keep me from doing it...but i talked to the administrator and she told me i could come in at any time...it got so bad that i started sleeping on the floor because i was scared...i did that for 3 nights until they said it was a fire hazard...so i started sleeping in my truck...and it was a good thing as when i came in the morning...mike was becoming unresponsive and sick...noone had checked on him in 6 hours...too lazy to make that long walk down there...i guess...so we ended up in mobile infirmary again... another thing that happens was that a psychiatrist named florin ghelmez came in while mike was on a bed pan and i asked him to come back...and when he came back mike was still on the pan...so we never saw him again...i guess it was to do an evaluation...so when mike went to mobile infirmary on june 18th by emergency vehicle i came to the hospital...went into mikes cubicle in er...and i saw a manila envelope...i asked mike what it was and he said it was from mobile nursing and rehab...i looked thru it and i asked a pa if they would copy the documents...she said she couldnt so i decided to just keep them...when i went thru it i found documentation by dr. florin ghelmex which basically was all a lie...slanderous...he said he had talked to us both....that mike was an opiate user...that he was doctor shopping and that i was his enabler...so it told mike about it and i later talked to an attorney about it...we decided to file medicare fraud case against this doctor...but would wait till we saw whether he filed the bill...we got the medicare documents and he did file for payment...so we called medicare and filed a fraud case against him...mike and i both thought that mnr was in cahoots with him because in the document he said he had talked to a nurse about us...my husband was on Percocet and fenynal patches but under a doctor care...dr Christopher nichols at the orthopedic group...and had been for a long time...mike was constantly in pain...\ni just got a letter from Medicare stating they are investigating the case... i came out of this facility one night and this lady was sitting in the chairs out front...she asked me what i thought of mnr...i told her that this place scared me...that i thought my husband needed to be in the hospital where he could get skilled care...she told me that her 90 something-year-old mother was there...and that she was in a shared room but no one was there and told her that she could sleep in the bed...they never offered that to me...and i was there every day and i even slept on the floor 3 nights...and i told them i was sleeping in my truck...they made no accommodation for me...mike needed me to be there with him...and i was really helpful to those people...i would change his sheets and clean him up so they wouldnt have to do it...but i stood up for mike...i am not the type of person that will allowed being walked over...", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "111796553275318372906", "name": "Helen Shirey", "time": 1486155025752, "rating": 4.0, "text": "I have volunteered here since 2003 I ,I love the people and the place . When it is my time I will live my final days at this place.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "109324525883330037091", "name": "Mary Cooper", "time": 1602625659557, "rating": 5.0, "text": "wonderful people", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "104276362017182148357", "name": "Angie Thames", "time": 1492106847894, "rating": 1.0, "text": "The absolute worse facility I have EVER been in. I walked into the door after being let in of course by a employee that Never greeted me not even so much a smile, .  I understand the nurse to patient ratio is moderatly high but this is unaccetable .  I pressed the call light and timed the aids to address the light and it was 25 minutes before it was answered.  My mother was in a halo of rine and there were no supplies in the room, she is a tube feeder and the aid tried to put her head down all the way until I reminder her that she was a tube feeder and that wasnt suppose to happen, no gloves no barrier and the trash was over flowing, the TV was off and lights were off in the room, I'd not recommend this facility to anyone other than the state and that would be under the suggestion to shut them down, VERY POOR QUALITY OF CARE BEWARE!!!", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "112759722945689066232", "name": "Jasmine Young", "time": 1581713903820, "rating": 5.0, "text": "Friendly residents and staff", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "101170936167656282919", "name": "kayla buttram", "time": 1631022162736, "rating": 1.0, "text": "I was an employee at this facility and the way they treat some of the patients is sad they don't change them like they are suppose to they yell at the patients put their hands on them", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "114389766927368203747", "name": "Alisha A.", "time": 1619729110523, "rating": 5.0, "text": "The staff is awesome and the facility is well kept. Just love it!!!  Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "117176364859831372836", "name": "Dr.David Callaway", "time": 1556319208667, "rating": 5.0, "text": "Wonderful place,Very clean. Staff is very nice and helpful. The therapy is the best around.They look after all my needs.The food is really good as well. They treat there residents with respect, and honor.The rooms are nice too.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNQa96ZzdmPi-Dkoj7LohXi2ebDKxxkScAjewMH=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "117631130719516553225", "name": "Mary Folsom", "time": 1611845604700, "rating": 5.0, "text": "Such nice folks! I came here after my knee replacement and the therapy was top notch!", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "102263920896973996306", "name": "laura hough", "time": 1596644460890, "rating": 5.0, "text": "I've worked at this facility for 2.5 years and have loved it the entire time. The staff is very friendly, ED is very accommodating, therapies are excellent. The only reason for my resignation is because my husband is now travelling for work and I need to be closer to home. Otherwise, I would work here until retirement. The nursing staff is wonderful and accomodating. The ED has been updating the building and it looks very nice. Zero odors, ever. The food is good and hot when delivered on halls as staff completes test trays often to ensure palatability. The Food and Nutrition Manager is always implementing new programs to make the residents feel at home -- ice cream socials, homemade bread to make the dining room smell good, omelet and waffle stations. Overall this is a great facility and I would absolutely place my family member here if needed.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "104000478353233117572", "name": "Bill Werner", "time": 1576594786157, "rating": 5.0, "text": "Both my mother and father have been at this facility over the course of several years after falls at home.  Nice staff and a wonderful therapy team.  Best in Mobile.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "105400193774211500960", "name": "Susan Bell", "time": 1559856774428, "rating": 5.0, "text": "I moved my Mother from another facility to this one and am very glad I did.  Staff have been very nice and while we did have to wait on a private room, she has one now and they have been very accomodating in making it home like for her.  She has transitioned very easily and has made herself some friends that she visits with.  My family and I have been very pleased.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "115658923039819088937", "name": "Krystal Bean", "time": 1548270860797, "rating": 5.0, "text": "My grandmother was a patient here and she got great care.  The admissions staff was really nice and understanding and the nursing and therapy staff was amazing.  My family felt good knowing she was being taken care of.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "103014214943805286539", "name": "Julie Peyton", "time": 1538169916149, "rating": 5.0, "text": "This facility came highly recommended and it did not disappoint.  My mother was admitted after her hip surgery and the therapy was excellent.  I don't typically write reviews but was truly impressed with the care she was given.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "103755497433040134447", "name": "Shannon Harris", "time": 1559446985324, "rating": 1.0, "text": "We had a terrible experience with the night nurses. My 88 year old father was there for rehab and when I arrived at 5 am, I found his nurse call button in the chair where he couldn’t reach it. They had wrestled it away from him injuring (cutting)his finger and bruising him. They said that he kept pushing the button. Totally unacceptable. When I left the night before at 9 pm, I left his cell phone along with a pad that had my number and my brothers written down on the tray table next to his bed. When I got there, both had been moved to a desk in his room that again he couldn’t reach. I would hire a sitter if your loved one is ever has to be in this facility, especially at night. Beware of the night nurses. I have names of them if needed.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "116329584868827003341", "name": "Joseph Knight", "time": 1564425978471, "rating": 5.0, "text": "Nice people.  My siblings and I researched the facilities here in Mobile and this one is the best.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "101139146852779315346", "name": "Tom Steele", "time": 1581798586935, "rating": 1.0, "text": "Would not recommend. Nursing care was disappointing. The therapy was ok. Try another place.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "115400500601586851943", "name": "Wade Willis", "time": 1559570666240, "rating": 5.0, "text": "My Mom was at this facility for 20 days following her hip replacement.  The therapy was really good, everyone was friendly and she didn't have to share a room which she wouldn't like.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "106609501257747408726", "name": "Jamie MeMe", "time": 1443971796613, "rating": 1.0, "text": "Absolutely terrible experience; some staff is amazing only a small portion while other staff is horrific and shouldn't be taking care of people or anyone for that matter. Had an issue and staff never followed through. Without going into full details, I wouldn't put my worst enemy in this place. People incarcerated are treated better!  And how absolutely slow the staff is for emergency every minute counts! This place should shut down bottom line.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "102110632141562026879", "name": "Jasmine McMillian", "time": 1529970808001, "rating": 5.0, "text": "One of the best facilities in town!!! the staff were so helpful and kind. when i walked into this facility everyone greeted me as if ive known them a lifetime. The facility smelled wonderful and everything was so nice and pleseant. also the food was AMAZING and the Therapy department couldnt be any better , I would Highly recommend this facility !!!", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "114897683911666630784", "name": "Mike Jacobson", "time": 1525540876513, "rating": 1.0, "text": "DO NOT PUT A LOVED ONE IN THIS FACILITY!!!!! CARE OF RESIDENTS IS TERRIBLE.  STATE VIOLATIONS AGAINST THIS FACILITY FOR FOOD TEMPERATURE, RECURRENCE OF UTI's WAY ABOVE NORMAL; FINES ASSESSED AGAINST FACILITY. LOOKS GOOD FROM OUTSIDE BUT WHEN YOU GET TO ROOMS (UNLESS DIRECTOR THERE IS EXPECTING YOU) ARE FILTHY. RESIDENTS ARE NOT LOOKED AT FREQUENTLY BY AIDS/NURSES.  UNFRIENDLY STAFF.  CHECKED STATE WEBSITE FOR THIS FACILITY, LOOKS LIKE THERE ARE MANY WHO HAVE FILED A CLAIM OF NEGLECT AND ARE REQUESTING FACILITY TO BE SHUT DOWN.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "114045806176273978233", "name": "Betty Lassiter", "time": 1554931526216, "rating": 5.0, "text": "Great therapy staff, I enjoyed the food as well.  Overall a good experience after my hip replacement.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "108460276899931566656", "name": "Joyce Scarbrough", "time": 1523110984875, "rating": 1.0, "text": "My MIL had to be transferred from assisted living to a nursing home because she was having multiple falls, was declining daily, and needed skilled nursing care, so we chose this place. We told them from the beginning that we had gotten a 30-day notice from the assisted living facility to complete the transfer. Dedra, the admissions director, was never in when we called and never returned even ONE of my more than a dozen phone calls. When I went to the facility in person, she was never there and her assistant, Paula, acted as if she was bored to tears by everything I said and could not have cared less about our problems. Finally, when we were on day 24 of our 30 days and Dedra still had not done the face-to-face interview with my MIL to determine if they could take her, we gave up and chose another nursing home. I've known people who had relatives at Mobile Nursing and Rehab who were very happy with the nursing care, but the administration and admissions personnel are terrible. They made an already painful and stressful time for us even worse.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "108965206803018550099", "name": "Amanda Eubanks", "time": 1495304421673, "rating": 5.0, "text": "I work here in housekeeping and I love the environment and the co-workers I love the genuine hospitality we have here and I absolutely love how we all work together to access the need of our residents they are our top priority!", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "103984421904479323260", "name": "artgirl", "time": 1541791418543, "rating": 1.0, "text": "my husband mike was in mnr from mays 31st to june 18, 2018...for rehab...they put him at the end of a long hallway...i think it was room 327...i donot recommend this snf to anyone...on the first day after mike was admitted he ended up being unresponsive and em people took him to providence...we were there 8 hours and we came back...during that night mike couldnt breathe he was on oxygen...so i ran up to the nurses station and got the male nurse on duty...i think his name was vic...not sure...he came up...and checked his line and it had popped off the concentrator...because the line coming from the humidifer was too long...so he cut off a section of it and put it back on and mike could breath...vic...said this happens all the time...mike and i thought this is what might have happened to him and why he landed in the hospital...it is no telling when anyone checked on him...we had problems with some of the nurses espcecially a ms andry...she was so incompetent...i started coming in all the time because i was afraid something would happen to mike...there is a federal law stating that you can visit your loved one at anytime...they tried to keep me from doing it...but i talked to the administrator and she told me i could come in at any time...it got so bad that i started sleeping on the floor because i was scared...i did that for 3 nights until they said it was a fire hazard...so i started sleeping in my truck...and it was a good thing as when i came in the morning...mike was becoming unresponsive and sick...noone had checked on him in 6 hours...too lazy to make that long walk down there...i guess...so we ended up in mobile infirmary again... another thing that happens was that a psychiatrist named florin ghelmez came in while mike was on a bed pan and i asked him to come back...and when he came back mike was still on the pan...so we never saw him again...i guess it was to do an evaluation...so when mike went to mobile infirmary on june 18th by emergency vehicle i came to the hospital...went into mikes cubicle in er...and i saw a manila envelope...i asked mike what it was and he said it was from mobile nursing and rehab...i looked thru it and i asked a pa if they would copy the documents...she said she couldnt so i decided to just keep them...when i went thru it i found documentation by dr. florin ghelmex which basically was all a lie...slanderous...he said he had talked to us both....that mike was an opiate user...that he was doctor shopping and that i was his enabler...so it told mike about it and i later talked to an attorney about it...we decided to file medicare fraud case against this doctor...but would wait till we saw whether he filed the bill...we got the medicare documents and he did file for payment...so we called medicare and filed a fraud case against him...mike and i both thought that mnr was in cahoots with him because in the document he said he had talked to a nurse about us...my husband was on Percocet and fenynal patches but under a doctor care...dr Christopher nichols at the orthopedic group...and had been for a long time...mike was constantly in pain...\ni just got a letter from Medicare stating they are investigating the case... i came out of this facility one night and this lady was sitting in the chairs out front...she asked me what i thought of mnr...i told her that this place scared me...that i thought my husband needed to be in the hospital where he could get skilled care...she told me that her 90 something-year-old mother was there...and that she was in a shared room but no one was there and told her that she could sleep in the bed...they never offered that to me...and i was there every day and i even slept on the floor 3 nights...and i told them i was sleeping in my truck...they made no accommodation for me...mike needed me to be there with him...and i was really helpful to those people...i would change his sheets and clean him up so they wouldnt have to do it...but i stood up for mike...i am not the type of person that will allowed being walked over...", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "111796553275318372906", "name": "Helen Shirey", "time": 1486155025752, "rating": 4.0, "text": "I have volunteered here since 2003 I ,I love the people and the place . When it is my time I will live my final days at this place.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "109324525883330037091", "name": "Mary Cooper", "time": 1602625659557, "rating": 5.0, "text": "wonderful people", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "104276362017182148357", "name": "Angie Thames", "time": 1492106847894, "rating": 1.0, "text": "The absolute worse facility I have EVER been in. I walked into the door after being let in of course by a employee that Never greeted me not even so much a smile, .  I understand the nurse to patient ratio is moderatly high but this is unaccetable .  I pressed the call light and timed the aids to address the light and it was 25 minutes before it was answered.  My mother was in a halo of rine and there were no supplies in the room, she is a tube feeder and the aid tried to put her head down all the way until I reminder her that she was a tube feeder and that wasnt suppose to happen, no gloves no barrier and the trash was over flowing, the TV was off and lights were off in the room, I'd not recommend this facility to anyone other than the state and that would be under the suggestion to shut them down, VERY POOR QUALITY OF CARE BEWARE!!!", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "112759722945689066232", "name": "Jasmine Young", "time": 1581713903820, "rating": 5.0, "text": "Friendly residents and staff", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "101170936167656282919", "name": "kayla buttram", "time": 1631022162736, "rating": 1.0, "text": "I was an employee at this facility and the way they treat some of the patients is sad they don't change them like they are suppose to they yell at the patients put their hands on them", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "114389766927368203747", "name": "Alisha A.", "time": 1619729110523, "rating": 5.0, "text": "The staff is awesome and the facility is well kept. Just love it!!!  Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "117176364859831372836", "name": "Dr.David Callaway", "time": 1556319208667, "rating": 5.0, "text": "Wonderful place,Very clean. Staff is very nice and helpful. The therapy is the best around.They look after all my needs.The food is really good as well. They treat there residents with respect, and honor.The rooms are nice too.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNQa96ZzdmPi-Dkoj7LohXi2ebDKxxkScAjewMH=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "117631130719516553225", "name": "Mary Folsom", "time": 1611845604700, "rating": 5.0, "text": "Such nice folks! I came here after my knee replacement and the therapy was top notch!", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "102263920896973996306", "name": "laura hough", "time": 1596644460890, "rating": 5.0, "text": "I've worked at this facility for 2.5 years and have loved it the entire time. The staff is very friendly, ED is very accommodating, therapies are excellent. The only reason for my resignation is because my husband is now travelling for work and I need to be closer to home. Otherwise, I would work here until retirement. The nursing staff is wonderful and accomodating. The ED has been updating the building and it looks very nice. Zero odors, ever. The food is good and hot when delivered on halls as staff completes test trays often to ensure palatability. The Food and Nutrition Manager is always implementing new programs to make the residents feel at home -- ice cream socials, homemade bread to make the dining room smell good, omelet and waffle stations. Overall this is a great facility and I would absolutely place my family member here if needed.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "104000478353233117572", "name": "Bill Werner", "time": 1576594786157, "rating": 5.0, "text": "Both my mother and father have been at this facility over the course of several years after falls at home.  Nice staff and a wonderful therapy team.  Best in Mobile.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "105400193774211500960", "name": "Susan Bell", "time": 1559856774428, "rating": 5.0, "text": "I moved my Mother from another facility to this one and am very glad I did.  Staff have been very nice and while we did have to wait on a private room, she has one now and they have been very accomodating in making it home like for her.  She has transitioned very easily and has made herself some friends that she visits with.  My family and I have been very pleased.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "115658923039819088937", "name": "Krystal Bean", "time": 1548270860797, "rating": 5.0, "text": "My grandmother was a patient here and she got great care.  The admissions staff was really nice and understanding and the nursing and therapy staff was amazing.  My family felt good knowing she was being taken care of.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "103014214943805286539", "name": "Julie Peyton", "time": 1538169916149, "rating": 5.0, "text": "This facility came highly recommended and it did not disappoint.  My mother was admitted after her hip surgery and the therapy was excellent.  I don't typically write reviews but was truly impressed with the care she was given.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "103755497433040134447", "name": "Shannon Harris", "time": 1559446985324, "rating": 1.0, "text": "We had a terrible experience with the night nurses. My 88 year old father was there for rehab and when I arrived at 5 am, I found his nurse call button in the chair where he couldn’t reach it. They had wrestled it away from him injuring (cutting)his finger and bruising him. They said that he kept pushing the button. Totally unacceptable. When I left the night before at 9 pm, I left his cell phone along with a pad that had my number and my brothers written down on the tray table next to his bed. When I got there, both had been moved to a desk in his room that again he couldn’t reach. I would hire a sitter if your loved one is ever has to be in this facility, especially at night. Beware of the night nurses. I have names of them if needed.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "116329584868827003341", "name": "Joseph Knight", "time": 1564425978471, "rating": 5.0, "text": "Nice people.  My siblings and I researched the facilities here in Mobile and this one is the best.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "101139146852779315346", "name": "Tom Steele", "time": 1581798586935, "rating": 1.0, "text": "Would not recommend. Nursing care was disappointing. The therapy was ok. Try another place.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "115400500601586851943", "name": "Wade Willis", "time": 1559570666240, "rating": 5.0, "text": "My Mom was at this facility for 20 days following her hip replacement.  The therapy was really good, everyone was friendly and she didn't have to share a room which she wouldn't like.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "106609501257747408726", "name": "Jamie MeMe", "time": 1443971796613, "rating": 1.0, "text": "Absolutely terrible experience; some staff is amazing only a small portion while other staff is horrific and shouldn't be taking care of people or anyone for that matter. Had an issue and staff never followed through. Without going into full details, I wouldn't put my worst enemy in this place. People incarcerated are treated better!  And how absolutely slow the staff is for emergency every minute counts! This place should shut down bottom line.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "102110632141562026879", "name": "Jasmine McMillian", "time": 1529970808001, "rating": 5.0, "text": "One of the best facilities in town!!! the staff were so helpful and kind. when i walked into this facility everyone greeted me as if ive known them a lifetime. The facility smelled wonderful and everything was so nice and pleseant. also the food was AMAZING and the Therapy department couldnt be any better , I would Highly recommend this facility !!!", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "114897683911666630784", "name": "Mike Jacobson", "time": 1525540876513, "rating": 1.0, "text": "DO NOT PUT A LOVED ONE IN THIS FACILITY!!!!! CARE OF RESIDENTS IS TERRIBLE.  STATE VIOLATIONS AGAINST THIS FACILITY FOR FOOD TEMPERATURE, RECURRENCE OF UTI's WAY ABOVE NORMAL; FINES ASSESSED AGAINST FACILITY. LOOKS GOOD FROM OUTSIDE BUT WHEN YOU GET TO ROOMS (UNLESS DIRECTOR THERE IS EXPECTING YOU) ARE FILTHY. RESIDENTS ARE NOT LOOKED AT FREQUENTLY BY AIDS/NURSES.  UNFRIENDLY STAFF.  CHECKED STATE WEBSITE FOR THIS FACILITY, LOOKS LIKE THERE ARE MANY WHO HAVE FILED A CLAIM OF NEGLECT AND ARE REQUESTING FACILITY TO BE SHUT DOWN.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "114045806176273978233", "name": "Betty Lassiter", "time": 1554931526216, "rating": 5.0, "text": "Great therapy staff, I enjoyed the food as well.  Overall a good experience after my hip replacement.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "108460276899931566656", "name": "Joyce Scarbrough", "time": 1523110984875, "rating": 1.0, "text": "My MIL had to be transferred from assisted living to a nursing home because she was having multiple falls, was declining daily, and needed skilled nursing care, so we chose this place. We told them from the beginning that we had gotten a 30-day notice from the assisted living facility to complete the transfer. Dedra, the admissions director, was never in when we called and never returned even ONE of my more than a dozen phone calls. When I went to the facility in person, she was never there and her assistant, Paula, acted as if she was bored to tears by everything I said and could not have cared less about our problems. Finally, when we were on day 24 of our 30 days and Dedra still had not done the face-to-face interview with my MIL to determine if they could take her, we gave up and chose another nursing home. I've known people who had relatives at Mobile Nursing and Rehab who were very happy with the nursing care, but the administration and admissions personnel are terrible. They made an already painful and stressful time for us even worse.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "108965206803018550099", "name": "Amanda Eubanks", "time": 1495304421673, "rating": 5.0, "text": "I work here in housekeeping and I love the environment and the co-workers I love the genuine hospitality we have here and I absolutely love how we all work together to access the need of our residents they are our top priority!", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "103984421904479323260", "name": "artgirl", "time": 1541791418543, "rating": 1.0, "text": "my husband mike was in mnr from mays 31st to june 18, 2018...for rehab...they put him at the end of a long hallway...i think it was room 327...i donot recommend this snf to anyone...on the first day after mike was admitted he ended up being unresponsive and em people took him to providence...we were there 8 hours and we came back...during that night mike couldnt breathe he was on oxygen...so i ran up to the nurses station and got the male nurse on duty...i think his name was vic...not sure...he came up...and checked his line and it had popped off the concentrator...because the line coming from the humidifer was too long...so he cut off a section of it and put it back on and mike could breath...vic...said this happens all the time...mike and i thought this is what might have happened to him and why he landed in the hospital...it is no telling when anyone checked on him...we had problems with some of the nurses espcecially a ms andry...she was so incompetent...i started coming in all the time because i was afraid something would happen to mike...there is a federal law stating that you can visit your loved one at anytime...they tried to keep me from doing it...but i talked to the administrator and she told me i could come in at any time...it got so bad that i started sleeping on the floor because i was scared...i did that for 3 nights until they said it was a fire hazard...so i started sleeping in my truck...and it was a good thing as when i came in the morning...mike was becoming unresponsive and sick...noone had checked on him in 6 hours...too lazy to make that long walk down there...i guess...so we ended up in mobile infirmary again... another thing that happens was that a psychiatrist named florin ghelmez came in while mike was on a bed pan and i asked him to come back...and when he came back mike was still on the pan...so we never saw him again...i guess it was to do an evaluation...so when mike went to mobile infirmary on june 18th by emergency vehicle i came to the hospital...went into mikes cubicle in er...and i saw a manila envelope...i asked mike what it was and he said it was from mobile nursing and rehab...i looked thru it and i asked a pa if they would copy the documents...she said she couldnt so i decided to just keep them...when i went thru it i found documentation by dr. florin ghelmex which basically was all a lie...slanderous...he said he had talked to us both....that mike was an opiate user...that he was doctor shopping and that i was his enabler...so it told mike about it and i later talked to an attorney about it...we decided to file medicare fraud case against this doctor...but would wait till we saw whether he filed the bill...we got the medicare documents and he did file for payment...so we called medicare and filed a fraud case against him...mike and i both thought that mnr was in cahoots with him because in the document he said he had talked to a nurse about us...my husband was on Percocet and fenynal patches but under a doctor care...dr Christopher nichols at the orthopedic group...and had been for a long time...mike was constantly in pain...\ni just got a letter from Medicare stating they are investigating the case... i came out of this facility one night and this lady was sitting in the chairs out front...she asked me what i thought of mnr...i told her that this place scared me...that i thought my husband needed to be in the hospital where he could get skilled care...she told me that her 90 something-year-old mother was there...and that she was in a shared room but no one was there and told her that she could sleep in the bed...they never offered that to me...and i was there every day and i even slept on the floor 3 nights...and i told them i was sleeping in my truck...they made no accommodation for me...mike needed me to be there with him...and i was really helpful to those people...i would change his sheets and clean him up so they wouldnt have to do it...but i stood up for mike...i am not the type of person that will allowed being walked over...", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "111796553275318372906", "name": "Helen Shirey", "time": 1486155025752, "rating": 4.0, "text": "I have volunteered here since 2003 I ,I love the people and the place . When it is my time I will live my final days at this place.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "109324525883330037091", "name": "Mary Cooper", "time": 1602625659557, "rating": 5.0, "text": "wonderful people", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "104276362017182148357", "name": "Angie Thames", "time": 1492106847894, "rating": 1.0, "text": "The absolute worse facility I have EVER been in. I walked into the door after being let in of course by a employee that Never greeted me not even so much a smile, .  I understand the nurse to patient ratio is moderatly high but this is unaccetable .  I pressed the call light and timed the aids to address the light and it was 25 minutes before it was answered.  My mother was in a halo of rine and there were no supplies in the room, she is a tube feeder and the aid tried to put her head down all the way until I reminder her that she was a tube feeder and that wasnt suppose to happen, no gloves no barrier and the trash was over flowing, the TV was off and lights were off in the room, I'd not recommend this facility to anyone other than the state and that would be under the suggestion to shut them down, VERY POOR QUALITY OF CARE BEWARE!!!", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "112759722945689066232", "name": "Jasmine Young", "time": 1581713903820, "rating": 5.0, "text": "Friendly residents and staff", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "101170936167656282919", "name": "kayla buttram", "time": 1631022162736, "rating": 1.0, "text": "I was an employee at this facility and the way they treat some of the patients is sad they don't change them like they are suppose to they yell at the patients put their hands on them", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "114389766927368203747", "name": "Alisha A.", "time": 1619729110523, "rating": 5.0, "text": "The staff is awesome and the facility is well kept. Just love it!!!  Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "117176364859831372836", "name": "Dr.David Callaway", "time": 1556319208667, "rating": 5.0, "text": "Wonderful place,Very clean. Staff is very nice and helpful. The therapy is the best around.They look after all my needs.The food is really good as well. They treat there residents with respect, and honor.The rooms are nice too.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNQa96ZzdmPi-Dkoj7LohXi2ebDKxxkScAjewMH=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "117631130719516553225", "name": "Mary Folsom", "time": 1611845604700, "rating": 5.0, "text": "Such nice folks! I came here after my knee replacement and the therapy was top notch!", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "102263920896973996306", "name": "laura hough", "time": 1596644460890, "rating": 5.0, "text": "I've worked at this facility for 2.5 years and have loved it the entire time. The staff is very friendly, ED is very accommodating, therapies are excellent. The only reason for my resignation is because my husband is now travelling for work and I need to be closer to home. Otherwise, I would work here until retirement. The nursing staff is wonderful and accomodating. The ED has been updating the building and it looks very nice. Zero odors, ever. The food is good and hot when delivered on halls as staff completes test trays often to ensure palatability. The Food and Nutrition Manager is always implementing new programs to make the residents feel at home -- ice cream socials, homemade bread to make the dining room smell good, omelet and waffle stations. Overall this is a great facility and I would absolutely place my family member here if needed.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "104000478353233117572", "name": "Bill Werner", "time": 1576594786157, "rating": 5.0, "text": "Both my mother and father have been at this facility over the course of several years after falls at home.  Nice staff and a wonderful therapy team.  Best in Mobile.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "105400193774211500960", "name": "Susan Bell", "time": 1559856774428, "rating": 5.0, "text": "I moved my Mother from another facility to this one and am very glad I did.  Staff have been very nice and while we did have to wait on a private room, she has one now and they have been very accomodating in making it home like for her.  She has transitioned very easily and has made herself some friends that she visits with.  My family and I have been very pleased.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "115658923039819088937", "name": "Krystal Bean", "time": 1548270860797, "rating": 5.0, "text": "My grandmother was a patient here and she got great care.  The admissions staff was really nice and understanding and the nursing and therapy staff was amazing.  My family felt good knowing she was being taken care of.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "103014214943805286539", "name": "Julie Peyton", "time": 1538169916149, "rating": 5.0, "text": "This facility came highly recommended and it did not disappoint.  My mother was admitted after her hip surgery and the therapy was excellent.  I don't typically write reviews but was truly impressed with the care she was given.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "103755497433040134447", "name": "Shannon Harris", "time": 1559446985324, "rating": 1.0, "text": "We had a terrible experience with the night nurses. My 88 year old father was there for rehab and when I arrived at 5 am, I found his nurse call button in the chair where he couldn’t reach it. They had wrestled it away from him injuring (cutting)his finger and bruising him. They said that he kept pushing the button. Totally unacceptable. When I left the night before at 9 pm, I left his cell phone along with a pad that had my number and my brothers written down on the tray table next to his bed. When I got there, both had been moved to a desk in his room that again he couldn’t reach. I would hire a sitter if your loved one is ever has to be in this facility, especially at night. Beware of the night nurses. I have names of them if needed.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "116329584868827003341", "name": "Joseph Knight", "time": 1564425978471, "rating": 5.0, "text": "Nice people.  My siblings and I researched the facilities here in Mobile and this one is the best.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "101139146852779315346", "name": "Tom Steele", "time": 1581798586935, "rating": 1.0, "text": "Would not recommend. Nursing care was disappointing. The therapy was ok. Try another place.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "115400500601586851943", "name": "Wade Willis", "time": 1559570666240, "rating": 5.0, "text": "My Mom was at this facility for 20 days following her hip replacement.  The therapy was really good, everyone was friendly and she didn't have to share a room which she wouldn't like.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "106609501257747408726", "name": "Jamie MeMe", "time": 1443971796613, "rating": 1.0, "text": "Absolutely terrible experience; some staff is amazing only a small portion while other staff is horrific and shouldn't be taking care of people or anyone for that matter. Had an issue and staff never followed through. Without going into full details, I wouldn't put my worst enemy in this place. People incarcerated are treated better!  And how absolutely slow the staff is for emergency every minute counts! This place should shut down bottom line.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "102110632141562026879", "name": "Jasmine McMillian", "time": 1529970808001, "rating": 5.0, "text": "One of the best facilities in town!!! the staff were so helpful and kind. when i walked into this facility everyone greeted me as if ive known them a lifetime. The facility smelled wonderful and everything was so nice and pleseant. also the food was AMAZING and the Therapy department couldnt be any better , I would Highly recommend this facility !!!", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "114897683911666630784", "name": "Mike Jacobson", "time": 1525540876513, "rating": 1.0, "text": "DO NOT PUT A LOVED ONE IN THIS FACILITY!!!!! CARE OF RESIDENTS IS TERRIBLE.  STATE VIOLATIONS AGAINST THIS FACILITY FOR FOOD TEMPERATURE, RECURRENCE OF UTI's WAY ABOVE NORMAL; FINES ASSESSED AGAINST FACILITY. LOOKS GOOD FROM OUTSIDE BUT WHEN YOU GET TO ROOMS (UNLESS DIRECTOR THERE IS EXPECTING YOU) ARE FILTHY. RESIDENTS ARE NOT LOOKED AT FREQUENTLY BY AIDS/NURSES.  UNFRIENDLY STAFF.  CHECKED STATE WEBSITE FOR THIS FACILITY, LOOKS LIKE THERE ARE MANY WHO HAVE FILED A CLAIM OF NEGLECT AND ARE REQUESTING FACILITY TO BE SHUT DOWN.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "114045806176273978233", "name": "Betty Lassiter", "time": 1554931526216, "rating": 5.0, "text": "Great therapy staff, I enjoyed the food as well.  Overall a good experience after my hip replacement.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "108460276899931566656", "name": "Joyce Scarbrough", "time": 1523110984875, "rating": 1.0, "text": "My MIL had to be transferred from assisted living to a nursing home because she was having multiple falls, was declining daily, and needed skilled nursing care, so we chose this place. We told them from the beginning that we had gotten a 30-day notice from the assisted living facility to complete the transfer. Dedra, the admissions director, was never in when we called and never returned even ONE of my more than a dozen phone calls. When I went to the facility in person, she was never there and her assistant, Paula, acted as if she was bored to tears by everything I said and could not have cared less about our problems. Finally, when we were on day 24 of our 30 days and Dedra still had not done the face-to-face interview with my MIL to determine if they could take her, we gave up and chose another nursing home. I've known people who had relatives at Mobile Nursing and Rehab who were very happy with the nursing care, but the administration and admissions personnel are terrible. They made an already painful and stressful time for us even worse.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "108965206803018550099", "name": "Amanda Eubanks", "time": 1495304421673, "rating": 5.0, "text": "I work here in housekeeping and I love the environment and the co-workers I love the genuine hospitality we have here and I absolutely love how we all work together to access the need of our residents they are our top priority!", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "103984421904479323260", "name": "artgirl", "time": 1541791418543, "rating": 1.0, "text": "my husband mike was in mnr from mays 31st to june 18, 2018...for rehab...they put him at the end of a long hallway...i think it was room 327...i donot recommend this snf to anyone...on the first day after mike was admitted he ended up being unresponsive and em people took him to providence...we were there 8 hours and we came back...during that night mike couldnt breathe he was on oxygen...so i ran up to the nurses station and got the male nurse on duty...i think his name was vic...not sure...he came up...and checked his line and it had popped off the concentrator...because the line coming from the humidifer was too long...so he cut off a section of it and put it back on and mike could breath...vic...said this happens all the time...mike and i thought this is what might have happened to him and why he landed in the hospital...it is no telling when anyone checked on him...we had problems with some of the nurses espcecially a ms andry...she was so incompetent...i started coming in all the time because i was afraid something would happen to mike...there is a federal law stating that you can visit your loved one at anytime...they tried to keep me from doing it...but i talked to the administrator and she told me i could come in at any time...it got so bad that i started sleeping on the floor because i was scared...i did that for 3 nights until they said it was a fire hazard...so i started sleeping in my truck...and it was a good thing as when i came in the morning...mike was becoming unresponsive and sick...noone had checked on him in 6 hours...too lazy to make that long walk down there...i guess...so we ended up in mobile infirmary again... another thing that happens was that a psychiatrist named florin ghelmez came in while mike was on a bed pan and i asked him to come back...and when he came back mike was still on the pan...so we never saw him again...i guess it was to do an evaluation...so when mike went to mobile infirmary on june 18th by emergency vehicle i came to the hospital...went into mikes cubicle in er...and i saw a manila envelope...i asked mike what it was and he said it was from mobile nursing and rehab...i looked thru it and i asked a pa if they would copy the documents...she said she couldnt so i decided to just keep them...when i went thru it i found documentation by dr. florin ghelmex which basically was all a lie...slanderous...he said he had talked to us both....that mike was an opiate user...that he was doctor shopping and that i was his enabler...so it told mike about it and i later talked to an attorney about it...we decided to file medicare fraud case against this doctor...but would wait till we saw whether he filed the bill...we got the medicare documents and he did file for payment...so we called medicare and filed a fraud case against him...mike and i both thought that mnr was in cahoots with him because in the document he said he had talked to a nurse about us...my husband was on Percocet and fenynal patches but under a doctor care...dr Christopher nichols at the orthopedic group...and had been for a long time...mike was constantly in pain...\ni just got a letter from Medicare stating they are investigating the case... i came out of this facility one night and this lady was sitting in the chairs out front...she asked me what i thought of mnr...i told her that this place scared me...that i thought my husband needed to be in the hospital where he could get skilled care...she told me that her 90 something-year-old mother was there...and that she was in a shared room but no one was there and told her that she could sleep in the bed...they never offered that to me...and i was there every day and i even slept on the floor 3 nights...and i told them i was sleeping in my truck...they made no accommodation for me...mike needed me to be there with him...and i was really helpful to those people...i would change his sheets and clean him up so they wouldnt have to do it...but i stood up for mike...i am not the type of person that will allowed being walked over...", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "111796553275318372906", "name": "Helen Shirey", "time": 1486155025752, "rating": 4.0, "text": "I have volunteered here since 2003 I ,I love the people and the place . When it is my time I will live my final days at this place.", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "109324525883330037091", "name": "Mary Cooper", "time": 1602625659557, "rating": 5.0, "text": "wonderful people", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "104276362017182148357", "name": "Angie Thames", "time": 1492106847894, "rating": 1.0, "text": "The absolute worse facility I have EVER been in. I walked into the door after being let in of course by a employee that Never greeted me not even so much a smile, .  I understand the nurse to patient ratio is moderatly high but this is unaccetable .  I pressed the call light and timed the aids to address the light and it was 25 minutes before it was answered.  My mother was in a halo of rine and there were no supplies in the room, she is a tube feeder and the aid tried to put her head down all the way until I reminder her that she was a tube feeder and that wasnt suppose to happen, no gloves no barrier and the trash was over flowing, the TV was off and lights were off in the room, I'd not recommend this facility to anyone other than the state and that would be under the suggestion to shut them down, VERY POOR QUALITY OF CARE BEWARE!!!", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "112759722945689066232", "name": "Jasmine Young", "time": 1581713903820, "rating": 5.0, "text": "Friendly residents and staff", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "101170936167656282919", "name": "kayla buttram", "time": 1631022162736, "rating": 1.0, "text": "I was an employee at this facility and the way they treat some of the patients is sad they don't change them like they are suppose to they yell at the patients put their hands on them", "pics": null, "resp": null, "gmap_id": "0x889bb2ff5d0c2d7d:0x8a0921432909962f"}
{"user_id": "112077628037473693283", "name": "Evgenia Kovda", "time": 1606324027044, "rating": 5.0, "text": "Have taken really good care of my aged dad, many thanks to the caring staff.", "pics": null, "resp": null, "gmap_id": "0x888a034847ad03a1:0x562bc5a652a5e78d"}
{"user_id": "111329596592354783893", "name": "Dinah Harper", "time": 1598901774125, "rating": 4.0, "text": "Having to see my mom thru a window is heartbreaking due to CoVid19 but they are doing a wonderful job with their residents.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN-hyfSfIguqjSg8NejBVrba5rmqP6kKBnh9OAJ=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a034847ad03a1:0x562bc5a652a5e78d"}
{"user_id": "100533739957817140376", "name": "Misty Clift", "time": 1582905825369, "rating": 5.0, "text": "Very clean, very friendly environment from the time you walk through the doors.", "pics": null, "resp": null, "gmap_id": "0x888a034847ad03a1:0x562bc5a652a5e78d"}
{"user_id": "102274810465714920704", "name": "Suzanne Ray", "time": 1581007350902, "rating": 1.0, "text": "My father was admitted one Tuesday for Rehab and I got a call on Friday morning that he was given another Patient’s medication ( 4 different meds). He was monitored at the ER and was discharged to home For home health PT. I was not going to give them another chance to harm him.", "pics": null, "resp": null, "gmap_id": "0x888a034847ad03a1:0x562bc5a652a5e78d"}
{"user_id": "101602111376238588335", "name": "Susan Burgess", "time": 1464895584678, "rating": 5.0, "text": "My husband's cousin and Aunt are there. She is in the rehab just yesterday from the hospital after a bad fall. I saw a post from 2 weeks ago from an employee stating she loved her job and has been there for  4 years. Things have been good for  his cousin.\nPraying his Aunt can recover.  All of our family appreciates the kindness that has been shown to out loved ones. It really means a lot.\nThank you so much! ❤️\n\nFamily appreciates", "pics": null, "resp": null, "gmap_id": "0x888a034847ad03a1:0x562bc5a652a5e78d"}
{"user_id": "106668309176721311050", "name": "Emily Tinsley", "time": 1582824420083, "rating": 5.0, "text": "Great place that provides great care!!", "pics": null, "resp": null, "gmap_id": "0x888a034847ad03a1:0x562bc5a652a5e78d"}
{"user_id": "113394597488969587343", "name": "Tina Soper", "time": 1463517332248, "rating": 5.0, "text": "I have worked there for 4 years and I love my job we treat each other like family even residents. I wouldn't work anywhere else.", "pics": null, "resp": null, "gmap_id": "0x888a034847ad03a1:0x562bc5a652a5e78d"}
{"user_id": "108623747909279235398", "name": "Judy Brown", "time": 1420666694343, "rating": 4.0, "text": "A cold day but pleasant experience", "pics": null, "resp": null, "gmap_id": "0x888a034847ad03a1:0x562bc5a652a5e78d"}
{"user_id": "106871101799430229684", "name": "Carol-Ann Stewart", "time": 1616286244221, "rating": 5.0, "text": "Synergy Homecare was the perfect agency to support my dad’s stroke recovery. I needed a little extra help each weekday morning while my dad was on home health and his care giver (Brandon) really helped him gain his strength back.\n\nSynergy was very responsive and very easy to work with, I highly recommend this company.", "pics": null, "resp": {"time": 1617285655380, "text": "Thank you Carol-Ann it was an honor to provide care for your dad."}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "102407641770590147367", "name": "Delaris Juitt", "time": 1630341899390, "rating": 5.0, "text": "The office staff and caregiver are excellent Connie makes sure to provide the right caregiver to their patients.  Also counsel the caregiver on what the patients need.", "pics": null, "resp": {"time": 1630443795197, "text": "Thank you Ms. Juitt. We appreciate you!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "105152836720160835427", "name": "Jan D", "time": 1610993364460, "rating": 5.0, "text": "The caregivers we had were compassionate and loving. Helpful and caring. They took a load off our minds for sure. Synergy was easy to work with, as well. Thank you so much.", "pics": null, "resp": {"time": 1611160937729, "text": "Thank you Jan."}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "100953268878880699199", "name": "Tracey Sheets", "time": 1600803322962, "rating": 5.0, "text": "I continue to be impressed by all the staff at Synergy Home Health. Especially Mrs Keisha. I feel like they really care about the patient and as my husband’s caregiver, I feel very supported by Synergy. Everyone has been so nice and helpful. I’m extremely grateful I connected with Synergy.", "pics": null, "resp": {"time": 1600807057799, "text": "Thank you Tracey for your kind words!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "112357443399142504759", "name": "Aleshia Walker", "time": 1571425543312, "rating": 5.0, "text": "Working for SYNERGY has been an extremely positive experience.  The whole organization truly cares about providing quality care and support to each client, and is in this business for all of the right reasons.  They are available 24/7 and work hard to accommodate their clients' scheduling needs.  The office staff truly cares for each client like family and we have wonderful caregivers.  I'm excited to see what the future holds for Synergy HomeCare!", "pics": null, "resp": {"time": 1571428429210, "text": "Thanks Aleshia, we are blesses to have you on our team."}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "109757023190937385623", "name": "Jenny Hallyburton", "time": 1596589434418, "rating": 5.0, "text": "Synergy has great customer service and the management team has always been helpful. Scott and Lynn are always willing to meet families and answer any questions they may have. I highly recommend this sitter service.", "pics": null, "resp": {"time": 1596650962123, "text": "Thanks Jenny!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "111854529968598824500", "name": "Amy Whittenburg", "time": 1572538859541, "rating": 5.0, "text": "My mother is in late stage Alzheimer's and the caregivers have been wonderful with her.  They are very skilled and have the knowledge to deal with my mom on a daily basis.  They bathe, feed, keep her engaged and love on her.  Could not ask for a better company to take care of my mom.", "pics": null, "resp": {"time": 1572539905188, "text": "Thank you Amy!  We love working with your mom!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "102790628163316545891", "name": "Lady Te", "time": 1579859234962, "rating": 4.0, "text": "I will not be with this company much longer due to low pay, plus I found a wonderful family that I will be working for with much better pay. I love what I do and plan on staying in this line of work but love doesn’t pay the bills or put food on the table and clothe my children. I loathe being forced to work overtime just to make ends meet which takes time away from my family. I really do wish things were different because I absolutely love the company and some of the management. I just wish they paid based on experience but they don’t. If you are experienced you will be making the same as someone who has never done this before and are afraid of the elderly. They really do there best to show appreciation for there caregivers and cna’s but trust me, the best thing to do is pay your experienced employees a decent livable wage.\n\nYou can bet that whenever you see “competitive wages” on the job application just know that means you will be paid little to nothing and a decent check depends on how desperate you are for the money and if you aren’t desperate enough to do a boat load of overtime then don’t waste your time.\n\nI will say that Scott and Lynn are wonderful people and they are flexible with your shifts so you’ll be able to work what fits you best. Keisha, Kathleen and Santrece are so warm and wonderful to work with.\n\nI’d say this job is great for beginners and students who plan on going into medical. Although we do not provide skilled nursing like a Ltcf it is the basics and allows you to get your feet wet. I love the company but I’ve outgrown it and just because it’s no longer a good fit for me, doesn’t mean I will not recommend this company to reliable people who need work. I’ve already sent some people Synergys’ way.", "pics": null, "resp": null, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "101382569584896141318", "name": "T0785", "time": 1596580342498, "rating": 5.0, "text": "Thank you so much for your great care for our patients and staff at Arbor Springs!", "pics": null, "resp": {"time": 1596651018835, "text": "Thank you Taresa!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "101637236862186019155", "name": "Nicole Gachett", "time": 1597238908358, "rating": 5.0, "text": "Awesome staff and great welcoming atmosphere upon entry of the office.", "pics": null, "resp": {"time": 1597244129981, "text": "Thanks Nicole, you're awsome!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "108371891602155134744", "name": "Dwayne Long", "time": 1579543108674, "rating": 5.0, "text": "These are some truly amazing people who take  very good measures to insure that you are receiving the best possible care for what is going on and helps you understand all aspects of your care. And it helps that they have a great  attitude and outlook for helping people to understand.", "pics": null, "resp": {"time": 1596651070015, "text": "Thanks Dwayne!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "109195218335298633090", "name": "Janine Rumker", "time": 1542733229753, "rating": 5.0, "text": "Right from the very beginning, Shasta from Synergy made us feel welcome and cared for. She was patient and kind with my mother, who recently had a heart attack and had a stent put in. My mother is a caregiver, not used to accepting help and certainly a very proud and private person. She did NOT want any help, certainly not with bathing. Shasta knew just whom to send...Michelle. What a blessing! My mom went from not wanting any help, to wanting to take Michelle with her to her home in Florida! Michelle was so kind and understanding. She did things without being told, was efficient and sweet. I can't say enough good things about our first experience with home care. Thank you so much Synergy!", "pics": null, "resp": {"time": 1542753539473, "text": "Janine,\nTaking care of your mother was such a blessing. Michelle told us many times how much she enjoyed their time together. We wish the best for your mother in Florida and we will miss her.\nThank you again,\nShasta Kromer"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "105946262325231529260", "name": "venus9 Cotton", "time": 1584158205763, "rating": 4.0, "text": "I have never work there but I heard some good thing's", "pics": null, "resp": null, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "102790628163316545891", "name": "Lady Te", "time": 1579859234962, "rating": 4.0, "text": "I will not be with this company much longer due to low pay, plus I found a wonderful family that I will be working for with much better pay. I love what I do and plan on staying in this line of work but love doesn’t pay the bills or put food on the table and clothe my children. I loathe being forced to work overtime just to make ends meet which takes time away from my family. I really do wish things were different because I absolutely love the company and some of the management. I just wish they paid based on experience but they don’t. If you are experienced you will be making the same as someone who has never done this before and are afraid of the elderly. They really do there best to show appreciation for there caregivers and cna’s but trust me, the best thing to do is pay your experienced employees a decent livable wage.\n\nYou can bet that whenever you see “competitive wages” on the job application just know that means you will be paid little to nothing and a decent check depends on how desperate you are for the money and if you aren’t desperate enough to do a boat load of overtime then don’t waste your time.\n\nI will say that Scott and Lynn are wonderful people and they are flexible with your shifts so you’ll be able to work what fits you best. Keisha, Kathleen and Santrece are so warm and wonderful to work with.\n\nI’d say this job is great for beginners and students who plan on going into medical. Although we do not provide skilled nursing like a Ltcf it is the basics and allows you to get your feet wet. I love the company but I’ve outgrown it and just because it’s no longer a good fit for me, doesn’t mean I will not recommend this company to reliable people who need work. I’ve already sent some people Synergys’ way.", "pics": null, "resp": null, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "110463180510508467113", "name": "Urica Summers", "time": 1571426576882, "rating": 5.0, "text": "I started with Synergy last year it's a great place to work and the staff is very friendly and the schedules are flexible 😊", "pics": null, "resp": {"time": 1571428245321, "text": "Thanks, Urica!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "105536607524898326678", "name": "Gretchen McKenzie", "time": 1565981358160, "rating": 5.0, "text": "I have been working for synergy for two years and I love my job and they’re great people to work with.I give five stars to this awesome company!", "pics": null, "resp": {"time": 1565984793343, "text": "Thank you Gretchen!  We appreciate you so much!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "117152289914272617284", "name": "Erin Carter", "time": 1595974644799, "rating": 5.0, "text": "Great staff and so compassionate!", "pics": null, "resp": {"time": 1596026201190, "text": "Thanks Erin!"}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "115359726514514132019", "name": "Santrice McClure", "time": 1571425170185, "rating": 5.0, "text": "I start as a caregiver in 2015 when they first open up. I work in the field i absolutely love working for Synergy Home Care and the owners a very understand and i love working with them.", "pics": null, "resp": {"time": 1571428108107, "text": "You are an awesome caregiver."}, "gmap_id": "0x888ced42f071fc51:0xb31dac841c2213ee"}
{"user_id": "101614158367810349558", "name": "Jeannie Davis", "time": 1524688571708, "rating": 5.0, "text": "My aunt and I toured this facility and we were extremely impressed with it and the staff.  Mary Holley helped us and she could not have been nicer or more helpful. My aunt could not make up her mind at this time and they were more than understanding. They were kind, respectful ,and more than patient. If the time comes for her to live somewhere, I could not ask for a  better place.", "pics": null, "resp": {"time": 1526497870980, "text": "Thank you very much for your five-star review, Jeannie! We’re happy to hear that you had a great tour with your aunt and we very much appreciate your kind words about our community and its dedicated associates and care partners. We understand that it’s a difficult decision and that it’s one you need to take your time with. Please feel free to bring your aunt by for another visit soon. We’d love the opportunity to get to know you both better. Again, we thank you for taking the time to rate us. Please let us know if we can be of further service to you!"}, "gmap_id": "0x888860c5034bedc5:0x6c261a65a3aa91e8"}
{"user_id": "108204091890287839746", "name": "Debbie Wilson", "time": 1518575479244, "rating": 5.0, "text": "Mary Holly came in on her day off to speak to us regarding Mom/mother in law. She was so very helpful, caring and sincere in her advise. The facility was so impressive, clean and staff was very  friendly. Everyone we met seemed to be part of one big loving family. All though we decided to bring our Mother home with us to Montana, we would have not hesitated to place her at Harbor Chase in Jasper, Al.  Thank you Mary and staff Alan & Debbie Wilson, Victor, Mt", "pics": null, "resp": {"time": 1520517287535, "text": "Thank you for your five-star review, Debbie! We’re very happy that you and your family had such a wonderful visit with us at HarborChase. We sincerely appreciate your kind words about our great community and clean environment. We especially thank you for singling out so many of our talented and dedicated associates. Every day, they strive to provide compassionate care that goes above and beyond all expectations. We truly do think of ourselves as one big, happy family. Again, we thank you for taking the time to review our community. Please let us know if we may be of service to you and your family in the future!"}, "gmap_id": "0x888860c5034bedc5:0x6c261a65a3aa91e8"}
{"user_id": "112897887315962793091", "name": "Kathy Dawson", "time": 1572546520031, "rating": 5.0, "text": "My mom lives here & she loves it!😁", "pics": null, "resp": {"time": 1572877344290, "text": "Thank you so much for your wonderful five-star review! We look forward to serving your family for years to come!"}, "gmap_id": "0x888860c5034bedc5:0x6c261a65a3aa91e8"}
{"user_id": "100977504971469145887", "name": "Kathy Waddleton", "time": 1540401332959, "rating": 1.0, "text": "Today I saw the disgusting excuse for food served to the residents. For the money that the residents are required to pay should at least bring a healthy edible meal 😢", "pics": null, "resp": null, "gmap_id": "0x888860c5034bedc5:0x6c261a65a3aa91e8"}
{"user_id": "107376857926500224244", "name": "Pam Ward", "time": 1540487119786, "rating": 1.0, "text": "Look on Face book and see what they are feeding residents...just awful.\n.", "pics": null, "resp": null, "gmap_id": "0x888860c5034bedc5:0x6c261a65a3aa91e8"}
{"user_id": "110362371069731585716", "name": "Don Jackson", "time": 1621116533155, "rating": 1.0, "text": "Where do I begin? During my father’s stay at this facility, he contracted Ecoli and was hospitalized  for two weeks.  Following his hospitalization, an employee of the facility (who claimed to have been looking out for my father) started texting and calling me.  She advised me that my father was receiving inadequate care, that another employee was abusive to patients and that the facility was unsanitary.  ECOLI IS TRANSMITTED IN UNSANITARY ENVIRONMENTS.   The employee then attempted to leverage me for money.  It was classic:  “I am going to look out for your father. He is not being treated well.  I need money..  Let me hold a few dollars.”  The employee actually sent text messages asking for money.  The Director of the facility was advised of the employee’s conduct.  When he was advised, he stated on a teleconference with almost ten witnesses that the employee attempted to leverage me because I was “successful” without accepting responsibility for the employee’s conduct.  Unsanitary environment, telephones that don’t work (even though you are charged for them),   etc.  Since the visitation restrictions were imposed 14 months ago, I am concerned that the quality of care has declined.", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "113392264273281434276", "name": "Just 1 Man", "time": 1531473605315, "rating": 1.0, "text": "Beware of this place.  Your family member is not safe.  They sent my mother in law off campus for an MRI that she wasn't scheduled for and didn't have it documented until the next day and never informed any of her 8 children that they were doing so. If there wasn't so much covering up and lying it wouldn't have been so bad.  Generally I believe in accepting responsibility and moving on to a solution,  but when grown women are lying and pushing the blame, that means this type of thing happens often.   If it had been my mother.... it wouldn't have ended like that.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMKsGutfPnmOrf4BxgAy7kJtQLHYOQljpk4Ga4h=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMruQtZHmPIL8Q1e5OK-O4fpAWHakk3ARXmwDEY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPcu7mgMdmOLdnfDvEh5-lBuQaY8uarQOf_UfG4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOMIuxGAboGbmKXDQQExyx8VNnNv9EkwpzGnWBy=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMUe0s_WIExTNh-4tdidxqtWdi8Ccegc4X-AxhD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOIhHtC8q5551ePwsodbrtWpNTyoNMkUuulys_5=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOa4ZmzDxAfaVdCFhxd1gH072DRDh9fmUHP2qz4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP4ig0UhYWPXH8_tgnb8_k-r5ZZac_urMIz2TiI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNtaCPt67K_ieRdMkt0axA4PUpfYq5l1LwO8O7r=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPBN3aXmW3s3YYRH2zKYR1cjaISLquNWEtifIvX=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "116990627022591063287", "name": "Esi Fante", "time": 1622974689180, "rating": 1.0, "text": "If you can avoid it PLEASE DO NOT go to this place! TERRIBLE!!!", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "110477490497628531930", "name": "Vicki Scott", "time": 1583111196967, "rating": 5.0, "text": "Hillview Terrace is Amazing! My mom loves being there and they are taking such good care of her. We started in Rehab Select and they were great! The Administrator, Business Office, and the Nursing Staff on Oak Station are so so wonderful. They always check on my mom and keep her room clean. They have fun activities for the residents. We couldn’t ask for a better group of people to take care of my mom .", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "103404453744902264223", "name": "Douglas Dunn", "time": 1596656553131, "rating": 1.0, "text": "My uncle was placed here for 14 days after a broken hip.  The center used the COVID-19 pandemic to keep family members from checking on him.  He was left unattended because they said he had to be quarantined.  His surgical dressings were not changed during his stay here.  He was not bathed.  Now he has bedsores, open sores in his groin area, and his surgical sutures were infected.  This facility used COVID-19 as an excuse for neglect.   He is now in more pain and in worst shape than before he went into this facility.", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "115332787168540554038", "name": "Kendra Johnson", "time": 1576589639448, "rating": 5.0, "text": "This review is for Rehab Select!\n\nThe admission process was seamless and the staff was outstanding! Huge thanks to all of you for taking care of my grandmother after a traumatic experience. We greatly appreciate you guys and couldn’t thank you all enough! Would definitely recommend!\n\nHonorable mentions to Ms. Awilda, Audreanna, and Nurse Paige! You guys were awesome!", "pics": null, "resp": {"time": 1579488759044, "text": "Thank you"}, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "101513295959200797940", "name": "James Archie", "time": 1580420492124, "rating": 5.0, "text": "Admission process was seamless, way faster than the hospital, the staff was very nice and i was informed of her health condition every day", "pics": null, "resp": {"time": 1580489310018, "text": "Thank you for your review and i'm glad you had a great stay. We are always looking for ways to make processes work better. Let us know if we can ever be of any assistance.  Thank you again."}, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "110130734769499153325", "name": "audrianna laprade", "time": 1580420925368, "rating": 5.0, "text": "I had a great experience, great staff and great care, sometimes they took a few minutes to answer the call light but overall very good", "pics": null, "resp": {"time": 1580488929676, "text": "Thank you for your review and I’m glad you had a great experience. We will continue to strive to exceed our customers expectations.  Thank you again and if we can ever be of assistance please let me know."}, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "112560825251651090280", "name": "Berenice Lopez", "time": 1580419938462, "rating": 5.0, "text": "My loved one received the best care here, the staff is very friendly , and they have an amazing Rehab program!", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "113947367106011066301", "name": "Fred Burnett", "time": 1603157529991, "rating": 5.0, "text": "The nurses were very helpful", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "105294504306449432759", "name": "wendee hughes", "time": 1552284425722, "rating": 5.0, "text": "Very nice and very clean facility. Staff are knowledgable and caring with patients. Had an excellent experience here and would recommend to anyone needing a place for their loved one!", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "111226592635558673172", "name": "Peggy Terry", "time": 1558901284450, "rating": 2.0, "text": "When you gotta go you gotta go !!\nThis is Rehab select adjoined to Hillview terrace.\nThis staff here doesn't get in a hurry for anyone. The call button is useless . I experienced this myself not the patient. I'm going to find out a top person to talk to . This was on Sunday afternoon between two and three . Finally got a tech by going to the desk . Oh she came and then disappeared for another ten minutes before actually fixing the problem.\nDon't bring your family member here.\nRehab Select", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "104219253168906735577", "name": "Awilda Fegans", "time": 1581018931690, "rating": 5.0, "text": "I would recommso please with her out come.\n— Awilda Fegsns\nend Hillview Terrace to all of my Friends and Family...", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "102836385155515055988", "name": "Patricia Carroll", "time": 1595982402562, "rating": 1.0, "text": "If you can AVOID this place at all cost. It shouldn't even be open.", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "117512636144899196082", "name": "Lover Boy", "time": 1536084308694, "rating": 1.0, "text": "I've never been to this place, but I've interacted with a few of the staff at my former job. Those particular ones were rude & had no basic manners. I guess because they wear blue scrubs & work in a clinic that they must think they're above you. One in particular I dealt with named \"Marghert\" had a very cold demeanor the whole time I was waiting on her, and of course, she didn't say thank you or anything when the transaction was over smh. I won't refer any of my loved ones to this place. If you care about your loved ones, then you wouldn't either.👎", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "115671644076438443237", "name": "Jennifer Dickey", "time": 1525899520605, "rating": 1.0, "text": "This place is a joke. Giving them one star is too much. I honestly cannot believe this place is still open. My mother's care was ridiculous. They never gave her her meds when they were suppose to be given. They all acted like they hated their jobs. They looked and talked to my mom like she was disgusting. I got her the hell out of there and took her to the hospital so she could get real care and they were appalled by her treatment as well. They even tried to blackmail her when she said she wanted to leave (per her surgeon who did not agree with any of her care) and stated that she would be stuck with the bill because Medicare wouldn't pay. I called Medicare myself and they said that's not true. The whole place smells like urine and feces. The rehab lady was rude as hell as well. No one here is professional. I could go on and on but just thinking about this place disgusts me. IF YOU LOVE YOUR FAMILY MEMBER, DO NOT SEND THEM HERE!!!!!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "106538787021055842802", "name": "Dixie Forever", "time": 1443460954362, "rating": 1.0, "text": "If your family member passes away at this facility, the administrator sends any funds in the patient account to Alabama Unclaimed Property rather than turning the funds over to the designated family contact.  You will never be able to recover the funds, as the administrator will not authorize Unclaimed Property to release the funds.  The administrator will dodge your phone calls and refuse to communicate with you.  They are ripping off patient accounts.\n\nThe nursing home is filthy, needs repainting and reeks of urine.  DO NOT send your family member here.", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "110314129110964388632", "name": "Ann Jac-Gor", "time": 1536092853114, "rating": 1.0, "text": "My mother in law came for rehab from knee replacement surgery. She has dementia, diabetes and the knee surgery.  They along with the insurance company said that they know how to deal with patients with dementia. They complained to my husband that she couldn't respond to their commands and she just sat there...his response was I thought you had the capabilities to deal with dementia patients? The response was \"we don't do miracles.\" Mom had TWO UTIs while there. The second time we came close to the room on Sunday to a foul smell.  I checked to see if she was wet. She was wet and the pad beneath her was wet as well. They sent a culture of urine to be tested on Monday; the result was that she had a Urinary Tract Infection (UTI). By Wednesday they were awaiting prescription orders for her treatment.  My mother in law was transferred from there to another facility the next Tuesday. The UTI was still not treated. The facility where we had her transferred handled the UTI immediately. Dementia gets worse when there is an infection or UTI. She's Diabetic: they told me that they don't have a diabetic diet there to give patients. Well, I asked them not to give her sugar, caffeine, and pork. Her sugar was as high as 300+. When she was home, 118 was the highest unless she cheated then 220. She never took insulin shots; she got them there because they sent it up high with the bad diet, then gave insulin to bring it back down. Diabetic patients are groggy or sleepy when their glucose is up. According to them, she doesn't respond to commands. DUH if her glucose is high and she has a UTI, what the heck do they expect? OH, they don't do miracles! I guess I was talking to a wall when instructions and requests were given!!", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "100223018059746284973", "name": "andrew cook", "time": 1463336085942, "rating": 5.0, "text": "I visited a family member in this facility and couldn't have been happier. Great facility and staff members. I wouldn't mind staying here when I get older!", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "111015174795016819423", "name": "Misael Hacked my account Santos Hernandez", "time": 1534112174006, "rating": 1.0, "text": "You all need to hire more men because ladies are not strong enough to pick up them people.\nAnd your parking lot is too dangerous. I see why people dont like to visit anyone there because the parking is so difficult you might hit someones car. Hope y'all change how you do things. Thanks", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "116383739753856880524", "name": "Karlito Sway", "time": 1498610935423, "rating": 1.0, "text": "Its depressing as hell to be honest. Why tf would anyone wanna send their loved one to die here?", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "109178797799692328928", "name": "Julianne Hansen", "time": 1551657553656, "rating": 1.0, "text": "Sadly, I visited this facility to see a friend's mother who is recovering from an injury.  She said she hadn't had a bath and that she hadn't been \"changed\" all day.  Yet I saw plenty of staff gathered around the desk chatting and joking.  When I visited the restroom, a cockroach ran across the floor of the stall I was in .  I am appalled at the conditions here and would not want a loved one of mine placed here.", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "112110909459577945586", "name": "Daniel Bonner", "time": 1563843569850, "rating": 1.0, "text": "My medicine is 2 hrs late every morning. The nurses will argue about something as small as weather I had 1 or two drops in my eyes. Very immature and arrogant nursing staff.", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "104199677204067561749", "name": "lrs 0022", "time": 1463336299232, "rating": 5.0, "text": "Love this facility! good and clean environment", "pics": null, "resp": {"time": 1465409514050, "text": "Thank you for visiting our location."}, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "113755979874501631707", "name": "Lakendra Jones", "time": 1442277600865, "rating": 1.0, "text": "The administrator was nice and very professional", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "104559874364757622142", "name": "Sam Cullen", "time": 1531139544395, "rating": 1.0, "text": "Corn dogs for bypass patient and filthy condition. This place needs to be closed", "pics": null, "resp": null, "gmap_id": "0x888c2a0547539fd3:0xc023ecbcce265e8f"}
{"user_id": "108836448100704098347", "name": "Bridney09", "time": 1626181607740, "rating": 1.0, "text": "Please do send your loved ones here. My grandmother had triple bypass surgery at the age of 85 and was sent there for one week to do rehab. And she was told to bath herself, she came home with an infected bed sore. I made several calls to the nurses station to speak with her and was always told they couldn’t take the phone to her and the room she was placed in did not have a working phone. My Uncle called and he was told by nurse they would call the phone company to inspect the phone to see why it was not working. Which was never done. This facility in prisons the elderly. Please avoid by all means.", "pics": null, "resp": {"time": 1626186011429, "text": "Hello,\n\nCapitol Hill Healthcare takes the overall health and wellbeing of our residents very seriously. Your feedback is important to us and we’d like to know more so we may address your concerns. We invite you to contact our administrator at 334-834-2920."}, "gmap_id": "0x888e817322cf4369:0x23f87d54a10263c8"}
{"user_id": "111363487346007908574", "name": "IFeedOnYourSalt 2EAZY", "time": 1622239062699, "rating": 1.0, "text": "Terrible place bad with terrible staff that treat the the elderly badly. The food is extremely poor and the sanitation is badly with roaches near the air conditioning units and the beds.", "pics": null, "resp": {"time": 1622240257505, "text": "Hello, Capitol Hill Healthcare believes in providing dignified, quality healthcare and a safe environment for our residents. It seems you have concerns that we would like to know more about. In order to assist you, please contact our administrator at (334) 834-2920."}, "gmap_id": "0x888e817322cf4369:0x23f87d54a10263c8"}
{"user_id": "106774416013349490077", "name": "helen mize", "time": 1582755589005, "rating": 5.0, "text": "After a stay in the hospital I needed to go to a rehab hospital until I was able to care for myself.  I feel extremely fortunate to have had the opportunity to go to Capital Hill Rehab Hospital.  Everyone from the Administrator to the nurses, physical therapist, kitchen and cleaning crew were very friendly and helpful. The facility was very clean and offers activities and open spaces where you can visit with family or just enjoy.  The ability to have family members join you for a meal was an added bonus in well being.  I have visited friends in other facilities and they do not compare to the quality of care and friendly atmosphere of Capital Hill. I would recommend Capital Hill to anyone needing additional care.", "pics": null, "resp": {"time": 1582817558161, "text": "Helen, thank you for your review. Your feedback is important to helping us continue to provide quality healthcare and a good customer service experience."}, "gmap_id": "0x888e817322cf4369:0x23f87d54a10263c8"}
{"user_id": "111359747101932000827", "name": "Mayra Atchley", "time": 1583364567818, "rating": 5.0, "text": "My father is currently at Capitol Hill and he speaks Spanish. The staff have gone above and beyond to accommodate him with the language and cultural  differences. They are putting ideas together to make him Feel comfortable and are working on providing easy communication via flash cards. They have been attentive, caring and have communicated anything that may help him make the transition. They have provided love and understanding to me. Everybody from management to the CNA’s have been outstanding!  Thank you", "pics": null, "resp": {"time": 1583371102161, "text": "Mayra, thank you so much for your feedback. Hearing from the people we serve and their loved ones helps us continue to grow."}, "gmap_id": "0x888e817322cf4369:0x23f87d54a10263c8"}
{"user_id": "101729070795134404015", "name": "Jimmy Arrington", "time": 1558975442869, "rating": 5.0, "text": "I have been a patient at Capitol Hill twice, my experience there was great. The staff was very welcoming, helpful, courteous and beyond reproach. Therapy services were very helpful and help me to regain my strength. I would recommend Capitol Hill Healthcare of Montgomery to anyone that need rehab services. Lisa Murry- Case Manager will be your extended family during your stay there, and will take care of any of your medical needs. She goes above any beyond to take care of your problems.", "pics": null, "resp": {"time": 1558981776543, "text": "Jimmy, thank you for your review. We appreciate that you have taken the time to tell us about your experience. Your input is vital to our continuous commitment to providing a quality care."}, "gmap_id": "0x888e817322cf4369:0x23f87d54a10263c8"}
{"user_id": "114260508394091300604", "name": "Jessica Kearley", "time": 1584479879417, "rating": 1.0, "text": "Horrible. Inattentive. Slow to respond  Lacking basic nursing skills. I will not take another family member there.\n\nI did contact the Administrator, Michael Burnett in June 2019 right after the death of my family member. I met with him and two other staff administrators. I provided all details and my contact information and they were to look into the case and contact me once they found out what happened. I never heard back.", "pics": null, "resp": {"time": 1584393324198, "text": "Jessica, providing quality healthcare for our residents is important to us. It seems that you may have some concerns that we would like to learn more about. We invite you to contact our administrator at 334- 834-2920."}, "gmap_id": "0x888e817322cf4369:0x23f87d54a10263c8"}
{"user_id": "110395522036378094589", "name": "Heather Davis", "time": 1560551687968, "rating": 5.0, "text": "I recently did my clinicals here and it was by far the best place I've been to. Me and my class toured a few facilities and Capital Hill has been the most organized, cleanest,and friendliest. All the residents look so happy and clean and well taken care of.  As soon as you walk in you feel welcomed by the staff. If anybody is considering a place to put a loved one or looking for work, this is the place to come.", "pics": null, "resp": {"time": 1561044533840, "text": "Thank you for your feedback. Capitol Hill works to provide the best possible experience to our residents, families and visitors. We appreciate your review."}, "gmap_id": "0x888e817322cf4369:0x23f87d54a10263c8"}
{"user_id": "102128086860637143335", "name": "Nancy Nobles", "time": 1583077009044, "rating": 5.0, "text": "The people and the care were top notch. We were very scared at first and everyone put us at easy. We had been in other rehabs and this is the one. THANK YOU!", "pics": null, "resp": {"time": 1583161323525, "text": "Thank you for your review. We appreciate the feedback on your experience with Capitol Hill."}, "gmap_id": "0x888e817322cf4369:0x23f87d54a10263c8"}
{"user_id": "109309023316739504851", "name": "Justin Farris", "time": 1513289865136, "rating": 5.0, "text": "Friendly front desk. PTs were excellent with my grandparents.  They were nice and helpful. They cared about them and made sure they improved.  The facilities were well-kept and  the bedrooms were clean.  They were able to fit in my grandmother for a salon appointment, which made her very happy. Overall, I was very impressed.", "pics": null, "resp": {"time": 1513803368304, "text": "Thank you so much for your feedback.  We always strive to provide the best solutions and care for our residents."}, "gmap_id": "0x888e817322cf4369:0x23f87d54a10263c8"}
{"user_id": "106622706413083177852", "name": "Hevan Lunsford", "time": 1511968632220, "rating": 5.0, "text": "My grandmother is a hospice patient and recently went for respite for a 5 day stay so my husband and I could have some rest.  We were so so nervous and so was she.  They put her in a nice room to herself which was great - she is a introvert.  She loves the food.  I felt very comfortable after a few days since she was so content.  She even told me the day before we were to bring her home she could stay a few more days if we wanted and would be happy to come back! This is saying a lot from a lady who hates leaving her house.  So thankful it was a good experience!", "pics": null, "resp": {"time": 1513803443149, "text": "Thank you so much for your feedback.  We are so happy to help you and your loved ones."}, "gmap_id": "0x888e817322cf4369:0x23f87d54a10263c8"}
{"user_id": "103733282928995175979", "name": "sheafran89", "time": 1564952380050, "rating": 1.0, "text": "As a healthcare professional trusting others with my family is hard and the burned that trust. My father has fallen 3 different times with major injuries and no remorse or ownership from their employees.", "pics": null, "resp": {"time": 1565010242567, "text": "Thank you for your feedback. We are sorry to hear that you and your loved one may have had a negative experience. The health and well-being of our residents is important to us. We would like to know more about your experience and concerns. Please stay in contact with us as we continue to look into this matter. Feel free to contact our administrator at 334-834-2920."}, "gmap_id": "0x888e817322cf4369:0x23f87d54a10263c8"}
{"user_id": "101120102806325307826", "name": "Laurie Davis", "time": 1551834372961, "rating": 1.0, "text": "Wish I could give this place a negative star. If you love the person, DON'T leave them here!!! My dad was here for rehab and had an open wound on his foot and in three days the dressing never got changed!! When I transferred him to a different facility a serious infection had took hold. He almost lost toes over this!! The staff has no care for the people that stay here.   My dad told me they never came when he hit the call button. When I came to see him they were all socializing in the hallway.  My dad was seriously neglected, bordering on abuse.", "pics": null, "resp": {"time": 1551884852585, "text": "Thank you for your feedback. We are sorry to hear that you and your loved one may have had a negative experience. The health and well-being of our residents is our top priority. We are currently investigating your concerns. We invite you to stay in contact with us as we continue to look into this matter. Feel free to contact our administrator at 334-834-2920 if you have any further questions or concerns."}, "gmap_id": "0x888e817322cf4369:0x23f87d54a10263c8"}
{"user_id": "109838350022138679642", "name": "Ashley Austin", "time": 1489605431193, "rating": 1.0, "text": "no star rating (they made me select a star). this place was the worst ever. I would not let my dog go and stay there. the nurses drugged up my mom. she was placed on a different floor and sat in her waste all day. she was wrapped up like a hotdog and wreaking with filth. no way. I moved my mom outta there quickly. I asked them to bathe her and they showed me where the shower was told me to help myself. I don't know how they are passing any inspection. food was great. but the care was lousy!!!!", "pics": null, "resp": {"time": 1505843337198, "text": "Your feedback is appreciated and we have reviewed your concern. We are sorry to hear about your experience and will use this opportunity to review our procedures."}, "gmap_id": "0x888e817322cf4369:0x23f87d54a10263c8"}
{"user_id": "112080115620041682944", "name": "Stephine Luckey", "time": 1503968476962, "rating": 1.0, "text": "This place is pure Hell on Earth! Even the nurses there call it \"Capitol Kill\". Easy to see why. There are 2 nurses in the whole place that are professional enough to give true care. The meals there are inedible, they consistently run out of supplies. Most of the nursing staff & aides are hateful to your loved ones. I've been there when people were just ignored while literally crying in pain(well past the medication times). I've seen people admitted & no one even knew they were there, so they were getting no care at all. The administration there is a nightmare. Bring anything to their attn & they will flat out lie to you about handling the situation. We had one of the nurses there be so awful to our Mom that we reported her. Since then she's been even worse to our Mom & not only that, she's got other care staff to be nasty to her as well. If your loved one needs anything, the care there gets huffy & put out about it, so what they actually give is attitude & rough physical treatment... And for all this lousy treatment, expect to pay near $7000.00/mth for the privilege. The PT team there is their crowning glory. They were absolutely awesome & so helpful & we thank God for them. Past that... DON'T LEAVE ANYONE HERE!!", "pics": null, "resp": {"time": 1505843187358, "text": "Thank you for your feedback. We take the health and well-being of our residents at Capitol Hill Healthcare very serious. We are sorry to hear that you and your loved one may have had a negative experience. We invite you to stay in contact with us as we continue our review. It is important for us to work with our residents and their loved ones to ensure the best possible quality of life. Feel free to contact our administrator at 334-834-2920 if you have any further questions or concerns."}, "gmap_id": "0x888e817322cf4369:0x23f87d54a10263c8"}
{"user_id": "110365711545413494819", "name": "mary1234k", "time": 1472676888540, "rating": 2.0, "text": "My uncle has been living here for a few years now and ever since we have had a theft problem. It started out with someone taking his candy and drinks. Then it went to someone taking his wheelchair charger and now someone is going in his room while he is sleeping going in his bag that lays right next to him and taking his money. And all the directors can say is well we will investigate and call you in 2 days. Like WTH... I  will just be up there with the police and let them look into this situation. How about that Mr. Director", "pics": null, "resp": null, "gmap_id": "0x888e817322cf4369:0x23f87d54a10263c8"}
{"user_id": "116681921316199950904", "name": "Susan Smith", "time": 1592928938388, "rating": 5.0, "text": "Great care of my Aunt!", "pics": null, "resp": {"time": 1593712097573, "text": "Thank you so much for your feedback. It's an honor to be able to serve families like yours in our community and state."}, "gmap_id": "0x888e817322cf4369:0x23f87d54a10263c8"}
{"user_id": "107967108477434004201", "name": "Tiffany Thomas", "time": 1492826928396, "rating": 1.0, "text": "Worked there for seven years wouldn't put my dog in the place and my dog died years ago. I worked with some of the best people you'll ever meet is why I stayed but management and head could care less about the residents or the little people who make the place go around. If I could give zero stars I would. No supplies ever how can you provide care with nothing to do it with! The building is old hot nasty and falling apart not sure how or why its still in business. This place is hell on earth.", "pics": null, "resp": {"time": 1505217347383, "text": "Thank you for your feedback. We are sorry to hear that your experience as an employee was not satisfactory. We realize that our team members are an important part of taking care of our residents and they should be treated with respect. We appreciate your review. We will continue to build the strength and unity of our team and work to maintain the well-being of residents."}, "gmap_id": "0x888e817322cf4369:0x23f87d54a10263c8"}
{"user_id": "106500853990017244761", "name": "Phyllis Nicholson", "time": 1520608971597, "rating": 5.0, "text": "Uncle Thomas is a patient there and has been treated so nice by all.", "pics": null, "resp": {"time": 1524859088798, "text": "Phyllis,\nThank you so much for your review."}, "gmap_id": "0x888e817322cf4369:0x23f87d54a10263c8"}
{"user_id": "109273532621247566191", "name": "Gunnar Chambers", "time": 1491850467704, "rating": 1.0, "text": "Moved our father from a nursing home out of state to Capital Hill because they had a contract with the VA. What a poor decision this was for us to have made. The quality of care is terrible. The care and concern of the floor staff is terrible as well. There were a few nurses that actually cared but most were too busy sitting on their fat behinds at the nurse's station talking and playing on the computer. Anytime you asked for something they acted like it was a huge bother and distraction. Could never get a return call from management, never received any updates to care or changes to medications. Communication was non-existent from staff. Things were regularly stolen out of our father's room, clothing and food gifts would disappear. Would not recommend this facility to anyone that cares about their loved one.", "pics": null, "resp": {"time": 1505843275837, "text": "Thank you for your feedback. Your review is important to continually strengthening the quality of our care and service. We are sorry to hear about your experience and we are reviewing it. We understand that communication about the welfare of loved ones is important and we want to be as helpful as possible. Feel free to contact our administrator at 334-834-2920 if you have any further questions."}, "gmap_id": "0x888e817322cf4369:0x23f87d54a10263c8"}
{"user_id": "106644844032908283052", "name": "Billie D. Evans Jr", "time": 1468180111135, "rating": 4.0, "text": "It's a nice well kept nursing home.", "pics": null, "resp": null, "gmap_id": "0x888e817322cf4369:0x23f87d54a10263c8"}
{"user_id": "109055844475647978105", "name": "Auburn Brown", "time": 1452364365565, "rating": 1.0, "text": "I WOULD NEVER RECOMMEND THIS REHAB NURSING HOME!! THEY DO NOT HAVE THE PATIENT OR FAMILIES BEST INTEREST AT HEART!!! ESPECIALLY RHONDA!!! I WOULD STEER CLEAR OF HER!!! SHE IS NOT A GOOD REPRESENTATION OF THE FACILITY!!", "pics": null, "resp": null, "gmap_id": "0x888e817322cf4369:0x23f87d54a10263c8"}
{"user_id": "113029946649764115732", "name": "Mia Frost", "time": 1527937339197, "rating": 4.0, "text": "Thank you for helping my dad.", "pics": null, "resp": {"time": 1528745615243, "text": "You are most welcome! Thank you for your feedback."}, "gmap_id": "0x888e817322cf4369:0x23f87d54a10263c8"}
{"user_id": "106979149559681703193", "name": "BYRDIE Yeah", "time": 1502039350403, "rating": 1.0, "text": "Staff member brittney was not very compassionate or concerned to meeting the possible needs of my mother and I.", "pics": null, "resp": {"time": 1505843234651, "text": "Thank you for your feedback. Your review is important to continually strengthening the quality of our care and service. We always strive to provide dignified and comforting healthcare. We are sorry to hear about your experience and we are reviewing your concerns. Feel free to contact our administrator at 334-834-2920 if you have any further questions."}, "gmap_id": "0x888e817322cf4369:0x23f87d54a10263c8"}
{"user_id": "118141143239276827698", "name": "Delois Pickney", "time": 1470774468398, "rating": 5.0, "text": "Cool", "pics": null, "resp": null, "gmap_id": "0x888e817322cf4369:0x23f87d54a10263c8"}
{"user_id": "115188021648706631673", "name": "Gail pollard", "time": 1579658119182, "rating": 5.0, "text": "I have been working there almost 4 years. Kim is very good to work for-compassionate, kind , firm, but will always treat you fair. My job makes me feel needed, wanted, appreciated! Love my fellow workers, because Kim hires good people", "pics": null, "resp": {"time": 1579713384335, "text": "Thank you Gail!  We love having you on our team!"}, "gmap_id": "0x888a520bfc719ea5:0x4ea03854aa04db0d"}
{"user_id": "111791023650472946921", "name": "Sharon Chandler", "time": 1579647093523, "rating": 5.0, "text": "Friendly service, friendly office personal, all around great people. Couldn't ask for better.", "pics": null, "resp": {"time": 1579656534897, "text": "Thank you Sharon!"}, "gmap_id": "0x888a520bfc719ea5:0x4ea03854aa04db0d"}
{"user_id": "110069518216777349007", "name": "amber lewis", "time": 1552429722444, "rating": 5.0, "text": "My grandmother was there for rehab. The staff was very attentive and caring. Social services was very helpful with setting up her aftercare needs. We will definitely use them again.", "pics": null, "resp": null, "gmap_id": "0x88626c7007398fdb:0x279d180a3c903274"}
{"user_id": "102414268234017561216", "name": "diane rigsby", "time": 1556243425055, "rating": 5.0, "text": "My mom has been in the dementia unit for 6 months.  We could not be happier with the level of care she receives.  My mom loves the CNAs that care for her daily as well as the nursing staff. From the administrator, social worker, bookeeper to the janitorial staff are all friendly, helpful and responsive.  So keep up the good work.", "pics": null, "resp": null, "gmap_id": "0x88626c7007398fdb:0x279d180a3c903274"}
{"user_id": "107303269118005804434", "name": "peggy nelson", "time": 1513337438226, "rating": 1.0, "text": "I was admitted to Windsor House for a short term stay.Short term it was 3 days . I was put on the skilled nursing wing with bed ridden patient's. Would not move me as i could do for my self showed me NO respect.Wasnt given my meds had to eat in room food was cold .\nNot very clean at all called family and left.Would not recommend to anyone.", "pics": null, "resp": null, "gmap_id": "0x88626c7007398fdb:0x279d180a3c903274"}
{"user_id": "101668302862302691746", "name": "Selma Sanchez", "time": 1514667357521, "rating": 1.0, "text": "I wish I could give thia place negative stars! The smell of this place is something that can not be easily forgotten.My mom was there for 2 and a half days until I could transfer her and it felt like a month!!! I feel so bad for the residents of that place that have to stay there with no hope.The back of my mom' s bed was cover in mold!! Medicaid stop paying for this place! Save some people from this nightmare...", "pics": null, "resp": null, "gmap_id": "0x88626c7007398fdb:0x279d180a3c903274"}
{"user_id": "106636622510866735434", "name": "Denice Stisher-Howell", "time": 1519247677100, "rating": 1.0, "text": "Husband was there temporarily and level of care was not satisfactory.  Personnel are not conscientious and seemed to be confused at times about what they were supposed to be doing.", "pics": null, "resp": null, "gmap_id": "0x88626c7007398fdb:0x279d180a3c903274"}
{"user_id": "100526260093345852066", "name": "Sylvia Salazar", "time": 1569571363966, "rating": 1.0, "text": "This place is horrible it smells bad they don't  watch the patients everytime I go  the nurses are joking around in the hall do not recommended this place", "pics": null, "resp": null, "gmap_id": "0x88626c7007398fdb:0x279d180a3c903274"}
{"user_id": "113248588091359762453", "name": "Annabell Johnson", "time": 1543537111837, "rating": 1.0, "text": "This place needs to be shut down! No care for their paitents at all!!", "pics": null, "resp": null, "gmap_id": "0x88626c7007398fdb:0x279d180a3c903274"}
{"user_id": "111940247820980109128", "name": "Charlotte M. Ellett (Charlaxy)", "time": 1512425040929, "rating": 1.0, "text": "Nurse came in to see patient and yelled, \"What the f--- you want?\"", "pics": null, "resp": null, "gmap_id": "0x88626c7007398fdb:0x279d180a3c903274"}
{"user_id": "103127158279849920946", "name": "donna hughes", "time": 1602000525821, "rating": 5.0, "text": "The staff at The Gardens of Waterford are so helpful and knowledgeable in helping with placement of senior adults. I highly recommend The Gardens of Waterford for anyone seeking placement for their loved one with dementia needing assisted living. It is An open and airy facility. Happy and bright.", "pics": null, "resp": null, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "107526455078030400929", "name": "Felicia Lamar", "time": 1620703580194, "rating": 5.0, "text": "A great place missing everyone", "pics": null, "resp": {"time": 1620740733536, "text": "Thank you for your kind review, Felicia. We appreciate your supportive feedback!"}, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "101637907039780893659", "name": "Elizabeth Haupt-Johnson", "time": 1601299297295, "rating": 5.0, "text": "Staff and residents’ families communicate well with each other which has created trusting relationships and a pleasant home for residents!❤️", "pics": null, "resp": null, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "106146766934541385744", "name": "Monica A.", "time": 1559764868637, "rating": 5.0, "text": "The resident's at The Gardens of Waterford are well taken care of each and every single day. All residents are visually healthy and beautifully groomed. The management team upholds a very professional and responsible duty to each resident and employee. When working at The Gardens of Waterford you must have  purpose. All residents at The Gardens of Waterford have a special Dx: that takes love, patience,  and kindness. Each second, each minute,  and each hour takes time. If you're seeking employment  at The Gardens of Waterford make note you must have #Purpose and you must have patience every single day. I am grateful for my time spent at The Gardens of Waterford.  I've  learned so much about memory care.  My future plans as a Holistic Nurse Practitioner is to work closely with Doctors and Nurse Practitioners around the world that are trying to eradicate #Alzheimer's", "pics": null, "resp": null, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "105412873507415205641", "name": "Robin Rudder", "time": 1574377870080, "rating": 5.0, "text": "Such a wonderful staff who provides a caring environment for our loved one.", "pics": null, "resp": {"time": 1575303715644, "text": "Robin, Thank you for the five star review."}, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "117178716642420612617", "name": "Tina Whitaker", "time": 1574378041516, "rating": 5.0, "text": "Loving community\nClean\nManagement team is very responsive", "pics": null, "resp": {"time": 1575303727760, "text": "Thank you Tina for the 5-star review."}, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "101712454670074570933", "name": "Lori J", "time": 1517777328838, "rating": 1.0, "text": "One year ago this was the best of the best in Montgomery.  Today, it's a disaster.  Management change months ago and Manor House has gone so far down hill that we now, for our family member's safety, have to leave.  The head nurse has no compassion.  The director is unfit to run a community.  She asked us to give her a chance and we did, what choice did we have.  She has no regional support.  The corporate office makes a lot of unfulfilled promises.", "pics": null, "resp": {"time": 1523388728059, "text": "Lori, we take our reviews seriously and would like to discuss this further. Please call our toll-free Human Resources Hotline at 1-855-273-4397 for staff-related issues, or the Resident Relations Hotline at 1-855-881-2576. Thank you."}, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "104904098754123772050", "name": "Tisha Dickson", "time": 1558457115102, "rating": 5.0, "text": "Wonderful place for families to bring their love ones here...", "pics": null, "resp": null, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "107681740401300629704", "name": "Coretha Slayton", "time": 1559832959355, "rating": 5.0, "text": "The Gardens of Waterford wonderful \"at home\" atmosphere let's the residents maintain their independence in a safe, friendly environment!", "pics": null, "resp": null, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "111141508604997910893", "name": "Christina Wyatt", "time": 1498323058330, "rating": 5.0, "text": "Wonderful place! They take great care of their seniors. 😍", "pics": null, "resp": null, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "110977198448655448123", "name": "Diann Smith", "time": 1497020308311, "rating": 1.0, "text": "Poor old people this place is hll on earth.", "pics": null, "resp": null, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "106483366370668904230", "name": "Georgia Patterson", "time": 1529617643218, "rating": 5.0, "text": "Patients bedridden live here", "pics": null, "resp": {"time": 1533311492963, "text": "Georgia, thank you for the five star review!"}, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "105467180204036900480", "name": "Andrea Frachiseur", "time": 1619715425198, "rating": 5.0, "text": "Big Springs is a great facility for short term  patients as well as long term care residents. The staff works hard to care for the residents and patients. The therapy team is top notch and works very hard to assist their short term patients to reach their goals of returning home. Another strength this facility has is assisting families with whether or not their loved one is ready to transition to the next level of care whether that be an assisted living facility, independent living, returning to their prior living arrangement, or if their level of care requires them to transition to long term care. The interdisciplinary team works hard to make sure the patients return to the safest environment with the most independence and best quality of life. The therapy team is also excellent in assisting their long term residents to attain and maintain their highest level of function so the patients remain as independent as possible for as long as possible. New management is now is place and are working hard to provide the very best care for every patient that enters this building.", "pics": null, "resp": null, "gmap_id": "0x88626ca95b11700b:0xc0aaf2d3f2575041"}
{"user_id": "104058539324789998757", "name": "Cynthia May", "time": 1619536790278, "rating": 5.0, "text": "Big springs is a great place to be if you need rehab or long term care. It has an excellent therapy staff. The nursing team is very caring. There are many changes  taking place and it is getting even better. Its a great place to work and live or for a short rehab. The management team is amazing. They are always willing to listen.", "pics": null, "resp": null, "gmap_id": "0x88626ca95b11700b:0xc0aaf2d3f2575041"}
{"user_id": "115324693787107348956", "name": "Shirley Warren", "time": 1619752147153, "rating": 5.0, "text": "The nurses and aides try very hard to keep patients happy and make sure their needs are met. The therapists are top notch! They do an excellent job to get patients where they need to be in order to return home. I am impressed by new administration and the changes that are taking place. It’s evident that they truly care about the patients.", "pics": null, "resp": null, "gmap_id": "0x88626ca95b11700b:0xc0aaf2d3f2575041"}
{"user_id": "101654819815024776275", "name": "Mary Quigley", "time": 1619627924247, "rating": 5.0, "text": "The staff are very caring and attentive to resident needs.  Resident needs are top priority and come first.The Big Springs team has been extremely polite, helpful and make you feel like family.  Staff are treated very well with a solid staff appreciation program.They have great survey history with the state.  I would recommend this facility for your loved ones and a great place to work.", "pics": null, "resp": null, "gmap_id": "0x88626ca95b11700b:0xc0aaf2d3f2575041"}
{"user_id": "110996485660758396239", "name": "Darrell Ducote", "time": 1624664560190, "rating": 1.0, "text": "You can clearly tell workers are doing reviews to bring up the ratings. Lol. Sad. This place is horrible. They get multiple lawsuits per year. Do not send your family here.", "pics": null, "resp": null, "gmap_id": "0x88626ca95b11700b:0xc0aaf2d3f2575041"}
{"user_id": "115198113538642674577", "name": "Megan Ducote", "time": 1614368064886, "rating": 1.0, "text": "Do not put anybody here. I have a family member there recovering from Covid-19. They are perfectly able to use a bed pan with help. Not to mention, my family member is in their 50’s. The staff put my family member in an adult diaper and made them have a bowel movement in the diaper! Humiliated is not even the word! Laziness at its best! Unfortunately this is the only place insurance would pay for or they would not be there! And honestly I have know idea the condition of the building or who even works there, due to covid, I can not enter the building. I do know the outside is terrible. Please find somewhere better for your family meme we if possible.", "pics": null, "resp": null, "gmap_id": "0x88626ca95b11700b:0xc0aaf2d3f2575041"}
{"user_id": "115567513135373006508", "name": "Michele Sledge", "time": 1619710091832, "rating": 5.0, "text": "I have worked here for 2 years. Since the day I walked in I felt I was at home. Thank you  DVCR. it is great working here.", "pics": null, "resp": null, "gmap_id": "0x88626ca95b11700b:0xc0aaf2d3f2575041"}
{"user_id": "101269635363019183215", "name": "Brian Erskine", "time": 1620033390208, "rating": 5.0, "text": "Its a great place to work and a great place to take your loved one staff is warm and friendly.", "pics": null, "resp": null, "gmap_id": "0x88626ca95b11700b:0xc0aaf2d3f2575041"}
{"user_id": "115336956954075752909", "name": "Leann Richardson", "time": 1553806373396, "rating": 5.0, "text": "We currently have a loved one in this facility. And we’ve just had a loved one pass away that was a resident here. We give the facility and staff a 5 star rating. All of the staff are friendly to us, keep us informed of things and seem to genuinely care about our loved one and his well-being.  I can see a big difference in his health (mentally and physically) since he has been in rehab. After the stroke they have worked with him and his speech is better and his mind is better. The nurses and staff are always upbeat, smiling and laughing while we visit. They seem to enjoy their jobs. Cleanliness is a 5 star rating and the hallways are brightly painted and welcoming.", "pics": null, "resp": null, "gmap_id": "0x88626ca95b11700b:0xc0aaf2d3f2575041"}
{"user_id": "117261484045670897857", "name": "Safari Starr", "time": 1600831901651, "rating": 1.0, "text": "If I could give it negative  stars I would administer doesnt care about staff nor employees shes a blonde hair blue eyes devil that doesnt know how to put the care and safety  of staff and residents over the greed of money I wouldn't send my worst enemy here", "pics": null, "resp": null, "gmap_id": "0x88626ca95b11700b:0xc0aaf2d3f2575041"}
{"user_id": "103772039275077319601", "name": "Beth Daly", "time": 1622142970369, "rating": 5.0, "text": "They really care about their residents.", "pics": null, "resp": null, "gmap_id": "0x88626ca95b11700b:0xc0aaf2d3f2575041"}
{"user_id": "105907747580547062306", "name": "Lindsey Sanderson", "time": 1578067133612, "rating": 1.0, "text": "My grandmother fell at her home. She fractured her arm that required surgery. She also fractured her hip that need to heal in rehab. My grandmother was there less than a week. The facility left her unattended in a wheelchair and she fell again. This time she fractured her neck and lost movement in her right arm. The facility took no responsibility of their error in judgement nor showed any remorse. I have to remind the staff about her health needs and cleanliness on a regular basis. Medications were changed with consulting appropriate physicians or family members. Bandages are not changed regularly like required. The staff documents in patient's charts that things are being done when they are not. Management is poor. Some of the staff is unfriendly. Staff act unprofessional in the hallways. They talk loud and giggle in the halls while at work. The staff doesn't communicate with each other or the family members. If you need a rehab or nursing home for your loved one...DO NOT CHOOSE THIS ONE!!!", "pics": null, "resp": null, "gmap_id": "0x88626ca95b11700b:0xc0aaf2d3f2575041"}
{"user_id": "111941769996382232003", "name": "Jessica Cunningham", "time": 1567866405465, "rating": 1.0, "text": "Staff for the most part is helpful. There are a few that could improve their people skills. The building itself is old and showing its age inside the faclity. They are lacking in modern furnishings and need a higher level of cleaning throughout the building. Spider webs in the sunroom windows,  saw a roach in my clients room and the windows,walls and seating look dirty, some of it is the aging of the facility the rest is due to not being cleaned thoroughly.", "pics": null, "resp": null, "gmap_id": "0x88626ca95b11700b:0xc0aaf2d3f2575041"}
{"user_id": "114979702299676733304", "name": "Erin Broom", "time": 1567282377181, "rating": 1.0, "text": "Horrible facility! The building is dated and it looks as though nothing has been updated in years. I wouldn't leave a pet here, much less a family member. My family member has gotten bed sores,  laundry in their room piled up with the room smelling of urine, no one in the front to monitor people coming and going from the facility. If I could leave a review with no stars that is what it would truly be. With what it costs to stay in a nursing home you would expect so much more and certainly not abuse and neglect. For the Huntsville area I would look at other places. I would not ever recommend Diversicare of Big Springs. My family member lasted less than one year in this facility and died here. Horrible care!", "pics": null, "resp": null, "gmap_id": "0x88626ca95b11700b:0xc0aaf2d3f2575041"}
{"user_id": "104300544664018609710", "name": "Katina Rice", "time": 1561944858612, "rating": 1.0, "text": "I have a love one there and feel horrible the way how she is being treated with lack of respect with her appearance.  The quality of care with the CNA that works there are terrible! Please do your research and ensure you choose widely.", "pics": null, "resp": null, "gmap_id": "0x88626ca95b11700b:0xc0aaf2d3f2575041"}
{"user_id": "112958408711791720178", "name": "It’s simply Kg", "time": 1520022914842, "rating": 5.0, "text": "Diversicare of Big Springs is an excellent Skilled Nursing Facility that provides high quality healthcare.  They are currently a 4 star facility and it shows.  Stacey and Debbie are very helpful and can answer any questions you may have regarding caring for your loved one.", "pics": null, "resp": null, "gmap_id": "0x88626ca95b11700b:0xc0aaf2d3f2575041"}
{"user_id": "112497447813199813183", "name": "Elite Remodeling, LLC.", "time": 1560044851036, "rating": 1.0, "text": "Diversicare of Big Springs is not the place for your loved ones to spend their recovery time or life period!!!! My father was admitted into the hospital and was eventually transferred to long term care. December 2018 to June 4th 2019 he resided there. In April my father had a surgery and required his bandages to be changed frequently to minimize his risk of infection...THAT DID NOT HAPPEN....THE TECHNICIANS COMPLETELY DROPPED THE BALL IN MY DAD'S CASE.... THEY WOULD IGNORE HIS REQUEST TO THE POINT HE HAD TO GET OUT OF HIS BED, ROLL DOWN THE HALLWAY TO DEMAND SOME TO CHANGE THEM. AS A RESULT OF THEIR NEGLECT, MY DAD NOW HAS A LIFE THREATENING INFECTION (MSRA WHICH IS NOW BEING UPGRADED TO SEPSIS AS I TYPE THIS REVIEW), ACCORDING TO THE DOCTOR, HE IS IN CRITICAL CONDITION, AND WILL BE IN THE HOSPITAL FOR AWHILE AS THEY FIGHT TO KILL THE INFECTION AND KEEP HIM ALIVE. DO NOT ALLOW YOUR LOVED ONES TO LIVE HERE! I AM PURSUING LEGAL LITIGATION AGAINST THIS PLACE. PLEASE DO NOT LET YOUR LOVED ONES LIVE HERE!!!! PRAY FOR MY FATHER PLEASE!!!", "pics": null, "resp": null, "gmap_id": "0x88626ca95b11700b:0xc0aaf2d3f2575041"}
{"user_id": "110412604831484979302", "name": "Robyn Parham", "time": 1520342795095, "rating": 5.0, "text": "Congratulations to Team Big Springs on showing your dedication and hard work on a daily basis. Due to your excellence in upholding our Service Standars, we are now a Four Star facility.....Well earned and well deserved!!!!!!! Keep up the fantastic work!!!!!", "pics": null, "resp": null, "gmap_id": "0x88626ca95b11700b:0xc0aaf2d3f2575041"}
{"user_id": "116253907472969270217", "name": "ERICA GULLEY", "time": 1558146760870, "rating": 1.0, "text": "This place is horrible!!! My grandmother gas been there for a little over a year and has been in and out of the hospital mainly because they are irresponsible!!! My mom visited a couple of weeks ago and alerted the nurses to the fact that my grandmother was unresponsive and seemed I'll. Nothing was done. She is now going on a week in the hospital due to a kidney stone that has apparently been there for MONTHS and pneumonia.  PLEASE DO NOT SEND YOUR LOVED ONES HERE!!!", "pics": null, "resp": null, "gmap_id": "0x88626ca95b11700b:0xc0aaf2d3f2575041"}
{"user_id": "116783742218122842587", "name": "Mag Prime", "time": 1549481895751, "rating": 1.0, "text": "Some of these 5 star reviews are faked so here's a random 1 star to balance it back to where it should be.", "pics": null, "resp": null, "gmap_id": "0x88626ca95b11700b:0xc0aaf2d3f2575041"}
{"user_id": "117841893247468700863", "name": "Levi Grimes", "time": 1553545410330, "rating": 5.0, "text": "The have the best staff ever the have the most helpful", "pics": null, "resp": null, "gmap_id": "0x88626ca95b11700b:0xc0aaf2d3f2575041"}
{"user_id": "115394279623522267994", "name": "Brianna Jones", "time": 1518886360851, "rating": 1.0, "text": "Do not send your family here. My grandmother has been there for a few months and she has been in and out of the hospital because they aren't taking the proper precautions. They know she is a fall risk and yet, they don't seem to care. They have the right technology to prevent accidents from happening, but most of the nurses there are so ignorant that they won't use it.", "pics": null, "resp": null, "gmap_id": "0x88626ca95b11700b:0xc0aaf2d3f2575041"}
{"user_id": "112191888640869318135", "name": "John Franks", "time": 1553821173033, "rating": 1.0, "text": "This place is the worst, con artist what they are, they tell you to sign something and you have no idea what it is until it's to late.", "pics": null, "resp": null, "gmap_id": "0x88626ca95b11700b:0xc0aaf2d3f2575041"}
{"user_id": "108061207326797234622", "name": "Helen Gillespie", "time": 1559760373589, "rating": 5.0, "text": "Very caring staff!", "pics": null, "resp": null, "gmap_id": "0x88626ca95b11700b:0xc0aaf2d3f2575041"}
{"user_id": "104862133677212590781", "name": "Bobbi Tennyson", "time": 1407218486314, "rating": 4.0, "text": "The staff is really the best part", "pics": null, "resp": null, "gmap_id": "0x88626ca95b11700b:0xc0aaf2d3f2575041"}
{"user_id": "111512322191496512141", "name": "Tacion Boco", "time": 1621659452424, "rating": 1.0, "text": "DONT COME HEREEE !!\n\nIf I could leave 0 stars I would. This place was terrible. My grandmother was sent here after having surgery and she ended up with so many bed sores that she’s now recovering from. This place set her back so far recovery wise. She almost died in here but luckily someone was observant enough to realize she was almost dead and called 911. She was transferred to ICU and we weren’t called. Her hair was matted to her head. There was blood in her catheter. A majority of the fluid in it was blood. The “head nurse” / supervisor of that wing was oblivious to anything and everything and showed no compassion when we expressed our concerns. All she had to say was “I didn’t see that” when it came to answering or “how did this / that happen” . They wouldn’t let us come in ever and visit . Even after the Mask mandate was lifted which is why we couldn’t see the extent of the poor care. The goofy looking individual “ in charge” with the bow tie was also ZERO help. Showed zero interest in our concern. When writing down my complaints he was literally pretending to write stuff down . Two ppl quit during the conversation me and him had while I was standing in the lobby. Do not I REPEAT DO NOT SEND NOBODY HERE UNLESS YOU WANT TO BURY THEM", "pics": null, "resp": null, "gmap_id": "0x888925cfabc045d3:0xa358945ddbc0034"}
{"user_id": "117322951133694662334", "name": "Shazell Cline", "time": 1615153276259, "rating": 5.0, "text": "One of the best clinics in the area. Employees help a lot and strive to make a difference in the lives of patients. They make you feel like family.", "pics": null, "resp": null, "gmap_id": "0x888925cfabc045d3:0xa358945ddbc0034"}
{"user_id": "109387054692488991510", "name": "Fuck Trump", "time": 1604765138498, "rating": 1.0, "text": "PAYROLL: YOU DO NOT GET PAID ON TIME! The whole facility is UNORGANIZED. The staff is OK.  Far as sending a love one there to stay short or long term.  Is a HELL NO!!!  The stay complaining about the food.  It's just a lot! Red flags everywhere.  The only time they want to do everything by the book is when state comes.  Sad!", "pics": null, "resp": null, "gmap_id": "0x888925cfabc045d3:0xa358945ddbc0034"}
{"user_id": "110712500957423666538", "name": "Diana Bohanon", "time": 1615156737371, "rating": 5.0, "text": "Just took my great aunt to Shelby Ridge, I hated to have to leave her but the staff made me feel like i was doing the best thing for her.", "pics": null, "resp": null, "gmap_id": "0x888925cfabc045d3:0xa358945ddbc0034"}
{"user_id": "114068564842048465373", "name": "Paul Atwater", "time": 1602827533722, "rating": 5.0, "text": "You guys were great as long as I was there. Nine weeks of rehabbing and everyone was on top of everything. I  reccomend shelby ridge to anyone who spends time there.", "pics": null, "resp": null, "gmap_id": "0x888925cfabc045d3:0xa358945ddbc0034"}
{"user_id": "114804563259488360060", "name": "Cory McDaniel", "time": 1601930124472, "rating": 5.0, "text": "Very Friendly Atmosphere. Has a “Homey” feel to it!", "pics": null, "resp": null, "gmap_id": "0x888925cfabc045d3:0xa358945ddbc0034"}
{"user_id": "112553827762051146124", "name": "Jasmine Broadnax", "time": 1601494488466, "rating": 5.0, "text": "Nice facility to place family member for short term or long term care.", "pics": null, "resp": null, "gmap_id": "0x888925cfabc045d3:0xa358945ddbc0034"}
{"user_id": "106277430765160637755", "name": "Tristan Rose", "time": 1581827447981, "rating": 1.0, "text": "This is the most worst place I have ever been to the people and staff here do not help each other out much less care about the people that are there needing help after surgery! I know two different incidences for people that was there after surgery come out fine and then had some complications and let the nurses know and the nurses brushed it off as no big deal! NOW their dead thanks to Shelby Ridge Nursing Home!! I would not recommend any friends family members or not even an enemy to go to that place.", "pics": null, "resp": null, "gmap_id": "0x888925cfabc045d3:0xa358945ddbc0034"}
{"user_id": "104594949011519443628", "name": "Melinda Nydegger", "time": 1562679359078, "rating": 1.0, "text": "DO NOT recommend this facility at all! Horrible experience here. Had to call the local ombudsman multiple times to get anything done. When we tried to get our loved one out of this facility and transferred, they made it as difficult as possible. We ended up having to pay for a ambulance out of pocket just to get out! It is a shame and disgrace to treat our elderly that way. I've worked at many SNF and have never seen anything like this. Please don't take your loved one here.", "pics": null, "resp": null, "gmap_id": "0x888925cfabc045d3:0xa358945ddbc0034"}
{"user_id": "112745678270399080938", "name": "Shannon Cook", "time": 1520366048349, "rating": 5.0, "text": "Cannot say enough great things about the caregivers at this facility. They treat their patients and families like their own family. I would recommend anyone looking for short term rehab or long term care to visit Shelby Ridge!", "pics": null, "resp": null, "gmap_id": "0x888925cfabc045d3:0xa358945ddbc0034"}
{"user_id": "101128107495414513035", "name": "Dawn Ledgez", "time": 1579460781309, "rating": 1.0, "text": "Do not send your family members here. If they are not able to care for themselves, know that they will not be checked in attentively and at least every 2 hours as they should be, as state requires. This facility only does what it is supposed to when state comes to the building. Once state is gone, it’s back to CNAs hiding in rooms, nurses being very rude to the residents, CNAs and resident families.", "pics": null, "resp": {"time": 1579537353309, "text": "We would love to discuss your concerns that you have expressed at your convenience. You may contact the Administrator Roderick Watkins at 205-620-8500. We look forward to hearing from you soon. Thank you"}, "gmap_id": "0x888925cfabc045d3:0xa358945ddbc0034"}
{"user_id": "113307498140436910253", "name": "April Tucker", "time": 1541508454354, "rating": 1.0, "text": "The people that work here do not have a clue how to drive! They are constantly flying down the road. This is our neighborhood and there are children they could hit. One lady actually did cause a wreck with my neighbor. They try to fly around me while I’m pulling into my driveway. Multiple people have complained to management and were told that this would be stopped. Nothing has happened and they all continue to drive like crazy people down our road. One day they will seriously hurt someone. They cause so many problems every day and I’m sick of it!", "pics": null, "resp": null, "gmap_id": "0x888925cfabc045d3:0xa358945ddbc0034"}
{"user_id": "103077474330654359424", "name": "Margaret Mosley", "time": 1565182938427, "rating": 1.0, "text": "Horrible place...they feed you a bunch of lies about therapy. .did not give my son a bath for over a week and a half ...you literally hafta to stay on top of them. Horrible food ..expected son to eat ground up slop and feed himself .when he couldn't move his arms ...would die before going here or sending anyone here .staff very lazy. Please do not send loved ones here", "pics": null, "resp": null, "gmap_id": "0x888925cfabc045d3:0xa358945ddbc0034"}
{"user_id": "117893352834671230327", "name": "N Williams", "time": 1521023199061, "rating": 1.0, "text": "My brother was admitted to this hell hole against the family's will after leaving the Spain Spine Center at UAB. My brother was alert and in good spirits when he arrived there after spending 6 weeks at Spain; looked forward to getting back to work. He was dead within two weeks. Not a smoker or drinker nor did illegal drugs. No major medical conditions other than the surgery to his C spine for a fall; he was 48 years of age, and worked for the Federal Government. We are waiting the results of the autopsy. If you love your family member, do not send them to this facility. They are the worst!", "pics": null, "resp": null, "gmap_id": "0x888925cfabc045d3:0xa358945ddbc0034"}
{"user_id": "111782037933701859373", "name": "Susie Kelley", "time": 1474314441823, "rating": 5.0, "text": "EXCELLENT CARE!! My father had knee replacement surgery and did rehab at Shelby Ridge. His recovery time was remarkable and the staff were so thoughtful and caring.", "pics": null, "resp": null, "gmap_id": "0x888925cfabc045d3:0xa358945ddbc0034"}
{"user_id": "105978195003890827914", "name": "Jim Galetsis", "time": 1535505248353, "rating": 2.0, "text": "Honestly I would give this place 3 stars except the Personal Care Assistants on 2nd shift were very unattentive all the time. The nurses on 2nd shift were constantly sitting at the nurses station giggles and joking around. Call lights were ignored at times when people needed help. I was made to sit in messy pants after an accident on 2 seperate occassions for over 3 hours due to a lack of a sense of urgency.\n\nIf it weren't for a chosen few (names withheld) I would've given this place 1 star.", "pics": null, "resp": null, "gmap_id": "0x888925cfabc045d3:0xa358945ddbc0034"}
{"user_id": "106588178507658509982", "name": "Ashleigh Finn", "time": 1460529773891, "rating": 5.0, "text": "Quality Care, friendly staff & excellent therapy. Driven to get patients out quickly  and safely back home!", "pics": null, "resp": null, "gmap_id": "0x888925cfabc045d3:0xa358945ddbc0034"}
{"user_id": "107596894990627189551", "name": "Nicole Smith", "time": 1491851671996, "rating": 1.0, "text": "If I could I would give them a -5 stars, they almost let my father slip into a diabetic coma because they are horrible at patient care. I would never send my worst enemy to this facility!!", "pics": null, "resp": null, "gmap_id": "0x888925cfabc045d3:0xa358945ddbc0034"}
{"user_id": "115618516030433377997", "name": "Ellen Scalise", "time": 1492202449982, "rating": 1.0, "text": "I was in there after 5 weeks in the hospital, and this the worst excuse for a rehab facility. It's primarily a nursing home with therapy. I arrived on Tuesday afternoon and therapy didn't start until Thursday. I requested transfer to another facility Thursday morning and the discharge person pussyfoot around for 4 hours before faxing my info to the next facility. The food is very unhealthy, a bunch of nasty fried foods. And as another person wrote, the Nighshift is horrible. My roommate would call out for someone because she couldn't see to use the call button and they would never reply. They definitely do not deserve the ONE star I gave, but you have to select one to write a review!", "pics": null, "resp": null, "gmap_id": "0x888925cfabc045d3:0xa358945ddbc0034"}
{"user_id": "111684959392351391190", "name": "Justin Moorer", "time": 1489218653559, "rating": 5.0, "text": "My mother has been in this facility since December 2016 and the staff has been awesome and wonderful.", "pics": null, "resp": null, "gmap_id": "0x888925cfabc045d3:0xa358945ddbc0034"}
{"user_id": "117512240207781650118", "name": "cyhn santos", "time": 1547595330942, "rating": 1.0, "text": "Terrible facilty. The nurses and CNAs don't take care of patients well. Don't send your family there.", "pics": null, "resp": null, "gmap_id": "0x888925cfabc045d3:0xa358945ddbc0034"}
{"user_id": "117675592409946593202", "name": "SAL ROSSI", "time": 1503335406917, "rating": 5.0, "text": "I was there for 5 weeks.The therapy was able to take me from not being able to stand on my own to walking 90 feet with a walker.They taught me to care for myself and shape up my upper body.Lesley and Stephaney were the beautiful people I worked with.I think of them as family.They gave me another chance.\nThe nurses and CA's were great and made every effort to do a very difficult job.They do a lot of work with much undo criticism. I am very pleased with many people there Katina,Massamino,Shirley,Veronica,and many more.Thanks all,Sal Rossi", "pics": null, "resp": null, "gmap_id": "0x888925cfabc045d3:0xa358945ddbc0034"}
{"user_id": "103208029155152006418", "name": "Cole Martin", "time": 1456961928150, "rating": 1.0, "text": "My grandfather was admitted and his experience was PATHETIC! He said the night shift did not care about the patients. He described to me that he had to search for cups to pee in because the night shift would not bring him a urinal when he called several times. He ended up peeing himself and he pressed his button multiple times and they would tell him that they would be in there at 7 then 8 then 9. He said he starved at night and the night shift was more worried about there own social lives than the patients they are supposed to be taking care of. Very disappointed.", "pics": null, "resp": null, "gmap_id": "0x888925cfabc045d3:0xa358945ddbc0034"}
{"user_id": "102013564194278314532", "name": "Sandy Byrd", "time": 1550511708880, "rating": 3.0, "text": "You have to constantly stay on top of things especially hygiene and attitudes of some employees", "pics": null, "resp": null, "gmap_id": "0x888925cfabc045d3:0xa358945ddbc0034"}
{"user_id": "100859105421823632982", "name": "Hillary Myers", "time": 1603156929885, "rating": 5.0, "text": "Very clean place", "pics": null, "resp": null, "gmap_id": "0x888925cfabc045d3:0xa358945ddbc0034"}
{"user_id": "109257464360932823774", "name": "Lashawn Williams", "time": 1494603373544, "rating": 1.0, "text": "Staff (CNA) very rude not friendly at all i wouldn't send my pet there....", "pics": null, "resp": null, "gmap_id": "0x888925cfabc045d3:0xa358945ddbc0034"}
{"user_id": "105872093947566453517", "name": "Samar Misra", "time": 1600565543374, "rating": 3.0, "text": "Recently, as I was on a shift this past week with a nice gentleman at this facility, I was kind of shocked to see some staff near a kitchen area or in common area not masked up in addition to seeing residents dining together and being engaged in group activities unlike many other facilities especially during the pandemic now.  Despite being spoken to well and professionally by all staff, I figure would be good if precaution was taken where each resident would eat a meal in his or her room, group activities to be put on hold and all of the facility get covid tested regularly even if asymptomatic for best safety and comfort for all.  Wishing for the best while wanted to leave feedback.  Thanks!", "pics": null, "resp": {"time": 1600784012950, "text": "Hello Samar, thank you for sharing your feedback. We take all of our reviews seriously and we would like to discuss your experience further. Please reach out to us  at (256) 617-7285 with any further comments, concerns, or suggestions. We would love the opportunity to make things right, if given the chance!"}, "gmap_id": "0x8862133089f51d01:0xa027407830068246"}
{"user_id": "112878365819931056928", "name": "Susan Fox", "time": 1537138093581, "rating": 5.0, "text": "My mother loves this facility. The nurses and staff members are so very kind and caring. The food is great and the activities are fun, interesting and educational. She has had several personal health issues during her 15 month residency. Each and every time the nurses were quick to get her the help and care she needed. The residents are friendly and pleasant.  As I said, my mother has thoroughly enjoys this facility and calls it “home”.", "pics": null, "resp": {"time": 1547671034672, "text": "Thank you so much for sharing your family’s experience at HarborChase, Susan. We are very happy that you and your loved ones chose our community for your mother. We sincerely appreciate the great compliments on our delicious food, fun Life Enrichment program, and dedicated associates and staff members. As a community, we work hard to create an environment where we could envision ourselves living one day. We’re glad your mother loves her home! Thanks again for taking the time to review us. We look forward to serving your family for years to come!"}, "gmap_id": "0x8862133089f51d01:0xa027407830068246"}
{"user_id": "116062306691344656279", "name": "Nancy Bates", "time": 1507728031339, "rating": 5.0, "text": "My family LOVES HarborChase! My mother has been a resident for 6 years, begining with a recovevry stay from a fall. She says it's the BEST decision she has ever made! She loves the personnel, the people give compassionate care, the comfort of having her own apartment, the dining room serves wonderful meals, and there is a wide variety of activities to keep her busy. Not only has HarborChase given her the opportunity to remain self-suffcient, but it has also given her more confidence in living alone. She's always been an independent woman and her spirit has soared since living there. I believe she has also given HarborChase new life as well. One can tell they adore her, too. She brings a smile to everyone's face whenever she walks into a room!  TY, HC", "pics": null, "resp": {"time": 1508413978528, "text": "Thank you very much, Nancy, for your wonderful recommendation and five-star review! We’re very happy that you and your family decided to choose HarborChase for your mother six years ago! She has become an important and much-loved and adored member of our community! We sincerely appreciate the kind words about our delicious dining services, comfortable apartments and wealth of activities available daily through our Life Enrichment program. We especially love the wonderful compliments for our kind and compassionate associates. Every day, they are focused on providing the very best in senior living. We’re thrilled that your mother has been able to hold onto her independent spirit at HarborChase! Again, we thank you for taking the time to post your amazing review. We look forward to serving you and your family for years to come!"}, "gmap_id": "0x8862133089f51d01:0xa027407830068246"}
{"user_id": "112161436520484364495", "name": "David Kahalley", "time": 1602451786961, "rating": 4.0, "text": "My mom was in another nursing facility that was destroyed in Hurricane Sally.  Lynwood took in all of their residents and in this crisis mode handled the transition very well.  The staff and director were directly involved and helpful.  We moved my mom two weeks later when we found a replacement facility and they assisted in helping us get her and her belongings together so we could move her.  Thanks to Lynwood and their staff and director for stepping up to the plate in our time of need.", "pics": null, "resp": null, "gmap_id": "0x889a4c8d9f93af43:0xc6b721ee0118744"}
{"user_id": "116430877775301797413", "name": "Eboni and Rodney Jones", "time": 1589722598183, "rating": 1.0, "text": "This place is horrible. My aunt was here for 3 months and only had 1 bath. She started to develop a sore under her breast. They also did not pay attention to her required diet restrictions. She was not able to eat pork and they brought her Ham Mac n cheese which caused her blood pressure to go up. I hope they shut this place down", "pics": null, "resp": null, "gmap_id": "0x889a4c8d9f93af43:0xc6b721ee0118744"}
{"user_id": "105170510541958175275", "name": "Deborah Cooper", "time": 1570307955070, "rating": 1.0, "text": "My Mother had been a patient there for five years. They are horrible. The latest administor Elizabeth her assistant Allison have managed to ruin off the majority of the good workers and kept those who are verbally and physically detrimental to the elderly. They  cannot be bothered with ensuring that proper maintenance is conducted, such as cleaning out the air conditioning vents or repairing broken doors. They simply don't care. Most recently I was unable to visit my Mom for over 10 days do to a out of town work assignment. I came back to find my Mother weezing and fighting for a breath. Her oxygen had been turned off at doomed point and she had pneumonia. Course I'd the nurses in charge of get care had stopped to speak to her they would have known immediately. To my knowledge there is only two good nurses left, Carolina and Michael. If you are thinking about placing your family member there, than don't. They may not survive their horrible care.", "pics": null, "resp": null, "gmap_id": "0x889a4c8d9f93af43:0xc6b721ee0118744"}
{"user_id": "111221871695732345686", "name": "Tara Kamassai", "time": 1552489082372, "rating": 1.0, "text": "Lynwood needs strong, trained, caring, ethical leaders in all areas.   Nursing care is “safe” on some wards ONLY.   Business office and administrative staff are completely untrained.  I would recommend finding a better option for your family.", "pics": null, "resp": null, "gmap_id": "0x889a4c8d9f93af43:0xc6b721ee0118744"}
{"user_id": "109230470787856335654", "name": "Delora Pate", "time": 1572716881967, "rating": 5.0, "text": "I had to place my sister at Lynwood in memory care.  The staff is very passionate and courteous.   I am very pleased with Lynwood.", "pics": null, "resp": null, "gmap_id": "0x889a4c8d9f93af43:0xc6b721ee0118744"}
{"user_id": "108446201548782050529", "name": "James Dewberry", "time": 1553870214990, "rating": 1.0, "text": "A simply pathetic place! The nurses have zero clue about patient care. They spend more time on Facebook then caring for patients. The staff is over worked and not paid properly. If someone sends you there run away as fast as you can!", "pics": null, "resp": null, "gmap_id": "0x889a4c8d9f93af43:0xc6b721ee0118744"}
{"user_id": "100803826905947046177", "name": "L S", "time": 1511926752485, "rating": 1.0, "text": "When my father was being discharged from Mobile Infirmary, I was given the task to find a suitable rehab/care facility.  I looked at 3, and choose Lynwood due to the location, and what appeared to be, a nice place.  My father was an invalid, who had a hard time feeding himself.  He also had a PEG tube, for feeding him when he wasn't getting the required nutrients/calories.  When he left there for another facility, during the assessment phase, I found out he had lost over 20 lbs in the 6 weeks he was there.  I lost my father 2 weeks after his transfer from Lynwood.  If my dad did not have the PEG tube, I could understand him losing that amount of weight. I do believe, that fast loss of weight, contributed to my fathers demise.  I also began to wonder, did the staff always seem to care so much, when visitors were there, or was it continual.  I do not recommend anyone take their loved one to a facility, where they aren't capable of providing a diet, that maintains their patients weight.", "pics": null, "resp": null, "gmap_id": "0x889a4c8d9f93af43:0xc6b721ee0118744"}
{"user_id": "105033691064467656389", "name": "Linda Ploplys", "time": 1506777822411, "rating": 1.0, "text": "My father was in 82w at this horrific place that I call an insane asylum. Please don't let your loved one go here if you can help it. The head nurses are the rudest, cold hearted people I've ever met. They have no soul left or heart. They let the patient's sit in dirty diapers, show them 0 kindness. My dad finally got in William F Green and they are awesome. I would rather my dad had been in Metro than this place. I'm filing a formal complaint. They need to be shut down. My dad lost 23 pounds in the 2 1/2 months he was there. HORRIBLE HORRIBLE PLACE!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4c8d9f93af43:0xc6b721ee0118744"}
{"user_id": "113816981748780689986", "name": "Jessica Evans", "time": 1609910910510, "rating": 1.0, "text": "If you actually care about your family member, please go elsewhere.", "pics": null, "resp": null, "gmap_id": "0x889a4c8d9f93af43:0xc6b721ee0118744"}
{"user_id": "106988478550488119694", "name": "Brandon Stallworth", "time": 1546558858955, "rating": 1.0, "text": "My father was there for a couple months. While there he missed 5 doctors appointments.  Lynwood sent him to the hospital because his leg was infected. While he was in the hospital the staff \"lost\" all his belongings. So now my father has to replace all his clothes as well as worry about his health. Do not send anyone you love up there.", "pics": null, "resp": null, "gmap_id": "0x889a4c8d9f93af43:0xc6b721ee0118744"}
{"user_id": "109957079081119938254", "name": "The Legion", "time": 1552512865827, "rating": 1.0, "text": "If you have any love for your family member do not, I repeat DO NOT, let your loved one be sent here! We made the mistake of allowing the hospital to send our loved one here. Nurses and staff here are rude, make false promises, talk rudely to the residents, and are all around, untrained, unexperienced and most definitely,  UNPROFESSIONAL procrastinators!!! The service is about equal to using a public port-a-potty, covered in a alcoholic's puke at Fat Tuesday, during Mardi Gras.", "pics": null, "resp": null, "gmap_id": "0x889a4c8d9f93af43:0xc6b721ee0118744"}
{"user_id": "117464104387729320157", "name": "Sawyer Guarisco", "time": 1575233768266, "rating": 5.0, "text": "It’s great. good service", "pics": null, "resp": null, "gmap_id": "0x889a4c8d9f93af43:0xc6b721ee0118744"}
{"user_id": "102858633763854566188", "name": "Cyndi Moore", "time": 1487606216422, "rating": 4.0, "text": "Our mother was in the memory care unit, and everything from the beach murals on the walls, the layout of the unit including access to an outside area with gardens, to the staff was cheerful and resident focused.  The billing department is almost impossible to deal with, and the only reason they did not get 5 stars.", "pics": null, "resp": null, "gmap_id": "0x889a4c8d9f93af43:0xc6b721ee0118744"}
{"user_id": "117376982330777362229", "name": "Ronkee Jenkins", "time": 1487354717557, "rating": 5.0, "text": "Jenkins ronkeej88 Jenkins ronkeej88 Jenkins ronkeej88 Jenkins ronkeej88 Jenkins ronkeej88 Jenkins ronkeej88 Jenkins ronkeej88 Jenkins ronkeej88 Jenkins ronkeej88 Jenkins Jenkins ronkeej88 Jenkins ronkeej88 Jenkins ronkeej88 Jenkins ronkeej88 Jenkins ronkeej88 Jenkins ronkeej88", "pics": null, "resp": null, "gmap_id": "0x889a4c8d9f93af43:0xc6b721ee0118744"}
{"user_id": "116611177032156446689", "name": "Debra Fluker", "time": 1479793092770, "rating": 1.0, "text": "Currently trying to recoup from auto accident. Receiving abusive care (or lack of) fro some employees. Reported incidents have been ignore. Confontations with both employees and their supervisors. Money stolen from my purse, and check sent through mail was deposited into without my knowledge or permission. If I had another place to go I wluld be out soon. Oh they get my disability check as well as my Medicare and Medicaid funds. Cant get help with personal things from some workers. They have been reported but they are still here.", "pics": null, "resp": null, "gmap_id": "0x889a4c8d9f93af43:0xc6b721ee0118744"}
{"user_id": "116275506206464490281", "name": "Anthony Summerlin", "time": 1518293638968, "rating": 2.0, "text": "One of the most dusty and uncaring facility I've ever worked.the ice machines has mole when it works.the wheelchairs are never cleaned.understaff always.and the meal choices are terrible.would not recommend to anyone's family.", "pics": null, "resp": null, "gmap_id": "0x889a4c8d9f93af43:0xc6b721ee0118744"}
{"user_id": "113103965167684891227", "name": "Rayquelle Ruggs", "time": 1580923091394, "rating": 5.0, "text": "Very nice people", "pics": null, "resp": null, "gmap_id": "0x889a4c8d9f93af43:0xc6b721ee0118744"}
{"user_id": "117297522540921549061", "name": "Adrienne Pugh", "time": 1547131297202, "rating": 1.0, "text": "Not the best place to send your family or work", "pics": null, "resp": null, "gmap_id": "0x889a4c8d9f93af43:0xc6b721ee0118744"}
{"user_id": "112543766218631749402", "name": "Ronkee Jenkins", "time": 1505903076142, "rating": 5.0, "text": "(Translated by Google) Ronkeejenkins\n\n(Original)\nRonkeejenkins", "pics": null, "resp": null, "gmap_id": "0x889a4c8d9f93af43:0xc6b721ee0118744"}
{"user_id": "113683210217508623340", "name": "Ronkeejenkins ronkeejenkins Jenkins", "time": 1443063204145, "rating": 1.0, "text": "(Translated by Google) Ronkeejenkins\n\n(Original)\nRonkeejenkins", "pics": null, "resp": null, "gmap_id": "0x889a4c8d9f93af43:0xc6b721ee0118744"}
{"user_id": "109239813813427475805", "name": "Tommie & Marry Carlisle", "time": 1580279222745, "rating": 5.0, "text": "Excellent service and care was given to our love one. You all exemplified the \"We Care\" attitude and we will never forget how much attention to details and care you gave. May God continue to strengthen your health care facility as you care for those in need......!!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4e2ad7707743:0x32d1125e5ddc28d7"}
{"user_id": "111212349684548722863", "name": "Jawon Riley", "time": 1552897716403, "rating": 5.0, "text": "Everyone was very nice treated my mom with remarkable care. Best people!!!", "pics": null, "resp": null, "gmap_id": "0x889a4e2ad7707743:0x32d1125e5ddc28d7"}
{"user_id": "106465328099080229755", "name": "Jaime Mccullough", "time": 1578659083600, "rating": 1.0, "text": "I do not recommend this facility to anyone!!!The facility smells like urine, they did have the proper supplies needed for my mom, I complained numerous of times and nothing changed, and they would half clean her and her room", "pics": null, "resp": null, "gmap_id": "0x889a4e2ad7707743:0x32d1125e5ddc28d7"}
{"user_id": "111651326100891658982", "name": "Tracy King", "time": 1500342892751, "rating": 1.0, "text": "Has to be the nastiest nursing home ive ever been in. Halls smell like urine and residents complain about not being clean. I would absolutely NOT recommend putting my family member in that place! Company wont spend money on the resident rooms and its easily noticeable by just walking down the halls. Theres a reason why their rating is so low! If you loved your family, take them somewhere else! It also depends on what color you are if you want a job there. Trust me you dont want a job with them either.", "pics": null, "resp": null, "gmap_id": "0x889a4e2ad7707743:0x32d1125e5ddc28d7"}
{"user_id": "107817560231710666934", "name": "antonio Richardson", "time": 1549210467345, "rating": 4.0, "text": "Very clean and  great service", "pics": null, "resp": {"time": 1550609860276, "text": "Thank you so much for your sweet comment!  We strive to make everyone feel at home!"}, "gmap_id": "0x889a4e2ad7707743:0x32d1125e5ddc28d7"}
{"user_id": "117046889125056483597", "name": "April Mizell", "time": 1568298912918, "rating": 1.0, "text": "Not recommended at all.", "pics": null, "resp": null, "gmap_id": "0x889a4e2ad7707743:0x32d1125e5ddc28d7"}
{"user_id": "101814843532482246040", "name": "Randy Carpenter", "time": 1622462924711, "rating": 5.0, "text": "Our mother is a resident at Summerford. She is always treated with respect and the staff have amazing patience with her. The facility is always very clean. Several staff members have helped our family tremendously. Kyla Blackwood has always helped to guide us through the complicated regulatory processes and answers any of our questions and if she doesn't know she finds someone to help us. Kayla and Aryn have been amazing in the care they have provided for our mother. They spend the extra time with her necessary to take care of her many needs. Thank you to Summerford for providing a safe and caring place for our Mom!", "pics": null, "resp": null, "gmap_id": "0x88882b596cc475f1:0x227ef18cba2552d3"}
{"user_id": "107922224647777829611", "name": "Lang Sims", "time": 1622213193330, "rating": 5.0, "text": "One of the best things about Summerford Health and Rehab is its employees. To name one in particular, Kyla Blackwood is one of the most helpful, cheerful, thoughtful, and caring people I have ever known. She has guided me while trying to get things all set for my loved one, and she has done so with a can-do, happy to help attitude. She is wonderful!", "pics": null, "resp": {"time": 1622230778380, "text": "Thank you for your kind words! We love hearing great things about our amazing employees."}, "gmap_id": "0x88882b596cc475f1:0x227ef18cba2552d3"}
{"user_id": "113930409695288097194", "name": "Rachel S Fowler", "time": 1623808741623, "rating": 5.0, "text": "Kari B is a knowledgeable in her field as an RN. She communicates well with her staff and patients. She gives excellent patient care and exceeds in follow-up care and routines. She is well respected by her peers and works diligently with her staff. She excels in the healthcare and rehab profession.", "pics": null, "resp": {"time": 1623815029994, "text": "Thank you for the kind words 🙏🏻"}, "gmap_id": "0x88882b596cc475f1:0x227ef18cba2552d3"}
{"user_id": "102905497622477967334", "name": "Bebe Brown", "time": 1622259385130, "rating": 5.0, "text": "My mother was a resident at Summerford for 2 years and passed away this past December.  From the moment she arrived, she was treated with dignity and respect, she was well cared for and I could not have asked for more.  A special thanks to Kyla Blackwood, whose kindness and compassion (from admission until the end), made things easier and made us feel like family 💜\nI have recommended Summerford to many friends, who have also had good experiences!", "pics": null, "resp": {"time": 1622342254266, "text": "We’re happy that you’re happy! Thank for leaving the kind note."}, "gmap_id": "0x88882b596cc475f1:0x227ef18cba2552d3"}
{"user_id": "107145985262800505965", "name": "Stewart Walker", "time": 1622734390966, "rating": 5.0, "text": "My mother has been at Summerford’s twice for rehabilitation. The service and the staff are awesome! Kyla Blackwood, in particular, has been amazing. She goes above and beyond to help the entire process go smooth and seamless. She is an invaluable asset no doubt!", "pics": null, "resp": null, "gmap_id": "0x88882b596cc475f1:0x227ef18cba2552d3"}
{"user_id": "112146012980486232639", "name": "Dettrina Peinhardt", "time": 1622223382882, "rating": 5.0, "text": "Super good Nursing Home! Clean, Caring and Compassionate   Antionette Edge in Dietary always helpful and willing to do what she can to keep residents and their taste buds happy and healthy!", "pics": null, "resp": {"time": 1622342348392, "text": "Thanks for sharing. Keep up the great work Antionette!"}, "gmap_id": "0x88882b596cc475f1:0x227ef18cba2552d3"}
{"user_id": "114424405104522465327", "name": "Karen Walker", "time": 1622418587521, "rating": 4.0, "text": "My sister has been in Summerfords twice for rehab and is now a resident.  I feel secure that she is well cared for by the staff.  It is always difficult when you cannot continue living in your own home,  Summerfords has made that transition much easier.\nKyla Blackwood is very helpful with any questions or concerns I have.  She is a bright light in a stressful time.  Positive and cheerful all the time which is great for me and my sis.", "pics": null, "resp": null, "gmap_id": "0x88882b596cc475f1:0x227ef18cba2552d3"}
{"user_id": "107047091620701081798", "name": "Kyla Blackwood", "time": 1622468285011, "rating": 5.0, "text": "I am an employee of Summerford, but I have had two family members there, my grandparents. My grandfather was there before I became an employee. The nurses and CNA’s are amazing. Lexi Powers, Jerome Orr, Rebecca Gay, Kista Burden, Michael Evans took amazing care of my grandfather. Cynthia Williams, Evita Williams, Cassandra Ward, Jessica Morrow took amazing care of my grandmother. This doesn’t include SO many others that have gone above and beyond for my family and me. I was on vacation when my grandmother began to decline. Charley Caudle went in and was with my Mom when I couldn’t be and I could never thank her enough for that. Our DON’s, Angie Chaney and Amy Lay are two of the most intelligent nurses I know. If we don’t know an answer, they sure do and are always willing to help  out where needed. Vicky Toller and Rita Evans in housekeeping have so much to do everyday and we are always adding to their list. They are blessing to the staff and residents. I am thankful to be a part of this team and I am even more thankful for the compassion the staff shows. ❤️", "pics": null, "resp": null, "gmap_id": "0x88882b596cc475f1:0x227ef18cba2552d3"}
{"user_id": "113674606990439843052", "name": "Spartan Tactical", "time": 1591121322846, "rating": 1.0, "text": "My grandmother was recently admitted here after a stroke. she has lost her ability to speak and move one side of her body. she has a hard time swallowing or drinking. she's on her way back to ICU now because of the impotent staff and nurses who would rather sit at the nurses station on their phone than to make sure she is getting fluids and food. DO NOT PUT YOUR LOVED ONES HERE! Was all good during intake and then the communication wall went up. now they act as if they couldn't care less about my grandmothers help. I will be filing a formal complaint with HR and the BBB. Disgraceful.", "pics": null, "resp": null, "gmap_id": "0x88882b596cc475f1:0x227ef18cba2552d3"}
{"user_id": "100014993809723482599", "name": "Crystal Clay", "time": 1557499981607, "rating": 1.0, "text": "Admission of my father to Summerford was easy, smooth and the staff was very friendly and helpful but towards the end of my fathers stay, I become very disappointed with how the office staff and clinical staff handled my fathers situation. He developed behavior problems and was basically shoved out the door. There was communication failure between office and clinical staff and in the end, my father ended up with no where to go and Summerford showed no concern because they did not want to deal with his behavior. I would not recommend this facility because in our time of need, Summerford failed us.", "pics": null, "resp": null, "gmap_id": "0x88882b596cc475f1:0x227ef18cba2552d3"}
{"user_id": "105707661461351160859", "name": "Blackkat RavenWolfe Productions", "time": 1554248462150, "rating": 5.0, "text": "If the beautiful flowers and trees aren't enough there are animals you can feed on the south end. There are deers, goats, llamas, emus, geese, and turkeys just to name a few.  The rehab department is top notch and meals are usually very good.", "pics": null, "resp": null, "gmap_id": "0x88882b596cc475f1:0x227ef18cba2552d3"}
{"user_id": "115052695485856472378", "name": "Deloria White", "time": 1535603001000, "rating": 5.0, "text": "My father has been in Summerford Nursing Home for several years . He has Parkinson's disease & dementia which are terrible disease to work with. His care takers Jerome & Lexie are such troopers !!! My daddy loves them & his face lights up when he sees their sweet face :)  Summerford Nursing Home is squeaky clean ...always !!! The cleanest nursing home you will find ...spotlessly clean. Everyone does their job and the staff and owner are friendly and willing to help any way they can. And did I mention the good southern homemade meals ??? Folks come from the outside to eat lunch /dinner here . The administration clerk and social worker is beautiful ...inside and out and knows her job plus willing to go the extra to help anyone she can. If you are looking for a home for your loved one.....check out Summerford Nursing Home in Falkville, AL.", "pics": null, "resp": null, "gmap_id": "0x88882b596cc475f1:0x227ef18cba2552d3"}
{"user_id": "108868638073511273133", "name": "Micheal W. Palmer", "time": 1500317042976, "rating": 5.0, "text": "My father is here. The staff are wonderful to him. The location is attractive and always clean. When I get to be his age, I hope I get such good care.", "pics": null, "resp": null, "gmap_id": "0x88882b596cc475f1:0x227ef18cba2552d3"}
{"user_id": "111736588891558087051", "name": "Marvin Nuby", "time": 1485963373824, "rating": 5.0, "text": "I visit folks at Summerford Nursing Home on a regularly, staff are very helpful and concerned about the care of residents. If I had a loved one that needed care, this is the place I would chose for them.  They watch out for them, if an emergency occurs, they take care of it ASAP. I visit there every weekend.  Not just one person, several folks I see and hand out church bulletins from GOD's Church that I am a member of.", "pics": null, "resp": null, "gmap_id": "0x88882b596cc475f1:0x227ef18cba2552d3"}
{"user_id": "101668302862302691746", "name": "Selma Sanchez", "time": 1531249057965, "rating": 5.0, "text": "My mom was there for a while and I could not aske for a better place , a cleaner place , better staff.This is a place of mercy and compassion.God bless them..", "pics": null, "resp": null, "gmap_id": "0x88882b596cc475f1:0x227ef18cba2552d3"}
{"user_id": "115179438370065618104", "name": "Doug Oden", "time": 1550271671324, "rating": 5.0, "text": "Very clean and organized very friendly and helpful staff.Great food", "pics": null, "resp": null, "gmap_id": "0x88882b596cc475f1:0x227ef18cba2552d3"}
{"user_id": "114183053244481376134", "name": "Kay Campbell", "time": 1507779978354, "rating": 4.0, "text": "My husband's folks are here now. Staff seem attentive, & their room is a good size.", "pics": null, "resp": null, "gmap_id": "0x88882b596cc475f1:0x227ef18cba2552d3"}
{"user_id": "105698879721835033450", "name": "David P. Olivier (1000 Hearts)", "time": 1597774319262, "rating": 1.0, "text": "On April 11, 2020 I lost my Mother at this “facility”.  Despite CDC and ADPH guidelines which include provisions for “life and death ” situations; 2 men-yes, just 2 men- have put a policy in place that saw my beloved Mother leave this world and enter the next completely alone!  No husband of 66 years holding her hand.  No children or grandchildren at her bedside.  We were in the parking lot being\ncondescended to.  We were being offered a “glance through a window” moments before being told, in a parking lot, that she was gone.  If the roles had been reversed and any human being had tried to stop my Mother from being at the side of her loved ones as The final breath were drawn: No Earthbound force could  have stopped the Power of Love that coursed through that remarkable woman.  She would have been at my side.  I am a weaker soul than she.  I tried diplomacy.  My cries fell on ears so consumed with ego and a sense of power that the only meaningful response from the tyrant who dared only speak with me via speakerphone was  “...that’s how we’re doing it.  That’s off our best judgement.”\nI posted a video on social media prior to Mother’s passing, after the phone conversation, asking for support from friends and others in the community.  The calls that they place were met with hostility, rudeness, and empty promises of “the administrator will get back in touch with you”.  As those phone calls were coming in and my sister was being told of Momma’s passing, I was receiving cold, disdainful stares by the only staff member who could even bring herself to look in my direction.\nThere is no way this injustice can be reversed.  This beautiful creature whose pastor said in his eulogy “... was a beautiful soul.  It was my privilege to be her pastor and to be her friend.  I'm not sure that I've ever known anyone who had so much love, so concentrated, deep within her being.  Every interaction I've ever had with Carolyn was permeated with love.” This giant of a giver.  This Child if God.  My Mother.  I cannot change the final moments of her life.  I can, however, see that her story is told.  I can see that these individuals who slither through this life generating pain and sorrow need not be concerned if they are alone.  I couldn’t be there for Momma on that day but with God as my witness, until I draw my last breath, I will live as a reminder to those who tried to diminish her that She lives in me.  Where her eyes are now closed, mine are now open.  My eyes are wide and inquisitive.  My eyes seek only one sight today.  That sight is justice!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPSIMcOHyDkJjEvJiV1wzIntCUgI-CxkRkk468V=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88628ca2f713080d:0xe3d72b4151aa0574"}
{"user_id": "106122381008780823371", "name": "Elizabeth Hollingsworth", "time": 1554228488648, "rating": 5.0, "text": "Fantastic facility! The therapy staff are truly dedicated to helping you achieve your goals and get home as quickly as possible. The environment is bright and clean. Highly recommend this facility to anyone!", "pics": null, "resp": null, "gmap_id": "0x88628ca2f713080d:0xe3d72b4151aa0574"}
{"user_id": "102447697817850087965", "name": "Matt's Regional Calendar", "time": 1569338879546, "rating": 5.0, "text": "Staff was very friendly. Facility was very clean.  Therapist were great and treating us like family.", "pics": null, "resp": null, "gmap_id": "0x88628ca2f713080d:0xe3d72b4151aa0574"}
{"user_id": "115026238953929233276", "name": "Charmin Mccurdy", "time": 1489769101704, "rating": 1.0, "text": "My aunt was in this facility and recently passed due to severe dehydration and blood sugar at 700. She was not taken care of by most of the staff only family that stayed with her. When the family would turn the light on for help it would take up to 45 min for the staff to respond. The staff was /is overworked sometimes working 16 hour days. This is by law unacceptable. I would not recommend this facility to anyone that cares for their loved one.", "pics": null, "resp": null, "gmap_id": "0x88628ca2f713080d:0xe3d72b4151aa0574"}
{"user_id": "115134446008372513714", "name": "Movin' Mark", "time": 1472691687208, "rating": 4.0, "text": "Great facilities have done really well with my mom.", "pics": null, "resp": null, "gmap_id": "0x88628ca2f713080d:0xe3d72b4151aa0574"}
{"user_id": "106350408948100080840", "name": "Barry lkard", "time": 1477949557098, "rating": 4.0, "text": "Yes", "pics": null, "resp": null, "gmap_id": "0x88628ca2f713080d:0xe3d72b4151aa0574"}
{"user_id": "114411321367262592480", "name": "Deborah Saye", "time": 1627349272723, "rating": 5.0, "text": "Worked here for over 20 years. Although, I am\nNo longer here, Marshall Manor will always hold a special place in my heart. They have the most loving staff that cares for the residents. I would highly recommend this facility if you are in need of placement for a family member.", "pics": null, "resp": null, "gmap_id": "0x8889f9a6c5c4e363:0xa07bba768bd0d130"}
{"user_id": "115759287938129569333", "name": "Isaac P", "time": 1623364795734, "rating": 5.0, "text": "There is no finer nursing home in the state! The love and care they provide their residents is unmatched. The staff are very dedicated.", "pics": null, "resp": null, "gmap_id": "0x8889f9a6c5c4e363:0xa07bba768bd0d130"}
{"user_id": "109822249056923823870", "name": "Amanda", "time": 1623365942096, "rating": 5.0, "text": "Marshall Manor is a wonderful facility full of people who were called to serve. They really pour their heart into their residents. They offer wonderful activities and social opportunities. I can't express how wonderful this facility is. They provide the upmost care to all their residents.", "pics": null, "resp": null, "gmap_id": "0x8889f9a6c5c4e363:0xa07bba768bd0d130"}
{"user_id": "115875080504521326880", "name": "otto wood", "time": 1561940396980, "rating": 5.0, "text": "Serving as a Hospice Chaplain for the last 3.5 years I  frequent many facilities through out the North Alabama region. Marshall Manor is one of the finest. They have a caring committed staff from the administrator (Linda) ,nurses, to the kind aides. The facility is kept clean and so are the patients. Most importantly the residents are valued and loved  and that is demonstrated every day.", "pics": null, "resp": null, "gmap_id": "0x8889f9a6c5c4e363:0xa07bba768bd0d130"}
{"user_id": "102478158318172200453", "name": "Autumn Martin", "time": 1491474831533, "rating": 5.0, "text": "Not working there anymore but by far the best job I have EVER had. I loved the people I worked with and my residents. Only problem I ever had there was some of the people there did not care AT ALL about their job or residents. We all had our bad days but definitely loved my job. Amazing place to work. I loved it!", "pics": null, "resp": null, "gmap_id": "0x8889f9a6c5c4e363:0xa07bba768bd0d130"}
{"user_id": "104530367730552269326", "name": "David Denham", "time": 1442427648714, "rating": 1.0, "text": "I would advise avoiding this place at all costs. My grandmother was admitted to Marshall Manor for rehab. Shortly afterward we found out she had lung cancer that had moved into her bones also. They consistently served food that was horrible, and in some cases unidentifiable. She was bed bound and had to push the nurse call button for assistance to use the bathroom. Once it was an HOUR before anyone came to help her. Finally, when we were trying to coordinate transportation for her appointment at the cancer care center, they were absolutely unwilling to help until I enlisted the help of the ombudsmen and threatened to file a complaint with their corporate office. They went so far as to lie to the scheduler from the Cancer Care Center when she called herself to try to arrange transportation. They claimed my grandmother was \"very mobile\". She was totally bed bound. When the Dr and the Cancer Care Center saw my grandmother, he apologized profusely and said he had been misled about her condition. He had her admitted immediately to Shepherd's Cove (a hospice facility). I regret immensely that my grandmother had to spend two of her final weeks at this horrible facility.", "pics": null, "resp": null, "gmap_id": "0x8889f9a6c5c4e363:0xa07bba768bd0d130"}
{"user_id": "116233651757463573141", "name": "Doug Tucker", "time": 1617617768770, "rating": 1.0, "text": "Avoid at all costs", "pics": null, "resp": null, "gmap_id": "0x8889f9a6c5c4e363:0xa07bba768bd0d130"}
{"user_id": "105354626821789424070", "name": "Vickie Thompson", "time": 1518451327135, "rating": 4.0, "text": "I use to volunteer here. Its in a quiet community. They do have a lot of activities for their patients.", "pics": null, "resp": null, "gmap_id": "0x8889f9a6c5c4e363:0xa07bba768bd0d130"}
{"user_id": "100975892998032552847", "name": "Christapher Flowers", "time": 1450497656604, "rating": 4.0, "text": "im wondering if hiring ? im looking for a job , and i want to work badly , i just moved to alabama recently i thought this would be a good place to start hopefully Marshall Manor Nursing Home can get back to me", "pics": null, "resp": null, "gmap_id": "0x8889f9a6c5c4e363:0xa07bba768bd0d130"}
{"user_id": "116985286298434033744", "name": "Melissa B", "time": 1454091182905, "rating": 1.0, "text": "One of the worst as the other reviewer has said. Avoid.\nThe Director of Nursing is a total wack job psychopath. Avoid, avoid, avoid.", "pics": null, "resp": null, "gmap_id": "0x8889f9a6c5c4e363:0xa07bba768bd0d130"}
{"user_id": "105500052725405186220", "name": "lucretia Lemley", "time": 1467813399724, "rating": 1.0, "text": "Awful place to work", "pics": null, "resp": null, "gmap_id": "0x8889f9a6c5c4e363:0xa07bba768bd0d130"}
{"user_id": "112996706824182531265", "name": "Eric Stark", "time": 1626491056146, "rating": 5.0, "text": ".. is a great place to be from, as in as far as one can get away from.\nI literally had to sleep with one eye facing the door to assure my belongings were still in tact the following day. I lived enduring this ‘real fear’ the entire 20 mo. rehab stay loosing approximately $27,000 in real property value.\nA local Elder Law Attorney stated if I had a rock solid case though if I moved the n it that Their Doors would be Administratively Barred (closed down), again, which would hurt a lot of Folks less Fortunately.", "pics": null, "resp": null, "gmap_id": "0x88890e754e3d4b9d:0x5679bbee739c0e64"}
{"user_id": "111569235445985902747", "name": "Erin Lovett", "time": 1560697793435, "rating": 1.0, "text": "I would give zero stars if possible. My dad's mental status started to seriously decline while here. He came for rehab for 20 days. PA and staff kept saying that's just how he will probably be (in regards to his mental status). Well I know my dad and even though he is elderly he is sharp. He had a Foley and the urine was a strange tea like color. They said no big deal. I had to request they run labs on the urine (the PA didn't even want to do that). When they came back one of the labs was a little elevated, they said it was no problem, nothing serious. He wasnt eating well when usually he is a good eater. He vomited. He had hallucinations. He was lethargic. We reported all of this. THEY DID NOTHING. When dad's eyes started rolling back in his head and he was difficult to wake we demanded he be taken to the ER. HE WAS SEPTIC. The ER nurse's words were \"What the hell are they doing over there? Your dad is very, very sick.\" If he wouldn't have had family there every day for several hours a day they would have let him lay there and DIE. If you love someone do not send them here. If you don't like someone don't send them here. No one deserves unskilled, uncaring, incompetent staff at a place where you come to get better.", "pics": null, "resp": null, "gmap_id": "0x88890e754e3d4b9d:0x5679bbee739c0e64"}
{"user_id": "103801953900971498962", "name": "Mack Hays Jr.", "time": 1610904239378, "rating": 1.0, "text": "Wish I could give -5 stars. On Christmas Eve 2019' Jerelyn Tiller CRNP diagnosed my dad with a UTI when in fact his foley was blocked. When we asked the RN on duty (Teresa) why he was almost unresponsive she replied \"he been up all day' he just tired.\" Dad suffered horribly & almost died from sepsis. if we hadn't insisted he be taken to the ER he probably wouldn't have made it another 24hrs.", "pics": null, "resp": null, "gmap_id": "0x88890e754e3d4b9d:0x5679bbee739c0e64"}
{"user_id": "110593532366276801183", "name": "michael allison", "time": 1550503081336, "rating": 3.0, "text": "The care seems to be ok,we are experiencing clothes coming up missing, new cloths hanging in her closet, never worn, just gone, and of course no one knows anything. Buy some light weight chain and a small lock and lock up the closet and drawers, give your loved one the key put it on a string and have them wear it around their neck,then they will control who goes in and out of their  clothing closet and drawers.", "pics": null, "resp": null, "gmap_id": "0x88890e754e3d4b9d:0x5679bbee739c0e64"}
{"user_id": "113213609056471415828", "name": "Taylor Daniel", "time": 1571703257576, "rating": 1.0, "text": "They did not take care of my grandmother properly and failed to tell us of several incidents that occurred during her short stay. I would give this place negative stars if I could.", "pics": null, "resp": null, "gmap_id": "0x88890e754e3d4b9d:0x5679bbee739c0e64"}
{"user_id": "117906736107225831385", "name": "Joseph Watkins", "time": 1563806703841, "rating": 5.0, "text": "This place very clean and nice vauble care for love ones check them out 1 for patient care.", "pics": null, "resp": null, "gmap_id": "0x88890e754e3d4b9d:0x5679bbee739c0e64"}
{"user_id": "104057614505617945309", "name": "T Whitfield", "time": 1534177612315, "rating": 1.0, "text": "Do Not Send Your Love One Here! My mom has dementia and had hip surgery and was there to help her walk again. When we brought her home we realized they didn't change her (diapers) like they should and she was SEVERELY raw on her bottom. She had bruises all over her where they (I assume) tried to pick her up or change her. So if your love one isn't able to communicate like they should or has any dementia DO NOT SEND them here. They do not know how to handle them or won't. Believe me Mom is worse now than before she went there.", "pics": null, "resp": null, "gmap_id": "0x88890e754e3d4b9d:0x5679bbee739c0e64"}
{"user_id": "105072278345839320561", "name": "LaSandra McKinzie", "time": 1557828737884, "rating": 1.0, "text": "This is the worst nursing home for someone who had a stroke. My mother is inpatient their and they missed a lot of opportunities to get her better. First they told me she was ok after I insist that they have her checked by a nurse because I realize she wasn't mobile, weak, active, slurred speech, confused, forgetful and lost of appetite. I finally ask for them to check her for a UTI and after 6 days they finally agreed to have her checked. I was told that they had lab work done and it was negative. After not getting anywhere with the Nurse Manager, nurse, and CNA. I took my mother to ED to finally get a urinalysis that she in fact had a UTI. They are very unprofessional, liar, and uncaring. Don't take your love ones there unless you can stay with them 24 hours a day.", "pics": null, "resp": null, "gmap_id": "0x88890e754e3d4b9d:0x5679bbee739c0e64"}
{"user_id": "103461432721360071635", "name": "Robert Ricks", "time": 1547531561112, "rating": 1.0, "text": "Night shifts nurses rude and unprofessional.  One came out front door to smoke as we're unloading pt. Could hear her complaining about receiving said pt then left us outside in the cold while our dispatcher had to call them to let us in", "pics": null, "resp": null, "gmap_id": "0x88890e754e3d4b9d:0x5679bbee739c0e64"}
{"user_id": "115370757372687683155", "name": "Sheryl Williams", "time": 1524147775429, "rating": 1.0, "text": "If they had a 0 to rate. I'd give this place a NEGATIVE 5. DUMB NURSES, UNCARING CNA, SMELLS LIKE A DUMP SITE,ANS MANAGEMENT. WELL, LET'S JUST SAY my dog can run this building", "pics": null, "resp": null, "gmap_id": "0x88890e754e3d4b9d:0x5679bbee739c0e64"}
{"user_id": "116430222911957018637", "name": "Thomas S", "time": 1407363214214, "rating": 1.0, "text": "Disgusting place. Horrible staff. Totally indifferent to patients needs. Do not send your dog to this place even if you do not like it.", "pics": null, "resp": null, "gmap_id": "0x88890e754e3d4b9d:0x5679bbee739c0e64"}
{"user_id": "117883893549638490691", "name": "Gail Cator", "time": 1624098345400, "rating": 5.0, "text": "My experiences as a member of the Activities staff are endlessly fulfilling. For over three years I have been privileged to work closely with our residents, listening, sharing, laughing, singing, and so much more. Each resident is a precious miracle. I am honored to know them and learn their daily stories.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPO61CRGwl6XPXH4bleH7odfj9Kkffwc3NPKHWY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMnY1ZfXwiRb1TIL0znbb6FWcvPobGx2J6-5aAN=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNfc2bY3-5T5iUu1LsAtADP124j5tKs5mEJpJUc=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPnz7RQXcMdmWZd_IJMpJgCCplwSoxEkPVM492k=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88890e9c04c0a3c9:0xbd879a5f1a9275ed"}
{"user_id": "105305410490472921537", "name": "Debra Crutchfield", "time": 1624235373315, "rating": 5.0, "text": "I have had the experience of having my Mother In Law and my Aunt at Birmingham East. The compassion and care that the facility staff showed was exceptional. The building was clean and well keep. Therapy was exceptional. I would highly recommend Birmingham East to anyone looking for a great long term care facility.", "pics": null, "resp": null, "gmap_id": "0x88890e9c04c0a3c9:0xbd879a5f1a9275ed"}
{"user_id": "105911536891083233537", "name": "Sheila Bennett", "time": 1624032044585, "rating": 5.0, "text": "I highly recommend Birmingham Nursing and Rehabilitation East with your family's long term needs. My Mother was there for almost 5 years,  the staff took very good care of her, all departments were very helpful and friendly.", "pics": null, "resp": null, "gmap_id": "0x88890e9c04c0a3c9:0xbd879a5f1a9275ed"}
{"user_id": "112080914016721973263", "name": "Lisa Seabolt", "time": 1624048007170, "rating": 5.0, "text": "I have been employeed at Birmingham Nursing for almost 30 years . Birmingham Nursing is a exceptionally nice place to work. We have wonderful nurses, CNA's, great therapy department , dietary and we have lots of fun and activities with our very sweet and kind activities department. We have great dining experience with staff there to assist. We love our residents here and treat them with the upmost respect the residents here are our family too. Just stop by meet our caring and dedicated staff and see our clean building. I am proud to say I work here and have been for almost 30 years. If my mother had to have placement it would be a honor for me to place her at Birmingham Nursing and Rehab East.", "pics": null, "resp": null, "gmap_id": "0x88890e9c04c0a3c9:0xbd879a5f1a9275ed"}
{"user_id": "113038089733152069564", "name": "Susan Wnorowski", "time": 1623186174333, "rating": 5.0, "text": "Very nice here I was very happy with my stay here.I came here because my legs were weak, and therapy got me strong enough to go back home. Staff was very friendly and compassionate staff.\nCarl Ford", "pics": null, "resp": null, "gmap_id": "0x88890e9c04c0a3c9:0xbd879a5f1a9275ed"}
{"user_id": "104207883067089509020", "name": "Kayla Barlett", "time": 1624033617883, "rating": 5.0, "text": "I've worked at this facility for over 7 years! I enjoy my job, and love the opportunity to provide care for our residents!", "pics": null, "resp": null, "gmap_id": "0x88890e9c04c0a3c9:0xbd879a5f1a9275ed"}
{"user_id": "117860851728393378865", "name": "Karon Huguley", "time": 1612968816426, "rating": 5.0, "text": "My sister has been a resident at this facility for several years. The staff has always been very professional and informative. The facility is very clean and very well kept. I would highly recommend bringing any loved one to visit or live at Birmingham East Nursing and Rehab.", "pics": null, "resp": null, "gmap_id": "0x88890e9c04c0a3c9:0xbd879a5f1a9275ed"}
{"user_id": "101245912292284542182", "name": "Marsha Daugherty", "time": 1613742389175, "rating": 5.0, "text": "My sister was a resident at Bham East Rehab & NH for 2 years.  She received very good care from nursing staff.  Office staff was great as well, and helped with making her private room more than a room but her home.  I am so thankful for the love, support and care she received.", "pics": null, "resp": null, "gmap_id": "0x88890e9c04c0a3c9:0xbd879a5f1a9275ed"}
{"user_id": "107278764343394404470", "name": "Carl Ford", "time": 1624661008161, "rating": 1.0, "text": "Not happy with business office and administration. They kept me 5 days over. Gave misleading information about my covid vaccines and changed my insurance without my consent", "pics": null, "resp": null, "gmap_id": "0x88890e9c04c0a3c9:0xbd879a5f1a9275ed"}
{"user_id": "105846022103347207912", "name": "Jessica Amerson", "time": 1623678697031, "rating": 1.0, "text": "Horrible place! Don’t send your loved ones here!!", "pics": null, "resp": null, "gmap_id": "0x88890e9c04c0a3c9:0xbd879a5f1a9275ed"}
{"user_id": "113219306189707510109", "name": "V Gidley", "time": 1615343559196, "rating": 5.0, "text": "I am so appreciative of the staff that take care of my mother.", "pics": null, "resp": null, "gmap_id": "0x88890e9c04c0a3c9:0xbd879a5f1a9275ed"}
{"user_id": "114269106212098562999", "name": "Evelyn Stubbs", "time": 1623968999143, "rating": 5.0, "text": "A wonderful place and a loving staff", "pics": null, "resp": null, "gmap_id": "0x88890e9c04c0a3c9:0xbd879a5f1a9275ed"}
{"user_id": "106484892980768928712", "name": "Joshua Perdue", "time": 1507224974814, "rating": 5.0, "text": "A great nursing faculty with awesome staff! The staff are friendly and offer each resident individualized care in a special way. The staff are also more than willing to answer any questions and/or concerns. This facility provides 5 Star Care to all that they serve, and they also ensure that the resident’s families are knowledgeable about all of the things going on!", "pics": null, "resp": null, "gmap_id": "0x88890e9c04c0a3c9:0xbd879a5f1a9275ed"}
{"user_id": "116002058169963760287", "name": "Janet L Hunter", "time": 1599883364679, "rating": 1.0, "text": "My Husband had been resident there over 3 years. This had been the rudest business office people at this facility . Susan Wnorowski  had misappropriated my husband's money and now trying to punish me with her rude tone and bad Business  behavior. Tracy Yopasa is her manager she told me to just overlook Susan ways.  She Blatant lied and her Boss is okay with it.\nI gotta say There all rude and unprofessional. Still unresolved issues on my husband's money 9/11/20. Still NO Word on my husband's stimulus check or other missing monies.", "pics": null, "resp": null, "gmap_id": "0x88890e9c04c0a3c9:0xbd879a5f1a9275ed"}
{"user_id": "111093570926317116115", "name": "Robin Layfield", "time": 1577556393446, "rating": 1.0, "text": "Under staffed. Room bells are always going off with no response, from multiple desk. Alternate meals are a joke.", "pics": null, "resp": null, "gmap_id": "0x88890e9c04c0a3c9:0xbd879a5f1a9275ed"}
{"user_id": "107364174997752517269", "name": "Rachale Harris", "time": 1495215299709, "rating": 1.0, "text": "Worked for this company 3 months.  From day one I wasn't given any training in regard to the computer systems or patient care. They gave me a set of keys and said handle it. Handle it meaning  45 long term patients. After I turned my notice in they cut my pay cut my hours back. The day I was supposed to receive my last paycheck I find out someone over payroll deposited it onto a H&R BLock debit card that belongs to someone else. I contacted the company who refused to correct their mistake.", "pics": null, "resp": null, "gmap_id": "0x88890e9c04c0a3c9:0xbd879a5f1a9275ed"}
{"user_id": "100327929684358141126", "name": "Melody Crutchfield", "time": 1498909003910, "rating": 5.0, "text": "My Mother has been a resident there for 4 years. CNAs and Nurses does a great job. Remember anyone can post here even those who wants to be vindictive torwards the facility because they are being ugly. Please go by the facility take a tour unannounced talk  with  staff. We are fortunate to have the honor to work in their home.I am blessed to be a part of that.", "pics": null, "resp": null, "gmap_id": "0x88890e9c04c0a3c9:0xbd879a5f1a9275ed"}
{"user_id": "100054177348965879316", "name": "Erin Kinnaird", "time": 1380028966460, "rating": 1.0, "text": "My grandmother has bed sores because the staff are not turning her properly.  She has a UTI because they are not cleaning her properly.  The administrative staff always seem to be \"out to lunch\" whenever my mother calls them to discuss my grandmother's care (or lack thereof).  The in-house doctor won't allow my grandmother to have the anti-anxiety medicine that she's been on for the last 10 years or so and even though she's been diagnosed with PTSD as a result of a near fatal car wreck, he won't give her anything for that either.\n\n9-24-13 Update: My grandmother finally had to be rushed to the ER because her vitals dropped.  Her sodium was at a critical level.  It was so low that she was almost comatose.  The bed sore on her lower back ended up being as big as a softball and 3 inches deep.  She's been sent home with hospice now.  The nursing home has killed my grandmother.", "pics": null, "resp": null, "gmap_id": "0x88890e9c04c0a3c9:0xbd879a5f1a9275ed"}
{"user_id": "108452525516379393521", "name": "Roger Lee The Doodle", "time": 1516283316474, "rating": 2.0, "text": "Some of the staff is very friendly, the other half is very moody.  The weekends are the worst, always short on staff. 1 nurse on staff for 23 patients and meds are late. Cna's barely come to work.  Overall it was close to home, my mom stayed 30 days and I got tired of no improvements, poor food options and understaffed days and weekends so I took her home, couldn't be any worse there.", "pics": null, "resp": null, "gmap_id": "0x88890e9c04c0a3c9:0xbd879a5f1a9275ed"}
{"user_id": "103847628140549055273", "name": "Robert Mcdonald", "time": 1520739262732, "rating": 1.0, "text": "Please Please do not send your loved ones here, so much neglect. You think you are sending them there for doctors and nurses to help them, when all they do is help them to live missorubly and die sooner!!! And that's from my experience and doctors comments at hospital.", "pics": null, "resp": null, "gmap_id": "0x88890e9c04c0a3c9:0xbd879a5f1a9275ed"}
{"user_id": "113765195141971318472", "name": "Sheila Abbott", "time": 1516986767301, "rating": 1.0, "text": "Rude to everyone that lives there  my grandmother thirsts half to death never comes to change her clothes pushes the button and they come two hours later. I usually don’t write reviews but I would want to know if my family would get treated bad. My grandmother is young 55 years old so she’s considered elderly.", "pics": null, "resp": null, "gmap_id": "0x88890e9c04c0a3c9:0xbd879a5f1a9275ed"}
{"user_id": "114584529253577745329", "name": "cool navy", "time": 1552929767752, "rating": 3.0, "text": "I used to stay there the staff did half of the job never again", "pics": null, "resp": null, "gmap_id": "0x88890e9c04c0a3c9:0xbd879a5f1a9275ed"}
{"user_id": "102104165775378036513", "name": "J Pannell", "time": 1548315189533, "rating": 1.0, "text": "I stayed there last year for rehab after being shot for a busted feemer it's the most nasty inhumane place I've ever been my family checked me out", "pics": null, "resp": null, "gmap_id": "0x88890e9c04c0a3c9:0xbd879a5f1a9275ed"}
{"user_id": "112650656475927595948", "name": "Kurt Wilson", "time": 1491894861401, "rating": 5.0, "text": "Treated my family w/ respect", "pics": null, "resp": null, "gmap_id": "0x88890e9c04c0a3c9:0xbd879a5f1a9275ed"}
{"user_id": "109948816680009631173", "name": "Tavouis Adams", "time": 1376608045298, "rating": 3.0, "text": "Birmingham east nursing rehab", "pics": null, "resp": null, "gmap_id": "0x88890e9c04c0a3c9:0xbd879a5f1a9275ed"}
{"user_id": "101230532798868999825", "name": "Mark Lester", "time": 1614133781681, "rating": 3.0, "text": "I WAS A RESIDENT THERE! I WAS just getting over a Serious Sickness situation that made it to where I couldn't hardly walk by Myself for a bit. Prior to going there over in River-View Hospital. Funny thing to add in-advance, I'd got shipped there via Ambulance on Feb.14th ( out all days, lol ). Anyway, River-View had sent me there @ Coosa Valley for Re-Hab. Now, My then-recent foot surgery DIDN'T HELP MATTERS @ ALL ( in the start ). Did PLENTY of Paper-work, & met sev. of The Staff/Workers ( CNA,RN, Physical Re-Hab Personnel, Etc. ). I'd DID MY BEST I Could ( with HELP from The Staff ) to get the Req. Re-Hab needed ASAP! Infact, they'd \"Begged\" me to stay, but I was ready ( no more need for wheel-chair except, maybe a cain, kept. clean+showered without needed extra help, etc. ). I'd left out of there on March 31 2020. The Physical Department WAS ( THE CROWN-LOYAL ), so to speak! Let me work @ MY OWN Phase, allow Music to help aid the excerises given to each Patient/Resident , & were such a Jolly-Bunch! Now, The CNA's Behaviors varied on Person to Person of how one was treated, or how that one Resident Behaved towards them.", "pics": null, "resp": null, "gmap_id": "0x888a47790dd0a23f:0x3dd7732a9184864d"}
{"user_id": "115977215666885084780", "name": "Brown Suga", "time": 1594252996296, "rating": 1.0, "text": "IF YOU VALUE YOUR LIFE DON'T WORK HERE\nShort and simple! They don't value the residents or the workers. Durning the pandemic they've withheld material's to help keep down virus AND information from CERTAIN workers!!! They are ALWAYS ill prepared for important things and are usually unaware of what really needs to be brought to attention. This place will throw you to the wolves and watch you get eaten alive and cover it up like it didn't happen. Your life, health and family is more important then making money especially here!!!", "pics": null, "resp": null, "gmap_id": "0x888a47790dd0a23f:0x3dd7732a9184864d"}
{"user_id": "104487681193658834317", "name": "Sharon Gaddy", "time": 1598383890574, "rating": 1.0, "text": "Have a ex sister in law in here took her husband to visit an for some reason he is not allowed to go past the doors they bring her out to see him,,they are very rude to him an hateful ,,an he's 73 an she's 93 I've had speaker phone on when he calls,,some times they are nice but mostly rude an it's mostly office personal...", "pics": null, "resp": null, "gmap_id": "0x888a47790dd0a23f:0x3dd7732a9184864d"}
{"user_id": "115846014411911323259", "name": "Patti Neal", "time": 1557941259045, "rating": 1.0, "text": "I can honestly say that they don't care about their employees.  I was a dedicated employee that truly cared for my residents and my residents loved me back. I tried so hard to make sure that my patients were kept clean and comfortable.  I worked overtime when they were short staffed, anytime they needed me. I really cared. I saw good nurses get fired for no reason.  They have no respect for the good people that try to do a good job. They show no loyalty for the staff. This is why the place can't keep good people that try.  This is why they have such a poor score. The nurses are pushed beyond their limits, and they are always short staffed. The residents don't get the proper care they deserve,  because they either push good people away, or they have people who come in to work and end up quitting after being worked to death, getting no loyalty from the administration.  I had high hopes that if I came in worked hard, took excellent care of my patients that it would gain myself a positive impact and I would stay till retirement.  This place is miserable.  Every single day.  I wouldn't have a family member admitted to their facility.  Lots of other great nursing homes in the area to choose from.", "pics": null, "resp": null, "gmap_id": "0x888a47790dd0a23f:0x3dd7732a9184864d"}
{"user_id": "113396422831647811717", "name": "Darla Newman", "time": 1555635504779, "rating": 1.0, "text": "This place is horrible.  They could care less about your loved one.  They let them lay in a mess for hours at a time.  They loose all of their clothes even if you tell them that you will do their laundry.  If you care about your Loved one do not take them to this place.  It is a joke.  I would not take a stray dog to this place.", "pics": null, "resp": null, "gmap_id": "0x888a47790dd0a23f:0x3dd7732a9184864d"}
{"user_id": "112072155784510543949", "name": "J. P", "time": 1507599839692, "rating": 5.0, "text": "Great 👍 👍", "pics": null, "resp": null, "gmap_id": "0x888a47790dd0a23f:0x3dd7732a9184864d"}
{"user_id": "111889298767906891651", "name": "Mike Simonton", "time": 1592277711790, "rating": 1.0, "text": "My wife went in that PLACE the 18 of May .Two weeks later she died i was not contacted till she had passed away and wad flat out lied to.. They did not return her belonging. Will not answer any questions . I would not recommend those people to take care of a dog", "pics": null, "resp": null, "gmap_id": "0x888a24b941c0fe5f:0x45e00943c826ddd"}
{"user_id": "106872627667093200055", "name": "Sally Ann", "time": 1590695113157, "rating": 5.0, "text": "Staff has a heart for healthcare!  The nursing staff goes above and beyond to make sure the residents have their needs met. Even weekly shopping trips to the grocery store if residents would like to have special items delivered to their homes. It's a home away from home.", "pics": null, "resp": null, "gmap_id": "0x888a24b941c0fe5f:0x45e00943c826ddd"}
{"user_id": "117143585461566332973", "name": "Lillian Christian", "time": 1596403398214, "rating": 1.0, "text": "I will not recommend this place to anyone. I be put on hold a long time and get no answer. I am not able to communicate with my son .,And I don’t get accurate information about his condition. I am going to report them.", "pics": null, "resp": null, "gmap_id": "0x888a24b941c0fe5f:0x45e00943c826ddd"}
{"user_id": "102757571777658867895", "name": "Norma Brunson", "time": 1542017955996, "rating": 5.0, "text": "Everyone has been wonderful.   The staff has catered to all my uncles needs.", "pics": null, "resp": null, "gmap_id": "0x888a24b941c0fe5f:0x45e00943c826ddd"}
{"user_id": "102483660356757814021", "name": "L K", "time": 1554187243872, "rating": 1.0, "text": "Stroke victim made to remain in bed 24/7 with NO rehab. Not turned and checked for excretion or urination for hours and now has a growing bed sore. By law a patient needs to be turned every two hours!!", "pics": null, "resp": null, "gmap_id": "0x888a24b941c0fe5f:0x45e00943c826ddd"}
{"user_id": "104209850246091301336", "name": "Mizz Lisa Kay Hawkins (Lkay)", "time": 1455244596939, "rating": 5.0, "text": "As A Certified Nursing Assistant Working Here .. I loved this job.. Me Myself and other CNAs treated our Residents with Love and commitment in which we treated them as we wanted our Family to be treated.. Anyways i worked her And Got CNA of the Month By \"\"Mr George Thoroton \" whom i miss dearly.. i miss all my Residents Dearly.  Great Nursing Home. Very Well Strict and Caring .. I worked between the years of August 2007- December 2009", "pics": null, "resp": null, "gmap_id": "0x888a24b941c0fe5f:0x45e00943c826ddd"}
{"user_id": "116429091264680232661", "name": "Lynda Cook", "time": 1517383943290, "rating": 4.0, "text": "My sister has been there 3 or 4 years .I've never witnessed anything bad happening n my sister loves it", "pics": null, "resp": null, "gmap_id": "0x888a24b941c0fe5f:0x45e00943c826ddd"}
{"user_id": "118092242351115097339", "name": "Jenna Wyatt", "time": 1505250950914, "rating": 1.0, "text": "Absolutely horrible... Not enough words in the world to describe how horrid this place is. From the ridiculous attitudes and stories that don't add up to the poor people the just leave laying or sitting anywhere with full diapers and all. The state needs to step in and fix this place.", "pics": null, "resp": null, "gmap_id": "0x888a24b941c0fe5f:0x45e00943c826ddd"}
{"user_id": "104268118123298702762", "name": "Leon Archer", "time": 1508122577996, "rating": 1.0, "text": "Disgusting. Can never find a nurse or a CNA. This place is filthy and stinks all the time of poo.", "pics": null, "resp": null, "gmap_id": "0x888a24b941c0fe5f:0x45e00943c826ddd"}
{"user_id": "101143302525196789295", "name": "Anita Chandler", "time": 1620178808309, "rating": 5.0, "text": "I’ve been given the opportunity to love and serve numerous patients and residents over the past twelve years. I’m truly blessed. So many positive outcomes and thankfulness from so many and I appreciate all of you for your kind words and support. It has always been my desire to provide the best possible care to everyone that is or was entrusted to our care. Thank you and may God continue to bless you and be near you. Always remember you and your family are in my daily prayers.", "pics": null, "resp": {"time": 1620221396475, "text": "Hello Anita! We’re so happy to have you as part of the Signature family. We appreciate your dedication and compassion! – Sincerely, Signature HealthCARE"}, "gmap_id": "0x8862133a7685b99d:0x29b04ab624a44d28"}
{"user_id": "101557647375055936083", "name": "Niki Malone", "time": 1623110912507, "rating": 5.0, "text": "The facility has had a turn over in the some of the management team. There is a new Admission Director, Rehab Director, Nutritionist, Social Worker just to name a few. These new shining stars will bring a lot to Whitesburg Gardens. Look forward to the growth potential with these new Managers.", "pics": null, "resp": {"time": 1620216102179, "text": "Hello Niki and thank you so much for your review! The feedback of our residents, families, and stakeholders is valuable to us. – Sincerely, Signature HealthCARE"}, "gmap_id": "0x8862133a7685b99d:0x29b04ab624a44d28"}
{"user_id": "100222512124411235444", "name": "Zerlinda Armes", "time": 1620276987796, "rating": 5.0, "text": "This month I am completing my 7th year at Signature Healthcare of Whitesburg Gardens. As the Business Office Manager, it is my pleasure to be a go-to-person to our residents and family.  I assist in navigating the deep sea of Alabama Medicaid for those who need to transition to long term care. I am thorough in helping to address any issues that may hinder Medicaid eligibility.\n\nSince I have been a member of the team, I have enjoyed working with amazing people.  From the nurses and CNAs, to the adminstration, dietary, and housekeeping, these people work.  We have a CEO who believes in urgency, and you don't find that everywhere.  I have grown professionally, personally, and spiritually in my time at Signature Healthcare of Whitesburg Gardens.  We are here to serve.", "pics": null, "resp": {"time": 1620300568473, "text": "Hello Zerlinda! We’re so happy you joined the Signature family! You are a great team member and we value your dedication and compassion! – Sincerely, Signature HealthCARE"}, "gmap_id": "0x8862133a7685b99d:0x29b04ab624a44d28"}
{"user_id": "107168733576194510942", "name": "Dennis Buck", "time": 1598918154387, "rating": 1.0, "text": "There is no way to give a negative star or I  I would. My mom is a resident there this has to be the worst nursing home in not only the state of Alabama... but possibly anywhere.   As of this post my mom....94 years old....with COPD... congestive heart failure and an A fib pacemaker as a few of her issues was diagnosises Sat 8/29 with COVID 19.  She is luckily finally on her way to the ER as of Monday night about 6 pm.  This is in no thanks to anyone at Whitesburg. The absolute lack of any protocol to make sure someone in her condition is ssen by a PA or doctor is just the tip of the iceberg. During conversation today with the RN of the Covid ward she stated no we can't have her seen by anyone as our process is to give Tylonol if her temp continues to rise. The simple fact that the Covid in this facility is being spread by the staff is the only explanation.  The place has been locked down and no visitors could possibly get in.  The list of issues goes on and on and on.   They will probably remove it but if you want more info, email me at dbuckretired@aol.com.  If you are thinking of this place and can run away....do so...If your family member is a patient here...I will pray for them.....", "pics": null, "resp": {"time": 1598970695722, "text": "Hello Dennis. Thank you for taking the time to review us, and please know that we value your feedback. We are committed to serving our residents and their families with compassion, dedication, and commitment for the utmost safety of all. If you would like to discuss your concerns further, we would like to hear from you.  Please contact our anonymous CAREline at (888) 392-8886 or via www.ltcrevolution.ethicspoint.com. – Sincerely, Signature HealthCARE"}, "gmap_id": "0x8862133a7685b99d:0x29b04ab624a44d28"}
{"user_id": "107350310978093047279", "name": "Barron Stephens", "time": 1544976195979, "rating": 5.0, "text": "My mother in hear at whites burg gardens.   They take very good care of her and are very kind polite and are making her days nice here.  She came in after heart surgery and will be hear for a long time.  I'm glad they are helping us so much.", "pics": null, "resp": {"time": 1545061550899, "text": "Barron, It is our pleasure to serve your mother and your family with joy and compassion. Your feedback is important to us, and please know that we value your experience. - Sincerely, Signature HealthCARE of Whitesburg Gardens"}, "gmap_id": "0x8862133a7685b99d:0x29b04ab624a44d28"}
{"user_id": "115582536298248098705", "name": "frances bulliner", "time": 1598387936287, "rating": 1.0, "text": "Called to find a friend, they give me the wrong number and when asked for the right number they hang up and stop answering", "pics": null, "resp": {"time": 1598392485423, "text": "Hello Frances, we appreciate your concerns and are very sorry to read of your experience. If you would like to discuss this further, please contact our anonymous CAREline at (888) 392-8886 or via www.ltcrevolution.ethicspoint.com. – Sincerely, Signature HealthCARE"}, "gmap_id": "0x8862133a7685b99d:0x29b04ab624a44d28"}
{"user_id": "116798640231196899371", "name": "Sheri Hammond", "time": 1518546767778, "rating": 1.0, "text": "My review is absolutely on nothing at the facility. But I have left numerous emails with my phone number to text or call by email address to email me asking information about your facility. I always get a computer-generated email saying someone will be in touch with me by the next day. I have yet to hear from anyone. I have a mother with Alzheimer's and I need a home for her and I'm actively looking and this is the best fit I think but no one will return any of my messages.", "pics": null, "resp": {"time": 1518615349194, "text": "Sheri, if you would like to comment or directly email us at admission.whitesburg@signaturehealthcarellc.com with the best phone number to reach you, we will be happy to directly contact you. -Sincerely, Signature HealthCARE"}, "gmap_id": "0x8862133a7685b99d:0x29b04ab624a44d28"}
{"user_id": "118084129167267245288", "name": "Kristen Goode", "time": 1566668148234, "rating": 5.0, "text": "My grandfather spent a few weeks at Whitesburg Gardens for rehab after back surgery. We’re more than pleased with how he was treated, the quality of care, and of course bring allowed to bring our vaccinated family dogs to visit.", "pics": null, "resp": {"time": 1566831522785, "text": "Hi Kristen. Thank you for your 5 stars and for taking the time to leave us a review. We are so thrilled to hear your great feedback. - Sincerely, Signature HealthCARE"}, "gmap_id": "0x8862133a7685b99d:0x29b04ab624a44d28"}
{"user_id": "109166703247697517944", "name": "Nakesha Lemons", "time": 1513875144668, "rating": 5.0, "text": "I've had the pleasure of working with these folks for about 8 years and I can't think of a better crew. They are truly my family and I admire how passionate they are about caring for our patients. Loving the Whitesburg family!", "pics": null, "resp": {"time": 1513952264786, "text": "Nakesha, it is a pleasure having you part of the Signature family! Thanks for taking the time to review us! Sincerely - Signature HealthCARE"}, "gmap_id": "0x8862133a7685b99d:0x29b04ab624a44d28"}
{"user_id": "105021770257483513935", "name": "Kurt W", "time": 1440274755140, "rating": 1.0, "text": "My mother was in the facility for about a month in June 2015. The folks in the rehab department seemed earnest in their effort and my mother actually thought they were very nice. The doctor/nursing aspect is a totally different matter that seems to operate on providing the minimal care and effort.  If you have a loved one at this facility, you need to pay attention to the needs of your family member.  When I noticed fungal growth on my mother's hand, I called it out.  The nurse told me that the doctor determined it to be a callous. They then promised they would apply fungal cream. I left on business for two weeks and when I returned, her entire hand was covered is what appeared as crusted skin and had spread to her other hand and face.  Only after I raised it to their attention did they start to address the situation. I mean no one seems to have noticed it before this?   It turned out to be scabies which means that she required isolation and likely infected other in the facility.\n\nThere were a few other matters such as trash on the floor of her room, the fact they couldn't hang up her clothes, and that when they put her on an air mattress, they shoved the other mattress into the bathroom preventing any access to the bathroom.\n\nA few days later, she fell out of bed. Supposedly she slid off of the air mattress.   They sent her to the emergency room for precaution.  Although she sustained no injuries, the hospital kept my mother as she had a bacterial infection causing her white blood count to be extremely high.\n\nThe management staff was nice, and the rehab people seemed genuinely engaged.  Some of the nursing staff were conscientious but to ignore a situation that was clearly out of control and in need of medical attention is inexcusable.", "pics": null, "resp": null, "gmap_id": "0x8862133a7685b99d:0x29b04ab624a44d28"}
{"user_id": "105928342621710920541", "name": "House of Big John", "time": 1437339328140, "rating": 5.0, "text": "They healed my father and then some. He arrived ill from Pneumonia and was helpless, unable to lift his head. (near death to be truthful) In 90 days he walked out of there healed. I observed the staff many times caring for the patients just as I would want to be treated, with love and care. The rehab staff, the nurses and care takers are all seemingly caring people. My dad didn't care for the meals at times but it goes that way when you don't get to pick what you get for dinner. They always tried to accommodate him and have the kitchen make him something different. The director was a professional and put us at ease in our first visit with her. I would recommend it to your family based upon my experience there.", "pics": null, "resp": null, "gmap_id": "0x8862133a7685b99d:0x29b04ab624a44d28"}
{"user_id": "107536991299614423709", "name": "Nancy Ball", "time": 1540348573062, "rating": 1.0, "text": "The CNAs don’t treat the residents with respect.  I heard one tell a resident in a wheelchair to get her big a$$ out of the way.  Several of my relative’s belongings have been stolen and her clothes just disappear.  The place smells awful the majority of the time I’ve visited and they seem to be short staffed on weekends.", "pics": null, "resp": {"time": 1540403808235, "text": "Nancy, Thank you for bringing these issues to our attention. We strive to make our residents our top priority every day and deliver the highest quality of care available.  Our Careline advisors would like to personally talk with you about your experience, will you share with us the best  way to contact you? You can also contact our Signature Careline advisors directly at (888) 392-8886. Sincerely - Signature HealthCARE of Whitesburg Gardens"}, "gmap_id": "0x8862133a7685b99d:0x29b04ab624a44d28"}
{"user_id": "108501600517098168028", "name": "Kelly Wells", "time": 1529913091593, "rating": 1.0, "text": "Never allow a loved one to go here!  I Called 911 to have my Mother rushed to Huntsville Hospital emergency room today.  Doctors found her seriously malnourished with multiple open wounds, serious bacterial infections, urinary tract infection, and infiltration pneumonia.  They are still doing tests.  I was told by a WG staff member that they run out of critical medical supplies on a regular basis because they can’t pay their bills.  Only the Nursing Director has the key to the Supply Closet.  I checked with the State of Alabama and they have Tax Liens as well. The Department of Justice announced on June 8, 2018 that Signature Healthcare defrauded Medicare and Medicaid of $244M and were only able to pay back $30M.  Dr Michael K Johnson is the Medical Director and the only Doctor for 159 residents.  My mother has lived there 5 years and I’ve only seen him in the building once.  He doesn’t show up for rounds and operates his own Medical Practice at another location in addition to being the Medical Director for North Alabama Hospice who the Nursing Hope Recommends to patients who don’t quakify for it!!", "pics": null, "resp": {"time": 1529930782022, "text": "Kelly, Thank you for reaching out.  We have received and responded to the many inquiries you’ve recently sent us.  If there are additional or new concerns, please contact the specific persons at the phone numbers we provided to you.  Our team is happy to personally discuss your experience. Sincerely - Signature HealthCARE of Whitesburg Gardens"}, "gmap_id": "0x8862133a7685b99d:0x29b04ab624a44d28"}
{"user_id": "118031326369940178032", "name": "Michelle Warner", "time": 1520006078001, "rating": 1.0, "text": "Very little empathy from therapy staff.  A pain prescription that came up missing.  My mom was here for a little over a month.  When she passed away,  I got the phone call saying she had \"expired\".  If I had the chance to make the nursing home decision over again,  I would choose a different nursing home.", "pics": null, "resp": {"time": 1520272039237, "text": "Michelle, Thank you for bringing these issues to our attention. We here at Signature take all of your concerns very seriously, and we work hard to serve you. Our patients mean the world to us, and we strive to make them, and their families, a top priority. We would like to personally talk with you more about your family's experience. Please contact one of our Signature Careline advisors at (888) 392-8886.  Sincerely - Signature HealthCARE"}, "gmap_id": "0x8862133a7685b99d:0x29b04ab624a44d28"}
{"user_id": "110725049284886739921", "name": "April Walker", "time": 1520921848642, "rating": 1.0, "text": "Hello. I've worked at your facility in Huntsville Al almost a year. I made complaints on staff such as your DON & administration but to no avail.\nI called the careline & Cassidy disregarded my complaints of being bullyed by Regina Orta & Anita & Carmen.\nI quit my job because of the bullying & I saw that nothing was being done about my complaints, in fact it got worse.\nThey also shorted my checks & changed my hours worked in their computers.\nThis is the worse place to work. They allow Jennifer Dark cna to bully staff also with no recourse. There are many staff that has quit or fired from here that complained to careline & nothing is being done. I want to go to the local news station to bring this out in the open.", "pics": null, "resp": {"time": 1520949807187, "text": "Tina, Thank you for bringing these issues to our attention. We here at Signature take all of your concerns very seriously, and we work hard to serve you. Our stakeholders mean the world to us, and we strive to make you, our stakeholder, a top priority. We would like to personally take with you about your experience. Will you share us the best way to contact you?  Or feel free to call one of our Signature Careline advisors at (888) 392-8886. - Sincerely - Signature HealthCARE"}, "gmap_id": "0x8862133a7685b99d:0x29b04ab624a44d28"}
{"user_id": "104469250935860026619", "name": "Donna Hemley", "time": 1528210530173, "rating": 5.0, "text": "I am proud to work for such a wonderful company!!", "pics": null, "resp": {"time": 1528292921665, "text": "Donna, we are proud to have you on our team and part of the Signature family! Thank you for all that you do to serve our residents and their families. - Sincerely, Signature HealthCARE"}, "gmap_id": "0x8862133a7685b99d:0x29b04ab624a44d28"}
{"user_id": "108371277161552319712", "name": "Lynn Sanders", "time": 1386397067333, "rating": 5.0, "text": "My mother'n law has been in the care of the wonderful staff at Whitesburg  Gardens for the past two weeks.  From day one I have been impressed and amazed at the level of care she has received.  Mary is 90 years old and in very good health.  Up until her fall, on November 7, 2013, she and her 93 year old husband had been living in their home with the help of a care giver who was with them during the day. ( 8 a.m. - 4 p.m. )  On the evening of Nov. 7th Mary fell and broke her pelvis.  Her GP doctor put her on pain meds and sent her home.  We arranged for 24/7 care for her at home, but within a week after her fall she became listless and stopped eating, sleeping and dehydration was setting in.  An ambulance ride to Crestwood Hospital ER was arranged & she was admitted for 3 days/nights of intensive care to bring her pain under control & getting her back to eating and sleeping normally again.  The admitting Dr. recommended The Kindred Transitional Care & Rehabilitation Center quite highly.\n\nFrom the first moment I walked into Whitesburg Gardens until this evening, two weeks later, I have felt completely at peace with our decision to have Mary under the care of the caring folks at this rehabilitation facility.  The atmosphere is so positive, and the entire staff works together as a team so completely, that any worry I might have had when Mary was placed in this rehab center has completely vanished.  I've observed a delightful group of caring people who are truly committed to the rehabilitation & attaining the goal of giving their patients their lives back, no matter what age or disability they have upon their admittance to the facility.\n\nDuring the course of these past two weeks at Whitesburg Gardens, I have had an education in true compassion, a deliciously keen sense of humor expressed by the majority of the staff and a depth of dignity shown to the men and women who are going through a positive rehabilitation while on their journey back to living the lives they want to live.\n\nKudos all around!\n\nI wish to express my sincere thanks to everyone who works at Whitesburg Gardens.\n\nLynn Sanders", "pics": null, "resp": null, "gmap_id": "0x8862133a7685b99d:0x29b04ab624a44d28"}
{"user_id": "104660193972100495136", "name": "James Owen", "time": 1553394265862, "rating": 5.0, "text": "Very\nNice with caring attitude.", "pics": null, "resp": {"time": 1553533494253, "text": "Hi James. Thanks for taking the time to review us. We are thrilled to hear your great feedback! Sincerely - Signature HealthCARE"}, "gmap_id": "0x8862133a7685b99d:0x29b04ab624a44d28"}
{"user_id": "103492801707408597761", "name": "Joan Pender", "time": 1555540109717, "rating": 1.0, "text": "My mother was there for rehab....place was over crowded and smelled bad. Nursing staff was uncaring and reluctant to help...probably overwhelmed by the number of patients. Will not be sending her back to this place for long term care!", "pics": null, "resp": {"time": 1555678658103, "text": "Hi Joan. We appreciate your feedback. The care of our residents remains our top priority – and we are committed to giving the highest quality health care. Please share with us the best way to contact you or please feel free to contact one of our Signature Careline advisors at (888) 392-8886 or via email, cewing@signaturehealthcarellc.com. Sincerely - Signature HealthCARE"}, "gmap_id": "0x8862133a7685b99d:0x29b04ab624a44d28"}
{"user_id": "111513353395978074201", "name": "Calvin Jacobs", "time": 1441776180946, "rating": 5.0, "text": "Great place", "pics": null, "resp": null, "gmap_id": "0x8862133a7685b99d:0x29b04ab624a44d28"}
{"user_id": "100281579676568438818", "name": "Fallon Johnson", "time": 1452014536812, "rating": 5.0, "text": "Great place and staff", "pics": null, "resp": null, "gmap_id": "0x8862133a7685b99d:0x29b04ab624a44d28"}
{"user_id": "108281306633062928021", "name": "Angela Glaze", "time": 1616458033858, "rating": 1.0, "text": "I give one star because you can't post without giving something. I wish I could give some type of notice to close down this facility and relocate the residents that are stuck there... to some this is as close to a death sentence as possible. The best recommendation I can give anyone is to not consider this facility to provide the care for a loved one. Moving my mother to another facility was the best thing we could do for her. Diversicare of Riverchase left much to be desired. The lack of compassion and the poor communication are two of the things they should be known for. Their admin leads most of the group that treat you in a very disrespectful and unprofessional manner. If you disagree with what she has to say she will quickly threaten to write up a 30 day discharge notice for your loved one. They recently upgraded their phone system which gives you false hope of being able to get someone on the phone and have your issues resolved. Most people do not return your calls unless you have to escalate your concern by emailing or calling the number on the website. I will say that there are a couple of staff members that did assist my family, and those ladies are Vicky and Lauren. If you send your loved one here please do not send any belongings that you would not want lost or given to another resident. My mother was sent to Diversicare from a short term facility with notes from her husband (who suddenly passed away while she was in rehab). A staff member hung one of the notes on her wall and at some point it was lost and never located. In addition to a note that they placed on her wall being lost, a note inside of my mothers glasses case was lost, a cell phone was lost twice, phone chargers were lost, numerous pieces of her laundry were lost, a hard back photo book with her name and photo on the cover was lost. We were offered a reimbursement on a cell phone and book but no one ever got back with us to issue reimbursement. The most important thing they lost was MY MOTHER - she was supposed to go to the ER and I called to see which one she went to. The two staff members who had me on speaker phone were disagreeing with one another about if she was sent out or not. One finally said \"I know she went out but I can't tell you where\". 32 minutes later I had to call them back to see if they found where she was. 7 minutes of being hold I was told that she either never was sent out or already returned. No one could clearly tell me what the true story was. For an hour or more they were not even aware that she was in their facility! At one point a photo blanket of my mother with her family was lost and then found and kept in the admins office for weeks. Upon picking up some of our mothers belongings we found dirty laundry with another woman's name in it in a bag with trash, some purses and wallets that were not our mother's, etc. As our mother made it to the new facility we found that the new clothing items we took to her a couple of months prior were not sent with her. We saw our mother at doctor appointments and through zoom calls and she was wearing clothes that were not hers. I would do your loved one a favor and find any other place other than this one to send them to. REMEMBER YOU ARE THE ADVOCATE FOR YOUR LOVED ONE AND YOUR VOICE IS STRONGER THAN SOME OF THE PEOPLE IN THESE CARE FACILITIES. This is only a highlight of the ridiculous things my mother and family endured from late June 2020 through late February 2021.", "pics": null, "resp": null, "gmap_id": "0x88892267c3d3aa39:0xaee638499242526b"}
{"user_id": "109926240699231573256", "name": "Seth Thomas", "time": 1619821072810, "rating": 1.0, "text": "Please do not send your loved one here. I wouldn’t send my worst enemy there. My grandfather passed away here and when we came to see him not one person gave condolences. It was horrible.", "pics": null, "resp": null, "gmap_id": "0x88892267c3d3aa39:0xaee638499242526b"}
{"user_id": "118038310267592722217", "name": "Lee Tibbetts", "time": 1613828035492, "rating": 1.0, "text": "I would never send anyone here.", "pics": null, "resp": null, "gmap_id": "0x88892267c3d3aa39:0xaee638499242526b"}
{"user_id": "106106737714727956036", "name": "Rene Hughs", "time": 1574479928234, "rating": 1.0, "text": "They have left my mother in a wheelchair for 6 hours when she is in pain recovering from surgery. All she wants to do is get in bed. Multiple people have come and went and even though she is asking for help to get in bed and it is  late at night they will not. Do not bring someone you love to this place!", "pics": null, "resp": null, "gmap_id": "0x88892267c3d3aa39:0xaee638499242526b"}
{"user_id": "111316966700881961848", "name": "megan rollins", "time": 1520783617404, "rating": 4.0, "text": "My family and I had a great experience here. They took care of my dad and truly cared about him. The nursing staff was excellent, they knew me by name and cared about how I was doing too. The residents are also great, they are all so kind. I would highly recommend this place to bring your loved one.", "pics": null, "resp": null, "gmap_id": "0x88892267c3d3aa39:0xaee638499242526b"}
{"user_id": "112745678270399080938", "name": "Shannon Cook", "time": 1520366220676, "rating": 5.0, "text": "Facility has greatly improved regarding staffing and quality care. Amazing administrator who is always willing to go the extra mile for his residents. Director of Nursing is wonderful and the new facility Physician and his team of Nurse practioners are a cut above the rest!", "pics": null, "resp": null, "gmap_id": "0x88892267c3d3aa39:0xaee638499242526b"}
{"user_id": "104696738310607939111", "name": "Austin Wimberly", "time": 1578412482538, "rating": 1.0, "text": "The nursing staff is adequate.\n\nThe business office is completely unprofessional.", "pics": null, "resp": null, "gmap_id": "0x88892267c3d3aa39:0xaee638499242526b"}
{"user_id": "103888970146865530217", "name": "Dianna Hodgson", "time": 1561656600042, "rating": 1.0, "text": "Leaving one star because y'all don't take care of your patience. Instead you medicate them. Shame on you.", "pics": null, "resp": null, "gmap_id": "0x88892267c3d3aa39:0xaee638499242526b"}
{"user_id": "101713797732628984736", "name": "R", "time": 1513582850986, "rating": 1.0, "text": "DO NOT SEND YOYR LOVE ONES TO THIS DUMP! UNPROFESSIONAL,  UNCARING, NON RESPONSIVE. CAN'T PROVE EDERLY ABUSE BUT I KNOW THEY DID NOT TREAT MY MOM AND OTHERS WITH THE BEST CARE. RANDOLF DOES NOTHING BUT COVER UP LIES AND DEFEND HIS INCOMPETENT STAFF.", "pics": null, "resp": null, "gmap_id": "0x88892267c3d3aa39:0xaee638499242526b"}
{"user_id": "113195248568375752987", "name": "Amber Mcmillion", "time": 1539281888161, "rating": 1.0, "text": "I WOULD NOT recommend anyone to bring their loved ones here 1 of the worst nursing home it’s filthy they have mold all over the entire building the patients do not get the proper care like their suppose to.", "pics": null, "resp": null, "gmap_id": "0x88892267c3d3aa39:0xaee638499242526b"}
{"user_id": "100781842784472948628", "name": "bliss littlekiss", "time": 1563222899154, "rating": 1.0, "text": "This place forces patients on hospice against their will. Sick place!", "pics": null, "resp": null, "gmap_id": "0x88892267c3d3aa39:0xaee638499242526b"}
{"user_id": "101116539383157238848", "name": "Karla Rugg", "time": 1518985018615, "rating": 5.0, "text": "Had a very good experience with therapy. Nursing was very helpful and Kari from dietary was awesome in helping me with my meals", "pics": null, "resp": null, "gmap_id": "0x88892267c3d3aa39:0xaee638499242526b"}
{"user_id": "102002512559437235153", "name": "Paige Hopper", "time": 1516031630910, "rating": 1.0, "text": "This place is DEPLORABLE and should not be in operation. It's filthy and the staff is highly incompetent. Truly a nightmare!", "pics": null, "resp": null, "gmap_id": "0x88892267c3d3aa39:0xaee638499242526b"}
{"user_id": "110273678179079946315", "name": "K Perez", "time": 1564080225536, "rating": 1.0, "text": "This place has denied civil rights of patient Marian Leonard  and refusing her to have any visitors and forced hospice . This is an outright injustice .", "pics": null, "resp": null, "gmap_id": "0x88892267c3d3aa39:0xaee638499242526b"}
{"user_id": "116747970366806884058", "name": "Glenda Holmes", "time": 1508010657590, "rating": 1.0, "text": "Slow servers  .spend over 45 min waiting for help putting someone in bed .turns off call light then leaves", "pics": null, "resp": null, "gmap_id": "0x88921e03d04bb585:0x662bc6996238d04"}
{"user_id": "103771387919386895988", "name": "Alex Higgins", "time": 1568741037019, "rating": 5.0, "text": "Did a fantastic job with my brother when he was in need of assisted living, friendliness staff and most importantly qualified.", "pics": null, "resp": null, "gmap_id": "0x887d585f3615d74d:0xac97329ec6d917f"}
{"user_id": "108913273528051218386", "name": "Kim Santos", "time": 1573898993545, "rating": 5.0, "text": "Kind people. They do it differently at Burns. The staff treats your loved ones like they matter.", "pics": null, "resp": null, "gmap_id": "0x887d585f3615d74d:0xac97329ec6d917f"}
{"user_id": "104207136923286971244", "name": "Thelma Vick", "time": 1538771287016, "rating": 3.0, "text": "I believe this is a nice place with friendly", "pics": null, "resp": null, "gmap_id": "0x887d585f3615d74d:0xac97329ec6d917f"}
{"user_id": "113188465781455096354", "name": "Shirley Vickery", "time": 1492103229643, "rating": 5.0, "text": "My Mom will be moving in to Regency Pointe in a few weeks and our entire family has been so happy with the experience.  We have been on the waiting list for several months so Stephanie has shown the facility multiple times to different groups of family members always with a smile.\n\nWe visited every available establishment for senior living in the Birmingham area and were about to give up when Mom found her new home.  We look forward to a new beginning for her.", "pics": null, "resp": null, "gmap_id": "0x888a3a36119a8c91:0x5f0e5217e6cdfef1"}
{"user_id": "110136585397199108676", "name": "Derriel Anderson", "time": 1521868085142, "rating": 5.0, "text": "Have been moving tenants in and out since Regency Pointe since it first opened! Gr8 Staff and cleaning crew, and maintenance, Always really cheerfull employees!  ***** star rating!!!", "pics": null, "resp": null, "gmap_id": "0x888a3a36119a8c91:0x5f0e5217e6cdfef1"}
{"user_id": "103689486983816871863", "name": "Jason Morgan", "time": 1483845061538, "rating": 5.0, "text": "This is a real nice place. If you can pay it this is where you want to be in your golden years.", "pics": null, "resp": null, "gmap_id": "0x888a3a36119a8c91:0x5f0e5217e6cdfef1"}
{"user_id": "113559016576709729473", "name": "CARL E. OUTLAW", "time": 1594837088045, "rating": 4.0, "text": "It was a nice place. The staff were very helpful and concerned", "pics": null, "resp": null, "gmap_id": "0x8887c89bdcf3e62d:0x2f9f115e34b8a73f"}
{"user_id": "100316117299975939610", "name": "Kim Graben", "time": 1611942862940, "rating": 5.0, "text": "Wonderful place to work !", "pics": null, "resp": null, "gmap_id": "0x8887c89bdcf3e62d:0x2f9f115e34b8a73f"}
{"user_id": "113998331705551303870", "name": "Latoya Davis", "time": 1607012048525, "rating": 1.0, "text": "Please I would love to give this place zero stars if I can they have have not been giving me my medicine for the last three days and I have been feeling bad lately I'm begging you please send ur family somewhere else you must want them to die and we have covid-19 up here and they will mistreat you up here so please don't send them", "pics": null, "resp": null, "gmap_id": "0x8887c89bdcf3e62d:0x2f9f115e34b8a73f"}
{"user_id": "103373187312895534250", "name": "Stephen Gray", "time": 1596661474916, "rating": 1.0, "text": "Worst experience ever with my mom. They didn't care bout her needs.", "pics": null, "resp": null, "gmap_id": "0x8887c89bdcf3e62d:0x2f9f115e34b8a73f"}
{"user_id": "113118746444123928144", "name": "Kaitlin Cunniff", "time": 1548880370753, "rating": 1.0, "text": "They dont anwser the phone. Never!", "pics": null, "resp": null, "gmap_id": "0x8887c89bdcf3e62d:0x2f9f115e34b8a73f"}
{"user_id": "117420223986954679868", "name": "Joshua Stark", "time": 1561146133750, "rating": 5.0, "text": "Amazing service", "pics": null, "resp": null, "gmap_id": "0x8887c89bdcf3e62d:0x2f9f115e34b8a73f"}
{"user_id": "110730022895683710594", "name": "Marsha", "time": 1619320276015, "rating": 1.0, "text": "I was an employee there. Run..do not walk from this place. If they don't like you for any reason they will blacklist you. I received very unfair treatment from the entire corporation. The administrator hides in her office all day and ignores what's taking place in the facility. No staff, residents not being changed all night   and CNAs that refuse to do their job, but that's ok. Do not put a loved one there if you care anything about them.", "pics": null, "resp": {"time": 1619699049123, "text": "I would like to get some more details about your experience with us. Please contact our Compliance Department at Reachout@genesishcc.com so we can further investigate."}, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "106155001013839517077", "name": "jimmy caradine", "time": 1622227243217, "rating": 1.0, "text": "My wife used to work here they treat their employees like second rate citizens and their residents even worse was the best day of my life when my wife (a CNA) quit after 5 years of miserable employment", "pics": null, "resp": {"time": 1622723573708, "text": "I would like to get some more details about your experience with us. Please contact our Compliance Department at Reachout@genesishcc.com so we can further investigate."}, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "103047225937755520180", "name": "Kelly Grimes", "time": 1615500895296, "rating": 1.0, "text": "Do not send loved ones here. Chronically understaffed. Patients are ignored. No assistance getting out of bed. 12 days no bath even for my Aunt that needed temporary care. She will likely have permanent health problems as a direct result of her care here", "pics": null, "resp": {"time": 1614168188600, "text": "We would like to address the situation you have described. Please contact our Compliance Department at Reachout@genesishcc.com so we can further investigate."}, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "108856367196992770443", "name": "Hali Baskin", "time": 1601235457609, "rating": 1.0, "text": "If I could post negative numbers on this review, I would. The staff here is inattentive and without any desire to care for your relative. My grandmother ultimately died due to lack of care at this facility. She was found passed out in her bed (thought to be dead) from seizures when she had pressed the buzzer.\n\nShe was given a buzzer to press for when she needed help. Often the buzzer would beep for over 30 minutes before someone got to her room. If you love someone, do not send them here. If you want your relative to die-this is the place!", "pics": null, "resp": {"time": 1601257716933, "text": "We would like to address the situation you have described. Please contact our Compliance Department at Reachout@genesishcc.com so we can further investigate."}, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "116836891626906348528", "name": "shan b", "time": 1606156328033, "rating": 1.0, "text": "My dad is currently a resident.  I really believe that the constant isolation from the constant lockdowns over the Covid-19 virus are contributing to the progression of dementia.  I’m sorry but this place is horrible and their management is beyond reproach. There are certain staff members that care, but as a whole they could care less about the well being of their residents.  Facility is mostly dingy and the smell usually wreaks of waste. I wish so much that I had a better option for the last days of his life. 😒", "pics": null, "resp": {"time": 1606655986578, "text": "Thank you for bringing this matter to our attention. We will use this as an opportunity to improve. Please contact our Compliance Department at Reachout@genesishcc.com so we can further investigate."}, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "100823483177462791653", "name": "MSH3 Hoff", "time": 1576976201601, "rating": 3.0, "text": "My father is a short-term resident here for post-operative rehabilitation services in their rehab center and while the staff is very friendly and for the most part attentive to his needs when he calls, they seem to have a major problem with their plumbing. The toilet in his bathroom stays clogged constantly and is full of feces and is not cleaned daily, as it should be. I myself have cleaned it twice and unclogged it once, but that was several days ago and it is clogged and in an absolutely disgusting condition. This is a health hazard, not to mention the stench of human waste. This is unacceptable and needs to be dealt with pronto.", "pics": null, "resp": {"time": 1577717087820, "text": "Thank you for taking the time to leave us feedback about your experience with us. Please contact our Compliance Department at Reachout@genesishcc.com so we can further investigate."}, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "115280977418623998777", "name": "Holly Fryar", "time": 1579474196539, "rating": 1.0, "text": "The facility is filthy. Building is old and in need of major renovation. Level of professionalism and organization is unacceptable. My dad was at Lakeshore for 20 days and was progressing after a stroke. He went to Magnolia for additional therapy and regressed. Would not recommend!", "pics": null, "resp": {"time": 1579529193334, "text": "I would like to get some more details about your experience with us. Please contact our Compliance Department at Reachout@genesishcc.com so we can further investigate."}, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "115676073525655490808", "name": "Julie Ritchey Miles", "time": 1566283341906, "rating": 3.0, "text": "I liked it but there is not enough gel for the patients there. The meals are not well planed. For diabetic and the patients wait a while . I think it could be cleaned but a very busy lace .I would do checks every hour and have more help.Good I would get a chef as much as they pay. Nice help matters .Some yes.", "pics": null, "resp": {"time": 1566307797802, "text": "Hello Julie Ritchey Miles, we appreciate you taking the time to leave us this feedback."}, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "107532281106470587621", "name": "Alyssa H", "time": 1558979168880, "rating": 1.0, "text": "Terrible place!  Do not let your family go here!  They do not change their clothes/sheets and will leave the patients sitting in urine all day long.  The therapy is a joke.  I cringe at the thought of what my loved one went through here because we thought it was a good facility.", "pics": null, "resp": null, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "102341606915896174033", "name": "Alethea Thomas Thomas", "time": 1537462268022, "rating": 5.0, "text": "I don't know why happy patients don't give reviews, but this is the best nursing home in Jefferson county. The staff is friendly, the place is clean today and the patients are happy. My mother is glowing with excitement. Thank you for doing a great job.", "pics": null, "resp": null, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "118187556843519478827", "name": "Stephanie Childers", "time": 1606768350145, "rating": 1.0, "text": "This place is a absolute disgrace.", "pics": null, "resp": {"time": 1606915649700, "text": "I would like to get some more details about your experience with us. Please contact our Compliance Department at Reachout@genesishcc.com so we can further investigate."}, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "108322651987158498558", "name": "Jeannie Cheatwood", "time": 1569353427795, "rating": 5.0, "text": "I haven't been working here long, but I absolutely love it!!! This is by far one of the best places I have worked!!!!!", "pics": null, "resp": {"time": 1569363028630, "text": "Hello Jeannie Cheatwood, thank you; we appreciate your feedback!"}, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "101359773182912386989", "name": "Amanda Harless", "time": 1571530372800, "rating": 3.0, "text": "My grandmother has been here almost two years her clothes have been stolen and$100 dollars was stolen from me while I was cleaning my grandmother in the bathroom. The administrator Tom laughed at me when I reported it. He asked me if anyone in the facility could say that I had $100 in my wallet! Why would I tell anyone that. It’s been months since my last review. I love the nurses that take care of my granny, no mistakes about that. The clothes that were “lost” she has been reimbursed for. The $100 that was taken from my purse has never been resolved and probably never will be.", "pics": null, "resp": {"time": 1571579715926, "text": "Amanda Harless, thank you for your feedback."}, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "114091223975608073962", "name": "Wilbert Kelley", "time": 1569716699779, "rating": 1.0, "text": "The morning staff was excellent, but that evening shift was rude, and didnt seem to care. I had problems with a nurse name Ed or Eddie, and a Tammy. They were very unprofessional.", "pics": null, "resp": {"time": 1569762327348, "text": "Thank you for taking the time to let us know about your recent experience. We are disappointed to hear that you are not satisfied with your visit. Please contact our Compliance Department at Reachout@genesishcc.com so we can further investigate."}, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "117378815586547605264", "name": "Amiah Morgan", "time": 1569003665096, "rating": 1.0, "text": "The morning shift is wonderful, but the evening shift with Tammy Wilcox is just lazy and Just Have nasty attitudes. This facilities is very outdated, just need renovated", "pics": null, "resp": {"time": 1569875760803, "text": "I would like to get some more details about your experience with us. Please contact our Compliance Department at Reachout@genesishcc.com so we can further investigate."}, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "103039976318859264374", "name": "Shelly Sutherland", "time": 1508262134336, "rating": 4.0, "text": "My godmother is there her name is Bonnie Moore and she is very pleased with this nursing home and the staff is wonderful and she's starting rehabilitation and they have been amazing. Thanks to all staff and nurses for your kindness.", "pics": null, "resp": null, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "117605915137919942132", "name": "Michelle Johnson", "time": 1503375124707, "rating": 1.0, "text": "Horrible facility......my mother nearly died from lack of medical care from the nursing staff. I filed a report with the state and filed a police report naming two nurses from that facility.\nIf you love your family member- do not put them there.", "pics": null, "resp": null, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "100313739578693862022", "name": "Jennifer Russell", "time": 1534957934114, "rating": 1.0, "text": "Supposed to had been in rehab to get stronger and wound care. Negative wound is worst . Never got sleep, always had an old drink by his bed. They never would let me look at his wound. On top.of didn't give him all his correct meds.....", "pics": null, "resp": null, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "114223814775376485994", "name": "Nicole Morgan", "time": 1569075568690, "rating": 1.0, "text": "The morning staff is excellent, when it comes to the night shift, they are sorry with nasty attitudes. I hope if your family comes here, you never have Eddie or a woman name Tammy.", "pics": null, "resp": {"time": 1569278578229, "text": "I would like to get some more details about your experience with us. Please contact our Compliance Department at Reachout@genesishcc.com so we can further investigate."}, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "101971699341796154328", "name": "Danielle Bourque", "time": 1496801517823, "rating": 1.0, "text": "Horrible place! The night shift more than the day shift, my mother in law is staying due to a broke hip, I went to ask some of the staff members a question and it was like it pained them to get off their cellphones and give me eye contact and smile, one never even turned around and keep her back toward me. It breaks my heart to see how badly the residents are treated and how run down and disgusting the facility is.", "pics": null, "resp": null, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "102245494479718607453", "name": "O. Shanta", "time": 1507046731878, "rating": 1.0, "text": "I chose this place for my mom because the pictures looked pretty and cleaned, plus the offered rehabilitation. My lack of knowledge caused my mother a lot of neglect and humiliation. There is a ton I could say but I’m going to narrow it down to four:\n1. My mom called me one day around 730pm and stated she had been calling for someone to come change her diaper since 3:30pm.\n2. My mom suffers from CHF and needs a low sodium diet. Whatever she would chose from her REGULAR menu to eat, the kitchen would send her whatever they wanted her to have. Usually something processed and high in salt. Now my mother retains fluid very badly.\n3. After seeing other areas of neglect, I researched better facilities and put in to transfer my mother. I put the request in, in person on a Thursday morning. I came back Friday afternoon and it had not been send. I checked on it Monday evening it was finally sent. Then there was the transportation issue, the family pays, WHAT no one told me. Well Magnolia social services didn’t help me, nor did they offer guidance or contact numbers. So I called the transfer NEW facility and admissions said “we will take care of this for you and we will get you the lowest price possible, we will try to make this transition smooth”. About 15 Min later I was set with transportation.\n4. They are always short staff, once my mother had a very bad case of heart burn. She pushed her button for help, a hour later mom called me and I called the nurses  desk. The supervisor came, took her BP, said she will be back with some tums. An hour later Mom pushed the button. No one came. She called me, I called the desk, the new shift nurse said the supervisor WENT HOME! So I got dress and went to the store and drove from the South side to Gardendale to take mom some heartburn meds.\n\nWhen you enter Magnolia Ridge the smell of OLD urine and bowels will meet you at the door and it lingers in the hallways. Whenever I leave the building that smell is stuck to my clothes.\n\nIf you put your love ones in this facility “YOU BETTA CHECK ON THEM DAILY”", "pics": null, "resp": null, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "110792846252800472606", "name": "Dick Brown", "time": 1491590512353, "rating": 4.0, "text": "Did a good job for my brother-in-law.", "pics": null, "resp": null, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "114578353128762266815", "name": "Sharon Teer", "time": 1560775747970, "rating": 1.0, "text": "DON'T, just don't!  For elderly care or rehabilitation!", "pics": null, "resp": null, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "116384818994464040034", "name": "Lajuan Earl", "time": 1474376880261, "rating": 1.0, "text": "Disgusting! Would not recommend needs to be close down does not take care of patients and do not take to the doctor when needed", "pics": null, "resp": null, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "111330106677486073170", "name": "papa Millwood", "time": 1482536912826, "rating": 2.0, "text": "My MawMaw there and I don't think it's good for a dog but my granny want leave", "pics": null, "resp": null, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "111969034020268513267", "name": "Doreen Williams", "time": 1441110627155, "rating": 5.0, "text": "Great  place to work", "pics": null, "resp": null, "gmap_id": "0x8889043c16246da9:0x49264155c51aeb0"}
{"user_id": "116327062689188864275", "name": "Michael Schmidt", "time": 1599773722306, "rating": 5.0, "text": "My Mom was a resident of memory care at The Blake for several years before her passing  in July 2020. Though initially it was tough transitioning her from her home to a care facility (she was a strong-willed even WITH  dementia!), she adjusted thanks to the love and care she received. I never regretted my decision. Kudos the Director John Michael, the management team and the entire group of caregivers. I never worried about Mom's safety or well-being while she lived at The Blake. Thank you for making her part of the family and for my peace-of-mind!", "pics": null, "resp": {"time": 1600102521159, "text": "Michael, thank you so much for leaving this wonderful review and sharing your experience with our community. It was such an honor and privilege to have your mother as one of our residents and as part of the family here. We will pass along your kind words to our team, and always feel free to reach out if you need anything in the future. Take care!"}, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
{"user_id": "112982996826709383060", "name": "Claudia Daniel", "time": 1599875148108, "rating": 5.0, "text": "Our mom arrived at the Blake at Malbis pretty much kicking and screaming. Much different story now, she is happy,  calm,  and grateful that she doesn’t have to worry about her house upkeep anymore.\nHer major adjustment took about 3 to 4 weeks.\nJohn Micheal, the executive director is almost always able to talk when I have a question, so is the rest of the staff, they have all been so helpful and kind.\nBonnie and the other ladies who answer the phone are knowledgeable, helpful and friendly.\nThe nursing staff are the best by far, I consider them like friends and so does my wonderful mom.\nMom loves the food and keeps saying her pants are to tight now!\nThe activities director, Petra, always has something going on, right now she is putting together a grandparents day treat for the residents.\nJohn Michael has kept the family current with all updates about the COVID-19. The Blake is very cautious about opening up to soon, for this I’m extremely grateful. It’s a horrible way for any loved one to pass. They have in my opinion gone out of there way to try ways for us to see our mom.\nI chose The Blake for our mom 1 year ago because it felt like a home when I went on my first tour. My opinion has not changed.\nWe dreaded putting mom in a home, but we have been so happy, and so has she, because she is in a place that is like a home.", "pics": null, "resp": {"time": 1600103346861, "text": "Thank you so much for sharing your experience with our community, Claudia! Your mother is a joy to have as our resident and we most certainly appreciate your involvement as well. We're always striving to provide the best care possible for our residents and reviews like this are so great to see. We will definitely be passing along your kind words to our team."}, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
{"user_id": "105070145967308205286", "name": "Jason Smith", "time": 1623080173053, "rating": 1.0, "text": "Our family had a terrible experience. I find the facility unfit to care for the elderly.", "pics": null, "resp": {"time": 1623170896413, "text": "Hi Jason,\nWe want to take the chance to apologize for the negative experience you've had with our community. We'd really like to know more about your situation in order for us to improve. Please reach out to  Executive Director, Tammy Robinson, at tammy.robinson@blakeliving.com to discuss matters further."}, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
{"user_id": "104722835199709268956", "name": "Janet Norman", "time": 1602096283857, "rating": 5.0, "text": "My mom suffered from dementia and short term memory loss and I tried having her live with me.  It was clear I could not provide her the care she needed.  The staff at The Blake - Malbis (memory care) loved and cared for my mother like I never expected.  Mom went on outings, participated in activities.  I visited her all times of the day throughout the week and found her well cared for and engaged in activities.  Turning over your parent to others for care is a very difficult decision but at The Blake - Malbis she was under the best care you could ask for.  The staff made a very difficult situation much easier for me and my brother.  Mom was better looked after than I was capable of doing.  Thank you everybody, especially John, Petra, and Rachel.", "pics": null, "resp": {"time": 1602164653137, "text": "Janet, we really appreciate you leaving this thoughtful review on our community. It truly means a lot to us, and we'll make sure to pass your review on for our staff to see. Taking the best possible care of our residents and offering support to family members are our top priorities, and reviews like yours reassure us we're on the correct path."}, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
{"user_id": "102410317476924001484", "name": "Rhonda Winder", "time": 1606874516652, "rating": 1.0, "text": "While our family has an overall great impression with The Blake at Malbis, we do have an experience with them that isn’t so great. They can very easily rectify matters, but so far they refuse to do so. It has to do with the beauty salon.\nIf you’re loved one wishes to get their hair done they may make use of the in-house salon. There is a form that the person responsible to pay the salon charges fills out. You may leave a credit card on file and you may opt to just have your card used whenever the resident wishes or be asked if you’re in agreement with your family member having their hair done before being charged. This is so that a family member who is losing their mental acuity doesn’t decide to go get their hair done too often, which was our situation, and we stipulated on the form that we’d like to be contacted first.\nHowever, our card was charged several times with no permission request beforehand. To the tune of approximately $500.00. With our busy life we didn’t catch these charges as they were incurred. Once we did see them, we called and got them stopped.  To their credit, The Blake admitted they were in the wrong. However, it has been over a year of requesting the fraudulent charges be reversed or having a check sent to us. We’ve been in touch with the beauty salon, patient representatives, the facility manager and a regional manager. We’ve allowed each person along the way ample time to make it right, sometimes two months before we call again, but no resolution is ever forthcoming. Now, they’ve stopped taking our calls.\nWe will now pursue this with our credit card company.\nOur family member passed away in May of 2020, so they are no longer a resident. I would hate to think that is the reason we now are not even getting our phone calls answered.\nIf you’re wondering why our family member passed away, it was due to the virus. We were told she was the only one in the whole facility to contract it. A subsequent email from The Blake that was emailed to families of the residents claimed to have zero cases of the virus at The Blake.\nI suppose no place can be 100% above board at all times, but these things concern us.\nPlease don’t misunderstand us. We realize the virus is strange and can effect some and not others. We have no ill feelings in that regard. These things happen. But we would love to be treated as well as we were when she was accepted there.\nWe have no other complaints. The facility was a beautiful and very nice place for seniors.", "pics": null, "resp": {"time": 1607627659872, "text": "Hi Rhonda,\nFirst and foremost, we want to apologize that you've had this unpleasant experience. During this unprecedented time, we have made, and continue to make, it a priority to keep our residents and families as up-to-date as possible with the most accurate and timely information available to us. Additionally, we strive to partner with the best service providers in order to give our residents the highest quality services and amenities possible. We understand you have had a frustrating experience working with our previous stylist provider and we are currently working hard to reach a solution for you. We are grateful to have had the opportunity to care for your mother and we want to thank you for your trust and kind words regarding the care she received as a resident here at The Blake."}, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
{"user_id": "102541788083236430707", "name": "D Joiner", "time": 1601219044267, "rating": 1.0, "text": "I have never written an online review, but the experience we had with this facility warrants my remarks. My mother was a Memory Care resident for 2 months 25 days before removing her from this facility.  Once home she was examined by our physician along with labs received from the Blake.  She had lost approximately 20 lbs, was poorly nourished (per lab work), had a large pressure ulcer on hip (never reported by staff), cellulitis in lower extremity (never reported by staff or wasn’t being treated).  She walked in on admission and was wheelchair bound upon leaving. As I said that is the SHORT LIST of issues we had with this facility.  Don’t be fooled by the\n“nice facility or friendly staff”.  My mother was neglected physically and medically.  I am not just a disgruntled daughter. I worked in critical care for years, served as nurse manager of a critical care unit and a cardiology outpatient clinic.  I know poor care when I see it!!!", "pics": null, "resp": {"time": 1601312298132, "text": "Hi D,\nWe apologize that you’ve had a negative experience with our community. At The Blake, we're committed to offering the best care possible for residents, as well as support for family members. Although it’s never easy to receive reviews like these, we take them very seriously and we'd like to resolve any issues you've had with our level of care. If you'd like to discuss these matters further, please contact our Executive Director, John Michael, at john.michael@blakeliving.com."}, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
{"user_id": "100806825528281228885", "name": "Sam Adams", "time": 1595970680052, "rating": 4.0, "text": "Our only problem with The Blake, is information, few of the staff will give out info. In particular our Dad,(93 yrs.) was admitted during covid 19 and quarantined until negative test result, we were told 2 days to get result, after 5 days we questioned why no result, after a full fay and multiple calls we were then told 3 days in quarantine before test is even performed. Not veryhvery", "pics": null, "resp": {"time": 1599084003454, "text": "Hello Sam,\nWe sincerely apologize for your frustrating experience; we know how stressful a delay in receiving information can be, especially in times like these. Also we want to thank you for your support and patience as we navigate through these unprecedented challenges.  We would like to reach out to see how can better improve this process, so this isn't repeated in the future. Please contact us at (251) 625-6400, so we can discuss this matter further."}, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
{"user_id": "103983899574838410635", "name": "Brad Hinman", "time": 1580843704061, "rating": 5.0, "text": "My Mom has been in several assisted living facilities over the years and this is the best! Highly recommend...", "pics": null, "resp": null, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
{"user_id": "111806280179011817404", "name": "Susan Holmes", "time": 1555170187913, "rating": 1.0, "text": "My Dad lasted a total of 45 hours in their Memory Care facility. During that time he fell 3 times. They said he was physically aggressive and called an ambulance to take him to the hospital. They only way we knew this was - the hospital called for information.  If he became angry, and he might have, it was because he was scared!  However, 2 hours later when the ambulance did arrive, he was asleep in his chair.  He is now in the hospital with pneumonia.  These residents are not safe! Oh! ...and I had left him a gift bag with a variety of items the first day.  We never found it!", "pics": null, "resp": {"time": 1556119173510, "text": "Hello Susan-\nWe would like to sincerely apologize for your experience at our beloved community. As resident care and employee support are our top priorities at the Blake, we take these comments very seriously. John Michael, our Executive Director, would love to speak with you further about your experience. Please call (251) 625-6400 to reach him. Again we appreciate your comments and apologize for the negative experience."}, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
{"user_id": "104444656726440711552", "name": "Natalie Davis", "time": 1501201684152, "rating": 5.0, "text": "Prior to working at The Blake, I worked WITH The Blake. They truly care about the residents and their families. It is a beautiful community, the food is great, and it is a fun place to be. I would most definitely place my family here when the time comes.", "pics": null, "resp": null, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
{"user_id": "108986922367231436901", "name": "Jerre Brisky", "time": 1495836065540, "rating": 5.0, "text": "Wonderful and gorgeous facility.", "pics": null, "resp": null, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
{"user_id": "100097772095906838392", "name": "Crooked Smile", "time": 1462549050499, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
