{"user_id": "112793222818725942027", "name": "Sherry Dodgen", "time": 1612912758832, "rating": 5.0, "text": "I love going to Covington Health Care for my health needs. Sarah and her staff are extremely knowledgeable and professional, and I  always feel better after I go there. Sarah is very thorough and she goes above and beyond what is necessary to take care of her patients. Had I not listened to her insistence on getting a preventive screening, I may not be here today!!! I trust her completely and would definitely recommend going to Covington Healthcare if you are in need of health services.👍👍👍👍👍", "pics": null, "resp": null, "gmap_id": "0x888c47515b1aecf9:0x96b20205ebdb91b6"}
{"user_id": "112731154795313433199", "name": "Kami Kam", "time": 1603480190008, "rating": 1.0, "text": "One word to describe this nurse practitioner....RUDE.....Covington Healthcare will no longer service me or my family for anything. I’m not going to go into details but when I say this lady is RUDE Lord Father please help her attitude. When a physician hangs the phone up on you just because you didn’t agree with her it’s time to find another physician with little bit more respect and compassion. She’s Rude and very unprofessional. Just wanted to let you know without  patients there would be no Covington Healthcare please remember that. Learn to appreciate and listen to your patients regardless if you feel like you are right or wrong.", "pics": null, "resp": null, "gmap_id": "0x888c47515b1aecf9:0x96b20205ebdb91b6"}
{"user_id": "118032162857200978283", "name": "Kayla Lynn", "time": 1565120055981, "rating": 5.0, "text": "Sarah was absolutely wonderful! She was extremely thorough and informative. She treated our daughter with kindness during her immunizations. She’s very knowledgeable and walked us through everything we needed to know and then some. We drove from Montgomery to receive her care, the best around hands down! I highly recommend her healthcare services!!", "pics": null, "resp": null, "gmap_id": "0x888c47515b1aecf9:0x96b20205ebdb91b6"}
{"user_id": "104427950447642653466", "name": "Bambi Thornell", "time": 1591198162146, "rating": 1.0, "text": "I have always been pleased with Sarah and her services but my husband ran out of his medicine in April.   He called to get them refilled.  Sarah was not there so they set him up a teladoc appt with another  NP  just to get the medicine called into the drug store.  He had just seen Sarah in October. They charged $120.00 just to get his medicine.  I called to ask about this and was hung up on 2 times.  I was told not to come back.  I was not trying to get out of paying , I just think $120.00 is a little  too much for a call to the drug store.", "pics": null, "resp": {"time": 1603479749231, "text": "Telemedicine visits are  billable. Call your insurance company to get an explanation when they don’t pay. After many thousands of dollars in tuition and continuing education, it is right to be able to charge for those services   This is  consistent with acceptable practices nationwide"}, "gmap_id": "0x888c47515b1aecf9:0x96b20205ebdb91b6"}
{"user_id": "105089122896465389335", "name": "Wendy Madison", "time": 1577799182897, "rating": 5.0, "text": "Sarah was nice and professional. Gave me a thorough exam and I would recommend her highly.", "pics": null, "resp": null, "gmap_id": "0x888c47515b1aecf9:0x96b20205ebdb91b6"}
{"user_id": "115591342504882939001", "name": "Erika Carlton", "time": 1573281122689, "rating": 5.0, "text": "I’ve known, worked with, and trusted Sarah Covington for over a decade as an RN, a college, and now, by choice, as my personal Primary Care Nurse Practitioner. She is one of the most intelligent, dedicated, compassionate, hard working, and honest women in the field of Family Medicine. Sarah’s leadership skills show her daily devotion to the sound well-being of every life she encounters. I highly recommend Sarah Covington, CRNP, to manage the healthcare needs for newborns to the elderly population.", "pics": null, "resp": null, "gmap_id": "0x888c47515b1aecf9:0x96b20205ebdb91b6"}
{"user_id": "110619712653187196984", "name": "lilquez 08", "time": 1604740703514, "rating": 1.0, "text": "Sarah is so RUDE!and i mean RUDE and unprofessional,with a nasty attitude i have never in my life seen a Dr. Who act like her.Just know my family will never go back to Covington Healthcare!!!", "pics": null, "resp": null, "gmap_id": "0x888c47515b1aecf9:0x96b20205ebdb91b6"}
{"user_id": "101124469375526003683", "name": "Pat Mason", "time": 1550069658514, "rating": 5.0, "text": "Super nice doctor. Mrs Covington is very caring. She will be informative and up front. She truly cares for her customers.", "pics": null, "resp": null, "gmap_id": "0x888c47515b1aecf9:0x96b20205ebdb91b6"}
{"user_id": "111839706074637186693", "name": "Shannon Huey", "time": 1597355722587, "rating": 1.0, "text": "RUDE, RUDE, and RUDE\nStaff and DR.\nHung up in my face twice\nMom find you another Dr.", "pics": null, "resp": {"time": 1597359804757, "text": "we can not discuss private medical information with anyone other than the patient per HIPPA. we also can not give out medical advice to anyone other than patients who are checked in for an office visit."}, "gmap_id": "0x888c47515b1aecf9:0x96b20205ebdb91b6"}
{"user_id": "108460060233549213030", "name": "Scottie Johnson", "time": 1557769867328, "rating": 5.0, "text": "She is very thoughtful and gets your diagnosis correct or she sends you to someone who can", "pics": null, "resp": null, "gmap_id": "0x888c47515b1aecf9:0x96b20205ebdb91b6"}
{"user_id": "101652365912006314466", "name": "Erin Allen", "time": 1546044723188, "rating": 5.0, "text": "Sara is always understanding in any situation I've come to her about.", "pics": null, "resp": null, "gmap_id": "0x888c47515b1aecf9:0x96b20205ebdb91b6"}
{"user_id": "108563334280370805737", "name": "Meagan Harper", "time": 1464103840777, "rating": 5.0, "text": "Very thorough, and always caring. I feel like I am in very good hands here. ☺️", "pics": null, "resp": null, "gmap_id": "0x888c47515b1aecf9:0x96b20205ebdb91b6"}
{"user_id": "103739710930482313442", "name": "kenneth smith", "time": 1559148386357, "rating": 5.0, "text": "Very good  person to see. Really takes care of you each time you see her", "pics": null, "resp": null, "gmap_id": "0x888c47515b1aecf9:0x96b20205ebdb91b6"}
{"user_id": "114865175091870787617", "name": "Tucker Andrews", "time": 1609269650910, "rating": 5.0, "text": "She is a straight shooter.", "pics": null, "resp": null, "gmap_id": "0x888c47515b1aecf9:0x96b20205ebdb91b6"}
{"user_id": "109003254354322790174", "name": "Marie Arledge", "time": 1564957574294, "rating": 2.0, "text": "Being personally attacked when at your weakest is a crushing feeling.  I hope you never have to endure that.", "pics": null, "resp": null, "gmap_id": "0x888c47515b1aecf9:0x96b20205ebdb91b6"}
{"user_id": "105182925934912646290", "name": "Lance Price", "time": 1540495011104, "rating": 5.0, "text": "She is a very caring person and very professional", "pics": null, "resp": null, "gmap_id": "0x888c47515b1aecf9:0x96b20205ebdb91b6"}
{"user_id": "101912030228486808300", "name": "Jennifer Knighten", "time": 1564229799196, "rating": 5.0, "text": "Love Sarah Covington she is wonderful!!!", "pics": null, "resp": null, "gmap_id": "0x888c47515b1aecf9:0x96b20205ebdb91b6"}
{"user_id": "108814049311146077405", "name": "John Emfinger", "time": 1476424223756, "rating": 5.0, "text": "Thanks for the total care I received from Covington Healthcare  LLC They show they really care.", "pics": null, "resp": null, "gmap_id": "0x888c47515b1aecf9:0x96b20205ebdb91b6"}
{"user_id": "100221770333707417079", "name": "Jane Boston", "time": 1546033289733, "rating": 5.0, "text": "She cares about her patients", "pics": null, "resp": null, "gmap_id": "0x888c47515b1aecf9:0x96b20205ebdb91b6"}
{"user_id": "105429570858358896295", "name": "Rachelle Wallace", "time": 1530636754076, "rating": 5.0, "text": "Sarah is great!", "pics": null, "resp": null, "gmap_id": "0x888c47515b1aecf9:0x96b20205ebdb91b6"}
{"user_id": "108545534723765709713", "name": "John Battle", "time": 1553268206628, "rating": 5.0, "text": "Great patient care!!!!!", "pics": null, "resp": null, "gmap_id": "0x888c47515b1aecf9:0x96b20205ebdb91b6"}
{"user_id": "106073376918358131648", "name": "Shawna Monroe", "time": 1615503741041, "rating": 5.0, "text": "Absolutely one of my favorite medical providers. Very personable and good at putting patients at ease.", "pics": null, "resp": null, "gmap_id": "0x88891764f9d434ed:0x1efe70a21743a93d"}
{"user_id": "116035373219233615828", "name": "Wendy Kang", "time": 1614794185865, "rating": 1.0, "text": "If I could give a zero I would. Her staff is very incompetent, doesn’t respond to voicemails", "pics": null, "resp": null, "gmap_id": "0x88891764f9d434ed:0x1efe70a21743a93d"}
{"user_id": "106638130328378300030", "name": "LeeAnne", "time": 1565714985344, "rating": 5.0, "text": "I moved back to Birmingham after being out of the country for years, unfortunately I didn’t have health insurance for almost a year. While not having insurance I found myself in the hospital several time and treated for various illnesses. Finally getting insurance I had several conditions that needed Attention now, after being blown off by one specialist, telling me my condition was not IMPORTANT NOW... I ended up back in the ER ...Brookwood because I felt uab were just treating emergency conditions with me...and not looking for what was connecting all my medical problems... I was given a list of providers and was told to get a primary doctor and make an appointment with a surgeon...before I could go home after my er visit Brookwood already had an appointment with a surgeon in three weeks.... I couldn’t wait three weeks, but was impressed they followed up with making the appointment so fast...I called every dr on the list but no one had an opening less than a month away...so I decided to call Brandi Carboni office...    I am truly blessed to have found her, one look at me and she sent me to HER surgeon..( her words were you can’t wait three weeks, you need a surgeon now).... not only got me I to see the surgeon in a few days but had three other dr offices call me in less than 24 hours making appointments for the other specialist I needed. She is so personable and truly interested and cares about her patients, even took my blood herself!!! My husband is going to use her as well!!!! It’s so refreshing to be listened to, and treated like a person and not a number!!! I am convinced that I will be using her as my primary dr from now on! Staff is wonderful too.... not hard to get an appointment...no over crowded waiting rooms.... you’re not rushed in and out so they can see the next person.... Her and her staff deserve more than five stars!!! .I’ve had a history of medical problems all my life, countless drs and hospital last , here in the USA and overseas ... Brandi is far superior than anyone with the letters “dr” or “md” in their name!!! Btw the her surgeon diagnosed me and apologized for the previous doctors when saying my case wasn’t IMPORTANT... make a long story short I not only needed a surgeon but a plastic surgeon as well and the both will be preforming surgery on me (2 teams) at the same time to repair a hernia that reopened..my surgeon words were the same as Brandi saying this condition can not wait much longer...there are good and bad drs everywhere, it’s important that you always feel comfortable ... For the first time in fifty years I feel comfortable with my health team!!!!!", "pics": null, "resp": null, "gmap_id": "0x88891764f9d434ed:0x1efe70a21743a93d"}
{"user_id": "101713998918647989795", "name": "jami elmore", "time": 1518538988680, "rating": 5.0, "text": "I love Brandi, she listens too me, always takes her time and explains things. I'm so thankful I found her!! ❤️", "pics": null, "resp": null, "gmap_id": "0x88891764f9d434ed:0x1efe70a21743a93d"}
{"user_id": "103177174469667652131", "name": "Josh W", "time": 1492705110981, "rating": 5.0, "text": "Brandi Carbonie is awesome. She's straight forward and seems like she actually cares about her patients.", "pics": null, "resp": null, "gmap_id": "0x88891764f9d434ed:0x1efe70a21743a93d"}
{"user_id": "114065555788065928522", "name": "Sharon Jarrette", "time": 1453223757518, "rating": 1.0, "text": "She was very rude as where her staff.  I  felt very unwelcome and i wont go back  Dr. Morris has no bed side manner  very cold person!  She was like a robot.  I have told several people who were looking for a Dr. not to go to her!!!!", "pics": null, "resp": null, "gmap_id": "0x88891764f9d434ed:0x1efe70a21743a93d"}
{"user_id": "109913725345250759996", "name": "Jayson Shafer", "time": 1626980396946, "rating": 5.0, "text": "The Dr. spent a good bit of time with Talking to me about my options.  I’m a very complicated cervical  injury patient  I  do everything possible to you take care of myself.  I believe  Dr Durkin Could understand that even in our first visit. I appreciate his straightforward approach.", "pics": null, "resp": null, "gmap_id": "0x889a4d5273d59c2f:0x4b3af33deb61879a"}
{"user_id": "105763913489809834966", "name": "Starr Whittington", "time": 1622051632280, "rating": 5.0, "text": "These people are awesome!! Dr. Walker and her associates are So devoted to their patients . When I started going to them I could barely walk but now with their devoted experience I'm walking . This facility is unique.  I would recommend these drs to anyone that really wants to get better and have less pain.", "pics": null, "resp": null, "gmap_id": "0x889a4d5273d59c2f:0x4b3af33deb61879a"}
{"user_id": "115029665043058754423", "name": "Charles Osborne", "time": 1627540573972, "rating": 5.0, "text": "Very informative on my consultation visit to know what my treatment will intel", "pics": null, "resp": null, "gmap_id": "0x889a4d5273d59c2f:0x4b3af33deb61879a"}
{"user_id": "112084012349861972776", "name": "buddy james", "time": 1622058419844, "rating": 5.0, "text": "Being my first experience  at Dynamic pain and wellness , I was very much Impressed with everyone and how polite and respectful  they were. The Doctor seemed very much concerned with my diagnosis  and scheduling me for immediate future care . I feel that I have made the right choice by coming to Dynamic I thank you very much.", "pics": null, "resp": null, "gmap_id": "0x889a4d5273d59c2f:0x4b3af33deb61879a"}
{"user_id": "110846149470902922381", "name": "Terry Johnson", "time": 1621602110038, "rating": 5.0, "text": "A professional and friendly atmosphere.\nThe Physicians are knowledgeable and there to do the best they can to help you.\nThey're very efficient, you're in and out.", "pics": null, "resp": null, "gmap_id": "0x889a4d5273d59c2f:0x4b3af33deb61879a"}
{"user_id": "106377588063430296917", "name": "heart", "time": 1621634940359, "rating": 5.0, "text": "I am so grateful for the care and compassion of, Dr. Durkin and staff! I truly felt cared for.", "pics": null, "resp": null, "gmap_id": "0x889a4d5273d59c2f:0x4b3af33deb61879a"}
{"user_id": "117860636915227330793", "name": "Jenny Henson", "time": 1626463915808, "rating": 5.0, "text": "My boyfriend an a friend goes here nice people clean place", "pics": null, "resp": null, "gmap_id": "0x889a4d5273d59c2f:0x4b3af33deb61879a"}
{"user_id": "107652714392811700312", "name": "Ivy Dodd", "time": 1615617243040, "rating": 5.0, "text": "The staff are the most adoring people and are most respectful. Waiting time has improved tremendously.", "pics": null, "resp": null, "gmap_id": "0x889a4d5273d59c2f:0x4b3af33deb61879a"}
{"user_id": "105129481309504045898", "name": "Chris Orso", "time": 1613413225517, "rating": 1.0, "text": "Great staff... HOWEVER... I've been on the same pain medication(percocet) for 3 years, prescribed by them. That's the ONLY narcotic I've taken in that time. And on 3 separate occasions they tell me my drug screen came back with morphine in my system. And another time, codeine. THAT'S COMPLETEY FALSE!!!! And there's no disputing it nor will they allow to do an on the spot drug to prove such. So now I'm out pain medicine because of their faulty lab practices. Youre better off going ANYWHERE  than this quack of an office!", "pics": null, "resp": null, "gmap_id": "0x889a4d5273d59c2f:0x4b3af33deb61879a"}
{"user_id": "105021170578529876646", "name": "Chase Nelson", "time": 1598263130544, "rating": 1.0, "text": "Fraud and unethical practice. Upon information and belief, I’d encourage any current or former patient, or representative of a patient to file a complaint with the state board, insurance company and any other legal avenues against this group. The DEA should investigate allegations of insurance fraud and other medical malpractices.", "pics": null, "resp": null, "gmap_id": "0x889a4d5273d59c2f:0x4b3af33deb61879a"}
{"user_id": "108288238802534517259", "name": "Jennie Washington", "time": 1590677711421, "rating": 1.0, "text": "The staff here is sickening, new patient and they don’t help you understand what is going on are what is needed they expect you to just know, they all stand around on social media not speaking are even communicating with the patients. Only reason they got a star is because that’s the only way to write a review it’s sad to say you be better off somewhere else. The dr is not friendly and he seems as if he is in a rush this clinic is unprofessional and I will not be back.", "pics": null, "resp": null, "gmap_id": "0x889a4d5273d59c2f:0x4b3af33deb61879a"}
{"user_id": "117142271113753872506", "name": "Donna Fornoff", "time": 1605900884267, "rating": 5.0, "text": "They have been extremely nice to me as well as seem legitimately concerned about my pain", "pics": null, "resp": {"time": 1605901711302, "text": "Thank you for your feedback!"}, "gmap_id": "0x889a4d5273d59c2f:0x4b3af33deb61879a"}
{"user_id": "103820369589658516790", "name": "Willie Williams", "time": 1568761396782, "rating": 1.0, "text": "Unorganized, unprofessional and rude. Probably one of, if not the worst places I’ve ever been. Overheard the staff discussing another patients history as well as their “I think he’s an addict” comment. Patient privacy is a joke here. They flat out lied about Dr. Hall being on vacation just so they could sign up all his patients without them knowing he was leaving. Dynamic pain and wellness is more of a pain than wellness. Do not go here, it’s all about the money to them.", "pics": null, "resp": null, "gmap_id": "0x889a4d5273d59c2f:0x4b3af33deb61879a"}
{"user_id": "115799717626716320619", "name": "Marie", "time": 1582557700254, "rating": 1.0, "text": "I was going here when Dr hall was here last year and the name was not the same I loved it then but every since docter Hall left this place is a joke  he had me on 3 pills a day 7.5 that work just fine for a year they come in and start changing it first they went down to three  5 which I said was not working to good so the next month they took me to only two 5mg a day I missed so much work so when I went back I drop them like they like to drop ppl I told them I no longer wanted to be seen by them and I call my docter to see about sending me else where this folks or a joke", "pics": null, "resp": null, "gmap_id": "0x889a4d5273d59c2f:0x4b3af33deb61879a"}
{"user_id": "111386895367574201091", "name": "Randy", "time": 1572375845007, "rating": 1.0, "text": "This New Main Doctor Had A Clinic In Florida And Because of Fraud With Some  Insurance Companies Are  Reasons why The Insurance companies Will Not Approve Paitents To Be Seen!!! They Say You Have Been Approved And Give you the APPOINTMENT Date And Time THEY Call You 1 DAY before you supposed to be there to say YOU ARE NOT Approved? Not Good at NOTHING BUT Delaying YOU for Meds And Upcoming SURGERY!!! LEFT HAND Doesn't Know What the Other Hand Is Doing 3 months of Misleading Someone who is Trying to Get Another SURGUERY Done Over By ORTHOPAEDIC surgeon!! Review the Internet the Whole True Story is Posted You Don't have to Take My Word for the Truth!!", "pics": null, "resp": null, "gmap_id": "0x889a4d5273d59c2f:0x4b3af33deb61879a"}
{"user_id": "103433186158857075159", "name": "Janetta Pogue", "time": 1569241919201, "rating": 1.0, "text": "This facility is so unorganized and unprofessional.   Appointments were scheduled on top of another,  chaos and confusion.   It's a straight money grab.", "pics": null, "resp": null, "gmap_id": "0x889a4d5273d59c2f:0x4b3af33deb61879a"}
