{"user_id": "104234006145964196881", "name": "Faye Cobbs", "time": 1628004501978, "rating": 5.0, "text": "Recently spent several days in this hospital.  Great care by Dr. Keith Anderson. Excellent tech care by Celeste & Kathy & Megan.  Outstanding  Therapy by Kelly & Tina. Mrs. Saint took care of my wound from surgery in  an amazing way.  Great case manager and lots of kindness shown to me and my family by Marcie Bullard.   I would definitely recommend this hospital to friends.", "pics": null, "resp": {"time": 1628017768369, "text": "Thanks for entrusting us with your care, Faye. We’re happy that you had such a good experience!"}, "gmap_id": "0x8862135337c96181:0x1b98346ed0aa2d86"}
{"user_id": "101358954336618212626", "name": "April Baker", "time": 1613223487309, "rating": 5.0, "text": "I do quite a lot of notary work at Encompass and have never had anything but positive experiences with their staff. They are always kind, thoughtful and considerate to their patients and family of their patients. They jump through hoops to fill the needs of their patients  while still managing to keep everyone involved safe and socially distant. Y’all are amazing!", "pics": null, "resp": {"time": 1613399316952, "text": "Thanks for sharing, April!"}, "gmap_id": "0x8862135337c96181:0x1b98346ed0aa2d86"}
{"user_id": "108911234417340167037", "name": "Big P Bullwinkle, Jr.", "time": 1626955185792, "rating": 3.0, "text": "My mother was discharged from Encompass 4 days ago. I will start by saying everyone I was in contact with was extremely friendly and kind. Case Manager and front desk were my favorite folks. My mother was there for 2 weeks. She received several hours of PT/OT therapy per day. Based on the reports of her progress while there, I was under the impression my mother would come home being able to do most things..simple things...walk to the bathroom...dress herself...on her own with supervision. NOT THE CASE. The first couple days home so far have been hell. My mother is far more dependent and way less capable of caring for herself than she was when she was admitted two weeks ago. She walked into the last doctors appointment before being admitted to Encompass. Now, she can barely walk to the bathroom. Definitely not the outcome I had anticipated....sorry to say.\n\nre·ha·bil·i·ta·tion\n/ˌrē(h)əˌbiləˈtāSH(ə)n/\nnoun\nthe action of restoring someone to health or normal life through training and therapy after imprisonment, addiction, or illness.", "pics": null, "resp": {"time": 1626963381214, "text": "Thanks for sharing your concerns with us. We have forwarded this information to the appropriate contacts. If you’d like to share additional details, please email us directly at feedback@encompasshealth.com."}, "gmap_id": "0x8862135337c96181:0x1b98346ed0aa2d86"}
{"user_id": "113903291897919414178", "name": "VICKI BREWER", "time": 1612657119490, "rating": 5.0, "text": "My uncle was in after a traumatic brain injury. The staff for the most part were excellent and any problems were quickly resolved. The therapists did a wonderfully job. If he ever has to go again I only want him at Encompass", "pics": null, "resp": {"time": 1612975878929, "text": "So glad to hear your uncle's experience at Encompass Health North Alabama was great! Thanks for sharing, Vicki."}, "gmap_id": "0x8862135337c96181:0x1b98346ed0aa2d86"}
{"user_id": "115785061338675875622", "name": "Ken Hamilton", "time": 1600779990393, "rating": 1.0, "text": "I would NOT recommend this facility.  We were only allowed to visit one time (I understand the reason).  The staff was very nice.  While we where there, they never came in to turn him or get him up.  The reports we were given on a daily basis, was very encouraging.  We were informed by the case management team, that the family member was doing very well.  We were also given a report that the family member would only need a little help walking, feeding themselves, and sitting up.  The family member would need more assistance in other areas of activity.  Once we got the family member home, we was total bed ridden.  It took two people  to get him up or to move him.  When the home health nurse came to the house, she confirmed that she had also been told the same thing that we had been told.  The family member also had a wound to his heel and signs of break down on his back (the family member was only at Encompass for 10 days).  After completing Encompass' survey, I received a telephone call from someone saying she was from Encompass and wanted to talk to me about the survey.  After talking to me, she stated that she would investigate the issues and call me back in a couple of days.  It has now been over 2 weeks, and I have not hear back from her.  If I know then what I know now about Encompass, I would never had allowed my family member to go there.", "pics": null, "resp": null, "gmap_id": "0x8862135337c96181:0x1b98346ed0aa2d86"}
{"user_id": "117279570978676996521", "name": "Donna Traylor", "time": 1573257303407, "rating": 5.0, "text": "I had 2 strokes I a row (smaller ones), this fall.  Huntsville Hospital referred me to Encompass for rehab.  I was scared!  Being in a new place was very scary for me.  I was pleasantly surprised, actually the nursing care I received was excellent! The doctor and nurse practitioner were very, very caring.  I recommend this rehab and give it a 5+ stars!  The aids, cleaning staff, maintenance dept, nurses, techs, physical therapists, and occupational therapists are AWESOME!  Thank you Shannon, ( my occupational therapists!  I was very off balance and unable to do much at all, before Encompass!  Thank you and God bless you all!", "pics": null, "resp": {"time": 1573679621661, "text": "Donna, thank you so much for sharing your positive experience at our Huntsville hospital. Thank you for entrusting us with your care!"}, "gmap_id": "0x8862135337c96181:0x1b98346ed0aa2d86"}
{"user_id": "109311663157860955941", "name": "Dale Lowe", "time": 1580402711900, "rating": 5.0, "text": "I found that every aspect of my rehab was handled very professional and the staff made the rehab enjoyable as you could have hoped for.  The nursing and the staff are top notch!", "pics": null, "resp": {"time": 1581970787574, "text": "Dale, thank you so much for sharing your positive experience at our Huntsville hospital! We agree that our Encompass Health team is the best."}, "gmap_id": "0x8862135337c96181:0x1b98346ed0aa2d86"}
{"user_id": "106854904078104963009", "name": "Lynn Johnson", "time": 1552321146735, "rating": 5.0, "text": "It’s a great facility with very friendly, helpful staff. They did a great job helping our loved one get stronger to prepare for double knee replacement surgery. The therapists worked with her a lot to help her reduce her pain and chances of falling. Once she gets the surgery done, I hope they send her back there to recover. I would definitely recommend Encompass.", "pics": null, "resp": null, "gmap_id": "0x8862135337c96181:0x1b98346ed0aa2d86"}
{"user_id": "113966002544721803265", "name": "Mary Smith", "time": 1542322043046, "rating": 1.0, "text": "Horrible place to work for nurses at the Huntsville, AL location. Good pay, but if you are not in their \"clique\" the employees start to bully you, trying to get you to quit. If you do not quit and are a good employee (good work, no absences, not late), you still get put on probation with no explanation (in the facility(90 days)-not towards licensing-being a single-mom I had no other choice but to accept it). However, people that are constantly late, call in alot,are lazy, etc, move up in the company. Very unprofessional and backwards place to work.", "pics": null, "resp": {"time": 1543424633851, "text": "Mary, thank you for sharing feedback with us. We've passed this information along to the appropriate contacts as the behavior described does not align with our Company values. If you'd like to provide additional details, please email feedback@encompasshealth.com."}, "gmap_id": "0x8862135337c96181:0x1b98346ed0aa2d86"}
{"user_id": "117202688458064203765", "name": "Jane Thurmer", "time": 1460644326753, "rating": 5.0, "text": "We could not be happier with the great care our mother has received at this rehab facility after her total hip replacement.  Thank you all for your attention to every detail of her care and especially the great planning for care at home after her discharge!", "pics": null, "resp": null, "gmap_id": "0x8862135337c96181:0x1b98346ed0aa2d86"}
{"user_id": "117982955103222416279", "name": "Calethea Martin", "time": 1507750824236, "rating": 5.0, "text": "My husband is currently at healthsouth now and he has done just awesome since he has been there. This is a great rehab facility.", "pics": null, "resp": null, "gmap_id": "0x8862135337c96181:0x1b98346ed0aa2d86"}
{"user_id": "114812432340347797675", "name": "Jeff K", "time": 1522162865869, "rating": 2.0, "text": "My son was in HealthSouth. It's an aggressive program and very well suited for young people who heal fast. I don't think it would be that great for the very elderly who have physical injuries except in the right circumstances.\n\nMy son had a brain injury, bruised spleen, and broken ribs. The physical therapists didn't believe that he had broken ribs. I was told that the pain he was feeling was in his mind due to his brain injury. This was not true. The doctor who first examined him at Huntsville Hospital verified that he had broken ribs on both sides. HealthSouth was either ignorant or chose to ignore this fact until I chewed some ass and got him some pain medication. They even brought in a portable x-ray machine and still said he had no broken ribs. The physical therapists tried to move him around and were too aggressive for someone in that kind of pain.\n\nI don't know if they lie as a part of their aggressive approach, or if it was a mistake. It's hard to believe it was a mistake when it was in his medical record that his ribs were broken.\n\nMost of the staff is nice and helpful. A couple of them were rude but you get that anywhere.", "pics": null, "resp": {"time": 1526010239074, "text": "Jeff, we are sorry to hear about your family's experience. This does not align with our Company values and we have forwarded this information to the appropriate contacts. We do use intensive therapy as part of our approach to returning patients of all ages back to their optimal level of independence. We do not encourage aggressiveness and in no way condone overlooking important information in a patient's file. If you'd like to provide additional details, we encourage you to email us directly at feedback@encompasshealth.com."}, "gmap_id": "0x8862135337c96181:0x1b98346ed0aa2d86"}
{"user_id": "114193186494196607317", "name": "Ty Farr", "time": 1522964993945, "rating": 1.0, "text": "Would never recommend this rehab hospital to work.", "pics": null, "resp": {"time": 1526010831327, "text": "Ty, we'd appreciate the opportunity to learn more about your experience with our Huntsville hospital location. Please email us directly with additional details to feedback@encompasshealth.com."}, "gmap_id": "0x8862135337c96181:0x1b98346ed0aa2d86"}
{"user_id": "114284741092620739556", "name": "Ricky Boothe", "time": 1500148677567, "rating": 5.0, "text": "About this time last year I had a spinal injury I'm not like I was but I have to give a thanks to my  ooccupational and physical therapist that worked with me if wasn't for you and my determination I can't imagine what shape I'd be today thank you !", "pics": null, "resp": null, "gmap_id": "0x8862135337c96181:0x1b98346ed0aa2d86"}
{"user_id": "107157418498150520685", "name": "Aquarius X2", "time": 1537548306905, "rating": 5.0, "text": "Awesome place! They have helped my daughter tremendously! Top of the line teachers and staff! They always go above and beyond for the kids! I can't praise this place enough!", "pics": null, "resp": null, "gmap_id": "0x88891965a8d09d25:0x2f8d9e82ab8ddfa0"}
{"user_id": "115306225821891638717", "name": "candy pope", "time": 1625848541245, "rating": 5.0, "text": "My mother had a triple bypass and pretty much lost all of her movement. She went to Encompass for rehab and the nurses there were so nice and helpful during her visit. The physical therapist  was extremely nice and helped my mother regain use of her legs and arm movement. i would recommend them to everyone. Thank you Encompass for helping my mom so much!!!", "pics": null, "resp": {"time": 1626110568950, "text": "Thanks for entrusting us with your mom's care, Candy. We’re happy that you had such a good experience!"}, "gmap_id": "0x888e806bf2b1b419:0xdfed3a9e459fc401"}
{"user_id": "103537595398578821470", "name": "Nikkia Wright", "time": 1618257458313, "rating": 4.0, "text": "I hadna stroke and the therapy was awesome loved the staff but some were slow.to answer call lights .took me a week and a half and I was home .", "pics": null, "resp": {"time": 1618349032044, "text": "Thanks for entrusting us with your care, Nikkia. We’re happy that you had such a good experience!"}, "gmap_id": "0x888e806bf2b1b419:0xdfed3a9e459fc401"}
{"user_id": "107981084306189341291", "name": "Averie Brock", "time": 1608728711979, "rating": 1.0, "text": "I would NOT recommend anyone to this inpatient rehab in Montgomery. My grandmother has been through so much and was transferred here after getting well only to be exposed to COVID. Not only was she exposed but they also exposed my mom by not telling her my grandmother’s roommate had tested positive to Covid the night before. Apparently this place has tons of covid cases. Someone should have told us before we let her go there.\n\nNurses would NEVER call back and let us know how she was doing and we could barely get anyone to answer the number at the nurse’s station. My grandmother’s ringer was turned off and therefore, she never knew we called her.\n\nThere was a few extremely wonderful people such as a nurse named Angela and a few unit clerks. Therapy was nice when we had the chance to talk to them.\n\nThe front desk was rude and not welcoming.\n\nI would NEVER recommend this horrible care to anyone.", "pics": null, "resp": null, "gmap_id": "0x888e806bf2b1b419:0xdfed3a9e459fc401"}
{"user_id": "102441551608263363538", "name": "Sandy Stafford Stafford", "time": 1614000380556, "rating": 1.0, "text": "Would  not take my dog there. Very loud... I was there and hope i never have to go. Horrible.", "pics": null, "resp": {"time": 1614011340086, "text": "Hi Sandy, we’re sorry to hear about your experience and would like to learn more about the situation. Can you please email feedback@encompasshealth.com with additional details?"}, "gmap_id": "0x888e806bf2b1b419:0xdfed3a9e459fc401"}
{"user_id": "107603098088587767503", "name": "LaShawn Jackson", "time": 1597786220534, "rating": 1.0, "text": "Do NOT send your loved one to this place. My mom died last month after being in this facility and aunt this month. Hopefully they will be shut down sooner than later.", "pics": null, "resp": null, "gmap_id": "0x888e806bf2b1b419:0xdfed3a9e459fc401"}
{"user_id": "112152409021303479323", "name": "Nancy Smith", "time": 1577890034418, "rating": 1.0, "text": "One Dr for 60 patients, no provisions for special diets, dirty bathrooms and floors, no control over the scores of visitors, ridiculous idea of occupational therapy. However, nurses were efficient I and caring though overworked.", "pics": null, "resp": {"time": 1578351420288, "text": "Nancy, we are sorry to hear about your negative experience at our Montgomery hospital. The experience you have described does not align with our standards of care. We have forwarded your comments to the appropriate contacts, and if you have additional concerns, please contact us directly at feedback@encompassshealth.com."}, "gmap_id": "0x888e806bf2b1b419:0xdfed3a9e459fc401"}
{"user_id": "102586506342674508932", "name": "Christopher Moore", "time": 1548911891251, "rating": 1.0, "text": "My mother was sent out of rehabilitation center and was in worse shape than when she arrived. They are all about the money. Worst place to carry anyone. When getting ready to leave which they said she was ready to go home.she fail. Because of that they rushed papers to be signed by her to be released. She had no idea of what she was signing. To try and drop there responsibly. Not going to work tho.\nLaw suit against the hospital is now starting.\nBecareful there. Discharged with broke fimar bone.\n.", "pics": null, "resp": {"time": 1549030414990, "text": "Christopher, we're sorry to hear about your mother's negative experience at our Montgomery hospital. The care and safety of our patients is our greatest priority. Please email us directly at feedback@encompasshealth.com with additional details, and we will pass your information along to the appropriate contacts."}, "gmap_id": "0x888e806bf2b1b419:0xdfed3a9e459fc401"}
{"user_id": "102731410650591378590", "name": "kit boden", "time": 1539471552359, "rating": 2.0, "text": "I mother, Maxine braddy, spent nine days at this facility. Every time I came to visit with her she was seated at a long table either asleep or alone. She regained no physical strength. The staff had  a distant and unfriendly feel. It took the staff four days to diagnose a UTI, after being told it was a distinct possibly. She pretty much declined in their care.\nBeside the case manager, the staff was subpar.", "pics": null, "resp": {"time": 1543423904570, "text": "Kit, thank you for sharing feedback with us, and we are sorry to hear about your family's experience at our Montgomery hospital. If you'd like to provide additional details, please email feedback@encompasshealth.com."}, "gmap_id": "0x888e806bf2b1b419:0xdfed3a9e459fc401"}
{"user_id": "114887793840161290840", "name": "K Hudlin", "time": 1615061937884, "rating": 5.0, "text": "Very nice office, scheduling appointments is a very easy process, and great staff!\nMrs. Kelsey Jackson is a dream! My son quickly felt comfortable with her and was willing to go out of his way and come out of his shell with her assistance. He says he likes going to \"Doctor's appointments now.\" It is so nice to receive care from someone who actually loves their job. She just has this ease about her that put my son and I in a very comfortable space. Mrs. Kelsey please keep doing what you do, you are a very bright light! You are a very valuable asset to your organization! Stay safe and well. Blessings to you and your family!!", "pics": null, "resp": {"time": 1615219345718, "text": "Thank you so much for the kind words, and especially for Kelsey! We think she's pretty awesome, too!  We're so happy that you had a great experience!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "116227978716204049887", "name": "Laura Elmore", "time": 1617657531737, "rating": 5.0, "text": "We’ve had a great experience going through autism and ADHD testing for two of our boys. The staff are friendly, knowledgeable, and professional. Scheduling is easy (I recommend emailing for appointments). The feedback from Dr Wadsworth and the therapists is great! Can’t recommend this place enough :)", "pics": null, "resp": {"time": 1617717323197, "text": "Thank you so much for this great review! We're glad that you had such a great experience!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "102262751710617203234", "name": "Terin", "time": 1600800399733, "rating": 1.0, "text": "I’ve been calling since June to schedule an appointment; I was finally able to reach someone at the clinic via phone - it’s September. To be clear, I have not been to their office... This practice was recommended by my child’s pediatrician for comprehensive developmental testing. Once I finally spoke to someone, I was informed that they only accept BCBS or cash. For the low, low price of $2500-3000, you can have 3-4 appointments (that is for testing only, no treatment).\n\nWhile their website presents this image that they aim to treat a wide array of conditions, including those individuals with disabilities and handicaps, it appears that their primary interest is taking advantage of those most in need. In many instances, those with handicaps and disabilities are unable to work with little to no income to support themselves or rely on their families for support; families in these situations are already under intense financial strain. Additionally, based on my conversation, test results are not given until a year long payment plan concludes (imagine an oncologist having this policy). A year, when it comes to a child’s development, is a long time to wait.\n\nAfter hearing the pricing, I had no interest in further details or clarification; however, I suppose it’s a good thing they offer a payment plan, if you’re willing to pay their high fees and do not want to take out a personal loan. It is likely they do not contract with Medicaid because the state will not pay anywhere close to their high fees.\n\nI have no interest in supporting a clinic more interested in lining their pockets than genuinely helping the community in which they aim to serve. I would not recommend this clinic to anyone and I will be contacting my pediatrician’s office to advocate removing this office from their list of recommendations.", "pics": null, "resp": {"time": 1600811761271, "text": "Terin,\n\nI am very sorry for the communication difficulties. I am afraid that there were some miscommunications regarding insurance coverage and cost of testing.  Additionally, test results are never withheld for payment - we always provide patients with a copy of the test results at the test result session, with payment plans continuing well beyond that date if cash is used. Please contact our office manager, Angela, at angela@silverliningsclinic.com for more clarifications.\n\nThank you,\nSLN"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "107219142762668301169", "name": "Krista Kiser", "time": 1617208472749, "rating": 5.0, "text": "Holleigh Woodward is an compassionate professional therapist. I highly recommend her.", "pics": null, "resp": {"time": 1617717382608, "text": "Thank you so much for the kind words for Holleigh!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "110785630211230592802", "name": "Jason & Amanda Page", "time": 1564781419799, "rating": 5.0, "text": "We’ve been using Silver Linings for our daughter for almost two years now. We absolutely love the doctors there. The environment is welcoming and calming. The doctors are very patient and detailed. They go over things with us at length and make sure we understand everything about a diagnosis or a therapy we’re doing. I’m just so very thankful for this place! Highly recommend it!", "pics": null, "resp": {"time": 1564958007364, "text": "Jason & Amanda,\n\nThank you so much for sharing your experience! We’re so happy that it’s been a positive one. It’s been a delight working with your family!!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "117700292109131912622", "name": "Brittnie Guise", "time": 1596550319079, "rating": 1.0, "text": "My son had an appointment for a full developmental screening and I was contacted by Angela and she told me that insurance denied to cover the testing and so I called my insurance company and they sent me information to appeal and I let Angela know this and she emailed me back once and I at that point communicated that I wanted to appeal and then sent her the information that needed to be filled out. It’s been 3 weeks and I’ve heard NOTHING from anyone. I have left voicemails for Angela  as well as emails, I have also tried contacting the front office and have left voicemails there trying to get some sort of help. My child is 4 and at the developmental level of a 2.5 year old as far as his speech & has multiple behavioral issues, I am desperate for help for him and all I want is for him to hopefully be tested and appeal the insurance decision or it’s $2600 out of pocket. It seems as though no one here cares I don’t understand it. Very unprofessional and I would not recommend this business to anyone. I’m beyond frustrated and disappointed.", "pics": null, "resp": {"time": 1596555049190, "text": "Ms. Guise,\n\nWe are so very sorry for the communication difficulties. We will be reaching out to you as soon as possible to attempt to rectify the situation.\n\nSLN"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "110126183966165584875", "name": "Jennifer Brown", "time": 1560174617330, "rating": 5.0, "text": "My son is a patient with Heather Wadsworth. Her and the rest of the staff are amazing at what they do and very friendly! The office is very clean, comfortable, and welcoming for people of all ages. By far the best place we have been for my son to get help with his issues. We love this office. My son actually gets excited for each appointment! Definitely a 5 Star facility!", "pics": null, "resp": {"time": 1560175487830, "text": "Jennifer,\n\nWe're so happy that you and your son are enjoying your experience with Heather and everyone at SLN!  It makes our day to know that your visits have been so positive!  Thank you so much for the review!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "113664281639864498400", "name": "Jessie Loveday", "time": 1593127466168, "rating": 5.0, "text": "We LOVE silver linings!! We went to numerous other places to get our son the help he so desperately needed. My son suffers from a severe case of selective Mutisim and we just kept getting told he will out grow it but we knew better and were watching our child suffer with such a debilitating anxiety disorder. Then we found silver linings. We met with Dr.Crisler and she confirmed that he would not “just out grow it” and they would get our son through this. She set us up for therapy with Emily and she is simply amazing!! Our son has been to four therapy sessions and we are already seeing amazing progress. The entire staff is so kind, compassionate, understanding, and you can tell none of them are there just for a paycheck. They TRULY care about these kids and the families. The front desk staff always make you feel so welcome and have always been upfront about there policies and do a great job going over insurance and copays prior to your first visit. I HIGHLY recommend this team!", "pics": null, "resp": {"time": 1593180395552, "text": "Jessie,\n\nThank you so much for such a warm review!! We are all so happy that you have been seeing progress and have had such a good experience with our team!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "117700435964401330954", "name": "Tasha Vineyard", "time": 1568033748910, "rating": 5.0, "text": "It's very hard to find skilled and compassionate mental health professionals but this office has nailed it. Everyone from the Office Manager (Angie) to the Psychologist (Dr. Crisler) are caring and patient. We have been patients here since the office opened and the quality of care provided has been exceptional.", "pics": null, "resp": {"time": 1568044704740, "text": "Tasha,\nThank you so much for this review and kind words!! It has been our pleasure to work with you and are delighted that you've felt so supported!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "105956955776369894907", "name": "Cassandra Roberts", "time": 1575784054952, "rating": 5.0, "text": "Silver Linings has been the best thing for our daughter. The advancements she's made since we have started going is unbelievable and we are so grateful for them!", "pics": null, "resp": {"time": 1575903069178, "text": "Cassandra,\n\nWe are so happy that you have had a great experience at Silver Linings! Thank you for the review!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "100671702607893317718", "name": "april patellis", "time": 1559681437900, "rating": 5.0, "text": "My daughter has had a wonderful experience at Silver Linings.  She is working with Brooke Sorrells, Speech and Language Pathologist, to improve her verbal social skills.  2 months ago I would have never thought that a speech pathologist could help her with her social skills, but she is improving so much thanks to Brooke's work with her!", "pics": null, "resp": {"time": 1559844959846, "text": "April,\nThanks so much for the positive review! Brooke is pretty awesome :) We're happy you have seen such great improvement!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "105935848951881922489", "name": "G G", "time": 1559834481063, "rating": 4.0, "text": "Pretty good. One odd policy like we can be late more than 15 minutes late for your appointment but if you're 15 minutes late you may not get in. Other than that pretty good and professional.", "pics": null, "resp": {"time": 1559845389300, "text": "Thanks for the kind review! We're very sorry if you were ever left waiting. If this was a significant problem, please feel free to reach out to our office manager, Angie, at office@silverliningsclinic.com  We try our best to stay on time and have the 15 minute policy in place to simply encourage our clients to do the same - especially for our shorter, 30 minute sessions.  When we are able to, though, we do make every effort to see patients who are late."}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "108051639933198824726", "name": "Lela Boggess", "time": 1556550050022, "rating": 5.0, "text": "As a homeschool family, Silver Linings provided  exactly to kind of support that we needed to get answers and solutions to a few of the issues we were facing. The staff were all helpful and polite. Billing was made clear and they helped us navigate insurance issues. I would recommend them to others.", "pics": null, "resp": {"time": 1556635913390, "text": "Lela,\nThank you so much for the kind review! We’re happy that you had such a positive experience with the entire process!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "103808072427117692694", "name": "randy williams", "time": 1553782858111, "rating": 1.0, "text": "I had a very poor experience with silver linings. I needed help with my teenage son.the attitude and atmosphere from the beginning was uninspiring at best.the reception was poor.the lack of information was poor.my son had one visit .the counselor did not even introduce himself or herself.i don't know if it was a male or female. my son will not even tell me what was discussed.please go elsewhere if you need help.", "pics": null, "resp": {"time": 1553796249200, "text": "I am sorry that your experience with SLN was unsatisfactory.  Please reach out to us at office@silverliningsclinic.com so we can better understand your complaints and how to rectify the problem in the future."}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "116656017474654651318", "name": "Christie Queen", "time": 1556335499724, "rating": 5.0, "text": "My daughter loved her experience with testing recently. The staff was very friendly and helpful. The office was clean, welcoming, and well-thought out.", "pics": null, "resp": {"time": 1556541920342, "text": "Christie,\nWe're so happy that testing went well with you and your daughter! We aim to try and make it as pleasant as possible and are so happy that you both were pleased!  Thank you for the review!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "107312898871977736000", "name": "Kathleen Dunseith", "time": 1561392398698, "rating": 5.0, "text": "The staff is great. They communicate by phone, text, and email. Most paperwork is sent ahead of time by email or their online portal.", "pics": null, "resp": {"time": 1561415999518, "text": "Kathleen,\nThank you for the wonderful review! We're happy that you have found use of the online portal and have had a positive experience with our team!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "105601826631770899498", "name": "Meg Breland", "time": 1534295780530, "rating": 5.0, "text": "Silver Linings is the perfect name for this office! These amazing women go above and beyond for you. The whole office from the receptionist to the doctors take the time to know you and your child. They REALLY listen and want to use their knowledge to help. Here you are not just another patient. (Also, They take a variety of insurances. So don't let that stop you from calling.) They provide the gold standard testing like Sparks and Glenwood without being put on a year long waiting list.", "pics": null, "resp": null, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "107035388024058210213", "name": "Pamela Kerns", "time": 1556562912954, "rating": 5.0, "text": "Everyone in this business has been kind and courteous.  Takes time to listen about needs and has been very punctual about appointment times.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOTds5VtuC3rt910RjhKLRBUDNIM5LymplJuQ4j=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOgHWuvb0lPGbUNmTrqEF9PicjyfpJkemugF7Bo=w150-h150-k-no-p"]}], "resp": {"time": 1556635998287, "text": "Pamela,\nWe greatly appreciate your kind words! We’re happy that you have had a good experience with our team! Thank you for the review!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "108963407588328066973", "name": "ALN", "time": 1554302898709, "rating": 5.0, "text": "SLN is simply AMAZING!! They offer everything from diagnostics to other services that a client may need. They are passionate and vested in their clients, and go above and beyond what one would expect from a professional setting. Personally, the wellbeing of a child is priceless, and they are more than willing to take the time to listen and then implement whatever means necessary to help a client. I HIGHLY RECOMMEND SLN! You will be blessed!", "pics": null, "resp": {"time": 1554829073573, "text": "Thank you so much for the positive feedback!  It has truly been a pleasure of ours to help!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "105012151659853195263", "name": "Norionna Cox", "time": 1554467140503, "rating": 5.0, "text": "The entire staff is amazing!! They have been so helpful and encouraging and we are so thankful for their help.", "pics": null, "resp": {"time": 1554828860143, "text": "Thank you so much for the warm feedback!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "107331701119944635207", "name": "Brenda Tapia", "time": 1555014098297, "rating": 4.0, "text": "Great support in working though and developing a plan. I appreciate the staffs professionalism .", "pics": null, "resp": {"time": 1555078837301, "text": "I'm so glad that you felt supported! Thank you for sharing your positive experience!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "117137893230451895396", "name": "Karen Rass", "time": 1554816292729, "rating": 5.0, "text": "Very nice office and wonderful staff! Dr Crisler was concerned about my child issues and listen to them! Thank u!", "pics": null, "resp": {"time": 1554828780100, "text": "Thank you so much for the kind review!  We're so happy that you had a great experience!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "111025696414748911189", "name": "Matthew “Matt S”", "time": 1539741391688, "rating": 1.0, "text": "*****DO NOT USE SILVER LININGS*****\n\nAs much as Silver Linings does to help the customer, I feel like they still need a lot of work in actually helping.\n\nThe only reason I was willing to see so many therapist and so often was because we had met our max deductible and all that would be owed was the $25 dollar co-pay as session.\n\nSomehow in their decisions, they had us using a therapist that apparently wasnt a Blue Cross Blue Shield In-Network Doctor. You would of thought that anyone in their right mind wanting to only pay the 25 co-pay would not want each session to start costing over $130 dollars a session.\n\nI know I am partly to blame, but I just stopped paying waiting for the insurance to clear on the sessions, UN-knowing she was not even running it on Insurance. Silver Linings kinda screwed me over.\n\nOn top of that, my wife is a bit forgetful but we were stuck with $400 dollars in Cancellation fees for 4 missed appointments. Pretty stiff. I never even knew that policy existed, because they never told me. And dont say well I told Jane, because I am Bob and not Jane. Tell me the one paying the bills.\n\nWell as things are now, we are not putting our son back at Silver Linings because I feel like I was screwed over and they are not willing to work with me at all.  They will take their money over time sure, but work with me getting screwed over and making things right, no they wont.\n\nIf they decide to work something out with me, I will edit my review.", "pics": null, "resp": {"time": 1539793482702, "text": "Mr. Skillman,\n\nWe are deeply sorry that you feel less than pleased with the encounters your family has had with Silver Linings.  We do our best to present all fees within initial paperwork and notify families of any higher fees related to insurance as soon as we are made aware, but also understand that you are not satisfied at present.  We will discuss as a team how to improve and make all fees as clear as possible to future families. We are sorry for the frustrations you have experienced.  Please call us at 256-489-1583 to discuss your personal encounter in more detail and how we can further help.  When calling, please ask for the Insurance & Billing Department.\n\nSincerely,\nThe Silver Linings Team"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "115916623262560252548", "name": "rachel ciliax", "time": 1555425802290, "rating": 5.0, "text": "Very knowledgeable and friendly staff, dr Emily is great with my son.", "pics": null, "resp": {"time": 1555671901061, "text": "We’re so happy that you have been pleased with everyone, especially Emily! Thank you for the kind review!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "107195974654973740165", "name": "David Moak", "time": 1580312208960, "rating": 5.0, "text": "Easy parking and covered access", "pics": null, "resp": {"time": 1580851255923, "text": "Thanks for the great review!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "114411321367262592480", "name": "Deborah Saye", "time": 1627349272723, "rating": 5.0, "text": "Worked here for over 20 years. Although, I am\nNo longer here, Marshall Manor will always hold a special place in my heart. They have the most loving staff that cares for the residents. I would highly recommend this facility if you are in need of placement for a family member.", "pics": null, "resp": null, "gmap_id": "0x8889f9a6c5c4e363:0xa07bba768bd0d130"}
{"user_id": "115759287938129569333", "name": "Isaac P", "time": 1623364795734, "rating": 5.0, "text": "There is no finer nursing home in the state! The love and care they provide their residents is unmatched. The staff are very dedicated.", "pics": null, "resp": null, "gmap_id": "0x8889f9a6c5c4e363:0xa07bba768bd0d130"}
{"user_id": "109822249056923823870", "name": "Amanda", "time": 1623365942096, "rating": 5.0, "text": "Marshall Manor is a wonderful facility full of people who were called to serve. They really pour their heart into their residents. They offer wonderful activities and social opportunities. I can't express how wonderful this facility is. They provide the upmost care to all their residents.", "pics": null, "resp": null, "gmap_id": "0x8889f9a6c5c4e363:0xa07bba768bd0d130"}
{"user_id": "115875080504521326880", "name": "otto wood", "time": 1561940396980, "rating": 5.0, "text": "Serving as a Hospice Chaplain for the last 3.5 years I  frequent many facilities through out the North Alabama region. Marshall Manor is one of the finest. They have a caring committed staff from the administrator (Linda) ,nurses, to the kind aides. The facility is kept clean and so are the patients. Most importantly the residents are valued and loved  and that is demonstrated every day.", "pics": null, "resp": null, "gmap_id": "0x8889f9a6c5c4e363:0xa07bba768bd0d130"}
{"user_id": "102478158318172200453", "name": "Autumn Martin", "time": 1491474831533, "rating": 5.0, "text": "Not working there anymore but by far the best job I have EVER had. I loved the people I worked with and my residents. Only problem I ever had there was some of the people there did not care AT ALL about their job or residents. We all had our bad days but definitely loved my job. Amazing place to work. I loved it!", "pics": null, "resp": null, "gmap_id": "0x8889f9a6c5c4e363:0xa07bba768bd0d130"}
{"user_id": "104530367730552269326", "name": "David Denham", "time": 1442427648714, "rating": 1.0, "text": "I would advise avoiding this place at all costs. My grandmother was admitted to Marshall Manor for rehab. Shortly afterward we found out she had lung cancer that had moved into her bones also. They consistently served food that was horrible, and in some cases unidentifiable. She was bed bound and had to push the nurse call button for assistance to use the bathroom. Once it was an HOUR before anyone came to help her. Finally, when we were trying to coordinate transportation for her appointment at the cancer care center, they were absolutely unwilling to help until I enlisted the help of the ombudsmen and threatened to file a complaint with their corporate office. They went so far as to lie to the scheduler from the Cancer Care Center when she called herself to try to arrange transportation. They claimed my grandmother was \"very mobile\". She was totally bed bound. When the Dr and the Cancer Care Center saw my grandmother, he apologized profusely and said he had been misled about her condition. He had her admitted immediately to Shepherd's Cove (a hospice facility). I regret immensely that my grandmother had to spend two of her final weeks at this horrible facility.", "pics": null, "resp": null, "gmap_id": "0x8889f9a6c5c4e363:0xa07bba768bd0d130"}
{"user_id": "116233651757463573141", "name": "Doug Tucker", "time": 1617617768770, "rating": 1.0, "text": "Avoid at all costs", "pics": null, "resp": null, "gmap_id": "0x8889f9a6c5c4e363:0xa07bba768bd0d130"}
{"user_id": "105354626821789424070", "name": "Vickie Thompson", "time": 1518451327135, "rating": 4.0, "text": "I use to volunteer here. Its in a quiet community. They do have a lot of activities for their patients.", "pics": null, "resp": null, "gmap_id": "0x8889f9a6c5c4e363:0xa07bba768bd0d130"}
{"user_id": "100975892998032552847", "name": "Christapher Flowers", "time": 1450497656604, "rating": 4.0, "text": "im wondering if hiring ? im looking for a job , and i want to work badly , i just moved to alabama recently i thought this would be a good place to start hopefully Marshall Manor Nursing Home can get back to me", "pics": null, "resp": null, "gmap_id": "0x8889f9a6c5c4e363:0xa07bba768bd0d130"}
{"user_id": "116985286298434033744", "name": "Melissa B", "time": 1454091182905, "rating": 1.0, "text": "One of the worst as the other reviewer has said. Avoid.\nThe Director of Nursing is a total wack job psychopath. Avoid, avoid, avoid.", "pics": null, "resp": null, "gmap_id": "0x8889f9a6c5c4e363:0xa07bba768bd0d130"}
{"user_id": "105500052725405186220", "name": "lucretia Lemley", "time": 1467813399724, "rating": 1.0, "text": "Awful place to work", "pics": null, "resp": null, "gmap_id": "0x8889f9a6c5c4e363:0xa07bba768bd0d130"}
{"user_id": "104528333314704206508", "name": "Sharn Mccants", "time": 1612898486574, "rating": 5.0, "text": "Office staff is very professional... Everyone there is highly trained and great!!!! I would highly recommend!!!", "pics": null, "resp": {"time": 1612902588257, "text": "Thank you for your review. We are glad you have made progress and hope to see you continue to improve."}, "gmap_id": "0x888c2affa01eeac7:0x3d5925169968815"}
{"user_id": "103989876923016921580", "name": "Deroithy “Cool Breeze” Scott", "time": 1596758543307, "rating": 5.0, "text": "Awesome", "pics": null, "resp": {"time": 1596804092705, "text": "Thanks Deroithy!"}, "gmap_id": "0x888c2affa01eeac7:0x3d5925169968815"}
{"user_id": "111604821008097411776", "name": "Caroline McGee", "time": 1599049432898, "rating": 5.0, "text": "Karen is superb at what she does! She takes time to listen each visit and always puts me through my paces. She was quick to recommend another therapy to augment her therapy. She looks at the long-term benefits and was very conscious of my number of visits on insurance. Overall, I am very pleased with the therapy I received and will keep coming as I have a long-term disability.", "pics": null, "resp": null, "gmap_id": "0x88626cca2f9bdbdd:0xfec7f1138f539706"}
{"user_id": "104438496223039924069", "name": "Jason Powell", "time": 1578968951496, "rating": 1.0, "text": "Therapy Achievements was alright.  Went there and everything went alright but felt that they were just kind of phoning it in with the therapy.  Apparently they were just charging my insurance for the money.  Last visit there according to the invoice I received today was from almost 11 months ago.  Didn't hear anything from them for over 11 months till I got a bill today for almost 600 bucks.  Glad I chose to go to another PT because they didn't do me this way plus they were a lot more active in making sure I got better.", "pics": null, "resp": {"time": 1579298777784, "text": "Mr. Powell, we are so sorry that you didn't have a better experience.  We have tried to reach out to you a few times over the phone with the number you provided to us during your visits. Feel free to call us at 256-509-4398. Dianne would be happy to speak with you on this matter."}, "gmap_id": "0x88626cca2f9bdbdd:0xfec7f1138f539706"}
{"user_id": "113581798416507926339", "name": "Lon Moncrief", "time": 1541782260427, "rating": 5.0, "text": "We came here from inpatient rehab where the therapist had a number of patients at one time. The one on one attention is great.  My wife has make great progress in her recovery.  The therapist have the necessary experience to get the most out of each session and the patient.\n\nI would recommend Therapy Achievements to anyone seeking maximum recovery from their illness or surgery.", "pics": null, "resp": {"time": 1543944892500, "text": "We appreciate your review Mr. Moncrief! Your wife is a joy to work with and we look forward to seeing her continued progress!"}, "gmap_id": "0x88626cca2f9bdbdd:0xfec7f1138f539706"}
{"user_id": "109615083586929227876", "name": "Rosalind Rainey", "time": 1544809589496, "rating": 5.0, "text": "Such a nice and profesional group that actually cares  and takes the time to explain and answer questions.  I feel hopeful now knowing what my issues are that no one ever explained to me in the past.  More doctors should use this service and refer their patients.  I look forward to being able to  move  around more without the severe leg pain.", "pics": null, "resp": {"time": 1544817967197, "text": "Ms. Rainey, we are so happy that your experience here has been positive. We are also thankful that you are finally getting some of the answers to the questions you had. We look forward to working with you more! Thank you for the review!"}, "gmap_id": "0x88626cca2f9bdbdd:0xfec7f1138f539706"}
{"user_id": "112081693506980541701", "name": "Elizabeth Harrell", "time": 1464384457515, "rating": 5.0, "text": "My son twisted his knee in one of his basketball games, so he went to Therapy Achievements for Therapy . I love everyone there, they are so helpful and nice to everyone. I love the fact that the patients are getting one on one therapy with each therapist. It is not like the other places when you are in a big room with all the other patients and therapist. This clinic is on a more of a personal level and I love that. I also love the fact that the therapist answer all of your questions in a way that you can understand. I think the best part about Therapy Achievements is the fact that they offer all different kinds of programs and services, its like a one stop shop!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x88626cca2f9bdbdd:0xfec7f1138f539706"}
{"user_id": "105259916683052224377", "name": "Kenneth Lane", "time": 1544995484856, "rating": 5.0, "text": "I have just  had one treatment and my lower legs looks better than before. I look forward to my continue therapy with them. The staff that work with me , gave excellent service and advice.", "pics": null, "resp": {"time": 1545058914794, "text": "Thank you for the review Mr. Kenneth! We are so glad to hear that you are already able to notice a difference in your lower legs. We look forward to working with you more."}, "gmap_id": "0x88626cca2f9bdbdd:0xfec7f1138f539706"}
{"user_id": "111818162996303955764", "name": "Leslie Griffin", "time": 1544242467444, "rating": 5.0, "text": "Wonderful, knowledgeable staff.  We have been very pleased with results of lymphedema therapy (personally) and have had extensive, professional experience with dozens of our customers who have gone through the driver training process for specialized driver controls to keep them active  & on-the-go!", "pics": null, "resp": {"time": 1544563467986, "text": "We greatly appreciate your review, Ms. Griffin. We are so happy that we were able to help with your lymphedema, and that there have been so many positive experiences related to our driving evaluations. We are always eager to help!"}, "gmap_id": "0x88626cca2f9bdbdd:0xfec7f1138f539706"}
{"user_id": "109174796003715501186", "name": "david pepper", "time": 1543347899725, "rating": 4.0, "text": "Great OT staff. They work well with you to help you achieve your goals. Great value for your investment.", "pics": null, "resp": {"time": 1543945292339, "text": "Thanks for your review Mr. Pepper! We are happy to hear that you had a great experience!"}, "gmap_id": "0x88626cca2f9bdbdd:0xfec7f1138f539706"}
{"user_id": "111943109779035379164", "name": "Hannah C.", "time": 1539022901234, "rating": 5.0, "text": "Staff is incredibly kind and knowledgeable! So happy to have found them", "pics": null, "resp": {"time": 1539036898737, "text": "Thanks Hannah!  We are so glad we get to work with you and look forward to all the great things you will achieve."}, "gmap_id": "0x88626cca2f9bdbdd:0xfec7f1138f539706"}
{"user_id": "107531886871527032681", "name": "JD WILLIAMS", "time": 1543347461420, "rating": 5.0, "text": "Great facilities and excellent personnel. Very professional personnel who make the hand controls driving experience less stressful.", "pics": null, "resp": {"time": 1543945065760, "text": "Thank you for your review! We are happy to know that we were able to make the hand controls driving experience less stressful for you. We are always eager to help!"}, "gmap_id": "0x88626cca2f9bdbdd:0xfec7f1138f539706"}
{"user_id": "106275207688878412308", "name": "Fred Baker", "time": 1546965316062, "rating": 5.0, "text": "First place I ever went that helped me with the problem I had. Good Job. I Highly recommend therapy achievements. ~2Thumbs up~", "pics": null, "resp": {"time": 1546966100572, "text": "Thank you so much for the review! We are so happy that we are able to help!"}, "gmap_id": "0x88626cca2f9bdbdd:0xfec7f1138f539706"}
{"user_id": "115273160705606508498", "name": "Anna Blanchard", "time": 1543457770608, "rating": 5.0, "text": "Pleasant facility to have therapy. Therapist was very nice.", "pics": null, "resp": {"time": 1544451791984, "text": "Thank you for the review Ms. Blanchard. We are always happy to help!"}, "gmap_id": "0x88626cca2f9bdbdd:0xfec7f1138f539706"}
{"user_id": "106607975766783762956", "name": "Emanuel Chester Jr", "time": 1541783348821, "rating": 5.0, "text": "My visit was great as usual the therapist was very professional and knowledgeable of my treatment. Thanks for Asking!", "pics": null, "resp": {"time": 1543944953483, "text": "Thank you for your review Mr. Chester! We are always happy to help!"}, "gmap_id": "0x88626cca2f9bdbdd:0xfec7f1138f539706"}
{"user_id": "103877398191722153807", "name": "J Talley", "time": 1543350598053, "rating": 4.0, "text": "Therapists are very helpful and can get you where you need to be, time is all it takes.", "pics": null, "resp": {"time": 1544451709193, "text": "Thanks for the review Mr. Talley! We are always happy to help."}, "gmap_id": "0x88626cca2f9bdbdd:0xfec7f1138f539706"}
{"user_id": "106858563211766093981", "name": "Anthony Free", "time": 1569825370071, "rating": 5.0, "text": "Best help and people who care", "pics": null, "resp": {"time": 1579302298077, "text": "Thanks, Mr. Free!"}, "gmap_id": "0x88626cca2f9bdbdd:0xfec7f1138f539706"}
{"user_id": "113301385298237180042", "name": "Butch Coolidge", "time": 1541438822045, "rating": 5.0, "text": "Super friendly and genuinely caring about your well being", "pics": null, "resp": {"time": 1541466380030, "text": "Thanks Butch!  We appreciate being able to partner with you to accomplish your goals."}, "gmap_id": "0x88626cca2f9bdbdd:0xfec7f1138f539706"}
{"user_id": "107984262502712759464", "name": "A. T. Hislop", "time": 1517349484680, "rating": 5.0, "text": "Timely and excellent PT and was a great help to my recovery ...highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88626cca2f9bdbdd:0xfec7f1138f539706"}
{"user_id": "118049562098177497858", "name": "Gail Bundow", "time": 1541786197723, "rating": 5.0, "text": "Have used their services twice. Staff is professional,  knowledgeable , cheerful, and encouraging .  I am very satisfied with the experience and highly recommend .", "pics": null, "resp": {"time": 1543945002567, "text": "Thank you for your review Ms. Bundow! We are always happy to help."}, "gmap_id": "0x88626cca2f9bdbdd:0xfec7f1138f539706"}
{"user_id": "106324034975011590782", "name": "Linda Mendenhall", "time": 1506302418679, "rating": 5.0, "text": "This is the greatest Occupational Therapist Office in Hustcikle\nKAREN was recommended by my physical therapist and gave me the name of a wonderful Dr", "pics": null, "resp": null, "gmap_id": "0x88626cca2f9bdbdd:0xfec7f1138f539706"}
{"user_id": "101707771449978618291", "name": "Gina Thurman", "time": 1539102000304, "rating": 5.0, "text": "Karen seems genuinely interested in my progress.", "pics": null, "resp": {"time": 1543601149495, "text": "Thank you so much Ms. Thurman! You are a joy to work with!!"}, "gmap_id": "0x88626cca2f9bdbdd:0xfec7f1138f539706"}
{"user_id": "102181201063576670618", "name": "Barbara Lee Norris", "time": 1543952658173, "rating": 5.0, "text": "Excellent and friendly care.", "pics": null, "resp": {"time": 1544451825225, "text": "Thank you for the review Ms. Norris. We are always happy to help!"}, "gmap_id": "0x88626cca2f9bdbdd:0xfec7f1138f539706"}
{"user_id": "101768852467754860770", "name": "Farrah Rollings", "time": 1541176947748, "rating": 5.0, "text": "Great experience!", "pics": null, "resp": {"time": 1543944781573, "text": "We are so glad that you had a great experience! Thank you for the review!"}, "gmap_id": "0x88626cca2f9bdbdd:0xfec7f1138f539706"}
{"user_id": "117987159504381634388", "name": "Peggy Daugherty", "time": 1543456076110, "rating": 4.0, "text": "Very friendly and professional.", "pics": null, "resp": {"time": 1544451746709, "text": "Thank you for your review Ms. Daughtery!"}, "gmap_id": "0x88626cca2f9bdbdd:0xfec7f1138f539706"}
{"user_id": "116747970366806884058", "name": "Glenda Holmes", "time": 1508010657590, "rating": 1.0, "text": "Slow servers  .spend over 45 min waiting for help putting someone in bed .turns off call light then leaves", "pics": null, "resp": null, "gmap_id": "0x88921e03d04bb585:0x662bc6996238d04"}
{"user_id": "103423400816122826587", "name": "Alicia WAYLEN Smith", "time": 1622224185822, "rating": 5.0, "text": "Wow! 1st visit I'm laughing I'm crying.  Our sweet Averie is going to shine! In such a short time to see what your mind knew she could do. Thank you", "pics": null, "resp": null, "gmap_id": "0x88891bac8b6e0c6d:0x787d595e650f7618"}
{"user_id": "107497847802876495456", "name": "Alex Cervasio", "time": 1623377927722, "rating": 5.0, "text": "I cannot say enough good things about Therapy South! I have been their patient for about 8 months and my quality of life has improved drastically. They really take the time to educate you and explain things so you can continue your progress at home between appointments. I typically see Patrick and Ashley, but everyone there is so kind and helpful. I have struggled with autoimmune related issues and I am so thankful Patrick and Ashley have taken the extra time to understand and get to know me! They are always so positive and motivating even on the challenging days. I can’t thank them enough!!!", "pics": null, "resp": {"time": 1623382106308, "text": "Thank you so much for your kind words!"}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "102298412240229594313", "name": "Jan Slaughter", "time": 1622153378518, "rating": 5.0, "text": "I never knew PT could actually be fun and successful. I went in for back pain, which can be vague, but Robert nailed the problem on the first visit. The pain was completely interfering with the quality of my life. Now, after 8 weeks of therapy I am a changed woman! I went from barely able to work in my yard (my favorite thing to do) for an hour without pain. I can now work 6-7 hours with no pain. They also addressed some pain from my knee replacement of June 2020. I can now walk with no pain, but don’t ask me to run a race.\n\nI can’t give Therapy South Auburn anything but a 5+ stars rating for friendliness and competence of the entire staff. If you need PT, this is THE place to go.", "pics": null, "resp": null, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "102397627781681404672", "name": "Chris Hernandez", "time": 1622048108893, "rating": 5.0, "text": "Highly recommend Therapy South - Auburn. The staff is very caring and welcoming. Before starting PT, I was always in pain and discomfort, but after weeks of working through it with Patrick, I am doing so much better. Couldn’t be happier.", "pics": null, "resp": {"time": 1622126924545, "text": "Thank you for your kind words!"}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "114361298329389590312", "name": "Luke Melillo", "time": 1619622283743, "rating": 5.0, "text": "Patrick Carroll is the best. He helped me out with my shoulder and I’m feeling so much better. I definitely recommend TherapySouth!", "pics": null, "resp": {"time": 1619751395885, "text": "Thank you for your feedback!"}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "108870121787729317624", "name": "krystal anagnos", "time": 1616067686344, "rating": 5.0, "text": "Everyone is super friendly, and kind. They are always smiling and making you feel as comfortable as possible. They're full of energy and constantly keeping everything clean. They really know what they are doing here.", "pics": null, "resp": {"time": 1616069410496, "text": "Thank you for your kinds words!"}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "102390215597323271208", "name": "Ashley Haywood", "time": 1618840101453, "rating": 5.0, "text": "Very professional and helpful. Patrick helped me with a problem I've been battling for 2+ years. I could not be more happy with the outcome.", "pics": null, "resp": {"time": 1618849998718, "text": "Thank you so much for your kind words!"}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "115901091475380193393", "name": "Clay Ogata", "time": 1617893282619, "rating": 5.0, "text": "I have had 9 surgeries - BY FAR the BEST PT results I've ever had.", "pics": null, "resp": {"time": 1618850222676, "text": "Thank you so much for your kind words!"}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "109688597485833011438", "name": "Deb Hall", "time": 1614205479458, "rating": 5.0, "text": "Visiting Therapy South was like visiting family or friends. Everyone was very personable and kind, they truly care about their patients, thanks everyone!", "pics": null, "resp": {"time": 1614457985620, "text": "Thank you so much for your kind words!"}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "108665004737457645456", "name": "sydney garner", "time": 1591657215119, "rating": 5.0, "text": "Best treatment I have found thus far. Robert Harris-Physical Therapist-completed corrected and healed my low back and hip pain in less than 3 weeks. He was thorough and highly informative. I also highly recommend dry needling as a super effective technique that was used to help with my muscle tightness/soreness. I will return to Therapy South anytime I have a PT issue that needs to be addressed.  Highly recommend!", "pics": null, "resp": {"time": 1594652151876, "text": "Thank you so much for your kind words!"}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "107725574111493939571", "name": "Harrison Wachtler", "time": 1589996330726, "rating": 5.0, "text": "I've been to therapy south for two different injuries and each time I have been given professional and specific treatment. I wouldn't go anywhere else in the southeast for physical rehabilitation. Therapy South is second to none !", "pics": null, "resp": {"time": 1594652218236, "text": "Thank you so much!  We always try to deliver five star level physical therapy!"}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "100367487795056514132", "name": "Kalani Long", "time": 1582848718041, "rating": 5.0, "text": "This place has fixed both my husband and I. We are incredibly grateful for the team at Therapy South. The staff is kind, hardworking and devoted to making their patients feel relief and ultimately healing them. I highly recommend Therapy South to anyone in need of PT. You will get the results you need around people that deeply care.", "pics": null, "resp": {"time": 1594124884382, "text": "Thank you so much for your kind words!"}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "100365734465568490109", "name": "Shawna Tatarchuk", "time": 1601237095268, "rating": 5.0, "text": "I have been suffering with plantar fasciitis for five years. Being an active person who likes to hike and lives on a farm, I immediately went to the doctor and was referred for physical therapy. It didn't help at all. Over the last five years, I have tried different doctors who have referred me to different physical therapists, with no change in pain level.\nAt my last doctor's appointment, my primary doctor asked if anything was bothering me and I told him I still had plantar fasciitis. We talked through my experience and he suggested I try a different podiatrist, Dr. Stark. Dr. Stark immediately referred me to Therapy South and asked that I see Robert Harris. I went to the appointment not expecting any different outcome but I am so glad I went! Robert was encouraging, saying he had a plan and he felt confident he could help me. We started with therapy three times a week, addressing first the plantar problem but then working backward to involve the parts of the leg and hip that caused the injury in the first place. Robert gave me four exercises to do twice daily at home and I logged exercise sessions through an easy to use app. Each appointment has been a teaching experience. Robert asks how I'm doing, I tell him how I'm progressing or having problems and he immediately explains and teaches me a stretch or exercise that will help. Robert's goal is to teach me strategies to address problems independently in the future. Each week finds me feeling better, my plantar fasciitis pain now almost completely gone. I am truly thankful to Therapy South!\nI recommend Therapy South and Robert Harris for anyone needing physical therapy. They are knowledgeable and extremely professional!", "pics": null, "resp": {"time": 1601314401818, "text": "Thank you so much for your kind words!"}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "100411651831569392864", "name": "Robin Miner", "time": 1596138762149, "rating": 5.0, "text": "Great therapists!  Easy to schedule, clean, maintains COVID era precautions, spends time seeing where I am in rehap process.  Kind, friendly  staff.  Gives good instructions in appropriate exercises. Caring folks.", "pics": null, "resp": {"time": 1596144583367, "text": "Thank you so much for your kind words! We are doing everything we can during these difficult times to take great care of our patients!"}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "100897734112454345556", "name": "savannah hardin", "time": 1594360099984, "rating": 5.0, "text": "they are the best! they care about their patients. and they always have the best music, which makes pt a little bit more fun", "pics": null, "resp": {"time": 1594651836817, "text": "Thank you so much for your review!! PT is always so much better when everyone is having fun!"}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "108303674489061056419", "name": "Brandy Willoughby", "time": 1615814587237, "rating": 5.0, "text": "Very professional, friendly  staff and never a long wait for your appointment. I still use what they showed me to this day.", "pics": null, "resp": {"time": 1615818237359, "text": "Thank you for your review and your kind words!"}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "101682348284250719098", "name": "Lori Pahls", "time": 1584423229750, "rating": 5.0, "text": "Dr. Robert & staff were great! I highly recommend Therapy South! I live in Southern California & was in Auburn for a month awaiting the arrival of my first grandchild. They were so accommodating& nice!", "pics": null, "resp": {"time": 1594124896354, "text": "Thank you so much for your kind words!"}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "114201783050145916563", "name": "Amy", "time": 1582744931030, "rating": 5.0, "text": "Therapy South in Auburn has been my saving grace after my knee replacement in December. Can physical therapy be painful? Yes, BUT it is worth every tear I shed.....don’t be afraid!!! No pain, no gain!!! I truly believe that the therapists here are the reason I’m walking “normal” again. Robert, Dreher, Cody, Erick, and Patrick are the absolute BEST!!! And I can’t forget Claire who always greets you with a smiling face each and every time you come. Thank you Therapy South for everything you did and continue to do for me and my mobility!", "pics": null, "resp": {"time": 1582770407881, "text": "Thank you for your kind words!"}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "103594352841685959829", "name": "Linda Speedy", "time": 1566863735930, "rating": 5.0, "text": "My experience with these outstanding professionals has been exceptional.  They provide personal care taking time to understand your physical needs.  I had been in the hospital for a month.  My husband died while I was in intensive care. When I was finally released I soon found out I had cancer.  After chemo I was finally told I was cancer free. My life was totally turned upside down.  Emotionally I was a wreak; physically I was weak and was walking with a great deal of pain.  I was referred to Therapy South.   Eric and Robert\n( PTs at Therapy South) listened  and found exercises that slowly improved my strength and eased my pain.  Soon I regained my self confidence and realized there was life to be lived.  I thank God every day for these two gentlemen.  He has given them the gift to heal.", "pics": null, "resp": {"time": 1566908040017, "text": "Thank you so much for your kind words!"}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "108321219334556693539", "name": "Drew", "time": 1568233940271, "rating": 5.0, "text": "Heroes. After 7+ months of pain and not many answers, I went to Therapy South not really knowing what to expect. But after a few months of consistent visits and help from these great people, I'm finally pain free. The people at Therapy South not only help you get better, they make an effort to get to know you and be apart of your path to recovery. Hopefully I wont be needing PT anytime soon, but if I do, it's nice to know there's a place like Therapy South I can go. Thank you everyone there.", "pics": null, "resp": {"time": 1571834622344, "text": "Thank you so much for your kind words!"}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "103563655433064994048", "name": "James Caglianone", "time": 1581688637065, "rating": 5.0, "text": "10/10 experience. I’d recommend therapy south to anyone dealing with pain and discomfort whether mild or severe. My knee was painful and would lock up, even just sitting in class so I was referred to here. Between the in clinic work, the at home exercise programs they made for me, and the positive and fun attitude from everyone in the clinic it was a very positive experience and my knee significantly improved by the end of my time here!", "pics": null, "resp": {"time": 1581912446140, "text": "Thank you for your kind words!"}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "107944052656278933906", "name": "Jimmy Doan", "time": 1598202194184, "rating": 5.0, "text": "Had to come here for my knee and they helped strengthen the muscles in my leg and allowed me to get back to playing basketball again. The people here knew what to do to get me back to playing and knowledgeable on which muscles to target", "pics": null, "resp": {"time": 1598207212283, "text": "Thank you so much for your kind words! We love being able to get people back to their personal goals!"}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "106861020060427714478", "name": "Will Brown", "time": 1573636174371, "rating": 5.0, "text": "Great service. They are very professional and care about their clients. I would recommend  Therapy South Auburn  for anyone who needs physical therapy.", "pics": null, "resp": {"time": 1573653561287, "text": "Thank you for your kind words!"}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "116867812206735476166", "name": "Jacque Kochak", "time": 1557876942996, "rating": 5.0, "text": "I ALMOST enjoy physical therapy because the guys are a lot of fun, and they know their stuff. I can't say enough good things about Cody Klein and the others. And I think they genuinely care about my knee.", "pics": null, "resp": null, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "100783362415188835809", "name": "John Sisson", "time": 1556141424094, "rating": 5.0, "text": "Robert was one of the best therapist I have ever had. He was so knowledgeable and knew exactly what was wrong and why that part of my back was hurting. Everyone was so nice and welcoming there and I will definitely be back!", "pics": null, "resp": {"time": 1556751068378, "text": "Thank you! We are so glad to be part of the Auburn community and to be able to provide personal, hands on care to patients."}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "102995844851346223535", "name": "Buddy Holland", "time": 1537938530816, "rating": 5.0, "text": "Awesome job and care in helping patients in need.\nThank you so much for all your hard work and kindness. I would recommend anyone to come here for help.", "pics": null, "resp": {"time": 1556045590650, "text": "Thank you!  TherapySouth Auburn strives to offer the highest quality physical therapy care in our area!"}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "114180628915347050621", "name": "Santana Flowers", "time": 1549675369342, "rating": 5.0, "text": "Therapy South is truly a welcoming and comfortable environment. They make sure you are extremely taken care of throughout the entire process, from explaining startup and insurance to working through the exercises to get you better. If I ever have any need for physical therapy in the future Therapy South will be my go to! Highly recommend It!", "pics": null, "resp": {"time": 1549906074807, "text": "Thank you for the kinds words and for your support!"}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "110751257473065738495", "name": "Richard Dukes", "time": 1525135115450, "rating": 5.0, "text": "I highly recommend TherapySouth! The staff are professional, friendly, and genuinely care for your physical health. My issue was quickly and correctly diagnosed and that staff had me back feeling like myself again in no time. If you want the best in physical therapy then TherapySouth is the place for you!", "pics": null, "resp": {"time": 1556045618314, "text": "Thank you!  TherapySouth Auburn strives to offer the highest quality physical therapy care in our area!"}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "100786507422072641624", "name": "nathan turner", "time": 1549644150905, "rating": 5.0, "text": "Amazing staff from the greeting desk to those who work with the clients.  They will go the extra mile to make sure you are back to feeling your best.  Could not imagine this process being any easier.  Thank you to all at TherapySouth.", "pics": null, "resp": {"time": 1549663080930, "text": "Thank you for the kind words!"}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "110751257473065738495", "name": "Richard Dukes", "time": 1525135115450, "rating": 5.0, "text": "I highly recommend TherapySouth! The staff are professional, friendly, and genuinely care for your physical health. My issue was quickly and correctly diagnosed and that staff had me back feeling like myself again in no time. If you want the best in physical therapy then TherapySouth is the place for you!", "pics": null, "resp": {"time": 1556045618314, "text": "Thank you!  TherapySouth Auburn strives to offer the highest quality physical therapy care in our area!"}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "107098080087747586572", "name": "Sharon Potter", "time": 1493834758602, "rating": 5.0, "text": "Best Physical Therapy place in our whole area!  I have been to many, and Therapy South is By Far The Best of The Best!  The entire staff is so nice,\nand my PT was Dr. Robert Harris, DPT, and the Manager.  He was outstanding, such a nice person, and an excellent PT.  All the PT's there are wonderful. Such a lovely place to go if you need Physical Therapy.\nI spent two months going there, and I would never go elsewhere.", "pics": null, "resp": {"time": 1556751290539, "text": "Thank you for your kind words!"}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "115392759618970517642", "name": "Chris Gomes", "time": 1539385222004, "rating": 5.0, "text": "This is the best PT clinic in the Auburn/Opelika area HANDS DOWN. I received the best post-surgery care that I could have asked for. The staff members are kind and personable and they make the overall experience fun and enjoyable. Each physical therapist does an outstanding job creating a beneficial one-on-one physical rehabilitation program and it is very obvious that your progress is their top priority. Would not go anywhere else!", "pics": null, "resp": {"time": 1556751109941, "text": "Thank you for your kind words!"}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "108195048121281616770", "name": "Lydia Blanton", "time": 1515213023822, "rating": 5.0, "text": "I had my first experience at Therapy South today and I must say I was extremely impressed! I felt so welcomed as soon as I walked in the door from meeting Miss Kim at the front desk to working with my therapist Robert and all of the staff and students! I’ve been to therapy places before where I’ve felt like they just get you through the process and let you go. Robert made sure I understood every exercise and what it was doing to my body & explained what I should and shouldn’t be feeling (which is very important to me after the extensive surgery I had). I felt like all of the staff genuinely cared and I’m looking forward to continuing my care here. I will definitely recommend Therapy South to friends and family!", "pics": null, "resp": {"time": 1556751269676, "text": "Thank you! We are so glad to be part of the Auburn community and to be able to provide personal, hands on care to patients."}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "114507160043350935190", "name": "Allie Weingarten", "time": 1464798393445, "rating": 5.0, "text": "I recently had an appointment at TherapySouth Auburn and I cannot speak highly enough of the people there. The physical therapist's, Robert and Emily, are both very knowledgeable, professional, and caring. You can tell that they love what they do and that they genuinely want to help you through your rehabilitation. I was very impressed with the rest of the staff as well. Everyone was thorough and diligent, but also kind and welcoming. If you need to see a PT, definitely check out TherapySouth!", "pics": null, "resp": {"time": 1556751320939, "text": "Thank you for your kind words!"}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "103978168937194961043", "name": "Amanda Healy", "time": 1533586487695, "rating": 5.0, "text": "I started going to TherapySouth while I was a student at Auburn.  I have hip problems and was trying to make myself stronger to prolong getting a replacement. I felt so comfortable with Robert and his staff that I just couldn’t stay away. Fast forward a couple years, I went back to TherapySouth Auburn for rehab after both of my hip replacement surgeries even though I currently live in the Birmingham area. I enjoy going to TherapySouth because they actually listen to my concerns, silly ones and serious ones, and talk things out with me until I feel comfortable. They show me compassion and respect and maintain the utmost professionalism. They have and continue to give me all the tools I need to succeed post-op and I appreciate them so much for it!", "pics": null, "resp": {"time": 1556751193431, "text": "Thank you!  TherapySouth Auburn strives to offer the highest quality physical therapy care in our area."}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "101470634012475366768", "name": "April Click", "time": 1452724951604, "rating": 5.0, "text": "Went in after a fall that resulted in intense pain.  They are extremely friendly and always professional.  They aren't just trying to fix the short term.  Robert made sure to explain everything he did and how it would affect my body short and long term.  I have already recommended Therapy South to several people and will continue to send others there!", "pics": null, "resp": {"time": 1556045658500, "text": "Thank you!  TherapySouth Auburn strives to offer the highest quality physical therapy care in our area!"}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "114754395294719384348", "name": "Lucas Miller", "time": 1470078017134, "rating": 5.0, "text": "I injured my back quite severely and they were able to take me through a rehab program that allowed me to return to function without surgery. I am a Certified Athletic Trainer, so from a professional perspective Robert, Emily and the rest of the staff were very knowledgeable. They did a good job of explaining things to patients \"in English\" while also explaining things to me in the medical jargon I understood. If I were staying in the area and had a team I was working with that needed PT services, I would absolutely refer them to Therapy South without hesitation.", "pics": null, "resp": null, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "105918076003204113812", "name": "Tristan Hughes", "time": 1467047124891, "rating": 5.0, "text": "Absolutely great. They are aware of the science and the office is full of energy, but it's not in your face. This is the third and best PT I've been to. Everyone is kind and very good at their job.", "pics": null, "resp": {"time": 1556045683188, "text": "Thank you!  TherapySouth Auburn strives to offer the highest quality physical therapy care in our area!"}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "109043531549713561680", "name": "Casey R", "time": 1455925279955, "rating": 5.0, "text": "I came to TherapySouth in 2015 with extreme pain and muscle spasms in my neck and arm due to a cervical disk herniation. The injury happened around 1 year before I became their patient.  During that year, I had no luck controlling the pain with pharmacological therapy, cervical steroid epidurals or a previous round of physical therapy. I found myself in bed and in tears almost daily due to the pain the pain I felt. It affected my schoolwork, my social life, and my ability to do general everyday activities like driving etc.\n\nI was very apprehensive about physical therapy when it was prescribed to me for a second time. The first time around (at a different facility in the Auburn area) physical therapy left me feeling defeated and in more pain than ever. However, after my very FIRST visit with Robert, I knew that TherapySouth was the place to be. He took his time to get every detail about my pain level, mobility, daily activities and most importantly, my end goals for therapy.\n\nHe created a workout and therapy plan tailored to my specific needs and abilities.  After every session I felt increasingly better. Nine months later, I am able to do most activities that I want/need/love to do without ANY pain and I have gained muscle strength and flexibility that I so desperately needed.\n\nI really don't know what I would have done without the physical therapists Robert and Emily, their interns, and the wonderful staff at TherapySouth-Auburn. They are all amazing, caring and thoughtful individuals and their skills and knowledge are exemplar. I am so thankful to have been under their care.", "pics": null, "resp": null, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "105918076003204113812", "name": "Tristan Hughes", "time": 1467047124891, "rating": 5.0, "text": "Absolutely great. They are aware of the science and the office is full of energy, but it's not in your face. This is the third and best PT I've been to. Everyone is kind and very good at their job.", "pics": null, "resp": {"time": 1556045683188, "text": "Thank you!  TherapySouth Auburn strives to offer the highest quality physical therapy care in our area!"}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "113824568951731371992", "name": "Charlie Crawford", "time": 1560944546239, "rating": 5.0, "text": "Over a lifetime of injuries, from motorcycle accidents to on-the-job, to athletic, I have been prescribed physical therapy many times.   A year and a half ago, I could no longer live with my shoulder pain, both sides due to torn rotator cuffs.  My orthopedist said surgery was likely the only way to successfully heal.  I did not want that and asked for a PT referral.  I began therapy at TherapySouth in January 2018 and was surprised at how thorough and caring the folks were.  I was asked detailed questions throughout my initial evaluation and follow-up questions during each exercise.  Robert and Dreher would adjust exercises according to my limits and evaluate my ongoing recovery at each session.  By April, I had almost full motion in my arms/shoulders, pain was gone, and I even could reach around back to scratch my shoulder blades!  All without any NSAIDS or other drugs.\n\nSo when I began having elbow pain this year, I asked my doctor for a referral to TherapySouth.  Once again a thorough evaluation of my pain and its source was done by Robert.  By the second session I was already experiencing significant relief from pain that was serious enough to keep me awake at night.  And no drugs!  During my last session, I menbtioned that I also suffered from occipital neuralgia.  Robert did not seem surprised and showed me how complex the relationship with all the tendons, muscles, etc in the back and neck can end up causing pain and trigger points.  Here I am two days later with reduced pain throughout my neck, back, shoulders.\n\nIf you are injured, TherapySouth is the place to go for Physical Therapy.  I've literally been to dozens of therapists over a lifetime.  No one comes close to these folks.  If I could give them 10 stars instead of 5 I would do that.  I'm lucky to have found them and grateful for all they have done for me.  I would never go elsewhere.", "pics": null, "resp": {"time": 1561086865007, "text": "Thank you for your kind words!"}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "108558681593157074514", "name": "Angela Fells", "time": 1524087235815, "rating": 5.0, "text": "Know one wants to go to therapy.  However, if you do you want to be treated by people who care. I have been coming here for a while now. I have been seen by every therapist that works here. I am pleased to say, THEY ALL ROCK!!  Even though Dreher can’t sing he makes my day all three days that I come. If you need therapy, Sarah, Robert, and Dreher are all good choices. Congratulations on your upcoming wedding. Angie Fells", "pics": null, "resp": {"time": 1556751208541, "text": "Thank you for the kind words!"}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "108254661923557576800", "name": "Jan Sikes", "time": 1536325194627, "rating": 5.0, "text": "My journey with Therapy South began during the most painful incident in my life----a fall.\nDr. Robert Harris and the dedicated professional at Therapy South brought me back from excruciating pain and walking with a cane to complete healing.\nI have returned to them for shoulder and jaw issues and the results have been the same.  They are professional, courteous, caring and highly skilled.  They give attention to the smallest details like warming the electrolysis pads after each therapy session.\nEach member of the team has a genuine desire to return their patients to a state of wellness and optimum quality of life.  I highly recommend Therapy South .  I will continue to return to them for all my physical therapy needs….They are Miracle Workers.", "pics": null, "resp": {"time": 1556751170117, "text": "Thank you!  TherapySouth Auburn strives to offer the highest quality physical therapy care in our area."}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "112989492894443566658", "name": "Nick Boyle", "time": 1532711024079, "rating": 5.0, "text": "I have been visiting Therapy South in Auburn for the last four months. I started my treatments unsure of my particular ailments. Robert and Cody Klein were instrumental at identifying the roots of my pain and improving my orthopedic state. Thanks Therapy South of Auburn Staff.", "pics": null, "resp": {"time": 1556045634476, "text": "Thank you!  TherapySouth Auburn strives to offer the highest quality physical therapy care in our area!"}, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "104250393997934526297", "name": "Shannon Manley", "time": 1478725798129, "rating": 5.0, "text": "The staff is absolutely amazing. They will push you to get the most out of your rehab experience. They want you to not only get well but to be able to do the things you want to do post injury.", "pics": null, "resp": null, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "110465147227540884423", "name": "Nan Williams", "time": 1449239629799, "rating": 5.0, "text": "Very professional and caring group.  Could not ask for a better experience.\n]Really helped with my problem. I thank and appreciate them all.", "pics": null, "resp": null, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "110232768298757351842", "name": "Warren Smith", "time": 1445461901932, "rating": 5.0, "text": "I was referred for physical therapy after cervical stenosis corrective surgery (ACDF).  In layperson terms, I needed help to retrain my muscles to function normally after years of unconscious tension and stiffness around my area of pain in my neck.\n\nI was blessed to find my way to Therapy South in Auburn where the staff of PT experts assessed my condition, then developed a plan to get me back to normal, pain free movement and function. The lead Therapy South professionals are DPTs  (Doctor of Physical Therapy).   These professionals impressed me every visit with their deep knowledge of the human body and how to help it recover from injury or surgery.\n\nWhen I first came to Therapy South, I had neck tightness and pain, leg weakness and very poor balance.  After just a few weeks, the staff at Therapy South helped me with treatments and exercises that completely removed the pain, dramatically reduced the stiffness, and helped me make huge progress in returning to normal balance.  I feel so much better about my physical health today because the team at Therapy South delivered effective care and treatment.  They have the expertise, the facilities and the patient first mentality to make a big difference in therapy for improvement in quality of life use of the body.  Without reservation, I recommend Therapy South to anyone in need of help to recover lost or limited physical movement, or relief from pain.", "pics": null, "resp": null, "gmap_id": "0x888cf290b4d05f23:0xc9bb75fdde5ab561"}
{"user_id": "111527671942217555440", "name": "heather Elkins", "time": 1621775970525, "rating": 5.0, "text": "Absolutely love this place!! My child was down with a fractured hip. Luke is the best therapist and was very knowledgeable,caring,patient and understanding when it came to getting my son back up and going!!! I will recommend them to anyone that need therapy!!!", "pics": null, "resp": {"time": 1621795980374, "text": "Thank you so much for your kind review! We appreciate you very much :)"}, "gmap_id": "0x888bc33693ee0575:0x8eb6018b24183117"}
{"user_id": "113981204569756906005", "name": "Margaret Calloway", "time": 1605496006499, "rating": 5.0, "text": "In November 2017 after a left knee joint replacement, I received physical therapy services (at TherapySouth Talladega, AL).  The results were very good.  Therefore in July 2020, I chose TherapySouth after having my right knee joint replacement.  The therapists & staff display professionalism, a caring manner, and a team approach.  Regarding the services provided, they are prompt, patient oriented, and well informed.  While receiving the services, they provide for a relaxing, pleasant, cordial and clean environment.  I would definitely recommend TherapySouth.", "pics": null, "resp": null, "gmap_id": "0x888bc33693ee0575:0x8eb6018b24183117"}
{"user_id": "117272168323948563703", "name": "Barbara Armstrong", "time": 1615424945406, "rating": 5.0, "text": "The therapists were very friendly, answered any questions that I had, and were very helpful with the exercises and explained them well.", "pics": null, "resp": {"time": 1615434630766, "text": "Thank you!"}, "gmap_id": "0x888bc33693ee0575:0x8eb6018b24183117"}
{"user_id": "108165568697612125908", "name": "Alex Shirey", "time": 1621450389434, "rating": 5.0, "text": "Highly recommend extremely friendly staff and great facility", "pics": null, "resp": null, "gmap_id": "0x888bc33693ee0575:0x8eb6018b24183117"}
{"user_id": "105751853607079839447", "name": "Tasha Nunnelley", "time": 1602352699933, "rating": 5.0, "text": "I can not say enough how professional and kind the team at TherapySouth-Talladega are! Along with being highly skilled in their field, they still keep the vibe and environment within the clinic upbeat, positive, humorous...basically a “small town feel” that fits perfectly in Talladega. I highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x888bc33693ee0575:0x8eb6018b24183117"}
{"user_id": "102346875542928316065", "name": "Lillie Cooley", "time": 1597354995802, "rating": 5.0, "text": "I love Therapy South. They treated me so good. Had helpful  things I could do at home. Very professional group here. Will definitely recommend them to everyone.", "pics": null, "resp": {"time": 1597668869669, "text": "Thank you very much!"}, "gmap_id": "0x888bc33693ee0575:0x8eb6018b24183117"}
{"user_id": "108338480364494540341", "name": "Rebecca Beard", "time": 1562876353195, "rating": 5.0, "text": "Love Therapy South I've been twice. They are wonderful. Friendly and caring. I wouldn't hesitate to use them again.", "pics": null, "resp": {"time": 1566168572932, "text": "Thank you!"}, "gmap_id": "0x888bc33693ee0575:0x8eb6018b24183117"}
{"user_id": "107993233746278688773", "name": "Helen Waldrop", "time": 1551135781382, "rating": 5.0, "text": "Love Therapy South in Talladega.  Linda, Luke, Tasha, and Allison are all very friendly and professional. Their concerns for your wellbeing are genuine. Very relaxed atmosphere. Highly recommend.", "pics": null, "resp": {"time": 1551147151568, "text": "Thank you so much for your wonderful feedback! Best wishes!"}, "gmap_id": "0x888bc33693ee0575:0x8eb6018b24183117"}
{"user_id": "111946331216614762545", "name": "Tonya Shepard", "time": 1547053716934, "rating": 5.0, "text": "Special thanks to the staff at Therapy South in Talladega.  I have successfully completed my therapy.  I can't began to explain how comfortable they made me feel.  When my pain was too severe they allowed me time to rest, I never felt rushed.  When I had questions they were there to answer them.  When I needed to discuss my pain, once again they were there.  Thanks again Therapy South for always being there!", "pics": null, "resp": {"time": 1547057500907, "text": "Thank you so much for the kind words. :)"}, "gmap_id": "0x888bc33693ee0575:0x8eb6018b24183117"}
{"user_id": "103062490588041680702", "name": "LaTrice Pruitt", "time": 1571419287175, "rating": 5.0, "text": "Thank you for helping me get my knee better", "pics": null, "resp": {"time": 1571438950484, "text": "Thank you so much!!!!!"}, "gmap_id": "0x888bc33693ee0575:0x8eb6018b24183117"}
{"user_id": "112840005545876474944", "name": "Belinda Hutchinson", "time": 1576493218674, "rating": 4.0, "text": "Great therapist and friendly staff members", "pics": null, "resp": null, "gmap_id": "0x888bc33693ee0575:0x8eb6018b24183117"}
{"user_id": "104505050774200974803", "name": "Valeria Hill", "time": 1583455852441, "rating": 5.0, "text": "Very friendly n help me alot", "pics": null, "resp": null, "gmap_id": "0x888bc33693ee0575:0x8eb6018b24183117"}
{"user_id": "101088306261898178953", "name": "Walette Morris", "time": 1581373453642, "rating": 5.0, "text": "My therapist Todd Hood got me back at my goal of 100%..... Thanks a million", "pics": null, "resp": null, "gmap_id": "0x888bc33693ee0575:0x8eb6018b24183117"}
{"user_id": "106589351846001995409", "name": "ZD Mc", "time": 1537506593941, "rating": 5.0, "text": "Awesome staff, fun to work with. I highly recommend this place if you find yourself in need of physical therapy.", "pics": null, "resp": {"time": 1562630680385, "text": "Thank you for the kind words!"}, "gmap_id": "0x888bc33693ee0575:0x8eb6018b24183117"}
{"user_id": "100791903595388258568", "name": "The Solitary Eclectic Witch", "time": 1578867371551, "rating": 5.0, "text": "Friendly staff, neat and clean", "pics": null, "resp": null, "gmap_id": "0x888bc33693ee0575:0x8eb6018b24183117"}
{"user_id": "114611945206373821487", "name": "Brenda Jackson", "time": 1565978574920, "rating": 5.0, "text": "very nice people who work there", "pics": null, "resp": {"time": 1566168534866, "text": "Thank you very much for your kind words!"}, "gmap_id": "0x888bc33693ee0575:0x8eb6018b24183117"}
{"user_id": "107125747267528515047", "name": "Erica ONeal", "time": 1560449220052, "rating": 5.0, "text": "Good place n nice people", "pics": null, "resp": {"time": 1562630611115, "text": "Thank you!"}, "gmap_id": "0x888bc33693ee0575:0x8eb6018b24183117"}
{"user_id": "102731998558271987215", "name": "Sheila Goodwin (Stwinky)", "time": 1582127810800, "rating": 5.0, "text": "Nice people", "pics": null, "resp": {"time": 1582138373177, "text": "Thank you very much for your kind words!"}, "gmap_id": "0x888bc33693ee0575:0x8eb6018b24183117"}
{"user_id": "101603465472267302491", "name": "Vallissa Pearson", "time": 1573312689057, "rating": 5.0, "text": "Wonderful", "pics": null, "resp": {"time": 1576028179152, "text": "Thank you!!"}, "gmap_id": "0x888bc33693ee0575:0x8eb6018b24183117"}
