{"user_id": "117326992469845698560", "name": "Dallas Cooper", "time": 1623776859752, "rating": 5.0, "text": "Excellent Company to do business with!", "pics": null, "resp": {"time": 1623781562482, "text": "Dallas, thanks so much  for the review and the kind words. We’ll make sure we keep taking care of you."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "107966793811712425678", "name": "Adam Brown", "time": 1594836446752, "rating": 5.0, "text": "Responsive and courteous.  Knowledgeable about printing technology.  Best business around for all of your printing needs.", "pics": null, "resp": {"time": 1594868171230, "text": "Adam, thanks so much for the review.  I hope we continue to provide you good services.  Thanks!"}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "112004212507799031401", "name": "Debbie Veesey", "time": 1566589389193, "rating": 5.0, "text": "The Lioce Group has been servicing our business for several years. We recently had the pleasure of working with Patrick our new Account Executive. He came in, did a survey of our current machine and was able to reduce our cost with a NEW CANON!!! Great team of guys came in, removed the old one and replaced it promptly with no interruption to our busy day!  I recommend this company - great equipment - BETTER PEOPLE!", "pics": null, "resp": {"time": 1568213912188, "text": "Debbie, thanks for that outstanding review.  Patrick is awesome and i’m glad he’s taking care of a great customer like you."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "107042134617502579202", "name": "Michele Tate", "time": 1579106166042, "rating": 5.0, "text": "Whitesburg Christian Academy is blessed to have Lioce supporting all of our copier needs.  They are kind and courteous in all their dealing with us, which are prompt and thorough.  We have never been disappointed in our service.", "pics": null, "resp": {"time": 1579113225019, "text": "Thanks Michele for that great review.  So happy to here we are taking care of you. Whitesburg has been such a great customer."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "105327482153879075945", "name": "Jon Canterbury", "time": 1554994699167, "rating": 5.0, "text": "We have been associated with the Lioce Group for many years and they have given us the great service. The one thing that really sets them apart from other copier companies is their service department. They are local and very responsive. The technicians are well trained and very responsive to our needs. This is the main reason we have remained with them. Their sales team is very good and are always trying to understand our operation and keep with our changing needs as well as the advancements made in the technology. All this is at a fair price. To sum it up good equipment and local responsive service.", "pics": null, "resp": {"time": 1555034888128, "text": "Jon, thanks so much for the great review.  We appreciate your business and I’ll make sure we keep up the good service.  Much appreciated."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "115641533360056790041", "name": "Kathy Miller", "time": 1563382205452, "rating": 5.0, "text": "We purchased a Canon copier and TX-3000 from Brooke over 1.5 years ago, we had some issues in the beginning with our TX-3000. Brooke stayed with us the whole time making sure that we received the best possible customer service during our down time. Even though we had some issues Brooke was always here to help make things work right. She didn't just sell us something and leave she continues to give us support. She is the BEST!!", "pics": null, "resp": {"time": 1563410926397, "text": "Kathy, thanks for the review.  I’m aware of the issues and very proud of Brooke staying with you.  Sorry for your troubles, but TLG will be there for the life of the unit.  50 years and counting.  Thanks!"}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "102046625392191030601", "name": "Kevin Thompson", "time": 1551327430584, "rating": 5.0, "text": "The folks at Lioce are the best.  They are very personable and really care about their customers.  They are always there when we need them.   You won't meet a nicer guy than Adam in sales.  He has always taken great care of us.  I also give the highest marks to the service team who always get us running again.  These folks are true professionals.", "pics": null, "resp": {"time": 1551422767768, "text": "Kevin, what a great review, much appreciated.  Thanks!"}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "117501359173597954869", "name": "Lisa Garland Segroves", "time": 1551208646498, "rating": 5.0, "text": "Katie, Patrick, Sonja and Bill have been so awesome to work with! We met the team at Lioce several years ago when we were shopping for a new copier; even though we didn't purchase from them at that time, the stayed in touch and kept us informed on not only copiers but other products as well,. They worked with us to implement Bamboo HR software - what a lifesaver it's been! Countless hours were spent helping us set up the account - their responsiveness and attention to detail make them one of the best vendors we've every worked with. We now own two copiers purchased through The Lioce Group and will stay with them for all of our future needs!", "pics": null, "resp": {"time": 1551545136848, "text": "Lisa, thanks so much for such a great review with detail.  I'm glad we are helping you and we'll keep it up."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "112922969029044215061", "name": "Chris B.", "time": 1551730483388, "rating": 5.0, "text": "The Lioce Group takes care of all of the copier and printer needs for our company. They are always quick to respond and fix any copier issues. They even provide our toner for desktop printers and usually have the toners delivered the next day, if not the same day. I have never had a bad experience with any of the employees, they are always very knowledgeable and friendly!", "pics": null, "resp": {"time": 1551751380807, "text": "Chris, thanks so much for the great review, much appreciated.  Great customer."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "116840498637370810566", "name": "Justin Cantrell", "time": 1556036626099, "rating": 5.0, "text": "My organization uses The Lioce Group for all of our print service needs, There is not been a more professional, knowledgeable, flexible, and customer focused team I have ever seen regardless of industry or business. These guys make business easy for the customer, they make doing business enjoyable, and they have impressive solutions available. Alex C. & John P. especially deserve the highest of grades for their support.", "pics": null, "resp": {"time": 1556199610198, "text": "Justin, thanks so much for such a wonderful review.  I’m glad we’re taking care of you and your company.  Thanks for your business."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "117201486234904058776", "name": "Patricia R Bahr", "time": 1551224381497, "rating": 5.0, "text": "The Lioce Group (TLG) is a reliable and dependable supplier.  We have never regretted selecting them when we made the decision to upgrade our printer/copier/scanning solution and they proposed affordable, multi use machines that are reliable.  We are in a timeline driven business, with hard deadlines to meet our customer needs.  Lioce is a supplier that will help you look good to your customers.  I would not hesitate to recommend them.", "pics": null, "resp": {"time": 1551274806492, "text": "Patricia, thanks so much for the kind words and thanks for your business."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "114332203323498841177", "name": "Leslie Donnelly", "time": 1551202345594, "rating": 5.0, "text": "We absolutely love The Lioce Group. They are always fast, friendly, and supportive. We especially love our rep. Katie Baker. She takes time to get to know us and relationship build. After working in customer service for many years, I know a great company! Thank you TLG!", "pics": null, "resp": {"time": 1551545193317, "text": "Leslie, thank you for being such a great customer."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "110120667939973965987", "name": "Sam Ortega", "time": 1570193341312, "rating": 5.0, "text": "TLG has been servicing our business computers for the last two years. They have been responsive, professional, and courteous and just an all around great customer service organization to work with. Their excellent performance helps our business run smoothly.", "pics": null, "resp": {"time": 1570191947555, "text": "Sam, thanks for your business and thanks for the review."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "104178391459458349420", "name": "Teddy Dawson", "time": 1551215569148, "rating": 5.0, "text": "I've used Lioce Group for my organization's printer/copier needs for over ten years. They are simply the best in business. Great pricing upfront and the support and training you need throughout the life of the product.  They stand behind what they sell with great customer service and outstanding technical support.", "pics": null, "resp": {"time": 1551423133153, "text": "Thanks Ted, you are a great customer.  Let me know if you ever need anything."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "114294957749369407334", "name": "Hazel Green United Methodist Church Hazel Green, AL", "time": 1551194949712, "rating": 5.0, "text": "Everyone at The Lioce Group has been great to work with and their customer service has been top notch. The copier and folding machines that we lease from them are efficient and simple to use. They make our jobs much easier and relatively stress-free.", "pics": null, "resp": {"time": 1551545399849, "text": "Thank you very much.  Hazel Green UMC is a wonderful customer."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "106329439120151265322", "name": "Janice Crowson", "time": 1568051377392, "rating": 5.0, "text": "The level of support and professionalism from this team is beyond compare.  Jason and Dawn are just two that have gone above and beyond in keeping us running.  After 38 years, working in both for profit and not-for-profit environments they provide the highest level of service I have experienced.", "pics": null, "resp": {"time": 1568053028308, "text": "Janice, thank you so much. It’s great to hear Dawn and Jason are taking care of you.  Thanks for being a great customer."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "101102231013662747901", "name": "Regina Abell", "time": 1552060577223, "rating": 5.0, "text": "I have been utilizing The Lioce Group to lease, purchase, and provide maintenance services on my companies copiers, printers, scanners and plotters for over ten (10) years. I competed them out in the beginning and they were not only the lowest priced, but they had more service people with the most experience than an other dealer in town. They offer a 90 minute response guarantee. One of the advantages of working with the Lioce Group is they are a small company and their Accounting Department is much  easier to work with than the Manufacturer Financial Institutions. They have also continued to save my company money year-over-year. I trust them totally to make recommendations for our company as to the size and speed required for the copiers. They have proved they have our companies best interest in mind. I also use them for all my off-site offices. If you are not using the Lioce Group in the North Alabama area, you are paying too much.", "pics": null, "resp": {"time": 1552141044041, "text": "Regina, can’t thank you enough.  You are a great customer and a great lady, we enjoy serving you."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "108451798483247697688", "name": "Benny Ledford", "time": 1558037424732, "rating": 5.0, "text": "Katie and Patrick have been so awesome to work with! I was introduced to Katie at Turner Beverage about two years ago. We were not looking at the time but she provided us with service which evolved to our first printer purchase with them. They worked with us to implement the printer with our shelf tags - their attention to detail make them one of the best vendors we've every worked with. Patrick has taken care of us on our scanner purchase and thru the install. We will work with The Lioce Group  on our future needs!", "pics": null, "resp": {"time": 1558045312341, "text": "Benny, thanks so much for the great review.  I’m so glad we’re taking care of you.  Patrick and Katie are great reps and will continue to support you well.  Thanks!"}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "116386509449921229496", "name": "Dianne Bryant", "time": 1551137032652, "rating": 5.0, "text": "The Lioce Group wrote the script on \"Customer Service.\"  They are responsive, customer focused, and determined to meet the needs of their customers.  Regular hours or weekends they make EVERY effort to satisfy our requests!  I am grateful for Ms. Katie Baker and the entire Lioce team for their professional attitude and timely responses.", "pics": null, "resp": {"time": 1551146567005, "text": "That’s great to hear.  I’m very proud of our people.  Thank you!"}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "102934644979904185061", "name": "Shelia Fox", "time": 1566243953359, "rating": 5.0, "text": "What a great team!  We couldn't be happier with the level of professionalism and service we receive from The Lioce Group.   We highly recommend them!", "pics": null, "resp": {"time": 1566255959072, "text": "Sheila, we very much appreciate the great review.  TLG works hard and will continue to work hard to keep you happy."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "106554288570855422647", "name": "Tracey Burns", "time": 1556223531618, "rating": 5.0, "text": "The Lioce Group has been such a joy to work with and has made our lives so much easier when dealing with our copier needs. Stacey Ridenour has been such a blessing when issues come up  and has gone the extra mile to keep us/the customer happy. I would highly recommend this company because they get the job done and demonstrate a high level of  professionalism.", "pics": null, "resp": {"time": 1556278941886, "text": "Tracey, thanks for the great comments.  It’s great to hear that admin is taking care of our customers.  Stacey is great.  Thanks for your business and this review."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "113199428921321281477", "name": "Bryan Patterson", "time": 1551140914992, "rating": 5.0, "text": "Absolutely the best service and products. All my service calls are addressed promptly and the technicians are very knowledgeable and friendly. Katie is my rep and she goes out of her way to check on me and suffice my needs.", "pics": null, "resp": {"time": 1551146072329, "text": "Thank you very much Bryan.  Katie is great.  Contact me if you ever have an issue."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "105308908813830469093", "name": "Nicole Graves", "time": 1554214269718, "rating": 5.0, "text": "Valley Pools has been working with TLC for several years and have had great service. If the equipment needs to be serviced they are a click away and usually there the same day.  I would recommend TLC for all your office equipment.", "pics": null, "resp": {"time": 1554251530340, "text": "Thanks so much Nicole for the great review.  Valley Pools has been a great customer for a long time.  Glad you are happy."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "117798273842597203489", "name": "Cheryl Westlake", "time": 1551365637764, "rating": 5.0, "text": "The whole team - sales, service, supplies - all work together great to get you exactly what you need in a timely manner. We leased our first copier and entered our first support agreement with them 3 years ago. Recently, when it came time to upgrade the copier, I never even considered shopping around because we have never had another equipment group so responsive and attentive to our business needs. They came in and gave us a few recommendations,  we picked the one we liked best, and they had it delivered and set up in no time. I highly recommend The Lioce Group for all your copier/printer needs. I also plan to branch out and use some of their other services in the future.\n\nCheryl Westlake\nCottage Senior Living, Inc.", "pics": null, "resp": {"time": 1551422716169, "text": "Thank you Cheryl.  I love our team."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "105198040019849838567", "name": "Lana Powers", "time": 1551202614476, "rating": 5.0, "text": "This company is awesome. We decided to do business with them the first of the year and I have not regretted once. We have two pieces of equipment and love them. The service is wonderful because the people are very caring and supportive.", "pics": null, "resp": {"time": 1551423181877, "text": "Lana, that means a lot.  Thanks for the business."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "109431968979565647558", "name": "John Spillman", "time": 1574697277129, "rating": 5.0, "text": "Always friendly to deal with and they have the correct ink for my plotter in stock. I highly recommend The Lioce Group!", "pics": null, "resp": {"time": 1574776199975, "text": "Thanks John.  Our local parts and supplies are key to serving great customers like you."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "103678728155859002173", "name": "Schoel Engineering", "time": 1551205387119, "rating": 5.0, "text": "The service we've received from The Lioce Group has been outstanding. Everyone on their team goes above and beyond to bring the best service possible to their clients. From sales to support, they KNOW customer service.", "pics": null, "resp": {"time": 1551275104236, "text": "Thank you. 4Site is a great company."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "112207884217290891267", "name": "Noah England", "time": 1551132345534, "rating": 5.0, "text": "I’ve worked with 3 different companies that were clients of Lioce, and I have to say they have never fallen short of excellent service. Quality equipment, extremely knowledgeable support team, and some of the best sales reps of any industry I know. Highly recommend them, ask for Katie at Lioce if youre in downtown!", "pics": null, "resp": {"time": 1551147395669, "text": "Noah, what a special review, thanks so much."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "109128065051908196449", "name": "Katie Mashburn", "time": 1568923254213, "rating": 5.0, "text": "The Lioce Group has exceptional customer service!!  They are always quick to respond whether it be ordering toner or showing up for a maintenance call.  We look forward to years of business with them.", "pics": null, "resp": {"time": 1568924539106, "text": "Katie, this may be a duplicate thank you, but thanks again for our 100th 5 Star review."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "116647476735385613878", "name": "Macie Macklin", "time": 1551200643047, "rating": 5.0, "text": "The Lioce Group is knowledgeable, helpful and professional.  They respond quickly to questions and issues.  They made our transition to new machines easy and pain free.", "pics": null, "resp": {"time": 1551423505781, "text": "Thank you Macie!"}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "110491649771095798957", "name": "Jake Mallory", "time": 1557419511391, "rating": 5.0, "text": "The Lioce Group services our out of state equipment in the Huntsville area and does an excellent job.  We can't say enough about how well the partnership between our organization and Lioce Group has benefited the client.  Kudo's on a  job well done.", "pics": null, "resp": {"time": 1557577238592, "text": "Jake, what a great review.  I’m so glad we’re taking care of you.  What a great customer, thank you."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "101078991621172555704", "name": "Jeff Johnson", "time": 1551200383283, "rating": 5.0, "text": "I've used TLG for my business copier and printing needs for years. The sales staff, Adam and Bill have always been more than helpful in helping find the right solution while aligning with my budget. They've also helped me with sales and service for all my US locations. The service staff is also to be noted for their quick friendly repairs and for the assistance answering user questions. Thank you guys!", "pics": null, "resp": {"time": 1551423480383, "text": "Thanks Jeff for a great review.  Our great customer drive us to serve."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "112687003989165665641", "name": "JC Ross", "time": 1596567878546, "rating": 5.0, "text": "Lioce has always been a rapid response team when it come to my printer repairs and supply orders!  Thanks Lioce!!", "pics": null, "resp": {"time": 1582237136474, "text": "JC, we really appreciate the 5 star rating.  I’m glad TLG is taking care of you.  We’ll make sure to keep it up."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "110833652240735344334", "name": "Chase Layton", "time": 1574358856028, "rating": 5.0, "text": "TLG is the best around. We switched over to them from Berney about a year ago and there is no comparison. Not only are they seamless and extremely fast in their support of their products, they also go above and beyond to be proactive in finding additional ways to help automate processes and workflows with their vast portfolio of software solutions. Customer service and dedication to their clients is top notch.", "pics": null, "resp": {"time": 1574365479865, "text": "Chase, can’t thank you enough for those kind words and your business.  SEA is a great company.  TLG is proud to have you as our customer."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "104448893673741274011", "name": "Brandon Sparkman", "time": 1551447118752, "rating": 5.0, "text": "Prompt, excellent service. Very knowledgeable and friendly staff. TLG has been extremely helpful and flexible in working with us to streamline our printing, scanning and faxing needs.", "pics": null, "resp": {"time": 1551448317699, "text": "Thanks Brandon, thanks for the review and your business."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "113578070416297551498", "name": "Alex C", "time": 1556220115332, "rating": 5.0, "text": "I would first like to say that the Lioce Group is a fantastic resource that I have leaned on heavily over the past years.  We have procured copiers and shredders with full coverage maintenance through them and could not be happier. Working in the government is not always easy when it comes to purchases and the strict requirements that go along with it but my rep ,Corey, is knowledgable and understands what we go through and his patience is neverending with it. That rep is the pinnacle of what a salesperson should be. We look forward to many more years of service with them.", "pics": null, "resp": {"time": 1556278735406, "text": "Alex, we really appreciate your business and thanks for these great comments.  TLG works hard to support our government installations and it’s good to hear we are delivering"}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "103006956190960426714", "name": "Larry Pitts", "time": 1551134912659, "rating": 5.0, "text": "Responded well to our needs. Price was more than fair. Katie Baker takes care of her customers. I would highly recommend her & TLG.", "pics": null, "resp": {"time": 1551146862572, "text": "Larry, much appreciated.  We’ll keep it up.  Call if you ever need me."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "100290686362545523556", "name": "Greg Johnson", "time": 1552324229269, "rating": 5.0, "text": "TLG is AWESOME! They have the BEST customer service in the business, hands down. No request is too big for them. They will go way out of their way to make sure you are not only happy with the product but you understand everything about it. Make the switch, chose the best, use TLG for your office needs.", "pics": null, "resp": {"time": 1552351444190, "text": "Greg, much appreciated.  Thanks for the great review.  Hope you are well."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "114263685228066742811", "name": "Richard Pugh", "time": 1570807996342, "rating": 5.0, "text": "Lioce has consistently answered the call and  taken care of my printers when I've needed them. I won't call anyone else. Thanks LIOCE!!", "pics": null, "resp": {"time": 1570810062739, "text": "Richard, thanks for that excellent review.  We couldn’t do it without great customers like you. Much appreciated."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "114505521267028696003", "name": "Denise Bates", "time": 1551198411689, "rating": 5.0, "text": "Outstanding customer service!  Truly a company that values the partnerships and relationships that they create with their clients.  Hexagon (Intergraph) has done business with them for years and we've never been dissapointed!  Great products - Adam and Bill have always brought great ideas to the table and their solutions are spot-on.  I highly recommend them.", "pics": null, "resp": {"time": 1551423295773, "text": "Hexagon is an outstanding company and customer.  Denise is the best, thank you very much."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "112585231716931364098", "name": "Tony Smith", "time": 1551197992313, "rating": 5.0, "text": "They get my copiers back up and running very quickly.  Always friendly, both the techs and customer service.", "pics": null, "resp": {"time": 1551545508816, "text": "Thanks Tony, you are great customer."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "110605971538595618708", "name": "Brad Burns", "time": 1551197781887, "rating": 5.0, "text": "I've been using TLG to support my organization's print/scan/fax units for 5 or 6 years now.  They've always offered great customer service and their technical support is fantastic.  If you're looking to bring in professional help for your printing needs, you should seriously consider using TLG.", "pics": null, "resp": {"time": 1551545491838, "text": "Brad, thanks for the great review, much appreciated."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "114166176690810958877", "name": "Dalton Capley", "time": 1551359057042, "rating": 5.0, "text": "Best in the business, hands down! They do what they say they will do and they always make it right! Fast and Great service!", "pics": null, "resp": {"time": 1551422625699, "text": "That’s great to hear, thanks very much."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "102937759269703095010", "name": "Ron Snyder", "time": 1551194196850, "rating": 5.0, "text": "We've used TLG since 1984. When those few issues have developed, they have handled those problems promptly and professionally. We are totally satisfied with service and the quality and price of what we lease from them. I think we have 5-7 machines here.", "pics": null, "resp": {"time": 1551423574752, "text": "Ron, thanks so much.  What a great customer, we enjoy serving you."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "112647424543275580851", "name": "Karen Elaine Kiger", "time": 1567176124513, "rating": 5.0, "text": "New customer and have been very happy with my quick, efficient and friendly service!", "pics": null, "resp": {"time": 1564488691556, "text": "Thanks Karen for the review and trusting us with your business.  Our best is after the sale, so i hope we continue the good service."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "117862175120154108362", "name": "K Johnson", "time": 1559231533049, "rating": 5.0, "text": "I work for a local non profit and even though we are a smaller account we always receive amazing service in a timely manner.  Katie is awesome to even talk me through a question over the phone.", "pics": null, "resp": {"time": 1559521347363, "text": "Thanks for the review, very much appreciated.  No customer is small to TLG, we treat every customer as a value partner."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "112845880031919525992", "name": "Holly Stapler", "time": 1558457005678, "rating": 5.0, "text": "Great experience working with our team @ TLG....always happy to help and quick to respond", "pics": null, "resp": {"time": 1558463798621, "text": "Thank you Holly, we appreciate your business and your feedback. We will constantly try to serve you better."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "101931646072882246039", "name": "Terry Slay", "time": 1551200657488, "rating": 5.0, "text": "TLG provides excellent service.  Their staff is professional and prompt when a service call is placed.  It is a pleasure to do business with a company that cares about their clients!  I highly recommend TLG.  They are truly a five star organization!", "pics": null, "resp": {"time": 1551423535211, "text": "Thanks Terry, much appreciated."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "115978989821244099188", "name": "Sharna Kennamer", "time": 1569945273819, "rating": 5.0, "text": "We use the Lioce Group at Breland Homes and we love not only their service but their ability to find exactly what we need for a great price!", "pics": null, "resp": {"time": 1551545442975, "text": "Thanks Sharna."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "106986809292242783016", "name": "Selina Mason", "time": 1566250908185, "rating": 5.0, "text": "The Lioce Group has been a staple in Huntsville since I moved here in 1985. The company has grown and diversified along with the city of Huntsville, but  I am willing to bet that their longevity is attributed to the family's commitment to each customer.", "pics": null, "resp": {"time": 1566255356957, "text": "Selina, I can’t thank you enough for this special review.  TLG does care about each customer.  We’re not perfect, but every employee cares.  Thanks!"}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "100710179047777846211", "name": "Wendy Graves", "time": 1551210783621, "rating": 5.0, "text": "Brockwell Technologies, Inc. has been doing business with The Lioce Group for about 10 years.  They are very responsive and easy to work with.  TLG keeps up with the latest technology in order to take care of the changing needs of the Huntsville area.  They are a one stop shop for all our document needs!", "pics": null, "resp": {"time": 1551545065863, "text": "Wendy, what a great review.  Brockwell is a great customer and great company.  Thanks!"}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "113702622410585295891", "name": "Anthony Olinger", "time": 1551277111266, "rating": 5.0, "text": "Great company to do business with. Staff is very knowledgeable and helpfull on the projects I have worked the on and look forward to working with them in the future.", "pics": null, "resp": {"time": 1551423048681, "text": "Thanks Anthony, you are a great customer."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "108944151162973485857", "name": "Zack Penney", "time": 1440040141405, "rating": 5.0, "text": "Friendly professional staff help us keep our office solutions running smoothly. Always responsive and attentive to our needs. 5 Stars in our book. -Zack Penney from Bill Penney Toyota/ Mitsubishi", "pics": null, "resp": null, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "101143206695018526465", "name": "duwayne lamb", "time": 1560283299003, "rating": 5.0, "text": "We enjoy working with TLG. Dawn has been a great help with Fiery and Damon is very thorough and knowledgeable on our machines.", "pics": null, "resp": {"time": 1560298736046, "text": "Thanks Duwayne, much appreciated.  Dawn and Damon are great employees.  Glad they are taking care of you."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "113563605893349650510", "name": "Sonia Teague", "time": 1563543110550, "rating": 5.0, "text": "I have worked with TLG for years, and they are the best!! They have always been very prompt and professional yet kind and so caring! Even when the business I worked for was over an hour away, they were always there to help me either the same day or very early the next morning. I have a very stressful job, so having the peace of mind I have using TLG and knowing I don't have to worry about any of our machines  makes my job so much easier. With their customer service and technicians, they have proven I don't have to be concerned with a broken machine. You can't go wrong by choosing TLG! Use TLG, and you will be so glad you did!", "pics": null, "resp": {"time": 1563638898534, "text": "Sonia, thanks so much. Best review ever.  Glad we are taking care of you."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "114234470755562407209", "name": "Mark Reynolds", "time": 1552390554903, "rating": 5.0, "text": "Great staff to work with! Very supportive and straightforward with advice and information.", "pics": null, "resp": {"time": 1552392516549, "text": "Mark, thanks very much for the review and for your business."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "109978893368785745978", "name": "Roger Wisnosky", "time": 1551198098333, "rating": 5.0, "text": "TLG is very knowledgeable on their equipment and respond in a very timely matter on any issue that may arise.", "pics": null, "resp": {"time": 1551423317500, "text": "Thank you Roger, much appreciated."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "115304600446648531968", "name": "Loretta Hoke", "time": 1551296596673, "rating": 5.0, "text": "Our company, Stratolaunch Systems in Huntsville, AL  has been doing business with the Lioce Group for the past 8 years, and our experience has been nothing short of exceptional. We are a fast-paced and evolving organization, and as such we have found ourselves in several critical situations in which we needed our printing services repaired or modified. Our representative, John Petitt, was always prompt in his assistance and ensured we had our problems resolved in an efficient and effective manner. The services provided by Lioce were broad and extensive, ranging from the installation of printing software to the troubleshooting of malfunctioning equipment, and we have always been helped to our upmost satisfaction. We thoroughly recommend the Lioce Group’s services to anyone in need of exceptional service and high-quality products.", "pics": null, "resp": {"time": 1551422924149, "text": "Loretta, what a great review, thanks.  Stratolaunch is a great company and great customer."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "113284001800065568250", "name": "Nick Thompson", "time": 1551195122259, "rating": 5.0, "text": "Patrick, Bill, and Harry have handled every need we've ever had. They should have a sixth star. They have went out of thier way on several occasions to beat the competion. The service team has a great response time also. Always prompt and freindly. Not many places left these days where the President of the company will step out of his office just to say 'Hi' and make sure you're satisfied. You can't go wrong with Lioce.", "pics": null, "resp": {"time": 1551423634267, "text": "Thank you very much Nick.  That means a lot."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "116917507234335255954", "name": "April Ragland", "time": 1553170093869, "rating": 5.0, "text": "The company I work for has been with TLG for 3 years now.  Very professional staff.  The are very quick to respond and always a pleasure to work with!", "pics": null, "resp": {"time": 1553134789484, "text": "April, thanks so much for the kind words.  Let me know if you ever need anything.  We appreciate your business."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "115751401319869850844", "name": "Andy Roswal", "time": 1551197392827, "rating": 5.0, "text": "Great company.  Very professional and always provides outstanding service.", "pics": null, "resp": {"time": 1551545466327, "text": "Thank you Andy, it's great to hear."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "118234005235467993063", "name": "D Wil", "time": 1551193757700, "rating": 5.0, "text": "Great people to work with. Always prompt in responding to our needs.", "pics": null, "resp": {"time": 1551545353296, "text": "Thank you.  We appreciate your support."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "106197972752552285160", "name": "Rick Angel", "time": 1574114721553, "rating": 5.0, "text": "Lioce is local company that provides great products and great service!", "pics": null, "resp": {"time": 1574365527529, "text": "Rick, thanks for the 5 star.  We’ll make sure to keep up the service.  Thanks for your business."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "106793042678152821751", "name": "cindy mcculloch", "time": 1553094427181, "rating": 5.0, "text": "Brooke Rollins is our rep and she is awesome!!! She is very helpful and is ALWAYS available!", "pics": null, "resp": {"time": 1553716383759, "text": "Thanks Cindy, Brooke does great.  Thanks for the review."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "108155971699523518062", "name": "Jared and Haley Coffell", "time": 1551200330954, "rating": 5.0, "text": "TLG has been one of the best solution providers for the business I work for. I believe a company should be able to offer the best price upfront  with little to no haggling. We started using TLG with 2 MFPs at 1 facility, over the next few years TLG came to the table, time and time again, beating the other local competition on lease and maintenance prices. It was only a matter of time before all other competition was out of all our buildings. TLG didn't stop there and continues still today, consistently taking care of problems as they arise, quickly and efficiently. All of TLG's employees are friendly and professional, I can pick up a phone and talk to a live person at any moment. I recommend them to everyone.", "pics": null, "resp": {"time": 1551423409797, "text": "Jared, thanks, can’t say enough about you and your company.  You have taught us a lot.  Good partnership."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "102582547904390031563", "name": "Brian Mould", "time": 1552929202245, "rating": 5.0, "text": "Over the last 5 years the Lioce Group has worked with us to place office equipment in US Government Facilities. They understand the issues related to the Federal Government and always assist us to make the process a workable experience, both for us, and the client.", "pics": null, "resp": {"time": 1552953885025, "text": "Brian, thanks for a great review.  Much appreciate the partnership."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "108584485776847455148", "name": "Stephanie Nunez", "time": 1551133648095, "rating": 5.0, "text": "We've been using TLG's services at my job (Martinson & Beason, P.C.) for over 5 years and they've been a pleasure to work with.  Our sales representative, Katie Baker, is very attentive and has always been prompt to handle our needs.", "pics": null, "resp": {"time": 1551147139885, "text": "Stephanie, thanks for the review.  I go back with the Martinson’s many years.  I’m glad we are serving you well."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "100354883391890700473", "name": "Maureen Eversmeyer", "time": 1551195286760, "rating": 5.0, "text": "The Lioce Group is always responsive, thorough and kind!  We love them!!", "pics": null, "resp": {"time": 1551545431060, "text": "Thanks Maureen, i'm glad we are serving you well.  We'll work hard to keep it up."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "112628940559485677130", "name": "Dalton Capley", "time": 1561648053270, "rating": 5.0, "text": "Best in the business!! Outstanding work ethic!", "pics": null, "resp": {"time": 1561657496732, "text": "That’s awesome Dalton. Thanks so much."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "102467266534446831930", "name": "Lisa Burroughs La Grone", "time": 1569939446336, "rating": 5.0, "text": "Great service and awesome Sales Rep.", "pics": null, "resp": {"time": 1569949670692, "text": "Thank you Lisa for a great review. I’m glad we’re taking care of you."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "105488028428258956246", "name": "Kathy Tadlock", "time": 1565126586131, "rating": 5.0, "text": "Great products and excellent service!", "pics": null, "resp": {"time": 1568213963668, "text": "Kathy, thanks for the review, much appreciated.  We’re committed to keeping up our service."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "102010895502414007046", "name": "Games By Gamers", "time": 1551198817033, "rating": 5.0, "text": "TLG handles all of our printer needs. They care about their customers and it shows by the great service TLG provides!!!!!!!!!", "pics": null, "resp": {"time": 1551545325398, "text": "Thank you. Yes, we care about every customer.  I'm glad it comes through."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "111551116745139207754", "name": "Chris Urban", "time": 1551286659210, "rating": 5.0, "text": "The Lioce Group has provided our business with excellent service.", "pics": null, "resp": {"time": 1551422991529, "text": "Thank you for the review Chris."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "110421327864490900752", "name": "Vrenda Parham", "time": 1551198672893, "rating": 5.0, "text": "The Lioce Group always delivers the best customer service in the business.", "pics": null, "resp": {"time": 1551423248260, "text": "Thanks Vrenda, make sure we keep it up."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "104822342606591596419", "name": "Curt Cooper", "time": 1551311027395, "rating": 5.0, "text": "Great company! Honest, trustworthy partners!", "pics": null, "resp": {"time": 1551422804664, "text": "Thanks Curt, that means a lot."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "114268212756545372994", "name": "Jolie Ferguson", "time": 1551198881258, "rating": 5.0, "text": "They are very helpful and respond quickly", "pics": null, "resp": {"time": 1551545286715, "text": "Thank you Jolie.  We will work hard to keep the service up."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "116483958040356442316", "name": "Matt Curtis", "time": 1481931393037, "rating": 5.0, "text": "The Lioce Group has been great to work with in getting our new printer up and running. Our sales rep Adam has gone above and beyond to help make us successful.", "pics": null, "resp": {"time": 1551147509321, "text": "Matt, thank you for the kind words.  Adam is great and will stay with you after the install."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "100696964408177001391", "name": "Lisa Jackman", "time": 1554237586413, "rating": 5.0, "text": "They are a great company to work with.", "pics": null, "resp": {"time": 1554249378906, "text": "Lisa, thanks so much for the review.  Much appreciated.  Glad you are happy and glad you are our customer."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "104024441898221226318", "name": "Ray Morring", "time": 1551132977307, "rating": 5.0, "text": "Valent Group - we love working with The Lioce Group!", "pics": null, "resp": {"time": 1551147314310, "text": "Thanks Ray, much appreciated.  Like the new name Valent."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "106804844991568758836", "name": "Daniel Phillips", "time": 1551203633005, "rating": 5.0, "text": "excellent service highly recommend", "pics": null, "resp": {"time": 1551545161943, "text": "Daniel, much appreciated.  Thank you."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "104360201361389516203", "name": "Melanie Vandiver", "time": 1551204989617, "rating": 5.0, "text": "Great customer service!", "pics": null, "resp": {"time": 1551275007502, "text": "Thanks Melanie and thanks for your business."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "107173942484985286050", "name": "mc court", "time": 1554388052180, "rating": 5.0, "text": "Fast, accurate and friendly service", "pics": null, "resp": {"time": 1551545521320, "text": "Thank you very much!"}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "104871074725405858544", "name": "Diana Bradford", "time": 1551204237830, "rating": 5.0, "text": "Excellent customer service", "pics": null, "resp": {"time": 1551274921827, "text": "Thank you Diana, much appreciated."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "111062190331884328957", "name": "Lori Clanton", "time": 1551194458737, "rating": 5.0, "text": "GREAT service!!!", "pics": null, "resp": {"time": 1551545371229, "text": "Thanks Lori, appreciate the review."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "107541876621797816353", "name": "Jeanna Wing", "time": 1627577478068, "rating": 5.0, "text": "Prompt response to needs. Quick installation.  Wonderful instruction and answers to questions on new machine!", "pics": null, "resp": {"time": 1627578279645, "text": "Thanks Jeanna, hope you and the family are well."}, "gmap_id": "0x88626ceeae905b73:0x2a7c046529d84496"}
{"user_id": "104645640064491730202", "name": "GLloyd Philpo'tt", "time": 1541265031922, "rating": 4.0, "text": "Great people who are customer focused", "pics": null, "resp": null, "gmap_id": "0x888a3cb5d64d73e5:0x19017c77047f29b7"}
{"user_id": "114576816214221708687", "name": "Hezzick Doyle", "time": 1620926741452, "rating": 1.0, "text": "SECURITY RISK!!!! Do NOT use this store for any type of document shredding! The staff is very quick to take your money but will leave you documents setting on the countertop while they do other things. Your paperwork is left where other associates and customers can easily go through it. The staff makes it seem that they cannot be bothered to even put it in the secure bin.\nThis review is solely based upon using the shedding services advertised here and I made no other purchases or used any other services here.", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "117577196448874750275", "name": "Alaina Calvert", "time": 1614793995771, "rating": 1.0, "text": "Possibly one of the worst customer service experiences I have ever had. The employee and the manager were both extremely rude and unaccommodating . Staples has lost my business forever. COVID has not only taken lives. It’s also taken people’s common sense, empathy and humility.", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "101407036974856791375", "name": "Ali Ali", "time": 1620679521156, "rating": 1.0, "text": "Possibly one of the worst customer service experiences I have ever had. The employee and the manager were both extremely rude and unaccommodating .", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "106854970677737844425", "name": "Jack LaFountain", "time": 1621550761063, "rating": 3.0, "text": "Self operated copier never works the first try and runs in slow motion.", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "102984504585827780056", "name": "I AM ANIMAL Williams", "time": 1621725171363, "rating": 1.0, "text": "Your website says you close at 7pm on Saturday, but we pull up and you're closing and walking out the door at 6 pm", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "102481674605642714830", "name": "D P", "time": 1614889058499, "rating": 1.0, "text": "I have asthma and have trouble breathing WITHOUT a mask but that didn’t stop your cashier from trying to embarrass me in front of your entire store demanding I wear one.... I won’t be back for school or office supplies.", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "110811343157866360538", "name": "Jeffrey Mayoff", "time": 1611874910423, "rating": 1.0, "text": "Apparently when the website says stores have customer workstations where they can do things like print out documents it means they actually don't have those. Thanks for wasting my time.", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "118291058520299251842", "name": "Brandon Patterson", "time": 1574700201998, "rating": 5.0, "text": "I've always had a great experience shopping at this local Staples but yesterday I really needed a bit of assistance to ensure our store would be all set for a big week. Amber and Michael were extraordinarily patient and helpful with showing me the process on our label gun and also making sure we were purchasing all of the correct components. Thank you so much and we will see you soon!", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "105926492328425021126", "name": "Sonia Ramirez", "time": 1568170230280, "rating": 5.0, "text": "☆☆☆☆☆☆☆☆☆☆\nThey deserve more golden stars!!!\nAlways friendly, polite, great customer Service.\nAlways greeted at the door, wish I love.\nTruly best place to shop for office supplies.", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "101590619371899048002", "name": "Casey Miller", "time": 1602785173952, "rating": 5.0, "text": "There are some things you can only find here", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "118206459249424561645", "name": "Nathaniel P", "time": 1553944706408, "rating": 5.0, "text": "I called and spoke with Chris about last-minute outdoor sign printing options. He answered all my questions and even mentioned their blank yard signs that are available. I arrived minutes later and he was able to take me straight to them and help with answering more questions.\n\nAfter making my selection, Shaun checked me out and she was a delight.", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "103723344862567844755", "name": "Mary O", "time": 1538247681976, "rating": 5.0, "text": "Love being able to look for what I want, finding it, and knowing how many they have in the local store. Very friendly and helpful employees. Always a pleasure to shop there.", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "114530174212200488804", "name": "M A Bell", "time": 1551984302387, "rating": 5.0, "text": "Love the Decatur Staples store. The staff is always friendly and helpful. It is a clean and organized store.", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "106370466384247835597", "name": "Julie Hudson", "time": 1478097692313, "rating": 5.0, "text": "As soon as you enter the store, someone will come to you and offer to help you find whatever you are needing, which for someone like my mother, who doesn't necessarily know her way around gadgets and/or supplies, this is a much appreciated gesture. Their staff has always been very patient and helpful. I also like how everything is arranged so neat and orderly. I also like that they offer a large selection of the same types of things so that you have a number of options. It is very convenient that they will also ship packages for you if needed, weigh the object, provide postage and ship UPS. Very nice environment.", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "105785695486221275837", "name": "Linda Taylor", "time": 1532354848029, "rating": 5.0, "text": "The employees were very helpful and knowledgeable about the products I inquired about. The store was set up for school shoppers. I had a very positive experience. I completed my school list.", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "111588972799680444460", "name": "Sean Blasingame", "time": 1533956330151, "rating": 4.0, "text": "Smaller than in bigger cities but does the job. A little higher priced than other places around. When you get there on a sale you save big on great, higher qualiry items like routers, office furniture and even computers and accessories. I highly reccomend keeping an eye on their sales.", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "110024415786132750545", "name": "Carolyn Hill", "time": 1543704850734, "rating": 4.0, "text": "Friendly staff. Selection of products is satisfactory. Prices are a bit higher than some of the bargain stores.", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "100697924780305626756", "name": "JJ J", "time": 1542470592109, "rating": 5.0, "text": "Love this store! The staff is always friendly and helpful, they make sure to get my orders done on time and perfect!", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "110744771137848484015", "name": "KEN", "time": 1546992475688, "rating": 5.0, "text": "Very professional, Very kind, Very good customer Quality Services. \"THANK-YOU\" *****KAMI***** 5 STARS*****", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "116406148598494845906", "name": "Autumn Foster", "time": 1527983050509, "rating": 1.0, "text": "Staff is rude.  I waited in line behind someone          placing a copy order to be told they don’t laminate after 6pm (it was 6:20).  I had something laminated there after 6pm just a couple weeks ago.  When I talked to the manager he acted like we were talking about alcohol sales or something...it was comical.  I wanted two 8.5”x11” children’s posters laminated.  It’s unfortunate because I’ve always shopped at staples but they lost me as a customer today.  I drove down the road to their competitor & had them laminated without an issue.  It was cheaper too.", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "107235489564728250307", "name": "Dana Long", "time": 1523649983872, "rating": 5.0, "text": "Great service. Fast and easy trip with plenty of help.", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "106273983550330858037", "name": "Sharon Reaves", "time": 1520703798850, "rating": 1.0, "text": "Go somewhere else.  Understaffed. Inefficient.  Simply ridiculous wait time for a simple lamination.", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "103499246919146606758", "name": "Thomas Sisson", "time": 1424630722300, "rating": 1.0, "text": "I was in to make copies then mail them out. The worker was helping me she had another customer come to counter. She then called for help, but never told me she was passing me off to someone else. I just feel it's was rude!!", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "112200393670555599017", "name": "Cory “Tomo” Mason", "time": 1530571341583, "rating": 3.0, "text": "Not a friendly place. My experience has never been stellar, and employees have told me that management is not good at all. I got run out of the store by a supervisor because I was taking to an employee too long, even though I was asking about products.", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "104504191833252486143", "name": "Jen Schmall", "time": 1511752421269, "rating": 2.0, "text": "Margie was nice but the lady behind the printing are made everyone aware that she didn’t know what she was doing.  She looked stressed out and couldn’t keep her composure.", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "116562572913917888657", "name": "Dana Barton", "time": 1501373940031, "rating": 5.0, "text": "Had everything I needed at good prices. Staff were helpful and friendly", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "105303453072362650568", "name": "Lori Ray", "time": 1540697879280, "rating": 5.0, "text": "Great service and selection as always.", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "109740812514672062656", "name": "Carson Elmore", "time": 1482786443107, "rating": 3.0, "text": "Nice store, but the signage showing where different items are could be more clear. The staff can also be a little rude and unhelpful.", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "114180846184666178743", "name": "Lexi Brown", "time": 1502128134096, "rating": 5.0, "text": "Very good service. In and out.", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "114832451787642463340", "name": "John Zink", "time": 1524866285604, "rating": 5.0, "text": "Ok nice prices good help 😂😂😂😂😂", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "107758400497121228401", "name": "Barry Johnson", "time": 1519740372773, "rating": 3.0, "text": "Expensive, but the staff is very helpful", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "113601313063539209512", "name": "Shawn Neff", "time": 1542987173996, "rating": 5.0, "text": "Ryan is the man if you need anything he's got you!!", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "108697058638829817027", "name": "Candace Grizzard", "time": 1525111050462, "rating": 3.0, "text": "Slow slow slow!¡", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "106762547367518749755", "name": "Billy Prince", "time": 1529181763762, "rating": 3.0, "text": "Will not go back!!!!", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "104864689275850624996", "name": "Tyra Payne", "time": 1527806702509, "rating": 5.0, "text": "Nice", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "108878197357468775228", "name": "Ginny Caspar", "time": 1541898153424, "rating": 3.0, "text": "Why the heck would you close at 7 on a Saturday night?", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "113107934759717781388", "name": "Verna Garner", "time": 1497383981310, "rating": 5.0, "text": "Excellent service, thanks", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "115378423023136308585", "name": "Jim Glimpse", "time": 1482007367162, "rating": 5.0, "text": "Robert is the store manager and went above and beyond to make sure that I was taking care of on a return that I had to make make sure that I was completely satisfied and really impressed me with his customer service", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "103920210043731514125", "name": "Randal Morris", "time": 1449671188703, "rating": 5.0, "text": "Very friendly staff", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "116713965095270254594", "name": "Alejandro Juarez Tiño", "time": 1570043203115, "rating": 5.0, "text": "(Translated by Google) Mijis amazing staples all their products\n\n(Original)\nMijis asombroso staples todos sus productos", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "118400709579513542506", "name": "BENNYGARCÍAMIX Y SU WIRI WIRI ALABAMA", "time": 1453646317282, "rating": 4.0, "text": "(Translated by Google) Nothing bad\n\n(Original)\nNada mal", "pics": null, "resp": null, "gmap_id": "0x886283f5ea7d05bb:0x150b81d8a618c1cf"}
{"user_id": "101183471468868624923", "name": "Mike Presson", "time": 1616457786521, "rating": 5.0, "text": "Great place to load. Very nice people and friendly. Thanks guys for the quick service 👍", "pics": null, "resp": null, "gmap_id": "0x88890f7dc2119e01:0x2f73d4556a0cda2b"}
{"user_id": "107866715675056139487", "name": "C Porter", "time": 1562937108793, "rating": 5.0, "text": "I've been  Enjoying There coffee's for years.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNsBO2kUZ5yJwE6BmjlqC_GssKFNMtxwwHq-D-c=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM9qW3pilW3T6b-VmY0aLzQkLCTieRSL9dnZdnM=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88890f7dc2119e01:0x2f73d4556a0cda2b"}
{"user_id": "104855788157686842492", "name": "Walter Hernandez", "time": 1614456624305, "rating": 5.0, "text": "It's a good place to work for. Friendly environment and they  care for everyone.", "pics": null, "resp": null, "gmap_id": "0x88890f7dc2119e01:0x2f73d4556a0cda2b"}
{"user_id": "111847843531662572976", "name": "Easton Lynn", "time": 1584214797033, "rating": 5.0, "text": "They offer a great variety of fresh food. I love dining here. The employees are always super friendly, prices are affordable and the place is always clean.", "pics": null, "resp": null, "gmap_id": "0x88890f7dc2119e01:0x2f73d4556a0cda2b"}
{"user_id": "108334147335679379600", "name": "Douglas Adams", "time": 1584456099521, "rating": 5.0, "text": "This spot is great! Good prices, large dishes and the staff members are regularly super nice.", "pics": null, "resp": null, "gmap_id": "0x88890f7dc2119e01:0x2f73d4556a0cda2b"}
{"user_id": "100074112929921257638", "name": "Nilipour Oriental Rugs", "time": 1493214962105, "rating": 5.0, "text": "My family and I are thankful to Mr. and Mrs. Smith of Royal Cup Coffee Co.!  We have enjoyed our mornings so much more now that have been introduced to some of the finest coffees!  What a treat to wake up to such a wonderfully bold aroma and it goes down so smooth!  Thank you for being such a landmark to Birmingham, AL!", "pics": null, "resp": null, "gmap_id": "0x88890f7dc2119e01:0x2f73d4556a0cda2b"}
{"user_id": "102846716405090137880", "name": "CJ Britton", "time": 1454682795710, "rating": 5.0, "text": "Royal Cup is easily one of the best places I've had the pleasure to work at. While we serve (the best) coffee and tea nationwide I will proudly say that the company does everything it can to serve its people first. While it is a tired HR trope to say this, at Royal Cup is it so true. Here you're not an employee, you're family.", "pics": null, "resp": null, "gmap_id": "0x88890f7dc2119e01:0x2f73d4556a0cda2b"}
{"user_id": "102625183170749946835", "name": "Dan Micoley", "time": 1553000184194, "rating": 3.0, "text": "Nice people but takes more time to figure put where your load gos than to unload,  And that's not very fast either.", "pics": null, "resp": null, "gmap_id": "0x88890f7dc2119e01:0x2f73d4556a0cda2b"}
{"user_id": "117021142286141185731", "name": "Marcus Kirby", "time": 1558455056816, "rating": 5.0, "text": "I am a business partner of Royal Cup, and have found them to be very friendly and professional. They are some of my favorite folks to work with.", "pics": null, "resp": null, "gmap_id": "0x88890f7dc2119e01:0x2f73d4556a0cda2b"}
{"user_id": "118180613789021417481", "name": "Brian Chapman", "time": 1512596643205, "rating": 5.0, "text": "Great experience  ! Nice folks,  and  had an appointment for the next morning,  and  they unloaded me early.\nAbout an hour opening to closing doors.", "pics": null, "resp": null, "gmap_id": "0x88890f7dc2119e01:0x2f73d4556a0cda2b"}
{"user_id": "107578114344584420687", "name": "Jon Biancardi", "time": 1454642451128, "rating": 5.0, "text": "Royal Cup offers exceptionally smooth coffees and flavorful teas as well as instills a customer-centric approach through sales, service, and customized beverage programs.", "pics": null, "resp": null, "gmap_id": "0x88890f7dc2119e01:0x2f73d4556a0cda2b"}
{"user_id": "104406259948689190878", "name": "paquiao manuel", "time": 1535555942119, "rating": 1.0, "text": "just trying to make a delivery.. nobody knows who is receiving the load...they have several warehouses..2 hours spend driving back and forth", "pics": null, "resp": null, "gmap_id": "0x88890f7dc2119e01:0x2f73d4556a0cda2b"}
{"user_id": "103781060840709108881", "name": "Abdelhamed Hasan", "time": 1508434687695, "rating": 5.0, "text": "Amazing people with amazing attitudes\nI love this place,,, in and out in 1 hour", "pics": null, "resp": null, "gmap_id": "0x88890f7dc2119e01:0x2f73d4556a0cda2b"}
{"user_id": "118297578545420044205", "name": "Jason Letcher", "time": 1482242018682, "rating": 4.0, "text": "The amazing Aroma of fresh-brewed coffee.", "pics": null, "resp": null, "gmap_id": "0x88890f7dc2119e01:0x2f73d4556a0cda2b"}
{"user_id": "107309087215898547604", "name": "Dakota Nichols", "time": 1443558742745, "rating": 5.0, "text": "Great coffee (and tea), great customer service, and great for the city of Birmingham!", "pics": null, "resp": null, "gmap_id": "0x88890f7dc2119e01:0x2f73d4556a0cda2b"}
{"user_id": "110692861649405030380", "name": "Jason Mydland", "time": 1497458880462, "rating": 5.0, "text": "Awesome people! Great Coffee.", "pics": null, "resp": null, "gmap_id": "0x88890f7dc2119e01:0x2f73d4556a0cda2b"}
{"user_id": "103851104964729995084", "name": "Birdivender Singh Birring", "time": 1546880869370, "rating": 1.0, "text": "Slow very very slow unloading  never ever coming again 😡😡😡😡", "pics": null, "resp": null, "gmap_id": "0x88890f7dc2119e01:0x2f73d4556a0cda2b"}
{"user_id": "108060165408188856535", "name": "John Johnson", "time": 1544798420742, "rating": 5.0, "text": "Great company!!!", "pics": null, "resp": null, "gmap_id": "0x88890f7dc2119e01:0x2f73d4556a0cda2b"}
{"user_id": "100067739268193013935", "name": "Jonathan Brantley", "time": 1513694657803, "rating": 5.0, "text": "Awesome place", "pics": null, "resp": null, "gmap_id": "0x88890f7dc2119e01:0x2f73d4556a0cda2b"}
{"user_id": "105695021287303807379", "name": "Debbie Boles", "time": 1499858012254, "rating": 5.0, "text": "great tasting coffee", "pics": null, "resp": null, "gmap_id": "0x88890f7dc2119e01:0x2f73d4556a0cda2b"}
{"user_id": "102560930724593386585", "name": "Mark Pouncey", "time": 1448592078055, "rating": 5.0, "text": "Great place to work!!!", "pics": null, "resp": null, "gmap_id": "0x88890f7dc2119e01:0x2f73d4556a0cda2b"}
{"user_id": "101416484141595473739", "name": "Rebecca Victory", "time": 1443552857279, "rating": 4.0, "text": "great coffee!!", "pics": null, "resp": null, "gmap_id": "0x88890f7dc2119e01:0x2f73d4556a0cda2b"}
{"user_id": "114706988258971779739", "name": "Kevin Spurlin", "time": 1392618718676, "rating": 5.0, "text": "I wish they sold it in stores!", "pics": null, "resp": null, "gmap_id": "0x88890f7dc2119e01:0x2f73d4556a0cda2b"}
{"user_id": "107488446620853998987", "name": "Dmitry Kucher", "time": 1592579955878, "rating": 1.0, "text": "(Translated by Google) Very long unloading. You need to ring the doorbell and wait half an hour until someone comes and opens the door.\n\n(Original)\nОчень долгая разгрузка. Нужно позвонить в звонок на двери и ждать полчаса пока кто-то придет и окроет двери.", "pics": null, "resp": null, "gmap_id": "0x88890f7dc2119e01:0x2f73d4556a0cda2b"}
{"user_id": "102737463072645659389", "name": "Geovanny Angeles", "time": 1537554796417, "rating": 5.0, "text": "(Translated by Google) It is a nice and beautiful place\n\n(Original)\nEs un lugar lindo y hermoso", "pics": null, "resp": null, "gmap_id": "0x88890f7dc2119e01:0x2f73d4556a0cda2b"}
