{"user_id": "102242588954165723999", "name": "K McIntyre", "time": 1626440480097, "rating": 5.0, "text": "Dr Scott diagnosed me with a hereditary eye disease after 2 other eye doctors missed it.", "pics": null, "resp": null, "gmap_id": "0x8889f923a9657143:0x9ffaf063c0a338d8"}
{"user_id": "108859647785200805632", "name": "thomas dunnavant", "time": 1592334779448, "rating": 1.0, "text": "Went for an emergency exam and they turned me away.", "pics": null, "resp": null, "gmap_id": "0x8889f923a9657143:0x9ffaf063c0a338d8"}
{"user_id": "113468003985127191044", "name": "lynn williams", "time": 1574202076136, "rating": 5.0, "text": "I saw Dr. Salter for a checkup after having cataract surgery at a facility in Gadsden several years ago.  The wait was not long and the Dr. and staff were professional and kind.", "pics": null, "resp": null, "gmap_id": "0x8889f923a9657143:0x9ffaf063c0a338d8"}
{"user_id": "112903394218263017015", "name": "Carol Rattan", "time": 1605204377776, "rating": 5.0, "text": "Love the new doctor and the staff! Dr. Gannon took time to answer my questions without rushing through the appointment.  So glad she comes to Wetumpka!", "pics": null, "resp": {"time": 1605901225618, "text": "Carol, thank you so much! We’re so excited to hear that you had such a wonderful experience with Dr. Gannon and our staff in Wetumpka, and that you didn’t feel rushed during your visit. Thank you again for taking the time to let us know how we did!"}, "gmap_id": "0x888c218918955f85:0x87e7747193f14cf3"}
{"user_id": "101730645374982502953", "name": "George walker", "time": 1610490494278, "rating": 5.0, "text": "Very complete examination and evaluation. Dr Gannon is friendly and professional, her staff is well trained and friendly as well.", "pics": null, "resp": {"time": 1611570799518, "text": "George, we’re so glad to hear you were pleased with your thorough eye examination with Dr. Gannon and our staff. Thank you so much for taking the time to let us know how we did!"}, "gmap_id": "0x888c218918955f85:0x87e7747193f14cf3"}
{"user_id": "100411041278985311891", "name": "Donny Eason", "time": 1600996757405, "rating": 5.0, "text": "Everyone was very nice and there was very little wait time had a great experience thanks", "pics": null, "resp": {"time": 1601772410888, "text": "Thank you, Donny! It’s great to hear that you were satisfied with your wait time and had a great experience with us overall. We appreciate you taking the time to leave us a review!"}, "gmap_id": "0x888c218918955f85:0x87e7747193f14cf3"}
{"user_id": "103013634905296994844", "name": "Van Dismukes", "time": 1602622873528, "rating": 5.0, "text": "Ya'll  are always amazing!  I never have to wait long for my appointment and I am always pleased with my eye exam/ contact exam.  Thanks for taking such good care of me 🙂", "pics": null, "resp": {"time": 1572620589422, "text": "Thank you for your kind words, Van! We’re so glad to hear that you’re always pleased with your Eye Center South experience. We hope that every patient has as positive of an experience as yours. Thank you for your five-star review and for trusting us with your eye care!"}, "gmap_id": "0x888c218918955f85:0x87e7747193f14cf3"}
{"user_id": "116693829344891953750", "name": "Faye Jones", "time": 1602620332126, "rating": 5.0, "text": "Very fast service and very courteous", "pics": null, "resp": {"time": 1602858271458, "text": "Thanks so much for your kind words, Faye! We’re glad you had a great experience and we appreciate you taking the time to share it with us!"}, "gmap_id": "0x888c218918955f85:0x87e7747193f14cf3"}
{"user_id": "114703598828287164769", "name": "Charles F Tatum", "time": 1576878986646, "rating": 5.0, "text": "I had a excellent experience Dr. Paulk was supper he talked to me during the procedure and that gave me a great deal of comfort.The staff has been first class as well.I would recommend the Eye center South to all my friends.Thank You all Charles f Tatum.", "pics": null, "resp": {"time": 1577456347301, "text": "Thank you so much, Charles! It’s wonderful to hear that you’ve had such a great experience with our staff, and that Dr. Paulk was able to make you feel comfortable during your procedure. We truly appreciate your recommendation—thank you so much for trusting Eye Center South with your eye care!"}, "gmap_id": "0x888c218918955f85:0x87e7747193f14cf3"}
{"user_id": "100549627539723699898", "name": "Kittie Liddell", "time": 1576705898955, "rating": 4.0, "text": "Quick, efficient and told me all that I needed to know and what to look for in the future", "pics": null, "resp": {"time": 1577456258007, "text": "Thank you, Kittie! We’re glad your visit went smoothly and you had a positive experience with us. Thanks for taking the time to let us know how we did!"}, "gmap_id": "0x888c218918955f85:0x87e7747193f14cf3"}
{"user_id": "101665022336258115276", "name": "Cliff Harker", "time": 1571712043444, "rating": 5.0, "text": "Professional and caring staff just a great eye doctor thank you", "pics": null, "resp": {"time": 1572009400677, "text": "We’re so glad to hear that you found our staff to be professional and caring, Cliff! It’s wonderful to know that you had such a positive experience. Thank you for your five-star review and for choosing Eye Center South!"}, "gmap_id": "0x888c218918955f85:0x87e7747193f14cf3"}
{"user_id": "117642716251868821246", "name": "Dorothea McBride", "time": 1569535980620, "rating": 4.0, "text": "The staff were very friendly.  Great location", "pics": null, "resp": {"time": 1569592261767, "text": "Thanks so much, Dorothea! We're happy to hear you found the staff friendly and the location convenient. Thanks for choosing Eye Center South!"}, "gmap_id": "0x888c218918955f85:0x87e7747193f14cf3"}
{"user_id": "112931499539628669617", "name": "Beverly Collins", "time": 1576694214323, "rating": 5.0, "text": "Everyone was very nice and the wait was short!", "pics": null, "resp": {"time": 1577456243575, "text": "We’re glad to hear you experienced a short wait time and had a great experience with our staff, Beverly! We appreciate you taking the time to share this with us!"}, "gmap_id": "0x888c218918955f85:0x87e7747193f14cf3"}
{"user_id": "105219359228845547753", "name": "David Chrietzberg", "time": 1582224808957, "rating": 5.0, "text": "After cataract surgeries both eyes are seeing well with the new contacts,Thanks David.", "pics": null, "resp": {"time": 1583166805013, "text": "David, we’re so glad to hear that you’re pleased with the results of your cataract surgeries! Thanks so much for sharing this with us, and we truly hope you enjoyed your improved vision!"}, "gmap_id": "0x888c218918955f85:0x87e7747193f14cf3"}
{"user_id": "112759874263611454599", "name": "Teri Going", "time": 1550704175629, "rating": 5.0, "text": "The doctor and staff were great.", "pics": null, "resp": {"time": 1553179703233, "text": "Hi Teri, thank you so much for the 5-star review! We are thrilled that our Wetumpka eye doctor and staff were able to help. It's our goal to continue to provide friendly and professional eye care!"}, "gmap_id": "0x888c218918955f85:0x87e7747193f14cf3"}
{"user_id": "116762699932924416974", "name": "Becky Fuller", "time": 1629466251515, "rating": 1.0, "text": "I have always had good service here but yesterday was a different matter. I came in because my newer glasses didn’t work for me. I had an eye exam but when  the doctor(?) came in at the last part, everything he spoke and did was so fast, that I understood nothing. He recommended 2 products for my eyes but didn’t write the names down.  When I left. I got a piece of paper without any explanation or recommendation. I am 73 and not as quick as I used to be. I left feeling like I learned nothing and accomplished nothing.", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "115686080869492796898", "name": "Woodward Lamar", "time": 1629239239722, "rating": 5.0, "text": "I arrived early and was received right away.  The staff was friendly and competent.  Dr Swan explained what was going on with my eyes and suggested a follow up appointment.  He answered all my questions.  I was in and out in just over an hour.  Great appointment.", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "111490649812583817656", "name": "Anita Kelley", "time": 1629761233457, "rating": 5.0, "text": "Everyone is so nice and helpful and takes time with you.  I feel like I just got the most thorough eye exam I have ever gotten.  Everything is explained and they have patience when you ask a question.", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "110977267204077588073", "name": "David Melton", "time": 1630075743804, "rating": 5.0, "text": "I had a nice visit there. Everyone was very helpful. Waiting time was short. Doctor and staff were very nice and informative.\nThanks", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "111240244830022945089", "name": "Theresa Chattman", "time": 1629167023538, "rating": 5.0, "text": "Always happy with Dr. McFaden. He’s very knowledgeable and friendly. The staff is very professional and efficient. Overall a great experience.", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "109592976347071003023", "name": "Lynne Stokley", "time": 1628197653723, "rating": 2.0, "text": "After 90 minutes of not being seen by a doctor yet, I asked at the front desk about the time. I told her we’d have to leave in 45 minutes to be somewhere else. She shrugged her shoulders and said let me know if you leave. Really? Staff is not friendly or helpful. Routine eye exam took 2 hours - surely there’s a way to schedule better.", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "112579800537368637874", "name": "Abundantly Blessed", "time": 1628382000311, "rating": 4.0, "text": "The entire staff were genuinely nice and professional in getting my problem solved. Thanks for helping me so quickly and efficiently. I am feeling much better.", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "101127637606954077949", "name": "Sylvie S", "time": 1628708662406, "rating": 5.0, "text": "I had a great experience during my LASIK screening/consultation. They were efficient and friendly!", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "116179173192187334789", "name": "Rosetta Lovelace", "time": 1628285663561, "rating": 5.0, "text": "Every is professional and friendly.  I enjoyed my visit.", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "117851218892922821831", "name": "Carla Meadows", "time": 1628865314502, "rating": 5.0, "text": "MEP is an excellent place for eyecare!", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "107816767508676370333", "name": "Savannah Stone", "time": 1617458806751, "rating": 5.0, "text": "They are AMAZING!! I was so nervous to have the LASIK procedure done but they walked me through absolutely everything and were constantly reassuring. Best procedure experience ever. I can not recommend them enough!! Dr. McFaden and Dr. Shin are the best!", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "116546538117635826914", "name": "Graham McGalliard", "time": 1619531522394, "rating": 5.0, "text": "I’ve been to both Prattville and Sturbridge locations for exams with contacts and glasses in the past. I had LASIK April 22 performed by Dr. Swan and the results have been incredible. I could see drastically better leaving the office 10 minutes after. At my post-op appointment the next day I could see almost 20/15 out of one eye. The other eye does have more irritation and dryness and is improving daily.\n\nDr. McFaden and the rest of the staff have been very helpful and friendly getting my procedure set up and during recovery to help with the irritation and minor swelling.\n\nI look forward to see how my eyes have healed at the 1 week follow-up. I highly recommend LASIK with Montgomery Eye Physicians. It’s been life-changing already.", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "112513196799057901548", "name": "Valerie Turner", "time": 1629318108483, "rating": 2.0, "text": "I had to wait a long tome to see the doctor, over 2 hours.", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "113763814071954488909", "name": "LInda Johnson", "time": 1629310802000, "rating": 4.0, "text": "Very good and friendly.", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "117041069796952070065", "name": "Jenny Griff", "time": 1605543040611, "rating": 1.0, "text": "Took my brother with a disability to office saw Dr. Shin everything started smoothly until he started to examine him. He started yelling to look this way don't blink. I told the doctor he's not deaf and I'm translating no need to yell, well he needs to do want I'm asking. 🤨Really a person with down syndrome can't control the fact that he see's something coming at his eye. He was suppose to take a sample of whatever he had in his eye and the risk was if he moves or blink I could cut his eye. I call our mom and told her the risk and how this doctor acted towards my brother she was not happy nor was I we left but not before I told him that we would find someone that can have the patience and find a different way to do this procedure his response was well the other place you will find a specialist is in Bham and if you don't he will lose his eye. I told him don't worry I have driven to Bham before to take him to doctors and I will make sure he doesn't lose his eye unlike you.", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "108148926999754209955", "name": "Sonja Ethridge", "time": 1583373252476, "rating": 5.0, "text": "Very friendly service and doctors will answer all your questions and give you just about all the information you need,  I especially liked that my doctor gave me sample eye drops to try and that I can get them over the counter or by prescription from my primary care provider.", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "104052934677220799133", "name": "Shemaiah Campbell", "time": 1584122444138, "rating": 2.0, "text": "Most of seemed really nice. But, I came in March 3rd to order a contact lense. Dr. McFaden gave me a contact lense review. One had gotten broken 2 days beforeand. Dr. McFaden said it was ok to go ahead and order my lense now so I can have it on the way soon and if it needed to be changed they will do that on my regular schedule exam on March 13th. I was told by one of the nurses that the order for my contact was put in and there wasn't a payment for today and that they will call me when it came in. Forward to March 13th when it was time to have a regular full exam, I asked about the order, and then that's when I was told I had to make a full payment first before it was ordered. So what they told me the first time was a straight up LIE. My contact could've almost been here by now if they would've just told me that in first place!! Now I have to go with 1 freaking contact in for another 2 weeks because somebody don't know how to properly do their job!! This really pisses me off and Tiffany always have a rude demeanor.  My problem wasn't paying for the contact upfront! I could've done that March 3rd! It's the lie that I was told about the ordering! It's not fun going longer than what I have to with one contact!", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "106056427010577424479", "name": "Karen Harris", "time": 1564423626992, "rating": 1.0, "text": "When I scheduled my new patient appointment almost 2 months ago, I was adamant that I wanted to be seen by an ophthalmologist.  An appointment was made to see Dr. Mitchell and to also see Dr. McFadden for my contact exam.  Fast forward to today, when I arrived for my appointment, I'm informed that it has been cancelled.  No phone call, text, email...NOTHING!  As a matter of fact, I had to call the week before to confirm my appointment  because I had not received any form of confirmation.  Needless to say, I will not return or recommend this practice to anyone.  I did not appreciate having my appointment cancelled without any just reason and then only to arrive and have the lady at the reception desk continuously trying to get me to see another doctor.", "pics": null, "resp": {"time": 1564429974795, "text": "Karen, we are sorry to hear about your experience today. We are looking into the issue now and will call you shortly to review. Thank you for the feedback."}, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "117285476492956827129", "name": "Stephen Pierce", "time": 1496362585073, "rating": 3.0, "text": "This is my second review.  Plan to spend more than one or two hours there.  The last visit took three hours.  The previous visit Dr. Swan was two and a half hours LATE for my apt.  Next time I will allow a thirty minute wait then leave!", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "117726140986182573933", "name": "Keith Smith", "time": 1507598661866, "rating": 5.0, "text": "Dr. Mcfaden is a great doctor! Very thorough. Highly recommend him to anyone. The staff as a whole is awesome as well!", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "118151372225954810329", "name": "Brandon Stoudenmier", "time": 1533133935179, "rating": 5.0, "text": "The staff was very accommodating over the course of multiple appointments, answered all of my questions, and went above and beyond to assist with LASIK. Greatly appreciated!", "pics": null, "resp": {"time": 1534772181840, "text": "Thank you for the feedback, Brandon! We appreciate you taking the time to let us know about your experience."}, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "109301210742249634683", "name": "Misty Price", "time": 1515242822775, "rating": 5.0, "text": "Friendly staff & short wait time. I had lasik surgery performed here & they did a fantastic job. They were friendly before, during, & after the surgery, which helped tremendously. If you are considering lasik, give them a visit!", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "103406185166514174092", "name": "Cherokee Haynes", "time": 1534543405387, "rating": 3.0, "text": "Service was good but the receptionists were extremely rude and talking about people in front of their faces. Very disrespectful!", "pics": null, "resp": {"time": 1534772148222, "text": "Cherokee, thank you for sending us your feedback. We are sorry to hear we didn't exceed expectations during your visit. This information has been sent to our administrative team so we can make the proper adjustments. Your feedback is important to our practice, and we appreciate you taking the time to let us know about your experience."}, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "107711851460184472700", "name": "Matthew Brown", "time": 1368669720751, "rating": 2.0, "text": "When I showed up for my new patient appointment I was told the Dr. had left sick. That's understandable, but no one could give me an explanation as to why I wasn't called and told this before my appointment time.  I drove across Montgomery just for this appointment.  I was told they would call me to reschedule in the morning. No one called.\nI called them the next day and then I was put on hold and then hung up on.  It's very clear to me they don't need/want new patients. Moving on", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "109137129221092745491", "name": "Dick Martin", "time": 1521336636490, "rating": 1.0, "text": "I had the occasion to have a glaucoma test by Dr Shin which was with a hand held paortable device. It happened to be 10 points higher than a test administered to me days earlier by Dr . Izer.  He wanted to prescribe medication. When I said I just had the test 4 days ago by another doctor, he got very upset and told me there is no reason for me to come back since I saw the other doctor. Apparently he doesn’t like a patient getting a second opinion. He is insecure or threatened by a second opinion, especially when there is such a disparity in the result.", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "115968231795772961279", "name": "Karl Smith", "time": 1519397298480, "rating": 2.0, "text": "I had a difficult time trying to find this office even with the GPS feature on my cellphone", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "105463305854057555511", "name": "Amy Mapp", "time": 1456227952688, "rating": 5.0, "text": "Excellent.    Friendly and caring staff", "pics": null, "resp": null, "gmap_id": "0x888c2c817b9add49:0x2ee5464c8c08183d"}
{"user_id": "102575898443385233052", "name": "Jim Hennessey", "time": 1615563200969, "rating": 1.0, "text": "Arrived for my appointment, lobby was empty. The woman at the counter shouted across the room that we needed to wait and she would get with us (me and my wife).\n\nShe then shouted across the room about who our insurance carrier was? My wife provided that information and the lobby “boss” we’ll call her because that is the nicest I can describe her attitude.\n\nThe Lobby boss then shouted we don’t accept that, my wife replied “yes, you do” my wife checked before making our appointment. The lobby boss then made us shout our  SSI numbers across the room so she could check. Violation of our privacy.\n\nLobby boss then ordered us to adjust our masks as they did not meet with her approval. Shortly thereafter the “lobby boss” then got into my wife’s personal space and the ordered here to replace her mask as it did not meet with the “lobby boss’s” approval.\n\nAt that point my spouse and  I elected to leave. We were going to have vision checks, buy glasses, purchase contacts and have lenses replaced buy two pairs of glasses. That was conservatively a $1,000.00 bill.\n\nGetting into paying customers personal space, treating them rudely, treating personal private information without care is unacceptable.\n\nAvoid this place at all costs.", "pics": null, "resp": {"time": 1615572728099, "text": "I apologize for your experience in our office.  We strive for excellent customer service.  Thank you for your feedback.  I will address these issues with our staff.  Please feel free to call me 205-949-2020 Tammy G."}, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "108119387158972902061", "name": "Mike Campbell", "time": 1621331459630, "rating": 3.0, "text": "Pros - great doctors and staff, polite and knowledgeable.  Excellent quality glasses (except for cons, see below)\nCons - I'm 61, worn glasses most of my life, and have had various coatings. These coating have never come off, not once.  It's happened with both sets of lenses from Vision First.  Now I just have annoying streaks across my lenses.  Don't know if I can get a pair without the coating because I can never get through to a real person and never a person from the Pell City clinic.  I've left messages but to no avail.  Very disappointed.\nUPDATE Apr 2021 - Went back for an exam and received the same excellent service.  They're just really good.  I also learned that the coating was an anti-glare coating that was coming off.  5 stars for the staff.", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "109754142957604347065", "name": "Sondra Epperson", "time": 1579628727439, "rating": 5.0, "text": "Super easy to make an appointment. Great friendly staff. High tech equipment. Knowledgeable and cost effective. Works with Medicare and most insurance plans.", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "118326678612195774067", "name": "Timothy Fulton", "time": 1558140007426, "rating": 5.0, "text": "It was an amazing experience. Lori is very polite and very thorough she made sure I got the perfect fit for my contacts. Definitely recommend going there", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "115332321543257822988", "name": "Jake Mollus", "time": 1544516205156, "rating": 5.0, "text": "The Doctor and staff are incredible. You can genuinely tell they have your best interest in mind. The staff friendly and helpful. I would highly recommend their office to anybody.", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "111003603472686916090", "name": "Tyler Tidwell", "time": 1548170837321, "rating": 5.0, "text": "I chose this eye center because of the reviews on Google and I'm glad that I did! All of the staff was great and Dr. Clark explained everything to me in a way I could understand it. I highly recommend this facility!", "pics": null, "resp": {"time": 1548174085847, "text": "Thank you for choosing VisionFirst!"}, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "100141199844103596378", "name": "Tina Gann Fuller", "time": 1457992678908, "rating": 5.0, "text": "My husband and I are very pleased after our visit to Dr Clark's in Pell City office.  She and her staff were very professional and friendly.  I always need help picking out new frames and the lady that ordered them was extremely helpful and very patient with me as I probably tried on every pair in the office.", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "103172286497919696286", "name": "John Kiker", "time": 1537472829364, "rating": 1.0, "text": "Treated my daughter in law as if she was a dead beat. ACTUALLY HAD GUTS ENOUGH TO PUT  SCOTCH TAPE ON GLASSES AND SAID IT'LL DO FOR NOW.\nOK ALL BECAUSE MY DAUGHTER IN LAW HAD MEDICAID.......\nAND BY THE WAY........\nIT WAS FOR MY 3 YEAR OLD GRANDAUGHTER....", "pics": null, "resp": {"time": 1538156236413, "text": "Sorry to hear about your experience in the office.  I did try to reach you or the contact that was giving to me but I was unsuccessful the day of your visit to the office.  If we can farther assist you please contact Vu Quang @ 205-949-2020"}, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "112981854608961843456", "name": "Karen Petersen", "time": 1456419867200, "rating": 5.0, "text": "I had an appointment with Dr. Clark for a blocked/infected tear duct & was so nervous that it would require surgery (doesn't look good on YouTube).  Everyone from the nurse to Dr. Clark was so very friendly & they answered all of my crazy questions.  I was reassured I was on the right track with the antibiotics & would not need surgery.  I felt very comforted & taken care of.  Thank you guys so much for the positive experience!\nK. Petersen", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "117697221363373854444", "name": "Joanie Killingsworth", "time": 1456955666231, "rating": 5.0, "text": "My 8 y.o. son and I both saw Dr. Clark in the Pell City office.  Wait time for appt., was 2 days.  Everyone in the office from front desk to Dr. Clark, amazingly friendly and very helpful..\nWe will continue seeing Dr. Clark.", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "100283410438867218743", "name": "Brittany Sullivan", "time": 1466120923223, "rating": 4.0, "text": "First time going there, had to wait over an hour before I was seen but the staff was nice and took care of my vision needs.", "pics": null, "resp": {"time": 1466168007669, "text": "Brittany thank you for the review. We are glad you enjoyed your visit. However, we apologize for the long wait."}, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "113797861282849570283", "name": "Sandy Lawrence", "time": 1458748336935, "rating": 5.0, "text": "Great doctor and staff. They made me feel very much at ease.", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "105709475249706143257", "name": "Randall Cox", "time": 1456446423886, "rating": 5.0, "text": "The doctor  was excellent and I was in and out in a hurry.  The staff was friendly and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "112551397185022632913", "name": "Leanne Etheridge", "time": 1456420334083, "rating": 5.0, "text": "Dr. Clark and her staff were courteous and professional. I would recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "112729659746247947817", "name": "Jo Nell Powell", "time": 1456414106692, "rating": 4.0, "text": "Very friendly and helpful. Plan to return when needed", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "116613719331489469845", "name": "Sheri Williams", "time": 1456427174458, "rating": 5.0, "text": "The perfect combination of efficiency, expertise,  and caring", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "118316950584997778306", "name": "Belinda Marvin", "time": 1600906590933, "rating": 5.0, "text": "The attention to making sure the equipment was cleaned and disinfected before use was very comforting to watch. I felt safe . Every precaution is in place. Hospitals and doctors offices need this level of attention. So take note Eye center South keeps their patients  health and safety first.", "pics": null, "resp": {"time": 1601772068353, "text": "Belinda, it means so much to us to hear that you felt safe at our office. We are doing our utmost to make sure that our patients remain healthy and are taking every precaution to ensure your safety. It’s wonderful to hear that you appreciated our attention to detail! Thank you so much for taking the time to share your thoughts with us!"}, "gmap_id": "0x8891ee11127412cf:0x68a9e583a4fd93bf"}
{"user_id": "111576291457421467868", "name": "Gerald Kilpatrick", "time": 1565726439123, "rating": 5.0, "text": "I am a veteran since 1965 and I found this place these doctors. Dr. Bennett @ Dr. Gauldin.  to be some of the best. @their staff  very efficient and courteous.   I would definitely recommend this place to anyone that needed a surgery or treatment or anything to do with your eyes.", "pics": null, "resp": {"time": 1565975154624, "text": "Thank you for your service, Gerald! We are so happy to hear that you found our staff efficient and courteous. Eye Center South strives to provide the very best for our patients and we are so thankful for your feedback and recommendation."}, "gmap_id": "0x8891ee11127412cf:0x68a9e583a4fd93bf"}
{"user_id": "100026604971973581163", "name": "Brenda Deason", "time": 1573787101807, "rating": 5.0, "text": "Dr. Bennet👨‍⚕️ is my hero & a man of God! 🕊I was almost blind and now I see!🕊TGBTG- TO GOD BE THE GLORY!!!🙏", "pics": null, "resp": {"time": 1574431788453, "text": "Brenda, thank you for the kind words about Dr. Bennett! We hope you enjoy your improved vision!"}, "gmap_id": "0x8891ee11127412cf:0x68a9e583a4fd93bf"}
{"user_id": "102700250385422081369", "name": "Mary Yates", "time": 1598906266474, "rating": 5.0, "text": "Excellent care.", "pics": null, "resp": {"time": 1599575087371, "text": "Mary, thank you so much for your kind words. We’re glad to hear that you’re satisfied with the excellent care you received from us at Eye Center South!"}, "gmap_id": "0x8891ee11127412cf:0x68a9e583a4fd93bf"}
