{"user_id": "103568655459817985998", "name": "Jason Kohn", "time": 1626996261877, "rating": 5.0, "text": "Amazing CBD products. Very knowledgeable Staff, and great buying experience. They make you feel welcome to the store. And answer any questions you may have,and help you decide what best fits your lifestyle. Overall highly recommend this Local store.", "pics": null, "resp": {"time": 1627054891417, "text": "Thanks, Jason. Great to get to know you"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "102402897173021618705", "name": "Travis M", "time": 1619457517183, "rating": 5.0, "text": "Hands down one of the better dispensary experiences I've had since living here. The staff completely understands and levels with the customers and makes the whole process way more personal than other places. Thanks so much for hemp-helpfully helping me get  relief I need!", "pics": null, "resp": {"time": 1619458340489, "text": "Thanks!"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "107828689746401180657", "name": "zach rowland", "time": 1625515955431, "rating": 5.0, "text": "Great guys here!!! They really are well Informed on all stuff CBD!!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPKMybMdgFCtrk1-AeUQnYV5RF0Uf8bq00De-xB=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "117570015140233594742", "name": "Macy Walden", "time": 1617378075443, "rating": 5.0, "text": "Aaron was amazing. He knew what he was talking about when showing me different strands of hemp and he even gave me samples to try that just came in and are strong. Great guy.", "pics": null, "resp": {"time": 1617379175170, "text": "Thanks!!"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "110201516853030728497", "name": "Kevin Ives", "time": 1616275638635, "rating": 5.0, "text": "Awesome experience.  The customer service and expert knowledge of their products helped me choose what I was looking for.  I highly recommend this business to others and I will be returning for future purchases.", "pics": null, "resp": {"time": 1616291332327, "text": "Wow! Thanks, Kevin"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "112477268506279578380", "name": "Chandler Breal", "time": 1620400946738, "rating": 5.0, "text": "Great experience, very nice people that work there. And some seriously amazing products!", "pics": null, "resp": {"time": 1620402603929, "text": "Thx!"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "102270511214583289784", "name": "Laura Delmarsh", "time": 1611942644887, "rating": 5.0, "text": "The impeccable customer service paired with expert knowledge provided an excellent experience when searching for the proper product.\nI highly recommend Simply CBD for not only their extensive inventory of product, but for attentive service focused on you and your individual needs.", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "104460667467550017581", "name": "Adam Hamilton", "time": 1565981101030, "rating": 5.0, "text": "My wife and I had an excellent experience at Simply CBD today.  Chad and Aaron were very helpful and knowledgeable.  They were able to recommend a tincture and chews for our dog who has seizures and tremors, as well as, a tincture for the bursitis in my shoulder.  The quality control practiced in production of the products is impeccable.  You can even see the individual lab results for each product.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMDOMJTT8yDky2h4CcPSIUjN1rtNP5u5vM5CXle=w150-h150-k-no-p"]}], "resp": {"time": 1565995315891, "text": "Thanks, Adam. So nice to meet you both."}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "109763710030041119319", "name": "Lilith Knight", "time": 1614372749690, "rating": 5.0, "text": "There's a pretty good variety but probably the best quality I've seen in Southern Alabama.", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "101816350005399455562", "name": "Josh Holliday", "time": 1596652680343, "rating": 5.0, "text": "I have been shopping at Simply CBD in Daphne for a couple of months now. The quality of the product line is incredible. High quality CBD products! The staff is highly knowledgeable about the science and applications of each of their products. I highly recommend Simply CBD!", "pics": null, "resp": {"time": 1596652878197, "text": "Thanks, Josh!"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "115562145485079067219", "name": "Jakob Johnson", "time": 1598290428481, "rating": 5.0, "text": "Great selection, great service, and great prices! Aaron is very knowledgeable on CBD products and is committed to helping you make an informed purchase. I highly recommend this company!", "pics": null, "resp": {"time": 1598973381425, "text": "Thanks for high praise, Jakob. We appreciate you."}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "117439713946155503532", "name": "Aaron VanHauter", "time": 1602518473999, "rating": 5.0, "text": "So I stopped in because I keep hearing about Delta-8. I was in another store down the road and they just kept trying to push it and couldn't give me info about it, so I left went down the road and Simply spent 20 min going over what the Delta-8 is, what I should expect and how to take it. If knowing what you put in your body is important then go check them out", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "110732781406904593714", "name": "Molly Armstrong", "time": 1615516757092, "rating": 5.0, "text": "Great staff and amazing prices!!", "pics": null, "resp": {"time": 1615517921587, "text": "Thanks, Molly. Hope everything works well for you!"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "100519146154634416144", "name": "Kendall Pledger", "time": 1598993805056, "rating": 5.0, "text": "Best CBD store I've been to. Always greeted with a smiling (now masked) face💗 Me and my husband couldn't think of any better way to spend our money than on these products. True relief and relaxation to the deepest pain 💙", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "110806515674342668374", "name": "Melody Duncan", "time": 1576880598573, "rating": 5.0, "text": "Aaron is super kind and knowledgeable about the products offered in store—-also, there is an array of natural skin care products available, not just CBD products!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMyusrG0d4WaFPHYWs_0SAsCmnA2dUNmE77B6hN=w150-h150-k-no-p"]}], "resp": {"time": 1578093923217, "text": "Thanks, Melody. Always great to see you. Good energy!"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "112757636830459624957", "name": "Shermeka Brandon", "time": 1606755167415, "rating": 5.0, "text": "A great store to go too I love it I will be going back", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "113547362840056045352", "name": "Karen Barkle", "time": 1593798045793, "rating": 5.0, "text": "The people are so very knowledgeable. They have answered every question I have come up with. They give great advice for what ails us and are very friendly. Great service, great products!", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "100035376305859920827", "name": "Milissa Guitterrez", "time": 1581118705189, "rating": 5.0, "text": "Aaron and Chad are extremely knowledgeable. As I have engaged in conversations with several CBD business owners, it is clear that they stand head and shoulders above! They are careful to ask multiple questions in an effort to truly solve the problem at hand. In asking questions and receiving answers to those questions, it’s evident that they have researched and provided some of the best products out there. They do a great job in educating!", "pics": null, "resp": {"time": 1581119079112, "text": "(Translated by Google) We appreciate that, Milissa\n\n(Original)\nWe appreciate that, Milissa"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "101563192810651987756", "name": "Robin Ponder", "time": 1593697092881, "rating": 5.0, "text": "Awesome store. These guys know their products, are friendly and helpful and offer great suggestions but are not pushy. They are the real deal. Dont mess around with those other stores", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "102267228044728818470", "name": "Steve Avery", "time": 1566074513467, "rating": 5.0, "text": "Okay, so there a few places in the area I visited in Fairhope and Daphne. Simply CBD is on a whole nother level. Aaron took the time to explain every product they had and what it can help with. I had no idea there were other cananbanoids other than CBD. He also made sure I knew how much to take so I would not waste or undertake. If you are going to try CBD, you need to go here.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNqxH4gzyrMHSW_45SkkQMYq8CGIy8-xB3KVy5d=w150-h150-k-no-p"]}], "resp": {"time": 1566137923012, "text": "Thanks, Steve. We are always eager to teach those who want to learn."}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "103623004801986008936", "name": "Laura Leigh", "time": 1590594996944, "rating": 5.0, "text": "We are so pleased with the products and services at Simply CBD. Our sweet Pup suffers from epilepsy and they have been so helpful in helping us find the product for him. If you have questions about CBD and it's benefits please go see them. You will not be disappointed.", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "116125262563517671874", "name": "Dana Walker", "time": 1566162175499, "rating": 5.0, "text": "I was referred by my Dr at Thomas Hospital to try CBD and he said these guys know the most in the area.I have severe fibromyalgia. I can't say he was wrong. Aaron spent about 30 min with me going over everything. I walked out with the pain cream. It works in about 10 min for me. Very happy I stopped in. I recommend.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOjxBJbYXR6eBds6pMJOxmQ_pbg0zHj1Zi5qUY2=w150-h150-k-no-p"]}], "resp": {"time": 1566511957835, "text": "Thanks, Dana. I'm glad you had a good experience."}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "100565562119702317734", "name": "Lizzie Hughes", "time": 1614797141725, "rating": 5.0, "text": "Very knowledgeable and helpful.have learned a lot.", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "111028180630092254340", "name": "Dr. Larson", "time": 1585326819009, "rating": 5.0, "text": "Being in the medical field I have been somewhat reluctant to recommend CBD. After attending one the Simply CBD's educations seminars at a local hospital I was able to spend about an hour with the owners. I can tell you that I came away feeling confident with Simply CBD and their products, but most importantly their knowledge. If you plan on trying or using,give them a try", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "109847815978220048535", "name": "Saara Simard", "time": 1597177636278, "rating": 5.0, "text": "Amazing customer service. I I quired about the pet cbd oil for my boxer mix who has seizures and got a phone call back from a real human! They were super helpful and the product has already made a huge difference for her seizures. Highly recommend!", "pics": null, "resp": {"time": 1597178492109, "text": "Thanks, Saara. We are so happy its working well."}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "102320122126753892125", "name": "Terry Jenkins", "time": 1568768148281, "rating": 5.0, "text": "Incredible customer service. Aaron and staff are very knowledgeable about their product and are very helpful in selecting the right CBD product for your needs. They have changed my life! I highly recommend Simply CBD!", "pics": null, "resp": {"time": 1569848149442, "text": "Thanks, Terry. Glad it's working so well. Thanks for the kind words"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "117344695018495274354", "name": "Kat Keeney", "time": 1596657893580, "rating": 5.0, "text": "So helpful, great products and they really take the time to help you find the best products for your needs!! Will definitely be back!", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "106833348404551502659", "name": "Seth Port", "time": 1582675390294, "rating": 5.0, "text": "Great little shop in Daphne! I’ve stopped in a couple times now and the staff is always incredibly friendly and knowledgeable about their products. They make it a very pleasant experience and take their customer service seriously. I wouldn’t give any weight to the one star reviews I see here. Not saying that bad days are impossible to have, but there is no way they are talking about the same guys I met at the store. I have a good feeling there is another shop owner in town who is apparently a petty enough person to leave fake reviews. That being said, 5 star review from me and I will gladly recommend them to anyone!", "pics": null, "resp": {"time": 1582675552195, "text": "Thanks, Seth. Those kind words mean a lot"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "116480727343475232627", "name": "Judson Smith", "time": 1566152208650, "rating": 5.0, "text": "I spent about 40 minutes with Aaron the other day learning much more about CBD than I thought was out there.  The atmosphere in the store is elegant and inviting.  This was my first visit to a CBD store.  I was really impressed and see no reason to go anywhere else in town.  Really looking forward to doing business in the future.  Thanks again Aaron!  Chad, I look forward to meeting you.", "pics": null, "resp": {"time": 1566153821089, "text": "Thanks, Judson. Great to meet you too. I enjoyed our chat!"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "117566677123033341458", "name": "Amanda", "time": 1564451516332, "rating": 5.0, "text": "I really like this store. It’s a very nice and welcoming place. There’s a great selection of products to try, including coffee! The coffee is a great way to start your morning... a fantastic addition to the mix. Don’t be shy, go check it out!", "pics": null, "resp": {"time": 1564453983020, "text": "Thanks, Amanda. It was great to meet you."}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "114697722680528704001", "name": "Ryan Ware", "time": 1604342086992, "rating": 5.0, "text": "Great staff with a wide variety of great products!", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "102385913669457813702", "name": "Tiffany Strickland", "time": 1596496736822, "rating": 5.0, "text": "Wow, such great service and their products are amazing. I walked in looking for relief from my headaches. I was offered some salve to rub on my temples. Nice, right? I was also informed about the gummies and Cbd vapes. I walked out with a smile, some goodies and a couple of freebies, just for being a first time customer. As far as my headache, it was gone within maybe 10 minutes of trying the salve! I’ve taken Tylenol all day, with no relief. Highly, recommend!", "pics": null, "resp": {"time": 1596652928065, "text": "Great to meet you, Tiffany."}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "118166792425768464595", "name": "Taylor Holley", "time": 1588193522750, "rating": 5.0, "text": "Austin and I have been to this store many times the owners are both great. They are super helpful and informative and will spend time answering any questions you have and helping you find what is best for you . We will continue to go here !", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "116971464400413566558", "name": "Laura Rodgers", "time": 1570220280485, "rating": 5.0, "text": "SO GLAD i STOPPED IN. i HAVE BEEN STRUGGLING WITH SLEEP FOR YEARS. AFTER STOPPING IN AARON SHOWED ME HOW PRODUCTS ARE DIFFERENT AND WHAT WOULD HELP. I'M HAPPY TO SAY I AM FINALLY SLEEPING! YES ALL IN CAPS BECAUSE THEY ARE GREAT", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "109833166106648307738", "name": "Linda Olepa", "time": 1566749906552, "rating": 5.0, "text": "Stopped by 30 min before they were open. Aaron greeted my and let me in. He walked me around the store and explained everything. Great selection of everything. I have been to other CBD stores that call themselves ' Super Stores \" that have far less than this place. This is a go to for me moving forward.", "pics": null, "resp": {"time": 1569848388728, "text": "So nice to meet you Linda"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "103951277257878479309", "name": "Bob Stelt", "time": 1597699590308, "rating": 5.0, "text": "Best selection, I visit both stores depending on which side of the bay im on", "pics": null, "resp": {"time": 1597703287025, "text": "Thank you for the support. We appreciate you as a customer"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "114858774751048759275", "name": "Marco Gonzalez", "time": 1572625697007, "rating": 1.0, "text": "I find it very weird almost all of the reviews for Simply CBD are brand new accounts with no other reviews, seems very fishy to me. Against my best judgement I went into the store and they seemed more interested in selling me anything under the sun than listening to my actual ailments.\n\nEDIT TO RESPOND: It is convenient you glossed over the fact that most all of your reviews are by 1 star reviewers with no other reviews.", "pics": null, "resp": {"time": 1572614996190, "text": "Thanks for the feedback, Marco. I think you may have gone to a different store and sadly not Simply CBD. We don't have outsourced products nor pseudo marijuana, however, if you do make your way to Simply CBD , we'd love to meet you. We encourage our clients that have a great experience to leave reviews so others may experience the success that so many have had.\n\nUpdate: Google has confirmed this review was made by the IP address belonging to John Mcaruther of Fairhope Hemp. This is the 5th attempt that Fairhope Hemp has made to leave negative reviews. Google has removed the others. I asked that this one stays so others may read. We wish you the best, John"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "106718577879959132521", "name": "jacob glisson", "time": 1581362869359, "rating": 5.0, "text": "Aaron is amazing! Very friendly, social, and welcoming! Took his time to explain and chat with us about all our questions! Will definitely be coming back for all our CBD needs!", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "110889939486479325962", "name": "marsha sutton", "time": 1572561114306, "rating": 5.0, "text": "So this place is great and here's why. I was unsure of CBD and have been in the store three times asking questions. Each time I came in they were just as friendly and didn't mind answering all the same questions. I finally tried a 1000 mg oil and in a week I have to say its working exactly like they said it would.", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "118057410731269543815", "name": "Brent Comotiz", "time": 1566227098135, "rating": 5.0, "text": "I've been meaning to leave this for a week and finally here it is. This is a great store with best selection that I have seen. Owners are great. They actually directed me to a less expensive product and explained why it would work better. I've been going to other CBD stores and NO ONE has ever done that.", "pics": null, "resp": {"time": 1566511920209, "text": "Thanks, Brent. Your review is much appreciated."}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "114706334163388554849", "name": "Reggie Pulliam", "time": 1565813675024, "rating": 5.0, "text": "Aaron and Chad are not only revolutionary with their service, but with their genuine care for the health of the community. Simply CBD will do wonders for anybody who chooses to use their products and follow their guidance. Great store. Great people.", "pics": null, "resp": {"time": 1565996718697, "text": "Thanks, Reggie. Kind words from you mean a lot."}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "113925503919356455593", "name": "Erica Framboise", "time": 1570221011288, "rating": 5.0, "text": "Just moved from Colorado Springs. So happy to find a real store selling legit real products. So much garbage out there and this stuff works great. I actually used to live my the fields near Manitou Springs Colorado. Great job guys!", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "107387744769218306802", "name": "carey Puricelli", "time": 1599140611074, "rating": 5.0, "text": "Super knowledgeable, very friendly, and had many products!", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "106364605719424912302", "name": "Leslie VanHauter", "time": 1564241796258, "rating": 5.0, "text": "When I first stepped into Simply CBD, I was unsure of the products and what I might need.  Aaron and Chad listened to understand my ailments.  They explained the benefits of each product and helped me understand what could help my condition.  They've created a welcoming environment and I will be back to try more products.", "pics": null, "resp": {"time": 1564447140809, "text": "Thanks, so much!"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "108074908530979250600", "name": "Zann", "time": 1578083013464, "rating": 5.0, "text": "From the second I walked in Aron welcomed me in and made me feel well taken care of the entire time. He educated me on what CBD is and listened to some of my concerns and offered me certain things that I would be interested in. Overall Great service, Good vibes, and even let me sample some of the amazing CBD water!", "pics": null, "resp": {"time": 1578087038248, "text": "Thanks, Zann. Great to meet you."}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "107141013932836967286", "name": "russ copeland", "time": 1564891101466, "rating": 5.0, "text": "The store is awesome and they have a great selection of products. Staff answered all of my questions and I am excited to try the CBD oils. Will definitely be back!", "pics": null, "resp": {"time": 1565307347307, "text": "Thanks, Russ"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "114027032763257452340", "name": "Jack Rich", "time": 1566489081990, "rating": 5.0, "text": "This is the most professional and knowledgeable place I’ve ever been too. Those guys know the science behind every aspect of CBD. First place I have purchased from where I felt  confident about the purchase I made. Quit wasting time at vape shops. Will be a long time customer. They represent the CBD industry the way it should be. Kudos!", "pics": null, "resp": {"time": 1566511722722, "text": "Thanks, Jack. Great to meet you."}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "101249956640096122900", "name": "Daron Harris", "time": 1564853564327, "rating": 5.0, "text": "Having this store open in the area (and in Alabama) is such a blessing. My wife has been battling Stage IV breast cancer and all of the related side-effects and pain in her body for several years now. Being able to access these type of products more affordably and conveniently is a big help to us.  What really stands out about the store is of course the amazing selection of products, but above and beyond that, the knowledge base of the staff, particularly Aaron. Aaron combined his command of the products with his skills in listening to what our needs were to connect us to the right set of choices for us.", "pics": null, "resp": {"time": 1565307384127, "text": "Thanks for the kind words, Darron"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "103728025748468098166", "name": "Charlotte Plunkett", "time": 1564704852074, "rating": 5.0, "text": "This place is a godsend.  From the depth and beauty of the store to the depth and breadth of the selection.  Owners so knowledgable and helpful i feel relaxed before i leave the door.  Products are easy to use, priced to sell and best of all they WORK!  thank you thank you thank you!", "pics": null, "resp": {"time": 1565996803307, "text": "Wow. Thanks for the kind words."}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "115990321697409734313", "name": "James Barker", "time": 1564424988603, "rating": 5.0, "text": "Friendly and informative staff. Very clean and warm environment. Great product selection and advice!", "pics": null, "resp": {"time": 1564428603872, "text": "Happy to meet you , James"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "115953338053648734940", "name": "Rat Tail Toneworks", "time": 1597183785943, "rating": 5.0, "text": "Really nice people and awesome service.", "pics": null, "resp": {"time": 1597246875351, "text": "We appreciate the kind words and confidence you have in us!!"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "113378043006307741687", "name": "alysa mckee", "time": 1568419157399, "rating": 5.0, "text": "This place is absolutely amazing. I finally found a place that wants to educate you. The prices are absolutely amazing. The stuff actually works. Thank you, so much for your time.", "pics": null, "resp": {"time": 1569848169568, "text": "Thanks so much for the kind words"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "108531256708077440618", "name": "Claudia Washington", "time": 1583370045549, "rating": 5.0, "text": "The owner was SOOO kind and professional I came from mobile and he was very informative! Definitely worth the drive!", "pics": null, "resp": {"time": 1583373973427, "text": "Wow! Thanks"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "100394927731833752285", "name": "Kristin McDaniels", "time": 1564704485082, "rating": 5.0, "text": "Such an awesome place.  Owner was really nice.   Stopped and talked to use for awhile .   After using the products i feel more relaxed and can focus better", "pics": null, "resp": {"time": 1564704855477, "text": "Appreciate your kind words, Kristin"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "112947300890775505239", "name": "Joann Cammarata", "time": 1564448948614, "rating": 5.0, "text": "I was visiting from out of town and drove past Simply CBD. I stopped in not knowing anything about their products and left knowing more than my local store has ever shared. Great people!", "pics": null, "resp": {"time": 1564454004838, "text": "It was a pleasure meeting you, Joann"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "102051493806299569150", "name": "Chris Bean", "time": 1564442876339, "rating": 5.0, "text": "This store is fabulous!!  The owners are very friendly and knowledgeable. I also love the locally made bath products.", "pics": null, "resp": {"time": 1564447158753, "text": "Really appreciate the feedback!"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "104495138196315025911", "name": "Brittany Sheppard", "time": 1564599780085, "rating": 5.0, "text": "A friend of mine showed me this place. I have been ordering all my CBD items online. It was so nice to have a face to face talk about what I have been using and what I may want to try. Answered all my questions and left knowing a little more.", "pics": null, "resp": {"time": 1564607349980, "text": "Thanks, Brittany so nice to meet you."}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "102323390404425793412", "name": "Dana Mitchell", "time": 1576866650124, "rating": 5.0, "text": "My husband was just released from Hosp. from having a portion of his lung removed, so needless to say I have had some anxiety. This store is sent from heaven. Aaron is patient and informative. Thanks you , Simply CBD", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "106392792731231806145", "name": "Hillary Burger", "time": 1567184727314, "rating": 5.0, "text": "I can’t recommend this place more! The customized buying experience is unparalleled. I will never buy online again! Chad will 100% take care of you!", "pics": null, "resp": {"time": 1569848347079, "text": "Thanks so much, Hillary"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "103110317290358824193", "name": "Ashley Hollinger", "time": 1565883921267, "rating": 5.0, "text": "Before I came in I emailed asking a question and got a response in less than 5 minutes, which with most places doesn't happen. I went in later that afternoon to see if there was a product I wanted to buy. I am extremely new to the cbd scene and know almost zero information about any of it. Aaron was able to answer any questions I had, and even answered questions I would not have thought to ask. He was extremely knowledgeable and personable which made shopping there an easy and awesome experience. I wound up buying a pen and a loaded cartridge for it. I am very much looking forward to going back there and purchasing other products.", "pics": null, "resp": {"time": 1565885256119, "text": "Thanks, Ashley. So great to meet you both."}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "104536903972440840994", "name": "Adri Senpai", "time": 1566835214279, "rating": 5.0, "text": "Very welcoming! Super inclusive, informative, and friendly! Come see Aaron and Chad. I promise you that you won't regret it.(:", "pics": null, "resp": {"time": 1566946554347, "text": "Adri,\nWas so nice to meet and chat with you. Hope everything worked out for you!"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "103809114103738579763", "name": "Ella Vision", "time": 1564531534993, "rating": 5.0, "text": "Simply CBD is awesome! Staff was intelligent and well informed about their products. I will definitely be going back for more product.", "pics": null, "resp": {"time": 1564607400539, "text": "So glad it was a great experience, Chris"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "118243981302120649028", "name": "Richard Henderson", "time": 1566581415987, "rating": 5.0, "text": "Great first experience in this store. The staff was extremely helpful and knowledgeable. Great product selection (edibles, vapes, lotions, beard oils, dog treats, ect.) I would recommend this store to anyone that uses CBD or is curious about trying it. I'll definitely be going back.", "pics": null, "resp": {"time": 1566582683979, "text": "Thanks, Richard. Great to meet you"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "106157139336973731842", "name": "Jory Martinez", "time": 1566414790426, "rating": 5.0, "text": "Chad was extremely helpful on spreading knowledge and awareness of their CBD products! Down to earth people. I would recommend their business to anyone!", "pics": null, "resp": {"time": 1566511838821, "text": "Thanks, Jory. Great to meet you."}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "108925569266067464469", "name": "karolina higgins", "time": 1581362801626, "rating": 5.0, "text": "By far my favorite CBD store!!! Aaron is super friendly and helpful. Will absolutely be going again!!", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "109062773366732693196", "name": "John McKinney", "time": 1569965108461, "rating": 5.0, "text": "I've been in a few times. Always good information. Hands down the best CBD products on the eastern shore at Simply CBD.", "pics": null, "resp": {"time": 1570033362725, "text": "Thanks!"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "106739294398779146878", "name": "Mark Davis", "time": 1564574133851, "rating": 5.0, "text": "I love this store! Their product range is awesome! And they are more than happy to help with dosing and recommendations", "pics": null, "resp": {"time": 1564607375788, "text": "Thanks, Mark. We appreciate the kind words"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "117841573695259365375", "name": "Jenny Redmon", "time": 1567187515394, "rating": 5.0, "text": "This place is absolutely amazing. I was in a car accident and dealt with back and neck pain for the last 2 months. Within the first 10 minutes of being here, Aaron gave me something and the pain was completely gone! I will definitely be back!!", "pics": null, "resp": {"time": 1569848315523, "text": "Thanks so much for the kind words, Jenny!!"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "101604373345679878734", "name": "ur friendly neighbourhood garbage man", "time": 1572546736554, "rating": 5.0, "text": "Couldn't help but stay and learn about the kinds of CBS and what's best for different kinds of people! So nice and helpful!!", "pics": null, "resp": {"time": 1572550956127, "text": "great to meet you!"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "111808037760151755888", "name": "David Sharp", "time": 1564447706119, "rating": 5.0, "text": "Simply CBD is amazing. Very knowledgeable staff. They offer more than CBD oils and you can find  something for everyone.", "pics": null, "resp": {"time": 1564454023489, "text": "Great to meet you, David"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "113291055749631734483", "name": "megan Meshelle", "time": 1574281130087, "rating": 5.0, "text": "The owner is very friendly and approachable very welcoming atmosphere went in my back was hurting as i go to therapy 3 days a week he gave me the hard candy within 5 minutes my back pain was so much better he was absolutely rite about all the information he gave me thank you simply cbd", "pics": null, "resp": {"time": 1574309090209, "text": "Thanks, great to meet both of you today"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "108613274494149034649", "name": "Richard Evens", "time": 1566161523927, "rating": 5.0, "text": "I have been driving out to Canabama for the last few months to get CBD for my arthritis. This location is way more convenient and I feel like they know a little more about the products. I'm going to start going here from now on.", "pics": null, "resp": {"time": 1566163411908, "text": "Thanks, Richard. We are happy to help."}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "100650233004286635575", "name": "Matt B", "time": 1566499016801, "rating": 5.0, "text": "Excellent experience here.  Aaron was extremely knowledgeable and answered many questions.  Great products and service.  Thanks!", "pics": null, "resp": {"time": 1566511706784, "text": "Thanks, Matt. Great to meet you both. Let us know how things work for you."}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "108769668486553898983", "name": "PsychoSchemer", "time": 1567287628047, "rating": 5.0, "text": "Fantastic customer experience! Chad knows their products well and is ready to answer any questions. Happy!", "pics": null, "resp": {"time": 1569848223321, "text": "Thanks so much!"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "108483736104128292290", "name": "R P", "time": 1589826460885, "rating": 5.0, "text": "Friendly and knowledgeable, super informative on all of their products.", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "115516955933212912063", "name": "Devin Choinski", "time": 1579036384119, "rating": 5.0, "text": "every time my wife and I go to this cbd shop we are always greeted with a smile and a positive attitude. All of the employees are extremely helpful and have very high quality items. I would recommend this shop to everyone who might be interested in trying cbd or if you are looking for high quality cbd this is the one stop shop. The employees also go out of their way to educate you on the products that are currently in the store and go into depth on what products will benefit you the most. I have nothing but the at most respect for all of the employees at (simply CBD) do yourselves a favor and stop by the shop. You will not regret it!!", "pics": null, "resp": {"time": 1579040078440, "text": "WOW! Really appreciate that, Devin"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "113360570735967758066", "name": "Stephen Jackson", "time": 1565291476079, "rating": 5.0, "text": "The Costa Rican CBD infused coffee is amazing! Simply CBD is a great addition to the area. Can’t wait to try the other products!", "pics": null, "resp": {"time": 1565307294665, "text": "Thanks for trying and thanks for the review"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "106217724021468043143", "name": "Beth Oltean", "time": 1573674896544, "rating": 5.0, "text": "Great store with people who know what they are talking about. Happy I stopped in", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "107304316161372049993", "name": "Todd Blackwell", "time": 1573492049347, "rating": 5.0, "text": "Hands down the best. I had been going elsewhere because of trouble sleeping. No one ever explained CBD vs CBG. Starting CBG has been the best thing ever. I can fall asleep and best of all stay asleep.", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "117614960668472450380", "name": "Meghan Williams", "time": 1567184351638, "rating": 5.0, "text": "Aaron was great! So knowledgeable and helpful.  A wide variety of products to choose from", "pics": null, "resp": {"time": 1569848369458, "text": "Wow! Thanks for the kind words!"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "117438538343771930341", "name": "Nathan Sides TSTREETZ200010", "time": 1566406141832, "rating": 5.0, "text": "They got everything you need.. the 2 guys that work there are very friendly and helped me with the many questions I had.. I would totally recommend this place and will keep going back myself We need more people like this in the world!!", "pics": null, "resp": {"time": 1566511865353, "text": "Wow! Thanks for the kind words. We are happy to help."}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "104802846386706673752", "name": "Hammet Blackwell", "time": 1565482618515, "rating": 5.0, "text": "Drive down from Fairhope. Staff was very knowledgeable and the store was nice. I’ve been taking a lower quality CBD for 3 months and noticed the difference in their product in 2 weeks. It’s helped me sleep and my back pain.", "pics": null, "resp": {"time": 1565996755459, "text": "Thanks so much for the kind words."}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "102233911812401405352", "name": "Donna Dubose", "time": 1566151307545, "rating": 5.0, "text": "I was looking for a CBD store near me, I googled and saw they were the top rated, so I stopped in. I can see why. These guys take what they are doing seriously. I'll be back !", "pics": null, "resp": {"time": 1566153854383, "text": "Thanks so much, Donna. I'm anxious to hear how things are working for you."}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "108488898952723492120", "name": "Can't Say", "time": 1575751655329, "rating": 5.0, "text": "Best CBD store in the general area. Just moved from Co. Glad Alabama has a place like this.", "pics": null, "resp": {"time": 1575996173174, "text": "Thanks for the great feedback. We won't share your info either:)"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "101747037309685246056", "name": "Jeff Chamberlain", "time": 1566704751678, "rating": 5.0, "text": "Great selection and very friendly and knowledgeable staff. Will definitely be back!", "pics": null, "resp": {"time": 1569848402579, "text": "We appreciate it, Jeff"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "102598624514449042977", "name": "Amanda Hughes", "time": 1564512256582, "rating": 5.0, "text": "What a great experience! Thank you for answering all of my questions! Love the new store!", "pics": null, "resp": {"time": 1564607425970, "text": "We loved meeting you, Amanda"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "100910812666100343551", "name": "Jeff Stanton", "time": 1578601432378, "rating": 5.0, "text": "great selection of products. i highly recommend", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "116157651849865721487", "name": "Terri Hall", "time": 1576676079437, "rating": 5.0, "text": "Super friendly and knowledgeable. Let me try a sample while I was there and talked to me about the products and differences to help me get the most for my money.", "pics": null, "resp": {"time": 1578093939010, "text": "Thanks so much Terri"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "110595427696034196097", "name": "joe lane", "time": 1565109272978, "rating": 5.0, "text": "Owners are Very Helpful and Informative about CBD Products and Health Benefits, Answered All Questions and Provided Handouts of Written Information. Great Customer Service.", "pics": null, "resp": {"time": 1565307312669, "text": "Great to chat, Joe"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "116109331642951461146", "name": "Perry Moran", "time": 1574808916449, "rating": 5.0, "text": "Dude was super friendly! Gave me a little extra just because 😊", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "113348137755135830715", "name": "Todd Matthewas", "time": 1565019805385, "rating": 5.0, "text": "Learned a lot about the benefits of cbd and the different quality of products being sold. Store is very nice and owners are easy to talk too and tailored product to my needs.", "pics": null, "resp": {"time": 1565307334063, "text": "Thanks, Todd. Great to meet you"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "111301087374242008116", "name": "Steph Morris", "time": 1573251523674, "rating": 5.0, "text": "Love this place! So informative and great product.", "pics": null, "resp": {"time": 1573272268636, "text": "Thanks for the kind words !"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "114090673976247001244", "name": "Justin Gilmore", "time": 1567807733922, "rating": 5.0, "text": "Amazing products and the staff is very knowledgeable and are willing to help in any way.", "pics": null, "resp": {"time": 1569848206036, "text": "Thanks, Justin. Really appreciate the kind words"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "112802679394242914899", "name": "Chad Hughes", "time": 1564456302310, "rating": 5.0, "text": "It was perfect, I had the chance to discuss several products with Aaron, and felt a lot more informed about the benefits.", "pics": null, "resp": {"time": 1564607449697, "text": "Thanks for the review, Chad"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "107911705250846279924", "name": "Linda Strathmore", "time": 1566510852222, "rating": 5.0, "text": "How is this place not on everybody's radar. 10 min in store and I know more about CBD than an hour researching. I sampled pain cream and IT WORKS!", "pics": null, "resp": {"time": 1566511680781, "text": "Thanks, Linda. We are happy to help!"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "110050294724552033065", "name": "Santyonia Bradley", "time": 1566246413741, "rating": 5.0, "text": "He's very knowledgeable about the products that he distribute.Friendly environment.Ienvironment.I will definitely be back.", "pics": null, "resp": {"time": 1566511888396, "text": "Hey Santyonia, appreciate the kind words!"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "111700044493254923974", "name": "Tyrela Overstreet", "time": 1570211796175, "rating": 5.0, "text": "Tried the CBD Hemp Oil on my knee it's an awesome product", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "113277135867764362894", "name": "Claire Moses (clairebear4498)", "time": 1567284659638, "rating": 5.0, "text": "I didn’t know anything about cbd and I get anxiety and I went in to the one in daphne and Chad was really nice and explained everything I needed to know about it. I would definitely recommend this to anyone who has anxiety and like pain.", "pics": null, "resp": {"time": 1569848258557, "text": "Thanks for the kind words, Claire. We really appreciate it"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "106896899835348198962", "name": "Louis Primos", "time": 1573500569024, "rating": 5.0, "text": "I've been wasting my money on gas station gummies. These gummies here are incredible", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "111850064530953697884", "name": "Jennifer Bush", "time": 1566922848141, "rating": 5.0, "text": "Best CBD products in the area with the most knowledge staff to boot!", "pics": null, "resp": {"time": 1566946518845, "text": "Thanks, Jennifer. We really hope you enjoy the Dropout Hippy products. Let us know your thoughts."}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "103750221618093947290", "name": "Autumn Jordan", "time": 1566755602482, "rating": 5.0, "text": "Great environment, knowledgeable, friendly staff, reasonable prices, superior products.", "pics": null, "resp": {"time": 1566946584686, "text": "Thanks, Autumn. We are proud of our staff and thankful for you!"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "112502801180270912807", "name": "Bart Roberts", "time": 1566422691831, "rating": 5.0, "text": "I was refereed by my podiatrist  in Fairhope for planters fasciitis. I went in not knowing anything. I got the foot cream and it has been working wonders. Glad I stopped in. If you have foot pain, I highly recommend.", "pics": null, "resp": {"time": 1566511818623, "text": "Thanks, Bart. We are always thrilled when we are referred by doctors and nurses. We are eager to hear how the foot cream works out for you."}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "111804387748482287611", "name": "Emma Boles", "time": 1573859567712, "rating": 5.0, "text": "Best CBD shop I have ever been to! The staff is very knowledgeable and helpful, especially Aaron!", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "102728659745213150957", "name": "Shana Jordan", "time": 1564452762430, "rating": 5.0, "text": "I was very impressed by the selection and knowledgeable staff at Simply CBD.  I have enjoyed the products I purchased and planned to shop there again soon.", "pics": null, "resp": {"time": 1564453941880, "text": "Thanks, Shana. It was great to meet you"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "106093609589524967246", "name": "Aaron VanHauter", "time": 1572386387674, "rating": 5.0, "text": "Great selection, better than most stores", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "109468353842594575272", "name": "Sarah Hinote", "time": 1589384462835, "rating": 5.0, "text": "Great products and great people!!", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "118216130242454778396", "name": "Paul Steuben", "time": 1564704578730, "rating": 5.0, "text": "So awesome thank you for being there!", "pics": null, "resp": {"time": 1564704872027, "text": "Really enjoyed meeting you, Paul"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "116752408011285694288", "name": "Steven Jones", "time": 1576102468356, "rating": 5.0, "text": "Wonderfully friendly and a beautiful indoor location!", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "117337504062032373048", "name": "Suzie anonomous", "time": 1572560821826, "rating": 5.0, "text": "My new favorite place.", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "112880151610156289221", "name": "Trisha", "time": 1611509395446, "rating": 3.0, "text": "Call before you go, they aren't always there when they are supposed to be open.", "pics": null, "resp": {"time": 1611867085490, "text": "Thanks, Trisha. We appreciate your efforts to let everyone know on Google, Facebook and other platforms. Just a reminder to you, we are only open until 6 pm weekdays and 4 pm on weekends. Our hrs are posted on our website, Google, Facebook. This will help to make sure you arrive when we are open"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "112040403959266349788", "name": "Robert Causey", "time": 1571684574644, "rating": 5.0, "text": "Very friendly and good product's", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "117905744239236101022", "name": "ty m", "time": 1575591635694, "rating": 5.0, "text": "Amazing hospitality and amazing products", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "116861609157367076175", "name": "Mary Bean", "time": 1564673823001, "rating": 5.0, "text": "Love the owners and this fabulous product...I feel better already!!!  Thank you!!!!", "pics": null, "resp": {"time": 1564679589585, "text": "Thanks so much for the kind words, Mary"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "105702698951283710977", "name": "Kimberly Brown", "time": 1564443577619, "rating": 5.0, "text": "Very nice people wonderful store", "pics": null, "resp": {"time": 1564447069858, "text": "Thanks so much, Kimberly"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "107784547706226076506", "name": "Amy Newton", "time": 1571755964618, "rating": 5.0, "text": "Very helpful and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "101244101735231314505", "name": "jenniferbryars bryars", "time": 1564671137912, "rating": 5.0, "text": "Very helpful and knowledgeable staff!", "pics": null, "resp": {"time": 1564679609147, "text": "Thanks for the kind words, Jennifer"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "101405465933271791930", "name": "Dylan Morgan", "time": 1596154767777, "rating": 5.0, "text": "Very knowledgeable", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "114447326140661739037", "name": "Bob Dillingham", "time": 1570221932661, "rating": 5.0, "text": "Gummies are great!", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "117453624357676386222", "name": "Wendy Holmes", "time": 1569466691900, "rating": 5.0, "text": "Professional, fun and informative!", "pics": null, "resp": {"time": 1569848107664, "text": "Great to meet you, Wendy"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "103938331398378462031", "name": "Tammye Thomas", "time": 1574701209404, "rating": 5.0, "text": "Great store!", "pics": null, "resp": null, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
{"user_id": "112835144832751034271", "name": "Gabby C", "time": 1628109223774, "rating": 5.0, "text": "Erin is very friendly and knowledgeable about the products he is selling! Will most definitely be back!", "pics": null, "resp": {"time": 1628110174852, "text": "Thx, Gabby. Great to meet you today"}, "gmap_id": "0x889a43fe24e74baf:0xf1eba32366be7fde"}
