{"user_id": "107797963116797806453", "name": "Rayuna", "time": 1497626240114, "rating": 5.0, "text": "Nice and comfortable shoes to fit your style.", "pics": null, "resp": null, "gmap_id": "0x88891672f972695d:0x59069cf30c21ea28"}
{"user_id": "104705150340321118443", "name": "B Andrews", "time": 1461620674485, "rating": 1.0, "text": "Closed business", "pics": null, "resp": null, "gmap_id": "0x88891672f972695d:0x59069cf30c21ea28"}
{"user_id": "105845787218720530333", "name": "Jean Hawkins", "time": 1597104888482, "rating": 5.0, "text": "David  Ford is the best.    Happy retirement!!", "pics": null, "resp": null, "gmap_id": "0x888918a303322c55:0xbfff2036c7d6d734"}
{"user_id": "107960863016799096613", "name": "Meredith R.", "time": 1594988987013, "rating": 1.0, "text": "Dr. Refused to wear a mask in exam room with me.  I complained but he did not care!!!", "pics": null, "resp": {"time": 1595626652691, "text": "I’m sorry for whatever led to this dishonest review. We last saw Meredith in April 2020 when our state was under the “Stay At Home” order. At the time, masks were not required but were only recommended. While I did enter the room without a mask, Meredith rudely asked why I didn’t have one. I responded because they were not required; however, if it made her more comfortable I would be happy to wear one. There was no refusal to wear a mask. I would have happily worn one and now do everyday. She replied by saying that it was fine and she didn’t want to argue. I agreed that I wasn’t interested in arguing and only wanted to help with her inserts. After the adjustments of her device were made, I returned into the room where Meredith had apologized for her rudeness. I am shocked to have received notification of this review because she left in such a good mood. During her visit, we had safety measures in place, but masks were not one of them. In April and May, our office had anyone scheduled to notify us via phone once they had arrived. We would call them back via phone when a room was available for them to come in. As the effects of this virus increased, our office began asking everyone to wear masks during there visit. We did not make this mandatory and left the decision up to each individual. However, as of July 16, 2020 the state amended the “Safer At Home” order to require everyone to wear masks. As of now, we do not allow anyone in our office without a mask until this order has expired. Once expired our office will continue wearing masks but only recommend that our customers/patients wear one. We also began checking everyone’s temperature by using an infrared thermometer before signing in to be seen. I’m sorry that you are unhappy with how our business has attempted to operate during this unparalleled time. Hope your feet are happy!\n\nSteven Ford, C.Ped"}, "gmap_id": "0x888918a303322c55:0xbfff2036c7d6d734"}
{"user_id": "110546859777121500739", "name": "David Link", "time": 1503938888332, "rating": 5.0, "text": "these guys are great!  If your feet hurt, there's probably a good reason, and help is right down the road.  Have recommended to several friends.", "pics": null, "resp": null, "gmap_id": "0x888918a303322c55:0xbfff2036c7d6d734"}
{"user_id": "115101653314170874752", "name": "Shooting Snow's Sig Sauer", "time": 1510234974000, "rating": 5.0, "text": "My feet were hurting so bad that I walked with a noticeable limp. I was spending $185 on Nike air max thinking I was getting the support I needed. My wife works with one of the Ford’s spouses. She texted them one night when my feet were killing me. He graciously helped me set up an appointment. I went in and he watched me walk and wrote a list of suggested shoes that would better serve me and took a mold of my feet. I bought the shoes (way cheaper than air max) returned to their clinic and they put my custom orthotics in and made sure everything was adjusted properly. My feet no longer bother me and my back pain is way better as well. These are top notch professionals that know how to treat people. I hope this family business continues many more years of success. Thanks for helping my aching feet.", "pics": null, "resp": null, "gmap_id": "0x888918a303322c55:0xbfff2036c7d6d734"}
{"user_id": "106679891537229808398", "name": "Alex Farris", "time": 1528472740146, "rating": 5.0, "text": "Great team to work with. Fixed my plantar fasciitis with an affordable pair of insoles. One squeaked a bit in my dress shoes, which I did not bring to them when they fit my orthotics, so they made me an appointment, adjusted the orthodic, and tested them in all of my shoes. Incredible service. Incredible product. Skilled technicians. I'd recommend them to anyone!", "pics": null, "resp": null, "gmap_id": "0x888918a303322c55:0xbfff2036c7d6d734"}
{"user_id": "110522338733002691162", "name": "John Phillips", "time": 1478530032769, "rating": 5.0, "text": "Well, needless to say, like many other folks I did not realize that so much of the discomfort I was feeling when I walked or even moved was the result of my feet , my shoes, my posture, and unfortunately my aging body! My orthopedic surgeon from UAB referred me to  David and Steven Ford for custom orthotics. I had tried some of \"off the shelf\" varieties from the local drug stores with minimal success but had no idea the huge difference these would make. Admittedly there has been some adjustment period but everyone there has been so nice and gave me a heads up as to what was going to happen. I think setting expectations is a huge part of any medically related procedure and they set mine realistically and in a timely manner. I just wish I had known about all this sooner, I couldn't imagine anyone being more professional, courteous, knowledgeable, and gracious in taking care of foot/walking.issues!", "pics": null, "resp": null, "gmap_id": "0x888918a303322c55:0xbfff2036c7d6d734"}
{"user_id": "105878173024680553650", "name": "Beth Tullis", "time": 1497383622443, "rating": 5.0, "text": "Everybody is a class act. They work to please and the services they offer make the long, almost 2 hour drive with it,  I tried a service nearer my home and watched my feet condition get worse.", "pics": null, "resp": null, "gmap_id": "0x888918a303322c55:0xbfff2036c7d6d734"}
{"user_id": "107147723076151231224", "name": "Tambi Smith", "time": 1624913339259, "rating": 5.0, "text": "Excellent customer service.  Noel is friendly and knowledgeable.  Please note that parking is limited and some of the parking spaces are very near a busy street,  N.Florida Street.  Limited Seating Space.  Will accept walk-ins and you can call for an appointment.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xbf456910256c66be"}
{"user_id": "104800146653051875752", "name": "Sharon Condon", "time": 1593213248456, "rating": 5.0, "text": "Pep in my step with style, socks; service by a professional appreciated", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xbf456910256c66be"}
{"user_id": "118370586464360725071", "name": "Radical By Choice", "time": 1527717871396, "rating": 5.0, "text": "Noel was very attentive to my needs and was able to get me what I needed after determining my fit. I would highly recommend to anyone with special shoe needs.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xbf456910256c66be"}
{"user_id": "115100296227831995070", "name": "Noel Miller", "time": 1418902128912, "rating": 5.0, "text": "Moved to 107 N. Florida St. next to Southern Glass.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xbf456910256c66be"}
{"user_id": "107471558746086037022", "name": "Toni Higdon", "time": 1592504028744, "rating": 5.0, "text": "Very informative, and professional yet had me feeling like family as soon as I went in. Adam and his staff are wonderful. My feet are very happy . 😊", "pics": null, "resp": null, "gmap_id": "0x888925d19907ba9b:0x7c02648225091175"}
{"user_id": "104691504731213721995", "name": "Mike Lane", "time": 1604524527046, "rating": 5.0, "text": "Nice folks good service", "pics": null, "resp": null, "gmap_id": "0x888925d19907ba9b:0x7c02648225091175"}
{"user_id": "114922403398897708181", "name": "wendy bivins", "time": 1510243564491, "rating": 1.0, "text": "The specialist seems knowledgeable and spent time explaining things to us HOWEVER the office staff is rude and not helpful AT ALL. We were told our orthotics would be ready in a couple of days........when we explained this to the office staff Jennifer was rude and said the specialist had no business saying that and he didn’t know how things worked. She would not listen and just kept saying the same thing over and over....finally she asked if I wanted to talk to someone else, I said yes please and she YELLED great into the phone. The next person I talked to actually listened to my ONE question...answered it and it was no problem. She said give it a week and if we had not heard anything call back. So I called back today. Jennifer answered and checked on the status. Well turns out she sent the forms 3 weeks ago and had not heard from anyone (I would think she would have checked up on it but nope) ....if I wanted to I could call the doctors office myself and request the forms I could....which forms I asked....what we sent them was the answer I got. Does she have the Dr’s number? No but I can look it up. So I do Jennifer ‘s job for her....turns out she had not sent any forms to the doctor and to top it off that’s not where the forms go. lol  I let the office know what they needed to do (cause ya know I work there lol) let’s see how that goes 🙄", "pics": null, "resp": null, "gmap_id": "0x888925d19907ba9b:0x7c02648225091175"}
{"user_id": "115275793398287114429", "name": "Michele Cahoon", "time": 1536702450810, "rating": 5.0, "text": "Everyone extremely helpful & nice", "pics": null, "resp": null, "gmap_id": "0x888925d19907ba9b:0x7c02648225091175"}
{"user_id": "104330646584934472050", "name": "Melissa Morris", "time": 1623947266204, "rating": 5.0, "text": "If I could give more than five stars, I would! I went in for hiking shoes, not having done my research beforehand, and the sales associate knew her stuff and helped me. I can say two weeks later, after just finishing multiple hikes in Yosemite National Park and other challenging locations, these are the best hiking shoes that I have ever worn-water proof and all! They are perfect for what I needed. The associate also helped me find everyday shoes and the owner herself tried them on with me, so I could see them “on a model”, which was so incredibly helpful. The selection is wonderful, the staff is wonderful, and the owner was a delight to meet and be helped by, during a busy weekend day. I will never go anywhere else for shoes. Huntsville is super blessed to have this store!", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "101785387606434886160", "name": "Jill Campbell", "time": 1594750871874, "rating": 5.0, "text": "You have saved my life! I had knee replacement surgery in November and afterward I developed Planters Fasciitis as well as Neuropathy.  I came into Valley Sole in pain in February. You took the time to find the perfect fit in Birkenstock’s and Aetrix. I was finally able to walk without pain! After about 2 weeks I could continue my knee physical therapy without foot pain. I could flatten my leg without heel pain.  I continue to wear my Birkenstock’s around the house because it just plain fills better.  My feet feel better at the end of the day! Other shoes, your feet hurt at the end of the day. You have a customer for life! Just bought 2 pair of Naot’s with the same foot support.  And they don’t look like everybody else’s shoes from department stores. Thank you so much!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOiNz8WbqDi3OLGm1TkM_2VBZTHwZY2r8Ckk3E=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOCrYdchm4fnm4wKvGT6-t2ZuSkA0yTma-238c=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "103070374755172946576", "name": "Tonya & Robert Bickerstaff", "time": 1621797430831, "rating": 2.0, "text": "First of all, I will start by saying that the store appeared very clean and has a good selection of different brands of shoes that are displayed nicely and I was greeted before I even got halfway through the door.  But those are the only positive things that I can say about my experience.  The sales lady immediately asked what I was looking for and I told her that I would just like to look around for a few minutes if that was ok because this was my first time in the store.  Well, I guess that wasn’t ok because she started asking me all of these questions.  I told her that I wanted to look at a pair of Birkenstock but that I had never had a pair before so I needed help with the sizing and no one in my area carried them and I had driven over an hour to come and look at them.  She immediately tried to get me to look at another name brand and told me she liked them better but I told her that I was there to look at Birkenstock.  I guess I got the wrong idea about this store, since I didn’t know my size I thought maybe they would measure my feet and actually try to help with a size but I left just as about confused as I did when I went in.  She kept changing her mind about what size she thought I needed.  She ended up telling me they didn’t have my size and color in stock which is ok because by this point I probably would have not bought them anyway and I don’t know how she even knew about the size when she kept changing her mind.  She told me that since I had never had Birkenstock before that there was going to be a break in period and that I still needed to look at the other name brand that she was trying to push.  I told her that I wasn’t stupid enough to pay $135 for a pair of shoes without reading up on them and doing a little research and that was exactly what I had done with the Birkenstock that I was interested in.  I wasn’t wanting to spend that kind of money that day just because I had nothing better to do, I knew exactly what I was wanting to look at.  She told me that she didn’t like Birkenstock because they hurt her feet but before I could get out of the store, she told me that she had two pairs that she loved.  What???  And if this was not already bad enough, at one point she left me standing barefoot in the middle of the store next to the Birkenstock display so she could go follow some lady around that was making a return that she had apparently helped a day or two before.  There was another associate that could have helped her.  And my sales lady was walking around with the shoe that I was needing to try on.  Needless to say, I don’t think I’ll ever be back and I would much rather shop at the small locally owned stores and with the craziness of the last year, you think they would appreciate your business but this store doesn’t need to count on me to keep them in business.", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "104308324505659751669", "name": "Peter Speak", "time": 1623528920374, "rating": 5.0, "text": "Very friendly and helpful staff. They had the shoes I was looking for.", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "105238076099831527271", "name": "Lynn", "time": 1619571623916, "rating": 4.0, "text": "Very nice store but extremely limited men’s selection.", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "106085565034140908834", "name": "Laura Stiegler", "time": 1620423914410, "rating": 5.0, "text": "I love Naot shoes and Valley Sole.  Everyone is friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "117010782273473596792", "name": "b wilson", "time": 1595091041496, "rating": 5.0, "text": "Valley Sole is AMAZING!  I have been shopping here for years! I will never shop for shoes anywhere else.  Holly & Julie are a wonderful team, they put their heart & soul into finding the perfect shoe for you.\nEvery shoe I own comes from Valley Sole  <3", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "101290195222994483803", "name": "Lela Morrow", "time": 1599159086904, "rating": 1.0, "text": "Knew exactly what I was looking for and Valley Sole had come highly recommended.  The moment I entered the store, the associate was incredibly rude.  I brushed it off and gave her the benefit of doubt —everyone has a bad day.  However, the encounter continued when I told her which shoe & what size I needed.  She quickly popped off implying that I had never worn said brand, etc.  A younger associate came over to help and was very nice.  While VS had the exact shoe I was looking for (and I would have purchased in more than one color; I even asked to try on the colors I intended to purchase) and while I always try to shop local, I left the store—which is something I would normally never do—and went just down the road where I was able to make my purchases.   Small businesses hold a special place in my heart however if I am belittled from the moment I walk in the door, that’s certainly not a place that I want to do business.", "pics": null, "resp": {"time": 1599227345164, "text": "I am so sorry to hear about your experience. Yes, we all have bad days but our goal is always to not only help our customers find the perfect shoe but also to make a friend and be a bright spot in their day. Please send me an email to julie@valleysole.com so that we can make it right. Thank you for supporting local businesses, especially during this crazy time."}, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "113959203740179957633", "name": "Christy Davies", "time": 1588641625532, "rating": 5.0, "text": "I love Valley Sole!  Julie is so knowledgeable about the different brands and works really hard to find the perfect shoe for you!  I will keep shopping here because my feet have never been so comfortable and the customer service is the best!", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "103275647510424941294", "name": "Marcie Grossman Smith", "time": 1568671452733, "rating": 5.0, "text": "What a treat it is to find an independent retailer who cares about their Customers! Julie and her team are truly lovely, charming, and dedicated. I feel fortunate to have accidentally wandered into Valley Sole and will return the next time I’m in the area for sure!", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "116164815586249182467", "name": "Misty McNeill", "time": 1568674496281, "rating": 5.0, "text": "Love this shoe store! They carry all the best brands for your feet!! Wish there were more like it!  We need more quality professionals providing stylish but good for your feet shoes!", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "111008572519800677972", "name": "Denise Kidd", "time": 1568760165424, "rating": 5.0, "text": "I love shopping at Valley Sole!  They have a wonderful selection of shoes of all types.....dressy and casual and offer wonderful personal assistance.  Her shoes are not your run of the mill shoes and are extremely well made and wear like a glove!  I live in Fayetteville and drive an hour just to shop at this store.  I love recommending them to folks especially when they tell me how cute my shoes are!!!", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "117857575502550454708", "name": "Suzanne Stogner Comer", "time": 1596025961092, "rating": 5.0, "text": "Best people, best place, best selection, best customer service! Shop local with Julie and her crew at Valley Sole❤️", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "107208371284489311548", "name": "Michelle Lee", "time": 1565709557385, "rating": 5.0, "text": "I LOVE THIS STORE! It's my favorite shoe store! The staff is amazing! They sell more than just Birkenstocks! Go and give them a try you wont be disappointed!", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "104017853916029606804", "name": "Paige Nihart", "time": 1568721554682, "rating": 5.0, "text": "Visited when out of town and in a crunch to get shoes...\n\nGreat selection of shoes! Employees were very helpful and went above and beyond to help me get what I was looking for! You won’t be disappointed!", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "117952791479918960728", "name": "Laura Cambra", "time": 1568678102170, "rating": 5.0, "text": "I was in the area for business and stopped by this awesome shoe store.  Great selection and amazing customer service! Wish you guys were closer to home!", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "112440137175503322682", "name": "Kelly M", "time": 1568734055036, "rating": 5.0, "text": "Cutest store. Great selection and awesome customer service! Will definitely be back!", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "104047946350542932007", "name": "Leslie Hamm", "time": 1568914711167, "rating": 5.0, "text": "Love this store! They have a great selection of shoes. Not only if the staff friendly, but they are very knowledgeable about the brands they sell. Can’t wait to go back!", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "102326486445649424305", "name": "Emily Futransky", "time": 1568752167578, "rating": 5.0, "text": "Happened upon this gem recently. Can't say enough good things. Awesome selection, lovely service.", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "101467853302603772000", "name": "Tammie Berzett", "time": 1568649395483, "rating": 5.0, "text": "Valley Sole is an amazing shoe store.  It is unfortunate there are people in our society that stoop to low life tactics to try to ruin someone's business.  To the owner of Valley Sole.....keep up the wonderful service you provide to the Huntsville community.", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "105981422335121837889", "name": "S. Beltran", "time": 1564155156446, "rating": 5.0, "text": "I received outstanding personal service here in my search to find comfortable shoes. The friendly salesperson recognized when the shoe was a touch too big before I did! I found three pairs of perfect fitting shoes but alas, I only budgeted for one pair and a pair of Birkenstocks for my son. My husband now wants a pair of Birks. :)\n\nI can’t believe it took me four years of driving past it on Airport before walking into this shoe store. I can’t wait to buy my next pair of shoes at Valley Soles! :)", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "118124686708823284835", "name": "Katie Thompson", "time": 1525800844989, "rating": 5.0, "text": "Great store and tons of selection!  Came in for Birkenstocks, and left wanting so much more after trying on some different styles of different types of shoes.  They are so kind and helpful.  They truly want you to have happy feet and to feel good in your shoes.  Extremely personalized and very patient.  Can't say enough great things!  Definitely worth a visit ... you'll probably even walk out wearing your new shoes!", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "109306820839935059583", "name": "Brea Harris", "time": 1497750513853, "rating": 5.0, "text": "I have looked everywhere for comfortable professional shoes to stand on for 10-hour days, and nothing seemed to work for me. I walked into Valley Shoes, and Julie listened well, understood my problem, and immediately took me to a new brand to try. The shoes she recommended fit so well and were so comfortable (and so cute!), and I'm excited to try them out at work. She was so helpful and friendly and even added a little extra padding because my foot is so thin. Best service I've had at a shoe store by far!!", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "105524007024654040141", "name": "Jackie Rettick", "time": 1568668802328, "rating": 5.0, "text": "Great service, wonderful selection. Will definitely be returning upon future visits!", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "115164146011695022945", "name": "Ruth Martin", "time": 1562782428460, "rating": 1.0, "text": "Shoe selection was great however I'm rating a one for service because when I walked in and stayed for a while looking around no one ever acknowledged me or asked if I needed help. It was very disappointing because I saw two pairs I would liked to have tried on but after 10 minutes with no offer of help I just left. They weren't very busy. The girls working there could have at least said, I will be with you in a few minutes.", "pics": null, "resp": {"time": 1562850836290, "text": "Ruth,\nYou are absolutely right and I am so sorry. We have several new employees as we grow and expand but greeting a customer (even when you are helping other customers) is day 1 of training and should not happen ever. Will you please send me an email to julie@Valleysole.com so that I can get more info about your visit and get this corrected immediately? I hope that you will try shopping with us again and if you let me know when you are coming I would love to personally work with you. Thank you for for getting in touch and I sure hope you’ll come back.\nSincerely,\nJulie"}, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "110615884467568173281", "name": "AM B", "time": 1568668676584, "rating": 5.0, "text": "Awesome selection & service. Julie was an amazing help & I love, love, LOVE my new shoes!", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "116656201302057394388", "name": "Creative Palette", "time": 1525806975694, "rating": 5.0, "text": "My 88 yr young mom gets swollen feet and ankles but still wants pretty shoes. Valley Sole hooked her up with some great sandals by revere that have strap extensions just for that problem. Great service! I love bringing my mom here for shoes because they are comfy, good looking and help keep her moving safely.", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "104526569374692652848", "name": "cj angeleyes", "time": 1568653820256, "rating": 5.0, "text": "Excellent shoe selection & customer service! Support your local business owners! ✨", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "101986887794688882594", "name": "Tami Pearson", "time": 1584828015230, "rating": 5.0, "text": "I can always find the shoes I want and the employees are always ready to help", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "108555082308919412122", "name": "Paige Parker", "time": 1512084263744, "rating": 5.0, "text": "I had a wonderful experience at Valley Sole! I have plantar fasciitis/heel spurs & the ladies at Valley Sole knew exactly what I needed. They were so attentive & helpful. They have a great selection of shoes. But the best part is that for the first time in months, my feet feel great. I will definitely be back!", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "100513417107277559882", "name": "Paula Mulqueen", "time": 1432081979188, "rating": 5.0, "text": "The service was attentive and friendly.  There is a wide selection of brands and styles. I had a good variety to choose from even though my foot is wide and difficult to fit.  The prices are very competitive.   I will definitely be back next time a need a pair of shoes.", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "110059684745387092360", "name": "michele pearce", "time": 1360011765283, "rating": 5.0, "text": "I love this store!  I started calling on them as a sales representative and after spending time in the store, was soon very impressed with the professional sales people working there.  They know their products so well and treat every customer like they are the most important person.  And the products... they have such stylish shoes, boots and accessories, i can't help but shop there, even when i am supposed to be on a sales call.  I bought the cutest pair of Bussola boots last month and every time i wear them, I get a ton of compliments.  I highly recommend Valley Birkenstock Sole for anyone who enjoys a great shopping experience and wants the latest styles.", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "103318999640571894198", "name": "Meredith", "time": 1496960983150, "rating": 1.0, "text": "Very disappointed in my experience today. I have been here before and the employees were helpful. I have read amazing reviews about customer service. Today, however, it was awful. I walked in and the two employees sat behind the desk and did not get up to offer any help. One was on their phone. In a store like this, I feel like I should not have to ask to try on a pair of shoes, I am usually being helped and they will offer to get me some to try on. It is not like a department store where you sometimes have to hunt down an employee. I probably should have just gone to one anyway. If I was the owner and had seen my employees being that lazy I probably would have fired them on the spot. Today, I was willing to drop $200 on shoes, and they had the ones I was looking for, but there was no way they were getting my sale.", "pics": null, "resp": {"time": 1497022040440, "text": "Meredith,\n\nI am so glad that you've had good experiences in the past and our goal is always to provide excellent customer service as well as unique products. I am so sorry for your bad experience yesterday. You are absolutely right, our ladies should be on their feet and ready to help! I have spoken with all of them and addressed this so that this will not happen again. We so appreciate you shopping local and I would love to personally help you next time you come in.\n\nThanks,\nJulie"}, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "110244926438207950501", "name": "Lois Flowers", "time": 1559010566294, "rating": 5.0, "text": "Love Valley Sole...the only store that has the best selection and cutest shoes that my customized orthotics can fit in.", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "107662698127528023014", "name": "Mentone Inn", "time": 1502165211256, "rating": 5.0, "text": "I own. Bed n breakfast,  I am on my feet 16-18 hours a day sometimes.  My cousin told me about Valley Sole in Huntsville. As soon as I sleepless into the store the owner and staff were very helpful and made suggestions based on what I told them.  I was blown away by the customer service.  She made sure the fit was right and the correct support on my arch.  I live 75 miles away , but I will be coming back ,", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "117750881773657817411", "name": "Carolyn Seaman", "time": 1478900166098, "rating": 5.0, "text": "I just had a great shopping experience at this store. I am very hard to fit and have literally been looking for a cute casual shoe with support for three months. Not only did they have something that fit me, but I had a choice! It was busy, but the staff was attentive and friendly. I will definitely go back.", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "112128218724184170083", "name": "Elizabeth Sheep", "time": 1568684356711, "rating": 5.0, "text": "EXCELLENT customer service and great selection!  Will certainly be back!", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "108955732997342905548", "name": "Paula Dickinson", "time": 1404263950589, "rating": 5.0, "text": "I've been here several times and like it more each time I shop.  I have really bad feet and have found quite a selection of stylish shoes that cater to your individual problem.  They also carry really comfortable orthotics for your old shoes.  The best thing about this shoe store is the service.  A clerk stays with you from the time you come in until you leave, helps you on and off with the shoes, etc.  They can special order a certain size or width and really try to satisfy you.  My feet are happy and it's nice to know there's a store here in Huntsville for people with special feet.", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "114963788074168812009", "name": "Daniel A. Williams", "time": 1568688475743, "rating": 5.0, "text": "Great owner, great selection! Love this place", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "103903311542095722452", "name": "lorena iacobone", "time": 1568681750506, "rating": 5.0, "text": "Great selection and awesome owners!! Will definitely be back!!", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "108736890311763872157", "name": "Zack Cullison", "time": 1525798877148, "rating": 2.0, "text": "Drove all the way from Athens because they wouldn’t answer there phone. Apparently they don’t do that anymore.  Why put your phone number out there if you aren’t gonna answer it. It was better when it was the Birkenstock store.", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "104585411681694541607", "name": "Allison Ott", "time": 1486433746508, "rating": 5.0, "text": "I came in looking for good work shoes to help my bad back and I found exactly what I needed. The owner was very helpful, she helped me find exactly what I needed. She didn't help me out just for her benefit, it was to provide me with good shoes. Very pleased with my experience and would recommend them to anyone.\n- Jesus Cordero", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "109904795457891553879", "name": "Julia Conner", "time": 1444696347319, "rating": 5.0, "text": "Service was fantastic!  Sales staff very patient and worked with me until I got just the right pair of boots.  Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "100148767282428465804", "name": "M F", "time": 1392659446217, "rating": 5.0, "text": "A GREAT place to purchase shoes of ANY kind!  Not only Birkenstocks....they sell many other brands and styles for all occasions. Comfortable shoes for everyone. Locally owned and they seem to be genuinely concerned about the correct fit and shoe for their customers.  I highly recommend Valley Birkenstock Sole!", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "104013365373902646881", "name": "Wayne Fisher", "time": 1487028934925, "rating": 5.0, "text": "The owners and the staff are awesome!  Very friendly, professional and most important knowledgeable.  Best of all, I now have super comfortable shoes that don't hurt my feet, woohoo!  I would not hesitate to recommend Valley Sole.", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "108638419804476844408", "name": "Erin Margarella", "time": 1568681824623, "rating": 5.0, "text": "Great selection! Great service!", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "106663404093677902270", "name": "Patricia Huebner", "time": 1395770605817, "rating": 5.0, "text": "What a lovely store!  A week ago my daughter-in-law asked me to go with her to buy  Birkenstock sandals for work.  She and I had never been to Valley Sole before and were pleasantly surprised.  Not only did they have a great selection but they were so nice and hospitable and really knew their products.  I got a warm vibe as soon as I walked in.  I ended up buying some for myself too and last weekend, went back with my mother to the store.  There aren't many stores with such nice customer service like this anymore.  Thank you!  I will be back!", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "111000775697068845575", "name": "Destiny Dennis", "time": 1488409327205, "rating": 5.0, "text": "The employees were so helpful. They made sure I got just what I wanted. Definitely recommend this store.", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "100957180811550531822", "name": "Jeannie Vereen", "time": 1450752890833, "rating": 5.0, "text": "I know it sounds dramatic, but the shoes and people at Valley Soul changed my life.  I was unable to sleep or find a comfortable position in which to sit or lie down.  Pain was shooting down my leg and foot and up my back and I was miserable 24/7. Finally I decided to go to Valley Soul to see if they could help me.  The employees listened carefully to what I had to say and then brought out several different shoes for me to try on.  It was amazing! My pain started to subside as soon as I put on their shoes.  Needless to say, I only buy from them now and highly recommend Valley Sole for their excellent caring and competent staff and collection of fabulous shoes!", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "117618047622928303176", "name": "Susan Cornelius", "time": 1437402217714, "rating": 5.0, "text": "I always have a great experience at Valley Sole.  Great service.  They work hard to find the right shoe for me.  The shoes are so comfortable.", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "106866243142776445009", "name": "Pam Stapleton", "time": 1486040894178, "rating": 5.0, "text": "My favorite shoe store! I love the selection -- they always have new styles that are different from the bigger stores. Holly and Julie are so knowledgeable and always help you find the perfect fit and the right inserts if you need them. Birkenstock, Naot, Picolinos, Clouds -- I highly recommend Valley Sole!", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "114949366038817817360", "name": "Ashley DeHaye", "time": 1384896352927, "rating": 5.0, "text": "Really love the selection here and the staff has proven to be very knowledgeable every time I go. They don't just know what shoes they carry, they understand how those shoes fit different types of feet and what shoes might be best for lifestyle.", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "111142870505938353611", "name": "Brandi", "time": 1568682352403, "rating": 5.0, "text": "Great store with a great selection!", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "115430571602968175501", "name": "Heather Reid", "time": 1374942094719, "rating": 5.0, "text": "I had a great experience at Valley Birkenstock. I have wide feet and plantar fasciitis so I have difficulty finding shoes. The sales staff was helpful and knowledgeable and assisted me quickly to find Birkenstocks that fit great! I will definitely go back when I'm ready for another pair of shoes.The shoes are a little more expensive than what you find in department stores but I think this is probably a case of you get what you pay for.", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "106502264935109700409", "name": "Adrian McCobbie", "time": 1424734072515, "rating": 5.0, "text": "Holly is sweet and very heloful. Good service great atmoshpere. I enjoy my time at Valley Sole. I give them 5 stars for service .", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "107984262502712759464", "name": "A. T. Hislop", "time": 1406478833773, "rating": 5.0, "text": "After 20 years it was time to replace my Birkentock Boston's.  I headed to Valley Sole and was greeted with a very helpful and knowledgeable sales staff.  Not knowing what Birkenstock had to offer the salesperson went through all of the options and features.  This reinforced why I like to buy from a specialty store vs. online or department...it's the service you get!  I was able to order exactly what I wanted and I'd have to say that there is absolutely not way I'd be able do this on line and  it makes a big difference to see in person just what I would be getting.  In the process of our conversation I mentioned that I suffer from plantar fasciitis and it's a big part of why I love Birkenstock, for the support and comfort.  The salesperson lit up and mentioned that I have to try something...not that over the years, I've gone to local running stores and was offered several inserts that have been just OK.  And trust me, I've tried them all.  However, at Valley Sole I was introduced to BirkoSport inserts, which are very different...they essentially make any shoe feel like a Birkenstock.  Even if you don't suffer from any foot ailments, I'd try these, they are excellent and have several variations which would appear to meet any foot size/ shape etc.  I like these so much that I\"m going to invest in several pairs and upgrade all of my shoes, dress, running, work boots, skates, etc.  Also, while I was at Valley Sole I was introduced to several very high quality brands and purchased 2 other pairs of casual shoes.  I'd recommend Valley Sole due to the quality products as well as the friendly and knowledgeable staff.", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "118124126359352700942", "name": "Gail Brown", "time": 1360728998241, "rating": 5.0, "text": "Visited the store today and bought some of the wonderful SmartWool compression socks to wear on overseas flight to help prevent DVT.  Recently bought a pair of Naot shoes.  The employees were friendly and helpful.  Their inventory is always changing and they have trunk shoes from various reps from time to time.  I buy all my shoes from this store.  Have never had any problems with staff or products.  Would highly recommend store to friends, and frequently do!", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "110293356461958070135", "name": "Steve Mabb", "time": 1360261540861, "rating": 5.0, "text": "Just visited the Valley Birkenstock Sole store for a meet and great with customers and was very impressed with the staff and service provided.  The store looked great, was clean and tidy with a great range of stylish and comfortable brands.  Would recommend anyone looking for great shoes and sound advice to check it out - Holly, Julie and the team will take great care of you.  We are proud to have our brand represented in the store.\n\nSteve Mabb\nEVP\nOrthaheel footwear", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "104938225633010767193", "name": "Sierra Landoll", "time": 1568672999153, "rating": 5.0, "text": "Great friendly service 💗", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "112682817615494916804", "name": "Meredith Harrington", "time": 1568762481573, "rating": 1.0, "text": "They didn't have a big enough choice of shoes.", "pics": null, "resp": {"time": 1568774754470, "text": "This is not a valid review. We are in touch with google to remove this false review.  It is written in response to a disgruntled ex employee soliciting friends to leave reviews.  Please ignore."}, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "107441914548649178600", "name": "robin monroe", "time": 1509080879590, "rating": 5.0, "text": "Great service and nice selection of shoes with great support. Thank you, Valley Sole !", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "109701483268457501906", "name": "Stacey McSweeney", "time": 1404155000836, "rating": 4.0, "text": "I have a number of foot issues and I dreaded having to go in to buy orthotic shoes that would fit custom insoles, but I was pleasantly suprised by Valley Sole!  They have a great selection and can order so many additional shoes for you, as well.  The friendly and knowledgable sales associates helped me find shoes that fit my feet needs, as well as my sense of style.  While they have the styles you would expect, they have a nice selection of attractive, stylish shoes for a working professional.  Valley Sole is great about returns and even ordered another size for me when the original ones ordered ended up being too large.  I took one star off for price--these are pricer shoes and that can be hard to swallow.  But, the quality is much better and they are my go-to shoe store now, so it is worth the extra! I have been impressed thus far!", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "114474535176621277396", "name": "Martha Custer", "time": 1381965812242, "rating": 5.0, "text": "My husband has plantar fasciitis and I have been looking for a comfortable shoe for him.  I found Orthaheel on the internet and was trying to locate a store to buy them.  I phoned Valley Birkenstock and was told that they stocked them and they even checked sizes for me.  The next day we visited the store and were promptly greeted and offered assistance.  When I told the young lady what I was looking for, she remembered me calling the day before and even the size we were looking for.  She promptly brought out the shoes and talked with my husband about his plantar fasciitis problems. She brought out several other shoes, a compression sock and an ice pack- all to help with the plantar fasciitis.  My husband tried everything on and was so impressed with the feel of the Orthaheel that he wore them out of the store.\n\nJulie was the young lady that was helping us and she was very knowledge about her products,and was very helpful with suggestions.  She was very kind & polite.  My husband is very pleased with all his purchases and says he will be going back soon to purchase more shoes (this coming from a man that hates to shop - especially for shoes) all because of the personal attention & helpfulness that he received.\n\nThis store really knows the definition of \"Customer Service\"!", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "115153833312562975559", "name": "Mandie Harrington", "time": 1568753310304, "rating": 5.0, "text": "Amazing local business!", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "111810710671499578621", "name": "Sophia Muldrew", "time": 1359054752476, "rating": 2.0, "text": "I wish my first visit to Valley Birkenstock Sole on Airport Rd. in Huntsville, AL could be my last.\nDecember 31, 2012 was my first visit to the store, it was about 4:30pm.\nI made a purchase, the sales girl put the receipt in the shoe box.  On January 2, about 12:00pm, I went back with the unworn product, in the original box, receipt still in the box, to return the item.  (Note: A time lapse of less than 6 hours as they were closed on the 1st.)\nI was told that I could not return it because it was sale merchandize.\nThe communication of that policy was extremely poor- it is not posted, the sale items are not marked, individually or as a group, and the sales people do not tell you verbally.\nThe only place that policy is communicated is on the sales receipt.  In addition, there are no prices on anything: sale or regular price items.\n\nThe store manager told the sales girl that she would take care of me, asked me to wait while she checked on something.  Returning to take care of me, she informed me that she had checked store records and since I was a regular customer I knew  about the \"no return on sales merchandize\" policy and therefore she could not help me.  (This should give you cause for concern, regular customers are given no preferential treatment.)\nShe offered for me to leave the item with her and said that if I did and walked out, she had no further obligation.\nI continued to try to convince her that I was a new customer and had no idea about the policy.  I asked where it was posted, etc.  Her response was that in the state of Alabama it is \"Buyer Beware\".  I agreed that she could enforce that policy.\n\nI asked if she typically opened the shoe box to read the receipt before she left stores so she could find \"no return\" policies, because that is the only way I could have discovered theirs. (I use the word 'discover' intentionally because this store seems to hide everything: prices, policies...)\nI told her that reputation is important these days with internet data accessibility and that she left me with no alternative but to blog this occurrence.\nThen she wrote me a receipt stating the amount I was owed I could spend in cash with that piece of paper and if I lost it there would be no effort of correction.\n\nAs if all of this, and the fact that I was now required to return, was not bad enough, when I turned to leave she told me that had I behaved differently she could have resolved this another way.  Basically, she did not like me (subjective) so she chose not to return my money.\nTHIS IS A HORRIBLE WAY TO RUN A BUSINESS!!  She just admitted to me that she could have given me what I asked for.  God forbid we do what the customer wants.\nMy thoughts are that their business model is failing.  The only reason to go in this store is to try on the shoes you want to purchase for a fit check and then go and purchase them at a discounted price on the internet.\nThe manager's justification from the other blogs--that it is a service oriented store is untrue.  The sales staff is so immature and inexperienced that they are a bother.  If you ask a price you are told, \"oh it is about...\"  About?  When I am shopping and spending these amounts of money, I want to know the exact price.\nThey seem to have lost sight of the personal aspect of the business and are overly concerned with money.  As an example, did they not think that the sales person (blogged earlier) could also be a customer?  Can they not relate that his experience, and mine, will be publicized for other people's benefit?\nI have never been so poorly treated, ever.\nWhat a shame I have to go back.", "pics": null, "resp": {"time": 1359382495176, "text": "Dear Sophia,\n\nThanks for your feedback. Valley Birkenstock Sole is sorry to hear you are unhappy. We would like to help. Our policy for sale shoes is no return as these are priced for clearance.  Customers are told at the time of\npurchase and it is stated on our receipts that SALE shoe purchases are final.\nNormally we do not return sale shoes as is the policy, but it sounds like our manager accommodated you by giving you a store credit to purchase something else. When you return, if you will identify yourself to one of the owners, we will personally take care of you and make sure any questions or issues you have are addressed.\nValley Birkenstock Sole takes pride in well trained staff who offer full, sit down service.   I am sorry you did not have a pleasant experience in our store and we hope you will return to use your store credit very soon.\n\nBest regards,\nJulie Pierce and Holly McGinness, Owners"}, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "107271517859449854400", "name": "EVERYTHING CHILDERS", "time": 1495794166236, "rating": 1.0, "text": "First time I went & my last, unless I can't avoid them.  The lady totally embarrassed me & was arrogant & RUDE!!?  Her shoes aren't worth that to me.", "pics": null, "resp": {"time": 1497021783800, "text": "I am so terribly sorry for your bad experience. Please send me an email to info@valleysole.com or stop by the store so that we can talk about what happened. Our goal is always to love on our customers and I am so sorry that wasn't your experience.\n\nThanks,\nJulie"}, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "105128372703498872846", "name": "Holly Ellis", "time": 1511210866261, "rating": 5.0, "text": "Great service!  Great Shoes!", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "117490446709007167719", "name": "Rose Lee", "time": 1500650146145, "rating": 5.0, "text": "Great Experience.", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "100126403468993111127", "name": "Brittany Moon", "time": 1490805485178, "rating": 5.0, "text": "Excellent!!! Wonderful service and helpful people!", "pics": null, "resp": {"time": 1497022080111, "text": "Brittany,\n\nWe always love helping you! I hope you are loving your Birkenstocks!!!\n\nThanks,\nJulie"}, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "114558278491994282574", "name": "Nancy Maggart", "time": 1484958800877, "rating": 1.0, "text": "They do not back their products very well.  For the price you pay I would go to a different retailer and check their return policy and if they back their products.", "pics": null, "resp": null, "gmap_id": "0x8862132dc5e388db:0x4a2c43068782f22b"}
{"user_id": "103080100546766466069", "name": "Eric Shugart", "time": 1576258274551, "rating": 5.0, "text": "What a fantastic experience. Very pleasant and repaired a gash that I thought was not repairable. In addition, I had a pair of boots with a rubber edge I didn't wear because of the wear. After about 45 seconds, the entire boot looked brand new. Going forward, they will be doing all of mine and my wife's show polishing and repair. Highly recommend to anyone with realistic expectations around shoe repair and or patch services.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "106072381611661291586", "name": "Sarah Ramdeen", "time": 1512244217727, "rating": 5.0, "text": "I wish I had thought to take before pictures of my boots. They look amazing now that the repairs are completed. I brought in two pairs of boots and the craftmanship on both are incredible. They look like new.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNRnAKN9X2IepudoP6VLYzySgWKd46073R0Lfg0=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "113393998999103138159", "name": "Jessica Cost", "time": 1591299240834, "rating": 1.0, "text": "THREE MONTHS ago, I took a pair of boots in for stretching. Still haven't gotten them back. I called about 6 weeks ago to check on them and the lady on the phone was very condescending and short. So, by the time I'll be getting them back, it will be too hot to wear them. IF I get them back...who knows at this point?! Save your time, folks. Go somewhere else.\n\nAlso, their showroom is disgusting. The whole place reeked of cigarettes and it's just a disheveled mess. Guess my boots will smell like smoke, too. Ugh.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "111395873695052236621", "name": "Kirk Ward", "time": 1537967993230, "rating": 5.0, "text": "I just don't see what the problem is.  The owner is very professorial, does a quality job and if you ask his opinion on something, be prepared for the answer.............whether you like it or not.  On this visit, her repaired a cut on the side of one of my boots and then did a really good job of cleaning them up without changing the color.  All at a more than fair price.  I will keep going back for as long as he is open.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "116337750171208002553", "name": "Elli Maye", "time": 1557157097961, "rating": 1.0, "text": "I brought in a pair of brand new shoes that needed a little sewing on a stitch for reinforcement. The repair work was shotty with threads hanging off and the stitch came out while I was still in the parking lot. I went back in, showed the lady, and she offered to try again, but with a trip coming up, there was no time for that. She did give me a full refund. It would've been nice to have the work done right the first time. The stitching was not the worst of it though. The smell of the business is of pure cigarette smoke. I was unable to get the smell out of my shoes and I ended up donating them. I don't understand why this hasn't been mentioned in any of the reviews. Word of caution: If you walk in and there is smoke hanging in the air, your items will smell like that and it won't come out.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "115788679123989731942", "name": "Cody Mac", "time": 1562764463499, "rating": 5.0, "text": "I've taken some custom leather shoes in multiple times for repairs (heavy wear and tear), and they always do a great job for me, at a reasonable price. If you need any shoe repair, or custom footwear repaired, definitely check them out!", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "104115964812741211739", "name": "Patti Jean", "time": 1580162531212, "rating": 1.0, "text": "Not a place I would recommend. I've been several times and each time the service is poor, they only take cash. Price changes from drop off date. Mediocre  at best.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "103617577515275419563", "name": "Jerry Barclay", "time": 1461850262596, "rating": 5.0, "text": "Highly recommended!  I needed a pair of dress shoes resoled, and needed them done quickly.  The owner gave me a quick turn-around date, had the shoes ready when promised, did very nice work and charged a very reasonable price.  I won't go anywhere else.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "116983769715430897611", "name": "hannah vaughn", "time": 1533401107760, "rating": 1.0, "text": "Honestly this guy is a joke and very unprofessional. We went in to get patches sewn onto our vests. He insulted another shops previous work, was disrespectful about our organization, and laughed and said he didn’t want future business if we had any, but he’d “be happy” to do the work we needed (he obviously was not excited about bringing him business). On top of all that, he said it would take a week to get the work done and scolded me for not asking about how long it would take over the phone? He couldn’t quote me a price over the phone so why would I ask about how long it would take if he “has to see the patches in person first”? We went to JT’s shoe repair and they had it done in an hour with exceptional quality and was nice as could be. Don’t waste your time with this guy, go to JT’s.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "110718460370893007797", "name": "Joseph Gibson", "time": 1512970940095, "rating": 5.0, "text": "Good prices and great service. He is honest and does not try to trick you into buying anything. He gets the job done.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "118050249585712961585", "name": "Ben Nemec", "time": 1517247041863, "rating": 5.0, "text": "Fantastic service. He'll shine, repair, and even recommend shoe brands based on his extensive experience in the industry.  Would highly recommend.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "108795607591870059607", "name": "Hegan Belue", "time": 1436560887447, "rating": 5.0, "text": "I had shoes polished and repaired.  Good work and reasonable pricing.  The man at the counter was very nice to do business with.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "101490841847462557006", "name": "Ben McDaniel", "time": 1556647114317, "rating": 5.0, "text": "They did a great job on a pair of shoes that I thought were ruined. They are super helpful and I would definitely recommend them to anyone!", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "111266290864855258793", "name": "David & Lisa McCord", "time": 1469936351373, "rating": 5.0, "text": "Brady's Shoe Repair is awesome!  Steve is very friendly and does excellent work.  Reasonable prices, quick turn-around time, and shoes that look like new again.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "109419116976408349387", "name": "Bonnie Harrison", "time": 1509374498108, "rating": 5.0, "text": "We have had our shoes repaired there for many years and he has always done an excellent job. We highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "115512278464062442451", "name": "Dave Root", "time": 1513963641104, "rating": 5.0, "text": "My mother broke my wife's favorite sandles.  Took them to Brady and he fixed them on the spot! Great service! I'll be going back!", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "112906954687000494213", "name": "soylent green", "time": 1492869721933, "rating": 5.0, "text": "always helpful and offers only the service i need, nothing that i dont need. bradys resoles both my work boots and my dress shoes and the work has always been done beyond my satisfaction. a plus is that the shoes are always returned looking better than when i dropped them off. i always recommend bradys.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "104707098972841612233", "name": "Farley Church Of Christ", "time": 1582825578701, "rating": 5.0, "text": "BRADY HAS RETIRED.  BUSINESS IS CLOSED.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "113966587557562553100", "name": "Sharp Shinerz", "time": 1559149357909, "rating": 1.0, "text": "If I could rate a absolute zero then I would . Had my boots for almost 4 months and every time I called he said it would be the next week . He was very rude over the phone and blamed the store that sent them to him for me as to why it was taking so long . Went in and they still was not done after . The boots had not even been touched . He was very rude and disrespectful. He said he told us not to come in till they was done . That the boot store that sent them to him was lying and he had not had them but a little while , but the boot store has receipt for when they mailed it and when he got them . A 2 week job turned into 4 months of nothing. He is a liar , unorganized, rude, disrespectful, and unprofessional. I nor the boot store I used will be using him again .", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "102181201063576670618", "name": "Barbara Lee Norris", "time": 1500819757869, "rating": 5.0, "text": "Excellent repair of three pair of shoes. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "115132075894292883233", "name": "Katie Carpenter Stuhr", "time": 1468624474806, "rating": 5.0, "text": "The cobbler I recommend to all my friends...and you too.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "112699979732278133062", "name": "Lolita Jones", "time": 1551795408507, "rating": 5.0, "text": "Great place to take shoes for repair.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "118300175798471827665", "name": "Ric Patterson", "time": 1504127522050, "rating": 5.0, "text": "very pleased with his  work.....would recommend to anyone", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "103732718965218751981", "name": "Bill Allen", "time": 1471704273716, "rating": 4.0, "text": "They do a great job on shoes and boots. They do a horrible job of seeing patches to leather jackets/vests.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "109573694006607509589", "name": "Dana Dunne", "time": 1507363902642, "rating": 1.0, "text": "He insinuated my purse was cheap and that he could not repair it. Very rude.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "103426656294688436208", "name": "DJ Sam Smite", "time": 1531165157527, "rating": 1.0, "text": "Not done with excellence in mind. One should never have to pay for a repair and then be suggested to have to take it home to complete the repair with a touch up job. Counter productive.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "100693737314065081755", "name": "Amber Bianchini", "time": 1366585164371, "rating": 2.0, "text": "The repair was poorly done, expensive ($20 for stitching and glue on soles), and new damage was done to my shoes.  When I asked about the new damage, I was treated extremely badly.  I will not be returning.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
