{"user_id": "107181172965090758717", "name": "Stephen Fisher (Brainlok)", "time": 1532631241252, "rating": 2.0, "text": "He over sold me twice. He made these huge braces that would not fit in my shoes.  The second one didn't even address my foot drop.   I was fortunate enough to get a refund on the first one.  I ended up ordering an AFO off of Amazon that fits inside shoes that fit me. It saved me hundreds of dollars when the second one was found to be insufficient for my needs.", "pics": null, "resp": null, "gmap_id": "0x88626c9670fe8d95:0xfbea937f3346b230"}
{"user_id": "105845787218720530333", "name": "Jean Hawkins", "time": 1597104888482, "rating": 5.0, "text": "David  Ford is the best.    Happy retirement!!", "pics": null, "resp": null, "gmap_id": "0x888918a303322c55:0xbfff2036c7d6d734"}
{"user_id": "107960863016799096613", "name": "Meredith R.", "time": 1594988987013, "rating": 1.0, "text": "Dr. Refused to wear a mask in exam room with me.  I complained but he did not care!!!", "pics": null, "resp": {"time": 1595626652691, "text": "I’m sorry for whatever led to this dishonest review. We last saw Meredith in April 2020 when our state was under the “Stay At Home” order. At the time, masks were not required but were only recommended. While I did enter the room without a mask, Meredith rudely asked why I didn’t have one. I responded because they were not required; however, if it made her more comfortable I would be happy to wear one. There was no refusal to wear a mask. I would have happily worn one and now do everyday. She replied by saying that it was fine and she didn’t want to argue. I agreed that I wasn’t interested in arguing and only wanted to help with her inserts. After the adjustments of her device were made, I returned into the room where Meredith had apologized for her rudeness. I am shocked to have received notification of this review because she left in such a good mood. During her visit, we had safety measures in place, but masks were not one of them. In April and May, our office had anyone scheduled to notify us via phone once they had arrived. We would call them back via phone when a room was available for them to come in. As the effects of this virus increased, our office began asking everyone to wear masks during there visit. We did not make this mandatory and left the decision up to each individual. However, as of July 16, 2020 the state amended the “Safer At Home” order to require everyone to wear masks. As of now, we do not allow anyone in our office without a mask until this order has expired. Once expired our office will continue wearing masks but only recommend that our customers/patients wear one. We also began checking everyone’s temperature by using an infrared thermometer before signing in to be seen. I’m sorry that you are unhappy with how our business has attempted to operate during this unparalleled time. Hope your feet are happy!\n\nSteven Ford, C.Ped"}, "gmap_id": "0x888918a303322c55:0xbfff2036c7d6d734"}
{"user_id": "110546859777121500739", "name": "David Link", "time": 1503938888332, "rating": 5.0, "text": "these guys are great!  If your feet hurt, there's probably a good reason, and help is right down the road.  Have recommended to several friends.", "pics": null, "resp": null, "gmap_id": "0x888918a303322c55:0xbfff2036c7d6d734"}
{"user_id": "115101653314170874752", "name": "Shooting Snow's Sig Sauer", "time": 1510234974000, "rating": 5.0, "text": "My feet were hurting so bad that I walked with a noticeable limp. I was spending $185 on Nike air max thinking I was getting the support I needed. My wife works with one of the Ford’s spouses. She texted them one night when my feet were killing me. He graciously helped me set up an appointment. I went in and he watched me walk and wrote a list of suggested shoes that would better serve me and took a mold of my feet. I bought the shoes (way cheaper than air max) returned to their clinic and they put my custom orthotics in and made sure everything was adjusted properly. My feet no longer bother me and my back pain is way better as well. These are top notch professionals that know how to treat people. I hope this family business continues many more years of success. Thanks for helping my aching feet.", "pics": null, "resp": null, "gmap_id": "0x888918a303322c55:0xbfff2036c7d6d734"}
{"user_id": "106679891537229808398", "name": "Alex Farris", "time": 1528472740146, "rating": 5.0, "text": "Great team to work with. Fixed my plantar fasciitis with an affordable pair of insoles. One squeaked a bit in my dress shoes, which I did not bring to them when they fit my orthotics, so they made me an appointment, adjusted the orthodic, and tested them in all of my shoes. Incredible service. Incredible product. Skilled technicians. I'd recommend them to anyone!", "pics": null, "resp": null, "gmap_id": "0x888918a303322c55:0xbfff2036c7d6d734"}
{"user_id": "110522338733002691162", "name": "John Phillips", "time": 1478530032769, "rating": 5.0, "text": "Well, needless to say, like many other folks I did not realize that so much of the discomfort I was feeling when I walked or even moved was the result of my feet , my shoes, my posture, and unfortunately my aging body! My orthopedic surgeon from UAB referred me to  David and Steven Ford for custom orthotics. I had tried some of \"off the shelf\" varieties from the local drug stores with minimal success but had no idea the huge difference these would make. Admittedly there has been some adjustment period but everyone there has been so nice and gave me a heads up as to what was going to happen. I think setting expectations is a huge part of any medically related procedure and they set mine realistically and in a timely manner. I just wish I had known about all this sooner, I couldn't imagine anyone being more professional, courteous, knowledgeable, and gracious in taking care of foot/walking.issues!", "pics": null, "resp": null, "gmap_id": "0x888918a303322c55:0xbfff2036c7d6d734"}
{"user_id": "105878173024680553650", "name": "Beth Tullis", "time": 1497383622443, "rating": 5.0, "text": "Everybody is a class act. They work to please and the services they offer make the long, almost 2 hour drive with it,  I tried a service nearer my home and watched my feet condition get worse.", "pics": null, "resp": null, "gmap_id": "0x888918a303322c55:0xbfff2036c7d6d734"}
{"user_id": "117408969088274730899", "name": "Phoenix Whitewolf", "time": 1582650961074, "rating": 5.0, "text": "I worked for this company at one time and I am here to tell you that you won’t find a better orthotic company any place! Glenn, Barb, Jeannie, Keith, and Kathy are some of the best, most caring people I have ever known and it was an honor knowing and working with them!", "pics": null, "resp": null, "gmap_id": "0x888e805d29f80071:0xa1b13e12ff276f9e"}
{"user_id": "112160728932164480160", "name": "Jamie Rathbone", "time": 1503716332597, "rating": 5.0, "text": "I lost my leg in a very traumatic way. My stump is misshapen and very short. I was so afraid that I would never walk again. Those guys are like family. The encouragement,dedication, and being there at the drop of a hat to solve problems with the prosthetic. I Thank God for these wonderful people. Special thanks to Keith. Man you keep me going. The ladys in the office let my children come back and pet the cat and have a snack. It's a super atmosphere and family. Nothing is Impossible with THESE AWESOME FOLKS\nKindist Regards. Jamie Rathbone.", "pics": null, "resp": null, "gmap_id": "0x888e805d29f80071:0xa1b13e12ff276f9e"}
{"user_id": "106483366370668904230", "name": "Georgia Patterson", "time": 1529616944584, "rating": 5.0, "text": "Wheel chair assistant", "pics": null, "resp": null, "gmap_id": "0x888e805d29f80071:0xa1b13e12ff276f9e"}
{"user_id": "109408377861732161887", "name": "QUEEN CLEO", "time": 1570557431552, "rating": 5.0, "text": "Very friendly staff, of folks.the prosthetist does a great job..grandson was a happy camper walking out.. Great job", "pics": null, "resp": null, "gmap_id": "0x88626c9670faeb7b:0x56c59b696619ce85"}
{"user_id": "116879532344180830643", "name": "Destiny Delao", "time": 1509371020049, "rating": 5.0, "text": "Absolutely love this place Aj and the team have taken good care of my daughter her orthotics are doing well and she is about to recieve her SDO for spinal and hip support can’t wait to see the progress she makes wearing it", "pics": null, "resp": null, "gmap_id": "0x88626c9670faeb7b:0x56c59b696619ce85"}
{"user_id": "114472531325071771569", "name": "Jennifer Busick", "time": 1493760481483, "rating": 5.0, "text": "My daughter was thrilled that the thigh section of her KAFOs matched the colors in the AFO portion, I was thrilled that the shoes to fit the KAFOs are included, and in general A.J. and company have taken good care of my girl.", "pics": null, "resp": null, "gmap_id": "0x88626c9670faeb7b:0x56c59b696619ce85"}
{"user_id": "104069251205396286988", "name": "DMond D Outlaw", "time": 1488974945443, "rating": 2.0, "text": "Great staff", "pics": null, "resp": {"time": 1489175951069, "text": "Thanks, Glad we could help! If there is anything we can do to be a 5 star in your opinion please let us know. Thank you for your business, Cheers"}, "gmap_id": "0x88626c9670faeb7b:0x56c59b696619ce85"}
{"user_id": "113990214885842604690", "name": "India Garrett", "time": 1614620447805, "rating": 2.0, "text": "The only reason I'm giving it 2 stars is because the technician was very nice. We've been waiting for custom orthotics for some time now and the girl who answers the phone is very RUDE and not helpful at all. At this point I'd rather pay out of pocket to go somewhere else!!!", "pics": null, "resp": null, "gmap_id": "0x88929374e9799b25:0xd0a375f8bf6b0a0d"}
{"user_id": "115905181103171951809", "name": "heather crose", "time": 1615917643054, "rating": 1.0, "text": "This Brace Shop in Dothan is so incompetent that now my doctor will no longer send referrals there\nThey are rude on the phone & are even rude to my doctors head nurse she said.  The doctor is looking for a new brace shop for his patients", "pics": null, "resp": null, "gmap_id": "0x88929374e9799b25:0xd0a375f8bf6b0a0d"}
{"user_id": "111371934253402066223", "name": "Brennan Mulllins", "time": 1596478087808, "rating": 1.0, "text": "Very disrespectful, the little girl at the front desk is a lier! WOULD NOT recommend anyone going there! Scammers!", "pics": null, "resp": null, "gmap_id": "0x88929374e9799b25:0xd0a375f8bf6b0a0d"}
{"user_id": "115315208054912876158", "name": "Lisa Adams", "time": 1603905405505, "rating": 1.0, "text": "I went in August to get insoles. Have not got them to this day. They won't call you back and tell you anything.  Find some where eal to go.   Not HAPPY", "pics": null, "resp": null, "gmap_id": "0x88929374e9799b25:0xd0a375f8bf6b0a0d"}
{"user_id": "109421421101392068388", "name": "Jim Walder", "time": 1585308166685, "rating": 2.0, "text": "I'm amazed they stay in business with such poor customer service.  Rude arrogant associates citing make believe regulations to furthur their own agenda.  No different from Hanger when fitting diabetic shoes.  How did these young smarmy girls get so smart so soon?  Thanks to their Chinese connection there are no Medicare approved diabetic shoes made in USA.  Best to buy online.  The molded shoe inserts are a private joke shared by these charlatans & their Chinese cohorts.  Well, jokes on them as they advance in years when health issues overtake them and the shoe will be on the other foot!", "pics": null, "resp": null, "gmap_id": "0x88929374e9799b25:0xd0a375f8bf6b0a0d"}
{"user_id": "104157100508024377709", "name": "Roberta Harper", "time": 1573769033234, "rating": 1.0, "text": "I got a knee brace prescribed by my doctor went and got it and was sent a bill for it even though I have Medicare and Medicaid they sent me a bill and when I called the billing mgr told me to throw the bill away. I had him on speaker so my fiance can hear. He also heard him tell me this. They was gonna resubmit the bill. Mean while I been calling them about receiving said bill and was told they was taking care if it. This was in 2018 now 2019 I get sent to collections called them 4to6 time a and finally got a hold of them. That same person said he never said such. Which was a bold face lie. I have proof. Anyway they said I have to take it to Medicare. Called medicare they deemed it medically not necessary due to documention in which they SHOULD have called my doctor. And didn't. I was told I have to file a late claim due to their neglect to call me all this time. I wore the brace home and never touched it due to its not mine until its paid for. I also explained to Medicare I have had recent surgery on same knee and may need a partial knee replacement but its not medically necessary? 2 years of wasted therapy. So my new doctor did surgery recently and informed my fiance that my knee is a mess. I also fell at home today due to my knee. So I do not recommend this place as far as billing ... To boot I was told Willis the owner wont talk to me about this issue which I do not believe because he is a nice person. He needs to get rid of the billing mgr who lies and doesn't do his job when all he needed to do was call my doctor for documentation to get this taken care of. So I called my doctor office and they said this mgr has not called them once. And they would see what can be done. Also I now have to file a late claim because NOONE has the decency to call me to appeal this in time. Again the facility is nice and the owner is also he just needs to fix his billing dept. I am very disappointed because that man made this place Look bad.", "pics": null, "resp": null, "gmap_id": "0x88929374e9799b25:0xd0a375f8bf6b0a0d"}
{"user_id": "117901676803184968593", "name": "Terry Brantley", "time": 1572271827884, "rating": 5.0, "text": "I recommend this place to anybody they are very helpful I've been going there for 25 years and had great care.", "pics": null, "resp": null, "gmap_id": "0x88929374e9799b25:0xd0a375f8bf6b0a0d"}
{"user_id": "114198809551179763565", "name": "Ginger May", "time": 1550032324800, "rating": 5.0, "text": "These are some of the most experienced people you will ever meet.  I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x88929374e9799b25:0xd0a375f8bf6b0a0d"}
{"user_id": "104890392074648319122", "name": "james parker", "time": 1576526636655, "rating": 1.0, "text": "Save your time and go to Academy or one of the sports stores as I was told by them. Went in for an elbow brace and they have basically the same selection you see at Walmart! Was told they can't get one custom made or special ordered. No help here", "pics": null, "resp": null, "gmap_id": "0x88929374e9799b25:0xd0a375f8bf6b0a0d"}
{"user_id": "109143831631536263570", "name": "Lana Smitherman", "time": 1542543331354, "rating": 5.0, "text": "Excellent staff and knowledgeable practitioners.  Over 50 years serving the Wiregrass area.", "pics": null, "resp": null, "gmap_id": "0x88929374e9799b25:0xd0a375f8bf6b0a0d"}
{"user_id": "107543394613470604599", "name": "Tim Bigham", "time": 1528377537328, "rating": 5.0, "text": "Great people good attention to detail!", "pics": null, "resp": null, "gmap_id": "0x88929374e9799b25:0xd0a375f8bf6b0a0d"}
{"user_id": "115669756745756653297", "name": "william rollan", "time": 1628622563773, "rating": 1.0, "text": "Only gave 1 star because I had no other option! The Brace Shop is the ABSOLUTE WORSE choice in this area!! It is so bad my doctor refuses to send referrals to them. I highly recommend going else where. I highly recommend the Hanger Clinic. Pary Sumlar will take care of you at The Hanger Clinic in Dothan.  You will regret using this Dothan Brace Shop. Willis is the worst prosthetist I've ever met. He is a liar, he is rude, he is disrespectful and takes several months for a socket anywhere else provides in less than 2 weeks.  I waited for over a year for orthotic inserts for my shoes. But, they made sure to bill my insurance company and got paid a year ago. They are awful. Save yourself the trouble and go somewhere else!!! I regret ever trying them. I cant say 1 good thing about this pathetic place or Willis. The office manager is just as bad. Both are just as sorry!!! You will regret it if you choose to go to the Brace Shop!!! There is nothing Willis and the Brace Shop does to help you. The office manager is no better. All of these complaints and patients leaving at alarming rates and nothing is done about it. It's all about ripping you and your insurance company off. How much can they milk you for before you've had enough and leave. This place is the worst possible choice!!", "pics": null, "resp": null, "gmap_id": "0x88929374e9799b25:0xd0a375f8bf6b0a0d"}
{"user_id": "111446418921863034523", "name": "Charlotte Welborn", "time": 1614832534093, "rating": 1.0, "text": "Do not, do not do business with Complete Feet in Homewood or Hoover especially if filing Medicare claims for senior adults. I don’t think I have ever written a bad review for a retail establishment. Owner’s name is Michael. Please, pm me if you would like details. Horrible experience that no older person should have to go through!", "pics": null, "resp": null, "gmap_id": "0x8889197b567d4c47:0xb3f2189046eef"}
{"user_id": "113906093540040550451", "name": "2econdGuyTheory", "time": 1615308804700, "rating": 5.0, "text": "Haven’t even stepped foot in there yet and the staff went over the top to tray and schedule an appointment that works best for me! They seem to actually care about helping! Looking forward to my appointment!", "pics": null, "resp": {"time": 1615315868506, "text": "Thank you! We look forward to seeing you!"}, "gmap_id": "0x8889197b567d4c47:0xb3f2189046eef"}
{"user_id": "103124232991423274225", "name": "Debra Payne", "time": 1614112183797, "rating": 2.0, "text": "I bought two pairs of shoes and spent over $200.00 of which one was the Ethel after 2 weeks of wearing, one shoes looks like the suede came off. I attempted to take back.  But she said she couldn’t due mfg would not take back. Very dissatisfied.", "pics": null, "resp": null, "gmap_id": "0x8889197b567d4c47:0xb3f2189046eef"}
{"user_id": "102205038743412760030", "name": "dean jones", "time": 1518877165951, "rating": 5.0, "text": "I highly recommend Complete feet. I've been going there for years and they're always professional and very personal. I work on my feet all day and they recommended everything from my work boots to my tennis shoes.  With the inserts they made my work boots are actually the most comfortable shoes I have and seems like I can walk all day without any problems. Thanks to Michael and his staff for helping me stay active.", "pics": null, "resp": null, "gmap_id": "0x8889197b567d4c47:0xb3f2189046eef"}
{"user_id": "111795847356676409360", "name": "Jenifer Schniper", "time": 1518729067135, "rating": 5.0, "text": "Great store, friendly staff and wonderful service! Everyone who Michael has seen in my family has had a great experience. Everyone who has waited on any of us has been professional and caring. What a great store. Will definitely be going back!", "pics": null, "resp": null, "gmap_id": "0x8889197b567d4c47:0xb3f2189046eef"}
{"user_id": "106291236239621555255", "name": "Arther Hontzas", "time": 1518712592771, "rating": 5.0, "text": "BEST Place in the Birmingham area to have custom orthotics made and to be professionally fitted for casual and sports shoes. The store is exceptional, and the staff are courteous, professional and well trained to fit you in your perfect pair of shoes.  Shoes are top quality and the service is fantastic.  Definitely give them a try.  Your feet will love you.", "pics": null, "resp": null, "gmap_id": "0x8889197b567d4c47:0xb3f2189046eef"}
{"user_id": "108824946382323543357", "name": "Jeremy Montgomery", "time": 1518735892619, "rating": 5.0, "text": "I can't think of anything negative to say here. It's a beautiful storefront with a staff of kind professionals. Amy is a sweetheart and will make sure that you are in a pair of shoes that fit well and that you love. Michael has made orthotics for many of my friends and has always taken the time to make sure everything is perfect. I'm a loyal customer, and wouldn't hesitate to recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x8889197b567d4c47:0xb3f2189046eef"}
{"user_id": "106966765844240025470", "name": "celia nadler", "time": 1518720071248, "rating": 5.0, "text": "Every experience I have had with Complete Feet and the Staff has been positive. Michael and Amy and everyone else are very knowledgeable about their products and helpful in choosing the right ones for my needs. Michael has also fitted and made orthotics for my immediate and extended family with excellent results, and they will continue to go to him as well.", "pics": null, "resp": null, "gmap_id": "0x8889197b567d4c47:0xb3f2189046eef"}
{"user_id": "112175123885117944453", "name": "Wes Bacon", "time": 1518988151051, "rating": 5.0, "text": "We had a great experience at Complete Feet. They were very knowledgeable and helped fit us with shoes and inserts that have been great. Would recommend to anyone in or passing through Birmingham.", "pics": null, "resp": null, "gmap_id": "0x8889197b567d4c47:0xb3f2189046eef"}
{"user_id": "114232889258110284992", "name": "Jamelle Allen", "time": 1518827120407, "rating": 5.0, "text": "Unbeatable staff and service. Michael and Amy make you feel at home. Great experience and highly recommended!", "pics": null, "resp": null, "gmap_id": "0x8889197b567d4c47:0xb3f2189046eef"}
{"user_id": "105960761725865239154", "name": "Opal Hall", "time": 1553476989697, "rating": 5.0, "text": "A really nice selection of shoes that a great for the feet. Small, but with very nice styles.", "pics": null, "resp": null, "gmap_id": "0x8889197b567d4c47:0xb3f2189046eef"}
{"user_id": "102065361293691750305", "name": "Ben Singletary", "time": 1518707649036, "rating": 5.0, "text": "I had problems with my right foot and the doctor said I could have a slight rip in my Achilles tendon. Surgery was an option....... well not to me. Complete feet was a second recommendation( should have been first ) for orthodics. The staff was friendly and helpful. I was seen, measured and in a week I had everything I needed. It has been a year now and the pain has pretty much stopped. Much cheaper and better option than surgery.", "pics": null, "resp": null, "gmap_id": "0x8889197b567d4c47:0xb3f2189046eef"}
{"user_id": "115559363847567769192", "name": "Sharon M", "time": 1518906301135, "rating": 5.0, "text": "My husband has multiple pairs of orthotics from Complete Feet and always received excellent customer service. He has flat feet and the shoes and orthotics he received there literally changed his life. He can walk much longer distances and is no longer in pain. I know he will be back!", "pics": null, "resp": null, "gmap_id": "0x8889197b567d4c47:0xb3f2189046eef"}
{"user_id": "100528614073351274790", "name": "S Hoffman", "time": 1518706624689, "rating": 5.0, "text": "My experience here has always been excellent. I have purchased five pairs of orthotics over the last several years and probably 10 pairs of shoes. I keep coming back because the pedorthic and shoe staff are knowledgeable, the place stands behind their product, and have always been willing to make things right.", "pics": null, "resp": null, "gmap_id": "0x8889197b567d4c47:0xb3f2189046eef"}
{"user_id": "106546262757402373259", "name": "Joshua Rutsky", "time": 1518707261048, "rating": 5.0, "text": "I came to Complete Feet with a nerve issue in one of my feet.  It felt like I had a constant itch about a half-inch under the sole of my left foot, and it was so irritating that I had started digging a ball-point pen into the foot where the itch seemed to be to try to stop it!\n\nMichael, the Orthopedics guy, told me what was likely happening was a nerve pinch, and that orthotics would relieve the pressure on the nerve and cause the itching to stop.  I was a little skeptical, but I also was digging into my foot with a pen, so I tried it.  Complete relief in a day!  It was wonderful.\n\nI stand all the time at work, and my orthotics have held up very, very well.  The pictures below are after nearly two years of daily use, and you can see they have only worn heavily at the toe.  I replace them every three years or so.\n\nI had a great experience with Complete Feet, and have recommended them to my friends and my family.", "pics": null, "resp": null, "gmap_id": "0x8889197b567d4c47:0xb3f2189046eef"}
{"user_id": "101066467537865483458", "name": "zeina berryhill", "time": 1518710612561, "rating": 5.0, "text": "They do a great job!!  They really care and are so nice, I plan on using them every time.", "pics": null, "resp": null, "gmap_id": "0x8889197b567d4c47:0xb3f2189046eef"}
{"user_id": "115741778187057904602", "name": "Jennifer Rawlings", "time": 1519164086215, "rating": 5.0, "text": "Best place in Birmingham for orthotics! Michael and his staff are very knowledgeable and pleasant to work with.", "pics": null, "resp": null, "gmap_id": "0x8889197b567d4c47:0xb3f2189046eef"}
{"user_id": "104556006737210816952", "name": "Julie Schweer", "time": 1519320120727, "rating": 5.0, "text": "I’ve only have great things to say about Complete Feet. Since I’ve been wearing the orthotics they made, my knees and feet have felt much better. Michael even repaired one of them after my puppy chewed it up. (The same day I took it in!). The friendly service is such a plus. Every time I go, Amy helps me decide which styles will work best.\n\nBack when I first got my orthotics  I needed some sandals for them. I was impressed with the wide selection of shoes Complete Feet offers.  Lots of styles, colors and heel variations. My favorite was the Wolky brand sandal with the style name “Jewel”. Since that day I have had SO many compliments. (Now I have three pairs of them.). I always tell each woman these sandals can be found at Complete Feet. They are awesome!  I also love my Wolky short boots. They carry other great brands like Naot and Taos; so many options!", "pics": null, "resp": null, "gmap_id": "0x8889197b567d4c47:0xb3f2189046eef"}
{"user_id": "101732073996626592344", "name": "terrance autry", "time": 1587674768597, "rating": 5.0, "text": "Doctor Clint Mullins is the best awesome job", "pics": null, "resp": {"time": 1600893184754, "text": "Hi! I apologize for the delay in response as the pandemic has delayed notifications.\rThank you for taking the time to leave this encouraging feedback! Hanger Clinic’s goal is to empower all of our patients with the best personalized prosthetic and orthotic care, and we appreciate hearing about your experience! All the best, Sonia from Hanger"}, "gmap_id": "0x889a4dea0c4b64d1:0xd8e07f1baa02827"}
{"user_id": "106167638210310614211", "name": "eot m (EchozofTruthMinistries)", "time": 1461248975574, "rating": 3.0, "text": "Great with toddles but they don't keep the word about when you get your custom  braces or assistance  gear, it's out of there hands,", "pics": null, "resp": {"time": 1533325273263, "text": "Hi, Thank you for taking the time to leave this review.  At Hanger Clinic we strive to provide the highest quality of customer service and care to each of our patients, and we’d love to hear what we can do better so you feel you are receiving five-star service. Please email HangerClinicCares@hanger.com so we can learn more about your experience. - Sonia from Hanger Clinic"}, "gmap_id": "0x889a4dea0c4b64d1:0xd8e07f1baa02827"}
{"user_id": "105230807166161869700", "name": "V_Ahava f r", "time": 1461249161963, "rating": 2.0, "text": "They really liars and all about the money there, there office manager is a devil , but the doctors seem decent , they don't see how bad the office staff is", "pics": null, "resp": {"time": 1533325035053, "text": "Hello, thank you for taking the time to provide this review. At Hanger Clinic we strive to provide exceptional customer service and patient care, and we are so sorry to see that you had a negative experience. Please contact me with more information at HangerClinicCares@hanger.com so I can look into this for you."}, "gmap_id": "0x889a4dea0c4b64d1:0xd8e07f1baa02827"}
{"user_id": "107471558746086037022", "name": "Toni Higdon", "time": 1592504028744, "rating": 5.0, "text": "Very informative, and professional yet had me feeling like family as soon as I went in. Adam and his staff are wonderful. My feet are very happy . 😊", "pics": null, "resp": null, "gmap_id": "0x888925d19907ba9b:0x7c02648225091175"}
{"user_id": "104691504731213721995", "name": "Mike Lane", "time": 1604524527046, "rating": 5.0, "text": "Nice folks good service", "pics": null, "resp": null, "gmap_id": "0x888925d19907ba9b:0x7c02648225091175"}
{"user_id": "114922403398897708181", "name": "wendy bivins", "time": 1510243564491, "rating": 1.0, "text": "The specialist seems knowledgeable and spent time explaining things to us HOWEVER the office staff is rude and not helpful AT ALL. We were told our orthotics would be ready in a couple of days........when we explained this to the office staff Jennifer was rude and said the specialist had no business saying that and he didn’t know how things worked. She would not listen and just kept saying the same thing over and over....finally she asked if I wanted to talk to someone else, I said yes please and she YELLED great into the phone. The next person I talked to actually listened to my ONE question...answered it and it was no problem. She said give it a week and if we had not heard anything call back. So I called back today. Jennifer answered and checked on the status. Well turns out she sent the forms 3 weeks ago and had not heard from anyone (I would think she would have checked up on it but nope) ....if I wanted to I could call the doctors office myself and request the forms I could....which forms I asked....what we sent them was the answer I got. Does she have the Dr’s number? No but I can look it up. So I do Jennifer ‘s job for her....turns out she had not sent any forms to the doctor and to top it off that’s not where the forms go. lol  I let the office know what they needed to do (cause ya know I work there lol) let’s see how that goes 🙄", "pics": null, "resp": null, "gmap_id": "0x888925d19907ba9b:0x7c02648225091175"}
{"user_id": "115275793398287114429", "name": "Michele Cahoon", "time": 1536702450810, "rating": 5.0, "text": "Everyone extremely helpful & nice", "pics": null, "resp": null, "gmap_id": "0x888925d19907ba9b:0x7c02648225091175"}
