{"user_id": "110288935051937120950", "name": "Twink Holland", "time": 1600297253906, "rating": 5.0, "text": "This office has been so helpful to my family and me.  The entire staff is pleasant and professional.  They know who I am when I call and take care of my questions in a timely manner.  Making an appointment is easy, too.  Jenny Lee Southwood CRNP is pleasant, caring and takes her time with me each time I see her. She is never in a rush and listens to all my concerns.   I highly recommend this office without hesitation!  Thanks Jenny Lee, for taking care of my health!", "pics": null, "resp": {"time": 1600984649372, "text": "Thank you for taking the time to share your experiences, Twink! We're so glad that Jenny Lee and the rest of our team are meeting all of your health care needs with a personal touch. We'll make sure the entire staff sees your sweet comments."}, "gmap_id": "0x886265774d3585eb:0xdade2efa9001babe"}
{"user_id": "110402630337827717197", "name": "Jesslyn Helton", "time": 1598986645233, "rating": 5.0, "text": "Always a great experience. They are able to get me in quickly when I call. Front office staff is nice always. The office is always clean.  Nurse is wonderful and even recognizes my 7 year old son I bring with me and knows his interests. I see one of the nurse practitioners and I think she is one of the best. I have referred many people to her over the past few years. My entire family (husband, mother, grandmother, uncle, friends, etc) go here. I encourage anyone looking for a great family practice to consider them!", "pics": null, "resp": {"time": 1600983889504, "text": "Thank you for the amazing review, Mrs. Helton! It means so much that you trust our team to care for your entire family. We'll continue to do our best to provide you with great primary care and customer service."}, "gmap_id": "0x886265774d3585eb:0xdade2efa9001babe"}
{"user_id": "111919847587050381838", "name": "thomas holland", "time": 1600297808697, "rating": 5.0, "text": "I have been a patient with this group for over 5 years and am absolutely satisfied with their care. Being a healthcare professional, I understand what it takes to be a compassionate, caring person in that setting and Ms. Southwood, CRNP, does so effortlessly  with grace and kindness. She is knowledgeable and thorough in questioning me about my health concerns and during routine exams. The rest of the staff always greets me with a smile and my visits are always easy and I’m not kept waiting staring at the walls.", "pics": null, "resp": {"time": 1600985166807, "text": "Hello, Mr. Holland. Thank you for allowing us to serve you for the past 5 years. We hope you will be a part of our practice for many more. We'll let Nurse Practitioner Southwood know how impressed you are with her great care."}, "gmap_id": "0x886265774d3585eb:0xdade2efa9001babe"}
{"user_id": "102548003330948181880", "name": "Abby Patterson", "time": 1601584525485, "rating": 5.0, "text": "Dr. Jones is a fabulous doctor, very kind and caring. She diagnosed an issue that no other doctor has in the past ten years. Her MA, Ericka, was very helpful and made me feel comfortable at all times. I highly recommend!", "pics": null, "resp": {"time": 1602882576697, "text": "We appreciate the 5-star review, Ms. Patterson! We'll pass along your compliments to Dr. Jones and Ericka."}, "gmap_id": "0x886265774d3585eb:0xdade2efa9001babe"}
{"user_id": "103958553660015585453", "name": "Kendall Reasons", "time": 1605112323302, "rating": 5.0, "text": "This was the first time I have sat down with a doctor and didn’t feel rushed. Dr. Caton took her time and made sure to explain everything to me and it didn’t seem like she was rushing me out the door. I highly recommend her! She is highly knowledgeable and genuinely so sweet. Her and her staff are WONDERFUL!!", "pics": null, "resp": {"time": 1605300632030, "text": "Hello, Kendall. Thank you for taking the time to share your impressions of Dr. Caton and her staff. We're so glad you have found a physician you like and a medical home with our practice. We look forward to continuing to care for you."}, "gmap_id": "0x886265774d3585eb:0xdade2efa9001babe"}
{"user_id": "116745211881670401167", "name": "amy m", "time": 1597942040587, "rating": 5.0, "text": "I was looking for a new family doctor and found a great one here. I see Dr Jones and she’s awesome. I had no trouble getting an appointment, Dr Jones and her nurse were very thorough at my new patient visit, and she answered all questions/concerns I had. I have a six month follow up and that appointment is already scheduled and my orders for any labs I’ll need prior to the appointment are already in the computer system so all I have to do is go get them drawn and I’m ready for my appointment. I would recommend Dr. Jones to any of my friends and family.", "pics": null, "resp": {"time": 1600983335125, "text": "We appreciate the kind words and the great review, Amy! We''re thrilled that you chose us for your health care needs."}, "gmap_id": "0x886265774d3585eb:0xdade2efa9001babe"}
{"user_id": "103810599815799550327", "name": "Bonita Dixon", "time": 1600475198749, "rating": 5.0, "text": "I went to the Gurley clinic before it shut down and seen Gail Prentice CRNP for years. I was so sad when she transfered,and than the clinic closed so I moved to the Madison Clinic back to Gail Prentice, so happy to be back the office is nice and clean but best of all Im back seeing Gail Prentice shes the best. She listens to you and stays on top of your care, I have always received awesome service, and so Happy to be Back they are all so nice.", "pics": null, "resp": {"time": 1601058745853, "text": "Hello, Ms. Dixon. We're glad you have found a new primary care home with our practice. We certainly agree with your comments about CRNP Prentice and will let her know how satisfied you continue to be with her great care. Thank you for the wonderful review!"}, "gmap_id": "0x886265774d3585eb:0xdade2efa9001babe"}
{"user_id": "102375138421973727640", "name": "LIZ", "time": 1602019650936, "rating": 5.0, "text": "Great doctor!  I am very impressed with Dr Rachel Jones.  Recommend her to anyone wanting a wonderful, caring and knowledgeable doctor.  She listens and takes time to thoroughly answer all questions.", "pics": null, "resp": {"time": 1602882631458, "text": "Thank you, Liz! We appreciate you taking the time to tell others about your experience with Dr. Jones and our practice."}, "gmap_id": "0x886265774d3585eb:0xdade2efa9001babe"}
{"user_id": "107833215524621874995", "name": "S Valentine", "time": 1614440334064, "rating": 1.0, "text": "Had my first appt with Gail Prentice CRNP. She was not very personable and easy to talk to. She was very condescending and I felt rushed and interrupted. She literally did nothing but ask random questions which really couldve been done over the phone. I also have to wait a month to get labs and another appt. Will  definitely not return.", "pics": null, "resp": {"time": 1614635947747, "text": "Hello. We are very sorry to hear about this and would like to talk with you personally about your concerns. Please call (256) 265-5970 at your earliest convenience and ask for the Practice Administrator."}, "gmap_id": "0x886265774d3585eb:0xdade2efa9001babe"}
{"user_id": "108317384834369512132", "name": "Yushima C.", "time": 1598392048158, "rating": 5.0, "text": "I met with Dr. Jones for the first time today. I felt heard. I felt hopeful. I feel empowered. I have been going here for a while, my other doctor has her strengths as well. I am literally excited for my next visit.", "pics": null, "resp": {"time": 1600983525929, "text": "This is wonderful to hear, Yushima! We'll make sure to pass along your compliments to Dr. Jones. Thank you for allowing us to care for you."}, "gmap_id": "0x886265774d3585eb:0xdade2efa9001babe"}
{"user_id": "104028300468606341538", "name": "Thomas Stricklin", "time": 1606053580407, "rating": 5.0, "text": "I rely on Ms. Southwood, CRNP, for all my primary care. She is a caring professional who is knowledgeable, courteous, and VERY thorough. She patiently answers all my questions, addresses any concerns, and is careful to ensure that I understand everything discussed. She closely coordinates my care with various specialists and my complex pharmacy requirements (diabetes and cancer). I trust her completely with my care. I also wish to acknowledge the nurse that assists her, Ms. Monterusso. She is also a caring professional who always puts the patient's welfare and comfort first. The other support staff at the facility are also great. I don't really know how it could be any better.", "pics": null, "resp": {"time": 1611343561254, "text": "Hello, Mr. Stricklin. Wow, what an amazing account of your experience with CRNP Southwood! Our goal is for every patient at Huntsville Hospital Physician Care-Madison to be as satisfied with their care as you are. We'll make sure that she and Nurse Monterusso see your kind comments. Thank you so much for sharing!"}, "gmap_id": "0x886265774d3585eb:0xdade2efa9001babe"}
{"user_id": "103318455905715245587", "name": "Yushima Cherry Burks Author, Therapist, CEO (YearofYushima)", "time": 1611861765556, "rating": 2.0, "text": "A lot of things change from the first visit to my last. A lack of communication from Dr. Jones could have caused significant injury to me.", "pics": null, "resp": {"time": 1611933872219, "text": "Hello. We would like to speak with you personally so we can better understand your concerns. Please call (256) 265-5970 and ask for the Practice Administrator. We look forward to hearing from you."}, "gmap_id": "0x886265774d3585eb:0xdade2efa9001babe"}
{"user_id": "108285411515617626890", "name": "Tekoa Shager", "time": 1604679691781, "rating": 5.0, "text": "Jenny Lee Southwood and the entire staff are polite and professional. I would recommend them to my friends and family.", "pics": null, "resp": {"time": 1605300385102, "text": "Thanks so much for the kind words and the great review! We appreciate your support."}, "gmap_id": "0x886265774d3585eb:0xdade2efa9001babe"}
{"user_id": "116894786698488966308", "name": "Tim McCarley", "time": 1600876088058, "rating": 5.0, "text": "Jenny Southwood and Ashley are both outstanding.  Very Professional and genuine!!!", "pics": null, "resp": {"time": 1601058807584, "text": "Thanks for the kind words and the 5-star review, Mr. McCarley. We're glad to have you as part of our growing practice."}, "gmap_id": "0x886265774d3585eb:0xdade2efa9001babe"}
{"user_id": "112774353358659303152", "name": "Ryan Henson", "time": 1581087168868, "rating": 1.0, "text": "Worst experience ever! I made a appointment over a month ago for today 2-7. I get to my appointment 45 min early to fill out new patient paperwork and was informed that I was not on the schedule. Instead of them fitting me in because they made a mistake they tried to give me a new appointment in another two weeks. I waited a month for this appointment what the heck. I take thyroid medicine I am almost out of.  I would have gave less stars if I could have, this was absolutely the worst doctor office experience I have ever had!", "pics": null, "resp": null, "gmap_id": "0x886265774d3585eb:0xdade2efa9001babe"}
{"user_id": "108737591660527194709", "name": "Heidi Fowler", "time": 1598997570627, "rating": 5.0, "text": "Great staff!  Always helpful and kind.", "pics": null, "resp": {"time": 1600983925033, "text": "Thank you for saying that, Ms. Fowler. We appreciate the 5-star review!"}, "gmap_id": "0x886265774d3585eb:0xdade2efa9001babe"}
{"user_id": "111475007468530469941", "name": "Shelby Franco", "time": 1580134830061, "rating": 5.0, "text": "I absolutely love Dr. Caton! She takes the time to listen to all your issues and addresses them. I've been looking for such a doctor, I've finally found her!", "pics": null, "resp": {"time": 1580164745744, "text": "Thank you for the kind words and the five-star review, Ms. Franco! We're glad to hear that Dr. Caton is the perfect physician match for you."}, "gmap_id": "0x886265774d3585eb:0xdade2efa9001babe"}
{"user_id": "104131612729561731015", "name": "Allwrite Now", "time": 1583172071207, "rating": 1.0, "text": "I saw them regularly years ago until I relocated. I’m now back in the area. I wanted to schedule an appointment with a different physician but was told they don’t allow that. So I will be searching elsewhere for a new primary care doctor (where I actually have a choice in my physician).", "pics": null, "resp": {"time": 1583522715707, "text": "Your feedback is very important to us, Ms. Fleming, and we will share this review with our leadership. Please consider calling the practice administrator so we can address your concerns directly. Our number is (256) 265-5970. Thank you."}, "gmap_id": "0x886265774d3585eb:0xdade2efa9001babe"}
{"user_id": "116430763658145394986", "name": "Jaime Justice", "time": 1565975286025, "rating": 5.0, "text": "Dr. Caton took a lot of time to talk to me and give advice. She was very pleasant and definitely listened to everything I had to say and provided thoughtful advice. Very friendly and helpful and the office is nice, as well.", "pics": null, "resp": {"time": 1566245319864, "text": "Thank you for the five-star review and the kind comments! We'll make sure Dr. Caton and the rest of the staff sees this."}, "gmap_id": "0x886265774d3585eb:0xdade2efa9001babe"}
{"user_id": "116048788582616524219", "name": "Michael Willcutt", "time": 1582230587989, "rating": 1.0, "text": "Second clinic in over six years came here hoping for better office personal an medical doctor's, first was told didn't take my insurance. LOL, I knew better after leaving driving back to Huntsville to talk with insurance provider I get a call from office they do take my insurance. Did get to see nurse practitioner next day. But that was kinda late for I was seeking a referral to my cardiologist because I believe I was having a heart attack no one believes I was having. I'm sorry toreport just days later I was hospitalized and ended up having five bypasses.  Now  needing new prescription filled. Got meds I didn't need an none I did .on third missed dose  nottwenty points over heart surgeon wants major head achs now. Maybe someone needs to retrain your people. Not acceptable unless you work for Crestwood.", "pics": null, "resp": {"time": 1582326403648, "text": "Your feedback is important to us, Mr. Willcutt, and we will share your comments with our leadership. We also invite you to call our practice administrator so we can properly address your concerns. Our number is (256) 265-5970. Thank you."}, "gmap_id": "0x886265774d3585eb:0xdade2efa9001babe"}
{"user_id": "113751131244191665184", "name": "Clayton Baswell", "time": 1577834821812, "rating": 1.0, "text": "Let me start by stating I am a business owner... very rarely do I rate business with one start however this situation more than merited this rating. If it were possible to give less stars I would do so.\n\nI have never been treated so disparagingly or with such utter patronizing disdain from a medical provider in my entire life. Gaile Prentice CRNP (not even a medical doctor mind you) was assigned to me when I called in for a general wellness check over a year ago.  After a not so pleasant initial experience with a CRNP who was clearly not well trained or very competent for that matter I thought I'll try again when I call back next time for another appointment with another doctor. Unfortunately you are assigned the same doctor for LIFE at this practice.\n\nThis is the most absurd practice concept I have ever heard of. Instead of seeking the best doctor patient relationship this practice cares more for administrative duties and collecting as many co pays as possible.\n\nAs my wife accompanied me to my appointment literally in tears pleading for  help with managing my general anxiety we were met with ZERO SYMPATHY and were denied a refill of an very common anti anxiety medication I have used in the past on multiple occasion when it was absolutely necessary to do so (valium).\n\nRather than attempting to dig into the problem she exasperated the issue and the most she would do was refer me to a psychiatrist. Never mind in Texas with my  primary care doctor I was able to get prescription refills without ever having to see such a doctor. They were more than competent and experienced enough handle simple issues like these.\n\nI was treated with contempt and my personal integrity was questioned on multiple occasion regarding a medication I have been taking literaly for years.\n\nDo not waste your time with this practice. Do not waste your time with Gaile Prentice, she is utterly unsympathetic, contentious, and unqualified as a Certified Nurse Practitioner to act as a primary care provider.", "pics": null, "resp": null, "gmap_id": "0x886265774d3585eb:0xdade2efa9001babe"}
{"user_id": "100711436639210465966", "name": "gail springer", "time": 1557529375944, "rating": 1.0, "text": "Worst experience ever. Went in to discuss bloodwork and explained I was having anxiety issues. She upped my anti-depression medication which did nothing for my anxiety. Told me if it didn’t help to call and they would do something else. Called twice and didn’t even get the courtesy of a return call. Guess they wanted another co-pay. Time to move on.", "pics": null, "resp": {"time": 1557764677502, "text": "Hello, Ms. Springer. We're very sorry to hear about this. Your feedback is important to us, and we would welcome the opportunity to speak with you about your concerns. Please call (256) 265-5970 and ask to speak with the practice administrator. Thank you."}, "gmap_id": "0x886265774d3585eb:0xdade2efa9001babe"}
{"user_id": "109811541241996651176", "name": "Nicole Guyton", "time": 1447951876824, "rating": 5.0, "text": "She is a very patient and caring physician. She takes the time to really listen to my concerns and needs. I'm excited that she is my primary care provider. I wish I would of found her sooner !", "pics": null, "resp": null, "gmap_id": "0x886265774d3585eb:0xdade2efa9001babe"}
{"user_id": "107995391662594510004", "name": "roslyn guyton", "time": 1472735868147, "rating": 5.0, "text": "Great personnel, caring and knowledgeable doctor.", "pics": null, "resp": null, "gmap_id": "0x886265774d3585eb:0xdade2efa9001babe"}
{"user_id": "116390446182664171997", "name": "Steven McDowell", "time": 1586185876896, "rating": 5.0, "text": "Dr. Heather Haley is the best! I wish she could be my GP. The staff here are wonderful and are so helpful when you have a question.", "pics": null, "resp": null, "gmap_id": "0x88621354ebe8c1a9:0xfb1cfec34b1503a7"}
