{"user_id": "108073941194332818962", "name": "777", "time": 1541688872271, "rating": 5.0, "text": "I've gone to Dr. Bray for years.  He and staff were EXTREMELY sympathetic with me before Obama Care enabled me to get decent insurance.  I thank God, however, that things ultimately worked out for my condition ... and that Dr. Bray was a major part of God's plan toward my healing.  Utmost blessings always!", "pics": null, "resp": null, "gmap_id": "0x888a1b9bce919133:0xe0ea8b166ec24cd5"}
{"user_id": "114374684174069231446", "name": "Teresa Wilson", "time": 1517338572486, "rating": 5.0, "text": "Went in due to enlarged tonsil & mentioned having trouble hearing out of one ear. Dr. Bray ordered a hearing test upon my return visit, when he got the results he ordered a MRI, it was done 2 days later.  He called me in the same day to discuss the results. I am thankful for his professionalism & concern.", "pics": null, "resp": null, "gmap_id": "0x888a1b9bce919133:0xe0ea8b166ec24cd5"}
{"user_id": "115673388843333100695", "name": "Elana James", "time": 1495505264030, "rating": 1.0, "text": "Misinformed me on the phone about certain aspects of my visit. When I pointed this out in person the lady at the front desks attitude immediately changed to annoyance. As I left after not getting a check up due to said misinformation she perked up and threw a sarcastic and rather bitchy goodbye. I'm sure Dr. Bray is a wonderful doctor but his staff is rude and don't want to admit that they messed up the details. I would have been okay with it if they'd just forgotten and I'm sure it was indeed an honest mistake but an unnecessary snarky attitude is pretty damn unprofessional. I'm not rescheduling obviously.", "pics": null, "resp": null, "gmap_id": "0x888a1b9bce919133:0xe0ea8b166ec24cd5"}
{"user_id": "108679212906558368647", "name": "C Baker", "time": 1537800117086, "rating": 1.0, "text": "I think its seriously wild that you guys want to be rude and basically turn me away because I'm private pay. For those reading this, dont waste your time here with a rude staff that won't even try to get you in the door. Honestly.", "pics": null, "resp": null, "gmap_id": "0x888a1b9bce919133:0xe0ea8b166ec24cd5"}
{"user_id": "103324270911786742509", "name": "Alisa Davis", "time": 1475175148222, "rating": 1.0, "text": "I wouldn't even give them a star.  They are very unprofessional in the office.  They refused to give my daugter an appointment because she missed one due to cheerleading.  They went as far as to say something about my mothering skills.  My daughter suffers from seizures and other medical issues. I've never in my life spoken to more unprofessional people a day in my entire life! We will be seeing another dr.", "pics": null, "resp": null, "gmap_id": "0x888a1b9bce919133:0xe0ea8b166ec24cd5"}
{"user_id": "107116869042701574322", "name": "Gina Doran", "time": 1591714643910, "rating": 5.0, "text": "Dr. Carroll has performed two surgeries on my neck over the course of 16 years. I highly recommend him. He takes time to listen to your concerns, he gives you a thorough exam, even during a follow up, and he has a kind and caring demeanor. He always has a few student trainees with him who have turned out to be awesome doctors as well. After each surgery, you can see only a hint of the incision scar, and I healed completely. He is 100% amazing.", "pics": null, "resp": null, "gmap_id": "0x88891bc05c73d2fb:0xbd3473bac45ddc5"}
{"user_id": "107696002103436566529", "name": "Charlotte Parkinson", "time": 1575339673977, "rating": 5.0, "text": "Dr. Carroll saved my life in 2009. He is a very good doctor and has compassion for his patients.", "pics": null, "resp": null, "gmap_id": "0x88891bc05c73d2fb:0xbd3473bac45ddc5"}
{"user_id": "108460039661676221210", "name": "Addis Davis", "time": 1559434373909, "rating": 5.0, "text": "I was his patient in 2000 ....extremely thorough and great surgical experience through my treatment time.", "pics": null, "resp": null, "gmap_id": "0x88891bc05c73d2fb:0xbd3473bac45ddc5"}
{"user_id": "102450120890547456945", "name": "Leslie Knight", "time": 1573576990976, "rating": 5.0, "text": "Dr. Sillers is absolutely fantastic. He always spends an appropriate amount of time in the exam room and addresses every concern. I'm so grateful that I was referred to him 8 years ago. I'm from Huntsville, but I gladly drive 2 hours for my appointments because he's just that good. His office staff is always friendly and polite, and the ladies at the front desk always have a smile on their faces. Do yourself a favor and become his patient. You'll thank me later.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd1462139e0c6ea2f"}
{"user_id": "100252732228887378951", "name": "Kimberly Nation Morton", "time": 1593028112071, "rating": 5.0, "text": "He did my husbands sinus surgery a few years ago . He is the absolute best ! Also caring and great bedside manner ! No issues at all since surgery !", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd1462139e0c6ea2f"}
{"user_id": "105300371942809188227", "name": "Larry Forston", "time": 1591978691211, "rating": 5.0, "text": "Gives very understandable explanations of complex medical issues and is very caring for his patients. His medical expertise and practices are second to none", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd1462139e0c6ea2f"}
{"user_id": "117284092307261250557", "name": "Tracey Medley", "time": 1573589113767, "rating": 5.0, "text": "Dr. Fuller's and his staff were wonderful. They took great care of me from start to finish. I was well pleased with the service I received.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd1462139e0c6ea2f"}
{"user_id": "102272429015648882058", "name": "Darla Clifton", "time": 1591292681078, "rating": 5.0, "text": "6 months and 3 doctors later I am so thankful to have come across Dr. Sillers. My brother has been have problems with his ear and no one would take the time out to get to the root of the problem, just give him antibiotics and send him on his way. Dr. Sillers is the first person to sit and listen, and actually X-ray him to find the root of the problem. We got more feedback and learned more from one visit then 3 other doctors. I want to say a huge thankful to Dr Sillers and his team!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd1462139e0c6ea2f"}
{"user_id": "102063310698938911636", "name": "Amber Rogers", "time": 1573582664555, "rating": 5.0, "text": "Dr. Sillers is one of a kind! I've referred him to multiple friends and family and they always RAVE about his kindness, accuracy, and his ability to treat and cure their ENT needs. He treats our family like family and always sends us home feeling better! I could not recommend him more.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd1462139e0c6ea2f"}
{"user_id": "102547126500394740864", "name": "Brian Bellenger", "time": 1573577689461, "rating": 5.0, "text": "Dr. Sillars is terrific! He does a great job of checking me out whenever I have sinus issues, very thorough and makes me comfortable. Sincerely wants me to feel better. He and the entire staff are so friendly and helpful. I highly recommend Dr. Sillars and the staff at Alabama Nasal and Sinus Center!!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd1462139e0c6ea2f"}
{"user_id": "116644965187029321609", "name": "Bobbie Jo Wright", "time": 1476370309001, "rating": 5.0, "text": "What a wonderful first time visit to Dr. Sillers this week!  The new patient \"paperwork\" was a breeze!  I was NOT handed a clipboard with  20 sheets of paper to fill out! I answered a few questions on a hand held device and it was done. My wait time was literally less than 10 minutes in the waiting room. Once in the patient room, Dr. Sillers was there before the door closed it seemed. Dr. Sillers was extremely thorough and really listened to what had brought me there in the first place. Super nice guy. I would highly recommend. Thank you for respecting my time! I really appreciate that when I have to visit the doctor.  Keep it up the great work Dr. Sillers! It matters!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd1462139e0c6ea2f"}
{"user_id": "110502000585050766412", "name": "Todd Mixon", "time": 1573602741978, "rating": 5.0, "text": "Very professional staff, great communication, very experienced in complicated sinus issues.\nWould definitely recommend to other patients.\nDr. Sillers is very talented and a man of character.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd1462139e0c6ea2f"}
{"user_id": "110811940595881761301", "name": "Kenny Ingram", "time": 1573577151131, "rating": 5.0, "text": "I have been very pleased with the results of my sinus surgery from Dr. Sillers. My breathing is much better.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd1462139e0c6ea2f"}
{"user_id": "108137231908771335271", "name": "Tuffy Holland", "time": 1573590934821, "rating": 5.0, "text": "I suffered with chronic sinus infections most of my life. I had 4 other nose and sinus surgeries before I came to Dr. Sillers. Dr. Sillers told me he could help me but it would take 2 surgeries. After the second surgery I've been pretty much infection free for 12 years. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd1462139e0c6ea2f"}
{"user_id": "102467041401761573016", "name": "Allison Gregg", "time": 1573661291648, "rating": 5.0, "text": "His office and staff are very pleasant and welcoming. Dr. Sillers answered all of my questions with patience and understanding. He treated me for my ongoing nasal obstruction and I can breathe for the first time in many years. I would definitely recommend Dr. Sillers for anyone looking for a great ENT", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd1462139e0c6ea2f"}
{"user_id": "114851644919467052622", "name": "Paul Ward", "time": 1573596387059, "rating": 5.0, "text": "I had suffered from sinus issues for 30 yrs...was told and treated as allergies for yrs...then went to allergist who said I was not allegic to anything and she sent me to Dr Sillers. He did surgery 5 yrs ago and it was life changing. Did surgery on Thur and I was back to work on Monday. Now my wife and son and son-in-law have also had surgery. I can't say enough. I am 74 yrs old.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd1462139e0c6ea2f"}
{"user_id": "113150727842477847730", "name": "Nettie Mullins", "time": 1573753182111, "rating": 5.0, "text": "Dr. Sillers is great! He did a complicated tumor surgery (for a laymen's knowledge) and he and his staff were sooo nice. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd1462139e0c6ea2f"}
{"user_id": "101872190744463673247", "name": "John Tice", "time": 1573600632523, "rating": 5.0, "text": "Dr. Sillers is an exceptional physician who listens well and prescribes treatment responsibly and effectively. Birmingham is blessed to have Dr. Sillers.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd1462139e0c6ea2f"}
{"user_id": "107620743186755527392", "name": "ricky clowdus", "time": 1573581978334, "rating": 5.0, "text": "Great sinus surgery. I had problems all year and had to purchase OTC meds and prescription meds from another DR. before Dr. Sillers cleared my problem. This ER room was full of friendly and helpful employees. I will use him again if needed.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd1462139e0c6ea2f"}
{"user_id": "101110963377993830385", "name": "Kati Higginbotham", "time": 1573660112298, "rating": 5.0, "text": "Dr. Sillers is a genuine soul with a servants heart. He's extremely versed in Rhinology and Otolaryngology. If your looking for compassion and assistance with your ear, nose, or throat he's your guy.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd1462139e0c6ea2f"}
{"user_id": "101786680079003872404", "name": "Jack Coltrain", "time": 1573577646596, "rating": 5.0, "text": "Dr. Sillers performed sinus surgery on 3 years ago and I have not any issues until this year with sinus infection. I went my regular doctor from January to August and could not get cured. I made an appointment with Dr. Sillers and he found the issue and treated me and in no time I was relieved of the sinus infection. He assured me if any issues that last this long do not hesitated to come see. Thank Dr. Siller very much.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd1462139e0c6ea2f"}
{"user_id": "106299837382959742845", "name": "Rod Yates", "time": 1522431952365, "rating": 5.0, "text": "Had sinus infections for several months.  Tried injections and drugs but without success.  A friend recommended Dr. Sillers.  It took several weeks to get an appointment, but it was worth the wait.  He is a friendly caring doctor.  He performed a thorough examination and recommended sinus surgery.  He performed the surgery a week ago and I had my post op visit yesterday.  While sinus surgery recovery and the post op visit are not fun, I highly recommend Dr. Sillers.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd1462139e0c6ea2f"}
{"user_id": "100058312495210858475", "name": "Mike White", "time": 1573591055851, "rating": 5.0, "text": "Dr. Sillers helped me overcome years of chronic sinus pain and problems.  He is a wonderful person and his staff are great.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd1462139e0c6ea2f"}
{"user_id": "109608316626651994102", "name": "Anna Nash", "time": 1573684210259, "rating": 5.0, "text": "Dr. Siller’s gave me very specialized care and explanations of my diagnosis. He took and unusual amount of intentional time with me making me feel cared for.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd1462139e0c6ea2f"}
{"user_id": "112842955888762589136", "name": "Cindy Austin", "time": 1487620685184, "rating": 5.0, "text": "I have had 5 sinus surgeries in total. I have had sinus infections constantly and my medical Dr was treating me with antibiotics and shots. He finally told me that I needed to find a specialist to go to. At first I chose another Dr who removed a fungus from my nose and I thought that would do the trick. I will not name this Dr, but he had a terrible bedside manner. He wouldn't take any time with me to discuss anything. So after two months after surgery I started having trouble again. I went to my computer and typed in, The Best ENT Doctors In Birmingham. Right away I found Dr. Sillers name and when I clicked on it, I knew that this Dr was for me. I made the appointment and he not only took a lot of time explaining what was wrong, but also had a screen that showed me the problem. Unfortunately I had to have surgery again, but it cleared up the problem. On my last visit which was a couple of times after surgery, I ask him when I should come back and he said, \"you will know when\". It has been almost a year and I have had no problems. Not one sinus infection!! I could not recommend this Dr enough. I have gone to going to the my local Dr who treated me every couple of months with a sinus infection to a Dr that took care of the problem and I haven't been back to a Dr with any issue with my sinuses since my surgery. So if you are fed up like I was, come to this Dr. and I think that you will leave satisfied like I did.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd1462139e0c6ea2f"}
{"user_id": "100589362934974323112", "name": "Kylie Seesholtz", "time": 1512652605883, "rating": 5.0, "text": "Had to get my tonsils out in my late 20s (not a fun experience) Dr was more than helpful. Took time to talk to me and answer any questions I had. Highly recommend", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd1462139e0c6ea2f"}
{"user_id": "110440783733925015347", "name": "M Gravlee", "time": 1528377501845, "rating": 5.0, "text": "Dr Sillers was highly recommended by a close friend.  Very short wait in the waiting room and the Dr showed up immediately in the exam room.  He examined my ears and correctly diagnosed my problem.  His assistant gave me a hearing test and fitted me with hearing aids.  Problem solved!  I can hear again.  Highly recommend Dr Sillers and his friendly staff.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd1462139e0c6ea2f"}
{"user_id": "103783815789405637868", "name": "Tom Vaughan", "time": 1573580179582, "rating": 5.0, "text": "Excellent doctor; wonderful human being", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd1462139e0c6ea2f"}
{"user_id": "103037087785049513580", "name": "edward potter", "time": 1627343424967, "rating": 5.0, "text": "Excellent I arrived a few minutes before my appointment! I was taken in to the examination room and Dr. Morgan arrived shortly after to take care of the issues I was having! I have always been very satisfied with the service and promptness of the staff and Dr. Morgan.\n\nDr. Edward Potter PhD", "pics": null, "resp": {"time": 1628182475853, "text": "We appreciate you taking the time to send in a review for Dr. Bruce Morgan."}, "gmap_id": "0x8889c9356304bcb5:0x5c5a609f83dfbb2d"}
{"user_id": "116210742765608186011", "name": "Randy Makemson", "time": 1628858558790, "rating": 5.0, "text": "Very professional! Always takes time to answer questions.  Great office personnel.", "pics": null, "resp": {"time": 1629230771138, "text": "Thank you so much for taking the time to send in a review for Dr. Bruce Morgan and the staff here at ENT Associates of Alabama, P.C."}, "gmap_id": "0x8889c9356304bcb5:0x5c5a609f83dfbb2d"}
{"user_id": "100911949618859804446", "name": "julia sifuentes", "time": 1625988569077, "rating": 4.0, "text": "The office staff was very friendly. The Dr. was great.  I was very concerned about the crowded waiting room. Too many people!!", "pics": null, "resp": {"time": 1626373815939, "text": "We appreciate you taking the time to send in a review for Dr. Bruce Morgan and the staff here at ENT Associates of Alabama, P.C."}, "gmap_id": "0x8889c9356304bcb5:0x5c5a609f83dfbb2d"}
{"user_id": "103918117518905823035", "name": "Angie Harris", "time": 1627341605454, "rating": 4.0, "text": "Good Dr. I do think he talks a little to fast. Luckily he did write down what I needed to do.", "pics": null, "resp": {"time": 1628182505261, "text": "Thank you for taking the time to send in a review for Dr. Bruce Morgan."}, "gmap_id": "0x8889c9356304bcb5:0x5c5a609f83dfbb2d"}
{"user_id": "114611942193231993591", "name": "Clyde Holloway", "time": 1626387442632, "rating": 5.0, "text": "Dr, Bruce Morgan is pleasant and professional.  The staff is very nice.", "pics": null, "resp": {"time": 1626791670107, "text": "Thank you so much for taking the time to send in a review for Dr. Bruce Morgan and the staff at ENT Associates of Alabama, P.C."}, "gmap_id": "0x8889c9356304bcb5:0x5c5a609f83dfbb2d"}
{"user_id": "104744599590384310253", "name": "Tabby Reece", "time": 1625879748902, "rating": 3.0, "text": "The nurses are awesome!", "pics": null, "resp": {"time": 1626373864363, "text": "Thank you for sending in a review for the staff here at ENT Associates of Alabama, P.C."}, "gmap_id": "0x8889c9356304bcb5:0x5c5a609f83dfbb2d"}
{"user_id": "117362062908809453980", "name": "Clay parker", "time": 1573064149579, "rating": 5.0, "text": "I have always had a great experience at this office.  My child has had recurrent strep and was referred by our primary care Dr. Dr Bruce Morgan and his nurse took a lot of time explaining to my wife and myself and ultimately remover her tonsils. No problems after surgery and I would highly recommend this office to anyone.", "pics": null, "resp": null, "gmap_id": "0x8889c9356304bcb5:0x5c5a609f83dfbb2d"}
{"user_id": "104006196690669966234", "name": "Jason Farley", "time": 1569330887773, "rating": 5.0, "text": "Dr. Morgan and his staff are incredible. They have taken great care of our daughter and are always kind and easy to talk with. Dr. Morgan has always been straight forward and willing to help us every time we call or come by.", "pics": null, "resp": null, "gmap_id": "0x8889c9356304bcb5:0x5c5a609f83dfbb2d"}
{"user_id": "107588460625334346119", "name": "Baby Yoda", "time": 1579025390672, "rating": 1.0, "text": "My mother had her nose cauterized and was sent home. She followed all the guidelines and she still having trouble. I do not recommend Cullman ENT to no one.", "pics": null, "resp": null, "gmap_id": "0x8889c9356304bcb5:0x5c5a609f83dfbb2d"}
{"user_id": "101496789414728310303", "name": "Sherry England", "time": 1573511738601, "rating": 5.0, "text": "The staff was very helpful and friendly.  Mckinze Gunter helped me so much with the Kiosk.", "pics": null, "resp": null, "gmap_id": "0x8889c9356304bcb5:0x5c5a609f83dfbb2d"}
{"user_id": "107696002103436566529", "name": "Charlotte Parkinson", "time": 1560696228287, "rating": 1.0, "text": "I went in for emergency surgery because of a hole in my esophagus due to a plate being removed by Dr. Samuel Bowen. Dr. Morgan operated on me and closed me up. I continued to get worse. An associate of Dr Morgan, Dr. Black, came in and said Dr. Morgan didn't know what he was doing so they needed to operate on me again. I said no thank you and asked to be transferred to UAB. Beware of all of these doctors. This happened in 2009 and I am still suffering from what these doctors did to me.", "pics": null, "resp": null, "gmap_id": "0x8889c9356304bcb5:0x5c5a609f83dfbb2d"}
{"user_id": "106496962635528202011", "name": "Gina Johnson", "time": 1548368941356, "rating": 5.0, "text": "Professional physician and a wonderful surgeon!", "pics": null, "resp": null, "gmap_id": "0x8889c9356304bcb5:0x5c5a609f83dfbb2d"}
{"user_id": "107312068965923498398", "name": "Apollo Strong", "time": 1542329058865, "rating": 1.0, "text": "The worst doctor office I have ever dealt with. Incompetent staff. Avoid at all costs.", "pics": null, "resp": null, "gmap_id": "0x8889c9356304bcb5:0x5c5a609f83dfbb2d"}
{"user_id": "102518764305297174296", "name": "Terry Tingle", "time": 1627420184742, "rating": 5.0, "text": "Did not wait long to be seen. Dr. Asked asked appropriate questions. Did a quick exam, took out a tube that was bothering me. Gave me two shots and a prescription for my sinus infection. Already feel 100% better. Could not be more satisfied.", "pics": null, "resp": {"time": 1628179201827, "text": "We appreciate you taking the time to send in a review for Dr. Aland."}, "gmap_id": "0x88891bb624a9b221:0xaf11167154c9c5e3"}
{"user_id": "101502977276865121328", "name": "Carolyn Boykin", "time": 1625792034641, "rating": 5.0, "text": "I was seen in a timely manner, diagnose and prescribed medicine for my ailment. Dr. Aland was professional and created a pleasant atmosphere while asking questions.", "pics": null, "resp": {"time": 1626381600014, "text": "We appreciate you taking the time to send in a review for Dr. Aland."}, "gmap_id": "0x88891bb624a9b221:0xaf11167154c9c5e3"}
{"user_id": "105075881244884134925", "name": "Michael Priola", "time": 1628776836717, "rating": 5.0, "text": "Very pleasant and like clockwork.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xaf11167154c9c5e3"}
{"user_id": "100013819756154828686", "name": "Tracey Brown", "time": 1627569973843, "rating": 5.0, "text": "Awesome experience…..", "pics": null, "resp": {"time": 1628179138050, "text": "Thank you so much for taking the time to send in a review for Dr. Aland and the staff at ENT Associates of Alabama, P.C."}, "gmap_id": "0x88891bb624a9b221:0xaf11167154c9c5e3"}
{"user_id": "101840441780300465050", "name": "Violetsandferns", "time": 1497295272811, "rating": 5.0, "text": "I met with Dr Aland in office briefly for a small matter related to my hearing. I tend not to like doctors in general but I found him not very demeaning. He sat with me and discussed a question I had regarding an unrelated matter. I appreciated that he actually sat down to discuss it and genuinely seemed interested. I would see him again if I ever needed another ENT consult.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xaf11167154c9c5e3"}
{"user_id": "114053823379315167549", "name": "Kandra Wade", "time": 1524749011300, "rating": 5.0, "text": "Dr. Aland has been my ENT for about 5 years. He always listens to my concerns and assess every aspect before treating. He got down to the bottom of my sinus issues and didn’t have to do any unnecessary steps. He also was the one who removed my tonsils and I recovered well under his care.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xaf11167154c9c5e3"}
{"user_id": "103748808012651424356", "name": "Junk Mail", "time": 1536851168952, "rating": 5.0, "text": "Sleep Study suggested a CPAP.  I chose to let an ENT check me out.   Minor surgery and I don’t Snore anymore.  Get plenty of rest and feel more rested.   I probably get 2x the oxygen thru my nose now.    Suggest this route before you do CPAP. The Dr and his staff were great", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xaf11167154c9c5e3"}
{"user_id": "113066009962477187020", "name": "trish mc", "time": 1516290390317, "rating": 5.0, "text": "Great doctor  absolutely wonderful", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xaf11167154c9c5e3"}
{"user_id": "105875426575518306512", "name": "Danita Arceneaux", "time": 1627946616837, "rating": 5.0, "text": "The customer service provided by Dr. Swain and staff was excellent. I would recommend him to family and friends. I feel confident that my hearing needs were met.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "114902804832935273026", "name": "Katie Knapp", "time": 1622134557922, "rating": 5.0, "text": "Dr. Swain and his staff are incredible! My daughter has suffered from chronic ear infections since she was 6 months old (she is almost 4 now) so we have had frequent visits at both locations and the surgery center. I've never had a bad experience and always feel like we receive superior care and attention.  Even when my daughter is being difficult they are ALWAYS patient and understanding. I highly recommend Dr. Swain and his team!", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "115364276768501862517", "name": "Shantia Malone", "time": 1626817385699, "rating": 5.0, "text": "Dr. Swain is the absolute best! He has seen all 4 of my children. I'm his patient as well. We love him!", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "110826916630055756671", "name": "D. Little", "time": 1621530288681, "rating": 5.0, "text": "Dr. Swain, Jr. and his staff are very kind and friendly from the time you walk into the office until the time you leave. Dr. Swain takes his time to listen to the patient and acknowledges what has been said. Dr. Swain thoroughly examines the patient and then explains in layman's terms the diagnosis and his course of action. Not only does he make the patient feel relaxed, but his staff are a calming presence for the nervous patient. Hence, why my entire family are patients of Dr. Swain, Jr.!", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "104021331331108850171", "name": "Cowboy Kid Shane", "time": 1623374119317, "rating": 5.0, "text": "Dr. Swains office and staff were excellent as always. They’ve treated my son and his chronic ear infections for around 8 years now. I’d recommend this practice to anyone in need of ENT services.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "107101950319384025413", "name": "Laura Strachan", "time": 1612385503809, "rating": 5.0, "text": "Dr.  Swain is AMAZING!! Very knowledgeable and caring.  He actually listened to me and not just hear what I say and have an already formed opinion when I got there.  He didn't just want to throw medication at me and tell me to leave, he spent his time with me. One of the BEST doctors I've met.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "102532878466280271265", "name": "Cody Parker", "time": 1609303428350, "rating": 5.0, "text": "Dr. Swain and his staff were very quick and thorough for me and my son 11 months! We called at 9 am and both my son and I was scheduled for the same day back to back times. We were in and out in a little over an hour, which included very short lobby wait, X-ray, eat cleaning, cauterize both nostrils, and my sons hearing test. We never had to wait in the room for very long waiting on the next step like some offices. I would highly recommend him and his staff!", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "113102540310559719019", "name": "Candace's Journey", "time": 1617727943942, "rating": 5.0, "text": "Dr. Swain and his staff were very friendly and efficient!  I will definitely go back and will recommend him!", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "111122876510023646319", "name": "Omega Taylor", "time": 1618329538685, "rating": 5.0, "text": "Dr Swain Jr and his clinical staff have been there for me over 18 years. I love them and appreciate the care they have given me.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "105463314914374228784", "name": "Victoria Rowan", "time": 1614951319087, "rating": 5.0, "text": "We love Dr Swain! Both my children have needed tubes placed and he has always been so great with my kids!!", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "113486637663797180494", "name": "Morgan Newburn", "time": 1605107447433, "rating": 5.0, "text": "We have been using Dr. Swain since my almost 6 year old was 6 months old. He is compassionate and thorough. Not once have we ever felt rushed during a visit. His staff is also always so friendly. We recommend him to everyone we know.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "113149223109745663956", "name": "Deanna Mitchell", "time": 1602854275016, "rating": 5.0, "text": "I’ve been going to Dr Swain Jr for 3+ years, he has treated me and done surgical procedures on me multiple times. He’s an excellent doctor with good bedside manners and a huge factor for this positive review  he doesn’t rush out of the room. He takes his time and answers any and all questions or concerns you may have.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "113444357080425800036", "name": "Timothy Soileau", "time": 1605142239702, "rating": 5.0, "text": "The visit with Dr Swain was very efficient and professional. This was a follow up as he had preformed surgery on my sinuses several years ago and this was a follow up to make sure things were still on track. He was very engaging and easy to talk to.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "108755432147107308262", "name": "Eric Coleman", "time": 1614360775215, "rating": 5.0, "text": "The staff was great, Dr Swain was so professional and knowledgeable that I was completely at ease about the surgery. Couldn’t ask for better care.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "110323351219188508047", "name": "PHarper", "time": 1595600794078, "rating": 5.0, "text": "Best ENT doctor in Mobile, hands down!  Dr Swain works hard to get to the root of the problem and not just mask your symptoms with medication.  Dr Swain never rushed my visits and was always very patient and understanding.  The office is very respectful of your time with very little wait time for appointments.  His nurses are the best too.  I highly recommend Dr Swain Jr.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "102677416067490731056", "name": "Israel Crawford", "time": 1612675621091, "rating": 5.0, "text": "Amazing Doctor!!!! Got to the root of the problem and prescribed what was need to treat, only 4 day into the meds and noticed a significant change!!", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "105434258805580781623", "name": "Marvin Johnson", "time": 1608229283640, "rating": 5.0, "text": "Always professional and attentive to my wellness. Thank you for taking great care of my medical and auditory needs!", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "106894145359844865235", "name": "Andrea Miller", "time": 1611760021523, "rating": 5.0, "text": "We really like Dr. Swain. He is patient with my son and we really appreciate it!", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "102489901148543912669", "name": "Kristina Rayner", "time": 1603306907041, "rating": 5.0, "text": "Dr. Swain was personable, knowledgeable, and very thorough. I was terrified to have my throat scoped but he made me feel comfortable, and the experience was completely manageable and quick. He will be my ENT doctor should the need arise in the future.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "115837321749078147650", "name": "David Richardson", "time": 1609607075518, "rating": 5.0, "text": "Very good experience. Found my problem, corrected it. now I'm much better off than before.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "111571065751473588880", "name": "Katharine Wingard", "time": 1626916860768, "rating": 5.0, "text": "The best ENT in Mobile!", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "117529958344410844567", "name": "Stephanie Gordon", "time": 1601572855574, "rating": 5.0, "text": "Amazing doctor and bedside manner. Does not brush you off like some doctors do. Works with the patients other medical issues to coincide with ENT treatment! Highly recommend", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "104648917970463774140", "name": "Tamara Rubenstein", "time": 1598108450115, "rating": 5.0, "text": "Super great staff and one of the nicest doctors I've met in a long time. I immediately felt at ease with him and he answered all my questions without rushing through the appointment. If you're looking for a great ENT, this is your guy!", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "104754947780147136012", "name": "Fred Brackett", "time": 1610569196232, "rating": 5.0, "text": "The best ever doctor I’ve ever had to trust my care too !! I almost wish I needed more surgery!!  If u need a doctor that actually cares about u go see Dr Swain!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "107721509327798997794", "name": "Lisa Barnhill", "time": 1608217986597, "rating": 5.0, "text": "Dr. Swain, Jr., and his staff are wonderful! My son (now 6) has been a patient of his for years and absolutely loves him!!", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "117873438154551655325", "name": "Beau StricklaNd", "time": 1593629466684, "rating": 5.0, "text": "Excellent COVID-19 precautions. Staff was very professional and friendly. We made a plan to deal with the issues I have. The Doctor was prompt and yet I never felt rushed.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "109104843455846407855", "name": "Brady Churchwell", "time": 1599666753072, "rating": 5.0, "text": "We love Dr. Swain Jr! He has performed multiple procedures on multiple family members, and always had a wonderful experience.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "106481790256049531562", "name": "James jeter", "time": 1596047910783, "rating": 5.0, "text": "Dr. Swain was respectful and professional. He knew just what was going on with my  ears. I would recommend him for all your ENT stuff.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "108811262198783477602", "name": "Augustine Meaher", "time": 1620148712895, "rating": 5.0, "text": "Ronnie is the best ENT IMAGINABLE", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "112756680073298868193", "name": "Jessica Clontz", "time": 1598613056550, "rating": 5.0, "text": "Dr Swain Jr has been my ENT for several years now. He treats my whole family because I trust him. He is quick but thorough.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "116737935308483693460", "name": "Catherine Mosley", "time": 1593622998753, "rating": 5.0, "text": "We absolutely LOVE Dr. Swain and his staff! They are always attentive, helpful, and compassionate when it comes to my son! I highly recommend him for any of your ear, nose, or throat needs!!", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "114294815201439001131", "name": "Robbye Fisher", "time": 1600875912602, "rating": 5.0, "text": "Great service from Deanne and the Dr.\nThey worked me in  and I did not have to come back a second time.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "107585342860593891272", "name": "Eileen Wishon", "time": 1623490404805, "rating": 5.0, "text": "Dr. Swain is very caring, knowledgeable and thorough.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "101144818701192721547", "name": "Tony Hoffman", "time": 1616009760560, "rating": 5.0, "text": "By far the BEST ENT in Mobile.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "113987970967094240611", "name": "Jesi Barnhill", "time": 1567773118489, "rating": 5.0, "text": "Dr Swain is amazing! I can’t say enough great things about him. He’s extremely knowledgeable, kind, and skilled. My daughter and I have had issues with our sinuses. We recently stopped by his office to make an appointment since we were near his office, they worked us both in that day! Helpful, friendly office staff.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "116937099878600173633", "name": "Frank Barnett", "time": 1584142966534, "rating": 5.0, "text": "Three years ago when I finally got to Dr. Mark Brown's office, I had lost vision in my right eye and was losing color vision fast in the left eye. My thyroid had been killed and I was taking thyroid replacement medicine but my eyes continued to bug out. The pressure was causing headaches which I did not know I should mention. My endocrinologist did not know you could have Graves Disease without double vision (which I didn't get until later). He sent me somewhere for dry eye and that doctor hurried me to Dr. Brown. Brown called in Dr. Ron Swain Jr, who uses 3-D mapping to guide him as he opens a pathway for Dr. Brown's work. They did decompression surgery on both eyes; Brown recommended 12 weeks of I.V. steroids, a therapy that was showing promise at the Mayo Clinic. Three years and several surgeries and procedures later I am reading at 20/20 in both eyes and seeing in full color. So far, so good! Sherry Barnett", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "115556848077554734776", "name": "Michele Whittington", "time": 1561384843874, "rating": 5.0, "text": "Dr. Swain is the best doctor! He has taken care of my daughter since she was 4 years old. (She’s now 19). He is always caring. He always gives us the time we need and listens to our concerns. I HIGHLY recommend Dr. Swain!!!", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "110720993304722945249", "name": "Waterboy", "time": 1615222075505, "rating": 5.0, "text": "Thorough and listened to the patient.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "113909047396393662640", "name": "Connie Deas", "time": 1547673110708, "rating": 5.0, "text": "Dr. Ronnie Swain Jr. is an amazing wonderful doctor. He is very caring and kind. His office staff (clerks and nurses) are also wonderful. I go to the office at Providence.  Both of my granddaughters (age 6 & 10) had their tonsils and adenoids removed recently.  They never had any pain, swelling, fever or discomfort. I totally trust Dr. Ronnie Swain Jr.  If I should ever move away, I will travel however many miles I needed to travel to use Dr. Ronnie Swain Jr. DOCTOR RONNIE SWAIN JR IS SIMPLE THE BEST ENT DOCTOR IN ALL THE WORLD!!", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "107791136298993788994", "name": "Elaine Sanford", "time": 1547777129651, "rating": 5.0, "text": "Dr Swain performed Sinus surgery on me 15 years ago. Since then, he has monitored me very closely and kept me well. During the years he has at times gone an extra mile doing much paperwork to obtain\nInsurance coverage on needed medicine.\nHe is a highly qualified and efficient physician who shows concern for his patients.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "113484690119421683766", "name": "Janie Griffin", "time": 1553735585189, "rating": 5.0, "text": "All of the staff are wonderful.  Dr. Swain takes his time and is very informative.  I have surgery scheduled and feel very confident that it will go well.  I have young grandchildren and will recommend him if they need an ENT in the future.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "106386878551682160094", "name": "Jennifer Eiland", "time": 1578417385230, "rating": 5.0, "text": "We had a great experience. Dr. Swain and his staff are wonderful!", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "117760799679292077565", "name": "Chris Ott", "time": 1574089958437, "rating": 5.0, "text": "Dr. Swain was very professional and very personable as well. I highly recommend him for any ENT related needs.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "103931914347947922821", "name": "Elizabeth Sayler", "time": 1583544660860, "rating": 5.0, "text": "Thorough, conservative, nonsense doctor.  Sinus expert! I can breathe again.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "103605146364197846177", "name": "Ben & Emily Coate", "time": 1490534255748, "rating": 5.0, "text": "I have recommended Dr. Swain to several people.  He is an excellent doctor who seems to generally enjoy his job and care about his patients.  He has provided us with outstanding care.  We are so glad we found him!", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "112193160483160800623", "name": "Margaret Mowry", "time": 1557775422417, "rating": 5.0, "text": "Dr. Swain is an excellent ENT physician. He has taken care of everyone in my family. He is caring and dedicated to his patients. I would recommend him without reservation.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "107319304790554871457", "name": "Donna Moffett", "time": 1550777761236, "rating": 5.0, "text": "I am very pleased with care I received for an acute sinus problem.  Outpatient surgery was uneventful.  I had no pain postop.  Dr Swain and staff were very effective in my recovery from vertigo, as well as the audiology dept.  I would highly recommend Dr Swain/staff to anyone.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "110650866930438364188", "name": "Carolyn Kinney", "time": 1549950189856, "rating": 5.0, "text": "Dr. Swain’s staff is so kind and caring. He is fast, but efficient and very thorough. Thankful to have such a wonderful physician and skilled team in Mobile!", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "102267378373642516575", "name": "Harry Eckel", "time": 1569985179124, "rating": 5.0, "text": "Dr. Swain, his intake staff is efficient and smiling. I was taken on- time on the intake desk, and shortly directed to the exam room. Dr.Swain greeted me with an handshake and a smile. Having asked my health question, he examed me and assured that my problem looked normal and advised me to make an appointment to my GP for further treatment.\n\nMy reason for going into some details of my visit, is to let you khow as a patient of Dr. Swain and his staff you will be treated as you would expect from professional medical individuals.\n\nHarry Eckel", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "109370174095780138275", "name": "Donald Alexander", "time": 1601937653003, "rating": 5.0, "text": "Very friendly and courteous by the Dr. and his staff.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "108722942159368698104", "name": "Cyndi Anderson", "time": 1547606404034, "rating": 5.0, "text": "Dr.Swain is one of the best doctors I have ever had.  He is kind and listens to me.  He is thorough and cares.  I would highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "114560135000640258012", "name": "Ken Pruna", "time": 1620148848316, "rating": 5.0, "text": "One of the most knowledgeable and caring Doctors I have been lucky enough to be treated by.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "100208422950274129713", "name": "Max Shreddington", "time": 1548195142409, "rating": 1.0, "text": "Only people who have the patience of a Buddhist monk should schedule an appointment. If you enjoy spending hours of your life in a waiting room, then an appointment with Dr. Swain is for you.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "109863020221449821603", "name": "Linda Gwin", "time": 1547136168934, "rating": 5.0, "text": "Needed wax removed from my ears. Dr. Swain was very gentle and professional. I will continue to use him and highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "108969114719852311286", "name": "Darlene W", "time": 1601394946570, "rating": 5.0, "text": "One of the best doctors I have ever had the pleasure of dealing with.  He is never rushed, takes his time and has a staff that is second to none.  THANKS!", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "112288617269084053864", "name": "Regina Lancaster", "time": 1503587590711, "rating": 5.0, "text": "One of the best Dr's ever.... I've been dealing with my sinuses for over 12 years and now I'm getting the help I needed. I truly recommend Dr. Ron Swain. I have my life back.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "102871195332243996533", "name": "Judy Etheredge", "time": 1583273080473, "rating": 1.0, "text": "Doctor stayed with me a whole 4 minutes and apologized for me “waiting so long”. He looked in my ears then hurried to the next patient. Not impressed", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "101391733712630379331", "name": "Suzanne Miller", "time": 1603466404843, "rating": 5.0, "text": "Dr. Swain was very thorough and professional!", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "114942181681188488271", "name": "Cindy hicks", "time": 1510413200090, "rating": 5.0, "text": "Office employees are super nice!  Dr Swain is very caring and addresses all my questions and resolves all my issues.  Highly Recommended!!", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "102639834626751091463", "name": "robert hannahan", "time": 1507817268101, "rating": 5.0, "text": "Dr. Swain was on time and professional. Explained everything to myself and my spouse in layman terms.  He allowed us to view what he was doing with tv screen. I would have no reservation recommending him to my family or anyone else. His staff was helpful and professional.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "112394732441834121396", "name": "Jaclyn Blake", "time": 1546966521790, "rating": 1.0, "text": "overall pleased with experience with surgery and doctor. Very displeased with wait time for office visits.  We sat in the lobby for an hour and a half before each visit.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "105194221682473852576", "name": "Foley Medical Weight Loss", "time": 1521747700891, "rating": 2.0, "text": "I love Dr. Swain but his office staff that answer the phone are not very friendly. I called 2 times today trying to talk to someone about making my 8 month old an appointment and the lady acted like she didn't have time to talk to me and then hung up!! Really lady I have a sick child!!", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "118018663265674610404", "name": "Dianne Martin", "time": 1601649171090, "rating": 5.0, "text": "Dr. Swain was both professional and personable. He done an excellent job of my issue, the surgery and follow-up.  Yesterday was the shortest I have ever wait to see any doctor.  Excellent service.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "115826742831777164071", "name": "seretha bass", "time": 1516078967974, "rating": 5.0, "text": "Dr. Swain is a very good doctor. He is friendly and he cares for his patients. He is thorough and I appreciate him for loving what he does.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "109422153758651499317", "name": "SHEILA FERGUSON", "time": 1605311839614, "rating": 5.0, "text": "Dr Swain & the whole staff is wonderful.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "102603682600372383367", "name": "Tim Last", "time": 1605800346385, "rating": 5.0, "text": "Fast, efficient and effective!", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "111994589471046931412", "name": "Lisa H", "time": 1493577032416, "rating": 5.0, "text": "I am very pleased with Dr. Swain. He is a excellent doctor. I am pleased at how fast I was seen with no wait time. I definitely recommend Dr. Swain.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "111753557514050343812", "name": "Heather Grimes", "time": 1486057828417, "rating": 5.0, "text": "Dr.  Swain Jr with Premier Medical Group is great.  He takes his time and answers all questions you have.  My family sees Dr, Swain Jr and we highly recommend him to everyone.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "115426959507735916985", "name": "Frances Griffin", "time": 1516726029130, "rating": 1.0, "text": "I went to Dr. Swain because my other Doctor retired and I keep getting sinus infections. I had a severe sinus infection when I visited his office. It was confirmed by three other doctors. Dr. Swain said, I didn't have a sinus infection it was just allergies. He did a CT scan and said, I had a slight deviated sinus, but I was fine. That was 2017, it is now January 2018 and I still have a sinus infection, I'm still taking antibiotics. My lymphnodes are still swollen, I'm still hacking out dark yellow mucus with blood and my throat is still raw.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "114381004988298506127", "name": "Kiesha Cordier", "time": 1505674324163, "rating": 5.0, "text": "Dr. Swain Jr is very thorough and his nurses are very nice. I love that I can get next or same day appointments when needed.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "114635698262776831977", "name": "Reneta Powe", "time": 1526588397526, "rating": 5.0, "text": "Dr. Swain is great and so is his staff. They actually take the time to listen and try to understand your medical problems.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "106399400278634910368", "name": "Beverly Witherspoon", "time": 1547230313115, "rating": 1.0, "text": "Bad mannerisms  as a doctor,  first time  visit,  would  not  recommend  this  so call  doctor  to anyone  if you  value your  life!", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "115502712499637588571", "name": "Christine Portenga", "time": 1566249825901, "rating": 5.0, "text": "Caring and professional personnel.  Dr. Swain is kind and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "111672454043946552606", "name": "Michelli Scales Mobile", "time": 1532012750188, "rating": 5.0, "text": "Best EENT ever, always eager  to listen and take action to fix me.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "107392257281220349600", "name": "Alex Krempa", "time": 1471016693010, "rating": 5.0, "text": "Very effecient. Easy to understand. Great visit. Highly recommend", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "100464368683235239582", "name": "Meredith Ramer", "time": 1508424153005, "rating": 5.0, "text": "We've had a great experience with Dr. Swain and all of the staff! He's great with kids and the staff are all very sweet!", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "109828244738788567277", "name": "Mary Hammond", "time": 1520782090072, "rating": 5.0, "text": "Very patient and understanding. Related well to my problem. Very professional.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "110657765204201612851", "name": "Janet Silvernail", "time": 1549559854641, "rating": 5.0, "text": "Excellent patient experience at this office.  Dr. Swain is the best of the best, and his staff is extraordinary.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "114720064576506069800", "name": "Casey Welborn", "time": 1523589190186, "rating": 5.0, "text": "Took amazing care of my husband!!! Everyone was so kind and professional!!! Cannot reccomend enough!!!", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "107709156026681904869", "name": "Richard Geiger", "time": 1530451684707, "rating": 5.0, "text": "Excellent service, help and treatment of a serious sinus problem.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "111333280515341361867", "name": "Joe. Williams.", "time": 1594342258118, "rating": 5.0, "text": "Very good experience", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "103334650857984505595", "name": "T Gray", "time": 1523799284983, "rating": 5.0, "text": "Worked in on same day called and diagnosis and treatment effective", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "107284785779216091964", "name": "D Buoy", "time": 1576681289209, "rating": 5.0, "text": "No wait, professional treatment and caring manner.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "112816232795255375614", "name": "gary sullins", "time": 1561471655754, "rating": 5.0, "text": "Very professional and to the point.", "pics": null, "resp": null, "gmap_id": "0x889bb3fda3d7a249:0x18567ff6c637a735"}
{"user_id": "107300929016835343695", "name": "Angela Smith", "time": 1518815415594, "rating": 5.0, "text": "Wonderful Doctors! Everyone is so friendly, and they really do all they can for their patients. Absolutely my first pick!", "pics": null, "resp": null, "gmap_id": "0x888bb3bcfe8cc85d:0x32e6fa0ca090d27a"}
{"user_id": "106426617878352567132", "name": "Debbie Ball", "time": 1494610813572, "rating": 4.0, "text": "I have Not seen this doctor in long time ...but when I did they were always good to me All of them", "pics": null, "resp": null, "gmap_id": "0x888bb3bcfe8cc85d:0x32e6fa0ca090d27a"}
{"user_id": "111304030992766108060", "name": "Patrick Scott", "time": 1625064855630, "rating": 5.0, "text": "Dr. Joe Frank Smith is one of the best in the business as far as I am concerned. He performed my daughter's surgery on her adnoids and tubes and she had no complications and a speedy recovery. I have continued to recommend Dr. Smith to parents and others since and I have been to see him myself in the past.", "pics": null, "resp": null, "gmap_id": "0x88928d989c13f943:0xf89441c142afe08"}
{"user_id": "112462748239030073738", "name": "Glen Deaton", "time": 1612410026074, "rating": 2.0, "text": "I went to see Dr Joe early part of last year 3 third surgery the recent one as of June 2020.He knows Glens health and dignosis.Hes never made him wear a mask!! we went today Feb 3 2021, the receiptionaist ask where r your masks I explained that he has a letter from his psycharist and Dr Joe has never required him to wear one.She was loud ,rude had my autistic son upset .she only checked his temperature not mine we live in the same household I was going in the room with him last year they ask u all these ??? Nope not anymore they used to take parents temperature nope wow.so even though Glen hates changes and he loves Dr Joe and he trusts him because of the rudness from the receiptionaist and the nurse who btw had to tell me that Dr Joe operated on someone with Convo today.Does your mask and vaccines protect you ??btw he did his surgery at the Dothan surgical center and didn't even recommend a Convo test this was June 2020", "pics": null, "resp": null, "gmap_id": "0x88928d989c13f943:0xf89441c142afe08"}
{"user_id": "106276702774166680149", "name": "Abby McNeil", "time": 1514451770819, "rating": 5.0, "text": "Love dr joe frank ! Performed all my surgeries since I was a toddler", "pics": null, "resp": null, "gmap_id": "0x88928d989c13f943:0xf89441c142afe08"}
{"user_id": "111805635986799075063", "name": "Ashley Smith", "time": 1417635446932, "rating": 5.0, "text": "Dr Joe Frank Smith is a excellent doctor and his staff are also at both locations", "pics": null, "resp": null, "gmap_id": "0x88928d989c13f943:0xf89441c142afe08"}
{"user_id": "104375241608367043830", "name": "Emma Smith", "time": 1615707827408, "rating": 5.0, "text": "Great experience with Dr.Smith. I have fought strep throat 3-4 times a year for as long as I can remember. Last ent I saw said \"we'll just do an allergy test.\" $200 later and not even a step of progress. Smith didn't beat around the bush and asked me if I was comfortable having surgery. Now I'm recovering from a tonsillectomy and in absolute misery but know in the long run this is the best thing I could have done. Great staff, great doctor, great experience.", "pics": null, "resp": null, "gmap_id": "0x88929341848b9ae5:0x6c0d465a2bc184d2"}
{"user_id": "117708371635560072420", "name": "Brian Dothan", "time": 1600102037712, "rating": 5.0, "text": "What a relief! I finally found a doctor that cares. I highly recommend ENTCare and Dr. Chelsey Smith. I love the staff and how methodical Dr. Smith was during my visit. Surgery was a great success and I can now sleep and breath better. I recommend ENTCare over any other ENT office.", "pics": null, "resp": null, "gmap_id": "0x88929341848b9ae5:0x6c0d465a2bc184d2"}
{"user_id": "114955929479494952289", "name": "Carli Sontag", "time": 1600463941048, "rating": 5.0, "text": "I can not say enough good things about Dr. Chelsey Smith! The best patient care!", "pics": null, "resp": null, "gmap_id": "0x88929341848b9ae5:0x6c0d465a2bc184d2"}
{"user_id": "113881841310014443641", "name": "David White", "time": 1621274419639, "rating": 5.0, "text": "I am so glad that ENT science has improved so well over the years.  I'm 73 and always as long as I can remember, suffered from sinusitis.  I just endured it with over the counter stuff.  But getting the \"tubes\" in my ears has really, quickly relieved my condition a lot.  I really like the fully professional staff and the doctors.  For once I am really better.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "113619271270684809199", "name": "Greg Strickland", "time": 1626279895419, "rating": 5.0, "text": "Quick and professional, caring and knowledgeable staff who goes above and beyond to treat their patients. Some of the absolute best!!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "108511350413598810877", "name": "soapy jones", "time": 1625238515977, "rating": 5.0, "text": "A very professional office with kind, efficient crew and docs who explain things thoroughly, listen to questions and act with compassion. An amazing place.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "106039686264639515928", "name": "Brian Koerwitz", "time": 1620783069366, "rating": 5.0, "text": "Dr. Shields went above and beyond.  My son came down with a rare illness his freshman year at the University of Alabama and we were from out of state.  The office got him in fast and was super easy to work with.  My son then needed a couple different letters from Dr. Shields to explain the illness to his employer and Dr. Shields worked with us on those as well.  I highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "106736827327613698764", "name": "Ms. Bossy P", "time": 1620248251679, "rating": 5.0, "text": "Great experience. Dr Beniot was amazing with my special needs daughter. Would recommend", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "115991408992300342305", "name": "Loren Enslen", "time": 1615393542236, "rating": 5.0, "text": "The staff is professional and polite. Dr. Benoit was great with my 5 year old son and very thorough in making sure everything was ok. Definitely would recommend Alabama Ear, Nose, and Throat to everyone!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "114737419456065939731", "name": "Bob Corning", "time": 1614709944045, "rating": 1.0, "text": "Broken Nose.  No diagnosis or treatment provided. No attempt to explain to the patient on the condition or potential outcomes.  Completely ignored patient concerns for the 2 minutes the 'doctor' spent with the patient.\nHorrifying approach to a medical practice.  Seek treatment elsewhere.  Will be denying insurance payment.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "108388235995406349160", "name": "Porsche Vaughn", "time": 1615981047744, "rating": 5.0, "text": "Very nice and detailed about what services will take place and I got results same day!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "116959679379383426122", "name": "Mary Mitchell", "time": 1619040539283, "rating": 5.0, "text": "Best doctors, best CRNP EVER and the greatest staff around.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "101841470479283780590", "name": "Ashref Abdulla", "time": 1623877619819, "rating": 5.0, "text": "VERY professional I’m telling you guys right now I came all they way from Mississippi and they treated with nothing but respect and kindness", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "113965823263956662771", "name": "Civille Brown", "time": 1614786984841, "rating": 5.0, "text": "Excellent ENT physicians. I trust them.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "110251895664896590528", "name": "Amber Compton", "time": 1606833869641, "rating": 5.0, "text": "We were referred to Alabama ENT for a newborn hearing screen since my son didn’t pass his test in the hospital. The staff was friendly and wait time was short. The audiologist was very friendly and made the experience of the testing really smooth.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "114198870122793215958", "name": "Summer Birdsell", "time": 1602703447627, "rating": 5.0, "text": "Dr. Gordon Shields is the absolute best! Has awesome bedside manner/care and has taken care of my children with their ENT needs! Defiitely recommend this doctor and their office team!!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "107079152949044991078", "name": "Jo Ann Harrelson", "time": 1593173845345, "rating": 5.0, "text": "The staff is always kind and very sweet when we arrive! My son is now 3 years old and knows when we go into the office he will be greeted kindly and get to see many nice and kind faces as they check his ears and make sure he is doing great.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "102702185973661939229", "name": "Ms. Barbara", "time": 1557845616187, "rating": 5.0, "text": "Dr. Shields is wonderful. He's professional and friendly. He really listens to his patients and he explains things well. The office is in a good location with adequate parking. The waiting areas and exam room were clean and nicely decorated. The staff was professional. The wait time was reasonable for the number of patients in the queue. No complaints.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "116966833594077148861", "name": "Chana Taylor", "time": 1611207354616, "rating": 5.0, "text": "Dr. Benoit and staff were superb 🙌🏻", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "104264536209657572908", "name": "Bertha M. Hunter (Queen B)", "time": 1615808926672, "rating": 5.0, "text": "I was very satisfied with the service I received", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "115198616251159203336", "name": "Kimmy sofab", "time": 1593274118134, "rating": 5.0, "text": "Friendly staff who provided their services in a timely manner. My daughter is four and she was comfortable being there.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "116078242948888619038", "name": "Nancy Gvillo", "time": 1559316081042, "rating": 5.0, "text": "I was very pleased with my experience at Alabama Ear, Nose,  & Throat Specialists.  Candace Maynard treated us with professionalism and care.  Dr. Crady and Dr. Benoit made us feel at home and both were very thorough with my son's exam.  Dr. Benoit did an excellent job with my son's ear tubes and we are so thankful!  We appreciated their follow-up and willingness to answer questions also. A big thank you to all of them.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "111027484371582366609", "name": "Trisha Hubbard67", "time": 1557803950703, "rating": 5.0, "text": "I have been going to Dr. Benoit probably at least a dozen years.   Very nice doctor.  I feel confident with his diagnosis.   My daughter and family use him,  too.  I recommend him to family and friends.  Office staff are very nice.  Very clean and attractive office.  Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "104287827818013816231", "name": "Curzine Wallace", "time": 1574723355795, "rating": 5.0, "text": "I went to Dr. Shields because I was having trouble with vertigo.  I was recommend by a coworker.  Dr. Shields and his staff are very  professional and thorough.  He performed a series of tests to see what was causing the vertigo.  I just want to say that you will not be disappointed with this practice if you decide to go.  Thank you Dr. Shields.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "113306404739424630092", "name": "Lisa Phillips", "time": 1574997288529, "rating": 5.0, "text": "Dr. Benoit is a very good ENT Specialist. His concern and care about what I was dealing with made me feel so at ease under his care. He is very thorough with giving your diagnosis and prognosis. I was clear about everything that he was going to do for me before any procedure was done. The thing that really made my heart overjoyed was when he personally called to check up on me after my procedure. I've never ever had a doctor to take that kind of time out of their busy day to personally call me, and for me, that is what has left a lasting impression on me. I told my family and friends about that and they were amazed, so thank you Dr. Benoit and staff for taking excellent care of me. You will always be my ENT Specialist and who I will refer all my family and friends to. Thanks again!!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "113587790278628269445", "name": "CB Smith", "time": 1574283949252, "rating": 5.0, "text": "Dr. Gordon Shields is an excellent ENT. He demonstrated great rapport with me on my first visit so I knew he was going to be a good fit for me. During every visit, he walks in, immediately greets me, and shakes my hand. He addresses all my concerns.\n\nRecently, he performed minor surgery on me in his office and did an excellent job. Anesthesia was used and I had no pain or side effects. He is very competent and professional.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "110406999270827226784", "name": "Stephanie Hall", "time": 1600660359469, "rating": 5.0, "text": "Dr. Benoit is amazing! Staff is amazing as well! Thank y’all!!!!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "116411688938750328956", "name": "Carol Caffee", "time": 1597357731373, "rating": 5.0, "text": "Nice seemed knowledgeable, understood and was patient with my emotional baggage from childhood.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "117378502316229761923", "name": "rebecca house", "time": 1579365928462, "rating": 5.0, "text": "I see Dr. Benoit as well as NP Snider. They are both great and well knowledgeable. I feel like they really listen and form a treatment plan to quickly help the problem!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "113116154842476270865", "name": "Robin Kuykendall", "time": 1554915933723, "rating": 5.0, "text": "Dr Shields has the greatest bedside ethics and he’s also very knowledgeable.  I couldn’t ask for an easier experience relating to my inner ear disease.  Highly recommend Dr Shields and his staff are super friendly and very prompt and professional!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "117444479934895412576", "name": "Diane Walker", "time": 1571356365035, "rating": 5.0, "text": "Dr Benoit corrected a problem I had for years. I had a dry hacking embarrassing cough for many years and all of my testing were normal and no doctor could figure it out. As soon as I told him about my symptoms he gave me a diagnosis right away and prescribed a medication that worked. The first day without coughing brought me to tears because I FINALLY found a solution! . I will forever be grateful. Dr Benoit you are the BEST!!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "105215403665117044367", "name": "Terra Smith", "time": 1614966007916, "rating": 5.0, "text": "I would absolutely recommend Dr. Shields and his staff! Everyone was friendly and professional. I had the balloon procedure done in the office, and they talked me through the procedure before and during. Excellent job!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "109503534678122345679", "name": "Rose Boyd", "time": 1522704488918, "rating": 5.0, "text": "I called first thing in the morning and was able to get an appointment later on that morning. First time patient - you know what kind of paperwork you have to complete.  The young man on the other end recommended I go online to complete the patient forms, which was VERY convenient.  I was able to type in all the info, print out and sign.  I was in and out within an hour. The staff was phenomenal.  Very, very nice and professional.  Dr. Benoit was GREAT!  Very empathetic, kind and caring. I would highly recommend Dr. Benoit and his staff!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "115413020976574948841", "name": "Alicia Menard", "time": 1547740484877, "rating": 5.0, "text": "Very friendly staff, easy parking, and clean office; these guys are great! Dr. Benoit took his time to address my issues and he answered all my questions.  His nurse was fantastic, too.  I would highly recommend Dr. Benoit to anyone looking for an ENT.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "106116130577556907819", "name": "Lodkeshia Cheatem", "time": 1574958694702, "rating": 5.0, "text": "Dr. Benoit is the best. Great bedside manner. Very patient and thorough!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "114254464577441266767", "name": "JAMES GORMAN", "time": 1552079106013, "rating": 5.0, "text": "Very impressive got right to work, did what I went there for.   Staff is very well informed and they know their positions.  Was really impressed with everything.  I will be a patient as long as they will have me.    I will recommend  to my family and anyone that needs an ENT.       JG", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "104015572374637888836", "name": "April Stevens", "time": 1546530654074, "rating": 5.0, "text": "We love Dr. Shields and Audiologist Crady and everyone at this practice! Unfortunately my son has needed 3 sets of ear tubes because he just hasn't outgrown the condition, so we have visited this office A LOT and they are always kind, professional, and great with my son. They are very good with timing their appointments as well, we do not have long waits like you have at many doctors, which is really a blessing when you have small children waiting with you.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "100067090699476337812", "name": "Curtis Fleming", "time": 1527697176927, "rating": 5.0, "text": "These are Great folks to deal with and always do a good job with your medical and Hearing issues. I saw the audiologist  Molly and she checked my hearing and made some adjustments to my hearing aids and I can hear much better.  Thanks", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "107260230849865821536", "name": "Sarah Morrison Bell", "time": 1545345950245, "rating": 5.0, "text": "We love Dr Benoit! He is so patient and kind! You can tell he really cares! Great with small kids!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "100110603797624471531", "name": "Heather Miller", "time": 1548863448288, "rating": 5.0, "text": "Very professional, organized and knowledgeable staff. They got us in and out quickly but not without thoroughly explaining our toddlers condition or treatment options. I didn’t feel rushed and felt as if Dr. Shields genuinely cared for our son and his illness.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "110340905543661727024", "name": "Jessie Sealy", "time": 1579750370367, "rating": 5.0, "text": "I was very sick with a very bad cough sore throat and couldn't talk good. I called the office and they let me come that day and was treated for my illness. I thank all them for that. Keep up the good work. Thanks", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "103037181254945107522", "name": "Tom Ozment", "time": 1559310832911, "rating": 5.0, "text": "Dr. Shields and Dr Benoit have taken excellent care of me with a right ear issue. From hearing tests to treatments, everyone is top notch and on the ball.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "100487318486531705127", "name": "Dianne Knight", "time": 1513440670707, "rating": 5.0, "text": "My experience was very good. First of all I was able to do paperwork on computer and just take in at my appointment. More offices need to pick up on this because very good. Everyone that works there are friendly just as doctor.  Would recommend to anyone.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "109566918139777596553", "name": "Dee", "time": 1545459434459, "rating": 5.0, "text": "I had a major/minor accident. One doc tokd me my nose was broken, then Dr. Benoit told me it wasn't.  After a follow-up visit I am happy 2 report I am back to normal. Dr. Benoit was great and made me feel really confident in his diagnosis. Thanks Dr. B.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "114593770736435434144", "name": "Cherrelle Knight", "time": 1592712358431, "rating": 5.0, "text": "Love this office. Nice and professional.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "108114782287420774536", "name": "Poisondragonx", "time": 1550091628041, "rating": 5.0, "text": "These are the best docs I've just about ever dealt with...they get you in fast and get you out fast.  They did a wonderful job with my son on getting him over some chronic sinus problems and did great on his tonsilectomy...highly recommended", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "113491136206277514705", "name": "Robert Poe", "time": 1582754060721, "rating": 5.0, "text": "Dr pappas is a great friend to hard of hearing ppl", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "110231408030201526696", "name": "Charlie Odle", "time": 1615028167505, "rating": 5.0, "text": "5 star experience in all areas.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "110254784151641475683", "name": "Super Sunny", "time": 1583279942620, "rating": 5.0, "text": "Fixed my nose; can't really compare it to anyone else, as I've only had this done once.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "112839772463571974876", "name": "Lynne Foster", "time": 1532549721849, "rating": 5.0, "text": "Dr. Benoit is extremely professional.  He takes his time and thoroughly explains everything.  I would highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "109349656193810439298", "name": "Eric Lewis", "time": 1567006735363, "rating": 5.0, "text": "I been using them for years, easy to get into and always treated good.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "117433677490439410420", "name": "Tina s Mills", "time": 1562798980365, "rating": 5.0, "text": "I have been to 2 ENT doctors while I lived in Pensacola Florida.  I have been to a UAB ENT doctor since moving back to Tuscaloosa. No one has helped as much as doctor Benoit!!  Not only has he helped my vertigo, which I considered severe and disabling, he is so kind, he listens and treats you with respect.  He has tried something new for my vertigo and it is working!!  Hugs to Alabama Ear, Nose and Throat!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "105524413703349215141", "name": "Patrick Agee", "time": 1512316413329, "rating": 5.0, "text": "Alabama ENT was able to see me on short notice.  They were attentive to my needs and went above and beyond.  Great group to call my doctor(s).", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "106798340848954041248", "name": "Sandra Reed", "time": 1571677135217, "rating": 5.0, "text": "Professional; answered all my questions; highly recommend", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "108497264382148232129", "name": "Natasha Norwood", "time": 1557436351011, "rating": 5.0, "text": "Friendly staff & My first time goin to Dr. Craig M.Benoit,  MD  Office... Dr Benoit went right to my problem... Thank u so much for helping me...\nTMJ is soo painful & now Humana want pay for my Mouth Splint $1,000.....", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "104052784802159400819", "name": "BeardedWonder 85", "time": 1519695883296, "rating": 5.0, "text": "Dr. Shields and the staff at Alabama ENT were great. They all were polite, respectful, and to the point. I had surgery on my nose performed by Dr. Shields and couldn't be happier with the results.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "103807068427870060776", "name": "Eric Lewis", "time": 1533657941933, "rating": 5.0, "text": "I always get good service, and when I have an emergency they do their best to work me in as quick as they can.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "111257747565844584994", "name": "Nicole Perez", "time": 1567377004048, "rating": 5.0, "text": "Great, helpful staff. I also never had to wait long at all.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "107269995982324146813", "name": "Christopher Snider (craziedScot)", "time": 1511906711321, "rating": 1.0, "text": "I’m in disbelief that I have two insurance cards (both valid) a primary (Blue cross blue shield of Alabama) and secondary (Aetna) both covered at this place. I was told after waiting an hour that they (Alabama Ear, Nose and Throat) can’t see me until this is resolved. Not sure what needs to be resolve but I lost a days pay coming to see this doctor. I even said I would pay cash and was turned away. This is a crock of S**T and I am totally going to get my money, I lost for taking a day off work. Figured we get billed if we miss an appointment and only fair the doctor gets billed for my time. Totally disappointed by the professionalism of the front desk. It’s a shame I hear good things only to be proven wrong!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "109593565242482167199", "name": "Jeremy Middaugh", "time": 1525278818866, "rating": 5.0, "text": "Very professional and most caring about their patients. I would highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "113206068573400478637", "name": "Luke Smith", "time": 1546448380086, "rating": 5.0, "text": "Great people. Great visit. Highly recommend. Very professional and personable.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "118232824126738986087", "name": "Andrew A", "time": 1512746426996, "rating": 5.0, "text": "Very thorough. Nice and helpful. Did an awesome job on my surgery.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "107872501568885544341", "name": "zz tan", "time": 1574798534882, "rating": 4.0, "text": "doctor are good, but it's hard to get quick appointment", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "115150106140390877842", "name": "Tyra Hoggle", "time": 1550764167724, "rating": 5.0, "text": "Love Dr. Benoit and the ofc staff is nice and friendly.  I've never had a long wait time either.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "104266838227250659539", "name": "Abbey Jones", "time": 1537325171286, "rating": 5.0, "text": "I’ve been going here for the last couple of years, and have been completely satisfied. The wait is never long, the staff is courteous, the audiologists are nice and experienced, and Dr. Shields always listens to me and takes his time.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "115574639220688949790", "name": "Amanda Knight", "time": 1513698037452, "rating": 5.0, "text": "The staff were vary friendly and was great to my daughter they put her at ease.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "115868201907020800473", "name": "Shatara Hunter", "time": 1531327128789, "rating": 5.0, "text": "Dr. Benoit was very attentive and listened to my problems rather than telling me what he thought was wrong without me telling him anything. And I appreciate that.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "114411443899349950170", "name": "Melissa Holt", "time": 1512162433935, "rating": 5.0, "text": "The staff is very friendly and very efficient. No long waits.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "110602600753521769225", "name": "Greg Baxley", "time": 1565402285689, "rating": 5.0, "text": "Best ENT Dr. In town.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "111603126032384873173", "name": "Danielle Jeter", "time": 1550954934615, "rating": 5.0, "text": "Little wait time & caring Dr's.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "104200473257126159865", "name": "Riley Leslie", "time": 1522942772098, "rating": 5.0, "text": "I had a very good experience! Very friendly atmosphere!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "103183970892002056954", "name": "Sibyl Fondren", "time": 1483890126108, "rating": 5.0, "text": "I'd been plagued with monthly sinus infections with intense pressure and pain for over a year.  During that time I saw 3 different ENTs without any long term change.  I had tried the prescribed sinus irrigation, Flonase, countless rounds of antibiotics etc. to the point I was living on decongestants to get any relief.\nDr. Benoit was the first to suggest taking a CT scan. He listened to my history and seemed to genuinely want to help me find relief. He showed me the CT scan and explained how my deviated septum and enlarged turbinates were swelling and causing not only pain but blockage which wasn't allowing mucus out or helpful medications in! He suggested a septoplasty with turbinate reduction.\nMy surgery was November 16, 2016 and I have had continually improving symptoms.  I have yet to have a sinus infection, I can breathe freely through both nostrils (something I never realized I couldn't do!), clearing my sinuses is a breeze now and my Flonase can actually get where it needs to go!\n\nA huge thanks to Dr. Benoit and his friendly, efficient staff! I couldn't imagine an easier experience or a better outcome!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "113313419430993677469", "name": "Larry Roach", "time": 1573219930964, "rating": 5.0, "text": "Very caring, friendly, and professional service.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "112375069333297057840", "name": "Brenda Brasfield", "time": 1558582408752, "rating": 5.0, "text": "Did not have a long wait before being seen by dr, staff friendly,  courteous.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "104213062139648864414", "name": "Janece Chapman", "time": 1576168348892, "rating": 5.0, "text": "Dr. Benoit was great!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "112467123270199105417", "name": "James Barber", "time": 1547567590379, "rating": 5.0, "text": "Professional staff that is always pleasant and helpful!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "102106313279225573884", "name": "Garrett Mckone", "time": 1512748566112, "rating": 5.0, "text": "Glad we have these great doctors in Tuscaloosa.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "115587299688486114880", "name": "scotty probasco", "time": 1491408680851, "rating": 3.0, "text": "Charged for pre surgery screening and then refused surgery, all while being referred to a pulmonary doctor that was \"covered by insurance\" but it wasnt.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "115041041835384402708", "name": "Pam Nix", "time": 1553557208387, "rating": 5.0, "text": "Very happy with the personal and the doctor!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "106731982446235249239", "name": "Susie Culp", "time": 1566946830838, "rating": 5.0, "text": "did not have a long wait at all.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "116991023155130235307", "name": "Lanora Bayer", "time": 1525264891490, "rating": 5.0, "text": "Excellent customer service and care!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "116060001029842830857", "name": "Kristy H", "time": 1520454177262, "rating": 5.0, "text": "You couldn’t ask for a more understanding doctor and the nurses were very friendly as well.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "102992916564037910708", "name": "Glenn Munn", "time": 1566248281727, "rating": 4.0, "text": "Very professional and courteous", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "111995354223072391796", "name": "Grace Byrd", "time": 1532639340737, "rating": 5.0, "text": "Very professional and thorough.", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "111349679636473650547", "name": "Graylin Arnold", "time": 1552147735681, "rating": 5.0, "text": "Good overall experience", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "104517709334499223091", "name": "Philip Plotkin", "time": 1574174084790, "rating": 3.0, "text": "Meh", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "101856646060653355417", "name": "Linda Noland", "time": 1513700390311, "rating": 5.0, "text": "Very nice and helpful", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "113404023382610507391", "name": "Christinia Hinton", "time": 1537256048792, "rating": 5.0, "text": "Knowledgeable,  Friendly people", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "116568740081166769910", "name": "Quionnia Harkins", "time": 1546230451002, "rating": 4.0, "text": "Nice, friendly, and helpful!!", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "106243356330963316888", "name": "Valarie Deloach", "time": 1550493182784, "rating": 5.0, "text": "Excellent care", "pics": null, "resp": null, "gmap_id": "0x8888a7ffffdc10fd:0xe1e55dac4332a9db"}
{"user_id": "103684200412476034323", "name": "terry bassett", "time": 1623100293606, "rating": 5.0, "text": "Dr. Spires is both personable and professional.  He is very thorough in his examinations, and, I am very pleased with my direction in treatment.", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "108861683878295383907", "name": "Jacqueline Allen", "time": 1619021837980, "rating": 5.0, "text": "I loveeeeee Dr. Spires. He is always funny and right to the point. He took out my thyroid gland and about 10 nodules back in 2016. He is the best hands down💛", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "108461499449858004577", "name": "Jacqueline Smith", "time": 1616187259549, "rating": 5.0, "text": "Dr. Spires and his staff were very thorough and professional.  I highly recommend this team of healthcare workers.  The receptionist even scheduled my appointment the day ahead and notified me of the same.", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "112417648252781892086", "name": "Danielle Gentry", "time": 1620754995442, "rating": 5.0, "text": "Even though I wasn’t able to have surgery with Dr. Spires, he had went above and beyond to try to make it happen. I recommend him to anyone in Alabama who needs a great ENT to see him!", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "111396114001210563645", "name": "Ann Vinson", "time": 1615993155565, "rating": 5.0, "text": "I was pleased with Dr. Spires diagnosis.  He answered all my questions.  He was kind, knowledgeable and considerate.  I will certainly continue under his care.", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "111591299149116344483", "name": "Bob Hochstetter", "time": 1614712669373, "rating": 5.0, "text": "Almost no waiting. Very professional and efficient staff. Treatment went well. Would definitely recommend Dr. Spires and his staff.", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "103353444410110085930", "name": "Sherri Arledge", "time": 1611875522616, "rating": 5.0, "text": "Always so professional and never have to wait too long. Top notch, personalized care.", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "118437721880100457893", "name": "Mark Huff", "time": 1614093115432, "rating": 5.0, "text": "On time, very knowledgeable, highly recommend him for your ENT needs.", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "114293531846157303683", "name": "Dog House", "time": 1613307507542, "rating": 5.0, "text": "Awesome Dr and staff all get a 10", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "112605120350076560638", "name": "Bridgette", "time": 1594604125118, "rating": 5.0, "text": "Love this Doctor and the staff!  They all listen to your concerns and do everything they can to help you!  I would definitely recommend him!", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "111297390458268309921", "name": "Charlie Edwards", "time": 1596281068324, "rating": 5.0, "text": "It was a great office visit. I went there in much pain. After doctor Spires finished, I was in a lot better condition than when I went in with my pain. I am a 100% better today.", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "100610284920963217075", "name": "Terrie Lynn", "time": 1584553923455, "rating": 5.0, "text": "Very caring &I compassionate. I went to see him yesterday. Put a tube in my ear. Didn't take but a minute. And it didn't hurt. I can hear again. Highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "115221627782201387008", "name": "Gary BUCKHAULT", "time": 1584134107056, "rating": 5.0, "text": "Dr. Spires is an awesome doctor.  He’s one that takes time to listen to you he doesn’t rush in and out of the room. He actually sits and talks to you.  He has a heart for his patients.  He did my sinus surgery.  I would definitely recommend him.", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "106525550548377774831", "name": "Dana Chapman", "time": 1603277333534, "rating": 5.0, "text": "He listened and was very empathetic to my condition", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "114523442841354539790", "name": "Darlena Harness", "time": 1601605876474, "rating": 2.0, "text": "Dr Spires and his nurse don’t listen and mix up my concerns for my visit. He was in and out in under 5 mins. He never gave me a chance to tell him my issues. Very disappointed.", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "107830969492120039579", "name": "Theresa Pyle", "time": 1581530929532, "rating": 3.0, "text": "Office was run smoothly and efficiently.   Dr. Spires spent a total of two minutes with me and left the room after telling me if my sinuses were blocked it would be an easy fix.   I had other questions and told the girl that was taking me to the insurance and she shrugged her shoulders.  Nothing is an easy fix, I am putting off surgery for a partial bowel obstruction due to a very compromised immune system.   I scheduled my CT scan, but will request to see a different doctor in this office.  Seriously, my visit consisted of a maximum of 2-3 minutes and that is being very generous.  He looked in my nose, ears and mouth and said they would schedule an allergy test (which I also have been advised not to do at this time by my oncologist) and a CT and it would be an \"easy fix\".     He won't be fixing anything for me.", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "115105559395758110912", "name": "Heather Brunner", "time": 1573063357634, "rating": 5.0, "text": "Dr. Spires and his staff (and the entire staff) at Premier Medical Group are amazing. He is extremely kind, takes his time and ensures all of your questions are answered. I would highly recommend him to anyone in need of a skilled, honest, professional ENT.", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "118337993180407139381", "name": "Teresa Colvin", "time": 1584382373973, "rating": 5.0, "text": "Dr. Spires is awesome. We have been using him for about 33 yrs now. He has never steered us wrong. He is our Superman.", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "109821958178644497914", "name": "Kathy Skipper Buckhault", "time": 1571841390247, "rating": 5.0, "text": "Yesterday was my first visit to see Dr. Spires.   I can not express how impressed I was with him and his staff.  I would definitely RECOMMEND him to anyone needing an ENT Specialist.   He is very knowledgeable  and will test to get to the bottom of your problem.  Blessed to have been referred to him.", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "116177110222268323102", "name": "Kathy Curtis", "time": 1599081314184, "rating": 5.0, "text": "Very friendly and professional, I would recommend this practice.", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "101003333638566246702", "name": "Sk waite", "time": 1596219447604, "rating": 5.0, "text": "Dr. Spires is a great doctor, he is genuinely concerned, and definitely knows what what he is doing. I'm glad he is my doctor.", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "101479640878036794074", "name": "Tom Rhodes", "time": 1578951734602, "rating": 2.0, "text": "Very quick visit was not given time to explain my issue before Spires was out the door. Everyone else great experience, very professional nurses and front door check-in.", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "102276562544798566005", "name": "J.", "time": 1601303877978, "rating": 5.0, "text": "I can hear again!!\nExcellent staff and Doctor!", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "110826944562867768599", "name": "Melanie Moore", "time": 1576772790222, "rating": 5.0, "text": "Short wait which is always a positive. Dr. Spires immediately diagnosed my problem and prescribed treatment. Great experience all around", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "117341685575098333682", "name": "Laurence Lyons", "time": 1555423164991, "rating": 5.0, "text": "Dr. Spires always sees me promptly and, most directly, tells me his diagnosis and what the treatment will be, even if it's bad news. I very much appreciate his frank approach and the clarity of his explanations. His staff is excellent and was quick to provide much needed information when I had to cancel a cruise due to my illness.", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "114348702364322804301", "name": "C.D. Simpson", "time": 1536520298469, "rating": 5.0, "text": "This is best ENT I know of ever. He has the best staff. Never wait. Very thorough. He saved my husbands life. I thank God for him. He treats you like family. I can’t say enough.", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "116244844359937892103", "name": "Jim Dumas", "time": 1579193738301, "rating": 5.0, "text": "Thorough and gave detailed plan of action if resolution isn't better soon!", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "115001967744236843738", "name": "Sharon Gibson", "time": 1579866165670, "rating": 5.0, "text": "Very pleased. Problem treated. No problems at all.", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "112758312362492542714", "name": "Buster McMullan", "time": 1488599174340, "rating": 5.0, "text": "My visits are always excellent with Dr Spires. He is so knowledgeable and caring. When I see him, he makes me  feel like I am his only patient. He is very thorough, and describes the X-rays in detail. I am so glad to say Dr Spires is my doctor.", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "106147435203261422117", "name": "Janie Johnson", "time": 1559672040753, "rating": 5.0, "text": "Good experience.  Dr. Spires and his staff are always professional and polite. Jessica explained the procedures well as she performed them.  Very pleased.", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "101407556516675695123", "name": "Verona Gazzier", "time": 1547649892830, "rating": 5.0, "text": "I have used Dr Spires for 30 years more or less. I have never had a bad experience. The staff are angels, kind, caring and on time. Understanding emergencies do happen occasionally and he may get behind. Recomend Dr Spires highly.", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "109555917795861858441", "name": "Don Hunter", "time": 1546995497414, "rating": 5.0, "text": "He was on time. He is a good people person. He has tremendously helped my breathing after 40+ years and I now breathe better than I can remember.", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "112493813133164304390", "name": "Sonja Dowdle", "time": 1582586110889, "rating": 5.0, "text": "I was in and out in a very short time\nStaff very friendly so was the doctor!", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "105894164010955115787", "name": "Jettie Everette", "time": 1603892905823, "rating": 5.0, "text": "Gordon has to see Dr. Spires every four to five months to have his ear cleaned out. He had mastoid surgery over sixty years ago, and tissue plus wax builds up and he cannot remove it himself. Dr. Spires has been taking care of him for many years. We recommend him to anyone who needs his services.", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "105174825821699265079", "name": "V N", "time": 1496685781081, "rating": 5.0, "text": "Great doctor. He performed my son's tonsillectomy a few years ago. Good bedside manner, polite, very informative. He also performed a blood allergy test & I found out my son had serious allergies to many things! He's been on allergy shots ever since.", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "108547313511123453649", "name": "Donald Woods", "time": 1607533833884, "rating": 5.0, "text": "Very Nice, Was Direct in Information. Didn’t try and sell an uneccessary procedure. Will definitely recommend.", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "116786094053569758745", "name": "Susan Newell", "time": 1535143061077, "rating": 5.0, "text": "Love Dr. Spires. Been using him for a long time with myself and my kids and always very satisfied with all care received.", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "111966239534769160240", "name": "Qualandria McCoy", "time": 1579664961088, "rating": 1.0, "text": "Don’t feel like my needs were even heard. The visit felt rushed and about insurance. He was in and out 5 mins top", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "109092421170777491547", "name": "Patricia Edward", "time": 1553674075921, "rating": 5.0, "text": "He is awesome and an excellent physician, surgeon and person and also have an amazing staff.", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "107763342085190843696", "name": "MM 2021", "time": 1520989965625, "rating": 1.0, "text": "My 19 y/o daughter called me distraught after seeing Dr Spires for a pre-op for  a lymph node biopsy. She said he was not kind or friendly. He never introduced himself. She said he just walked and started examining her. His behavior was really off-putting after seeing Dr. Pitcock (in the same group), who was so professional and patient friendly.", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "116749297921538777098", "name": "Allisen Chains", "time": 1521209888631, "rating": 4.0, "text": "Dr Spires has done nasal surgery on me and put tube in both of my kids' ears.  He's very nice and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "103532373102850454798", "name": "Michelle Davis", "time": 1489931834266, "rating": 4.0, "text": "It was my first time visiting Premier Medical Group, Dr. Spires is very professional but quickly served me when he checked my ear.", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "100195795800874265931", "name": "taha alsaidi", "time": 1578443533965, "rating": 1.0, "text": "His very bad doctor he spent only one minute with me he prescribe wrong medicine for me", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "102766859680044622971", "name": "Lindsey Roberts", "time": 1493645431113, "rating": 5.0, "text": "Everyone at Premier Medical is wonderful. So thankful for such an incredible team!!", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "115266494239596195041", "name": "Ashley Vaughan", "time": 1488765152481, "rating": 5.0, "text": "Very organized office. Prompt treatment and great communication.", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "118227937451384361656", "name": "Larry Simpson", "time": 1549985824834, "rating": 5.0, "text": "He’s a great Dr", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "106508457134534095580", "name": "kiran bhatti", "time": 1489422020465, "rating": 5.0, "text": "Really good experience and nice staff. Thanks!!!", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "105087683108664124334", "name": "Martee Gibson", "time": 1524758163748, "rating": 5.0, "text": "felt like I was a person who was totally taken care of,the nurse and the doctor was prompt and address my problem very well. I was well please", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "114007525688005429987", "name": "Joe Wiseman", "time": 1495131798529, "rating": 5.0, "text": "Top Notch Doc!", "pics": null, "resp": null, "gmap_id": "0x889a4d778b60eac7:0x32836fc642618f5f"}
{"user_id": "111863291295846878362", "name": "Craig Nelson", "time": 1607405291289, "rating": 5.0, "text": "Dr. Handley is a great ENT Doctor. I have been his patient for over 25 years. In April 1995 Dr. Handley performed my successful sinus surgery which was a great relief and overall it significantly reduced the number, duration and severity of subsequent sinus problems such as infections. Cutting down on need for medication going forward. He also diagnosed and treated me for Meniere’a Disease.\nDr. Handley has always been available when I have needed his expertise. He is the consummate medical professional. My office visits with Dr. Handley have always been useful. Dr. Handley communicates well and listens very actively and doesn’t waste any time but at the same time he is always willing to explain issues thoroughly, concisely and in a way for patients to understand. I highly recommend Dr. Handley to anyone needing critical and/or chronic ear, nose (sinus) and throat problems. He explains all treatment options including the Pros and cons of each method of treatment. Due to Dr. Handley’s success I do not see him as routinely as I first did when my sinus issues were severe and recurring; however when I do go back he knows me and my medical history.", "pics": null, "resp": null, "gmap_id": "0x8888dddb3b43a909:0x507b74d8325c5626"}
{"user_id": "112836866902506426804", "name": "Jordan", "time": 1562168827095, "rating": 5.0, "text": "Great doctor. Knows his stuff and takes care of you. Very good at answering questions", "pics": null, "resp": null, "gmap_id": "0x8888dddb3b43a909:0x507b74d8325c5626"}
{"user_id": "115899874524802918830", "name": "Laura Sizemore", "time": 1479240938905, "rating": 5.0, "text": "He's a fantastic doctor! Takes amazing care of my 2 year old!", "pics": null, "resp": null, "gmap_id": "0x8889226be945aa97:0x515bb4d38d415198"}
{"user_id": "113946942109079573624", "name": "Leonard Austin", "time": 1621368402679, "rating": 5.0, "text": "My wife's friend at work recommended Dr. Bhuta and her husband, Dr. McCool.\n\nI called yesterday morning, and they were able to work me in at 12:45.\n\nI am really funny about things being poked down in my ears, I would rather go to a Dentist than an ENT doctor, but Dr. Bhuta understood and was patient and gentle.\n\nAlthough I am not looking forward to my next visit and hopefully, the over-the-counter drops she recommended will keep me hearing. Dr. Bhuta will be my ENT doctor, and I highly recommend her and her practice.", "pics": null, "resp": null, "gmap_id": "0x8889197a025ab27b:0xb233d960f87cb84c"}
{"user_id": "104681234738951070867", "name": "Susan Johnson", "time": 1610592768132, "rating": 5.0, "text": "My first time to see this doctor; I had no idea I had an excellent ENT within walking distance of my house. My ENT retired so I needed to find a new one. I called yesterday and was seen by Dr. Bhuta at 10:00 this morning! She is very professional and knowledgeable; and she answered all of my questions! I will definitely be back!!", "pics": null, "resp": null, "gmap_id": "0x8889197a025ab27b:0xb233d960f87cb84c"}
{"user_id": "110990500115775323965", "name": "Hayley Scheer", "time": 1608063201933, "rating": 1.0, "text": "Beware: Very unfriendly and unhelpful staff, and seriously questionable billing policies (billed an incorrect code for an office visit to get more money from insurance, and more importantly, the patient). I would give this place 0 stars if I could.", "pics": null, "resp": null, "gmap_id": "0x8889197a025ab27b:0xb233d960f87cb84c"}
{"user_id": "111546138280294718011", "name": "Katherine Uncapher", "time": 1602169551843, "rating": 5.0, "text": "Amazing office. Very friendly from beginning to end. Dr. Bhuta was professional and kind. She handled my problem efficiently and with expertise. Front office staff was wonderfully kind and helpful. Great experience all around!", "pics": null, "resp": null, "gmap_id": "0x8889197a025ab27b:0xb233d960f87cb84c"}
{"user_id": "108056221285489919895", "name": "Matthew Vines", "time": 1623085507966, "rating": 1.0, "text": "Waited over an hour in the waiting room", "pics": null, "resp": null, "gmap_id": "0x8889197a025ab27b:0xb233d960f87cb84c"}
{"user_id": "107036363532652704604", "name": "Tom Atkins", "time": 1578795808502, "rating": 5.0, "text": "A few people told me to go to Costco for your hearing aids...so I did.  The technician seemed to do a thorough audio test, had a nice sound proof booth that was her office actually.  Told me of a couple of units that would work for me so I tried the cheapest one thinking they are all the same basically sound amplifiers with the ability to amplify the frequencies you have trouble hearing in. Anyway took those home wore them daily but it was not pleasant to wear. I called it an edgy sound that was not natural to me. So I went back trying to tweak them to make them more bearable. They kept falling out of my ears. Didn’t fit properly, and I still missed a lot of words. So I quit wearing them regularly. Finally went back to Costco and asked my technician are these the right ones for me. Did I buy too cheap a pair?  Should I buy a more expensive ones, etc. never really got a clear answer. Always seemed to be these are typical and should help me.\n\nSo after a couple of years suffering with the hearing aids from Costco, I finally went to McCool & Bhuta and met Rachel Lynch. Rachel is a very well trained audiologists. Right away I could tell I had found a true professional that was very knowledgeable concerning hear aids and audio testing. Rachel fit me properly the first time with the right length of in ear speakers that no longer fell out of my ears.  When I first put them on they were not edgy and the sound was very natural. I almost didn’t think they were turned on until she demonstrated how much better I could hear by walking out of site down the hall outside her office.\n\nNow these were more expensive than the Costco but why I ever considered cost to be such an important factor for something that was so critically important, I feel foolish about that.   The ones I have now are rechargeable, can connect to my phone through a Bluetooth connection, and have a nice phone app to change a lot of the setting myself. Thanks Rachel!", "pics": null, "resp": null, "gmap_id": "0x8889197a025ab27b:0xb233d960f87cb84c"}
{"user_id": "115041466072258160674", "name": "Emily Gilmore", "time": 1550770398509, "rating": 5.0, "text": "This practice takes care of our whole family. The wait is never long and they tend to remain on time with appointments. The nurses do a good job of promptly returning phone calls. They easily accomodate appointment times in a reasonable time frame. Dr Bhuta has taken care of our daughter and we have been very happy please with tubes and adenoid removal. Dr.  McCool was able to take blood from our baby with hardly a fuss (those veins are so tiny and he nailed it, first try, quick and relatively painless). This is a big feat considering he usually loses it with shots! Both doctors are caring, knowledgable and very good at what they do! I highly recommend this practice!", "pics": null, "resp": null, "gmap_id": "0x8889197a025ab27b:0xb233d960f87cb84c"}
{"user_id": "117058902261051866595", "name": "Willow Smith", "time": 1501645172706, "rating": 4.0, "text": "Our visit was efficient and informative. The prescriptions were. Or at the pharmacy until the next day but we eventually received them.", "pics": null, "resp": null, "gmap_id": "0x8889197a025ab27b:0xb233d960f87cb84c"}
{"user_id": "104408424798035797493", "name": "KEITH JEWELL Straight-Line PARKING LOT MAINTENANCE", "time": 1579624836499, "rating": 5.0, "text": "Great service Doctor is looking after my wife Tonyua.we are very satisfied", "pics": null, "resp": null, "gmap_id": "0x88928d989c16ad75:0xa9f22dec42ff4b35"}
{"user_id": "102155083273750998443", "name": "JoAnn Westover", "time": 1624644956701, "rating": 5.0, "text": "Great doctor. Always takes time to listen and explain things in a way you can understand. I would recommend him to anyone.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "101330430110607224950", "name": "Thomas Zace", "time": 1624585482087, "rating": 5.0, "text": "First visit with Dr Palesano and was very impressed.  I got in on time which is very important to me. I hate waiting passed my appointment time. He explained everything clearly to me. No complaints and would recommend.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "103626639141981454146", "name": "Judy Niemeyer", "time": 1624585578080, "rating": 5.0, "text": "Dr. Palesano is the best.  I highly recommend him.  He is so calming in his approach.  Thank you, Dr. Palesano.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "112213396190002791122", "name": "Sandra McCrory", "time": 1616171868938, "rating": 5.0, "text": "Dr. Palesano and his staff are amazing.  They make you feel comfortable and at ease during your appointment.  The nursing staff was amazing and the level of care they offered is above and beyond.  I would recommend this office.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "100639971538258881604", "name": "Jane Edwards", "time": 1620942376849, "rating": 5.0, "text": "I have been seeing Dr. Palesano for several years. He performed my sinus surgery and I had perfect results. He’s a fantastic ENT.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "111686896387661119740", "name": "Hope Tallman", "time": 1618431334174, "rating": 5.0, "text": "Prompt, attentive, listens to patient and very thorough.  Highly recommend Dr. Palesano.  His staff are also professional and attentive.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "112588590476952317574", "name": "Leigh Weber", "time": 1619023668013, "rating": 4.0, "text": "Great experience! he takes time to talk and discuss my issues with out rushing me and actually listened to me.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "110534656299947979902", "name": "Trey Wood", "time": 1622162121899, "rating": 5.0, "text": "I was very satisfied with my visit with Dr. Palesano.  He diagnosed my problem and said to come back if it becomes an issue for me.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "111986152467519148506", "name": "Patricia Havard", "time": 1611756709040, "rating": 5.0, "text": "Dr. Palesano conveys a pleasant, courteous, manner which puts the patient at ease.  I have seen him on two occasions and appreciated his manner of addressing my health problems.  My husband had sinus surgery performed by Dr. Palesano.  We were thankful for his knowledgeable, efficient manner, and appreciated the kindness of his staff.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "104696218506056884942", "name": "Foncie Bullard", "time": 1605296234571, "rating": 5.0, "text": "Wow. Such a pleasure to go to a new doctor and get right in. Dr. Palesano was professional and knowledgeable about my problem. I was in and out but never felt rushed or unimportant. It's obvious that he is passionate about what he does. I feel confident and comfortable with his diagnosis and treatment.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "114745803159458794455", "name": "Bama Farmboy", "time": 1608660594129, "rating": 5.0, "text": "Dr. Palesano and his nurses are the best. They are friendly and professional. I have been very pleased with the results of the treatment that I have received. Have recommended him to several people.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "116292337216186404762", "name": "Olivia Vacalis", "time": 1610040395644, "rating": 5.0, "text": "Dr. Palesano and his staff were awesome, decisive and kind. Best ENT and staff in the area. So glad my friend recommended him...", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "105828215504807443679", "name": "Lea Winfield", "time": 1603930702527, "rating": 5.0, "text": "Always such a pleasure, if you have to see a doctor Dr. Palesano is a great choice. My husband and I, plus most of our office have seen him for years. And his nurses are the best.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "108043374256048016077", "name": "Lindsey Lee", "time": 1620927110137, "rating": 5.0, "text": "Dr. Palesano was very personable and understanding!", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "107373828144078989236", "name": "Gerti Cook", "time": 1610304865304, "rating": 5.0, "text": "Dr  Palesano and his staff where awesome professional and kind!\nRecommended Dr Palesano to several people.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "107039351930553029507", "name": "Charybdis ¿?", "time": 1608125666248, "rating": 5.0, "text": "Dr palesano is absolutely the best! I've had to see him for a few things one being my tonsillectomy and let me tell you it was not as bad as I thought it would be. I was scared to death as an adult to have the surgery but if you are considering it please do yourself a favor and go see Dr. Palesano. Smooth recovery, minimal pain and he and his team are just good people. The nurses are very good at what they do and so kind. It's always a plesent time seeing him.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "101667435642293022448", "name": "Nancy Hill", "time": 1603462518657, "rating": 5.0, "text": "Excellent experience!   He was very thorough and compassionate and knowledgeable.  The entire staff was wonderful!", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "110980534139277495001", "name": "Jennifer Anderson", "time": 1601657516425, "rating": 5.0, "text": "Dr. Palesano has a wonderful disposition and his staff is always so nice and friendly. They are outstanding!", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "100693718782637252097", "name": "Larry McSween", "time": 1603896763439, "rating": 5.0, "text": "Dr. Palisano listened to my complaint and discussed his plan of action after doing an endoscope to check my vocal chords. Always professional and always friendly, I would highly recommend him for any eye, ear, nose or theoat concerns.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "103800547995127713098", "name": "Sandra Cunningham", "time": 1604602377897, "rating": 5.0, "text": "I didn't feel rushed. He listened to my concerns and was caring.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "111243822206948793741", "name": "Joyce Johnson", "time": 1584491969711, "rating": 5.0, "text": "First visit - very personable and tentative.   Made sure I understood the options and I did not feel rushed.   Rest of staff was polite and helpful as well.  Would recommend.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "100272575567858942429", "name": "schlickev", "time": 1611432396670, "rating": 5.0, "text": "Excellent service, timely and professionally accomplished", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "108670251352398067858", "name": "Amy Campbell", "time": 1580391830202, "rating": 5.0, "text": "Clean facilities, with efficient and courteous staff. Palesano himself is extremely friendly and actually listens to what you tell him. He is very knowledgeable and gets you in and out of your appointment in a timely fashion.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "114730490718556504699", "name": "Ann Corl", "time": 1594167809415, "rating": 5.0, "text": "First time seeing Dr. Palesano. Great experience. Very friendly and personable. He is my new ENT.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "103843832124825686666", "name": "Kerry McCullough", "time": 1583353141155, "rating": 5.0, "text": "Love Dr. Palesano. Trust him completely with all of our ENT needs.  Always a pleasant experience, very efficiently run office.  His nurses and assistants are always on top of their game and have never failed to help me anytime I’ve called.  Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "110076560453522144608", "name": "Pamela Dyar", "time": 1566959660845, "rating": 5.0, "text": "First, I was very grateful that I was able to get an appointment rather quickly, as I had been sick. The staff was great, especially Brooke! I would definitely recommend Dr. Palesano and staff. He took time to thoroughly go over test results and gave suggestions. Pleasant demeanor, also!!", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "107476925996887854948", "name": "Mallory Martin", "time": 1581115674383, "rating": 4.0, "text": "I generally always have a pleasant experience at Dr.Palesano's office. Check in is usually fairly quick and I am able to get in and seen fairly quickly as well. Dr. Palesano is incredibly nice and friendly, and I feel that he takes the time to really listen to my symptoms and concerns and come up with the best treatment plan that will work for me. His staff and nurses are always very friendly and nice as well.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "111076338320242258656", "name": "Judith Zeller", "time": 1564155762139, "rating": 5.0, "text": "I was really nervous going to see the doctor. As soon as he can in, he was awesome. The greatest bedside manner. The visit was quick and no questions unanswered when I left. Thank you so much. Judith Zeller", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "116906708146363448711", "name": "Sally Weeks", "time": 1567799614451, "rating": 5.0, "text": "I have been going to this office since it opened. These are the nicest staff. They are helpful and easy to talk to. You get a feel that they really care about your health. Dr. Palesano has done a great job in training and keeping a quality staff!", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "108768691684837403341", "name": "Paula Everett", "time": 1584033871258, "rating": 4.0, "text": "Dr. Palesano is a true professional. He listened to what I had to say and checked my ears to determine if there was a problem.  He even sent me to the audiologist to verify his prognosis.  Sadly, the audiologist doesn't listen as well as Dr. Palesano. When I told her that the ringing in my ears made it difficult to determine whether or not I was hearing the beeps, she told me just to say yes when I THOUGHT that I heard them. Well, with the ringing in my ears, it sounded like the beeps were nonstop. So, I just kept saying yes, even though hearing anything after the ringing started was extremely difficult.  And, according to her, I have excellent hearing.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "113992302801598097862", "name": "Tee Huff", "time": 1603211383309, "rating": 5.0, "text": "Everyone in the facility, whom I've come in contact with, have ALWAYS been very pleasant & helpful.  Dr. Palesano is an EXCELLENT E.N.T.  He is very thorough with every appointment. I would recommend this facility to anyone!", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "112343340877931536406", "name": "Randy Parkison", "time": 1613694192368, "rating": 5.0, "text": "Good experience.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "111988236623564578152", "name": "Diana Collins", "time": 1581825190072, "rating": 5.0, "text": "Dr. Palesano is the best ENT in Mobile. He is a very skilled doctor with a great bedside manner. I would highly recommend him!", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "102574109338137910306", "name": "Marie Springfield", "time": 1597074767427, "rating": 5.0, "text": "Dr. Palesano has helped me so much!! 5 Stars!!", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "100428006931040350781", "name": "Aimee Rose", "time": 1580226212639, "rating": 5.0, "text": "Dr. Palesano has been our family’s ENT for years. He is always professional and takes the time to make sure you understand what your diagnosis means. I highly recommend him for all ages!", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "105228597150938534271", "name": "Lindy Hawthorne", "time": 1622284893985, "rating": 5.0, "text": "Steadfast, professional, gentle, friendly, and there when you need him.  His nurse Tanya, fantastic.  🙏🏻❤️", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "117541611245796286647", "name": "doretha bradley", "time": 1605896213955, "rating": 1.0, "text": "i did not get to see him", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "117109676367179403298", "name": "jinger leverett", "time": 1560871670634, "rating": 5.0, "text": "Doc Palesano is the best at his craft in our fair city.  He has helped me every time I have seen him.  He operated and others would have let me be deaf.  He fashioned new tiny bones from plastic and 20 years later I can still hear!  I love him!  Besides the fact that he is extremely caring and not to mention a fine looking man!  Highly recommend him to anyone with ear troubles.\nHe is really the very best at what he does.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "102664867547170962071", "name": "Sarah Watson", "time": 1573093987244, "rating": 5.0, "text": "The staff was very helpful and knowledgeable. They were super friendly and efficient. Dr. Palesano was very nice and thorough.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "111052927263913174607", "name": "Ricky Hall", "time": 1621347423652, "rating": 5.0, "text": "Always kind , caring  and knowledgeable ..\nStaff is also pleasant and concerning...", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "107678402411179838338", "name": "Jeffrey Hall", "time": 1579795816897, "rating": 5.0, "text": "Dr. Palesano is Excellent in every area that I can think of.  I have been a patient for 20 plus years!", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "107523692935734495571", "name": "Herman Parks", "time": 1583298525932, "rating": 5.0, "text": "First choice of all.  Especially appreciated the wall monitor for viewing live procedure.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "109887911573291624406", "name": "Shannon Barnes", "time": 1564160234496, "rating": 5.0, "text": "I have been going to Dr. Palesano for years now. He is a great listener and takes time to explain things in a way that I understand. He’s great!", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "104289337438914412528", "name": "alan Horne", "time": 1577833972820, "rating": 5.0, "text": "Dr Palesano is a great Dr.\nHe listens to what you have to say and is straight forward.\nI would recommend Dr Palesano for your ENT Dr.\nEveryone was nice and considerate, nurses, and staff were all nice to deal with.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "108646101358880384937", "name": "cougar1forever", "time": 1576817205550, "rating": 5.0, "text": "Moved from Dallas Texas in July.  The PA in Texas said lets do a biopsy on that lump.  The doctor said no need to its nothing. Move to Alabama and problem with my hearing.  Went to Urgent Care and ear drops did nothing, finally saw Dr. Palesano and wow amazing had a biopsy came back negative but they found a tumor.  My advice is see Dr. Palesano for ear problems.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "103531630392923816646", "name": "Alana Maske", "time": 1551758872923, "rating": 5.0, "text": "Dr. Palesano was very nice, he took his time with me and made sure to answer all my questions. He was friendly and professional. His nurses were also very sweet! I definitely recommend him and Premier Family Medical.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "105793871286192046987", "name": "John Streufert", "time": 1583376580003, "rating": 5.0, "text": "The doctor and staff were very friendly and fast.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "103323889212653274150", "name": "number1tealady", "time": 1608683668788, "rating": 5.0, "text": "I've been going to Premier Medical since 1995. I started with Dr. Swain Sr. When he retired he referred me to Dr.  Palensano. And I am so glad he did! Dr. Palensano is a great listener and never rushes. And he explains everything to where I can understand. He greets me each and every time with a smile and a handshake. I think he truly cares about all his patients.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "106777421285938129737", "name": "Sherry Barlow", "time": 1569810112313, "rating": 5.0, "text": "Premier Medical is special, I feel like they're all friends there.  I'm an FOJ and I'm well taken care of at Dr. Palesano's office.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "101670216547415829771", "name": "Jack Roberts", "time": 1568133258079, "rating": 5.0, "text": "I was very impressed with Dr. Palesano. I thought he was very thorough and explained every procedure to me.I will be a permanent patient.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "110238404375351402750", "name": "Faron McKinley", "time": 1598208764844, "rating": 5.0, "text": "I like Dr. Palesano very much.  He is thorough, and to me, very competent.  A very good experience for me.  Thanks.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "103096352489705068221", "name": "John Ikner", "time": 1568649926240, "rating": 5.0, "text": "Had a great experience- knowledgeable and professional doctor & staff", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "100074459277016065632", "name": "Hilton Sessel", "time": 1510635261966, "rating": 5.0, "text": "This doctor impressed me tremendously.\nClinically excellent and patient friendly. All in offce testing was done efficiently and the various potential causes of my ailment explained to me in a simple manner that left me confident of a way forward.\nI would highly recommend this specialist and the practice/facility.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "116309627855615521432", "name": "Patricia Miller", "time": 1564522168696, "rating": 5.0, "text": "Great Doctor very  Pleasant has wonderful bedside manners", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "100740624860953104262", "name": "Whitney C", "time": 1463492062658, "rating": 5.0, "text": "Dr. Palesano is a fantastic doctor.  He spends a great deal of time with you and will make sure you are taken care of.  Very personable.  Entire staff is great too and are very helpful!!", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "117924577378589708536", "name": "Kaitlyn M", "time": 1444868835687, "rating": 5.0, "text": "Dr. Palesano  is a great doctor. He has performed surgery on all three of my children as well as myself. I highly recommend him to anyone looking for an ENT doctor. He is a kind and compassionate doctor, two of my children are autistic and generally are scared to see the doctor but they are always at ease when seeing Dr. Palesano. He also has three great nurses who are always willing to help when necessary whether it be for an appointment or answering a medical question.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "111415612966071748737", "name": "mrjdixie100", "time": 1552410157673, "rating": 5.0, "text": "Premier Medical has wonderful doctors and their staff is 5 star.  I have recommended Premier Merdical to many people.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "113327698434712209955", "name": "Hal Todd", "time": 1349906612288, "rating": 5.0, "text": "Dr. Palesano is excellent. It was really cool seeing him examine my ear on his big screen in his office in real time. He has some of the most modern equipment and friendly staff I have seen in a doctor's office. I am a man, so I HATE going to the doctor, but I can honestly say I don't mind going back.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "116427132643982523221", "name": "Kim Campbell", "time": 1508971149898, "rating": 5.0, "text": "Dr Palesano has operated on my son and taken care of my family and friends. His staff is excellent and we have always had a wonderful experience. I recommend him if you need an ear nose and throat doctor!", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "116044691662447241494", "name": "Nichole Dossett", "time": 1446690639055, "rating": 5.0, "text": "Dr. Palesano was able to get me into his office very quickly in order to help my sinus issue before leaving town on a huge trip that I'd planned with friends to New York City!  I appreciate his attentiveness to my issues and the care he provided in such a timely manner in order to get me off on a once in a lifetime trip feeling my best!", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "100528366388823856390", "name": "owo Five Nights at Freddy's owo", "time": 1572656127068, "rating": 5.0, "text": "Great doctor and wonderful staff!", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "103298410204080534167", "name": "Dewayne Ford", "time": 1448316389693, "rating": 5.0, "text": "Dr. Palesano and staff explained everything and I was never rushed.  His office was very responsive to my needs and exceeded every expectation.  The whole process from diagnosis to post care was handled perfectly.  I would highly recommend him to others.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "109876843676922504715", "name": "A O McGill", "time": 1547652750042, "rating": 5.0, "text": "Great service............. pleasant, helpful, friendly....... I drive for 2 hours to see Dr. Palesano.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "100442294930811834961", "name": "Georgia Prosser", "time": 1518288722590, "rating": 5.0, "text": "The staff was very helpful. I was attended to quickly, which is a plus in any medical office. I had some tests run @ the hospital and Premier contacted me with the results the next day. I would definitely refer people to Dr. Palesano for any ENT needs.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "117542981899968452725", "name": "Joyce Cody", "time": 1547924718225, "rating": 5.0, "text": "Very knowledgeable able illness. Very kind and professional.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "105182605894991188415", "name": "tony agostinelli", "time": 1488401733329, "rating": 5.0, "text": "Dr. Palesano was very thorough in his examination and took the time to explain all aspects of my son's condition and his recommendations.  He was patient with our questions and took the time to understand our concerns.\n\nWhen it was time for the procedure, he and his staff were excellent both pre and post-op.  A nice touch was private sitting area where the family could wait while the surgery was taking place.\n\nThe follow up visits were equally well handled.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "111125951332788268588", "name": "Drew Williams", "time": 1484878460561, "rating": 5.0, "text": "Dr. Palesano is the only doctor I trust to treat my son's sinus issues.  He takes time to listen to what my son has to say and then explains what is going on in a manner that my son and I can both understand.  A+++", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "103204588814056479728", "name": "Anna Sweet", "time": 1488353026990, "rating": 5.0, "text": "So caring! Incredibly kind and extremely skilled at what he does. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "105191824423315304572", "name": "Eric Tate", "time": 1485887975270, "rating": 5.0, "text": "Dr. Palesano, is a great doctor. He is always friendly and has a good sense of humor. Also, he is very thorough and doesnt mind taking time to explain things to his patients. I would recommend him to any of my friends or family.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "102310601437201668181", "name": "robin salata", "time": 1485098968623, "rating": 5.0, "text": "Dr. Palesano is awesome!! He has done tubes on both of my children and has treated me with all sinus related issues. He listens and never rushes you out.  He is the only doctor we will see for ENT. Highly recommend him to anyone looking. His staff is awesome too!", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "115578501168788807793", "name": "James Stevenson", "time": 1546960588261, "rating": 5.0, "text": "Palesano is a no non sense doctor, he is there to fix you and does it well, good communication, good staff, same day or next day service, very little wait time - but,,,,very expensive is the only down side", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "109120403509385285041", "name": "lisa mitchell", "time": 1484692878054, "rating": 5.0, "text": "On January 17 2017 I had a wonderful experience the ladies at the front office was great  his nurses are super Dr Palesano is a great doctor he listen to me and was concerned about my well being he made me feel better about my situation", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "104997632133708956511", "name": "Jessica Kelly", "time": 1496684950048, "rating": 5.0, "text": "I have used Dr. Palesano for all three of my children's ear problems.  Dr. Palesano goes above and beyond for excellent care/follow-up with his patients (my children).  I would definitely recommend him.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "100804331466459497102", "name": "David Marks", "time": 1603478503115, "rating": 5.0, "text": "Great doctors visit on short notice. Dr Palesano is simply \"THE BEST\" !!!!", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "114428975365261495303", "name": "Margie Stiely", "time": 1495138005699, "rating": 5.0, "text": ".I was impressed Dr. Palesano was thorough, tested me, and sent me on my way without insisting I come back for general checks when I didn't need anything.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "103465894724846794629", "name": "Sean Bryant", "time": 1484882893252, "rating": 5.0, "text": "If you're looking for a great ENT, I would highly recommend Dr. Palesano. He always goes above and beyond to make sure we receive the best care.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "108955093608624366206", "name": "Bruce Finley", "time": 1582311868119, "rating": 5.0, "text": "Caring. Provides clear explanations.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "106778204353920461726", "name": "Angela Boykins", "time": 1505832251849, "rating": 5.0, "text": "Dr. Palesano and staff are great! I recommend them to everyone with the needs of an ENT Doctor.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "114102660393037186711", "name": "Jennifer Carter", "time": 1469625368623, "rating": 5.0, "text": "When I went a few years ago he was really awesome, highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "113300859389306117923", "name": "Lisa Fallon", "time": 1535540132829, "rating": 5.0, "text": "Great staff.  Very friendly and professional.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "103373789884210572317", "name": "Malek Abuhmoud", "time": 1498919718446, "rating": 5.0, "text": "This is was the first time I've been to Dr. Palesano's office, the staff were very friendly. He was very patient and helpful with us, I asked alot of questions and not once did he cut me off or gave me a rushed answer. I really had a wonderful experience there and I definitely plan on going back there for future appointments. This is honestly the best ENT doctor I've been to in Mobile, and I would recommend him to anyone.\nThank you so much,\nMalek.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "101098351442180404272", "name": "John Mc", "time": 1484880561342, "rating": 5.0, "text": "Dr. Palesano talked to me with care and real concern. It's nice for a change to feel like a real person!", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "111293551392672054309", "name": "Yulette Carter", "time": 1566400289071, "rating": 5.0, "text": "Loved Dr.Palesano and staff, wonderful group of caring professionals", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "110186274434522054548", "name": "Jonny Smith", "time": 1546458466831, "rating": 5.0, "text": "Seem my husband in New Year’s Eve! Waiting on us to come from way out of town!!", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "117117969179466159616", "name": "Jim Graham", "time": 1612542717387, "rating": 5.0, "text": "Superb in every respect.", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "107546065415131534918", "name": "Cooper “CooperZMan” Tate", "time": 1398273632027, "rating": 5.0, "text": "THE BEST", "pics": null, "resp": null, "gmap_id": "0x889a4d8d1a0bea3b:0x4b1a0ca7c64c3dc3"}
{"user_id": "102912093054553972319", "name": "Candace Wason", "time": 1540934722071, "rating": 5.0, "text": "Dr. Simpson is a phenomenal ENT. He is extremely intelligent, attentive and kind. He has gone out of his way to help me find relief from an extremely painful middle ear condition. His office is well run, his staff members are helpful and courteous, and all phone calls are promptly returned. I would recommend him to anyone.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0x253c4c98d425c268"}
{"user_id": "103761230424070049596", "name": "n8", "time": 1542287468298, "rating": 5.0, "text": "Dr. Simpson has been my lifesaver.  He speaks to his patients as human beings first.  He explains his prognosis succinctly while he records his memos in front of you.  He sincerely listens intently to your concerns.  Instead of just diagnosing me with a disorder, he trusts in his experience and expertise to find the results which previous Dr's have overlooked.  He is the best.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0x253c4c98d425c268"}
{"user_id": "107539332624886447907", "name": "Tammy Hodum", "time": 1598856771398, "rating": 5.0, "text": "I love Dr Cho, he did 2 surgeries on me. Took plenty of time with me. Also put me back to sleep to take my stitches out. He was great ❤️ Would recommend him to anyone 🤗", "pics": null, "resp": null, "gmap_id": "0x88891b94acf03f51:0x50e4135c56f36079"}
{"user_id": "103721379576735421847", "name": "Chuck", "time": 1542057857889, "rating": 5.0, "text": "Dr.Cho is GREAT. I drove 4 hours 6 times to see him. He did my repair surgery from a doctor from Mobile. He is the BEST doctor I have ever seen. He has bed side manners and really cares about your health and recovery and the quality of your life.", "pics": null, "resp": null, "gmap_id": "0x88891b94acf03f51:0x50e4135c56f36079"}
{"user_id": "111338071736008751983", "name": "Jenice McMillan", "time": 1560204323685, "rating": 1.0, "text": "Was referred to see Dr. Cho for a chemical inhalation from work. He didn't look in my nose his nurse did.  He was with me approximately three minutes said nothing wrong yet I have nose bleeds and still do ,unable to blow my nose normally like I use to.  Rumor has workers comp patients don't get treated correctly. It's never the employees fault. And still today I'm having nose bleeds and unable to blow my nose normally. I cant blow out my right side , and the left side is always stopped up cant breathe in or out my left nostril.  No sign of compassion from this dr . Waste of time.", "pics": null, "resp": null, "gmap_id": "0x88891b94acf03f51:0x50e4135c56f36079"}
{"user_id": "110179095256819096033", "name": "Megan Sowada", "time": 1623865694788, "rating": 5.0, "text": "Wait time was very reasonable for a specialty Dr office. Dr Hobbs provided me with great information, I appreciate the wonderful experience at a routine Dr appointment!", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "102828677115685392118", "name": "Alura Garrison", "time": 1535681506141, "rating": 5.0, "text": "Been seeing Dr. McFadden here for three or four years now. He started me on allergy shots and makes sure I have the right meds (nasal sprays) to keep from getting sinus infections. He's great, his staff are great, and the allergy clinic is great.\n\nAlso, #rocketcityrocks 😁", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPasVLzB-tV_TcmG0A6TeOIg15Pj6s4JomCrlin=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "100265178809566164000", "name": "Cameron Blake", "time": 1604078976388, "rating": 1.0, "text": "I personally would not recommend going here, unless you were referred for a particular condition.\n\nI went in, without a referral, as I have been having really disorienting issues with higher pitched sounds. I was given a told I'd be getting an Ear Drum Pressure Test, as well as a test to check my hearing.\n\nI reluctantly agreed, believing that these tests were going to be beneficial to helping my problem. I agree that the pressure test was a good idea, but after taking the hearing test, I realize I was big scammed. I not once said I had any issues with low range noises, and this hearing test did not AT ALL consist of anything that might prove beneficial for my case. It was entirely low range based, nothing to do with why I went in. I never once said I had any issues hearing anything, beyond high frequencies causing my discomfort.\n\nAfter the tests, I went back to meet with the Dr. again just to be told \"Sorry, we do not have anything to test high frequencies.\"  Well, I would have appreciated knowing that before I agreed to these tests. The final ruling was that I may be experiencing age related hearing loss, but I am only 23 y/o.\n\nI received a bill for $55 for a hearing test which I did not need, which also provided zero benefit for me. At least the $23 ear pressure test made sense.\nOverall, $120 wasted for absolutely nothing.", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "100151093065267603229", "name": "Abby Burke", "time": 1604613223102, "rating": 1.0, "text": "Do not recommend. I was referred here by my general practitioner for dizziness, fluid in my ears, ear pain, ear pressure, itching, etc. I saw a nurse practitioner which was my choosing. The wait to see the actual doctor was a lot longer. It was like they were herding cattle in this place. Very busy with little to no niceties. The NP briefly asked my symptoms, did a check with some machine to see if I had fluid on my ears and that was it. She referred me out to their physical therapy office in Madison for EAR issues and dizziness. No thanks. Never looked at my sinuses or likewise. I still have the exact same symptoms that I've had for months and this office did nothing to help nor did they take the time to actually listen and evaluate me. I will find another ENT in this area.", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "110426720833224365624", "name": "J Chambers", "time": 1604509687323, "rating": 5.0, "text": "I really like Dr Alapati.  Some may think he seems a little aloof, but I think he is serious minded and thoughtful. He thinks about your issues. He is otherwise friendly and very knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "110797609412266788086", "name": "David Schleimer", "time": 1607203536452, "rating": 5.0, "text": "Dr. Alapati is a highly skilled and dedicated professional! I would recommend Dr. Alapati to anyone seeking care for head and neck malignancies or general ENT concerns.", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "102704817658999799961", "name": "Ashley Ward", "time": 1583808218005, "rating": 5.0, "text": "Dr.K is wonderful! Our 2 year old had to have surgery, and he took the time to fully explain everything going on. Very patient and kind. Appointments always ran on time.", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "113492551059219588844", "name": "Re Run", "time": 1594172553724, "rating": 1.0, "text": "Terrible experience. It was stressed before the appointment to arrive early to complete documentation for the visit. For my 9:40 appointment I arrived around 8:50 and completed all the paperwork in 10 to 15 minutes where I was told I would soon be called back. I'm guessing that meant at some point that day. I set for hour and a half waiting to be seen as people who arrived after me were called back, and were leaving as I still waited. After finally being called back, I recieved a dry greeting from the nurse who walked me back to the room where the remaining staff just glared, clearly looking but choosing not to greet. My nurse then walks me into the wrong exam room where another patient was already sitting. We will just call that a clerical error. I finally make it to the exam room where the doctor shortly follows and begins the examination where he begins to ask my symptoms. Not that he actually cared, seeing that he didnt let me finish a sentence. I never finished giving him the details before he told me that I had nothing to worry about and gave me the same recommendation I'd received previously with no examination. The two month wait for an appointment was summed up in a five minute appointment and a two hour wait. What was my first visit will certainly be my last. I'd rather make the drive to any other location than to ever receive service from here again.", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "106669976923028648325", "name": "Patrick Obarr", "time": 1561386496237, "rating": 2.0, "text": "I have mixed feelings on this place. I have been seeing my ENT doctor their for 17 years. Not releasing his name. But if you looking for a doctor and place for surgery this would probably be the place but if you looking for a regular ENT doc for recurring issues it’s not. Example I have frequent ear infections call to get an appointment. They say we can see you in 2 months that’s no help. Not to mention the hours waiting to be seen. I honestly think the doctors here are great just they have taken on waaay too many patients to be able to be efficient!!!!!", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "105225321870497649243", "name": "Seth Ferrara", "time": 1584378365245, "rating": 5.0, "text": "My experience with North Alabama ENT has been excellent, especially with Dr. Scott McCary.", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "110718414573292198249", "name": "Elizabeth Bowles", "time": 1562705319679, "rating": 1.0, "text": "These people clearly cant tell time. I sat in the waiting room for over 2 hours with my toddler because these people are not capable of doing their job in a timely manner. VERY dissatisfied.", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "105041593959022964419", "name": "carolyn banks", "time": 1550031854051, "rating": 5.0, "text": "Dr. Scott Mccary  has done two sinus surgeries  on me. He did one three years ago and one today.  He is a very caring doctor and he cares about you being in pain.  I would recommend  him to anyone that need a good ENT.", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "115738795228987188517", "name": "Jerry Smith", "time": 1505415995575, "rating": 3.0, "text": "The Dr. was very thorough and made me feel that I was in good care. However, I waited over an hour past my scheduled time. My second visit I was running a little late and called them twenty minutes before my scheduled appointment and was told that if I didn't make it within ten minutes after that I would have to reschedule. So instead of driving thirty minutes and chancing \"one minute late\" being too late I decided to reschedule. I was told it would be twenty five dollars for the late reschedule. So instead I just cancelled the appointment all together. I would rather go to a place that doesn't expect you to wait as long as they want you to without trying to work with you much at all. I'm sure the doctors are all great but I'll take my business elsewhere. The crew lost the company my money.", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "112058048072450709393", "name": "Melody Fergerson", "time": 1535659928835, "rating": 5.0, "text": "MORITA, Dr. McCary’s Assistant, is the absolute BEST! She went above and beyond her duties to ensure that my referral was complete (on more than one occasion). She is extremely polite, caring, and she LISTENS to my needs and expedites ways to meet them. I am grateful for her assistance and her friendly, helpful attitude.\nMelody Fergerson", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "115769081430893115685", "name": "M Thorne", "time": 1574866737820, "rating": 1.0, "text": "Very rude and impatient staff. I refuse to wait for an appointment here. I called in to schedule an appointment and the receptionist cut me off twice, exhaled impatiently into the phone, and told me that I would have to wait a few weeks before being seen. I don’t mind the wait but the attitude was too much. I’d wouldn’t pay anyone for that type of service", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "106348500946453618066", "name": "Jessica Keepler", "time": 1473342734325, "rating": 1.0, "text": "I wish there was another doctors office that specialized in ear nose and throat. I will definitely search for an alternative. After today I am almost willing to drive to Birmingham if need be. Waited over a month for an appointment only for it to be scheduled at the wrong office and even though we had more than enough time to make it to the Huntsville office, and were willing to drive, They still would not see my child who has moderately severe breathing issues or even give an excuse for work/school. i count this as bad customer service. Does anyone know of an alternative for this practice?", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "113023259880233980490", "name": "Patrick Smith", "time": 1536078663863, "rating": 5.0, "text": "Very impressed by the staff and doctors at North Alabama ENT; Despite their having possibly hundreds of patients each week, I made to feel that I was more than just another appointment.   Doctors Kostrzewa and Teachey were both accessible and took time to personalize my experience.  Scheduling was prompt and they kept me personally included in the process; More than once I received personal calls directly from the actual doctor with prompt updates.   I believe their thorough and logical approach very well may have saved my life.\n\nI would highly recommend their services. Whatever you do... never ignore a persistent lump on your neck!", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "117409555345972162696", "name": "Jacob Parker", "time": 1534866882064, "rating": 5.0, "text": "I have been visiting Dr. McFadden over the last several years. The staff has always been very helpful and kind. Dr. Mcfadden also performed my deviated septum surgery with no complications whatsoever. I can’t recommend this place enough.", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "103259463817261252145", "name": "Flora Adams", "time": 1555259484576, "rating": 5.0, "text": "Dr. Hobbs did my tonsillectomy and I can't recommend him and his staff highly enough. They were able to schedule me very quickly for the surgery (I had to get it done over spring break my final semester of college before getting married and moving out of the country... They scheduled me just 1.5 weeks out from the surgery due to the situation), were polite and friendly and prompt throughout the entire process, answered all my questions fully and respectfully, and gave me a clear and accurate understanding of what the recovery would be like as an adult getting a tonsillectomy. Dr. Hobb's nurse and the Surgery Center both called and checked up on me multiple times after the surgery, and the surgery itself went exactly as planned. I was able to see Dr. Hobbs in less than 24 hours when I called with concerns about healing on one side of my thoat 3 weeks after the surgery. Beyond this, I mentioned during the initial consultation that my fiancé was having surgery overseas, and Dr. Hobbs asked how the surgery went for him both at my surgery and at the check in 3 weeks after. His concern (and the fact that he remembered) was very encouraging.", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "100863278916077476592", "name": "Allison Cash", "time": 1487778680616, "rating": 5.0, "text": "I see Dr. Martin for thyroid issues and my son sees Dr. Kostrzewa for significant nasal/septum issues.  I have been pleased with the conservative treatment from both doctors, and I greatly appreciate that they explain everything thoroughly.  After being prescribed a nose spray that my insurance doesn't adequately cover, we came up with an alternative treatment that works just as well.   I also have been pleased with the office staff.  I was running late for an appointment because of being stuck at a light due to a traffic accident.  I called the office to let the know, and they were very understanding.  They are a very busy office, so I imagine they are fairly strict with their policies.  I haven't run into any problems though.  All in all, I would highly recommend this practice.", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "111515713004282244226", "name": "Katy Murphy", "time": 1490096147845, "rating": 5.0, "text": "My daughter and I both see Dr. Kostrzewa and we are very pleased! He put tubes in my daughter's ears when she was 10 months and the procedure went well - she's now 3 years old and we've had zero issues since then. Also, he did sinus surgery on me due to chronic sinus infections. He did a great job of explaining everything about the procedure and recovery - I felt very comfortable with him and everyone else involved doing the surgery. I hate that other people have had bad experiences, but I have nothing but good things to say about this place!", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "100515473854495234151", "name": "Mary Parker", "time": 1534866472112, "rating": 5.0, "text": "Incredible office staff, Dr. McFadden and his entire team are thorough, warm and knowledgeable! Highly recommend for children and adults.", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "113268624109784525530", "name": "B. R.", "time": 1522702220486, "rating": 4.0, "text": "I liked Dr. John Kostrzewa, he was pleasant and took the time to answer my questions. The office staff seemed unorganized, as I had to tediously fill out the same paperwork I filled out online. Expect to wait at LEAST an hour past your appointment time, but don't be late or they can charge you a rescheduling fee.", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "113576756091952257003", "name": "laura brinkley", "time": 1534866324670, "rating": 5.0, "text": "Performed T&A on my 4 year old daughter. Very pleased! Great doctor & staff!", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "112881097825029526225", "name": "Julia Law", "time": 1581516568430, "rating": 1.0, "text": "Had a doctor appointment @830 am today i called @8 i was on wait until 807 until i hung up i know they just opened, so answer the phone, when i called to make an appointment she gave a awful attitude", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "103904284925715112288", "name": "Mia Landingerghgfb.", "time": 1484976624614, "rating": 5.0, "text": "Dr. Castillo took great care of my daughter. She had to have her tonsils out due to sleep apnea. I'd recommend him to anyone.", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "102527050568233342184", "name": "Emma Minor", "time": 1466702292061, "rating": 1.0, "text": "Office staff non- caring...Office cold, drab, smells bad...Business ran..You're treated as if you are non- intelligent... Hidden costly and unnecessary procedures... Cannot get worked in for emergency.... SLOW....Always an excuse for being behind, yet they run you through like cattle... NP fee same as physician fee, yet neither do a decent job...I've had an ear infection for 3 weeks, severe pain,nausea, cannot be seen until July 13th....Left messages 3 times...No return call from NP...If I hadn't let them talk me into having a tube placed in my ear, I would go elsewhere... The tube was to fall out in a few months... Has been in for 5 + years... Nothing but problems.. They want to remove it and place a new one....If I EVER get to see the doctor, I will have it removed, get a patch placed for the hole, and not go back after follow up...Do not recommend , period....", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "105112966989900808283", "name": "Terri Coleman", "time": 1519932479325, "rating": 4.0, "text": "He is the best doctor i ever seen he got the respect for his patients he will listen to u and helps his people  lls i could not find another one like him his spirit in god shows a very great  doctor as the most high careing doctor in my life", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "102681279256900551913", "name": "Steven Gunn", "time": 1528915408715, "rating": 5.0, "text": "Been going here for years. Always have had a decent experience. Dr. Mcfeely has done two mastoidectomys for me. He is always willing to answer any questions and is very thorough when explaining all aspects of the care he provides. They are a large practice. I think most of the negative reviews are things that occur with large places. The er sounds similar to me. People. Your milage may very.", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "115456264577735975443", "name": "Cassidy", "time": 1413828235404, "rating": 1.0, "text": "Hate it. Dr. McCrary slips in costly procedures without disclosing that they are not part of a regular office visit. We complained about getting charged $200 unexpectedly. He was rude and talked down to us for not knowing what the procedure was and knowing that it wasn't routine (you know, because patients should apparently know all the things they pay doctors to know). Then he told us hatefully to find a new ENT. Even sent a certified letter to really seal in the fit he threw about it.\n\nDo not recommend. I have a feeling he's making extra $$$ off all the procedures he just announces he's going to do without asking for consent or disclosing cost.", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "117473750109105718406", "name": "Leivy", "time": 1515968602399, "rating": 1.0, "text": "Called to schedule an appointment at the Huntsville location a couple of days ago and the woman who answered the phone was absolutely rude! Lost a potential paying patient. Get someone with better customer service to answer the phone!!!", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "106573494482579209648", "name": "Streeter Michael", "time": 1477950783840, "rating": 1.0, "text": "Had an appointment for my son. Forgot appointment when my father had a stroke in SC and the passed away tthe I had to evacuate my mom from hurriane Mathew explained this to his staff they asked him and apparently he is all mighty and he said he would only drop it if we rescheduled and came in now why would I with a response like that this man his heartless. I will give him a dollar check every month for the next 25 months sorry that's all I can afford.\nThis is what wrong with the world when capitalism is more important then people just so he can drive a nice car.", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "113238706584085998203", "name": "Daphane Ignont", "time": 1524521526388, "rating": 1.0, "text": "Arrived for my appointment as instructed 15 minutes early only to be told the doctor I was scheduled to see was in Madison which no one told me. When I googled NA ENT a Madison location did not come up, you only see this if you scroll down or visit their website. The nurse/receptionist was nice enough to call Madison to see if they could still see but to no avail. I was rescheduled. Very unfortunate that I had to be penalized and inconvenienced for the mistake of an NA ENT employee.", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "111085713390831333155", "name": "Quincia “Quin” The Queen", "time": 1481923495921, "rating": 1.0, "text": "If I could give negative stars I would!  This is the most horrific ENT location EVER. How this place is still in practice is beyond the understanding of  God. I got a refferal for chronic hoarseness they never called me to confirmed my appointment. I recieved a bill for a no show appointment. I didn't even know they were my doctors. Frack, I didn't even know where this location was or  even stepped foot in there to sign paperwork. When I called to have it removed they refused saying this is just their  policy and I would only get a refund if the doctor said so. They confirmed an automated system called me but the call only lasted 2 SECONDS for \"whatever reason\". Did not a live person care to call?? Upon my question she said they don't place calls to patients for appointments. What in the world 🌍? Then they said they'll call me back.... guess what they didn't  call back, just like they didn't call me to inform me of a appointment. How surprising...😑\n\nIf you can drive even an hour to another doctor... DO IT!!!!!\n\nNotice the ONLY 5 star rating was from a review from YEARS AGO with no comment. Most likely is fake.", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "107686748220406480473", "name": "Pfak C", "time": 1494009566399, "rating": 5.0, "text": "Great Staff, called to check on me several times, I would continue to patronize with the physicians there.", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "111965857372478725787", "name": "Juanita Washington", "time": 1510241483493, "rating": 1.0, "text": "Wow I got and appointment a month out. I️ get to the office and  still had to wait and hour to get to the back . You know you are in the wrong because you can’t look in the eye of the patient. So the question is to the floor I️ really hope the floor answer her back.", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "103800116183887796948", "name": "Christi Dutton", "time": 1452136791252, "rating": 1.0, "text": "I went to see Dr. Brocato a year ago. I was having vertigo attacks, ringing in my right ear along with pressure, and I explained I was having problems listening to people on the phone with my right ear. I took a hearing test at their office before the doctor saw me. Dr. Brocato walked in sat down and told me there was nothing wrong with my hearing and it must be allergies. He prescribed me the most expensive nasal spray on the market and sent me on my way. I suffered for a while and just tried to take different allergy medicines. I then started having more frequent vertigo attacks. A year later I decided something must be going on and asked to be referred to a different ENT.\n\nI have now been diagnosed with Meniere's Disease. In the beginning of the disease there is a period of fluctuating hearing loss. If caught in time there is a chance to save the patients hearing. Thanks to Dr. Brocato overlooking my complaints and not scheduling a follow up visit for me, I now have permanent hearing loss in my right ear at the age of 29.\n\nIt was the worst medical experience I have ever had. He was very casual and treated me like a hypochondriac. We rely on doctors with \"specialties\" to be able to help us when things go wrong. Dr. Brocato completely overlooked my symptoms and brushed me off and now I am left dealing with the aftermath. It may not have been malpractice but it is bad practice.", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "112859911495303802778", "name": "Todd Jurhs", "time": 1483026623908, "rating": 5.0, "text": "hmm, i'm not sure why the other folks here have had such a bad time with AL ENT.  I've always had great service and care from Dr. K. and i've been going to him for more than two years", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "117821439778895286198", "name": "Joshua Schaffer", "time": 1475871813755, "rating": 1.0, "text": "worst place ever, worst doctor ever. This place is a joke. Dr. Kostrzewa is the worst professional experience of my life. DONT GO if you have other options.", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "118098334196698983338", "name": "Charles Hayes", "time": 1543942743420, "rating": 1.0, "text": "Waited 57 minutes past my wife's appointment time just to get called back to a room.  Completely unacceptable!", "pics": null, "resp": null, "gmap_id": "0x88621354deaf35f3:0x78ed15711377c210"}
{"user_id": "116238820200796561427", "name": "Life in Camo Media, LLC", "time": 1619720614851, "rating": 5.0, "text": "We have used Jackson Surgery Center three times in the last two years and every visit was a positive experience. The staff is friendly, the nurses are kind and knowledgeable about every procedure we were there for. The staff kept the family/driver informed the entire time the patient was there. The billing department was very easy to work with. I was able to get someone on the phone every time I called to get an insurance issue resolved. I would highly recommend Jackson Surgery Center to anyone that needs the type service they offer. I would give them 10 stars if it were possible.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPQmD3NONX5lxnTqqGpPpccmzty7UBXatECy-lz=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "114488075300264503910", "name": "Janice Howell", "time": 1623257740459, "rating": 4.0, "text": "I had a great experience with my kind and caring nurses at my pre-surgery and recovery room time. I'd like to thank Cherri, Philanda and Cheryl personally for their great work. They made sure I was comfortable. As for as the surgery, the anesthesiologist and surgeon made sure I was knocked out for the 7 stitches although I didn't choose to be. Doctor was very late so he didn't want to waste any time. Maybe it was for the best but it was definitely not my choice.", "pics": null, "resp": null, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "117375952924911138946", "name": "Russell Marks", "time": 1614872568983, "rating": 1.0, "text": "I was schedule for a colonoscopy on Mar 4th.  I was notified that I had to report to Surgery Center for Covid 19 test prior to having the procedure.  I called the doctor's office to see if I could have it done in Prattville area as I lived North of Prattville and was told to call Jackson Surgery Center, I did and they said that would be fine.  So I got the test and a letter saying  I had a negative result.  Then next day I get a call from JSC saying what I had was not good enough.  I was asked why I didn't get tested at JSC and explained that it was more convient to have it locally.  She stated that she lived south of Montgomery and came to work every day.  This really upset me!  Long story short I had already spent a whole afternoon getting tested and by the time she called had already begun the prep and had to cancel the procedure.  They need to get better people friendly personal    to contact patients and get there act together as far as what is acceptable covid testing.  I had this procedure at the JSC (prior to Covid) and it was a great experience just glad I didn't have contact with this person back then.", "pics": null, "resp": {"time": 1614949554575, "text": "Mr. Marks, thank you for bringing this issue to our attention. We apologize for any confusion.  We will address this issue with our staff, the response you received certainly isn't our expectation. For future reference we have Important Covid Information on our website. You can find it here to review our policies.\n\nhttps://www.jscal.com/blog/covid-19-information/\nIf you have further issues or questions please contact our director Missy Sallas 334-293-8484"}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "100150209495080402340", "name": "Lisa Hudspeth", "time": 1601996170033, "rating": 1.0, "text": "Better check to see what you owe or they will not do the operation.  They never told me the countless times I’ve spoken with them.  They were extremely hateful.  I asked what I needed and they said insurance card and license.  I drove 4.5 hours and they were going to cancel on me!", "pics": null, "resp": null, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "106860308004527833404", "name": "Vernon Hunter", "time": 1550070817024, "rating": 5.0, "text": "We had a wonderful experience here. Very welcoming and professional. The ladies at the front desk were very nice and helpful.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMEA6SuVnqtgNXXnNkzREdg32B0zgufuc5cv_E=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO4uB51fxyaeDpO2yDu2wNTSxPqh2O8yHqB2fs=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMKelv6hT0qb05rGgjtyF822D8UYa0I-uSI8Co=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMzww9DxQJkCwnUedUgw9PJeezxKmFfHtLDnDk=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipObPWGFUVK4hTVE8lS2E-RgkyerbdsOR4Hh2tw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNXQS8EPgYZFbDmxHO9f_bBDZmc1UFM-44zLdY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMJqrimS9z6XE50WzCh_gGS9Fn5EyK0YrWWMCI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNjU73BEntArb0ed9LGb1NqqNaIqXlaFJzlV5g=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNpw9Gg51OKBGQDnwp4D3vjqdxV92b8CKCXQvY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPZwGldC5pb6lfTxx5riGecXESwGA5LbK89DLY=w150-h150-k-no-p"]}], "resp": {"time": 1550078887420, "text": "Thank you so much for the positive feedback.  Our team will be really happy to hear you noticed.   Thank you!"}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "113385512553342126004", "name": "Rosilind Maxwell", "time": 1571770585377, "rating": 5.0, "text": "I just wanted to tell everyone how much I appreciated you all for being so gracious and concerned about the experience that I had with you all on October 21st. You made an unnerving and uncomfortable situation pleasant and endearing.  Thank you from the bottom of my heart. God bless each and everyone that works in that entire building.", "pics": null, "resp": {"time": 1571774286418, "text": "We thank you and are very happy to have had a positive impact on your experience.  Thank you for your kind words we will share this with our team.  With sincere appreciation. Take Care!"}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "103227802844892782214", "name": "Jason York", "time": 1574466873995, "rating": 1.0, "text": "We were surprised by having to pay a second co-pay, one for the facility for the doctor. It was explained that this is because the doctor is not affiliated and it is an out patient surgery. However, the doctor's name is listed as part owner, not to mention the fact that we have had out patient surgeries in the past and not had separate co-pays. We will not be using this facility again, as it appears to be using any way possible to take money. We could have refused, but we already had the time scheduled off work, and it's hard to rearrange a surgery. At the very least, they could have let us know this in advance, instead of at the time of the surgery. We will be using the Baptist hospital system from now on.\n\nUpdate: No, it wasn't really addressed, we were just told that we would have to pay again or reschedule. It's not about the money, it's about letting us know in advance that there are two separate co-pays, which was not done.", "pics": null, "resp": {"time": 1574442580320, "text": "Hi Jason, we apologize for any miscommunication. Our administrative team is aware of the concern and has addressed this with the patient.  If you need future assistance or have further questions about our billing policies, please contact our Administrator Mr. John Gray 334-293-8484"}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "103860438254680297210", "name": "Barbara Sowell", "time": 1580652862613, "rating": 5.0, "text": "Great experience! Wonderful staff. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "101193850016028689346", "name": "leo zemke", "time": 1539124545151, "rating": 1.0, "text": "I am glad everyone else had such a fantastic experience at this place but they almost let my step son DIE!  He came in and was scheduled for exploratory surgery to fix SHODDY WORK DONE BY DR CHANDLER during a sinus polyp surgery and my step son began to pour blood from his Sphenopalatine Artery and the office was more worried about getting another three hundred dollar copay out of us than helping my son.  My wife had to scream for help in the office to get nurses and a doctor to get my son and help him.  We were treated shabbily during the whole ordeal.  My step son was bleeding to death and they did not even have the ability to  give him blood at this facility.  They almost killed him!  IT WAS HORRIBLE!  A HORRIBLE ORDEAL!!!!  I should post photos of all the blood.  The clinic manager was not friendly, everyone acted as if they did not know what was going on or what to do.  They had to take my son by ambulance over the the hospital and then the nightmare continued.  The ER doctor threw my son out of the hospital room that he was scheduled to be in.  It was like they tried to kill my son and then they were trying to sweep us under the carpet or out the door.  TO HIDE US AND THE HORRIBLE THINGS THEY DID AND THE WAY THEY ALMOST KILLED MY SON!!!   It was a nightmare!  They were going to give my son a blood transfusion in the ER and sweep us out the door.  MY WIFE HAD TO ENLIST THE HELP OF THE AMBULANCE DRIVERS Who could see that our son was in agony and practically DEAD AT THEIR HANDS!  The ambulance drivers GOD BLESS THEM talked the angry, crazy doctor into keeping our son and putting us in a room for the night.  This was the worst thing that has ever happened to our family.  I would not allow this clinic to operate on a PET COCKROACH if I had one!  PLEASE BEWARE!!!", "pics": null, "resp": {"time": 1539276470948, "text": "Dear Leo, we sincerely apologize for your experience with the Jackson Surgery Center.  We strive to provide the highest level of care equally to all of our patients.  We appreciate your feedback and are addressing the issues mentioned with our administrative team.  We promise to also forward your concerns to the Jackson Hospital Administration.  Our commitment to protecting patient privacy disallows us to discuss this in an open forum.  Please do not hesitate to contact our administrator John Gray at 334-293-8484"}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "112297912146866970493", "name": "Whitney Boutwell", "time": 1555592531295, "rating": 4.0, "text": "Very organized...very clean", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOXOLIBacBgsHxJG5iQ1wSlUfQoJG7vzmpR9JTM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOlpBS1BQZG6WSGqYqPA5y9JvzmNyonq_4GAx8J=w150-h150-k-no-p"]}], "resp": {"time": 1555676575347, "text": "Thank you Whitney!  We appreciate your observations and are happy to provide healthcare services to you and your loved ones.  I’ll share your comments with our team. Happy Friday!"}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "106585088584921164573", "name": "Carol Roberts", "time": 1533780088492, "rating": 5.0, "text": "My husband and I have both been here for minor outpatient procedures. We could not be more impressed with this facility and can enthusiastically recommend it to anyone needing surgery. We both had excellent care while we were there. The nurse even gave me novacaine before placing an IV in my hand (totally unnecessary, but I appreciate the thoughtfulness). I had some questions about anesthesia, and they actually brought the anesthesiologist to me to answer my concerns. After care and instructions were good.", "pics": null, "resp": {"time": 1533781108127, "text": "Carol we so appreciate your observations.   Thank you for noticing the “little” things we do to make your outpatient experience favorable.  Speedy recovery!  We will check on you soon!"}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "108378131542001498396", "name": "Michelle Swofford", "time": 1515160287657, "rating": 5.0, "text": "They took excellent care of my daughter and staff was super friendly.   She had an excellent nurse in recovery.   Everything is very organized from registration to discharge.", "pics": null, "resp": null, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "116107001445522782197", "name": "Keri Chaney", "time": 1536781345836, "rating": 5.0, "text": "This was my first procedure done here. Wonderful staff, very professional. Pleasant experience.", "pics": null, "resp": {"time": 1536783535671, "text": "Thank you!  We appreciate your kind words and will share with our staff.  Have a super recovery!"}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "113375147722597424669", "name": "Vincent Seabrook", "time": 1523394870461, "rating": 5.0, "text": "First class service.  5 star rating.", "pics": null, "resp": null, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "118051830061796961119", "name": "William Wheat", "time": 1533699862201, "rating": 5.0, "text": "Very nice service and friendly staff", "pics": null, "resp": {"time": 1533728675636, "text": "Thank you William.  I will share your kind remarks with our team."}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "110802827941322421352", "name": "Charlie Bradley", "time": 1580929194290, "rating": 5.0, "text": "Dr. Kowal is such an amazing doctor. He is thorough, easy to talk to, and has a great sense of humor.He explained my diagnosis with terms that that are extremely easy to understand, as well as explained our course of action. I'm so happy that I chose to come to his office for my treatment. I would recommend him to anyone with their ENT needs!", "pics": null, "resp": null, "gmap_id": "0x889a0def06bb67c7:0x7d19660d0ee4fd77"}
{"user_id": "115032578284416455032", "name": "Brittney Dent", "time": 1559576701939, "rating": 5.0, "text": "Love the staff and Dr. Kowel is very efficient and to the point. Also, he speaks in terms that are very easily understood. He has seen my youngest since she was 2 and now my 7 year old. I would recommend his office to anyone!", "pics": null, "resp": null, "gmap_id": "0x889a0def06bb67c7:0x7d19660d0ee4fd77"}
{"user_id": "108949356844217426642", "name": "Emerald Jewel", "time": 1583274235217, "rating": 1.0, "text": "Worst And rudest office staff on the planet. They are horrible and uncaring.", "pics": null, "resp": null, "gmap_id": "0x889a0def06bb67c7:0x7d19660d0ee4fd77"}
{"user_id": "116987056775025130773", "name": "Joyce Fisk", "time": 1518812024975, "rating": 4.0, "text": "Dr. Kowal removed my tonsils and I highly recommend him for this procedure. He was very kind and patient with me. His bed side manner is top notch.  The only reason his office didn’t receive 5 stars from me is the office staff can’t keep up with him. He is very efficient and it seems the staff struggles a bit. They are very friendly but a bit disorganized. I have no major problems with his office or services. There just needs to be a few tweets and adjustments made to make it run smoother.", "pics": null, "resp": null, "gmap_id": "0x889a0def06bb67c7:0x7d19660d0ee4fd77"}
{"user_id": "111108756608479176881", "name": "cheesegrits196", "time": 1548844303425, "rating": 5.0, "text": "Dr Kowal and his staff are an extremely caring group. They listen to your issues and then help you improve your situation. The other reviews about his staff being unprofessional are wrong. Everyone in Foley and surrounding areas should feel lucky to have such a resource close by.", "pics": null, "resp": null, "gmap_id": "0x889a0def06bb67c7:0x7d19660d0ee4fd77"}
{"user_id": "102880747195584090030", "name": "ashleigh lagreco", "time": 1526494423066, "rating": 1.0, "text": "Not only did I wait TWO HOURS in the waiting room, I had a 10:00 am appt, everyone that showed up after I did was called, also I tried to get my medicine faxed to a different pharmacy and they told me to call the nurses line, come to find out that they only answer once in the morning and once before they close. The doctor was ABSOLUTELY AMAZING and great at his job, but he should consider getting a new staff.", "pics": null, "resp": {"time": 1526658382903, "text": "Thank you for your feedback.  We understand the frustration of long wait times.  We do have multiple practitioners, and some patients who are called back before others could be patients of different providers. However, we assure you that we take your comments seriously and use them as an opportunity for improvement and training.  Thank you for entrusting us with your ENT treatment."}, "gmap_id": "0x889a0def06bb67c7:0x7d19660d0ee4fd77"}
{"user_id": "112624199624258604103", "name": "Cameron Workman", "time": 1534346706717, "rating": 1.0, "text": "I can't speak on the specialists due to the fact I felt that no one in this place deserved my copay and business, but let me say the front desk has some major issues. Rude and lazy are understatements. The waiting room is something out of a comedy skit. We walked in to folks standing around legitimately elevator level crowded and as I laughed it off a woman said to me that she's seen 6-7 people on the floor multiple times. There's not enough floor space for 5 and nah I'm not going to sit on a dusty carpet floor inch to inch with folks hacking just to see a Dr. for sinus issues. Counterintuitive. Common sense would tell you that anyone good at their practice or caring and about their oath would not subject patients to a space that will literally worsen the conditions they're there with and willing to pay someone to help fix. If this is a purely for profit practice with no sense of compassion I understand business is business; my advice is to work on office space and hire some hard working smiling individuals. Customer service is the beginning and end to all business and if you can't understand that you will never multiply in profit or resources. Simple. Plenty of offices about 30 minutes South, East, and North of here that aren't a scene from an 80s episode of SNL. Have a blessed one!", "pics": null, "resp": null, "gmap_id": "0x889a0def06bb67c7:0x7d19660d0ee4fd77"}
{"user_id": "105401701649219284505", "name": "Donna Earnest", "time": 1551908527118, "rating": 5.0, "text": "They have really helped with my sinus and allergy issues.  I also, really like their helpful staff!", "pics": null, "resp": null, "gmap_id": "0x889a0def06bb67c7:0x7d19660d0ee4fd77"}
{"user_id": "105401701649219284505", "name": "Donna Earnest", "time": 1551908527118, "rating": 5.0, "text": "They have really helped with my sinus and allergy issues.  I also, really like their helpful staff!", "pics": null, "resp": null, "gmap_id": "0x889a0def06bb67c7:0x7d19660d0ee4fd77"}
{"user_id": "108702433597442956680", "name": "G Harvel", "time": 1529980863187, "rating": 1.0, "text": "Absolutely horrendous. The doctor (Kowal) is condescending and inconsiderate. He wastes time. From what I witnessed, he is unprofessional towards the staff.  He did not help me at all, but to be fair I saw a woman who was a nurse and she was very helpful in getting me the right medicine. The work environment was not comfortable for me or the other staff members", "pics": null, "resp": null, "gmap_id": "0x889a0def06bb67c7:0x7d19660d0ee4fd77"}
{"user_id": "110810311979881108866", "name": "CallMe Kryptic", "time": 1562602770336, "rating": 1.0, "text": "This place is terrible. My appointment was for 10:20. I didn’t see the doctor for over an hour past my appointment time!!! Won’t come back!!!", "pics": null, "resp": null, "gmap_id": "0x889a0def06bb67c7:0x7d19660d0ee4fd77"}
{"user_id": "106032661582959315398", "name": "Tre Garrett", "time": 1616543391938, "rating": 5.0, "text": "I had battled with chronic sinusitis my entire life, up until my mom referred me to the best and only doctor to ever correct my sinus issues. I had 2 procedures and neither are in anyway invasive at all. The healing process was a breeze and I can finally breathe! I highly recommend anyone who suffers with any sinus/allergy to consult with Dr. Roberson. I have never felt better in my entire life.", "pics": null, "resp": {"time": 1616552752103, "text": "We are so glad you are feeling well! Thank you for your kind words."}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "101899971296895664008", "name": "Joe Moore", "time": 1612905349533, "rating": 5.0, "text": "Dr. Robertson was very informative, and made sure I understood in full detail everything he was recommending for me. Staff was very friendly and knowledgeable. I can tell I'm in good hands.", "pics": null, "resp": {"time": 1613336062970, "text": "Thank you for your kind words!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "102615502888452211586", "name": "Carol Mims", "time": 1614352655599, "rating": 5.0, "text": "I have nothing but good things to say about Dr. Robertson and his staff. I recently had surgery for a deviated septum and balloon sinuplasty. Both procedures went well and I am breathing and sleeping better.\nDr. Robertson is very prompt and caring as is his staff.", "pics": null, "resp": {"time": 1614355646945, "text": "Thank you so much Carol! We are so glad you are feeling good."}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "102223490664247163377", "name": "Stephen LaRocca", "time": 1610735263557, "rating": 5.0, "text": "Dr. Robertson, Beth, and staff are extremely courteous and professional. They took time to discuss concerns and review diagnostic data with me. Highly recommend this group!", "pics": null, "resp": {"time": 1611761379175, "text": "Thank you so much for your kind words!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "117222530601191863215", "name": "Lanier Millsap", "time": 1610031533137, "rating": 5.0, "text": "Staff is great and professional.   Dr. Robertson handle all my questions thoroughly. Did my wife and I sinus surgery.  Highly recommend.", "pics": null, "resp": {"time": 1610059339468, "text": "Thank you for your kind words!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "109236689603499798891", "name": "Tiffany Guin", "time": 1600480545490, "rating": 5.0, "text": "Dr. Robertson is hands down the best doctor. I would highly recommend him. I have never felt this much relief from my sinuses and ears. Thanks to Dr. Robertson I now have no sinus pressure in my ears and I have so much relief and can breathe so much better. Thank you!", "pics": null, "resp": {"time": 1600484938328, "text": "So glad you are feeling better! Thank you for the kind words."}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "109379532754025617610", "name": "Cindy Tennimon", "time": 1622155991248, "rating": 5.0, "text": "Great staff, promptly see you once you arrive . Expensive? Yes, even with insurance.", "pics": null, "resp": {"time": 1622819317644, "text": "Thank you for your review!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "105418759381483567954", "name": "Marsha Hutchison", "time": 1602019571843, "rating": 5.0, "text": "Dr Robertson and staff are amazing!  I was sick for a very long time .  My MD sent me to Dr Robertson.  I thank God for them.  Surgery went well. I almost forgot what it was like to be well!  Thank you so much for all your help and being so kind", "pics": null, "resp": {"time": 1602028891828, "text": "We are so glad you are feeling so good!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "103383705289330257758", "name": "Amber M", "time": 1579714307600, "rating": 5.0, "text": "Wonderful experience! I found Dr. Robertson online and went in because I was having problems with breathing and sinus pain. They started me on allergy shots which have reduced the frequency of sinus pain. Then I had a few surgeries to correct a deviated septum and remove my tonsils. Every surgery went very well, and Dr. Robertson was very hospitable to me (a 22 year old female) and my father. I now breathe a lot better!", "pics": null, "resp": {"time": 1579709879292, "text": "Thank you for your great rating!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "101887860347868781658", "name": "Jacob Hinkle", "time": 1582219669004, "rating": 5.0, "text": "Dr. Robertson and his staff are among the friendliest I've ever encountered. Scott talked to me about the procedure in simple terms that make sense to people who aren't doctors. When I visited, I did t feel like a patient, I felt like I was visiting a friend.", "pics": null, "resp": {"time": 1582237399992, "text": "Thank you for sharing your experience and your kind words!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "114239592464627008957", "name": "Google Account", "time": 1562955601153, "rating": 5.0, "text": "One of the Best doctors I have ever met!!  I can Breathe now.  A million Thanks to Doctor Robertson and his exceptional staff.  The surgery was so much better than I expected!  New to Birmingham and glad that I found you!", "pics": null, "resp": {"time": 1564531932274, "text": "Thank you! We are glad you are feeling better!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "102069743780540201422", "name": "Alex Nix", "time": 1557887274236, "rating": 5.0, "text": "The staff and Dr. Robertson are so friendly and truly care about your health. I can honestly say from my personal experience that Dr. Robertson changed my life. Before seeing him, I suffered daily from chronic sinus issues that significantly impacted my day to day life, and I am forever grateful for what he did to turn my life around. My quality of life is so much better, I sleep like I have never slept in my life, and I can finally breathe like a normal person. If you suffer from chronic sinus issues like I did, they can give you the relief you are seeking. I highly recommend Dr. Robertson and his staff, they are truly excellent at what they do!", "pics": null, "resp": {"time": 1564531969055, "text": "Thank you for your kind words! We are so glad you are feeling good!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "111702898491031143946", "name": "Maria Faulkner", "time": 1550352809054, "rating": 4.0, "text": "The doctor is five stars all the way and he’s made a tremendous difference in my son’s ability to breathe! He’s had two surgeries with Dr Robertson and it’s been a great experience. I can’t give the place five stars because for some reason even a simple post op appointment (and every other appointment I’ve been to with my son) takes between an hour and a half to two hours. I don’t understand the wait time; we usually book for first appointment in the morning or first one after lunch and still wait an hour. If they can fix that it would be great!!!", "pics": null, "resp": {"time": 1550516977646, "text": "Thank you for your feedback! We aplologize for the wait time. We are working on improving our scheduling procedures to minimize wait time."}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "113714896824254140809", "name": "Randy Miller (Ran)", "time": 1569454370204, "rating": 5.0, "text": "Great experience! Office staff is very friendly. Dr. Robertson was very thorough, his professionalism and bedside manner is second to none, he accurately diagnosed my problem and treated it appropriately. I am now back to 100%! Thank you Dr. Robertson and staff.", "pics": null, "resp": {"time": 1569457534484, "text": "Thank you! We are glad you are feeling good!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "103702178652063687981", "name": "Thom Johnson", "time": 1553303474922, "rating": 5.0, "text": "Dr. Robertson and his staff are very friendly and very knowledgeable. All of the procedures were done in house and with minimal discomfort. Dr. Robertson is in high demand so you must be flexible in case there is a wait! Don't worry, he'll spend as much time with you as necessary. Hope he helps you as much as he did me. I can breathe so much better now.", "pics": null, "resp": {"time": 1553304399231, "text": "Thank you for your kind words. We are glad you are breathing better!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "117749771707152147605", "name": "Philip Dye", "time": 1540942269073, "rating": 5.0, "text": "My wife Rachael Dye has been going to him since October. We have loved  our experience so far. We have been treated very nice and we love how sweet, kind and caring he is and his whole staff. Today Rachael had a  procedure done and the OutPatient Center was great. Dr and the staff treated her very kind and was there checking on her the whole time when she got sick and did what they needed. Her procedure went good and she has one more in November. We will recommend him to anyone.", "pics": null, "resp": {"time": 1541098485193, "text": "Thank you for your kind words. We hope Rachael is doing well!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "111442735245342443391", "name": "Andrea Clay", "time": 1540314635973, "rating": 5.0, "text": "Dr. Robertson was referred to me by my primary care doctor as well as a friend.  I have had sinus problems my entire life.  I underwent sinus surgery with Dr. Robertson at the end of August and am thrilled with the outcome.  He is thorough in explaining every part of any test, procedure, etc and takes all necessary time with you as a patient.  His office staff is professional and kind.  I highly recommend Dr. Robertson for any of your ENT needs.", "pics": null, "resp": {"time": 1540316289369, "text": "Thank you for sharing your positive experience and kind words!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "107178191116919903672", "name": "Matt Bartlett", "time": 1553742278339, "rating": 5.0, "text": "Great doctor! Very professional and informative. He made sure to address any concern i had with the sinus and septum surgery. He informed me that all the horror stories that i may hear about the surgeries are not true. highly recommend.", "pics": null, "resp": {"time": 1553743506815, "text": "Thank you for your kind words!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "106803836679169731864", "name": "Steven Eversole", "time": 1537926947070, "rating": 5.0, "text": "Excellent doctor that takes time with patients and explains everything completely. He doesn't rush or over book appointments they keep you waiting forever in the office. Great surgeon for sinus problems too. Highly recommended and the best ENT around.", "pics": null, "resp": {"time": 1537927656532, "text": "Thank you!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "101040114473136464637", "name": "Teresa Elliott", "time": 1551881056133, "rating": 5.0, "text": "I had sinus surgery on January 8,2019.  Dr. Robertson was great!  I highly recommend him!  The surgery and recovery process went well!", "pics": null, "resp": {"time": 1551903038683, "text": "Thank you for the kind words and we are glad you are doing well!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "105610709381908754254", "name": "Tara Parker", "time": 1557076634684, "rating": 5.0, "text": "Love him! Very professional staff, comfortable office, and detailed care. I am so glad i took someone else's advice, and gave Dr. Robertson a call. I finally feel like im getting ahead of my severe sinus and allergy problem.", "pics": null, "resp": {"time": 1557102801683, "text": "Thank you for your kind words!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "110727638891352911924", "name": "Shella Smith", "time": 1571688381825, "rating": 5.0, "text": "My cousin drives all the way from Atlanta to get her hearing aids adjusted! She loves Jennifer", "pics": null, "resp": {"time": 1577024163317, "text": "That’s great! Thank you for the review."}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "102779834863842429895", "name": "Zachariah Kesterson", "time": 1557166722657, "rating": 5.0, "text": "I have suffered from sinus issues and infections for over 25 years. I have seen other specialists. Dr. Robertson is by far the best ENT I have ever been treated by. Dr. Robertson and his people are so kind and thorough. After a hearing test, an allergy test and catscan he discovered my sinuses were blocked with little to no openings in the passages. The surgery was scheduled quickly and the care was fantastic. The recovery was not bad at all. I have never felt better in my life. I can finally breathe through my nose with no obstruction, and I am not getting a sinus infection every month anymore. My family can even tell a difference in my mood. The surgery has been life changing. If you need ENT care, Dr. Robertson and his people are incredible.  Highly recommend.", "pics": null, "resp": {"time": 1564532030065, "text": "We are so glad you are feeling good! Thank you for coming to see us!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "106799017269761397771", "name": "Charles Daryl Wideman", "time": 1550417308622, "rating": 2.0, "text": "That want to charge you for appointment if you have to cancel, but they can't get you back to see the doctor at your appointment time. Always 20-30 behind. Also it seems they just want to upsell services.", "pics": null, "resp": {"time": 1550516882287, "text": "We are so sorry about this. We actually do not charge for canceling an appointment, just for a “no show”. We are working on improving our scheduling, so that the wait time is minimal."}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "107639813832056147369", "name": "Brenda Slatton", "time": 1553091311815, "rating": 5.0, "text": "You need an ENT he is the best and the staff is very professional help me so much", "pics": null, "resp": {"time": 1553634389343, "text": "Thank you!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "107278629902588882124", "name": "Amy Wagar", "time": 1445256433637, "rating": 5.0, "text": "Staff is very friendly. Dr Robertson takes time to explain everything to me. I had surgery to open sinuses and it is amazing the difference. I feel very confident in the care I've received there.", "pics": null, "resp": null, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "108369331871065654897", "name": "David Massengale", "time": 1513744448310, "rating": 5.0, "text": "Dr Robertson did 2 surgeries on me, one to repair my deviated septum, the second on my sinuses. He did a great job! He is a very good ENT surgeon!!", "pics": null, "resp": null, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "114331284340261420293", "name": "Independent thinker", "time": 1416272456190, "rating": 1.0, "text": "Went in, thought I had bad allergy, was told by Dr Robertson I was allergic to  everything but mold and mildew. I had a bad feeling about it then. He suggested surgery to get air moving, idiot like I agreed. I could tell no difference after healing, didn't approach my original problem. I feel he wanted to pad his pocket at my expense.\nI went to another Doctor, he didn't do the age old skin prick test, he drew blood and sent it off to be tested. Came back I was allergic to dogs only and just enough to register on the test it was so slight. Said I will probably have to have surgery to get it straight. Dr Robertson didn't do the job right.  He only did part of the job needed, why would he not do the whole job and not put someone through all that again?\nGO AT YOUR OWN RISK!", "pics": null, "resp": null, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "105554081770444743576", "name": "Breunca Meadows", "time": 1501639875810, "rating": 1.0, "text": "My experience started off good and went horribly wrong from there. Working in the health field I've learned that a patients health history pays a vital key in treatment. I show up to my 5:45 appointment for my surgery apparently no one from the nurses to the doctor reviewed my medical history which stated that I was anemic . After being prepped for my surgery I was then told that I wouldn't be having the surgery due to me being anemic. Which was stated that same day more than once to two different people. On top of wasting my time, including the week that I had already taken time off from work which was now a waste, I was told that I could  call back in two - three months once I was \"cleared\" to have the surgery! I wouldn't recommended to anyone who has any type of predisposed health issue.", "pics": null, "resp": {"time": 1501694373049, "text": "We are so sorry for the inconvenience.  We always put our patient's safety first.  Unfortunately, safety concerns can arise at any time.  Please give us a call if you have any additional questions.  Thank you!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "105590779498271044927", "name": "Kevin Foote", "time": 1427753610606, "rating": 5.0, "text": "Dr. Robertson changed my life! I visited him after hearing a radio commercial about balloon sinuplasty, and I was skeptical at first but after years and years of chronic sinus problems, I was desperate to try anything. Dr. Robertson was very warm & personable, and I could tell he really cares. Most doctors I've met are sort of callous, and it's hard to find one that'll talk to you like a real person. Kudos to Dr. Robertson for making me feel comfortable about this, because it's a lot to consider & a lot of money. I elected to go with the procedure, and I'm so glad that I did. I can breathe so much better now, I'm sleeping better, and I'm no longer constantly bothered by my sinuses throughout the day. I'm not breathing perfectly, of course, but I can definitely feel a significant improvement. I think as long as you're nor expecting rainbows & unicorns but can keep your expectations reasonable, you'll be satisfied. If I could go back in time, I would have the procedure again. Thank you Dr. Robertson!", "pics": null, "resp": null, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "104957207123587525259", "name": "JP", "time": 1491935065849, "rating": 5.0, "text": "Dr. Robertson is a great doctor.  The best ENT in Birmingham. Dr. Robertson performed sinus surgery on me back in 1998. I was having severe miagrane headaches that would last for days.  After surgery I felt 100% better. I was amazed at the result. Also Dr. Robertson does NOT pack your sinuses after surgery. Today I'm still doing great and haven't had any other problems with my sinuses.", "pics": null, "resp": null, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "105052743519866573717", "name": "becky patterson", "time": 1577017015827, "rating": 5.0, "text": "First time I got relief with my sinuses!", "pics": null, "resp": {"time": 1577024097552, "text": "We are glad you are feeling well!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "115917112411888473774", "name": "Deana Mumpower", "time": 1446041450448, "rating": 5.0, "text": "I have had chronic sinus infections  for years.  My ears felt stopped up which was affecting my hearing.  Dr Robertson found the problem.  He suggested balloon  sinuplasty.  This has enabled my sinuses to drain properly and has alleviated  constant sinusitis. This procedure also opened my  ears.\nThe balloon sinuplasty  helped me so much, I took my mother (90) to see Dr Robertson.  She has had constant sinus problems for years.  Dr Robertson suggested the same procedure.  She is having great results, also.", "pics": null, "resp": null, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "104269136012608898670", "name": "Sweet Home Alamanda", "time": 1452866255387, "rating": 5.0, "text": "Dr. Robertson is absolutely amazing. I originally went in to see him about sinus issues that were making me miserable. He suggested that I undergo allergy testing. I did and my results revealed that I was allergic to 90% of what I was tested for, and I was severely allergic to most of those. I have started Rush Immunology and I look forward to feeling better in the future! Due to my anatomy (as found on CT Scan) Dr. Robertson recommended surgical intervention, and he performed a Septoplasty on me as well as addressed several other sinus-related issues during the procedure. Yes, post-op pn is never fun, but I am hoping to reap the benefits of the surgery in the near future.\nI cannot thank Dr. Robertson enough as he has been so knowledgeable and helpful in explaining exactly what he feels is going on with my allergy and sinus issues. When I first met him, he came in and sat down and took plenty of time speaking with me...even after being in a long day of surgery. He is never rushed in my appts, and spends a good amount of time explaining things. His staff has also been so friendly, helpful and knowledgeable as well. I appreciate Dr. Robertson and his awesome staff more than they will ever know! Thank you ALL so very much!!!\n(*FYI regarding another review below, the blood test used for allergy testing is NOT AT ALL considered to be the most effective at finding accurate results; research this)", "pics": null, "resp": null, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "112333434551215376865", "name": "Em M", "time": 1535254008587, "rating": 5.0, "text": "Dr Robertson and his staff are very friendly and helpful!", "pics": null, "resp": {"time": 1535390572209, "text": "Thank you!  We really appreciate your review and kind feedback."}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "116439990772194710213", "name": "Brandon Cruise", "time": 1564526723704, "rating": 5.0, "text": "great care and very friendly", "pics": null, "resp": {"time": 1564531895292, "text": "Thank you for your kind words!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "109610590841895487081", "name": "C Guthrie", "time": 1428348117499, "rating": 5.0, "text": "Dr Robertson is the best ENT we have ever been to. He cares for our whole family and extended family with allergies, tonsils, asthma, etc. Great practice and highly recommended.", "pics": null, "resp": null, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "103940423309617784407", "name": "selina allcorn", "time": 1498577746524, "rating": 5.0, "text": "Very nice staff, and Dr. Robertson is very thorough.", "pics": null, "resp": null, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "109891319777833429940", "name": "Victor B Pettus", "time": 1571418756735, "rating": 5.0, "text": "Great Service", "pics": null, "resp": {"time": 1577024173589, "text": "Thank you!"}, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "115518893991040546026", "name": "Diana Shoel", "time": 1526076279646, "rating": 5.0, "text": "Great doctor and friendly staff", "pics": null, "resp": null, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
{"user_id": "111484906490605884541", "name": "sool sool", "time": 1499487562485, "rating": 5.0, "text": "(Translated by Google) Dr. Robertson is a sinus specialist, my big problem for many years, after a detailed study he explained what the causes were and what solutions he had for me.\n\n(Original)\nEl Dr. Robertson es especialista en sinusitis, mi gran problema por muchos años, después de un estudio detallado me explico cuales eran las causas y que soluciones tenía para mi.", "pics": null, "resp": null, "gmap_id": "0x888917e64c8d3ea7:0xdc28d0f45952accf"}
