{"user_id": "107300929016835343695", "name": "Angela Smith", "time": 1518815415594, "rating": 5.0, "text": "Wonderful Doctors! Everyone is so friendly, and they really do all they can for their patients. Absolutely my first pick!", "pics": null, "resp": null, "gmap_id": "0x888bb3bcfe8cc85d:0x32e6fa0ca090d27a"}
{"user_id": "106426617878352567132", "name": "Debbie Ball", "time": 1494610813572, "rating": 4.0, "text": "I have Not seen this doctor in long time ...but when I did they were always good to me All of them", "pics": null, "resp": null, "gmap_id": "0x888bb3bcfe8cc85d:0x32e6fa0ca090d27a"}
{"user_id": "116701707057439435212", "name": "June McClendon", "time": 1624732343673, "rating": 4.0, "text": "I highly recommend Southern ENT & Dr Walters. Likes: Website has printable new patient forms that I completed before my appointment. Comfortable waiting area. Once I got to the exam room, I was seen right away. First by the friendly, efficient & knowledgeable auditory tech who took me to the sound-proof room for testing. I was pleasantly surprised that there was no wait time between testing & meeting with Dr Walters to review my results. Five stars for Dr Walters! It was obvious that he had reviewed my paperwork in advance,. He explained my results, answered my questions, and recommended a course of action clearly & patiently. I felt like he was seeing me as a person, not as a condition. Why not 5 stars? 40-minute wait time before getting to exam room & inability to complete & submit patient forms online.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "109321360756288387280", "name": "Deborah Hataway", "time": 1626970799152, "rating": 5.0, "text": "I am  completely satisfied with my appointment with  Dr. Lowery.  He put me at ease.   He has been my ENT for over 10 years and I drive over 45 miles one way because I trust him and his diagnosis each visit I have had.  He orders test when needed to ensure we know what we are dealing with.\nI recommend the Southern ENT & Sinus Center to any and everyone that needs an ENT.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "118206263218210649794", "name": "CLH 79", "time": 1624315376044, "rating": 5.0, "text": "We saw Dr Fort for my son's frequent nosebleeds. He was very nice and helpful. The office is large and clean. His nurse/assistant and the front desk clerk were very nice also. Overall a great place. Easy to get an appt too.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "115699391723525140900", "name": "Rhonda Rhudy", "time": 1626815709843, "rating": 5.0, "text": "Dr Walter's was very kind & thorough with my 15 year old daughter's sinus surgery. He explained the procedure to where she understood", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "112046350063589526968", "name": "M J", "time": 1617746675071, "rating": 5.0, "text": "The assistant for Dr Lowery is very gentle and patient. Dr Lowery was very attentive and informative. I did not feel rushed as I usual do when visiting the doctors. Dr Lowery and his assistant listen and were compassionate. I would recommend them to my clients as well.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "118241715010888133577", "name": "James Sparks", "time": 1617825141048, "rating": 5.0, "text": "Great experience.  Dr. Walton was wonderful and concerned about my illness. Would highly recommend if you need a great ENT", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "102613799315012531350", "name": "Dana Price", "time": 1607193969266, "rating": 5.0, "text": "I saw Dr. Walters for the first time.... I am completely pleased! He took time with me , listened to me and discovered an issue that was previously missed by another ENT in my hometown. He took care of the problem and I felt immediately better! He will definitely be MY doctor from now on!", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "110115481554068986918", "name": "Lauren Gingo", "time": 1612680192404, "rating": 5.0, "text": "Dr. Fort seen my husband for a 2nd opinion and we were very impressed. He listened to all his concerns, explained in detail what he was thinking, prescribed him medication, and getting him to a specialist for more in depth testing for his trouble swallowing. He also wants him to follow up with him in the near future. One of the best Drs he's seen, not just ENT Dr's.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "107841753224888819299", "name": "Pamela Williams", "time": 1612467369274, "rating": 5.0, "text": "Dr Walters was very professional and answered my questions precisely. I will recommend him.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "106998141012729230339", "name": "Ray White", "time": 1605305090089, "rating": 5.0, "text": "I was very happy with the office staff and with Dr. Lowery in their manner and concern for my well being. I highly recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "108948349441784284622", "name": "D J", "time": 1608324642124, "rating": 5.0, "text": "They seem to be extremely cautious with Covid safety.  Dr. Walters is the BEST. Very patient,  explains well, answers all questions and really cares.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "103746235602676490083", "name": "Bobbi Lee", "time": 1604173689837, "rating": 5.0, "text": "Excellent care, I felt welcomed and that all personnel were courteous and professional.  I was seen at my appointment time, in spite of COVID precautions and the aftereffects of Hurricane Zeta. Dr. Lowery was polite and answered my questions.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "103424394194085224746", "name": "Heather Brownlee", "time": 1561036309536, "rating": 5.0, "text": "Went here yesterday for extreme ear pain. I had already been to a doctor and received antibiotics for what I was told was an inner ear infection. Upon arriving the nurses were extremely helpful and nice with helping me get my insurance figured out. I was taken to the back for a hearing test by another very nice lady she explained everything she was doing and explained the graph to me after we were completed. Dr.Walters was very thorough and looked in both ears more than once. He determined I DID NOT have an inner infection but, a protruding ear drum! He was able to pop it back in place for immediately relief. I was very happy with my visit here and everyone on the staff is extremely helpful and nice! I recommend anyone to go here!", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "109082315971785092268", "name": "Betty Bryant", "time": 1601771274314, "rating": 5.0, "text": "Prompt attention, thorough exam, left satisfied. Personnel very friendly.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "106411139485337673177", "name": "Ala Barakat", "time": 1574714147498, "rating": 5.0, "text": "Friendly staff, no waiting on appointments. Dr. Walters was very friendly and knowledgeable. Highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "108067481546921736104", "name": "Monty Reed", "time": 1603902935200, "rating": 5.0, "text": "Got me in same day I called. Fixed my gland immediately", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "113319179488473931618", "name": "Johnny Walker", "time": 1552072589188, "rating": 5.0, "text": "The staff is the best! They go out of their way to make you feel welcome and do an excellent job. I wouldn't considering going anywhere else and my treatment has been nothing short of a life changer.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "112769715152790815053", "name": "TommyMary Grant", "time": 1605295090543, "rating": 5.0, "text": "In and out in a reasonable time", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "105284883321240640723", "name": "Linda Lee", "time": 1603551441345, "rating": 5.0, "text": "Excellent serviice.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "115527044841455865302", "name": "mike yeskevicz", "time": 1578437344859, "rating": 5.0, "text": "Dr.  W is great and very good bedside manner", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "111118226927417170590", "name": "James Patillo", "time": 1553719603482, "rating": 1.0, "text": "I was a patient of Dr. Jebeles for many years and was very pleased with him. In Nov 2018 I developed a severe nose bleed, something I never had previously. Had to go to emergency room where they advised me to go to my ENT Dr.  Which I did with Dr. David Walters with Southern EnT. He did nothing to treat the condition, other than advised me to go to the emergency room. Of course I told him I was at his office from what I was told to do from  emergency room Dr. that night the bleeding was severe and I called and talked to Dr . walters the next morning he advised me to go to the emergency room. Ayer a few days of  very severe bleeding I was able to get an  appointment  with  another ENT. Dr. Who immediately cart irised my nose.This Dr could not believe why Dr Walters would not treat this conditionThe bleeding was very severe and I felt it to be life threating. After almost 20 years I will never  go back to Southern ENT  And Sinus", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "117192137654006299074", "name": "Leah D", "time": 1479840431368, "rating": 5.0, "text": "I had a reaction to a steroid shot out of nowhere (that doesn't EVER happen to me), and the entire staff went out of their way to make sure I was taken care of. I was very much so blessed with their patience and kindness", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "102494647938481819406", "name": "Lindsay Brock", "time": 1581728459297, "rating": 5.0, "text": "Great place great people 👍", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "105138833436904284223", "name": "ANNimal 2020", "time": 1528596393523, "rating": 1.0, "text": "The rudest staff ever & Dr. Jebeles is in & out not hearing a word you say misdiagnosing you. Had to end up using another AWESOME ENT at ENT of Alabama at St. Vincent’s", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "110847520477891799177", "name": "Mike MacMahon", "time": 1470661769547, "rating": 5.0, "text": "Prompt scheduling, attentive staff, and great doctors finally got me relief from my chronic sinusitis. Hooray!", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "116296672795214289271", "name": "Ana Johnson", "time": 1497964879095, "rating": 5.0, "text": "Great staff! Quick and efficient!!", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "111626396238041970964", "name": "Randall Garrison", "time": 1627350619154, "rating": 1.0, "text": "Christopher Clark is a very arrogant doctor.  Instead of trying to find a solution, he got defensive and belligerent with me.  I had to go back to my doctor, today, who sprang into action right away, when he heard of my condition.  Clark had a good opportunity, but failed to make the mark.  I’m not sure Clark is a capable doctor.  I didn’t see it.  I will try to give Clark as much adverse publicity as I am able.  And that goes for ENTAA as well.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "101600483277831810121", "name": "liz fike", "time": 1627450354305, "rating": 5.0, "text": "Even though I’m sick, I love coming to see the friendly staff & my great Dr Goldberg!!!  I think he is the best is town!!! I’ve been with them since 1997.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "103737119299193193861", "name": "Cindy Attaway", "time": 1625218476900, "rating": 5.0, "text": "I always like going to see Dr. Owens because of his joyous personality as well as his expertise as a physician. He has always been a great help to me and makes sure he answers all questions I might have. He makes me feel that everything will be ok and I need not worry. I like that feeling when I walk out of his office. All his staff are very kind and helpful.", "pics": null, "resp": {"time": 1626377758985, "text": "Thank you so much for taking the time to send in a review for Dr. Owens and our staff here at ENT Associates of Alabama."}, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "107392813736810835368", "name": "Mark Teachman", "time": 1627503507733, "rating": 5.0, "text": "Dr Owens was very helpful in diagnosing and treating my reflux condition. He is kind and spends enough time with me to thoroughly evaluate and discuss options.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "117945188680937347628", "name": "Amber StJohn", "time": 1627438293961, "rating": 5.0, "text": "The entire staff is very professional and helpful. They still care and take time with their patients. I never feel like I am being rushed and not heard. Here is the big one.... when you call, they answer the phone!!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "104515631635871833435", "name": "Gary Eggleton", "time": 1627650235065, "rating": 5.0, "text": "Had Sinus checked for infection, they were, received shots and a prescription, Dr. Wilson was good, thorough and informative.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "107601454558163584898", "name": "Christy DeFrance", "time": 1626655190475, "rating": 5.0, "text": "Polite and respectful staff. Dr Colvin listened to every concern and addressed my needs/issues professionally and politely.", "pics": null, "resp": {"time": 1626790748899, "text": "We appreciate you taking the time to send in a review for Dr. Colvin and the staff at ENT Associates of Alabama, P.C."}, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "115956290267738750272", "name": "Sue K", "time": 1625691621273, "rating": 5.0, "text": "I have just started going to Dr. Elledge and I’m very glad that my doctor referred me to him. He listened to my concerns and came up with an excellent plan which was the least evasive way to go. Also, his staff is friendly and made me feel very comfortable. I definitely recommend this practice.", "pics": null, "resp": {"time": 1626378103342, "text": "Thank you so much for taking the time to send in a review for Dr. Elledge and for our staff here at ENT Associates of Alabama, P.C."}, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "114733621895994713544", "name": "Tammy Maddox", "time": 1625617518099, "rating": 5.0, "text": "Dr Clark and staff at ENT Associates of AL are all exceptional and very caring! Very pleased with their expertise and kindness!", "pics": null, "resp": {"time": 1626378802438, "text": "We appreciate you taking the time to send in a review for Dr. Clark and the staff here at ENT Associates of Alabama, P.C."}, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "110926444518109971616", "name": "Sierra Turberville", "time": 1625769232442, "rating": 5.0, "text": "Friendly staff, short wait times, Dr. Colvin very thorough explaining things and very patient to make sure it is understood.", "pics": null, "resp": {"time": 1626378449162, "text": "Thank you so much for spending the time to send in a review for Dr. Colvin."}, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "101074120633007936355", "name": "Joy Steadham", "time": 1626095101316, "rating": 1.0, "text": "Made an appointment at the Grandview office of ENT Associates and after 2 hours in this office, I left without any treatment or conclusion in regards to my visit. Two weeks later, I visited a local Doc in the box (Med Center Hoover), in which they let me know within 30 minutes of being in the office I had fluid behind my ear which was causing the issues I had gone to a PROFESSIONAL for. Upon leaving ENT associates I was under the impression that of 24 years of age I was suffering from tinnitus, as well as needed to consider a nose job for my allergy problems. Now after one day of being treated by the local doc in the box, I feel 100 times better. Who knew it was rocket science to take .000005 seconds to look into someone's ear and see fluid, and then connect the dots. 0/10 for ENT Associated at Grandview, don't waste your time.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "111984259075706517089", "name": "Mandi V", "time": 1626193256881, "rating": 5.0, "text": "Extremely friendly and knowledgeable staff. Such a great place!", "pics": null, "resp": {"time": 1626378327728, "text": "Thank you so much for taking the time to send in a review for ENT Associates of Alabama, P.C."}, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "113019352532044808791", "name": "Kayla Thomason", "time": 1626367514489, "rating": 5.0, "text": "Everyone is so nice and efficient. Glad to breathe again after Dr. Elledge did my septoplasty!", "pics": null, "resp": {"time": 1626377796627, "text": "Thank you so much for taking the time to send in a review for Dr. Elledge."}, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "101385346462785410473", "name": "Ashley Davis", "time": 1625245029167, "rating": 5.0, "text": "Dr. Goldberg is my new ENT! He was professional, thorough and kind. I so appreciate the staff at ENT Associates of AL, P.C.", "pics": null, "resp": {"time": 1626378829651, "text": "We appreciate you taking the time to send in a review for Dr. Goldberg."}, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "102776650278946608861", "name": "Tamika McNeal", "time": 1626439550203, "rating": 5.0, "text": "Service very quick. Staff very friendly", "pics": null, "resp": {"time": 1626790811164, "text": "We appreciate you taking the time to send in a review for ENT Associates of Alabama, P.C."}, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "104221464419337013578", "name": "Leonard Wertheimer", "time": 1625239029381, "rating": 5.0, "text": "Very good medical treatment and very warm and welcoming staff.", "pics": null, "resp": {"time": 1626378951698, "text": "Thank you so much for taking the time to send in a review for ENT Associates of Alabama, P.C."}, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "111949772950405776934", "name": "Tracey Smith", "time": 1627134805353, "rating": 5.0, "text": "Dr. Goldberg was great at discussing treatment.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "118378415853564195355", "name": "Esther Levy", "time": 1626552962943, "rating": 5.0, "text": "I was able to get in quickly and everyone was very nice,", "pics": null, "resp": {"time": 1626790780493, "text": "Thank you so much for taking the time to send in a review for ENT Associates of Alabama, P.C."}, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "100531382467029140198", "name": "Jeri Davis", "time": 1625693809868, "rating": 5.0, "text": "Dr Goldberg is kind, relaxed, not an alarmist and an excellent Dr.", "pics": null, "resp": {"time": 1626378760461, "text": "Thank you so much for taking the time to send in a review for Dr. Goldberg."}, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "112906857844062869767", "name": "Patricia Bonds", "time": 1625227990726, "rating": 5.0, "text": "Very good , happy with care received!", "pics": null, "resp": {"time": 1626379011627, "text": "Thank you so much for taking the time to send in a review for ENT Associates of Alabama, P.C."}, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "102712663322596536182", "name": "Linda Channell", "time": 1603245296210, "rating": 2.0, "text": "Very pleasant & courteous, but he did not fully address all of my issues.  I felt the depth of care was enough justify the charges.   Very disappointed,", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "102448728965203132829", "name": "Lisa Lowery", "time": 1627673759152, "rating": 5.0, "text": "Dr. Owens is the best!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "102051067274359310885", "name": "Kathryn Carlton", "time": 1625700372941, "rating": 5.0, "text": "Dr. Owens is wonderful!", "pics": null, "resp": {"time": 1626378738564, "text": "We appreciate you taking the time to send in a review for Dr. Owens."}, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "116124522623155828585", "name": "Darrell Sims", "time": 1626296449263, "rating": 5.0, "text": "Knowledgeable, caring  Doctor!", "pics": null, "resp": {"time": 1626378279723, "text": "Thank you so much for taking the time to send in a review for Dr. Goldberg."}, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "110230002038362439113", "name": "Angela Hollis", "time": 1625763264301, "rating": 5.0, "text": "Very detailed oriented", "pics": null, "resp": {"time": 1626378692571, "text": "Thank you so much for taking the time to send in a review for ENT Associates of Alabama, P.C."}, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "109261231269065310241", "name": "Salim Jan", "time": 1576729248154, "rating": 5.0, "text": "Good Group of Doctors, Great services by entire staff. Good communication.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMqHA_fVVPNH1R2F00L7xlnUoF6XUzNDSNjRxsS=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "109817597646888992463", "name": "Deana Gore", "time": 1573483407473, "rating": 5.0, "text": "A truly wonderful group of Physicians and Staff.  Decades of experience. The doctors have taken VERY good care of me and my son in immediate times of need. Several members of my extended family and friends are also seen by the physicians. Never have to wait for an appointment, same day.  Can't say enough GOOD about this practice.  I would HIGHLY recommend!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "107274967924642924701", "name": "Rhonda Shear", "time": 1573235176541, "rating": 5.0, "text": "The doctors and staff of ENT Associates of Alabama are wonderful!  Dr. O'Neil at St. Vincent's is AMAZING!!  The staff at the Grandview, St. Vincent's Downtown and St. Vincent's East locations are always so nice and friendly. The girls at check-in always have a smile on their faces.  And I can't say enough about how efficient they all are!  There is no sitting in the waiting room for an hour waiting to see the doctor.  They get you in and out very promptly.  But when you leave, you don't feel like you were just a number and rushed out of there.  I highly recommend ENT Associates!!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "106812794086520904637", "name": "Jill Carter", "time": 1575484505576, "rating": 5.0, "text": "We go to the St. Vincent's office in Trussville.\n\nDr. Christopher Clark is amazing with both Adults and Children.. My 5 year old ADORES him and trusts him completely. They REALLY CARE about their patients and have ALWAYS found time to see us THAT DAY if it is urgent... Even if it means staying later after hours.\n\nMy daughter needed her tonsils out, he did his first available and did a Great Job!!\n\nAnd the staff, they are the kindest and hardest group of workers I have ever met. There is child area in the waiting room full of books and lots of other fun stuff W(is actually cleaned often)!\n\nI would recommend them (especially Dr. Clark) to EVERYONE!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "103143966881715442526", "name": "Joe McNulty", "time": 1564664067627, "rating": 5.0, "text": "My wife had surgery at St. Vincent’s on Monday and Dr. Black and his team were awesome. St. Vincent’s Hospital was a wonderful  experience. From the time we checked in at 4:45 am until we left, even the special kindness shown to us by the young lady who went to retrieve our car did not go unnoticed. We were very impressed. Thank you!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "104340587657520904090", "name": "Kathy Lecroix", "time": 1572375287594, "rating": 5.0, "text": "The allergy department staff is awesome!! They are interested in me and make sure that I’m doing well with the medicine!! Deana and Libby take excellent care of me and are very encouraging and attentive!! I wouldn’t go anywhere else and I highly recommend this department to everyone!!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "114459070276250322513", "name": "Kayla Adcox", "time": 1573184263471, "rating": 5.0, "text": "Amazing group of doctors! All are wonderful! They’ve been treating my sinus and allergy problems for four years now. I would recommend this group to anyone with ear, nose, and throat issues.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "102901354116100409537", "name": "Bradley Dupree", "time": 1580407565712, "rating": 1.0, "text": "Arrived 15 minutes early for appointment. Waited 2.5 hours, and still had not seen the doctor. Left to return to work. I understand the overbooking process, but patients would appreciate a heads up for long waits, or even alternative dates to ensure a quick visit. This is unfortunate, because I've otherwise had a pleasant experience at previous visits.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "113662107268451887304", "name": "Greg Gravlee", "time": 1574618523888, "rating": 5.0, "text": "The Allergy team is phenomenal!  Libby and Deana have great attitudes, and their customer service is fantastic.  I always enjoy my \"one-time-per-vial\" visits.  Thanks, ladies!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "102381781407944757405", "name": "Lisa Benefield", "time": 1566512224219, "rating": 5.0, "text": "Dr. James T. O'Neil is the best. A great Doctor who has a great attitude, smart, and straight up with you about your issues. He listens and communicates well and gets you out of the hospital FAST! A very trustworthy & down to earth guy.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "107252443570053836510", "name": "S Curtis", "time": 1574814141284, "rating": 5.0, "text": "I have been a regular patient/customer at the ENT Associates of AL main office at St Vincent's for many years. I have always been very pleased with the office staff, the nurses, and my doctor (Goldberg). Everyone is cheerful, polite, and helpful, and they really keep things moving in the clinic to try and stay reasonably close to 'on-time' for appointments.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "103857946469844124609", "name": "April L", "time": 1559669972611, "rating": 5.0, "text": "St. Vincents location - Entire staff was nice. Process was smooth. I was able to complete registration easily from my phone the day before my appointment. I had Dr. Alan. He took care of all my concerns and made sure I was good to go. I would refer any of my family and friends to him.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "115558552328356695858", "name": "Scott Wilson", "time": 1575323655858, "rating": 5.0, "text": "First time there and nothing but good to say about these professionals. Dr. Black was who I saw and he was thorough and friendly. Treated me like a patient and not a case or number. Left feeling good about my first experience with them.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "109303173050133796646", "name": "Patricia Pate", "time": 1575083377780, "rating": 5.0, "text": "I have loved my experiences with these doctors, especially Dr. Black, and the employees. I truly believe that Dr. Black saved my life and I am so very thankful for him. I would, and do, recommend Ent Associates of Alabama to everyone.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "118041675667427554623", "name": "Tammy Felix", "time": 1574652370744, "rating": 5.0, "text": "Dr LeJeune is amazing! Very knowledgeable and listens to his patients! The front desk staff are incredible! All of the staff, nurses all of them are outstanding! I'm grateful for all of them!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "102550157513146698159", "name": "Kelsey Jackson", "time": 1573172453686, "rating": 5.0, "text": "Ent Associates of Al where do I begin you can’t go wrong with the physicians here they care for you listen and take time for you and the staff members are awesome as well! They all work as a team and you can definitely tell it! Love ENT Associates of AL!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "115529160765586903923", "name": "Katie Pardue", "time": 1573159076042, "rating": 5.0, "text": "This is a great group of doctors. The office staff is very kind and helpful. I highly recommend this practice to anyone that needs a ENT doctor.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "108421289589950340819", "name": "Heather Williamson", "time": 1565393261096, "rating": 1.0, "text": "Dr Black has the absolutely worst bedside manner. He shares absolutely no sympathy with his patients. To even watch him belittle his shadow Dr,'s. I will never use this practice again, much less recommended it. I will do my due diligence to shed light on a self sanctified, full of himself physician. For a Christian based hospital....he shows no christ like behavior. Only self exalting, completely blinded by himself. To feel so debased today,....complete unbecoming of St Vincent's Hospital. I will definitely let everyone I know, to steer clear of this practice.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "107428446078709868044", "name": "JMC 1981", "time": 1573572877954, "rating": 5.0, "text": "The entire ENT Associates of Alabama staff are awesome!! Great staff and great facilities. I would recommend to anyone!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "108099316558788495388", "name": "Taylor Manasco", "time": 1573144983752, "rating": 5.0, "text": "Such a wonderful group of physicians! I couldn't have asked for a better experience. The staff was absolutely fantastic and very friendly.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "115419063940870909463", "name": "Jamie Odell", "time": 1572295160507, "rating": 5.0, "text": "Love ENT Assoc. of Alabama- St. Vincent’s Birmingham Allergy Dept. Deana and Libby are wonderful and make the allergy process SO much easier! :)", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "111596220926709340434", "name": "Sam Rich", "time": 1573154981311, "rating": 5.0, "text": "I see Dr. Patrick Owens at the St. Vincent's East office - this is an excellent and caring office.  Everyone is very friendly, from the front desk to the back of the office.  I highly recommend this office and doctors.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "105543517773035895497", "name": "Catherine Gray", "time": 1574619056548, "rating": 5.0, "text": "ENT Associates has the most professional and friendly staff! The nursing staff is personable and professional. Highly recommend ENT Associates for all of your ENT needs!!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "114117616787926717266", "name": "Jenny Vaughn", "time": 1571666172627, "rating": 5.0, "text": "Wonderful group of Doctors. I would trust any one of them to see me or my family!  Dr. Goldfarb is absolutely wonderful! He's not just a wonderful doctor, he's a good hearted person who loves his patient's and staff", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "102636808123014538934", "name": "Petit J", "time": 1584103188657, "rating": 2.0, "text": "On Thursday, March 12th, arrived at 1:45 pm for 2:00 pm appointment with Dr. Clark (St. Vincent's East location, Bldg 48).  Was called to exam room at 1:55 pm.  Was told there would be a wait as Dr. Clark was in surgery....Dr. Clark finally came in to see me at 2:50 pm.  NO ONE CHECKED ON ME OR GAVE ME UPDATES DURING THE 55 MINUTES I WAITED IN THE EXAM ROOM.   WILL NOT BE BACK TO DR. CLARK!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "100118449264731591401", "name": "Drew McLaughlin", "time": 1573559099991, "rating": 5.0, "text": "Great group! Amazing doctors and courteous staff! Everyone always goes above and beyond for the patients.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "113680681893986111836", "name": "Kelley Cobb", "time": 1573150886022, "rating": 5.0, "text": "Great group of physicians. Office staff also very helpful! Wouldn't use anyone else!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "108715670324379543339", "name": "Terilyn Burg", "time": 1575501203547, "rating": 5.0, "text": "Bravo to all of the staff for their caring and loving attention they give to all of the patients/clients...definitely 5 star *****.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "102051137016425340285", "name": "LM Jones", "time": 1572516656179, "rating": 5.0, "text": "St. Vicents birmingham allergy department staff are great. I always enjoy seeing Deena and Libby. They are so sweet and very professional! They make the experience the best!!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "111609954273664601500", "name": "Crista Hughes", "time": 1574439174930, "rating": 5.0, "text": "Amazing group of people they just love on my little guy , hes very hard to deal with but they take there time with him and try and talk to him and play to calm him down. Thank yall❤", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "104700017364807186748", "name": "Kellie Luckie", "time": 1576088775545, "rating": 5.0, "text": "ENT Associates has a great group of doctors!!  I would refer anyone to see them as I know that these doctors will take care of them.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "106990660158061339394", "name": "Mallory McLaughlin", "time": 1570712834358, "rating": 5.0, "text": "Very friendly staff and amazing doctors!! Dr. Goldfarb did nose surgery on me, and has been amazing!! I have had no pain with the surgery.\nMy family sees Dr. Favrot, and think the world of him. You would be in great hands with any doctor in this group.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "108075829711714187167", "name": "Miranda Stewart", "time": 1573151556708, "rating": 5.0, "text": "Dr. Elledge and team are wonderful!!  They have treated me and my son (both patients) so well and I would recommend them to all my friends and family.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "105120504952298710589", "name": "John Higginbotham", "time": 1522157309470, "rating": 2.0, "text": "Great staff and doctors. However, my wife was overcharged for her test and office visit. This is ok as long as the refund is issued in a timely manner. The CEO Dianne's policy is that if you are overcharged, you will receive a check 6-8 weeks later. This is unacceptable as they should bill these charges rather than charge too much upfront. I STRONGLY encourage any patients to check to make sure of this as the billing department would have kept my money if I hadn't caught it.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "104107257879545414212", "name": "Brittany Robinson", "time": 1569849786352, "rating": 5.0, "text": "Staff is very friendly and helpful. Everything is very clean and well kept.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "114918023619602504750", "name": "Kaye Jones", "time": 1573146553027, "rating": 5.0, "text": "My daughter has had sinus issues for years\nI made an appointment in the Alabaster Office. We loved Dr Elledge and his wonderful staff\nAfter being treated by Dr Elledge my daughter is doing tremendously better\nI highly recommend Dr Elledge at ENT Associates of Alabama in Alabaster ❤️", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "112219494699453841743", "name": "vickie howell", "time": 1573149495781, "rating": 5.0, "text": "All the staff at ENT Associates of Alabama are very polite and make you feel so comfortable.You dont have to wait long to see a dr. They have you in and out at a timely matter.I would recomend anyone that needs to see a ENT to go to ENT Associates of Alabama.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "104191370803535717013", "name": "Shawn Green", "time": 1573149899413, "rating": 5.0, "text": "They get  you back in a room fast and the doctors and staff are very kind and helpful", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "111613398629910671742", "name": "Chris Vaughn", "time": 1573142994106, "rating": 5.0, "text": "wonderful group of doctors and staff!! I would highly recommend this ENT group", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "115366696405612728523", "name": "B Cop", "time": 1569591309520, "rating": 1.0, "text": "The McDonald's of ENT's (not a good thing)\nSaw Dr Oneil (well, actually his PA did most of the work, he showed up for 30 seconds at the end) for a very bad double ear infection and he was less than gentle with my sore ears. The nursing staff is all about turnover...they messed up my first prescription to the hospital pharmacy and I am still trying to get a prescription called in 24 hours later but cannot get past the nurses answering line and nobody will call me back.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "118163050985599564094", "name": "William Daniels", "time": 1573147709170, "rating": 5.0, "text": "I had a great experience with Dr Favrot\nCompassionate nurses\nStaff was wonderful", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "117146196197401617402", "name": "Hannah Taylor", "time": 1573149419359, "rating": 5.0, "text": "Great group of doctors with friendly staff! Dr Black did my thyroid surgery and I could not have asked for better care!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "101194385593443794945", "name": "Sonya Gruber", "time": 1574513412538, "rating": 5.0, "text": "A great group, got the best care, left feeling better.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "100079395979048023130", "name": "posey ernie", "time": 1568658644524, "rating": 1.0, "text": "I have been a patient of dr lajune and dr brag for about 25 years. now that they moved I call to refill my allergy and they say I have to schedule a appointment I was just there 6 weeks ago that's another fifty copay so I decided to take my business elsewhere thank you very much.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "114130158722700993356", "name": "Toni Ashcraft", "time": 1553878886647, "rating": 5.0, "text": "Very helpful and efficient like I have not seen in dr office in a while staff is helpful and friendly", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "107115008727544408548", "name": "Adam&Kimberly waugh", "time": 1574786076104, "rating": 5.0, "text": "Dr. LeJeune and the staff at Gardendale are great!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "100867552836536690914", "name": "Brenda Cade", "time": 1527337928284, "rating": 1.0, "text": "Dr Poynor has got to be the worst Dr at St Vincent. He told me I had an attitude because I didn’t remember the prescription Dr Simpson prescribed to be before and I asked was it in the files. When he said that I immediately left his office and refuse to be seen by him. Dr Simpson was booked but he was able to squeeze me in. When I was on my was back to see him Dr Poynor continued to try to make commits to me. He said I did not mean to cause you to have a bad day with a smile on his face. What was that to say. If my Dr is not available I do not and will not ever step foot in his office. Other than that the Staff is all way courteous and Dr Simpson is the best.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "117259978054771811622", "name": "Angela Manasco", "time": 1573145958643, "rating": 5.0, "text": "Great group of physicians. Friendly  staff.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "102599839990068348742", "name": "Jeremy Bryant", "time": 1573166600985, "rating": 5.0, "text": "Great faculty! Love this place!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "114188529058766438610", "name": "mike callahan", "time": 1534362950116, "rating": 5.0, "text": "Dr Poynor is one of the most gracious and smartest doctors I’ve ever met!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "114035578146780572911", "name": "Amy Lazaro", "time": 1573132853163, "rating": 5.0, "text": "Great doctors, great employees and awesome service!!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "105256599990391889517", "name": "Tara McBurnett", "time": 1574211851036, "rating": 5.0, "text": "Excellent Group of Doctors and Specialist.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "110446642974392066071", "name": "Tammy", "time": 1574211298952, "rating": 5.0, "text": "Recommend for all your ENT needs!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "111251152495383948469", "name": "Cheryl Adams", "time": 1573146470608, "rating": 5.0, "text": "Great doctors, friendly staff.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "103844459586803250633", "name": "Kimberly Carder Waugh", "time": 1574785706495, "rating": 5.0, "text": "Amazing offices at ENT Associates and wonderful doctors!!!!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "110635855906107103024", "name": "Christel Lee", "time": 1573854867262, "rating": 5.0, "text": "Great Doctors, Great staff, Great experience", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "104858873591796280717", "name": "Brian W. Kittrell", "time": 1494499173397, "rating": 5.0, "text": "Love these guys!", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "118283470019045173250", "name": "Laura Whittington", "time": 1627747927260, "rating": 5.0, "text": "Wonderful staff, so polite, helpful and professional.\nReally like Dr Owens.  He's so down to earth.\nHe sits beside you and explains everything.\nTreats me like his grandmother!!!!!\nHe's young, but he's GOOD.", "pics": null, "resp": null, "gmap_id": "0x88891bb624a9b221:0xa63e3095cc4ec97b"}
{"user_id": "110802827941322421352", "name": "Charlie Bradley", "time": 1580929194290, "rating": 5.0, "text": "Dr. Kowal is such an amazing doctor. He is thorough, easy to talk to, and has a great sense of humor.He explained my diagnosis with terms that that are extremely easy to understand, as well as explained our course of action. I'm so happy that I chose to come to his office for my treatment. I would recommend him to anyone with their ENT needs!", "pics": null, "resp": null, "gmap_id": "0x889a0def06bb67c7:0x7d19660d0ee4fd77"}
{"user_id": "115032578284416455032", "name": "Brittney Dent", "time": 1559576701939, "rating": 5.0, "text": "Love the staff and Dr. Kowel is very efficient and to the point. Also, he speaks in terms that are very easily understood. He has seen my youngest since she was 2 and now my 7 year old. I would recommend his office to anyone!", "pics": null, "resp": null, "gmap_id": "0x889a0def06bb67c7:0x7d19660d0ee4fd77"}
{"user_id": "108949356844217426642", "name": "Emerald Jewel", "time": 1583274235217, "rating": 1.0, "text": "Worst And rudest office staff on the planet. They are horrible and uncaring.", "pics": null, "resp": null, "gmap_id": "0x889a0def06bb67c7:0x7d19660d0ee4fd77"}
{"user_id": "116987056775025130773", "name": "Joyce Fisk", "time": 1518812024975, "rating": 4.0, "text": "Dr. Kowal removed my tonsils and I highly recommend him for this procedure. He was very kind and patient with me. His bed side manner is top notch.  The only reason his office didn’t receive 5 stars from me is the office staff can’t keep up with him. He is very efficient and it seems the staff struggles a bit. They are very friendly but a bit disorganized. I have no major problems with his office or services. There just needs to be a few tweets and adjustments made to make it run smoother.", "pics": null, "resp": null, "gmap_id": "0x889a0def06bb67c7:0x7d19660d0ee4fd77"}
{"user_id": "111108756608479176881", "name": "cheesegrits196", "time": 1548844303425, "rating": 5.0, "text": "Dr Kowal and his staff are an extremely caring group. They listen to your issues and then help you improve your situation. The other reviews about his staff being unprofessional are wrong. Everyone in Foley and surrounding areas should feel lucky to have such a resource close by.", "pics": null, "resp": null, "gmap_id": "0x889a0def06bb67c7:0x7d19660d0ee4fd77"}
{"user_id": "102880747195584090030", "name": "ashleigh lagreco", "time": 1526494423066, "rating": 1.0, "text": "Not only did I wait TWO HOURS in the waiting room, I had a 10:00 am appt, everyone that showed up after I did was called, also I tried to get my medicine faxed to a different pharmacy and they told me to call the nurses line, come to find out that they only answer once in the morning and once before they close. The doctor was ABSOLUTELY AMAZING and great at his job, but he should consider getting a new staff.", "pics": null, "resp": {"time": 1526658382903, "text": "Thank you for your feedback.  We understand the frustration of long wait times.  We do have multiple practitioners, and some patients who are called back before others could be patients of different providers. However, we assure you that we take your comments seriously and use them as an opportunity for improvement and training.  Thank you for entrusting us with your ENT treatment."}, "gmap_id": "0x889a0def06bb67c7:0x7d19660d0ee4fd77"}
{"user_id": "112624199624258604103", "name": "Cameron Workman", "time": 1534346706717, "rating": 1.0, "text": "I can't speak on the specialists due to the fact I felt that no one in this place deserved my copay and business, but let me say the front desk has some major issues. Rude and lazy are understatements. The waiting room is something out of a comedy skit. We walked in to folks standing around legitimately elevator level crowded and as I laughed it off a woman said to me that she's seen 6-7 people on the floor multiple times. There's not enough floor space for 5 and nah I'm not going to sit on a dusty carpet floor inch to inch with folks hacking just to see a Dr. for sinus issues. Counterintuitive. Common sense would tell you that anyone good at their practice or caring and about their oath would not subject patients to a space that will literally worsen the conditions they're there with and willing to pay someone to help fix. If this is a purely for profit practice with no sense of compassion I understand business is business; my advice is to work on office space and hire some hard working smiling individuals. Customer service is the beginning and end to all business and if you can't understand that you will never multiply in profit or resources. Simple. Plenty of offices about 30 minutes South, East, and North of here that aren't a scene from an 80s episode of SNL. Have a blessed one!", "pics": null, "resp": null, "gmap_id": "0x889a0def06bb67c7:0x7d19660d0ee4fd77"}
{"user_id": "105401701649219284505", "name": "Donna Earnest", "time": 1551908527118, "rating": 5.0, "text": "They have really helped with my sinus and allergy issues.  I also, really like their helpful staff!", "pics": null, "resp": null, "gmap_id": "0x889a0def06bb67c7:0x7d19660d0ee4fd77"}
{"user_id": "105401701649219284505", "name": "Donna Earnest", "time": 1551908527118, "rating": 5.0, "text": "They have really helped with my sinus and allergy issues.  I also, really like their helpful staff!", "pics": null, "resp": null, "gmap_id": "0x889a0def06bb67c7:0x7d19660d0ee4fd77"}
{"user_id": "108702433597442956680", "name": "G Harvel", "time": 1529980863187, "rating": 1.0, "text": "Absolutely horrendous. The doctor (Kowal) is condescending and inconsiderate. He wastes time. From what I witnessed, he is unprofessional towards the staff.  He did not help me at all, but to be fair I saw a woman who was a nurse and she was very helpful in getting me the right medicine. The work environment was not comfortable for me or the other staff members", "pics": null, "resp": null, "gmap_id": "0x889a0def06bb67c7:0x7d19660d0ee4fd77"}
{"user_id": "110810311979881108866", "name": "CallMe Kryptic", "time": 1562602770336, "rating": 1.0, "text": "This place is terrible. My appointment was for 10:20. I didn’t see the doctor for over an hour past my appointment time!!! Won’t come back!!!", "pics": null, "resp": null, "gmap_id": "0x889a0def06bb67c7:0x7d19660d0ee4fd77"}
