{"user_id": "106481287006020363431", "name": "Angie Judy", "time": 1608735550500, "rating": 3.0, "text": "Monique is the worst customer service representative i have ever spoken with, she says I'm glad I was able to assist you.  She did nothing, would not even let me talk, cut me off, was not helpful in placing an order. The driver TC in my area was exceptionally great service.  I wanted to give 1 star overall but TC deserves recognition (5star service) as well as nurses and physical therapy folks BUT Monique 0stars. The company needs to evaluate their office staff to get better ratings!!!", "pics": null, "resp": null, "gmap_id": "0x888e8fb7b36e8f7f:0x6f44d829e4ce8cd5"}
{"user_id": "102274253839485151595", "name": "Marche Gayle Cotney", "time": 1598042676219, "rating": 5.0, "text": "I have been a customer with Lincare for over a year I have nothing but praise for them the staff the equipment delivery the equipment delivery man they are all so nice and respectful to me and if i need a prescription for anything they get right on it even the people i talk to on the phone I recommend them to everyone I know Thanks you all for great service", "pics": null, "resp": null, "gmap_id": "0x888e8fb7b36e8f7f:0x6f44d829e4ce8cd5"}
{"user_id": "115883110347433953271", "name": "Drew & Alexis Dolan", "time": 1607390309253, "rating": 5.0, "text": "Very sweet people!", "pics": null, "resp": null, "gmap_id": "0x888e8fb7b36e8f7f:0x6f44d829e4ce8cd5"}
{"user_id": "114431608777161288508", "name": "Ashly Barlow", "time": 1580827850798, "rating": 5.0, "text": "The all new staff is fabulous! Very caring and goes out of their way for patients.", "pics": null, "resp": null, "gmap_id": "0x888e8fb7b36e8f7f:0x6f44d829e4ce8cd5"}
{"user_id": "102791219103777089384", "name": "Kay Mata", "time": 1554829370102, "rating": 1.0, "text": "Not a fan. I had an allergy to the mask I was given and was told they would order me another one. Four weeks later I had still not heard anything after calling multiple time. I finally had to go to Precision CPAP (they were amazing, and helpful), and had to buy another mask. Lincare still has not returned my calls regarding the mask and it has been over two months.", "pics": null, "resp": null, "gmap_id": "0x888e8fb7b36e8f7f:0x6f44d829e4ce8cd5"}
{"user_id": "115203366146139942628", "name": "Kris Conner", "time": 1549918219738, "rating": 1.0, "text": "Avoid dealing with this company AT ALL COSTS!  I would have given them zero stars if that was an option.  Lincare is still billing Medicare 7 months after we discontinued service with them.  They are still billing Medicare and harassing our family for payment 5 months after my mother DIED.  SHE DIED AND THEY ARE STILL BILLING MEDICARE and US!  We have spoken to numerous people in numerous Lincare locations, centers, billing offices, etc. and cannot get this resolved.  We have reported them for Medicare fraud and reported them to the Better Business Bureau.", "pics": null, "resp": null, "gmap_id": "0x888e8fb7b36e8f7f:0x6f44d829e4ce8cd5"}
{"user_id": "101313053968099220859", "name": "Felicia O.", "time": 1582637743364, "rating": 1.0, "text": "I was told that someone would call me to order parts as needed. It had been a year and no call. I called last week and was told I would get replacement parts. Nothing! I found out they were charging my insurance company for a year of equipment replacement parts that I’ve been buying off of Amazon. I’m reaching out to a lawyer and my insurance company.", "pics": null, "resp": null, "gmap_id": "0x888e8fb7b36e8f7f:0x6f44d829e4ce8cd5"}
{"user_id": "106839158471980603724", "name": "Mary Fortenberry", "time": 1562784479212, "rating": 1.0, "text": "For 3 weeks I have contacted this office a total of 5 times to come pick up my oxygen equipment that I no longer use. I have been promised repeatedly that they would take care of this. In the meantime I am being charged for  equipment rental that my dr has discontinued. I cannot recommend this company at all. Very frustrating.", "pics": null, "resp": null, "gmap_id": "0x888e8fb7b36e8f7f:0x6f44d829e4ce8cd5"}
{"user_id": "105808926920642197162", "name": "Kim Owens", "time": 1502742162825, "rating": 1.0, "text": "I truly can not even give a half a star for this company. And the only reason why I did because it would not let me post this comment..They do not care about your family members at all. They do not know what they are doing.", "pics": null, "resp": null, "gmap_id": "0x888e8fb7b36e8f7f:0x6f44d829e4ce8cd5"}
{"user_id": "115942410449226602145", "name": "Jenn Lavanish", "time": 1516742236415, "rating": 1.0, "text": "This company has the worst billing department I have ever encountered. Charging for equipment we never received and despite having our insurance they have never filed regarding bills from over 6 months ago.  Local office and billing office give us the run around and do not communicate between systems.  If we were not desperate for oxygen for my husband's medical health we would never use Lincare, and because of this I doubt we will patron them ever again.", "pics": null, "resp": null, "gmap_id": "0x888e8fb7b36e8f7f:0x6f44d829e4ce8cd5"}
{"user_id": "102753358113379978230", "name": "Gene Smith", "time": 1529372483822, "rating": 1.0, "text": "Avoid this company at all costs. Equipment ordered May 3, 2018, insurance approved. It is now June 17, 2018, no equipment, no return calls. Nothing. Truly a sorry excuse for a business. I hope they totally fail and go belly up!", "pics": null, "resp": null, "gmap_id": "0x888e8fb7b36e8f7f:0x6f44d829e4ce8cd5"}
{"user_id": "102198300706397409010", "name": "Tiffany Easterling", "time": 1547132327608, "rating": 1.0, "text": "I would hate to know I had to depend on these people!!!!  Always an excuse, rude, and not dependable!!!!!\nI really don’t have the words to describe how awful dealing with them has been!!!!", "pics": null, "resp": null, "gmap_id": "0x888e8fb7b36e8f7f:0x6f44d829e4ce8cd5"}
{"user_id": "108699333513666355151", "name": "Del Chick", "time": 1527623641671, "rating": 1.0, "text": "I agree with every single comment here! No need for me to add anything, terrible customer service.", "pics": null, "resp": null, "gmap_id": "0x888e8fb7b36e8f7f:0x6f44d829e4ce8cd5"}
{"user_id": "104413607461902032329", "name": "Ivy Abrans", "time": 1492697800472, "rating": 1.0, "text": "Even if you have a big home oxygen tank that cost way to much these people will not work with you to go out of town. Just need a smaller due to a death in family.", "pics": null, "resp": null, "gmap_id": "0x888e8fb7b36e8f7f:0x6f44d829e4ce8cd5"}
{"user_id": "106163523132077958924", "name": "Carol Ford", "time": 1514990996851, "rating": 1.0, "text": "They do not keep up with your equipment.  I left and they will no come get the machine.  They are still trying to charge me a monthly fee.  Awful service.", "pics": null, "resp": null, "gmap_id": "0x888e8fb7b36e8f7f:0x6f44d829e4ce8cd5"}
{"user_id": "112501841386294085491", "name": "chris taylor", "time": 1529956419314, "rating": 1.0, "text": "Rude customer service!!", "pics": null, "resp": null, "gmap_id": "0x888e8fb7b36e8f7f:0x6f44d829e4ce8cd5"}
{"user_id": "115115117289425882478", "name": "Gail Littrek", "time": 1509223754413, "rating": 1.0, "text": "They picked up the equipment in early 2016 but keep charging me like I have their very expensive concentrator.  They recently got paid $400.00 for one month by my insurance company but I called and that was quickly reversed. I don't know how to get them to stop the harassing bills for something I don't owe. Be warned - get a receipt if they pick something up. Don't be fooled by their cordial greetings.", "pics": null, "resp": null, "gmap_id": "0x888c2be5a398eb4f:0x8c8b02365558e739"}
{"user_id": "102753358113379978230", "name": "Gene Smith", "time": 1529371972937, "rating": 1.0, "text": "Equipment ordered and Insurance approved on May 3, 2018 - still waiting as of June 17, 2018. Do not use them. Will not return calls. No help. Avoid at all costs.", "pics": null, "resp": null, "gmap_id": "0x888c2be5a398eb4f:0x8c8b02365558e739"}
{"user_id": "108699333513666355151", "name": "Del Chick", "time": 1537820657232, "rating": 1.0, "text": "WORST Oxygen co. to deal with !  Good luck !!!  None of them seem to know what they’re doing over there! And you will most definitely get the runaround no matter if you call the local office or the billing department! They could care less about their stupid jobs!", "pics": null, "resp": null, "gmap_id": "0x888c2be5a398eb4f:0x8c8b02365558e739"}
{"user_id": "107797910402826000208", "name": "Janet Hadley", "time": 1615859709048, "rating": 5.0, "text": "Great customer service! They were so helpful and went out of their way to get my grandparents everything they needed when they were sick. They went above and beyond to make sure everything was taken care of. I highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x888bfd7d61c4f013:0x3de3eb66498fe339"}
{"user_id": "113235348262263907554", "name": "Falanda Huntley Bright", "time": 1615826494204, "rating": 1.0, "text": "This company doesn't even deserve one star. I'm a double amputee and because my wheelchair was 5years old, they wouldn't even try to order a seat replacement for it. I feel like I was lied to because I went right in same town and had one ordered! I personally feel like it was because of my race! If you have to get medical equipment do not use them if you are an African-American! They will do anything to get more money for new equipment instead of assisting in getting your old one fixed.", "pics": null, "resp": null, "gmap_id": "0x888bfd7d61c4f013:0x3de3eb66498fe339"}
{"user_id": "111213227075488154616", "name": "Kelli Mask", "time": 1601861508035, "rating": 5.0, "text": "The staff is wonderful and very helpful. They always make you feel welcome. I recommend them to everyone.", "pics": null, "resp": null, "gmap_id": "0x888bfd7d61c4f013:0x3de3eb66498fe339"}
{"user_id": "103448672138763008510", "name": "Melvin Miller", "time": 1603133689579, "rating": 5.0, "text": "Great service and always greeted with a smile and informative answers.", "pics": null, "resp": null, "gmap_id": "0x888bfd7d61c4f013:0x3de3eb66498fe339"}
{"user_id": "112258964478821765835", "name": "Mel Palmer", "time": 1598279996302, "rating": 5.0, "text": "Great office to work with for all of your Respiratory and Home Medical Equipment needs.", "pics": null, "resp": null, "gmap_id": "0x888bfd7d61c4f013:0x3de3eb66498fe339"}
{"user_id": "100390013968723929433", "name": "maranda Brice", "time": 1563289530334, "rating": 4.0, "text": "Very understanding and very helpful.", "pics": null, "resp": null, "gmap_id": "0x888bfd7d61c4f013:0x3de3eb66498fe339"}
{"user_id": "107782729610310629897", "name": "Richard Morgan", "time": 1577834998237, "rating": 4.0, "text": "Had the machine I needed!", "pics": null, "resp": null, "gmap_id": "0x888bfd7d61c4f013:0x3de3eb66498fe339"}
{"user_id": "115432945480300339953", "name": "Mary LaGuardia", "time": 1617201779993, "rating": 5.0, "text": "Best pharmacy I have ever used. They are friendly and attentive and they fill faster than anywhere else.", "pics": null, "resp": {"time": 1617332151716, "text": "Thank you so much for your review!  The girls work very hard, it's nice to see them receive the recognition they deserve.😁"}, "gmap_id": "0x888c27cb7f45a087:0xdd31d0072901e9a4"}
{"user_id": "115781290542667760673", "name": "Lauren Hughes", "time": 1617886129027, "rating": 5.0, "text": "Just started using them and so far great service! Love the small town feel❣️", "pics": null, "resp": {"time": 1618250677996, "text": "Thank you very much for the great review.  We really appreciate your feedback it lets us know were on the right track!"}, "gmap_id": "0x888c27cb7f45a087:0xdd31d0072901e9a4"}
{"user_id": "106506304649906991813", "name": "Jessica Joyner", "time": 1606240201847, "rating": 5.0, "text": "Great place! They have moved to the new clinic by Lowes. Just be aware upon entering the clinic, you will need to take your tempature or the lady at the front desk will start barking at you. 😒 Class II medication was available and ready pick up within 10 minutes!!!", "pics": null, "resp": null, "gmap_id": "0x888c27cb7f45a087:0xdd31d0072901e9a4"}
{"user_id": "105290673275692833768", "name": "Aleisha Brown", "time": 1575588452650, "rating": 5.0, "text": "I absolutely adore this pharmacy ❤️. Their so incredibly sweet and are so caring. I’ve never had problems with them. They go over and beyond. Kim Moses is absolutely amazing!!", "pics": null, "resp": null, "gmap_id": "0x888c27cb7f45a087:0xdd31d0072901e9a4"}
{"user_id": "117488539664293012712", "name": "Ashley Wilson", "time": 1569540766797, "rating": 1.0, "text": "As a new resident in Wetumpka I wanted to give back to local businesses and use this pharmacy for all of my prescription needs. I went in to drop of my prescription and instead of just being told when it would be ready I was asked all of my medical history and was told they would need to be verified with the doctor, even though I had just turned in my prescription written by my doctor. I felt like I was being judged for the types of medications I am taking. The owner should worry more about being a friendly and helpful pharmacist, rather than a judging pharmacist trying to act like he is my doctor. I will never go back and will take my business to a different local pharmacy.", "pics": null, "resp": null, "gmap_id": "0x888c27cb7f45a087:0xdd31d0072901e9a4"}
{"user_id": "109490993868512242962", "name": "Abby Traylor", "time": 1565364648208, "rating": 5.0, "text": "Love this pharmacy & the staff is always super nice. Always good to have a hometown feel when you’re at a place of business!", "pics": null, "resp": null, "gmap_id": "0x888c27cb7f45a087:0xdd31d0072901e9a4"}
{"user_id": "114258426861410546021", "name": "Carter Taunton", "time": 1565364252651, "rating": 5.0, "text": "My favorite hometown pharmacy ! They Are more like a family than a business and I can appreciate that !", "pics": null, "resp": null, "gmap_id": "0x888c27cb7f45a087:0xdd31d0072901e9a4"}
{"user_id": "110367644934825758229", "name": "Michelle Swaney", "time": 1575589991350, "rating": 5.0, "text": "Been at Wetumpka Pharmacy ever since it opened love the hospitality. Kim and Johnny go over and beyond to make sure everyone is taken care", "pics": null, "resp": null, "gmap_id": "0x888c27cb7f45a087:0xdd31d0072901e9a4"}
{"user_id": "110447340386361769461", "name": "Aaron Moses", "time": 1565286932732, "rating": 5.0, "text": "Very friendly staff and i was in and out of there in no time.", "pics": null, "resp": null, "gmap_id": "0x888c27cb7f45a087:0xdd31d0072901e9a4"}
{"user_id": "114771975973941631784", "name": "Michelle Hancock", "time": 1617810688127, "rating": 5.0, "text": "The ladies that helped me at this place are awesome. I had a situation where I needed my new bipap machine at the last minute due to changes I found out about in my insurance. I was going to have to pay more for my equipment if I did not get it that day. Megan and Savannah hit a home run and were able to squeeze me in and had the exact equipment in store that I wanted! They normally need more than a day to handle new equipment, but told me they were willing to try due to my situation and they really worked hard to make this all happen. I highly recommend using McAbee Medical as their employees really care about their customers.", "pics": null, "resp": null, "gmap_id": "0x8862869e443c0ca3:0xf6fef2b894ed7d1c"}
{"user_id": "107138918961801353660", "name": "Irfan Rashid", "time": 1620506342713, "rating": 1.0, "text": "Terrible experience. Will not recommend this place to anyone. Purchased a compression stocking for $80 and it ripped 10 minutes later when putting it on. Went back to the store 10 minutes later and they refused to refund or exchange for an identical pair. Not good customer service at all.", "pics": null, "resp": null, "gmap_id": "0x8862869e443c0ca3:0xf6fef2b894ed7d1c"}
{"user_id": "100707286428916198066", "name": "randee deason", "time": 1608412980500, "rating": 1.0, "text": "Would not recommend, employee seemed stressed and not engaged upon first contact. It was over a month after I heard back from them.", "pics": null, "resp": null, "gmap_id": "0x8862869e443c0ca3:0xf6fef2b894ed7d1c"}
{"user_id": "116437292437623067167", "name": "Donna Turcotte", "time": 1587484405447, "rating": 1.0, "text": "Wouldn’t fill a stocking prescription without talking to my dr. There was no reason to talk to my dr. Went down the road and had no problems walked out with my stockings. Should have known better by the way they treated my husband when he was alive. Not very nice people.", "pics": null, "resp": null, "gmap_id": "0x8862869e443c0ca3:0xf6fef2b894ed7d1c"}
{"user_id": "106322593233779536347", "name": "Kevin Breuers", "time": 1518718274561, "rating": 1.0, "text": "Went to them for a CPAP.  If you want a company that does not return calls, and forces you to track down clinical data while requiring you to also serve as the middle liasion for the Dr and insurance company, this company is for you.  If you want a company to do all this for you and fit and give you your CPAP in a day, go to Southern Medical Equipment in Huntsville.", "pics": null, "resp": null, "gmap_id": "0x8862869e443c0ca3:0xf6fef2b894ed7d1c"}
{"user_id": "103709160974803659364", "name": "Danielle Hays", "time": 1624844382865, "rating": 1.0, "text": "Worst experience we have had with a drug company. Never received our supplies on time and constantly had to hassle them to send out our supplies. I voiced my concerns to the lead coordinator Jennifer many times and she never apologized or empathized with us. DO NOT USE!  We are now with Southeast Diabetes and so far have been pleased.", "pics": null, "resp": null, "gmap_id": "0x8888580f86ea2b4d:0xe603ec70e25be40c"}
{"user_id": "104878218511490906829", "name": "Charlotte Cook", "time": 1591986837429, "rating": 5.0, "text": "Such a good place to buy MED supplies!!  Convenient, nice people, and offer such a variety of Everything!!!  Too much to list!!  My brother in law had knee replacement & needed a Walker before.discharge...It was ready &  loaded in just a few minutes ...and by a smiling pretty staff member.  THANKS Y'ALL", "pics": null, "resp": null, "gmap_id": "0x8888580f86ea2b4d:0xe603ec70e25be40c"}
{"user_id": "106255574529486517292", "name": "Corey Mahaffey", "time": 1597673880185, "rating": 5.0, "text": "Very great customer service sweet people. Been in business for along time. Glover's are a great family honest loyal people", "pics": null, "resp": null, "gmap_id": "0x8888580f86ea2b4d:0xe603ec70e25be40c"}
{"user_id": "116544563449743974069", "name": "Holly Stiles", "time": 1589296280662, "rating": 1.0, "text": "Had a great experience at first but slowly the customer service dwindled. Julie was always helpful and kind. Jennifer, not so much. Our last interaction she told me that I might need to find another pharmacy to fill my DME needs, after I questioned the length of time it took to file claims with BCBS. She thought I wouldn’t be able to find a supplier who could file in a timely manner. Guess what? I found one who files in less than a week and doesn’t create a backlog of claims for me to monitor. Thanks for pushing me in that direction, Jennifer. I’ve taken over $9,000 in business elsewhere.", "pics": null, "resp": null, "gmap_id": "0x8888580f86ea2b4d:0xe603ec70e25be40c"}
{"user_id": "110620539195023731140", "name": "Beth Tidwell", "time": 1603399141400, "rating": 2.0, "text": "Long wait times. Don't fill meds when they are called in. \"Lost\" meds that were called in. And they're more expensive than other pharmacies.", "pics": null, "resp": null, "gmap_id": "0x8888580f86ea2b4d:0xe603ec70e25be40c"}
{"user_id": "112817116282184079579", "name": "david uptain", "time": 1584219319075, "rating": 5.0, "text": "I have always been treated with respect and they're always ready to help with any problems that I have  I've been using Ken Glover drugs since they first opened I am well satisfied with their business", "pics": null, "resp": null, "gmap_id": "0x8888580f86ea2b4d:0xe603ec70e25be40c"}
{"user_id": "101749840330086703426", "name": "Elizabeth Patton", "time": 1580226845890, "rating": 1.0, "text": "Contacted this pharmacy about a breast pump provided by BCBS.  Was promised that they would deliver it a month before the due date but it never arrived.  I have called numerous times with no one picking up, been on hold over ten minutes each time, and left several messages with no return call. Awful service, awful customer service.  I was hoping to work with a local small business but this isn't how you do business.  I'll have to call St. Vincent's in Birmingham now.", "pics": null, "resp": null, "gmap_id": "0x8888580f86ea2b4d:0xe603ec70e25be40c"}
{"user_id": "106678801593542207559", "name": "Caren Brown", "time": 1546067875525, "rating": 1.0, "text": "I would give 0 stars if that was an option but it's not. They will not return calls. I called to order my daughter's CGM supplies, they said would ship out the next day, a week later still haven't gotten them. Left 2 messages today and no return call. This has happened in the past too. Hoping to find another supplier.\nPoor customer service.", "pics": null, "resp": null, "gmap_id": "0x8888580f86ea2b4d:0xe603ec70e25be40c"}
{"user_id": "101988505643026179687", "name": "jill billions", "time": 1515523883473, "rating": 1.0, "text": "Have gotten Durable Medical Equipment for my daughter with CP here for years. They used to be very good. I don't know what has changed but they must be very busy. No longer return phone calls, can't answer questions about bills,..have been trying to reach them over two weeks for a billing question. Needed a replacement tube for my daughter who is fed through a g-tube into her stomach and it took a month. Too bad. down hill.", "pics": null, "resp": null, "gmap_id": "0x8888580f86ea2b4d:0xe603ec70e25be40c"}
{"user_id": "118338073249680736466", "name": "Samantha", "time": 1541622377800, "rating": 1.0, "text": "Very difficult to get in contact with. Tried for days to get a hold of someone to fill my Dexcom transmitter order with no response during their office hours, emergency line was also sent to an unanswered voicemail. I consider my CGM a lifeline for me. My blood sugars are very difficult to manage without it, and I've been \"flying blind\" for days now. Will be switching to a different company. Not pleased with the lack of customer service from the Ken Glover employees.", "pics": null, "resp": null, "gmap_id": "0x8888580f86ea2b4d:0xe603ec70e25be40c"}
{"user_id": "105488585442769126086", "name": "Tracy Thrasher", "time": 1523113167733, "rating": 5.0, "text": "I love love love it here they have great stuff and are so kind you can’t ask for more", "pics": null, "resp": null, "gmap_id": "0x8888580f86ea2b4d:0xe603ec70e25be40c"}
{"user_id": "113511827635076131817", "name": "Mys D", "time": 1480269429769, "rating": 5.0, "text": "Fast  and  friendly  service .", "pics": null, "resp": null, "gmap_id": "0x8888580f86ea2b4d:0xe603ec70e25be40c"}
{"user_id": "113883013913425097507", "name": "Erica S", "time": 1529727484677, "rating": 5.0, "text": "Amazing Pharmacy, employees!!", "pics": null, "resp": null, "gmap_id": "0x8888580f86ea2b4d:0xe603ec70e25be40c"}
{"user_id": "102807110302686839197", "name": "Diane Natale", "time": 1596742884994, "rating": 3.0, "text": "They can never find my prescription. I am always at the Sleep Center when they fax my prescription over.  I have to call and ask the Sleep Center to fax them another prescription. Time consuming.", "pics": null, "resp": null, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "100061593155281889111", "name": "Tony Blankenship", "time": 1583439410650, "rating": 5.0, "text": "Staff wonderful and very helpful.  Margo did great job.  Good expression looking forward to working with these guys.", "pics": null, "resp": {"time": 1583443478168, "text": "Thank you so much for choosing Medlogic.  We look forward to working with you as well."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "108095796035458558196", "name": "Jason Paul", "time": 1542140644594, "rating": 5.0, "text": "I live a long distance from this location and was there to see my Dr who referred me here. Everyone was so nice and accommodating. They made sure I was taken care of all in one visit and made getting my new CPAP a pleasant experience. The staff was very knowledgeable and extremely nice. I highly recommend anyone using them.", "pics": null, "resp": {"time": 1542142729196, "text": "Thank you for choosing Medlogic. We strive to make sure every patient has a positive experience. Thank you again for allowing us to take care of your CPAP needs."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "111790554795915948891", "name": "Kevin Henderson", "time": 1554989377723, "rating": 5.0, "text": "Much love for Medlogic! I arrived in town aaaaaand, sure enough, I forgot my power supply for my CPAP.  I called Medlogic to see if I could purchase a power supply, oh and it was 5 min before closing,  after explaining my situation they said they would wait for me to arrive at their store (huge relief !).  After they found out I was only in town for two days before heading home, they told me I could simply borrow the power supply and return it before leaving town.  I can honestly say that I have experienced customer service like this in such a long, long time! Y'all are such a blessing, and I'm very grateful!", "pics": null, "resp": {"time": 1555064851507, "text": "It was our pleasure to help. Thank you for the kind words."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "111334775645572059024", "name": "Dan Jones", "time": 1517582892553, "rating": 5.0, "text": "After waiting for almost a week for another provider I called Medlogic. Great choice!! I had my new CPAP the same day. Cassandra was great! Knowledgeable and efficient. Can't say enough good things. Highly recommend Medlogic. Thank you !!!!", "pics": null, "resp": null, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "109818105006541160121", "name": "Cheryl Ivey", "time": 1550243122937, "rating": 5.0, "text": "Using Med Logic at UAB Medical West.  Had all of my supplies and so I didn't have to drive down to Hwy 280!  The best part was the personalized service on getting happy with the CPAP which is priceless.  I haven't felt this good in years!  Thank you all so much.  Excellent!", "pics": null, "resp": {"time": 1550243914543, "text": "Cheryl, thank you for your kind words and for trusting Medlogic with your CPAP therapy."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "110415395050525563526", "name": "Benita Higginbotham", "time": 1582312564241, "rating": 5.0, "text": "Wonderful place to go for medical supplies. Very professional  friendly and knowledgeable.", "pics": null, "resp": {"time": 1582313884047, "text": "Thank you for allowing us to take care of you."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "111766140048581638984", "name": "Gordon Zane", "time": 1565048975673, "rating": 1.0, "text": "Vary sad that was unable to purchase supplies and new head gear from Medlogic. Was wanting to try use a new place and share a new experience . People were very friendly but refused to sell me anything without a prescription. So I left went down to my other choice on Hwy 280 and bought everything I needed without prescription. Spent over $400 dollars that I could of spent at  Medlogic. I still refused to figure out why a business would turn down business when in fact you and order the same products on line🤔. I call my Dr. who said why would you need a scrip when paying cash and it’s not going against your insurance. Apparently someone didn’t ask the right question and assumed it was insurance which you do need a scrip. Sorry for their loss and and business. Reply: You do not need prescription for CPAP supplies, only for MACHINE. READ federal guide lines. Supplies are Not regulated.", "pics": null, "resp": {"time": 1565046424588, "text": "I would like to thank you for coming in today. Like we explained to you earlier, the masks are a prescription only item. Due to federal regulations, we  must  have a prescription on file to fulfill an order,  even to a private pay customer.  If you look at the package that your mask comes in, you will notice the \"Rx only\" label .  My apologies if you felt like we didn't want to help you. We just try to follow the rules and do the right thing so that we have longevity in the CPAP world. Our number one priority is always to help with the patient's compliance and achieve a better quality of life via their CPAP therapy."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "114702443519501477620", "name": "Jennifer Nolan", "time": 1515424957919, "rating": 5.0, "text": "We called and were able to get an appointment the same day.  The staff was very friendly and helpful.  They also had a great selection of equipment.  I'm so glad we chose them.", "pics": null, "resp": {"time": 1515608576370, "text": "THANK YOU JENNIFER, IT WAS OUR PLEASURE!"}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "107573445381164469810", "name": "Karla Thomas", "time": 1550349476606, "rating": 5.0, "text": "Thank you Medlogic, you are the best!  With Medlogic and Med West sleep clinic working together you both definitely went above and beyond what anyone else could do for me!  My stupid obstructive and central sleep apneas are the hardest and most expensive to treat and you did it inexpensively and quickly!!  You definitely saved my life!  Thank you Kelly and the guy on the phone, sorry I forgot your name... that memory loss from sleeping without breathing , hopefully soon to breathe and sleep comfortably. You are the best!!! Thanks for working your magic for me!  Not a 'paid for' review either!", "pics": null, "resp": {"time": 1550228883817, "text": "Farrar (clinic) and Kelly (guy on the phone) are great! Thank  you so much for trusting Medlogic with your care."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "114204032019116028730", "name": "evelyn bryant", "time": 1512681475852, "rating": 5.0, "text": "I don't know how I would have gotten through without the help of Farrah! She is so helpful and knowledgeable, she explained how to use everything I had and even answered some questions when I got home and had more. Thanks so much got having a caring staff!!", "pics": null, "resp": null, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "112533226777527681748", "name": "MeanMarceline Vampirequeen", "time": 1540927089301, "rating": 1.0, "text": "If this was the last place I could get CPAP supplies I would rather die in my sleep than to give them a single dollar of my money. All these 5 star reviews are paid for. The staff was so rude the office manger was hiding and they are tripling the price of their supplies.", "pics": null, "resp": {"time": 1540929560475, "text": "I apologize that you feel this way.  Per your phone conversation with our office, you had a piece broken on your mask. Since you weren't an existing patient we had no way of knowing what mask you have. We recommended that you bring in your mask so we could see if we had any parts to accommodate your needs.  If you recall, no pricing was ever discussed because we didn't know what piece you needed.  You stated you had driven a long way and asked where the manager was.  I am in fact the manager and I walked up to the counter when I finished the phone call I was on.  I walked up to intercede and you stated you would not be getting supplies from us but would take our candy out of the candy bowl.  I'm so sorry you felt like you had a less than positive experience.  We strive to meet all patient's needs."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "102998320374562040844", "name": "Wally Conway", "time": 1513987947728, "rating": 5.0, "text": "They called the same day they  got my prescription. I had an appointment the next day with very helpful staff! They explained the usage and care very thoroughly. This is the place I will recommend to friends and family!", "pics": null, "resp": {"time": 1514312475155, "text": "Thank You Mr.Conway! We look forward to providing great service to you and your family for many years to come!"}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "100442895061753350235", "name": "Henry Ricks", "time": 1550250259225, "rating": 5.0, "text": "I had a very profitable meeting with the Medlogic CPAP representative who did a through job of explaining the machine features/operation, supplies, billing, and support from the local office and ineractive internet functionality that the machine has. I went home looking forward to getting the old machine in storage and the new machine up and running. Best of all, I can now start using my So clean device which didn't work with my older CPAP machine.", "pics": null, "resp": {"time": 1550251550929, "text": "Thank you so much for the wonderful compliment. We strive to make each patient feel comfortable and confident when starting their CPAP therapy."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "107253215794354219666", "name": "Rod Peeks", "time": 1553108924210, "rating": 5.0, "text": "MedLogic did a yoeman’s job of helping me with my CPAP needs. Stacey and Josh went above and beyond in their efforts to help me have a successful experience. Thank you.", "pics": null, "resp": {"time": 1553137396005, "text": "We are so pleased that you had a great experience! Please let us know how we may assist you in the future ."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "109029184218490107143", "name": "Donna Morgan", "time": 1534960084332, "rating": 5.0, "text": "Kelly was an excellent individual to work with for my CPAP. He explained everything in great detail. I feel very comfortable in knowing I can count on him for my CPAP needs.", "pics": null, "resp": {"time": 1534960945439, "text": "Thank you for choosing Medlogic. We look forward to helping you with your sleep management."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "103838025172920458718", "name": "Koodan 77", "time": 1547852802788, "rating": 5.0, "text": "Very nice and friendly staff. Handled themselves professionally and helped me get what I needed quickly", "pics": null, "resp": {"time": 1548070846946, "text": "Michael, thank you for your kind review. As always, please feel free to call us if you ever have any questions."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "100169475061859826309", "name": "Joanne Anthony", "time": 1534994247903, "rating": 5.0, "text": "Everyone was friendly and knowledgeable about the products.  I was fitted for my new CPAP machine and had all the paperwork finished up in almost no time at all.  Definitely the place to go for your CPAP needs.", "pics": null, "resp": {"time": 1534994988141, "text": "Thank you so much for choosing us as your sleep management company! We look forward to servicing you with all of your Cpap needs In the future."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "115299172007458503358", "name": "Patty Bryant", "time": 1512682088027, "rating": 5.0, "text": "I felt right at home with the staff. Carla,Josh and Farrar are the best. They are knowledgeable and friendly. I especially appreciate the fact that you are educated on the operation and care of your machine before you leave.", "pics": null, "resp": null, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "102676517678953621662", "name": "Amy Persich", "time": 1512680111562, "rating": 5.0, "text": "Staff is amazing and so knowledgeable. They really take their time in explaining everything and making sure you understand as well. Selection of products was great as well.", "pics": null, "resp": null, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "108960186532086264063", "name": "Valerie T Porter", "time": 1536772841909, "rating": 5.0, "text": "Great experience!! The young lady that gave me instructions was pleasant, knowledgeable and thorough. I really enjoyed her humor.", "pics": null, "resp": {"time": 1535651294967, "text": "Thank you for using Medlogic! We look forward to working with you in the future!"}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "112994590836254276648", "name": "Jan Darby", "time": 1550620208960, "rating": 5.0, "text": "Pleasant experience. Feel much better about care that I will receive from needing CPAP supplies.", "pics": null, "resp": {"time": 1550621839008, "text": "Thank you for your kind words. We look forward to taking care of you and your CPAP needs."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "103372736870767370524", "name": "Luci Tucker", "time": 1533923129291, "rating": 5.0, "text": "The employees are very kind and helpful.  They answered all of my questions and made me feel as ease.", "pics": null, "resp": {"time": 1533929092776, "text": "Thank you for choosing Medlogic."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "102021962943186111247", "name": "Sonia Cardwell", "time": 1553634134139, "rating": 5.0, "text": "Friendly service and extremely helpful answering all my questions. Margo was awesome!", "pics": null, "resp": {"time": 1553635284124, "text": "Sonia, thank you so much for allowing Medlogic to take care of you. Please let us know if we can be of further assistance."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "105479060192586942072", "name": "Mizz Tanya", "time": 1542121518923, "rating": 5.0, "text": "I will recommend Medlogic to anyone with their CPAP needs.  I loved the staff as they were very much helpful in me selecting the right CPAP machine along with all the items needed to go along with my machine.", "pics": null, "resp": {"time": 1542123296371, "text": "Thank you so much for allowing Medlogic to take care of you."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "118041168786900554137", "name": "Sandy Roberson", "time": 1542386367210, "rating": 5.0, "text": "Margo did a great job explaining everything about my machine! Praying for a good nights sleep!", "pics": null, "resp": {"time": 1542388204290, "text": "Thank you so much for allowing Medlogic to take care of your CPAP needs. Here's to your good night sleep."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "104800768358251210334", "name": "Alisa Smith", "time": 1534873590195, "rating": 5.0, "text": "The staff is extremely helpful and take their time to assist you in selecting the best products for your needs.", "pics": null, "resp": {"time": 1534874290612, "text": "Thank you Alisa! We look forward to providing you in the future with 5 star care."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "113237867292351956125", "name": "Christa Wolfe", "time": 1534790410099, "rating": 5.0, "text": "The staff was very friendly and helpful.  They have  a great selection of equipment to chose from.", "pics": null, "resp": {"time": 1534791192844, "text": "Thank you for your kind words. We are always here for you if you have any questions."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "101421321187241993315", "name": "JAMES B", "time": 1534941681438, "rating": 5.0, "text": "Thorough review  and demonstration of CPAP use. Good communications. Recommend.", "pics": null, "resp": {"time": 1534942803515, "text": "Thank you choosing Medlogic. We look forward to servicing you with five stars in the future."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "115187083703835341100", "name": "Ginny Milton", "time": 1534784419242, "rating": 5.0, "text": "Farrar King and Carla Shelton were excellent in training me for my new cpap. They both spent extensive time to make sure I understood the care and use of my cpap. They both offered phone support anytime.\nI would highly recommend patients to this company . They take the time to listen and  understand your particular problems and can offer advice to resolve any needs you may require.", "pics": null, "resp": {"time": 1534784561923, "text": "Thank you so much for your kind comments. We want each patient to feel like they are our only one and not just a number in our computer. And please don't hesitate to call us with any questions or concerns. We are always here to offer any assistance that is needed."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "103024080882080501975", "name": "Nancy Sailer", "time": 1513789003468, "rating": 5.0, "text": "Great products, easy to use, and staff very knowledgeable. Josh took the time to answer our questions and was very thorough with education of products.", "pics": null, "resp": {"time": 1513886220704, "text": "THANK YOU NANCY FOR BEING A GREAT CUSTOMER AND GIVING US AN OPPORTUNITY TO WORK WITH YOU!"}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "105431874069108938299", "name": "John Sardin", "time": 1551991937689, "rating": 1.0, "text": "Approximately, two weeks ago I came in to look at the newer machines because mine was 6 yrs. old and stopped working.  UAB Sleep Center faxed my prescription over. Two days go by and no called asking me to come in. I called and they tell me I needed to see my doctor first. I had no problem with that, but someone should have called and informed me. I saw my doctor and he sends my info over. Two days go by and no call back. UAB called in for me and they were told they needed more info. UAB asked why no one called to inform them and you all did not give a good answer. Even though info was missing, callbacks are vital and it shows good customer service and concern for the customer.  UAB sent my info to OxyMed and I received a call the very next morning (today) to come and pickup my CPAP. They were very professional on the call and my visit there was awesome.", "pics": null, "resp": {"time": 1552301566226, "text": "My sincerest apologies for the lack of communication. While we do have a record of the requests for additional documentation from your doctor  and sleep lab we failed to keep you informed on the status of your documentation retrieval. We always strive to give each patient five star service and again I'm sorry that we fell short.  I'm glad you  were able to get taken care of and I  will use this situation and your comments as a learning tool with my staff."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "113558829410141992169", "name": "susan harrison", "time": 1537569850935, "rating": 5.0, "text": "It was great Farrah was very nice and informative on explaining the c pap process", "pics": null, "resp": {"time": 1537571723656, "text": "Thank you for allowing Medlogic to take care of your CPAP therapy."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "103396601688105387264", "name": "Donna Daniel", "time": 1537823234942, "rating": 5.0, "text": "Stacy and Margo did a great job explaining the machine and how to use it properly.", "pics": null, "resp": {"time": 1537824091935, "text": "Thank you so much for your kind remarks. Thank you for choosing Medlogic."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "112257267206586503720", "name": "Lady Cole", "time": 1526651662789, "rating": 5.0, "text": "Thank you so much for explaining to me everything I needed to know about my cpap machine.", "pics": null, "resp": {"time": 1526652442619, "text": "Thank you so much for Intrusting us in your care!! We look forward to providing you with a great care!"}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "107640787416179852493", "name": "Camilo Gomez", "time": 1539709741837, "rating": 5.0, "text": "Excelent service. Margo was very helpful, patient and profesional.", "pics": null, "resp": {"time": 1539710451576, "text": "Thank you so much and thank you for choosing Medlogic for all of your Pap needs!"}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "110420083049680754992", "name": "Michael Scott", "time": 1538600733635, "rating": 5.0, "text": "Excellent service.  Especially the follow up. Clearly a commitment to serving their customers.", "pics": null, "resp": {"time": 1538603178038, "text": "Thank you for allowing us to help you with your CPAP therapy."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "112983834230242094075", "name": "Miranda Pate", "time": 1540402068743, "rating": 5.0, "text": "Everyone was very friendly and informative. I highly recommend this company.", "pics": null, "resp": {"time": 1540402711308, "text": "Thank you so much for allowing Medlogic to take care of you."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "117365253746768062478", "name": "Joshua Velo", "time": 1512676183019, "rating": 5.0, "text": "They are very cooperative, they are extremely respectful and know what they are doing.Just in general are very good people definately deserves a five out of five stars.", "pics": null, "resp": null, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "108615456526840998423", "name": "Patricia Spalding", "time": 1545417021014, "rating": 5.0, "text": "Staff was very friendly and answered all my questions to my satisfaction. I'll use them from now on for CPAP needs.", "pics": null, "resp": {"time": 1545417815844, "text": "Thank you Patricia! We look forwards to our new relationship with you! Happy Holidays!"}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "104552225421483706932", "name": "Philip Jaffe", "time": 1546450169839, "rating": 5.0, "text": "Very easy process to get set up. Staff explained everything very well.", "pics": null, "resp": {"time": 1546462940613, "text": "Thank you for allowing Medlogic to take care of your CPAP therapy."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "109496070993183712125", "name": "Keith Carlin", "time": 1549325182905, "rating": 5.0, "text": "Best service. Very knowledgeable.", "pics": null, "resp": {"time": 1549326254881, "text": "Thank you for allowing Medlogic to take care of you !!!"}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "114749057444648595307", "name": "Andreyuanna Briggins", "time": 1533915335050, "rating": 5.0, "text": "Margo was awesome!\nThank you so much for everything!", "pics": null, "resp": {"time": 1533918291678, "text": "Thank you for trusting us with your CPAP needs."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "107054100603750464626", "name": "Esther Vaughan", "time": 1546977026633, "rating": 5.0, "text": "Easy access and quick, friendly service.\nVery clear explanation of device and options.", "pics": null, "resp": {"time": 1546977745707, "text": "Thank you Esther for your kind review and allowing Medlogic to take care of your CPAP needs."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "115947553296474749291", "name": "rebecca Beacham", "time": 1516392456169, "rating": 5.0, "text": "Very helpful. The waiting area was super comfy", "pics": null, "resp": null, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "103772026577371185703", "name": "Keelie Yowe", "time": 1512676159134, "rating": 5.0, "text": "Farrar and Carla are very knowledgeable in this business. They are also very helpful and kind. Thank You bham for the best medlogic branch!", "pics": null, "resp": null, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "103940461880312762213", "name": "C S", "time": 1512685461268, "rating": 5.0, "text": "The whole experience was truly amazing. We laughed, we cried. I'm going to go back there again and again.", "pics": null, "resp": null, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "103724561465488612994", "name": "Bonita Crowe", "time": 1513697311893, "rating": 5.0, "text": "Been with 3 companies due to insurance providers & Medlogic is the most thorough  & helpful.", "pics": null, "resp": {"time": 1513718111313, "text": "Thank you! We try very hard!"}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "111365942437136041224", "name": "Jennifer Johnson", "time": 1512677773904, "rating": 5.0, "text": "The customer service and knowledge of all the equipment from the people at MedLogic is phenomenal and above all the rest!! Thank you for taking care of my family!!", "pics": null, "resp": null, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "115255362658955605172", "name": "Faye Holtzclaw", "time": 1533928172543, "rating": 5.0, "text": "Outstanding customer service!!!  Looking forward to future interactions.", "pics": null, "resp": {"time": 1533934622137, "text": "We are so happy we were able to provide service to you!! Looking forward  to our new relationship!!!"}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "113438229360468439844", "name": "Greg Mckinney", "time": 1545264252193, "rating": 5.0, "text": "The staff was friendly and very helpful.", "pics": null, "resp": {"time": 1545305839337, "text": "Thank yo so much Mr. McKinney for allowing Medlogic to take care of you."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "113701611192717190830", "name": "Erica Meadows", "time": 1512675138360, "rating": 5.0, "text": "So helpful and the staff is super good looking!", "pics": null, "resp": null, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "114879857341523076814", "name": "dipdive", "time": 1552057621124, "rating": 5.0, "text": "Very knowledgeable and super friendly.", "pics": null, "resp": {"time": 1552300732517, "text": "Thank you so much for allowing Medlogic to take care of you."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "117108561579017028778", "name": "Jason Seavers", "time": 1534782564501, "rating": 5.0, "text": "Flawless service and follow through", "pics": null, "resp": {"time": 1534783350543, "text": "Thank you so much for choosing Medlogic."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "113062680036713344966", "name": "Summer Ransom", "time": 1512674625280, "rating": 5.0, "text": "Josh was so helpful!", "pics": null, "resp": null, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "100765876721359343859", "name": "Tyler Gentry", "time": 1512677534144, "rating": 5.0, "text": "I could not have ask for better customer service!!", "pics": null, "resp": null, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "103974140704658980595", "name": "Nathaniel Br", "time": 1539042671786, "rating": 5.0, "text": "Service was excellent.", "pics": null, "resp": {"time": 1539046255094, "text": "Thank you for choosing Medlogic."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "111137022955798564060", "name": "Jeff Wallace", "time": 1534368698241, "rating": 5.0, "text": "Margo is Awesome!", "pics": null, "resp": {"time": 1534466430580, "text": "Thank you Jeff!! We think she is pretty terrific as well! We look forward to working with you!"}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "116900259880909293075", "name": "Dennis Wallace", "time": 1540497454492, "rating": 5.0, "text": "Great service", "pics": null, "resp": {"time": 1540502788499, "text": "Dennis, thank you for letting Medlogic help you with your CPAP."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "117425569940566225770", "name": "Cyndy Dowling", "time": 1473018957878, "rating": 2.0, "text": "I was pretty much directed to this merchant by my MD. I had a broken bone in my foot. A friend drove me from my MD visit over to this merchant  and I hobbled inside.  I knew I would need to present my insurance information cards and make a payment.\n\nThe employee desks are situated at the very back of the room beyond the product displays. \"For sale\" reclining and lift chairs are located to the left,  then there is a huge group of walkers, wheel chairs, bathing safety seats etc located in the middle section of the store. Neither employee visible got up when we entered the store.\n\nAn employee called out something to us from the desk area.\n\nMy friend encouraged me to sit in the first reclining chair but as it was a floor product I hesitated to do this and  continued towards the back of the store towards the employees.  One of the employees finally said, \"you can sit in one of those chairs\".\n\nI AM trying to make a long story short.\n\nI ended up buying a cast boot, but they informed me that they did not take my insurance so I paid out of pocket for the item.\n\nThe first boot they tried on me was way too big and they quoted me a price of $89.00 for the item.\n\nIn the end they sold me a higher valued, smaller product at close to the price they originally quoted, so I will give them credit for honoring the price they quoted. That is why 2 stars rather than 1 star. (I think the real reason I got the lower price was because my friend advocated for me regarding the price. I could not hear what was said,  because I was still sitting over against the wall in a recliner,  and my friend was over at one of the staff desks.)\n\nThe staff did not appear to know or understand their products very well and did not really explain much about the boot I bought. They were not gentle or accommodating of my injured foot which was covered in a sock, but swollen and quite painful. The boot was not put on my foot/leg correctly. The tops of the two rigid metal posts that are covered in a hard, rough, scratchy Velcro product were up above the padding of the boot.  After a bit of struggling by the employees, I really just wanted to finish the process and get out of the store. My foot hurt and nothing they were doing was helping at all.  Later, after I got home,  my husband and I looked at the picture on the cast boot box.  The picture clearly showed the boot padding extending up above the two rigid metal posts.\n\nThe posts had already sanded away the skin on both sides of my calf/shin. My husband reassembled the boot correctly and put it back on my foot after putting bandages on the two sores on my calf.\n\nThis store needs to rethink the showroom set up. The employees and their desks should be located near the door.  I realize that their product storage and office space are located at the back of the store but they ARE selling medical devices for customers who probably have some kind of limitation. The employees are the ones who should be making the trek across the store. It might also be a good idea for them to have a wheelchair available just inside the door that they could direct a customer to, if needed,  as soon as they entered.  This would be another advantage to the employees being stationed near the door.\n\nLet me be clear. No one was rude to us, but, no one seemed very concerned either. The first girl who tried to help us must have been new and was not familiar with the  boot products.\n\nThis necessitated a second, presumably more experienced staff member also assisting us. The second staff member was pretty obviously not pleased that she had to become involved and was very abrupt with the first staff member.\n\nAll in all it is not an experience I would repeat.\n\nAfter I got home and was finally comfortable with the cast boot, I looked up cast boots on Amazon and I could have gotten a comparable or even better product at half the price. And, Amazon has great customer service.", "pics": null, "resp": null, "gmap_id": "0x886266179711a56d:0x909b87d6f07bead6"}
{"user_id": "112427367387044258202", "name": "Ivan W", "time": 1512756017403, "rating": 5.0, "text": "Needed a wheel chair and a knee cart for a friend who broke her ankle. All Star personnel were friendly, competent, and helpful, and the equipment was like new. I recommend All Star to others.", "pics": null, "resp": null, "gmap_id": "0x886266179711a56d:0x909b87d6f07bead6"}
{"user_id": "105124345556377776363", "name": "Aaron Page", "time": 1508880473931, "rating": 1.0, "text": "I would give them a negative star but that is not an option.  I actually called down to see if they took Tricare Reserve Select, for CPAP supplies, before driving by.  I was told that they do and I just needed to drop by and pick up my supplies.  Once I got there I am sent to the back to talk to a lady where I am informed that I need to produce a great deal of paperwork besides just the prescription.  I explained that all the other times I have done this, in over 3 other locations in 2 other states, that I never had to go through this.  I was told that I was wrong.  So, I can only assume the that prior times, for over 3 years, has caused for those businesses to eat the cost.  Somehow I am just going to go with these guys have zero clue.", "pics": null, "resp": null, "gmap_id": "0x886266179711a56d:0x909b87d6f07bead6"}
{"user_id": "112100658644692013988", "name": "Peggy Cobb", "time": 1551982387731, "rating": 1.0, "text": "Went today to get a new cpap mask. Sign on the door says “closed until further notice “. I asked someone in the store next door and she said that they have been closed for nine weeks.", "pics": null, "resp": null, "gmap_id": "0x886266179711a56d:0x909b87d6f07bead6"}
{"user_id": "101450159794462300011", "name": "Rick Wienczkowski", "time": 1535141770075, "rating": 2.0, "text": "It was a Friday afternoon the young lady on the phone was very rude I just asked her to check to see if my insurance would cover.... she knew it all ....told me to write a check for $20,000.she was wrong.... Please pray for her", "pics": null, "resp": null, "gmap_id": "0x886266179711a56d:0x909b87d6f07bead6"}
{"user_id": "117568858545609498750", "name": "Lisa Overton", "time": 1624293600231, "rating": 5.0, "text": "I’m very happy to leave my first and only Google review (so far, ever) for this excellent medical equipment company! I came in today and met with Danielle who provided me with new medical equipment and the most thorough and stellar instructions! The experience far exceeded my expectations, as well as the quality and features of the equipment itself. Unfortunately, my visit was necessitated by a medical equipment recall. However, this visit put my mind at ease about my ongoing treatment with the new equipment. If you are looking for fast, friendly, and informed service, I highly recommend ONeal Medical!", "pics": null, "resp": {"time": 1624298689257, "text": "Thank you Lisa, we appreciate you and your kind words!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "104681234738951070867", "name": "Susan Johnson", "time": 1595971146157, "rating": 5.0, "text": "I am so glad ONeal Medical is taking care of business while protecting its customers! Farrah came out to my car, picked up my CPap, took it inside for a checkup, and returned it to me in my car. I had been having problems with it and Farrah fixed the problem! I left happy and with a working machine!🥰", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPqewOpk15gDWxV3-Jhm1vqTrc1fAhe4rwJtaIj=w150-h150-k-no-p"]}], "resp": {"time": 1595975244541, "text": "Thank you Suzan, Farah does a wonderful job and while this time has been challenging for us all, we do also appreciate you mentioning the fine service!  Stay well!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "101088033011776367530", "name": "Shaney Dunn", "time": 1621366770549, "rating": 5.0, "text": "Joe & Woody are like family. Dr. Lee's office has done business with this company for over 20 years. If you call or send a email you will get an immediate response. They are here to deliver top notch quality care. Use  this company , amazing service.", "pics": null, "resp": {"time": 1624298735874, "text": "Thank you Shaney, we try hard every day to be the best we can and appreciate your feedback!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "114654149236723827382", "name": "Steven Lee", "time": 1616079919286, "rating": 1.0, "text": "I am not happy. When I bought my Resmed Airsense 10 CPAP they had a VERY limited selection of masks and I'm not happy with the outside vendor mask they had to special order.\n\nLast night my CPAP died middle of the night...repeated attempts to cycle power failed. Had to pull out old CPAP. Showed up at office when they opened, when they plugged it in it worked, but I'm leaving on a trip and don't trust it. The only option they offered was sending it to Resmed...not really an option if you don't have a backup machine. Previous vendor I used just gave me a replacement machine when I had problems.\nBottom line they have VERY limited selection of equipment and no option for loaner or replacement for a critical piece of medical equipment which is still under warranty. I will be changing CPAP vendors immediately.", "pics": null, "resp": null, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "102873856500315189663", "name": "Philip Robinson", "time": 1608857346921, "rating": 5.0, "text": "A gift for Christmas\nMost of us look to give and receive monetary and presents for Christmas.\nI too look forward to this, why?, because of the system we've been conditioned too.\nWell I received a gift today that beats all those gifts.I Received a gift of friendship\n\nI came to spend Christmas with one of my children . I drove 12 hrs. To get here only to find out at 1130pm. That part of my cpap mask was left at home 12hrs. Away. I went to a late night emergency clinic to find one only to find out they couldn't help. I then went to the emergency room at the closest hospital to find out theirs weren't comparable either. I almost resigned myself to stay up all night fearing to go too sleep.  See sleep Anna is nothing to play with, breathing can stop and kill you so going to sleep is dangerous.\n\nI went on line to see if any of the company's that delt with breathing equipment if they had any emergency after-hours  procedures.God is great. As I glanced through  all the options this one stuck out for the simple reason that they emphasized their care for late-night and emergency needs. My son and I called and left messages hoping that someone would call back.\n\nTheir advertisement said that after 12pm that their recording system would call back in the morning. But being it's a holiday I didn't think anyone would.  But by the grace of God around 1210 I was at the hospital emergency room when I got a call. To my surprise the caller wasn't the on call person but one of the owners themselves.\n\nSee he took the on-call because the on-call person tested positivefor Cov19 and he decided to not put anyone else on call.  He had never before  been on call. He met me at his office 15 minutes later, gave me a complete upgraded mask for  free. Saying no one should be deprived of a goods night sleep.\n\nSo to Michael Harden with ONEAL MEDICAL in Birmingham Alabama, you have given me the best Christmas gift, friendship,commitment,and above all, your word that you would answer anyone who needed help no matter when.\n\nThanks", "pics": null, "resp": {"time": 1608916953736, "text": "Thank you Phillip!  All our best and happy holidays sir!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "114623558906915944218", "name": "Bob Beaty", "time": 1602089834124, "rating": 5.0, "text": "O'neal has been my CPAP supplier/support go-to for several years. They all are friendly and always helpful. During this \"challenging time\" the necessary curbside interaction with masking and social distancing is very professional and courteous.  Farah is very knowledgeable and up to date on multiple CPAP systems and the proper accessories.\nShe quickly re-set my machine's prescription and provided me a status update on my machine.  They are a pleasure to work with.\nB", "pics": null, "resp": {"time": 1602597758618, "text": "Thanks Bob! We appreciate you letting us know about your positive experience!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "114567585681602944469", "name": "Pete Partin", "time": 1582418995250, "rating": 1.0, "text": "My husband has been on oxygen since 2015.  Since 2017 he has repeatedly asked about a portable concentrater.  Repeatedly he was told that he did not qualify and would not qualify until he had been on oxygen for 5 years.  Now he has a doctors prescription for one but they will not submit it to Medicare because he will be \"in the gap\" starting in April and they will not be receiving any reimbursement from Medicare, but  would have to continue providing service regardless.", "pics": null, "resp": {"time": 1582464825544, "text": "Is your husband a current OXYGEN customer of ONeal Medical because we have no way of knowing based simply on a Google review.\n\nRegardless, a 1 star review is simply not warranted based on the policy of YOUR insurance plan.  We aren't happy about Medicare's policy of paying for oxygen, we hear complaints about it frequently and so do other oxygen companies, but ONeal Medical didn't create the \"gap\" and Medicare's low payment rates,\n\nYour insurance plan, Medicare, created this mess, not ONeal Medical.\n\nYes, it is up to our company to provide service for the entire 5 years, yet ONLY get paid for the first 3, and then for 2 whole years (the \"gap) basically free of charge. Bear in mind that over this entire 5 year period, we include:\n-24 hours service\n- maintain the equipment\n- free delivery\n-all tubing and supplies / filters\n-file paperwork on the patient's behalf,\n-and from time to time we even provide free oxygen service for patients who travel.\n\nWe would be happy to assist once the \"gap\" period is over, you have the option of privately purchasing a portable oxygen concentrator, but in no way we did we earn a 1 star review as  we feel your review is more a reflection of Medicare's onerous policy, perhaps your misunderstanding of such, but in no way of our company’s performance.\n\nYou can call our office and ask to speak to one of the owners for a more detailed explanation if you wish, and you can call 1-800- MEDICARE as well.\n\nThe process of getting a portable oxygen concentrator, a fairly complex medical device, is VERY fact dependent, there are significant clinical issues to consider as well, so we would encourage you to contact us again so we can fully explain your options, but a 1 star review, no, that's simply not warranted.\n\nNot at all."}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "102662807047269058970", "name": "Cooper Family", "time": 1582752586627, "rating": 5.0, "text": "The staff is knowledgeable and friendly! They really spend the time to help you understand the equipment and do whatever they can to make you happ!", "pics": null, "resp": {"time": 1582757541418, "text": "Hey thank you!  We appreciate this and will pass along to our staff!  Call if you ever need us!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "110500818666655555266", "name": "Casey Bentley", "time": 1563972245695, "rating": 5.0, "text": "Great family owned business for ALL your DME needs!  Great people.", "pics": null, "resp": {"time": 1565799763692, "text": "Thank you Casey!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "107899614337291875242", "name": "Lauren Stinson", "time": 1550454301849, "rating": 5.0, "text": "Excellent and prompt service from O'Neal Medical! Both gentlemen that came to our home to set up oxygen equipment were courteous, patient and knowledgeable. The support staff were also very friendly and helpful. It was wonderful to work with such professional and personable staff members during a stressful time. I would highly recommend O'Neal Medical!", "pics": null, "resp": {"time": 1565799838745, "text": "Thank you Lauren!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "109257703902066368292", "name": "Clarence Fortune", "time": 1548255961903, "rating": 1.0, "text": "Very poor customer service. Received 4 threatening statements for products paid for 4 months ago. Management refused to come to the phone or come out of the office to discuss this. I insisted on a statement showing my entire payment history which showed a zero balance. After receiving another statement for these same changes, management still refused to discuss this.", "pics": null, "resp": {"time": 1548278602186, "text": "Someone will contact you.  We strive for great customer service."}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "116838303445337895732", "name": "W Smith", "time": 1536880468221, "rating": 5.0, "text": "I was using another Medical Supply in Pelham Al. They were the worst company I've ever encountered. I was looking for a good Medical supply and ran across O'Neal Medical. I gave them a try. They actually repaired my C-Pap mask to fit properly, and I wasn't their customer at that time. In days to come I became a customer of O'Neal Medical, and very glad I did.\nThe people are very courteous and caring. They seem to give you the time needed to get you fitted and make sure your happy. My experience with O'Neal Medical is EXCELLENT.....proud to have found them.\nWalt S", "pics": null, "resp": {"time": 1565799847860, "text": "Thank you!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "101956615004864688548", "name": "Cindy Allen", "time": 1460864421091, "rating": 5.0, "text": "I have been using O'Neal Medical for my CPap needs for the last 5 years. They are very helpful whenever I need them to answer any question that I might have. They also have the supplies that I need on hand. I don't have to wait 6 week like I did at my previous supplier. Thanks O'Neal for taking care of us!", "pics": null, "resp": {"time": 1460991374524, "text": "Thank you for the kind words!  We value each and every customer!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "117675592409946593202", "name": "SAL ROSSI", "time": 1597820741925, "rating": 5.0, "text": "Very professional.", "pics": null, "resp": {"time": 1597837190981, "text": "Thanks Sal, we appreciate you!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "109349567589229709050", "name": "Scott Davis", "time": 1536859508261, "rating": 5.0, "text": "Very responsive to my CPAP needs. Very friendly staff.", "pics": null, "resp": {"time": 1565799858470, "text": "Thank you Scott!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "107224779953510952884", "name": "Pat Killian", "time": 1619015945648, "rating": 5.0, "text": "The BEST place in fort Payne for supplies and the BEST staff - - -", "pics": null, "resp": null, "gmap_id": "0x8861d7d4ccd29ef9:0x31477a502f6f0d1c"}
{"user_id": "104497264889036358944", "name": "Richard Hartline", "time": 1492547651716, "rating": 5.0, "text": "They have a very good selection of just about anything a person needs for home health care. The prices are fair and the staff is very friendly and helpful.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMSGKhQvLSg7R6I_LXP-gtSHr3dfKmrD8-ATKQz=w150-h150-k-no-p"]}], "resp": {"time": 1499786202285, "text": "Thank you so much for the kind review. Hope to see you soon!"}, "gmap_id": "0x8861d7d4ccd29ef9:0x31477a502f6f0d1c"}
{"user_id": "101540822407172250453", "name": "Drew Taylor", "time": 1590766579330, "rating": 5.0, "text": "This family-owned business proves time and time again that they put their customer's first. They're the best Medical Supply company in Fort Payne, Al - Hands down!", "pics": null, "resp": {"time": 1526651168159, "text": "Thanks for the review Drew Taylor!"}, "gmap_id": "0x8861d7d4ccd29ef9:0x31477a502f6f0d1c"}
{"user_id": "117695963417381518386", "name": "Beverly Dean", "time": 1502216400929, "rating": 5.0, "text": "Have used them for years. Always very helpful. Highly recommend.", "pics": null, "resp": {"time": 1502218677127, "text": "We thank you so much for the kind words! Thank you!! See ya soon!"}, "gmap_id": "0x8861d7d4ccd29ef9:0x31477a502f6f0d1c"}
{"user_id": "106951458073798745489", "name": "Candice Wilbanks", "time": 1502454823346, "rating": 1.0, "text": "Caught them in a lie about something trivial like when they actually ordered what I needed. Its been over a week and a half and still haven't heard from them on item. I would not recommend these people at all.", "pics": null, "resp": {"time": 1502834009210, "text": "Candice,\n\nThank you so much for bringing this matter to our attention. I apologize for the unpleasant experience with our company. This is never our intention. I have followed up on the order and found your product was ordered on August 4th, (the morning after you were in) directly from the manufacturer. The item was backordered when our shipment arrived meaning it actually had to be made rather than just being packed and shipped. Unfortunately the backorder involved two weekends which did add time to the order. I sincerely apologize for your inconvenience and for our failure in communicating more specifically to you regarding your backorder. Again, thank you for your feedback and I apologize once again.    Beth Westmoreland owner"}, "gmap_id": "0x8861d7d4ccd29ef9:0x31477a502f6f0d1c"}
