{"user_id": "117301511746260921842", "name": "Sherry LEGARE-UNDERWOOD", "time": 1628970567096, "rating": 5.0, "text": "Had the best time at a big party enjoying wine, snacks and good company, with old and new friends. The staff at Wine & Design catered to out every need and we all ended up with a beautiful piece of original art that I still have on my mantle. Great place to take visitors coming from out of town too.", "pics": null, "resp": null, "gmap_id": "0x888c2d363c52dccb:0x23f343852974dce6"}
{"user_id": "109080501791317613022", "name": "Lazy Byne", "time": 1628198377683, "rating": 5.0, "text": "I really enjoyed my experience at Wine and Design. The atmosphere was very calm, relaxed, fun and refreshing. I had fun and my guess enjoyed it as well. We will be returning for another event of fun. The instructor was awesome and her assistant as well. They made it enjoyable. Thank you for a great life experience/memory with you and my family.", "pics": null, "resp": null, "gmap_id": "0x888c2d363c52dccb:0x23f343852974dce6"}
{"user_id": "113492545095755928165", "name": "T-Bird Mableton", "time": 1629206840548, "rating": 5.0, "text": "My family had a fabulous virtual experience with Monica and Imani of Wine & Design! The planning and preparation for our \"Birthday Partini\" was a smooth process, and all the materials arrived on time. Overall it was a creative, unique and successful party. We had a blast!\n\nHave a Paint 'n Sip party with Wine & Design. You won't regret it.", "pics": null, "resp": null, "gmap_id": "0x888c2d363c52dccb:0x23f343852974dce6"}
{"user_id": "115042825585104007079", "name": "Susan Hargrave", "time": 1628900794747, "rating": 5.0, "text": "My friend and I had a great time! We loved the pumpkin portraits that we did. The instructor was good and very helpful.", "pics": null, "resp": null, "gmap_id": "0x888c2d363c52dccb:0x23f343852974dce6"}
{"user_id": "107492527888237436813", "name": "Leslie Cox", "time": 1628917958347, "rating": 5.0, "text": "Had a wonderful time with my friend “arting” our hearts out. Great little shop and the owner and teacher were fabulous and accommodating. Would go back again over and over!", "pics": null, "resp": null, "gmap_id": "0x888c2d363c52dccb:0x23f343852974dce6"}
{"user_id": "110347466167023916063", "name": "Maleika McMillan", "time": 1613484234706, "rating": 5.0, "text": "Our virtual party was professional, fun, and really necessary. My co-workers and I had a chance to safely socialize and laugh outside of our typical office environment. It was definitely a team building experience.  Our instructor was Monica and she was amazing! She laughed and joked with us.  This helped to put a lot of us that were unsure about painting at ease. I would definitely recommend it to anyone that will listen. Thank you for the fun experience! I even have a lovely painting to show off.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN9JHPQuJ3STs02rocjShHvxrnWonPD0QW14O1F=w150-h150-k-no-p"]}], "resp": {"time": 1615819044890, "text": "We really appreciate that feedback."}, "gmap_id": "0x888c2d363c52dccb:0x23f343852974dce6"}
{"user_id": "117203054330809776878", "name": "Kelley Eley", "time": 1628965850461, "rating": 5.0, "text": "Fantastic experience! The instructor was great and helped guide us through creating a masterpiece :) The studio is beautiful and very inviting AND the wine is great too!", "pics": null, "resp": null, "gmap_id": "0x888c2d363c52dccb:0x23f343852974dce6"}
{"user_id": "112136382731591704081", "name": "Jesscynthia Collins", "time": 1628994230583, "rating": 5.0, "text": "I went for my birthday and had a fabulous time! It was a great experience with my daughter and friends! I will be back!", "pics": null, "resp": null, "gmap_id": "0x888c2d363c52dccb:0x23f343852974dce6"}
{"user_id": "108166655452840638188", "name": "Jenny Renea C. Pruitt", "time": 1619982141963, "rating": 5.0, "text": "I really enjoy coming here to pretend I'm an artist for a few hours.  I've been able to paint pictures I have been really surprised I actually created.  The store is clean and the staff is very friendly and helpful.  Savanna Pruitt has taught the classes I've taken and I highly recommend requesting one of her classes, but everyone is really nice and friendly.", "pics": null, "resp": null, "gmap_id": "0x888c2d363c52dccb:0x23f343852974dce6"}
{"user_id": "106199141644863931582", "name": "Lenora Patterson", "time": 1613483183187, "rating": 5.0, "text": "Although painting is not something I usually enjoy, I have attended classes at W&D twice and had a great time. The instructors are knowledgeable and everyone stresses having a good time more than worrying how your painting will turn out. I was able to relax and just enjoy time with my friends. I’ve also participated in a virtual party. My kit was delivered on time with everything I needed to have a safe painting experience with my family. I will definitely be supporting again in the future!", "pics": null, "resp": {"time": 1615819069207, "text": "We really appreciate those kind words! Thanks!"}, "gmap_id": "0x888c2d363c52dccb:0x23f343852974dce6"}
{"user_id": "109447574743708476346", "name": "b p", "time": 1620155765599, "rating": 5.0, "text": "My friends and I enjoyed our first time experience of doing anything like this. We were able to create great art. The environment was just that warm and inviting that we met new people and had great conversation.", "pics": null, "resp": null, "gmap_id": "0x888c2d363c52dccb:0x23f343852974dce6"}
{"user_id": "102832014587002385399", "name": "Nicole Beasley", "time": 1628366753378, "rating": 5.0, "text": "Fun atmosphere! I've gone twice and both times I had a wonderful experience.", "pics": null, "resp": null, "gmap_id": "0x888c2d363c52dccb:0x23f343852974dce6"}
{"user_id": "100089325763907333312", "name": "Josh Fuqua", "time": 1619549414048, "rating": 5.0, "text": "The instructor was great. The atmosphere was great. The night was great.\n\nI had almost no idea what I was doing and ended up with a painted decoration that I will actually display during Christmas. Thank you, Wine & Design.", "pics": null, "resp": null, "gmap_id": "0x888c2d363c52dccb:0x23f343852974dce6"}
{"user_id": "110177112591683434067", "name": "Onica Sanders", "time": 1619479088610, "rating": 5.0, "text": "This is a wonderful place to throw a party!! You are able to choose your painting, play your own music, and bring food. I thoroughly enjoyed myself and loved the professionalism of the owners.", "pics": null, "resp": null, "gmap_id": "0x888c2d363c52dccb:0x23f343852974dce6"}
{"user_id": "112578191610895085112", "name": "Kamisha Coleman", "time": 1613435531792, "rating": 5.0, "text": "Thank you for making my daughter's virtual birthday party a great experience! We loved painting the pineapple picture. The owner also took the time to play music that went along with our theme for the kids while they painted. The kits were beautifully and professionally done & easy to deliver to all the guests. In the mist of a pandemic we were still able to enjoy ourselves virtually! Thank you again! K.C.", "pics": null, "resp": {"time": 1615819054074, "text": "Thank you for being our customer! We're glad you were pleased with Virtual Paint Party."}, "gmap_id": "0x888c2d363c52dccb:0x23f343852974dce6"}
{"user_id": "115647828853868541215", "name": "Lauren Robbins", "time": 1619547759226, "rating": 5.0, "text": "Wonderful time! Small group with lots of One on one attention,which I needed! Want to do theChinky blanket class again soon! It I spurred me to learn to crochet! 😊", "pics": null, "resp": null, "gmap_id": "0x888c2d363c52dccb:0x23f343852974dce6"}
{"user_id": "106535198940794359027", "name": "Yolanda Rose", "time": 1621289082228, "rating": 5.0, "text": "Perfect outing for relaxing with friends old and new!! They thought of everything, just bring yourself and have a great time.", "pics": null, "resp": null, "gmap_id": "0x888c2d363c52dccb:0x23f343852974dce6"}
{"user_id": "113429958888938081197", "name": "Mrs. Butler", "time": 1621126361168, "rating": 5.0, "text": "Awesome-awesome experience! Great place for girls night and tons of fun!", "pics": null, "resp": null, "gmap_id": "0x888c2d363c52dccb:0x23f343852974dce6"}
{"user_id": "107374876607743003002", "name": "Kelsie Thomas", "time": 1625540698743, "rating": 1.0, "text": "I paid for 2 tickets. I was told that I could use the credits for another paint date instead(due to me not being able to make the original date). Contacted customer service and never got a response.$ 80.00 gone to waste. Never again", "pics": null, "resp": {"time": 1625541619700, "text": "Kelsie, did you email us at montgomery.al@wineanddesign.com? We have no record of correspondence with you. We will not have an issue with giving you a credit."}, "gmap_id": "0x888c2d363c52dccb:0x23f343852974dce6"}
{"user_id": "107593603483375604297", "name": "Hope Allen", "time": 1619998551794, "rating": 5.0, "text": "I had such a fun time here! It was great!", "pics": null, "resp": null, "gmap_id": "0x888c2d363c52dccb:0x23f343852974dce6"}
{"user_id": "110823458118534423912", "name": "Asia", "time": 1628605332288, "rating": 5.0, "text": "Great date night idea", "pics": null, "resp": null, "gmap_id": "0x888c2d363c52dccb:0x23f343852974dce6"}
{"user_id": "107710542059205807510", "name": "Thalita Rabb", "time": 1612794567349, "rating": 2.0, "text": "My coworkers and myself we attended this venue on Saturday, February 6 for my coworkers birthday🎂. The instructor was great no problems very professional, awesome we had a great time. Towards the end someone comes 😳in the back door so we’re all looking like 🤔who is this coming in here. We 🤷🏽‍♀️guessed it was the owner she doesn’t introduce herself & suddenly the whole vibe turns negative in the room 👎🏾.Then @ 8:58 she hollers out loud you have 2 minutes left & you can 💵buy some more time🥴. So everyone is looking like she’s kicking 🏃🏽‍♀️us our at this point we’re rushing gathering everything😫. She hollers 🗣leave the artist a $20 tip it’s in your contract. Ok kool not a problem but her tone was loud & extremely rude 😤she was very unprofessional. I will not return nor recommend this venue to anyone. Hopefully 😫 the owner will be more professional at future events. Have a beautiful day 🤩🥳🤪.", "pics": null, "resp": {"time": 1612837043690, "text": "I apologize if my tone seem rude. It was definitely not my intention or my reputation. Thank you giving us a try and your honest feedback. We are happy you enjoyed your class."}, "gmap_id": "0x888c2d363c52dccb:0x23f343852974dce6"}
{"user_id": "116117300216157450835", "name": "Theresa Fortson", "time": 1612762668721, "rating": 3.0, "text": "My co workers and I came to wine & design on 2/5/21 for a sip & paint to celebrate Tomeka's birthday. The artist was absolutely wonderful, helpful, patient and made us feel comfortable I believe her name was Charletta. But towards the end another lady comes in through the back and I am assuming she is the owner but she didn't introduce herself so at 8:58 she hollers out that we have 2 minutes left unless we want to buy more time now mind you the painting was not finished we still had to do the lips and sign it but we rushed through to get it done so we never got to take pictures with our painting at this point we are trying to help Tomeka pack up her food and she also did not get to open her gifts because we were rushed out and she had to rush and cut her cake plus it was raining and cold last night and to put the icing on the cake the owner says as we are leaving that in your contract you have to tip the artist a minimum of $20 so Tomeka gives the artist the $20 tip which she did deserve I said all of that to say this its not what you say it's how you say it and after that experience I will not be returning to this establishment and I wanted to see how this night went so I could plan to have a couples sip and paint night for my anniversary but due to how we were treated in the end I will be looking for another location/establishment", "pics": null, "resp": {"time": 1612797113438, "text": "Please accept our sincere apology. It wasn’t my attention to appear to be rude. Announcing the time left in and asking the party if they want to purchase more time is customary and something we do at every private party . I did politely announce that you can continue to paint as we clean up. I did see several people taking pictures at the end as we were cleaning up. We hope guys will give us another try.  :)"}, "gmap_id": "0x888c2d363c52dccb:0x23f343852974dce6"}
{"user_id": "107996396135002918603", "name": "cynthia ferguson", "time": 1607415716419, "rating": 5.0, "text": "I enjoyed my first visit the host Monica was very knowledgeable about painting and made you feel at home i will be going back", "pics": null, "resp": {"time": 1612837093863, "text": "Thank you for the opportunity."}, "gmap_id": "0x888c2d363c52dccb:0x23f343852974dce6"}
{"user_id": "104080669926471937660", "name": "Theressa Virgil", "time": 1606226519655, "rating": 5.0, "text": "Fun, professional, and memorable! During the pandemic, we were looking for a way to safely have a birthday party celebration. Monica and Imani were the answer to our prayers.\n\nThey provided the perfect virtual experience so that attendees from all over the country could participate. There was prompt communication, the materials arrived on time, and we enjoyed a delightful “painting partini” on Zoom. Don’t let distance dampen your fun. Let Monica and Imani show you how it’s done!", "pics": null, "resp": null, "gmap_id": "0x888c2d363c52dccb:0x23f343852974dce6"}
{"user_id": "105541196297741431230", "name": "Ansley Turner", "time": 1594349784162, "rating": 5.0, "text": "Had a great time! Made us feel comfortable and welcome. Enjoyed painting and relaxing with my family. Very nice setup Monica and Imani were very kind and attentive definitely will be back. Definitely recommend!", "pics": null, "resp": null, "gmap_id": "0x888c2d363c52dccb:0x23f343852974dce6"}
{"user_id": "117114913404384074917", "name": "Amber Smith", "time": 1602971645822, "rating": 5.0, "text": "Awesome experience with friends! Honestly, you can't go wrong with painting and margaritas! Look forward to returning.", "pics": null, "resp": null, "gmap_id": "0x888c2d363c52dccb:0x23f343852974dce6"}
{"user_id": "115607180778375941055", "name": "Jewel Whiting", "time": 1613361862991, "rating": 2.0, "text": "Cost too much for just a paint session and the eine is extra.. disappointed", "pics": null, "resp": {"time": 1613364700803, "text": "Hi Jewel,  thank you for taking the time to leave us a review! I’m so sorry you felt the experience wasn’t a 5-star one. Our pricing is in line with the paint and sip industry standard, and we pride ourselves on our beautiful painting selections and excellent artist instruction. We list all our policies and instructions- including that we are not a BYOB studio- in our class descriptions when you check out because we understand the importance of setting expectations! We will look into how we can make it clearer that beverages are available for purchase. Again, I’m so sorry you were dissatisfied. As a local small business I am grateful for everyone who walks in the door,  and I appreciate your feedback."}, "gmap_id": "0x888c2d363c52dccb:0x23f343852974dce6"}
{"user_id": "104568122719103477205", "name": "Adria D", "time": 1598985644144, "rating": 5.0, "text": "Had so much fun! Very pretty and clean environment.", "pics": null, "resp": null, "gmap_id": "0x888c2d363c52dccb:0x23f343852974dce6"}
{"user_id": "101976698437935891114", "name": "Cassie Rockette", "time": 1593657426639, "rating": 5.0, "text": "Great place, the staff is very friendly, hands-on and adjustable.  They have great customer service, very clean and inviting place.", "pics": null, "resp": null, "gmap_id": "0x888c2d363c52dccb:0x23f343852974dce6"}
{"user_id": "104824573273534464636", "name": "Mike Hand", "time": 1628533468763, "rating": 5.0, "text": "Fun friendly and very clean. Loved it.", "pics": null, "resp": null, "gmap_id": "0x888c2d363c52dccb:0x23f343852974dce6"}
{"user_id": "104387856977264683369", "name": "Lisa Brown", "time": 1582489003801, "rating": 5.0, "text": "Great place to enjoy the company of friends and create your own masterpiece.", "pics": null, "resp": null, "gmap_id": "0x888c2d363c52dccb:0x23f343852974dce6"}
{"user_id": "101022177044066781531", "name": "SJ SJ", "time": 1629935660705, "rating": 3.0, "text": "Attended an event nice place but the owner rushed the guest and kept referring to time left before event end. A bit tacky considering guest had an invitation with time.", "pics": null, "resp": {"time": 1629940559660, "text": "We are so sorry you felt rushed! We always kindly remind our guest how much time is left so that we may finish on time to prepare and start our next class on time. We hope that you will give us another chance in the future and we appreciate your feedback."}, "gmap_id": "0x888c2d363c52dccb:0x23f343852974dce6"}
{"user_id": "110792094125388460028", "name": "Tiffany Cope", "time": 1600657529511, "rating": 5.0, "text": "Went to a birthday party here. The kids had a great time! They do such a good job of making sure they all had an actual nice painting to take home! After the kids fill in their pictures, the workers go back and outline and add in details to really bring it to life.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPPu5BX08Vm0ijYoaQzvnvqtR6TYTEUC9BSO3mP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO0NqN3VrAzYsAgYTrvQRDUX5E2w04x9s4aWEDs=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOwp6EurKPMMQFAKye0L_RJnBdEIhQ3FGY9-rys=w150-h150-k-no-p"]}], "resp": {"time": 1623180116349, "text": "Thank you for the review! We hope to see you back soon!"}, "gmap_id": "0x88628b429faac5db:0xb11d47d73171010c"}
{"user_id": "106599616760699546349", "name": "Lisa Self", "time": 1619634972936, "rating": 5.0, "text": "The Broken Brush is such  a great place to go relax, paint, meet up with your family and friends. The staff is awesome & will help you in anyway they can. They make your visit so enjoyable that it becomes addictive. If you haven’t been what are you waiting for? This should be in your bucket list.", "pics": null, "resp": null, "gmap_id": "0x88628b429faac5db:0xb11d47d73171010c"}
{"user_id": "101126759321836525954", "name": "Bree Harrison", "time": 1623181601825, "rating": 5.0, "text": "Love this place! Everyone is so helpful and it’s the best little paint place!", "pics": null, "resp": null, "gmap_id": "0x88628b429faac5db:0xb11d47d73171010c"}
{"user_id": "104556143805900108670", "name": "Jessica Pratt", "time": 1619493967140, "rating": 5.0, "text": "Great little studio located in downtown Athens, Al! Locally owned and operated.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNnsEcjkBOjhjkuvYWRtZMNHA6PqpEOGIpY6CEF=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88628b429faac5db:0xb11d47d73171010c"}
{"user_id": "104688326861236251755", "name": "Blake Williams", "time": 1613548377473, "rating": 5.0, "text": "Amazing experience every time with Jessica, Jarred, Lisa or Stephanie! Great painting studio in downtown Athens!", "pics": null, "resp": null, "gmap_id": "0x88628b429faac5db:0xb11d47d73171010c"}
{"user_id": "107110734827450346897", "name": "Charles Stanford", "time": 1550252851411, "rating": 5.0, "text": "Great for date night. Instructors were very helpful and you will amaze yourself of what you can do. We went on Valentines and it was for Couples only. Had a great time! Would recommend this very highly.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPAj5KqQMa2j_2wlj--vFCEBgo0l0Pw0ZRGeq5x=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNHXmrBTnGTq_V6GRUlAVV3liRqxFAW2GizVGuO=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88628b429faac5db:0xb11d47d73171010c"}
{"user_id": "107848199641416274868", "name": "Vickie Clemmons", "time": 1569941680042, "rating": 1.0, "text": "My daughter paid $45.00 each for both of our projects 2/3 weeks prior to the class. When we arrived, we were told they did not have anyone signed up for that class. My daughter showed her email for payment conformation. The instructor said she would have to cut our pieces. It seemed a bother. We stood around for a while & she finally told us to sit with another class. I feel like we were not shown the attention as everyone else. We had to ask for paint, brushes, & water to clean the brushes. We are pretty crafty so we just looked at the sample and completed it on our own. We did not get holes drilled for the hanger...she could not work the drill and the piece was not sealed. I do not recommend this business. Everyone should be treated with the same attention.....very disappointed!!", "pics": null, "resp": null, "gmap_id": "0x88628b429faac5db:0xb11d47d73171010c"}
{"user_id": "113811335308211893182", "name": "Nameless Faceless", "time": 1582618416739, "rating": 1.0, "text": "My mom, niece, and I had a pretty abysmal experience here.\nIt was our third time doing a sip and paint class (I don't even want to call it a class at this point). There was little to no direction by the \"instructor\" who made it VERY clear that she was not supposed to be there that late and informed us that the girl who was supposed to teach the class couldn't make it.\nLike many other establishments like this, they offer a variety of painting classes at different levels of difficulty. You also have the option to \"upgrade\" your painting by purchasing a larger canvas.\nAnother thing that most of these places do is sell the paintings that the instructors do during every class. I wish I could say that they're affordable and worth the price, but that definitely is not the case. When I inquired about which paintings were for sale and about the general cost, the woman got snarky with me. After paying well over $100 to for little to no instruction and having an overall bland experience, I did not want to give this place any more of my money.\nPAINTER'S TIP:\nI would suggest stopping by Walmart (or ordering off Amazon) and getting a cheap variety pack of paintbrushes (I posted a photo of the pack I purchased). I found that the brushes they supplied were a little worn out and often I couldn't get my lines as thin as I wanted them (I have a heavy hand).", "pics": null, "resp": null, "gmap_id": "0x88628b429faac5db:0xb11d47d73171010c"}
{"user_id": "110220065633890231747", "name": "Brandi Paustian", "time": 1490068503702, "rating": 5.0, "text": "We love The Broken Brush! Jessica is a great teacher and it is always so much fun. My 12 year old son loves it too.", "pics": null, "resp": null, "gmap_id": "0x88628b429faac5db:0xb11d47d73171010c"}
{"user_id": "101865143184490254843", "name": "Sipping Tea", "time": 1594834119135, "rating": 1.0, "text": "I just can't even with this place", "pics": null, "resp": null, "gmap_id": "0x88628b429faac5db:0xb11d47d73171010c"}
{"user_id": "106533767893939107731", "name": "June Johnson (Yaya)", "time": 1620414054311, "rating": 5.0, "text": "Very good food. Nice, clean facilities. Quick service.", "pics": null, "resp": null, "gmap_id": "0x8861dec7bcc1da4d:0xe811848cb1c2b46e"}
{"user_id": "111030440393576123254", "name": "2xperthands", "time": 1611277553491, "rating": 5.0, "text": "Fresh, to order sandwiches with sides. Friendly, quaint, clean!", "pics": null, "resp": null, "gmap_id": "0x8861dec7bcc1da4d:0xe811848cb1c2b46e"}
{"user_id": "113503954324416381246", "name": "Jennifer Benefield", "time": 1490755509892, "rating": 5.0, "text": "Had my daughter Maddie's \"bleaching flannel\" 13th birthday party there!!! Awesome place, awesome service!!!!!!! Alice is very friendly and helpful!!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipND46K50WoO6Z-MXlNNuQmGPu0akiTp3deaRc1I=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPMeBNCJebPkg480OGnSo2VRJAiURxO6mvKOQbl=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8861dec7bcc1da4d:0xe811848cb1c2b46e"}
{"user_id": "102870402694924380930", "name": "Anna Nappier", "time": 1510716529430, "rating": 4.0, "text": "Cute stuff,  didn't really have anything I was looking for.", "pics": null, "resp": null, "gmap_id": "0x8861dec7bcc1da4d:0xe811848cb1c2b46e"}
{"user_id": "112391671656198234180", "name": "Debbie Culpepper", "time": 1563730784089, "rating": 5.0, "text": "Alice has the best gifts", "pics": null, "resp": null, "gmap_id": "0x8861dec7bcc1da4d:0xe811848cb1c2b46e"}
{"user_id": "100884986434950517140", "name": "Lisa Lou", "time": 1564256713141, "rating": 5.0, "text": "Love this place!", "pics": null, "resp": null, "gmap_id": "0x8861dec7bcc1da4d:0xe811848cb1c2b46e"}
{"user_id": "107659723167993162572", "name": "chlorine adam", "time": 1487084435143, "rating": 5.0, "text": "Food is great!", "pics": null, "resp": null, "gmap_id": "0x8861dec7bcc1da4d:0xe811848cb1c2b46e"}
