{"user_id": "108100778542682893272", "name": "Brandy Chambers", "time": 1537983288352, "rating": 3.0, "text": "Was full at 7 am make sure and get there early", "pics": null, "resp": null, "gmap_id": "0x88891b8a7a8b91a7:0x9f1d9abdb33a5569"}
{"user_id": "117976180755046303868", "name": "marceon walker", "time": 1349838513521, "rating": 2.0, "text": "Why would they allow gangs", "pics": null, "resp": null, "gmap_id": "0x88891b8a7a8b91a7:0x9f1d9abdb33a5569"}
{"user_id": "112060851285261385451", "name": "lena w", "time": 1629298000369, "rating": 5.0, "text": "No problem 👍🏼", "pics": null, "resp": null, "gmap_id": "0x88891999a9adc579:0x4a409c162cefee85"}
{"user_id": "102796629284309579796", "name": "Andrew Farrow", "time": 1628092686117, "rating": 5.0, "text": "Great parking garage for Target", "pics": null, "resp": null, "gmap_id": "0x88891999a9adc579:0x4a409c162cefee85"}
{"user_id": "107318915672795521686", "name": "Jeff king", "time": 1625880752635, "rating": 4.0, "text": "Love the elevated Target here", "pics": null, "resp": null, "gmap_id": "0x88891999a9adc579:0x4a409c162cefee85"}
{"user_id": "102221954954166555328", "name": "Mary Hildreth", "time": 1625689383743, "rating": 4.0, "text": "Clean parking area, safe as well", "pics": null, "resp": null, "gmap_id": "0x88891b19ca60f8af:0xd0ca65190a4b94e0"}
{"user_id": "117637282664713172162", "name": "Robert Smith", "time": 1626413841802, "rating": 5.0, "text": "They were very nice", "pics": null, "resp": null, "gmap_id": "0x88891b19ca60f8af:0xd0ca65190a4b94e0"}
{"user_id": "116243391013152312277", "name": "Marilyn Glasgow", "time": 1628225105805, "rating": 5.0, "text": "Valet staff was very friendly.", "pics": null, "resp": null, "gmap_id": "0x88891b19ca60f8af:0xd0ca65190a4b94e0"}
{"user_id": "116195307692586989325", "name": "Ms Fowler (Ms. Fowler)", "time": 1623711426578, "rating": 1.0, "text": "Unhelpful for patients", "pics": null, "resp": null, "gmap_id": "0x88891b19ca60f8af:0xd0ca65190a4b94e0"}
{"user_id": "106976631620163919954", "name": "Harry D Smith", "time": 1570284174897, "rating": 5.0, "text": "I appreciate a great place to park while in the Clinic to keep appointments with my doctors.", "pics": null, "resp": null, "gmap_id": "0x88891b19ca60f8af:0xd0ca65190a4b94e0"}
{"user_id": "100048885817472146808", "name": "Gregory Slappey", "time": 1580074633982, "rating": 5.0, "text": "Easy and convenient", "pics": null, "resp": null, "gmap_id": "0x88891b19ca60f8af:0xd0ca65190a4b94e0"}
{"user_id": "102873784553806987050", "name": "USA NORTE AMERICA", "time": 1563234107813, "rating": 5.0, "text": "exelent clinic in Birmingham", "pics": null, "resp": null, "gmap_id": "0x88891b19ca60f8af:0xd0ca65190a4b94e0"}
{"user_id": "103559832722518501371", "name": "Benjamin Shelton", "time": 1628718456391, "rating": 5.0, "text": "It's a courthouse it was more to say", "pics": null, "resp": null, "gmap_id": "0x887d485e47439bdf:0xd78b262289815c43"}
{"user_id": "105092179315625737757", "name": "Amy Shaneyfelt", "time": 1549433982700, "rating": 4.0, "text": "Yes", "pics": null, "resp": null, "gmap_id": "0x887d485e47439bdf:0xd78b262289815c43"}
{"user_id": "106772738342210543744", "name": "Ashley Battle", "time": 1534954808111, "rating": 5.0, "text": "I actually work in the mall and I love the area it's amazing! I'm usually here on my days off so that tells a lot about the area, there's a variety of stores that I love here as well as a movie theater. I love going to the movies as well as a kids play Park, pretty neat area!", "pics": null, "resp": null, "gmap_id": "0x88626eb09f5a52a7:0x34e8933072af7056"}
{"user_id": "108233854198991313743", "name": "Yuli Chang", "time": 1504463337894, "rating": 1.0, "text": "Poorly designed, looks cheap.  They dug up a nice looking lake to put this concrete monster here.  Looks like some one measured it incorrectly and didn't leave enough space for the up and down ramps.  The ramps are dangerous because you can't see incoming traffic.  The elevators are out of order half the time.", "pics": null, "resp": null, "gmap_id": "0x88626eb09f5a52a7:0x34e8933072af7056"}
{"user_id": "101767398904651307080", "name": "Theresa Speakman", "time": 1539568589868, "rating": 4.0, "text": "Easy entrance and exit.  Convenient to Brighton , and several shops near the theater.", "pics": null, "resp": null, "gmap_id": "0x88626eb09f5a52a7:0x34e8933072af7056"}
{"user_id": "109356044374693800062", "name": "James D Hopkins", "time": 1547141192189, "rating": 3.0, "text": "Okay let's get serious..... it is a parking deck I'm not sure what they want you to review that for.", "pics": null, "resp": null, "gmap_id": "0x88626eb09f5a52a7:0x34e8933072af7056"}
{"user_id": "104527633603521731841", "name": "Elizabeth Fauss", "time": 1627826283061, "rating": 5.0, "text": "We highly recommend this campground! It’s a wonderful very safe place to stop and camp especially if you are doing just one night! It’s quiet and very easy to get to from I-20. It is exactly 1 mile (doesn’t even feel like it’s even that far). It’s behind the storage company. If you don’t turn right on the road after the storage place you will miss it. It’s a tucked away treasure. The spaces are huge, easy to get in and out of and perfectly flat! There is a beautiful tree line and plenty of areas for your pups. Bruce the owner is amazing! He has made the process so simple and easy to book. He is very friendly and down to earth. I cannot praise this place enough!", "pics": null, "resp": null, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "111129710234041313834", "name": "Kathy McCorkle", "time": 1624666894636, "rating": 5.0, "text": "Hidden Gem!  Right off I 20.  Not a resort, it’s well kept, large gravel sites for one night or long term, easy hookups, grass and not one or two, but three, large fenced in, grass dog runs!  Well kept, owner was very helpful, we will definitely back on next cross country trip.  Had a 40ft Class A towing and did not have to unhook.  Wish they could all be this big, neat, easy in and out!  See you next time!", "pics": null, "resp": {"time": 1624887714474, "text": "We we be here ready for you! So glad you enjoyed your stay!"}, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "105174009915839143632", "name": "L Spo", "time": 1626353720789, "rating": 5.0, "text": "Traveling back home from Tennessee to Texas.  We found this little gem looking for an overnight stop.  It is exactly as it describes. If you are traveling and need a clean,safe place this is it.  Water, sewer,electric (30/50 amp), WiFi, two dog runs and one mile off interstate 20 .  Easy off/on.  Easy in/out.  Large well packed base slots with many pull thru.  Bruce is a great host.  We will be back for sure next trip thru.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNPKHk-qy_OTbbUN9Vr0HVHB710kQrk_ao6Z9qa=w150-h150-k-no-p"]}], "resp": {"time": 1626460632961, "text": "We'd love to have you back! Safe travels!"}, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "114060388029078026057", "name": "Julia Slaughter", "time": 1627304134023, "rating": 5.0, "text": "Clean, safe park. Owner was very accommodating and a pleasure to speak with on the phone. He was very very very very helpful. Facilities were perfect and it was quiet. Not too crowded. We got in at 11ish, and it was no problem! Definitely recommend", "pics": null, "resp": {"time": 1627309247219, "text": "Thank you for your feedback. We are so glad you had a great experience! We love to hear this and feel free to come back any time you're in the area!"}, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "111601049929117251222", "name": "Donna Pickett", "time": 1622559122108, "rating": 5.0, "text": "This place is a great place to stay! Nice people and clean/quiet area despite being close to businesses. They also have a safe area to go to in case of bad weather which made me feel safe   I’m a travel nurse being alone most of the time and I felt secure here. Not far off interstate and close to college and anything you might need. Thanks Bama!!!", "pics": null, "resp": {"time": 1624887598186, "text": "Thank you so much for the kind words. We strive to provide the best experience for our patrons."}, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "107378388962441960427", "name": "Mark Bosch", "time": 1626842474516, "rating": 5.0, "text": "If you’re looking for a peaceful, well kept park, this is a the ticket! Multiple dog park areas, quiet and away from the main road, and the owner seems to care about every customer. If you’re looking for an overnight stay, football game stay, or extended stay, you can’t go wrong here.", "pics": null, "resp": null, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "101748219787435530288", "name": "Judy Herring", "time": 1626139552304, "rating": 5.0, "text": "We rented a large pull-thru capable of handling a 75ft rig for a night while passing thru. We had adequate room for turning and maneuvering a large rig. Level, gravel site with 50 amps, water and sewer. Lots of choices for food delivery with Waitr was a plus!", "pics": null, "resp": {"time": 1626460589010, "text": "Thank you so much for your review. Glad you found some great food while you were here too!"}, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "100037239499704712512", "name": "keith walter", "time": 1626399507860, "rating": 5.0, "text": "Great overnight stay in a 40 ft Class A towing a Jeep with bikes. Big-rig friendly. Level easy in easy out sites.Can't be be beat for an ovefnight stay. We ard Lifetime Good Samm Members and absolutely recommdnd this Park to all RV'ers.", "pics": null, "resp": {"time": 1626460734841, "text": "Thank you for taking time to leave your feedback. We are glad you had such a positive experience at Bama RV Station!"}, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "106388795496730439701", "name": "Keith n Marie Kosmin", "time": 1605846367508, "rating": 5.0, "text": "Clean, quiet, friendly and well maintained RV park. Great location during football season, but we stayed there overnight while on our way to Texas. Owner is very friendly and helpful. Location is far enough away from the interstate that you don’t hear trucks and other loud vehicles, but it is close enough to be a convenient overnight stop. We will definitely stay here again.", "pics": null, "resp": {"time": 1615412118143, "text": "We would love to have you back! Our facility is in a great location and we love it! So glad you enjoyed it. This is what we love to hear!"}, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "104103963510950800926", "name": "Tristan Schade", "time": 1614375139105, "rating": 5.0, "text": "Fantastic campground! Will be coming back. Great staff! Bruce is a very friendly and helpful man.", "pics": null, "resp": {"time": 1615412348609, "text": "Thank you for your review. Bruce cares about all of his patrons. I am glad you had a great experience with us."}, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "104927214342940266314", "name": "Kendell Snyder", "time": 1608462137783, "rating": 5.0, "text": "Stayed overnight on the way home from Florida, great park! Bruce was great, got us parked quickly. Park was clean and quiet, easy on/off from the interstate. Definitely stay here again!", "pics": null, "resp": {"time": 1617891414750, "text": "Thank you for your review! Bruce is a great guy and we are blessed to have him as our owner."}, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "111307948291396688933", "name": "Eileen Fox-Biswell", "time": 1618579403711, "rating": 5.0, "text": "Very attentive owner. Very quiet location. Close to University of Alabama.", "pics": null, "resp": {"time": 1618582519225, "text": "It was a pleasure having you here with us. Come back any time!!!"}, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "105747278763824052847", "name": "Estefan Olivares", "time": 1557075721499, "rating": 5.0, "text": "Quiet place to park the rv. There are a lot of spots, and it was only partially filled during our visit. We were lucky to get a pull through spot at the end. Also lucky enough to be next to the two dog runs.  Bit expensive, but we had full hook ups with electricity and waste right next to the rv so we can just let the hose and wires out.\n\nStaff was great. Even offered us some help if the storm got worse. There was a terrible storm supposed to come in, but it just rained. Still the thought that counts.\n\nNeighbors were also friendly, which is good cause there isnt anything to do here so having a chat while walking the dog or working outside was great", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNdOBonnSRcEJJ9r9ERJxbz4hyUpZeI_kHGhyCL=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP-R8L3L6kovCFxpH8OdtJURDobqVRxts9eV2v_=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "102984733957506336482", "name": "Ryan Davis", "time": 1611945851127, "rating": 5.0, "text": "Fair prices and excellent service. Bruce is a great guy.", "pics": null, "resp": {"time": 1615412291254, "text": "Thank you Ryan! We appreciate your business!"}, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "100004808158899638464", "name": "Carleen Hyatt", "time": 1617889281408, "rating": 5.0, "text": "Clean, quiet, reasonably priced, level sites and friendly people.", "pics": null, "resp": {"time": 1617891488589, "text": "Thank you for your review! Our 19 acre complex makes for a relaxing location for sure. Please come stay with us any time!"}, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "116615845105995354908", "name": "Samantha Shaw", "time": 1584744951484, "rating": 1.0, "text": "Under no circumstances use this camp ground. The owner cut off our water as I was washing dishes and turned off our power. This was not a one time thing and it will damage your camper. We lost all the food in our freezer. He did not knock and would just\ncome and open the door to the camper and had to keep it locked when I was there. When my husband went to talk to him about it very calmly and ask him to not mess with our camper. The man threatened my husband and got in his personal space. He then ask us to leave after we had paid for a month, due to asking him to not mess with our camper.\n\nThe lady at the office was very nice and helpful and did everything in her power to be so kind. She is the only good thing about the campground.", "pics": null, "resp": {"time": 1615411989482, "text": "We apologize for any misunderstanding that may have occurred during your stay with us."}, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "112470757180488908811", "name": "Tammy Moore", "time": 1578617293731, "rating": 5.0, "text": "Stayed here for 4 months and would highly recommend! This is a great place to stay. The owner and employees are very helpful and friendly. The RV park is in a convenient location and is safe and clean. If you need a RV park in Tuscaloosa, this is the place to stay!!", "pics": null, "resp": {"time": 1617891313723, "text": "Thank you very much! We are happy we could meet your expectations. Come back any time!"}, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "109522201729770867971", "name": "Patty Boulos", "time": 1613061512676, "rating": 5.0, "text": "clean spots and had a great time", "pics": null, "resp": {"time": 1615412314304, "text": "Thank you for staying with us! Come on back anytime you need a place to stay!"}, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "110444611317420724580", "name": "Mandy MW", "time": 1561493786281, "rating": 4.0, "text": "Stayed here for our first trip with a 41ft camper. Online reservations were super easy, the park was well maintained and quiet, the dog parks were clean and had plenty of SHADE! Easy location to find and close to the interstate. Lots of restaurants available for delivery on the Waitr app, too! I’m guessing during football season it’s a bit more full, but we really enjoyed our few days here as a test run!", "pics": null, "resp": null, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "113834546208455429358", "name": "Melody Cook", "time": 1581387540806, "rating": 5.0, "text": "My husband and I have stayed at Bama RV over the past three months. Contrary to a couple of previous reviews, Bama RV certainly does cater to long-term camping! We have a wonderful spot, and even though we have neighbors (which we like!), we have plenty of privacy. We have a dog, so we are very fond of the three different pet areas that are offered. We have full hook up and also Wi-Fi is included in the cost! Bama RV is conveniently located less than a mile from the interstate, and with a quick trip you can reach downtown and The University of Alabama area. It is also only about a 30 minute drive to Birmingham and less if you need to go to MBUSI in Vance. Last but certainly not least, you won’t find better customer service! Denise is the absolute best! From paying your bill, to asking random questions, she goes above and beyond to help in anyway possible! She even gave us a personal phone call when bad weather was approaching to make us aware of the shelter.  Even the owner, Mr. Bruce Taylor, makes the rounds occasionally to make sure everyone is happy and that all is well.  If I could give more than five stars I would!", "pics": null, "resp": {"time": 1615411864374, "text": "Thank you for your review! We sure do take pride in our facility. Our owner, Bruce, makes sure everything is secure and pleasant for our patrons. Come stay with us anytime!!"}, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "110955640574689388863", "name": "Ed Baldwin", "time": 1579283982820, "rating": 5.0, "text": "This RV park is perfect for our trip. We wanted to be close to the University of Alabama so we could attend our granddaughter soccer camp, and not have to drive 30 minutes or more to get there. We are less than 10 minutes from the campus. We have FHUs, great wifi signal, and adequate room. The only drawback is no restrooms, showers.", "pics": null, "resp": {"time": 1617891368775, "text": "Thank you for your review. Our location sets us apart in a lot of situations and we are so happy you could stay with us!"}, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "111361352806135908855", "name": "James Gest", "time": 1574507108531, "rating": 5.0, "text": "Great place to stay for Alabama football season.  Owners are very friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "112468903140003614435", "name": "Steven Riley", "time": 1524521467577, "rating": 5.0, "text": "Very nice RV Park. The Lady at the front desk was as pleasant as they come. The park is gravel roads and sites. The sites are fairly large and the hookups are very convenient. Had no problem maneuvering my 42’ MH and full size pickup toad. There are train tracks at the back of the park. We never heard a horn the night we were there. I would certainly stay there again.\nSteve Riley", "pics": null, "resp": null, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "106210031728815225546", "name": "Merle Baker", "time": 1568504925515, "rating": 4.0, "text": "This was an easy place to get to but we were told they had pull throughs because that is what we had to have. Upon arrival we were told they do not have pull throughs. The lad on duty in the office was very nice and accommodating. She found a spot that was not being used that allowed us to pull though. We were just staying one night & did not want tonunhook our tie vehicle. So beware, if you need a pull though, don’t go here. Other than that it was fine.", "pics": null, "resp": null, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "103711790287364504341", "name": "Shawna Peterson", "time": 1554383684346, "rating": 5.0, "text": "We stayed here four months. The people in the park are friendly. The staff is terrific. We would definitely stay here again. Thanks for everything Bama RV !", "pics": null, "resp": null, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "104259116217701136699", "name": "Jennifer Gresham", "time": 1525986077423, "rating": 5.0, "text": "Staff is super helpful and friendly. Very convenient to the interstate, campus, and downtown. Nice amount of space for each rig and easy to get in and out of. Resident doggo Cooper is the best!!", "pics": null, "resp": null, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "100479627590604740322", "name": "Jon DeLuca", "time": 1532874658042, "rating": 5.0, "text": "Very friendly staff, gravel road and sites, very easy to move my 41' fifth wheel in and out with ease. Good place to stay long term as well as tailgate! Roll Tide", "pics": null, "resp": null, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "101123444969129438016", "name": "Robert Slade", "time": 1555076132011, "rating": 4.0, "text": "Stopped for one night in our motorhome.  Had a pull thru with 50A.  Nice clean park.  Very friendly at check-in.  Will stay here again.", "pics": null, "resp": null, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "105782440895175496961", "name": "Cindy Wilson", "time": 1573250605589, "rating": 5.0, "text": "4th year we've enjoyed a  AL football season.", "pics": null, "resp": null, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "115143996063557152765", "name": "LP", "time": 1524154880171, "rating": 5.0, "text": "We love Bama RV Station!  Staff is super friendly and helpful.  Great place to store your RV if you need to.", "pics": null, "resp": null, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "106924047704947380227", "name": "Debbie Daniels", "time": 1562869075174, "rating": 4.0, "text": "Nice place for one night.  Clean, good price.", "pics": null, "resp": null, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "117152035690116877215", "name": "J Thompson", "time": 1527103775192, "rating": 5.0, "text": "We came down for a game last season.  It was a lot of fun.  The staff is very friendly and accomodating.", "pics": null, "resp": null, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "113286077654207862687", "name": "Justin Keeton", "time": 1559508318785, "rating": 3.0, "text": "Very nice spot clean  lots i wasnt staying but a friend was if i had a camper id definitely  reccomend  this spot if you need somewhere  in the Tuscaloosa  area", "pics": null, "resp": null, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "110171569502262849621", "name": "Madison R", "time": 1525809534367, "rating": 5.0, "text": "We really enjoyed our stay!  It was a perfect little home away from home.", "pics": null, "resp": null, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "106727989437819144197", "name": "--", "time": 1521099746097, "rating": 1.0, "text": "Overhyped and overpriced. While the service is good they allow no long term rentals and they cater only to football fans . If you want a long term and more affordable RV park hit up sunset or Avalon .\n\nDon't mean to be mean but if you're an rv park you should cater to anyone that is a patron. Not everyone lives and breathes beer and football.", "pics": null, "resp": null, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "109207944471717581462", "name": "Lindon Allen", "time": 1525435588320, "rating": 5.0, "text": "Close to interstate, 50 amp service, southern hospitality, large camp spots, restaurants nearby, Walmart nearby, what more could you ask for?", "pics": null, "resp": null, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "100311744034767455507", "name": "Byrd Mathis", "time": 1562549662954, "rating": 5.0, "text": "Clean grounds, level pads, several dog runs. Only drawback is no restrooms. Have stayed here in the past and would stay in the future.", "pics": null, "resp": null, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "117779671230952048856", "name": "Stephanie S.", "time": 1492899353412, "rating": 5.0, "text": "This was a great RV park! We stayed here for 2 months and had a great experience. The people that run the RV park are very nice and helpful. It's a great location, it's located about a mile off the interstate and not far from gas stations, grocery stores etc. They also have GREAT Wi-Fi !! Which is very hard to find when staying at a RV park. I definitely recommend this RV park if your staying in the Tuscaloosa/Cottondale area.", "pics": null, "resp": null, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "114002274215653699069", "name": "Tom Kent", "time": 1543180984029, "rating": 3.0, "text": "Nothing more than a parking lot with hookups. OK place for a couple of nights.", "pics": null, "resp": null, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "117970945746788131385", "name": "Robert Nelson", "time": 1567167745193, "rating": 4.0, "text": "Good place to park the RV.", "pics": null, "resp": null, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "113585086251958370446", "name": "Llama D", "time": 1547842111676, "rating": 5.0, "text": "Great customer service!", "pics": null, "resp": null, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "108345265051535730907", "name": "Lisa Reid", "time": 1533077309800, "rating": 4.0, "text": "Good place to stay in Tuscaloosa", "pics": null, "resp": null, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "108195780485166486922", "name": "Kymberly Selvage", "time": 1534616989019, "rating": 2.0, "text": "I was only there for a second", "pics": null, "resp": null, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "103900182658681390204", "name": "B Longson", "time": 1530153692860, "rating": 1.0, "text": "No bathrooms or  showers", "pics": null, "resp": null, "gmap_id": "0x8888a92bb085ac1d:0xde4951dee164b3f5"}
{"user_id": "114982892142146841136", "name": "Chris Everidge", "time": 1531345128833, "rating": 1.0, "text": "They closed it off to public parking. Screw y all greedy bastids.", "pics": null, "resp": null, "gmap_id": "0x888ccdb742066ab3:0x9602bb3ef4de9fd3"}
{"user_id": "106367481005018422786", "name": "Robert Schumaker", "time": 1535896358855, "rating": 3.0, "text": "Just another parking garage. However, the automated ticket and money exchanger did not work. I had to press a button and someone had to let me out.", "pics": null, "resp": null, "gmap_id": "0x888ccdb742066ab3:0x9602bb3ef4de9fd3"}
{"user_id": "117542877037314467623", "name": "Terry Willcutt", "time": 1577576655562, "rating": 5.0, "text": "Great Place", "pics": null, "resp": null, "gmap_id": "0x88891be9a9cf18cd:0xf0e222d3991d4b5e"}
{"user_id": "102828829440734211529", "name": "David", "time": 1548275745370, "rating": 4.0, "text": "Parking was fine. What can you say about parking? I was able to park and the building didn't collapse. The price was better than some of the lots around it. I think there may be something wrong with the elevators as they each carried people off and never came back. I parked there for a concert and it took me quite a while to get an elevator because they were so slow and I'm temporarily walking impaired so I couldn't take the stairs. Once I got to my car it took me an hour to get out. Seriously, an hour. I don't know why or whose fault that was because I was trapped in a parking garage and couldn't see what was going on at the exit. Also, it could use some toilets. As it was taking a long time to leave I saw several people, including one right beside my car, relieve themselves on the floor.", "pics": null, "resp": null, "gmap_id": "0x88891b9ab330ba3f:0x3d18aea3dbe3d766"}
{"user_id": "110809505574501361368", "name": "Tyler Douglas", "time": 1516492003739, "rating": 4.0, "text": "Bring $2 in cash. It will spit out $18 in quarters. Also there's no ATM nearby so if you have a card you'll walk several blocks and be hit up by vagabonds once every 2 blocks who \"just need 48¢.\" Everything else is convenient and great however. Please get a card reader.", "pics": null, "resp": null, "gmap_id": "0x88891b9ab330ba3f:0x3d18aea3dbe3d766"}
{"user_id": "118246832109844484650", "name": "Amy Beard", "time": 1576042272869, "rating": 4.0, "text": "Special Event Parking is only $10 up front.  Very convenient to BJCC, Boutwell, and Alabama School of Fine Arts.", "pics": null, "resp": null, "gmap_id": "0x88891b9ab330ba3f:0x3d18aea3dbe3d766"}
{"user_id": "104450480299933110991", "name": "Paul Calhoun", "time": 1514171608949, "rating": 3.0, "text": "Great parking well great lightning and has Security and great prices", "pics": null, "resp": null, "gmap_id": "0x88891b9ab330ba3f:0x3d18aea3dbe3d766"}
{"user_id": "107845712347994200193", "name": "Edmund Martinez", "time": 1573919646592, "rating": 4.0, "text": "A++", "pics": null, "resp": null, "gmap_id": "0x88891b9ab330ba3f:0x3d18aea3dbe3d766"}
{"user_id": "116292333659035092447", "name": "John Graf", "time": 1564585451821, "rating": 5.0, "text": "Ok parking, but others are closer", "pics": null, "resp": null, "gmap_id": "0x88891b9ab330ba3f:0x3d18aea3dbe3d766"}
