{"user_id": "103363720445682827670", "name": "Jason Sims", "time": 1616181840203, "rating": 1.0, "text": "Called 5 times while they were open and got no answer.", "pics": null, "resp": null, "gmap_id": "0x8884e3c40a18584b:0xa6032d242f676b15"}
{"user_id": "106723578647519658562", "name": "clang theo", "time": 1487342015287, "rating": 4.0, "text": "Friendly service with the standard odd hours.   Helpful with packing and other services.", "pics": null, "resp": null, "gmap_id": "0x8884e3c40a18584b:0xa6032d242f676b15"}
{"user_id": "108712514804647397132", "name": "Walt Gay", "time": 1484314393725, "rating": 4.0, "text": "Fast and friendly service", "pics": null, "resp": null, "gmap_id": "0x8884e3c40a18584b:0xa6032d242f676b15"}
{"user_id": "107778050002282193886", "name": "Lanore Smith", "time": 1616253487453, "rating": 5.0, "text": "Everyone at this branch is nice and helpful.", "pics": null, "resp": null, "gmap_id": "0x888b914c2c1867b3:0xcfbc00ee93e0c388"}
{"user_id": "108902022353972918259", "name": "Deborah Phillips", "time": 1602942424212, "rating": 2.0, "text": "I had them to hold my mail for a few days and one of the ladies is so rude to me. When I ask her for my mail she always says that there isn't any today without even looking to see.", "pics": null, "resp": null, "gmap_id": "0x888b914c2c1867b3:0xcfbc00ee93e0c388"}
{"user_id": "101222381238073974696", "name": "Nikki H", "time": 1548696473958, "rating": 1.0, "text": "I live in Ashland and sadly this post office has caused several issues for me returning important mail after being listed as \"moved with no return address\" which I hadn't. The employees at the counter are usually friendly and very helpful. I have forwarded all my mail to the PO box from now on and I guess eventually it will be recognized as forwarded.", "pics": null, "resp": null, "gmap_id": "0x888b914c2c1867b3:0xcfbc00ee93e0c388"}
{"user_id": "115687400149690582965", "name": "Bonnie Q. Calihua", "time": 1570650622069, "rating": 5.0, "text": "Great place. Long time employees. Got passports  with mo issues.", "pics": null, "resp": null, "gmap_id": "0x888b914c2c1867b3:0xcfbc00ee93e0c388"}
{"user_id": "116892582723324356172", "name": "shannon higgins", "time": 1554757162089, "rating": 1.0, "text": "Was in twice in the last week, rudest employees I’ve ever had to deal with.", "pics": null, "resp": null, "gmap_id": "0x888b914c2c1867b3:0xcfbc00ee93e0c388"}
{"user_id": "107086019525882446283", "name": "Lila Wild", "time": 1628771921406, "rating": 4.0, "text": "Nice very SMALL country post office. We got our passport applications and photos done here.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNDguff_CMEaoBxjht3KtkG6ybglMW6dEU6Q9YC=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM3Kk0dT1KgZQ2MSx730ldVshr7UfjcGUn3csiA=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNthyYah23efkIqz-Z8QkKQg1-49janvz8XXVaz=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNe8lVt3jQWyO6kK6HH5jW-RPyKYzUbXxtynT_r=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888cc8ae098cf8e1:0x5ae66be8bafc8f37"}
{"user_id": "117827033633217374947", "name": "Jonathan Bain", "time": 1625700748326, "rating": 5.0, "text": "I picked up a money order the other day and they helped me in understanding how it works purchasing, completing and tracking it.  I sent two items today, a package and a letter, Express mail and the person helped me in getting everything correct for shipment and delivery.  It seems to me like they have pretty good customer service being very helpful and courteous both times.", "pics": null, "resp": null, "gmap_id": "0x888cc8ae098cf8e1:0x5ae66be8bafc8f37"}
{"user_id": "114158003244320666688", "name": "Megan Keno", "time": 1623676737927, "rating": 1.0, "text": "Automation says package delivered to my box. No it is not. I want my package. Why is it no person answers a phone just a crazy automated voice that does not give you the information you want. Why all the garbage about COVID  get over it.", "pics": null, "resp": null, "gmap_id": "0x888cc8ae098cf8e1:0x5ae66be8bafc8f37"}
{"user_id": "101263337926912499642", "name": "Latrice Walker", "time": 1627308288722, "rating": 1.0, "text": "I don’t think the mailman can read! Half the time we get other people mail or our mail end up in their mailbox. And I was supposed to received a package Saturday. Never got it! It said it was delivered so where the heck is it?", "pics": null, "resp": null, "gmap_id": "0x888cc8ae098cf8e1:0x5ae66be8bafc8f37"}
{"user_id": "116001272068841885831", "name": "Ckss Bush", "time": 1619321643519, "rating": 1.0, "text": "My first time at this location and was an awful experience. The guy working there needs to not work with the public he is very rude and not helpful at all.\nCome on Postal Service set standards and hold your employees liable ... DO BETTER", "pics": null, "resp": null, "gmap_id": "0x888cc8ae098cf8e1:0x5ae66be8bafc8f37"}
{"user_id": "111500909127422292212", "name": "Katherine s", "time": 1617114790657, "rating": 5.0, "text": "I have always had a good experience doing business at this post office. Anytime I have had any issues with deliveries the staff have been very cooperative and sincerely concerned with resolving the problem. Right now there seems to be some confusion with deliveries to my address due to the city transitioning residents from numbered lee road addresses to street addresses with names. I hope this will be resolved soon as I do a lot of online shopping.", "pics": null, "resp": null, "gmap_id": "0x888cc8ae098cf8e1:0x5ae66be8bafc8f37"}
{"user_id": "100020566758394137441", "name": "christopher yingling", "time": 1601487706896, "rating": 1.0, "text": "First off I didn’t appreciate being profiled when I came in to this post office to do a money order transaction. The woman in the back who started to make up that emails came in saying that everyone has to be carded for making a money order transactions. Even tho both employees in the front said that wasn’t protocol with the amount I was getting. I just want to say thank you for profiling me because I have tattoos all over me. Guess if I was still wearing the uniform it wouldn’t have been an issue. Just know that your services at this post office will no longer be of use to me and my business.", "pics": null, "resp": null, "gmap_id": "0x888cc8ae098cf8e1:0x5ae66be8bafc8f37"}
{"user_id": "110766299631285923149", "name": "randy hall", "time": 1581980772169, "rating": 4.0, "text": "I have had no problems here. My daughter lives out of state so I ship often. They always give an accurate arrival date even during the holidays and their staff is great. Sometimes there is a long wait but it's a very small location with only 1 or 2 people working the counters but they are super friendly. Great experiences here", "pics": null, "resp": null, "gmap_id": "0x888cc8ae098cf8e1:0x5ae66be8bafc8f37"}
{"user_id": "115515885091378217042", "name": "Gremblo Gremblo", "time": 1596819349971, "rating": 2.0, "text": "Still waiting on my package that should have been here 3 days ago. No way to call and talk to somebody about it either.", "pics": null, "resp": null, "gmap_id": "0x888cc8ae098cf8e1:0x5ae66be8bafc8f37"}
{"user_id": "116704515422043146752", "name": "Janelle Briscoe", "time": 1593107543786, "rating": 1.0, "text": "What's the point of having a phone if you dont answer it?", "pics": null, "resp": null, "gmap_id": "0x888cc8ae098cf8e1:0x5ae66be8bafc8f37"}
{"user_id": "116849989812306080455", "name": "James B", "time": 1552243612628, "rating": 1.0, "text": "I have had several times the same problem others have stated. I'm home all the time and dont get my packages delivered. I get emails stating delivery attempted but that is complete BS. I even have security cams showing the driver never getting out of the car.", "pics": null, "resp": null, "gmap_id": "0x888cc8ae098cf8e1:0x5ae66be8bafc8f37"}
{"user_id": "100871946441503948777", "name": "Matt", "time": 1601484603143, "rating": 1.0, "text": "Still waiting on a package that should have been here 2 days ago. The customer service number tells you nothing besides they can’t help. And you think I’m gonna let you handle a mail in ballot for me???? 😆😆 heck no!!!", "pics": null, "resp": null, "gmap_id": "0x888cc8ae098cf8e1:0x5ae66be8bafc8f37"}
{"user_id": "114838106872439366422", "name": "Debbie Elzey", "time": 1557523115139, "rating": 1.0, "text": "The lady is the only.one that is nice. The younger guy is plain out smart talking to people . He has a unfriendly manner and does not need a job out front.", "pics": null, "resp": null, "gmap_id": "0x888cc8ae098cf8e1:0x5ae66be8bafc8f37"}
{"user_id": "102019924461956424584", "name": "Thereal Mc", "time": 1595265056967, "rating": 1.0, "text": "Mail left on ground, bent flag what customer service?", "pics": null, "resp": null, "gmap_id": "0x888cc8ae098cf8e1:0x5ae66be8bafc8f37"}
{"user_id": "103926413716257240820", "name": "Shannon Pickard", "time": 1592848269400, "rating": 1.0, "text": "Many delivery issues, and holding mail", "pics": null, "resp": null, "gmap_id": "0x888cc8ae098cf8e1:0x5ae66be8bafc8f37"}
{"user_id": "110863475159733315495", "name": "joseph carman", "time": 1535375321700, "rating": 5.0, "text": "Nice people, location can get crowded sometimes but they work as quickly as possible to get you in and out.", "pics": null, "resp": null, "gmap_id": "0x888cc8ae098cf8e1:0x5ae66be8bafc8f37"}
{"user_id": "109759281422254031199", "name": "Reg Desousa", "time": 1469556724999, "rating": 5.0, "text": "Friendly service :).Those people are wonderful in there they go above and beyond.", "pics": null, "resp": null, "gmap_id": "0x888cc8ae098cf8e1:0x5ae66be8bafc8f37"}
{"user_id": "111980463253890744449", "name": "Linda Gill", "time": 1489860835689, "rating": 1.0, "text": "We had to move our mail box bc FedEx Guy or UpS trucks kept backing over it..Since then The Man man is prissy about where we sat it up out of the way of our neighbors driveway. So needless to say he is holding our mail .I guess I will have to show my face at the post office .", "pics": null, "resp": null, "gmap_id": "0x888cc8ae098cf8e1:0x5ae66be8bafc8f37"}
{"user_id": "117831129164468557302", "name": "Ko H", "time": 1462038367038, "rating": 1.0, "text": "I needed a package delivered to my house and they left a note and DID NOT knock on the door. I didnt receive my package in time, eventhough they had it. Horrible.", "pics": null, "resp": null, "gmap_id": "0x888cc8ae098cf8e1:0x5ae66be8bafc8f37"}
{"user_id": "106379513773432202986", "name": "Derek Hurst", "time": 1431966225981, "rating": 1.0, "text": "I shipped a package to the Philippines on May 4th 2015 and paid $30 for 3 to 5 day delivery. Today is May 18th and it still has not arrived. I also sent another package to the same place in the Philippines on May 11th and paid $50 for a guarantee 3 day delivery. Again it is May 18th and this package has not arrived either. They both say in transit. I called to speak with the Post Master. They took my name and number and have not called me back since..... Not impressed at all.", "pics": null, "resp": null, "gmap_id": "0x888cc8ae098cf8e1:0x5ae66be8bafc8f37"}
{"user_id": "109108186944086239680", "name": "Jay “Honeycomb” Holcomb", "time": 1504904306039, "rating": 1.0, "text": "This NOT a real post office. It's a residential neighborhood which is a cul-de-sac.", "pics": null, "resp": null, "gmap_id": "0x888cc8ae098cf8e1:0x5ae66be8bafc8f37"}
{"user_id": "103907586509967879594", "name": "Queen Gemini", "time": 1499895786027, "rating": 1.0, "text": "These incompetent people lost my package from JustFab & then claiming that they're computers are down! Such bs! Not to mention they will put your mail in other people's mailbox. If you can't do your job correctly then you need to work somewhere else!", "pics": null, "resp": null, "gmap_id": "0x888cc8ae098cf8e1:0x5ae66be8bafc8f37"}
{"user_id": "100204142776762956085", "name": "Volodymyr Dubinin", "time": 1510335697755, "rating": 5.0, "text": "Good job!", "pics": null, "resp": null, "gmap_id": "0x888cc8ae098cf8e1:0x5ae66be8bafc8f37"}
{"user_id": "103886178601283579197", "name": "Red See", "time": 1539308186801, "rating": 1.0, "text": "This", "pics": null, "resp": null, "gmap_id": "0x888cc8ae098cf8e1:0x5ae66be8bafc8f37"}
{"user_id": "105514956679590759685", "name": "Danielle theHanyo", "time": 1618188132819, "rating": 5.0, "text": "I love this place. The employees are always very helpful and we've never really had any problems with anything at all. We end up coming in fairly regularly too and mailing out a ton of mail all over the world and the closest thing to a problem was a mix up on an address to Austria (the guy thought it was supposed to go to Australia) and it took us a moment to catch it too so like... Not a big deal. We caught it in time and beyond that every time we've gone it's been a good experience. I wouldn't say fun exactly but I don't dread going there and the wait time is never over 10 minutes when they're crowded.", "pics": null, "resp": null, "gmap_id": "0x888861142eb3826f:0xbb77a0f331566f4d"}
{"user_id": "115541571875333862855", "name": "Pamela Pugh", "time": 1592945706459, "rating": 5.0, "text": "I had a seller mail a package in a flat rate box and only paid for 1 ounce so additional money was due, the Postmaster Greg hand delivered me this package and did not send it back even though he could have chosen that route. I live 10 miles from post office so this shows the character that our Jasper, Alabama Postmaster has, He cares about people and our mail! Thank you GREG for your generosity and going beyond your job duties!", "pics": null, "resp": null, "gmap_id": "0x888861142eb3826f:0xbb77a0f331566f4d"}
{"user_id": "106264257081488394766", "name": "Misti Estes", "time": 1588419607840, "rating": 4.0, "text": "The postal workers are very helpful. Always greet there patrons with How can I help you and Thank you at the end. Very knowledgeable of rules and regulations. Most of the office workers have worked there for several years.", "pics": null, "resp": null, "gmap_id": "0x888861142eb3826f:0xbb77a0f331566f4d"}
{"user_id": "112096237596507358940", "name": "Patti Griffith", "time": 1581405572370, "rating": 5.0, "text": "The employees are always nice and helpful. Service is very fast, usually at least three clerk's are\nworking at a time. You can get all\nyour shipping material here, nice greeting cards, gift cards to almost anything you want, and Jasper, Alabama United States\nPostal always has a great\nvariety of postage stamps. 💯", "pics": null, "resp": null, "gmap_id": "0x888861142eb3826f:0xbb77a0f331566f4d"}
{"user_id": "112969626038498345337", "name": "A JRuck", "time": 1577368224569, "rating": 5.0, "text": "They are always super friendly and keep things running. For the amount of packages I receive, I never have any problems.", "pics": null, "resp": null, "gmap_id": "0x888861142eb3826f:0xbb77a0f331566f4d"}
{"user_id": "103713204737770465834", "name": "Mecachu 64", "time": 1528393793805, "rating": 1.0, "text": "Absolutely AWFUL!!! I've always taken my prepaid packages to Carbon Hill and they were sent out perfectly, Jasper's employees on the other hand came up with every excuse in the book on why they couldn't mail my package (the USPS tape can't be accepted, the box size, the label, literally anything). Today I take the same package to CH and it's mailed off with no problem, also found out the employees at Jasper LIED, there was nothing wrong with the box or the label and the tape is THE ONLY TAPE USPS CAN ACCEPT!!! Getting things mailed off at Jasper would be a lot easier if the employees would want to do their job instead of being lazy. From now on when staying in Jasper I'll just make a longer trip to CH where the employees actually know what they are doing!", "pics": null, "resp": null, "gmap_id": "0x888861142eb3826f:0xbb77a0f331566f4d"}
{"user_id": "104954957013117576493", "name": "Kiley Smith", "time": 1564236654466, "rating": 3.0, "text": "Need a proper contact number and not this automated junk..been trying for over 30 minutes just to try an get a person.", "pics": null, "resp": null, "gmap_id": "0x888861142eb3826f:0xbb77a0f331566f4d"}
{"user_id": "117741822486497741340", "name": "Sandra Courington", "time": 1576271441573, "rating": 5.0, "text": "Most friendly and helpful post office in our area!!", "pics": null, "resp": null, "gmap_id": "0x888861142eb3826f:0xbb77a0f331566f4d"}
{"user_id": "117268371176897494478", "name": "Kelleigh Killingsworth", "time": 1519400532579, "rating": 5.0, "text": "Very helpful and sweet ladies working here. They even helped me wrap the china I was shipping when I said I was in a hurry!", "pics": null, "resp": null, "gmap_id": "0x888861142eb3826f:0xbb77a0f331566f4d"}
{"user_id": "105563731037172907530", "name": "Margaret Spears", "time": 1526190217928, "rating": 4.0, "text": "JASPER POST OFFICE-Southern Hospitality At It's Best.", "pics": null, "resp": null, "gmap_id": "0x888861142eb3826f:0xbb77a0f331566f4d"}
{"user_id": "116031215412896646826", "name": "Samson Kirby", "time": 1552157458311, "rating": 1.0, "text": "This is the 2nd time that my paycheck has been delivered to someone else's address!! How about hiring people who actually want to do their job!", "pics": null, "resp": null, "gmap_id": "0x888861142eb3826f:0xbb77a0f331566f4d"}
{"user_id": "106114887906564363200", "name": "Kristopher McGregor", "time": 1360269253572, "rating": 2.0, "text": "This postal service is full of idiots, i have had 5 total packages lost by them, Tracked them all the way to Jasper and the Jasper Post officer either loses them or misdelivers them. 1 of them was even my Check. I hate living in a town where most elementary school kids could deliver the post more accurately than them.", "pics": null, "resp": null, "gmap_id": "0x888861142eb3826f:0xbb77a0f331566f4d"}
{"user_id": "116837075617252212636", "name": "Avis Hudson", "time": 1401272948396, "rating": 5.0, "text": "The employees for the most part are very helpful and knowledgable.", "pics": null, "resp": null, "gmap_id": "0x888861142eb3826f:0xbb77a0f331566f4d"}
{"user_id": "101214016902265167533", "name": "Jessica pittman", "time": 1454022617153, "rating": 1.0, "text": "Worst service I have ever received. Their mailman Bryan put down that he delivered two of our packages in a mailbox (which we do not have a mailbox) and then tries to say that he delivered it to someone at our kiosk. I've spoke to every employee and no one has received either package! Our customers are steaming mad Bc their products have not come in so I called the office and spoke to a woman named Cindy I believe which was very rude and said that she talked to a female that said she claimed that she received the part and that she thought she had misplaced it. Funny thing is is I am the only female working here and I received no calls. I asked Cindy who this persons name was and she couldn't remember apparently. She also said that Bryan said he may have dropped it off at the store beside us that he couldn't remember. I've spoke to the owner the manager and the employees and they all said that they never received our package and that none of them have received a phone call from her. I figured it may have been the mall manager so I called her, nope not her either. I asked for some kind of proof that it was delivered and they could not give me any form of proof, I asked why he documented that it was delivered to a mailbox and he was saying he delivered it to us (why is the documentation off u know) and she said oh well they sometimes accidentally push the wrong button and file it wrong. So on top of them losing two of our packages and lying to us and having false documentation they are now saying that they are not gonna reimburse us for any of our packages they have lost. And because we now have to order another product AGAIN FOR THE THIRD TIME we will now be losing money from our business, the customers are steaming mad, and they have made business very difficult and we no longer trust them. Keep in mind my owners do business for 46 franchises and they are still growing! They have agreed that we will never be using USPS again. Their service is awful and I'll be so happy to know that I will never have to deal with them again!", "pics": null, "resp": null, "gmap_id": "0x888861142eb3826f:0xbb77a0f331566f4d"}
{"user_id": "117059309387077263080", "name": "Shannon Michelle Clark", "time": 1460058448306, "rating": 5.0, "text": "I had loooong help n she was grrrrrrrreat!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x888861142eb3826f:0xbb77a0f331566f4d"}
{"user_id": "106389260908282547845", "name": "Tammy Campbell", "time": 1517004814661, "rating": 1.0, "text": "Our mail person doesn't know or will not put our mail in right mail box.", "pics": null, "resp": null, "gmap_id": "0x888861142eb3826f:0xbb77a0f331566f4d"}
{"user_id": "106282218690321493986", "name": "Jason Latham", "time": 1471129711800, "rating": 4.0, "text": "Mail carrier comes by at the same time every day", "pics": null, "resp": null, "gmap_id": "0x888861142eb3826f:0xbb77a0f331566f4d"}
{"user_id": "108333285687161874316", "name": "Art Of Valor", "time": 1617691186028, "rating": 5.0, "text": "From what I've read, the first Piedmont, Alabama post office was resurrected in the mid 1800's. This building is very old but has been remodeled and kept up well over the years. Always enjoyed the atmosphere here.", "pics": null, "resp": null, "gmap_id": "0x888a58724b29e4b7:0xebdeace4798d816b"}
{"user_id": "110194561389775770191", "name": "Krystal Moore", "time": 1613240171535, "rating": 2.0, "text": "Most of the clerk's are just fine.\nShelia ruins it for the whole post, though. She never wears her mask properly. She is ALWAYS rude and short with customers that she doesn't know or who aren't overly friendly with her. We've watched her bully and talk down to many customers over the years...she has no business working with the public.\nI'm leaving a review now because things seem to be getting worse. I recently witnessed Shelia checking a customer out, and insinuating to another employee that bad things happen to some people's packages. Obviously the customers in line would assume that she was referring to the package that she was currently processing.\nWe have never had a problem with our delivery...just our encounters with Shelia. She should not work with the public.", "pics": null, "resp": null, "gmap_id": "0x888a58724b29e4b7:0xebdeace4798d816b"}
{"user_id": "106342329243401536525", "name": "Pam Love", "time": 1607697167351, "rating": 1.0, "text": "You pay outrageous prices for 2 day service and it takes 5 days for delivery and even with that they still didnt deliver. I am noy sending anything else USPS. I could walk and deliver it in person faster. Then you go to post office for a refund only to have to stand and wait for 2 hours because the post master has left for lunch at 2p and there are not sure the postmaster is even coming back to finish the day. If you cant overnight or express mail then its quite simply take it down until you can do your jobs. While I was at the,post office several people came in to send mail express. They gladly take your money knowing they cant deliver like they are paid to do. I am very 😡 with the service I received while there the anger and smart comments were uncalled for.", "pics": null, "resp": null, "gmap_id": "0x888a58724b29e4b7:0xebdeace4798d816b"}
{"user_id": "106227816169836857921", "name": "indrid cold", "time": 1612796394322, "rating": 1.0, "text": "Shelia is very rude and not cut out to work with the public. Shipping is horrible even before covid. The Post office is a waste of tax payers money imo.", "pics": null, "resp": null, "gmap_id": "0x888a58724b29e4b7:0xebdeace4798d816b"}
{"user_id": "105350169627365314903", "name": "Karen Towne", "time": 1582144966392, "rating": 5.0, "text": "The two clerks ( blonde and brunette) were working when I stopped by and they were very nice. They answered my questions and helped me with my packages. Really liked the building also, pretty old but clean. Definitely will go back!", "pics": null, "resp": null, "gmap_id": "0x888a58724b29e4b7:0xebdeace4798d816b"}
{"user_id": "102737276944295523614", "name": "Terry Smart", "time": 1582500163928, "rating": 4.0, "text": "There was only one clerk working up front when I went so it’s understaffed. There was a loud older lady eating at a table, while the clerk that helped me was doing everything else. However, the clerk that helped me was very friendly. I asked about the flag and a woman in the back came up and talked to me and my wife. Other than the very loud woman, it was a pleasant experience.", "pics": null, "resp": null, "gmap_id": "0x888a58724b29e4b7:0xebdeace4798d816b"}
{"user_id": "118204654374210124720", "name": "Cindy Kohl", "time": 1560261963419, "rating": 2.0, "text": "I usually have good things to say about folks but the new mail carrier on my route is LACKING. My mail is left with my neighbors mail in their boxes at times. Not always, mind you, just sometimes. And Why is it that our carrier will leave 2 out of 3 packages stuffed inside our jumbo box, and take the 3rd back with him causing Amazon to notify me that the carrier COULD NOT MAKE IT TO MY DOOR to leave my package and that I must contact the carrier to track it down?? My front door is about a hundred or so yards from my  mailbox & the carrier has left packages at my front door before numerous times. However,  yesterday he could not. I called the Post Office, spoke with the supervisor on June 11, 2019, tried to find out where my package was like Amazon told me to do, and  after a brief hold was told shortly & quickly the carrier will bring my package out today and the call was disconnected. How rude.  Why was it not left yesterday with the other two packages that WERE delivered?? Were there dragons in my driveway he just could not overcome??  And for over a month now, for some reason when the carrier tries to leave my mail the door on my mailbox decides to attack and tears itself from the box and flings itself into the ditch. My husband has tried to force it to stay by installing new rivets to hold the door on the box on (2) two separate occasions. We have finally stepped up to using bolts to fasten the door to the box. We sincerely hope this will stop our wayward mailbox from acting so rudely to our mail carrier. Hopefully this will help encourage our carrier to know we care about our mail and packages and appreciate him doing the same. He can leave our packages at our door anytime. 😊", "pics": null, "resp": null, "gmap_id": "0x888a58724b29e4b7:0xebdeace4798d816b"}
{"user_id": "117313529789430027579", "name": "Donna Hill", "time": 1559569670737, "rating": 1.0, "text": "Every time I have been in this post office or my granddaughter the lady is very rude & ugly. It’s a shame to go in for something & be treated so rude. If you work with the public you should be nicer. I think that old lady needs to retire or get a job that’s nit around the public. We the customers don’t deserve to be treated so ugly.", "pics": null, "resp": null, "gmap_id": "0x888a58724b29e4b7:0xebdeace4798d816b"}
{"user_id": "113056059818173689063", "name": "Bobbie Garrett", "time": 1578426037125, "rating": 1.0, "text": "Left my package leaning against the tree down the road!  UNACCEPTABLE!!!!", "pics": null, "resp": null, "gmap_id": "0x888a58724b29e4b7:0xebdeace4798d816b"}
{"user_id": "115860994686039741852", "name": "Ashley Delevie", "time": 1475082036566, "rating": 1.0, "text": "Very rude ppl..I have to chase the mailman down BC he never leaves my packages. When I call they say deal with it and refuse to contact the mailman. This is 8 times straight today...4 packages out for delivery and not the first one got left. I'm seriously thinking about contacting my lawyer and pursuing the matter.", "pics": null, "resp": null, "gmap_id": "0x888a58724b29e4b7:0xebdeace4798d816b"}
{"user_id": "110627657690529358517", "name": "Matt Jennings", "time": 1560287148878, "rating": 1.0, "text": "Staff is rude, and they ALWAYS close up 3 to 5 minutes early.", "pics": null, "resp": null, "gmap_id": "0x888a58724b29e4b7:0xebdeace4798d816b"}
{"user_id": "107224239356902836115", "name": "Tracey Delevie", "time": 1502956197686, "rating": 1.0, "text": "Never ever ever get my package delivered like it says when I track today 6 emails saying different times..what is your problem USPS.", "pics": null, "resp": null, "gmap_id": "0x888a58724b29e4b7:0xebdeace4798d816b"}
{"user_id": "106817812966013481468", "name": "April Ford", "time": 1469879202066, "rating": 3.0, "text": "Everything I have ever had to go in and deal with anyone, they have always been super rude from the get go then they act like they really don't want to speak to you, and they typically hassle you about your business", "pics": null, "resp": null, "gmap_id": "0x888a58724b29e4b7:0xebdeace4798d816b"}
{"user_id": "115816483976344585475", "name": "Jaí Frenshá", "time": 1627491008053, "rating": 1.0, "text": "The big black man has a AWFUL attitude! I’ve left plenty of reviews not wanting people fired but he needs to be gone or at least not worked in the front! So sad how his own co workers seems afraid of him", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "101839352602626408356", "name": "Mrs. Lenora", "time": 1623264112300, "rating": 1.0, "text": "The customer service is horrible! Sue at the front counter was very rude and her manager was standing there listening to the entire conversation, but did not acknowledge the wrongdoing of his employee. Only certain customers were greeted and acknowledged upon arrival. This is not the first horrible encounter that I had at this post office. It doesn’t cost a thing to be nice and considerate of others.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "109596159184742812276", "name": "DAVID NAYLOR", "time": 1623271868819, "rating": 1.0, "text": "As a small business owner I am dependent on the USPS for timely deliveries. Unfortunately, this particular location is the absolute worst at every step in the delivery process. I have had packages not scanned and checked in, packages lost, rude customer service, and missing mail requests go unsearched. Do not drop off your packages in the overnight bin either. They will get ignored and not scanned in.....Was recently advised that I could check in my own packages using the kiosk outside. Unfortunately, not all types of shipping can be checked in. So I go inside to report the problem. The only feedback after telling them the issue was to leave the lobby because I didn't have mask.....Helena Post Office is wonderful! Alabaster office is nice too! This was the last straw. No more Pelham USPS.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "111261477496967709202", "name": "Ashley Campbell", "time": 1623443025488, "rating": 1.0, "text": "Don’t waste your time. People working there are disrespectful, lazy and rude! Do not go there for a passport application/services because you will get nowhere. As I was walking into the post office two of the employee male and female we’re talking rudely about a customer who just walked out in front of other people.\nJust save yourself some time and go to a different location because this is the absolute worst post office ever and I don’t know how they still have a job. I have never seen anybody so rude and disrespectful while sitting on their behind and judging people in front of others", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "106842874355857950676", "name": "Jack Mc", "time": 1622385856739, "rating": 1.0, "text": "The worst. Read other reviews and your going to get a good idea about what to expect from this PO. Packages marked as delivered, but not. Mail delivered to neighbors. Packages stuffed/crammed tightly into the mailbox. Or simply left on the ground by the mailbox instead of being placed in a more secure area (front door, side door, by the garage, etc.). And forget calling them... the phone will ring and ring for about 3 minutes before disconnecting. Do yourself a favor and use another service or PO if at all possible.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMcHy_fubSkh6tMuNKjgEFq_YXDrblL11Bgb1_4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPJJEednGvzWGF_g8rddEFOGeZmi-BEjr5Pm3aS=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMV-Nm_EWgrirREwwz5mTFtfydK_1JKDnJExQO8=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "117558062905448709034", "name": "Ashley", "time": 1624974844370, "rating": 1.0, "text": "How is there never anybody available to answer the phone? Ridiculous and after all the complaints against Sue how is she still there. This location has to be the absolute worst.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "104320076252378682738", "name": "Cheryl Burnette", "time": 1616003726157, "rating": 1.0, "text": "Absolutely horrible customer service. I called and needed to ask two questions. The woman (not lady) who answered was impatient and short with me from the very beginning. She would not tell me the cost of premium forwarding. Said I had to come in. She eventually hung the phone up in my face! When I tried to call back to speak to the supervisor, she would not answer the phone. Such inept people should not be working in customer service. This is a very black eye for the USPS. Would not use that post office if it were the last one on earth. (I never got the chance to ask my second questions.)", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "112802037086872796045", "name": "Jessica Norris", "time": 1622756001992, "rating": 1.0, "text": "Whatever you do, don't use this post office!!! I'm sure they will never read their reviews just like they don't answer their local phone line either, but today I had the absolute worst service ever. The man working the front desk told me to go grab a mask in order to be in the lobby, which I complied with. Then he proceeded to enforce his political views on me in public in front of the entire lobby. Completely inappropriate and unprofessional, especially since I was the CUSTOMER and he was the EMPLOYEE. I usually avoid USPS but in this scenario I needed to send something to another PO Box and HAD to use them. Never will go back for the rest of my life. No wonder the post office wanted \"mail-in\" votes to count when this employee publicly tried to push his agenda.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "100819156771018388928", "name": "Asherr Cole", "time": 1617900068626, "rating": 2.0, "text": "Priority Mail packages will more than likely not be sent on time,  as a business owner I don't recommend this location as a drop off if you are looking for reliable and consistent service.  😔", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "110719905788171666400", "name": "Dennis Dee", "time": 1620840222274, "rating": 1.0, "text": "They don’t had the sleeve to put the customs declaration in.\nTold me I have to go to a different USPS location!\nVery poor for a post office!!!!!\nUSPS is just a nightmare", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "114069551273765393203", "name": "Arena Hill", "time": 1621877664190, "rating": 1.0, "text": "the workers here are just garbage and totally lazy, will not deliver mail. and they are very disrespectful.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "117219165643835946043", "name": "melissa aplin", "time": 1615844136705, "rating": 1.0, "text": "Worst post office ive ever come across. They dont answer the phone nor deliver your mail on a consistent basis. Also i dropped 3 packages off on Friday and 2 have started tracking but 1 is somehow already lost and not been scanned and sent out anywhere. They are the WORST!!!", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "104212429646288235234", "name": "Heather Cee", "time": 1597778781280, "rating": 5.0, "text": "I just got off a call with Ron and he was very kind and couldn't have been any more helpful. I very much appreciate him and my regular mail carrier, Tony. They do a great job, as I would guess all folks there do. I'm so grateful for our Postal Service.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "105237783002621534809", "name": "Marcie Prescott", "time": 1614270260581, "rating": 1.0, "text": "No one ever answers the phones.  I'm trying to find out why my package is being held there and not delivered.  So frustrating.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "107790968527316415874", "name": "Nicole Evans", "time": 1617388771722, "rating": 1.0, "text": "Customer service was absolutely the worst thing I have EVER seen.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "114978325871674663693", "name": "Alicia Yoerg", "time": 1607451731617, "rating": 1.0, "text": "I went to the Pelham Post Office today 12/8/2020 about 12:00.  While I waited in line, one of the female workers(unsure of her name) was extremely rude to 2 different male customers.  It was super confrontational and uncomfortable to be there.  I had seen this worker be rude before but this time, I will not go back to this post office.  I highly recommend them handle this hostile female worker.  The other two workers on each side of her were apologizing to customers as they came up.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "108106459117460681426", "name": "Ashley Cox", "time": 1601487127981, "rating": 1.0, "text": "Susan or Sue (not sure what her actual name is) was EXTREMELY rude. Won’t be going back to this location because of my horrible experience with her.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "115359131558810429513", "name": "Bob from Eufaula", "time": 1561993402681, "rating": 1.0, "text": "(July 1, 9AM) So my wife just lugs two 25 pound boxes into the Pelham Parkway PO. The overly rude and disrespectful government employee at the counter tells her that she can't mail those boxes because they don't have \"Flat Rate\" printed on the labels. He never looks up and won't listen and does not even try to read the label. Maybe he does not know how to read?She leaves in disgust and begs me to switch to FedEx because at least their people know how to treat customers. please view attached picture and see how long it takes to find the words \"Flat Rate\" on the label", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP3-Lhh7VMOfDRTCD5cXzenZrz-9pmpFGPwK7qY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPdeGR7s-b3XOcDdgEZSCo-7wipluArqWI7jqcA=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "117288283824626596119", "name": "Lara Penney", "time": 1624906562622, "rating": 1.0, "text": "Avoid if at all possible.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "106333854982063146559", "name": "Marissa Kendrick", "time": 1577764851742, "rating": 1.0, "text": "Talked down on whenever I’ve been there. Multiple packages have been marked as delivered while I was outside waiting on them- and nothing. They just never arrived. When I tried talking to the staff twice they have dismissed me and acted as if I wasn’t worth their time. I’m not one to write reviews but this has really been a issue that should be addressed. I ordered two packages on Black Friday that we’re supposed to be Christmas gifts for my mother, that I never received. I was told “maybe they were stolen” when I watched the delivery truck drive past me while receiving my  “delivered” text message. I was told the post master would be in contact with me twice, nothing. It has been over four weeks at this point. I really hate to be one to complain, I always try my best to be positive but this post office has proven more than once that they do not care about their packages or their customers. I really hate that I’m out $100. Guess I’ll just start using UPS and FedEx.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "111145840476773717910", "name": "James Walker (Miles)", "time": 1606869489891, "rating": 1.0, "text": "Dropped off a package in overnight box to be sent off with Priority 2Day Shipping. That was the 23rd, today is Dec. 1 and it says it hasn't even been scanned in yet. No one answers the phone or can tell me my package even exists. Of all the places in the government that I wish gets shutdown. Let it be you first, honestly you all don't care enough to be considered a service.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "105808142077443511786", "name": "Siimply_ Dounuts", "time": 1620480010840, "rating": 1.0, "text": "passaport service is terrible", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "114926203725564859208", "name": "Stephen Byzek", "time": 1603197702874, "rating": 1.0, "text": "I have had four packages in as many weeks fail to get delivered on time for various reasons. \"No Secure location\" \"Customer Requested redelivery\" and then just... nothing. Packages will sit as \"out for delivery\" for three to four days with no updates on the tracking information. Worst post office ever.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "107242428803956029303", "name": "Brittnay Martínez", "time": 1604429285695, "rating": 1.0, "text": "A lady named Susan is extremely rud and disrespectful she told my mom that the package had not arrived even though the paper to go pick it up and an hour later I went with the same paper and a first she was like “a9 ok she already ask she just came and it’s not there” and I went and asked and the box was there and the box looked like it was opened 😡😡😡", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "115882118200034154452", "name": "Amanda Cortez", "time": 1591823763154, "rating": 1.0, "text": "I'm updating my review. Original below. I don't know what happened in a year but I was treated like absolute GARBAGE today, not by Debbie but by her dark-haired female coworker. I am removing my 5 start review and I wish I could give zero stars. NO ONE should be treated with the disrespect I encountered today.\n\nDebbie was kind and knowledgeable! I got my packages sent off with ease (and the best deal). She also helped me compete my passport paperwork and send it off! She truly made my morning!", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "112497685863280500557", "name": "alix bada", "time": 1610664387412, "rating": 1.0, "text": "I called to check on my mail it took me one hour and a half to fill them to answer me and then the end didn't give me no help at all they are bad service and bad delivery I barely can see the delivery driver come to our plaza here in the business is terrible", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "110377391377359675655", "name": "gary burton", "time": 1574117510567, "rating": 1.0, "text": "If I could leave no stars I would , this is by far the worst post office in Alabama. The workers are complete garbage. The Mishandling of packages is beyond mind blowing. Literally everyone that works there is a waste of life In general. Not to mention it looks abandoned on the outside. Zero pride . Pathetic", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "118206700046744397711", "name": "Arial Johnson", "time": 1580828916264, "rating": 1.0, "text": "If you live in Pelham and have to use this post office, get stuff sent to a friend not in Pelham if you're able. The mail carriers are incompetent. They mark packages as \"Delivered\" then deliver them 3-4 days later. They mark as not having access to a delivery point when they are too lazy to deliver and they also do not even bother to check if someone is available to accept a package if a signature is required, but rather mark it as \"No One Available for Delivery,\" forcing you to pick it up at the post office. Not to mention the numerous packages that will get lost or delivered to wrong addresses. It's so bad that I have had to request sellers to NOT ship anything to me USPS and just pay extra for FedEx or UPS.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "116685332367527121766", "name": "Jessica Sims", "time": 1606933520089, "rating": 1.0, "text": "I watched the employees treat two customers ahead of me horribly and then it was my turn. I was lied to and cursed at. This is not the first time. These people are a disgrace!", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "103759218594191380665", "name": "Janeysi Perez", "time": 1574784682662, "rating": 1.0, "text": "Very rude. Asked a question and he answered quickly without searching for the package on his computer.\nMailman NEVER rings doorbell to actually deliver packages. Only wants to stay in truck.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "111204508114670362309", "name": "laith huneidi", "time": 1592245306885, "rating": 1.0, "text": "I had the most horrible service. I dealt with a lady named Sue. She was rude in the past and she was rude to me once again. But this time it was to another extreme.  I have done nothing to this lady. After a mistake on her end that she tried to blame her mistake on me in a room full of customers. I had enough and asked for her managers name and number. Sue did not want to provide me that information at first. Then she proceeded to tell me that her manager is not in. I proceeded to ask for a phone number and was given the wrong phone number! How is this lady even allowed to work there?  We do not appreciate this type of service when doing business here. If i dont see an effort from this Post Office location trying to resolve this issue I will take the matter to someone who can. No person should be spoken to in that manner regardless of race, age religion, or color.  I will not let his one go. Terrible service Sue.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "108648396411112079708", "name": "James Holeman", "time": 1606965076124, "rating": 1.0, "text": "Dark haired lady at the front is extremely rude!!", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "103042605449446852779", "name": "Paula Harvel", "time": 1576518757869, "rating": 5.0, "text": "Love these workers of this post office. They are always so helpful!", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "114954525864752220423", "name": "Freddie Percy", "time": 1592427856961, "rating": 1.0, "text": "Very rude dark haired lady at the front desk", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "102319428169822935341", "name": "Oui Lee", "time": 1567526199904, "rating": 1.0, "text": "One of the ladies at the register was very rude. I printed out a label for one order, but forgot to print a second for another package. Instead of saying they don’t print labels, she first looked at me shaking her head in a rude manner and said “I don’t know what you want me to do”. So I calmly asked if they printed labels and she finally said no. As I was reaching for my card to pay for tape, I caught her looking at others behind me throwing her hands up and shaking her head again. The overall experience was very unprofessional.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "105974561384503014447", "name": "Kyle Turner", "time": 1587840782356, "rating": 1.0, "text": "Constantly having issues with my mail carrier. I call and can never get anyone (real person) on the phone. My mail sometimes shows up, sometimes goes to my neighbor, sometimes just sits in the back of the actual stock room until I go up there and ask for it.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "115939034885643871869", "name": "jeremy lane", "time": 1594482061295, "rating": 1.0, "text": "Lady named Sue needs to get fired. Extremely rude!!", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "102112577459255024227", "name": "Ali Joon", "time": 1594349686522, "rating": 1.0, "text": "If you drop a package in the box after hours it will sit there forever before they touch it. Add at lease one week to the delivery time. There is a reason for all of these one star reviews. You will save yourself lots of frustration by driving to another USPS store or using another carrier altogether.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "104874167677064841273", "name": "Brittney H (Brittney Hunt)", "time": 1575731784955, "rating": 5.0, "text": "Nice and friendly staff, usually when I go in there’s not too long of a wait.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "105139436964053952336", "name": "David Lamar", "time": 1524007048044, "rating": 1.0, "text": "ZERO stars would be more accurate.  We have had so much trouble with this post office.  Our mail gets delivered to the neighbors and we get mail for other people that don't even live in our subdivision.  They CRAM packages that don't fit in the mailbox, they mark that there is no one here when we are just because they don't want to get out of the truck and when we try and hold our mail they either DON'T  hold it or they don't deliver it when the hold is over as we requested.  They are totally incompetent.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "117873272433646542254", "name": "Greg Edgeworth", "time": 1573433846705, "rating": 1.0, "text": "I live in Grey Oaks in Pelham.  I get mail every day.  But most is not mine. Neighbors swap mail most every day.  All streets and mailboxes are labeled.  I don't know if they can't do the job or just don't care. I will go up the ladder if needed.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "105481092792327054915", "name": "Vernon Pruitt", "time": 1576081949391, "rating": 1.0, "text": "Can't reach anyone by phone. Trying to call and check claim for missing package. Automated phone service says claim is resolved but no one has called or emailed and the package is still missing.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "113184763580347430335", "name": "Rinku Patel", "time": 1549659725639, "rating": 1.0, "text": "Never again.. i personally drove 20 mins to drop off my package to this location. I verified it was media mail and paid postage for it. 10 days later the package gets dropped to my door step saying I need to pay $32 more to send it out. I drove back there and had to speak to the postmaster. She is rude and very unprofessional.  Has an attitude, and does not deserve to be in her position of serving customers. I never know how these people qualify for these jobs... postmaster didn't know what qualified as media mail... the staff is just as clueless. I think my issue was resolved after 3x of me driving down there. Who knows, they may drop off my package at my door step again, claiming it's not media mail when it is..incompetent idiots....", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "114529990180478546613", "name": "Mike Brooks", "time": 1565190137688, "rating": 5.0, "text": "PostLady Miss Debra and Postman Jesse have been great for almost 14 years experience.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "112536725035513137913", "name": "Jen Guadalupe", "time": 1457101378604, "rating": 1.0, "text": "The lady I spoke with not only yelled at me to speak up, she had a bad attitude too. I only asked that a package be held at the office so I could pick it up since it had to be signed for. She was rude but said it would be held there. I sent my husband to get it since I was stuck at work. The lady yelled and cursed at my husband that she didn't know what he was talking about and that there was no package there. She even told him to get out! That he was wasting her time! I called Helena office and find out that the lady had it held there! Seriously?? This is how the Fed Gov allows the postal service to be run? I will be avoiding Pelham office at all costs now. Truly offended.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "105083482002207072473", "name": "Megan Everett", "time": 1530648743551, "rating": 1.0, "text": "If I could give Pelham post office negative stars I would. This place might as well be shut down!!!!!!! In the past two weeks I’ve had two packages delivered to the wrong address. I never get my own mail but At least twice a week I get 2-3 different neighbors mail. Seems like y’all need to fire your mail delivery people.....", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "106796247101520398198", "name": "yusuf alhajj", "time": 1535819765777, "rating": 1.0, "text": "Misplaced a package that needed a signature. Took 45 minutes to finally locate which I should consider myself lucky looking at the other reviews. The carrier refuses to come to my door to let me sign and instead leaves a slip in the mailbox indicating no one was available. Unacceptable!", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "108638329151800586635", "name": "Maria Martinez", "time": 1604470505151, "rating": 1.0, "text": "very bad service with Susan is always bad 😤😤😤", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "105467482615185596827", "name": "B R", "time": 1566422167413, "rating": 1.0, "text": "An employee named Ron was claiming my daughter couldn’t get a passport without me there even though she was of age to do so and had all of the correct paper work according to the federal passport website. He wouldn’t let me explain to him what was going on and when I tried he kept interrupting me and yelling “a parent must be here” in front of everyone in the post office. I was never able to explain anything or show him the website where it states that she can get one with out me there bc he kept interrupting and yelling at me that “A parent MUST be here”! He told me I’d have to cancel my appointment which I was not going to do bc she needed to apply for the passport today. I finally left my daughter there and tried to run and get my other daughter from school hoping I could make it back in ten minutes for the appointment. My daughter calls me a little while later and told me she was able to get the passport and that the nice passport lady told her “Ron” had never done passports before and didn’t know what he was talking about. Needless to say I’m glad Ron didn’t convince me to cancel and I’m glad one person there actually knows what they are doing! I plan on avoiding this post office from now on and driving a bit farther next time we need a passport.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "102357058541155570951", "name": "B.B.", "time": 1594403555087, "rating": 1.0, "text": "Need a mask required sign not recommended instead of kicking people out", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "104163901382550594594", "name": "Brian Evans", "time": 1467834206072, "rating": 5.0, "text": "They have letters. Sometimes the letters tell us what to do.  Sometimes we tell letters where to go.  File, sort, stuff and stamp.  The post office has it all.  Totally recommend for your next vacation.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "108413360577488234360", "name": "Full OfFamily", "time": 1553961641524, "rating": 1.0, "text": "Terrible lady who works there over charging people on pre paid shipping.  Terrible Terrible and then you can’t speak to the manager.  Went to other post offices who don’t do this and the person was very rude and treated a 40 year old like a child.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "116805106759114139275", "name": "Andrew Eberhardt", "time": 1493667060420, "rating": 1.0, "text": "Won't answer the phone. Can't give me info on my package. Told me it's my fault it came to the wrong post office. Done with USPS. Paid money to have it shipped quickly and still have no idea where my order is. Horrible.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "108544106597302699107", "name": "Eboni Berry", "time": 1543714356193, "rating": 1.0, "text": "If I pay for overnight or 2 day shipping, that’s what I expect. This mail carrier has updated the tracking several times to say that they couldn’t access my mailbox, HOWEVER. I make sure to park in my yard and the mailbox is on the street. I run a business and I need my packages! I expect to receive them according to the shipping I’ve paid! Please stop lien on the tracking and stop being lazy! Do your job!!", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "101654848938989152955", "name": "Brian McDaniel", "time": 1575919196501, "rating": 1.0, "text": "Had several items shipped to my location. 3 items delivered the 4th item is now marked \"attempted delivery, could not access location\".", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "103993672530760732163", "name": "Chris Edwards", "time": 1593702943586, "rating": 1.0, "text": "Employees suck, lack of knowledge and helpfulness", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "102547353954529616649", "name": "Linda Lemoine", "time": 1499439303160, "rating": 1.0, "text": "I usually use UPS but for some reason I decided to drive further and use the USPS. I was treated in such a rude manner by \"Ron\" . Never having experience with packaging he not only would not give me a little help when I asked for it, he told me \"customers are supposed to do their own packing\". He handed me a heavy tool that dispenses tape and pointed to the area where labels,etc. are. I was the only customer in the store mind you, until another lady came in who offered me help and then I was able to finish my process.\nI have never been in a situation where someone refused to help me.\nNo wonder this office has such a poor rating.\nI hope he gets untreatable diarrhea .", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "104438718831922095577", "name": "Trac Vo", "time": 1597153500470, "rating": 1.0, "text": "Never pick up their phone.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "117796775419462732697", "name": "Katie Vann", "time": 1469048258033, "rating": 5.0, "text": "Everyone was so helpful! Danny thank you for your time and help! Best experience in a post office ever!", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "113809883091564233319", "name": "J Enis", "time": 1494867794436, "rating": 1.0, "text": "Horrible! The mail delivery person left a letter in my mailbox stating they had missed me and that my certified package would be delivered back to the post office. The delivery person did not attempt to knock on my door, ring my doorbell or even blow the horn to alert me they were outside. I tried to call the post office once I received the notification to which I received a message that the hold time would be greater than one hour. Today I went to pick up my package at the post office. I was the first person there out of six people ( I was the last of the six people to leave. Four of the six people had complaints. )The guy took my notification and returned 20 minutes later to tell me there was not a package for me there. Obviously there is a package because I am holding the notification in my hand that was left in my mailbox Saturday. He alerted the Post Master and after 45 minutes of waiting for my package I finally had it in hand. Unorganized...not to mention all the many times the mail delivery person leaves a neighbors mail in my box or vice versa. We are always having to deliver each others mail to one another in my neighborhood.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "112751641977458292835", "name": "Chris Wilson", "time": 1583558006742, "rating": 2.0, "text": "Usually a long wait, then get treated rudely by postal worker. Hate going there.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "111789762351694801190", "name": "Megan Templeton", "time": 1527704889345, "rating": 2.0, "text": "Staff always looks depressed and are rude . The packages are thrown around. Observed the staff mocking two customers today. Save yourself the trouble and go to the Helena or Hoover post office - worth the drive.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "111128596247442414714", "name": "Barbara Williams", "time": 1573587221024, "rating": 1.0, "text": "Misdelivered or missing mail at least once a week. Call the post office & get hung up on.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "114294522959417669081", "name": "K Smith", "time": 1502657587590, "rating": 1.0, "text": "They frequently misdeliver my mail to other addresses or fail to deliver it at all. The most recent nonsense is failure to deliver a package with the tracking code \"No access.\" Really? A standard residential street address with no access just one day out of the year? Absurd. Some research indicates that's the code used for \"it was raining\" (it was) or \"I didn't want to get out of the truck\" or any other reason they have for skipping a delivery, or perhaps later realizing they forgot something. At least this time there was a code. Normally there's no explanation at all. I've lived in many places, and this post office is the worst I've ever experienced.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "110253657429377812507", "name": "Joey Smith", "time": 1534949100526, "rating": 1.0, "text": "Too bad we can't give negative stars. The \"lady\" who helped me was the poster child for snarky attitude. Now they have lost another package that has been showing \"out for delivery\" for 7 days. I didn't realize we still had postal riders on horseback, hell you could walk to our house and back to the post office in less than 1/2 a day. Pathetic, no wonder they are losing money.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "108629055608384721775", "name": "taylor evans", "time": 1511681373821, "rating": 5.0, "text": "Nice place! I love it good service", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "115014854445930120933", "name": "Brittany C.", "time": 1533306815151, "rating": 1.0, "text": "Easily the worst post office I have ever had dealings with. Packages aren't delivered, they are delivered to the wrong address, etc.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "101580725140614288024", "name": "Stephanie Young", "time": 1497028467442, "rating": 1.0, "text": "This is the most rude and unprofessional so called post office! You have a problem about receiving your mail or other issues,  and they do not care about resolving anything! They will hang up on you rather than to deal with you. They can't get anything right. I believe some of them can't even read or write! Pathetic", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "106004601154037946053", "name": "smile dog ace dog", "time": 1538776140256, "rating": 1.0, "text": "Only delivered box 2out of 2 and lost box 1 out of 2 . Mail person said they would return the next day with it and didn’t show up.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "110819097093518725456", "name": "Joshua Jones", "time": 1528562784763, "rating": 5.0, "text": "Danny was awesome, great experience!", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "107969357190357038088", "name": "Gerald Seaborn", "time": 1529270101492, "rating": 1.0, "text": "Instead of walking my package to the front door of my home which is covered, they would rather leave it on the top step which is only a few steps from my door. The package got rained on and was open. This not the first time either. Their mail carriers suck!", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "116937197939678587383", "name": "Bill Hart", "time": 1473954648127, "rating": 1.0, "text": "It's the government at its BEST!", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "106873349235950993666", "name": "Dawn Marie", "time": 1601063523615, "rating": 1.0, "text": "Worst post office I've ever been to.  POOR customer service.  Nobody EVER answers the phone.\nCarrier service is rediculous!", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "109658121714015401951", "name": "Joshua Williams", "time": 1524073244210, "rating": 5.0, "text": "LOCAL PO I USE....STAFF IS KIND....STAYS BUSY", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "105100300548680714447", "name": "Alcides Palacios", "time": 1566938047195, "rating": 5.0, "text": "Good service", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "107764645467655045817", "name": "Darren Morten", "time": 1541440301238, "rating": 1.0, "text": "These people are rude! Beware if you have to go here. Customer service is a foreign concept to these people.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "103247016568297100284", "name": "Barbie", "time": 1506172685388, "rating": 1.0, "text": "This is the most worse and unprofessional post office", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "101420684007721517362", "name": "janitorial-engineer", "time": 1495046188184, "rating": 1.0, "text": "They act as if it's a free service.", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "101216743082299773656", "name": "Robert Evans", "time": 1492150169954, "rating": 3.0, "text": "You can tell these are government run", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "115654373652036168752", "name": "Richard Walton", "time": 1525802909546, "rating": 1.0, "text": "awful", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "110513299916025416846", "name": "Jose Bracamontes", "time": 1525812123375, "rating": 1.0, "text": "Terrible", "pics": null, "resp": null, "gmap_id": "0x8889240f95693861:0x5b6708dd21f8d0bd"}
{"user_id": "100245704474927893802", "name": "Justin watkins", "time": 1619444975452, "rating": 3.0, "text": "Set up an appointment a week ahead of time for 9AM Monday morning and in the scheduling system it said please show up early as it takes us time to prepare. So I show up at 8:40 and as soon as I identify the purpose of my visit she very rudely said If you have an appointment for 9 I’ll be with you AT 9. I of course responded with your scheduling system says be sure to arrive early and she interrupted me to say well I’m still sorting mail so I’ll see you after 9. You guys need to calm the hell down and change your system if it is going to instruct your patrons to do things outside of what you want.", "pics": null, "resp": null, "gmap_id": "0x8888aedbea63ee21:0x185025610099f5eb"}
{"user_id": "107300851154132415003", "name": "Pitty Pat", "time": 1607691739491, "rating": 4.0, "text": "Always come here instead of PO right down street from my house. Friendlier, more helpful clerks here. Only prob is they often only have 1 window clerk and when you have the misfortune to get behind a customer doing passport business you might as well leave and come back later. Also they close for lunch (prob due to personnel shortages,  which of course is not the fault of this branch.) Overall, I consider this my \"local\" PO even though it is not, because my local PO is TERRIBLE.", "pics": null, "resp": null, "gmap_id": "0x8888aedbea63ee21:0x185025610099f5eb"}
{"user_id": "115499606884728061099", "name": "John Samuel Gurtler", "time": 1609992922363, "rating": 5.0, "text": "You can spend the same amount of time driving to the Cottondale location and receiving prompt service as you would standing in line at the Tuscaloosa and Northport offices. It's just quicker than the city locales.", "pics": null, "resp": null, "gmap_id": "0x8888aedbea63ee21:0x185025610099f5eb"}
{"user_id": "105293018269454788763", "name": "Lasandra Tucker", "time": 1595271125813, "rating": 5.0, "text": "This is the best post office in the Tuscaloosa area. Always great customer service and the wait is never long. I’ve shipped multiple packages and I have a po box here. My friend and I had so much fun getting our passports here. I travel out of my way to  go here! I can’t say enough good things about theEmployees at this location!", "pics": null, "resp": null, "gmap_id": "0x8888aedbea63ee21:0x185025610099f5eb"}
{"user_id": "112589053061461065879", "name": "Pamela Nicole", "time": 1596656319129, "rating": 5.0, "text": "Great customer service..always smiling faces and respectful.", "pics": null, "resp": null, "gmap_id": "0x8888aedbea63ee21:0x185025610099f5eb"}
{"user_id": "111351613591727402710", "name": "Austin Huddleston", "time": 1573074089737, "rating": 3.0, "text": "Why is there not a direct call number for this location?  I went through a 10 minute automated service just to be on hold for an hour to ask one simple question.", "pics": null, "resp": null, "gmap_id": "0x8888aedbea63ee21:0x185025610099f5eb"}
{"user_id": "104219254872985170661", "name": "Smitty Johnson", "time": 1575915965943, "rating": 1.0, "text": "Phone number is not to local post office and does not give you what you need nor let you speak to a real person. Waist of time to call", "pics": null, "resp": null, "gmap_id": "0x8888aedbea63ee21:0x185025610099f5eb"}
{"user_id": "100821101845224329295", "name": "Krislynn Woolwine", "time": 1585926605072, "rating": 2.0, "text": "Can someone please tell me how I can speak to an actual individual about when mail will be delivered to my area ? Very important question that I have waited on hold for 45 mins with.", "pics": null, "resp": null, "gmap_id": "0x8888aedbea63ee21:0x185025610099f5eb"}
{"user_id": "101395735859651087198", "name": "Christi Burge", "time": 1484851391531, "rating": 5.0, "text": "So fast and super friendly. The blonde haired woman with glasses makes you feel right at home!!", "pics": null, "resp": null, "gmap_id": "0x8888aedbea63ee21:0x185025610099f5eb"}
{"user_id": "102528559775999445104", "name": "Amanda Morgan", "time": 1498675134665, "rating": 5.0, "text": "My favorite post office. I even drive out of my way to go there.  The ladies are always so nice and helpful.", "pics": null, "resp": null, "gmap_id": "0x8888aedbea63ee21:0x185025610099f5eb"}
{"user_id": "100215794338869425147", "name": "April in Alabama", "time": 1531879554130, "rating": 5.0, "text": "Best Postal Workers in Tuscaloosa! So friendly, patient and helpful!", "pics": null, "resp": null, "gmap_id": "0x8888aedbea63ee21:0x185025610099f5eb"}
{"user_id": "112719351754584205132", "name": "Jeff Jones", "time": 1523326388464, "rating": 5.0, "text": "Very helpful staff at this post office", "pics": null, "resp": null, "gmap_id": "0x8888aedbea63ee21:0x185025610099f5eb"}
{"user_id": "113217827734240296564", "name": "Crystal Guilford", "time": 1613573340259, "rating": 1.0, "text": "The customer service is absolutely terrible to nonexistent. I say this because the post office always send a new mail carrier to my address that doesn’t even know the route (or simply how to use a GPS either), so whenever I’m expecting packages or very important mail, it’s a gamble on rather I’ll actually get it or not on those specific days. Even if they do give me some of my mail and/or packages, they usually leave something out. So if I don’t receive everything right then and there, then I’ll have to go to the post office in person the next day to retrieve my mail that was left out and my packages that were left behind because it’s like trying to find gold to get ahold of a real person on the phone because they usually ignore the calls and barely ever actually answer the phone. USPS sucks terribly, I truly wish that I could have all of my packages delivered ONLY by FedEx, UPS, or some other more reliable delivery service.", "pics": null, "resp": null, "gmap_id": "0x888a3ea6f30efb63:0x7ec6faa719520ac2"}
{"user_id": "114120083576864943699", "name": "Sherry Rylander", "time": 1613828141171, "rating": 4.0, "text": "Called about a package that had been at the Post Office for 14 days but never scanned in as being received at that location according to the online tracker. An employee checked and stated it was definitely not there and they would check with our carrier. It was delivered the next day. Thank you for following up and finding my package.", "pics": null, "resp": null, "gmap_id": "0x888a3ea6f30efb63:0x7ec6faa719520ac2"}
{"user_id": "103728848049927063252", "name": "K. W.-Wilson", "time": 1606001708183, "rating": 1.0, "text": "I have been monitoring a package from an order and it's been sitting with the Chestnut St. branch since the 17th, today is the 21st and it has not been delivered yet. I have called and called but nobody has answered. I called Piedmont Cutoff and they answered immediately, but they could not help due to zip code. Chestnut Street office needs to do better and work on customer service and efficiency.", "pics": null, "resp": null, "gmap_id": "0x888a3ea6f30efb63:0x7ec6faa719520ac2"}
{"user_id": "116158570299346359304", "name": "Wyatt W", "time": 1603879517959, "rating": 1.0, "text": "So i go down to the post office to retrieve a package, tracking says \"insufficient address\". Lady at the post office says the sender forgot to put the apartment letter on the label. Ok, not your fault USPS, i get it. So the lady says ill go back and look for it if they havent already sent it back, comes back and says cant find it, the post office guy must be riding around with it on his truck. Give me your name and number and ill call you when he gets back. 2 hours later I get am update saying its being processed out of Gadsden usps to be returned to sender. Wowwww . so thanks for nothing i guess? And I get the 1 star is kinda harsh but even after the driver was made aware i was trying to retrieve it (lady said she called him) it was still sent back. Smh. You can do better Gadsden USPS", "pics": null, "resp": null, "gmap_id": "0x888a3ea6f30efb63:0x7ec6faa719520ac2"}
{"user_id": "105925664917158507792", "name": "Brittney A", "time": 1589578775287, "rating": 1.0, "text": "Over 2 weeks, how can you lose 6 individual small packages with tracking numbers on them inside of a locked mailbox that has to have a key to open it? But yet all my paper bills are still there? If you can read the box well enough to leave bills, you are perfectly capable of reading the same name and same address for my packages?", "pics": null, "resp": null, "gmap_id": "0x888a3ea6f30efb63:0x7ec6faa719520ac2"}
{"user_id": "104044565029181539239", "name": "Kacey Watts", "time": 1603293225167, "rating": 3.0, "text": "the place is great, but trying to call them is a nightmare. you can never get an actual person on the phone", "pics": null, "resp": null, "gmap_id": "0x888a3ea6f30efb63:0x7ec6faa719520ac2"}
{"user_id": "107131227101613878566", "name": "Matthew", "time": 1605971650612, "rating": 1.0, "text": "It’s Saturday morning and they should open at 9:00, it’s now 9:15 and it’s not open and a line of 10 people.", "pics": null, "resp": null, "gmap_id": "0x888a3ea6f30efb63:0x7ec6faa719520ac2"}
{"user_id": "115991956625616175264", "name": "Jackson Morgan", "time": 1600627734098, "rating": 1.0, "text": "Can't talk to anyone about lost or misdelivered package.  Online is no better.", "pics": null, "resp": null, "gmap_id": "0x888a3ea6f30efb63:0x7ec6faa719520ac2"}
{"user_id": "102794824990917335655", "name": "michael silvey", "time": 1569438268885, "rating": 1.0, "text": "What's really pathetic is the mail carrier will fill out \"Sorry we missed you while you were out\" pink slip before they leave for their route. They do this so that they do not have to get out of their car and can finish their routes faster. I have caught my mail carrier doing this several times. Try to report it but the bureaucrats don't care about anything except a paycheck and benefits. Absolute disgrace.", "pics": null, "resp": null, "gmap_id": "0x888a3ea6f30efb63:0x7ec6faa719520ac2"}
{"user_id": "114020309532702580573", "name": "Marcus Davinport", "time": 1530995634564, "rating": 1.0, "text": "This place is horrible.  The people working the window are great.  But everyone else is horrible.  Driver forgot to deliver package for two days. Showing OUT FOR delivery two days. Person at post office said that it did not mean out for delivery only that it was at post office.  Which is worse a driver not delivered for two days or that it sat at your post office for two days.......", "pics": null, "resp": null, "gmap_id": "0x888a3ea6f30efb63:0x7ec6faa719520ac2"}
{"user_id": "103653308448292848864", "name": "A S", "time": 1520362341467, "rating": 1.0, "text": "This negative review is more a reflection of one of the passport agents, and not so much the staff collectively.\n\nLast week, the passport agent on duty was a blonde lady who was very helpful and sweet. Fast-forward to today, and now it is a black man who is exactly the opposite of what the lady was.\n\nI walk in at 11:32 and he tells me that I have to leave and go to the court house because 'she' (as he gestures to a lady filling out paperwork) will be his last customer for the day.\n\nNow, the lady sitting there was, as I said, filling out the paperwork for the passport application. I, on the other hand, had completed paperwork in-hand, along with all required identification and monies. Instead of just allowing me to turn in my paperwork and pay my fees *ahead* of the lady filling out paperwork, he directs me somewhere else; which translates to, \"I'd rather sit here and wait for this lady to finish her paperwork so that I don't have to do anything for a while.\"\n\nI also mentioned to him that I had visited or attempted to visit that office nearly every day over the past week (so that he would know that I have been making every effort to get this taken care of), and even though he said, \"I understand, but...,\" we all know he couldn't care less. Saying \"I understand, BUT...\" is the customer service equivalent of, \"Your issue/need doesn't matter.\"\n\nThe employees at the front desk are nice enough, and always helpful; but the gentleman I speak of in particular has left a very bad taste in my mouth.", "pics": null, "resp": null, "gmap_id": "0x888a3ea6f30efb63:0x7ec6faa719520ac2"}
{"user_id": "104605537218973750516", "name": "dwight bush", "time": 1477762429254, "rating": 5.0, "text": "The front counter employees are great! I noticed that they are very helpful to all customers. They show concern for their customers. Very friendly people!", "pics": null, "resp": null, "gmap_id": "0x888a3ea6f30efb63:0x7ec6faa719520ac2"}
{"user_id": "105862436652168828402", "name": "Kevin McCullouch", "time": 1542237020322, "rating": 5.0, "text": "I went here about 11 today to send a care package off. The short brunette lady was such a help and was super polite.", "pics": null, "resp": null, "gmap_id": "0x888a3ea6f30efb63:0x7ec6faa719520ac2"}
{"user_id": "114321378592095577083", "name": "Andrea Benjamin azu", "time": 1561211248030, "rating": 5.0, "text": "The people in this post office are great", "pics": null, "resp": null, "gmap_id": "0x888a3ea6f30efb63:0x7ec6faa719520ac2"}
{"user_id": "118092799638248530710", "name": "M A", "time": 1499111979572, "rating": 5.0, "text": "Excellent staff , very friendly and helpful, if you are polite while talking to them, they will do everything to help you 👍🏻💚", "pics": null, "resp": null, "gmap_id": "0x888a3ea6f30efb63:0x7ec6faa719520ac2"}
{"user_id": "109853892657811356183", "name": "Noah Walker", "time": 1349447935344, "rating": 2.0, "text": "First \"Treda\" is the women that never called me back for anyone who calls. These people suck, my package was \"delivered\" but i never got it. I called three times with a \" ill call u right back\" and they never called. I asked for the manager and Treda finally got off her but and talk to the carrier. She told me that the guy never delivered a package there or anything, but yet someone had to write down a \"delivered\" message or the tracking info wouldn't say \"delivered\". very unsatisfied and will not be using them again.", "pics": null, "resp": null, "gmap_id": "0x888a3ea6f30efb63:0x7ec6faa719520ac2"}
{"user_id": "107755120759856195874", "name": "jordan riggan", "time": 1498068588602, "rating": 1.0, "text": "Very unprofessional. Their phone service is nonexistent. An automated voice states you are being transferred to the next available agent and then after several rings it automatically disconnects the call. They could not care less about customer service.", "pics": null, "resp": null, "gmap_id": "0x888a3ea6f30efb63:0x7ec6faa719520ac2"}
{"user_id": "101448200330834850043", "name": "Alex Casey", "time": 1497555903941, "rating": 1.0, "text": "Because I live on the county line they tell me they don't service my address. So they refused to help me find my package even though after I track my pack it says that it is in their office. They wouldn't even bother to check. Terrible customer service. Would give 0 stars if I could.", "pics": null, "resp": null, "gmap_id": "0x888a3ea6f30efb63:0x7ec6faa719520ac2"}
{"user_id": "104152127705019274228", "name": "Mr. Shakedown", "time": 1545070199154, "rating": 1.0, "text": "Horrible service and don't deliver what they're supposed to deliver", "pics": null, "resp": null, "gmap_id": "0x888a3ea6f30efb63:0x7ec6faa719520ac2"}
{"user_id": "110095994775081261665", "name": "Wendy POWELL", "time": 1561821737799, "rating": 5.0, "text": "Very nice employees!!!!", "pics": null, "resp": null, "gmap_id": "0x888a3ea6f30efb63:0x7ec6faa719520ac2"}
{"user_id": "117386263664078831222", "name": "Marvellus Prater", "time": 1488604611112, "rating": 5.0, "text": "Excellent service", "pics": null, "resp": null, "gmap_id": "0x888a3ea6f30efb63:0x7ec6faa719520ac2"}
{"user_id": "115254290834997390204", "name": "Pamella Vann", "time": 1483643488214, "rating": 1.0, "text": "Over the past year. This post office has continued to go down hill. There is always just one person working and a line out the door. Plan to spend 15-30 minutes here to mail off a package.", "pics": null, "resp": null, "gmap_id": "0x888a3ea6f30efb63:0x7ec6faa719520ac2"}
{"user_id": "112558425565557791688", "name": "color nocharm", "time": 1618680202553, "rating": 1.0, "text": "I'm not even from AL and the impact of just how poorly ran this post office is has affected me in VA.  It's no surprise the reviews are so bad.  Get it together.. you're literally a laughing stock to the entire east coast", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "100753674667907876214", "name": "Kristin Marshall", "time": 1620089978410, "rating": 5.0, "text": "Great customer service today but the gentleman in the front. Keep up the great work.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "106729561546983142213", "name": "Appledroplarry", "time": 1623783048747, "rating": 1.0, "text": "Defund the post office. We we need a delivery service that delivers 99% junk mail and wont get out of their vehicle to deliver mail. Put the billions of tax dollars towards something else.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "102273090310819267626", "name": "D M", "time": 1614372747153, "rating": 1.0, "text": "February 26, 2021 (2:30pm) The gentleman working behind the counter today with two ladies carried on one transaction after another in the rudest demeanor, tone and manner. There was an elderly woman in front of me working with him at the counter and I stopped counting the number of time he rolled his eyes at her or gave her a death stare. He’s condescending and arrogant and appeared to be taking out his frustration on every customer. Unacceptable. We appreciate your service and may not understand what you go through on a daily basis but treat the customers with respect.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "111682895086649786690", "name": "Big Dal", "time": 1623338910190, "rating": 1.0, "text": "Package has been sitting there for 3 days and hasn't been delivered!!!! Next time I'm using FedEx.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "104875516947963255202", "name": "Paula Balius", "time": 1603575514994, "rating": 5.0, "text": "Mrs. Lisa (I think that was her name) and the other postal workers are absolutely outstanding.  Today,  I had a package lost and Mrs. Lisa found my package and drove it to my apt. after hours and called me from her home to make sure I got it.  This is going beyond the call of duty!  Thank you Daphne USPS you all rock!!!  Paula Balius, Daphne, AL", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "109251070800038735471", "name": "Carey Hilliard", "time": 1611371336372, "rating": 1.0, "text": "This is the worst post office I have ever had to deal with. We live in Spanish Fort. Our mail is delivered to other houses in our subdivision. I never use them to mail or receive packages because we have had packages from them that were never delivered. Today I spoke with a female there because it said a package was delivered. She took my number and never called me back. They are useless here. Don't care at all about their jobs.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "115868410621514082351", "name": "Joy M", "time": 1606842799861, "rating": 1.0, "text": "I live in Spanish Fort and my mail doesn't arrive to my house until 3 or 4 weeks after it was sent. I am so fed up with this terrible service. I have no trust in my carrier, I receive other people's packages and mail all the time. Is it up to me to take it to the correct address? Well if the mail carrier is delivering other people's mail to my address it stands to reason he may be delivering my mail to the wrong address too. So how can I rely on such terrible service? Not happy at all!", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "113496854826536277873", "name": "Sean Crowley", "time": 1604066787219, "rating": 1.0, "text": "Absolutely horrible, I paid to send a package Priority Mail with tracking on the 19th, expected delivery on the 22nd.  It still has not arrived yet (it's the 30th).  I went in to address my concerns and all I got was a \"well you can pay more next time for a guarantee delivery\".  Are you kidding me!  Would not help track the package at look into it at all, certainly not refund the money I paid for expedited delivery. Horrible customer service, use FedEx or UPS if possible, stay away from these guys!!", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "106154132235172590636", "name": "T Bond", "time": 1612971957052, "rating": 1.0, "text": "No real phone number to this location. Everything automated.  No possible way to speak to a human on the phone.\nWhat happened to customer service? Damn shame.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "100476721951362532359", "name": "Em L", "time": 1593275698862, "rating": 1.0, "text": "Black lady at the front desk is THE RUDEST person on earth EVERY SINGLE TIME I have ever been in here. I would PAY THIS OFFICE TO FIRE HER! There’s absolutely NO REASON to have the attitude she does when ITS HER JOB!", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "113837867919641812549", "name": "Thomas Webb", "time": 1603716654742, "rating": 1.0, "text": "I us the Foley Post Office because this location keeps losing my stuff.  I have sent out 6 packages and 2 are missing.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "109481013717744272408", "name": "susan young", "time": 1610664772218, "rating": 1.0, "text": "Rude clerk I’ve had her before; she had a surly attitude!!", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "101246294731786273297", "name": "Sokr Ates", "time": 1593636015854, "rating": 1.0, "text": "I have literally nothing but negative things to say about this excuse of a govt building but whatever. I have never seen a more lazy mail person in my area, the workers in the building do NOT care what your issues are. I would rather drive hours away than to have to deal with this group of employees. I wish I could give a worst rating but my review would probably be taken down.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "108531327038063370103", "name": "Diana Eileen Vargas", "time": 1575469309889, "rating": 5.0, "text": "I spoke with a gentleman over the phone after calling this post office's direct number.  I am new to Daphne and wanted a general window of time that mail is delivered in my neighborhood.  He knew my mail carrier by name and supplied me with the requested information.   We move quite often for my husband's work and this is the first time I have experienced such a friendly and efficient postal worker over the phone.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "105849338941934744686", "name": "Keric Frost", "time": 1583779867463, "rating": 5.0, "text": "After the hassle of driving all over Fairhope trying to find somewhere to do passports (court was in session at satellite courthouse and they don't do them at all at Fairhope post office) I went to the Daphne post office and they got me taken care of quickly. The clerk Thomas was very helpful, friendly, and took no time at all in getting my paperwork taken care of.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "102072308588735963844", "name": "Krissy Isidore", "time": 1590786963968, "rating": 1.0, "text": "KNOCKED ON MY DOOR REALLY HARD  AND DIDNT EVEN GIVE ME TIME TO ANSWER IT BEFORE TAKING OFF!! IM 8 MONTHS PREGNANT, SORRY I CANT RUN TO THE DOOR IN YOUR TIMELY MANNER!!", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "112088606690872971911", "name": "Marclyn Keenan", "time": 1588628863838, "rating": 5.0, "text": "Shout out to Thomas for all the help getting my 30 boxes in! Thomas you have no idea how much you turned my day around!", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "116379963670428629314", "name": "M Sullivan", "time": 1602946452646, "rating": 1.0, "text": "WORST customer service. The mail lady has stolen from me- which I have ON CAMERA. The SUPERVISOR is a joke and hung up on me.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "103073299997175439384", "name": "Ari", "time": 1544152080192, "rating": 1.0, "text": "Had my package go through this facility to be delivered to me. 8:32 - package departed. 8:34 - delivery attempted. 2 minutes to do a delivery? Yea right. The driver decided they didn't want to deliver my package, and skipped it. I sat here for 2 hours waiting for my package before I finally got it. Today, the delivery left at 10 am and then at 8:50 a delivery was attempted. Completely false. So I now have to go up there and wait for hours tomorrow to get a delivery that was supposed to just be dropped off at my doorstep like they always have done. Absolutely horrible. Do not ship with USPS, go with UPS they are far better.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "118173938036703215793", "name": "Elizabeth Black", "time": 1554317672902, "rating": 4.0, "text": "The wedding dress my mother made me was delivered to the wrong address.  I am giving this review because Thomas, Roger and yhe supervisor I spoke with were all very attentive and helpful with my problem.  Although I feel the carrier was negligent in their duties, it is nice to know that other people at the post office were concerned and willing to fix the problem in an expedient manner.  Thank you Daphne post office for listening to my problem and working to ensure good service in the future!", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "112564902762581021340", "name": "Frank", "time": 1603564113721, "rating": 1.0, "text": "The black lady here is awful and need to be fired.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "112591664627014486416", "name": "Daniel Slate", "time": 1566918365397, "rating": 1.0, "text": "Worst mail experience. I payed to have my package held at the post office and they still delivered it even after i was charged a fee.I had to go back 3 times to finally get my package.I was told I was going to have to pay another fee, which I refused.The postmaster couldn't explain why I was getting charged again and had a poor attitude every time I was trying to talk or ask any questions.Would rate a 0 if it was possible.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "101536204053533547656", "name": "Xtream search and rescue org Founder Mike Kensie", "time": 1601490874059, "rating": 1.0, "text": "Garbage it's a hit and miss when they decide to deliver our mail on main st sometimes ten sometimes two pm sometimes next day or four pm ridiculous lazy slow and uneducated", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "100770563798821878390", "name": "Paula L", "time": 1542985583628, "rating": 5.0, "text": "I had a recent experience with Michael at the Daphne post office...he went above and beyond to help me track down an overnight package...without going into the long story, bottom line is he delivered it personally to my home when it arrived to the post office late rather than having me wait until the next day for my regular carrier to deliver it!  Highly impressed with his professional attitude and commitment to great customer service!  Thank you!", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "104579576666591108348", "name": "Peter Jesunathadas", "time": 1383667249556, "rating": 5.0, "text": "A caring Post Office. Informed Mr. Beasley of the Daphne AL PO that a Priority Mail envelope of mine was just running circles in the Postal system at Birmingham for 10 days and he not only solved the problem but called me the next morning to let me know. Now how is that for service from the Post Office!! There are still some great and caring folks, but for some reason they all seem to be in the deep south!! I salute the Daphne Post Office! Thanks Mr. Beasley. God bless you.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "118105352655399922032", "name": "Angus Moree", "time": 1557885865020, "rating": 5.0, "text": "I was very happy with service I recieved when I visited the Daphne post office. The clerks there are very courteous and proficient unlike other post offices I have had the displeasure of visiting.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "106019152312284097432", "name": "Jamie Wilhelm", "time": 1555087361718, "rating": 1.0, "text": "The postal carrier that runs Lake Forest keeps delivering my packages to the wrong address, this has been happening for many years. They need yo pay attention to the entire address and the name of the person for the address.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "106019152312284097432", "name": "Jamie Wilhelm", "time": 1555087361718, "rating": 1.0, "text": "The postal carrier that runs Lake Forest keeps delivering my packages to the wrong address, this has been happening for many years. They need yo pay attention to the entire address and the name of the person for the address.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "108905883808523862217", "name": "Dawn Morris", "time": 1591047561158, "rating": 1.0, "text": "Package has been sitting there for 4 days and still hasn't been delivered!", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "117466650880238461817", "name": "Marc Nelson", "time": 1557153476900, "rating": 2.0, "text": "The past couple of months I have had mail delivered to my home in Spanish Fort Estates that was not my address or even my street. In addition, my mail has been incorrectly delivered to other addresses. I have missed several bills, i.e., Riveria Utilities and been charged late fees due to never receiving my statements. I have noticed different mail carriers making deliveries. Our previous carrier gave very good service and was very attentive. Today, I called the Postmaster at Daphne to address my concerns. He was very considerate and indicated he would flag my address to the mail carrier to slow down and be more attentive. I hope it gets resolved.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "104016586674897555585", "name": "Dana Bullard", "time": 1560688047326, "rating": 1.0, "text": "I had 4 packages from Hobby Lobby worth over $400.00\nThe package was supposed to be mailed to my Daughter house in Robertsdale.\nI recieved one with no problem.\nMy other 3 was mailed to DAPHNE UPS, they said they put it in the correct bin to be coming to correct UPS.\nCalled them they said we don't have it, if so you would of had it in 2 days.\n\nOver 2 weeks, I got the run around from both UPS\nI called Hobby Lobby filed a dispute and got my money back.\n\nJust ordered 3 more, of course I got one again, looked at tracking says it arrived in DAPHNE.\nWTH is wrong with this UPS?", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "104720718424670061142", "name": "Jennifer Andrews", "time": 1550181798998, "rating": 1.0, "text": "Went into to get my son's passport today before 3 and lady at counter was perturbed as soon as I said what I was there for. She looked around as if I was a burden to her. After shuffling through my papers she says ohhh it can't be black ink. Anyway, its hard for working class citizens to get off work M-F to accommodate the hours of 10-3pm. I expect a friendly face not a RUDE bothered individual. Shame on Daphne Post Office no wonder your rating is 2.3 Stars lucky to be that.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "106930177528463381171", "name": "Robert Akins", "time": 1528124045815, "rating": 1.0, "text": "For YEARS mailbox left wide open throughout entire subdivision. Wet, damaged, OPENED mail and damaged and OPENED delivery boxes. Not scanning packages from mail order pharmacies. Reported missing mail last week but no response. Have reported multiple times and overall lack of care on delivery driver and local manager. 2 employees have shared my concerns especially when I was missing medication and they located for me what wasn’t scanned and misplaced. I am grateful she cared.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "112572940713555869698", "name": "Kimberly Ashton", "time": 1515011495096, "rating": 1.0, "text": "If it was up to me they wouldn't get 1 star!!!! Carrier failed to deliver package, excuse was something was wrong with our address. Spoke with corporate headquarters, consumer affairs, and Daphne post office and all said address was correct. Now only God knows where our package is because no one can find it!! Sounds like fraud to me if carrier gave false information about not being able to deliver due to problem with our address! Post Master hung up on me as well. Not cool or professional at all. Amazon made a big mistake by signing up with USPS as their delivery service!!!", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "112233425758070868021", "name": "Amy Rajek", "time": 1503831617736, "rating": 3.0, "text": "I like the 3 people at counter inside but when u have a problem, call to postmaster = could care less to be helpful.... Service IS in their name but not delivered kinda like my mail all the time & we pay taxes to government offices paychecks and benefits only to be treated poorly & services not handled appropriately. Government anything is a joke these days!", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "109754023714381075432", "name": "EggoTheMeggo", "time": 1533844484763, "rating": 1.0, "text": "Good luck trying to get an actual human being with a pulse on the phone. I called about a package that tracking said had been delivered and left at the mailbox (package is not here), and was put on hold \"for the next available representative.\" Was told my wait time would be 40-50 minutes, and was hung up on after 34 minutes of waiting. Called back, went through the recording process again, was told my new wait time would be 30-40 minutes. Still have yet to speak to an actual person. This has happened before with other packages. I just want what I paid for, and for it to be delivered when tracking says it's delivered.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "101993140518778152261", "name": "Kevin Mims", "time": 1483035455132, "rating": 1.0, "text": "Whoever delivers to the Ashley Gates apartment complex is just down right lazy. Today was 3rd or 4th instance where the person delivering a package basically just threw it up the stairs instead of delivering it to the door. I spoke with a representative about filing a complaint and all I was told was \"well we'll talk to them because we don't deliver to your door\".\n\nLuckily nothing was broken, but it's still unacceptable.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "101993140518778152261", "name": "Kevin Mims", "time": 1483035455132, "rating": 1.0, "text": "Whoever delivers to the Ashley Gates apartment complex is just down right lazy. Today was 3rd or 4th instance where the person delivering a package basically just threw it up the stairs instead of delivering it to the door. I spoke with a representative about filing a complaint and all I was told was \"well we'll talk to them because we don't deliver to your door\".\n\nLuckily nothing was broken, but it's still unacceptable.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "109887643969048477924", "name": "Valerie Rodriguez", "time": 1527716425761, "rating": 5.0, "text": "Everytime I go to the post office in Daphne, AL, the service and friendly attitude has been great! Once, I was the last customer on a Saturday.  Everyone was very helpful with my questions.  When I left they shut it down and locked the door. I got to my car and realized I had left my key on the counter! I ran back and yelled thru the tiny mail deposit slot. They were laughing when they opened it all up again to give me my key. They were very sweet about it!", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "100535031544297023518", "name": "Vadim Cateli", "time": 1481234193428, "rating": 1.0, "text": "This is the most unhelpful place you will find in town. They lost my mail, and when I went in there to try to find out what was going on I got yelled at and ignored by Thomas, that was his name. It's just unbelievable how can somebody be so ignorant and rude to people. I would avoid their services all together. Just go to ups. It might cost more but you won't be treated like garbage!", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "108344459138123128326", "name": "Amanda Nicely", "time": 1567546848722, "rating": 1.0, "text": "This is the worst post office on the planet.  And the woman who delivered the mail is  slow as dirt.  Absolutely ridiculous", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "109464691149749629940", "name": "Bryan Irvin", "time": 1464916191689, "rating": 4.0, "text": "The postal crew there were very informed and explained everything to.you. They even had a great sense of humor.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "114531980788300974808", "name": "Geoffrey Morgan", "time": 1462376565682, "rating": 1.0, "text": "Poor. At best. Order is always delivered to wrong address even though labels are correct. Have called post office and spoke with representatives to have little help changing problem. Only packages not mail is being missed place.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "109199029054039976232", "name": "Bonnie Dentinger", "time": 1534176192952, "rating": 2.0, "text": "Lately I have been having issues getting packages and certified mail on the weekends. Considering I work through the week and make sure I'm home for the delivery on Saturday, it's extremely frustrating to not receive my packages. No notice is left on my door, no knocking, nothing. They don't even attempt to. I then have to make special arrangements to get them. The only reason I'm giving more than 1 star is that someone in the office helped get my certified mail delivered to my workplace after the delivery person decided not to attempt to get it to me on the Saturday prior.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "117391671372413098311", "name": "Victoria Wilson", "time": 1536610236912, "rating": 1.0, "text": "Rude, unfriendly. Don't accept complaints or criticism. The mgr will talk over you when you try. NOT HELPFUL!", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "106780142366312566892", "name": "oana out", "time": 1481231572943, "rating": 1.0, "text": "they misplaced my package, and for 2 days I'm trying to get in touch with a supervisor to check the tracking nr and to tell me exactly what happened to my mail! she is busy and she said she will call me,  is the worst  costumer service ever! doesn't  even have the guts to come and talk to me, and is my 3rd trip to the post office!  They act like I'm asking for favors not that this is their job!!!!  please save yourself time and go to real delivery company. USPS Sucks.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "111239202228477199228", "name": "Tara Lancour", "time": 1451571424446, "rating": 5.0, "text": "I'm usually outta there pretty quick and all the USPS employees are really nice!", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "118004110851794988525", "name": "Philip Yeakel", "time": 1528492930732, "rating": 1.0, "text": "Several packages have been \"delivered\" only to find no package available. I'm not sure what is going on here, but it's near impossible to get a straight answer from anyone at this office.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "110373085433131654897", "name": "Rachel Tucker", "time": 1467214689742, "rating": 3.0, "text": "Everyone is very nice and informative except for the older lady in there she is pretty rude. Maybe I just catch her on bad days?", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "107592475762883537770", "name": "Peggy Benandi", "time": 1519845458739, "rating": 5.0, "text": "Personnel has always been helpful and friendly.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "101477099740838848541", "name": "Erica Danielle", "time": 1469475094826, "rating": 1.0, "text": "I truly don't understand how difficult it is to make sure that people get the right mail. For the past month now I keep receiving other people's mail and other people keep getting my mail. I actually was supposed to receive a package today and it says it was delivered but guess what it's not here.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "117876887866405335867", "name": "Bryan Flott", "time": 1451758170068, "rating": 5.0, "text": "Fast response on answering the phone and packaging delivery.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "116442849367017280664", "name": "Dean Lemieux", "time": 1452618407572, "rating": 1.0, "text": "Called to check on a package that per the USPS and the tracking number had been delivered to my residence on 01/11/15 @ 10:09am?    I called the next day after the mail delivery and still no package?  When I called, \"Stacey\" answered the phone and asked what I was calling in regards too?  I explained I needed to check on a package, explained I had the tracking number, and she asked if I could hold?  I said yes........tick tock......tick tock......tick tock............it's been 41:09 minutes now and I am still listening to the horrible music and the \"Thank you for calling, we sincerely appreciate your patience\" radio announcer voice.  Hello....echo, echo, echo......Hello, is there anybody in there?  Echo, echo, echo!   Next time I think I will ship via UPS or Fedex?  Oh, and now it has been 45.04 minutes.....hanging up now....buh bye!", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "100297733277299785793", "name": "William Robbins", "time": 1533742846995, "rating": 1.0, "text": "You will chase your tail off trying to simply talk to a person with a heartbeat.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "109850750872369931995", "name": "L Peterson", "time": 1516489620012, "rating": 1.0, "text": "Worst postal service EVER! Mis-delivered mail, damaged packages, lost mail etc etc. Multiple complaints made to no avail.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "103519047109357583479", "name": "Maureen Kennedy", "time": 1538234046554, "rating": 1.0, "text": "Very poor customer service.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "109281639250318060969", "name": "Tracey Beaver", "time": 1488683193820, "rating": 3.0, "text": "Prepare to stand in line.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "112372180207805720189", "name": "bigby wolf", "time": 1511996383075, "rating": 1.0, "text": "Absolutely awful", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "115628985999810395426", "name": "Melissa Langley", "time": 1499891557347, "rating": 1.0, "text": "They drive through lake forest at at least 40 So why don't the cops do their job when the speed limit here is 25", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "114925455742078898537", "name": "Phyllis R. Cochran", "time": 1487680449005, "rating": 3.0, "text": "Long lines", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "103663689297629855544", "name": "The Courtney Family", "time": 1446062258049, "rating": 1.0, "text": "My mail is constantly being delivered to the wrong address and they gave some one my package and has yet to get it back to me.", "pics": null, "resp": null, "gmap_id": "0x889a43d7d461da2f:0xc7eccdfab6fbe1cb"}
{"user_id": "116754356576089616867", "name": "Paula Calhoun", "time": 1595334984004, "rating": 5.0, "text": "Very friendly and helpful staff.  I went in yesterday with a couple of my own  boxes  that i packed, but price was too high so the sweet employee gave me a good tip on how to pack my items so i could use the priority boxes she gave me and save a lot of $.   She was right about rolling the clothes up and more fit in there than looked like would.", "pics": null, "resp": null, "gmap_id": "0x888ec636447961c1:0x15fa004364606fcd"}
{"user_id": "100611248587377284178", "name": "Sabrina Shavers", "time": 1598985098661, "rating": 5.0, "text": "Always have a great experience when I come in here and have to ship something.. Mrs. Crumpton is always so nice and informative.", "pics": null, "resp": null, "gmap_id": "0x888ec636447961c1:0x15fa004364606fcd"}
{"user_id": "113838505617028152597", "name": "tabitha fulmer", "time": 1599496880011, "rating": 5.0, "text": "The employees at this post office are always friendly and go out of their way to offer any help", "pics": null, "resp": null, "gmap_id": "0x888ec636447961c1:0x15fa004364606fcd"}
{"user_id": "107590135784995929177", "name": "andrew martin", "time": 1481602395636, "rating": 5.0, "text": "Probably best post office I've been in. Helpful. Nice postal employees here.", "pics": null, "resp": null, "gmap_id": "0x888ec636447961c1:0x15fa004364606fcd"}
{"user_id": "103470995000362938869", "name": "Sassy Sophia", "time": 1481469421224, "rating": 5.0, "text": "The workers at the Clanton U.S.P.S. are always friendly and help.", "pics": null, "resp": null, "gmap_id": "0x888ec636447961c1:0x15fa004364606fcd"}
{"user_id": "117904167548557515649", "name": "Donald Gulledge", "time": 1431327498421, "rating": 3.0, "text": "This is NOT the address for the Clanton Post Office.\nThis is the Old address of the Clanton Post Office which was purchased by the city of Clanton & now the current Location of Clanton city Police Department.\nCurrent location of Clanton Post Office is off of 6th Street listed as U.S. Post Office", "pics": null, "resp": null, "gmap_id": "0x888ec636447961c1:0x15fa004364606fcd"}
{"user_id": "108566621943761627613", "name": "Boosted 4doorEg", "time": 1501835896999, "rating": 5.0, "text": "Always get in and out super quick", "pics": null, "resp": null, "gmap_id": "0x888ec636447961c1:0x15fa004364606fcd"}
{"user_id": "100016606006903862819", "name": "Angeles Cárdenas", "time": 1493405253941, "rating": 5.0, "text": "👍🏻📨📬", "pics": null, "resp": null, "gmap_id": "0x888ec636447961c1:0x15fa004364606fcd"}
{"user_id": "114450797268928530506", "name": "Marie E", "time": 1615252522111, "rating": 1.0, "text": "There was only one employee. The line and wait were far beyond reasonable! The one employee, a tall bald man, was extremely rude. I had a passport appointment, and he used his phone during the time he was taking my picture. Also, he was hasty and rushed me. He did not mention or suggest anything about priority or express mail or insurance. He lost my application at one point during the process. He told me to write on the form to correct it, when the dept. of state explicitly says NOT to write on the form. When I told him that, he said something to the effect of, \"Trust me, I've been doing this for years, and I took the all day class. I know what I'm doing.\" With a sharp tongue. My application never made it to the dept., and it is now lost with my original birth certificate and a check I had to pay to void, with no way to track it's whereabouts. Absolutely horrible. Id give them -5 stars if I could.", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "115263261566591296616", "name": "George William", "time": 1550365837611, "rating": 1.0, "text": "I’ve lived all over the country. This post office is the absolute worst ever. Soooooooo slow and the employees are clueless. I can only imagine the sight if these workers had jobs where they had to produce. They also need to update their posted hours. I was here on a Saturday right after 8:30 because online it states 8:30. However their window shows 9:00 and of course they didn’t unlock the door until EXACTLY 9:00 in spite of a line waiting outside.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPmn_a1n0-xT6u5UhfQsQcXr9HAsPji4ElsDK-k=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "115656245667502094113", "name": "Reme lopes", "time": 1619314513500, "rating": 1.0, "text": "Positive this place is stealing packages\nI’ve had two packages say attempted deliver but that they didn’t have access to my apartment building\nFor three days in a row now, my packages are gone.\n\nMy apartment building is never locked and doesn’t even have a lock on it.\nToday Saturday was their “ attempted re delivery “ for all of my packages ( sep order)\nAnd no one even showed up.\nAlso yay me it’s Saturday they said they re delivered around 7 pm which is coincidental that tomorrow they are closed and already closed today.\n\nI will be calling to people above them, to get this area reported.", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "112830775751175354426", "name": "jeffrey mathis", "time": 1623054970434, "rating": 1.0, "text": "Our residence, 3257 Monte Doro Dr, 35216 has had no delivery of mail since Wed., June 2 through Sat., June 5. That's 4 days. I will attempt to be in someone's ear about this.", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "111959209227768772028", "name": "Paul Goodall (PrincePaul)", "time": 1611680966880, "rating": 1.0, "text": "I scheduled a passport appointment on 1/21/2021.  The appointment was confirmed to take place at 10:00am on 1/26/2021.  I arrived 10 minutes early on the 26th as directed and was informed that... \"The guy who does passports isn't here today.  He said he was going to call everyone who had an appointment and let them know.  They called me to come open the store.  I'm not even supposed to be here.  You can wait if you want but usually if he was coming in, he would already be here.\"\n\nObviously, I left.\n\nI had to leave work for this appointment and now I'll have to leave again on the 28th... to go to a different location, of course.  You may rest assured I received no call from this man.  You may also rest assured that this place deserves even less than the 1.9 stars they have earned for themselves.", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "115243163287953838081", "name": "Kirsten Ratza", "time": 1601158334559, "rating": 1.0, "text": "I am quite frustrated with this post office. I had a package marked as delivered that never appeared at my home. Now, three weeks later, the same thing has happened again. Another package is marked as delivered but has not appeared.  What is happening to this service?  I would rather have slower but accurate service then missing mail.  Please, if someone of any authority reads this, figure out what is happening to this vital service! We rely on you to do good work.", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "112977561381955491291", "name": "notthebeesxoxo", "time": 1606922222788, "rating": 1.0, "text": "Slow with usually only one person working the entire office. If they are tied up doing passports, they will tell you they can't help you. They have lines out the door of people with one person working always. They will also set out hand written signs that say they will be back later, leaving the doors unlocked and the office completely open with no one in it.", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "113016672605434024601", "name": "Kristen W.", "time": 1615234386286, "rating": 5.0, "text": "I was wary of visiting because all the reviews are bad but it was a good experience. There was a line but Lakita was pleasant and efficient.", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "109211121042585190004", "name": "peter rambin", "time": 1603911992646, "rating": 1.0, "text": "Amazon package not delivered for no apparent reason. Just says held at location and gives me the address for the vestavia post office. Obviously I'm already frustrated since I paid for delivery. I go there and ask if my package is there and the man working very rudely starts cutting me off and telling me I don't have a p.o. box there he doesn't have my package and that it's at green springs location. That's fine and dandy, but could he not tell me nicely it, even in a neutral tone? Why did it set this guy off and why could he not conduct himself like an adult to tell me this? He also appeared to have a nicer shirt in than the other employee as if he might be in charge/the manager which is insane given how he acted like a child. Based on these reviews I'm not alone with incredibly incompetent and rude staff.", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "103475734974756231837", "name": "Kenneth Carden", "time": 1611073505308, "rating": 1.0, "text": "Lazy. The bald guy here will cut corners if he can. Make them verify the address sent and also just go to another post office.", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "104311904293512752320", "name": "William Sellers", "time": 1613064313033, "rating": 1.0, "text": "I don’t even review places but I had to leave this 1 star after my experience today.", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "113553593475001758118", "name": "jacob g", "time": 1611610530183, "rating": 1.0, "text": "Declined service at 3:30 on a monday when no else was in store.", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "108150381681216469750", "name": "Melanie Taylor - Coleman", "time": 1559571016602, "rating": 4.0, "text": "In and out in 5 minutes or less. The service was fine. Others complain about the long line. The newer post offices are much bigger. This little place can’t help but have a line. My issues is the building. This location is very old and dark. The location can also be hard to get in and out.", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "102268997114995862389", "name": "JIll Billions", "time": 1545660138126, "rating": 1.0, "text": "This post office is unfortunately the slowest post office ever. The same employees have been there for ages and take their sweet time no matter how long the line is. Occasionally they’ll get a new or temp worker that is smiley and more proficient which is a breath of fresh air. I absolutely dread this post office and often drive farther to a different one. I’ve also mailed cards directly from here that were local and took over 2 weeks to arrive.", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "110986215175047642183", "name": "Jessica Gunter", "time": 1603996323310, "rating": 1.0, "text": "Wouldn't make a copy of change of address to enroll a student as proof of address change for the new school ... school told me that the post office did actually what i needed went to a another post office and got what was needed for the school .... when they told me it would be 10 to 15 business days", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "118271476984798625451", "name": "Jenna Willoughby", "time": 1547750354740, "rating": 1.0, "text": "Very disappointed with my attempted visits here. I had a passport appointment at 10:00 am (first appointment of the day) and when I came in they said all passport appointments had been canceled. She said they called everyone but I did not have a missed call. I scheduled an appointment for another day at 10:00 am. I went in and the man said they canceled all passport appointments again!! I did not have any missed calls, and the night before I received confirmations of my appointment. Not coming back.", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "107033556984430232294", "name": "Matt Burke", "time": 1578420964804, "rating": 1.0, "text": "Friendly but not enough employees especially when they’re the busiest—during lunch hours.  Line is regularly out the door with only 1 employee at the register.", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "100595554795104408264", "name": "Jesse Carter", "time": 1580500774559, "rating": 1.0, "text": "I was 5 min late for a passport appointment after driving 40 min away and having to wait in traffic. She said after 3 min your late and I can't help you. Like exceptions can't be made over 2 min? The past 3 usps ive been too have had awful service. Its like they hire way underqualified people to work there that don't understand what line of work they are in. The answer is customer service by the way. They need to take some training courses to learn how to service people. Mcdonalds has better customer service.", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "115048124014078639941", "name": "Shaun Thomas", "time": 1488312916106, "rating": 1.0, "text": "I called because a package was attempted for delivery to my business and a \"notice\" was supposedly left because we were closed. There was no notice to be found, and the carrier did not show up the next day to redeliver. The phone number online is a fax line, so no luck calling to get anyone on the line to explain. I've had other similar experiences here in person where employees couldn't be any less concerned with helping customers. I also have had packages taken without being given tracking information after asking for it. Hate having to deal with this office.", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "115434532513154416556", "name": "Adaryl Mines", "time": 1565916277699, "rating": 1.0, "text": "One of the letter carriers rear ended my car not paying attention at a stop light. It's going on 2months and they still haven't called me or my insurance agent back about the repairs my car needs. When you call all you get is the run around and directed to a claims lady that is never in her office nor does she return phone calls.", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "102723060135943928754", "name": "Nikki Aaron", "time": 1514310688716, "rating": 1.0, "text": "A family had an appointment to get passports. Instead of having two desk workers to cover the appointment and regular business, these morons sent the second employee on a long break. So a long line of customers had to wait and wait to get our business handled. I'm so glad we spend all our tax revenue on war instead of on making the government run smoothly.", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "107440981150969572995", "name": "Katie R", "time": 1355871341452, "rating": 4.0, "text": "I have never used this post office location, as it is not really near my home or work but it was convenient to me yesterday to purchase stamps and mail my Christmas Cards.  This location was by far the most personable I have been to in many many visits.  There was a line out the door but the two clerks working the registers stayed calm and friendly the entire time, even when the system went down and quit taking credit/debit cards.  They were friendly and patient and it was truly a nice experience despite the wait in line.  They were efficient and methodical as well.  Often times at other locations I feel as though the clerks are attempting to see just how SLOWLY they can process everybody in line.\n\nJob well done, despite your location not being convenient to me, I wouldn't mind making the drive just to have this good of service from a postal service office.", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "117143349941836745213", "name": "Stina Journey", "time": 1459351831173, "rating": 1.0, "text": "I tried calling about getting a passport and the lady didn't even care. I am new to the area and didn't know about the walk-in building. I had to ask her about the address for the walk-in building and she quickly told me. I asked about the times they were opened. She quickly told me with a very bad \"I'm better than you\" voice and hung up. I didn't even get to ask about the application or what forms of ID I needed to bring. I'm definitely not calling back or wanting to be a customer.", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "118337628606151715413", "name": "Seble abadi", "time": 1584462243741, "rating": 1.0, "text": "Worst place to do business at. The staffs are horrible. It’s a place you wouldn’t want to go back again!", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "114668571028239959090", "name": "Marcus Ross", "time": 1594826137856, "rating": 1.0, "text": "Slowest. Post Office. Ever.", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "115507371937272219416", "name": "Christian Mays", "time": 1482606845003, "rating": 5.0, "text": "This post office and the post office downtown were rated some of the United States fastest post offices. Heck yes. My packages have never been late. It's pretty incredible.", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "100292440626520070024", "name": "Jermaine Watkins", "time": 1489591702175, "rating": 1.0, "text": "Took forever to get on the phone & when answered was rushed to get off. Tried to pass me off to the main office several times. I recommend going to the UAB location. They were very nice AND efficient", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "103275798646303936568", "name": "Arnold Servo", "time": 1383232190591, "rating": 1.0, "text": "The single worst experience I had at an USPS office!  I was \"served\" by Mrs. Joanne Simmons.  It became evident pretty quickly that this lady couldn't care less about working at this office or to fulfill the most minimal and basic duties this government paid job requires.  Admittedly, there might be other great service providers / employees at this facility, but the fact that the disrespectful and incompetent behavior of a person like Joanne Simmons is tolerated there, makes me doubt that this is the case.", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "114479284096578275253", "name": "Richard McCallum", "time": 1539639256486, "rating": 1.0, "text": "Plan to wait at least 10 to 30 minutes if you need to see someone at the counter. You would figure that they would have full staff on busy days like April and October 15th. It seems like every time that their is a deadline, the line is out the door and there is only one person at the counter.", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "112702160212323987472", "name": "Daniel Ford", "time": 1530368234198, "rating": 5.0, "text": "Going to the post office is never fun, but it's not their fault that the lines are long. I've never had anything other than a positive experience here, and I ship packages for my business regularly", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "115706162412608533661", "name": "Tiffany Roberts", "time": 1566934896931, "rating": 2.0, "text": "This is the slowest post office anywhere around. There's only ever 1 cashier and a ton of people in line. It's worth the hassle to just drive to Hoover where they actually have multiple employees and it doesn't take 20 minutes to mail a single package.", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "107623352229526189193", "name": "Dee X", "time": 1540914743198, "rating": 2.0, "text": "Went there around 10am. Line wasn't too long so that wasn't bad, but one of the employees was rushed and rude to the customers that were ahead of me.", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "115945115866480634546", "name": "Sharon Worcester", "time": 1539988897973, "rating": 1.0, "text": "Been twice. First time the doors were locked more than 5 min before closing. Second time I made it at 10 min til closing and a man at the counter rudely said I had 3 min and should probably just come back in the morning. There won't be a third time.", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "103033919521867214128", "name": "Wrath", "time": 1505495037372, "rating": 1.0, "text": "Several post office locations nearby. Do not go to this one. You will regret it.", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "101207180572289569625", "name": "Tommy Norton", "time": 1536696713571, "rating": 1.0, "text": "I would rather go to a dog fight than to the USPS.", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "101216743082299773656", "name": "Robert Evans", "time": 1485559016507, "rating": 2.0, "text": "Not very friendly. Act like you need an appointment to get a stamp.", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "112104718007165768237", "name": "Rebekah Eckard", "time": 1437511613262, "rating": 2.0, "text": "Slowest post office ever. 5 customers. 2 employees. 20 minutes.", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "106164141656186991920", "name": "Gary Grimes", "time": 1565898014773, "rating": 3.0, "text": "Typical post office", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "107454367179028028067", "name": "Stephanie Sprouse", "time": 1492112004032, "rating": 5.0, "text": "Friendly service", "pics": null, "resp": null, "gmap_id": "0x88891902e7051c2d:0xe6d6256f81649ab8"}
{"user_id": "103079809311060202996", "name": "Blair Winfield", "time": 1576349697121, "rating": 1.0, "text": "I guess the days of courteous behavior is gone when Sharon is not there and since Sarah has retired.\n\nThere are two women in there at the counter who are the most rude and obnoxious people. I don't think it's right for them to behave that way when people.go in there and spend their money to send cards off to loved ones for the holidays. It doesn't matter what day it is or what it's for. They do not have the right to treat people horrible or ruin their day. They need to rethink their attitudes or  go find another job that does not require talking to patrons.", "pics": null, "resp": null, "gmap_id": "0x888990ec20fe7ee9:0x40e0c9c207d11405"}
{"user_id": "111704733508494880791", "name": "Jacob Warden", "time": 1586556979312, "rating": 5.0, "text": "Hey, I was in there today around 4:30 April 10th. Firstly. I'm sorry if I was out of place with anything I said while I was in there, I wasn't  trying to make the situation worse at all....\nSecondly,  your whole staff is incredible.  You are all very nice and kind and helpful. I just hope I didnt make the situation worse with anything I said.  I know you all try your best every day and it shows! Thank you for your kind service to the oneonta community!", "pics": null, "resp": null, "gmap_id": "0x888990ec20fe7ee9:0x40e0c9c207d11405"}
{"user_id": "110664910339835380085", "name": "Heather Reeves", "time": 1582249308288, "rating": 1.0, "text": "Only because one is an option. I mailed a package on the 14th of feburary and it's still siting at the post office at this time. I really dont recommend going here.", "pics": null, "resp": null, "gmap_id": "0x888990ec20fe7ee9:0x40e0c9c207d11405"}
{"user_id": "114073907509468414606", "name": "Lela Dailey", "time": 1564404062480, "rating": 5.0, "text": "The staff is excellent and knowledgeable.\nI've never had any problem with them\nand we've had a box there for many, many years.", "pics": null, "resp": null, "gmap_id": "0x888990ec20fe7ee9:0x40e0c9c207d11405"}
{"user_id": "108530722004666041407", "name": "homesteader fifty w/ ricky & martha", "time": 1589814678014, "rating": 5.0, "text": "Thank you ,ladies  for sesrching high and low for our package ..", "pics": null, "resp": null, "gmap_id": "0x888990ec20fe7ee9:0x40e0c9c207d11405"}
{"user_id": "101553189892874296312", "name": "Kate Lucille", "time": 1498928344991, "rating": 5.0, "text": "I had called to check on a package that they are supposed to receive soon and they were very sweet and quick about everything", "pics": null, "resp": null, "gmap_id": "0x888990ec20fe7ee9:0x40e0c9c207d11405"}
{"user_id": "108861052154508325673", "name": "Neil Putman", "time": 1489332513227, "rating": 5.0, "text": "THE PEOPLE IN POST OFFICE  IN ONEONTA AL ARE REAL NICE THAT IS WHAT MAKES  A REAl Great post office friendly faces always good .so good to you  it's like 0 so good BarBQ its so good to see some being good to you.you it makes you to want back and buy their steamps or say Hi How you doing you go to out for a veggie pizza at pizza Hut", "pics": null, "resp": null, "gmap_id": "0x888990ec20fe7ee9:0x40e0c9c207d11405"}
{"user_id": "104017794118878473808", "name": "Anthony Cornelius", "time": 1481913808075, "rating": 5.0, "text": "Very helpful staff. Unlike most of the offices I have visited.", "pics": null, "resp": null, "gmap_id": "0x888990ec20fe7ee9:0x40e0c9c207d11405"}
{"user_id": "116932230839172833498", "name": "Chris Mahan", "time": 1499122642262, "rating": 5.0, "text": "Very professional and helpful.", "pics": null, "resp": null, "gmap_id": "0x888990ec20fe7ee9:0x40e0c9c207d11405"}
{"user_id": "105865668816712421162", "name": "Mary Chappell", "time": 1530591992018, "rating": 5.0, "text": "Very helpful and nice.", "pics": null, "resp": null, "gmap_id": "0x888990ec20fe7ee9:0x40e0c9c207d11405"}
{"user_id": "106320211737120164640", "name": "LeudisFit", "time": 1618036800714, "rating": 1.0, "text": "Really bad experience! I ordered some medications I needed for this Friday, I ordered on last Monday it was delivered on Thursday to the wrong address, I went to the post office, they took my number, the delivery man just told me “Maybe one of your neighbors has your package, I think I put it in the wrong mail box” it has been happening a lot lately on my apartments complex because I went to the apartments office to see if my package was delivered there, and they said some neighbors complained about the same experience. I hope they be more carefully about people package.", "pics": null, "resp": null, "gmap_id": "0x889a04d774e72a2f:0xd2712a0f5729d160"}
{"user_id": "116651715813493614999", "name": "Curt Brewer", "time": 1539788170339, "rating": 3.0, "text": "***** UPDATE 10/17/2018 *****\n\nI have noticed that many personal items of mail that we receive to our P.O. Box have been ripped as if someone has looked in on it.\n\nPlease stop this!!!\n\nIt happens to most of the items that look like they may be a \"Check\" or a \"Financial Item.\"\n\nPlease, Gulf Shores Post Office, Please look into this.  It happens a lot in the past year.\n\n------------------\nEnd of new review\n------------------\n\nI have read several reviews from this place, and people have rated it low. I've seen the volume they do in this post office, and I'm surprised at how patient they can actually be with the amount of people that come through. The building and the property leave a few things to be desired, but for the most part, everybody here is nice and friendly and they do try to help you to the best of their ability!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO_UBLlaNeQOJXrW2MHwwIgapcjvJ2vk0FlEpea=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a04d774e72a2f:0xd2712a0f5729d160"}
{"user_id": "111518165109213981937", "name": "SE Editor", "time": 1583518474773, "rating": 5.0, "text": "Edward provided excellent customer service. He was fast, friendly and efficient as he weighed and prepared postage for the 45 boxes we were sending across the United States. Keep up the good work Edward and Gulf Shores Postal Service.", "pics": null, "resp": null, "gmap_id": "0x889a04d774e72a2f:0xd2712a0f5729d160"}
{"user_id": "113036927321045689024", "name": "Cody Cothren", "time": 1574774223795, "rating": 5.0, "text": "Everytime i use the post office here everyone is friendly. As someone who uses the post office a lot I know that the Gulf Shores office is one of the better offices around. They have a high volume of customers and mail. Prices are set by congess. Tax dollars are not used, the post office funds itself. Put yourself in the employees shoes dealing with customers that have messed up addresses or came to complain to them and they had nothing to do with that situation, but they listen and try and help. I know I would be a little frustrated sometimes too. Just a thought. Maybe it will make the experience better if you don't come in blaming everyone and just ask for help instead. Most of the negative comments i have read on here are just people whining because they didn't get exactly what they wanted and chances are they didn't pay to get it either. The post office has premium services for just about everything from special handling to restricted. You just have to be willing to pay for the service or properly wrap the items.", "pics": null, "resp": null, "gmap_id": "0x889a04d774e72a2f:0xd2712a0f5729d160"}
{"user_id": "117549281939940965682", "name": "connie lopez", "time": 1582173304595, "rating": 5.0, "text": "The post office staff from the Postmaster to those that work at the counter in Gulf Shores are always so helpful and very pleasant.", "pics": null, "resp": null, "gmap_id": "0x889a04d774e72a2f:0xd2712a0f5729d160"}
{"user_id": "111951203390182297449", "name": "Nancy Pfaff", "time": 1600202795281, "rating": 5.0, "text": "Staff is always helpful and patient 😀", "pics": null, "resp": null, "gmap_id": "0x889a04d774e72a2f:0xd2712a0f5729d160"}
{"user_id": "109248289709786576820", "name": "Stefanie Stortz", "time": 1569704477881, "rating": 5.0, "text": "A big shout out to Dixie and Roger at thr Gulf Shores location. I had a problem today and they worked fast and fixed it on a Saturday!! Thank you so much!!", "pics": null, "resp": null, "gmap_id": "0x889a04d774e72a2f:0xd2712a0f5729d160"}
{"user_id": "111059321261128314292", "name": "Thomas Davison", "time": 1549662699455, "rating": 1.0, "text": "Would not recommend this post office, Not vacationer friendly. Will not hand out General delivery mail except on Thursday and Friday between the hours of 2pm till 4pm. Called and talked to Postmaster and he stated that they would rather have you rent a P.O. box instead of using General Delivery. They would rather make the money off of P.O. box instead of the inconvenience of general delivery. Now I understand why the post office is going under. Lack of customer service. I explained to the post master it might be a good idea to post the general delivery rules somewhere so people will know. It sounded like he didn't care. Will be using UPS stores in the future.", "pics": null, "resp": null, "gmap_id": "0x889a04d774e72a2f:0xd2712a0f5729d160"}
{"user_id": "110075922311451999121", "name": "Niconico nii", "time": 1551459988705, "rating": 5.0, "text": "My favorite post office. Go early. It gets packed quick.", "pics": null, "resp": null, "gmap_id": "0x889a04d774e72a2f:0xd2712a0f5729d160"}
{"user_id": "106184557121123866722", "name": "Jane Randolph", "time": 1571241677919, "rating": 5.0, "text": "Suzanne was so helpful even though it was my error on packages that were addressed incorrectly. Thank you Gulf Shores Post Office.", "pics": null, "resp": null, "gmap_id": "0x889a04d774e72a2f:0xd2712a0f5729d160"}
{"user_id": "101133921698130686370", "name": "Sean Nichol", "time": 1451512876173, "rating": 1.0, "text": "Every single time my wife or I come in there which is often since we buy and sell a lot on eBay. These people are always so rude and act very inconvenienced. They charge me twice what UPS does for a simple padded envelope. I will no longer be using this post office ever again.", "pics": null, "resp": null, "gmap_id": "0x889a04d774e72a2f:0xd2712a0f5729d160"}
{"user_id": "105935930932925378754", "name": "Sofia Rivera", "time": 1500575995779, "rating": 1.0, "text": "Doesn't matter what the package is labeled with, my lights always come broken. I can't get these reptile bulbs local so I have to order online, only they are usually damaged in shipping even with big labels saying \"GLASS BE CAREFUL\". Now I have to find someone to drive to since I've been waiting for reshipments of the same product, only to arrive once again broken. Very displeased and will avoid from now on.", "pics": null, "resp": null, "gmap_id": "0x889a04d774e72a2f:0xd2712a0f5729d160"}
{"user_id": "101292581641528377023", "name": "Sondra Kilgo", "time": 1566424962152, "rating": 5.0, "text": "Fast and Super Friendly 😊", "pics": null, "resp": null, "gmap_id": "0x889a04d774e72a2f:0xd2712a0f5729d160"}
{"user_id": "100734923312528273151", "name": "Angela Wingard", "time": 1511194277411, "rating": 1.0, "text": "Susan is the rudest person o have ever delt with...she was unwilling to help anyway and to top it off was talking to me like i was stupid. Very obvious she did not want to help me..bad experience", "pics": null, "resp": null, "gmap_id": "0x889a04d774e72a2f:0xd2712a0f5729d160"}
{"user_id": "111051494586253230695", "name": "Irina Gusak", "time": 1558792072228, "rating": 5.0, "text": "The Best staff!!!", "pics": null, "resp": null, "gmap_id": "0x889a04d774e72a2f:0xd2712a0f5729d160"}
{"user_id": "107794631144280684551", "name": "David", "time": 1499919173007, "rating": 3.0, "text": "Slow", "pics": null, "resp": null, "gmap_id": "0x889a04d774e72a2f:0xd2712a0f5729d160"}
{"user_id": "112741975685597675051", "name": "William Frost", "time": 1505327173420, "rating": 5.0, "text": "Very friendly", "pics": null, "resp": null, "gmap_id": "0x889a04d774e72a2f:0xd2712a0f5729d160"}
{"user_id": "115199141866074503550", "name": "Geoff HockeyDad", "time": 1485971885355, "rating": 5.0, "text": "Friendly and helpful staff, full service P.O.", "pics": null, "resp": null, "gmap_id": "0x889a04d774e72a2f:0xd2712a0f5729d160"}
{"user_id": "108287941463956135519", "name": "Richard Kiefl", "time": 1487717584553, "rating": 4.0, "text": "Love the post office", "pics": null, "resp": null, "gmap_id": "0x889a04d774e72a2f:0xd2712a0f5729d160"}
{"user_id": "111546184360833192269", "name": "Mister Haznoskilz", "time": 1443988521179, "rating": 5.0, "text": "Just your regular post office.", "pics": null, "resp": null, "gmap_id": "0x889a04d774e72a2f:0xd2712a0f5729d160"}
{"user_id": "117482647791404257068", "name": "Adventures with Maverick", "time": 1452894447637, "rating": 1.0, "text": "Can't get an answer", "pics": null, "resp": null, "gmap_id": "0x889a04d774e72a2f:0xd2712a0f5729d160"}
{"user_id": "109401646706741764069", "name": "DJ Jenks", "time": 1434636867570, "rating": 5.0, "text": "Its a Post Office, Yaaaaay!", "pics": null, "resp": null, "gmap_id": "0x889a04d774e72a2f:0xd2712a0f5729d160"}
