{"user_id": "100223822991006352351", "name": "Sandra Wood", "time": 1614895917782, "rating": 5.0, "text": "This is hands a great law firm.  Steve Heninger and his paralegal Pamela were phenomenal from start to finish.  Steve took our complex case, and was responsive/empathic throughout the entire process.  He was able to reach a successful resolution without having to proceed with a trial.  We were very pleased with the outcome, and would not hesitate to use this firm in the future.  Would highly recommend.", "pics": null, "resp": {"time": 1615248295893, "text": "Hi Sandra, thank you for the great review. We always put our clients first, and it’s excellent to see that you had a five-star experience with us."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "117448887259587661989", "name": "Jack Simpson", "time": 1621350993699, "rating": 5.0, "text": "Eric has been working  on a case for me for awhile now. He’s always communicated with me about the case and was always looking out for my best interests. I would recommend them to anyone who’s looking for a great attorney. Thanks you sir for all you’ve done for me and always going the extra mile.", "pics": null, "resp": {"time": 1621364096973, "text": "Thank you for your review, Jack! Communication is a top priority when it comes to serving our clients at HGD."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "104068073877662004616", "name": "Jessica Shackelford", "time": 1614702477089, "rating": 5.0, "text": "Working with Nada and Jackie was a dream! They always made themselves available to answer questions. They explained things clearly to me that allowed me to make the best decision for me. They never stopped fighting for my case to ensure I received what was deserved. I can truly say they have changed my life!", "pics": null, "resp": {"time": 1614888219410, "text": "Hi Jessica, thank you for leaving us a great review! We’re here to give our clients the best representation and it’s fantastic to hear that you received top-quality legal support."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "100931808633067923799", "name": "Neal Owings", "time": 1624460239058, "rating": 5.0, "text": "Excellent Law Firm, Anna Carroll did her due diligence and exceeded my expectations. Thank you!", "pics": null, "resp": {"time": 1624460931185, "text": "Thank you for the 5-star review, Neal!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "103514086294878354306", "name": "MsBooFish", "time": 1627771472452, "rating": 5.0, "text": "Consummate and compassionate professionals! I highly recommend this firm!!", "pics": null, "resp": {"time": 1627911376679, "text": "Thank you for your kind words!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "107388512022129772614", "name": "Dustin Mccombs", "time": 1611773710890, "rating": 5.0, "text": "During my experience with Heninger Garrison Davis, I have been shown courteous, personalized, and prompt coordination in our relationship. I am never left in the dark and am always included step by step in progress and decision making along the way! They have been an excellent firm to work with!", "pics": null, "resp": {"time": 1612230062991, "text": "Hi Dustin, thank you for the great review. We always put our clients first, and it’s excellent to see that you had a five-star experience with us."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "112910142062003713756", "name": "Jonathan Lusk", "time": 1615469332047, "rating": 5.0, "text": "As a practicing attorney myself, I was well aware of this law firm's excellent reputation before I selected them to handle a lawsuit on behalf of my family. The firm lived up to its reputation and more.  Attorneys Tim Davis and Mark Ekonen handled our case. They both worked tirelessly all the way through to a successful settlement. My family and I could not be more pleased with their legal expertise and consummate professionalism. Moving forward, I will refer clients to Heninger Garrison Davis without reservation. Take it from an attorney who knows the difference between average and superior legal representation -- if you have been wronged and need a top flight law firm in your corner to achieve the best possible result, contact Heninger Garrison Davis.", "pics": null, "resp": {"time": 1615471606817, "text": "Thank you so much for your kind words, Jonathan! It means so much coming from a fellow member of the legal community. All the best to you and your family!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "108263681152454855991", "name": "Jacklyn Stegman", "time": 1614369530401, "rating": 5.0, "text": "After our bad accident (a semi truck merged into us at 65mph) myself and my mother-in-law were referred to Heninger Garrison Davis as the people who could help us the best. Let me tell you, they were right. The people we worked closest with were Mark,  Eric, and Beverly, and they are all so friendly and helpful.\n\nEven considering that I moved to a different timezone shortly after the accident, I still felt that I was able to easily communicate with them about any questions or concerns I was having (they respond with most efficiency to email in my experience).\n\nDuring negotiations with the other party (which lets face it, thats the part all of us care about the most) I was shocked by how willing this practice was to work with us and help us obtain the settlement we needed to finally put this ugly event behind us. While I sincerly hope that I am never in another situation that would call for it, I would happily use this law firm again and/or refer them to any friend or family member in need of legal representation.", "pics": null, "resp": {"time": 1614815223284, "text": "Hi Jacklyn, thank you for leaving us a great review. We’re here to give our clients the best representation and it’s fantastic to hear that you received top-quality legal support."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "103328392431722193625", "name": "Lisa Jones", "time": 1607621476590, "rating": 5.0, "text": "I truly had a pleasant experience working with Anna. This was a very sensitive matter for me & my first legal issue. Anna came highly recommended to me, and I would recommend her to someone else. I really appreciate you representing me.", "pics": null, "resp": {"time": 1611161443872, "text": "Thank you for your recommendation, Lisa! We are lucky to have clients like you and want to do everything we can to support you and get the outcome you deserve!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "100202754459755523423", "name": "Kam Pugh", "time": 1616170997721, "rating": 5.0, "text": "Erik persevered and kept me updated through a process where an insurance company tried to draw things out as long as possible. I would highly recommend Erik and his team to anyone who has a need in this area.", "pics": null, "resp": {"time": 1616185702960, "text": "Thank you for your review, Kam! Communication is a top priority when it comes to serving our clients at HGD."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "109858388818703864714", "name": "Matt Sato", "time": 1611761673606, "rating": 5.0, "text": "Unfortunately we had an accident where my wife was injured in a car accident and we needed to seek representation.  The process is already stressful and difficult but Brandy Robertson and her team at Heninger Garrison Davis, LLC provided knowledgeable and excellent service that brought acceptable resolution to our case.  Especially during the current COVID environment and with the courts being backed up it was great to see this Firm adapt to the current situation and get our case settled.", "pics": null, "resp": {"time": 1612230107811, "text": "Hi Matt, thank you for leaving us a great review! We’re here to give our clients the best representation and we are honored to have been able to work with you and your family."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "112005915573678205669", "name": "Cassie Gilbert", "time": 1611780890408, "rating": 5.0, "text": "Mr. Leonard is a very kind and  caring person. He has handled everything quickly and professionally.", "pics": null, "resp": {"time": 1612230040171, "text": "Hello, Cassie – thank you for the great review! We will pass along your kind words to Mr. Leonard as well."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "109618002338938492867", "name": "Brian Kinsley", "time": 1603217498179, "rating": 5.0, "text": "Henninger Garrison Davis is a great firm that works hard for their clients.  They are leaders in the legal community and results driven. I have worked on projects with them for years and enjoy collaborating with them.", "pics": null, "resp": {"time": 1603397732071, "text": "Thank you so much, Brian. We enjoy collaborating with you as well!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "100135860165502881183", "name": "Jeannie Nabers", "time": 1615241875739, "rating": 5.0, "text": "For anyone in need of professional, caring advice or representation, I highly recommend Heninger Garrison Davis, LLC.", "pics": null, "resp": {"time": 1615248269478, "text": "Thank you for leaving us a five-star review, Jeannie. Having you as a client has been a pleasure!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "109827643183457029276", "name": "Melissa Williams", "time": 1603392002144, "rating": 5.0, "text": "Ive had a great experience with them and I will be working with them in the near future for other cases if needed..", "pics": null, "resp": {"time": 1603397677166, "text": "Thank you for the kind words, Melissa. We are here for you if you ever need us."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "111836952100666997166", "name": "susan belcher", "time": 1589478689421, "rating": 5.0, "text": "I would highly recommend this firm. They are a very experienced, ethical, professional team which provided me with excellent legal advice for a complex issue. Thank you Beverly and Erik!", "pics": null, "resp": {"time": 1589502970482, "text": "Thanks, Susan. Great clients lead to great results!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "118124565530071795128", "name": "Megan Miller", "time": 1613176897165, "rating": 5.0, "text": "Knowledgeable, professional and thorough attorneys and staff", "pics": null, "resp": {"time": 1614045764895, "text": "Thank you for the thoughtful review, Megan!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "115769008729721991113", "name": "Laura Coe", "time": 1572910601807, "rating": 4.0, "text": "My husband and I are in the midst of a class action, medical device failure, we believe the manufacturer of the product is liable for his 15 year, ongoing medical battle with the device. Even though we have not met face to face with the attorneys,  HGD has always been quick to return phone calls, answer our call, the first time, not after days and days of leaving voicemails. Our contacts are busy doing all the leg work, representing other clients in court, etc. They are professional, keep you informed, and answer your questions quickly and honestly to the best of their ability. Sometimes the answers aren't what you want to hear, but sometimes the truth hurts. Their experience , willingness to work ethically as a team shows! I plan on writing another review down the line as our case proceeds through the judicial system.", "pics": null, "resp": {"time": 1572915821542, "text": "Thank you so much for your kind words, Laura! We really appreciate you taking time to share your experience with us! We are so glad that your needs are being met by our team and that we are keeping you updated on your case. We count ourselves lucky for clients like you and your husband! Please feel free to reach out to anyone on our team at any time should you need our assistance! Thanks again"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "117813000061196327661", "name": "colette Jones", "time": 1565891295396, "rating": 5.0, "text": "This is a highly reputable firm with highly knowledgeable attorneys. The staff are warm and caring. Highly recommend!", "pics": null, "resp": {"time": 1565891590285, "text": "Thank you for the great review! We are here to help you anytime."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "116724168243060263378", "name": "Stephen Orr", "time": 1617988559066, "rating": 1.0, "text": "Grossly misled, ignored and overcharged!", "pics": null, "resp": {"time": 1617993523719, "text": "Dear Stephen,\n\nThank you for taking time to post a review for us. We are sorry to hear that your experience was not what you expected. We set a high standard for ourselves and we’re so sorry to hear this was not met in your interaction with our business. We do pride ourselves on our clear communication and full disclosure of all fees at the beginning of any client relationship. For that reason, we would like the opportunity to talk with you and investigate your feedback further. Please feel free to reach out to me directly at 205-327-9121 at your convenience so we may discuss how to possibly resolve your issues. Thanks again.\n\nT. Gauldin – Firm Admin"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "103367730960486795057", "name": "Linda Bond", "time": 1578765196010, "rating": 5.0, "text": "I recommend this attorney, he works hard for his client’s best interest.", "pics": null, "resp": {"time": 1580337074375, "text": "Thank you for your recommendation! We are lucky to have clients like you and want to do everything we can to support you and get the outcome you deserve!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "113802985391468570626", "name": "Bill Freise", "time": 1572975913938, "rating": 5.0, "text": "Bill Bross is the greatest. I have never dealt with any one who is more helpful professional or caring I recommend them 110 pct", "pics": null, "resp": {"time": 1572982930898, "text": "Thank you for the great review, Bill! We could not agree with you more about Bill Bross. He is the best of the best! We are also very thankful for great clients like you! Thank you for putting your trust in us and we look forward to our continued partnership with you!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "114487378074814080881", "name": "Mark Phillips", "time": 1584291222506, "rating": 5.0, "text": "I can't say it would be a conflict of interest. Just kidding these guys are very professional and there's a whole team of them there they get it done thanks guys", "pics": null, "resp": {"time": 1589502994161, "text": "Thanks so much Mark! We appreciate working with people like you!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "114007062462287616139", "name": "John Smith", "time": 1619300763618, "rating": 5.0, "text": "Great people", "pics": null, "resp": {"time": 1619442704008, "text": "Thank you, John! It is always a pleasure helping clients."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "108516747051589409617", "name": "Bentley Schoening", "time": 1539708503403, "rating": 5.0, "text": "We have worked with HGD for many years. They are a very reputable firm with exceptional attorneys and staff. Highly recommended!", "pics": null, "resp": {"time": 1565891651641, "text": "Thank you for the kind review, Bentley. We have enjoyed our partnership with you as well."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "112544730905252623315", "name": "Kewanee Fox", "time": 1558353981216, "rating": 5.0, "text": "Nice office.", "pics": null, "resp": {"time": 1565891623846, "text": "Thank you for taking time to review our firm! We hope to see you soon."}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "116909536351440176650", "name": "Bobbie Payne", "time": 1497800149532, "rating": 5.0, "text": "They are great lawyers", "pics": null, "resp": {"time": 1536772384282, "text": "Thank you for the kind words!"}, "gmap_id": "0x88891b962094dd53:0xbdfc27b2b8093e7"}
{"user_id": "107124037624911481680", "name": "Bear Grylls", "time": 1612154296779, "rating": 5.0, "text": "When your lawyers walk out on you, remember \"better phone Schoen\"", "pics": null, "resp": null, "gmap_id": "0x888e81dadca25c31:0x2b26e2e119a96768"}
