{"user_id": "112377491024445076319", "name": "Matt Henson", "time": 1617923357946, "rating": 1.0, "text": "9am appointment was a complete no show.  Called at 945 and got a call back at 10:15 from the guy that was supposed to show up at 9am saying sorry, been busy.  He showed up at 4pm and the quote for an aluminum fence was $9550, vs the $7k quote I got from another company that showed up on time this past Saturday with all 5 star reviews.  Stay away.  Bad service and trying to rip off people in the community is very bad business", "pics": null, "resp": null, "gmap_id": "0x888926dcf8bf1f31:0xc1ffcc421e2949be"}
{"user_id": "115266497784960574583", "name": "Robert Linder", "time": 1604975315679, "rating": 5.0, "text": "Great experience with this group - excellent customer service from the estimator Steven who takes his time and is very knowledgeable and patient . The crew - Casey and his team were absolutely fantastic ....this was a tough build with all the cutting and extending from the old deck ....they built this deck 100% to my satisfaction and I found not one single flaw..and I looked for them !! Great experience Helena Fence and Deck ...will use you again!!", "pics": null, "resp": null, "gmap_id": "0x888926dcf8bf1f31:0xc1ffcc421e2949be"}
{"user_id": "117636332151064262033", "name": "Scrape13", "time": 1601396708658, "rating": 5.0, "text": "Great service and on time. Very polite and great workmanship.  Will definitely use them again!", "pics": null, "resp": null, "gmap_id": "0x888926dcf8bf1f31:0xc1ffcc421e2949be"}
{"user_id": "105988375084610272911", "name": "Eric Wilson", "time": 1598293229359, "rating": 5.0, "text": "Didn't work out decided to go a different route. Have cash on hand. No real complaints.", "pics": null, "resp": null, "gmap_id": "0x888926dcf8bf1f31:0xc1ffcc421e2949be"}
{"user_id": "111574389301464083889", "name": "Anthony Hamilton", "time": 1615989640194, "rating": 1.0, "text": "Update: 5 months in and the gates are sagging\n\nThey were 1.5 hrs late. They talked us into putting toppers on our posts, but they cut the posts too short to put toppers on and have refused to replace them. multiple toppers are below the fenceline! The fence still has green spray paint on it from the store. They talked us into arched tops-- which turned out terribly uneven/non-symetrical. There are overcuts everywhere. The arch on the frontside of the fence doesn't light up with the backside (of the same panel) of the fence. Every cut is splintered and jagged. They have nice gates and they are balanced well. They have refused to fix the issues. I hope we don't have to escalate this.", "pics": null, "resp": null, "gmap_id": "0x888926dcf8bf1f31:0xc1ffcc421e2949be"}
{"user_id": "113309210348090258155", "name": "Eddie Graves", "time": 1597183096419, "rating": 2.0, "text": "June 18th crew arrived to start demolition.  I was informed the entire job would take 3 days.  Equipment issue occurred, and work stopped.  Day 2 (6/19)  Remainder of fence taken down, then the next problem.  It was originally agreed existing posts would be extracted and new posts installed to avoid damages to sprinkler system.  Their removal system was not working, so I agreed to let them saw existing posts to ground level.   Day 3 (6/20) Remaining posts set and cross beams are up.  Work to begin installing pickets but no pickets available.  How can you have a job scheduled, know lumber needed,  and not have purchased in advance?  The company had received half payment for job.  Day 4 (6/22)  Pickets have been purchased,  Sprinkler system has been damaged and needs repaired.  Company paid repair.  The gentleman sawing the posts to the same height of the top of fence was not as tall as the 6’ fence.  This resulted in posts being sawed off at an angle, and numerous adjacent boards were marred because of the chain saw.  In addition, boards were split, some boards sawed into, and others were installed without using a level.  I had 2 gates installed and neither were up to the standards that I expected.  Day 5 (6/23) Finally the finish line.  My wife noticed a couple of small things that needed attention.  The supervisor was not very receptive to her concerns and seemed agitated she would question the workmanship.  We felt they were rushing to get to the next job.  I could not stand over each employee to see that the work was being done properly.  This falls under responsibility of the job supervisor.   I raised these issues with the rep.   On June 25th, rep came out and inspected  issues in question and agreed our issues were not to their company standards.   On a text dated July 7th, I was assured these “touch ups” would be taken care of and owner had approved necessary repairs.  Almost two weeks later, the crew came out to make  repairs.  They should have known materials needed for this appointment, but once again, the needed materials were not in their possession.  I told them “no problem”, get the lumber and come back in a couple of days.    I texted the rep after they had gone to inform him of the problem, and  was told it would be rescheduled in a few days.  After several texts to reschedule, I finally heard back on July 31st.  I was then informed the “touch ups” were NOT warranted, and no further action from the company.  So, for 24 days I was misled regarding the repairs.\nWould I recommend Helena Fence and Deck?  NO.\n1.\tYou do not know if they will be on the job early enough to finish on time because they must get supplies for the day’s work.  If the stores do not have the needed materials, then your job will be on hold until store is resupplied.\n2.\tYou would need to inspect all the work as it is being done, because  lack of follow-up to repair any issues that are discovered after they have gone.\n3.\tOne of the supervisors on job is not receptive to suggestions, therefore making it difficult to communicate while the work is being performed.", "pics": null, "resp": null, "gmap_id": "0x888926dcf8bf1f31:0xc1ffcc421e2949be"}
{"user_id": "107974810453371586600", "name": "Timothy Christian", "time": 1595538239608, "rating": 2.0, "text": "They responded fast prior to installation and had quick availability. The crew was nice but the quality and repairs after installation don't justify a 20% premium over others in the area. For instance they installed pavers on the side of the house for our garbage and recycling bins to rest on but they didn't use leveling sand or joint compound. The individual pavers would wobble. I had to removed all the pavers and re-install them correctly. Currently our side gate flexes when you open and closes, they tried to repair the gate two times. It's still not completely correct and the repairs were sloppy. Communicating with the owner is difficult, I will probably pay another company to repair the door correctly and fix an unsecured post. Overall I'm not fully pleased.", "pics": null, "resp": null, "gmap_id": "0x888926dcf8bf1f31:0xc1ffcc421e2949be"}
{"user_id": "100354790407624225684", "name": "Betty Sexton", "time": 1562975366524, "rating": 5.0, "text": "I have a Beautiful deck.!  Brian Barnes & crew got the job done.  Good price, good people. Definitely I would recommend Helena Fence & Deck!", "pics": null, "resp": null, "gmap_id": "0x888926dcf8bf1f31:0xc1ffcc421e2949be"}
{"user_id": "101988223974105790574", "name": "Decie", "time": 1622085049945, "rating": 5.0, "text": "Isbell handled the spray foam insulation, vinyl, and gutters on my new construction. The cost was fair and the work was quick and accurate. Keith did a great job sharing information and getting the work done in a timely manner. Steve did a hell of a job on the vinyl, and left not a single shred of material on the ground at the end of each day. The spray foam is one of the best decisions that we made for this house. The black gutters against the white house look awesome. Good job guys!", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "108126330685469041672", "name": "Chris Kozak", "time": 1622668629859, "rating": 5.0, "text": "Keith and his crew put a deck next to our above ground pool.  It surpassed our expectations, and the craftsmanship is outstanding.  We are beyond pleased with their work.  We had a few small adjustments but thanks to the quick communication and responsiveness to our changes by Keith, the project finished in a timely manner and surpassed our initial vision of what it was going to look like.  We will call Isbell and Keith when we decide to do our siding and patio covering.  Thanks Keith and Isbell for a professional job well done!", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "100627247770266105638", "name": "Hayden Reed", "time": 1618968896937, "rating": 5.0, "text": "I recently had some siding and exterior trim work done on my house, and Isbell did a fantastic job. Working with Keith was easy and they delivered on time at a great value. They went above and beyond to ensure every cap was clean and square and even readjusted my screen door in the process. Would highly recommend and will be using Isbell again in the future.", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "111070830124720769658", "name": "Lynda Fields", "time": 1627181807136, "rating": 5.0, "text": "Isbell siding made my home look better than new!! I'm so proud...thanks!!", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "106566701466114873525", "name": "Wanda Littleton", "time": 1623239774975, "rating": 5.0, "text": "Twice we have used Isabel services for window replacement and both times we were very pleased with the job.  They use quality products and install them with care.  I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "118283339296880513272", "name": "Robert Sabbagh", "time": 1622925359285, "rating": 5.0, "text": "Isbell siding built us a  fabulous top for our existing deck. The top was good looking and strong, enough for a good size man to walk on the top of it with no regret, Mat done all the work himself and was very polite and friendly during all his work. Keith Kennemur  gave us a great quote and came by  a lot to check on the progress in building our new top. If you decide to build a top for your deck ask for the Sana Fe kit. you will love it as we do. Bonnie and Bob Sabbagh  Cottondale, AL", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "116222470159424450314", "name": "Captain Chris", "time": 1619116778528, "rating": 5.0, "text": "Did a great job on replacing some windows. Keith is a great guy to have come out! Fast service and windows look great!", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "112923110968230482640", "name": "Patricia Atkins", "time": 1620916405087, "rating": 5.0, "text": "Outstanding and excellent quality work on my screened in porch and patio cover. I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "114751050061870455830", "name": "RJ Thompson", "time": 1618318937951, "rating": 1.0, "text": "The absolute worst, rudest business experience I have ever seen. Isbell Services installed the roof on my home and I called to set up an inspection after I had two leaks that damaged my sheetrock. The owner contacted me and stated that I would have to find someone else, they don't stand behind their product and hung up. I would be extremely cautious using Isbell for ANY service.", "pics": null, "resp": {"time": 1619098657439, "text": "This review is very inaccurate. The house he is speaking of was roofed by Isbell for another home owner 8 years ago. He wanted us to come and do repairs for free and was told the warranty was nontransferable. Apparently he did not like the answer. Also I (Jeff Isbell) am the owner of Isbell Services and I would never hang up on a customer Write or Wrong."}, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "110952791891286604713", "name": "Rebecca Parris", "time": 1587144382009, "rating": 5.0, "text": "This is our 2nd house that we have used them for gutters the crew did a awesome and flawless job.  Can’t wait for the rain!!! 😊", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "108746358965586211707", "name": "Christi Wood", "time": 1573398260422, "rating": 1.0, "text": "Isbell Services was the roofing contractor for my townhome complex built 3 years ago.  We have had significant roof leaks this fall, and Isbell evidently offered only 12 months of warranty on their roofing work.  what good is a 30 year shingle if it's installed incorrectly, and the installer doesn't stand by their work?!!", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "103183970892002056954", "name": "Sibyl Fondren", "time": 1564533343616, "rating": 5.0, "text": "It took a few days to come out for the job but I later understood why. They must be in high demand due to their impeccable work and customer service! They had the job done (replacing brick with vinyl siding over a garage with drooping lintel) efficiently and professionally. A few bricks from another area of the facade came off after repair and installation. They came and repaired it a couple of days later without a call having to be made. Our family will recommend and definitely use Isbell again for any home repairs!", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "115937575270344792491", "name": "Jason Polancich", "time": 1578344002271, "rating": 1.0, "text": "Another example of an unreliable local Tuscaloosa home improvement company. Had them out week before Thanksgiving for a quote to replace/repair gutters on a historic home in downtown Tuscaloosa. Was told Id have a quote out by the next week and they'd be able to start within a couple weeks. Two weeks went by and no quote. I called them, was transferred to a rep named Mike \"who handles all the gutters.\" He told me he'd follow back up with me by the afternoon. Now, first week of January, called back and got mike who said \"We're not going to be able to help you on that job.\" Im guessing it was too low a cost threshold for them, but it would have been very nice to have known that back in November. Great people. Don't advertise gutter repair/replacement if you dont actually do the work!", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "112249114710625384638", "name": "Joseph Mcguire", "time": 1548188748706, "rating": 5.0, "text": "I'm a grad student who just bought their first home. Being incredibly busy during working hours, Isbell was super easy to work with via email and text to arrange for gutter installation. They color matched to my paint without my even thinking about it, were quick, and overall did a great job.", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "116226329867618313666", "name": "Daniyell Henderson", "time": 1588355732445, "rating": 5.0, "text": "Cause answer all your questions they do a great job very good customer services", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "115967766411968367183", "name": "Joe Fey", "time": 1480438575321, "rating": 5.0, "text": "We offer a wide range of Home Improvement amenities. From Siding, Roofing, Gutters to Windows.and Insulation. We have great salesman who promptly and properly explain what our services are. Also we have very dedicated work crews who are diligent and prepared to get the job done in an efficient and expedient manner. Call us today to make your home hey more efficient and good-looking place to live", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "102877399335547383643", "name": "Ray Miller", "time": 1570787879778, "rating": 5.0, "text": "They replaced some soffits, fascia and gutters after tree fell and damaged house. i was quite pleased with their work and their price. Their workers were courteous and knowledgeable of what they were doing. They got in and made  repairs quickly.  They are in demand so you may need to wait a week or two until they can get to you, but for the quality and price it is worth being a little patient. I will definitely call them again should the need arise. I do recommend them if you need their services.\n\nI had Isbell Insulation come out again this week and add a board and batten siding product to part of the front of my house. Frank and Jeff came in the morning and work was completed by lunch time. I could have not been more pleased with their quality of work and professionalism. These technicians really take a lot of pride in their work and it shows. This product has about half inch insulation rigid backing that makes it more solid. Looks like actual wood when driving up to the house. It matches other wooden board and batten we have on front of our house. I was tired of painting and replacing weather worn boards. We ordered color that matches the paint we have on the house. No more on ladder for me on this particular wall of the house. Once again i do recommend Isbell. Really nice technicians that do a great job. As other time price i believe was real reasonable.", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "118167985337248201627", "name": "Raymond Milner", "time": 1594047231591, "rating": 1.0, "text": "Will not return calls after job is completed when customer is not satisfied", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "108404041661807532146", "name": "Slow and Curious !", "time": 1566329675341, "rating": 2.0, "text": "Did not get any work from this company but the guy I talked to on the phone was terrible with customer service, cost them my business forsure. Asked me when I would be free to have him come out and give me a quote, I responded 3pm - and after and he could not fit that into his schedule, anyday of the week.\n\nNo problem I will find someone else, and I did.", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "118246049910762128807", "name": "Keith Kennemur", "time": 1562339475987, "rating": 5.0, "text": "Isbell put gutters on my pole barn house I built. It’s a metal roof on an 8/12 pitch. So the water flies off. The 6” gutters handles all the water on the first big rain I had.", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "115100684069270389072", "name": "Kimberly Davis", "time": 1478307310155, "rating": 5.0, "text": "Thank you, Isbell Services, for doing such a great job installing my new roof and vinyl siding. The work was done in a very timely and professional manner with \"doing the job right\" at the top of your list. Your company provided me with the best price, the workmanship was of the highest quality, and most importantly you always stand behind your work. I will personally recommend your services to all my friends and colleagues.", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "110509938166525089245", "name": "Julie Salter", "time": 1352825011284, "rating": 5.0, "text": "The guys at Isbell were great to work with for our roof repair. We got someone out to our house really quickly and they were able to repair the roof for us that week. This company was easy to work with and I would use them again!", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "113280136718524382911", "name": "Joey Barnett", "time": 1555952085818, "rating": 1.0, "text": "I’ve heard good things about the work that they do, but I didn’t make it as far as to see their work for the lady that answered the phone. Very rude, short, and demeaning.", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "112548653086400186821", "name": "Kelsey Williams", "time": 1556988502165, "rating": 5.0, "text": "Super easy to work with and did a fantastic job!", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "115247561322815886592", "name": "Laney Hamner", "time": 1478612370544, "rating": 5.0, "text": "The men at isbell were a pleasure to work with. They were very considerate of what I wanted. I plan to use isbell again in the future. I will be recommending them to all my family and friends.", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "104694932271875376638", "name": "Billy Morris", "time": 1609861531861, "rating": 4.0, "text": "Good", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "105892217351996760270", "name": "James Fields", "time": 1596841437049, "rating": 5.0, "text": "Quality Service", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "114069710582244853219", "name": "Ailie Inc", "time": 1438723936550, "rating": 5.0, "text": "Work done with integrity...", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "114854596525958879428", "name": "wolf lonnah", "time": 1495456585529, "rating": 5.0, "text": "Nice", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "110006032525000737977", "name": "Kelli Taylor", "time": 1628048383439, "rating": 5.0, "text": "I built my dream home with a certain look in mind. I credit Isbell Services with working outside the box, envisioning each detail with me and bringing my dream to fruition! The Sales staff and each employee was very professional and always helpful. I can honestly say, when Frank completed the vinyl and fiber cement around the perimeter of my home, there wasn’t a punch list. Literally, everything is absolutely perfect! Selecting Isbell Services to do work on my new home was the best decision I made throughout the building process!", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "102314361608215318357", "name": "Horace “Boogie” Copridge", "time": 1628035680660, "rating": 4.0, "text": "I didn't use their service; they recommended me to another agency, sense they were booked for several days.", "pics": null, "resp": null, "gmap_id": "0x88860260a1cd8271:0x7d1327a48b3e45d1"}
{"user_id": "118263876092754335473", "name": "Betty Clemens", "time": 1621371416992, "rating": 5.0, "text": "This company rescreened 27 of my screens on my house, they did a fantastic job, in a timely manner and they were very professional, the price was very reasonable, and I will definitely use their service again.\nThank you so much for everything 😊", "pics": null, "resp": {"time": 1621374997514, "text": "Thank you for your review! We’re so happy that you’re happy! Thanks for choosing us to help you with your home!"}, "gmap_id": "0x88626b912b9c2a7b:0x74a44113392b89b8"}
{"user_id": "111905505880968047180", "name": "Stefan Bowers", "time": 1623856652893, "rating": 5.0, "text": "Great work! Had our back patio screened in and it looks great!", "pics": null, "resp": null, "gmap_id": "0x88626b912b9c2a7b:0x74a44113392b89b8"}
{"user_id": "116459841710032910471", "name": "Mari C.", "time": 1618779120634, "rating": 5.0, "text": "BLT, INC replaced my broken window screen in no time at a very reasonable price. I highly recommend them.", "pics": null, "resp": {"time": 1618849058235, "text": "Thank you for your review! We appreciate your business."}, "gmap_id": "0x88626b912b9c2a7b:0x74a44113392b89b8"}
{"user_id": "108828007058460682094", "name": "Keisha B.", "time": 1595340368578, "rating": 5.0, "text": "Brian came out to give me an estimate on the cost of installing a screened in porch. He was honest and alerted me to issues I should resolve before having the porch built. It's rare that you encounter people that operate with integrity even when it will potentially cause them to lose business. I highly recommend BLT and look forward to doing business with them at some point in the future.", "pics": null, "resp": null, "gmap_id": "0x88626b912b9c2a7b:0x74a44113392b89b8"}
{"user_id": "110425178175255256057", "name": "stephen story", "time": 1591666845131, "rating": 5.0, "text": "Very knowledgeable. They did a great job on a decommissioned hospital to nursing home renovation job I did in Greensboro Ga.30+ very large commercial storm windows with screens. Every one fit like a glove. I highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88626b912b9c2a7b:0x74a44113392b89b8"}
{"user_id": "106773151138329701796", "name": "Kavita Kumar", "time": 1594996196465, "rating": 5.0, "text": "We had our screened porch converted to a sunroom. Brian and his crew did a great job! We are enjoying this space so much now that we can use it year round. Thank you!", "pics": null, "resp": null, "gmap_id": "0x88626b912b9c2a7b:0x74a44113392b89b8"}
{"user_id": "106310424474730705458", "name": "Freeman I", "time": 1569285826624, "rating": 5.0, "text": "I highly recommend this company! I wanted a screen room and chose BLT Inc over three other companies. I ultimately decided on BLT Inc and I am so glad I did! They were responsive and highly professional. Additionally, they had my screen room installed within a week. The individual who installed my fence even looked at the screen room and indicated, \"they did a great job on your screen room.\" BLT installed an aluminum screen room enclosure with pickets. The pickets look great are very professional. I highly recommend everyone install the pickets. They look very fashionable and are a great addition. Based on my experience, I would have made a mistake if I would have selected another company. Again, I highly recommend.  Thank you BLT!", "pics": null, "resp": null, "gmap_id": "0x88626b912b9c2a7b:0x74a44113392b89b8"}
{"user_id": "115944594081108836265", "name": "Dale Kelly Olguin", "time": 1565381420054, "rating": 5.0, "text": "I highly highly recommend Brian and his crew from BLT to do any form of screens on windows and screened in back porches. He did both on our house. It was worth every cent. His crew was professional, courteous, respectful, and polite. They took there time and did quality detailed work. You will not be disappointed. Brian is easy to get a hold of and will quickly return your calls. The whole process from measurements to ordering the supplies to the install was just shy of 4 weeks.", "pics": null, "resp": null, "gmap_id": "0x88626b912b9c2a7b:0x74a44113392b89b8"}
{"user_id": "110086567894151896705", "name": "Erin Collins", "time": 1562158893149, "rating": 5.0, "text": "We bought a home that did not have screens for any of the windows, including those on the enclosed porch.  BLT came and measured each window, made the screens offsite and returned to install them.  Flawless fit, good turn around time and friendly service.  It was a bit pricey since I chose to have them come out and measure rather then do the measuring myself but it was worth it.", "pics": null, "resp": null, "gmap_id": "0x88626b912b9c2a7b:0x74a44113392b89b8"}
{"user_id": "110717720209926167501", "name": "Christine Marsh", "time": 1568472704884, "rating": 5.0, "text": "Had a fantastic experience with Brian Allen and the rest of the BLT team!  Highly recommend and definitely will be back for additional projects!", "pics": null, "resp": null, "gmap_id": "0x88626b912b9c2a7b:0x74a44113392b89b8"}
{"user_id": "103063337845103458139", "name": "BLT INC Home Improvements", "time": 1551720339193, "rating": 5.0, "text": "Great job on our sunroom. Very professional. All the guys were polite and they cleaned up everything really well.", "pics": null, "resp": null, "gmap_id": "0x88626b912b9c2a7b:0x74a44113392b89b8"}
{"user_id": "114545217947767516679", "name": "Kevin Kimbrough", "time": 1574803870796, "rating": 5.0, "text": "Good friendly reasonable service. For glass, windows things give them a shot.", "pics": null, "resp": null, "gmap_id": "0x88626b912b9c2a7b:0x74a44113392b89b8"}
{"user_id": "105357836224668797821", "name": "Carla Holder", "time": 1531439757399, "rating": 5.0, "text": "This is a great place to get replacement screens or get screens redone. Price is good and so is their work.", "pics": null, "resp": null, "gmap_id": "0x88626b912b9c2a7b:0x74a44113392b89b8"}
{"user_id": "105849336326780805006", "name": "Antoinette Mitchell", "time": 1544345737140, "rating": 4.0, "text": "Professional Team and outstanding work! Highly Recommended!", "pics": null, "resp": null, "gmap_id": "0x88626b912b9c2a7b:0x74a44113392b89b8"}
{"user_id": "106391552230202345366", "name": "lady lovelace", "time": 1488836329439, "rating": 1.0, "text": "Employees yelled at us from their work truck. Rude! Definitely would not want in or near my home !!", "pics": null, "resp": null, "gmap_id": "0x88626b912b9c2a7b:0x74a44113392b89b8"}
{"user_id": "104939620394435081758", "name": "Harry Hall", "time": 1575214448403, "rating": 5.0, "text": "Excellent builders!", "pics": null, "resp": null, "gmap_id": "0x88626b912b9c2a7b:0x74a44113392b89b8"}
{"user_id": "107922539234017508327", "name": "Brian Allen", "time": 1502824378796, "rating": 5.0, "text": "The single star review was not from a customer of ours.  Sorry for someone else submitting a review about BLT Inc.", "pics": null, "resp": null, "gmap_id": "0x88626b912b9c2a7b:0x74a44113392b89b8"}
{"user_id": "111022823856562138716", "name": "Keith Krininger", "time": 1500837713933, "rating": 5.0, "text": "We would like to acknowledge what a wonderful experience we had working with Alabama Landscape Creations.  Their management is knowledgeable, friendly, and prompt.  We had a large project with a large seawall, double waterfall, and 2 flagstone decks, not to mention the beautiful  landscaping job they did.  We get compliments every time someone visits, even from boaters passing by.    Most importantly, they stand behind their work and if you have a problem, they will fix it.  We highly recommend them!!  Keith and Kay K.", "pics": null, "resp": null, "gmap_id": "0x888ecde8558086ab:0x4b420a673611a607"}
{"user_id": "116138046102982294502", "name": "David Wilson", "time": 1423276199903, "rating": 5.0, "text": "ALC came up with a plan that solved a very challenging erosion problem on my steeply sloped lot that fit my budget, looks fantastic and was completed ahead of schedule.  Jake and everyone I met was very professional and I recommend them highly.", "pics": null, "resp": null, "gmap_id": "0x888ecde8558086ab:0x4b420a673611a607"}
{"user_id": "101684836222605112158", "name": "Valorita Salaam", "time": 1612811440381, "rating": 5.0, "text": "Initially i was concerned re: when my work would start and remarkably, the installers showed up on a Monday and completed the work on a Friday!!! The guys could not have been more professional and courteous:-) They were kept us in the loop every step of the way and we could not be happier. I will recommend MA Jackson to any and everyone.\n\nThank you so much!", "pics": null, "resp": null, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "110864049055723485562", "name": "Joseph Marshall", "time": 1603642286902, "rating": 5.0, "text": "Last year,  M.A Jackson rebuilt my Deck. The crew was knowledgeable,  professional,  and courteous. This year, they sealed and stained that deck. There were initial problems getting the right people out to do the job because of prior job commitments, but eventually things worked out.  Everyone from office personnel, to the boss, to the stain crew, went out of their way to get the job do and make me happy. I strongly recommend.\nJoseph Marshall\nOwens Cross Roads,  Al", "pics": null, "resp": null, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "109273763668612700949", "name": "James Brasfield", "time": 1603201473284, "rating": 5.0, "text": "M. A. Jackson built me a screened pool enclosure and did an excellent job. The enclosure will provide insect protection (mosquitos/West Nile Virus, wasp, flies, etc.) and allow night swimming (keep bugs from flying into the lighted pool). The enclosure will also reduce pool maintenance/cleaning by eliminating falling and windblown debris, insects, frogs, etc. from entering the pool. Mr. Jackson and his entire team are friendly/courteous folks and are devoted to providing you with a quality product that you are completely satisfied with.", "pics": null, "resp": null, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "101762008964598927721", "name": "Pamela Fortier", "time": 1606785912319, "rating": 5.0, "text": "I love my new sunroom! From Start to Finish ALL M. A. Jackson employees have made every aspect of this building project a pleasant experience. Because of Covid-19 there have been a few unexpected setbacks. However, I was always informed about what was going on. The office personnel and construction workers were always very kind, friendly and professional. I can't stress enough how beautiful and well constructed my sunroom is. I wholeheartedly recommend M. A. Jackson for whatever your needs maybe. You won't be disappointed!", "pics": null, "resp": null, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "114799105984217025968", "name": "Doug Thompson", "time": 1586199038893, "rating": 5.0, "text": "M.A. Jackson took our concrete slab and turned it into a screened in room.....  After having to work around the weather ( All the rain ) they made us a fantastic area to sit in and not have to worry about the bugs.... It looks great... After it was done they had to come back to adjust a spot or two which only took 5 minutes and now it's perfect.... We found them very easy to work with and after the build they did a great job with the clean up..... They also called to make sure we were happy with our new room.... Yes... 100 %.... We will used them in the future and will Highly recommend to our family and friends....  Thank you M.A Jackson....", "pics": null, "resp": {"time": 1600301638479, "text": "Thank you for the 5-star review and kind words!"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "102208728343896665081", "name": "Google User", "time": 1573583958453, "rating": 5.0, "text": "M. A. Jackson Co. recently installed a walk-in shower for us in our master bath. The installer did an excellent job with the installation. It exceeded our expectation. They were extremely courteous and proficient in their completion of the project. The work area was cleaned and all materials removed when the job was completed. Thanks for such a good job.", "pics": null, "resp": {"time": 1600301590416, "text": "Thank you for the 5-star review and kind words!"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "115304278249640712525", "name": "Google User", "time": 1572365187415, "rating": 5.0, "text": "I did research on patio covers before deciding to go with MA Jackson, Co. The price was right and the design complimented our home better than the competition. We are so happy with the results. We sat under the patio cover the same day the job was finished. I would definitely recommend MA Jackson, Co. We are totally satisfied.", "pics": null, "resp": {"time": 1600301541365, "text": "Thank you for the 5-star review and kind words!"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "107592303904915315005", "name": "teresa cobbs", "time": 1567426532477, "rating": 5.0, "text": "Absolutely the best guys around. They added a screen room to my carport. The crews that came out, were respectful neat and eager to please the customer.  I love my new space. Nathan Nicholaus is one of many that worked and the whole crew seemed to really put forth a team effort. Would recommend M.A Jackson Co.", "pics": null, "resp": {"time": 1600301609158, "text": "Thank you for the 5-star review and kind words!"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "115955243844226744303", "name": "Diane Cooper", "time": 1574274685681, "rating": 4.0, "text": "I have had MA Jackson Co do a few projects for me over this past year and have been happy with the results.  Because of my disability due to cancer and amputation surgery, I had to have my master bathroom remodeled to install a walk-in handicap-accessible bathtub as well as open up a wall so that I can get into the toilet with my wheelchair.  Also had cement ramps built up at the front and back doors.  Aside from the medically necessary remodel, I also had a screened-in back porch put up and it's so perfect for us and the cats love it!!!  Just be patient as their crew is sometimes backed up with projects.  His guys are very respectful and friendly.", "pics": null, "resp": {"time": 1600301451080, "text": "Thank you for the 5-star review and your kind words about our company! If there is anything else we can do just give us a call. Thank you once more."}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "107216536958217320162", "name": "Cindy C", "time": 1582517883923, "rating": 5.0, "text": "They built a nice sun room for us, we love it. Quick, hard workers, great craftsmanship, couldn't be happier", "pics": null, "resp": {"time": 1600301494872, "text": "Thank you for the 5-star review and kind words!"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "104968894491755492809", "name": "Linda Sell", "time": 1578358313534, "rating": 5.0, "text": "M.A Jackson Co installed us a screen in porch....we were very pleased with the work and professionalism of the men that installed our screen porch....I would highly recommend them and if I need anymore remodeling I will call M.A Jackson Co.", "pics": null, "resp": {"time": 1600301284053, "text": "Thank you for the 5-star review and kind words!"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "107619999855236609786", "name": "Google User", "time": 1572967513196, "rating": 5.0, "text": "We went to a local home and garden show in Huntsville, AL where they had a display. We used them to build a cover on our outdoor patio with a fence and railing, etc. Outstanding!", "pics": null, "resp": {"time": 1600301088125, "text": "Thank You For The 5-Star Review!"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "106249274123875795877", "name": "Lisa Sheffield", "time": 1508074721819, "rating": 5.0, "text": "Andy and his crew were great.  I love my sunroom and new deck!  Would definitely recommend to anyone looking to have a big project done.", "pics": null, "resp": {"time": 1564090788852, "text": "Thank you for the nice review and  \"5\" stars!"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "109858007450538613604", "name": "Shana Romano", "time": 1530317921658, "rating": 5.0, "text": "Love my patio cover!! Andy was courteous and made sure that I was pleased with the work when finished.", "pics": null, "resp": null, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "114196298873055635658", "name": "John Drake", "time": 1500341916837, "rating": 5.0, "text": "M. A. Jackson company did a great job for me! They were very professional. There workmanship was top notch. I would definitely use them in the future!", "pics": null, "resp": {"time": 1500344325299, "text": "Thank you Mr. Drake!\nIt was our pleasure working closely with you and your wife, to get you the results you were wanting to achieve. We truly look forward in the near future to serving you both again, in all your home improvement needs."}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "106114360154908385574", "name": "Denise Cooper", "time": 1596555835994, "rating": 5.0, "text": "This is a great company!!!!  They stand behind their products and their work !!!  High quality products and great workmen ship!  Thanks Andy and Pam !!!!!", "pics": null, "resp": {"time": 1600294220721, "text": "Thank you for the 5 star review and wonderful comment!"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "117642623293589202957", "name": "A Google User", "time": 1503412523215, "rating": 5.0, "text": "Great people to work with! Best contractor in North Alabama! A reputable company that diversifies in many different products.", "pics": null, "resp": {"time": 1503611368405, "text": "Thank you!"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "102939315835045237027", "name": "Mr. Burnz", "time": 1547616585385, "rating": 3.0, "text": "I had a Four Seasons Sunroom window that had an inside water leak. The sunroom was out of warranty, so I had to purchase the glass directly from Four Seasons in New York. The problem is, I had no clue how to install it. I’m glad that Andy and Jim were able to do this,  but I think $1200 for four hours labor was a little steep. (Includes two hour drive back and forth from Cullman)", "pics": null, "resp": null, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "112559819295600015600", "name": "Google User", "time": 1577816816860, "rating": 5.0, "text": "Exceptional work!", "pics": null, "resp": {"time": 1600294139004, "text": "Thank you for the 5 star review!"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "113550473204076566708", "name": "Susan Goodson", "time": 1491248012950, "rating": 1.0, "text": "We met this company at a home show in Huntsville.  At that time, we were in the process of selling our home and from the feedback we received, folks were wanting lighter cabinets which is why we spoke to them.   Fast forward a few months.  I rec'd a call from the company following up from our contact.  I scheduled an appt. but told the caller we have since moved but the home we own now was in need of a kitchen re-model.  The appt. came and went and no one showed.  Come to find out, rep went to our old address ( I gave new address during the phone call)  I called them to reschedule.  Rep showed up at our home and that was the end of the beginning.  He did not listen to us.  We did no want re-facing but he continued to measure existing cabinets which we did no intend to keep.  I asked to look at the books he brought in.  He asked rather snarkily, have you checked out our website???  Yes, but since you have books can I look?  At the  end of a very awkward meeting, he said they have a designer that could help with what we want.  We have not heard anything from this company 4 months later.  The end.  Would not recommend this company.", "pics": null, "resp": null, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "109364140630479289749", "name": "Google User", "time": 1501683472326, "rating": 5.0, "text": "Exceptional work!", "pics": null, "resp": {"time": 1501708260862, "text": "Thank you"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "103763369473849546741", "name": "A Google User", "time": 1501865133252, "rating": 5.0, "text": "Great Company", "pics": null, "resp": {"time": 1503611333234, "text": "Thank You"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
