{"user_id": "114111211951053821494", "name": "Shelby Mote", "time": 1468007092066, "rating": 5.0, "text": "Wonderful people to work with!! Very honest and caring. Would definitely recommend them to anyone for tax, payroll, or bookkeeping needs!!", "pics": null, "resp": null, "gmap_id": "0x88926ef8382aad2d:0x41b336b5c591fbb0"}
{"user_id": "100365530848552643938", "name": "Darrin Swan", "time": 1492701874771, "rating": 5.0, "text": "Great experience from a great company.  Thanks for all the help with taxes and payroll.", "pics": null, "resp": null, "gmap_id": "0x88926ef8382aad2d:0x41b336b5c591fbb0"}
{"user_id": "104474205535923552810", "name": "kiera meadows", "time": 1480101237998, "rating": 1.0, "text": "would be better if people will answer the phone!", "pics": null, "resp": {"time": 1626383131179, "text": "Thank you for your review.  That was a couple of years before we took over the tax office.  Things are much better now.  There were some health issues with ownership back then."}, "gmap_id": "0x88926ef8382aad2d:0x41b336b5c591fbb0"}
{"user_id": "107807661023494042927", "name": "FL Rowe", "time": 1519200681036, "rating": 4.0, "text": "Good teacher.", "pics": null, "resp": null, "gmap_id": "0x88926ef8382aad2d:0x41b336b5c591fbb0"}
{"user_id": "101943719153703474848", "name": "Michelle Crowe", "time": 1607441929865, "rating": 5.0, "text": "Payroll Vault has been doing my time keeping and payroll for over a year now.  I expected it to be costly but frankly it's less expensive for them to do it than it is for me.  It always seemed like I was going to be out of town on payroll day - now it doesn't matter.  They've got it and I don't have to worry about it.", "pics": null, "resp": null, "gmap_id": "0x889a4cd88d7d6d21:0xf07bb2330a363be2"}
{"user_id": "114541501040020646552", "name": "Josh Null (Gulf Coast Finc. Advisors)", "time": 1574869325680, "rating": 5.0, "text": "Cadie Gaut is incredibly organized and does a great job of taking care of all of the headaches of payroll - highly recommend Payroll Vault!", "pics": null, "resp": null, "gmap_id": "0x889a4cd88d7d6d21:0xf07bb2330a363be2"}
{"user_id": "110389974239312623742", "name": "Adam Eldridge", "time": 1582552645368, "rating": 1.0, "text": "Payroll Vault was given an updated W4 form on Feb 19 and we received a confirmation email stating the information was updated in their system. However when I received my W-2 I found they took 0$ out for Federal Govt😠. We are reporting to the IRS but it will still be a gigantic headache to deal with this. All for someone who just didn't do the job they are payed to do.", "pics": null, "resp": null, "gmap_id": "0x889a4cd88d7d6d21:0xf07bb2330a363be2"}
{"user_id": "106838596870965751348", "name": "Drew Mc", "time": 1576511514891, "rating": 5.0, "text": "They make payroll easy!", "pics": null, "resp": null, "gmap_id": "0x889a4cd88d7d6d21:0xf07bb2330a363be2"}
{"user_id": "103681007746796562672", "name": "Debra Smith", "time": 1612220132866, "rating": 5.0, "text": "The Quickbooks product is excellent and we have received excellent service from Chris.  Chris has been a huge asset from purchase to install. We have multi-stores and his expertise in our field as been so beneficial. I would highly recommend Chris to anyone and anywhere in the county. Thanks for all your great support Chris.", "pics": null, "resp": {"time": 1612273428439, "text": "Debra, thank so much for the review!  We at Barons' love Chris too...great guy personally AND professionally!  SO glad you had a GREAT experience! Please let us know how we can serve you in the future!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "115184016981435573311", "name": "Karen Sherman", "time": 1548282187470, "rating": 5.0, "text": "Barons' INC has helped me on my three businesses over the past five years. I feel they were indispensable when is came to setting up the books for one of the new ventures. Also,  I had my credit card machines purchased through them and they did a wonderful job with managing that for me.\nThese people are reliable, prompt, professional, and very informed.\nI trust them.", "pics": null, "resp": {"time": 1548288790924, "text": "You're AWESOME Karen, NOT just our customer, but our friend! Always a pleasure to work with you! Thank you SO MUCH for the GREAT review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "117068110860688416954", "name": "sherry ramsey", "time": 1568382780678, "rating": 5.0, "text": "They are hands down the number one Quick Books and accounting firm of all times.  I have never worked with anyone so knowledgeable and easy to work with in all my years.  Very satisfied customer!", "pics": null, "resp": {"time": 1577827863036, "text": "Wow Sherry, thank you so much for the rave review."}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "100173678078828747649", "name": "Nhat Truong", "time": 1549393903872, "rating": 5.0, "text": "Very knowledgeable, excellent communication. Brandon goes the extra mile to get things accomplished. I’ve been working with him to bring value to his clients, but he has in turn provided me exceptional value. I definitely recommend his expertise in all realms of Intuit Products.", "pics": null, "resp": {"time": 1553713989445, "text": "Nhat, you my friend are a ROCKSTAR!  We appreciate the GREAT review and is always a pleasure to work with you!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "111823807177511452049", "name": "Laser Beauty", "time": 1547941528421, "rating": 5.0, "text": "Barons, inc is very professional and and helpful in all aspects of QuickBooks management. I have been a client for over 15 years. I love working with Sharon. She always returns my calls and goes out of her way to fix any problems or help with questions. My business would not be where it is today if it were not for her expert knowledge and genuine caring attitude.", "pics": null, "resp": {"time": 1548287929987, "text": "Thanks Jacqueline!  I've appreciated working with you as well, you've been a joy to work with! Thank you for the GREAT review! ~Sharon"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "111277116250474484410", "name": "Tamla Masters", "time": 1550259881800, "rating": 5.0, "text": "Barons has been truly wonderful to work with. Very knowledgeable and extremely receptive with any of my business needs. I consistently get excellent customer support from the Baron’s team. They go out of their way to help me solve any issues I have with Quikbooks which gets me quickly back on track. Their services are extremely valuable for my business.", "pics": null, "resp": {"time": 1553712085351, "text": "Tamla, our Club Z! friend! Thanks for the GREAT review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "112115929266158956995", "name": "RxMaster Pharmacy Software", "time": 1553551376745, "rating": 5.0, "text": "Sharon is very knowledgeable and professional. I trust her with any Quickbooks problem or question I might have, she always gets back to me within a short time frame. I have been a satisfied customer for 14 years. I would recommend Baron's to anyone.", "pics": null, "resp": {"time": 1553711651174, "text": "Rhonda, thanks for the GREAT review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "105829907665835612779", "name": "Claude Stone", "time": 1559922161010, "rating": 5.0, "text": "I am not sure 5 stars gives one the right magnitude of the service Morse Farm has receives from Barron's, Chris Metzler. His support of each of our employees gives them the confidence to integrate Quick Books Point of Sale in the the Morse Farm infrastructure. We would love to make a sugar maker of him.", "pics": null, "resp": {"time": 1559924617504, "text": "Thanks Claude for your business! We feel the same way about Chris!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "117317254217504116074", "name": "Helene Cerise", "time": 1593114531105, "rating": 5.0, "text": "Excellent service - helped me all weekend to convert from Desktop to Online.", "pics": null, "resp": null, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "103553518053420410499", "name": "Teresa Bradford", "time": 1552933235427, "rating": 5.0, "text": "Sharon was an absolute delight to work with! Besides being very knowledgeable, she was very personable and quick to respond to every question and need that I had.  I am elated to have found such an expert!", "pics": null, "resp": {"time": 1553711770753, "text": "Teresa, it was a delight to work with you!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "110992099580609457605", "name": "Josh Drummond", "time": 1562364103306, "rating": 5.0, "text": "Baron's Inc is a great company with excellent service and lots of business knowledge for quickbooks and more. They service me here in Arkansas all the way from Alabama! Great folks and friendly to deal with. Highly Recommended!", "pics": null, "resp": {"time": 1562368437165, "text": "In true Rockstar fashion, thanks buddy!  Love doing business with you"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "106571462612984588457", "name": "Jeanne Grimes", "time": 1551808299303, "rating": 5.0, "text": "Baron's is your go-to for all things accounting and Quickbooks.  Sharon McCauley is extremely knowledgeable and a pleasure to work with for our end-of-year bookkeeping, financial audits for contractor licensing and any new business piece that we need to add in Quickbooks.  She is a wizard at all of it.  Truly don't know what we would do without her expertise.", "pics": null, "resp": {"time": 1553711955993, "text": "Thank you so much Jeanne!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "111276108849508523867", "name": "Regina Daniels", "time": 1549997944652, "rating": 5.0, "text": "Wow! We have been using Barons Inc since 2008!! I would spend hours trying to figure out how to “fix” something in QB, because you know it has to be easy😊, then I’d call Sharon and she would tell me in 5 seconds. They have made our lives so much more organized by teaching us & being fast at answering our questions!!", "pics": null, "resp": {"time": 1553712253531, "text": "Regina, yes WOW...thanks, yup kind of a long time...we love working with y'all!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "107962674414500317604", "name": "Jc’s Outlet", "time": 1547820153796, "rating": 5.0, "text": "Baron’s is an asset to my business. They have a lot of business insight, super friendly, and super helpful whenever I have a business need. Utilize their services and you won’t go wrong!", "pics": null, "resp": {"time": 1548288960720, "text": "Justin, you are a ROCKSTAR business owner as well as a great friend!  We value your friendship and your business!  Thanks for the review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "105263527778344374868", "name": "Kathy Vance", "time": 1548196933696, "rating": 5.0, "text": "I have been a client of Barons' Inc for over 10 years. Sharon and Brandon are great to work with. They are quick to return phone calls and follow through to get your accounting or qb issues resolved. I highly recommend this company!", "pics": null, "resp": {"time": 1548288200223, "text": "Thank you PEBBLES! We love working with you and we love you!  Absolute rock star professionally and personally!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "113723871616249817164", "name": "Will Perry", "time": 1550027401626, "rating": 5.0, "text": "My clients buy their QuickBooks software from Barons'. They do an excellent job of taking care of my clients. My clients and I have been doing business with Barons' for several years and they have always provided prompt service without any problems. I highly recommend Barons' Inc.", "pics": null, "resp": {"time": 1553712166569, "text": "AND...we appreciate you and your clients Will, thank you!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "116988780458405924345", "name": "Joanne DelBalso", "time": 1549742497328, "rating": 5.0, "text": "The team at Baron's Inc has top notch customer support.  They are very knowledgeable with all things Intuit product based.  If you have any questions on which product to purchase for your accounting software, POS system or Merchant services make sure you give Barron's a call!!", "pics": null, "resp": {"time": 1553713654918, "text": "Joanne, thanks for the GREAT review and thanks for being a friend and long time member of the Accounting Success Group!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "101823155699672483707", "name": "Jimmy Stewart", "time": 1547771723343, "rating": 5.0, "text": "Very great company with very knowledgeable staff. Highly recommend them to anyone. They will be a tremendous asset to your company.", "pics": null, "resp": {"time": 1548289095065, "text": "Jimmy, you're a great friend and appreciate the RAVE review!  So many years of  friendship and business..."}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "115522262429313184268", "name": "Jim Dinwoodie", "time": 1551997598578, "rating": 5.0, "text": "I have had the pleasure of working with Barons' for over fifteen years.  They were instrumental in helping me create and manage the financial foundation of our small business, and for educating me (a marketing person, no less) in the use of QuickBooks.  I have found their entire management team at Barons' to be professional, responsive and a delight to work with.", "pics": null, "resp": {"time": 1552063327425, "text": "Jim, you, my friend are another that started as a customer and left as a friend!  We value our relationship with you and much appreciate your review...THANK YOU!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "116162691382124930775", "name": "Michael Jordan", "time": 1566223941263, "rating": 5.0, "text": "Chris Metzler is a top notch professional. He took great time and care making sure our point of sale system was properly set up .", "pics": null, "resp": {"time": 1577827906641, "text": "Hey Michael thank you so much for the review. We think the same thing of Chris... Thanks again for the review I will make sure Chris sees this."}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "101168821075903408179", "name": "Ernest Cook", "time": 1549952778489, "rating": 5.0, "text": "I've know Brandon for almost a decade. He and his team provide top notch support for customers. I am happy to refer customers to his team because I know they will be treated right.", "pics": null, "resp": {"time": 1553712333969, "text": "A DECADE!? DUDE! Thanks for the great review Ernest!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "104588604249400463226", "name": "maria johnson", "time": 1549037440435, "rating": 5.0, "text": "My experiences working with both Brandon and Sharon has been a pure pleasure. Their expertise and dedication to help me achieve my business objectives surpassed my expectations.", "pics": null, "resp": {"time": 1553714191881, "text": "Thanks Maria, for the great review and the friendship over many years!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "101872866175889778924", "name": "Yvette Shaw", "time": 1549347316705, "rating": 5.0, "text": "Barons Inc. always give us excellent service and support. They are extremely helpful and knowledgeable. I would recommend them to anyone. Thanks Brandon and Sharon for stellar service and always giving us the support we need!  Yvette from YMS Bookkeeping Services, Inc.", "pics": null, "resp": {"time": 1553714057944, "text": "Yvette, you always so kind...we love working with you and having you on the ASG team as well!  Thanks for the GREAT review"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "114328140259736151845", "name": "Cason Smith", "time": 1549394513032, "rating": 5.0, "text": "Brandon is trustworthy, skilled and creative to customize an experience that is tailored to meet your exact needs. Plus! He’s a great guy who has a passion for helping people and businesses!", "pics": null, "resp": {"time": 1553713881226, "text": "Thanks Cason, you hit the nail on the head...we ROCK! LOL Seriously, thanks!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "111564339020835713042", "name": "April G", "time": 1551914491919, "rating": 5.0, "text": "Professional and customer service excellence! They are always my go to people when I have questions about Quickbooks. Thank you for your kindness and support dedication!", "pics": null, "resp": {"time": 1553711926151, "text": "Hey April! Thanks for the GREAT review...see you at QuickBooks meetup"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "100158609571642394133", "name": "Erik Wolff", "time": 1548111734313, "rating": 5.0, "text": "Baron's have eliminated ALL the headaches I had with Quickbooks and payroll. I have 5 different business, from Corporations to LLC to Non-profit. They set-up my Businesses from day one to run flawlessly and I'm still having success 10 years later because of what they continue to do. I would encourage any Business to give Barons Services a try. You'll wish you did it sooner.", "pics": null, "resp": {"time": 1548288095787, "text": "ROCKSTAR review Erik! Thank you SO much!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "102916626435739492516", "name": "Angie Johnson", "time": 1555437518731, "rating": 5.0, "text": "Barons' Inc is the best. Sharon is amazing, she can always help me with any issues I may have. I highly recommend them.", "pics": null, "resp": {"time": 1577827964169, "text": "Thanks Angie! Sharon is awesome, we agree... I'll make sure she sees this."}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "106630557942804063758", "name": "Nick Goedereis", "time": 1549483940100, "rating": 5.0, "text": "Barons is the best at what they do, I highly recommend them in every Accounting /Quickbooks/ Technical situation, simple or extremely difficult. They WILL find the answers and ease any stress or confusion you find yourself in. Always up to date with newest regulations or technology. Very courtious,professional and prompt.", "pics": null, "resp": {"time": 1553713836850, "text": "Nick & Lauren...thank you so much for the GREAT review...we love working with you guys!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "107638663752361238902", "name": "Sharon Ramey", "time": 1549993463359, "rating": 5.0, "text": "Sharon McCauley and Brandon Morris are excellent at what they do.  They are professional, knowledgeable and very easy to work with. I highly recommend them.", "pics": null, "resp": {"time": 1553712266880, "text": "Sharon, thanks for the GREAT review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "108444596400790262303", "name": "Robin Boyer", "time": 1550232908721, "rating": 5.0, "text": "Barons, Inc. set are company up with quickbooks over 10 years ago. Made my life so much easier. Extremely knowledgeable. Sharon always ansrewed  my calls when I needed help which was a lot. Very sweet and professional. I would recommend them to everyone", "pics": null, "resp": {"time": 1553712111695, "text": "Thanks Robin...much appreciated"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "117365559143113529977", "name": "Tricia Estes", "time": 1549231417557, "rating": 5.0, "text": "Sharon and Brandon are incredible!! Their knowledge, quick response and patience is second to none! I would highly recommend them to anyone needing help with Quickbooks.", "pics": null, "resp": {"time": 1553714148718, "text": "Thank you Tricia...you guys are always a joy to work with!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "106432421922678528479", "name": "Gina Rodkey", "time": 1549677222570, "rating": 5.0, "text": "Working with Baron's is a pleasure. Brandon is very professional, he knows my needs and is pro active in making useful suggestions. Anytime I have had a question or needed help he has been there.", "pics": null, "resp": {"time": 1553713738564, "text": "Gina, the pleasure is ours for sure! Thanks for being a friend and long time member of the ASG group!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "114086011900714284722", "name": "Nicole Donohue", "time": 1547741172940, "rating": 5.0, "text": "Brandon and Sharon have been building this business for 16 years and are extremely knowledgeable and passionate about what they do! I am beyond thrilled to be working with them both!", "pics": null, "resp": {"time": 1548287726699, "text": "Thanks Nicole! We agree, WE are absolutely thrilled to be working with you as well!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "112724701068644125891", "name": "Kyle Crabtree", "time": 1547748464005, "rating": 5.0, "text": "Brandon from Barons' Inc is my go to guy for all things accounting software. He bring not only the wealth of knowledge from being a Quickbooks expert but also the understanding of how business is ran.", "pics": null, "resp": {"time": 1548289176501, "text": "From you, Kyle that means a lot, you know a lot of people...GREAT review, thank you for the kind words as well!  Appreciate your friendship even though you bailed on me here in Mobile! lol"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "116450211628548719754", "name": "Jaguar Cleaners Inc.", "time": 1548438873716, "rating": 5.0, "text": "QuickBooks Gurus!  Look no further,  these guys do it all!  All of our accounting systems are now automated and integrated.  Our office now functions with ease.  We couldn't thank them enough!", "pics": null, "resp": {"time": 1548442729841, "text": "LOVE this review! Thank you Christina! Both you and Thomas are great people, work hard, and have a phenomenal business...thank you again for the GREAT review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "105433879793598619825", "name": "Wende Burdick", "time": 1553706121978, "rating": 5.0, "text": "Brandon and Sharon have been trusted Club Z! partners who have delivered exceptional support and training for many years. I don't know what we would do without their responsiveness and expertise to keep our franchisees out in the field and not stuck in their back office struggling with operations headaches! I always recommend them first over the other options available.", "pics": null, "resp": {"time": 1553707098417, "text": "Wende, thank you for this GREAT review!  We appreciate you and the Club Z! franchise!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "111935659508903591533", "name": "KC ProAdvisor", "time": 1549314660505, "rating": 5.0, "text": "Brandin has been a valuable source of information and has great solutions customers.\nGreat follow through and professional standards", "pics": null, "resp": {"time": 1553714123201, "text": "Jim, thanks for the GREAT review...much appreciated...love having you on the ASG team especially for the number of years we've been able to work with you!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "110328737941233817676", "name": "Nursery Texas Teacups (Texas Teacups)", "time": 1556730981793, "rating": 5.0, "text": "Chris Metzler is somewhat of a rockstar! I have had a very hard time getting everything installed properly and setup and every time I call and ask a question he always answer! Even when traveling he opens his laptop in the airport and walks me through step-by-step on how to get it done! Thank you Chris!", "pics": null, "resp": {"time": 1556810390681, "text": "We agree, Chris is kind of a BIG DEAL...but SO ARE YOU Becky...we appreciate your business and even more appreciate the time you took to brag on Chris...THANK YOU for your business!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "104664991626861162361", "name": "Tracy Johnson", "time": 1548692203037, "rating": 5.0, "text": "Have had great experiences with Barons' Inc. They have gone above and beyond to help me have the knowledge and tools I needed for my business. They really care about our success!", "pics": null, "resp": {"time": 1553714606930, "text": "Thanks Tracy, for the GREAT review"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "110625825839017936804", "name": "Coral Tree", "time": 1548347388057, "rating": 5.0, "text": "We have always had a positive experience working with the team at Barons' Inc. and would highly recommend them to anyone considering their services.", "pics": null, "resp": {"time": 1548348872058, "text": "Hey CORAL TREE, MUCHO thanks for the review! You guys are TRUE rockstars and appreciate your friendship and your products...great addition to our services! Thanks again!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "114403797920020902926", "name": "Ron Brown", "time": 1548275320315, "rating": 5.0, "text": "We Have been working with Sharon McCauley & Brandon Morris for close to 5 years. Excellent speedy and accurate service for our Quickbook needs, also all of our general accounting, payroll, and CPA work. If you are a Contractor you will  be amazed at the detail and experience they can bring to your firm.", "pics": null, "resp": {"time": 1548288684964, "text": "Thanks Ron for the AWESOME review! We love working with you guys. Give Turk a rubdown from us!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "117819026071038224553", "name": "Benita Drew", "time": 1547751358006, "rating": 5.0, "text": "Brandon really knows his stuff! He stays current on all the software has to offer and customizes it to fit what I need it to do for any new business venture I come up with.", "pics": null, "resp": {"time": 1548289526765, "text": "Thanks Benita...for the YEARS of business and bantering back and forth as well as bossing me around for photo shoots that the family has forced me into :) Not just a customer, but a friend!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "106317578164941275975", "name": "Becca Bodiford", "time": 1549951742595, "rating": 5.0, "text": "Brandon has always went above and beyond to help us out.  Fair price for excellent service.  Thanks for always taking care of the carpet store when we need you.", "pics": null, "resp": {"time": 1553713429223, "text": "Becca, it's always been our pleasure...cool that we get to work together after going to middle & high school together for all those years :)"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "113390311494774903268", "name": "Connie Armer", "time": 1548112625959, "rating": 5.0, "text": "Baron's has been wonderful to work with. If I didn't know the answers they always did.  Thank you for being there for us.", "pics": null, "resp": {"time": 1548289591675, "text": "Thanks for the GREAT review Connie, it is MUCH appreciated!  I have enjoyed working with you as well, both with your practice as well as with the church!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "107385354572352553890", "name": "Sabrina Johnson", "time": 1548369439285, "rating": 5.0, "text": "Brandon has always been friendly,  informative and professional. I highly recommend this company.", "pics": null, "resp": {"time": 1553712580077, "text": "Thanks Sabrina, much appreciate the review...hope all is going well!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "107413259219398428581", "name": "Marcie Hill", "time": 1552496039221, "rating": 5.0, "text": "Great at what they do.  From teaching to solving the problems.  Very informative and Great service!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMzi5-HkJUX9MT6YqsCLN6oikNIUYejh4ZTZw2t=w150-h150-k-no-p"]}], "resp": {"time": 1553711812284, "text": "Marcie, thanks for the GREAT review! Love hearing from long time clients!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "115243769015594441761", "name": "Janette Armstrong", "time": 1548186647755, "rating": 5.0, "text": "Barrons is so helpful and always available with any questions. Definitely recommend their services!!", "pics": null, "resp": {"time": 1548289722189, "text": "Thanks Janette for the GREAT review...ALWAYS enjoyed working with you both at the tractor store as well as 101 Livestock! Thanks!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "116827982663756002412", "name": "joealzate", "time": 1548368888368, "rating": 5.0, "text": "Love the personal attention they give. Friendly and knowledgeable staff.", "pics": null, "resp": {"time": 1553714685541, "text": "Hey Joe, thanks for the GREAT review..."}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "111367301631481325443", "name": "David Gotsche", "time": 1549986955624, "rating": 5.0, "text": "If you need ANY help with QuickBooks, this is the best resource available. The team will answe any questions you have and work to get you the total solution for your accounting needs!", "pics": null, "resp": {"time": 1553712302953, "text": "Thanks David, yeah...we are the TOTAL PACKAGE! :) LOL"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "111414255168103229315", "name": "Andrea Roy", "time": 1549378051626, "rating": 5.0, "text": "Very helpful for all of our Quickbooks needs and we always have a great experience!  I highly recommend!!!", "pics": null, "resp": {"time": 1548288513175, "text": "We highly recommend OPC and you are always a pleasure to work with as well Andrea! Thanks for the RAVE review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "102114284254594159971", "name": "Russell Guy", "time": 1553096302080, "rating": 5.0, "text": "Barons has helped me with my small business since 2011.  Their general accounting support and QuickBooks expertise has been of great value to me…and Sharon is such a joy to work with, I appreciate them greatly!", "pics": null, "resp": {"time": 1553711743589, "text": "Russell, thanks for the GREAT review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "109648838740866766564", "name": "Treasurer Salem UMC", "time": 1549652371583, "rating": 5.0, "text": "Always helpful and professional. This is the best way to help your business be successful.", "pics": null, "resp": {"time": 1553713795685, "text": "Thank you for the great review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "117967001023013505741", "name": "Bill Beyer", "time": 1551460330490, "rating": 5.0, "text": "If you use Quickbooks you need Baron's on your team. I have them on speed dial!", "pics": null, "resp": {"time": 1553711998228, "text": "Thanks Bill, one of these days we'll go see the Wizard (of ads) together! :)"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "101255129352709315425", "name": "Patrick Flanagan", "time": 1548739717756, "rating": 5.0, "text": "Extremely knowledgeable, professional and service driven. I would absolutely recommend Barons Inc for any business owner.", "pics": null, "resp": {"time": 1553714596385, "text": "Thanks Patrick, for the GREAT review"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "117700248905227186794", "name": "Robert Button", "time": 1550625951511, "rating": 5.0, "text": "Baron',s Inc is spot on when it comes Quickbook set up, sales and support. Sharon is extremely knowledgeable and has helped me manage my Quickbook accounts for over 12 years. Her expertise in the QuickBooks program is outstanding. Because of Baron',s Inc. My tax preparation was cut in half at the CPAs office saving time and money. I would highly recommend the Baron',s team!", "pics": null, "resp": {"time": 1553712053775, "text": "Thanks Robert!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "110997975562732227490", "name": "Pam Bohall", "time": 1553377632279, "rating": 5.0, "text": "Very knowledgeable and great service!! Would highly recommend Barons", "pics": null, "resp": {"time": 1553711680149, "text": "Thank you Pam, we appreciate your business"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "116843428936314117303", "name": "Elizabeth Crowder", "time": 1548272430869, "rating": 5.0, "text": "Baron's Consulting are amazing, very professional, loved working with them, they always knew what I needed for my self storage business. Thank you for always taking care of me", "pics": null, "resp": {"time": 1548288435097, "text": "Thank you so much Elizabeth with the GREAT review!  You are pleasure to work with!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "106483038404408750591", "name": "Jamie Delveccio", "time": 1549909501173, "rating": 5.0, "text": "I've had the honor and opportunity to know and work with Brandon Morris and the Barons' Inc team as their QuickBooks Channel Manager here at Intuit QuickBooks for over 5 years. Barons' Inc. is one of our fastest growing and highest valued QuickBooks Solution Providers, providing excellent service to our QuickBooks customers, and mentorship to our fellow QuickBooks Solution Providers. He also serves as a member in our QuickBooks Advisory Council, working directly with our QuickBooks leadership and product developers to lend his experience and feedback. I can't say enough about Brandon and Barons' Inc, we're incredibly fortunate to have him on our team!", "pics": null, "resp": {"time": 1553713591194, "text": "The honor and opportunity is all ours Jamie!  We love being in the QSP program, and love the direction and advice that you provide as well!  Thanks for all that you do!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "115261229787112019533", "name": "Lori Rogers", "time": 1548110690270, "rating": 5.0, "text": "I learned so much about QuickBooks from Barons' I would absolutely recommend them. They provide personal service and are very knowledgeable!", "pics": null, "resp": {"time": 1548288025153, "text": "Lori, Thanks for GREAT review!  We've LOVE working with you and we miss your face! :)"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "102258092652910121459", "name": "Marcella Parson", "time": 1549378413658, "rating": 5.0, "text": "We have used Barons' Inc for years and have always been happy with them.", "pics": null, "resp": {"time": 1553712482123, "text": "Marcella, thanks for the GREAT review! We've enjoyed working with you over all these years"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "110657316619835389026", "name": "Jessie Puryear", "time": 1550091268102, "rating": 5.0, "text": "Trustworthy, Honest, and Kind. They have gotten me out of some big jams.", "pics": null, "resp": {"time": 1553712137519, "text": "Jessie, thanks for the GREAT review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "111034602315809179296", "name": "Ross Rodden", "time": 1548859689522, "rating": 5.0, "text": "I’ve used Barons for many years in my small business. Their service, support and expertise in Quickbooks has been invaluable.", "pics": null, "resp": {"time": 1553714307507, "text": "Thanks Ross, we've enjoyed working with you guys as well...much appreciate the GREAT review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "109832571006216266309", "name": "Paul C", "time": 1601059161204, "rating": 5.0, "text": "Great to work with.", "pics": null, "resp": null, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "111514335252727309845", "name": "Mason Schirmer", "time": 1549674552731, "rating": 5.0, "text": "Brandon it's knowledgeable and responds quickly!", "pics": null, "resp": {"time": 1553713760291, "text": "Mason, thanks for the GREAT review - much appreciated!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "107366794749859003835", "name": "Tammy Hubbard", "time": 1548791181965, "rating": 5.0, "text": "Barons helped me with my pos system and when I started my business and is so helpful when I have any questions that come up. Which is probably more than the average person but I always get answers.", "pics": null, "resp": {"time": 1553714548914, "text": "TAMMY, you're a rockstar...thanks for the great review..."}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "110109097986193427933", "name": "Joe Delacruz", "time": 1548972602831, "rating": 5.0, "text": "Sharon McCauley did a great job.", "pics": null, "resp": {"time": 1553712442387, "text": "Joe, thanks for the GREAT review! Hope your rental business is going well!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "113087742610922079601", "name": "ravindavid", "time": 1553200625185, "rating": 5.0, "text": "Top Quality Service-ALL the time,EVERY time", "pics": null, "resp": {"time": 1553711716228, "text": "HARK! Thanks Dave...your work is always top quality as well!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "117611259330163789194", "name": "Faith Lessly", "time": 1552213906437, "rating": 5.0, "text": "They are very knowledgeable and eager to help!", "pics": null, "resp": {"time": 1553711879568, "text": "Thanks Faith (Bill) - GLAD you noticed our knowledge...and we ARE eager to help :)"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "107538613512321785609", "name": "TEAM VISION LLC", "time": 1548890928158, "rating": 5.0, "text": "From the owner to the agents. Nothing but great service and professional 😊😊😊😊", "pics": null, "resp": {"time": 1553714232271, "text": "The same could be said about you Kevin...thanks for the GREAT review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "117762228844796233439", "name": "OnCall Email", "time": 1548954026545, "rating": 5.0, "text": "Very professional and extremely prompt.", "pics": null, "resp": {"time": 1553714205790, "text": "Thanks for the GREAT review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "114894900767987371896", "name": "Stefanie Herrick", "time": 1548692321302, "rating": 5.0, "text": "Very knowledgeable and helpful. I would definitely recommend them.", "pics": null, "resp": {"time": 1553712513323, "text": "Stefanie, thanks for the GREAT review!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "100637001887715834985", "name": "Jenny Flicker", "time": 1549720026059, "rating": 5.0, "text": "Very responsive and helpful.", "pics": null, "resp": {"time": 1553713706108, "text": "Jenny, GREAT review, THANK YOU...glad to have you with Accounting Success Group!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "112616152128960672894", "name": "Annie Stieler", "time": 1548275194834, "rating": 5.0, "text": "The best of the best.", "pics": null, "resp": {"time": 1548288324024, "text": "Thanks for the GREAT review Annie! Truly appreciated!"}, "gmap_id": "0x889a4f3828f34543:0x238919d63f747c40"}
{"user_id": "104904665929739847417", "name": "James Chancellor", "time": 1581395567013, "rating": 5.0, "text": "She is a strong Christian who is always looking out for others. Carol is extremely helpful. She knows what questions to ask inorder to help you get the most money back for your taxes. She doesn't treat you as a customer, she treats you as a person. She is always willing to go the extra mile and take her time with you inorder to get the job done correctly. Carol's prices are amazing. She was several hundred dollars cheaper than H&R Block. Not only that you never know who you get when you step into a big box tax service. My family will always choose Carol E. Douglas as our tax needs provider.", "pics": null, "resp": {"time": 1581422828409, "text": "Thanks so much for the review.  Looking forward to next year. God Bless."}, "gmap_id": "0x889bb4923bc74e4d:0x2769a177ec07430e"}
{"user_id": "116250714072365762802", "name": "Jeff Welte", "time": 1602618838276, "rating": 5.0, "text": "Our FIRST choice for TAX prep help. Everyone in the office went above an beyond to help s with multi-state filings. It was complicated and they made it sound easy. HUGE Thanks to all!!", "pics": null, "resp": {"time": 1602649945197, "text": "Love new clients .. Appreciate your kindness.  Looking forward to our next visit.  Always Thankful !  God Bless !"}, "gmap_id": "0x889bb4923bc74e4d:0x2769a177ec07430e"}
{"user_id": "103962485830968019524", "name": "Jerrod Hodges", "time": 1590585499146, "rating": 1.0, "text": "2 out of 2 times disappointed. 1st time dropped off 2 months b4 the april dead line and it wasnt done so opted to do it myself. Then this year had a appointment on march 24th and still not done. And going some wheres else. If u have an appoint shouldnt it be done that day even with the covid19 issue  cause u have a set time??????\n\nUpdated : she used covid19 as a excuse,but hard to used that when my brother gave her his taxes 2 week after mine, his was done the week of the may 11th. So ill be going else where next year", "pics": null, "resp": null, "gmap_id": "0x889bb4923bc74e4d:0x2769a177ec07430e"}
{"user_id": "116354703942683138839", "name": "Pernell Glover", "time": 1529765468917, "rating": 5.0, "text": "Carol and Bridgette are amazing! They made the daunting task of tax filing stress free! It was like talking with new friends and before you know it you’re done! They are very experienced and ask questions you wouldn’t think to ask...and work to file your taxes leaving no stones unturned.They are very friendly, knowledgeable and good at what they do! I highly recommend!", "pics": null, "resp": {"time": 1530104914388, "text": "Love new clients .. Appreciate your kindness.  Looking forward to our next visit.\nAlways Thankful !"}, "gmap_id": "0x889bb4923bc74e4d:0x2769a177ec07430e"}
{"user_id": "101061659276326862279", "name": "Frances Dauster", "time": 1500300655758, "rating": 5.0, "text": "Carol has been doing my taxes since 1995. She has been AMAZING. From my being single, to married, to separated, to divorced, in addition I started a business, and had some overseas stuff going on - every step of the way Carol has been incredible. She goes to seminars, too - continuing ed is so important when it comes to quality work. Carol ROCKS.", "pics": null, "resp": {"time": 1500323799338, "text": "Appreciate your Loyalty.  Looking forward to our next visit.\nAlways Thankful !"}, "gmap_id": "0x889bb4923bc74e4d:0x2769a177ec07430e"}
{"user_id": "108446755128529805122", "name": "GSMO", "time": 1554999450603, "rating": 5.0, "text": "She was awesome! Very knowledgeable and helpful. I highly recommend Carol to anyone looking for tax help or a good accountant!", "pics": null, "resp": {"time": 1573785000582, "text": "Appreciate your kindness.   It was a pleasure. Looking forward to our next visit.\nAlways Thankful !"}, "gmap_id": "0x889bb4923bc74e4d:0x2769a177ec07430e"}
{"user_id": "104852750399815053202", "name": "sharkjones261", "time": 1500328394791, "rating": 5.0, "text": "Carol does a meticulous job. Highly recommend her", "pics": null, "resp": {"time": 1500329218647, "text": "Appreciate your Loyalty.  Looking forward to our next visit.\nAlways Thankful !"}, "gmap_id": "0x889bb4923bc74e4d:0x2769a177ec07430e"}
{"user_id": "116321459190466358888", "name": "Carol Shipman", "time": 1517448951684, "rating": 5.0, "text": "OUTSTANDING!!! KIND, CONSIDERATE KNOWS HER STUFF AND VERY REASONABLE!", "pics": null, "resp": {"time": 1517532133909, "text": "Thank you for your kindness and loyalty."}, "gmap_id": "0x889bb4923bc74e4d:0x2769a177ec07430e"}
{"user_id": "115128293354295829091", "name": "Mikaela Hoffman", "time": 1591888465422, "rating": 5.0, "text": "This was my first experience coming here and I am beyond pleased. I had my taxes done at another business and ended up coming here for a second opinion. I am very glad that I did because I saved thousands. I highly recommend Brett Professional from great customer service to good quality work!", "pics": null, "resp": {"time": 1591892187709, "text": "Thank you Mikaela!  We enjoyed working with you as well. We look forward to helping you in the future!"}, "gmap_id": "0x889a05c7e3dbf10f:0xcbd9967bb4d453ea"}
{"user_id": "115477451490149814611", "name": "Tim Defebaugh", "time": 1491331783515, "rating": 5.0, "text": "Brett Professional Services was referred to me for our tax needs in Gulf Shores. We purchased a rental condo there and they are handling all the taxes for us. I could not ask for or receive any better service from anywhere. They are incredibly professional and polite. They pay great attention to their client and do an outstanding job. I can not recommend them enough.\n\nThank you\nTim and Jennifer D.", "pics": null, "resp": {"time": 1602625756016, "text": "Thank you Tim! We have also enjoyed working with you over the years! Thank you for the 5 star review!!"}, "gmap_id": "0x889a05c7e3dbf10f:0xcbd9967bb4d453ea"}
{"user_id": "106933507915872735440", "name": "Martin Middleton", "time": 1582751405121, "rating": 5.0, "text": "Leslie is great! She’s been my go to since 2011.", "pics": null, "resp": {"time": 1602625655802, "text": "Thank you for your business Martin!!  We enjoy working with you and have so since 2010!"}, "gmap_id": "0x889a05c7e3dbf10f:0xcbd9967bb4d453ea"}
{"user_id": "103595945903523464068", "name": "Jim Peeples", "time": 1581455004441, "rating": 5.0, "text": "Very good professional service.", "pics": null, "resp": {"time": 1602625688561, "text": "Thank you for your business Jim! Your support for our business means so much to us, thank you!"}, "gmap_id": "0x889a05c7e3dbf10f:0xcbd9967bb4d453ea"}
{"user_id": "105009069663296496987", "name": "T “Lady T” CL", "time": 1555150428060, "rating": 2.0, "text": "Had never heard of this place before until they contacted me about a position. Someone else was hired. I stopped by the office to drop off requested paperwork. She said she would keep my information on file. No follow-up or communication since then.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOinsjvrG7S1Yd1V76dHG8ba8QzcnZ3U1TWguOq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMzRmiKtylB7CTdinEazOTHbomJun4mQdTSkS3P=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPt_Zr_oRLVSG1da-b8e48i3IvHQfWyPynKjJG9=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMtrnr9rmv99HtVUucNmk7HYalCootfCEsrPZ0H=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO9gfezIRSOknlwHiiUQKlyHLMK4VDsqPqLQE9K=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOeYVpG1yekGsvqe19dnUyUwkVdxsVwurEQAl-w=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOe3GNfHJXHUfIW-jmOsfqIx1hJk5zz2z64Btid=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNR10JCSCr7GStBcyXOLjEXPcnQ98CGHxSfIl6v=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMO75ZnyeGWaBmf3hu-FF_53MkxFxUks9PWD9xR=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN-NtNtlpe4400ppCiAkmXGvk_OFUEWzbDYJOq4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM6H08-AnXm0Dv87xAEPCB2_ib9Ogdlstnhdf1S=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNZ2sk0M9arcYG6b1XV9n2KvVRaMtsZSUNTqxuY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNclxgbOFepzUlS1Dx78tvV4zcCKfcs3akYfSq1=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88890e31731be2a1:0xea664c9cdec5334e"}
{"user_id": "113599126063458561745", "name": "Elaija Mason", "time": 1559302622711, "rating": 5.0, "text": "Went in one day they told me they would contact me when a job came available got the call early the next morning that they found a position got sent to interview with the hiring employer and 1 hour later I was hired! I have been to several temp agencies but this one got me in and got me out FAST and the staff are very energetic I will definitely be referring people !", "pics": null, "resp": null, "gmap_id": "0x88890e31731be2a1:0xea664c9cdec5334e"}
{"user_id": "104530235677517075897", "name": "Vernon B", "time": 1481307191984, "rating": 5.0, "text": "I've consulted with Darrell Walker Workforce many times regarding several of their employment services, including job placement, executive search, and workforce planning. On one occasion, I met with their administrative staff and recruiters in their Birmingham office. Throughout our 4 hour+ meeting, I was impressed with their attentiveness to my specific needs, eagerness and ability to answer my questions, breadth of knowledge about the staffing industry, and the years of experience they (literally) brought to the table. As an aside, they were providing temp services way back before the word \"personnel\" fell out of favor! I know I'm in good hands with Darrell Walker and will continue calling on them in the future for my staffing and payroll outsourcing needs.", "pics": null, "resp": {"time": 1481323844720, "text": "Hi Vernon! We remember that marathon meeting quite well. And we enjoyed every minute of it! One of the main reasons Darrell Walker Workforce is capable of providing relevant and beneficial employment services is because we understand the importance of listening. And the more we listen to valuable clients like yourself, the more we learn. We're definitely looking forward to our next \"discussion\". Thank you for taking time to leave a review. ~ Linda Walker Channell (President)"}, "gmap_id": "0x88890e31731be2a1:0xea664c9cdec5334e"}
{"user_id": "105177598837917596552", "name": "Nimitz 17", "time": 1572160206395, "rating": 5.0, "text": "I called in and they had me a job the next day, 5 stars all the way!", "pics": null, "resp": null, "gmap_id": "0x88890e31731be2a1:0xea664c9cdec5334e"}
{"user_id": "116894094856529757653", "name": "Shelley Belly", "time": 1409771304426, "rating": 5.0, "text": "Sheila and Meredith are very helpful and knowledgable in their field of human resources and placement.   It was a pleasure to deal with them. I have referred friends in the area to them and they have all enjoyed their experience with Darrell Walker Workforce Systems.  I would definitely recommend them to others.", "pics": null, "resp": {"time": 1481321495273, "text": "Hello Ms. Belly! Sheila and Meredith combined have over 45-years experience (and they're so young) in the staffing and recruiting industry, and Darrell Walker Workforce is grateful to have them on our team! It was a pleasure working with you as well and we REALLY appreciate your referrals. Thank you for your kind review. ~ Linda Walker Channell (President)"}, "gmap_id": "0x88890e31731be2a1:0xea664c9cdec5334e"}
{"user_id": "116123383910812557403", "name": "anthony d.", "time": 1541855764124, "rating": 5.0, "text": "I was hired by D. W. Over 2 yrs. ago and assigned a job by them in moody, al. After staying at that assigment for a couple months, I was hired on with the company full time and have been with them since then. The staff was very nice. I recommend D. W. highly as a place to get employment started. Also am making more money.", "pics": null, "resp": null, "gmap_id": "0x88890e31731be2a1:0xea664c9cdec5334e"}
{"user_id": "105933276905541719337", "name": "Len Snow", "time": 1546876171431, "rating": 1.0, "text": "I Signed Up For These People Multiple Times An They Never Found Me A Job I Call Every Monday These People Know My Name Personality An Never Found Me Nothing I Really Feel Like This Place A Waste Of Time An Just Won't You To Come In An Do Your Paperwork So They Can Get Paid", "pics": null, "resp": null, "gmap_id": "0x88890e31731be2a1:0xea664c9cdec5334e"}
{"user_id": "112974491811833007974", "name": "Humble Beginnings", "time": 1539894515015, "rating": 2.0, "text": "Only 12 hour shifts available.", "pics": null, "resp": null, "gmap_id": "0x88890e31731be2a1:0xea664c9cdec5334e"}
{"user_id": "110599512021352602360", "name": "Patrick Livingston", "time": 1625097213184, "rating": 5.0, "text": "Great experience, great knowledge and great people!  I am glad to work with folks who are not only doing me a service but are also my friends! Never a better place for all of your accounting needs other than profit wise accounting!", "pics": null, "resp": {"time": 1625239235153, "text": "Thank you, Patrick. We love having you as a client and a friend!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "104880504960117462126", "name": "Natalie Tuck", "time": 1625099011308, "rating": 5.0, "text": "Extremely professional and affordable. I have worked with Sharon for years. She is super efficient and the communication she has with her clients is outstanding!", "pics": null, "resp": {"time": 1625239458816, "text": "We appreciate the kind words, Natalie! We understand that communication is the key to help clients not only overcome obstacles, but to understand them."}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "101652159563950017981", "name": "babin sj", "time": 1625095916766, "rating": 5.0, "text": "Profit Wise has freed me from the stress of doing my business taxes, and has allowed me to focus on the the parts of my business that I love.\nSharon and crew are very active in giving back to our community, and I'm thankful for them and the good they do!\n\nSteve Babin, Photographer", "pics": null, "resp": {"time": 1625239658995, "text": "We care about our clients and our community. After all, they are one and the same. Thank you, Steve!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "109321634686813096412", "name": "Lawrence Johnson", "time": 1624931100724, "rating": 1.0, "text": "I hired Profit Wise to do my business and personal account. There is still difficulty in believing the incompetence and flat-out lack of character this “firm” displayed with my accounting.\n\nI found Ms Ashleigh Heinz to be a consistent and complete liar as far as returning phone calls and keeping due dates.\n\nI also worked with Ms Jacqueline Harwood, who frequently would not return calls and had difficulty doing bookkeeping tasks that should have been routine.\n\nMs Sharon Heinz completed my tax return and said I owed over 12K in taxes. I requested a meeting to review my return with Ms Heinz. I ended up meeting with Jonathon. After going through my tax return, I ended up owing less than 2K in taxes.\n\nNot only was I not offered an apology for the service that I received I was terminated as a client.\n\nA first-class organization this is not. Proceed at your own risk. They will gladly collect your money beware the service.", "pics": null, "resp": null, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "102061697806981622754", "name": "Lamia Haddad`", "time": 1619996546277, "rating": 5.0, "text": "This is the first year I do business with Profit Wise and for the first time I can say filing my taxes was stress free. Their employees are very welcoming (always smiling). Everyone I've dealt with was highly professional and kind. If you call when they're busy, they always call you back and address any question or concern you may have. Also when they tell you your taxes will be completed on a specific date, rest assured that they will respect you and abide by it. Jonathan was especially helpful and knowledgeable. Sharon is very professional and smart. You can tell she knows what she's doing. She's also extremely sweet and friendly which makes it a joy to do business with her. Thank you Sharon :)", "pics": null, "resp": {"time": 1625239940106, "text": "It's easy to smile when you have great clients and enjoy helping them succeed. Thanks, Lamia!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "118064130576590488239", "name": "Thos Kite Art & Design (Thomas Kite)", "time": 1619039028499, "rating": 5.0, "text": "I came to Profit wize with both my business and personal taxes because I was dissatisfied with my previous accountant. They are very professional, efficient and really helped me with my complicated tax situation. It was easy to load up docs etc to a secure share so that my personal information was never compromised. I found them to be friendly and I feel they really care about their clients. When I reviewed the returns, I was hoping I did not owe any tax but it turns out I did. So the person who worked on my taxes went back to the drawing board and found some additional credits ( I supplied him with some additional documentation). I was thrilled as he was able to get me money back on my federal return and a lower state tax bill. I feel he put in some extra effort  to make me happy. I would highly recommend them.", "pics": null, "resp": {"time": 1625240333179, "text": "Thank you! We are glad you came to us for help! We look love to watch  our clients grow, personally or in business."}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "112010012770361466617", "name": "The Engineer", "time": 1620015000765, "rating": 5.0, "text": "We went to Profit Wise because we weren't very satisfied with our previous accountants. Sharon and her team were extremely professional, friendly, and talented. The process was a walk in the park!\n\nWe sat together and Sharon explained everything to us. She made sure everything made sense before we left too!\n\nTaking care of my and family's taxes was NEVER so easy!\n\nGo ProfitWise!", "pics": null, "resp": {"time": 1625239832652, "text": "Along with overcoming tax issues, we like to help our clients understand them. We are happy you came to us for help!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "112848318806027696985", "name": "Randy Gatlin", "time": 1622726935247, "rating": 5.0, "text": "Fantastic customer service. I was out of the country for several years and had not filed over that time. Between that and moving back and forth overseas, our tax situation was very complicated. Sharon helped us get caught back up and up to date with our tax obligations. Would highly recommend.", "pics": null, "resp": {"time": 1625239758119, "text": "No matter how complicated, we can always find a solution. Thanks, Randy!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "111231867092666905456", "name": "S.W. Unite", "time": 1614637542657, "rating": 5.0, "text": "This is the second year Profit Wise has prepared my personal tax return. Excellent service and friendly atmosphere. This firm is top notch and highly recommended.", "pics": null, "resp": {"time": 1614874758866, "text": "You're making us blush with that glowing review! Thank you!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "104387659308224157408", "name": "Westy's Pet Grooming", "time": 1615312665036, "rating": 5.0, "text": "Sharron, Ashleigh, and I have dealt with at Profit Wise have always been a pleasure to work with. I'm new to business ownership and constantly on the go. They make things simple and easy to manage. So glad I found them!", "pics": null, "resp": {"time": 1625240449937, "text": "You take care of the pets, we'll take care of the paperwork. We are thankful for the oppurtunity to help your business grow!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "109438815683655017992", "name": "Joyce Betts", "time": 1613106316715, "rating": 5.0, "text": "I appreciate the professionalism. Kindness is a quality that attack you to people they displayed that toward me. I would highly recommend this company to others. Thanks", "pics": null, "resp": {"time": 1614190106702, "text": "Thank you for your wonderful review."}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "118376306446036993479", "name": "robert wentz", "time": 1599099148934, "rating": 5.0, "text": "I have been working with Sharon and Ashley since 2018, and they have helped me with Business as well as personal taxes.  I have used other firms for tax and bookkeeping services, but Profit Wise provides the best services in town. They are extremely knowledgeable and just a pleasure to work with. Their staff is freindly and able to work with my busy schedule. I can not thank Profitwise Accounting enough for all they have done for me, and highly recommend them to anyone.", "pics": null, "resp": {"time": 1600108292831, "text": "Mr. Wentz, Thank you so much for the wonderful review.  We enjoy working with you too."}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "107235430057861671635", "name": "James Wheeler", "time": 1619287013409, "rating": 5.0, "text": "Sharon has done a wonderful job taking care of our taxes the last couple of years.  Wish we had used her earlier.", "pics": null, "resp": {"time": 1625240092377, "text": "We are glad you are here now. Thank you, James."}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "117282269437730975837", "name": "B Knox", "time": 1603226959230, "rating": 5.0, "text": "I was very impressed with the professionalism of this office. I went to them to correct a tax problem/error from a previous company. They were able to go through previous returns and show us what was incorrect and they assisted us with getting our returns corrected and we also ending up getting more money back on previous returns. I would definitely use them for my future tax services.", "pics": null, "resp": {"time": 1603832079296, "text": "Thank you for your kind words Mr. Knox. It was a pleasure to serve you and to save you money. We look forward to seeing you again!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "116572094275985617982", "name": "Alex Grimanis", "time": 1615059999178, "rating": 5.0, "text": "Quick and easy process. I highly recommend!", "pics": null, "resp": {"time": 1625240469891, "text": "Thanks, Alex!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "117178885583043092916", "name": "Jessica Dube", "time": 1598457604236, "rating": 5.0, "text": "I’ve been divorced a year. This was my first year to do taxes as my ex always took care of that for us. Sharon was very quick to respond, super friendly and professional. I felt like she gave me good advise. I was super happy with my experience and will use her again.", "pics": null, "resp": {"time": 1598473616650, "text": "Jessica, we enjoyed meeting you and are happy that we could make  your tax experience a positive one. See you next year!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "116490542433210003954", "name": "Joe Webster", "time": 1613493578410, "rating": 5.0, "text": "Sharon, is helping with my accounting issues, so glad I sit down with her and to stay on track with her professional guidance and she got busy ride-away to problem solving , very helpful for my tree business. Thanks Joe Webster", "pics": null, "resp": {"time": 1614190130200, "text": "Thank you for your kind words, Joe!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "114461620904233646735", "name": "Steve Zipfel", "time": 1606939721421, "rating": 5.0, "text": "Sharon and her team have done an excellent job in keeping me on the right track with tax filings and are very knowledgeable and helpful in all areas of growing one's business.", "pics": null, "resp": {"time": 1610464070644, "text": "Thank you Steve! Your kind words are appreciated."}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "103097450340025130735", "name": "Bob Druckman", "time": 1607195389050, "rating": 5.0, "text": "Sharon is very knowledgeable and she has a wonderful team surrounding her. They are consummate professionals.", "pics": null, "resp": {"time": 1610464105871, "text": "Thanks Bob! Those words mean a lot to us."}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "101655857491307732971", "name": "Penny Stevens", "time": 1603218145186, "rating": 5.0, "text": "Profit wise accounting was great to me and my Mother.  Sharon Heinz came in on a Saturday to get my mother's taxes before deadline.  Great customer service!!!", "pics": null, "resp": {"time": 1603831911952, "text": "Thank you Penny! We enjoyed working with with both of you!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "115778852305277142954", "name": "Hunter Lee", "time": 1603215406904, "rating": 5.0, "text": "Highly recommended! Very friendly and easy to work with, they are very good at what they do. Look no further!\nDr Lee", "pics": null, "resp": {"time": 1603831796793, "text": "Dr. Lee,\nThank you for your kind words. We enjoyed working with you!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "117219320139459546660", "name": "Steve Babin", "time": 1586819773501, "rating": 5.0, "text": "Profit Wise has provided me with Tax Preparation Services for the last several years.\nThey have always been Professional, Competent, Thorough and Prompt in all of our dealings. They know the latest information with regard to the Tax Code, and work diligently to make sure my returns are correct.\nUtilizing their service has been a major stress reliever for me...as well as saving me money. I heartily recommend them for all your accounting needs.", "pics": null, "resp": {"time": 1589557728204, "text": "Steve!!  We just love seeing your smiley face here.  Thank you for trusting us with your taxes."}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "110016619866632125434", "name": "Jennifer Gallaher", "time": 1603225913110, "rating": 5.0, "text": "Sharon and her team really have their client's best interest at heart. She takes the time necessary to answer all questions and I trust their knowledge completely.", "pics": null, "resp": {"time": 1603831834519, "text": "Thank you for your kind words Jennifer! So happy that we have earned your trust."}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "116515603894090643085", "name": "Jim M", "time": 1584731968658, "rating": 5.0, "text": "We were extremely happy with Sharon and Profit Wise, the professionalism was so much better than our previous accountant.  Sharon stayed on target for having our 2019 taxes completed and took the time to meet with us and review them.  We loved that Profit Wise had a precise cost list for each form that we needed to have done.  No surprises!  We hope to have many more years working with Sharon and Profit Wise for our business.", "pics": null, "resp": null, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "106340547977474270425", "name": "Gabriel Dambaugh", "time": 1603207598298, "rating": 5.0, "text": "Great responsiveness and quality of support for my business and personal accounting needs.", "pics": null, "resp": {"time": 1625240635336, "text": "We are thankful for the oppurtunity to help grow your business and personal life. Thanks, Gabriel!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "113843633983626036094", "name": "김덕명", "time": 1585087219391, "rating": 5.0, "text": "We have used Profit Wise for our small business for a couple years now. Sharon has been great to work with, and we look forward to the same level of excellence with Jessica.  Front desk staff is so friendly and welcoming (and well-dressed!). Although the cost of services is a little higher than we would like to pay for accounting services, we continue to use them for their services.", "pics": null, "resp": null, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "108760133588117393647", "name": "Mayra Pangborn", "time": 1603288404225, "rating": 5.0, "text": "I have been a Profit Wise customer for several years now.  I had a challenging situation that they helped me overcome.", "pics": null, "resp": {"time": 1610464041995, "text": "Thank you for the positive rating Mayra! We have enjoyed working with you."}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "117353479170335097340", "name": "kenneth walker", "time": 1625099729171, "rating": 5.0, "text": "I have been working with Sharon and Ashley for around 5 years. They have helped me in so many ways, I cant begin to cover them all here. They are extremely knowledgeable and just a pleasure to work with. Their staff is amazing as well. Jessica answered all my questions during the COVID-19 crisis and gave  me the information I needed to make critical decisions for my business. I can not thank Profitwise Accounting enough.", "pics": null, "resp": {"time": 1589557543751, "text": "Thank you Kenneth!  We enjoy working with you and are so happy we can help."}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "101243839984967874644", "name": "Ian Harvey", "time": 1581977289688, "rating": 5.0, "text": "I had a brief (and free!) consultation with Ashleigh, and she put my mind at ease about multiple aspects of my business. If you're starting a small business and want to make sure you're on the right track, grab a consultation slot through their online system. A great experience.", "pics": null, "resp": {"time": 1583271913940, "text": "Thank You Ian, we were happy to help!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "107193714011603540622", "name": "Kelly Griffin", "time": 1618590561348, "rating": 5.0, "text": "Great folks to work with. I can always count on Sharon and her crew to take care of me and to answer my questions quickly.", "pics": null, "resp": {"time": 1589557684374, "text": "Kelly, we are honored to help and happy to have you as a client.  Thank you for the review!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "104389063781519101156", "name": "Chris Day", "time": 1585580376138, "rating": 5.0, "text": "I was given Sharon's information through a friend and my dealings thus far have been phenomenal. Initially for my father, a local buisness owner, she sat down w/ us and went over all his needs and buisness concerns. After which she explained several different options he had and exactly how each one was different and/or beneficial to him. He signed on immediately and walked out of our consult an hour later relieved and I at ease knowing he was in good hands. Sharon and the Profit Wise team have been handling his payroll, taxes, etc for several months now and are extremely happy w/ the results.\n\nAfter seeing how professional and meiticulous she had been, I moved my families personal taxes over to her as well and am extremely pleased.\n\nIf your thinking of hiring a new CPA, finding one for the first time, or just not sure.. I highly recommend a consultation with Sharon before making a decision.\n\nThank you Sharon and Profit Wise for the exceptional service", "pics": null, "resp": {"time": 1589557866512, "text": "We are thrilled to have you and your father's trust.  Thank you for letting us work with your family, we enjoy having you as clients!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "116797010551126489514", "name": "Jason O'Neal", "time": 1579460800452, "rating": 5.0, "text": "Major back tax issue and Sharon and Ashleigh really made me feel confident and comfortable with a plan and procedure to clear up all issues. I’m extremely grateful for their customer service and guidance.", "pics": null, "resp": {"time": 1579536287666, "text": "Thanks for the awesome review, Jason! We work hard to meet expectations like yours, and we’re happy to hear we hit the mark for you. Come back and see us soon. Cheers!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "102934861959970554103", "name": "Manilla Gorilla", "time": 1589207901245, "rating": 5.0, "text": "Great team at Profit Wise, very helpful and knowledgeable, I usually try and do my taxes myself but not anymore.  I'll be back for sure", "pics": null, "resp": {"time": 1589557607101, "text": "Marty, we are so happy that we'll be seeing you on an annual basis!  Thank you for taking the time to review us, we enjoyed working with you."}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "118071813649690414158", "name": "Nathanael B.", "time": 1539797145136, "rating": 5.0, "text": "Sharon provides exceptional services. She advised me on exactly what to do with my business decisions and completed all the paperwork. She will advise you which route is best for your business and let you know of any pros and cons. Excellent service. Honestly, I can’t speak highly enough. Thank you!", "pics": null, "resp": {"time": 1539965927078, "text": "Thank You Nathanael, We enjoy working with you too!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "109493045171236164120", "name": "Elena Allman", "time": 1584394922055, "rating": 5.0, "text": "Sharon provided highly professional and excellent customer service. Thank you!", "pics": null, "resp": null, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "102009882933814133090", "name": "Molly Overton", "time": 1531449346121, "rating": 5.0, "text": "Going to see Sharon was one of my best decisions! I had been worrying and creating the worst image in my head. She put my mind at ease and patiently helped me work through all the details. She is smart and kind, and I ended up in a much better position than I imagined!", "pics": null, "resp": {"time": 1531496140011, "text": "Thank You Molly, We enjoyed working with you and are happy we could help!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "108683628221783782638", "name": "Dawn Warren", "time": 1489184285751, "rating": 5.0, "text": "Sharon is amazing! She is so knowledgeable in all aspects of business and personal accounting and is always a pleasure to work with. She is also very considerate of your time, which is a plus for me trying to manage getting everything together and done in a timely manner. I highly recommend her for any of your accounting needs, big or small.", "pics": null, "resp": null, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "104248126637153268070", "name": "Jeremy Patton", "time": 1551825646723, "rating": 5.0, "text": "Sharon and Ashleigh have been wonderful!  I had a complicated tax issue and they corrected it like it was nothing.  I have been using them ever since with wonderful care and customer service!", "pics": null, "resp": null, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "113898055014541800938", "name": "Kedra Bell", "time": 1470678259107, "rating": 5.0, "text": "Our company has been satisfied with Sharon's service and preciseness from the beginning. She's very detailed and can provide any accounting information you can think of. She's excellent at getting her clients setup on a schedule and it no time you will be running like a well oiled machine.", "pics": null, "resp": null, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "112882810999599315273", "name": "samuel clayton", "time": 1552423843819, "rating": 5.0, "text": "Sharon was very professional and knowledgeable.  Overall great experience and definitely will go back.", "pics": null, "resp": null, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "103823408013843702093", "name": "Leah Holcomb", "time": 1515171454759, "rating": 5.0, "text": "Sharon and Ashleigh are so helpful! They're always available when we need them and are willing and able to explain anything you don't understand. They make the hardest part of owning a business easier!", "pics": null, "resp": {"time": 1515253191739, "text": "The team here at Profit Wise are thrilled to hear such good feedback, and we are so privileged to work with you!  We enjoy helping with your Accounting and Payroll to make you life easier!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "105694863154379157183", "name": "Jeremy Harris", "time": 1489173096644, "rating": 5.0, "text": "Sharon's expertise in online sales was very helpful in assuring that our taxes were filled out properly. She was fast, organized and efficient in completing the filing process and I will be returning to her with all future quarterly and end of year taxes.", "pics": null, "resp": {"time": 1489188117143, "text": "It was a pleasure working with you and your wife!  I look forward to working together in the future!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "109376102152799789717", "name": "Jeremy Sanders", "time": 1458235153561, "rating": 5.0, "text": "Sharon is a very professional and thorough accountant. We absolutely enjoyed working with her for our business taxes.", "pics": null, "resp": null, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "105459151951442201600", "name": "Sharon Heinz Personal", "time": 1483499545099, "rating": 5.0, "text": "QuickBooks - Setup, Monthly Support & Training\nLike most small businesses, I needed help with setting up payroll and QuickBooks support. Sharon came to my office and explained QuickBooks to us and completed the initial setup in a timely manner. I recommend her to other business owners all the time.  If you want your Accounting o be Accurate, Timely and Informative call the team at ProfitWise!", "pics": null, "resp": null, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "109277713939660985631", "name": "Sarah Davis", "time": 1492265181978, "rating": 5.0, "text": "Sharon and her team are quick to respond to questions as well as quick turn around on filing! We have used for past 2 years and will continue to.", "pics": null, "resp": null, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "105835000217546801596", "name": "Charlotte M", "time": 1530893810451, "rating": 5.0, "text": "I made a mistake trying to do my own taxes!  Sharon's help and advice allowed me to sleep at night without IRS nightmares!", "pics": null, "resp": {"time": 1531496170821, "text": "Char, We are glad we could help and look forward to seeing you next year!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "109769231446917988856", "name": "Bryan Hodges", "time": 1625171002178, "rating": 5.0, "text": "The team at Profit Wise Accounting has been great for me. I own two businesses in the Madison County area, and my accounting needs are handled by them. Sharon helped me through some tough tax hurdles that I had incurred from a previous accountant. Not only that, but she also branched out my businesses off the same LLC.\nTwo years later now, my tax woes of the past debacle are in much better shape now. They have done a tremendous job to get me clear and stress free.\nI recommend Sharon, Ashleigh, Jackie, and the rest of this amazing firm to anyone needing their taxes or accounting needs met.\nI AM VERY PLEASED WITH PROFIT WISE.", "pics": null, "resp": {"time": 1625239320792, "text": "Thanks, Bryan! We love helping local business flourish and succeed. We are always here to help!"}, "gmap_id": "0x88626cc519651bff:0xf349c462ef534c91"}
{"user_id": "101061118091306784014", "name": "Monica “Beautiful Moe” Henderson", "time": 1610774625332, "rating": 5.0, "text": "I had a great experience with Christie she  Is people friendly. I was in and out at a good time. And she helped me find a job close to where I reside.  Thank you 😊", "pics": null, "resp": null, "gmap_id": "0x888a3b2f2dcfa2c1:0xe899dd34fe5f94b8"}
{"user_id": "105010504701618292275", "name": "Carol Schantzen", "time": 1593814684479, "rating": 5.0, "text": "Everyone is really nice... They are giving me a chance even tho I have no experience which is awesome", "pics": null, "resp": null, "gmap_id": "0x888a3b2f2dcfa2c1:0xe899dd34fe5f94b8"}
{"user_id": "118197742034802375824", "name": "James Green", "time": 1554502820753, "rating": 1.0, "text": "Do not look for a job here they will cut your first 2 checks for 100 to 150 charge u for stuff most company's give u. They will make it seem like they are the only reason you have that job, like your not good enough to get it without them. U better check your checks when u get them. I worked 6 mos before getting considered for full time they said they were fighting for me but no way they were fighting for 3 months, they didn't do squat for me. Oh also your last check after u get hired on to the company its half what is supposed to be, never was told why.", "pics": null, "resp": null, "gmap_id": "0x888a3b2f2dcfa2c1:0xe899dd34fe5f94b8"}
{"user_id": "108877941698426509670", "name": "Brend Palmer", "time": 1576508696358, "rating": 5.0, "text": "Today was a very good day got a job at Kamtek the office manager and his assistant was very professional and helpful upstanding to my iss. Sam and Greg was very nice and i think i", "pics": null, "resp": null, "gmap_id": "0x888a3b2f2dcfa2c1:0xe899dd34fe5f94b8"}
{"user_id": "113801711577542659698", "name": "Donald Payne", "time": 1523632193975, "rating": 1.0, "text": "They like to keep money out of your checks and claim you didn't work the hours or tell you it's fees. Paid me $20 bucks for a 12 hr shift. You will do better working anywhere else.", "pics": null, "resp": null, "gmap_id": "0x888a3b2f2dcfa2c1:0xe899dd34fe5f94b8"}
{"user_id": "112682918838454489204", "name": "Jason C", "time": 1595011131186, "rating": 1.0, "text": "Took ten days for a drug screen and took two one on July 6 and it’s now the 17 2020 and very unprofessional to leave me unknown then you tell me the person in charge is busy with a interview", "pics": null, "resp": null, "gmap_id": "0x888a3b2f2dcfa2c1:0xe899dd34fe5f94b8"}
{"user_id": "104220156088500189887", "name": "Austin Harden", "time": 1556013470235, "rating": 1.0, "text": "Went for a job did my drug test waited a few minutes they came back an had me do a mouth swab only to tell me I had a positive an wanted me to pay almost 100$ to retake a drug test  I passed a drug test 2 days before at Occupational health an one day after they pick an choose who they give jobs to I don’t not  recommend  my girlfriend got a job at Zla office working two days in two weeks i’d recommend onin staffing in rainbow City they are very nice an work with you they are very professional", "pics": null, "resp": null, "gmap_id": "0x888a3b2f2dcfa2c1:0xe899dd34fe5f94b8"}
{"user_id": "104142162175432242384", "name": "Anonymous_Ryan", "time": 1585933649797, "rating": 1.0, "text": "Whoever answered at front desk was the rudest person I’ve ever spoken to", "pics": null, "resp": null, "gmap_id": "0x888a3b2f2dcfa2c1:0xe899dd34fe5f94b8"}
{"user_id": "104948277211315026723", "name": "Wesley Veal", "time": 1518551681058, "rating": 1.0, "text": "After waiting 3 weeks for a call to go to orientation at a plant zla doesn’t call me and tell me and I miss the orientation.", "pics": null, "resp": null, "gmap_id": "0x888a3b2f2dcfa2c1:0xe899dd34fe5f94b8"}
{"user_id": "103626395788944377355", "name": "Savannah Wooten", "time": 1540348831452, "rating": 1.0, "text": "Unprofessional", "pics": null, "resp": null, "gmap_id": "0x888a3b2f2dcfa2c1:0xe899dd34fe5f94b8"}
{"user_id": "104144948326339389025", "name": "Kelly Sampson", "time": 1509553295659, "rating": 3.0, "text": "Been a bit of confusion because of some bad information I was given in my interview.", "pics": null, "resp": null, "gmap_id": "0x888a3b2f2dcfa2c1:0xe899dd34fe5f94b8"}
{"user_id": "100745614514420823717", "name": "Mary gilbert", "time": 1509466452471, "rating": 1.0, "text": "Worst place ever", "pics": null, "resp": null, "gmap_id": "0x888a3b2f2dcfa2c1:0xe899dd34fe5f94b8"}
{"user_id": "117472790265114566383", "name": "Daniel Ridenour", "time": 1498046237289, "rating": 5.0, "text": "Ok", "pics": null, "resp": null, "gmap_id": "0x888a3b2f2dcfa2c1:0xe899dd34fe5f94b8"}
{"user_id": "104013250244713337940", "name": "Michael Maser", "time": 1490194565343, "rating": 4.0, "text": "Very clean", "pics": null, "resp": null, "gmap_id": "0x888a3b2f2dcfa2c1:0xe899dd34fe5f94b8"}
{"user_id": "106344673356578017312", "name": "ladonna jones", "time": 1613173599483, "rating": 5.0, "text": "Always been friendly and great. I have been going here for years Ms Earlene is awesome. Most all of my co workers also go here. So tax mart is always who I refer people to when they ask me who I use.", "pics": null, "resp": null, "gmap_id": "0x887d4814cd026b27:0xe90f4d78ae60ff71"}
{"user_id": "111273125447895134815", "name": "lps cloudy", "time": 1615318847687, "rating": 5.0, "text": "Joyce has done my taxes for over 25 years and then I married and she still does. I love how we have to go over and check it all before we sign to send off, which cuts down on simple typos and mistakes. This lady worked on my taxes from home being sick or at work. She goes above and beyond and I could not have asked for a better friend! We love you Joyce. Thank you taxmart!", "pics": null, "resp": {"time": 1615327721271, "text": "Thanks ips cloudy for your post and visiting Tax Mart's site. I agree,  Joyce is a seasoned tax professional and an asset to our organization."}, "gmap_id": "0x887d4814cd026b27:0xe90f4d78ae60ff71"}
{"user_id": "106711418637317555496", "name": "Kim Reid", "time": 1611407673216, "rating": 5.0, "text": "You can only do your business thru a drop box. No human contact. They clean drop box after ever person, which I think is good. I use Stacy for years and he is very understanding and helpful. Thanks Stacy and Taxmart", "pics": null, "resp": {"time": 1612830175855, "text": "Thanks Kim,  Tax Mart strives to have a Covid- safe  environment. Thanks for your business."}, "gmap_id": "0x887d4814cd026b27:0xe90f4d78ae60ff71"}
{"user_id": "103759940947054105325", "name": "jackie brown", "time": 1612805655976, "rating": 5.0, "text": "Absolutely love stacy, he's taken care of us for years now.", "pics": null, "resp": {"time": 1612828915105, "text": "I agree Jackie, Stacy is a professional."}, "gmap_id": "0x887d4814cd026b27:0xe90f4d78ae60ff71"}
{"user_id": "106473144445870658150", "name": "Nancy Steadmon", "time": 1581900599059, "rating": 5.0, "text": "Our family go to place for having our taxes done. Alice is awesome, she has been doing ours for years. Friendly quick and efficient. Go in give info and Wala they are done.  The front desk folks are nice and friendly. We love tax mart", "pics": null, "resp": {"time": 1581957504967, "text": "Thanks for your business"}, "gmap_id": "0x887d4814cd026b27:0xe90f4d78ae60ff71"}
{"user_id": "113832256192915439881", "name": "KatrinaC Garcia-Lopez", "time": 1617678230867, "rating": 5.0, "text": "Always awesome!", "pics": null, "resp": null, "gmap_id": "0x887d4814cd026b27:0xe90f4d78ae60ff71"}
{"user_id": "104907948496949106444", "name": "Roland Patterson", "time": 1591984090104, "rating": 1.0, "text": "Hung out to dry!!!\nDon't count on any help from these people. THEY MAKE MISTAKE on my tax return. Caused me to be audited by state. Had ALL RECEIPTS FOR DEDUCTIONS. Now I'm out an extra 2600.00. They say we can't help you. ALL BECAUSE THEY LEFT OFF MY DEDUCTIONS!!!", "pics": null, "resp": {"time": 1594773339570, "text": "Thanks for your reply but with any audit,  state or federal,  proving deductions  when asked is imperative.  Refusing or not complying to provide requested info usually has negative results."}, "gmap_id": "0x887d4814cd026b27:0xe90f4d78ae60ff71"}
{"user_id": "107796830888216185109", "name": "David Jeffreys", "time": 1615834145348, "rating": 5.0, "text": "Stacey is the best!!", "pics": null, "resp": {"time": 1621090974957, "text": "I agree with you David, Stacy does a great job. Tax Mart appreciates your post and your business."}, "gmap_id": "0x887d4814cd026b27:0xe90f4d78ae60ff71"}
{"user_id": "107444577975503422029", "name": "Leah Foster", "time": 1581905239192, "rating": 5.0, "text": "Erlene is the best!", "pics": null, "resp": {"time": 1582039325185, "text": "Thanks for your business Leah"}, "gmap_id": "0x887d4814cd026b27:0xe90f4d78ae60ff71"}
{"user_id": "103157020833574392019", "name": "Regina Gamel", "time": 1294251897807, "rating": 5.0, "text": "Great place been there the past two years and they did a great job ..I highly recommend Tax mart", "pics": null, "resp": {"time": 1612830613256, "text": "Tax Mart Regina, Tax Mart appreciates your business and your recommendation."}, "gmap_id": "0x887d4814cd026b27:0xe90f4d78ae60ff71"}
{"user_id": "115513640510914758321", "name": "Jason Stricklin", "time": 1518114986458, "rating": 5.0, "text": "Love Taxmart! Alice is the best!", "pics": null, "resp": {"time": 1612830335138, "text": "I agree Jason, Alice is one of Tax Mart's experienced preparers. Alice always does a great job."}, "gmap_id": "0x887d4814cd026b27:0xe90f4d78ae60ff71"}
{"user_id": "116925752362484409302", "name": "Anthony Sparks", "time": 1485625729079, "rating": 5.0, "text": "Fast, courteous, and knowledgeable", "pics": null, "resp": {"time": 1612830419213, "text": "I appreciate your kind post Anthony."}, "gmap_id": "0x887d4814cd026b27:0xe90f4d78ae60ff71"}
