{"user_id": "102575898443385233052", "name": "Jim Hennessey", "time": 1615563200969, "rating": 1.0, "text": "Arrived for my appointment, lobby was empty. The woman at the counter shouted across the room that we needed to wait and she would get with us (me and my wife).\n\nShe then shouted across the room about who our insurance carrier was? My wife provided that information and the lobby “boss” we’ll call her because that is the nicest I can describe her attitude.\n\nThe Lobby boss then shouted we don’t accept that, my wife replied “yes, you do” my wife checked before making our appointment. The lobby boss then made us shout our  SSI numbers across the room so she could check. Violation of our privacy.\n\nLobby boss then ordered us to adjust our masks as they did not meet with her approval. Shortly thereafter the “lobby boss” then got into my wife’s personal space and the ordered here to replace her mask as it did not meet with the “lobby boss’s” approval.\n\nAt that point my spouse and  I elected to leave. We were going to have vision checks, buy glasses, purchase contacts and have lenses replaced buy two pairs of glasses. That was conservatively a $1,000.00 bill.\n\nGetting into paying customers personal space, treating them rudely, treating personal private information without care is unacceptable.\n\nAvoid this place at all costs.", "pics": null, "resp": {"time": 1615572728099, "text": "I apologize for your experience in our office.  We strive for excellent customer service.  Thank you for your feedback.  I will address these issues with our staff.  Please feel free to call me 205-949-2020 Tammy G."}, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "108119387158972902061", "name": "Mike Campbell", "time": 1621331459630, "rating": 3.0, "text": "Pros - great doctors and staff, polite and knowledgeable.  Excellent quality glasses (except for cons, see below)\nCons - I'm 61, worn glasses most of my life, and have had various coatings. These coating have never come off, not once.  It's happened with both sets of lenses from Vision First.  Now I just have annoying streaks across my lenses.  Don't know if I can get a pair without the coating because I can never get through to a real person and never a person from the Pell City clinic.  I've left messages but to no avail.  Very disappointed.\nUPDATE Apr 2021 - Went back for an exam and received the same excellent service.  They're just really good.  I also learned that the coating was an anti-glare coating that was coming off.  5 stars for the staff.", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "109754142957604347065", "name": "Sondra Epperson", "time": 1579628727439, "rating": 5.0, "text": "Super easy to make an appointment. Great friendly staff. High tech equipment. Knowledgeable and cost effective. Works with Medicare and most insurance plans.", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "118326678612195774067", "name": "Timothy Fulton", "time": 1558140007426, "rating": 5.0, "text": "It was an amazing experience. Lori is very polite and very thorough she made sure I got the perfect fit for my contacts. Definitely recommend going there", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "115332321543257822988", "name": "Jake Mollus", "time": 1544516205156, "rating": 5.0, "text": "The Doctor and staff are incredible. You can genuinely tell they have your best interest in mind. The staff friendly and helpful. I would highly recommend their office to anybody.", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "111003603472686916090", "name": "Tyler Tidwell", "time": 1548170837321, "rating": 5.0, "text": "I chose this eye center because of the reviews on Google and I'm glad that I did! All of the staff was great and Dr. Clark explained everything to me in a way I could understand it. I highly recommend this facility!", "pics": null, "resp": {"time": 1548174085847, "text": "Thank you for choosing VisionFirst!"}, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "100141199844103596378", "name": "Tina Gann Fuller", "time": 1457992678908, "rating": 5.0, "text": "My husband and I are very pleased after our visit to Dr Clark's in Pell City office.  She and her staff were very professional and friendly.  I always need help picking out new frames and the lady that ordered them was extremely helpful and very patient with me as I probably tried on every pair in the office.", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "103172286497919696286", "name": "John Kiker", "time": 1537472829364, "rating": 1.0, "text": "Treated my daughter in law as if she was a dead beat. ACTUALLY HAD GUTS ENOUGH TO PUT  SCOTCH TAPE ON GLASSES AND SAID IT'LL DO FOR NOW.\nOK ALL BECAUSE MY DAUGHTER IN LAW HAD MEDICAID.......\nAND BY THE WAY........\nIT WAS FOR MY 3 YEAR OLD GRANDAUGHTER....", "pics": null, "resp": {"time": 1538156236413, "text": "Sorry to hear about your experience in the office.  I did try to reach you or the contact that was giving to me but I was unsuccessful the day of your visit to the office.  If we can farther assist you please contact Vu Quang @ 205-949-2020"}, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "112981854608961843456", "name": "Karen Petersen", "time": 1456419867200, "rating": 5.0, "text": "I had an appointment with Dr. Clark for a blocked/infected tear duct & was so nervous that it would require surgery (doesn't look good on YouTube).  Everyone from the nurse to Dr. Clark was so very friendly & they answered all of my crazy questions.  I was reassured I was on the right track with the antibiotics & would not need surgery.  I felt very comforted & taken care of.  Thank you guys so much for the positive experience!\nK. Petersen", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "117697221363373854444", "name": "Joanie Killingsworth", "time": 1456955666231, "rating": 5.0, "text": "My 8 y.o. son and I both saw Dr. Clark in the Pell City office.  Wait time for appt., was 2 days.  Everyone in the office from front desk to Dr. Clark, amazingly friendly and very helpful..\nWe will continue seeing Dr. Clark.", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "100283410438867218743", "name": "Brittany Sullivan", "time": 1466120923223, "rating": 4.0, "text": "First time going there, had to wait over an hour before I was seen but the staff was nice and took care of my vision needs.", "pics": null, "resp": {"time": 1466168007669, "text": "Brittany thank you for the review. We are glad you enjoyed your visit. However, we apologize for the long wait."}, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "113797861282849570283", "name": "Sandy Lawrence", "time": 1458748336935, "rating": 5.0, "text": "Great doctor and staff. They made me feel very much at ease.", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "105709475249706143257", "name": "Randall Cox", "time": 1456446423886, "rating": 5.0, "text": "The doctor  was excellent and I was in and out in a hurry.  The staff was friendly and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "112551397185022632913", "name": "Leanne Etheridge", "time": 1456420334083, "rating": 5.0, "text": "Dr. Clark and her staff were courteous and professional. I would recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "112729659746247947817", "name": "Jo Nell Powell", "time": 1456414106692, "rating": 4.0, "text": "Very friendly and helpful. Plan to return when needed", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
{"user_id": "116613719331489469845", "name": "Sheri Williams", "time": 1456427174458, "rating": 5.0, "text": "The perfect combination of efficiency, expertise,  and caring", "pics": null, "resp": null, "gmap_id": "0x88890dc3b91a8d2b:0x2da8de973ada304b"}
