{"user_id": "107532281106470587621", "name": "Alyssa H", "time": 1537389029006, "rating": 5.0, "text": "The staff and doctors here could not be anymore friendly.  Every phone call and visit has been extremely pleasant and the nurses and doctors are phenomenal.  Would recommend to anyone with heart issues!", "pics": null, "resp": null, "gmap_id": "0x88891beeaea0f51b:0xe713f209d74c18ec"}
{"user_id": "109997698205130266285", "name": "Kate Ferguson", "time": 1502136632709, "rating": 5.0, "text": "Wonderful people! Great front office staff, great nurses and great doctors!!! I'm thankful to say we only had to visit once but I would gladly put my trust in them long term!!", "pics": null, "resp": null, "gmap_id": "0x88891beeaea0f51b:0xe713f209d74c18ec"}
{"user_id": "100588864802410624239", "name": "Tonya Bigham", "time": 1568075126494, "rating": 2.0, "text": "This photo is wrong. Google maps lead us to this building which was incorrect.", "pics": null, "resp": null, "gmap_id": "0x88891beeaea0f51b:0xe713f209d74c18ec"}
{"user_id": "101082200916211015580", "name": "Jeff Schulmerich", "time": 1446505023667, "rating": 5.0, "text": "This is the place to go if your child has heart defects. They are the best there is and you will not find any more skilled in there profession. What a wonderful experience in such a tragic situation.", "pics": null, "resp": null, "gmap_id": "0x88891beeaea0f51b:0xe713f209d74c18ec"}
{"user_id": "110924171617019378330", "name": "Chris Sims", "time": 1497672795787, "rating": 5.0, "text": "The most amazing people you will ever meet work here.", "pics": null, "resp": null, "gmap_id": "0x88891beeaea0f51b:0xe713f209d74c18ec"}
{"user_id": "115140102478956619746", "name": "corey sheaks", "time": 1551932003144, "rating": 5.0, "text": "Great cardiologist! Always spends time with me answering all of my questions. Hate that he is retiring.", "pics": null, "resp": null, "gmap_id": "0x88891bc04ca87801:0xb3024321b76b6de0"}
{"user_id": "115330465310840517644", "name": "Stefanie Liveoak", "time": 1533493494246, "rating": 5.0, "text": "Dr colvin is a awesome doctor he been my doctor for 26 years and he has never let me down I'm sad that he gonna be retiring soon but I just hope the new doctor he has for us will be awesome like him me n my family loves Dr colvin", "pics": null, "resp": null, "gmap_id": "0x88891bc04ca87801:0xb3024321b76b6de0"}
{"user_id": "108032273306879908982", "name": "Jadea James", "time": 1590956467065, "rating": 1.0, "text": "Don't go if you are a single mom you will be treated like it's always a problem and discriminat\nEd against if you get frustrated be aware they will report you do the DHR.i feel as if the staff and Dr had a personal problem with me. No charges were filed on me and she closed the case for not having enough evidence that I was too blame for my childs medical condition when it was all over I had my pediatrician switch us to B-ham Dr.Mcmahon. at UAB he is a good doctor who doesn't jump to conclusions.havent had a problem since and my son is doing well.", "pics": null, "resp": null, "gmap_id": "0x888c2c0797ad2705:0xd21e11eb4374e643"}
{"user_id": "102682906284327108671", "name": "Adam Rushin", "time": 1523467670469, "rating": 2.0, "text": "Asking parents to bring children with an empty stomach and then having them wait an hour+ past their appointment time is ridiculous. On top of that, the lobby has chairs and adult magazines, nothing to occupy small children. They are obviously set up for children that are 5 or older. Finally, everyone you speak to asks the same questions. Do they not talk to each other? Do they not check the charts? The doctor also had no knowledge of our child’s medical history. I guess he didn’t look at the file beforehand.", "pics": null, "resp": null, "gmap_id": "0x888c2c0797ad2705:0xd21e11eb4374e643"}
{"user_id": "105859481932552293897", "name": "Jessie Holmes", "time": 1513342047701, "rating": 5.0, "text": "Staff is always so sweet and considerate of their patients.", "pics": null, "resp": null, "gmap_id": "0x888c2c0797ad2705:0xd21e11eb4374e643"}
