{"user_id": "104404666782463952116", "name": "Royce Karina", "time": 1626650216434, "rating": 5.0, "text": "So I was on a 13 hour road trip going from Florida to Texas, and as one would do during their drive, I couldn’t help but notice my unsightly nails as they were directly in front of me as I steered the steering wheel. I decided that before I check in my hotel, I get my nails done 💅. I checked in and shortly after, I was appointed to Melissa. She treated me very well and listened to what I wanted :) and she did just that. She was very skilled in what she did and my nails look fabulous! I wanted a design on my nails and she asked another nail designer to draw the smiley face. Gel nails are pretty pricey but it was worth the experience and how my nails looked! There are some nail salons that I have been to where the nails are crooked and the polish is not evenly distributed. I am extremely pleased with the service and my nails! If I ever find myself in Mobile, this would be my go to!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNTzpHqzJX5hlwUpnW_QPdNoZZmObYgg9Ju88_6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN2OF4ZAhw9N7LhE67g7YLMGXhfukEEM2uKLkjC=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "104737124795088499958", "name": "Marianna Lyon", "time": 1625071391864, "rating": 5.0, "text": "Very professional, clean, and awesome manicures and pedicures! They have great customer service and you can earn points to get discounts on services the more you come. They stay busy so it’s important to make an appointment but they always have a lot of times available. I recently had a gel pedicure and within a week the color changed (possibly from the sun) and they were more than happy to change the polish for free when I came back a few days later. It’s a little bit more expensive than other places but the customer service and experience is absolutely worth it!", "pics": null, "resp": null, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "109144337472852062479", "name": "Jenna Brown", "time": 1618449397020, "rating": 5.0, "text": "Such a great place to get your nails done. The health rating is 100, and it is so gorgeous inside. The ladies that did our nails were very kind and treated us like royalty. Our manicures and pedicures were very strong.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOV6F8rSpBpfsOKQnv91mCWjPdeC1gowCRcT79F=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "113471594057021845154", "name": "Kaila Hart", "time": 1622323725496, "rating": 5.0, "text": "I LOVE this place! I'm from Indiana on my way to Gulf Shores and needed my nails done. I googled a nail salon on my route and this one popped up. I called two weeks in advance and made an appointment for Mani/pedis and when I tell you this experience was WONDERFUL, I do mean fantastic. Top notch professionalism, kindness and even had a mimosa to pass the time. 100% recommend this place to anyone and everyone!", "pics": null, "resp": null, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "101962172989849326068", "name": "Tearsa Brown", "time": 1623190320621, "rating": 5.0, "text": "I had the best experience here. The technicians are so meticulous, and I did not feel rushed in/out. Do yourself a favor, and make an appointment. Making an appointment ensures you don’t have to wait, and simply adds to the relaxation of your experience. I will most certainly be coming back. I have nothing but positive things to say.", "pics": null, "resp": null, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "115546795216998106909", "name": "kim debose", "time": 1626005339177, "rating": 5.0, "text": "The atmosphere is the best! Amy Le is very sweet and the BEST at what she does!!!! She makes your eyebrows look AMAZING!!!", "pics": null, "resp": null, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "107398516726871035354", "name": "N H", "time": 1614218244888, "rating": 1.0, "text": "This was an incredibly poor experience with customer service.  I stopped in on a very slow Wednesday night as an out-of-towner, returning to New York the next morning.  There was an hour before closing and the salon was mostly empty.  I showed the girl my unpolished/natural nails (aka minimum prep required) and asked about a manicure.  She smirked at me and said they wouldn't see anyone else that evening, despite the sign on the door saying there was still an hour remaining and walk-ins were welcome.  I asked again, explaining that I was going to be flying out the next morning and she just smirked again and said they wouldn't see me and I could leave.  As I left, I noticed that they turned the 'Open' sign off.  I cannot believe this.  Hours posted exist for a reason, and this kind of poor experience in New York would shut a salon down very quickly.  I guess Alabama doesn't have enough high-quality competition, and can support this kind of nonsense from customer-supported dollars.", "pics": null, "resp": {"time": 1614267534897, "text": "Hello, Ms. N H. Unfortunately, you came in after 6:30pm asking for double services. Our receptionist told you that all our nail technicians were already servicing the other customers and would not have gotten to you in time. Every night, we turn off our \"open\" at 6:30pm and you walked in after we had already turned it off. We try our best to take in everyone who walks in, especially if they come in \"an hour\" before we close.\nI am sorry you feel that way and if you decide to give us another chance, please feel free and call to make appointment with us, to secure your spot on the book with us. We do prefer appointments because it gives us the crowd control and social distance between the customers. Thank You."}, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "106110074057887491891", "name": "Johnathan Dennis", "time": 1621974997430, "rating": 5.0, "text": "My first time and I can say I'd do it again! Very relaxing and professional! 👍🏽", "pics": null, "resp": null, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "104916121898332912757", "name": "Karmel Karma", "time": 1614213584491, "rating": 1.0, "text": "I’ve recommended this place to several people.  They list their hours till 7pm.  But DO NOT go there after 5:30 pm.  This is the second time that they rejected customers between 5:30 and 6:15 when they weren’t even busy.  If you list your hours till 7, you plan on taking customers till 7.  Otherwise, put it in your ad that you don’t take customers after 5:30.  An out-of-town guest was dropped off there by a friend going thst way and I was to pick her up at 7 after feeding and bathing her two year old.  They wouldn’t take her  because they said it was too late.  She arrived at 6:05.  She’s now walking the two miles back.   I would never recommend these yo-yos again!", "pics": null, "resp": {"time": 1614266596727, "text": "Hello Ms. Karmel, I am so sorry you feel that way about our hours. Our hours are from 9am-7pm, our cut off time(to stop taking in walk-ins) is at 6:30pm(with one service). We take both walk ins and appointments, but appointments are prefer due to crowd control and social distancing with our COVID-19 precautions. We will and do accept walk ins if we have available nail techs to start on you right away or with a 10-15mins wait gap.\n\nYour friend walk in when all of our technicians were already working on their clients and would not have finished on time to start on your friend, she would have waited over an hour. Every night, we turn off our \"open\" sign at 6:30pm and your friend came in after we had already turned it off. If you decide to give us another chance, we recommend you calling and making an appointment first to guarantee you a spot with our nail technicians. Thank you."}, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "103313453474165336678", "name": "Jacquanda Robinson", "time": 1626379162437, "rating": 5.0, "text": "2nd visit will definitely make a 3rd", "pics": null, "resp": null, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "103408182213281318042", "name": "Patricia Duvall", "time": 1610140974578, "rating": 5.0, "text": "Wonderful....everyone there is very friendly and my nails look \"mar vu lus\".", "pics": null, "resp": null, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "114589524091056779170", "name": "Myteria Stallworth", "time": 1570062357878, "rating": 5.0, "text": "Had a nice first experience, very clean, nice, and professional.  Nick was great!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOYetADZq_bGlSA4a-M3TX9qvtYBx757HPpgMvl=w150-h150-k-no-p"]}], "resp": {"time": 1570126257164, "text": "Thank you Myteria for your visit. We glad you enjoyed your experience. See you again."}, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "106785563258448296557", "name": "TB GB", "time": 1598064640831, "rating": 5.0, "text": "Amy is super professional and she has a calming spirit. My Eyebrows look Fantastic! I opted for the second visit to get a touch up! It sealed the deal!", "pics": null, "resp": null, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "108237462218581279458", "name": "Tiffany Michelle", "time": 1607392189204, "rating": 5.0, "text": "Excellent service! Grace is my favorite person ever!", "pics": null, "resp": {"time": 1607880671672, "text": "Thank you very much Tiffany!"}, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "114524042813841373992", "name": "Myra Johnson", "time": 1565562113146, "rating": 5.0, "text": "The salon is amazing. Melissa always does a fabulous job on my nails. You can see in her work that she is very passionate about what she does. I had a chance to meet Amy. I absolutely love her! I have never had individual lashes done....well let me just say, “I’m addicted”! She did an amazing job. They look so natural. She was professional and very informative when explaining my options. 😊", "pics": null, "resp": {"time": 1565578838519, "text": "Thank you so much Myra for your experience. We glad yo enjoyed your visit!"}, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "111811314426752210037", "name": "LINDA DELLER", "time": 1593111018688, "rating": 3.0, "text": "It was clean and very friendly, my tech was super nice. She told me she's been doing this for 4 yrs. I am not sure by my nails it was accurate.  They got me through a few weeks, but honestly this place was pricey for what I got.", "pics": null, "resp": null, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "103186507250273270407", "name": "Virginia Burke", "time": 1558385538057, "rating": 5.0, "text": "Very pleased!! Great customer service and amazing experience. My nail tech did an incredible job and my toenails are very happy now! She helped fix a mistake another nail salon made on my nails and made them look so nice!! Definitely coming back here and would recommend this place to anyone :)", "pics": null, "resp": {"time": 1559706287489, "text": "Thank you very much!"}, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "110385262733407624171", "name": "janet rucker", "time": 1599096198866, "rating": 5.0, "text": "Always the most attentive pedicure technicians. LINDA and Ashley N are favs.", "pics": null, "resp": null, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "109796369445854215823", "name": "Jamie Bosarge", "time": 1561229247411, "rating": 5.0, "text": "Beautiful new lounge with great atmosphere. Love this place and all of the staff. I go here for nail services, pedicures, facials, waxing and lash tint. I highly recommend for all. Also, Amy is bomb on brows!", "pics": null, "resp": {"time": 1561335315378, "text": "Thank you for your kind words Jamie. We love you as our client as well!"}, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "111524154914538609854", "name": "Kanietrice Whitfield", "time": 1564568136701, "rating": 5.0, "text": "I came in to get me and the brides nails done. We were greeted by a cheerful receptionist. We were seated right away, offered beverages and enjoyed our time there. The technicians delivered exactly what we asked for. 👍🏽", "pics": null, "resp": {"time": 1564589794638, "text": "Thank you Kanieytrice and we glad you enjoyed your visit!"}, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "111736020671743965097", "name": "Googl User", "time": 1558569301795, "rating": 5.0, "text": "Best salon around! Went in to have SNS done. Skyler done a fantastic job! The best set of nails I’ve had. Not to mention the atmosphere is so relaxing and everyone around has a positive attitude. My new go to! Thanks Charm Nail Lounge for a relaxing and refreshing experience!", "pics": null, "resp": {"time": 1559706268141, "text": "Thank you very much!"}, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "114066694030746172796", "name": "Melissa Harris", "time": 1575031819323, "rating": 5.0, "text": "At Charm it’s truly an amazing experience I never have to wait. They are very professional and polite. Keep up the good work!", "pics": null, "resp": {"time": 1575327125310, "text": "Thank you very much Melissa. We glad you enjoyed your visit. Have a wonderful day!"}, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "100124633771001873055", "name": "Chill Pill", "time": 1554382743487, "rating": 5.0, "text": "From the greeting at the door to the walk out the door was warm.  The setting & music was very relaxing.  Amy did an amazing job on my eyelash extensions as well as my brows.  She also educated me on how to care for them.  I was so comfortable i've already scheduled to go back in two weeks for a touch up.", "pics": null, "resp": null, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "105348411208297464604", "name": "Claudia Sweger", "time": 1619708813161, "rating": 5.0, "text": "Amazing service!", "pics": null, "resp": null, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "107687969517518744642", "name": "Melinda Banner", "time": 1597103505624, "rating": 5.0, "text": "Amazing even though I came a bit late in the evening I got an amazing pedi from Linda she made me feel like i was her only priority and took her time and got rid of some pesky ingrown nail i am just traveling through but I was made to feel like family", "pics": null, "resp": null, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "112811536678419025678", "name": "Devin Clarke", "time": 1576877376978, "rating": 5.0, "text": "Fantastic service. I have never waited longer than 5 minutes and they do a great job. Very nice and clean!", "pics": null, "resp": null, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "107988006820400308488", "name": "Terri Carmack", "time": 1573680844482, "rating": 5.0, "text": "Came in on a Wednesday early afternoon. Haleigh was my technician. It was slow at this time so I was seated right away. Had SNS with a chrome finish. It only took an hour to complete.  The atmosphere and decor is very nice. I’m probably going to make this salon my. GoTo. Thanks y’all, I’m  happy!", "pics": null, "resp": {"time": 1573772141210, "text": "Thank you very much Mrs. Terri. We glad you enjoyed your visit and we'll see you next time. Have a wonderful day!"}, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "103214780218897043946", "name": "Nicole Brown", "time": 1561836790547, "rating": 5.0, "text": "Nick ALWAYS does an exceptional job! My nails are never anything short of perfect. His attention to detail is something to be sought after. I’m a forever customer of Charm Nail Lounge.", "pics": null, "resp": {"time": 1562468289453, "text": "Thank you very much Nicole for your kind words! Our pleasure to have you and your support!"}, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "106282144849842968350", "name": "Keeta's Kreative Korner", "time": 1578254422119, "rating": 5.0, "text": "Professional atmosphere and nails always coming out just like I want! Recommends this place to anyone who is looking for great experience.", "pics": null, "resp": {"time": 1578837182461, "text": "Thank you very much Keeta!"}, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "105078277262605681162", "name": "Rosalinda Gunderson", "time": 1604685699551, "rating": 5.0, "text": "Love the food great service and the food is magically delicious", "pics": null, "resp": null, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "101400918954203616699", "name": "Nancy H", "time": 1555035327831, "rating": 5.0, "text": "Amy did an amazing job on my individual lashes. Would highly recommend her. She made sure I was comfortable during the entire process. I even fell asleep. 😊", "pics": null, "resp": null, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "113546523021354661463", "name": "Bo'Keshia Dickinson", "time": 1574076767119, "rating": 3.0, "text": "Their foot massages are the bomb, but I've gone to other nail salons that have done my nails way better...", "pics": null, "resp": {"time": 1574101280168, "text": "Hi Mrs.Dickinson, thank for you feedback. Thank you for the great pedicure experience, however on your nails, you only got it soaked off and regular polish. I wonder what we could have done better to your nails for your to justify the rating? Thank you"}, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "111537596234886151674", "name": "Shanda Lyons", "time": 1583367558717, "rating": 5.0, "text": "Salon/spa feel.  More than just nail salon.", "pics": null, "resp": null, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "106292661039674254818", "name": "Miranda Connelly", "time": 1560700497507, "rating": 5.0, "text": "this place is so nicely decorated and i loved all the color options! i got the sns nails and the technician anna did them so nicely! it was a very quick wait and the ladies there are so nice. i will definitely be coming back soon!", "pics": null, "resp": {"time": 1560785130795, "text": "Thank you very much Miranda for your kind words! Have a great day!"}, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "101621798584877357626", "name": "Anitra Daffin", "time": 1569977306135, "rating": 5.0, "text": "I looooove this place. Tori their receptionist always greets you with a smile. The ambiance, the atmosphere, the customer service by far the best. Shariece pedicures are like little pieces of heaven. The best leg and foot massages ever. Ashleys ombre' nails are wonderful. A midtown hidden jewel. They have a smorgasbord of beautiful tones and color  selections lined up beautifully to greet you when you walk in. Thanks Nick. Thanks Amy.😉", "pics": null, "resp": {"time": 1575327179866, "text": "Thank you very much Mrs.Anitra!"}, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "112026404038005953502", "name": "Trudy Gage", "time": 1597185591482, "rating": 4.0, "text": "Very nice atmosphere and friendly staff.", "pics": null, "resp": null, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "115988847562636462008", "name": "Barbara C", "time": 1565091605728, "rating": 5.0, "text": "Best walk in place to get your nails done. Everyone is very nice.", "pics": null, "resp": {"time": 1565095586051, "text": "Thank you very much Barbara! We glad you enjoyed your visit. We’ll see you next time and have a wonderful day!"}, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "103704948077043701965", "name": "Veronica Banks", "time": 1559646248469, "rating": 5.0, "text": "Always pleasant staff and service...Sharie & Roth excellent customer service very friendly and professional.", "pics": null, "resp": {"time": 1559706223391, "text": "Thank you very much Veronica!"}, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "110656805487734443610", "name": "Nicole LeDe", "time": 1609093592097, "rating": 5.0, "text": "Wouldn't go any other place!!", "pics": null, "resp": null, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "106435090699370075839", "name": "Wendy James", "time": 1577407036104, "rating": 5.0, "text": "Great staff. Great nail products.", "pics": null, "resp": {"time": 1578837212727, "text": "Thank you very much Wendy!"}, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "101218273529953712476", "name": "Lee Lee", "time": 1619755373569, "rating": 5.0, "text": "Awesome", "pics": null, "resp": null, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "113717139856570907466", "name": "Tamara Perry", "time": 1557270260200, "rating": 5.0, "text": "New convenient place for beauty! Highly impressed and will be back.", "pics": null, "resp": null, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "113513653401919072948", "name": "susan sewell", "time": 1558146668016, "rating": 5.0, "text": "The space is amazing, and so are the people.i’ve found My new place.", "pics": null, "resp": {"time": 1558334615275, "text": "Thank you Susan for your kind words!"}, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "104132845278095713480", "name": "Simone Santibanez", "time": 1572993038948, "rating": 5.0, "text": "The salon is bright and new and the staff is very attentive", "pics": null, "resp": {"time": 1573772191704, "text": "Thank you Simone. We glad you enjoyed your visit. See you next time!"}, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "102143641374363301427", "name": "Brenda Nettles", "time": 1606347854545, "rating": 5.0, "text": "👍", "pics": null, "resp": null, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "116706512616054078802", "name": "Daphne Walters", "time": 1559312635695, "rating": 5.0, "text": "Incredible place!  I will definitely be back!!", "pics": null, "resp": {"time": 1559706240789, "text": "Thank you very much Daphne!"}, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "115181898424147444468", "name": "Laura Durgin", "time": 1568301396151, "rating": 5.0, "text": "Customer service and quality of work is  OUTSTANDING!", "pics": null, "resp": {"time": 1568405962793, "text": "Thank you very much Laura for your experienced! See you again and  Have a wonderful day!"}, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "106507993491222291239", "name": "Chelsea F", "time": 1558218522798, "rating": 1.0, "text": "Very understaffed on a Saturday. We waited an hour and still had not been received services.", "pics": null, "resp": {"time": 1558334485914, "text": "Hi Chelsea, our apologies for your long waiting for to be serviced as we tried our best to get to all the customers as fast as we could. However we were very busy with our appointments and could not get to you in a timely manner. If i'm not mistaken, our receptionist did mentioned to you that it would be going to be a bit of a wait? Furthermore, we couldn't rushed through our client because that is not the ideal of our business. Yes, we were understaffed because 3 of our team members were off due to personal reasons. As for a new business, it does takes time to nurture and slowly build up the team to its solid ground. We would love to have a lot more staffs, however we can't just randomly hired anybody, especially with our personal services business. If you happen to give us another try, feel free to book an appointment so that your time and service will be reserved.  Again, sorry for your experienced."}, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "103672645822480202636", "name": "Brenda Nettles", "time": 1626776531742, "rating": 5.0, "text": "Service is great!", "pics": null, "resp": null, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "114439820225497470435", "name": "Dianne Motes", "time": 1575319345256, "rating": 5.0, "text": "Skylar is the best!", "pics": null, "resp": {"time": 1575327070922, "text": "Thank you very I hope Mrs. Dianne!"}, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "110680388809445210746", "name": "Southern brwn suga", "time": 1572033656210, "rating": 5.0, "text": "Great place!", "pics": null, "resp": {"time": 1573772224418, "text": "Thank you very much. Have a wonderful day!"}, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "114359955851367938088", "name": "Tiffany Briggs", "time": 1595162002192, "rating": 5.0, "text": "Love it", "pics": null, "resp": null, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "115662999872620372918", "name": "Suzanne Coleman", "time": 1567717563330, "rating": 5.0, "text": "Lovely, new place", "pics": null, "resp": null, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "104668876009004721139", "name": "roxane lucas", "time": 1584587178811, "rating": 5.0, "text": "Awesome nail Lounge!!!!❤❤❤❤", "pics": null, "resp": null, "gmap_id": "0x889a4d1fc3b8d531:0xdce818773131b120"}
{"user_id": "109281055258218349184", "name": "Jirah Moon", "time": 1622956262038, "rating": 5.0, "text": "Briggitte does my hair and she always does an amazing job. I know all the other girls that work there do as well. The shop is always so clean and smells good. Everybody is pretty friendly even if you're not their client.", "pics": null, "resp": null, "gmap_id": "0x8889cbca9e417631:0xeb2c490f7b214371"}
{"user_id": "109882803663594735407", "name": "Michael Townson", "time": 1572115761062, "rating": 5.0, "text": "Bridget did very well on my 6 yr old daughter!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPa3eePY8ZY1Wvc_kAhp8_0xi5S6ENzaXYGmy2B=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNl1vozEcJJitK5THKuiwI2_-IUcftnknUa-sS3=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNETI-o94i-l_PAbMX4nsF9l4q18ikz2nljZoGp=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889cbca9e417631:0xeb2c490f7b214371"}
{"user_id": "104593624072083890128", "name": "Ataya Vandiver", "time": 1617492142021, "rating": 1.0, "text": "The woman that done my eyebrows didn't do a good job. I was a walk in.", "pics": null, "resp": {"time": 1617490428409, "text": "I’m sorry. Who was the woman that did your brows? We don’t have anyone on our schedule with your name."}, "gmap_id": "0x8889cbca9e417631:0xeb2c490f7b214371"}
{"user_id": "103051474905779985279", "name": "Carolyn Denton", "time": 1557282567170, "rating": 5.0, "text": "She was very nice the beauty shop was very pretty and clean and they offer everything from your nails to pedicure to a spa and face things if it really a nice day at a place to spend the day so and she's really I love my haircut did I just loved it she was really good thank you", "pics": null, "resp": null, "gmap_id": "0x8889cbca9e417631:0xeb2c490f7b214371"}
{"user_id": "108545806718892733964", "name": "Amy Hancock", "time": 1507234266064, "rating": 5.0, "text": "This was one of the most relaxing massages I have ever had. Definitely recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x8889cbca9e417631:0xeb2c490f7b214371"}
{"user_id": "104332589462526911246", "name": "Karin Snoddy", "time": 1541152286564, "rating": 5.0, "text": "Good work, a nice little place to get ur hair done close to home", "pics": null, "resp": null, "gmap_id": "0x8889cbca9e417631:0xeb2c490f7b214371"}
{"user_id": "113315368090970141905", "name": "Molly Shelton", "time": 1474739035512, "rating": 5.0, "text": "Love, love, love this place!! Great service and friendly faces. Ladies are super sweet and always make sure you are taken care of and happy!!", "pics": null, "resp": null, "gmap_id": "0x8889cbca9e417631:0xeb2c490f7b214371"}
{"user_id": "101646480332796603390", "name": "Tisha Marie", "time": 1532048285708, "rating": 5.0, "text": "Very good nail salon I recommend!!", "pics": null, "resp": null, "gmap_id": "0x8889cbca9e417631:0xeb2c490f7b214371"}
{"user_id": "116245438156791009912", "name": "Tresslan Patterson", "time": 1601055591950, "rating": 1.0, "text": "This business is closed. I don’t know why they still have their business pages up.", "pics": null, "resp": null, "gmap_id": "0x88890ce25baa8193:0x6e8da999a4028f52"}
{"user_id": "101305229388203089790", "name": "Chastity Fuller", "time": 1595529540118, "rating": 5.0, "text": "I would definitely recommend very honest,dependable&informative!\nBest in Birmingham!!!Thanks again,\nChastity Fuller", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPMWVtTnJWNHbJYaE-g2Lml4_wQeN0gDBKTHJRR=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88890ce25baa8193:0x6e8da999a4028f52"}
{"user_id": "112469849712822407356", "name": "Gaynor Luce", "time": 1551207867691, "rating": 5.0, "text": "Thorough and explains everything! Clean and cozy studio. She is conservative in her style and good at choosing natural colors. I would recommend her to a friend.", "pics": null, "resp": null, "gmap_id": "0x88890ce25baa8193:0x6e8da999a4028f52"}
{"user_id": "117943259996394741035", "name": "Deborah Phillips", "time": 1542241474385, "rating": 5.0, "text": "Had my eyebrows done previously and went back today for upper and lower eyeliner.  That speaks for itself I think.  Ranay is amazing and takes the time to explain why she does the procedures the way she does.   I love her personality and feel very comfortable asking questions or making suggestions.  I will never go to anyone else!", "pics": null, "resp": null, "gmap_id": "0x88890ce25baa8193:0x6e8da999a4028f52"}
{"user_id": "105620498058927530269", "name": "Debra Gayle", "time": 1538689917378, "rating": 5.0, "text": "Forever LaBelle was the perfect place for me to have my eyebrows tattooed. I had researched other places but nothing could have compared. The atmosphere made you feel at ease. Renay made me feel very comfortable. She is very professional and very honest. She explains everything very well. She takes her time with the procedure and is very concerned in wanting you to be satisfied. I am happy with my results and would highly recommend her. She is such a sweet girl!!", "pics": null, "resp": null, "gmap_id": "0x88890ce25baa8193:0x6e8da999a4028f52"}
{"user_id": "105901077927964366831", "name": "kristie self", "time": 1550847280506, "rating": 5.0, "text": "Renay is the best. She is professional and meticulous. She explains everything and gets your input each step of the way. I wouldn’t go to anyone else. If you want the best you have to see her.", "pics": null, "resp": null, "gmap_id": "0x88890ce25baa8193:0x6e8da999a4028f52"}
{"user_id": "105584044003759488711", "name": "Blair Plunkett", "time": 1528142101959, "rating": 5.0, "text": "Rest assured you will be in good hands with this one! I've always been skeptical of permanent cosmetics. But after talking with Renay she answered every question, gave her HONEST opinion on all my concerns and helped me decide what treatment option would be best for me. I've never wanted to walk around looking like I've got full blown perfect makeup but having thin light lashes make me look so washed out without anything on. I told her I wanted my eyes to pop without having tons of makeup on - but also wanted to be semi modest. She did an AMAZING job with a very thin eyeliner line on my top lashes She called it a \"lash enhancement\" and I LOVE it! Was I scared? Um, heck yea wouldn't you be with someone coming at your eyeball with 8 little needles? Ha! I'll never go to anyone else - not that I ever have but this woman knows her stuff and she's passionate about what she does. You can tell from the second you meet her. NEAT, CLEAN, HONEST and PROFESSIONAL. Thank you Renay!", "pics": null, "resp": null, "gmap_id": "0x88890ce25baa8193:0x6e8da999a4028f52"}
{"user_id": "115584639769279176592", "name": "Maria Mossor", "time": 1558571290509, "rating": 1.0, "text": "I have no experience to review. I have left phone messages and filled out an appointment request online and nobody has reached out to me. I even went to the shop but it was not open. Is this salon out of business?\nI’m so disappointed.", "pics": null, "resp": null, "gmap_id": "0x88890ce25baa8193:0x6e8da999a4028f52"}
{"user_id": "118140281436806968056", "name": "Rhonda Owens", "time": 1499822952962, "rating": 5.0, "text": "Renay is a true professional. She is not the first permanent cosmetician I have been to but she is the best!  She makes sure everything is perfect and exactly what you want!  I couldn't be happier with my new eyebrows!!", "pics": null, "resp": null, "gmap_id": "0x88890ce25baa8193:0x6e8da999a4028f52"}
{"user_id": "114867721050906374415", "name": "Roberta Hill", "time": 1536793196284, "rating": 5.0, "text": "I finally got my permanent eyebrows after years of debating with myself.  I love my eyebrows.  If you are reading this review then you are trying to decide on permanent makeup or not.  For a truly talented, professional makeup artist look no further than Renay Nix.  I can not say enough good things about Renay.  She is neat, clean, talented and truly a professional.  A very gifted and highly skilled makeup artist.  She is awesome and knows permanent makeup inside and out.  We talked at length of what I wanted and we worked together to achieve an outcome I am thrilled with. She is enthusiastic about and loves what she does and she is very good at it.  I would and do recommend Renay very highly and would not hesitate to use her again and again.  Did I mention I love my eyebrows!!!!", "pics": null, "resp": null, "gmap_id": "0x88890ce25baa8193:0x6e8da999a4028f52"}
{"user_id": "106013558566164483577", "name": "William Graves", "time": 1536513341807, "rating": 5.0, "text": "My wife and I moved here a year ago from California. She had the semi-permanent eyebrows done there. She searched and searched and found Renay. Renay educated her on permanent eyebrows vs. semi permanent and answered all her questions. I know this because she was so excited....and so was I after the 1st appointment. They looked amazing!  I just wanted to write a review and say as a husband I love my wife's eyebrows! Every time she has went she comes back talking about all the fun she had with Renay. You wont be disappointed! She even fixed some areas my wife didn't like done by previous artist!", "pics": null, "resp": null, "gmap_id": "0x88890ce25baa8193:0x6e8da999a4028f52"}
{"user_id": "109700306211987163052", "name": "Yvonne Harris", "time": 1520262750250, "rating": 5.0, "text": "Renae was over the top ,she made me feel comfortable and relaxed an Everybody love my eyes can’t wait tell she’s completely finished.", "pics": null, "resp": null, "gmap_id": "0x88890ce25baa8193:0x6e8da999a4028f52"}
{"user_id": "110637073571804564137", "name": "Chaille Stowe", "time": 1461781195599, "rating": 5.0, "text": "What a professional office! Very neat and clean. Renay really takes pride in her work and it shows. She cares about each and every client that walks through her doors and works to make all of their expectations a reality. I definitely recommend her office to anyone looking for permanent makeup, clinical needling or areolar tattooing reconstruction.", "pics": null, "resp": null, "gmap_id": "0x88890ce25baa8193:0x6e8da999a4028f52"}
{"user_id": "103443986076612538236", "name": "Andrea Reeves", "time": 1516893098282, "rating": 5.0, "text": "I have penciled in my eyebrows since I was 13/14 years old because they were so blond you couldn't see them. I have wanted for years to have them done permanently but was always afraid that someone would not do them right and mess me up -perminatly. So I did my research and found Forever La Belle, I read all the reviews and looked at people's pictures and thought, I am going to take this big step and do this! When I spoke with Renee, she made me feel so at ease. She was so imformative and her professional advise was spot on. She made sure I was ok with every step and tweek along the way. Renee is an amazing artist and her skill level is outstanding. I have never had this much confidence in my appearance. No more being self conscious about going swimming and my eyebrows washing off. Thank you Renee for making me comfortable in my on skin. You are amazing and you truely care for your clients!!!", "pics": null, "resp": null, "gmap_id": "0x88890ce25baa8193:0x6e8da999a4028f52"}
{"user_id": "115737564348192142577", "name": "Tanya Stewart", "time": 1618971372037, "rating": 5.0, "text": "I’m 40 years old and was definitely looking rough. I had micro needling done at a place that apparently did not know what they were doing so I decided to get a consultation for Aquagold at SkinRx. I cannot give enough stars to Dr. Frankel and his wife Clair. Their professionalism was top notch and he was able to notice things with my skin that I hadn’t really paid attention to.  My dark circles and skin tone and texture were my biggest concern and he was able to transform my skin into something that I didn’t believe was possible. They both talked to me the whole time and their ability to make you as comfortable as possible was spot on. I will definitely be going back to them. My skin had never looked this good!!", "pics": null, "resp": {"time": 1618989369474, "text": "Thank so so much for the glowing review Tanya! Dr Frankel and I had such a great time with you too day, and we look forward to seeing you again soon!"}, "gmap_id": "0x88628a56e3037319:0x5febf95eaf7cd16d"}
{"user_id": "113453249742239708529", "name": "B", "time": 1622946316686, "rating": 5.0, "text": "Nice, friendly people. Great experience. We will be back.", "pics": null, "resp": null, "gmap_id": "0x88628a56e3037319:0x5febf95eaf7cd16d"}
{"user_id": "114615294733832676017", "name": "Darneshia Scott", "time": 1612480313523, "rating": 5.0, "text": "This experience was EVERYTHING! Claudia treated me like royalty! She was extremely knowledgeable! She was very thorough with my facial! Definitely will be returning!", "pics": null, "resp": {"time": 1612484517074, "text": "Thank you so much Darneshia! It was so lovely getting to see you and your sister today 💕 we look forward to seeing you again soon!"}, "gmap_id": "0x88628a56e3037319:0x5febf95eaf7cd16d"}
{"user_id": "113691278811700544177", "name": "Cindy Neeley", "time": 1603132730915, "rating": 5.0, "text": "Skin RX is beautiful, safe and comfortable. Very, very clean.  My experience was amazing!  The staff and owner are friendly with great hospitality!  My results were beyond my expectations!  Do yourself a favor and pamper yourself soon. Get your skin ready for the holidays!", "pics": null, "resp": {"time": 1609876408628, "text": "Thank you so much Cindy for your kind words and thoughtful feedback! We look forward to seeing you soon!"}, "gmap_id": "0x88628a56e3037319:0x5febf95eaf7cd16d"}
{"user_id": "110661712412951563978", "name": "Savie S", "time": 1618701092946, "rating": 1.0, "text": "Normally I would rate this place 5 stars but I feel like I was majorly ripped off earlier this week on an IPL facial. Let me explain, I’ve been coming into this place to get full-face IPL treatments done for about a year. I’ve had three total treatments done in the span of a year. The first two treatments cost me $150. The second time I came in my specialist informed me that the prices will raise to $200 per IPL session. No problem for me, well... I came in earlier this week to get only CHEEKS and CHIN done and she charged me $350$!!! NO ONE informed me it would be that high! Last time I came in I was told $200. $350 for a partial face treatment is absolutely insane price. I’ve been getting these treatments done all over the country and I’ve NEVER had anyone charge me that much for a partial face IPL. Honestly, she should have told me before the treatment that it would be that much! I’ve seen her three times. I didn’t want to make a big deal about it by the time she charged me because I didn’t want to cause a scene but I’m honestly very unhappy with the lack of communication from this business. And what a shame because I really liked this place. ):", "pics": null, "resp": {"time": 1618703875244, "text": "Hi Savie. We informed you at your last IPL appointment there was a price increase expected. Prior to your next appointment, a year or so later, we left 2 voicemails to be sure you were prepared for the new pricing. I do hope you can find happiness & safe and effective IPL treatments within your budget range somewhere else."}, "gmap_id": "0x88628a56e3037319:0x5febf95eaf7cd16d"}
{"user_id": "115515362940350048184", "name": "Derick and Becky Honore", "time": 1603131946402, "rating": 5.0, "text": "I had a facial done by Kaylee. It felt amazing. She was super friendly, knew what she was doing, and attentive to my needs. My face felt so refreshed when I left. I would definitely recommend! ❤️", "pics": null, "resp": {"time": 1609877305171, "text": "Thank you so much for your thoughtful feedback!"}, "gmap_id": "0x88628a56e3037319:0x5febf95eaf7cd16d"}
{"user_id": "106206098651739098005", "name": "Margo Freeman", "time": 1609769915602, "rating": 1.0, "text": "DO NOT WASTE YOUR MONEY!  I went to Skin Rx in Madison because the doctor I usually use was going to be out after having surgery.  The girl at the front desk was terribly rude!  Very unprofessional.  Even went as far as to ask me HOW I got an appointment with them...she was the one who made the appointment when I called!!   I was charged $420.00\nFor Botox and since receiving,  four days later, there are absolutely ZERO signs that I ever got Botox!!!\nI have been doing Botox for 10 years...when my regular doctor does it, I see the results the next day!!!\nAgain...don’t waste your money here!  One star is too much!!", "pics": null, "resp": {"time": 1609876186891, "text": "Hi Margo. I'm so sorry you did not enjoy your experience at SkinRx. I am the owner of SkinRx, Clair Frankel, and I was the 'girl' at the front desk when you arrived. As with every client who enters our doors, I did try my best to be warm, welcoming and make you feel comfortable. I'm so sorry you did not feel the same and I wish you all the best in your aesthetic pursuits. Botox may take 7 to 10 days to be fully effective."}, "gmap_id": "0x88628a56e3037319:0x5febf95eaf7cd16d"}
{"user_id": "111625380735994553363", "name": "Bless Stonecypher", "time": 1614118373887, "rating": 5.0, "text": "Great place clean and friendly stuff...highly recommended", "pics": null, "resp": {"time": 1614122878124, "text": "Thank you so much Bless! We look forward to seeing you again soon"}, "gmap_id": "0x88628a56e3037319:0x5febf95eaf7cd16d"}
{"user_id": "101851553993115688786", "name": "ninoetz", "time": 1603298979209, "rating": 5.0, "text": "This is a beautiful, peaceful facility with a Modern design and awesome services! I loved the atmosphere!", "pics": null, "resp": {"time": 1609876482257, "text": "Thank you beautiful! We appreciate your patronage and your lovely review!"}, "gmap_id": "0x88628a56e3037319:0x5febf95eaf7cd16d"}
{"user_id": "100811404276086458720", "name": "Annette Joplin", "time": 1569332927408, "rating": 5.0, "text": "I got the gold special facial, Tiana was awesome. She has a great touch, along with being very skilled in her craft, she can explain your procedure and make recommendations for a skin regimen for you to follow. This place is gorgeous and just makes you feel relaxed from the moment you are greeted.  Loved my experience and will be back. Thanks Jessica for making the referral. Clair, you have an amazing place! Great job!  As for the one star review: Are you sure you went HERE??? Because they are so accommodating, I can not believe that statement.", "pics": null, "resp": {"time": 1570662683235, "text": "Thank you Annette! You are an absolute joy!"}, "gmap_id": "0x88628a56e3037319:0x5febf95eaf7cd16d"}
{"user_id": "105491028919935926748", "name": "Jessica J", "time": 1564254699296, "rating": 5.0, "text": "I completely disagree with the 1 star rating comments. SkinRx staff is very accommodating and very attentive. I’ve had several treatments and have been happy with all of them. Sometimes people have to be realistic on results of treatment. Sometimes ugly people on the inside reflects on the outside no matter what treatments you have.", "pics": null, "resp": {"time": 1564257039369, "text": "Thank you so much Jessica! It is always delightful to see!"}, "gmap_id": "0x88628a56e3037319:0x5febf95eaf7cd16d"}
{"user_id": "105774855932180461334", "name": "Emilie Cass", "time": 1603160344287, "rating": 5.0, "text": "Knowledgeable and friendly staff. Very clean.", "pics": null, "resp": {"time": 1609876432959, "text": "Thank you so much Emille!"}, "gmap_id": "0x88628a56e3037319:0x5febf95eaf7cd16d"}
{"user_id": "108523350234010296086", "name": "Emily Imus", "time": 1582410567459, "rating": 5.0, "text": "I cannot speak highly enough about SkinRx. The spa itself is BEAUTIFUL and the head esthetician, Leslie, is a godsend. I'm currently getting laser removal and Leslie was so kind and informative though the whole process. I'm actually excited about getting furthur treatments and trying their other services! Highly recommend!", "pics": null, "resp": {"time": 1582414343248, "text": "Thank you so very much Emily!"}, "gmap_id": "0x88628a56e3037319:0x5febf95eaf7cd16d"}
{"user_id": "108770722247102227601", "name": "Riley S", "time": 1584494825554, "rating": 5.0, "text": "Leslie was wonderful and had such a calming presence! The spa was gorgeous and everyone was so kind. I will be back!", "pics": null, "resp": {"time": 1589232018039, "text": "Thank you so much for the kind words! We hope to see you\nsoon!"}, "gmap_id": "0x88628a56e3037319:0x5febf95eaf7cd16d"}
{"user_id": "105220629431877455149", "name": "Jennifer Hare", "time": 1570972812433, "rating": 5.0, "text": "Claire and the entire staff are always amazing.   I've always been more than satisfied with all of my treatments.  Love them. Will continue to go back.", "pics": null, "resp": {"time": 1572541623197, "text": "Thank you so much Jennifer! We can't wait to see you again!"}, "gmap_id": "0x88628a56e3037319:0x5febf95eaf7cd16d"}
{"user_id": "110598142805616153112", "name": "Arlie Smith", "time": 1564287924904, "rating": 5.0, "text": "Friendly and knowledgeable staff! Relaxing atmosphere with an array of refreshments! Superb service! Ask for Lindsey! ❤️", "pics": null, "resp": {"time": 1565542210098, "text": "Thank you Arlie! It’s always a pleasure to see you! Come again soon!"}, "gmap_id": "0x88628a56e3037319:0x5febf95eaf7cd16d"}
{"user_id": "114048474659273993416", "name": "Shannon Vital", "time": 1567087644086, "rating": 5.0, "text": "Professional, knowledgeable with tranquil aesthetics. Exceptionally clean...I love coming here for the pampering. Always super welcoming!", "pics": null, "resp": {"time": 1567088894783, "text": "Thank you so much Shannon! You are such a joy and we are always so happy to see your beautiful face! 💗"}, "gmap_id": "0x88628a56e3037319:0x5febf95eaf7cd16d"}
{"user_id": "113643850026628336065", "name": "Jeffery Engbrecht", "time": 1567265136939, "rating": 5.0, "text": "I thoroughly enjoyed my reflexology session with Tiana. She has a great touch and was very attentive!\n\nI will be going back to SkinRx!", "pics": null, "resp": {"time": 1567270194823, "text": "Thank you Jeffrey! Tiana is amazing isn’t she?! We look forward to seeing you again soon!"}, "gmap_id": "0x88628a56e3037319:0x5febf95eaf7cd16d"}
{"user_id": "113643850026628336065", "name": "Jeffery Engbrecht", "time": 1567265136939, "rating": 5.0, "text": "I thoroughly enjoyed my reflexology session with Tiana. She has a great touch and was very attentive!\n\nI will be going back to SkinRx!", "pics": null, "resp": {"time": 1567270194823, "text": "Thank you Jeffrey! Tiana is amazing isn’t she?! We look forward to seeing you again soon!"}, "gmap_id": "0x88628a56e3037319:0x5febf95eaf7cd16d"}
{"user_id": "113055455962065174939", "name": "Tom Robertson", "time": 1574440647652, "rating": 5.0, "text": "Awesome place great customer service if you need most of your cosmetic needs handled check them out", "pics": null, "resp": {"time": 1576692769972, "text": "Thank you so much Tom! It’s always a pleasure to see you!"}, "gmap_id": "0x88628a56e3037319:0x5febf95eaf7cd16d"}
{"user_id": "104492397660569735952", "name": "Elaine Acree", "time": 1569164159225, "rating": 5.0, "text": "The staff is very knowledgeable and very professional  with the laser treatment and IPL.  Lovely, clean facility. I highly recommend SkinRx.", "pics": null, "resp": {"time": 1570662771519, "text": "Thank you so much Elaine! You are such a joy and we LOVE 💗 seeing you!"}, "gmap_id": "0x88628a56e3037319:0x5febf95eaf7cd16d"}
{"user_id": "108104724052429817140", "name": "Glo R", "time": 1569620722444, "rating": 5.0, "text": "Good consultation and good facial. Very clean and organized office.", "pics": null, "resp": {"time": 1570662649565, "text": "Thank you so much darling! We look forward to seeing you again soon!"}, "gmap_id": "0x88628a56e3037319:0x5febf95eaf7cd16d"}
{"user_id": "102987052336240637274", "name": "Diane Smith", "time": 1535380067933, "rating": 5.0, "text": "I had RF Contouring on my neck and am so glad I did.  The neck is a definite age definer. The fat and wrinkles ... visibly reduced.  I believe my neck has shrunk a full inch.  I am so happy with my neck now.  And the staff at SkinRx ... extremely helpful and professional.  Thank you SkinRx!", "pics": null, "resp": {"time": 1535805096445, "text": "Thank you Diane! I am so glad you are pleased with the results. RF Contouring is quickly becoming a personal favorite of mine too. Come see us again soon!"}, "gmap_id": "0x88628a56e3037319:0x5febf95eaf7cd16d"}
{"user_id": "109342714817687212314", "name": "jennifer helfert", "time": 1570051158581, "rating": 5.0, "text": "If I could give 10 stars I would!!! What an amazing experience!", "pics": null, "resp": {"time": 1570662531196, "text": "Aww 🥰 Thank you so much for the lovely review! It was so much fun getting to spend time with you! Look forward to seeing you you again soon!"}, "gmap_id": "0x88628a56e3037319:0x5febf95eaf7cd16d"}
{"user_id": "112620550036473950564", "name": "Jan Grissom", "time": 1516467885789, "rating": 5.0, "text": "NO PAIN . Laser treatment on my face. Friendly, knowledgeable, fast service. Highly recommend.", "pics": null, "resp": {"time": 1516546586355, "text": "Thank you Jan! It is always a pleasure to see you, come again soon!"}, "gmap_id": "0x88628a56e3037319:0x5febf95eaf7cd16d"}
{"user_id": "102428209970374438748", "name": "roll tide jeff", "time": 1564251317419, "rating": 1.0, "text": "don't even deserve one star if you ask that you are not satisfied they don't want to take care of it.", "pics": null, "resp": {"time": 1564256948526, "text": "Hi Jafar. We do not have any record of seeing you as a client at SkinRx. Please feel free to contact us directly if you have questions or concerns."}, "gmap_id": "0x88628a56e3037319:0x5febf95eaf7cd16d"}
{"user_id": "117966614769501115932", "name": "E. M.", "time": 1593039923514, "rating": 5.0, "text": "My eyebrows are AMAZING! I am someone who researches everything extensively before deciding to buy it or not and I have wanted to get my eyebrows microbladed for years!  I never went forward with it though because I never found someone I was completely confident in their results ....that was until I found Lemila Beauty. I saw her work online, I spoke with past clients and other professionals and they all said the same thing, GO TO HER she’s the best. I booked an appointment and Mila DID NOT DISAPPOINT. She exceeded all of my expectations and now I can’t imagine my face any other way! She will be the ONLY PERSON to do my eyebrows. I never knew how much good eyebrows could boost your confidence and enhance your facial features. It completely changed the look of my face for the better! Instead of having heavy set eyes and a big forehead I now have a sultry look and my green eyes really pop. I’m telling you GO TO HER! She has a forever client in me!", "pics": null, "resp": null, "gmap_id": "0x88897d17a435a295:0x6f0f4c88b060f178"}
{"user_id": "111983619880321721429", "name": "Robin Godshalk", "time": 1573065365891, "rating": 5.0, "text": "I love my new eyebrows Mila created for me. Fantastic job! If you want a confident, experienced artist then book your appointment now! This is my first cosmetic procedure and Mila is professional and you are in capable hands. Thank you Mila!😇", "pics": null, "resp": null, "gmap_id": "0x88897d17a435a295:0x6f0f4c88b060f178"}
{"user_id": "111951021081455901300", "name": "Thia “thiaminn” Nguyen", "time": 1547582066546, "rating": 5.0, "text": "I got my brows done and they are literally PERFECT! They are perfectly symmetrical and the experience was comfortable. If those are curious about how it feels- it's really not all that painful. If anything it feels like little scratches and then after a couple of minutes it starts to feel like nothing.", "pics": null, "resp": null, "gmap_id": "0x88897d17a435a295:0x6f0f4c88b060f178"}
{"user_id": "113874946677300522382", "name": "April Medders", "time": 1538444588906, "rating": 5.0, "text": "Mila is simply amazing!!! I would recommend her to anyone.  All her services are above and beyond what you would expect.  She is very sanitary and her business is beautiful.  Mila has a great personality and is passionate about her job but she is also very down to earth.  I suggest if you want the best you visit LeMila beauty.", "pics": null, "resp": {"time": 1538456585370, "text": "You are so sweet, April! LOVE YOU!"}, "gmap_id": "0x88897d17a435a295:0x6f0f4c88b060f178"}
{"user_id": "101488234064008719088", "name": "Haley Mcnutt", "time": 1582340840100, "rating": 5.0, "text": "Mila is truly an amazing artist! Will use her for any of my beauty needs!", "pics": null, "resp": null, "gmap_id": "0x88897d17a435a295:0x6f0f4c88b060f178"}
{"user_id": "100431664070847973644", "name": "Natasha Millette", "time": 1538396713909, "rating": 5.0, "text": "Le Mila Beauty is my go to spot for all facial services! Mila's products and techniques are spot on, she provides excellent customer service and her space is chic yet comfortable. I always leave feeling refreshed and better than I did than when I walked in. I love the fact that she opts for natural and organic products, and her location in Pell City is just a huge bonus for me! I highly recommend!", "pics": null, "resp": {"time": 1538456699346, "text": "Thank you fro your sweet review, Natasha! So glad you enjoyed your time with me and all of my natural products! 😘"}, "gmap_id": "0x88897d17a435a295:0x6f0f4c88b060f178"}
{"user_id": "103365888692753525716", "name": "Emily Graham", "time": 1547855053336, "rating": 5.0, "text": "Mila is amazing!!! I was losing my brows and she put them back and made them look so great! I couldn’t be more pleased! Completely transformed my 41yo face!", "pics": null, "resp": null, "gmap_id": "0x88897d17a435a295:0x6f0f4c88b060f178"}
{"user_id": "112471199179940631572", "name": "Debra Jackson", "time": 1542772058418, "rating": 1.0, "text": "I would love to give them more stars but, when I went there to set up an appointment and ask questions they had the door locked and the lady that was in there saw me at the door she did not acknowledge me nor did she come to the door to tell me if they were open or closed. I waited a couple of minutes and finally I just walked off I was upset because earlier I had    meet some nice ladies and they where passing out cards and asked us to come check them out. I wasn’t aware of a beauty bar in the Pell City area I wish she would have came to the door and told me anything but, I got nothing but stares like why is she still standing there I’m sure the service is great. I just had a bad experience.", "pics": null, "resp": {"time": 1544014545237, "text": "Hi, Ms. Debra. We apologize for the experience you received that day as we were closed the entire week for Thanksgiving.\nI am the only one that works there along with my office assistant. We both do not recall seeing you, maam, and if we did, we surely would have greeted you at the door. Now, sometimes one of our children would be up front once in awhile to grab something for us from the desk and as we have always told them not to open doors for strangers, it possibly could've been one of them. So, as I only work as appointment only, my door remains locked at all times. Again, Ms. Debra, we apologize for your experience.\n\nFor future reference, we will be closing our doors Jan. 15th as I will be moving to Vestavia and Odenville. You may visit my website or facebook for all info if you wish to receive any service from me in the future, maam.\n\nThank you, Ms. Debra.\n\nwww.lemilabeauty.com"}, "gmap_id": "0x88897d17a435a295:0x6f0f4c88b060f178"}
{"user_id": "114298711521053790543", "name": "Ali Roe", "time": 1538365755505, "rating": 5.0, "text": "Mila is the absolute best! The atmosphere of her shop is so relaxing & inviting. I look forward to every appointment with her! Best facials & brow wax available. Her makesup is amazing, as well!", "pics": null, "resp": {"time": 1538367501203, "text": "Thank you, Ali! I look forward to making you more beautiful every time! Love you! 😘"}, "gmap_id": "0x88897d17a435a295:0x6f0f4c88b060f178"}
{"user_id": "106464042416331255509", "name": "Cindi Thrasher", "time": 1544579542808, "rating": 5.0, "text": "I had my permerant eyeliner done today,  I love it. Mila did a great job. She is truly a gifted  artist.  She know exactly  what is best for you. I can't  wait to get my lashes done.\nI will reccomend  her to everyone  I  know.\n\nThank you, so much  Mila", "pics": null, "resp": {"time": 1544586874527, "text": "Thank you for your kind review, Cindi! It has been such a pleasure transforming your brows and eyes. Can't wait to top it all off with lashes!"}, "gmap_id": "0x88897d17a435a295:0x6f0f4c88b060f178"}
{"user_id": "109271093109246824870", "name": "paige williams", "time": 1538402851090, "rating": 5.0, "text": "The spa atmosphere here has you feeling like you're on a vacation at a home away from home. I won't let anyone else work on me besides her. I'll travel to her if need be.", "pics": null, "resp": {"time": 1538456630366, "text": "Thank you for your sweet review, Paige! I hope to see more of you in the future! 😘"}, "gmap_id": "0x88897d17a435a295:0x6f0f4c88b060f178"}
{"user_id": "112072206456390911724", "name": "Brittany Heath", "time": 1535255041349, "rating": 5.0, "text": "Mila is very professional and does a wonderful job!  I am so pleased with my eyebrows and love them!  Can’t wait to have lashes next!!", "pics": null, "resp": {"time": 1538363204020, "text": "Thank you for your wonderful review, love. Can't wait to service you again!"}, "gmap_id": "0x88897d17a435a295:0x6f0f4c88b060f178"}
{"user_id": "103449861869692775964", "name": "Lori Morgan", "time": 1518645735525, "rating": 5.0, "text": "Beautiful shop! She did a great job with my eyebrows!", "pics": null, "resp": {"time": 1538369204917, "text": "Thank you for your kind review! It was my pleasure! 💋"}, "gmap_id": "0x88897d17a435a295:0x6f0f4c88b060f178"}
{"user_id": "117980882993626148574", "name": "France Beal", "time": 1529979425779, "rating": 5.0, "text": "Comfortable", "pics": null, "resp": null, "gmap_id": "0x88897d17a435a295:0x6f0f4c88b060f178"}
{"user_id": "116322142777523241732", "name": "Nathaniel Vana", "time": 1623967269796, "rating": 5.0, "text": "As a guy who is picky about how my hair is cut, it has been super hard to find someone to do it right. I feel like I tried so many different barber shops and salons hoping to find one that works. Well I found one and that was Capelli Salon. All the ladies at the salon are a great and welcoming. I’ve been going here for a few months now and it is just a great environment all around. I am glad that I found this place. I would recommend this salon to any guy ( or girl ) looking to have their hair done right you will not be disappointed!!!", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "107386928427231015455", "name": "Judy Langford", "time": 1604354653522, "rating": 5.0, "text": "Christina is the best. She is very good as a stylist. She listens, pleases and sweet.", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "112555733076953227579", "name": "Gina Smith", "time": 1600812932180, "rating": 5.0, "text": "Wonderful place!!\nEmma did an awesome job on myself and my family members love her too!", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "114429400108180320951", "name": "Karen Pruitt", "time": 1596050978732, "rating": 5.0, "text": "Love the folks at Capelli!  Always a treat getting my hair styled by Betsy! ❤", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "100024340959870724070", "name": "Regina Gargollo", "time": 1577538487395, "rating": 5.0, "text": "First time visit - I called them in the morning to see if I can get a balayage that day and they said yes. Very easy to set a same day appointment. Emma did a fantastic job! I will be coming back for sure.", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "108080759340324243368", "name": "Lisa Phillips", "time": 1402075769393, "rating": 5.0, "text": "I walked in to the salon on a referral from a friend. The scariest thing it sitting down in a chair and hoping the stylist can \"read your mind\" and \"capture the same vision\" you have for your hair. She didn't know me, my personality, or what I liked or didn't like. I was nervous...what if she messed it up? What if I didn't like it? Immediately I was at ease. Everyone was so sweet and the atmosphere was very professional, clean, and calming. Not only did I get a GREAT haircut, I immediately knew I would be back for my color appointment. Another perk--no drama among the stylists! Professional yet friendly! I have even referred a friend there now and she had the same great experience. Best form of advertising is word of mouth! So glad I was referred to Capelli!", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "100268713813387137649", "name": "Amy Gable", "time": 1543206628856, "rating": 5.0, "text": "I overheard a woman talking about getting her hair done here, and she looked great, so I looked it up and booked an appointment. I’ve been back 3 times and absolutely love it! They did a great job! I’ve has Kelly and Kathryn both do my hair.", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "106740524537498260663", "name": "Inmi Brandsema", "time": 1529773967142, "rating": 2.0, "text": "I’ve always had great cuts and service for the past 2 years. The the salon is very flexible and I have always been able to make an same day appointment. I usually see Jerri or Julia. They are great. About a week ago, I saw someone else and I had a terrible experience. Part of it was on me since I did not specify my hair type (long and thick hair) but they also never ask. The stylist seems to be stressed about how long it was going to take to cut my hair. She did not attend to the details and how you can see every layer in my hair if you don’t cut it properly. She ran out of time before her next appointment and sent me to someone else to finish drying my hair. She never came back to check on her work. It was so choppy and uneven. I was so upset about my service. I went to a different salon to get it fixed. Sadly, I will not be returning to Capelli.", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "109984898932755032162", "name": "Bernadette Fraser", "time": 1520400932600, "rating": 5.0, "text": "Very professional & nice personnel, always helpful with good advises, I love the way how beautiful and tidy the rooms are. You will feel very well treated (spoiled) after a visit. 100% recommend", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "105149149824295481145", "name": "Debbie Faris", "time": 1469314072161, "rating": 1.0, "text": "I brought my sister here in July 2016.  I requested a cut/style and highlights and my sister got just a cut and style.  I showed my stylist (Julia) a photo of what I wanted prior to her starting.   When we were finished my hair looked nothing like the cut or highlights I requested.  My sister was very unhappy with her cut also (Katherine did hers).  Both of us had very chopped up cuts which were not the same from one side to the other.  We had negative comments from both friends and strangers who saw our hair later.  Neither of us could style our hair to make it look presentable.  I ended up cutting my own hair and my sisters to clean up the mess.  We were then able to style our hair better and got approval from friends and family.  For me this was the worst professional cut I ever got.", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "101642970665373732056", "name": "Sarah Oswald", "time": 1552407082376, "rating": 5.0, "text": "Best atmosphere in Birmingham. Katherine’s taken me from jet black to blonde without damaging my hair. Absolutely recommend", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "116723178815168952696", "name": "Tanja Rodriguez", "time": 1566684787088, "rating": 5.0, "text": "Have been going there for a while and LOVE Katherine!", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "117901507232715649666", "name": "Paris Wane", "time": 1452187740600, "rating": 5.0, "text": "This place is amazing! April gave me a great cut, listened to everything I was asking for and recommended products for me to try. Great atmosphere, friendly staff. Will definitely be back!", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "102118981489948879709", "name": "Jennifer Summar (NextJen)", "time": 1517361603528, "rating": 5.0, "text": "Great salon with friendly & knowledgeable stylists. Massaging shampoos & reminder calls from the staff are welcome courtesies. Easy to get an appointment, too.", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "105340266859239489646", "name": "Claire F", "time": 1563644843651, "rating": 5.0, "text": "Katherine does an amazing job on my hair color cut and style", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "106284731225002700218", "name": "Brent Panell", "time": 1520520229252, "rating": 5.0, "text": "Can’t say enough about the services and value offered by the veteran staff of Capelli.\n\nThey have a wide variety of talents among the stylists. Schedule an appointment and be prepared to forget other salons.  This is an awesome place!!!", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "112792033032143517661", "name": "Barbara Britton", "time": 1554481614928, "rating": 5.0, "text": "Couldn't have had a better experience very nice people and Kelly was fantastic", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "107017594940111774996", "name": "Whitney Bateman", "time": 1510859273467, "rating": 5.0, "text": "Great salon!  The staff is friendly, professional and fun!  Julia waxes my eyebrows and always does a phenomenal job!  I would highly recommend this salon!", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "110934974382456142706", "name": "Rebecca Dempsey", "time": 1519419167026, "rating": 5.0, "text": "My stylist is great! She's been doing my hair for five years. Everyone is pleasant. Great service!", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "115886238599327982145", "name": "Brent Panell", "time": 1510841806593, "rating": 5.0, "text": "Best Salon in Birmingham!!\n\nFriendly staff with mad skills combined with great prices!! Stop searching for a stylist and just book with Capelli!\n\nGet ready for compliments on your hair!!!!", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "112792033032143517661", "name": "Barbara Britton", "time": 1554481614928, "rating": 5.0, "text": "Couldn't have had a better experience very nice people and Kelly was fantastic", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "108685532734082958115", "name": "Katie Prodoehl", "time": 1422987542979, "rating": 5.0, "text": "Everyone here is great.  I have been seeing Christina for years & she is amazing with my color. Love the cookies & drinks, too!", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "111925802928479182378", "name": "Amy Albers", "time": 1554328301826, "rating": 4.0, "text": "My experience with my stylist was very good, although I did feel a chill in the air between some of the stylists. It was offputting, but overall a good experience.", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "107006950434415795932", "name": "Brandy Suns", "time": 1517327229692, "rating": 5.0, "text": "Julia did a wonderful job on my spray tan and eyebrows! It was a great experience.", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "115216691498913833028", "name": "Tammy Love", "time": 1535593964614, "rating": 5.0, "text": "The staff is amazing and I absolutely love having my hair done there!", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "104141163328078616609", "name": "JW Berry", "time": 1474036646163, "rating": 5.0, "text": "My stylist Julia did a great job of discussing options and cutting my hair.  Will definitely visit again.", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "103414367878480645624", "name": "BooksbyJacobRay", "time": 1535386456994, "rating": 1.0, "text": "Flakes on Cancer Organizations in the name of profits! We had two events with Capelli both were for a rare neuroendocrine cancer. Our staff was told to ‘lower our prices’ so that Capelli could make more money & skip helping our cause. The staff there are racist, uneducated, shallow & care nothing about the community- just money! Go anywhere else! Their prices are as big of a joke as their politricks. Imagine flaking on a cancer organization- patients eager to see pictures, eager to read posts, but denied over Capelli’s interest in money.", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "111077328683752431805", "name": "Laura Gillespie", "time": 1553089958818, "rating": 5.0, "text": "Very friendly, quiet and professional!", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "105845190856809549311", "name": "Katie Cooley Lock", "time": 1536796371798, "rating": 5.0, "text": "These ladies rock!! Great salon and environment!", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "104226416230533474679", "name": "Sue Dobrinski", "time": 1555552690975, "rating": 5.0, "text": "Friendly, attentive staff.", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "101220198866036522169", "name": "Lindsay Diaz", "time": 1576344701355, "rating": 5.0, "text": "Awesome!", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "103070706407070161500", "name": "Tammy Price", "time": 1581642044773, "rating": 5.0, "text": "Friendly staff.", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "114118770502048717211", "name": "Lisa Allen", "time": 1538179008495, "rating": 5.0, "text": "Kelly was great 👍", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "117426896127156989496", "name": "Amanda Flores", "time": 1557079911734, "rating": 5.0, "text": "Katherine is the best!", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "101411121598517512176", "name": "Adolfo Yax", "time": 1575401643690, "rating": 5.0, "text": "Kelly is great", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "104798592392179622716", "name": "Kris Findlay", "time": 1554835521145, "rating": 5.0, "text": "Nice place!", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "108688153882576402448", "name": "Holly Tourney", "time": 1518141652048, "rating": 5.0, "text": "Great,!!!", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
{"user_id": "107650118483486483589", "name": "Kim Carden", "time": 1471725126338, "rating": 4.0, "text": "Nice people", "pics": null, "resp": null, "gmap_id": "0x8889164cb1f7e4bf:0x72e30b83c9cfcf50"}
