{"user_id": "110880728497748623761", "name": "Weston N", "time": 1629666348831, "rating": 2.0, "text": "Guys were friendly but unfortunately we didn’t a full move and had to pay close to a 1k when quoted something else. Now we are having to make trips all day to get the rest of our stuff. Not very pleased.", "pics": null, "resp": null, "gmap_id": "0x889a043c030d4861:0xdb615c1196171191"}
{"user_id": "107692958309090454303", "name": "Jeff Sanders", "time": 1543864709733, "rating": 5.0, "text": "Gave an honest quote over the phone. Called the day before to confirm final details. Showed up on time and brought a truck that was well able to move my items (see photo). Had protective cloths for my dining room table set. Moving to a 3 floor Apt wasn't an issue for them. They were kind, respectful, and easy to communicate with. We were able to move my stuff in a short amount of time. They even helped set up my furniture. Would recommend their services to anyone. Will use them again in the future.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMo2s_vL8XGQpgtmAvNJt2Km0VSVqubTUzHOynQ=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a043c030d4861:0xdb615c1196171191"}
{"user_id": "109692202081184634096", "name": "Nicole Dasher", "time": 1603830965171, "rating": 5.0, "text": "Company was invaluable at helping secure my move. They took care of packimg and unpacking and even secured my space for me and left my keys with my storage company. Above and beyond.", "pics": null, "resp": null, "gmap_id": "0x889a043c030d4861:0xdb615c1196171191"}
{"user_id": "107755160579343360411", "name": "Greg Maynard", "time": 1590175040217, "rating": 5.0, "text": "Outstanding service. They communicated well through the whole process leading up to the move. I would highly recommend using them if you have any moving needs.", "pics": null, "resp": null, "gmap_id": "0x889a043c030d4861:0xdb615c1196171191"}
{"user_id": "114389596454029830467", "name": "Sharday Yorkshire", "time": 1582855807629, "rating": 5.0, "text": "In January 2020 I had the pleasure of working with Moving the Coast of Orange Beach. They moved me from Florida to Louisiana. If you are looking for a company that is professional and on time... look no further. This companies professionalism is unparallel to any other I've worked with in the past. Thank you for making my move easy and totally stress free. God bless your company.", "pics": null, "resp": null, "gmap_id": "0x889a043c030d4861:0xdb615c1196171191"}
{"user_id": "109525901970982547276", "name": "Todd Williams", "time": 1597955682100, "rating": 5.0, "text": "My wife and I just used them on a short local move and they guys were prompt & professional. Cost was in line.  I would highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x889a043c030d4861:0xdb615c1196171191"}
{"user_id": "115626434481286291337", "name": "Makenzie Willis", "time": 1514236440560, "rating": 5.0, "text": "Very polite and on time. Didn't charge extra fees.\nIt was a very smooth and professional move.\nI would recommend them to anybody.", "pics": null, "resp": null, "gmap_id": "0x889a043c030d4861:0xdb615c1196171191"}
{"user_id": "105353972497909653453", "name": "Sand Marcus", "time": 1535417318763, "rating": 5.0, "text": "They took our call last min around 7PM and was able to arrange a crew to come over 20 mins later to move a large dresser up a flight of stairs. They were fast, efficient, and easy to deal with. They will be getting our business again in the future.", "pics": null, "resp": null, "gmap_id": "0x889a043c030d4861:0xdb615c1196171191"}
