{"user_id": "107613036957640982637", "name": "Maxine Moon", "time": 1620857007757, "rating": 1.0, "text": "If I could do no stars I would the woman who called me about taking the cat and 2 kitchens made me feel like the worst person in the universe because I needed to remove them and proceed to tell me it was my fault that my cat had kittens. (When I got her she was a kitten herself, and I didn't feel comfortable with spaying her at the time) And then said that my mom and brother could get allergy medicine", "pics": null, "resp": null, "gmap_id": "0x889a406f7d0f6387:0xbfc2fa0f4d5fbc74"}
{"user_id": "111109870218533521986", "name": "Carol Gordon", "time": 1615924024574, "rating": 1.0, "text": "Tried to foster two kittens from this organization.  One turned out to be terminally ill.  Long story short I had to pay adoption fees for both kittens to pursue care for the ill kitten.\nThere was no misunderstanding.  Feel free to contact my vet, Susan Cardwell at Village Veterinarian Hospital, I’m sure she recalls your conversation regarding legal proceedings if she provided further care to the sick kitten while under “foster” and not purchased.  I had to deliver a check directly to your vet before we could pursue further care.", "pics": null, "resp": {"time": 1615918706443, "text": "Your statement is incorrect, this was two years ago . It was your decision to adopt the cats you offered to foster. So yes you would pay an adoption fee. We are sorry for any Misunderstanding."}, "gmap_id": "0x889a406f7d0f6387:0xbfc2fa0f4d5fbc74"}
{"user_id": "106001372735062512613", "name": "Vashni Hollis", "time": 1604707650226, "rating": 5.0, "text": "I am so glad I found them on Petfinder! Because of them we have a sweet fur baby added to our home. You can tell they really love and care about the cats they shelter. They try to find the best home that will be a perfect fit for each cat, which I respect so much. I would highly recommend them to any loving family that wants to give one of these babies a forever home!", "pics": null, "resp": {"time": 1613766539901, "text": "Thanks, so happy for you and the lucky kitty!"}, "gmap_id": "0x889a406f7d0f6387:0xbfc2fa0f4d5fbc74"}
{"user_id": "113922908430085009705", "name": "Heather Moore", "time": 1616289519374, "rating": 5.0, "text": "Most dedicated folks that work 7 days a week to help cats, they always take the hard cases!!", "pics": null, "resp": null, "gmap_id": "0x889a406f7d0f6387:0xbfc2fa0f4d5fbc74"}
{"user_id": "112958380100761590496", "name": "Donna Fagen", "time": 1595817112527, "rating": 5.0, "text": "This place is great. They really care about animals. I have had two cat situations that they helped with. I rescued 2 un-spayed momma cats and 5 kittens from a person in my neighborhood. They took one mom and adopted out 1 kitten. I was able to find homes for the other 4.\nThey also rescued a momma cat living in a shed behind pizza hut with her 3 babies, one died. I had been feeding her for 4 months. They showed up and stayed for hours until they were rescued.\nI called another rescue grouping Foley, ( which will remain nameless),about 4 times about the situations.They were no help at all. Heather that volunteers for ACCC called and was a big help. Other volunteers from their were a big help too.\nKudos to them for giving all of these kitties a chance. Please donate if you can. They are able to run off of donations.", "pics": null, "resp": {"time": 1601302720804, "text": "Glad we could help !"}, "gmap_id": "0x889a406f7d0f6387:0xbfc2fa0f4d5fbc74"}
{"user_id": "100821371615351108668", "name": "James Rickels", "time": 1523052680457, "rating": 5.0, "text": "Susan went way out of her way to help my daughter with a stray cat that needed neutering and vet care due to an eye infection. She made arrangement for neutering at a reduced cost with a local vet and made my daughter (USA College student) with little money able to afford to keep the stray. Thank you Susan for caring so much about these cats!", "pics": null, "resp": null, "gmap_id": "0x889a406f7d0f6387:0xbfc2fa0f4d5fbc74"}
{"user_id": "117012283424706544879", "name": "Michelle uhle", "time": 1499740790119, "rating": 5.0, "text": "Great group- they go the extra mile when others wont!!! Volunteering with this group makes a big difference and helps homeless cats! Not enough hours in the day....  for all the needy kittens and cats to be spayed.\nA great service for the community.", "pics": null, "resp": null, "gmap_id": "0x889a406f7d0f6387:0xbfc2fa0f4d5fbc74"}
{"user_id": "106286457011610250141", "name": "Stephanie Bassenger", "time": 1495030589762, "rating": 5.0, "text": "The ACCC is a caring, devoted group of volunteers that work tirelessly to save every cat they possibly can.  They help people trap feral and stray cats for spaying and neutering.  They take in cats and kittens that need homes, even pulling from local city and county shelters.  But all this costs money, and they do ask for contributions for their TNR services, and charge a reasonable fee for adoptions.  I have gladly paid adoption fees to bring home two of my best friends.  This is a great service for our community.", "pics": null, "resp": null, "gmap_id": "0x889a406f7d0f6387:0xbfc2fa0f4d5fbc74"}
{"user_id": "105382465822382962243", "name": "curtis lambert", "time": 1517356280599, "rating": 5.0, "text": "They have done as much as they could to help me, I've been trying to fix a feral colony & susan has always been polite to me & gave whatever help she could. But some people just don't understand how much effort goes into helping others", "pics": null, "resp": {"time": 1551459930115, "text": "We are happy to help when we can!!"}, "gmap_id": "0x889a406f7d0f6387:0xbfc2fa0f4d5fbc74"}
{"user_id": "101175935843863778260", "name": "Tameka Andrews", "time": 1429210603145, "rating": 1.0, "text": "I called about 6 kittens in a parked car and spoke with Susan who was very very RUDE!\nFor the place to be called a cat rescue center I can't tell by her responses. I guess my dog will EAT the kittens when they wonder into my yard.", "pics": null, "resp": {"time": 1551460090196, "text": "looking back at this remark, we want to note that all 6 kittens were taken by our volunteer and adopted out after fixed!! A shame the person who complained never corrected her remarks!!!"}, "gmap_id": "0x889a406f7d0f6387:0xbfc2fa0f4d5fbc74"}
{"user_id": "106945068968184690848", "name": "Jessika Crooker", "time": 1567770880645, "rating": 1.0, "text": "These people dont truly care they do NOT call or email back", "pics": null, "resp": null, "gmap_id": "0x889a406f7d0f6387:0xbfc2fa0f4d5fbc74"}
{"user_id": "114305873604650704744", "name": "Mary Beth Fiser", "time": 1500426248322, "rating": 5.0, "text": "I truly believe in this organization and will continue to donate.", "pics": null, "resp": {"time": 1551459967475, "text": "Thanks for any help this is 100% all volunteer group."}, "gmap_id": "0x889a406f7d0f6387:0xbfc2fa0f4d5fbc74"}
{"user_id": "111319900150590878486", "name": "charles shook", "time": 1566314456737, "rating": 1.0, "text": "they don't rescue  just another so called shelter for money", "pics": null, "resp": null, "gmap_id": "0x889a406f7d0f6387:0xbfc2fa0f4d5fbc74"}
{"user_id": "102166984210881237932", "name": "Pyro Roam", "time": 1484006416724, "rating": 1.0, "text": "Horrible experience! Susan is very rude and DOES NOT have the best interest of her cats in mind. Extremely rude, condescending, and selfish.", "pics": null, "resp": null, "gmap_id": "0x889a406f7d0f6387:0xbfc2fa0f4d5fbc74"}
{"user_id": "116954227632360068513", "name": "Jenn Jones", "time": 1579395932116, "rating": 5.0, "text": "Good organization.", "pics": null, "resp": {"time": 1601302737626, "text": "Thank You"}, "gmap_id": "0x889a406f7d0f6387:0xbfc2fa0f4d5fbc74"}
{"user_id": "111871975664429869192", "name": "Mary Duff", "time": 1566751734815, "rating": 5.0, "text": "They care", "pics": null, "resp": null, "gmap_id": "0x889a406f7d0f6387:0xbfc2fa0f4d5fbc74"}
{"user_id": "114884549057545406865", "name": "mary Meyer", "time": 1624848468150, "rating": 5.0, "text": "I love this establishment. They do a amazing job!! Always on point and exceed my expectations. They are amazing with my dog and really care. I will not go to another. They have a amazing booking website and super fast with responses of anything. WOW like wow. I love them.  They even contact you back to make sure you don't need anything after.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "111773111780443111832", "name": "Jan Ellison", "time": 1621440302872, "rating": 5.0, "text": "As this was my furbaby's first bath I was apprehensive about how it would go. They were gentle and made Izzy feel safe. She came home soft and smelling nice. I will definitely take her there again.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "105277734403369165304", "name": "Misty Bonner", "time": 1620690665686, "rating": 5.0, "text": "I can't say enough wonderful things about this business and their employees.  I was very hesitant to leave my puppy anywhere because she was having a hard time interacting with strangers and other dogs.  In no time they had her relaxed and making friends.  The employees would text me pics and videos without me even asking. My pup LOVES going to daycare now. HIGHLY recommend them for your fur babies.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "104347781597279303105", "name": "Jovet Alejandro Sanchez Martinez", "time": 1620525318487, "rating": 5.0, "text": "They treat my dog like one of their own. Prices are reasonable and customer service is amazing.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "100167906163683846616", "name": "Frantina Wilson", "time": 1606846574432, "rating": 2.0, "text": "I have to say I had heard negative things about Piper's from friends, but I continued to use them because we had always had good experiences with them. However, I really can't give Piper's a good review after my 4 babies latest visit over Thanksgiving weekend. We took more than enough of everything that our 2 dogs and 2 cats would need for a stay that spanned from Wednesday night - Sunday night. When we picked them up and got home we noticed left over food for the dogs, we took separate bags for each dog for each day, so was there a day that the dogs were not fed. In addition, MOST of the food we took for the cats was still in the bag...that concerns me as well. My 18 month old cat came home extremely jittery and has been jumping at the slightest noise. I can't say that Piper's did anything wrong, but I will say that our furbies did not come home happy this time. The cats will probably never go back and I will have to think long and hard about taking the dogs back too. The staff, as always, was great in their interactions with me.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "108299346240122722530", "name": "Lydia Higgins", "time": 1614187779357, "rating": 5.0, "text": "We love Piper's Playhouse and have utilized their services when they were at their old location in Saks. We absolutely love taking our pups to them, as they take awesome care of them and provide us with pics of playtime when we are away. We will always take our pups there for grooming and vacation getaways!", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "111926228822824614912", "name": "The Lott Spot", "time": 1592229543789, "rating": 5.0, "text": "They were truly a blessing and helped us when we were in a bind. My dog was labeled as aggressive by my veterinarian when I tried to board with them. I called Piper's playhouse and the owner personal helped calm me down (I was furious with my vet for not even really trying!!) and allowed me to come visit the facility and my dog loved them and it was great!! We would of had to cancel our plans to go out of town if I didn't find them. They were awesome to me and with my dog. Forever grateful!!", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "105799120183737254174", "name": "The Loc Kingdom By Endless Design Braiding LLc", "time": 1621913933454, "rating": 5.0, "text": "Yess love them", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "116561047404504141497", "name": "Fred Pope", "time": 1608644428042, "rating": 5.0, "text": "Great doggie daycare and Great people !\nI just love this place !", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "112503298034377245857", "name": "Teresa Aguilar", "time": 1560047516379, "rating": 5.0, "text": "We used Piper’s Playhouse to board our dog, and I must say we are very pleased!!  He was so loved and cared for!!  He came home all nice and clean!!!  I would recommend Piper’s Playhouse to anyone who has the need!  A special thank you to Shannon and the other staff for making our boy feel loved and welcomed!!!  We will use Piper’s again!!!  Thank you for being so great and professional!!!", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "110476716237317025592", "name": "Charnika Reynolds", "time": 1580306341378, "rating": 5.0, "text": "I love them, and so does my Hemi. They are heaven sent. Not only do they board, they have a daycare center, so my baby is not caged up half the day. They even have an amazing groomer. I can travel with ease, and not have to worry about how my baby is doing 🥰 They're reasonable priced as well.", "pics": null, "resp": {"time": 1583588183157, "text": "We love that handsome yorkie!!! Thank you for the kind words! We can't wait to see you again!"}, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "117011582583399731982", "name": "Bill Kimber", "time": 1599582188799, "rating": 5.0, "text": "Positive experience.  Will definitely board dog there again.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "104590229742410370331", "name": "Marissa Manfre", "time": 1596562289414, "rating": 5.0, "text": "Great customer service always satisfied when I come here.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "113808795803710108571", "name": "Black American Made", "time": 1591917245107, "rating": 4.0, "text": "Great service and its a easy process to drop off and pick up your pup", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "112437041650820876751", "name": "Tiffany Hayes", "time": 1565121412842, "rating": 5.0, "text": "My dogs first day was today and we both loved this place. Very affordable and clean. Best place in town Bailey love his bath", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "111854938501015770810", "name": "Teresa Davis", "time": 1553512241472, "rating": 5.0, "text": "I would like to Thank the Staff at Piper's Playhouse for the special accommodations they gave to me & my babies...Chuck & Rocket! I like to Thank the Owner & Shannon for coming in early to help accommodate my schedule. Again, I truly appreciate the staff for making my babies comfortable while we were here in Anniston, Al. on assignment.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "115766774953868122240", "name": "Kayla Donner", "time": 1551891834461, "rating": 5.0, "text": "I’ve taken my dog here to be boarded three times now and am very happy with the service. I can tell she has a lot of fun with the other dogs and is well taken care of. I love that they post pictures and videos of the dogs every day on Facebook, it really eases my anxiety. I definitely recommend this place over any other boarders in the area.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "105067033443752444555", "name": "Megan Wade", "time": 1579276807944, "rating": 5.0, "text": "Love Piper's they are amazing and always so friendly. My dog always loves going in to be groomed here.", "pics": null, "resp": {"time": 1579280899681, "text": "So happy Theo loves his spa days! We love having him."}, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "108444739649725110691", "name": "Richard Ensley", "time": 1552140771471, "rating": 5.0, "text": "Staff was very friendly. I felt comfortable leaving Andy with them. They try their best to make your dog feel at home. I will definitely be using them again.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "112868629283319038509", "name": "Melita Muhammad", "time": 1417187347916, "rating": 5.0, "text": "As a busy college student at a nearby university, Piper's Playhouse has been nothing but a blessing for my dog and I. I am so thankful for the staff, especially Connie, and the care they take of my dog! The love these people will have your dog is truly unconditional. The prices are extremely affordable and they offer daily deals! I highly recommend Piper's Playhouse!", "pics": null, "resp": {"time": 1417195501377, "text": "Thank you for the great review!!"}, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "104284891656815593011", "name": "Melinda McElroy", "time": 1463522249098, "rating": 5.0, "text": "I have been bringing my puppies, Jazzy and Jagger to Piper's for two years and we LOVE it! We've used grooming, daycare and boarding and we've never had any issues. They are always exhausted after a fun filled day at doggy daycare!  The staff truly care about the animals and do everything possible to ensure the animals are fully taken care of properly. We would never dream of going anywhere else or trusting our pups with anyone else!", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "114214258659404389730", "name": "Tia Stambaugh", "time": 1429635733638, "rating": 5.0, "text": "Absolutely fantastic! My Husky's loved the groomers and they did a great job! Very friendly staff and we were given advise on how to properly take care of their coats and such. Great prices and awesome daily deals! Highly recommended!! We will definitely be making this a regular routine!", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "111808956783552220006", "name": "Cade Somers", "time": 1459181863391, "rating": 5.0, "text": "Our family dog is well-behaved for our crew that includes 3 kids ages 5-11. He loves to fetch baseballs, run, play, and frolic in the occasional Alabama snowfalls but he doesn't get out to socialize often with other people or dogs, so he can act territorially aggressive when kenneled once or twice a year. We've kenneled him other places before, but he came home the happiest when we used Piper's. He came home clean and happy, and the staff seemed upbeat and positive both at drop-off and pick-up. I know he's likely not the most easygoing dog for which they provide services, but our family appreciates them for their professionalism and care.", "pics": null, "resp": {"time": 1459190581226, "text": "Thank you for the wonderful review! We can't wait until Homer comes to see us again!"}, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "103911857628625098781", "name": "Nicholas Shelton", "time": 1421891719596, "rating": 5.0, "text": "I have three hyper-active brindled rescued dogs that absolutely love this place, they begin going nuts when we are still blocks away. When my dogs are there for daycare, boarding, or day school they come home completely worn out and sleep/lay around for the next two days. They groomers do wonderful work. I cannot begin to express my gratitude to the wonderful people who work there for giving me peace of mind while I am away. I highly recommend entrusting your pet with these wonderful people for all of your pet care needs.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "102414743164202669003", "name": "Tessey Johnson", "time": 1483891756413, "rating": 5.0, "text": "I am very happy with everyone from Piper's Playhouse. They had my babies Casey and Daisy for 3 days, I was able to see pictures of them on their facebook page to see how they were doing. But the most impressive to me was how when my trip home got messed up because of the weather, they stayed late so I could get my babies back instead of having to wait another day. I had missed them so much so this meant the world to me. I would gladly take my babies back to stay with them. Thank you all so much", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "102718991019999599715", "name": "kala mitchell", "time": 1560308949810, "rating": 5.0, "text": "My pup has been going to pipers for almost 3 years now. Even though my pup started daycare at an early age she isnt very social towards other dogs. However she isnt aggressive. The staff at pipers recognized this right away and made accommodations to make her feel safe. While she is visiting she is allowed a safe place to withdraw when the interaction of other dogs is just too much. At the same time she has just as much freedom to join the group and observe or if she is in a really good mood play! The fact that they treat each dog according to each dogs personality and temperament speaks volumes! It is above and beyond and average doggie daycare! My pup is always excited to go to day care! She starts crying from excitement as soon as we turn off quintard. She is always extremely excited to see the staff, especially Alisha! 😉 (her second mom) Thank you to Alisha, Shannon, and all the Pipers staff for 3 years of great service!! 💖🐶", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "101983146291124795588", "name": "Elizabeth Blue", "time": 1517675917925, "rating": 5.0, "text": "They took such good care of my dogs when we boarded them there for a long weekend. As part of their boarding price doggy day care, playing with other size-appropriate friendly dogs, is included!", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "100364746246892208090", "name": "Lisa Amerson", "time": 1491622885809, "rating": 5.0, "text": "Good prices, easy to get reservations. Dog is always excited to go. Love that they take pics daily and I can see how Scout is interacting.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPROA8xjOkP-aywts9aryCSqqUTIwVE5oW1c_Rw=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "105169780828862624482", "name": "Stephen Mann", "time": 1502404327719, "rating": 5.0, "text": "They've kept my dogs on several occasions and have always done a great job.  They are also very reasonably priced.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "109876790394024618967", "name": "Jennifer Jackson", "time": 1557002928084, "rating": 5.0, "text": "My fur babies look so awesome after their visit and the staff is wonderful. Found my new groomers", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "118317340174834258627", "name": "Erin Calvert", "time": 1537044473620, "rating": 1.0, "text": "This local Dog establishment is violating multiple heath codes. The owner of this facility and the manager were told on multiple occasions by employees and were aware of the following: Fire extinguishers (they only have 2) being extremely out of date, last checked back in 2015— also no evacuation plan, or safety drills, air vent maintenance doesn’t take place— vents/filters not properly maintained can easily catch fire, this company works with LIVE animals, the safety of your dogs are not being considered as you can tell from the images.... everything is layered with years of dog dander and hair.\nWhen the heater gets turned on the smell of burning hair lasts for days and the company uses wax melts up front to mask the smells. They also stuff the vents they don’t clean with smell good beads to mask the smell.\nEven daycare dogs are kenneled. Employees hang around upfront until around 9 when they decide to start putting dogs in daycare—- this means if you’re paying for a full day or even a half day of doggie daycare starting in the morning your furbabies are missing out on 2+ hours of socialization. This facility doesn’t properly clean the daycare room. And weeks worth of hair is noticeable near the drains in the daycare play areas, this is extremely unsafe for your animals/the employees. The smell in this building that’s separate from the building your drop off your dog is horrific. Dogs are left unsupervised in daycare, and the daycare supervision in maintained outside of the daycare rooms- so instead of dogs getting that one-on-one attention they are only monitored when barking has increased. Because of that, rooms aren’t cleaned right away causing burns on paw pads from dogs playing around in urine. Most dogs have to be ran through Grooming to be spot cleaned before leaving. Bored dogs have started eating the walls of this establishment because of the lack of social interaction they receive. This facility illegally mentioned to employees that they can not pay overtime to them when they have worked 40+ hrs. Because of this, I believe the care of the animals that go there are being affected.\nDuring the recent snow storm an employee managed to chase a already nervous dog around the front lobby of this establishment causing him to run out of the front door. This dog was missing for a week and found with his hip shattered, and he had ate an entire toe off of himself.. this establishment paid his vet bill which included the cost of utilization. Clearly the proper training of employees is not being conducted. This facility also does not clean kennels often and when they do they use a dirty mop to wipe out the kennels. This is probably a factor to the outbreak of kennel cough they are currently battling.\nMany times employees just feed  dogs breakfast without even bothering to clean the kennel first or move the dog to a clean kennel.. that means that they were eating breakfast in their own filth and kenneled with it until daycare started up. In It’s hard enough trusting someone, let along finding out an establishment you’re paying LOTS of money to is neglecting your animal. This establishment recently caused the death of a small 4 lb dog, and they are trying to cover it up. By deleting comments and blocking any negativity they receive. I refuse to be silent. This facility is anything but transparent!!!", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "117481193391463817778", "name": "Shannon gilmore", "time": 1463604031614, "rating": 5.0, "text": "I wouldn't take my two babies anywhere else!! They love everyone there! My oldest dog is nervous around strangers and he doesn't hesitate to run up to everyone there. The groomer is amazing and I have never been disappointed. I have a 6 year old male dorkie (dachshund/Yorkshire terrier) and a 1 year old female schnorkie (schnauzer/Yorkshire terrier), who are both rescues. I recommend pipers to everyone", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "106483610856282471562", "name": "Faith Wright", "time": 1510797514421, "rating": 5.0, "text": "Great place for our fur babies! They pups love to play and the staff all take good care of pets.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "111446729338740942535", "name": "Rebekah Shierling", "time": 1473712018853, "rating": 5.0, "text": "They kept my lab for a few days. She has never been boarded or been to doggie daycare. She came back to me just the way I dropped her off. They were very understanding as to her walking for 15 minutes. They posted pictures of her playing daily! They said she enjoyed herself and they loved her. I would bring her back because for the first time in 6 years I didn't worry about picking my dog up and them being under stress, no walked enough, kept in a crate all day, or not being checked on plenty.\n\nThanks to piper's dogowners can rest easy knowing their pups are being pampered to the fullest in a clean environment!\n\nI even called and ask if my lab could stay one more day one the day I was supposed to pick her up from our trip and they were happy to let her stay in her room!", "pics": null, "resp": {"time": 1473712854539, "text": "Can't wait to see Mocha again!"}, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "100598519111238694895", "name": "wild rose", "time": 1592991631715, "rating": 3.0, "text": "It is a daycare ONLY!!!! THEY NO LONGER ADOPT DOGS OUT!", "pics": null, "resp": {"time": 1593012005428, "text": "Piper's Playhouse is a boarding, daycare, training and retail facility, but you are correct about the rescue. We had to close the Piper's Rescue in 2018 due to the lack of income to keep it running. We do work with other local rescues in order to continue helping in the community as much as possible. Piper's also holds drives for the the local animal shelters at least once a year to help in that aspect. Piper's Rescue a"}, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "110809502256626216585", "name": "Rachel Bonnett", "time": 1525126476934, "rating": 5.0, "text": "Wonderful with my Tod his hairstyle always looks amazing.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "103986465175291528978", "name": "Marilyn Hart", "time": 1463532435466, "rating": 5.0, "text": "Piper's Playhouse has been a lifesaver!!! We recently got a very sweet but very high energy rescue...Smokey:)  They were not scared off by his hyper-self and have been a wonderful help in helping me make his entrances and exits not so wild LOL;). I live and work in Gadsden so add 3 hrs and 140 miles to each work day for Smokey to go there...it's worth all that extra effort bc I know he is well taken care of(they welcome me calling to check on him), having fun, and will be toast when I pick him up, which makes nights much more manageable;). This place of business is clean, professional, helpful, loving, and a blessing for dogs and dog owners!!!", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "104164033250429318134", "name": "Kate Upchurch", "time": 1514492986333, "rating": 1.0, "text": "Prior to this past visit I'd have written a great review but when I picked my little guy  ( a shih tzu )up on Christmas Eve I was horrified! Shaking, limping and handed dirty bedding with no explanation as to how he was injured, why we weren't informed  when it happened plus finding out he'd been very stressed by being kenneled every night in the large room with the large dogs with big dog barks! When I first boarded @ Piper's 2 years ago I requested that he be kenneled at night with only little dogs and was shown a room off the hall on the right where I was told the small dogs stayed. When I asked why he was put in the big room this time with the big dogs she said \"well, you didn't request that he be separated\". If my file had been consulted I'm sure it would reflect my wishes. There was no I'm sorry we didn't contact you about his injury, etc. He literally had to be carried that night and Christmas day every time to potty, to food bowl, etc. While I understand this may not be the norm @ Piper's, ( had never happened to me before) since it happened this time, I'll be making other arrangements next time. Beware. Things are not always as they seem. Ask to see where your dog will be put at night. I was told they  NEVER allow tours! That's shocking! I've ALWAYS toured where I board my dog. Ask what their policy is if your dog becomes injured or sick. I asked when the owner would be there as I wanted to speak in person with them and was told the owner was never at the Anniston location. Really? So, I've emailed the owner to express my concerns.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "101620411781761026081", "name": "Wilson, Brandon David", "time": 1572417750539, "rating": 1.0, "text": "To fire one on leave seem real... despicable. More care is given to pups than those mental. If you've paid the piper you know who I am. The management's a joke, but current employees are grand.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "117103016751655594621", "name": "Leisa Cole", "time": 1514594323442, "rating": 5.0, "text": "My dog loves this place! People working here are GREAT!", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "107932251503996229767", "name": "Alabama Zephyr", "time": 1541370281875, "rating": 5.0, "text": "Wonderful staff and a wonderful doggie day care! Thank you!", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "108936122777324938034", "name": "Lawanna Wade", "time": 1497148743351, "rating": 5.0, "text": "Thanks to Pipers Playhouse  for taking care ol Handsome  for the Wades !", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "100705300402653043812", "name": "Shawanda Edison", "time": 1501296271174, "rating": 3.0, "text": "Prices aren't what they advertise. But it's a nice place to take your pet and know they are in good hands.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "103613549259580335544", "name": "Micah Morgan", "time": 1469047340910, "rating": 5.0, "text": "Highly recommended! Never had a complaint! My babies have been groomed here, boarded here and had play dates in daycare! If they were misbehaved I would have them in the training classes as well. There prices are very affordale plus they have just lowered the prices! They always have some new homemade nutritional snack for sale on the counter and tons of things to buy for your fur baby. Ranginger from shampoos to clothes to toys to collars and leashes. You will not be disappointed. Thank you Pipers for making it easier for me to go on vacation without being weary of how my babies are. Yall are awesome!\n\nAlso I would like to add with being a former employee of Pipers Playhouse. Know that your baby is well watched and takenjoy care of. Blankets, kennels and play areas are washed daily with non harmful chemicals.  They have very interactive play during daycare, someone is always watching and spending time with your furbaby. Medicine is well charted and given correctly.  Staff does their very best at making your pets stay as easy and comfortable as possible. The owner is the most compassionate person I have met and treat every animal with respect and love. You must check out Pipers for yourself!", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "104661793894494991348", "name": "NameIs Private", "time": 1520093864051, "rating": 5.0, "text": "Great people great service.  Thank you", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "115601214795586323345", "name": "Ms. D.", "time": 1560829224734, "rating": 5.0, "text": "The front desk worker helped me a lot.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "117033767606963075874", "name": "Cory Clifton", "time": 1495721463193, "rating": 5.0, "text": "Great place for doggy day care", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "112934907525103783396", "name": "Toni Bell", "time": 1467750019146, "rating": 1.0, "text": "My dog was boarded the weekend of July 4th. He was picked up today and reeked of urine as well as his bed that was sent. Highly disappointed and will not be using pipers playhouse again.", "pics": null, "resp": {"time": 1467753593594, "text": "I am very sorry you were disappointed with our services. Rudy (still being a puppy) did have accidents in his kennel at night. He also played VERY hard in doggie daycare each day. His bed and blankets were washed each day - but in the rush of dogs leaving today (July 5th) it was overlooked. I have addressed it with my Boarding Supervisor and it will not happen again! We would like to offer him a free full-service bath."}, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "110976692842329565160", "name": "Maia Canning", "time": 1537928994504, "rating": 1.0, "text": "The place smells strongly of urine.", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "110680826501288432919", "name": "Teresa Craven", "time": 1470088344982, "rating": 5.0, "text": "The daycare is the best!!!!!!", "pics": null, "resp": null, "gmap_id": "0x888bb344b45a6c63:0x685d3a5c7b681a37"}
{"user_id": "101126763801816893957", "name": "Markeria Thomas", "time": 1590603314736, "rating": 1.0, "text": "They don’t answer the phone at all, so annoying why run a business and don’t answer the phone ? Smh ignorant.", "pics": null, "resp": {"time": 1590607996197, "text": "Our phone lines are currently down being repaired.  We've also made announcements on our website and Facebook page that emails and Facebook messages get to us faster than calls. Due to Covid-19,  we are limited on hours in our office. Combine that with adopters and vets,  we are extremely busy at this time\n\nWe also see you have not sent in any application for adoption either."}, "gmap_id": "0x88890dfc4cdfca89:0x1cdb5483ad65d1c1"}
{"user_id": "114707572134481229348", "name": "Christopher Harris", "time": 1610408250087, "rating": 5.0, "text": "Great burger", "pics": null, "resp": null, "gmap_id": "0x88890dfc4cdfca89:0x1cdb5483ad65d1c1"}
{"user_id": "110169684943405940624", "name": "Ambitious Reality", "time": 1580153350254, "rating": 2.0, "text": "I haven't gotten a call back yet. It's been two days so far since I left the VM...", "pics": null, "resp": {"time": 1580168425776, "text": "We just checked all of our messages and we do not have any voice mail messages left by anyone with your name. Did you call 205-833-6654?"}, "gmap_id": "0x88890dfc4cdfca89:0x1cdb5483ad65d1c1"}
{"user_id": "111576151463937603037", "name": "Rebecca Palmer", "time": 1541718202357, "rating": 1.0, "text": "More of a donation solicitation than adoption site. No pics or descptions available...nothing here to fall in love with,or touch your heart and make you want to bring one home. Sad for the dogs.", "pics": null, "resp": null, "gmap_id": "0x88890dfc4cdfca89:0x1cdb5483ad65d1c1"}
{"user_id": "116500416154378300130", "name": "Dustin Maines", "time": 1582421795760, "rating": 5.0, "text": "Never been there not sure why it says I have been there", "pics": null, "resp": null, "gmap_id": "0x88890dfc4cdfca89:0x1cdb5483ad65d1c1"}
{"user_id": "109378638067929744333", "name": "Brett White", "time": 1525185693989, "rating": 5.0, "text": "Got my greyhound from here, excellent staff.", "pics": null, "resp": null, "gmap_id": "0x88890dfc4cdfca89:0x1cdb5483ad65d1c1"}
{"user_id": "100804253587585520788", "name": "Tim Leichty", "time": 1572119257097, "rating": 2.0, "text": "Never heard back from them", "pics": null, "resp": {"time": 1572125433049, "text": "That's quite odd Tim.\nWe have checked our emails,  our Facebook messages,  and our phone messages.  We do not have any messages, adoption information requests,  emails,  or any other correspondence from you.  If we would have had any such thing,  we would have responded.  You're welcomed to call our office during our normal business hours and speak to us in person or you may email us at agracstaff@gmail.com"}, "gmap_id": "0x88890dfc4cdfca89:0x1cdb5483ad65d1c1"}
{"user_id": "104277685810098164708", "name": "Cutler Knupp", "time": 1585786858127, "rating": 1.0, "text": "shady operation.", "pics": null, "resp": null, "gmap_id": "0x88890dfc4cdfca89:0x1cdb5483ad65d1c1"}
{"user_id": "107118674028330256901", "name": "Paige Mavity", "time": 1621442403374, "rating": 5.0, "text": "I had a great experience today with my 3 dogs at All Creatures! They were extremely helpful with recommendations on feeding my GP with chicken allergies and low fat food for my little dog! They even gave my Golden retriever a ball to take home with her for being so sweet!! Thank you guys so much, I’m so glad to have you as my permanent vet!", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "108940533308778684778", "name": "Sharon Borrell", "time": 1616255928831, "rating": 5.0, "text": "All Creatures are the best!!. I have use Dr Hankes for years an would not go anywhere else. The staff are very friendly an We love Jackie.. She is great with Nirto he gets excited every time we pull up to the clinic. He can’t wait to go inside. He loves the daycare program an I do to because he comes home so tired lol .", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNgZbietazzeCgWV2gaOZ7PFrctXjajNR0Vs9af=w150-h150-k-no-p"]}], "resp": {"time": 1616261377966, "text": "Thanks so much for the kind words! We strive to provide all pets and owners with the top notch care that they deserve!!"}, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "116389710558651859770", "name": "Lindsey Pierce", "time": 1620589383821, "rating": 5.0, "text": "Our experience with All Creatures hospital was wonderful! We have switched all of our animals to all creatures. They are very polite, helpful and are able to get you in quick, while taking great care of your fur babies. I can’t recommend them enough!", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "104017794118878473808", "name": "Anthony Cornelius", "time": 1621804197785, "rating": 4.0, "text": "Great patient staff. One of my dogs had an accident in the seat on the way there. He got it all over himself and my other pup. They tracked it in on the floor(I thought i had gotten most of it cleaned up). I was embarrassed,  but the staff wasn't upset at all. Reasonably priced compared to the other places I checked into. I will be going back sometime in the future.", "pics": null, "resp": {"time": 1621787106826, "text": "Thank you for the kind words. We strive to provide excellent client and patient care to all that visit our hospital."}, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "103510533640449658225", "name": "Judy Christian", "time": 1580678963521, "rating": 5.0, "text": "Wonderful place, thhe staff and Dr Hankes are great. They really care about giving your pets tbe best if care.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOU_wqb2KO3ljttLQw4OcylmBf9ezZtj4o-Khfo=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOB2dZnL5NjM_ZEPFMH5Qm5Ijk16BLsRuiLg6jV=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "115472577676369065936", "name": "Christiana Wachter", "time": 1621876146151, "rating": 5.0, "text": "Love Dr. Hankes and staff! My puppy Max loves coming to see them!", "pics": null, "resp": {"time": 1621957372076, "text": "Thank you for the kind words!!"}, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "117821109272772446382", "name": "Cody Beavers", "time": 1607469594237, "rating": 5.0, "text": "I rushed my cat in after being attacked my neighbors dog (he accidentally escaped). They quickly examined my cat and kept me informed every step of the way since they are curbside only. The staff and vet were all nice and caring. They stayed late to make sure he was ok and to stitch him up. I'm very grateful for them and everything they have done for us. If you are looking for an amazing veterinary team this is the place to go!!", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "103427717251066489576", "name": "Sarah Hambric", "time": 1618666096377, "rating": 5.0, "text": "I take both our dogs here. The other day I had to bring my Chihuahua in because he wasn’t feeling good. I called when they opened and they worked him in that morning. They let you know every step of the way what is going on and what they are doing. I even had to bring back urine and fecal samples and they called 30 minutes to an hour after I dropped them off to let me know everything was normal.", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "111760872372383886112", "name": "Jeni Crane", "time": 1598974512416, "rating": 5.0, "text": "Our family cat was having trouble urinating.  He was not acting himself and he was staying hovered on the litter box.  It was late in the day , close to closing for the clinic.  When I called in the staff was friendly and made room for me on the schedule.  When I got to the clinic the receptionist came to the car masked for the safety of clients. (Covid)  they cared for my cat and kept me informed along the way.   Mufasa our cat had crystals in his urine and a blockage.  They sedated him and took care of the problem.  He was hospitalized over the weekend and the staff and doctor Hankes kept us informed to keep us from worrying.     We now have him home and we have him on special food which for convenience we can buy there when needed.    It's been 5 days and the staff has called to check in to see how mufasa is.  I can not brag enough on how excellent the clinic is run and the loving hearts the staff has.\nBravo!", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "115629694216787982835", "name": "Sir Consumer", "time": 1599572805298, "rating": 3.0, "text": "Sadly animal care at 'All Creatures Pet Hospital', is not a priority. Today it was clear, $money$ is their priority. My son's Service Dog, needed antibiotics. Dr. Hankes stated he will give my sons dog the antibiotics he needs as he came outside to explain why. Then the itemized bill came out and I was going to be charged almost $50, for the meds!!. This was not a 'gift' as Dr. Hankes stated. The lady stated the Doctor has a bad habit of saying those things. I did not get the antibiotics due to an incredibly, and highly inflated prices. I found the same prescription from GoodRx, for less then $20 that Publix could fill. All Creatures will not send out prescriptions to help animals as I telephoned and was denied this service to help my sons Service Animal.\nAlthough the staff seems very kind. The Vet Dr. Hankes, needs to learn better communication skills and consider helping animals by paying his license to send out prescriptions, if this is the reason. Perhaps there is an unknown underling as to why 'All Creatures Pet Hospital', chooses not to. The high mark up on prices leads me to believe other prices are inflated. Time to look for another more caring animal clinic.", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "109361303454133268405", "name": "Bryan McCullar", "time": 1609515917162, "rating": 5.0, "text": "No way to make All Creatures Pet Hospital better when it’s already the best.  They have adapted to curbside service exceptionally well. While I prefer being in the office, with Akira, you have done an excellent job adapting to Covid.  Your staff is very helpful and do an amazing job.", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "111433573032950340754", "name": "Robert Miller", "time": 1597787632174, "rating": 5.0, "text": "Dr. Ted and his staff are AWESOME!  They really care about your pet and take the time to make sure to answer questions and ensure a quality level of care. They will explain any treatment procedures needed and give you options for you to make an informed decision.  I highly recommend All Creatures, you will not be disappointed.", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "100911055194165977576", "name": "Jules", "time": 1607104160387, "rating": 1.0, "text": "I rushed my dog here after he broke his leg at the Black Creek Dog Park on a Saturday. After they did the X-ray, they told me he would need surgery and they would have to refer him out. I wanted to take him right away, but they assured me no one would be open until Monday. They lied to my face. The office they referred me to (and who they said they work with all the time) is open 24/7. They kept him the entire weekend without giving me any updates, delayed his surgery, and charged me $900 for the unnecessary boarding. My advice is to drive the extra distance and find a reliable vet in Birmingham who won't swindle you.", "pics": null, "resp": {"time": 1607116166103, "text": "Wow! We can't believe this review. This review is completely unfair and not honest. Her dog was seen here four months ago. We don't know why she is suddenly writing a review. First, we don't keep pets here just to make money. We did not charge her $900 for boarding. That's just not true. Hospitalization (boarding) was charged for her pet to stay here for two nights at the cost of $108.22, which included administering the pain medication and antibiotics through the weekend. We stayed late to examine, sedate (to eliviate her dogs pain while she was positioned for radiographs), administered intravenous fluids, splinted her leg, and administer pain and antibiotic medications to her dog through the weekend. All treatments that we provided were completed at her request and signature. The charges weren't any different than would have been charged at any other clinic in Birmingham. This client was not our client and she couldn't get in at any other vet in the area late on a Saturday morning just before we closed at noon.\n\nFinally, we could not discharge her pet because he was completely asleep (sedated). It's something that vets just don't do. Bad things can happen when patients aren't kept quiet and still to rest and stabilize while under anesthesia. Also, the liability of someone driving in a hurry down the highway, slamming on their breaks and causing their dog to fly through the air and breaking it's neck is not a smart thing to allow.\n\nAlso, our honest experience had been that the surgical center doesn't see patients for routine fractures on the weekend. They are kept hospitalized at a general hospital or at the ER until Monday. The emergency hospital that is associated with the surgical center IS open 24/7 for emergencies throughout the weekend. That is probably the information that the client is referring to. This wasn't an emergency as he wasn't in shock and we had stabilized him on intravenous fluids. We literally called down there today and the technician told us that a bill for observation through the weekend for a dog with a simple fracture on intravenous fluids, antibiotics and pain medications at the emergency hospital would literally approach $2000.\n\nSo, we saved this client over $1000, saw her dog when nobody else would, stayed late and provided high quality medicine, and did what was best for her dog.\n\nThis review is not honest or accurate and should be removed."}, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "114472194619404905571", "name": "Donna Elliott", "time": 1609008742994, "rating": 5.0, "text": "All the staff at All Creatures Pet Hospital are wonderful! They are so helpful, friendly, knowledgeable, professional and best of all they love my furbaby, Paislee, so well that I know she is in the best care.", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "113525922073424582748", "name": "Tabbitha Turnet", "time": 1607491522195, "rating": 5.0, "text": "I couldn’t ask for a better Doctor for my sweet Daisy. She had what I though where allergy issues because of her chewing at her back end.  I took her in to be examined and the staff was very nice and caring. Dr Hankes came out to speak with me after her exam and told me she actually has knee problem which explain the bitting/chewing. He referred surgery to fix the problem but with the financial struggle that covid has caused everyone we just couldn’t do it. We decided to move further with a management plan instead of surgery. He also made it very clear that if in the future we wanted to go ahead with the surgery he himself would do it. I couldn’t ask for a more understanding Vet or more helpful staff. My daisy has been doing much better since we got her on her new medication and is not in anymore pain. We have also started a savings account so we can get the surgery done asap! I would highly recommend this clinic to anyone!", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "113439220089684992023", "name": "Dana HARDEN", "time": 1605204086143, "rating": 1.0, "text": "Will not use again, Mercy Animal hospital is SOOO much better. Wanted to charge a $300 deposit before they even saw my pet.", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "103808309291194976668", "name": "Joyce Wohn", "time": 1607289680589, "rating": 4.0, "text": "Nothing against the clinic I don't like having to wait outside to get results, and as this was my pets first time, I like to met Dr. Otherwise she was better soon after 2 visits and meds. Thank you Joyce Wohn", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "103235747551379009792", "name": "Zane Bush", "time": 1607108504407, "rating": 5.0, "text": "My wife and I have been using Dr. Hankes since 2006, he is very knowledgeable and treats us like family! He even has come to my house to do some farm calls for me to deworm and trim my goats feet. They are very fair on their prices and give us a military discount as well for all of my pets! The bloodwork they did prior to my beatrice's spay was something that i did not think was necessary, but Dr Hankes and his techs explained the reasons why she would need them and we found out she was a diabetic! Im so glad that they caught this in time now she can be treated and she is on the right dietary food that they have there and is doing so much better! We would have not known if he hadn't told us the risks she might be facing during surgery! We love him and all the girls they are the best!", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "101640406790409629969", "name": "Samantha AkaSam", "time": 1604944109352, "rating": 1.0, "text": "I wish I could add pictures of screenshots but go to their Facebook and check their reviews. Dude literally compared animals to a repoed vehicle. DO NOT trust them to tell you correct pricing. They have multiple bad reviews for the same problem.", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "109502007772223723928", "name": "Rick Godfrey", "time": 1592914802376, "rating": 5.0, "text": "All Creatures has cared for my little 14 year old mix Abby her entire life.  Dr. Ted and the entire staff are always great with her and I won’t even consider taking Abby anywhere else.  I trust them to always provide the best care possible, and I’ve never been disappointed.", "pics": null, "resp": {"time": 1593013627144, "text": "Thank you for the kind words. Our process insures this for all our clients and patients. We take one case meticulously at a time to insure pets are treated with the best care possible. Our slogan is \"We give your pets the care they deserve!\""}, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "100520966996309775722", "name": "Deidre Stone", "time": 1592838046826, "rating": 5.0, "text": "The staff are friendly and loving as well as knowledgeable. We have trusted them with our pets in the past so when our little Banjo came along there was no question who we would see for care. We love our vet!", "pics": null, "resp": {"time": 1592844620570, "text": "Thank you so much for the kind words! We strive to provide each pet and client with great care and high quality service!"}, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "109163860858373845465", "name": "Melissa Brand", "time": 1599164223184, "rating": 5.0, "text": "Had  a very great experience at the clinic there\nVery good and friendly specially Ashley Johnson one of the vet tech who was very good with my dog thank you very much", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "103612496000737639865", "name": "Rebecca J. McWhorter", "time": 1603558270437, "rating": 2.0, "text": "I recently moved to Gardendale and chose this office because it's close to where I live and it was well-reviewed.  I have 4 pets- one I just adopted, and I took her in to establish care. The first time we went, the lady who examined my dog came out to speak to me, gave me a thorough explanation of the exam, tips on treating her skin issues, food, etc. I was told she had an ear infection and we needed to come back 2 weeks later for a re-evaluation.  She told me to come back on a Saturday so I could see the same vet again.  We did just that.  However, this time my dog was examined by Dr. Hankes.  Our appointment was at 10:30am, but we weren't greeted until 10:55.  Dr. Hankes called me instead of coming to speak to me directly (which is fine, it was raining).  He told me that the heartworm medication I was using was ineffective and I needed to do some research on it online.  I've used it for years per a veterinarian in the family's recommendation.  I still can't find poor reviews about the medication online, for the record.  He also said that he preferred to not use 1800PetMeds because it was too much trouble for him to fax in prescriptions.  I asked him to examine my dog for another concerning issue I had, he said he would, but no call from him or response.  A few minutes later, a girl came out with a credit card machine (no invoice) asking me for $70.  I was hoping to start taking all 4 of my pets here for their vet needs, but we will be returning to Avondale Animal Hospital, where the vets take the time to answer all of your questions and don't upsell medications.  The receptionists are extremely kind and friendly, but the mask ordinance is not valued whatsoever.", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "100638895590365513150", "name": "Jami Lynn", "time": 1598065940718, "rating": 5.0, "text": "I brought my dog in because he was home alone and got into the trash and ate a drink can and everyone was so super helpful and sweet as they could be to him even though he was super nervous they took him back very quickly and now he is feeling much better\nDoctor Hankins and all of the staff were great and we are very grateful for you taking such good care of my baby we will be back to see you soon !", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "102616679170661258365", "name": "R Matthews aka RJ", "time": 1591730231912, "rating": 5.0, "text": "I recently brought my cat Skeeter to this vet. I am quite picky and normally leary of vets. But they were very good in everything they did and the staff  is  professional and the vets are phenomenal. I had to have tests run but they kept me posted as they did everything so there were no surprises. I would highly recommend them especially Dr Oaken. Dr. Hankes was great as well as I saw both with Skeeter. I found them be reasonable, friendly and professional.\nI would highly recommend them for your pet needs.", "pics": null, "resp": {"time": 1591736316870, "text": "Thank you very much for the kind words. Our policy is to treat each client with kindness and respect and each pet with a meticulous and thorough approach, getting to the bottom of each of their medical problems. We don't rest until we have solved your pet's medical issues. We give your pets the care they deserve!"}, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "101321973723072172218", "name": "laurendubbb", "time": 1596168478431, "rating": 5.0, "text": "The staff are always very informative on what my pets should have to maintain a healthy life. Their care for our pets is extraordinary and I wouldn’t take my pets anywhere else.", "pics": null, "resp": {"time": 1596210960995, "text": "Thank you for the kind words!"}, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "105085608128472113050", "name": "Ken Levesque", "time": 1596202891105, "rating": 5.0, "text": "All Creatures Hospital offers the best care anywhere!  Dr. Hankes gave me years with my dog I never thought I would get.  I wouldn't go anywhere else.", "pics": null, "resp": {"time": 1596211034734, "text": "Thank You for the kind words Mr. Levesque!!"}, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "112195431098753907935", "name": "kelle miller", "time": 1597166703421, "rating": 5.0, "text": "Dr Ted is the best vet in town! You will always get excellent service from Dr Ted and his caring staff.", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "112861301099779665207", "name": "Tammy Hill", "time": 1595978942405, "rating": 1.0, "text": "I am the person who bought Mercedes and was on the phone with Kb Bolds when the estimate was given and heard everything that was said. Your person said $129.00 and that includes spayed, boarding for one night and a catheter. Then you called her twice requesting that she changed her review and because she doesn't you imply that she's trying to cheat you. How can you slander my daughter because she doesn't change her review when you guys even gave her a refund because you knew that you were wrong.\nIt's not even about the money it's about the principal. She owns two homes (CA and AL), 4 cars, an RV, and supports herself and her children, do you really think $400 means that much to her or our family.  Not one bit. You need to stop before I get my attorneys involved.", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "109452507198846749972", "name": "Stephanie LeBerte", "time": 1591012590961, "rating": 5.0, "text": "I've been to other big vets in town, & NOBODY has taken as good care of my babies than All Creatures. I was told by the \"other\" vet that my 5 yr old cat couldn't be saved, but All Creatures has given me options that the other vet didn't and now my baby is looking like himself again. I won't be taking my pets ANY where else from now on! 😁🐕🐾", "pics": null, "resp": {"time": 1591024925703, "text": "Thank you so much for the kind words!! The experience that you and Aubie had at our hospital is what we strive for each client and pet. Our motto is \"We give your pets the care they deserve!\""}, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "104914680039401386213", "name": "Kb Bolds", "time": 1594838774731, "rating": 1.0, "text": "I called to find out how much it would cost to get my dog spayed and they quoted me a price of $129 saying it included the spaying, boarding for one night, and the IV catheter. They get her vet records from my vet and told me she needed a bordatella vaccine, ok fine. I drop my dog off and they call me later to say she’s doing great. The next morning, they call and say she’s vomiting and want to give her an injection for the vomiting and I agree after them saying it’ll be $49 for it. I go to pick up my dog and the total is $415!!! I was charged $179 for the spaying, an additional fee for the IV catheter, and a stool sample that I didn’t even consent to.  I only brought her there instead of my normal vet because mine is an hour away and I have an infant but lesson learned! I will NEVER use this place again.", "pics": null, "resp": {"time": 1595970134879, "text": "Hi Ms. Bolds,\nWe are extremely saddened to hear that you felt as though your experience with us was not pleasant. We strive to give our clients and their beloved pets the best experience we can offer. Your sweet baby Mercedes came in on 7/14/20 for a spay, which went perfect. Unfortunately the morning after her surgery, we noticed that she was vomiting a little, which we immediately informed you about. When we spoke with you about the vomiting, our associate suggested treatment, which you approved. The relief veterinarian that was on duty thought a fecal exam (stool sample) would help us to be sure that there were no other issues associated with her vomiting, which may have been miscommunicated (we gladly refunded this nominal fee). With this test we did find that Mercedes had hookworms, which can be associated with vomiting in many pets. We informed you of her results and suggested we deworm her. At that time you declined that service. At pick up the receptionist informed you of all charges before finalizing any payment, which at that time you agreed to with no questions asked or problems. When we spoke on 7/16/20, two days after your sweet baby had her surgical procedure to discuss your overall experience, to our surprise you told us that you were unsatisfied with our services. At that time you stated that when you first called for a price quote you were quoted $129 for the spay and were also told that included an IV catheter. This could not have happened as all of our receptionist have been on staff for quite some time and know that these procedures are not included in the surgery fee. I think what happened (because it happens a lot) is that you truly wanted these important protective measures for Mercedes but it all added up to more than you expected it to be with the treatment for the vomiting and nausea. Also, on the sheet that you filled out with the list of recommended pre-surgical procedures such as blood work and IV catheter, the price is clearly stated next to it. Plus there is a box to check yes or no as to whether you wanted the procedure or not right next to the price. Why would we ask you to chose yes or no if it was already included? We refunded you over $107 (which we didn't have to do) as a gesture of good will and you still remained upset and gave us a negative review. Bottom line is that you chose the added procedures which were performed."}, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "110275777555581143864", "name": "Rebecca “Yo Momma” Saxon", "time": 1581459321576, "rating": 5.0, "text": "We've only being using this veterinarian office for a few months. We got a NEW PUPPY, Miss Lola, but we've finished our puppy shots and will be getting neutered soon. We have had nothing but great experiences here. ... professional and loving staff and Veterinarian. .", "pics": null, "resp": {"time": 1581464065444, "text": "Thank you so much for the kind words! We always strive to take care of our clients and their beloved pets in the best way possible!"}, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "100338195621923489186", "name": "Karey Johnson", "time": 1576686717786, "rating": 5.0, "text": "Christal, Kayla, Ashley, & Dr.Hankes went above in beyond to work patiently with my family & my aunt’s injured cat last night ! Thanks for being so amazing! I highly recommend All Creatures to anyone looking for a compassionate team to care for their fur baby... ❤️👏🏻", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "109749291101737733367", "name": "Jake McAllister", "time": 1586591927293, "rating": 1.0, "text": "Up sales!! BEWARE!!!\n\nSo to start this off please understand, I am not a medical professional, however I professionally remove and rehabilitate wildlife. I am very experienced in just about all wounds, injury's, illnesses, and human harm caused by domestic and non-domestic animals.\n\nI have recently adopted a Dutch Shepherd, my primary vet for all of my inquires is Mercy Hospital(whom in my experience I would trust with my own life!)\n\nMy dog was a rescue, obviously covered in parasites from previous settings.\n\nI explained the situation to the profession under review( my wife made this appointment due to the ease involving COVID-19, as mercy was booked)\n\nKeep in  mind as a wildlife professional, I have already assessed my dogs illness.\n\nThe main reason for a vet was to acquire a  accurate heart worm test.\nWhen handing over my beloved Dutch shepherd I caught myself telling the vets office about her harmless  Sinus Arrhythmia Heart Rhythm(very common in dogs while sleeping)\n\nLonger story shorter, the vet personally talked to me telling me that my dog has a serious heart murmur, and attempted to sway me into the tests to verify. I already knew with no doubt there is not a heart murmur.\n\nThe doctor himself turned into a upselling salesmen attempting to use sympathy to sway me into purchasing tests. I am also a licensed insurance producer for Alabama so I am very aware of salesmen tactics, and I will say he tried. He tried very hard in his sympathetic approach claiming I need to do it now, its very serious.\n\nI then proceeded to my normal vet at Mercy Hospital for a second opinion. My Vet listened to my dogs heart for an extended period, as well as got another in house vet to listen as well as me, we all concluded there is no murmur and the heart is in great condition, afterword's ran tests to conclude.\n\nThis goes to show, don't try to scam people on sympathy, you never know how educated the other party is in your field.\n\nAlso as a consumer warning always be weary of ratings when choosing a service, especially when life is involved, a huge amount of services either pay for reviews, or pay there employees a commission per 5 star review.\n\nI wouldn't use a dishonest practice such as this, but I also can not say my mentioned vet is your best choice, I only speak from personal experience.", "pics": null, "resp": {"time": 1591036913227, "text": "We unequivocally and absolutely DO NOT upsell unneeded diagnostics at this hospital! We offer and provide medically what is appropriate for each pet. We are sorry that Mr. McAllister did not have the experience at our clinic that he wanted. Due to the accusative and completely unfair nature of his review, we must clear up numerus false assertions that he has made. We have reviewed the chart from his dog's visit with the doctors and staff involved. After discussing, all involved remembered clearly the visit. To say that we use sympathy to perform inappropriate diagnostics is completely inaccurate and unfair.\n\nFirst, he requested (just like any other clinic, our receptionists write down EXACTLY on the chart what the client requests for us to do) to have his dog examined because lately she had been mopey. That was his exact words. The primary request was not to have a heartworm test performed. That was a secondary request.\n\nSecondly, his dog had a heart murmur and wasn't feeling well. That is something very different than a sinus arrhythmia which is completely benign. The further cardiac diagnostics that we offered to fully assess the heart condition in a rescue dog was completely indicated (remember this is a rescue in which the medical history is unknown) and was the best medical practice for this dog. Sometimes diagnostics that are performed come back normal and that is great but it doesn't mean that the diagnostics weren't indicated. All vet hospitals offer tests that commonly come back normal.\n\nBoth of our doctors have been out of vet school 24 and 47 years respectively and are very capable of diagnosing heart problems. They do not offer diagnostics that are not indicated but they do offer the best medical diagnostics and treatments for all pets. Do some pet owners decline to have offered diagnostics performed. Yes, every hospital experience this on a daily basis. Do some murmurs come and go? Yes. Did this happen in this case? Maybe.\n\nAlso, why did the other clinic go ahead and do the further diagnostics if it wasn't indicated?? The answer is that they were indicated! Unbelievable! The diagnostics that we offered were indicated.\n\nSo we were presented with a large breed dog that was approximately 5 years old (which makes it middle aged) and had been RESCUED. Dogs that have been rescued commonly have heartworms because they haven't receive proper care which includes heartworm prevention. If it had heartworms they very well could have and commonly can cause a heart murmur.\n\nBottom line: for someone untrained in the veterinary field that rescues and rehabilitates animals to accuse us of using sympathy and scamming people to increase diagnostics is deplorable. The other clinics in the area know we don't do this just as we know they don't practice this way either. This clinic has been here for over 45 years and the current owner has owned it for the past 15 years. We have a great reputation and thousands of happy clients.\n\nThis review is a good example of LIBEL and is illegal. It should be removed!"}, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "116996843010400338931", "name": "Willie Webster", "time": 1577117014737, "rating": 5.0, "text": "Exceptional  service. Best vet in town. i drive 45 minutes just to use them for my Hercules. Received  above and beyond service from Jeni Jami and Lara. You guys rock!!!!!!! Recommend to anyone.", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "113652118187234049675", "name": "Cynthia McKinney", "time": 1576649324080, "rating": 1.0, "text": "I recently went with my daughter when she took her cat in about a problem it was having. I felt we were treated very rudely by the vet. He made my daughter feel like she was mistreating her cat when I know she takes very good care of her cat. The cat got sick very quickly and he made it seem like her cat had been neglected for a long time. He seem to treat everyone rudely, we could here him get angry over trivial stuff and get mad at the people in the back. It was very unprofessional and my daughter said she is never going back. I had brought my dog in several months ago and saw Dr. Oaken and he was very nice and seemed really kind and helpful, I recommended the clinic to my daughter based on my experience with Dr. oaken, but then she got the other vet and didn't understand the difference. One of the ladies at the front desk was very sweet and nice, she was the one having a baby. I was shocked by the other lady, I found out later she was the manager. My neighbor is the one who told me she was the manager and she had had problems too. When I was there she kept putting people on the phone on hold to continue her personal conversations that had nothing to do with the business. She also gossiped the entire time I was there and even gossiped about a customer who just left!!1! That is awful and I couldn't believe someone like that would be manager. My daughter was in tears when she left, she paid over $200 to be made to feel like an awful pet parent. We will never come back and will tell other people too.", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "111645447804134108256", "name": "Lanette Parker", "time": 1582390266718, "rating": 1.0, "text": "The new management isn’t very personal or friendly.  This Lady who called herself the “manager” wouldn’t sell me the medication I needed for my dog. It was all very unfortunate and unprofessional. I’ve been going there for 5 years.  I can’t believe the Doctor hired someone so mean to be around animals. She was like a terrifying virus, don’t let your fur babies around her.", "pics": null, "resp": {"time": 1582664288185, "text": "Ms. Parker:  I am glad you took the time to express your concerns about the care you received in our clinic on Saturday, February 22, 2020.  I was sorry to hear you were already having a difficult day and we have all had bad days.  I empathize with you and I hope you are doing better.  Per our conversations, your cat Lily has not been seen by a doctor since May of 2018 and it is illegal to dispense prescription medications to animals not under routine veterinary care.  This is entirely to protect, your baby, Lily.  We are still here to provide for you non-prescription items for Lily and since Ava has been seen within a year, and has a negative heartworm test, we are happy to assist with any prescription needs you may have.  I am terribly disappointed my attempts to help you within the confines of our laws and affections towards the overwhelmingly important pets we are honored to care for was interpreted as you feel.  I am here if you would like to stop by the clinic at any time and work towards understanding each other and caring for Lily and Ava.  Kind regards, Catherine West, All Creatures Pet Hospital Practice Manager"}, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "113857204403122459356", "name": "Roger Paul", "time": 1583173681124, "rating": 5.0, "text": "Recently we began taking our three dogs to All Creatures Pet Hospital; we transitioned from another practice.  Dr. Hankes and his crew (Desiree, Allie, Catherine, Jackie, Ashley and Ellen) have been a true gift.  Sadly, one of our dogs became heartworm positive despite being on a heartworm medication. Dr. Hankes was abreast of the literature and knew that the med we were using has a failure rate against resistant strains that came to this area following Hurricane Katrina.  Dr. Hankes and his staff handled the transition of our three dogs with dignity, efficiency and professionalism.  On a busy Saturday he worked us in and again the following Monday for “round two” of treatment. We were allowed to be with our dog during treatment and every step in the treatment was explained.  We now have our dogs on a medication known to be effective against heartworm, including resistant strains.  When Nick had a complication following treatment, Dr. Hankes and crew worked him in yet again and got him back to feeling better.  It is a blessing to be in the care of a knowledgeable, kind and compassionate provider.", "pics": null, "resp": {"time": 1583193270702, "text": "Thank you so much for the kind words about our clinic!"}, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "110681762035490603471", "name": "J Lo", "time": 1575292757520, "rating": 5.0, "text": "Dr. Hankes and his staff are fantastic! I live in TN and was in town visiting friends and family, and needed a vet to check out my fur baby. He was able to work my puppy in last minute before the holidays for a minor surgery. He took excellent care of him and throughly answered all of my questions. He was so kind and professional. It’s so nice to have met a vet that I can trust...and that my little guy trusts, too. I wish I could find a vet like Dr. Hankes here in TN.", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "117127790104621680607", "name": "Leola Gibson", "time": 1560316570355, "rating": 5.0, "text": "Dr. Hankins is very approachable and kind. He explained to me in detail all issues involving my pet.  The staff is exceptionally accommodating, especially (mommy to be). I call her that because I can't recall her name.", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "117762308721949374959", "name": "courtney galvan", "time": 1541089238509, "rating": 5.0, "text": "My husband and I travel a lot for his job and a couple months ago my gsp was put on medication for seizures. Unfortunately it is a controlled substance and he needs to be seen by a vet for refills. I called All creatures vet and they were able to get us in the next day. All staff was incredibly friendly and was able to work with us in finding a non controlling medication. Prices were very reasonable as well! Highly recommend this vet!!", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "104376335640411744484", "name": "Keith Tolbert", "time": 1563895648740, "rating": 5.0, "text": "They saw our little 12 year old Shitzu with a severe bacterial and ear infection when they were about to close for the day.  We were so thankful because they could have turned her away since it was actually after closing time.  Thank you for staying open to see our little angel.  She was in agony, but with your treatment, she is on the road to recovery!  Thank you so much!!!", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "115282501871156808526", "name": "Lauren Herndon", "time": 1539517886307, "rating": 5.0, "text": "My husband and I took our puppy to all creatures for his 3rd round of shots and 3rd puppy visit. After having a very bad experience at Stewart animal clinic, this place did such an AWESOME job. They took great care of my sweet buddy, even when he got super excited. The vet checked his teeth, listened to his heart, looked over his previous records and asked us questions about his health the previous shots he had gotten. I was so pleased and happy when we left. The techs and front desk staff are also so great. Kelli checked me in and let me know beforehand that they had two emergencies come in and there could be a wait, I was okay with that and filled out paperwork. The two techs that worked with buddy did such an awesome job of helping keep him calm and holding him so Dr. Hankes could look at him. All in all, I’m so pleased with all creatures. You have patients for life!", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "111981421637696460434", "name": "Christina Presnell", "time": 1550006611093, "rating": 5.0, "text": "Dr. Hankes and all of his staff are awesome!  They took such good care of our furbaby!  I could not be more pleased with the care and service she/ we received!  I highly recommend All Creatures Pet Hospital! They are the best!", "pics": null, "resp": {"time": 1550025302724, "text": "Thank you for the kind words!"}, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "114223384209335430431", "name": "Tammy Hauerwas", "time": 1571683790791, "rating": 5.0, "text": "The only place I use for all of my animal's.  I love everybody that works there.", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "108554135132447281500", "name": "Robert K Miller", "time": 1503179183022, "rating": 5.0, "text": "I have been using All Creatures for several years. Dr. Ted and his staff are the best!  Dr. Ted will be gentle and thorough in the treatment and care for your fur baby. When my grand dog was fixed, he was well taken care of during his visit and overnight stay. Dr. Ted will instruct you on post op wound care, meds and rehab. I always recommend All Creatures, whether you live in Birmingham or farther out like Tuscaloosa it is worth the drive for the care and service you get.", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "100052420732393017264", "name": "Jacob Sides", "time": 1535571934427, "rating": 5.0, "text": "I’ve been taking my pup to there daycare program for a while now. She seems to enjoy it and the prices are much better then the others that offer daycare services in the Gardendale area. The staff will go above and beyond to make sure you and your animals are happy.", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "115871207503163822949", "name": "Joseph Hankes", "time": 1526655796608, "rating": 5.0, "text": "The staff here are consistently friendly and professional and genuinely care about your animal.\nThe quality of care and services far outweigh the reasonable pricing they offer.\nThe hospital has been recently updated and has a warm and comfortable atmosphere for both human and pets alike.", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "100987124145244403216", "name": "Kelli Hollon", "time": 1536950835968, "rating": 5.0, "text": "Absolutely the best. I had a terrible experience at a different clinic in gardendale. But this place exceeded all of expectations and took great care of my kitty and myself! Recommend this place!", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "103439554352736157804", "name": "Vincent Hocutt", "time": 1535771997209, "rating": 5.0, "text": "All Creatures is staffed with compassionate people that treat your pet like their own.\nAfter a misunderstanding in some treatment cost that had been duplicated from a visit at another vet.... even though it was found out the error was due to previous vets inadequate records, Dr Hayes offered to refund the charges.\nThe crew there takes great care of our FurBaby.  Highly Recommended.", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "101830081827683733328", "name": "Angela Morgan", "time": 1420080361179, "rating": 5.0, "text": "These people are life savers! I was in a serious bind when the vet office in Bessemer that I had made reservations with to board my babies failed to inform me of the fact they would be closing early that day! I called All Creatures right before they closed on New Year's Eve, and these wonderful ladies were so understanding they stayed for 30 minutes until I got there, and was able to go to my aunt's funeral the next day because of them! Thank you so very much!", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "107474056905308943515", "name": "Nancy hughes", "time": 1447473589986, "rating": 5.0, "text": "This is a great place. They know me by name and my pets.  Always friendly and very helpful. Will answer my questions anytime. Dr Hankes is a great vet and his assistants are wonderful.  I feel complete trust in them with my dogs. Thanks to all of you for making our visits great!", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "116944988903992995123", "name": "cheyenne m", "time": 1503182267980, "rating": 5.0, "text": "I'm a broke college student living in Tuscaloosa and I always take my dog to All Creatures Pet Hospital. Dr. Hankes and his staff have always been kind and caring, and you can tell that everyone is passionate about the well being of your pets. Even as a college student, the care is affordable and the 45 minute drive is so worth it! I have never been happier with pet care and I know that my fur baby is always well taken care of when we come here. I recommend this place to all of my friends with pets because they are amazing here. I'd give more stars if I could, 10/10!", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "103136168224154012801", "name": "Destiny Fitch", "time": 1468276055226, "rating": 5.0, "text": "The lady I spoke with on the phone was very nice! And made me feel safe about taking my dog there. We have an appointment this Thursday for my little ginger and we can't wait!!", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "118063223236336171828", "name": "April Clark", "time": 1519670404009, "rating": 5.0, "text": "I can not even describe how wonderful they are here!!! A week ago we thought we were going to have to put our beloved fur baby to sleep. Our baby has IVDD and another  local vet put the wrong medication in our baby’s pill bottle and it caused him to almost seem paralyzed and caused liver damage. Doc and Denise got our baby on the proper medications and with only 4 laser therapy treatments our baby is back to normal!!! Our dog is happy, walking and no longer crying in pain!!! Our family is beyond grateful to everyone here!!", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "102636973073547027030", "name": "Damaris Leon", "time": 1541266583035, "rating": 1.0, "text": "DO NOT CROP YOUR DOGS EARS HERE!!!!!\nIt has been 3 months and everything possible has been done to get my dog's ears to stay up. That includes the vet constantly having the ears taped and me doing the same at hone. When they told me they start doing the ears at 13 weeks and no earlier, I was a little sceptical because every other vet said not to do it after 11 weeks but since this was my vet for a while I trusted them. But now Im left with droopy ears and I paid $450 for it.\nThis is just a little heads up for anyone thinking about getting their dogs ears done here. Also the receptionist (Jenny) should not be allowed to work or much less talk to the clients, she has a horrible attitude and she's very rude and nasty.\nThey do not call you and let you know about stuff that happens, you just find out on your own when you get there. Apparently they don't watch the animals because I've had numerous issues with my other pets where they had to have surgery for injuries that occurred at daycare. They have lost me as a client and I'm telling everyone else too!", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "102417438085674997604", "name": "Ingrid Ridgeway", "time": 1561645372094, "rating": 5.0, "text": "First let me start of by saying I’m beyond thankful for Dr. Hanke and his staff at ACPH. About a week ago, we brought our puppy in because we honestly believed he had Parvo and was dying. To make a long story short, Dr. Hanke went to do a routine check and just so happened to touch our babies’ tail and we discovered it was insanely infected (he also had a serious skin infection). We scheduled him for surgery the following Monday and I must say, EVERYONE at All Creatures treated us like we were family to them! We couldn’t afford the unexpected expense of his treatment at the moment so they were willing to work with us on paying the bill. They even provide pet insurance!!—Which we are purchasing.  I can NOT thank these people enough for literally saving my fur baby, Luca. Highly recommended!!", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "107104450060484625328", "name": "Tammy Hayes", "time": 1505576541826, "rating": 5.0, "text": "My dogs, Luci and Savannah both love doggie day care.  I have used this vet for years and love them.  Service is great and prices too", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "106741270653134453184", "name": "Scott Plagmann", "time": 1496610343524, "rating": 5.0, "text": "This place has a great vet and the staff is top notch.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPCBjqdaP97tl4_3Aq00tQDbOAcyK0hSfvRrp6M=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "106080016512142048480", "name": "Brooke Tate", "time": 1506119931087, "rating": 5.0, "text": "Dr Hankes always takes the best care of my pets. Denise is always extremely helpful and knowledgeable and is always willing  and able to answer any questions that I may have about their care. I won't take them anywhere else!", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "110089194976346386351", "name": "Penny Harrison", "time": 1397055001266, "rating": 5.0, "text": "There is not enough wonderful things I could say about everyone at All Creatures Pet Clinic.\nI feel so comfortable boarding our fur babies while we are out of state I am able to enjoy myself knowing that they are in such great hands (They enjoy it as well).\n(All 3 of our babies and even a guinea pig receive all of their care here)\n\nOur German Shepard had an \"lump\" on his belly and Dr Hankes was able to diagnose a tumor and went up and beyond to send it for even further testing now our Snow is healthy and happy thanks to his dedication.\nThe compassion from the staff after I recently lost one of my fur babies was greatly appreciated .\n\nIf you have never visited the clinic I would highly recommend you do so, You would not be disappointed with their services.", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "116653825204108494120", "name": "Sharon Borrell", "time": 1397688451327, "rating": 5.0, "text": ". Dr. Hankes an his staff are wonderful. I have been using All Creatures for many years now and they have always been there when ever I have needed them. My baby (Gunter) has been going to Day Care since he was 10 weeks old. He goes two days a week and he LOVES it. He get so excited when he see me pull up in front of the building he can't wait to get out of the car. I have never seen a dog so happy  in a vets office  before. I would highly recommended for you to check out All Creatures Pet Hospital. There the BEST!!", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "101848136102071284991", "name": "Meredith Walker-Sims", "time": 1543166235952, "rating": 5.0, "text": "All Creatures has always treated our dog (a toy poodle named Baskie) with great care. Denise, Dr. Hankes? and the rest of the staff always do a wonderful job taking care of our baby.", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "103593373172094106440", "name": "Laura Wall", "time": 1506012699358, "rating": 5.0, "text": "This place is AWESOME! I take my hyper puppy everyday to their affordable doggy daycare. He is worn out everytime. The staff is very friendly and is always willing to answer any questions you may have!", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "107445082824652635700", "name": "Adam Roderick", "time": 1474061323231, "rating": 1.0, "text": "Took my cat in at 7:30am for some serious coughing fits that often led to vomiting. Waited until 11:30am to call and check in. When I called, they said she had been seen but that the Vet was busy and would call me back to discuss. I waited until 2:00pm before getting fed up enough to show up in person. When I showed up in person, they said she had not yet been seen (6 1/2 hours later). They said I could wait but that it would still be a while before she could be seen. The whole time I was there, I could hear loud dogs barking and making noise in the back. Lulu (our cat) is a very small cat (a runt I found when she was 4 weeks old after her mom abandoned her). Thinking about her being left in a cage for 6 1/2 hours with big loud dogs barking gets me livid. I have never written a review online before but this was enough for me to start. DO NOT take your pets here. Especially if you have cats. They are extremely careless and are very inconsiderate of mixing pets. The whole time I was checking in, a huge retriever kept sticking his face into the carrier I had Lulu in. The front desk saw that, saw me pushing him away, saw the owner doing nothing about it, and didn't say a word. Truthfully, everyone there seemed nice enough but they are incredibly sloppy and careless. And when you take charge of the care of one of my family members (yes, Lulu is a family member) sloppy isn't good enough. She deserves better.", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "109999028998088201506", "name": "TeResa Worland", "time": 1497099734689, "rating": 1.0, "text": "Vet is more interested in renovations than caring for animals. He neglected my animal to the point of almost death, within 2 days the new vet and surgeon had my cat at a 50 % percent change of living. When I asked for the records someone wrote on the last pave animal was fine at last list, yet within 2 days Mr animal had a 7 inch mass in his intestines. SO lying was also a great part of his heartless treatment. And for him to write the cat was fine. Was telling me he knew be was negligence in supposedly caring for my animal. Please don't take your sick fur baby to him, he is notorious for giving steroid shots which damage animals kidneys. Love your animal enough to avoid this place,", "pics": null, "resp": {"time": 1498512239729, "text": "We are sorry that Ms. Worland felt this way about our doctor. But we know this is not the truth. Our doctor is very caring and loves pets a great deal. We have remodeled and we do apologize for any inconvenience. But that didn't change the way we cared for her pet during that time frame, which was FOUR MONTHS PRIOR TO THIS REVIEW. We offered all the diagnostics that were needed to diagnosis the cats condition but Ms. Worland declined the tests that we wanted to perform. It is difficult to diagnose a condition without the proper diagnostics being performed. From the results of the examination Ms. Worland's cat appeared stable to go home. Also, an animal's condition can change dramatically and we are always here for clients to call us if a pet's condition changes. Finally, we seldom give steroid injections and only when they are warranted."}, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "116842390148341577838", "name": "Tammy Boyington", "time": 1578009840489, "rating": 5.0, "text": "Thank yall for taking care of my turtle Odais 🐢🐢🐢🐢🐢🐢🐢", "pics": null, "resp": {"time": 1583193512866, "text": "Thank you very much for the nice comment! We are glad to help anytime!"}, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "101323698672479144361", "name": "Shane Sanders", "time": 1569021166490, "rating": 1.0, "text": "They should change their name because they don't treat all creatures like their name says. Will never call them for anything again.", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "116842390148341577838", "name": "Tammy Boyington", "time": 1578009840489, "rating": 5.0, "text": "Thank yall for taking care of my turtle Odais 🐢🐢🐢🐢🐢🐢🐢", "pics": null, "resp": {"time": 1583193512866, "text": "Thank you very much for the nice comment! We are glad to help anytime!"}, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "110968603334737710963", "name": "ZombieJonathon", "time": 1572457300531, "rating": 5.0, "text": "The entire staff is extremely caring and thorough.", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "102458224045049088293", "name": "Doreen Williams", "time": 1408897203223, "rating": 2.0, "text": "I carried my dog in on 7/29/14. She finally is walking better. BUT NOW ANOTHER PROBLEM my dog was trained to her potty pads. So there is my problem , what did they do to my dog. I have got to start all over again . It is much harder with a grown-up dog. The dr said it would be easier. NO!!  For what I paid them for two days they need to re-train her. I am going to talk to someone concerning this matter . MY DOG WILL NOT GO BACK THERE .", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "101323698672479144361", "name": "Shane Sanders", "time": 1569021166490, "rating": 1.0, "text": "They should change their name because they don't treat all creatures like their name says. Will never call them for anything again.", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "114138934076821801867", "name": "Dakota Goodwin", "time": 1523439678412, "rating": 5.0, "text": "all 3 of my pets go here and I couldn’t be more satisfied.very clean and always friendly", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "114681558315651956917", "name": "Mindy Tobin", "time": 1539909234375, "rating": 5.0, "text": "So I have taken My dog here a few times. The first few visits were pretty routine. They are nice ,clean and respectful.My dog had some swollen lymphoids and he  needed blood tests and such. I couldn’t afford them right off. They went ahead and did the test and let me pay it in payments.That was really going beyond the norm when it comes to a vet. So the test came back As cancer. I am so devastated. I was so upset in the office that I had to walk out side and get my self together. When I was out there I locked my keys in the car! Grrrrr... My phone wallet and insurance information were all inside of the car as well! Dr. Fuqua called a lock smith and paid for thier services! I couldn’t believe it! He is a good doctor and an even better man! Thank u Dr. Fuqua!You are awesome!", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "105257758660789061321", "name": "Ben Baugh", "time": 1517976768325, "rating": 5.0, "text": "I have been using All Creatures for the last 10 years. I have 3 Dachshunds and Dr. Hankes and his staff treat them with great care.  I live 30 minutes away and its worth the drive to get great care for my 4 legged kids.  The staff treats our dogs like family. The services they provide are priced fair and reasonable.  In fact, Dr.Hankes  has made himself available on weekends to make sure our pets are taken care off when we have emergency's from time to time.There have been instances that we have needed his expertise on a weekend and Dr. Hankes has helped us out then as well. If you need a Vet that knows what hes doing, I suggest going to All Creatures and tell them Ben sent you.", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "108602806455638684510", "name": "Kelly Daniel", "time": 1438978717625, "rating": 5.0, "text": "We love visiting Dr. Hankes and his staff at All Creatures Pet Hospital! They always love on our two fur babies when we visit their office. Dr. Hankes was especially patient with our many questions when we added our most recent rescue puppy to the family. We wouldn't recommend anyone else to take care of our babies!", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "115662112798919420738", "name": "Charles McKinney", "time": 1517613526385, "rating": 5.0, "text": "Fantastic staff who will remember your name and your pets. Very personable.", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "102095681944039468707", "name": "Erica LaRoman", "time": 1345482453729, "rating": 5.0, "text": "Love the workers and how they treated my baby Minnie! I recommend them to any one they are nice to talk to.", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "102095681944039468707", "name": "Erica LaRoman", "time": 1345482453729, "rating": 5.0, "text": "Love the workers and how they treated my baby Minnie! I recommend them to any one they are nice to talk to.", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "103918678079866229241", "name": "Jennifer Levesque", "time": 1596296389024, "rating": 5.0, "text": "We have taken our fur babies to Dr Hankes for several years now. He kept my yorkie Rudy, who had congestive heart failure, alive and happy for many more years than I thought was possible. Once Rudy did pass away Dr Hankes was very kind and understanding of our pain he even sent me flowers. My other fur baby Fi-Fi a Chihuahua mix that had been abandoned in a box on the vets door step. Knowing I was looking for a puppy he gave us a call.\nWhen we got our next puppy Pete a few months ago from Tuscaloosa Metro Animal shelter we had dr Ted check him out and even though we had a free neuter do to us at the shelter we prefered to have Dr Hankes perform the operation because Ted uses more safety procedures and gives the animal pain meds to take at home where many vets skip things like IVs and pain control. Ted puts the animals safty and pain control as a high priority.\nDr Hankes has so much experience with animals from trauma (U.S. Army vet) to being a cat lover himself. He truly is an awsome vet.", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "104656971922029268349", "name": "Candy Rue", "time": 1345574830501, "rating": 5.0, "text": "I felt very comfortable with the staff here,  I felt 100 perfect sure in placing my bull dog in all creatures hands.", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "108681919785671716970", "name": "Marie Haulsey", "time": 1379620200951, "rating": 5.0, "text": "The folks at All Creatures took wonderful care of our four animals during the three years we lived in Gardendale.  Everyone was friendly, and took the time to get to know not just our animals' physical concerns, but also their personalities.  Our dogs miss their human and animal friends at day care.  In one case of emergency, Dr. Hankes and Denise stayed over an hour extra to take care of one of our animals, and in another, Dr. Hankes made a special trip back to the clinic for us.", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "117998599805149860440", "name": "Ken Levesque", "time": 1487194445803, "rating": 5.0, "text": "2-15-17:  my two dogs went to All Creatures two days ago with explosive diarreah and vomiting.  It was a horrendous weekend.  We tried Pepto Bismal and other things.  Monday morning I took my little dogs down there and was greeted warmly by the staff.  They showed genuine concern asked lots of questions.  The feeling I had was like they were family.  Then the doctor just didn't alleviate the sickness but it was almost \"creepy\" how he COMMANDED the situation.  My pets came home the same day and the vomiting and diarreah FULLY ERADICATED.  Animal medicine is converted into TALENTED HEALING at All Creatures Pet Hospital.  I can't another option around here.\n\nI've taken my 2 dogs to Dr. Ted many times in the last year or so and have had nothing but a great experience.  I think he's a terrific and caring doctor and extremely knowledgeable.  All of his staff are friendly and always on the move.  They don't like it when people have to wait and they seem to work really hard to get to everyone.  I also have had my 2 pets in the kennel there and I was invited to go back and see them anytime I wanted.  I did go back to the kennels and the \"condos\" and they are extremely clean and beautiful.  Dr. Ted is an Afghanistan Army Veteran so I'm really glad that my vet is a real vet!  He saved my little dog from a heart problem that otherwise would have killed him.  I went to Dr. Ted when the treatments he was getting in another Vet Clinic in Gardendale weren't having any affect.  I've been please ever since.  I won't go anywhere else.  I've never thought I over paid either.", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "115178883063432361616", "name": "Billy Hughes", "time": 1576164898282, "rating": 5.0, "text": "Kind and caring staff and doctor!!", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "104824351146275746878", "name": "Janet Sanders", "time": 1430956256211, "rating": 5.0, "text": "On Oct 31st 2014 my 4 pound toy poodle Gabbi was dropped by my elderly father. She fell four feet on her head to a concrete floor. She was unconscious and not breathing. I rushed her to her Veterinarian Dr. Ted Hankes at All Creatures. Dr. Hankes and his staff did everything right to save her life. At the time we did not know that she had two scull fractures and a fractured vertebra. Thankfully Dr. Hankes prepared for the worst. The care he gave her kept her brain from swelling and kept her alive. After getting Gabbi stable he sent me to an emergency hospital where he continued to call and check on her the entire weekend. I am very happy to say that because of his excellent care along with many other excellent doctors my precious girl is completely well. Other than the fact she is extremely spoiled and overweight. If you could see Gabbi today you would never know the head trauma she suffered. She had a checkup today and is doing very well. I can't put into words the gratitude I feel for the entire staff at All Creatures. Thank you to everyone that had a hand in saving my baby girl. Also thanks for the care you give her older sister CoCo.  My husband and I will be eternally grateful.", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "106885566855390386626", "name": "Jan Berry", "time": 1395353376351, "rating": 5.0, "text": "Dr. Hankes, Denise, and the gang at All Creatures are tops when it comes to taking care of my baby girl, Sasha!  BYW, please don't tell Sasha she's a c-a-t.  Sasha was adopted from All Creatures 12 yrs ago as a 6 wk old when Dr. Allen held the reins and my son was a lab tech.\n\nWith the arrival of Dr. Hankes (and my son was gone to college), as you can imagine there were questions about the changes coming.  I have been so very pleased with the continuation of great services and getting to know another vet who is not only a well trained physician but truly loves all the pets that come in and wants the very best for them and their guardians.  The big bonus is that Denise (Sr. Lab Tech), who Sasha usually sees - and Sasha's very shy, has won over my baby and even has her choosing to stay with Ms. Denise instead of me after injections and exams some days.  That says A LOT for the caring ways of the team at All Creatures and who they are as crew members/care givers not just employees..\n\nRecently, Sasha had a period of rapid weight loss after getting a kidney issue under control and Dr. Hankes found that she had a growth on her thyroid as well as fluid around her heart causing breathing issues.  She was a very sick little girl.  Dr. Hankes treated her heart and brought it under control and within a period of weeks.  Dr. Hankes, teamed with Dr. Hall, was then able to remove the problematic portion of the thyroid and the growth.  Now 4 wks after surgery, her heart is doing well - she's gaining weight and running round the house like a wild 4 yr old instead of a 12 yr old.  Dr. Hankes and Dr. Hall did a great job with the surgery, the staff let Sasha recouperate in her basket with a blanket from home and are now keeping a tabs on her for a while to make sure her remaining thyroid is functioning properly.  Thanks to their great care, we're looking forward to many more years together.\n\nI have recommended All Creatures to my family, friends and new neighbors who are in need of a vet and have for years and hope you'll see them, too.  I don't know of any Pet Hospital around where you can get the top quality care PLUS the Super Care Givers that are on the team with Dr. Hankes at All Creatures Pet Hospital.  You'll be glad you've found one of the gems of not only Gardendale but the Greater Birmingham/Jefferson Area.", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "117041687738664274347", "name": "Kaitlyn Koehler", "time": 1570464795622, "rating": 5.0, "text": "Everything and everyone was amazing!", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "115493978921809715947", "name": "Sueann Repp", "time": 1342807161608, "rating": 5.0, "text": "We have been very pleased with the care that has been given to our pets.  Thank you!", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "111167459858007808791", "name": "ralph thomas", "time": 1543513716897, "rating": 5.0, "text": "GREAT VETS, GREAT AND CARING EMPLYEES", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "106885555637997842027", "name": "denise Nance", "time": 1556329128413, "rating": 5.0, "text": "The staff are very friendly .", "pics": null, "resp": null, "gmap_id": "0x8889046cf4f5b825:0x6863f15c86bf3033"}
{"user_id": "111135354751366338635", "name": "lionspiritualjourney", "time": 1533589974924, "rating": 5.0, "text": "This place is so nice and clean. I called ahead of time and she took my dog back immediately upon arriving. The little dog that you saw in the picture it was the one that greeted me first. Alora is the lady who assisted and Bailey's nails came out looking great.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO-pNm-7cFrYm6b-EDk3H4RAr7h38SQP6ZGk1qy=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMIkInNV0n9qOb_6XXIQ5lLzQ-rURdY8RO68rHn=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP64eh1yt9KN0RiUWmvlgEv5n6ULAxwzuYPpOFZ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMuQhy1lZ8DackvS5E7Ff4Gi1qG1twDQRUCYYu0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMRsULJbFbQu6YalMsBKBYj5upehxIFD3ARK510=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNsAviEErOogAg8eY6xDaOn3-ESA4eBm5yecLx6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPmwch93rIVWHW87__dwJD_2XdtnvAsHlnWhA1B=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNL4cm7U5cZr1F6_dSHYlZKdTtBd-CKE-54VAAa=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPZqwZ6bWu94TorpqFXSJJALtH7W_sfb_iFlqTF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPlpYwr40-aLkUtUklS_QSfsou3iOzI7jsFIafk=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN-e28mME5cpGUwEvMu5g99Ayyl7paG8ZD21swt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN4osAgCue-ZLMBcusHA2oS5S-tBhRcu32qcZ2S=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPOn1CiMgfzNxPep1p3T-_P4SU0ICA-8oPdrAWx=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a430402b960ab:0xf593a1cf4c0cde4a"}
{"user_id": "114898270586392658119", "name": "Hope Russo", "time": 1540213659722, "rating": 5.0, "text": "Love the Ruff House! They've been great to my babies since Fall '16 and I can't imagine anyone else taking the care that they do! We use them for day camp, boarding, and grooming and have zero complaints!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNuCb5kMYDE6kf7ayglJ_9f35SpAD_KCt0HBQ0k=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNRvYx93p65gW2vghZtX9cMCqNoLAlxWL5hUBzz=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a430402b960ab:0xf593a1cf4c0cde4a"}
{"user_id": "112693126310120953268", "name": "Danielle “PersonalitybyDanielle” Simms", "time": 1528905524150, "rating": 5.0, "text": "Greattttt place take your furry babies for daycare, boarding, and Grooming! Amazing staff with outstanding customer service! Your babies would love to stay here!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP2YorzYJaiFSO6-Vbxm5yzODwg193exCzISp9P=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMAyRh5QD9wNBcELwSmwJ9DtQLBtv2t4EBh7gks=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a430402b960ab:0xf593a1cf4c0cde4a"}
{"user_id": "100684573603394200515", "name": "taylor fox", "time": 1505324301747, "rating": 5.0, "text": "This place is awesome! My dog is usually really excited to leave when he is boarded. This time he seemed like he wanted to stay and play longer at Ruff House. The staff was also very friendly and accommodating. We fled from Irma, and they were so understanding and they took him in last notice with no problem. When we come back to visit friends in Daphne, we will definitely board our dog here again.", "pics": null, "resp": null, "gmap_id": "0x889a430402b960ab:0xf593a1cf4c0cde4a"}
{"user_id": "107750570116286527862", "name": "Kristy Garrison", "time": 1505049503950, "rating": 5.0, "text": "This place is great!! We had to evacuate for Hurricane Irma and they were so helpful. Great staff,  very friendly and kind. It made going through this a bit easier.", "pics": null, "resp": null, "gmap_id": "0x889a430402b960ab:0xf593a1cf4c0cde4a"}
{"user_id": "106260178762036775336", "name": "Adam Pfaff", "time": 1429901910821, "rating": 5.0, "text": "Love the Ruff House and their professionalism towards caring for your animals! We have been happy to have been sending our pups to The Ruff House for day care and grooming since they opened. Our dogs always leave tired and happy, and our younger dog has made great improvements in obedience through training sessions with Hillary. Their boarding services are great as well. Highly recommend using them!", "pics": null, "resp": null, "gmap_id": "0x889a430402b960ab:0xf593a1cf4c0cde4a"}
{"user_id": "103403634076789283650", "name": "Jeremy Crutchfield", "time": 1436192129198, "rating": 5.0, "text": "My dog Callie loves the Ruff house!! They are always very nice and professional. When I pick my dog up she is tired and happy. Their grooming service is the perfect add on to doggy day care especially when you pick your pup up with trimmed nails and clean.", "pics": null, "resp": null, "gmap_id": "0x889a430402b960ab:0xf593a1cf4c0cde4a"}
{"user_id": "103944948452538363312", "name": "Cäy Cäy T", "time": 1524363521172, "rating": 5.0, "text": "My god mom works here and she is very good with grooming. She had been grooming for years and has always gotten compliments. The daycare is huge and your dogs make friends. You can also Adot dogs!", "pics": null, "resp": null, "gmap_id": "0x889a430402b960ab:0xf593a1cf4c0cde4a"}
{"user_id": "107038450638305850382", "name": "Marie Aussie", "time": 1534184200815, "rating": 5.0, "text": "I had a very good experience I found a fabulous little dog.  They offer everything from grooming to doggy day care it's fabulous very knowledgeable I spoke with Allore and wouldn't hesitate  to go back", "pics": null, "resp": null, "gmap_id": "0x889a430402b960ab:0xf593a1cf4c0cde4a"}
{"user_id": "100648980614015489141", "name": "MEgan Engelhardt", "time": 1459700654378, "rating": 5.0, "text": "THE BEST!! Our dog came from a puppy mill and this was the first time we had ever boarded him. Naturally I was so worried about how he would do/feel being there. After speaking with Gloria who gave me full details of their day to day,  Candace then went above and beyond to send pics and videos daily to ease my mind. Our boy came back so happy,clipped and groomed and smelling sooo clean. We will defiantly use them again! Thanks girls, you all were AMAZING!", "pics": null, "resp": null, "gmap_id": "0x889a430402b960ab:0xf593a1cf4c0cde4a"}
{"user_id": "115858369966488504577", "name": "Floyd Bartholow", "time": 1532771299216, "rating": 2.0, "text": "Place was not what I hoped seemed just thrown together", "pics": null, "resp": null, "gmap_id": "0x889a430402b960ab:0xf593a1cf4c0cde4a"}
{"user_id": "115757145031445845993", "name": "Geaux LSU", "time": 1520858827999, "rating": 5.0, "text": "Great place to take your fur babies for daycare, boarding, and grooming! Awesome staff!", "pics": null, "resp": null, "gmap_id": "0x889a430402b960ab:0xf593a1cf4c0cde4a"}
{"user_id": "118009668320533097487", "name": "Micky Farmer-Kretschmer", "time": 1533418880813, "rating": 1.0, "text": "My dog was attacked by a bigger dog at day care. They let the big dogs in with the little dogs. My dog is now scared of larger dogs due to this and had to be treated multiple times my a vet. Will never step foot in the place again or will I allow others that I know to bring there pet there.", "pics": null, "resp": null, "gmap_id": "0x889a430402b960ab:0xf593a1cf4c0cde4a"}
{"user_id": "107509266191471886253", "name": "Hayden Faison", "time": 1423603191232, "rating": 5.0, "text": "Great place to send your dog! Professional and loving staff", "pics": null, "resp": null, "gmap_id": "0x889a430402b960ab:0xf593a1cf4c0cde4a"}
{"user_id": "110652256418325071394", "name": "Deborah Taylor", "time": 1562201441452, "rating": 5.0, "text": "Staff very helpful", "pics": null, "resp": null, "gmap_id": "0x889a430402b960ab:0xf593a1cf4c0cde4a"}
{"user_id": "100625542193159115772", "name": "Lakeshia Dotson", "time": 1546800083991, "rating": 1.0, "text": "I use them for their daycare and overnight boarding. Recently, there customer service has gone down. They are not a friendly staff anymore.", "pics": null, "resp": null, "gmap_id": "0x889a430402b960ab:0xf593a1cf4c0cde4a"}
{"user_id": "102694117081977990327", "name": "Matt Heater", "time": 1520938405815, "rating": 5.0, "text": "Our dogs run from the car to the door to get inside, that says it all.", "pics": null, "resp": null, "gmap_id": "0x889a430402b960ab:0xf593a1cf4c0cde4a"}
{"user_id": "117442616275098442359", "name": "drizzay222", "time": 1414441369803, "rating": 5.0, "text": "My two border collies come home tired and happy!", "pics": null, "resp": null, "gmap_id": "0x889a430402b960ab:0xf593a1cf4c0cde4a"}
{"user_id": "103387348490060947746", "name": "Gail Tetting", "time": 1616884238023, "rating": 5.0, "text": "Very nice setup just some donations would help with food and bills, van load making trip to Wisconsin now, any help appreciated", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "112663284694295626682", "name": "Dr. Matt and Debra St. John", "time": 1543607885222, "rating": 5.0, "text": "What a fantastic place with fantastic people! before you look anywhere else for a dog or cat, you need to go see these wonderful people and let them found you the perfect pet.   Be sure to ask to say hi to \"Midge\", the in house \"Grumpy Cat\" who has her own room!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM2bK063AVYli2sTUHL4mf1ohnKYjffUHbZ038j=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNmYw5SGvccImx4pHyKGvAhfd6tzAqnPd-nvi8v=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNMMEQYrA2Jeis3jvsajVj4CYN6w2WkqI-XhEIu=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMxt5PPI_pgiIbESCEkeUYlRxAftGgKgCYJVCub=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPZw3JHnT0VjTi4MAY0JLGgJn89C8qspYdOzS90=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "103385298708348596430", "name": "Jennifer Betterman", "time": 1610476596289, "rating": 5.0, "text": "We wanted all the dogs but was able to adopt. Such nice facility and very nice staff", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "102861741785046892510", "name": "marie levison", "time": 1611959169849, "rating": 2.0, "text": "i alway thought spca was to help abandon animals.i have been there to buy and voliteer.i alway saw good in them.But i call about 4 or 5 dogs that was freezing to death  and starving .i called for someone to check on these dogs.the owner said the dogs froze and starved.and had parvo.the  person who went out needs to be fired.the poors babies needed help", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "101497037604515381783", "name": "hunterjweathers", "time": 1614264321542, "rating": 5.0, "text": "This place is a great place to find homeless pups kittens. They have a huge variety of different  breeds. All you have to do is walk in and look through the kennels or kitty room. The price to adopt a cat or dog is $80, however, this also includes a spay/neuter, clipped, includes all shots and vaccines. Most, if not all, of the great people who work here are volunteers. They are extremely friendly and will answer any questions you may have. Great place to adopt.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM4ZjR7_hx_1G5gv5_TfhAOX1z-nsDhPptsfF8x=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "102945816305397218045", "name": "Mary Rhinehart", "time": 1599758688954, "rating": 4.0, "text": "Took by bobbed tail black Cat with yellow eyes which showed up at my house. Unable to keep it. He is beautiful and cant get enough  petting. Would be great around children. Please adopt him soon.", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "101935297887002507756", "name": "Allan Chapman", "time": 1602295323556, "rating": 5.0, "text": "Excellent all around shelter! Whether you want to walk, pet or adopt. This is the best place!", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "115655096603014684802", "name": "leigh sutherland", "time": 1596673011017, "rating": 5.0, "text": "Leslie was amazing. She helped us find the perfect match for my hubby.\nThanks to all of you that work at this facility.", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "103626946930029603921", "name": "Fanny P", "time": 1604339701545, "rating": 5.0, "text": "They do a great job. Thanks", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "113441012307016873066", "name": "Jacki Todd", "time": 1559248905839, "rating": 5.0, "text": "This is an amazing place.. They are great with the animals.  Very friendly people.  I have adopted 2 of my babies from here and my daughter adpoted her kitten from here also.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOiBfV5lfgcv6DtxBRUl3OLtxUtG4FNfWje0KO_=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "111325507224092191751", "name": "Wade Sizemore", "time": 1578922153291, "rating": 5.0, "text": "They have a good selection of dogs from large too small they usualy have labradores more than any big dog love this place they are a great staf very helpfull they realy care about animals.", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "115846014411911323259", "name": "Patti Neal", "time": 1537535121308, "rating": 2.0, "text": "I took in and helped care for a starving,  sick, rescue.  Although I knew I couldn't keep her, I grew to care for her. I didn't even know she was going to have kittens as I had to go out of state to care for my mother. I loved the sweet babies.  I kept them clean,  fed well and truly tried so hard to find homes for them.  I live in an apartment and couldn't keep them. I had my friend who helped me with them. I heard good things from people about this animal shelter and was told they have a friend's group who tries to help adopt. I took mama and 5 sweet babies to them. The woman on the phone was kind, but did explain they do euthanize.  I understand that but our kittens were beautiful,  healthy,  well socialized and mama loved her babies.  They were 6 weeks old still nursing.  I cried when I had to drop them off. The woman who came out of the back door who took them was rude and uncaring towards me and the mama and kittens.  I just didn't want mama cat separate from her kittens because it was traumatic for her anyway. I asked her if kittens would be kept with mama cat and she cruelly answered \" I don't know . \"They could be euthanized tonight....i understand that she didn't know what shape they were in, but it was just the hateful,  mean way she answered me. It breaks my heart to think that she wouldn't at least try to be kind to my scared mama kitty or her kittens. Even if they would not be adopted,  just be kind to them. They never asked to be born.", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "111052845750319451661", "name": "Jennifer Smith", "time": 1559365072611, "rating": 5.0, "text": "These people are amazing and work so hard to get animals into loving homes. Why is it so hard for people to understand that if they spay and neuter their pets we wouldn't have to worry about all the ones in shelters being put to sleep.?", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "105558885392477345134", "name": "Glenda Hutson", "time": 1535717253014, "rating": 2.0, "text": "Got the perfect little kitten, he is a love and I'm really glad we adopted him.  However; they did not do everything offered upon adoption.  They advertised  beginning shots, micro chip, rabies shot neutered for the $80.00.  They didnt give him his beginner shots, only a 6 month rabies shot and they actually just gave me the micro chip.  The staff was far from being nice.  The little kitten is awesome so it was worth the fee to get him.", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "114648226391143085079", "name": "J L", "time": 1591922446449, "rating": 5.0, "text": "Doing good work and it was pretty clean aswell", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "116210121948891215541", "name": "Jennifer Landrum", "time": 1562616976928, "rating": 3.0, "text": "Very clean and people are very nice. They don't respond to Facebook messages.", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "101465262739794606626", "name": "Kendra Cellary", "time": 1603399158242, "rating": 1.0, "text": "No one answers the phone at this business.", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "108748067824966782116", "name": "Peg Mager", "time": 1534644910292, "rating": 3.0, "text": "I was told the dog I adopted was 3 yrs old which is what I wanted, got home and 3 pairs of shoes later, I take her to my vet for upset stomach and he checked her teeth and informed me she MIght be 1 yr old!! I didn't want a puppy, I'm 65 but we were already emotionally attached so we will keep her. The same thing happened to a friend of mine. What's going on there?!! Get a vet that can tell age accurately!!", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "100244607918074043730", "name": "Robyn Culbert", "time": 1583720968120, "rating": 5.0, "text": "Very good people and awesome with the animals.", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "105664671182517564962", "name": "Jason Welsh", "time": 1577223749923, "rating": 4.0, "text": "The people I talked to where very nice, and knew what advice to give me on getting a litter of puppies a home.", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "101388130793284132494", "name": "Nathaniel Rice", "time": 1587174459577, "rating": 1.0, "text": "terrible service, these people have a hatred of pit bull breeds and rottweilers", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "117528414768871395450", "name": "Chelsey Lavery", "time": 1544819495307, "rating": 4.0, "text": "Respectful workers with a good heart. Although they really need to update some of the kennels.", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "112950761099319371524", "name": "Jennifer Stango", "time": 1579642017575, "rating": 4.0, "text": "The staff are super helpful, but it is sad there are so many animals with out a home. I wish I could take them all home with me.", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "113765679892392869013", "name": "Gail Wagner", "time": 1522630465062, "rating": 1.0, "text": "I think gave killed my dog he just came up missing. Then another one was put down after my daughter passed away before I had time to collect him. Thanks killing center.", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "107016509746925706403", "name": "Maxine Kaylor", "time": 1552335511603, "rating": 4.0, "text": "Staff was friendly and the kennels was clean no stink whatsoever", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "105496763529584956982", "name": "Ashley Bain", "time": 1484677224361, "rating": 5.0, "text": "I adopted a small dog from the DCAAC. All staff were very friendly and seemed to care about the animals. #Adopt", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "108652708621896055192", "name": "Tammy Helton", "time": 1581446483544, "rating": 4.0, "text": "They try to adopt out rescues", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "112321988205046490712", "name": "Kim Hardin", "time": 1591833666214, "rating": 5.0, "text": "Love  animals.", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "114966145599620131800", "name": "Mary Mackey", "time": 1573850065446, "rating": 5.0, "text": "Don't know haven't been there.", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "104100961846277395451", "name": "Suzie Tripp", "time": 1563306493446, "rating": 5.0, "text": "Very clean.  Animals inside kennels have a/c.", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "117980388994160021453", "name": "Ace Taylor", "time": 1561163378524, "rating": 5.0, "text": "Amazing place", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "110675307616656122288", "name": "Jason Higgins", "time": 1579567401853, "rating": 5.0, "text": "Staff friendly", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "114781770837232139716", "name": "John rahilly", "time": 1584240553142, "rating": 5.0, "text": "great atmosphere", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "110152740791740987403", "name": "michael nance", "time": 1583662116250, "rating": 3.0, "text": "Good", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "111612853894876750278", "name": "Jeromy Hughes", "time": 1519671691770, "rating": 5.0, "text": "Very clean facilities good folks", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "117084776151340922860", "name": "Divell Bell", "time": 1558838410986, "rating": 1.0, "text": "Ok", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "112868067140666628396", "name": "Christy Carroll", "time": 1459477455580, "rating": 5.0, "text": "I need a dog so much that I am freakin out about this", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "110085419727369396673", "name": "Jon R", "time": 1469155711238, "rating": 5.0, "text": "Some of the staff is friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
{"user_id": "106773925008625440468", "name": "Debbie Kiser", "time": 1431508263783, "rating": 5.0, "text": "Wonderful Caring People!!??", "pics": null, "resp": null, "gmap_id": "0x888a78043dd1de13:0xfc9e491d22b39b8e"}
