{"user_id": "105250933421616928711", "name": "Shiree Wilson", "time": 1622846414766, "rating": 5.0, "text": "What a wonderful stay. My husband and I went for a week for my birthday and it was exactly what we were looking for. Cozy, quiet, and adorable. Across the street from the beach, a small grocery store a block away, you couldn't really ask for more. The host was responsive and friendly for any questions I had. I will be returning here in the future.", "pics": null, "resp": null, "gmap_id": "0x889a1b42e6284589:0xf84660aae0d47b52"}
{"user_id": "109178610807708572968", "name": "Annette Sundholm", "time": 1591548671411, "rating": 1.0, "text": "Bad weekend .. Weather !! Pier closed for repairs . nothing much to do cut vacation short and went home..", "pics": null, "resp": {"time": 1591830721657, "text": "Sorry you had bad weather for your vacation. I'm also sorry you gave my property a poor review when you weren't even a registered guest with us. My guests booked through Airbnb and remained throughout their vacations.\n\nTo see real reviews (5 star) of our properties by real guests, please visit us on Airbnb, listing numbers 27468129 and 5811350."}, "gmap_id": "0x889a1b42e6284589:0xf84660aae0d47b52"}
{"user_id": "100168830764224037491", "name": "Sandra Murdock", "time": 1500399411406, "rating": 1.0, "text": "Gulf shores is a great place to stay if you like short walks on the beach because every 500 ft is another private beach. If you like a beach that's crowded it's awesome. If you don't want to fish it's great. If you like to spend outrageous prices for a place to stay or food this is the place for you!!!", "pics": null, "resp": {"time": 1500400735824, "text": "This person was not a guest at Gone Coastal at Sea & Sun in Gulf Shores. To see reviews by actual registered guests, visit our listing at Airbnb.com."}, "gmap_id": "0x889a1b42e6284589:0xf84660aae0d47b52"}
{"user_id": "113218158879741305622", "name": "T Jordan", "time": 1528965534710, "rating": 3.0, "text": "Served all our purposes. The air works great, lots of hot water, the place is clean and all the appliances work.Good location to the beach. But it could use some updates. Especially the couch.", "pics": null, "resp": {"time": 1529900572213, "text": "The guest leaving this review did not stay at Gone Coastal at Sea & Sun in Gulf Shores. The unit does not have a couch, and we are continually making improvements . To see reviews by actual registered guests, please visit our listing at Airbnb.com."}, "gmap_id": "0x889a1b42e6284589:0xf84660aae0d47b52"}
{"user_id": "109595882042072648416", "name": "Sarah Lewis Hodge", "time": 1439780879226, "rating": 5.0, "text": "Me and my fiance stayed here last year to get married on the beach.  We both loved it here.  Nice owners and clean rooms and very close walk to the beach.  We would definitely stay here again!", "pics": null, "resp": {"time": 1447267300507, "text": "So happy you enjoyed your time in our beach home! We appreciate great guests and thoughtful reviews. We look forward to accommodating you and your husband on future travels. Here's to a great marriage and a very happy life together! - Laurel"}, "gmap_id": "0x889a1b42e6284589:0xf84660aae0d47b52"}
{"user_id": "104930092676075287712", "name": "Daniel Johnson", "time": 1500413917118, "rating": 5.0, "text": "Saw dolphins saw a crab there is an arcade named fat daddy shrimp basket I amazing it was just awesome", "pics": null, "resp": null, "gmap_id": "0x889a1b42e6284589:0xf84660aae0d47b52"}
{"user_id": "114278981912385363023", "name": "Jeremy Mccarter", "time": 1564953329636, "rating": 5.0, "text": "Clean and really nice place as always", "pics": null, "resp": null, "gmap_id": "0x889a1b42e6284589:0xf84660aae0d47b52"}
{"user_id": "115299751967210277226", "name": "Dale Jackson", "time": 1582239537491, "rating": 5.0, "text": "Clean , affordable, and conveniently located.", "pics": null, "resp": null, "gmap_id": "0x889a1b42e6284589:0xf84660aae0d47b52"}
{"user_id": "104098201959018052715", "name": "Tim Randall", "time": 1465282368771, "rating": 5.0, "text": "Love this place", "pics": null, "resp": {"time": 1467821445477, "text": "Thank you for your five-star review! We appreciate your business and look forward to seeing you again. Have a great summer!"}, "gmap_id": "0x889a1b42e6284589:0xf84660aae0d47b52"}
{"user_id": "110754167864967317523", "name": "Kim M", "time": 1453725443975, "rating": 1.0, "text": "Never mind.", "pics": null, "resp": {"time": 1447270099117, "text": "Who are you?"}, "gmap_id": "0x889a1b42e6284589:0xf84660aae0d47b52"}
{"user_id": "106767046409309645420", "name": "Brittany Burney", "time": 1615348761246, "rating": 5.0, "text": "These are the best apartments I’ve ever lived in! The grounds are quite and nice. The apartments themselves have a very welcoming and homey feel and the staff is amazing! Everyone is so friendly and easy to communicate with. I highly recommend it here.", "pics": null, "resp": null, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "115777500232907400619", "name": "Teresa “Dee” Collier", "time": 1615348542427, "rating": 5.0, "text": "I really enjoy my apartment. Everyone seems to be really nice. All the office staff are always so helpful and polite. This has been a great place to live.", "pics": null, "resp": null, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "106136897621998919762", "name": "Ami Taylor", "time": 1602741480629, "rating": 5.0, "text": "We absolutely love our apartment. We have brand new appliances and carpet. The closets are huge and so are the rooms. I can’t say enough good about the staff. They’re attentive and so kind. My only complaint is that I didn’t move in here a long time ago!", "pics": null, "resp": {"time": 1603389529743, "text": "Thank you,  we are so happy to hear that!"}, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "112803778755676289171", "name": "Mindy Stoneburner", "time": 1615774127987, "rating": 5.0, "text": "ABSOLUTLEY a beautiful complex , & wonderful management & super friendly staff.", "pics": null, "resp": null, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "115839171840040648564", "name": "Seokwon Lee", "time": 1596906944807, "rating": 1.0, "text": "Where to start... first off the pictures that are posted Is definitely not what you see! They lie about your monthly rate just to wheel you in and charge you way more, they say water, pest control is included in your rent and that’s a lie!! The apartments are infested with gnats and roaches!!! Maintenance is sorry and never fixes NOTHING!!! they are always outside of the units smoking and hanging out not a good look at all!! Apartments floods, issue is never fixed! Front office staff lies. This is been the worse experience ever!!! I wouldn’t recommend this place to a homeless person", "pics": null, "resp": {"time": 1597254576707, "text": "While we always like to hear from our residents, we’re sorry to see that your experience does not reflect the high standard of living we strive to provide. We sincerely apologize that your experience with us was not a positive one. We are always open to opportunities to improve our service and welcome you to our office to see if we can resolve any outstanding issues you've experienced."}, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "104587537716178702841", "name": "Katrina Looney", "time": 1599072295740, "rating": 4.0, "text": "Hello and I would like to say thank you to the office staff of City Heights Homewood for listening, understanding & followup with my work order request.  Thank you to the maintenance crew who are working hard with the workers orders & your understanding.  Thank you again.", "pics": null, "resp": {"time": 1600941967974, "text": "Thank you so much for your review! You made our day!"}, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "103292144030683705862", "name": "George Davis", "time": 1599064510826, "rating": 5.0, "text": "The office staff is superb and nothing short of amazing. THANK YOU MRS. ODOM for all the help you constantly provide. This new system and team give hope to this area community. The best, apartments ever!!", "pics": null, "resp": {"time": 1604774001929, "text": "Thank you so much for your review! We will strive to continue with our tradition of high service quality!"}, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "105345753116497319968", "name": "Noplacelikeths P", "time": 1602228350172, "rating": 1.0, "text": "I would like to say that first off the pictures that you see on the internet are very misleading . Me and my roommate moved in less than 5 weeks ago . There were roaches in the nasty and dirty refrigerator when we first moved in . Around the third week we started to see more and more roaches crawling up the wall , through the kitchen cabinets , under the sink , in the bathroom. And me and my roommate are very clean people so we know that these bugs did not come from us . We even went and bought expensive bug spray that SHOULD prevent bugs from coming in your apartment to you to a year . That doesn’t work ... not to mention the doors are very flimsy , the plumbing is old rusty and dusty . The water goes out almost every week without warning . They add extra fees saying that it’s for cable , and WiFi etc . But when we first moved in those things were “free “ or “included in rent “ . They don’t care about your well being at all , all they care about is getting a check and I really feel played because basically I am paying to live in a dump full of roaches .", "pics": null, "resp": {"time": 1602434906836, "text": "We are really sorry you had such a negative experience with our property. At City Heights we strive to provide the best service at all times. Could you please reach out to our office so we can understand your issues and sort them out? Thank you!"}, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "112809330797149066683", "name": "Zoe Duncan", "time": 1557690804127, "rating": 1.0, "text": "They won't fix a single thing in our apartment, despite several of the maintenance requests being listed as \"emergency,\" such as the constant leak in our ceiling that has been there for over two months now, but they'll spend money on billboards...\n\nDon't live here. Neither you nor laws regarding apartment complexes are their priority here. Their priority is your money.\n\nThey will also not disclose that you HAVE to purchase their $75 cable/internet package, which if you have to work from home, you won't be able to because the Wi-Fi is so bad you can barely even stream Netflix on it.\n\nThey have changed property managers every 2-4 weeks for the past six months, and maintenance doesn't work at all. They sit outside the office's garage and smoke cigarettes all day, and MAYBE take a joy ride in their little maintenance golf cart.\n\nDon't waste your money. It's Homewood prices for a slumlord complex.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOZwWbNPsgZvXGssuuMiLeAfvtec1leGeyv9RgK=w150-h150-k-no-p"]}], "resp": {"time": 1541001155069, "text": "Zoe, it is unfortunate to receive a review such as this. We apologize for any issues that you may be experiencing due to unresolved issues prior to our management transition this past August. Upon learning last week of the maintenance problems you'd been having, our management and maintenance team scheduled to visit your home the very next day in order to assess your situation. However, due to the condition of the home upon entering, they were not able to properly provide any resolutions to your requests. We can assure you that your home was securely locked after our exit. We spoke with both you and your husband regarding the condition of your home, and the necessary steps that needed to be completed before we can make any repairs. We want all of our residents to feel comfortable and at ease in their homes, which is why it is imperative that we help rectify this circumstance as soon as we can. We would appreciate the opportunity to address any of your current questions or concerns offline, and encourage you to visit our office or give us a call at your convenience."}, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "116855212562300759383", "name": "Dean Winchester", "time": 1594739893477, "rating": 1.0, "text": "WORST MANAGEMENT. WORST SERVICE!!! Your not on a water bill by yourself so you’re paying for other ppl water depends on how many ppl in the building. A high unnecessary bill. My first apartment please do not rent here !!!!! They are nasty and do not care about ppl. Will see you calling and not answer the phone if y’all have encountered problems. Please run!!! You’ll regret it", "pics": null, "resp": {"time": 1595014568673, "text": "We’re disappointed to see some aspects of life in our community have fallen short of your expectations and we would love the opportunity to improve your experience. Our residents are our number one priority, however, we are sorry if you feel like this has not been the case. Please contact our office so we can discuss your particular concerns further."}, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "105994141272404213433", "name": "Cynthia Dugger", "time": 1599163680446, "rating": 5.0, "text": "Andre did. A great job", "pics": null, "resp": {"time": 1599237525696, "text": "Cynthia, we are happy to hear that! Thanks for the special shout out and we will be sure to pass along your kind words to our team member."}, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "118148121503760953423", "name": "Jalen Kelley", "time": 1588707941461, "rating": 1.0, "text": "You can NEVER get anyone on the phone & it takes them a month or two to come out & fix things. I’m very disappointed in them & I haven’t been staying here for a good two months & already ready to MOVE. They are terrible", "pics": null, "resp": {"time": 1589840325830, "text": "We’re sorry to see your customer service experience has fallen below our high standards of resident care. We’d appreciate another chance to improve upon our communication with you by speaking in person. If you’re willing to try again, we invite you to stop by the office so we may have an opportunity to talk through your concerns."}, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "114145361480898050107", "name": "katherine owian", "time": 1568745147655, "rating": 3.0, "text": "Frequent changes in management & management companies do not make for a happy/healthy atmosphere. The owner of the complex in 80's & 90's knew the way to treat people. He had a dynamic office manage. The staff were well treated so they responded with good treatment of tenants. This was a family oriented place to live. In 30 years there have been plenty of changes. A few have been good. But neglect, bug infestation, sloven neighbors make for less desirable conditions. We stay for convenience to UAB Hospitals & doctors. We have reared a family here. We love Homewood & will stay as long as it takes to get medical care.", "pics": null, "resp": {"time": 1569005589950, "text": "Katherine, we sincerely appreciate our feedback, and we are honored that you and your family have continued to be an amazing part of our community for so long. We can assure you that our current team is dedicated to providing a comfortable, well-maintained environment for all of our residents, and we apologize if you have received the opposite impression. We would love the opportunity to improve your stay with us, so please feel free to reach out to our office directly if you would like to discuss any concerns with our management team. Thank you kindly, and we hope to hear from you again soon."}, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "101051065779863661306", "name": "Googlejunkie", "time": 1614304771422, "rating": 1.0, "text": "Do not move here unless you have to.\nEvery time I put in a work order I end up having to fix it myself because they don't fix it or take way to long to address the problem\n(Edit) they responded trying to blame it on covid...\nMy garbage disposal fried making all drainage back up in October, before the pandemic they didn't come until February where I had to tell them too late I fixed it myself", "pics": null, "resp": {"time": 1589994829062, "text": "We are sorry to hear that your work order has taken longer than expected! We try to fulfill all maintenance requests in a timely and efficient manner, regardless of high volume. In addition, due to COVID-19, our team has been on emergency only work orders since March 27, 2020. We understand your frustrations and encourage you to contact our office if you have any outstanding work orders."}, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "102182948057454386046", "name": "Morasha Bouie", "time": 1593207404594, "rating": 5.0, "text": "Britany help made my process smooth and she had a very positive attitude", "pics": null, "resp": {"time": 1592505930329, "text": "Thank you so much for the 5-star review! Please let our team know if you have any feedback about your living experience. Thanks again!"}, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "111634218765744062247", "name": "Alejandra Leon", "time": 1585257197093, "rating": 1.0, "text": "DO NOT MOVE HERE! They're not worth anybody's money! This people will literally stress you out! Can't wait till our lease is over!", "pics": null, "resp": {"time": 1589840318099, "text": "We value resident feedback and would welcome the opportunity to address any concerns you may have in greater detail. Please set up a time to meet in person with our office. We hope to work together to improve your rating of our community."}, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "108173251925875156667", "name": "Redds World", "time": 1605231772343, "rating": 1.0, "text": "I’ve been living here for months , had many problems, that still haven’t been fixed, dishwasher , floor, etc they don’t answer the phone, they don’t come when they’re suppose too , I’ve had a hole in my bathroom ceiling that was suppose to be patched back up going on two weeks now and I’m starting to see roaches , Do not move here it’s stressful !!! Facts", "pics": null, "resp": {"time": 1605461487910, "text": "Could you please reach out to us at customer.service.ch@centrapartners.com with more details, so that we can resolve your issue? Thanks!"}, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "106268753828276662789", "name": "Sonya Bratton", "time": 1564928732139, "rating": 1.0, "text": "My son and I are current tenants here and my only day off is Sunday , but I have to deal with some sort of issue every other day.. August 8 , I get up to my kitchen floor flooded, at least 2 inches of water... no clue where it came from... this property is a joke, failure... and disgusting !!\nI DO NOT RECOMMEND THIS PLACE!!! You’ve been warned!!!", "pics": null, "resp": {"time": 1565639893449, "text": "Our top priority is providing comfortable, well-maintained homes for our residents, and we sincerely apologize if you feel we have not matched up to your expectations. We try to fulfill all maintenance requests in a timely and efficient manner, regardless of high volume. Please be sure to place an online maintenance request and reach out to our office at your earliest convenience if you are still experiencing these issues. We hope to hear from you again soon. Thank you."}, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "101052960332873010154", "name": "Victoria Littlepage", "time": 1559444802119, "rating": 1.0, "text": "I’ve been staying here 3 yrs and never had a problem until we were under new management. I’ve put in multiple works order for my AC to be fix and it’s been 3weeks ive called multiple times and still no one has came out . They don’t keep up with your rent and have constantly try to tell me I owe but lucky I keep my receipts then when I show them that’s when they find it saying I paid the rent. Communication is horrible. They never answer the phone I’ve had to call 10x before someone picked up during normal business hrs . They always want to say we’ll call you back but never do the staff is rude and doesn’t care at all . I HATE this place . Then they had time to reply to this review online but still haven’t came to fix my air nor answered the phone at all today ❗️", "pics": null, "resp": {"time": 1559323231070, "text": "We are so sorry to hear that miscommunication has been an issue during your stay, and we apologize for any inconveniences you've encountered. We can assure you that our staff is here to help our valued residents get the excellent stay they deserve, and we sincerely regret that your interactions have not reflected the high standard of service that we aim to provide. We would appreciate the opportunity to improve your time in our community, so please reach out to us in the office and we will be more than happy to discuss your concerns. Thank you."}, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "104939388435066492958", "name": "Tia Harding", "time": 1568564413856, "rating": 1.0, "text": "It takes them on average a month or more to get done with a maintenance request. They are always getting new owners witch means more problems. They dont clean up the mess they make after fixing a problem with your apartment. Literally worst apartment complex I have ever lived in! If you are thinking about living here think again. It's not worth it! And Oh yea all the pipes in these apartments are basically rotted and S%^@!", "pics": null, "resp": {"time": 1568819624458, "text": "This review is deeply concerning to read as our maintenance team works hard to ensure that our residents are comfortable and happy in their homes. We would like to learn more about your concerns and work with you to improve your stay. At your convenience, please stop by the office to speak with a member of our team. We hope to hear from you soon."}, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "115909074867337386911", "name": "jacquelyn johnson", "time": 1552045734178, "rating": 1.0, "text": "If I could give no stars I would. DO NOT MOVE HERE. They are so lazy. They don’t fix anything. It’s income tax season so now they want to try and fix up the place. Maintenance ride around all day on those golf carts doing nothing . They never answer when you call. Maintenance never come fix anything. They are so roach and gnats infested.", "pics": null, "resp": {"time": 1552418579102, "text": "Jacquelyn, we are very concerned to hear of your negative impression of our community. We can assure you that our top priority is providing comfortable, well-maintained homes for our residents, and we sincerely apologize if you feel we have not matched up to your expectations. We try to fulfill all maintenance requests in a timely and efficient manner, regardless of high volume. If you have any outstanding requests that you feel are taking longer than expected, please come by the office so we can work with you to provide a quick and thorough resolution. We'd like to learn more about how we can improve your stay, so we hope that you'll reach out to us at your earliest convenience, thank you."}, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "116794547364978239397", "name": "Tootie Boo", "time": 1530983359511, "rating": 1.0, "text": "These apartments are a total DUMP! They have the laziest maintenance workers in the world. I signed my lease and the the apartment was filthy! Bugs in the refrigerator, blinds were utterly disgusting. The dishwasher was full of filth and mold. I tried contacting Justin on numerous occasions through email and by phone and he NEVER returned my calls. My air went out and NOBODY called me back about it. If you’re looking for somewhere to live Olympia Village is NOT it. Run!!!!", "pics": null, "resp": {"time": 1530896016113, "text": "We are deeply concerned to receive feedback such as this, as we strive to provide our residents with the best service and best homes. We take any maintenance requests as well as any mention of pests very seriously and we are concerned to hear of your experience. We certainly want to make sure that we resolve your concerns, and we invite you to come into our office so we can discuss this."}, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "112274083493047287663", "name": "Juan Sanchez", "time": 1559020901160, "rating": 1.0, "text": "I've been here two years now and ever since we had that cold snap back in January or February our ac/heat has been out. I've put in work orders but no one has come by. Ive got a water leak in my ceiling that's been going on for two months cause it's been on and off but it's been none stop for a month now. We've got mold on our ceiling and our carpet is drenched and mildewy. Ive got to sleep in this room. Combine this with no ac I've got a freaking steam room. This environment is deplorable. Yet they still want me to pay the rent. Shame.", "pics": null, "resp": {"time": 1559323242850, "text": "Juan, we are disheartened to hear that your time our community has not been more positive. Our goal is always to provide maintenance services in a timely manner, regardless of high volume, and we sincerely apologize if this has not been the case in your experience. If you have any outstanding requests that you feel are taking longer than expected, please come by the office so we can work with you to provide a quick and thorough resolution. Thank you, and we look forward to hearing from you again soon."}, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "111487047281075542297", "name": "Isaiah Forte", "time": 1585174057113, "rating": 1.0, "text": "If I could I wouldn’t put a star on here They don’t fix anything I put in a work order 3 weeks ago about my air and haven’t anyone came out to fix it yet. Saying it’s not an emergency. This Whole place is trash!", "pics": null, "resp": {"time": 1589840302237, "text": "Our goal is always to provide maintenance services in a timely manner. All resident requests are addressed in the order in which they are received with priority given to more urgent repairs. That said, if your request has been pending for longer than expected, you can always reach out to us directly to get more information about the status."}, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "106731183624573462651", "name": "Ashley Wells", "time": 1525267083405, "rating": 5.0, "text": "I live here and it’s a great place to stay. And porsha and Kimberly has great customer service. I been here for a month and I love them.", "pics": null, "resp": null, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "111157258582703058840", "name": "K and K Collection", "time": 1552336801174, "rating": 1.0, "text": "Service is horrible, Maintenance is worst than that. I can never get anyone on the phone and when I go in there's always someone new so I can never get anything done. Its very frustrating and hard to be calm when you have to explain your issues so many different times because its always someone new.", "pics": null, "resp": {"time": 1552669589345, "text": "We understand your frustrations, and we sincerely apologize for any miscommunication you've encountered with our office staff. Please know, we care deeply for every resident of our community and are dedicated to providing quality, thorough service in a timely manner, and we regret that you received the opposite impression. We would greatly appreciate another opportunity to improve your stay in our community and discuss any remaining concerns you may have directly with our management team. At your earliest convenience, please consider stopping by our office or giving us a call, thank you."}, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "106170115766686602644", "name": "Shavaughn Billups", "time": 1549384235199, "rating": 5.0, "text": "I came in late very close to closing and the Assistant Manager Dany was extremely nice and patient. She was unable to show me an apartment but went over floor plans and made sure I had no other questions.", "pics": null, "resp": {"time": 1549474299121, "text": "We are so glad you stopped by, Shavaughn! It is so great to hear you had a wonderful experience visiting our community, and if you have any questions for our team you are more than welcome to give us a call or drop in on our office. We hope to see you around again soon!"}, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "100850924634719485590", "name": "Gwendolyn Brown (Godsgirl)", "time": 1546805279201, "rating": 1.0, "text": "I visit my daughter often and I must say that although the name of the place has changed, I am VERY disappointed in regards to how maintenance matters are handled.  She has water issue in the ceiling area, someone did respond very quickly, BUT to go in and take HER trash can for it to continue to capture the water and its been sitting there and sitting there. I have already shared with her that it is her private property and the nasty water needs to be caught by a container that the complex owns. Why leave an opening for the possibility of other things to crawl out.\nIf you are a first time renter, PLEASE DO NOT sign the lease here until you have read the reviews.\nOur daughter had been delayed in getting her place because they were cleaning it. Ha! The carpet had not been cleaned, the outlining of the previous person's bed was still visible in the carpet, dead roaches were present, a piece of the carpet was missing, LOT\"s of doggie doo was on the balcony area and then some, WE cleaned her apartment.\nWhen the NEW management team was in, I took them pics of EVERY single concerning area only to have been nicely told that I would need to write up each one because of how they do their work orders. I had pics and all and it was nicely done and could have easily been followed.\nWe are hoping that she can move elsewhere when her lease is up.\nI do NOT like visiting, but I do.\nThey did clean up the trash dumpsters and that helped a good bit.\nI would like to encourage tenants to contact their city officials and make written reports if you are not being taken care of. Some people feel as if they have no options, but you do.\nI would like to encourage you to start sending certified letters when your matters are not being take care of as well. Make copies of any and all communication between you and the leasing agent.\nI have tried to leave matters to my adult daughter, but I am about to have to get involved soon.", "pics": null, "resp": {"time": 1546992893907, "text": "We truly value your feedback, Gwendolyn, and we sincerely apologize if you and your daughter feel you have not been the high-quality service that we strive to provide. We understand that first impressions are important when moving into a new home, and we are sorry that your daughter's home was not in line with your expectations. We would greatly appreciate an opportunity to work with you to get your stay with us back on track. Please reach out to us as soon as possible so we can discuss resolutions for any outstanding issues that your daughter is encountering."}, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "109824231849443448805", "name": "tangineka webb", "time": 1565034856837, "rating": 1.0, "text": "You want your house broke into & a gun upside your head  when you wake up GO ahead & move out there & plus maintenance don’t fix anything these apartments is BS don’t move in please runnnnnnnn farrrr assss youuu cannn", "pics": null, "resp": {"time": 1565639897235, "text": "We are very concerned to hear about your negative perspective regarding your time in our community. We can assure you that our team is dedicated to providing excellent service and creating a comfortable, inviting environment. If you would like to discuss your experience with our management team, please feel free to reach out to our office directly. Thank you."}, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "107416735262857022125", "name": "Neorah Israel", "time": 1525759323247, "rating": 1.0, "text": "My experience has not been the best. Maintenance is sometimes slow. I am a clean person, I try to keep my apartment clean, but there are a lot of bugs (spiders, roaches, etc.). I would not recommend this place to anybody. Make sure you view the apartment before you sign a lease. This was my experience, yours may be different, but as soon as my lease is up, I will be leaving. I had to rate the apartment one star because it wouldn't let me post my comment, but if i could rank the apartment, I wouldn't give it anything. Staff is very nice though.", "pics": null, "resp": null, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "105330827665022169180", "name": "Verna", "time": 1521762113721, "rating": 5.0, "text": "I was looking for a short term lease until my home is ready. I toured the property with Kimberly she was really nice.", "pics": null, "resp": null, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "102937376884871643397", "name": "PoleCat Gamer", "time": 1520270033053, "rating": 1.0, "text": "Absolutely the worst in Homewood and at the bottom for Birmingham. Do not move in. Your water bill, which is billed by the complex, will contain debt that is not yours. If something is broken the maintenance is fast but if the problem is too much for them management will take months to hire someone.", "pics": null, "resp": null, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "101934526416988721231", "name": "Kim Taylor", "time": 1524599873083, "rating": 1.0, "text": "Problem after Problem since I've moved in .They've tried to change the name so they people will think everything is great .LOOK UP THE CREST AT HOMEWOOD'S REVIEWS and you will see how much of a trash property they are. They haven't done anything different but change the name .SAME incompetent people in the office who don't know what their doing. They let drug dealers move in ,people who play music all night long , someone has been killed on the property, bad pest issues still ,they mess up your account to make it seem like you owe and put eviction notice on your door ,pest control sucks(bed bugs, roaches,mice) and people move out everyday because they refuse to fix anything . PLEASE LOOK AT REVIEWS BEFORE YOU MOVE BECAUSE THEY AREN'T JUST FROM PEOPLE WHO DON'T PAY RENT ON TIME !!", "pics": null, "resp": null, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "107135635341678835326", "name": "Brannon Herzing", "time": 1530665960657, "rating": 1.0, "text": "I have been waiting since last week to have my kitchen sink fixed. I have made several calls, and walked into the office about this. Now I am going to have to spend the 4th of July sitting in an apartment with the smell of backed up sewage, and gnats flying around. FYI, this is the second apartment, and second building that I have had serious plumbing issues with. I am not the type to do bad reviews, but I am going to make an exception here.", "pics": null, "resp": {"time": 1530896025390, "text": "We are sorry and concerned to receive feedback such as this, Brannon. We take all maintenance requests very seriously, and we apologize for missing the mark. Please give us a call or come by the office so we can be sure and make this right."}, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "117393902105026996724", "name": "Tisse Ocho", "time": 1547068482665, "rating": 5.0, "text": "Mrs.Danielle Key has really been a blessing through my process moving in. She has been consistent with her communication. If you are looking for a place to stay swing through and talk to her !", "pics": null, "resp": {"time": 1547147454753, "text": "Thank you for the kind words! We aim to provide high-quality service and an inviting environment, and we're thrilled to hear that you had an excellent experience with Danielle and our community. If you have any questions for our team you are more than welcome to give us a call or drop in on our office. We hope to see you around again soon!"}, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "104197892809190671208", "name": "Ambii Goals", "time": 1522028996578, "rating": 5.0, "text": "Nice place to live , spacious floor plans , great customer service from kim and Porsha !", "pics": null, "resp": null, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "103657168986581394580", "name": "Alexis Reedy", "time": 1541444009871, "rating": 5.0, "text": "The new management has helped me out A LOT with the CHAOS the last management. The corporate office and Ms.Danny did what I needed to be done. Thankssss💜💜💜", "pics": null, "resp": {"time": 1541543686257, "text": "Thank you so much for this glowing review, Alexis! We're happy that we could be of service and ensure that you're enjoying a home life worthy of five stars here at City Heights Homewood! We appreciate your special shout-out for our team and will be sure to pass along your kind words to Danny. Remember, the office is always just a quick phone call away should you require any additional assistance moving forward! Thanks again!"}, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "102540058306215487980", "name": "Tyrus Butler", "time": 1547246011758, "rating": 5.0, "text": "The staff is great!!  They always are very responsive and really cares.", "pics": null, "resp": {"time": 1547500585276, "text": "Tyrus, we sincerely appreciate your compliments! Our team is dedicated to providing exceptional service to all of our residents, and we're excited to hear you've been enjoying your experience. If there is anything our team can do for you in the future, please don't hesitate to give us a call."}, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "107682915973958515581", "name": "Darius Smitherman (Poonie)", "time": 1561430778808, "rating": 1.0, "text": "We were considering moving here but were discouraged by the current tenant reviews I hope these problems can be addressed for your current tenants because there opinions of city heights has deterred us from even looking here I hope in the future things get better", "pics": null, "resp": {"time": 1561749849915, "text": "We hope that you'll still consider dropping by for a tour so we can show you how truly amazing our homes can be! We would greatly appreciate the opportunity to speak with you about how dedicated our team is to providing a comfortable, peaceful living environment, so please feel free to give us a call at your convenience."}, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "100706821109602542876", "name": "Kim Taylor", "time": 1518473199904, "rating": 1.0, "text": "They changed their name but that hasn't changed anything.Horrible management staff and maintenance staff . Still have bad pest control issues , abandoned cars, unfinished work orders and still no resolve.", "pics": null, "resp": null, "gmap_id": "0x88891ebbbeb333bd:0x26c118a24bae9b8"}
{"user_id": "117654902870438710460", "name": "Cassie Canter", "time": 1615332910624, "rating": 5.0, "text": "Great management, very professional. Always had someone available when needing to talk to someone or maintenance. Kept me up to date on any maintenance time or when to expect maintenance. Nice apartments, and nice size units.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "106294351321952247088", "name": "Lisa Minor-Burnside", "time": 1614306650109, "rating": 5.0, "text": "5 stars to the property manager⭐⭐⭐⭐⭐Destiny Kuchman!She made the move in process stress free for our daughter! She was very accommodating, friendly, and helpful. The apartment was perfect on move in day,  and all appliances, amenities,etc were exactly how she promised us it would be. Thanks Again!", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "107968121721897765847", "name": "Lexi Folsom", "time": 1615404173135, "rating": 5.0, "text": "I love this place! The apartments definitely give you a very at home feel and so clean and such an easy move in to. Destini, went above and beyond to help me and made me feel welcomed! plus she has an amazing style, which helped me feel very connected to her as well :)\n&& they are very pet friendly my little puppers has made new little friends here and I love it! I couldn't ask for a better place!\nyou won't regret living here !!!", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "108346265868124900904", "name": "Jamie Stone", "time": 1615338863033, "rating": 5.0, "text": "I have lived here for over a year now and I can say it’s\none of my favorite places I’ve lived. Great neighbors and just an all around good community.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "102630294674695062690", "name": "tylesha washington", "time": 1621024306203, "rating": 2.0, "text": "Thank goodness I’m out of there! It was a little too late to try to “fix” the leak. Hilarious how it got “fixed” after I turn in my termination letter (which they LIED like they never got, thankfully I recorded). I was told my leak was going to get fixed sooo many times but yet every time it rained/stormed my kitchen and back constantly had water coming in after multiple times maintenance came to caulk it. Then I’m the mist of moving water was on my table so that’s even more damage. Hopefully one day they properly fix 2079A and not just re do the floors. Maybe this fix they just did will help. I moved in October water issues happened in December, this new management came like January and here it is may and the issue is now “fixed”. Wish it would’ve rained so I could’ve seen if it actually worked or not.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "111313317977017211330", "name": "Calix Ainslie", "time": 1616530423973, "rating": 2.0, "text": "You get what you pay for. Management does what it can, but after a year-long bug infestation, several unresolved maintenance issues that have persisted since move-in despite maintenance requests, and more than one “professional” communications in all-caps, I’ve learned my lesson. Definitely won’t be staying here long-term.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "100259768399233973076", "name": "chris kauhn", "time": 1615337582801, "rating": 5.0, "text": "There very friendly and helpful, I had great customer service and that’s hard to find now a days, I loved living here real nice apartment and great prices, I felt very safe there with my family", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "102539055153888417855", "name": "Sierra Alexnder", "time": 1615336265377, "rating": 5.0, "text": "They are a great apartment complex rent is kinda high but it comes with the area and Destini at the leasing office is really nice and understanding and very helpful in any way possible they respond in a timely manner and maintenance come in a timely fashion as well highly recommended", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "106743145838204257534", "name": "PrototypeX113", "time": 1615335295264, "rating": 5.0, "text": "Good service,Very kind staff and overall a Great place to stay\nThe property manager Destini was very kind and made everything simple and stress free", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "117473242525204386215", "name": "Melena Estaine", "time": 1615333126487, "rating": 5.0, "text": "Very helpful and kind staff! Good pricing for the area as well.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "111918512280067868008", "name": "Kimberly Daniel", "time": 1615335503412, "rating": 5.0, "text": "Destini is a wonderful manager she is always understanding and makes sure she helps anyway she can .", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "115412088695100980900", "name": "Jennifer Burgett", "time": 1615335143363, "rating": 5.0, "text": "Nice property & located in a great spot where you're close to everything!", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "108916968860266348875", "name": "Sky Jett", "time": 1615334669131, "rating": 5.0, "text": "Great apartments. 10/10 Would stay here again", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "117281000564862559878", "name": "chante hunt", "time": 1592506833698, "rating": 2.0, "text": "Great area! Close to EVERYTHING! They apartments are pretty decent. Reason I don’t recommend is because of maintenance. I’ve been her 2 whole years and my outlet for my dryer hasn’t worked! The first dryer I had went out and it wouldn’t dry my clothes. So I throw it out. Thinking it was the dryer. So I went and bought another one. Still wouldn’t dry my clothes. Then after a month it went out. So at this point I refuse to buy another dryer. So I called an appliance company and someone came out. Come to find out it’s the outlet. They guy said wasn’t enough power pulling through and needed to be replaced. My dryer worked just fine. So I tell the maintenance people about it. And only thing they was going to do was reset the breaker. Till this day, I am still not able to use my dryer. My oven went out about 2 months ago and it still hasn’t been replaced either. You don’t get any updates about your work orders or nothing. I hate it. There is nobody to talk to about the issue or nothing. That’s why when my lease is up I’m moving out. Other than that it’s pretty ok. Not 5 star though.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "106703567159720980019", "name": "Diamond Pratt", "time": 1575042778293, "rating": 1.0, "text": "I hated this apartment complex so Bad. The apartment complex was almost 1,000 for a one bedroom. They wasn’t understanding. The apartment that I was supposed to move into I never moved in it. They put me another apartment. My heat went off for a whole a month and they wouldn’t put me in a model they gave me a heater. And then they always had new management. I really hated this apartment complex. I signed a least for 650 I never payed 650 I payed 900 every month. And they will call your phone about the rent . After being there for 2 years I just let it go I hated and It was just not worth it. You guys please look at other apartments it’s not worth it", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "113628381485305730180", "name": "Nina Garcia", "time": 1580856011008, "rating": 5.0, "text": "So far it’s been a great place to live! They do stuff for residents like Tasty Tuesday! And are super helpful with any issues!", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "117713566301269357474", "name": "Billie Mize", "time": 1578507795886, "rating": 5.0, "text": "I turned in a list of maintenance requests and as usual Amber has made sure the problems are taken care of. Because of parts ordered the list has not yet been completed but we are almost there. This is really nice.....thank you to Amber and her team.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "118110834375088046485", "name": "Herman Mattingly", "time": 1601077387716, "rating": 5.0, "text": "The greatest City Heights Hoover on planet Earth!", "pics": null, "resp": {"time": 1605461726850, "text": "Thank you so much for your review!"}, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "109008843366015943140", "name": "Stephen Bass", "time": 1521058462033, "rating": 5.0, "text": "The staff there is always helpful and timely with any requests.  Amber is amazing at her job and has helped me resolve several issues very quickly.  Marisa (?) has also come on board recently and is just as helpful and caring as the rest of the staff there.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "116229896690536348359", "name": "robert senecharles", "time": 1521655858811, "rating": 5.0, "text": "It is very quiet here, amber and rest the office including maintenance now are awesome, takes care of any request that need to be done. I would recommend anyone to come live here. The area is a very safe area to live especially when ya have children.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "102562261281944829585", "name": "4spect", "time": 1519963782143, "rating": 5.0, "text": "Pretty nice area and great schools. My apartment is really nice and spacious. The office  managers Amber and Marrissa are really nice and professional . The laundry room could use some updates but overall its been a nice experience so far.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "112352312348611762951", "name": "Danielle Zito", "time": 1521996840026, "rating": 5.0, "text": "Such a great complex with a great staff. Marissa has been very knowledgeable and has gone above and beyond to find the answers to my questions. Can’t wait to move in once my current lease is up !", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "102684409343793560007", "name": "Reneshia Bryant", "time": 1519935794041, "rating": 5.0, "text": "living here has been such a great experience. My leasing agent Marissa is very thorough, nice and made moving in a breeze. The other lady Amber always greets me with a smile and a nice professional attitude. I love my new apartment and the ladies in the office.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "116616477041012647156", "name": "Sherita Smith", "time": 1522030677505, "rating": 5.0, "text": "I am a soon to be resident (very soon)and so far my experience has been phenomenal!!! Amber and Marissa were such a great help and very patient assisting me with the move in process. Both were very knowledgeable about the property and went into detail of the amenities and even a great “Preferred Employer” discount. I’m defiantly feel like this will be a great move me.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "109943809270952436074", "name": "Zacolia Thomaa", "time": 1521066128524, "rating": 5.0, "text": "I’ve been here for almost a year, and I love everything about these apartment, from maintenance all the way up to the workers in the office. The office staff are so pleasant, no matter what small problem I have they always manage to fix it ASAP, and they are the nicest people especially Amber, I absolutely love her she has a great personality, very professional, and you can tell she loves her job. I wouldn’t want to live anywhere else.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "117804414558665013117", "name": "Lynsey Lockard", "time": 1520033299875, "rating": 5.0, "text": "Marissa and Amber really have transformed these apartments. They are enthusiastic about their job and keeping their residents happy! It is always refreshing to walk into a leasing property greeted professionally and to see friendly faces! They always resolve my issues in such a timely manner that I cannot complain! Alpine is in such a convenient location as well! I know alpine village will succeed as long as Amber and Marissa are there!", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "104553300002074972742", "name": "Demetrius Austin", "time": 1606670947225, "rating": 1.0, "text": "Rude very very Rude will not be returning.", "pics": null, "resp": {"time": 1607703612115, "text": "We are so sorry you had a negative experience - Could you please reach out to us at customer.service.ch@centrapartners.com to let us know the details of your experience? Thank you."}, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "118118552119838406491", "name": "Rena Durgan", "time": 1522527669352, "rating": 5.0, "text": "In search of a new apartment and Amber was OUTSTANDING! I've never went to an apartment complex with such superior customer service. The property was well maintained, looks like they have a great maintenance staff also. This property is definitely one of my top choices. Thanks Amber!", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "112352312348611762951", "name": "Danielle Zito", "time": 1521996840026, "rating": 5.0, "text": "Such a great complex with a great staff. Marissa has been very knowledgeable and has gone above and beyond to find the answers to my questions. Can’t wait to move in once my current lease is up !", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "118118552119838406491", "name": "Rena Durgan", "time": 1522527669352, "rating": 5.0, "text": "In search of a new apartment and Amber was OUTSTANDING! I've never went to an apartment complex with such superior customer service. The property was well maintained, looks like they have a great maintenance staff also. This property is definitely one of my top choices. Thanks Amber!", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "118290969887642360807", "name": "Tbaby120", "time": 1520029114268, "rating": 5.0, "text": "This is a very nice area to live. The office  managers Amber and Marrissa are really nice and very professional . I haven't been to a place that has such a caring and wonderful staff yet. My apartmet is very spacious and nice! It's close to the Galleria Mall, plus other shopping centers, and is around a lot of nice restaurants! Thank you guys, you are awesome!!!", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "105606016133284271059", "name": "DANIEL ERSKINE", "time": 1519962930384, "rating": 5.0, "text": "Nice apartment , maintenance [john & the other guy ] are quick to fix things.\nAmber the manager really goes the extra mile to make people happy . This place is so much better then my last apartment ,.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "100715181791555946059", "name": "Olivia Bailey", "time": 1520291415065, "rating": 5.0, "text": "I checked out Alpine Village looking for a 3 bedroom and was extremely impressed with the customer service. Marissa was so friendly and helpful and made feel very important. I will definitely keep them at the top of my list.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "101815552686861229496", "name": "m1 k87", "time": 1553118649866, "rating": 5.0, "text": "I'm living here about 18 months I'm totally happy and satisfied with everything plus I'm dealing with the best management ever .. especially the manager ( Amber ) she is the sweetest person you can deal with", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "101131334331698582907", "name": "Gayle Belcher", "time": 1520024181312, "rating": 5.0, "text": "Marissa and Amber were very professional and helpful. Marissa especially has such a cheerful personality and was very knowledgeable about the apartments and area.  I would definitely recommend Alpine Village in Hoover to anyone wanting a very large apartment with friendly service.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "112808359433905778239", "name": "Kendra Steele", "time": 1520875053083, "rating": 5.0, "text": "Alpine Village is a great place to stay! This place is by far my best experience in apartment living. Amber is always nice and makes sure I am satisfied!", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "110727575131291996642", "name": "Aderenle Ademikan", "time": 1520350653532, "rating": 5.0, "text": "Amber is amazing. She went above and beyond all the stars in the sky. When I had a problem she fixed it above and beyond. Marissa is amazing as well. When I moved in my apartment she made sure every issue I had whether minor or major was fixed instantly. I’m so happy for choosing alpine village as a place to call home. Thanks so much. 😘😍😍\nSincerely Antoinette.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "104457445774207223844", "name": "Anna Beahm", "time": 1522430755922, "rating": 5.0, "text": "Management was very helpful to fix the problems in our apartment. Amber and Marissa were very kind and helpful. It's always great to see smiling faces at the office! Haven't had many issues with neighbors or noise. It's in a great location close to the interstate and shopping in Hoover/280 area.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "106511632972174591695", "name": "Susie Becker", "time": 1521230804817, "rating": 5.0, "text": "I was looking for my daughter and grandkids and stumbled upon Alpine Village. Marissa was so helpful, professional, and courteous! She went above and beyond to make sure my family would love the place, area, and be safe and content. You go Marissa!", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "111105657297608055539", "name": "Austrin Lakinsky", "time": 1520033760710, "rating": 5.0, "text": "Amber and Marissa gave me such good customer service I had to post on Google about it. If you are looking for spacious apartments for a good price in the right part of town with caring management then Alpine Village is where you need to be. I can't wait to move in! Thank you Marisa and Amber for everything!", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "102226086508009966856", "name": "Ken Rosser", "time": 1520294572301, "rating": 5.0, "text": "My very first time renting and I am so relieved to have had such a great experience. I once had my dishwasher mess up and they fixed it within the hour! Marissa has been a huge help thru this whole process. Would really recommend choosing Alpine Village as your place to stay!", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "100878219937425227655", "name": "Charlessa Hoskin", "time": 1564277669150, "rating": 1.0, "text": "I don’t recommend no one to move in at City Heights Hoover Apartments! If you don’t have a internet service you still have to pay 75.00 a month such a rip off, the water, sewer, and trash fees are ridiculous high and even at the end of that Amber and her boss Susan  take your deposit they try and tell you some like it is at the rear the reason they took your deposit but from the beginning they tell you you would get your deposit back but at the end of it you find out you don’t get it back!! The back of the apartments have mold and spider wells they need to pressure washer them!!! If u paying all that money surely it should be done better than what it looks like!!!!", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "108637491746468956678", "name": "Larena Erskine", "time": 1522079034156, "rating": 5.0, "text": "Amber is such a sweet & warm person. We had a great experience with her!! Thanks Amber for helping us in our decision!!", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "104697096313584080053", "name": "Dominique Larriett", "time": 1520005146368, "rating": 5.0, "text": "I absolutely love this place. Friendly office staff. I highly recommend Alpine if you are looking to live in the Hoover area.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "114566421006063413678", "name": "Reese Whitley", "time": 1519937515313, "rating": 5.0, "text": "I recently moved here into a 2 bedroom apartment. Upon move-in I had experienced a few small hiccups. I was AMAZED at how fast the management and maintenance jumped in to help me and assist me with my move. I am all about first impressions and they held a 5-Star!!  I could not have been more impressed with this team getting me settled into my new home.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "110516953316917084373", "name": "Elizabeth David", "time": 1520292538861, "rating": 5.0, "text": "Marissa and Amber were super helpful showing me an apartment and answered all my questions!!   Beautiful apartments and great staff.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "109500216791477054619", "name": "rodneygrill", "time": 1499656396534, "rating": 1.0, "text": "Avoid this place at all costs!  My daughter lived here for a year and there were too many issues to list.  Her front door didn't lock and the bathroom sink leaked and never drained.  I can't believe the city of Hoover lets this place stay open.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "115676073525655490808", "name": "Julie Ritchey Miles", "time": 1566271503497, "rating": 4.0, "text": "Nice girl renting to people friendly.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "109500216791477054619", "name": "rodneygrill", "time": 1499656396534, "rating": 1.0, "text": "Avoid this place at all costs!  My daughter lived here for a year and there were too many issues to list.  Her front door didn't lock and the bathroom sink leaked and never drained.  I can't believe the city of Hoover lets this place stay open.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "118102338827811803468", "name": "D W", "time": 1519965012912, "rating": 5.0, "text": "Great place to stay and good maintenance. Good to see Amber back in the office making things happen", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "105830298836114559467", "name": "Gilberto Figueroa", "time": 1513440783645, "rating": 1.0, "text": "I got another one for you guys  they don't open on time  it's been 2 months  they have  not  refund my security deposit It's terrible  they don't answer the phone in the office I do not recommend for you own good don't even try to get apartment here😠😠😠😡😡😡😧😧", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "115676073525655490808", "name": "Julie Ritchey Miles", "time": 1566271503497, "rating": 4.0, "text": "Nice girl renting to people friendly.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "107616831498007216434", "name": "Letha Orr", "time": 1528474291358, "rating": 5.0, "text": "JUST SPOKE ON THE PHONE WITH THEM AND THEY WERE SO INFORMATIVE AND SWEET. OTHER APARTMENT COMPLEXES NEEDS TO  BE LIKE THEM!!!", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "110959032184080498821", "name": "TaKaysia Collins", "time": 1498970656996, "rating": 1.0, "text": "2034 Alpine Village\n\nAwful....Only on office person is friendly and that's the one that sits in the front. Other than that the one in the back is rude. I've been having problems since I moved out here and frankly I'm tired of it. I'm ready to move. At this point I care and don't care what happened. I've been fed with lies since I got out here. About the rent, discount promotions or whatever the hell, and also my lease. It's completely UNPROFESSIONAL!!!\n\nSome respond asap if you know of any lawyers", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "106075178134159730604", "name": "kimbberly3", "time": 1521649011102, "rating": 5.0, "text": "The staff is super freindly and informative about the area. They were so helpful in my new move to the city.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "100395752696892503367", "name": "Shaner Fowler", "time": 1520998848716, "rating": 5.0, "text": "My apartment is spacious and it’s a nice area . The manager Amber is very professional and the her manager was very friendly as I moved in . I look forward to living here", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "109817298236337608914", "name": "MrHoward916", "time": 1540577372442, "rating": 1.0, "text": "All of these other reviews are legitimately fake. Almost every building is infested with bugs. These apartments just went under new management (Implicity)2 months ago and nothing has been improved whatsoever. They treat the majority of their residents like garbage and Amber is the most ghetto and unhelpful one there who has been fired from other properties. Also, you dont know how much your rent truly is until the day its due. Document everything if you make the mistake of moving in.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "105039166686661644462", "name": "Kelly James", "time": 1520029192241, "rating": 5.0, "text": "I was currently looking for an apartment in the hoover area and after going to all the surrounding apartment complexes I stumbled upon Alpine Village as I was driving by. Walking in I was greeted with open arms and the environment in the office was nothing but positive and inviting. The two girls in the office were extremely helpful and patient. I believe their names were Amber and Marisa. I left the leasing office feeling better than I did leaving any other apartments that day. As I was leaving I also ran into Johnathan (I think that is his name) the maintenance supervisor and was blown away with how nice and friendly he was. It is that kind of customer service that makes looking for apartments a breeze! Although I did not end up moving in because my job had stationed me somewhere else I now look forward to moving back to Birmingham and renting from Alpine Village. Thank you for make my apartment searching experience an easy one!", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "103712905401130338292", "name": "Jas C", "time": 1560984507041, "rating": 1.0, "text": "Management is horrible and maintenance will try to enter your apartment without notifying you. I have video record of them entering my apartment but the notice left on the door says they left a mailbox key in the office. There is no reason you should have to enter my place of residence to give me a mailbox key! I was stung by a bee and had to go to urgent care for it. I called and put in a request online to have the nest removed from by my front door and was told I would have to wait for them to remove it. So I’m supposed to fear being stung AGAIN until the end of the week. They could care less because it’s not at their door! BS!!!! I’d live in my car of this was the only option for living! Will not be renewing my lease.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "117404303193396721635", "name": "Justin Chamblin", "time": 1522420873633, "rating": 5.0, "text": "Awesome Staff Marrisa and Amber make finding and living in your home easy and comfortable", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "116848643035879140618", "name": "Jeffrey Harris", "time": 1523494111559, "rating": 5.0, "text": "Alpine is a great place to stay, management is caring, professional, and they are always doing nice thoughtful things for their residents.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "116119485654636002203", "name": "Bryan Austin", "time": 1521677984907, "rating": 5.0, "text": "This is a great apartment in a great location and the staff is supper nice.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "106231054055440158456", "name": "Durran Turner", "time": 1520476456761, "rating": 5.0, "text": "Amber and Marissa are very professional love the new place!", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "106934060561327534378", "name": "Kay Mitchell", "time": 1526662588140, "rating": 1.0, "text": "Take your business and money elsewhere if at all possible.\n\nI’ve only lived here for a few months and I regret it. There are hidden fees that were not explained and I was unaware of until I got my last bill. I had made numerous attempts to reach the office and was unsuccessful until I sent an email stating that I wanted someone to address the complaint I had. Finally I made contact with the Property Manager. I asked for explanation and I got some crappy excuse about the cost of my bill and told “Sorry for the hidden fees.”\n\nI’m fine with the rent, water, trash and sewer fee. My first sewer bill was 88 dollars and I think that is unfit and unfair. I understand that there may be an inflation cost with the County or BWW but this is ridiculous. Still it’s been paid on time like everything else. The kicker for me is the “Mandatory Cable Service.” I was told that it came with my unit. I’m being charged for 1 HD cable box and 10MB of internet speed that I never even had set up. Recently, I called to get it set up and the customer service rep had a horrible attitude and said that there is a 65 dollar service connection fee due upfront BEFORE they come out to set up service. I was told that this is mandatory although this unit came with cable and internet and I’m being charged 75 dollars monthly for it. Pathetic.\n\nI constantly have problems with my toilet, there’s mildew in the hall and bathroom and my air constantly goes in and out. I’d rather turn a fan on. DO NOT BRING YOUR BUSINESS HERE.\n\nThe staff seemed nice and friendly and that’s what will draw you in. Response time to application was swift. Which is what impressed me. But stay away. Go somewhere else. I do not intend to renew my lease. I will be leaving the first chance I get. I am strongly considering just paying to end my lease just so I can go somewhere else. If I am going to pay 850-900+ a month for an older 2 bedroom 1 bathroom unit then I expect better service. For there not to be trash everywhere and for the necessities in my unit to work properly and to know exactly what I am going to be paying for upfront.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "101218245263753089440", "name": "Andre Weathers", "time": 1490756358567, "rating": 1.0, "text": "Floor very weak, plumbing backs up , air unit still not fixed.. Called the office and maintenance said their ordering parts since last year and the floor is bouncing because it's been worked on before.. I worked in construction before .. I know what a weak floor  feel like .. very dissatisfied..!!", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "102414689086602879116", "name": "KeAnterria Haywood", "time": 1523387053658, "rating": 5.0, "text": "Great Managers. awesome service.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "116140129891129294161", "name": "Jhitadw", "time": 1521663225141, "rating": 5.0, "text": "Amber Dansby was so helpful and nice:! Very professional!!! Great apartments!!!!", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "102994353540581982702", "name": "Killashane Money82time", "time": 1493778777833, "rating": 1.0, "text": "Office workers are friendly........., ceiling bulging from God knows what....  Been here 3 days and the environment is unfriendly for kids to play because teenagers hang out smoke dope and sell it in the open!!!  The appliances half work, HVAC unit is rigged and freezes up and it hasn't got hot yet!!  Closet doors are missing, it's an odor that no one can explain (mold)........ Etc.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "115431505209490702297", "name": "Lindolfo Garza", "time": 1539105217041, "rating": 1.0, "text": "They kept my deposit and the water bill is really high it was only my wife and me and we need to pay around 120$ per month I don't recommend you this place to live.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "117523202692948349587", "name": "Paula Oliver", "time": 1521069765441, "rating": 5.0, "text": "Amber McKinney is the BEST!!! She is helpful and informative!!!", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "105981876687670416257", "name": "Shannon Lamar", "time": 1567491692101, "rating": 1.0, "text": "The leasing agent at the office Susan was extremely rude and on her cellphone the whole entire time.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "110554833217076206385", "name": "Katrena Weathers", "time": 1502763897850, "rating": 1.0, "text": "Can never get anything fix always people hanging around. The apartments. Poor management.", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "108803326551093625657", "name": "Latoya King", "time": 1466004605445, "rating": 1.0, "text": "Mold and water leaks everywhere. Sewage backs up into the garage disposal. And the phone is always disconnected two months at a time", "pics": null, "resp": null, "gmap_id": "0x8889226e970e81e5:0xee87e48bb963c749"}
{"user_id": "102787019948847241298", "name": "Curtis Tarver", "time": 1516200378275, "rating": 4.0, "text": "Great place", "pics": null, "resp": null, "gmap_id": "0x888dec7532c9c971:0x523b6bc701bfc9b9"}
