{"user_id": "112789440330047517483", "name": "Abbie Reinsma", "time": 1628260743533, "rating": 5.0, "text": "Amy McDaniel with Dewdrops Photography is in a league of her own.  Visiting her newer studio in Olympia, WA is the best decision we could have made.  Our daughter had spent some time in the NICU and we couldn't get photo's taken until 7 weeks.  I was a little bit nervous but upon arrival Amy immediately put us at ease.  She is extremely kind and professional.  With an extensive array of props/colors she soothed our baby girl and captured brilliant moments that we will cherish forever.  You will not be disappointed!  I have not stopped raving to my friends and family and hope that she is flooded with success in Olympia.  Definitely worth every penny-they grow so fast!", "pics": null, "resp": null, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "103397979164156936158", "name": "Kati Thomas", "time": 1626887740003, "rating": 5.0, "text": "Amy was amazing she did a really great job even when my little girl got a little bit fussy she is amazing and she has such a way with newborns", "pics": null, "resp": {"time": 1626927076996, "text": "She is beautiful and I'm so honored that you allowed me to capture her at this stage of her life!"}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "116925162144719901298", "name": "Samantha Andrews", "time": 1602813076216, "rating": 5.0, "text": "Amy is incredible! We drove from Atlanta just to see her. I have followed and admired her work for years now, and when my daughter was born I knew I wanted Amy to photograph her. We arrived and Amy made us feel comfortable and at home. My daughter was fussy of course due to the long car ride, but Amy patiently soothed and comforted her and made sure she got plenty of set ups and poses. She had the studio set up so that we could get multiple props and colors in so that we have plenty of pictures to choose from. I am so glad we made the trip to Auburn— the whole experience was well worth it! Not only is her work incredible as you can see online, but the overall experience was awesome and I highly recommend hiring Amy. You will not be disappointed!", "pics": null, "resp": {"time": 1602814328843, "text": "Thank you so much! It was great to meet you and your sweet girl!"}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "116978803542919212520", "name": "tawyna evans", "time": 1612830987992, "rating": 5.0, "text": "Amy has always been my newborn photographer crush. I too am a newborn photographer and always dreamed of doing an in person workshop. When I found out she was coming to a town near me I jumped on the opportunity. SHE DID NOT DISAPPOINT! The workshop was phenomenal and my work was taken to the next level. She is a natural teacher and I promise if you do a workshop you will not be disappointed!", "pics": null, "resp": {"time": 1612840665229, "text": "Thank you so much! It was so great to meet you!"}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "106204596532949777508", "name": "Jennifer Traylor", "time": 1595538476757, "rating": 5.0, "text": "I have been a part of many Dewdrops sessions and every session has been planned out with utmost care, wonderful props, custom made headbands, outfits, etc. She is both professional and extremely pleasant and fun. Babies LOVE her! She just has an incredibly special way with babies and adults as well.\nHer images both on her social media, as well as her online proofing galleries, are exceptional. HIGHLY RECOMMEND to all my friends, family, and everyone else. She does not disappoint.\n\nAs for her mentoring classes and workshops, she is thorough, professional, fun, funny, and offers an immense wealth of knowledge both during the training and as a follow up in her online mentoring group that she generously shares in!", "pics": null, "resp": null, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "109270208353390342613", "name": "Rebecca Stoltz", "time": 1596514816252, "rating": 5.0, "text": "Hands down the best newborn photographer you can find!  Amy has done a handful of sessions for our family from a one year old session to two newborn sessions over 8 years.  We absolutely love her work.  Amy doesn’t do the same repetitive props for her sessions.  She has incredible experience and her portfolio speaks for itself.  When your husband is even excited about the session, you know it is going to be good! The amount of props, wraps, etc, Amy had our first session blew me away.  Babies don’t stay newborns long and these images are something we will cherish for decades to come. I would pay for newborn photography over and over; hiring Amy each time.  I am so thankful she captured two of my three babies. I only wish I had found her sooner for my oldest!", "pics": null, "resp": {"time": 1602814373486, "text": "Thank you so much!"}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "102229600029973372655", "name": "Kristin Dabbs", "time": 1619539171407, "rating": 5.0, "text": "Excellent! This is my second time using Dewdrops Photography for newborn pictures and I haven't been disappointed yet! 100% worth every penny!", "pics": null, "resp": null, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "111467702946800623005", "name": "Angela Moss", "time": 1595631990184, "rating": 5.0, "text": "Dewdrops Photography is the best photographer I've seen thus far. Her creativity is out of this world and her props are absolutely stunning. I will always recommend Dewdrops to anyone whether for newborn photos or family photos! Such great work", "pics": null, "resp": {"time": 1595705495506, "text": "Thank you so much!"}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "104509972069466402348", "name": "Shirah A", "time": 1596155616052, "rating": 5.0, "text": "My wife and I definitely enjoyed the photoshoot Amy did for our 1 year old daughter. She was professional, friendly, and knew exactly how to make our daughter smile. We love our pictures. Our families are fighting over pictures right now!\n\nThanks again Amy! We will see you soon.\n\n-Shi, Ty, and Baby J ❤️", "pics": null, "resp": {"time": 1596159311993, "text": "Thank you so much! I truly enjoyed meeting you and your family!"}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "113648056637315854551", "name": "Hayley Benson", "time": 1596156592524, "rating": 5.0, "text": "First of all, have you seen the pictures? What else is there to say, really? They're so sweet I have to clench my teeth every time Amy makes a FB post.\nWe did newborn photos when I was 10 days post partum, and she took so much care to make sure I was comfortable in every pose. My fresh c-section appreciated it.\nThe real actual Santa Claus comes to the studio for a couple days every Fall bc Amy's on the Nice list. I actually cried when I got the finished images, and I'm pretty sure there was magic involved.\nShe's got props and precious outfits for days. Just bring a clean baby, and stand back while she does her thing.\nAlso, have you seen the pictures??", "pics": null, "resp": {"time": 1596218001574, "text": "Awwww! You’re the best! Thank you so much!"}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "103751943584328010347", "name": "Melanie Resch", "time": 1595528583151, "rating": 5.0, "text": "Seriously the best newborn photographer in the country.  She is truly gifted at what she does and her passion and creativity show in all of her work.", "pics": null, "resp": null, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "117782907908183352182", "name": "Fatima Gilbert", "time": 1595514504220, "rating": 1.0, "text": "I would NOT recommend DewDrop Photography.  Amy McDaniel was supposedly a great children photographer.  WRONG!!  She had no creativity, no patience, no cute props, she offered nothing!!  The pictures were ok at best, absolutely nothing special, nothing a phone camera could not have captured.\n\nWe were told, as per her contract, that proofs would be sent in one week and then final selections in one week.  NO!  We had to contact her numerous times after weeks.  We never got our final pictures.  Eight pictures!!!  We got an entire wedding album in two weeks!!  So after three weeks we got a refund.\n\nAmy McDaniel is extremely unprofessional, rude, and as I stated the pictures were nothing special.  She ruined our sons first photography experience.\n\nI would NOT recommend you use Amy McDaniel at Dew Drop  photography!!!!!  You will be disappointed.", "pics": null, "resp": {"time": 1595526392223, "text": "This review is completely false. Client brought in two dogs to be photographed with her 1 year old. I was assured both dogs were under strict voice command but they weren't. We spent two hours over two days to try to get a photograph of their baby and dogs. (Session is normally 30 minutes so patience wasn't the problem.) I understand how important pets are as we have three dogs at home and we love them. I bent over backwards for this session and even added a bubble bath at the end. My studio is packed with props and outfits for babies but creativity is challenging when you spend the entire session trying to get dogs to sit. She mentions a contract but she never received a contract so I'm not sure where that is coming from. I explained the timeline to her in person and that I am visiting my parents in Washington State while my mother has a tumor from her breast removed. Her images were going to be two days later than the verbal timeline but she didn't care. I would hope that people could show a little more compassion during this time but there is no pleasing this client. I have enjoyed over a decade with amazing and repeat clients who have been an absolute pleasure to work with but I felt it was important to reply with the truth. Client was refunded immediately after realizing there was nothing that would make her happy."}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "110744950262202222923", "name": "Lauren Kelly", "time": 1535671433997, "rating": 5.0, "text": "I have admired Amy’s work for quite some time and I have been fortunate enough to attend 2 workshops of hers to date, and another later this year.  Seeing her in action is very inspiring!  She takes such care in handling new little babies and pays attention to every tiny detail—from posing to set design. She is truly the baby whisperer! (And that is the newborn session aspect of it. As a workshop attendee myself,  she is wonderful at explaining things as she goes and WHY she uses the techniques that she does.)", "pics": null, "resp": null, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "115848859906992784254", "name": "Veronica George", "time": 1538877679617, "rating": 5.0, "text": "I took Amy's newborn workshop review in July 2018. What an amazing learning experience!! She is just pure magical with the babies & a great teacher. The way she handles the babies and the parents is so professional, sweet & caring. Her teaching ability is commendable as well. She is always answering questions even though the workshop was months ago- there's no extra fee for that help. I cannot wait to work with her again next summer!", "pics": null, "resp": null, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "111895680332666534148", "name": "Jamie Clute", "time": 1539310183633, "rating": 5.0, "text": "I just went to Amy's newborn workshop in Michigan, WOW! I have gone to 3 other in person workshops before hers...AMY'S was THE BEST BY FAR! I can't put into words the amount of learning I did. Not only did we learn, but we had a fun, relaxed day too! Amy was so sweet, funny and just so down to earth! I loved meeting her! I would attend another one if I ever have the chance!", "pics": null, "resp": {"time": 1539312725973, "text": "It was my absolute pleasure!"}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "106612476218511655499", "name": "Mindy Turnbull", "time": 1537687477065, "rating": 5.0, "text": "The experience that we had with Amy has been nothing short of exceptional. She is the absolute best in the industry. I LOVE my newborn photos! Amy captured exactly what I hoped for - she has an eye for beauty and her photos are amazing. She was great with our daughter and has provided us with beautiful photos to enjoy for a lifetime.", "pics": null, "resp": null, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "115993087819399279196", "name": "Adris Ludlum", "time": 1571346254872, "rating": 5.0, "text": "Literally the best! Babies are unpredictable (at least I think, because I only have one), and Amy knows how to handle the situations that arise (my wife was pooped on). Not only that, the photos she takes are AMAZING. She is not only a pleasure to work with, she loves what she does. We will definitely use her again. Thanks Amy!", "pics": null, "resp": {"time": 1595526413822, "text": "Thank you!"}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "117012301411209038442", "name": "Tiffany", "time": 1516238152553, "rating": 5.0, "text": "BOOK HER NOW!!!!  My family was truly amazed at the poses and props Mrs. Amy nicely did during the photo shoot with our newborn. Keynotes about her: Professionalism, the utmost patience, kindness and she makes you feel at home during the shoot. I would recommend her to ANYONE in the world!!! We will be doing sessions with her in the near future. She's a God-sent Photographer!", "pics": null, "resp": null, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "113903408995569829945", "name": "J C", "time": 1536593575917, "rating": 5.0, "text": "Hands down THE BEST newborn workshop I have ever attended.  I have been in the business for about eight years and have attended several workshops around the country. None compare to what Amy taught me. She is so down to earth and forthcoming with every detail of how she shoots, poses, edits, etc. It has been a game changer for my business!!!", "pics": null, "resp": null, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "115441537189188611998", "name": "Rachel Martin", "time": 1561757983410, "rating": 5.0, "text": "I was in absolute awe at the patience, knowledge, and professionalism Amy displayed during our newborn session. Her work speaks for itself. PHENOMENAL work that I will treasure forever. Highly recommend!", "pics": null, "resp": {"time": 1561759569606, "text": "Thank you so much Rachel!"}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "105782472725714631711", "name": "Shelby Marie", "time": 1510717914500, "rating": 5.0, "text": "This lady has some serious skills. As a first-time mom, I'm highly proficient at worrying. But Amy handled my daughter with such care and caution that I felt I could place complete trust in her. She was extremely professional and quick to reply to all of my questions. During our session, she explained what she was going to do so that my mind would be at ease. I'm so grateful I got the opportunity to work with her. Thank you so much Mrs. Amy!", "pics": null, "resp": {"time": 1510719888833, "text": "Thank you so much Shelby!"}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "100901846598733776252", "name": "Chaya Braun", "time": 1534734525467, "rating": 5.0, "text": "Amy McDaniels is an incredible newborn photographer!  I traveled to Auburn, Alabama from Baltimore, MD for 2 days to learn from her.  She was so patient with me, and guided me to perfect the baby's posing, all the while asking me what it was that I wanted to learn next.  She had 2 baby models at the studio at all times, to maximize our learning, in case one baby was fussy or needed a break to eat.  Amy's art is so beautiful, and I'm so grateful to have had this opportunity to learn from one of the most skilled newborn photographers in the world!", "pics": null, "resp": null, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "106803708287907521046", "name": "C'est l'Amour Photography", "time": 1462193789411, "rating": 5.0, "text": "Amy is a fantastic photographer and mentor! Her attention to detail is what sets her apart. I took her workshop last summer and it's because of her, my confidence has grown. I am so thankful I have met her! I wished I lived closer so she could capture my future babies. Thank you Amy for blessing me and so many others with your God given talent xo", "pics": null, "resp": {"time": 1510718943264, "text": "Thank you so much!"}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "112449817518640858431", "name": "Vera Davis", "time": 1538916821367, "rating": 5.0, "text": "Amy's newborn workshop for photographers was amazing, I am so grateful to have had the opportunity to learn from her. I learned so much and very much appreciate her straightforward manner and fun personality!! Definitely recommend working with her if you have the chance!", "pics": null, "resp": null, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "115431647568050634084", "name": "Amber Robinson", "time": 1492003030059, "rating": 5.0, "text": "Amy is absolutely wonderful. That doesn't even begin to describe our experience with her. The care and love she shows in her work is so evident while she was working with our newborn. I was in awe at how she calmed him & the images she captured brings tears to my eyes. I was so thankful we were able to have Amy as our photographer, those newborn days go by SO fast, and this being baby number 4, I knew I needed a skilled photographer. I cannot thank Amy enough for the moments she froze in time for us. His sweet peachfuzz and flaky skin are already gone at 3 weeks old, but I will always be able to look back in sharp clarity at my precious 7 day old baby. She is the best, and obviously I would recommend her. I will no doubt be using her again & cannot wait!", "pics": null, "resp": null, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "110207290464368748819", "name": "Heather Gappi", "time": 1539054619075, "rating": 5.0, "text": "I just want to say I have taken so many classes  and I have never felt like I’ve got my moneys worth until yesterday. Thank you so much Amy, you are truly amazing and talented. You allowed us to be involved and gave us so much knowledge along the way. You have inspired me and I cannot wait to try out some of the new poses I have learned from you.  If you ever decide to come back to Michigan please let me know!!\n\nAmy Pearsall McDaniel", "pics": null, "resp": null, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "100229886638419576063", "name": "Stacey Houston", "time": 1567222347945, "rating": 5.0, "text": "Im not one to typically leave a review - however I’m just getting settled from a two day Newborn/ Family workshop with Krystal Sandefur & Amy McDaniel in Milwaukee Wi. As I’m taking a moment to reflect on the last 48 hours. To say I’ve been blown away would be an absolute understatement . If you can secure a seat-  I can’t recommend this joint workshop enough! They will not disappoint. Their joint process and workflow will change your routine for the better- having both of these ladies teach in one room is a complete LUXURY.\n\n- I have attended several well known workshops in the past this is one for the top of the charts.\nAmys brings her wealth of newborn  knowledge,  experience and safety training to a new level. Covering each pose piece by piece.\n\nKrystals unique approach to posing families allows you to seamlessly and effortlessly capture those real life personalities with out the pressure of being in front of a photographer\n\nI walked away feeling inspired and refueled- my recent loss of passion has a new spark.\n\nBoth Krystal And Amy are extremely informative and their method of delivery was easy to receive from all attendees at every experience level.", "pics": null, "resp": {"time": 1567255065806, "text": "Oh girl thank you so much!!!"}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "107832010128393218070", "name": "Heidi Weinmann", "time": 1535667592458, "rating": 5.0, "text": "I don't think there are enough words to adequately explain how amazing Amy is! I am so thankful for the opportunity I have had to work with her and I look forward to seeing her again in the future!", "pics": null, "resp": {"time": 1535674101970, "text": "Thank you! It was my absolute pleasure and I can't wait to see you in November!"}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "100489083754804520652", "name": "Lori Booth", "time": 1567274748219, "rating": 5.0, "text": "Amazing experience at the Milwaukee Workshop!  Great at what she does for sure!", "pics": null, "resp": null, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "104874322455733504688", "name": "Juliana Rodrigues", "time": 1538876226898, "rating": 5.0, "text": "I attended to Amy’s newborn photography workshop and it was life changing ! I learned so much , my confidence improved tremendously! This was one of the best investments I make in my business!", "pics": null, "resp": null, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "105235107078474495421", "name": "Karl Antoine", "time": 1561602147724, "rating": 1.0, "text": "This individual is not professional at all. I contacted her over two months before my baby would arrive, to see if scheduling would work for a newborn shoot. She responded with an email of her package pricing and the services provided. My wife and I felt we could work with her, so I replied letting her know the package we wanted, and if she would be able to also do the maternity shoot for my wife. I made attempts to contact her via phone for a conversation to fully understand her process, and communicate what we were looking for. Getting her on the phone was nearly impossible. The failed attempts were due to her workshop held in Canada in late April. I made additional calls, with no success, and no capability of leaving a voicemail, as hers was full. My only other option was to send another email. She replied a few days later in between her workshop with one available day in May for the maternity shoot. She did say it would be difficult to fit my wife in for the maternity, but would try. My wife and I initially agreed to the date, and Amy sent an email with an invoice. Throughout this whole interaction, no phone conversation took place. I paid for the maternity shoot in full since the date was about 3 weeks out, and placed a deposit for the newborn shoot. I did this to make sure we could get on her calendar, despite still not talking with her. After I paid her, I still was not able to make contact to coordinate the maternity shoot. I also made her aware that we live in the metro Atlanta area, and would be driving to her. Due to the lack of communication, and not being familiar with the Auburn area, her studio, caused my wife and I to cancel. Again, not being able to get her on the phone to communicate this, I texted her to about a week and a half prior to the maternity shoot to cancel. I asked if the balance I paid could be moved to a larger newborn package, and she was pleased to do so. Fast forward to June 14, I contacted her to let her know the exact date our baby would be born, understanding that we would finally have a phone conversation. Still no success on that front. She responds with one date for the newborn shoot that did not work for my wife and I. I then asked if she would be able to do the shoot on a different day, and that too did not work for my wife and I. It wasn't until I sent her an email letting her know I wanted to cancel everything was when we finally spoke on the phone. I let her know I wanted all my money back and explained the reasons why. She offered no apology, no option, only another date, that still did not work. Her only response was to take it up with PayPal, so I did. I never write reviews of this length, or do review at all, but Amy brought this on herself. She texted me 3:50 AM, then again at 5:03 AM, clearly upset about the outcome of the PayPal dispute. If she did not decide to harass me, and move on, I would have done so as well. There is always 2 sides to a story. I disclosed everything to PayPal, also citing that I was not provided any contract, offered three dates, that did not work, and minimal communication from Amy. Writing all of this took time I did not want to give do so, but having worked with multiple business owners and professionals from different industries, Amy lacks attributes of a business owner. Primarily that of being ethical. Doing research provided me insight on what Amy's true passion is, and that is holding workshops. He lack of availability is due to the abundance of workshops she is scheduled to hold. If she disclosed this material information to me from the very beginning, I would have made the decision to work with her or not. There are so many workshops planned for the remainder of this year, as well as 2020, both domestically and internationally. It's also clear that workshops are her passion, when 100% of her positive 5 star reviews are from workshop attendees. Amy I truly hope you use this as a learning opportunity to improve your business model, and just stick to doing workshops, or fully disclose how you work.", "pics": null, "resp": {"time": 1561641320879, "text": "This gentleman sent red flags from the very beginning so having a phone conversation with him was definitely out of the question. I knew I needed a paper trail to have proof of our conversations via email and text messages. I’m so grateful I have the documents that I’ve sent to PayPal. I was more than professional and when he cancelled his maternity session I was more than happy to let him transfer that money to his newborn session. This is after sending pictures of all of my maternity gowns and giving him several dates for his maternity session. They simply didn’t want to make the trip to Auburn. I was more than flexible by giving him 3 available dates for the newborn session. Baby hasn’t even been born yet! His assumptions about workshops are false. My family will be on vacation on the exact date that he wanted which is why I always advise my clients that we both remain flexible because we never know when babies are going to make their appearance into the world. My passions are my own family and newborn photography.  Workshops are how I put food on the table. I’m so glad I didn’t speak to this guy in the beginning because I wouldn’t have all the documentation of our many emails and text messages to prove how above and beyond I went for him. This scammer did get a full refund but because of the documents I sent, PayPal covered my expenses. I have a feeling this guy is very familiar with ripping people off."}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "116036768015559934782", "name": "Betty McGillis", "time": 1461444107151, "rating": 5.0, "text": "I've done a newborn workshop with Amy, she is a gifted prefessional..beyond talented.. I cannot thank her enough for sharing her gift with other newborn photographer's like myself. My business has thrived since doing the workshop, thank you Amy..", "pics": null, "resp": {"time": 1510718929748, "text": "Thank you so much Miss Betty!"}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "116644915025050584605", "name": "JR S", "time": 1433797794673, "rating": 1.0, "text": "I'm sure she'll send the National Reserve out to find me for writing what I endured. I tried contacting this photographer before my daughter was born and she never returned my phone call or writing via Facebook. I didn't like how I was treated- she acts like everyone else in this rotten town- treats people like money bags than a breathing and valuable human being.", "pics": null, "resp": {"time": 1433800671482, "text": "Congratulations on your new arrival but I don't think you actually tried contacting me.This is the strangest thing I've ever read! I'm sorry for what you've \"endured\" by me not replying to you. How can I treat you like anything if I never actually spoke to you?"}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "109098625208237991923", "name": "Лена Леденцова", "time": 1548840048158, "rating": 5.0, "text": "Very beautiful Job", "pics": null, "resp": null, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "109298565385829908994", "name": "Brittney Malone", "time": 1588388544141, "rating": 5.0, "text": "Working with Nick and his team is always an amazing experience! Nick has created amazing promo videos for my business and also captured many special moments for my family! I never have to worry what the end result will be because he always takes my crazy ideas and turns them into the perfect work of art! You will not be disappointed choosing Nick Frontiero Productions to capture all the specials moments!", "pics": null, "resp": {"time": 1589486084547, "text": "We have loved getting to be there for your business journey and through your family growing! You are family! We love you and are so thankful for you!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "101433340818095207307", "name": "Danielle Vannoy", "time": 1497495001647, "rating": 5.0, "text": "Nick Frontiero is an extremely talented photographer and it truly shows when he is in the zone searching for the perfect light and angle so that he can capture special moments. He and his wonderful team, Jenna, Susan, and Shannon, made our wedding day fun and turned what could be monotonous photos into an artistic and enjoyable experience. They were extremely professional and friendly and could make even the most camera shy person feel comfortable. We appreciate their hard work and dedication and could not imagine having anyone else shoot our special day! Our pictures turned out so amazing! Nick takes time to meticulously pick the best photos from your special day and edit them to perfection. If you want a way to preserve your wedding day so that you can share it with your family and friends for years to come, then he's your guy. My husband and I opted to not get a videographer, and after getting our photos back from Nick, I know that we didn't make a mistake in doing so because he made sure to capture everything! NFP is the bomb!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNIoAOi4BiFwtwCk93jHJB-v_VodVr4Ti6ZMDVC=w150-h150-k-no-p"]}], "resp": {"time": 1590691090404, "text": "Thank you so much Danielle!!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "106407239975206507935", "name": "Christopher Stitcher", "time": 1607187070375, "rating": 5.0, "text": "Best photographer in the river region and beyond! Great team and always a fantastic product!", "pics": null, "resp": {"time": 1607359013553, "text": "Thanks so much Chris 🙏 It was great getting to see you and the family this past Saturday! Can’t wait to share your portraits with Santa!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "116709788052479615166", "name": "Lauren Williams", "time": 1588384252140, "rating": 5.0, "text": "Nick and Kayla were so wonderful to work with! They were SO patient with my 2week old for newborn pictures and our family portrays as well! Nick has such a creative eye and has such a talent for capturing the most special moments.", "pics": null, "resp": {"time": 1589486011920, "text": "We are so thankful we got to work with you and your sweet family! Thank you so much Lauren!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "109787875678780773216", "name": "Sarah Bryan", "time": 1497548634989, "rating": 5.0, "text": "Nick Frontiero is such a wonderful photographer truly devoted to his passion for art. He brought to life every aspect of our wedding day and then some. I could not have asked for better quality photos. I am still in awe that he captured some of the most personal and sacred moments of the day in such a wonderful light. We will cherish these photos forever. What I loved most about Nick's photos are the \"in the moment\" pictures that he captures. Looking back through our photos, we were able to completely relive the day and look at moments we did not see on our wedding day. We received so many photos I had no idea were taken and we are so thankful to have them. He is incredibly professional and has many options for packages. I was pleased with his work from beginning to end as he went above and beyond. I highly encourage any bride to book Nick ASAP! You will not regret it! I truly do not have enough words to describe how grateful I am for Nick Frontiero Productions. Absolutely amazing!", "pics": null, "resp": {"time": 1590691360466, "text": "It was such a pleasure! Thanks so much for having me capture that special moment in your life!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "115071144720415604565", "name": "Lyndsey J.", "time": 1499135436967, "rating": 5.0, "text": "It's difficult to put into words what an incredible experience we had with Nick and his team throughout our wedding journey. From our first meeting up to our wedding day, Nick was more than we could have asked for in a photographer. Having beautiful images that not only captured our special day but would be forever keepsakes was incredibly important and a big factor in why we selected Nick Frontiero Photography. Nick and his team captured the fine arts style I had been dreaming of while still incorporating those classic, traditional shots. Their amazing skill set is displayed in all of our wedding day images. We were blown away by the attention to detail, creativity, and the little mementos included from our special day. Not to mention, Nick's use of film along with digital really gave the unique styling we had been looking for in a photographer.\n\nA big THANK YOU to Nick, Jenna, and Shannon for helping make our wedding day truly magical and something we will remember for a lifetime.", "pics": null, "resp": {"time": 1590690609374, "text": "We are so grateful you chose us to capture such a special time in your life! It truly means the world to us."}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "116166918661193739883", "name": "Lance Mauldin", "time": 1499807614831, "rating": 5.0, "text": "Nick and his staff were incredible to work with to capture all the images for our special day.  My wife and I were blown away by the quality of the pictures and Nick's unique ability to capture special moments that we will treasure for a lifetime.  I would highly recommend Nick to anyone looking for someone that will work with you, help put you at ease, and capture the most brilliant images you could imagine.  We appreciate everything Nick did for us, and will be using him in the future for any other photography needs.", "pics": null, "resp": {"time": 1590690562944, "text": "So glad I could be part of your special day! It truly means the world to me to capture such special moments for your family!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "104521342252243684277", "name": "Stephanie Sims", "time": 1497531391862, "rating": 5.0, "text": "Leading up to my wedding I searched & searched for photographers. I wanted one that would think outside the box & be able to capture the most memorable moments on my special day, however I found SO MUCH MORE with Nick! He was professional, a ton of fun to work with & he need little to no direction. He created a vision for me took the lead and my now husband & I followed. Our engagement & wedding photos are beyond amazing to say the least! I remember the day I received my wedding album, I cried as I turned detailed page after page.\n\nI was completely blown away at how he took that one day & transformed it into a piece of art!!! I appreciated how hard he & his team members worked on the day of the wedding. When you hire someone to do a job & after they have completed the job you find it hard to put in words how satisfied & pleased you are with that individual, that's when you know you made the right decision!!!!", "pics": null, "resp": {"time": 1590691392319, "text": "I'm so glad you loved it so much! I appreciate you so much!!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "109645526839109944854", "name": "Keeper58 Bibb", "time": 1498336287616, "rating": 5.0, "text": "Nick is absolutely amazing. He is very creative and always get the best shots. Him and his staff captured the best moments in our wedding. I look forward to working with him on other projects. By the way, our engagement photos were amazing and we are still getting compliments on them.", "pics": null, "resp": {"time": 1590691220786, "text": "Thanks so much!!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "114062734109470476802", "name": "Courtland Bibb", "time": 1604419116592, "rating": 5.0, "text": "The staff is helpful and great", "pics": null, "resp": {"time": 1605895121621, "text": "Thanks so much Courtl Bi for the review! Serving people with the highest excellence is definitely our aim! So glad you had a great experience!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "107945904108671241724", "name": "Skyler Shirley", "time": 1497535775139, "rating": 5.0, "text": "Nick is an awesome photographer! He was my photographer for my wedding and it was the best decision I made. He takes time to learn exactly what it is you want and goes above and beyond to meet those expectations. I recommend him to anyone who ask me about a photographer for any occasion. He is the best!!", "pics": null, "resp": {"time": 1590702302369, "text": "It was truly an incredible day! I was honored you chose me to capture that special moment in your life!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "111890651726256002920", "name": "Casey Stephenson", "time": 1497497770093, "rating": 5.0, "text": "Nick is the absolute BEST in his field! He becomes personally involved in your session and is sure to capture your individuality. Nick will always be my photographer, and I can promise you won't regret using him to capture your special occasions !", "pics": null, "resp": {"time": 1590691075864, "text": "Thanks so much Casey!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "113876076560476358105", "name": "Chantal Hopkins", "time": 1497562357092, "rating": 5.0, "text": "Our experience working with Nick was beyond OUTSTANDING!  Nick is very professional and personable.  He made our engagement session so much fun!!  He also captured every single moment our of wedding day and the quality of our photos are the absolute best.", "pics": null, "resp": {"time": 1590691321424, "text": "Thanks so much!!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "112955100617682591642", "name": "Jillian Ziemanski", "time": 1497620968651, "rating": 5.0, "text": "Nick and his team were perfectly professional while still maintaining a relaxed atmosphere. They captured every moment of our wedding day flawlessly! Our photos tell a beautiful story, and we're so thankful that we chose Nick as our photographer!", "pics": null, "resp": {"time": 1590691242311, "text": "Thanks so much Jillian! It was a pleasure!!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "116403716739192401006", "name": "Chase Watford", "time": 1497531959584, "rating": 5.0, "text": "There are absolutely not enough words to describe how thankful I am to have chosen Nick Frontiero Productions and his team to capture our day. I had a friend who used Nick and knew immediately i wanted to use him for our wedding day. Not only are his pictures absolutely gorgeous , but he goes above and beyond to give his brides exactly what they ask for. We did not know eachother before the wedding process, but now Nick and his wife Jackie are some of my most cherished friends. Nick brings a full team to shoot on the wedding day and i seriously felt like a celebrity with an entourage. There is not one moment of our day that they did not capture. I am forever grateful for this guy and his insanely cool photography skills. You will NOT regret booking Nick Frontiero Productions for your event. I can't wait to use him again for maternity and family photos one day!\nMuch Love,\nLindsey Watford", "pics": null, "resp": {"time": 1590691414566, "text": "It was such a pleasure! Thanks so much!!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "116968254954101198083", "name": "Lauren Hoepfner", "time": 1503093568128, "rating": 5.0, "text": "I cannot say enough good things about Nick and his team! Nick helped us to design a wedding package that worked the best for us and fit our budget. We wanted to do a lot of our pictures before the ceremony, and Nick worked with us to get everything figured out. He put together a detailed timeline for the wedding day, so we knew exactly who needed to be where and when. He and his team were so incredible to work with and captured absolutely amazing pictures of our entire wedding day. Nick also has 2 Polaroid cameras and took polaroids throughout the day. At the end of the night, he presented us with a beautiful wooden box with our names on it, full of all of the polaroids he had taken that day!! It was such an awesome surprise to have at the end of the night, and we loved getting to see a sneak peek of our wedding pictures. When our final photos came, they were PERFECT!! Thanks Nick and team for being the best and helping make our wedding day so much fun!! Y'all are the best!!", "pics": null, "resp": {"time": 1590690499843, "text": "We are so glad to be part of your special day!! We are so grateful!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "108447198262550732644", "name": "Elizabeth Wells", "time": 1497542527695, "rating": 5.0, "text": "Nick and his team were great to work with through the planning process and the day of our wedding. He took beautiful photos of the wedding and we'd definitely recommend him to a couple looking for a photographer.", "pics": null, "resp": {"time": 1590702242449, "text": "It was an honor you chose me to capture your special day! Thanks so much!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "118360194249319202501", "name": "Natalie Rowell", "time": 1497498547843, "rating": 5.0, "text": "Nick is an amazing photographer and is just as awesome of a person! Very professional and fun! He makes the experience very comfortable and produces amazing images! He will not disappoint!", "pics": null, "resp": {"time": 1590691102608, "text": "Thanks so much Natalie!!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "109753910865605205735", "name": "Meredith Moseley", "time": 1497527011479, "rating": 5.0, "text": "Nick did our Senior Portraits and we were and still are in love with our images, Nick was very easy to work with, very affordable and FUN! I can't wait to have my grandson's growth captured!", "pics": null, "resp": {"time": 1590691117347, "text": "So glad we got to capture those memories!!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "107856030216026223930", "name": "Haley Daniel", "time": 1497964717408, "rating": 5.0, "text": "He did AMAZING on our engagement pictures, wedding pictures, and wedding album!!!!! We love him!!! So glad we used Nick to capture moments that we will have forever :)", "pics": null, "resp": {"time": 1590690690490, "text": "Hey Haley! It was such an honor getting to share such special moments with you!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "104487008235926237871", "name": "Jenna Garrett", "time": 1497803506600, "rating": 5.0, "text": "From the moment NFP started popping up, I've admired Nick's photography style - so booking him for my wedding was already a given! I've seen Nick in action, and final products, but I was speechless when I finally got into our gallery! He captured so much emotion and happiness authentically, with each image providing an excellent reminder of each individual moments of our day. One of my favorite parts of the day was getting a box of polaroids at the end of the night - along with the film shots later. He can take any space/venue and make it look elegant - even our small backyard ceremony! You can choose a photographer who's style you like, or choose a photographer who's style constantly evolves and adapts with each individual wedding. All the weddings Nick has photographed look amazing, but I don't think you fully appreciate the talent until you see yourself captured by it. He's laid-back, focused, and actually a pretty stealthy photographer. NFP is an investment worth making if you want beautiful memories captured to last a lifetime!", "pics": null, "resp": {"time": 1590690765069, "text": "Hey Jenna! It was truly an honor getting to capture your beautiful day! You've become family! and we love you!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
