{"user_id": "113073151865447294636", "name": "Collin Robinson", "time": 1629306452089, "rating": 5.0, "text": "So much fun! DJ Platinum had our entire wedding dancing for almost 2 hours. He played a very good mixture of popular and catchy songs for everyone to enjoy.\n\nOnce the playlists my wife and I sent him ran out, he seamlessly played his own mix and had a good time with it.\n\nBrian Robinson (not related) MCd and he was very professional and fun too!\n\nThe photo booth was a huge hit, and the pictures it printed were a nice touch. Plenty of friends and family left with 2 or 3 photos in their hands.\n\nI highly recommend Platinum Entertainment DJ to anyone in the Birmingham, AL area!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "112249180929930124797", "name": "Rolanda Hammond", "time": 1629563705755, "rating": 5.0, "text": "DJ Platinum provided great music and all around EXCELLENT service for my company's 2 day event! I highly recommend him for all of your functions!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "113298567284197600786", "name": "kim russell", "time": 1626455603793, "rating": 5.0, "text": "DJ Platinum did a great job with our wedding! He turned our wedding reception into a huge party! I had a great time working with Platinum Entertainment. They are very professional and the online client site made it very easy to customize the music for my wedding.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "117169855353980590722", "name": "Teddy Rachel", "time": 1617038660219, "rating": 5.0, "text": "We had an absolutely great experience with platinum entertainment! We had DJ platinum and he was extremely professional and kind through out the entire process. The website was easy to use, they were very willing to help us in any way and the wed site and song list were easy to use. Sound quality was great, music selection was great. Couldn’t have wanted anything more, and one of the more affordable options as well. Lots of options for upgrades if you’d like such as photo booths, better lighting and personalized touches but we didn’t opt for those, I’m sure they would have been fun though.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "114123426787945851253", "name": "Alissa Maldonado", "time": 1627265760497, "rating": 5.0, "text": "The guests would not stop dancing the entire night! The band was above and beyond. They did a great job between balancing spanish music and today's top hits. 10/10 would recommend!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "106863722157897804259", "name": "Brandee Davis", "time": 1620917774567, "rating": 5.0, "text": "Excellent experience!! The smoke machine and sparklers were a great accent to our big day!! Very professional and everything was organized so perfectly! I would definitely recommend using this company for your special occasions", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "107319094291154570012", "name": "A S", "time": 1623772450750, "rating": 1.0, "text": "Hello!\n\nMy client and I were not pleased with the cloud effects and the lighting. I kept having to keep dimming the lights to actually see the lights on the ceiling, which is not what I was expecting. They were not the lights that I requested.\n\nI was never asked where I wanted the lights set up. Also, I was told that your employee could only run the cloud machine once and that is not what I paid for. I spoke with Andre the owner and he stated that he could not do it and I had a full camera crew on site for this event and it did not look well on cameras. I am really upset and feel like I was taken advantage of as a woman.\n\nThe owner eventually stated that he could do another cloud which did not last long at all.\n\nI did not feel like a client that the company cared about. I felt taken advantage of and let down considering that this was a major event for my client.\n\nI do feel like these issues need to be addressed.", "pics": null, "resp": {"time": 1623790101504, "text": "Hello Aleta,\n\nUnfortunately, the 3rd party person you booked us through did not explain the functions of the services you booked. They consulted us and told us that you needed dance floor lights and the dancing on the cloud. That is what your proposal was for and that is what was paid for and those are the services you received. If you needed the service multiple times then you would have to pay for the additional times.\n\nThere was never any contact from you until the day of the service. We spoke with the 3rd party you used to book the service, therefore, we cannot confirm what was agreed upon from those conversations between you and that person.\n\nDancing on the Cloud is a one time use cloud of smoke that is normally used for a first dance. It is not a multi-use service and it is what was requested and what was paid for. The dancing on the cloud lasts 2-3 minutes. That’s What we advertise on the website and that is what is written up on the client site by contract.\n\nDance Floor lights are moving head lights on truss stands that are Meant to shine on the dance floor. Also, with any lighting, it is not expected to have lights on in the room with lighting services. If you wanted Lighting for the entire room, WE would have advised you to go with uplights versus dance floor lights. We also would have advised 2 sets of uplights since the Boutwell Auditorium is a big venue. We never spoke with you, only your 3rd party booking person.\n\nIt was explained to you when you called the day of the event how the services work.\n\nMany of our clients are women. We do not take advantage of people. We simply provide the services requested of us. Unfortunately, you didn’t give us a chance to discuss prior to posting a 1 star review.\n\nThanks! Have a Great Day!"}, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "100354024946965785625", "name": "Chelsea Ryles", "time": 1625689731798, "rating": 5.0, "text": "Our DJ was AMAZING . He made our night PERFECT. The music transitions were ON POINT .  He kept the crowd up all night at our wedding . We also used him for uplighting , a photo booth and dancing on the clouds for our first dance which the guest enjoyed . We could not have asked for a better company to use for our wedding . He is worth EVERY PENNY.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "114871775959483318296", "name": "Alyssa Angel", "time": 1599068730417, "rating": 5.0, "text": "These guys are amazing! They provided the Photo Booth for my event and it was a HUGE hit! All of our guests loved it. It takes beautiful, high quality pictures and makes everyone look like a million bucks! The team also helped me design a custom layout for my prints and digital downloads which was amazing. These guys are the real deal and some of the best money we spent at the wedding! Don't hesitate to book them! You won't regret it, and i say that with confidence!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "109941719816502000188", "name": "Harper Basquill", "time": 1613744791468, "rating": 5.0, "text": "We hired Platinum Entertainment for my daughters 13th birthday party and had the DJ and mirror photo booth and they exceeded our expectations! They stayed in touch leading up to our event, did an excellent job designing graphics for the photo booth print out pictures, and kept the kids dancing with the music they chose! The mirror photo booth was very popular with the kids and adults, highly recommend the mirror photo booth!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "100803294590759815487", "name": "Jessie Hickey", "time": 1607303347568, "rating": 5.0, "text": "My husband and I got married on November 21, 2020 at Matthews Manor and DJ Platinum was our DJ! It was absolutely AMAZING! He checked in with us multiple times before the event, the night of was incredibly flexible, and overall made the night more enjoyable! He played the best music and listened to exactly what we wanted!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "117429410283577237991", "name": "Breonna Dunn", "time": 1617152025094, "rating": 3.0, "text": "Trevon was AMAZING! Ceremony music and dj’ing during reception was flawless. However, one of my sparkles during our grand entry and re-entry did not work. Also, the fog machine and monogram did not have the effect I expected.\n\nI would definitely hire Trevon though for future events.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "110387279282910657248", "name": "Breanna Culwell", "time": 1592277747849, "rating": 5.0, "text": "Absolutely incredible. I was super stressed about picking music right before the wedding they met with me, and as soon as we were done I was so confident in my music choices. He really knows how to read the crowd and get them involved and all out on the dance floor. Will definitely be hiring them for other events in the future, I could not have asked for a better DJ for our wedding. The photo booth was amazing. So many of my guests were taking about how great our DJ was not just at the reception but throughout the entire ceremony. If you are trying to find a DJ for your wedding, stop looking now, and hire platinum entertainment.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "115716368883465207896", "name": "Tracie Hughey", "time": 1613226864053, "rating": 5.0, "text": "What an amazingly postiive experience I had!!!  I can not say enough about how professional Platinum Events was through this entire process.  We had a high school dance.  From the beginning to the end, the experience was wonderful.  First was the immediate responses to all questions and communication.  The website was professionally and clearly laid out.  The \"ala carte\" choosing of the services they provide was so user friendly.  All communication was done by email so everything was clear for me.  I didn't rely on any  verbal committments, it was all recorded in emails.  The price...frankly I don't know.  I live by the motto you get what you pay for....I love capitalism.  And if I paid more than other services, I don't care....I got what I paid for....a wonderful experience.  Our services included a DJ, lights, sound system, and mirror photo booth.\nThe DJ set up was compact, high quality and the DJ screened the music for me...(i had enough on my plate).  Their website allowed my daughter to upload a spotify playlist easily and he screened it.  It also allowed a timeline that he respected and utilized..  The website has event planning section ......It was great.  I wish I was gifted at writing so I could paint a picture of what a wonderful experience but.....I had a wonderful experience and will recommend and utilize them a hundred times over!!!  We also utilized the Mirror Photo Booth...so fun.  Great props, assistance at it's side the entire time, easily usable, I am so glad I upgraded to this but I am sure the starter photo selection is great too but I am glad I upgraded to this one.  They designed a stamp for each of the photos customized to our event and they initiated that process and went with it without much of my involvement because I didn't have time.  The individuals who worked the event were dressed appropriately for the event, cordial, available, cooperative....I appreciated them handling EVERYTHING.  It made it worth every penny.\nMy ONLY suggestion would be to work with them on customizing your props for the event.  That was a shortcoming on my part not theirs.  Their props were great but looking back, I wish I had included some things that were directed toward this group of seniors.\nI can't thank them enough for working with us on providing these high school seniors a winter dance that had been cancelled by those around them twice who were more concerned about perceptions of participating in a \"super spreader event\".  They had a wonderful time, fantastic memories, and NO, we weren't a super spreader event.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "117900391247237689780", "name": "Anne Heaney", "time": 1605478332170, "rating": 5.0, "text": "Very professional! This team took such good care of my husband and I at our wedding and during the planning process, and made sure we had the perfect ceremony and reception! If you don’t want them to stray from playlist, I recommend telling them not to take requests, but just know you are in good hands with Platinum!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "104073717433578632420", "name": "summer perry", "time": 1597852167319, "rating": 5.0, "text": "Andre did such an amazing job providing the music for our wedding. He was very intuitive in playing songs that inspired our guests to dance and enjoy themselves! We also got the cold spark and dance floor light add ons and they were well worth it!! The cold sparks are SO AWESOME and surprised and delighted our guests during both our first dance and our wend off.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "107759013879817623292", "name": "Bethany Henry", "time": 1584712497566, "rating": 5.0, "text": "DJ Andre and his crew are truly the best in the business. The communication prior to the event, his professionalism during the event, and the overall execution was incredible and played a HUGE role in making our wedding day so fun and special. Andre did our ceremony and reception music and made everything flow so well with very little instruction from us...he didn’t miss a beat! His DJ booth, the uplighting, and his entire set-up look SO nice and professional! They add a very unique element that I wasn’t expecting, but was so happy with! DJ Andre played all the music that we requested, but also took guest requests and worked them in seamlessly to keep the overall vibe the same. And last but not least: they had a very sweet surprise for us and our guests at the end of the night that they had compiled throughout our day! I told everyone that night that Andre was not only one of our BEST vendors, but also one of the most affordable. You will not regret booking him for your wedding or special event!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "116430348420419770695", "name": "Chloe Harbison", "time": 1591489959536, "rating": 5.0, "text": "We booked Platinum Entertainment to DJ at our wedding- we spoke with Andre and explained to him what we wanted at our ceremony and how we would like our reception to be a big, fun celebration. Andre did not disappoint- everything was phenomenal!! Our wedding would not have been the same without them, I could not recommend them enough!\n\nVery professional and easy to work with!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "114180843333105291346", "name": "Billy Parker", "time": 1603391618480, "rating": 5.0, "text": "THE BEST DJ EVER!!!!! Highly recommend to anyone who is looking for a DJ you can trust to do an incredible job. Our reception was the best!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "104349675559494838490", "name": "JK Presnick", "time": 1568166982346, "rating": 5.0, "text": "DJ Platinum was SO much fun!!! I don't think there was one wedding guest not dancing & I had an afternoon/day wedding! The entire company and process with Platinum Entertainment went above and beyond to make my wedding planning as least stressful as possible. The website allows you to customize your day however you wanted with a \"do not play\" list, a \"play\" list, a wedding day timeline & so much more!! I even ~joked~ the day before my wedding & told my parents that I thought the only wedding vendor that did not stress me out yet was the DJ! The morning of the wedding we got a call from DJ Platinum telling us that they got a new photo booth & were wondering if we wanted to try it out for FREE!!! I am SO HAPPY we were able to have this at the wedding!! For any future brides, I would HIGHLY recommend using their photo booth because it was an absolute HIT!! I was able to have a link of every picture that was taken in the booth & it was one of my favorite things to look back at from the day of!! Looking back at my day, I would ABSOLUTELY \"splurge\" with the photo booth! I couldn't imagine my day without it. Thank you so much Platinum Entertainment!! All of my guests complimented the DJ days later!!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "113968821610841605818", "name": "Nicole Towns", "time": 1585181297627, "rating": 5.0, "text": "I used Platinum Ent for uplighting and a photo booth. I was blown away with their service. The uplighting really made the room pop with the green color. The photo booth was so much fun. My guests really enjoyed it and I had a lot of fun playing on it. The personal touches that was designed was beautiful. There were so many options. I would definitely recommend them for any event!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "117434750201721822021", "name": "Nia Richardson", "time": 1573003987400, "rating": 5.0, "text": "DJ Andre was absolutely the best! The communication was great, and the online customer portal made it easy to customize my packages. He played all the music that I wanted and new songs that I loved. The uplighting was phenomenal and it really completed the look. Plus, the Mirror Booth was a hit all night long. Booking Platinum Ent was the best decision, and affordable too.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "113870332684016942162", "name": "Brittany Mosier", "time": 1530279037119, "rating": 5.0, "text": "DJ Platinum was SO AWESOME! He did our ceremony music and the reception for our wedding day and everything was perfect and exactly what we asked for. He responded quickly and efficiently to all my questions and had our wedding guests dancing the entire night! We loved our static monogram he created for us and it was exactly what we wanted! Our wedding guests still talk about how much fun he was and that the variety of music he played was fantastic! I could keep going on and on about him and how great the customer service was! Platinum Entertainment is a definite MUST for your wedding day DJ!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "108037293941024594767", "name": "Ojas Gokhale", "time": 1601267301982, "rating": 5.0, "text": "I have known DJ Platinum as a coworker and as a DJ. He is the most amazing DJ we have encountered at Wedding events and there are not enough words to describe his talent; he takes requests on the fly and blends them seamlessly into his routine and often can incorporate music out of the standard genre (His Bollywood music skills are now legendary among my Indian friends). He performed at two of our friends weddings and obviously, recently at my own wedding. He set up the mood for the perfect party; one that my wife and I had desired. Everyone danced right right until the end. The lights and speakers he got were nothing short of a nightclub in Vegas.\nHe is very easy to work with and has a very professional approach, including an online dedicated user portal, with a form to setup songs. I highly, highly recommend his services.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "100594469079064428534", "name": "Dana Franklin", "time": 1560870055233, "rating": 5.0, "text": "Platinum Ent is the BEST to get all that you need to make your event sure to be a hit!  We used DJ Platinum Andre for our event lighting, mirror photo booth, dancing on the cloud, cold sparks, and more! Not only did the DJ really know how to turn up the party, and add beautiful special effects to our day, but the service was the ABSOLUTE BEST!!! Whenever we needed anything they were right there to help us!  I am big on service, so i the service is good I am highly likely to return and recommend your business! AND I HIGHLY RECOMMEND THERE SERVICES!!! Thanks again Platinum Entertainment!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "102337304870064166631", "name": "Jessica Upton", "time": 1545237562237, "rating": 5.0, "text": "Platinum Entertainment was excellent. They were easy to work with and everything was easy to set up. The music playlist can be set up through their website, which is super helpful. They also include must have songs and a \"don't play\" list. They took requests and made announcements throughout the ceremony as requested. Everyone at the wedding said it was the most fun wedding they'd been to - and a good bit of that experience can be attributed to the DJ  from Platinum Entertainment. They made our special day a lot more fun!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "109366621583925003259", "name": "Sebastian Eady", "time": 1556577104548, "rating": 5.0, "text": "DJ Platinum was awesome. He was very easy to contact and got back to us in a timely manner. His website is very straight forward where you could add a playlist to the website if needed. He played amazing music for all ages to enjoy!! He set up for the ceremony and reception and played the music according to the schedule. Overall great experience! Would recommend and use again to family and friends 100%. Thank you DJ Andre!!!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "104052489346513726369", "name": "Justin Mathison", "time": 1564896088671, "rating": 5.0, "text": "Andre and his team were phenomenal. Everything from the lighting to the custom logos to the EMCEEING to the mirror photo booth and of course the music was amazing! My wife and I could not be anymore pleased. He was super communicative throughout the entire process and we had so many great comments about the services he had to offer. He even did things on the fly which really helped us out! Thank you Andre and the Platinum ent. Team!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "104005600110603854714", "name": "Kennedy Thomas", "time": 1526915571619, "rating": 5.0, "text": "I do not have enough good things to say about Andre. He was so easy to work with, got back with you quickly, and made sure he knew exactly what you wanted for your big day! I trusted him completely with the song choices & he did an awesome job. He was good at reading the crowd, playing a mixture of genres & songs that got everyone dancing at my reception. Also- his prices are INCREDIBLE! Really cannot go wrong with DJ Platinum!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "104694368420360464750", "name": "Tricia Tapley", "time": 1572640431812, "rating": 5.0, "text": "Andre with PlatinumEntertainment was awesome!!! Best DJ, lighting. Professional setup!! He kept all the guests dancing all night long. Such an easy person to work with. Highly recommended him for any of their services. His online setup of your timeline, music playlist and do not play, etc was so easy to do. He is so much fun and fantastic to work with!!! Thanks for a wonderful wedding party for our daughter.!!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "109668712452647258076", "name": "sarah stephens", "time": 1514765879878, "rating": 5.0, "text": "Platinum Entertaining DJ went above and beyond at our wedding reception!!! He kept the party going for 5 hours!! The dance floor was full for a solid 4 hours. During the planning process Andre addressed all of my questions within the same day. He was so easy to work with and made me feel confident that we’d have a fun wedding. He played all of our songs as requested and ended the songs where I wanted them to end (we did partial songs during the father/daughter mother/son dance). He did cues for different parts of the reception (toasts, send off, etc). Everyone commented that they had the best time and it was largely because of the music choices! I’m so beyond thankful for Platinum Entertaining, they did a fantastic job!!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "107682899931534867598", "name": "Stacey Green", "time": 1572443253446, "rating": 5.0, "text": "I rented the photo mirror for our employee banquet.  It was a huge hit.  Everyone loved the pictures.  We really enjoyed using the props and the guy who managed it was great.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "108828007058460682094", "name": "Keisha B.", "time": 1507817317932, "rating": 5.0, "text": "One word: AMAZING!!! My wedding reception was on Saturday, October 7, 2017 in Huntsville, AL. I think on Tuesday evening, I decided I wanted a photo booth and so the search began. During my search, I ran across Platinum Ent Dj's website. They offer a Mirror Booth rental. BEST THING EVER!!! What I loved about the website was that you could instantly find out if the booth was available for your event and how much it would cost. I also was very happy that this company was willing to travel to Huntsville, approximately 1.5hrs away from Birmingham, for my event.\n\nFrom the very beginning, Andre was courteous and professional.  This company definitely understands customer service and it shows! They provided an easy and convenient method to pay for the services online which I appreciated. They also showed up early to the event just to make sure everything was in its proper place.\n\nThe mirror booth was a real hit with my guests. Everyone absolutely loved it! Based on my experience, I highly recommend this company to anyone looking for quality service and a stress-free event. This company literally exceeded all my expectations.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "111222103569986688517", "name": "Amy Davidson", "time": 1545539748354, "rating": 5.0, "text": "DJ Andre was a fantastic DJ for our daughter’s wedding reception! He kept the party going for 4 hours and was so easy to work with. We would definitely recommend him for any event.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "100791531187314044988", "name": "Mary Cowan", "time": 1573601419949, "rating": 5.0, "text": "DJ Platinum and his crew were amazing! Very professional and read the crowd very well! Everyone can’t stop talking about how much fun the wedding was! The up lighting is a MUST! 10/10!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "116725622801658922648", "name": "Sheriah Gibson", "time": 1535643301211, "rating": 5.0, "text": "Awesome to work with! As an event planner, Andre made my job easy but his timeliness and making sure I was fully aware of their needs to execute the event and keep our clients pleased. He was great to work with and I look forward to booking him again soon! Thank you!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "114729532607714712505", "name": "Ivy Patterson", "time": 1550692243117, "rating": 5.0, "text": "“We had a great experience with DJ Platinum. We were ambivalent about getting a good DJ because we wanted to avoid the corny vibe we’ve seen so much at school dances, but Andre was down to the earth, played great music, was totally accommodating to our students, and created an incredible soundtrack for our night! He was also perfect with timing and setting everything up before the dance started.  Plus, he adjusted his songs to the vibe of the party which was awesome. It was great to have DJ Platinum along with his lovely wife Kia.  It was just great to have someone so attuned to what we wanted. This DJ company is super professional and reliable and communication was wonderful and clear throughout. Thank you again Andre and Kia for sound-tracking such a wonderful night!”", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "113655657374020030186", "name": "Ashley Harris", "time": 1528937037196, "rating": 5.0, "text": "Andre was super responsive as we were planning for our wedding on June 9th. He even put together a last minute mix for the father Daughter dance! Price was absolutely reasonable and the Photo Mirror is a must!! Would definitely recommend!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "101450557188396234990", "name": "Brittney Jones", "time": 1574700466310, "rating": 5.0, "text": "Amazing and professional company, they are the best and made both of events successful! I can't wait to use them again.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "108846228832747243457", "name": "Miranda Carroll", "time": 1564861866296, "rating": 5.0, "text": "I absolutely loved the photo booth at a recent Wedding I attended. It Captures all of your personal&funniest experiences, and memories😍🥂🍾💕 I highly recommend this for your next Event⭐⭐⭐⭐⭐", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "110118678117047180824", "name": "Britnee Wellman", "time": 1472163471807, "rating": 5.0, "text": "DJ Platinum was wonderful! He is a lot of fun, but still very professional. Our guests really enjoyed the variety of music he played and had a great time. The lighting looked great and he created our monogram for the dance floor. Two thumbs up!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "112214976698345966961", "name": "Dedric & Tonja Brown", "time": 1471908884250, "rating": 5.0, "text": "Dj Platinum did our wedding and he was the best...the lighting was every thing, the monogram was so beautiful, and the music was non stop and perfect. He is very professional and i would definitely recommend his services and use him again for another event!!!! Thanks for making our day rememberable!!!!!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "100746457071490072436", "name": "Jessica Whiteside", "time": 1471913836864, "rating": 5.0, "text": "Dj platinum was EXCELLENT, He kept the crowd dancing. The lighting was beautiful. I can't wait to book him for our next event. He made sure our wedding and reception was perfect.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "117934201291551973330", "name": "Courtney Harris", "time": 1572540131534, "rating": 5.0, "text": "Trevon Dj Too Kold was awesome! I would recommend his services to anyone! He made our wedding so much fun!! He also was the most affordable DJ I could find in the Birmingham area. I would 10/10 hire him again for his DJ services!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "102613210394200483698", "name": "Courtney Harris", "time": 1571687405252, "rating": 5.0, "text": "Words can’t express how great and excellent the service was. From the lightning, to the photo booth, dancing on the cloud and to the cold sparkler machines everything was outstanding! I would recommend them to anyone!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "115082803796772890675", "name": "LaToya Smith", "time": 1471970381915, "rating": 5.0, "text": "I worked with  DJ Platinum on my husband's birthday party. I highly recommend his services.  He was both professional and affordable.  DJ Platinum is equipped to handle any size event.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "100545746874245003561", "name": "Jessica Spence", "time": 1471890670144, "rating": 5.0, "text": "DJ Platinum did an amazing job at our wedding reception this past weekend. We received so many compliments about him from our family and friends. He definitely kept the party going! We would definitely recommend him to any future bride and grooms.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "109416864469229461793", "name": "Sheriah Gibson", "time": 1563904932324, "rating": 5.0, "text": "Great services! Andre and his team consistently provide our clients with the best products and quality around.\n\nThank you! - Posh Occasions by Sheriah, LLC.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "110901168465064379653", "name": "Crystal Duco", "time": 1524846103468, "rating": 5.0, "text": "The photo mirror was a huge hit at our wedding!  They were so nice and easy to work with!  One of the best decisions!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "107703260186863613755", "name": "Sametra Moore", "time": 1520631663057, "rating": 5.0, "text": "I would like to thank DJ Andre for providing an excellent service for my husband 50th surprise birthday party.  He kept my guest dancing the entire time. I highly recommend this DJ.\n\nThank you for your service.\n\nMrs. Moore", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "105949058196141856797", "name": "Shenita Counts", "time": 1527303841968, "rating": 5.0, "text": "I normally don’t write reviews but in this case I made an exception. In the words of my daughter, The DJ was “Lit”!! They were very professional and on time. The teenagers and I loved the music selections, the photo booth and all the up lighting. A+ service!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "100168393196667353272", "name": "Gabriele Watts", "time": 1517157251615, "rating": 5.0, "text": "Can’t rave about this company enough!!! They kept us on the dance floor all night. The lighting was spectacular and the videography was stunning when we saw the final product! Book them!!! You will not regret it!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "102859119436773104114", "name": "Devon Reid", "time": 1489272326994, "rating": 5.0, "text": "DJ platinum provided a variety of music for our wedding. It turned from a wedding, to a blast of a party! Lol", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "112956952818301526246", "name": "Megan Harris", "time": 1533235747058, "rating": 5.0, "text": "DJ Platinum went above and beyond for my wedding! I loved everything. I definitely will be using him again.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "116918423622048680461", "name": "Tederick Withers", "time": 1555446355108, "rating": 5.0, "text": "We really enjoyed everything and the staff was very nice and professional we appreciate everything and we'll be contacting again for our next event", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "114577347903861311162", "name": "Memendra Page", "time": 1514667595570, "rating": 5.0, "text": "Awesome service... He was superb..he is a one stop shop.. This is the company you want to book to make everything a sucees", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "108724413625585668858", "name": "Rodrigus Cannon", "time": 1506623834229, "rating": 5.0, "text": "I really like the his professionalism! All the music was clean and had great sound quality.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "118106607360427909912", "name": "Tee Williams", "time": 1472135049252, "rating": 5.0, "text": "He's great for whatever event you plan. DJ Platinum did a great job at the reception everyone enjoyed the music.", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "109763122864866866986", "name": "Curtia Moon", "time": 1491332921215, "rating": 5.0, "text": "DJ Platinum is ALWAYS my first choice for a wedding Dj referral to my couples.  He is prompt, has a great attention to detail, and keeps the party jumping.  He is a pleasure to work with.\n\nCurtia Moon\nMXK Events & Weddings", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "113617161010399176527", "name": "Nachica Thomas", "time": 1471905302355, "rating": 5.0, "text": "Best DJ around and the lighting system is AWESOME!!!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "102303802693490892612", "name": "Tory Moody", "time": 1474317505402, "rating": 5.0, "text": "Dj Platinum was there for us from the beginning to the big day on our wedding day! The area we were having our wedding at was pretty much a cell phone dead zone, but Dj Platinum thought that out and gave us a form list to send him with sections to write in what songs we wanted; once that got back to him he created the playlist and took care of the rest. He made everything simple and more important for me and my bride he made it affordable; definitely, definitely, would recommend him to anyone I know who has a wedding coming up or even a party and a needs a Dj who is professional and is kind on their wedding budget! For the package we asked for Do Platinum definitely exceeded our expectations; of course besides providing great music he provided lights to help provide the right atmosphere to our reception, and his travel fee was definitely kind on our wallet. When the wedding was over and we went to the reception hall and walk through the doors DJ platinum had a very great set up waiting for us; what stood out most to us was the fact that the lights he used lit up the walls and ceiling with me and my wife's favorite colors of red and purple, both us and the guess we're blown away! A great time was definitely had by all, and none of that would have been possible without the professional help of Do Platinum!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "113652179523908315793", "name": "Christopher Thornton Sr", "time": 1545239420986, "rating": 5.0, "text": "Andre and Kia were very responsive to our last second requests and odd requirements of our over 40 group Christmas Party (60 guests).", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "113544257508887224233", "name": "Lashonda Calloway", "time": 1531747106429, "rating": 5.0, "text": "Awesome, professional, everything for my wedding was beautiful!!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "112365238420445973108", "name": "Daren Turner", "time": 1570335312950, "rating": 5.0, "text": "Awesome service and music!", "pics": null, "resp": null, "gmap_id": "0x8889106de6b70cbb:0x61316f3dd30eb306"}
{"user_id": "114202600638391906208", "name": "Elena Kulpa", "time": 1624545266333, "rating": 5.0, "text": "Changing States and starting my career back up in Real Estate meant also changing my entire team, choosing the \"right\" photographer is vital in this industry.  I was referred at least 5 photographers and Joe was the first to answer my call.  His adaptability and getting your vision in the first shot is impressive!  Pixel Joe is \"TOP NOTCH\" and is why he is my ONLY choice for photographer in North Alabama. Like they say \" if it's not broke why fix it.\" Give him a call, you won't be disappointed.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "104131304197496737316", "name": "Steven Payne", "time": 1624461173930, "rating": 5.0, "text": "Fun and educational! Much appreciated!", "pics": null, "resp": {"time": 1624510833125, "text": "Thanks for coming Steve!"}, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "110220400279779925575", "name": "christina hall", "time": 1622943504536, "rating": 5.0, "text": "Absolutely the best place for any venue needs!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "103803003022946061253", "name": "Thomas Lawless", "time": 1603760874439, "rating": 5.0, "text": "This dude took exactly what I had in my head for my business and made it happen. I couldn’t be more happy with the quality and appearance of the photos I needed.\n\nAbsolutely phenomenal", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "104143428204887567216", "name": "Steven L Payne", "time": 1624510184769, "rating": 5.0, "text": "Super nice setup!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "109102795672237195901", "name": "KAavalon", "time": 1569680089254, "rating": 5.0, "text": "My husband and I hired Joe for our wedding 8/31 to do a highlight video. Joe was AMAZING!!! He assisted us through the whole process helping us select the moments we wanted to capture. He gave us a beautiful video while staying within our budget. He is professional and personable. We had our DJ drop out at the last minute and he assisted us with finding a new one, DJ Scott Blakely was AWESOME!  I highly recommend Joe and Scott and I would definitely hire them again!!! Thank you both so much for helping us make our wedding a party and helping create a beautiful keepsake!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "114884731954220746471", "name": "Kimberly Holmes", "time": 1518198801133, "rating": 5.0, "text": "Joe was Fantastic and easy to work with. Never once got frustrated with us and always had a smile. You can definitely tell Joe is passionate about his work. He did a Fabulous job with our whole team!! I would definitely recommend him.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "114854941382840784237", "name": "Nadine Wormsbacher", "time": 1532815473298, "rating": 5.0, "text": "Joe is a gifted photographer and videographer. He thinks  outside the typical box to create videos and images that are unique and memorable. He created a beautiful video of my horses and farm; he used his drone and the camera that lets him move with the horses and not jiggle. He’s very professional and easy to work with. Although I’d recommend him for anything image related, after seeing my video, I think he would be especially great for outdoor weddings or events.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "113882969702963035749", "name": "John Wood", "time": 1517184820924, "rating": 5.0, "text": "Joe took some headshots for myself and my staff that came out great! Joe had a lot of great tips for posing and took care to always get the best shots he could. Joe's studio was top notch as well as his professionalism and his abilities! Highly recommend!", "pics": null, "resp": {"time": 1517239829093, "text": "Thanks John I enjoyed it. You have an amazing staff and I know you guys will be an amazing all state branch! If anyone needs insurance call these guys!"}, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "107012675560021782345", "name": "Tye Watson", "time": 1505707424106, "rating": 5.0, "text": "Highly creative photos- he can add any theme to create a magical scene. His videos are above the top. Love his work. Would highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "106718618561893959853", "name": "ABC Cleaning and Restoration", "time": 1533649441699, "rating": 5.0, "text": "Joe is the doctor of photography.  He has an eye for the picture and knows the camera like nobody!  Whether it's a headshot, sports action shot or wedding I highly recommend using his vision!  He is also great at making movies so if you'd like to watch that game or wedding over and over he can make it happen!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "111515713004282244226", "name": "Katy Murphy", "time": 1532729877812, "rating": 5.0, "text": "Joe Bullock is an excellent photographer! From headshots to engagement photos to promotional videos, Joe's work is top notch. He is professional and gives 200% to everything he does 📸🎥", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "100096560547750047679", "name": "Brandon Saraceni", "time": 1503714516052, "rating": 5.0, "text": "Joe took some photographs via his drone for me on a roof inspection. He was on time and very professional. I will definitely hire him again. Thanks Joe.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "117225640691016339924", "name": "Lauren Schippers", "time": 1505675033074, "rating": 5.0, "text": "Joe is very professional and took some amazing photos for a friend of mines engagement announcements. They turned out beautiful!!!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "110793175651707402605", "name": "ERICA PRICE", "time": 1508082460020, "rating": 5.0, "text": "Pixel Joe's photography did a great job for us and I will definitely hire him again! Thanks so much pixel Joe!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "108934058374010077336", "name": "Rachel Harchanko", "time": 1532907622867, "rating": 5.0, "text": "Pixel Joe did my head shots for me. Joe was an absolute pleasure to deal with. I was so thrilled with the finished photos.", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "100468113882323669988", "name": "Kayla Bullock", "time": 1506294828302, "rating": 5.0, "text": "Joe did a great job with our family pictures and getting 3 wild boys to smile!", "pics": null, "resp": null, "gmap_id": "0x88623f5ac6644e45:0x2d7d8c31505a4dab"}
{"user_id": "103567148776770915463", "name": "F Hudson", "time": 1617721703205, "rating": 5.0, "text": "The place was nice, the owner was nice. I overall enjoyed the experience with my family, my kids had a blast going from. Exhibit to Exhibit. It was very clean. Once in because it was no one there I felt very comfortable taking off my mask to take pictures and putting it back on. They have hand sanitizing stations throughout the Exhibit. They also have a place to put your items while you take pictures in the middle of the room. I highly recommend. Also the location is very easy to find . They do not have bathrooms so you will have to use the restaurant located adjacent to it", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM57mhWssGTvJilOTn2mc9PG7nwLvBUnrLtiELn=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMiNwIWoJ83aXonmTx2hzJevSLMaBitJ7e60zyX=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOI-0Uz9fVgV_87YmSMjflCwL8aWxHq5-Qb496s=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNLJpNNWflrPmWJfdD6Ea4Aawy9rWeKeNusfdPK=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMCvErmCr3Xc7jcQG-3Jh5gRIu64OPulzZuwWXq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPjwUTwMw5are3hLtziKQcc9eKZIHkcjqB5TZQq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOsCbjj03enrMmOK1mWEoobjAFYZmKKxKS5Cu9F=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNWLEEOTbjoLYNJy9HFsdwRIJCiHZNyzXtwj3JY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN2qpXXZYmCBBq6WlvTfIHVnqU6feEASskzaWu-=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888913e14b3ddc11:0x7f7ce6ffd2cf888a"}
{"user_id": "108857360625577035903", "name": "S. Artina Ruff", "time": 1616802957765, "rating": 5.0, "text": "Our first time visiting today. Scheduled for 2pm & it was AMAZING!!! The owner was friendly & welcoming, also VERY insightful w/photo suggestions. There are 40 BEAUTIFUL & FUN scenes. Unfortunately we had to leave before we could get through them all... My daughter, her sweetie & I LOVED, LOVED, LOVED It!!! Will DEFINITELY be coming back! We had a GREAT time!", "pics": null, "resp": null, "gmap_id": "0x888913e14b3ddc11:0x7f7ce6ffd2cf888a"}
{"user_id": "112633098889360081124", "name": "Crystal Dunn", "time": 1624314716613, "rating": 5.0, "text": "The Pixel Room was AMAZING!!!!! Even with “life” happening abs I had to change our original dates, they made contact with me to ensure that we were still able to visit the Pixel Room. The experience was PHENOMENAL!!!! Thank you Rob for the impeccable service!!", "pics": null, "resp": null, "gmap_id": "0x888913e14b3ddc11:0x7f7ce6ffd2cf888a"}
{"user_id": "110211985843559501035", "name": "Traci Bell", "time": 1623360123567, "rating": 5.0, "text": "The staff was very friendly and the establishment was clean. It wasn’t my first time visiting and the new backgrounds were phenomenal. They even went beyond their duty to accommodate us with our conflicting schedule. Great place to go! We’ll be back.", "pics": null, "resp": null, "gmap_id": "0x888913e14b3ddc11:0x7f7ce6ffd2cf888a"}
{"user_id": "106511653386093639018", "name": "JustBeingDrè _", "time": 1603055528862, "rating": 5.0, "text": "I took my mom here for her birthday. She loves pictures and social media. So my aunt and I surprised her with a trip to Alabama’s first selfie museum. She didn’t even know it existed. She turned 47 years old and she has a blast. We made some of the best memories here. She looked amazing and the rooms added so much character and good vibes. We will definitely be back !", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO73FFoi-DsFc_Yk3RslQivuEl2N0a12kIYEvlN=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMovlGWJ21lvuhsnq2CTXtsRcIDFPpQg2wHwZPr=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOeATRSOJaPQ0b__xBxo9OFeyi2ktGj2K3qPw9l=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPtPsl6HLoDobT0NveAzCwxBEwARsgqNBFyYqGP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMkRB_iD2g-TJoG916ZBH0fNYMTOTE2HIpRZvfa=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOy2cdLjhmDNCKE5cG2aRNR9ZGxk2avZw2dlvZH=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipONM0BprsTT3b6a2klW8nLQZx769WbSiXygqQSL=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipODJ47_7BaqeaQ8dXOKqvNFo2qhCIK7ahqOxsou=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMFYgqHVYH3Q4r4yAdQbKYlsKzgPK9bo5vRoLG-=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPDykkXsWu1iSEEUrlHfWnH4M4JE2Y4uI0YtQv_=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888913e14b3ddc11:0x7f7ce6ffd2cf888a"}
{"user_id": "106662574608956907325", "name": "Keyunna Moody", "time": 1620944482397, "rating": 5.0, "text": "THE PIXEL ROOM IS THE ABSOLUTE BEST PLACE TO  COME AND HAVE ANY TYPE OF SHOOT! The owners were super nice. So many different scenes.Nadiyah and Robb were very helpful. Nadiyah was very hands on with helping with my shoot. I enjoyed every bit", "pics": null, "resp": null, "gmap_id": "0x888913e14b3ddc11:0x7f7ce6ffd2cf888a"}
{"user_id": "115142762350980235282", "name": "Jazmin Harris", "time": 1618155891297, "rating": 5.0, "text": "I loved going to The Pixel Room ! The employees were so nice and the establishment was amazing . I 100% recommend !!\n\nfollow me on IG  @justjazz.tho", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNXktD_eorHi-qifpjpDftj6xXkd3b_3NOAZAAt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMS38oTrNXMqvC-lz9iGm3Q6DHJamDFypzGZNQp=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO_-5TnNv81iqmCfnhrgV_Tq-heAEGlvPzpGW7u=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPwLC13EXePp3CGqMXaxrWKNKCu5Rd9z81Evjxb=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888913e14b3ddc11:0x7f7ce6ffd2cf888a"}
{"user_id": "112763539405788538061", "name": "Wendy Bell", "time": 1619840311687, "rating": 5.0, "text": "This is an awesome place to host a private event!  The owner/staff are super friendly and always helpful.  Can't wait to host another event.", "pics": null, "resp": null, "gmap_id": "0x888913e14b3ddc11:0x7f7ce6ffd2cf888a"}
{"user_id": "101605756378789374035", "name": "Diamonique Franklin", "time": 1620685921445, "rating": 5.0, "text": "My experience here at the Pixel was everything ! They have so many options and decisions on backdrops i just couldn’t help myself ! My niece was so happy to share her experience here and the manager Rob was so nice and cool!", "pics": null, "resp": null, "gmap_id": "0x888913e14b3ddc11:0x7f7ce6ffd2cf888a"}
{"user_id": "112202543921025486843", "name": "Yovette Jackson", "time": 1614451966581, "rating": 5.0, "text": "My son surprised me with a photo shoot for my 49th birthday.  The experience was excellent and exciting.  The room is full of beautiful scenery and each station gives you a creative and personal atmosphere. The staff took great care of us and was very helpful.   The Pixel Room is the best place for selfies in Birmingham Alabama.   Please visit as soon as possible for your rewarding photos.  You will not regret the experience.", "pics": null, "resp": null, "gmap_id": "0x888913e14b3ddc11:0x7f7ce6ffd2cf888a"}
{"user_id": "109921401430662144167", "name": "Play time with Adriana Russell", "time": 1615682325499, "rating": 5.0, "text": "AMAZING place to go if you love taking pictures. My best friend and I had a blast! Thank you so much!", "pics": null, "resp": null, "gmap_id": "0x888913e14b3ddc11:0x7f7ce6ffd2cf888a"}
{"user_id": "112973253314591639844", "name": "Jasmine Renee", "time": 1620946085253, "rating": 5.0, "text": "This place is literally my dream come true. The staff is AMAZINGLY friendly and professional and will help you in anyway you need. If you are a photographer Pixel Room is the place for you.", "pics": null, "resp": null, "gmap_id": "0x888913e14b3ddc11:0x7f7ce6ffd2cf888a"}
{"user_id": "103572314008194919793", "name": "Jasmine Moseley", "time": 1620686277317, "rating": 5.0, "text": "Came here for my daughter's 16th birthday photoshoot...planning this process was amazing...I called on Friday and spoke with Rob the manager who was ABSOLUTELY THE BEST...He was super friendly and made planning a BREEZE. The experience was out of this world...my first time at a selfie museum and I don't think I could have chosen a better place for my daughters photoshoot...there were soooooo many rooms to pick from which made the photoshoot that much more AMAZING!!!! If you are in B'ham please please please stop by and tell Rob Jasmine sent you!!!!", "pics": null, "resp": null, "gmap_id": "0x888913e14b3ddc11:0x7f7ce6ffd2cf888a"}
{"user_id": "116520272300959352980", "name": "B Min", "time": 1614570936832, "rating": 5.0, "text": "Valentines Day my husband, daughter, and myself made a drive from Huntsville to The Pixel Room. We had fun, took lots of pics, many different backgrounds and themes. Well worth the price and drive. We wil definitely be going back.", "pics": null, "resp": null, "gmap_id": "0x888913e14b3ddc11:0x7f7ce6ffd2cf888a"}
{"user_id": "105033112931595609813", "name": "Jaidyn Hall", "time": 1615061732441, "rating": 5.0, "text": "Very nice place to come for birthday I turn 15 today and my mom brought me and I had a amazing time", "pics": null, "resp": null, "gmap_id": "0x888913e14b3ddc11:0x7f7ce6ffd2cf888a"}
{"user_id": "117129430242723846269", "name": "Julius Whitehead", "time": 1609632094893, "rating": 5.0, "text": "Awesome experience! Me and my wife had a blast. Many different looks. Great for date night.", "pics": null, "resp": null, "gmap_id": "0x888913e14b3ddc11:0x7f7ce6ffd2cf888a"}
{"user_id": "111113844198160296740", "name": "Denise Gray-Dupree", "time": 1614472165992, "rating": 5.0, "text": "Rob was awesome! Great time. Covid-safe. Clean. Fun.", "pics": null, "resp": null, "gmap_id": "0x888913e14b3ddc11:0x7f7ce6ffd2cf888a"}
{"user_id": "110776424733207179387", "name": "Alabama Crappie Adventures", "time": 1606086307909, "rating": 5.0, "text": "I took my daughter here Saturday, NOV. 21, 2020, and Rob was so super friendly and he even stepped in for free to take a few snap shots for her! Her first experience here and she has a blast for her sweet sixteen! Thanks, Rob!", "pics": null, "resp": null, "gmap_id": "0x888913e14b3ddc11:0x7f7ce6ffd2cf888a"}
{"user_id": "111679383961487173181", "name": "Kim Gerlach", "time": 1623951097221, "rating": 5.0, "text": "Best place in town hands down!", "pics": null, "resp": null, "gmap_id": "0x888913e14b3ddc11:0x7f7ce6ffd2cf888a"}
{"user_id": "110036582509238337024", "name": "Tyshawn Giles", "time": 1618728191111, "rating": 5.0, "text": "Fun and unique place. Loved it.", "pics": null, "resp": null, "gmap_id": "0x888913e14b3ddc11:0x7f7ce6ffd2cf888a"}
{"user_id": "103324292140309082110", "name": "Ara'Dal Leigh", "time": 1604686320105, "rating": 5.0, "text": "Had a blast!  Great atmosphere,  great customer service,  great time!  I'll definitely be returning soon!", "pics": null, "resp": null, "gmap_id": "0x888913e14b3ddc11:0x7f7ce6ffd2cf888a"}
{"user_id": "109961841018742124749", "name": "Jordyn Skinner", "time": 1615148005536, "rating": 5.0, "text": "Came for birthday selfie’s not disappointed!", "pics": null, "resp": null, "gmap_id": "0x888913e14b3ddc11:0x7f7ce6ffd2cf888a"}
{"user_id": "105468593799894995709", "name": "LAKRESHA DAVIS", "time": 1615146969495, "rating": 5.0, "text": "Extremely awesome place for anyone that’s photogenic", "pics": null, "resp": null, "gmap_id": "0x888913e14b3ddc11:0x7f7ce6ffd2cf888a"}
{"user_id": "111495987729334264072", "name": "Janelle Dunn", "time": 1624163526055, "rating": 5.0, "text": "Awesome place for awesome shots !!!!", "pics": null, "resp": null, "gmap_id": "0x888913e14b3ddc11:0x7f7ce6ffd2cf888a"}
