{"user_id": "109298565385829908994", "name": "Brittney Malone", "time": 1588388544141, "rating": 5.0, "text": "Working with Nick and his team is always an amazing experience! Nick has created amazing promo videos for my business and also captured many special moments for my family! I never have to worry what the end result will be because he always takes my crazy ideas and turns them into the perfect work of art! You will not be disappointed choosing Nick Frontiero Productions to capture all the specials moments!", "pics": null, "resp": {"time": 1589486084547, "text": "We have loved getting to be there for your business journey and through your family growing! You are family! We love you and are so thankful for you!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "101433340818095207307", "name": "Danielle Vannoy", "time": 1497495001647, "rating": 5.0, "text": "Nick Frontiero is an extremely talented photographer and it truly shows when he is in the zone searching for the perfect light and angle so that he can capture special moments. He and his wonderful team, Jenna, Susan, and Shannon, made our wedding day fun and turned what could be monotonous photos into an artistic and enjoyable experience. They were extremely professional and friendly and could make even the most camera shy person feel comfortable. We appreciate their hard work and dedication and could not imagine having anyone else shoot our special day! Our pictures turned out so amazing! Nick takes time to meticulously pick the best photos from your special day and edit them to perfection. If you want a way to preserve your wedding day so that you can share it with your family and friends for years to come, then he's your guy. My husband and I opted to not get a videographer, and after getting our photos back from Nick, I know that we didn't make a mistake in doing so because he made sure to capture everything! NFP is the bomb!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNIoAOi4BiFwtwCk93jHJB-v_VodVr4Ti6ZMDVC=w150-h150-k-no-p"]}], "resp": {"time": 1590691090404, "text": "Thank you so much Danielle!!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "106407239975206507935", "name": "Christopher Stitcher", "time": 1607187070375, "rating": 5.0, "text": "Best photographer in the river region and beyond! Great team and always a fantastic product!", "pics": null, "resp": {"time": 1607359013553, "text": "Thanks so much Chris 🙏 It was great getting to see you and the family this past Saturday! Can’t wait to share your portraits with Santa!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "116709788052479615166", "name": "Lauren Williams", "time": 1588384252140, "rating": 5.0, "text": "Nick and Kayla were so wonderful to work with! They were SO patient with my 2week old for newborn pictures and our family portrays as well! Nick has such a creative eye and has such a talent for capturing the most special moments.", "pics": null, "resp": {"time": 1589486011920, "text": "We are so thankful we got to work with you and your sweet family! Thank you so much Lauren!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "109787875678780773216", "name": "Sarah Bryan", "time": 1497548634989, "rating": 5.0, "text": "Nick Frontiero is such a wonderful photographer truly devoted to his passion for art. He brought to life every aspect of our wedding day and then some. I could not have asked for better quality photos. I am still in awe that he captured some of the most personal and sacred moments of the day in such a wonderful light. We will cherish these photos forever. What I loved most about Nick's photos are the \"in the moment\" pictures that he captures. Looking back through our photos, we were able to completely relive the day and look at moments we did not see on our wedding day. We received so many photos I had no idea were taken and we are so thankful to have them. He is incredibly professional and has many options for packages. I was pleased with his work from beginning to end as he went above and beyond. I highly encourage any bride to book Nick ASAP! You will not regret it! I truly do not have enough words to describe how grateful I am for Nick Frontiero Productions. Absolutely amazing!", "pics": null, "resp": {"time": 1590691360466, "text": "It was such a pleasure! Thanks so much for having me capture that special moment in your life!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "115071144720415604565", "name": "Lyndsey J.", "time": 1499135436967, "rating": 5.0, "text": "It's difficult to put into words what an incredible experience we had with Nick and his team throughout our wedding journey. From our first meeting up to our wedding day, Nick was more than we could have asked for in a photographer. Having beautiful images that not only captured our special day but would be forever keepsakes was incredibly important and a big factor in why we selected Nick Frontiero Photography. Nick and his team captured the fine arts style I had been dreaming of while still incorporating those classic, traditional shots. Their amazing skill set is displayed in all of our wedding day images. We were blown away by the attention to detail, creativity, and the little mementos included from our special day. Not to mention, Nick's use of film along with digital really gave the unique styling we had been looking for in a photographer.\n\nA big THANK YOU to Nick, Jenna, and Shannon for helping make our wedding day truly magical and something we will remember for a lifetime.", "pics": null, "resp": {"time": 1590690609374, "text": "We are so grateful you chose us to capture such a special time in your life! It truly means the world to us."}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "116166918661193739883", "name": "Lance Mauldin", "time": 1499807614831, "rating": 5.0, "text": "Nick and his staff were incredible to work with to capture all the images for our special day.  My wife and I were blown away by the quality of the pictures and Nick's unique ability to capture special moments that we will treasure for a lifetime.  I would highly recommend Nick to anyone looking for someone that will work with you, help put you at ease, and capture the most brilliant images you could imagine.  We appreciate everything Nick did for us, and will be using him in the future for any other photography needs.", "pics": null, "resp": {"time": 1590690562944, "text": "So glad I could be part of your special day! It truly means the world to me to capture such special moments for your family!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "104521342252243684277", "name": "Stephanie Sims", "time": 1497531391862, "rating": 5.0, "text": "Leading up to my wedding I searched & searched for photographers. I wanted one that would think outside the box & be able to capture the most memorable moments on my special day, however I found SO MUCH MORE with Nick! He was professional, a ton of fun to work with & he need little to no direction. He created a vision for me took the lead and my now husband & I followed. Our engagement & wedding photos are beyond amazing to say the least! I remember the day I received my wedding album, I cried as I turned detailed page after page.\n\nI was completely blown away at how he took that one day & transformed it into a piece of art!!! I appreciated how hard he & his team members worked on the day of the wedding. When you hire someone to do a job & after they have completed the job you find it hard to put in words how satisfied & pleased you are with that individual, that's when you know you made the right decision!!!!", "pics": null, "resp": {"time": 1590691392319, "text": "I'm so glad you loved it so much! I appreciate you so much!!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "109645526839109944854", "name": "Keeper58 Bibb", "time": 1498336287616, "rating": 5.0, "text": "Nick is absolutely amazing. He is very creative and always get the best shots. Him and his staff captured the best moments in our wedding. I look forward to working with him on other projects. By the way, our engagement photos were amazing and we are still getting compliments on them.", "pics": null, "resp": {"time": 1590691220786, "text": "Thanks so much!!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "114062734109470476802", "name": "Courtland Bibb", "time": 1604419116592, "rating": 5.0, "text": "The staff is helpful and great", "pics": null, "resp": {"time": 1605895121621, "text": "Thanks so much Courtl Bi for the review! Serving people with the highest excellence is definitely our aim! So glad you had a great experience!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "107945904108671241724", "name": "Skyler Shirley", "time": 1497535775139, "rating": 5.0, "text": "Nick is an awesome photographer! He was my photographer for my wedding and it was the best decision I made. He takes time to learn exactly what it is you want and goes above and beyond to meet those expectations. I recommend him to anyone who ask me about a photographer for any occasion. He is the best!!", "pics": null, "resp": {"time": 1590702302369, "text": "It was truly an incredible day! I was honored you chose me to capture that special moment in your life!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "111890651726256002920", "name": "Casey Stephenson", "time": 1497497770093, "rating": 5.0, "text": "Nick is the absolute BEST in his field! He becomes personally involved in your session and is sure to capture your individuality. Nick will always be my photographer, and I can promise you won't regret using him to capture your special occasions !", "pics": null, "resp": {"time": 1590691075864, "text": "Thanks so much Casey!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "113876076560476358105", "name": "Chantal Hopkins", "time": 1497562357092, "rating": 5.0, "text": "Our experience working with Nick was beyond OUTSTANDING!  Nick is very professional and personable.  He made our engagement session so much fun!!  He also captured every single moment our of wedding day and the quality of our photos are the absolute best.", "pics": null, "resp": {"time": 1590691321424, "text": "Thanks so much!!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "112955100617682591642", "name": "Jillian Ziemanski", "time": 1497620968651, "rating": 5.0, "text": "Nick and his team were perfectly professional while still maintaining a relaxed atmosphere. They captured every moment of our wedding day flawlessly! Our photos tell a beautiful story, and we're so thankful that we chose Nick as our photographer!", "pics": null, "resp": {"time": 1590691242311, "text": "Thanks so much Jillian! It was a pleasure!!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "116403716739192401006", "name": "Chase Watford", "time": 1497531959584, "rating": 5.0, "text": "There are absolutely not enough words to describe how thankful I am to have chosen Nick Frontiero Productions and his team to capture our day. I had a friend who used Nick and knew immediately i wanted to use him for our wedding day. Not only are his pictures absolutely gorgeous , but he goes above and beyond to give his brides exactly what they ask for. We did not know eachother before the wedding process, but now Nick and his wife Jackie are some of my most cherished friends. Nick brings a full team to shoot on the wedding day and i seriously felt like a celebrity with an entourage. There is not one moment of our day that they did not capture. I am forever grateful for this guy and his insanely cool photography skills. You will NOT regret booking Nick Frontiero Productions for your event. I can't wait to use him again for maternity and family photos one day!\nMuch Love,\nLindsey Watford", "pics": null, "resp": {"time": 1590691414566, "text": "It was such a pleasure! Thanks so much!!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "116968254954101198083", "name": "Lauren Hoepfner", "time": 1503093568128, "rating": 5.0, "text": "I cannot say enough good things about Nick and his team! Nick helped us to design a wedding package that worked the best for us and fit our budget. We wanted to do a lot of our pictures before the ceremony, and Nick worked with us to get everything figured out. He put together a detailed timeline for the wedding day, so we knew exactly who needed to be where and when. He and his team were so incredible to work with and captured absolutely amazing pictures of our entire wedding day. Nick also has 2 Polaroid cameras and took polaroids throughout the day. At the end of the night, he presented us with a beautiful wooden box with our names on it, full of all of the polaroids he had taken that day!! It was such an awesome surprise to have at the end of the night, and we loved getting to see a sneak peek of our wedding pictures. When our final photos came, they were PERFECT!! Thanks Nick and team for being the best and helping make our wedding day so much fun!! Y'all are the best!!", "pics": null, "resp": {"time": 1590690499843, "text": "We are so glad to be part of your special day!! We are so grateful!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "108447198262550732644", "name": "Elizabeth Wells", "time": 1497542527695, "rating": 5.0, "text": "Nick and his team were great to work with through the planning process and the day of our wedding. He took beautiful photos of the wedding and we'd definitely recommend him to a couple looking for a photographer.", "pics": null, "resp": {"time": 1590702242449, "text": "It was an honor you chose me to capture your special day! Thanks so much!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "118360194249319202501", "name": "Natalie Rowell", "time": 1497498547843, "rating": 5.0, "text": "Nick is an amazing photographer and is just as awesome of a person! Very professional and fun! He makes the experience very comfortable and produces amazing images! He will not disappoint!", "pics": null, "resp": {"time": 1590691102608, "text": "Thanks so much Natalie!!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "109753910865605205735", "name": "Meredith Moseley", "time": 1497527011479, "rating": 5.0, "text": "Nick did our Senior Portraits and we were and still are in love with our images, Nick was very easy to work with, very affordable and FUN! I can't wait to have my grandson's growth captured!", "pics": null, "resp": {"time": 1590691117347, "text": "So glad we got to capture those memories!!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "107856030216026223930", "name": "Haley Daniel", "time": 1497964717408, "rating": 5.0, "text": "He did AMAZING on our engagement pictures, wedding pictures, and wedding album!!!!! We love him!!! So glad we used Nick to capture moments that we will have forever :)", "pics": null, "resp": {"time": 1590690690490, "text": "Hey Haley! It was such an honor getting to share such special moments with you!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "104487008235926237871", "name": "Jenna Garrett", "time": 1497803506600, "rating": 5.0, "text": "From the moment NFP started popping up, I've admired Nick's photography style - so booking him for my wedding was already a given! I've seen Nick in action, and final products, but I was speechless when I finally got into our gallery! He captured so much emotion and happiness authentically, with each image providing an excellent reminder of each individual moments of our day. One of my favorite parts of the day was getting a box of polaroids at the end of the night - along with the film shots later. He can take any space/venue and make it look elegant - even our small backyard ceremony! You can choose a photographer who's style you like, or choose a photographer who's style constantly evolves and adapts with each individual wedding. All the weddings Nick has photographed look amazing, but I don't think you fully appreciate the talent until you see yourself captured by it. He's laid-back, focused, and actually a pretty stealthy photographer. NFP is an investment worth making if you want beautiful memories captured to last a lifetime!", "pics": null, "resp": {"time": 1590690765069, "text": "Hey Jenna! It was truly an honor getting to capture your beautiful day! You've become family! and we love you!"}, "gmap_id": "0x888e8e3d27b1240d:0x65f646ea33eb77d9"}
{"user_id": "103217788467077880933", "name": "Bill Armistead", "time": 1604716468891, "rating": 5.0, "text": "Image Hive did an outstanding job of transferring over 100 super eight videos onto a thumb drive with outstanding quality. And, they are right here in Birmingham. So there is no need to box up your videos and ship them off to another state to have them transferred. I could not be more pleased!  I highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "110914903018948010338", "name": "Theodore Campbell", "time": 1614076726838, "rating": 5.0, "text": "Great quality in and out I no time fast service will use again", "pics": null, "resp": {"time": 1614135354397, "text": "Thank you, glad we could help."}, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "107947153725319859167", "name": "D. Seibert", "time": 1579375895579, "rating": 5.0, "text": "The staff at Image Hive are incredible to work with!  So far, they have done script prep, teleprompter, studio shooting and final editing of over 30 of my online course videos and are now working on a new course with me.  I just love working with Steven, Dimi, Kat and the others there, that are most professional and caring about me and my projects.  They go overboard and I would strongly recommend them if you have a video project.", "pics": null, "resp": {"time": 1579544761841, "text": "Dear Don, thank you so much for your kind words. You are a great client to work with too. We hope your goal for many more people quit smoking be very successful."}, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "104356530368415532220", "name": "Barbara Franklin", "time": 1558556091270, "rating": 5.0, "text": "I prepared a video history for my organization and had Image Hive to reproduce it for me.  Kat was so helpful.  She converted the format, added chapters, assisted me with the cover graphics and produced my requested copies very quickly.  She provided superb service and helped us provide an amateur video that looked professional.  Everyone was pleased.  She was great and very professional.  Thanks, Kat.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "112946115069474444206", "name": "CLIFF STROUT", "time": 1559082988847, "rating": 5.0, "text": "When my mother in law passed away, I took her old 8mm Home movies to these people. They went above and beyond cleaning the dust, adding shots of film titles in her handwriting. They made a wonderful movie for us as a family keepsake. Everyone loved it.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "115173656244661117081", "name": "Jacob delaRosa", "time": 1547494097918, "rating": 5.0, "text": "Image Hive is my go-to choice for studio rental when I need an indoor location for my clients. They offer all the lighting equipment and backdrops you could ask for. Their enormous cyc wall is just amazing! You can comfortably shoot anything from products, large groups of people and even vehicles in their space. They also offer film scanning services for old home movies on VHS and super 8 film. Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "114437570016322460272", "name": "Jeff Nelson", "time": 1558466826083, "rating": 5.0, "text": "We had several old 8mm movie reels that we needed transferred to digital and DVD formats.  The results were great and we were very happy.  I would recommend your services to anyone with a similar need.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "101039468108346282478", "name": "Micah Wade", "time": 1547315488676, "rating": 5.0, "text": "The folks at Image Hive have been helping me secure my family’s memories for over three years now. Steven, Mark, and their staff are professional and helpful. As a mom, I was so stressed out about saving videos of my children, since I didn’t have the time or skills to do it on my own. Someone referred me to Image Hive and I’ve been so relieved ever since. They also run regular specials! 5 STARS, Image Hive!", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "113249054387056761263", "name": "Hilda Johnson", "time": 1558613663049, "rating": 5.0, "text": "Great job on my videos and great people to work with. Very quick return getting my videos back. Very pleased and anxious to have more done.\nHilda Johnson", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "109268273710875462007", "name": "Lee Winnige", "time": 1558462254581, "rating": 5.0, "text": "These guys did a great job of scanning my old family photos. Great service and friendly staff. I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "111309645251360108410", "name": "Richard Schlinkert", "time": 1578065424867, "rating": 2.0, "text": "I took in about thirty 35mm slides to transfer to digital, and while they turned the order around quickly, the slides had dust and lint in them and were very low resolution for the cost, which is about twice what the mail-in services charge for twice the resolution.  Unless you are in a hurry, look elsewhere", "pics": null, "resp": {"time": 1578078597457, "text": "Thank you for sharing your experience with us.  We're sorry that the final results of your scanning order did not meet your expectations.  We pride ourselves on giving each order personal attention and all of the work we do is done in our Birmingham location (in the historic Avondale neighborhood).\nWe recall your order very clearly.  You chose our PROOF quality (700 ppi) for your slide scanning order, which our lowest resolution (and lowest priced).  We also offer ARCHIVE quality scans (1700 ppi) at a slighlty higher cost.  Our scanning service, whether Proof or Archive level, includes the utilization of dust removal software, which can remove superficial debris and blemishes on the scanned images.\nOur technician specifically noted the high concentration of dust on your slides before scanning your slides.  Prior to scanning your order, our tech  attempted to manually clean each of your slides by hand to remove the dust and lint you described.  Unfortunately, dust and lint are often stuck to the film itself and may not be removed except by rewashing or physically wiping the film with a chemical solution.\nWe are generally unwilling to do such aggressive cleaning, out of fear we might damage our clients irreplaceable originals.  More often, if the condition of the originals is so bad that our usual cleaning and post-production are insufficient, we can do restorastion to the scanned images.  This digital retouching is not inexpensive, but for extremely valuable or badly deteriorated images, it is often the best option.\nAgain, we're sorry to hear you were not completely satisfied with our service.  We would welcome the opportunity to regain your confidence."}, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "103333855802638099393", "name": "Floyde Young", "time": 1607305734144, "rating": 5.0, "text": "Nice spot for photography", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "117818375670235475378", "name": "Dave Loftin", "time": 1558476871063, "rating": 5.0, "text": "Image Hive did a great job transferring some old video tapes for me. Awesome folks to deal with.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "110791981266546984577", "name": "Lisa Wienhold", "time": 1546988468648, "rating": 5.0, "text": "Hive did a great job with a bunch of old family photos.  I was very pleased.   Fast great service !", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "109031672118015331782", "name": "Robin Anderson", "time": 1572474512907, "rating": 5.0, "text": "Very helpful staff, she did a great job, this is a good place!", "pics": null, "resp": {"time": 1572478428230, "text": "Thank you! Cat is wonderful, glad to hear from happy customers!"}, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "111820436179064136417", "name": "tania mendoza", "time": 1476826841000, "rating": 5.0, "text": "I rented the photography studio at Image Hive recently to see if I could get a professional-looking profile pic for my CV, having a friend to take the picture instead of hiring a professional photographer. It turned out way better than I'd imagined. I'm so glad we did it ourselves! The place has a very creative vibe about it and the people there were very encouraging and helpful, without being intrusive. I also discovered that they convert all kinds of old media, like vhs tapes, film reels, and slides to digital. So, I'll be making a return trip after I go through my closets!", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "103003612105934390320", "name": "Linda Bryant", "time": 1533832827361, "rating": 5.0, "text": "Great studio rental price. The people at Image Hive are experanced and helpful. Overall perfect shoot.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "107842547183007232002", "name": "Tyler Kemp", "time": 1533753591342, "rating": 5.0, "text": "Great and experanced staff. Great studio for everything I needed. They also do film and tape transfers!", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "107842547183007232002", "name": "Tyler Kemp", "time": 1533753591342, "rating": 5.0, "text": "Great and experanced staff. Great studio for everything I needed. They also do film and tape transfers!", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "117513114308618465022", "name": "Jennifer Ralph", "time": 1546893925000, "rating": 5.0, "text": "Image Hive converted some of my old VHS tapes to DVD's and computer files, and I was very pleased with the service and results!", "pics": null, "resp": {"time": 1546896244992, "text": "Great, thank you so much for great review! We are so happy we were able to help!"}, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "107479741111646750395", "name": "Lee Walthall", "time": 1558562213953, "rating": 5.0, "text": "Image Hive has helped me convert old video recordings to digital files and duplicate CDs on several occasions and I was extremely pleased with their timely high quality service and reasonable price", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "101134386956469162515", "name": "elizabeth cypher", "time": 1559081570094, "rating": 5.0, "text": "Staff very knowledgeable and efficient. Prompt and just what I needed!", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "107237744589396884880", "name": "Collin Balentine", "time": 1533740724101, "rating": 5.0, "text": "Had a great studio perfect for shooting photography and video.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "114529658832792709921", "name": "Dima Ant", "time": 1464723079142, "rating": 5.0, "text": "Service is great and fast. Everything was done to my specifications. Great people in general.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "108459037081760182904", "name": "Cameron Balentine", "time": 1533143191604, "rating": 5.0, "text": "Can restore and duplicate and enlarge old photos..check them out! Great poster size made at a great price!", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "111647182964218600487", "name": "Mike Bryant", "time": 1533753306192, "rating": 5.0, "text": "Had a great set-up and knowledgeable staff. Also flexiable with time.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "101888309380030128580", "name": "Norman Virciglio", "time": 1491255009466, "rating": 5.0, "text": "Great Job on transferring 50 year old 8mm to digital.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
