{"user_id": "116470748235167188782", "name": "Tim Cross", "time": 1620778568988, "rating": 5.0, "text": "I have had so many Alabama sports memorabilia photos and jerseys framed. This is the best place in town when it comes to quality of work, integrity, as well as customer service.", "pics": null, "resp": null, "gmap_id": "0x8889226b301270d3:0x5adb5e407b341ea5"}
{"user_id": "117495428314122046847", "name": "Maxwell Barnhart", "time": 1578692522651, "rating": 5.0, "text": "Great service! My mom needed a mat cut for a picture frame, and due to the mat being too thin, the machine cut it wrong. So he replaced it with one of his own for free. The whole thing only took a few minutes too. Definitely go here if you live in the hoover area.", "pics": null, "resp": null, "gmap_id": "0x8889226b301270d3:0x5adb5e407b341ea5"}
{"user_id": "106725294931503752948", "name": "Brian Poythress", "time": 1565914809778, "rating": 5.0, "text": "Michael is an absolute joy to work with, knows his craft in and out, and goes out of his way to educate his customers and meet their needs.\nI took a very important document in for framing. He examined and discussed options with me for at least twenty minutes, and asked several questions about what I planned to hang it with, what styles I preferred, and questions I did not think to ask such as how much daily sun exposure to expect, what kind of lighting I would place it in, etc. As a first-timer in a framing shop, I expected to be overwhelmed, but he made the process painless as he outlined his recommendations and, very importantly to me, did not pressure and shove his more expensive options at me. The decision was about the right fit for my document and me, not his bottom line. He completed my framing job in two weeks, and the quality is top-notch. Michael can count on my business, as he should yours.", "pics": null, "resp": null, "gmap_id": "0x8889226b301270d3:0x5adb5e407b341ea5"}
{"user_id": "115837005970201586380", "name": "agnita mboya", "time": 1576950310866, "rating": 5.0, "text": "Michael is an awesome guy and do amazing work! Will definitely use him again in the future!", "pics": null, "resp": null, "gmap_id": "0x8889226b301270d3:0x5adb5e407b341ea5"}
{"user_id": "110151191000767176066", "name": "Dylan Saulsbury", "time": 1523981049924, "rating": 5.0, "text": "This store is excellent. Michael is extremely helpful and his work is of the the best quality. I would recommend this place to anyone looking for top notch craftsmanship", "pics": null, "resp": null, "gmap_id": "0x8889226b301270d3:0x5adb5e407b341ea5"}
{"user_id": "115656144361507885937", "name": "Rhiannon Holt", "time": 1551654168866, "rating": 5.0, "text": "Great place to get something special framed. He helped us pick out an awesome frame to match our huge canvas painting and we were amazed at how affordable it was. Cheaper than what Michaels quoted us for just a canvas stretcher without a frame... Definitely taking everything I need framed to him.\n\nUpdate: we have now gotten a total of 6 things framed here and they have all been amazing! Michael is very creative and always helps us pick a great frame. Love this place!", "pics": null, "resp": null, "gmap_id": "0x8889226b301270d3:0x5adb5e407b341ea5"}
{"user_id": "108272972440152716240", "name": "Renee Marlow", "time": 1442969446172, "rating": 5.0, "text": "Great Place. I was shown a lot of patience and friendliness as I hemmed and hawed forever trying to find a frame, and was met with friendly conversation the first visit, and the pick up visit. My painting looks wonderful and I am so thrilled with it, and all the helpful advice. I would not go anywhere else.", "pics": null, "resp": null, "gmap_id": "0x8889226b301270d3:0x5adb5e407b341ea5"}
{"user_id": "116540422151255127992", "name": "Scott Albano", "time": 1576868418589, "rating": 5.0, "text": "I can't say enough about the quality of the work Michael Mixon does!", "pics": null, "resp": null, "gmap_id": "0x8889226b301270d3:0x5adb5e407b341ea5"}
