{"user_id": "100521604714486055112", "name": "Wes Duncan", "time": 1624482934852, "rating": 5.0, "text": "I have been seeing Dr. Mann for a year now dealing with sciatic and lower back pain. I have had tons of relief since beginning my appointments. I would recommend his office to anyone. The new locations is super nice and i’m always greeted by his friendly staff. 10/10. If you’re looking for relief and long term results then this needs to be you’re go to.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOB1kVjrM964HgN1w3aG4DwL0kkZ2gRu_ZgSrzN=w150-h150-k-no-p"]}], "resp": {"time": 1625103875311, "text": "Thanks Wes for leaving us a review! We look forward to seeing you again! Have a great day!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "111726034402674150390", "name": "Caroline Mauldin", "time": 1624678750287, "rating": 5.0, "text": "I have always had a bad back. Since college I always wanted to go to a chiropractor. After hearing multiple positive experiences from my friends I booked a appointment. It was AMAZING. I’m am not the one to post at all. But they do an AMAZING job. Through the whole process I felt cared for as an individual and left feeling better then I have felt in a long time", "pics": null, "resp": {"time": 1625103918367, "text": "Thank you Caroline! We appreciate the review! Hope to see you soon!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "104683221537422109591", "name": "tammy jolley", "time": 1623794671767, "rating": 5.0, "text": "They got me in same day when I was in immense pain and the staff is so nice!! Dr. Mann has given me exercises that have decreased my need for frequent appointments.   I feel they care more about my long-term well-being than about making more money with appointments.   I would def recommend", "pics": null, "resp": {"time": 1624065572663, "text": "Thank you for taking the time to leave us this review! We are so glad we are able to help you! Keep up the good work on the exercises!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "115551557421393388318", "name": "Mckayla Sharp", "time": 1602710590419, "rating": 5.0, "text": "The front desk is so nice here!  I had no idea what to expect but Kelsey was super helpful!   I was treated by Dr. Mann.  He was very professional and attentive.  The whole visit went fairly quickly but still felt very thorough and Dr. Mann was able to answer all of my questions.  My back ache is already feeling much better and I am very pleased with my first experience with chiropractic treatment!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM3CNDmWUJnaJk_8QQcrzfUjSfmYlW9_cr1ISt7=w150-h150-k-no-p"]}], "resp": {"time": 1602861850443, "text": "Thank you for leaving us this review Mckayla!  We are glad you have had a good experience at Advanced Chiropractic.  We strive to make everyone's appointments as enjoyable as possible! We look forward to seeing you again!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "114977661011082901141", "name": "Billy Elliot", "time": 1618345716999, "rating": 5.0, "text": "Top notch people here. Polite, timely and helpful.  Office is impressive. I’m one of those engineer types and they tolerate me well.  They even check my blue cross blue shield federal benefits before me ahead of time. For my $30 copay I got X-rays and everything.   Thanks again", "pics": null, "resp": {"time": 1618352589001, "text": "Thank you for leaving us a review Mr. Elliot!  We will see you next time! Have a great day!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "110095278176735997012", "name": "Rusher Clemons", "time": 1616610536337, "rating": 5.0, "text": "My experience went amazingly well. The staff was so friendly and Dr. Mann really knew his stuff! I love the environment of his office. I will definitely be going regularly! I have also told all of my friends and family about how great this place is.", "pics": null, "resp": {"time": 1616619125023, "text": "Thanks for leaving us this 5 star review Rusher! We look forward to seeing you again!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "102633687440719480025", "name": "Russell Ormstedt", "time": 1608157730871, "rating": 5.0, "text": "Advanced Chiropractic is a professional and uplifting environment. The staff is friendly and easy to work including setting up appointments. My doctor who treats me is Dr. Mann who is knowledgeable in his field and the only chiropractor I trust and you should too!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNv3NoY9YriRUtspVo_CMwPXGzIgRz1wsDupvJ4=w150-h150-k-no-p"]}], "resp": {"time": 1608652398410, "text": "Thank for leaving us this review!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "112990043943082603787", "name": "David Tutwiler", "time": 1625696321524, "rating": 5.0, "text": "In my third week. Has been a huge help to my back and neck. Would recommend to anyone", "pics": null, "resp": {"time": 1626111665020, "text": "Thank you for the review Mr. Tutwiler!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "112578843834697353728", "name": "Sky Jones", "time": 1612547179495, "rating": 5.0, "text": "I love the atmosphere. Great and friendly staff . Your treated with care from the second you walk in the door . Dr. man and his staff are the best in Decatur al", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPO9dBN0rS2TcR5585ec64S2UjgDB4tI_mgnoDq=w150-h150-k-no-p"]}], "resp": {"time": 1613415050134, "text": "Thanks for the review Mr. Jones! Have a good one!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "101731615698576798446", "name": "Drew Gay", "time": 1616614321677, "rating": 5.0, "text": "I had a great experience with Dr. Mann. He really knows what he is doing and I will definitely be back. His staff is also pretty amazing. I promise you won’t be disappointed when you give him a visit.", "pics": null, "resp": {"time": 1616619282212, "text": "Thanks for leaving us this 5 star review Drew! We hope you have a great day!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "101010071312759949898", "name": "Brad Herring", "time": 1616613481689, "rating": 5.0, "text": "I really enjoyed Dr. Mann's insight on my pain. His methods have left me feeling significantly less pain after each visit. I will definitely be going back! His staff and his location in Decatur is very convenient for my family. Pay him a visit!", "pics": null, "resp": {"time": 1616619215288, "text": "Thank you so much for leaving us this review Mr. Herring! Have a great day!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "113953326365077132040", "name": "L Thomas", "time": 1610039074219, "rating": 5.0, "text": "Great place to get help.  I have only had one visit but it was smooth and simple.  Kelsey at the front desk was extremely kind and helpful.  I got my first adjustment today from Dr. Mann and it was great I already feel better.  They take blue cross blue shield insurance I get through my work.  I am looking forward to my next visit.", "pics": null, "resp": {"time": 1613415152073, "text": "Mr. Thomas thank you so much for leaving us a review!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "112394177928588415410", "name": "Jeremy Brannon", "time": 1615225003006, "rating": 5.0, "text": "First and only chiropractor I've been to. I enjoy the atmosphere and the doctor knows what he's doing. All the staff are amazingly helpful and nice.", "pics": null, "resp": {"time": 1615823913828, "text": "Thank you Mr. Brannon for leaving us this 5 star review!  We always enjoy having you in the office! Have a great day!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "107013671300238496160", "name": "Matt Anderson", "time": 1605561108492, "rating": 5.0, "text": "My third chiropractor Ive tried, and hopefully my last. The staff is always polite and efficient, making sure appointments are on time and scheduling as easy as possible. Dr. Mann has been able to work loose some tight areas that the other chiropractors and massage therapists could not. He's also has knowledge in the sports medicine arena, making him able to better treat or pre-hab joints that get used heavily/dynamically. I always leave feeling new and usually with a few things I can work on out of his office to keep injuries at bay.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMvjBc6PJ6uWfGKLcSjDbIkjOD_yh7HgYXF79r2=w150-h150-k-no-p"]}], "resp": {"time": 1605647412097, "text": "Thanks for taking the time to leave us this review Matt!  We really appreciate it.  Dr. Mann really loves working with his athletes!  Have a great day and see you next time!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "110187305712671345568", "name": "Sarah Snyder", "time": 1615844580351, "rating": 5.0, "text": "Dr. Mann and his staff are friendly and helpful.  They work to help you feel better and are very knowledgeable in how they care for their patients.", "pics": null, "resp": {"time": 1616618984699, "text": "Thank you so much for leaving us a review Sarah! Have a great day!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "114133480621258032637", "name": "Bill Weatherly", "time": 1612813282751, "rating": 5.0, "text": "Had great success here.  Doctor explains well and is very professional. Office is very clean an well organized. I appreciate this clinic’s attention to detail as well. Hard to find these days.", "pics": null, "resp": {"time": 1613414949648, "text": "Thank you for taking the time to leave us this review Mr. Weatherly! See you next time!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "100359278598317214874", "name": "Jesus Tavarez", "time": 1621265743363, "rating": 5.0, "text": "Quick and great service. Overall would recommend and would come again.", "pics": null, "resp": {"time": 1624065500365, "text": "Thank you for leaving us this review! We look forward to seeing you again!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "117352817362335186976", "name": "Karla Reiser", "time": 1616375781369, "rating": 5.0, "text": "The staff is wonderful always smiling the doctor is great since seeing him I feel better then I have in over two years I honestly recommend them", "pics": null, "resp": {"time": 1616619023633, "text": "Thank you so much for leaving us this review Mrs. Reiser! We look forward to seeing you again!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "110438988662933744623", "name": "Jenny Klee", "time": 1615228373226, "rating": 5.0, "text": "After being cooped up from trying to quarantine and then from winter driving me inside my neck and back were killing me.  I called and they were able to schedule me the same day.  After taking X-rays Dr. Mann said I had sciatica and degenerative disc disease.  Thankfully he says both of these are treatable.  After my first treatment I am already feeling a little better!  I look forward to my next visit!", "pics": null, "resp": {"time": 1615823856346, "text": "Jenny- thank you so much for leaving us this review.  We are thrilled that you have had such great results! Have a great day and we will see you next time!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "114280003548738255415", "name": "Brayleigh Still", "time": 1612815815007, "rating": 5.0, "text": "I woke up hunched over like an old lady one day.  My backs always been bad cause I’m a nurse.  I googled the place with the most good reviews and ended up here.  Everyone is so helpful here.  The doctor even went and got my purse and insurance card for me out of my car so I wouldn’t have to crawl and get it myself.  My back died on a Thursday and Dr. Mann had me at work on a Monday. You won’t find a better chiropractor!", "pics": null, "resp": {"time": 1613415026922, "text": "Thank you for leaving us this review Brayleigh!  We look forward to seeing you again!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "115234579394410524691", "name": "Savannah Hogan", "time": 1547767638607, "rating": 5.0, "text": "So this might be a little long winded but I have to tell you about my experience here!  My daughter was the first of us to use Dr. Mann.  She came in for really bad neck pain and headaches.  Dr. Mann said it was related to what is now being called 'text neck.' In two weeks of treatment she was completely better! Not only that it's been months now and she feels great- and still playing on that phone! The second patient was my son.  We were told he needed tubes in his ears because he had chronic ear infections for months.  It broke my heart thinking about that so I was chatting with Dr. Mann on one of my daughters visits and he told Chiropractic can be successful in treating that without tubes. So we gave it a try (child adjustments are different and very gentle if you didn't know) and low and behold after months of ear infections they were COMPLETELY gone.  We were thrilled- not to mention we saved hundreds avoiding surgery.  The next patient was me!  I do pure Barre and I was having trouble with my low back and knee.  It turns out that I had mobility issues.  Couple weeks of work and my workout is now a breeze. And finally my husband.  He's had back issues before but not quite like this recent one.  He works at a computer all day.  This time the sciatica was going all the way to his foot.  He is currently finishing up his rehabilitation with Dr. Mann and is already pain free!  I am so glad we came here first! No pain, no drugs, we feel great, and at a fraction of the price of surgery. Make this your first stop!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNCcUqWCnIe_W2Bkgm9w6SwmL2KQn2mqlfB0u_h=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNbLjAIeQ95tqPo8ZmVVTpAD1Vu0ZS7OO-XvgBa=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPU8LA3NgOETQfG_Y1Vthl2djtnmaBwr0MYonGK=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOcxW-4rzS-q9QQxxhGYR9NSCce6E12_llvyxAv=w150-h150-k-no-p"]}], "resp": {"time": 1546895731433, "text": "Mrs. Hogan we are so happy to have met you and your family.  Thank you for taking the time to leave this review!  We look forward to seeing you all again soon! Have a great day and have a great year!!!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "108059013087874953035", "name": "Cricket Wireless", "time": 1611436743511, "rating": 5.0, "text": "My appointment went very well.  Wait was short and everyone was helpful.  I was recommended Dr. Mann by a co worker and I am very pleased with my care.  Also thank you for getting me in on short notice", "pics": null, "resp": null, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "107478867728286341010", "name": "Caleb Thomas", "time": 1613079123984, "rating": 5.0, "text": "Great staff, very friendly and affordable payments. Dr. Mann takes great care of my back and really corrects the issues!", "pics": null, "resp": {"time": 1613414986153, "text": "Thanks Caleb! We appreciate you leaving us a review! Have a great day and we will see you next time!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "106704439174067947352", "name": "Debra Thomsen", "time": 1600267583854, "rating": 5.0, "text": "Dr Brian has the brightest smile and healing knowledge. Chelsea has the most wonderful greeting and is able to work in appointments for those aches and pains. Heath is so helpful and clear on his instructions on the table. Those hot pads are the best. You won’t go wrong getting adjustments for your back, hips and knees from Advanced Chiropractor!", "pics": null, "resp": {"time": 1600726278502, "text": "Thank you for leaving us a review! See you next time!!!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "113057687972133531252", "name": "mark mcalister", "time": 1615813907902, "rating": 1.0, "text": "I would stay away extremely overpriced. It was $235 for a new patient set up every visit after would be $99. The exam was minimal, no new x-rays and didn't even look at my old ones before slapping me with the bill. For chiropractic care this is egregious.\nAfter this visit i went to another practice new patient was $30 which included x-rays and a much more thorough examination.", "pics": null, "resp": {"time": 1615819675752, "text": "Good Morning! $18 is our average patient copay!  If you have questions on what your price would be please call us at 2563518500 so we can give you correct quotes.  Also, our exam guidelines follow both that of the Journal of the American Medical Association and the Journal of Chiropractic Medicine ensuring we deliver complete and thorough examinations every time! X-rays should only be taken on an as needed basis. If a chiropractor is taking x-rays on all patients without medical necessity we urge you to report this to the State Board of Chiropractic as this is either based on greed or severely outdated research and considered below the current standard of care. In all honesty, we believe this to be a fake review left by a competing Decatur chiropractor as the information in your comment is misleading and inaccurate."}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "101750289006627031552", "name": "R Mitchell", "time": 1611159602952, "rating": 5.0, "text": "Dr. Mann helped me with my back pain.  I had been getting worse and worse for months and I was having to miss work.  Everyone here is always nice and my back feels strong and pain free again. Thank you", "pics": null, "resp": {"time": 1613415123884, "text": "So happy to hear you were pleased with your care at Advanced Chiropractic Mr. Mitchell.  See you next time!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "101590619371899048002", "name": "Casey Miller", "time": 1603130699314, "rating": 5.0, "text": "Dr. Mann was exactly what is looking for when I was searching for something to help with my back pain. My other doctor just wanted me to take pills and then an orthopedic surgeon said I need an operation.  I didn't want any of that so I went here. The staff is very nice and the Dr. Mann is very professional.  He said even though I was in severe pain that he could still help me. Sure enough here I am now doing everything I need to without any pain. It has been 2 weeks since I have been.  I am   Thankful and grateful. Definitely recommend this office.", "pics": null, "resp": {"time": 1605110146886, "text": "We are so glad you found us Casey! See you soon!!!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "109526564471479536320", "name": "Dana Bradley", "time": 1604971262248, "rating": 5.0, "text": "Incredibly appreciative for all the help I received here.  I didn't make it here until after a month of muscle relaxers and an MRI.  I was scheduled for an appointment with my orthopedic doctor but my appointment was 6 weeks away.  I was really just looking for something to hold me over.  I took my report to Dr. Mann and I was told not only could help me he believed he could keep me from having any surgery and possibly no more meds.  I had my doubts, especially after he told me I had a disc in my lower back that was bulging.  To my delight, I began sleeping better each day.  After 2 weeks work wasn't so bad.  After 1 month I felt so much better I cancelled my orthopedic visit.  I don't know why the chiropractor isn't everyone's first recommendation when something hurts.", "pics": null, "resp": {"time": 1605109326338, "text": "We are so glad we could help you Mrs. Bradley!  We hope you are well and look forward to seeing you and your family in the future!!!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "118293486881748827134", "name": "Brylee Young", "time": 1611761803807, "rating": 5.0, "text": "Really nice people. Super great and very helpful. Highly recommend.", "pics": null, "resp": {"time": 1613415076938, "text": "Thank you so much Brylee! Hope you have a great day!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "113905253039133356963", "name": "Luke Appleton", "time": 1599245881480, "rating": 5.0, "text": "Highly reccomend this office to anyone trying to avoid pills and surgery for their back pain.  My back had steadily gotten worse and had reached a point that I couldn't take it anymore.  It hurt at work and as affecting my sleep.  Went to my MD and they just gave me a prescription. I'm not a pill head so I looked this place up.  Very little wait time here. I sat for less than 5 minutes waiting the whole visit. Sat for about 30 at my MD.  I used Dr. Mann here.  He went over what was going on.  I recieved treatment that day.  I had no idea how much sitting in a bad chair could affect my back.  I have since conpleted my rehab and feel great.  Even better than before it started bothering me.  Definitley worth the visit.", "pics": null, "resp": {"time": 1601326038872, "text": "Thank you for leaving us this review Luke! We are glad you had such great results during your time here! We strive to be leaders in rehabilitation and wellness care!  See you next time!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "113658494597281092601", "name": "Autumn Troxel", "time": 1600711479881, "rating": 5.0, "text": "My headaches and low back pain are gone!  I used to get headaches regularly. They weren’t usually debilitating but they were constantly there and just annoying. I would find myself in a bad mood just from the pain always being there. My lower back started after I had my child and I just couldn’t get it to go away. I found this place online and they were able to get me in the same day. My wait times are always very short at advanced chiropractic. I cannot stand going to an office and sitting for an hour waiting.  I think my longest wait was less than 10 minutes.  The office is very clean- they clean between every patient. They also take blue cross blue shield insurance which was great. I’m hoping to get my husband in soon for neck issues he had after a car accident.  Overall very pleased with my care here and happy to support local business in Decatur!", "pics": null, "resp": {"time": 1600726888349, "text": "Thank you so much for leaving us a review Autumn!  We love that you have had such great results!  Let Mr. Troxel know we deal with a lot of auto accident victims and have great success! See you next time!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "102521497235673343481", "name": "Robin Varner", "time": 1601995227648, "rating": 5.0, "text": "I would recommend Advanced Chiropractic to everyone!  The staff is so  nice!  I came for back pain.  Dr. Mann was patient and kind.  He walked me through everything and made sure I understood what my problem was.  I felt 100 percent better after finishing here.", "pics": null, "resp": {"time": 1602712067069, "text": "Thank you Robin for sharing your success with us at Advanced Chiropractic! See you next time!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "117661971631815137162", "name": "Kaz Baumgard", "time": 1605637357176, "rating": 5.0, "text": "EXCELLENT service and treatment here.  My sciatica and back pain are gone.  I understand better now how to avoid back pain as well.  My blue cross blue shield PEEHIP and secondary covered my bill entirely.", "pics": null, "resp": {"time": 1605647507045, "text": "Thanks for leaving us a review Kaz!  Happy holidays to you and your family!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "107605386980528918192", "name": "Jerod Stevens", "time": 1599515981734, "rating": 5.0, "text": "Feel like new now.  Thanks for all the help. Will definitely be sending you some business. Take care!", "pics": null, "resp": {"time": 1601325927914, "text": "Glad we could help Mr. Stevens!  We appreciate that! See you next time!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "115705110227158519897", "name": "Gabby Rochester", "time": 1575135113815, "rating": 5.0, "text": "Great clinic! Great hours too super convenient. I was having pain in my back and down my leg. I started this week and can already tell the difference! I have received great adjustments, some home exercises, and decompression therapy. Front desk was very accommodating, the doctor was very insightful and showed me why I’ve had so many problems with my back! I was especially impressed with the suggestions Dr. Mann gave me to avoid flare ups and actually help me fix why it was happening instead of just living at the chiropractor forever.  I also purchased their holiday massage special. It’s a 3 pack of one hour massages for $99. Can’t beat it! It’s always a little nerve racking to try a different doctor but I’m so glad I chose this place on my google search! Five stars for sure!!!", "pics": null, "resp": {"time": 1575321551146, "text": "Thank you for the review Gabby! Glad to here you have had such great success! Thank you for choosing Advanced Chiropractic!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "100544158484397505993", "name": "Tiffany Hightower", "time": 1582911110272, "rating": 5.0, "text": "Dr. Mann and the staff are amazing! The best chiropractor I have been to. Dr. Mann worked with me for a couple of weeks and now I feel much better! I would highly recommend them to anyone. Also Kelsey and Heath are the best! Everyone is always in a great mood! I love it!", "pics": null, "resp": {"time": 1583162996825, "text": "Thank you Tiffany! We always enjoy seeing you at the office.  So glad to hear that you had success with our practice!  Have a great day!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "114711378638134637393", "name": "Jennifer Landry", "time": 1579808410374, "rating": 5.0, "text": "Dr. Mann is a great chiropractor.  It looks like it's been said her a 100 times but I wanted to say why my treatments here allow me to say how much I mean that and miss being in Alabama!  I spend most of the year in Atlanta now because of work.  I have tried and tried to find a chiropractor here that was as good as Dr. Mann but I haven't been successful.  I called Dr. Mann before one of my appointments in Atlanta and asked if he would mind talking to my chiropractor (bless him for doing that) Even after an in depth conversation about the type of treatments I was receiving with Dr. Mann in Decatur I still wasn't getting the same level of relief from my Atlanta chiropractor that I was receiving at Advanced Chiropractic.  My neck is just not the same when I go to other places.  I only get to be adjusted a few times a year by Dr. Mann now because of the move and it's one of the worst things about not being home.  But every time  I am in town seeing Dr. Mann is on the list!  Another thing I always appreciated about Dr. Mann's office is there is always a plan.  He doesn't just say 'see ya' at the end of your appointment.  If I am working on an injury I always know when I need to be seen again.  If I am on wellness I know I need to be back monthly.  Other places I have been don't give any direction and it just seems less professional.  Be thankful for what you have here!!! He's the best! Thanks again Dr. Mann!", "pics": null, "resp": {"time": 1579812925781, "text": "Thank you so much Jennifer for leaving us a review! We always asked to be updated by your family when they come in for treatment about what you and yours are up to these days!  It sounds like the husband and kids are  adjusting to the move pretty well! We miss seeing you guys every month now that you've moved to Atlanta!  And yes anytime you are home give us a call and we will work your whole gang in.  Hope to see you soon!!!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "107002647467310604442", "name": "nathanael west", "time": 1595259620911, "rating": 5.0, "text": "This is a great place to get adjusted! They are friendly and make you feel welcome! I started going a couple months ago and I feel great! I suggest you give them a call!", "pics": null, "resp": {"time": 1596493737355, "text": "Thank you so much Mr. West for taking the time to leave a review!  We are thrilled to hear that you had such a positive experience with Advanced Chiropractic!  We look forward to seeing you in the future.  Have a great day!!!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "102444668951109860046", "name": "Miles Blackwell", "time": 1578604786314, "rating": 5.0, "text": "This is the chiropractor you've been looking for.  I'm a fan of all things wellness and am a believer that the chiropractor can save you from surgery. I am also very picky about the places I go for treatment and advice. I had just relocated to the area for work.  My supervisor had also just moved here and said I should give this place a try.  I called ahead and asked about the services provided and some questions about my new insurance.  I had my appointment that evening.  The office is more modern looking than some of the other places in town (past experience has taught me sometimes old building means outdated doctor). The staff and doctors are all nice people and I can without a doubt say that was the best treatment I have ever been given.  My last chiropractor was a good friend and great person but was a smaller build. Just guessing but I think that really was the difference in treatments and let me tell you it was significant. I come in about once a month and it keeps me doing everything I like (and some of the chores that I don't).", "pics": null, "resp": {"time": 1578529609045, "text": "Thanks for the review Miles!  We work hard to make sure we maintain a professional environment and stay up to date on the latest research on wellness and rehab treatments.  Thank you again for taking the time to leave us a review!!! See you soon!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "106267701323958583428", "name": "Tiffany Nichole", "time": 1547160308411, "rating": 5.0, "text": "I haven't felt this good in a long time! No more pain! No more headaches! Going to work isn't so painful anymore. I'm getting much better sleep at night. I can do just about anything I want to now. I'm not afraid to tackle a garden or the laundry! I'm so glad I gave this place a try. In the very first visit I could see the difference. After a few weeks I felt like a new person. I originally only came here because I had just moved to Decatur and driving to my old chiropractor was getting to be a hassle. On my first visit Dr. Mann discussed new treatment methods that he had seen some success with and I decided to give the rehab a try before just going to my regular Wellness treatments. Like I said in just a couple weeks I could see the changes. I used 2 feel tingling from my back almost weekly. I now haven't felt it in weeks. I used to have to avoid certain Hobbies that I enjoyed because I was afraid my back would go out. Thanks to Doctor Mann I now have no fear of my back going out on me. That in itself is huge for me! And yes this office is super convenient! Right on the Beltline across from publix!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM6ZSz96opGiFWc1rfXL8OTCRQTAoh8_9pnhwM4=w150-h150-k-no-p"]}], "resp": {"time": 1552318440057, "text": "Thanks Tiffany! We are glad we were able to help you!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "107571380742087732267", "name": "Keisha Talley", "time": 1606174376995, "rating": 5.0, "text": "My son and I come here for chiropractic treatment.  The front desk is always stellar and I have great trust in Dr. Mann. We always come her first for any pains or injuries we might have.", "pics": null, "resp": {"time": 1606326177830, "text": "Thanks Keisha for leaving us a review!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "117925749544212930309", "name": "Rachael Gardner", "time": 1609179536637, "rating": 5.0, "text": "Wonderful and nice people and they helped my back significantly", "pics": null, "resp": {"time": 1609880902764, "text": "Thank you so much Rachael for taking the time to  leaving us a review.  We are so happy to hear that you were pleased with your results at Advanced Chiropractic!  See you next time!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "105633587183636519592", "name": "Jamie Reynolds", "time": 1575309823614, "rating": 5.0, "text": "Just finished my visit and I am very impressed. Office was very easy to find. It’s on the Beltline in Decatur. No long wait, very nice staff. My appointment with the doctor went well. Dr. Mann is very friendly and approachable. He answered all my questions and we were able to start my treatment today.  Looking forward to coming back tomorrow when he says we will go over my x-rays together.  My copay was only $20 with my insurance. Already feel a little better! Looking forward to getting a good night of sleep!", "pics": null, "resp": {"time": 1575321486234, "text": "So glad you had a good experience! Thank you Jamie for leaving us a review and thank you for choosing Advanced Chiropractic!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "107455375273707383686", "name": "Blaine Roberts", "time": 1582847254305, "rating": 5.0, "text": "I love going to Advanced Chiropractic the staff is extremely nice and very helpful. They are also quite knowledgeable about the products they offer. The atmosphere is very enjoyable and the massage therapist is excellent as well. One of the best chiropractic offices I’ve ever been too.", "pics": null, "resp": {"time": 1582908639309, "text": "Thank you for the review! We hope to see you soon Mr. Roberts! Have a great day!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "115646153974512950272", "name": "Danny McGee", "time": 1568227710261, "rating": 5.0, "text": "I originally came here because of the office hours. I don't get off till 4:30.\nMy old chiropractors office wanted me there by 4:45 to be seen. Advanced Chiropractic is open till 6:00.\nI must say I have been very pleased with the switch. I highly recommend Dr. Mann! When I first came here I was contemplating another back surgery. Dr Mann ,through adjustments and suggestions on exercises, has improved my quality of life.  My job can be physically demanding at times. Dr Mann keeps me going! I have never had a problem getting an appointment when I have had a bad day. His office staff are friendly and helpful. The massage therapist is great to.", "pics": null, "resp": {"time": 1576950606692, "text": "Thank you so much for leaving us a review! It had been a pleasure having you join our office."}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "104940459951323832235", "name": "Jonathan Franks", "time": 1577126330771, "rating": 5.0, "text": "I was pretty happy with my chiropractor back home so finding a new place was not the most exciting thing for me.  I had been using the same chiropractor that my parents introduced me to when I was was young so I wanted to find the right doctor for me and my family.  I moved to Alabama as part of the construction happening in Madison right now and will be here for at least a year.  I found this place on google and called to schedule a consultation.  The office was nice. Front desk was helpful. Dr. Mann was very  professional and gave me the same level of treatment I was used to getting in back in Tennessee.  He also had some new ideas that were actually very helpful at work.  The machinery I sometimes use put me in bad positions and could flare me up for days. I’m a golfer too and he is going to try and get me back on the course.  My swing has been causing some radiating back pain in to my leg.  This place also works out with my schedule. I don’t get off of work until 5 sometimes but can still make it to the office since they are opening until 6. I’ll Be trying the massage therapist soon too.", "pics": null, "resp": {"time": 1577133278207, "text": "We are happy you found Advanced Chiropractic too Mr. Franks!  We understand that seeing a doctor for the first time can be a little nerve-racking.  We do our best to ensure a thorough and pleasant first visit while answering any questions you may have to help put your mind at ease.  We see a lot of construction workers- both supervisors and laborers.  We keep the office open a little later just so you all commuting back in to town can be seen.  Better hurry with the massage our yearly Christmas Special ends today! See you soon!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "112991199924517275462", "name": "CT Accounting", "time": 1577119145522, "rating": 5.0, "text": "Started here for my back issues.  I really thought I got it from my dad but Dr. Mann said a lot of it has to do with lifestyle as well.  I had great results here.  Instant relief, followed by weeks of improvement.  Visits never took that long- barely sat in the waiting room before me treatment begins and I was moved to the next parts of my treatment were with little to no wait.  At the end I did have a few question but Dr. Mann stayed with me to answer my questions.  Nothing beats being able to sleep, wake up, go through a demanding day, and still feel great every day.  I will most definitely keep using Dr. Mann and his clinic on a regular basis.\n\nUpdate 12/23/19-  It has been months since I have had even the slightest pain! I am back to exercising 3 days a week and doing pretty much anything I want, pain free.  I honestly have had days that I forgot that I was ever in pain all the time.  My son's basketball season started up which means lots of driving and uncomfortable locations I must linger in for hours, multiple nights a week.  With the instructions Dr. Mann gave me my back has held up and I have not missed a second of a single game.  They were able to work me in this morning for an adjustment before I hit the road for the holidays.  Dr. Mann even came out to my car to help me setup me seat cushion to keep my back from acting up on the long drive we have to my wife's family gathering in North Carolina.  I cannot say enough about how happy I am that I found Dr. Mann's office.   Until next time! Thanks again you guys! Have a Merry Christmas!", "pics": null, "resp": {"time": 1565897476593, "text": "Thank you for leaving the review!  We are so glad you have had such great results!  Chiropractic is great for many things!  We believe in keeping the body pain free and healthy so you can keep doing the things you love to do!  If we wait until pain arises then new damage has occurred and some parts of the body just don't grow back like the original pieces!  We are trying to change the narrative of health care by not only fixing the problem but preventing it from coming back as well. See you next time at Advanced Chiropractic!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "115472696143659505260", "name": "Hannah Criscoe", "time": 1603519754957, "rating": 5.0, "text": "I feel so good, me and Kate never felt better", "pics": null, "resp": {"time": 1617328459742, "text": "Thank you for leaving us a review!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "105582613146714866663", "name": "Daniel Jones", "time": 1576948492576, "rating": 5.0, "text": "Yesterday I woke up and my back had reached a point that I just couldn’t handle anymore. I had been trying to work through it for weeks.  I work second shift so at 11 I began going down the list of chiropractors in Decatur.  I found out that a lot places were closed by lunch and some were taking more time off for the holidays.  When I called advanced chiropractic Dr. Mann said he would keep the office open for me. I arrived after 12 and noticed that the office actually closed at 12.  He still took me in, did my exam and took my xrays himself.  I’m a plant supervisor and I would not have survived the night without Dr. Mann’s help.  I look forward to next week and getting more relief. Thanks again doc", "pics": null, "resp": {"time": 1577113963701, "text": "Mr. Jones we are glad we were able to help you.  Our proudest moments are getting people back to living life- both work and play!  We look forward to seeing you again! Thank you for leaving us a review and have a good day!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "112753738027622764010", "name": "Rhett Maples", "time": 1576382312211, "rating": 5.0, "text": "This was my first time seeing a chiropractor. I’ve had back pain for months that would come and go but this time it was worse.  The aching and nerve pain were keeping me awake at night and bothering me throughout the day.  My doctor told me it was time to see a surgeon.  I asked around and was recommended Dr. Mann by multiple friends.  I decided to go in for a consultation.  After talking Dr. Mann said he felt he could keep me from having surgery. And he was right. After 2-3 weeks I started noticing the pain was decreasing. By the end of my rehab I was getting uninterrupted sleep and getting through the work week with no issues.  I feel confident in my back again. I saved thousands by avoiding surgery and didn’t have to worry about the risks of surgery.", "pics": null, "resp": {"time": 1576534274844, "text": "Thank you for the review! Glad we could help you!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "107662730579157491812", "name": "Sydney Noel", "time": 1576623471922, "rating": 5.0, "text": "I’m very health conscious so I needed to find someone who could conveniently meet all my needs. Chiropractor, massage, health questions things like that. I found this place about 2 years ago and I am thankful I did. Through headaches, back pain, and pregnancy Dr. Mann has helped me even more than I could have imagined. The office is also very easy to get to. My last visit was just for a wellness adjustment and some diet advice.  Dr. Mann always takes time to answer any questions which is really hard to find these days.  I recommend everyone see a chiropractor and use this place if you’re looking for the best office to meet all your health needs!!", "pics": null, "resp": {"time": 1576950044081, "text": "Thank you for leaving us a review Sydney! We are proud to offer a variety of services and products to our patients. Our goal is to be the one place you need for all of your wellness and rehab needs. Thank you using us for so many years. Happy Holidays!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "107225152745619513994", "name": "Kristina Warren", "time": 1574924034330, "rating": 1.0, "text": "Recently moved to the area and was looking for a new chiropractor. I made the HUGE mistake of visiting Dr. Mann. Very unprofessional. Sort of “know it all”. He would not listen to any of my problems he just kept talking. Other than that I received my adjustment which was fine but then he wanted me to come back 3 times a week! I have a life. I don’t have time for that. The staff was very kind and attentive. Maybe I’ll just try a massage next time.", "pics": null, "resp": {"time": 1575131410148, "text": "We have no record of a 'Kristina Warren' ever being in this office.  This false review has been reported to the local authorities and Alabama Chiropractic Board."}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "101627359531212885325", "name": "Donald Priest", "time": 1577037891956, "rating": 5.0, "text": "I use Advanced Chiropractic for my low back pain problems.  I see Dr. Mann regularly and he keeps me going.  I try to go once a month so I can keep working.  It has been several years since I have had any issues.  The entire staff is very friendly and I have sent him several of my friends and family for their health needs.  My wife uses their massage therapist regularly and is very pleased with her visits their too.  They have great hours and are very flexible.", "pics": null, "resp": {"time": 1577113849247, "text": "Thank you for leaving us a review!  We are so glad you have had such great improvements over the years.  Dr. Mann enjoys seeing families come in!  We appreciate you spreading the word about Advanced Chiropractic! Have a great day!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "103860148448687002531", "name": "Eric Flannigan", "time": 1551295094949, "rating": 5.0, "text": "Highly reccomend for low back treatment.  Had lots of trouble with mine in the past. Dr. Mann was recommended to me by my boss.  They take blue cross blue shield so it was very convenient. Nice office and helpful staff. I also appreciate that Dr. Mann will answer any questions I ask. All around a great office that really sets the standard for Decatur.", "pics": null, "resp": {"time": 1552318334181, "text": "Thanks Mr. Flannigan for taking the time to review us! So glad we could help you!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "101711166582070550865", "name": "Whitney Brown", "time": 1554840546915, "rating": 5.0, "text": "My experience here has been nothing short of amazing. When i called to schedule my appointment, the receptionist was more than willing to get me in around my work schedule. When i first walked into the office, everyone was so friendly and welcoming. I cant say enough about Dr. Mann. He listened to everything i felt that i needed to tell him. He took his time explaining to me what he was doing and why. He recommended exercises to do between visits to help strengthen me back up. After he adjusted me, I felt so much relief. He eased pain that I have had for months. When I left, I felt like a new person. My only regret was not coming to see Dr. Mann sooner!!", "pics": null, "resp": null, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "110632800816063049194", "name": "State Farm Aspirant", "time": 1559677146085, "rating": 5.0, "text": "Dr. Mann treated me quickly both visits and I only had to go twice before my pain cleared up. He gabe me some quick daily exercises/ movements to do to keep me from having to continue making visits. I feel like My pain was actually healed instead of made to feel better and just Going back again and again for relief. I have regained full mobility with no back/neck pain because of work OR when I get up in the morning. Super nice guy and probably the most helpful doctor I’ve ever been to.", "pics": null, "resp": {"time": 1559685737745, "text": "Thank you for taking the time to leave us a review!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "113992880986139444974", "name": "avery summerford", "time": 1534526375310, "rating": 5.0, "text": "I just moved here for work from Tennessee.  Somehow during the move I hurt my back so badly that I couldn't move.  I had always had a chiropractor in Nashville but obviously that was no longer a choice.  So I got on my phone and began searching for a local one.  My chiropractor back home told me to find one that was 'up to date' and that it might be hard to find in a smaller city like Decatur.  I found advanced chiropractic and checked the website.  I found that they do a lot more than just heat and adjust their patients.  I called and scheduled an appointment the same day. The office is very modern looking and Dr. Mann may be even more knowledgeable than my last chiropractor.  I'm already feeling much better.  The receptionist is also very good with describing insurance coverage as mine was a mess.  Overall- great office. This will be my last chiropractor!", "pics": null, "resp": {"time": 1535039696845, "text": "Avery I'm glad you found us and thank you for your kind words!  It has been a pleasure getting to know you!  Yes- we see A LOT of back pain and we try our best to get patients in as soon as possible.  Again- thank you so much for taking the time to spread the word about what we do at Advanced Chiropractic.  We look forward to seeing you on your next visit!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "117607802378634014413", "name": "Judy Letson", "time": 1575053697940, "rating": 5.0, "text": "Had a very good first experience with chiropractic here. They accept insurance. My treatment for sciatica was a success. I will continue to use Dr. Mann in the future!", "pics": null, "resp": {"time": 1575321617628, "text": "Thank you Ms. Letson for leaving us a review and thank you for choosing Advanced Chiropractic!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "105501248053653245655", "name": "Eli Mann", "time": 1573779018874, "rating": 5.0, "text": "This place literally changed my life!! I’ve had HORRIBLE posture from gaming on my laptop and Dr. Mann fixed it! It took some time and effort, but he was there for every step. Such a kind and caring doctor unlike others around!", "pics": null, "resp": {"time": 1574696514091, "text": "Thanks for the review!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "109454057396959122876", "name": "Katy Bevin", "time": 1583449575408, "rating": 5.0, "text": "Today was my first visit and it went well.  The receptionist was very friendly and helpful.  The doctor is fantastic.  He took xrays, explained my causes of  pain and told me they would be able to help me.  It was my first adjustment so I think it went well with what I know so far. I'm looking forward to coming back and finishing my rehab. I reccomend this place to anyone with back pain.", "pics": null, "resp": {"time": 1583512783507, "text": "Thank you for leaving us a review Katy!  We are glad that you enjoyed your experience in the office!  We look forward to seeing you again!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "102477500010743450796", "name": "Greg Reily", "time": 1553268963297, "rating": 5.0, "text": "I had a catch in my back for months.  Sometimes sharp and achy. Sometimes i would get tingling or numbness down the back of my leg. This place popped up on google with the highest and most ratings so I called and they scheduled me very quickly.  First visit was good. Little bit of paperwork but nothing bad compared to other doctors offices.  Dr. Mann is a nice guy.  Answered my questions and explained what was going on. Began treatment that day. I feel great now. It's been a month since I've felt anything at all. I definitely recommend to anyone looking to avoid pills and surgery in the Decatur area.", "pics": null, "resp": {"time": 1556569597987, "text": "Glad we could help you Mr. Reily!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "114841311733352590517", "name": "Christy Burnham", "time": 1556642531868, "rating": 5.0, "text": "The girls up front are amazing and so sweet and very informative.  I started out with a massage the first time and she did an amazing job. I came back to get adjusted and I walked out feeling like a brand new person. He went over different ways to help me!", "pics": null, "resp": {"time": 1557153894466, "text": "Thank you Christy!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "112304280853885546059", "name": "Veronica Tiddle", "time": 1553725480860, "rating": 5.0, "text": "I woke up one morning with excruciating pain in my lower back.  It hurt to move at all.  I found Advanced Chiropractic online and they were able to schedule me right away.  After my first visit my pain decreased some. 2 weeks later I was feeling a lot better.  They really go the extra mile here to help you.  Dr. Mann and the staff are kind, friendly, and understanding. I highly recommend this place!", "pics": null, "resp": {"time": 1556569580527, "text": "So glad we were able to help you!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "104821056995141328442", "name": "Valerie Jones", "time": 1552240575819, "rating": 5.0, "text": "I could barely walk when I came to Dr. Mann.  I had lifted something heavy, and the urgent care doctor said that I had bulging disc. I was in so much pain! But Dr. Mann was very gentle and kind and in a matter of a few days I was feeling better. It took a few weeks but I was completely pain free. I would highly recommend advance chiropractic to anyone suffering from back pain. The staff are very friendly and helpful. And the whole experience has been a good one.  They make you feel like family!", "pics": null, "resp": {"time": 1552318378236, "text": "Thank you Mrs. Jones! We are so glad we could get you back on your feet!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "100578365193088694590", "name": "Linda Lawrimore", "time": 1560992263161, "rating": 5.0, "text": "Having past experience with a chiropractic practice I can honestly say that Advanced Chiropractic Rehab and Wellness is superior in all aspects of their work.  Dr. Brian Mann is a knowledgeable, helpful and friendly chiropractic physician. He is concerned about your well being and teaches you how to help yourself at home during the course of your rehabilitation.  I have made enough progress on my neck (which was in really bad shape) and my back (ongoing history for years) that I am confident I will get to the improved point I need to be.  Relief of pain and discomfort is a blessing and so is Dr. Mann.  His staff is friendly, helpful and at your side at all times during your visit. They are a great asset to the doctor's practice.   I can think of no other place I would want to go for chiropractic treatment when I already have the best!", "pics": null, "resp": {"time": 1561040437002, "text": "Thank you so much Mrs. Lawrimore!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "103641472520357610358", "name": "Verizon Wireless", "time": 1553794311362, "rating": 5.0, "text": "Thanks for the help doc! The ergonomics presentation was great! Our necks are already feeling a lot better! We'll see you soon! We highly recommend Dr. Mann to anyone who works on screens all day!", "pics": null, "resp": null, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "111021089677439268634", "name": "Derron Smith", "time": 1548284322781, "rating": 5.0, "text": "I've been coming to Advanced Chiropractic and seeing Doctor Mann now for about 2 years. I figured it was time that I gave him some acknowledgement. Honestly, I started coming here out of convenience.  It was right on my route home. I figured all chiropractors were pretty much the same. However the older doctor that I was seeing across town, turns out was very behind the times. Dr. Mann has updated treatment methods and a streamlined practice. I never really have terrible back pain but I never really knew how good I could feel until I started seeing Dr Mann. My visits are always fast- and I don't mean that they are rushed- just never any wasted time. So if you are deciding what you ahould do about your back or neck or any health needs you might have- you have found the right place.  They'll get you fixed up in no time.", "pics": null, "resp": {"time": 1552318410863, "text": "Thanks Derron! We appreciate your review!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "104059892377103583465", "name": "Angie Thom", "time": 1560816575412, "rating": 5.0, "text": "Dr. Mann and his staff are the best around! My back pain has improved dramatically in the short time I've been a patient, and I would highly recommend him to anyone seeking chiropractic care. I am always seen quickly with little to no waiting, and the staff is friendly and efficient.", "pics": null, "resp": {"time": 1560868205738, "text": "Thank you for the kind review Angie! We always enjoy seeing you!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "105552347746737105181", "name": "Wendell Atkins", "time": 1536700048440, "rating": 5.0, "text": "I used to see another chiropractor in town. I tried this place because they had massages too. My knees and hands usually always hurt and keeps me from fishin. When I left after one visit I already feel better. It was a great experience.  Will definitely be back", "pics": null, "resp": {"time": 1536700431024, "text": "It was a pleasure talking to you Mr. Atkins.  One of our goals here at Advanced Chiropractic is to keep everyone doing what they love.  We are happy to hear you gained back your pain free mobility and are able to get back on the water!  Have a good trip this weekend and let us know if we can do anything else for you!  We'll see you next time!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "115455533074695029935", "name": "Jonathan Yodges", "time": 1552897181486, "rating": 5.0, "text": "I highly recommend this office for neck and back pain. I flew to Alabama for a 4 week work trip.  When I arrived in Decatur I was in terrible pain from the long flight.  Several people at my company had great things to say about Advanced Chiropractic so I came here first.  Dr. Mann was very personable and answered all my questions.  After my exam, I immediately received treatment and was given exercises that I still use to keep my  back loose and strong.  I had great results and will continue to use this office for injuries and wellness whenever I am in this area.", "pics": null, "resp": {"time": 1556569622293, "text": "Thank you for leaving us a review!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "104010406170497924520", "name": "Amanda Elkins", "time": 1555549885371, "rating": 5.0, "text": "Came in with neck pain due to 3 bulging disc (going on 8 months) and I’ve finally gotten relief by coming to see Dr. Mann for the past 3 weeks! I have tried physical therapy and medications and they didn’t do much for me. So glad my neurosurgeon recommended seeing a chiropractor! Best decision ever! You can’t beat Dr. Mann or his staff!", "pics": null, "resp": {"time": 1555598932737, "text": "Thank you for leaving us a review Amanda!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "115851649264229217516", "name": "Jerry Brown", "time": 1540409581545, "rating": 5.0, "text": "Great front desk, very friendly. Like the atmosphere. I come to keep my back healthy and strong. Been coming for going on 2 years. I’ve also had my shoulders and wrists worked on. My sister comes here too!", "pics": null, "resp": {"time": 1545252078256, "text": "Thank you Mr. Brown for leaving us a review! We always enjoy seeing you and your sister at the office.  We will see the both of you soon!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "111039462655931818895", "name": "Jessica Carlson", "time": 1539728016441, "rating": 5.0, "text": "Look no further! you have found the best chiropractor in Decatur!  I have been seeing Dr. Mann for treatment for almost 2 years now. In the beginning, I came for my back pain.  Dr. Mann quickly fixed me up. now I see him for wellness visits and sometimes I will get massages from their massage therapist.  My husband also used Dr. Mann for his neck issues.  He sits at a desk all day and some days he had to come straight home and lay down. But now after his treatment he feels fantastic! Their location is super convenient too! Right on the beltline!!!", "pics": null, "resp": {"time": 1540318654373, "text": "Thank you so much Jessica for taking the time to review us!  We can’t believe it has been 2 years since we first met you.  It’s always a pleasure to see you and your family!  We look forward to your next visit! Thank you again to you and your family for making Advanced Chiropractic Rehab and Wellness your family chiropractor!!!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "108218886365762143200", "name": "Chris Humphries", "time": 1517683095741, "rating": 5.0, "text": "My wife and I use Dr. Mann and he has been wonderful! We always feel better leaving his office than when we walked in. The next day is even better! I would highly recommend him. We always have a professional experience and he knows what he is doing.", "pics": null, "resp": {"time": 1517707597556, "text": "Thanks Chris! We always enjoy seeing you and your family. Congrats on your success in priceville! We look forward to seeing you again! Tell everyone we said hello!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "118437417539322410888", "name": "Township Mom", "time": 1554420896217, "rating": 5.0, "text": "Dr Mann and his staff are completely amazing .. Great atomoshere! Dr Mann is knowledgeable and always available for any questions you have and cares about you're treatment. I'd recommend him to anyone who needs pain relief! I was in pain everyday for years! And now, I'm completely pain free!", "pics": null, "resp": {"time": 1555444813872, "text": "So glad we got you moving again!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "110721971952697267754", "name": "Cj Mooney", "time": 1534264040325, "rating": 5.0, "text": "I’m a construction worker and also travel a lot for work. Between work and driving I have lots of back and shoulder pain. I come here to keep me going. The front desk is friendly and fun. Give them a call today they’ll take care of you!", "pics": null, "resp": {"time": 1534264469566, "text": "CJ nothing makes me happier than keeping a hard working man going.  Not to mention you have some of the best stories from being on the road.  We are happy to have you as part of our Advanced Chiropractic family.  Keep that back straight and safe travels my friend! We'll see you next time!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "111357863062484303234", "name": "Anthony Fleming", "time": 1559660646477, "rating": 5.0, "text": "I had a wonderful experience with Dr. Mann and his staff. Not only was everyone in the office warm and friendly, but my lower back issue was addressed and resolved and is still feeling better today. I would highly recommend giving Dr. Mann a try if you are undecided on Chiropractors.", "pics": null, "resp": {"time": 1559685759411, "text": "Thanks Anthony! We appreciate the review!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "112384918569917856295", "name": "Dwight and Lisa Lang", "time": 1562626105988, "rating": 5.0, "text": "Office staff are friendly and helpful. I feel great after every visit. No more back pain", "pics": null, "resp": {"time": 1565732894961, "text": "Thanks Mr. Lang! We appreciate you taking the time to give us a review!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "104832898103493268360", "name": "brittany strickland", "time": 1608087206347, "rating": 5.0, "text": "Dr. Mann is an amazing chiropractor! Some clients leave their doctor feeling worse, but that is never the case with a visit at Dr. Mann's office. I am a loyal customer and would never go to anyone else! He's very talented and would recommend him to anyone and everyone. The staff is always so friendly which makes the visit welcoming each and every time.", "pics": null, "resp": {"time": 1507917032818, "text": "Thanks Brittany for leaving us a review! See you next time!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "108044400396293407161", "name": "Iris Haynes", "time": 1543939652120, "rating": 5.0, "text": "Treated my wrist arm and elbow pain. Didn’t have to get medication or surgery. Now I’m taking my grandson to be treated for his chronic ear infections. I continue my maintenance visits because I was in terrible pain before Dr. Mann and his wonderful staff treated me. Amazing results for not a lot of time or money. They are able to get me in and out quick and reasonably affordable. Definitely recommend to everyone.", "pics": null, "resp": {"time": 1545251999522, "text": "Thank you for the review Ms. Jones!  We are so glad you had such great results with your wrist and elbow!!!  We can't wait until we get your grandson fixed up too!  We look forward to seeing you two! Have a great day!!!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "113263872035735157459", "name": "Lori Mcalpin", "time": 1547759259438, "rating": 5.0, "text": "I am 100% pain free now.  That's probably the biggest reason I can recommend you for going here. My neck pain was terrible before I came here. After a few weeks of treatment my life has completely changed. But outside of that there are so many things that this place offers. Doctor mann is a great chiropractor who is trained in many Specialties as well. He has helped me with nutrition and supplements and also with training my kids for their high school sports. I'm pretty sure he has fixed at least one part of everyone in my family! They have a massage therapist who is also great. No extra charge for deep tissue either! I want a massage from them on Facebook! They also sell essential oils now for those of you who are hunting them! Thanks for taking care of us Dr. Mann!!!", "pics": null, "resp": {"time": 1548171392596, "text": "Thank you for taking the time to leave us this review! We're so happy to have met your family. We look forward to seeing you again! Take care!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "114951468781735327382", "name": "Lisa Whisenant", "time": 1509725253990, "rating": 5.0, "text": "I have used Dr. Mann since Dr. Fontes passed away and I really like him. He is always friendly and so is the staff.  They make you feel like you have known them forever and never make you feel uncomfortable. I love the way Dr. Mann does the adjustment. He will always tell you what he is going to do and when I leave I always feel better. I would recommend everyone to try him out.\n\nLisa", "pics": null, "resp": {"time": 1510869096101, "text": "Thank You Ms. Whisenant!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "116802543237620068661", "name": "sheila gooch", "time": 1536786439773, "rating": 5.0, "text": "I was recommended by my friend Wendell to come here for massage and chiropractic treatment. He said he had great results. I found out my insurance pays for my care 100 percent.  I have neck, back, hand, and ankle pain.  I like to stay busy so I need to take care of my body.  I felt better almost immediately My massage was wonderful and I plan on coming monthly!!!", "pics": null, "resp": {"time": 1536786810527, "text": "Mrs. Gooch thank you for taking the time to leave us a google review!  It really helps us get the word out about the success we are having here at Advanced Chiropractic.  Hey if you're paying for insurance you should use it!  It is AWESOME that you had immediate results! I fully expect you to see more improvement in all aspects of your life as we see each other at your future appointments.  Don't work too hard! See you soon!!!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "108909591358348503116", "name": "Audrey Dawn Landry", "time": 1510433155333, "rating": 5.0, "text": "I started using Dr. Mann after he took my previous chiropractor’s place when he passed away.Dr Mann and his staff are wonderful! He always lets me know what his plan of action is for my back pain and always explains things. He’s super nice and very knowledgeable in his field. I highly recommend Dr. Mann for all of your chiropractic needs!", "pics": null, "resp": {"time": 1510869066365, "text": "Thanks Audrey!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "118403035557211679052", "name": "Charles Bacon", "time": 1555022201012, "rating": 5.0, "text": "I was hanging sheet rock when my back went out. My pain went from my back to my hip. After my exam and xray I found out I had hurt a disc and had sciatica.  I was treated by Dr Mann and able to work the next day.  I am now completely pain free.", "pics": null, "resp": {"time": 1555444776970, "text": "Glad we could help!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "104850421201711740142", "name": "Caleb Whitaker", "time": 1559659781585, "rating": 5.0, "text": "Everyone here was absolutely amazing! I had been having lower back and hip problems for a while when someone recommended Dr. Mann! He worked wonders and I left feeling like a new person! HIGHLY recommended!", "pics": null, "resp": {"time": 1559685773320, "text": "Thank you Mr. Whitaker!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "105862205439908542674", "name": "John Greene", "time": 1540331066543, "rating": 5.0, "text": "My old lady is the one who got me here but I guess I'm glad she did.  Been laid up in the house for some time because too much excitement caused my old joints to flare up on me.  Can't say I was the best patient but after one visit I felt much better.  After about 2 weeks I felt 10 years younger.  Ive started to get out a little bit more and can walk a little each day. Im hoping to get back to a little golf here soon.", "pics": null, "resp": {"time": 1556569695782, "text": "Mr. Greene it was a pleasure to get you back to doing the things you love!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "107147427827282571647", "name": "Nichole Robichaud", "time": 1534199726800, "rating": 5.0, "text": "I started seeing Dr Mann after a friend referred me to the clinic.  He took x-rays and showed me what had happened to my back. I had disc damage and arthritis. I have been getting adjusted, have spinal decompression, therapeutic exercises, and heat therapies. The clinic is fantastic as well. The front desk is fun and kind.", "pics": null, "resp": {"time": 1534200341617, "text": "Nichole we love seeing you and the laughter you bring to the office! The whole office starts to smile when you arrive! I am so glad Trish sent you over to us and that the treatment has been successful! We look forward to taking care of you and the entire LG facility in Madison for many years to come.  Spread the word of your success for us!  Thank you again for choosing Advanced Chiropractic for your health and wellness needs!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "113488611707691629532", "name": "Denise Kelly", "time": 1487089392341, "rating": 5.0, "text": "Both of my kids love Dr Mann and his staff.\nHe is very knowledgeable and friendly, he takes the time with you that you need to get on the right track to feeling better! I have nothing but positive things to say about him! Madelyn and Isaac both think he is fantastic!", "pics": null, "resp": {"time": 1507917159358, "text": "Thank you Denise!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "111051161626950491288", "name": "Madelyn Kelly", "time": 1487089827748, "rating": 5.0, "text": "Dr. Mann is not only a great chiropractor, but he has awesome people skills and is super sweet and caring! I enjoy going to see him and his staff, I could go on and on about him, and his work. So ill keep it short and sweet, I would give him more than 5 stars, but that is the max I can give, so ALL THE STARS for you Mister!\nYOU DA BEST DR MANN!!", "pics": null, "resp": {"time": 1507917115553, "text": "Thank you so much Madelyn!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "100986467767901621803", "name": "Sonja Gibson", "time": 1508451846071, "rating": 5.0, "text": "I have a history of neck pain from a car accident and have a job that aggravates my condition. I started seeing Dr. Mann several months ago and have had great results. He is very knowledgeable and friendly. I'm usually nervous about seeing a new doctor but I have felt comfortable with Dr. Mann and his staff since my first visit. Highly recommend!", "pics": null, "resp": {"time": 1509395502766, "text": "Thanks Ms. Gibson!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "114441491131382657787", "name": "Kris Small", "time": 1546554260049, "rating": 1.0, "text": "Okay, So I've dealt with my back pain for many years I've seen chiropractors for many years and I am a licensed medical provider and I am honestly dismayed by this place, I told the D.C. what exactly was wrong and he ignored me. Attempted to realign a part of my body that didn't need it and when he was done after 6 minutes in the room with me he managed to not fix the issue at all now I'm out over $100.00 and absolutely  no relief for a simple pinched nerve, oh but he did set me up on the \"maintenance plan\" which is 3 visits a week at $65 per visit that's $780 a month! That's more then my mortgage for what every single other chiropractor has been able to fix and treat in one visit for under $50.00. Please be wise and heed this as a warning. I do not recommend this place for anyone. They may be a legal D.C. but it's as close to a scam ad you can get legally.", "pics": null, "resp": {"time": 1546567115350, "text": "Kris- you are being dishonest. Health expenses without insurance can be tough, but that is no excuse for your dishonesty in your review. Cameras show your time in the office was approximately 40 minutes; less than 5 minutes in the waiting room- standard for any first visit. Furthermore, we offer the lowest cash prices for new patients in town and also very flexible payment plans.  You were told the prices before you came in. Our cameras even show you were in high spirits until it was time to pay your bill.  And instead of talking to us and working out a payment plan we watched you go into your car and leave this angry review.  Also, what you tried to tell us was ‘wrong’ with you was actually incorrect and probably the main reason you’ve had to deal with your back pain for years instead of actullay being ‘fixed.’ While we have great respect for you and your field, you have to remember- you are not a doctor-  for instance a chiropractor in a car accident should heed the EMT’s instructions because that is what they have been trained to do.  You are also confusing your terminology- maintenance is for wellness patients- and is an optional once a month visit for those who have complete their ‘rehab’ plan to help stay ahead of injuries and reduce wear and tear on the body. Rehab plans are what you were trying to quote. Certain injuries take time to heal and a proper plan for recovery. You are absolutely right Kris- We do things different at Advanced Chiropractic.  We get so many patients who have seen chiropractors that take shortcuts to treat their injuries and the patient continues to deal with pain for years.  Our goal at Advanced Chiropractic is to HEAL the injury. We have found that if we simply make pain go away we are no different than a pain killer or opiate.  However, with our custom made rehabilitation plans you can escape that continued damage, year after year, which is so important as many parts of the body don’t grow back when you repeatedly injure them."}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "105889995286367256613", "name": "Robin Stacy", "time": 1534702137459, "rating": 5.0, "text": "When I start feeling discomfort, Dr Mann has taught me how to manage it: how to move properly and what therapy to do. He is ALWAYS willing to answer my questions. All of the listening and advice has helped tremendously!", "pics": null, "resp": {"time": 1513811185165, "text": "Thanks Mrs. Stacy!  Always good to see you!  I hope you continue having success in your path to wellness!  You are right proper movement is the key to wellness not just going through the motions!  And YES questions are great! They empower the patient! Hope your family is doing well and we will see you next time!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "108660571598649391778", "name": "Hanna Denton", "time": 1534302305088, "rating": 5.0, "text": "Dr. Mann and his staff are very positive, upbeat and helpful. Their office is clean and welcoming. Definitely a great place to go for your chiropractic and massage needs.", "pics": null, "resp": {"time": 1534779980515, "text": "Thank you so much for taking the time to give us a review Hanna.  It is always a pleasure to see you and we love having you at our vendor fair as our essential oils representative!!!  Our office is filled with scents of peppermint, orange, lavender, and thieves (depending on the room).  Looking forward to seeing you again!!!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "114258494104162442844", "name": "Kimberly Smith", "time": 1534349742653, "rating": 5.0, "text": "I used to have really bad back pain. I’ve been to several doctors and this is the only place to give me relief. I was a tough case and it took several weeks but I am finally pain free. Dr. Mann has a nurse practitioner that helped me as well and I also have gotten a few massages. I now have back exercises that help me take care of myself. I only go once a month now to stay feeling good. Now we’re going to see if we can tackle these migraines!", "pics": null, "resp": {"time": 1534780938673, "text": "Thank you for the review Kimberly!  So glad our team could get you such great results!  And it is fantastic that the exercises and lifestyle tweaks have gotten you to self care!  Don't you worry we'll get to work on those migraines now!  Looking forward to seeing you and Mr. Smith soon!!! Take care!!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "111866085324720638438", "name": "Marilyn Reed Reed", "time": 1534189047694, "rating": 5.0, "text": "I recently visited advanced chiropractic for low back pain.  It was so bad I couldn't walk.  He took x-rays and found I have scoliosis.  With the exercises, adjustments, and therapies I received I am now walking pain free.  Very happy with my results", "pics": null, "resp": {"time": 1534189220390, "text": "Thank you so much for the great review Marilyn! You are so sweet! And we are thrilled you are walking again! We love seeing you and look forward to helping you and your family!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "107996396939497169921", "name": "prayerwarrior46", "time": 1534893431901, "rating": 5.0, "text": "I first came to this office when Dr. Clyde was here. I saw him for many years as he was a church friend. He chose Dr.Mann to take over the office. I am happy he did and I still come regularly to the office for all my aches and pains! Give them a call!", "pics": null, "resp": {"time": 1534262869631, "text": "Thank you so much for your kind words!  We see many of Dr. Fontes patients and love them all! We always strive to give the best care to our patients whether it is staying up to date on the latest research or simply taking the time to hear the patient say what they need to be heard.  I hope we can take care of all your health and wellness needs for years to come!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "109842984737501177019", "name": "Greg Linderman", "time": 1544032741148, "rating": 5.0, "text": "I was in an ugly car accident when I first came to see Dr. Mann.  I felt a little banged up right after the accident and then sore the next day.  The accident wasn't my fault so I decided to go make sure I was completely OK.  I went to Advanced Chiropractic and have had a great experience.  The front desk was very helpful. I saw the doctor quickly and had xrays taken that day. My soreness was from whiplash from my accident.  It took several weeks to get me back to 100 percent but I'm thankful I went here. I would recommend that anyone in a car accident go here ASAP for care you can trust.", "pics": null, "resp": {"time": 1545252199806, "text": "Thanks Greg for taking the time to leave this review!  Car accidents are a big deal! They wreck (no pun intended!) the body head to toe!  Even if you don't initially have any pain that doesn't mean there isn't any damage.  Being hit by a 1000lb object even at 5 mph does serious damage to the body."}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "111023248337571433236", "name": "Justin Fagan", "time": 1568838034448, "rating": 5.0, "text": "I came here on a whim never have been to a chiropractor before and i must say that the experience that i received when i walked through the door was nothing short of excellent. Whitney was great and extremely helpful with getting me set up and taken care of especially at a last min call and Gia also done a wonderful job takin care of Me in conjunction with Whitney.. I see Dr Manns name quite often over social media and when you google chiropractor its one of the first to pop up and theres a reason one of the most professional individuals I've ever met , explained everything he was doing to a t and offered mounds of information for things that he had found with my back .. greatly recommend Dr Mann and his staff to get you situated .", "pics": null, "resp": null, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "106934742413301188104", "name": "Mrs Lamb", "time": 1534178341014, "rating": 5.0, "text": "I came because of my severe neck pain. I feel so much better now! They gave me neck exercise, neck decompression, and adjustments. Now I am a wellness patient. Love this place and the staff! Give them a call!", "pics": null, "resp": {"time": 1534179035966, "text": "Mrs. Lamb we are so glad we could help! Keep up the good work! And thank you for the review! It helps us get the word out!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "104714024507894178286", "name": "Wade Dinsmore", "time": 1522183857862, "rating": 5.0, "text": "Dr. Mann is wonderful and his staff is so courteous and kind.  Some places treat you like a number, not a living breathing person, and this is a welcomed change.  I recommend them to all who are looking for a change.", "pics": null, "resp": {"time": 1528578940773, "text": "Thank you!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "101195332500103732289", "name": "Tammy Burkett", "time": 1506637699877, "rating": 5.0, "text": "Dr.  Mann and staff were great. I was nervous about going to a chiropractor as I am one who tends to tense up when past chiropractors twist my on my neck.  Avoided going to chiropractor for that very reason. However,  Dr.  Mann made me feel at ease and was able to do adjustments and treatments without having to do any twisting.", "pics": null, "resp": {"time": 1507916490028, "text": "So glad you had such great results!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "102561945415778566802", "name": "kelsey johnson", "time": 1538087265481, "rating": 5.0, "text": "I was having back pain and decided it was finally time to do something about it.  So I did my Google search and found this to be a very popular place. They accepted my blue cross blue sheild insurance too so that was nice.  They were able to work me in the next day. My first appointment was less than an hour.   All my worries were examined and questions answered. I even recieved treatment in that hour. The next day they had my entire care plan cost on paper including how long it would most likely take to meet my goals. My next visits were less than 30 minutes in the office TOTAL.  That's fantastic considering my eye appointments go for about 90! I just finished my first week of rehab and I'm already noticing improvement! Definitely pleased so far and will be  recommending to my friends and family!!!", "pics": null, "resp": {"time": 1537212748924, "text": "Thanks Kelsey!  Thank you for taking the time out of your day to leave us a review! So glad to hear that you are having good results!  We always want to see results within 2 weeks to make sure your individually made care plan is effective!  We look forward to seeing you again and meeting your family! Have a great week!!!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "110256420852991725351", "name": "Cory Truett", "time": 1484325005906, "rating": 5.0, "text": "Dr. Mann is an extremely knowledgeable and sincere chiropractor. All the way from his thorough exam from when I first came in, to the recovery plan he put me, he has been amazing. I highly recommend a visit if you haven't been yet.", "pics": null, "resp": {"time": 1507917260850, "text": "Thanks Cory!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "101575948064222543375", "name": "Kellie Terry", "time": 1517872398039, "rating": 5.0, "text": "What a great experience!  Everyone was so nice from the moment you walk in.  The facility is clean and modern looking.  Dr Mann gave me some exercises for my neck that really seem to help.", "pics": null, "resp": {"time": 1518555212770, "text": "Thank you Ms. Terry!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "100990526226344982244", "name": "Sarah Killian", "time": 1534283603337, "rating": 5.0, "text": "I get really bad headaches. I’ve tried over the counter medicine and it did nothing. Went to a specialist and after several weeks still no significant results. Went to a holistic doctor- still nothing. I had been diagnosed with everything from migraines to fibromyalgia. A friend of mine told me to try her Chiropractor because she had great results for her low back. They take insurance (I didn’t know that at the time) so that was helpful. My first visit I Came in and the front desk was very helpful. I soon met Dr. Mann and after listening to my history he took some x-rays. He examined them and decided it was safe to begin treatment. Said what I actually had was a cervicogenic headache and that he was confident we could reduce the number of headaches I was having.  Within the week my headaches were almost totally gone. After two weeks of no headaches I am now down to just monthly visits to make sure they don’t come back. My only regret is that I didn’t go sooner. Thanks Dr. Mann!", "pics": null, "resp": {"time": 1534781120105, "text": "Thank you for choosing us for your healthcare needs Ms. Killian!  Headaches can be the biggest pain (no pun intended) .  I'm glad our team here at Advanced Chiropractic was able to get you sleeping and working like normal again.  We enjoy every visit with you!  Good luck with the new job and we'll see you soon!!!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "101508722719666873638", "name": "Terri Richards", "time": 1546743737382, "rating": 5.0, "text": "I came for shoulder and neck pain.  You never spend much time waiting here! The front desk is very kind, and Dr. Mann does a lot more than just crackin bones!  I also received exercises, stretches, and ergonomics tips for self treating at home.  He showed ways to tackle things differently so that I don't keep reinjuring myself.  I also keep doing my exercises that I was given to keep going pain free.  Tight shoulders are gone too!  I was skeptical at first because I had never been to a chiropractor before but the pain and even the numbness are completely gone now.  I really appreciate all the help! I'll probably try their massage therapist next! Highly recommend to anyone who tired of being achy and in pain!!!", "pics": null, "resp": {"time": 1546895837656, "text": "We are glad you had a good experience Terri!  Neck and shoulder pain is extremely common now and many people just ignore it!  Our rehabilitation program and ergonomics coaching is a major part to our success!  We look forward to seeing you soon!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "109393088594601279510", "name": "TruArchery (Brandon Truss)", "time": 1534273223901, "rating": 5.0, "text": "The only Chiropractic office you’ll ever want to be in! I had a severe back injury in high school. I also work with my hands and enjoy active life of hunting and playing with my son.  I had really bad back pain that made it hard for me to do all that. I went and saw Dr. Mann and I was back doing everything I wanted to do in no time. We are good friends now and have known each other for a long time. This is place you want to go for your healthcare! My wife and her mother also go here. They like getting massages from the therapist and seeing Dr. Mann on the same visit.  Now that I am pain free my visits now include nutritional counseling so I can learn to healthy and shed a little weight. This place really does it all!", "pics": null, "resp": {"time": 1507916989928, "text": "Thanks Brandon!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "116860781520446923505", "name": "Denise Jackson", "time": 1518973263382, "rating": 5.0, "text": "Such a nice office! Everyone is always so friendly and Dr. Mann is so kind.  My whole family goes now. Highly recommend!", "pics": null, "resp": {"time": 1520286195537, "text": "Thanks Mrs. Jackson!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "114056022684852625943", "name": "Isabella Sartain", "time": 1539631962885, "rating": 5.0, "text": "My first visit to Advanced Chiropractic was today.  I have never been to a chiropractor before so I did some research and found this place.  It is by far tbe best reviewed office in Decatur so I decided to give it a try.  It is a very nice office.  I was there for about an hour total.  I felt like that was pretty good since I had to fill out some paperwork since it was my first visit.  They said my future visits will be 30 minutes or less.  The visit cost about $20 with me insurance.  Dr. Mann seems very 'up to date' in his field.  Also, the building is very easy to find since it is right on the beltline. Overall very impressed so far!!!", "pics": null, "resp": {"time": 1539633493326, "text": "Ms. Sartain it was a pleasure to meet you today!  We are so glad you had a pleasant experience in our office today!  Dr. Mann works very hard to stay up to date on the latest proven successful methods of treatment and that is why we were recently chosen as Decatur's best chiropractic clinic!  And yes many insurance policies have great chiropractic coverage!    We look forward to seeing you on your next visit!  Thank you again for choosing Advanced Chiropractic for your rehab and wellness needs!!!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "102240639912195803837", "name": "Walker Snyder", "time": 1551491475747, "rating": 5.0, "text": "Dr. Mann is informative and accommodating. His staff is very helpful with everything and I won’t be going anywhere else.", "pics": null, "resp": {"time": 1552318481433, "text": "Thanks Walker! We'll see you soon!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "100522230292869620996", "name": "Richard Garlen", "time": 1556212680757, "rating": 5.0, "text": "Had gone to long with out an adjustment, read reviews, and he is in my insurance network.  On maintenance now have gained greater mobility.", "pics": null, "resp": {"time": 1556569551006, "text": "Thank you Mr. Garlen! Glad we could help you!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "115189435459427479367", "name": "Trisha Davis", "time": 1499449691817, "rating": 5.0, "text": "Dr. Mann is a very attentive and brilliant chiropractor. I've had head, neck, and back pains for years and after seeing him, I rarely have those pains anymore. If I have a slight pain, I just do the simple exercises that Dr. Mann showed me how to do, and the pain is gone! He's extremely intelligent in what he does. I would recommend him to anyone and everyone I know. This Mann knows his stuff!\n:)", "pics": null, "resp": {"time": 1507916731208, "text": "Glad we could we help Trisha!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "114610581633110351542", "name": "Candi Crow", "time": 1560879032291, "rating": 5.0, "text": "Absolutely wonderful! Love the staff and Dr. Mann. I can actually make it through the day without being in pain!", "pics": null, "resp": {"time": 1560895369172, "text": "Thanks you so much Candi! We love seeing you and are thrilled life has improved for you!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "105466814241858282927", "name": "Janet Cavender", "time": 1508460903723, "rating": 5.0, "text": "A colleague recommended Dr. Mann to me.  I'm so thankful because he is knowledgeable and teaches his patients to maintain and strengthen muscles with exercises/stretching.  He has a friendly staff too.", "pics": null, "resp": {"time": 1509395438451, "text": "Thank you for your kind words Ms. Cavender!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "109119731713506330056", "name": "Roxane Williams", "time": 1532989214552, "rating": 5.0, "text": "Very helpful with the issues I am having. The exercises work great. Staff is very polite.", "pics": null, "resp": {"time": 1533048433845, "text": "Thank You Ms Williams!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "114094722186838729050", "name": "Ashley Smith", "time": 1534021011834, "rating": 1.0, "text": "DO NOT LET THIS MAN TOUCH YOU!!!! I've been going to chiropractor for 10 years have always felt much better afterwards. After leaving his office I've been in bed for days from pain.  Every other chiropractor reviews your x-rays first then does an adjustment. He never looked at my x-rays and wanted me to come back in to get my results. I will be getting my x-rays that he took and take them to a different chiropractor to see what he messed up.", "pics": null, "resp": {"time": 1534170987940, "text": "Hi Ashley, we believe you have mistakenly reviewed the wrong office- we have no record of an Ashley Smith ever being treated in our facility. At Advanced Chiropractic, our patients' x-rays are always reviewed with the doctor on the first visit before treatment begins to ensure a safe, quick recovery.  'First do no harm' is a rule we strictly adhere to- as should all doctors. We are so sorry you received a poor standard of care at another clinic. Please give us a call at (256)351-8500 and we will help you recover from the injury you have endured.\nAlso, when you retrieve the x-rays from the other office you visited we'll review them for no charge- just mention this post.."}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "104846140950787615697", "name": "Big D's Shade Tree", "time": 1556114521298, "rating": 5.0, "text": "Friendly and caring staff. They really are concerned with your health and wellbeing.", "pics": null, "resp": {"time": 1556569517772, "text": "Thanks for the review!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "115214858434891361805", "name": "Cala Jones", "time": 1516737646992, "rating": 5.0, "text": "Found a place that does prenatal messages and adjustmemts. Thank goodness! It is so relaxing and helpful! Dr. Mann and and his staff our super friendly and helpful!", "pics": null, "resp": {"time": 1517871273602, "text": "Thanks Cala!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "111601088342274273099", "name": "Carol Spruill", "time": 1534178937552, "rating": 5.0, "text": "I found Dr Mann on line and took a chance.  I’m very pleased with his treatments and he has helped me tremendously.  I’m not going anywhere else!", "pics": null, "resp": {"time": 1534179072023, "text": "Mrs. Spruill you are the best! Thank you so much!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "114755300926673282730", "name": "Decatur Beltline", "time": 1504192671921, "rating": 5.0, "text": "I've been to several chiropractors in town. This place is definitely way ahead in treatment methods. Highly recommend", "pics": null, "resp": {"time": 1534179385802, "text": "Thank You And Your Staff! Always A Pleasure Seeing You And Your Employees!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "110733010395993182539", "name": "Ross Batiste", "time": 1517686662383, "rating": 5.0, "text": "Dr. Mann is great for low back adjusting. He has the right technique and strength to get me lined up every time!", "pics": null, "resp": {"time": 1517707556252, "text": "Thanks Ross!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "107091081558876877869", "name": "Rebecca Fontes", "time": 1527610767529, "rating": 5.0, "text": "So proud that Dr. Mann took over Fontes Chiropractic! He uses the same approach Dr. Clyde used and has added many new things that speed up recovery times! Highly reccommend!", "pics": null, "resp": {"time": 1528578913967, "text": "Thank you so much!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "108164375549198104879", "name": "Nikki Nichols", "time": 1534260323370, "rating": 5.0, "text": "Great staff, amazing massage therapist, and the best adjustments in town by Dr. Mann! If you need anything you should give them a try,  all around the best!", "pics": null, "resp": {"time": 1534261075601, "text": "Thanks Ms. Mason!  Happy to hear you enjoy your massages here!  Keep checking our monthly specials and make sure to check out our Facebook page!  We give a free one hour massage away each month to followers who share the massage give away post!  That's a $60 freebie!!!  Don't work too hard and we'll see ya next time!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "112959465453513212677", "name": "Winnie Tepper", "time": 1508429297855, "rating": 5.0, "text": "I have had a fracture in my spine and Dr. Mann helps me stay pain free more than anyone else ever has. He is great!", "pics": null, "resp": {"time": 1509395516145, "text": "Thank you!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "113087324936699448601", "name": "A Byars", "time": 1567699323071, "rating": 5.0, "text": "Dr. Mann does a thorough job of finding the problem and fixing it.  The staff is great and caring.", "pics": null, "resp": {"time": 1568147121341, "text": "Thank you for leaving us a review Mr. Byars!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "108279097090248956172", "name": "John Riley", "time": 1534187652223, "rating": 5.0, "text": "I came to advanced chiropractic for nerve pain.  I recieved adjustment, exercises, heat therapy in my visits and have seen great improvement.  My visits are less.than $8", "pics": null, "resp": {"time": 1534188198145, "text": "Mr. Riley we happy you have gotten such great results! We look forward to seeing you again! Have a great day!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "102178050252526368139", "name": "Melissa Brown, Melissa", "time": 1509643099589, "rating": 5.0, "text": "As an educator, I appreciate Dr. Mann's emphasis on how to self-treat at home between visits as well as how he explains his approach and the techniques he uses.  In addition, he and his staff are efficient and accommodating, which makes it easier to fit visits into my busy schedule.", "pics": null, "resp": {"time": 1510869114707, "text": "Thank You!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "108784126445890265104", "name": "Bill Tepper", "time": 1508362894276, "rating": 5.0, "text": "I have arthritic and.surgical medical history.  I have gained confidence in Dr. Mann's knowledge and ability to analyze and solve my occasional pain problems.  He has a gentle but positive manner.", "pics": null, "resp": {"time": 1509395561337, "text": "Thank you!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "106216812984553518100", "name": "Jason owens", "time": 1517524571482, "rating": 5.0, "text": ".... Today was my first time to visit Dr. Mann. The exam was very thorough and X-rays were performed. Office staff was extremely helpful and the massage therapist was wonderful.", "pics": null, "resp": {"time": 1517707657395, "text": "Thanks Jason!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "103857113711551034642", "name": "Jessica Hickerson", "time": 1513654082185, "rating": 5.0, "text": "Great experience - as a student, my neck is always sore after finals but it felt so much better after our session. 10/10, would recommend!!!", "pics": null, "resp": {"time": 1514934860728, "text": "Thanks Jessica!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "117073262330629375559", "name": "Mika Stacy", "time": 1496696372619, "rating": 5.0, "text": "I had a herniated disc with an annular tear in my neck and was in excruciating pain. Dr.Mann was extremely knowledgeable and helped me get everything back under control. He and his staff are wonderful to work with !", "pics": null, "resp": {"time": 1507917013191, "text": "Glad we could help Mika!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "106791779752042434793", "name": "Zac Cross", "time": 1542064084667, "rating": 5.0, "text": "I'm leaving this review because everyone needs to know about this place.  I work in construction and one day I was laying some brick and my back locked up on me. Worst pain I've ever felt in my life.  Went and had it looked at and was told I needed physical therapy. Month later not much better.  Then I went to an orthopedist in Huntsville.  Said I needed surgery.  I got to talking to a friend and he hsaid I really oughta give Dr. Mann a try. I'm sure glad I did.   In about 2 weeks I was feeling a lot better. In a month I was pain free.  I was told by 2 people I absolutely had to have surgery.  Been 3 months now with no issues and with my insurance my care cost harldy nothing. Thanks Dr. Mann", "pics": null, "resp": {"time": 1556569663297, "text": "Zac we are happy we could get you working again!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "114101660857045156775", "name": "Shane Jones", "time": 1544474465575, "rating": 5.0, "text": "Great people to get help from. I go weekly and have great results", "pics": null, "resp": {"time": 1517707638733, "text": "Thanks Mr. Jones!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "118296915184352180616", "name": "Rachel Steiner Freeman", "time": 1499735342719, "rating": 5.0, "text": "Dr. Mann is extremely knowledgeable and has great bedside manners. I love the atmosphere of his office and I left feeling 100%. I would highly recommend for anyone needing chiropractic care!", "pics": null, "resp": {"time": 1507916682009, "text": "Thanks Rachel!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "109762540557894814796", "name": "Elijah Cole", "time": 1567715900531, "rating": 5.0, "text": "Great place to go! Had back problems and as soon as I walked out I felt a difference!", "pics": null, "resp": {"time": 1568147100770, "text": "Great to see you Elijah. Thanks for taking the time to leave a review!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "101723812861409339060", "name": "JCDogg911", "time": 1532556262009, "rating": 5.0, "text": "Helped so much with my lower back pain. Friendly and caring about their patients. Always reccomend.", "pics": null, "resp": {"time": 1532620427713, "text": "Thank You!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "117053469103010917321", "name": "Shelly Huggins", "time": 1518646774696, "rating": 5.0, "text": "Absolutely amazing place! Very friendly staff and very professional! I went for a free consultation and I can not wait for next appointment on Monday!", "pics": null, "resp": {"time": 1520286214394, "text": "Thank you Ms. Mason!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "100287753132078801553", "name": "gary gordon", "time": 1534174361745, "rating": 5.0, "text": "Everyone at a\nAdvanced Chiropractic is courteous and professional Procedure is explained and all my questions are answered to my satisfaction.", "pics": null, "resp": {"time": 1534176552312, "text": "Mr. Gordon it has been a pleasure getting to know you! Thank you so much!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "111538273930341347838", "name": "robert shelden", "time": 1534175350856, "rating": 5.0, "text": "Great experience, always willing to suggest home care and excercise tips for self care.", "pics": null, "resp": {"time": 1534176577651, "text": "Thanks Mr. Shelden! I’m glad we could help! It’s always a treat to see you and your family. Let us know if you have any more exercise questions! Safe travels!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "113845747750145949864", "name": "Liesel LAND", "time": 1534192297121, "rating": 5.0, "text": "I am a dental hygienist and have problems with my low back. I see dr.mann regularly for adjustments and he keeps me going.  He also takes care of my family and my coworkers!", "pics": null, "resp": {"time": 1534192535804, "text": "Mrs. Land we LOVE seeing your family and coworkers.  The dental field has a very tough job in that the positions you have to maintain for long periods of time to deliver the quality care that your office gives are very hard on the low back!  We are proud to keep you all going strong and working!  Tell everyone we said hello and thank you for using us for your health and wellness needs!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "112798133621331948475", "name": "Dr. Michael Bowerman", "time": 1517686414936, "rating": 5.0, "text": "Dr. Mann and his staff were extremely knowledgeable and treated me like I was the only parient in the office. I left feeling amazing and would definitely recommend them!", "pics": null, "resp": {"time": 1517707572054, "text": "Thanks doc!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "106529138237296155071", "name": "Jo Lance", "time": 1534191256573, "rating": 5.0, "text": "I came to see Dr. Mann for lower back and hip adjustments. I have had great results!", "pics": null, "resp": {"time": 1534191464923, "text": "We are so excited that we have been able to give you good results!  Adjustments go a long way! Looking forward to seeing you again!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "107602462681953881442", "name": "Tyler Fuqua", "time": 1500334450460, "rating": 5.0, "text": "Great response time. And Dr. Mann really knows his stuff.", "pics": null, "resp": {"time": 1507916668432, "text": "Thank you!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "113359778575494424676", "name": "David Thompson", "time": 1510776677010, "rating": 5.0, "text": "I was in horrible pain due to bulging disks. After working with Dr. Mann I am now pain free. I love him and his work!", "pics": null, "resp": {"time": 1510869021705, "text": "Thanks David!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "117405203698149881434", "name": "Kelli Berryhill", "time": 1487176815833, "rating": 5.0, "text": "I was looking for guidance on wellness care and what to do to stay healthy.  Dr. Mann showed me some great simple changes and I feel better than ever!!!", "pics": null, "resp": {"time": 1514934880065, "text": "Thanks Kelli!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "112889888199111941730", "name": "Heath Alford", "time": 1517685298350, "rating": 5.0, "text": "Dr. Mann and his staff provide excellent chiropractic services in a clean and welcoming environment.", "pics": null, "resp": {"time": 1517707584812, "text": "Thanks Heath!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "113374922931127890402", "name": "Shashwat Sigdel", "time": 1526336460710, "rating": 5.0, "text": "The best chiropractor around! This place is awesome!", "pics": null, "resp": {"time": 1527176614549, "text": "Thank You!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "115488826284399795958", "name": "Varsity Dance", "time": 1497323187422, "rating": 5.0, "text": "Thanks so much for taking care of our team! Dr. Mann is the best!", "pics": null, "resp": {"time": 1507916951716, "text": "Thanks girls! Good luck to you all!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "115977126019174742702", "name": "Josh Weber", "time": 1543877977102, "rating": 5.0, "text": "They have a wonderful staff and get the job done", "pics": null, "resp": null, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "108369527409175242427", "name": "Haylee Blackmon", "time": 1483436653430, "rating": 5.0, "text": "Dr. Mann is the best! He's helped me so much with my knee and back pain! Highly recommend", "pics": null, "resp": {"time": 1507917202364, "text": "Thanks!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "104617486356968444038", "name": "Lori Ready", "time": 1498154750204, "rating": 5.0, "text": "Great chiropractic care and rehab...takes care of me and now my hubby!", "pics": null, "resp": {"time": 1507916847319, "text": "Glad we could help!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "105643792830034407057", "name": "Amanda Lamb", "time": 1487176076581, "rating": 5.0, "text": "No more knee pain! Kept me from having surgery! Thank you Dr. Mann!", "pics": null, "resp": {"time": 1507917068733, "text": "Thanks Mrs. Lamb!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "101399690081508750722", "name": "Sandy Scott", "time": 1533922862470, "rating": 5.0, "text": "Great local chiropractor! He helps me with the pain my scoliosis causes.", "pics": null, "resp": {"time": 1534171306374, "text": "Thank you Mrs. Scott!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "101191042964395263196", "name": "Selena Turner", "time": 1509318907291, "rating": 5.0, "text": "Wonderful office, friendly staff, and Dr. Mann is as caring of a doctor as they come.", "pics": null, "resp": {"time": 1509394801140, "text": "Thanks Ms. Turner!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "105812759240258814172", "name": "Matt Miller", "time": 1509216476932, "rating": 5.0, "text": "I have an old football injury that has always given me problems.  Dr. Mann has helped me continue doing the things I love.", "pics": null, "resp": {"time": 1509394838395, "text": "Thanks Mr. Miller!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "110026431326407605807", "name": "Jr Smith", "time": 1499701219640, "rating": 5.0, "text": "Had a lot of lower back pain but he is fixing the problem and showing me how to prevent them for next time. Great people", "pics": null, "resp": {"time": 1507916702318, "text": "Thanks Jr!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "109611948128753429013", "name": "Vicki Wood", "time": 1517436808231, "rating": 5.0, "text": "Love!!!! Love!! This place!! Knowledgeable!! Professional!! You will not be DISAPPOINTED!!", "pics": null, "resp": {"time": 1517707545066, "text": "Thank you so much!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "112533995733694195390", "name": "Bella Tylicki", "time": 1497984565846, "rating": 5.0, "text": "Dr. Mann had helped me so much with my neck and back pain! very friendly, knowledgeable, and the only chiropractor i'll ever see again!", "pics": null, "resp": {"time": 1507916892221, "text": "Thank you Bella!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "107753269353642971108", "name": "Brittnie Cagle", "time": 1509072814236, "rating": 5.0, "text": "Great experience, super helpful and informative!!! Highly recommend.", "pics": null, "resp": {"time": 1509394852850, "text": "Thanks Brittnie!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "116102335193196522516", "name": "robert hollis", "time": 1508361066672, "rating": 5.0, "text": "Dr. Mann and his staff are super friendly and helpful!", "pics": null, "resp": {"time": 1509395578183, "text": "Thank you!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "102713964479985211076", "name": "Laura English", "time": 1498238163443, "rating": 5.0, "text": "Dr. Mann is so kind and attentive, and the staff is fantastic!", "pics": null, "resp": {"time": 1507916802944, "text": "Thank you Laura!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "111294844127672997800", "name": "cherish pharez", "time": 1515863995566, "rating": 5.0, "text": "Wonderful place! He meets all your needs!!", "pics": null, "resp": {"time": 1517871316544, "text": "Thanks Cherish!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "101800129704315915721", "name": "SHIRLEY COYLE", "time": 1534174006283, "rating": 5.0, "text": "Fixed my hip good as new!", "pics": null, "resp": {"time": 1534174361186, "text": "Thank you Ms. Coyle!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "110141981593583792530", "name": "Cherish Stacy", "time": 1533922488136, "rating": 5.0, "text": "Dr. Mann is now the only doctor i’ll see for my headaches and back pain.", "pics": null, "resp": {"time": 1534171277293, "text": "Thanks Cherish!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "106320879837847851478", "name": "Rebecca Widmar", "time": 1572554600935, "rating": 5.0, "text": "Staff is awesome!", "pics": null, "resp": {"time": 1573073511753, "text": "Thank you for taking the time to leave us a review! See you next time!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "105589161048820226139", "name": "Danny Carroll", "time": 1520366056982, "rating": 5.0, "text": "I'm not sure I can recommend Mr. Mann and his team highly enough. Very friendly and professional. If you live in the Decatur area and need a chiropractor, give these guys a call.", "pics": null, "resp": {"time": 1527176719488, "text": "Thank you Mr. Carroll!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "115629780600466083001", "name": "Marc Cera", "time": 1507573888767, "rating": 5.0, "text": "The service is excellent.", "pics": null, "resp": {"time": 1507916403064, "text": "Thank you!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "113179647297073700531", "name": "Jacob Jones", "time": 1527876349669, "rating": 5.0, "text": "I go once a month and never felt better!", "pics": null, "resp": {"time": 1528579061748, "text": "Thank you!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "104770601987387786299", "name": "AJ Thakore", "time": 1526335984854, "rating": 5.0, "text": "Best chiropractor in Alabama!", "pics": null, "resp": {"time": 1527176626087, "text": "Thank you!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "100920355967496393384", "name": "Ak Murthy", "time": 1526338294290, "rating": 5.0, "text": "Dr. Mann is friendly and cares a lot about his patients!", "pics": null, "resp": {"time": 1528579129110, "text": "Thank you!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "103035822998956785023", "name": "Jonathan Dunwoody", "time": 1517542107610, "rating": 5.0, "text": "Dr. Mann is the best!", "pics": null, "resp": {"time": 1517707614536, "text": "Thanks Jonathon!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "101026331122264156782", "name": "Cathy South", "time": 1515353566045, "rating": 5.0, "text": "Best office in town!", "pics": null, "resp": {"time": 1517871342148, "text": "Thanks Cathy!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "101792148513170104010", "name": "Marsha Kelly", "time": 1483373344901, "rating": 5.0, "text": "Dr. Mann is the best!", "pics": null, "resp": null, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "116606453314705008697", "name": "thomas mann", "time": 1508287861374, "rating": 5.0, "text": "My favorite chiropractor!", "pics": null, "resp": {"time": 1508302822485, "text": "Thanks!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "109762630053300408234", "name": "Sherri Mann", "time": 1485901130086, "rating": 5.0, "text": "He's the BEST!", "pics": null, "resp": {"time": 1507917275984, "text": "Thanks!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "105699025624636080405", "name": "Mandy Burks", "time": 1497322774956, "rating": 5.0, "text": "Best chiropractor ever!!", "pics": null, "resp": {"time": 1507916968813, "text": "Thank you Mandy!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "113717721904274283439", "name": "ashley dunwoody", "time": 1515285726109, "rating": 5.0, "text": "Dr. Mann is awesome!!", "pics": null, "resp": {"time": 1517871367509, "text": "Thanks Ashley!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "112134792351500305463", "name": "Bonnie Roberts", "time": 1532551001398, "rating": 5.0, "text": "Great clinic!", "pics": null, "resp": {"time": 1532551149062, "text": "Thank You Ms. Roberts!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "101853658868199881862", "name": "diana Smith", "time": 1627590878460, "rating": 5.0, "text": "After weeks of dealing with severe pain in my back,  I started looking for help. I found Advanced Chiropractic and am so thankful I did! After just a few treatments,  my back started feeling better.  Dr. Mann and all of his staff are fantastic!", "pics": null, "resp": null, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "110065580994939242401", "name": "Denise Bishop", "time": 1627607300643, "rating": 5.0, "text": "I found Advanced Chiropractic by accident when I purchased a Groupon for a 90-minute deep tissue massage, not knowing at the time that I would need Dr. Mann’s services as well. Their new massage therapist is aah-mazing and my first chiropractic experience has been great. The staff is very friendly and attentive.", "pics": null, "resp": null, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
{"user_id": "105873030884120035571", "name": "Erica Esteban", "time": 1536680870290, "rating": 5.0, "text": "(Translated by Google) I am really happy and grateful to Dr. Mann because he is helping me a lot with my neck problem. I feel much better.\n\n(Original)\nEstoy realmente contenta y agradecida con el doctor Mann porque me esta ayudando mucho con el problema de mi cuello me siento mucho mejor.", "pics": null, "resp": {"time": 1536693427178, "text": "Thank you so much for taking the time to leave a review!  We are so glad to hear our Advanced Chiropractic team was able to give you a positive experience and help you!  It was nice meeting you and your family! You've been a great patient and we look forward to your next appointment! Have a great week!!!"}, "gmap_id": "0x886284764f6fef61:0x2058cd07a41eab07"}
