{"user_id": "114678821236381312632", "name": "Michael Linzey", "time": 1629118326616, "rating": 5.0, "text": "Good place for new and used musical instruments. Lessons on playing different types of instruments.", "pics": null, "resp": null, "gmap_id": "0x8889cb082e6190f9:0x4750615dc633ab75"}
{"user_id": "107824580450254157872", "name": "Robyn Blackmon", "time": 1600029636780, "rating": 5.0, "text": "Moved and tuned my piano. Tony is awesome and the piano sounds better than it has in years!", "pics": null, "resp": {"time": 1600457730934, "text": "Thank You . Glad it Sounds good"}, "gmap_id": "0x8889cb082e6190f9:0x4750615dc633ab75"}
{"user_id": "101643261206721189816", "name": "Todd Miller", "time": 1591754583718, "rating": 5.0, "text": "I learned how to play here as a  young child, and now I'm a pro-level guitar player in my 40s.  Glad to see he's still here.  I didn't take lessons directly from Tony back then, but he arranged recitals for the students, and gave me my first experience playing in front of people.  My favorite place in Cullman", "pics": null, "resp": {"time": 1594327481718, "text": "Thank you for your review"}, "gmap_id": "0x8889cb082e6190f9:0x4750615dc633ab75"}
{"user_id": "104258974777809054152", "name": "dexter leigeber", "time": 1595260985942, "rating": 5.0, "text": "Very helpful and nice, low prices on new and used music equipment", "pics": null, "resp": {"time": 1595889654306, "text": "Thanks for the nice review. Have a great week"}, "gmap_id": "0x8889cb082e6190f9:0x4750615dc633ab75"}
{"user_id": "117769245444501482793", "name": "Tina Cagle Herfurth", "time": 1590576024547, "rating": 5.0, "text": "Tony is a great teacher with incredible patience and the ability to break things down in a way you can understand them. He is willing to work with you on the things that interest you.", "pics": null, "resp": {"time": 1594327491501, "text": "Thank You"}, "gmap_id": "0x8889cb082e6190f9:0x4750615dc633ab75"}
{"user_id": "101576683333619158054", "name": "Keith Sellers", "time": 1590554625656, "rating": 5.0, "text": "The very first vintage guitar I learned to play had gotten a broke tuner. To my surprise Tony had a spare one and it was restored to original. Didn’t know where I was going to find one.", "pics": null, "resp": {"time": 1594327528258, "text": "Glad we could help You. Thanks for The Review"}, "gmap_id": "0x8889cb082e6190f9:0x4750615dc633ab75"}
{"user_id": "108892743183662426399", "name": "Paul Reynolds", "time": 1616616961612, "rating": 4.0, "text": "Very friendly and helpful", "pics": null, "resp": {"time": 1626987243431, "text": "Thank you"}, "gmap_id": "0x8889cb082e6190f9:0x4750615dc633ab75"}
{"user_id": "111207516825511375963", "name": "Gary Swann", "time": 1600367902327, "rating": 4.0, "text": "Great place nice thing nice people", "pics": null, "resp": {"time": 1600457696416, "text": "Thank You"}, "gmap_id": "0x8889cb082e6190f9:0x4750615dc633ab75"}
{"user_id": "107099515188146994554", "name": "Tigerchris 16", "time": 1462287045870, "rating": 5.0, "text": "Excellent store and music school very nice people and they are very helpful with what you need.", "pics": null, "resp": null, "gmap_id": "0x8889cb082e6190f9:0x4750615dc633ab75"}
{"user_id": "108073493475397643570", "name": "donnie collins", "time": 1492422826120, "rating": 5.0, "text": "Learn how to play .", "pics": null, "resp": null, "gmap_id": "0x8889cb082e6190f9:0x4750615dc633ab75"}
{"user_id": "105302779010688233270", "name": "john driver", "time": 1461854973870, "rating": 5.0, "text": "Great music lessons", "pics": null, "resp": null, "gmap_id": "0x8889cb082e6190f9:0x4750615dc633ab75"}
{"user_id": "106709489047840774248", "name": "Austin Wallace", "time": 1626830170913, "rating": 5.0, "text": "100% recommend! Our dining room table turned out better than we could have imagined! Great quality, reasonable, responsive and kind! All around great work and great to work with! Posted before and after photos!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN6q63_lqKt6PxDXMYhd7tjnkQiQQeesoz37Nc_=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPyyfQVP-k1fYoEK0KKGf2Gs6aujthuRHTZGAjA=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMgfjMVq4GA8zk6sYt4Uu2sp965R3vGE2Rnja5E=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO2WtqiU1PL-srD1fF6GKr8s9_ahOLNupU8a2_B=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMtThqTTmQhDVXUVY218ydsH6Q0Dm2n87vamL9F=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "110502607011042886276", "name": "Susan Green", "time": 1623871700746, "rating": 5.0, "text": "I had my very loved, very scarred kitchen table, bar stools and kitchen chairs redone by Mr. Moates.  The work he did is incredible.  They are absolutely beautiful and now have a new life for many more family dinners and gatherings.  If this review had 6 stars I would give it to him for the quality of work that he does.", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "117660774345622025765", "name": "Jennifer and Christopher Marquis", "time": 1622496017142, "rating": 5.0, "text": "I had a favorite solid wood buffet and set of chairs that I wanted to co-ordinate with our large round dining table as we are down-sizing our living space. The tops of the chairs and buffet were originally dark brown, almost black lacquer finish that I found very difficult to keep clean most of the time. So I asked Mr. Moates if he could help me out. And boy did he exceed my expectations tenfold! The buffet turned out beautiful, he was able to lighten it to the exact shade of brown that brings out all of the lovely wood grain I had hoped for. Now I have beautiful butcher block style buffet and matching dinette set that my family can enjoy for years to come. Thank you, Mr. Moates!!", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "115281326980054339170", "name": "Bethany Rose", "time": 1619719949969, "rating": 5.0, "text": "My table was completely restored to it’s original state thanks to the expertise and handiwork by Mr. Allen. Not only did he restore my coffee table – matching the wood stain and finish with precision – but it the job was completed in less than 24 hours. I could not be more pleased with the outcome!", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "110867024114951760739", "name": "walter kelley", "time": 1622385268835, "rating": 5.0, "text": "Mr. Moates repaired a drawer whose wood had been chipped, scuffed, and badly damaged by movers.  He completely restored the drawer's appearance.  He does beautiful work, and we are delighted with the result!", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "104765469410353818812", "name": "B 320", "time": 1616608589928, "rating": 5.0, "text": "I called this place as I thought I had distroyed the finish on my Piano. Allen was more helpful than I ever expected, and made several calls to assist. Allen,  Thank You so much for all your help!", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "105366284528501236258", "name": "Michael H", "time": 1609343035732, "rating": 5.0, "text": "Found Alan through several others that recommended him to me.  Of all things, I had a brand new bookshelf speaker that fell to the ground after my dog knocked it over.  Had damage on several corners and cracks in the finish.  I had little hope of being repaired to nearly new finish but Alan made several attempts to find the right repair before he did anything to the speaker.  I was amazed at the outcome!!  You now have to really look hard and to know the speaker was damaged.  Alan was very professional, timely, and fair about the price. I highly recommend Alan as he took something he had never repaired and make it look great. You will not be disappointed!!", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "103115263807120122417", "name": "Nancy Waggoner", "time": 1602607750808, "rating": 5.0, "text": "Mr. Moates has refinished a number of pieces of furniture for me over the years.  The quality of his work is superior; his finished pieces are flawless and beautiful.  Recently, he refinished a cabinet drawer and matched the color to the rest of the cabinets perfectly.  He is extremely conscientious and the nicest person I have ever known.", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "110274397800284873328", "name": "Debbie Seamans", "time": 1596303773795, "rating": 5.0, "text": "Had antique sideboard refinished.  Needed to match color of my antique table!  Match was perfect - looks beautiful!!  Very satisfied with quality of Allen's workmanship!  Highly recommend!!!", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "102994415320689600785", "name": "charles mitchell", "time": 1599836214769, "rating": 5.0, "text": "Mr. Allen Moates performs miracles....!!...He is meticulous and detailed in restoring and bringing your furniture back to life....I would give him 6☆☆☆☆☆☆ if I could.", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "110889902521139170915", "name": "Kenalyn Cromwell", "time": 1558834868610, "rating": 5.0, "text": "Mr. Moates is so awesome!  We brought three truckloads of antique and very high end furniture that was damaged in Hurricane Michael.  He did excellent work to restore and repair all that he could, and meet us on the weekend to drop off or pickup repairs.  His cost is very reasonable and the quality is the very best!  He was a blessing to help us save what we could.  You cannot find a better furniture repairman!", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "102987746696101252262", "name": "Joe Condoluci", "time": 1601426209247, "rating": 5.0, "text": "Mr. Moates is a true professional refinisher of wood.\nVery customer focused with suggestions and recommendations\n5 stars...definitely!!!!", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "104461141229184010729", "name": "Jennie Gillihan", "time": 1614699020938, "rating": 5.0, "text": "We have an antique cradle in our family that is being passed to my niece in NC. It had two broken leg tips and the top was broken off. He came to our home to pick it up, and when it was repaired, he delivered it back to our home!  He did an amazing job, having to hand craft both of the leg tips, and it still looks \"old\". I would recommend Allen with NO reservations for ANY furniture job you may have.  You will not be disappointed!", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "106898630351613110976", "name": "Linda Christy", "time": 1562205580292, "rating": 5.0, "text": "I highly recommend Mr. Moates if you are looking to refurbish or restore furniture.  His work is impeccable, and he is prompt.  He will come to your home and give you a price and a plan for what he will do.  He also picks up and delivers.  I can’t say enough good things about Mr. Moates.  I called him recently about some pieces that I thought needed to be repaired.  He is such an honest man that he actually told me he could not take my money and that my furniture was fine just as it was.  You won’t go wrong by using Mr. Moates!", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "110718214863067626844", "name": "Shannon Wiebe", "time": 1569251273352, "rating": 5.0, "text": "He refinished an antique for me and it looks incredible! I can't believe the quality and craftsmanship! The finish is flawless!", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "106051035319159650907", "name": "Trek Potter", "time": 1551574043408, "rating": 5.0, "text": "Mr. Moates did an incredible job for us. We had 2 antiques chairs and a writing desk that we’ve had laying around for years. Finally around to to refinishing it, but had no idea how good it could look under Mr. Moates care. They came out beautiful. He took the pieces carefully to ensure all cracks and crevices were cleaned of old material before putting back together and staining it. The chairs were very rickety (almost falling apart) and he was able to reinforce it in all the right, unnoticeable places to make them solid again. They literally looked like new pieces of furniture when we got them back. Perfectly sanded and stained. Would definitely recommend to anyone who needs furniture fixed and/or refinished.", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "100038169199947815588", "name": "Deborah Wood", "time": 1564966246955, "rating": 5.0, "text": "I had a small  antique chest of drawers- rather unique in style - and handmade by a great great uncle 120 years ago in New England. I took it from Richmond VA to Prattville to Mr. Moates because I had seen his work on some furniture belonging to my mother -in-law and decided that no one in Richmond would take that kind of time and do that kind of work on a piece valuable only to me.  It had an awful lot of damage - finish was horrible looking with water rings, cigarette burns, cracked wood with nails visible and missing trim to name a few.  I seriously doubted that it could be restored but Mr. Moates took the time to hand make some replacement trim pieces - no easy feat to match hand made carving from a century ago - , repair the damage, strip and restain just the color I requested, and did the most amazing job overall while leaving the character of the piece intact.  It is absolutely beautiful and I am so pleased that I now have a list of pieces to take one by one to Prattville for him to restore. He is a lovely man to work with and a true artisan. You will not go wrong if you chose him to do your refinishing.", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "110752306622719504596", "name": "Tami Meeks", "time": 1564338596388, "rating": 5.0, "text": "He is a master of the trade.  Mr. Moates does beautiful work.  Tami", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "115207611336155878602", "name": "forrest huddleston", "time": 1539380087086, "rating": 5.0, "text": "Did a fantastic job! A real artist! And finished earlier than expected. Very very happy with the results.", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "102828625458877541319", "name": "Carrie Klar", "time": 1500290411571, "rating": 5.0, "text": "Best refinisher in the area. He can really give fresh life to furniture. I like that he always removes the old finish before putting on a new one .", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "103558699229754538168", "name": "Wanderer", "time": 1562771460289, "rating": 5.0, "text": "Excellent service and quality work !", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "106381971056547538850", "name": "Stacey Chrysostom", "time": 1570823898671, "rating": 5.0, "text": "Thank you Moates for your help with Granny’s loveseat.", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "106437904522680558305", "name": "Leona Wilson", "time": 1553193529856, "rating": 5.0, "text": "Awesome", "pics": null, "resp": null, "gmap_id": "0x888e8e13c86e0643:0xd9c68c52de888255"}
{"user_id": "117325411624468836504", "name": "brian lashley", "time": 1626899659863, "rating": 5.0, "text": "\"I am a Worship Pastor at a local church and called Benjamin to tune our sanctuary piano. He responded quickly when I reached out. Not only did he do a wonderful job of tuning, he also took the time to look at an additional piano and gave me an idea of what it would cost to fix it, as well. Benjamin is very polite and knowledgeable and I would highly recommend him\"", "pics": null, "resp": {"time": 1626904981231, "text": "Hi Brian,\n\nIt was an honor getting to meet you today! You inspired me with your love of the community, music, and the Lord. Thank you for letting me be a part of your story!\n\nBenjamin Sanchez, RPT, MPT\nProfessional Piano Services"}, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "105128421353623375196", "name": "Katy Holicky", "time": 1620345439053, "rating": 5.0, "text": "The technician was polite, prompt and knowledgeable.  Best my piano has sounded in many years!", "pics": null, "resp": {"time": 1620404239577, "text": "Hi Kathy,\n\nIt was a pleasure meeting you, and an honor to be a part of your musical journey! Good luck!\n\nBenjamin Sanchez, RPT, MPT\nProfessional Piano Services"}, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "102464748895809551887", "name": "Linda Hurd", "time": 1604104485609, "rating": 5.0, "text": "Benjamin is passionate about his profession. That love permeates the quality of care he provides in tuning and maintaining my 80-year-old Kimball. A couple years ago the felts were replaced. What a big job that was!  The tone of my piano was vastly improved and definitely worth the investment. Whether your piano is a “large project” or needs a regular tuning appointment, Benjamin has the skill and desire to make your instrument the best it can be.", "pics": null, "resp": {"time": 1604165343960, "text": "Hi Linda,\n\nI’ve loved getting to know you and your family over the past few years! Your ability to run such a full life and yet care deeply about the people around you is an inspiration to me. You are a blessing!\n\nBenjamin Sanchez, RPT, MPT\nProfessional Piano Services"}, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "116071914847878563677", "name": "Vicente del Rio", "time": 1607240196751, "rating": 5.0, "text": "We were very pleased with Ben Sanchez's Professional Piano Services. The website is amazingly informative and complete, and it was very easy to set up an appointment and get it confirmed. Ben arrived at our house absolutely on the dot and he was thorough, informative, and very professional during the whole process. He tuned, fixed up the squeeky pedals, and recovered the hammers, and get the pitch much better. It was 1956 piano we got as a gift from a friend which had been serviced only twice in its lifetime! Besides, Ben is a very good classical piano player (I confess I tried to convert him to jazz a bit... ;0)", "pics": null, "resp": {"time": 1607359452740, "text": "Hi Vicente,\n\nIt was a pleasure getting to meet you and your family! Your love of the various styles of music was inspiring. My friend, I will try to learn some jazz before we meet again... but no promises!   ;-)\n\nBenjamin Sanchez, RPT, MPT\nProfessional Piano Services"}, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "111222345150301078236", "name": "Barb Williams", "time": 1608242828879, "rating": 5.0, "text": "Benjamin did a great job of tuning my Yamaha upright piano.  He walked my through what he thought was necessary before starting.  After he was done, he covered the work he had done, what to expect for the next couple of weeks, and when to have it tuned again.  I definitely recommend him!", "pics": null, "resp": {"time": 1608266552774, "text": "Hi Barb,\n\nI was honored to meet you and your family! I am always thrilled to meet new musicians and love getting to be a part small part of your story. Thank you for giving me something to smile about!\n\nBenjamin Sanchez, RPT, MPT\nProfessional Piano Services"}, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "105161294802616514837", "name": "Jonathan Christopher", "time": 1594270152990, "rating": 5.0, "text": "I purchased my 1979 B-1 Yamaha, from a music store going out of business in 1996.  Had it tuned up by a Yamaha technician and believed I had a great sounding piano.  I had Ben at Pro Piano refurbish and repair the inner-workings and I am stunned.  I am not lying when I tell you this piano does not sound like the piano I purchased even after it was tuned.  It sounds better than when I bought it and it has been tuned numerous times over the years.  A far more richer and fuller tone quality than it has ever had before.  He will soon be nursing by G-3 Yamaha back to its pristine original quality.  So thankful I landed on PPS.  I am a church musician and in charge of numerous pianos over 30 years and have experienced at least a dozen or more tuners and technicians.  Trust me when I tell you that not every piano tuner is proficient at their craft.   Ben is professional, courteous, and communicates well the needs your piano has to bring it to its best condition.  Every penny you spend is worth it.  He will care for your piano as if it was his own because he understands the emotional attachments we make with these instruments that bring us joy.", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "113894100861818198148", "name": "Valerie Rogers", "time": 1617391071775, "rating": 5.0, "text": "We had Ben tune our piano and also adjust the action on the keys!   He had his work ahead of him as my piano hadnt been tuned for a long while.  He did a wonderful job... Also, Ben is a very professional , kind , and  prompt!  We will use him again for sure!!", "pics": null, "resp": {"time": 1617409912747, "text": "Hi Valerie,\n\nIt was a pleasure getting to know you and your family! Your positivity is such an encouragement to me. Thanks for brightening my day!\n\nBenjamin Sanchez, RPT, MPT\nProfessional Piano Services"}, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "101336113670906604931", "name": "Cindi Smith-Dunham", "time": 1592610498489, "rating": 5.0, "text": "I was impressed by the reviews of Benjamin's service so I chose him to tune my neglected upright piano. It was remarkably easy to make an appointment online, with quick confirmation and timely reminders sent to my email. Benjamin arrived right on time and did a thorough examination and tuning of my piano. He was extremely professional, pleasant, thorough in explaining his findings and educating me about the inner workings of the instrument. I highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "109722154183896567097", "name": "Brian Asher Alhadeff", "time": 1596852274782, "rating": 5.0, "text": "Ben is an outstanding professional piano technician. He has tuned three times for me so far and each situation has been perfect. Ben shows up on time, in a uniform, is extremely respectful and courteous, and knows exactly what he is doing.", "pics": null, "resp": {"time": 1596856853111, "text": "Hi Brian,\nI never cease to be amazed at the diversity of talent I see every day. Hearing about your work with the Opera was the highlight of my day. Thank you for giving me something to smile about!\n\n— Benjamin Sanchez, RPT, MPT\nProfessional Piano Services"}, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "100966685423004334066", "name": "Ginger Fisher", "time": 1614011169303, "rating": 5.0, "text": "I highly recommend Ben and Professional Piano Services. The online appointment setting was easy and well organized with Ben making a follow up personal call confirming the appointment made online. When Ben came to the house he was considerate and professional while being personable and caring at the same time. We just inherited my grandmothers 1936 upright and I didn't know anything about it or how to care for it. Ben did a wonderful job informing me of the history and key differences about our specific piano, as well as teaching me how to care for it going forward. I just can't say enough good things about my experience, we will be customers for life!", "pics": null, "resp": {"time": 1614029784138, "text": "Hi Ginger,\n\nGetting to meet you and your family was the highlight of my week! I am so blown away by Alex’s ability to play. He’s a very special young man, and I’m honored to be a part of his musical journey!\n\nBenjamin Sanchez, RPT, MPT\nProfessional Piano Services"}, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "117656878727225363453", "name": "Gabby Shannon", "time": 1607809523024, "rating": 5.0, "text": "Ben is fantastic at his job—any piano owner knows that it’s not easy to trust someone with your baby, and you are just crossing your fingers that everything turns out okay. I have a 90-year-old refurbished Ellington baby grand “Franken” piano that had some issues I would have NEVER noticed...I’m so glad that I had Ben take a thorough look at this piano before tuning it. I needed to save up for the repairs, and with COVID it took me even longer to have him back to do those repairs because of restrictions, but when it was ok for him to repair the piano in my home, he had notes from over a year ago about my piano’s specific problems and came ready to work on it. Over the course of two days/sessions, he got my piano to sound (and function) better than I’ve ever heard it before. I can’t recommend him enough! You can trust him with your piano.", "pics": null, "resp": {"time": 1607815651509, "text": "Hi Gabby,\n\nIt was a pleasure getting to know you and your husband! Your love of music and the piano inspire me. It’s so cool that you’re willing to pass your gift along to the next generation, especially to those who might otherwise not have the chance. Thank you for letting me be a part of your story!\n\nBenjamin Sanchez, RPT, MPT\nProfessional Piano Services"}, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "115398366949852093632", "name": "Jane Piepes", "time": 1603140071008, "rating": 5.0, "text": "Bejamin is a great guy and a great tuner.\n\nI have this piano for many decades.\nAnd I have always watched my tuner at work.\n\nFirst, my husband is a physicist.\n\nHe's always been interested in the conceptual tuning process.\n\nBefore Benjamin arrived ...he had written out questions for him.\n\nHe didn't know whether B  would have the time or the knowledge to answer these questions.\n\nBut he was very happy to answer all questions ..\nAnd in these areas Benjamin was accomplished.\n.   ...\nSo I watched Benjamin at work on the couch as I snipped my dog's hair.\nI believe we we were silent enough.\nHe explained to me, however,  that even the the AC in the background effects the tuning (App)  Signal generator.\n\nThat was very interesting to learn.\n\nHe tuned every signal note.\n\nAnd my ear is good ..so I could hear the changes.\n\nIt seems to be hard work standing on your feet and dealing with eighty eight keys.\n\nBut Benjamin is calm and steadfast.\n\nI fell into a trance-like nap ...\nCause of the relaxing process.\n\nAt the end he checked  each note by ' ear ' as well.\nI appreciated that .\n\nThen we compared my perfectly in - tune electric piano to the newly tuned very old acoustic one.\nWe each played one simultaneously.\n\nMy old acoustic that I've had for a very long time sounds great now !\n\nSincerely,\nJane Piepes", "pics": null, "resp": {"time": 1603143614165, "text": "Hi Jane,\n\nIt was a pleasure getting to meet you and your husband! I was inspired listening to your story and getting to be a part of your musical journey. I‘m always honored to meet fellow musicians and piano lovers and love getting to be a part small part of your story. I can’t wait to play a duet with you again next time!\n\n— Benjamin Sanchez, RPT, MPT\nProfessional Piano Services"}, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "102583437013278689885", "name": "Rod Meadth", "time": 1590162152146, "rating": 5.0, "text": "I'm no professional, but our family upright piano had suffered through several moves and several years.  Benjamin was quick to respond, came on time and wasn't phased by our family of six trying to stay quiet around him!  Piano sounds great now!  Thank you.", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "105953934536652575233", "name": "Katie Baillargeon", "time": 1575294431842, "rating": 5.0, "text": "Benjamin is great! Punctual, professional, forthcoming with information, and clearly knows his stuff. I contacted him after a negative experience with another technician and he finished other person's work, fixed the problems, and improved the piano as well. I also really appreciate how forthright he is in communicating what he is doing and what the piano needs. Will definitely hire him again, without question. Also, I love the online scheduling feature!", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "108732043301429583263", "name": "Edward Garnica", "time": 1578759605740, "rating": 5.0, "text": "I had an old piano that was badly out of tune. Setting the appointment was very easy and I found their prices reasonable. Benjamin arrived exactly on time, and was a professional through and through. He worked diligently and answered any questions we had. I would highly recommend their services to anyone!", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "106403555230933679708", "name": "Teresa Falcone", "time": 1572046811490, "rating": 5.0, "text": "Very good website that allows for reservations online followed by a call to reconfirm the reservation. The piano tuner was on time, very professional, explained what he would be doing and took all the time needed to properly tune and repair my piano. I will definitely use Professional Piano Services in the future.", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "117324782760217276600", "name": "anne crowe", "time": 1571448741694, "rating": 5.0, "text": "Ben did a great job with my piano.  He was on time, fixed a couple of things, and tuned my piano.  He was polite, professional and pleasant.  I would use him again and would heartily recommend him to others.", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "108388568162702867950", "name": "Cindy Lamb", "time": 1578431834815, "rating": 5.0, "text": "I am delighted to have found Ben upon my recent move to Lompoc.  My piano was in desperate need of tuning after five years of neglect and three moves across California.  Ben is an engaging, polite and punctual professional. I was extremely impressed he was knowledgeable about my brand of piano and gave me a new appreciation of it. My musician son-in-law played it over the holidays and remarked on how lovely it sounds now.  I highly recommend Ben and will continue to call on him for his professional services.", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "100538929756028415411", "name": "James Powell", "time": 1575757687305, "rating": 5.0, "text": "Mr. Sanchez is not only an excellent piano tuner and pleasant young man, but he is quite knowledgeable about pianos and their history. He gave us a new appreciation for our instrument. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "114068586475845249061", "name": "William Wyatt", "time": 1575422614476, "rating": 5.0, "text": "I recently had Mr. Sanchez at my home to tune our family piano.  He was very prompt, thorough with his assessment, and gave me good advice for caring for the instrument.  I highly recommend him for piano repair and tuning services.", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "106305271037083112473", "name": "keith collins", "time": 1580437634340, "rating": 5.0, "text": "Mr Sanchez was recommended to me by a music store here in my town, so, I called, described my pianos problem  and set up an appointment for him to take a look at it, in no time flat he solved and fixed the initial problem, then he told me it was way out of tune, so, of course I had him tune it, what a remarkable difference in the sound! so clean and crisp, Ben I can't thank you enough, what a huge difference in sound, I highly recommend you to anyone, he is worth the 5 stars I give him, his work speaks for itself.", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "106624344313922929700", "name": "Geraldine A. Queja", "time": 1568244359535, "rating": 5.0, "text": "Benjamin did a wonderful job on tuning my piano. I find him very knowledgeable, and the professionalism he exhibits it shows in his performance! Definitely will have Benjamin tuned my piano from now on, I highly recommend him!", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "112791692546479362130", "name": "Mariah Voss", "time": 1570839297934, "rating": 5.0, "text": "I just met and hired Benjamin to tune our piano for the first time. He was extremely professional in his demeanor, appearance and punctuality. He was very informative and forthcoming with any updates as he felt were needed, not to mention tolerant and polite when it came to my yappy dog (air show practice day).\nI would highly recommend him. I felt like his price was a bit on the higher scale compared to others in our area, but considering his job well done and complimentary service, it was well worth the price.", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "110249615194189445059", "name": "Cameron Writt", "time": 1569596874229, "rating": 5.0, "text": "Highly reccommend Benjamin for piano care services. He is very punctual and works in a timely fashion. Also, he took time to explain what repairs would be necessary in the future, as well as estimate what the costs would be. Excellent service!", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "112079154590825126232", "name": "Michael Dulay", "time": 1567739943035, "rating": 5.0, "text": "Benjamin tuned, did some minor repair and polished our piano yesterday. We are very happy with the quality of the work and professionalism of the service. My son is delighted with how much better it sounds when he practices and even had an extra long session in honor of the much improved sound quality.", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "104534165085397088753", "name": "Kristen Cox", "time": 1553448321951, "rating": 5.0, "text": "Benjamin did a great job tuning and repairing my piano. He was kind enough to take the time to wait to get a visitor's pass to come on base twice. I will definitely use his services again in the future!", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "116519644178144336024", "name": "Susan Baar", "time": 1536096157748, "rating": 5.0, "text": "Benjamin was professional from the first phone call through leaving my home. He did an excellent job with my piano, his rates are fair and I highly recommend him. He knows his skill.", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "109450210620999475453", "name": "Elisa Jay", "time": 1507859656282, "rating": 5.0, "text": "Benjamin is the consummate professional! From making an appointment to having our ancient piano tuned, he was informative, skilled, and very kind. Our piano has never sounded better! I am a grateful customer, and you will be too!", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "103431956707104085415", "name": "Jack", "time": 1542130684234, "rating": 5.0, "text": "I am so grateful to have my piano cared for by such a professional, conscientious, well trained and highly skilled tradesman. It is very hard to find the kind of high quality I require, but this is it. If you care about your instrument and want a skilled professional, don't hesitate to call Benjamin!", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "115040986430444371807", "name": "Alice Howard", "time": 1534197300845, "rating": 5.0, "text": "Ben has been tuning my piano for about two years and has put me on his schedule for a tuning every six months. He shows up on time gets the job done and is very thorough and knowledgeable about the workings of the Piano! The word “professional” describes his work perfectly!", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "105471092881898454976", "name": "Rebecca Heath", "time": 1559149120140, "rating": 5.0, "text": "Benjamin is professional and thorough. It is obvious that he cares about providing a great service to his customers. I highly recommend Professional Piano Services.", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "114489722597145017013", "name": "jeff fahrni", "time": 1539275265170, "rating": 5.0, "text": "My grand piano was expertly tuned and serviced by Benjamin after my recent move to the area from L.A.  After experiencing years of senior skilled technicians taking care of my pianos in the L.A. area,  I can easily say that Professional Piano Services is practicing at what I consider to be the highest level of accomplishment.  Thanks Benjamin!!", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "102513737226507939581", "name": "Sarah Barthel", "time": 1527489443364, "rating": 5.0, "text": "Benjamin beautifully provided a pitch raise followed by a tuning for my piano which was long overdue for a tuning and had also been recently moved to a new home.  He took the time to answer my questions, adjusting the voicing at the upper end per my piano-expert friend’s request, and was professional from our first contact to the final adjustment at the piano.", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "111517003963154901028", "name": "Elaine Reese", "time": 1528046738970, "rating": 5.0, "text": "Benjamin’s professionalism was outstanding starting with appointment scheduling through completion of servicing my console piano. It is obvious that he is very knowledgeable,  experienced and passionate about his work.\n\nHe explained what he would be doing, answered my questions, and then summarized the  services he had performed on my very out of tune piano after working three hours non-stop!\n\nI highly recommend Professional Piano Services - you will be highly  satisfied with Benjamin’s great work and personal interaction skills.", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "105927342473636259229", "name": "Margaret Cordero", "time": 1530654541696, "rating": 5.0, "text": "Benjamin was prompt, thorough and attended to my very old Everett upright piano with love and care.  He shared his expertise, as well as some history about my piano with me.  I would recommend his work highly!", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "107862439635150930849", "name": "Julie Pike", "time": 1533354748143, "rating": 5.0, "text": "I appreciate the professional way Benjamin works to find solutions to any piano mechanisms that need repair.  He also works hard to insure that his clients are happy with the results of his labor. I have a grand piano at home Benjamin takes care of for me and my piano students.  There are several pianos at the high school where I accompany choir classes that he keeps in excellent working order. I highly recommend Professional Piano Services.", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "109716354731489194336", "name": "Ange Russell", "time": 1547960401419, "rating": 5.0, "text": "I am fairly new to Santa Barbara county and was grateful to receive the recommendation to contact Professional Piano Services from my boys' piano teacher. Benjamin has a very well organized and informative website where you make your appointment. Not only was it easy, I'd get reminder emails about the appointment made. He showed up on time, was professionally dressed and was very thorough with tuning my very old piano. Thank you Benjamin for your work! I highly recommend him to anyone who needs their piano tuned whether you are beginner player or a concert pianist.", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "100157301895846571449", "name": "Shari Peters", "time": 1531438728661, "rating": 5.0, "text": "Very happy with the service our very old (almost 100 years old!) piano received today.  Benjamin was very professional and knowledgable and we are happy to have our piano sounding great again.  I highly recommend Professional Piano Services.", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "109917809092646156526", "name": "Alma Monroy", "time": 1549092984936, "rating": 5.0, "text": "Benjamin did an excellent job tuning my son's piano (106 years old), he also fixed some broken keys,  he was very professional and knowledgeable about it. Highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "102529614812930770567", "name": "David Slay", "time": 1531358010610, "rating": 5.0, "text": "Benjamin is extremely knowledgeable, and loves what he does. Nice to see a young man with that rare passion. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "108130482493901800114", "name": "hollisteranchmom", "time": 1528753964278, "rating": 5.0, "text": "Benjamin tuned our 2 pianos and the name of his company speaks to exactly who he is and how he operates, \"professional\".  Benjamin's knowledge and ability to articulate details about our piano tuning and maintenance both in person and in writing was impressive. His attention to detail is excellent. We appreciate his skills and will continue to use his services.", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "104332482860819991910", "name": "Jill Garcia", "time": 1498458871158, "rating": 5.0, "text": "Benjamin is friendly, professional and talented at what he does.  Solid training.  He took the time to answer my questions and made sure I had good understanding of the tuning process.  As a musician and piano teacher, I highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "110284066335734622947", "name": "Lillian Matulic", "time": 1534691243434, "rating": 5.0, "text": "Ben is very knowledgeable and professional.  We purchased a used piano and he tuned in, cleaned it and even let us know what year it was built.", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "101118915192763797437", "name": "Danny Gampe", "time": 1540520883586, "rating": 5.0, "text": "After recently moving to Templeton, CA, I quickly discovered a severe shortage of piano tuners for my baby grand after having it moved there.  Then, after searching for about 6 months, I ran across Ben Sanchez at Professional Piano Services.  No sooner had I emailed him, I received a call and scheduled the appointment.  Best piano tuner I think I've ever worked with.  Professional, courteous, knowledgeable, timely.  And really knows his stuff.  Not only did he tune it, but he also gave it a very thorough review to be sure there were no other issues.  Very happy I found him and will definitely use him in the future.  You should, too!", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "102652267383699352216", "name": "Leona Sullivan", "time": 1576214328767, "rating": 5.0, "text": "I highly recommend Mr. Sanchez!", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "106057328150547813017", "name": "Theresa Bloom-Keeling", "time": 1498504400827, "rating": 5.0, "text": "Benjamin was prompt, professional and extremely professional.\nHe was very knowledgeable and explained everything he was doing.\nI would recommend Benjamin without hesitation.", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "105061486967617932274", "name": "Norman Hardy", "time": 1536007326436, "rating": 5.0, "text": "I have now had Benjamin Sanchez, of Professional Piano Services, tune and service my somewhat demanding grand piano for a second time, and he has done an excellent job both times.  I highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "102775385415654666384", "name": "Matthew Grant", "time": 1489433980932, "rating": 5.0, "text": "Benjamin took time to tune my piano and took time teaching me about the Steinway Line...  He was also able to color match and replace an ivory key that had been missing for many years.  Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "116889567779484373736", "name": "Patricia Buchmiller", "time": 1535083173178, "rating": 5.0, "text": "Our piano has never sounded better!  He did a thorough job tuning it.", "pics": null, "resp": null, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "105070912223772808431", "name": "Tim Woolever", "time": 1568436755497, "rating": 1.0, "text": "Sorry, I trust my friend.  He's blind since a child", "pics": null, "resp": {"time": 1568442798214, "text": "Dear Tim,\n\nI’m afraid I can’t locate your client record based on your Google profile. If you have a legitimate complaint about my services, please contact me at pianoartisan@protonmail.com, and I will be happy to resolve it to your complete satisfaction.\n\nOtherwise, please do not write a negative review about a service you have never used, as you are damaging my reputation for nothing. If you are writing this on behalf of one of my competitors, please stop, as that behavior is completely unethical.\n\nBenjamin Sanchez, RPT, MPT\nProfessional Piano Services"}, "gmap_id": "0x80ec195dfff19ba5:0xe25ea318724d49a"}
{"user_id": "114767620147841955152", "name": "Scotty Phillips", "time": 1521343562526, "rating": 5.0, "text": "He is just simply the Best", "pics": null, "resp": null, "gmap_id": "0x88890dc555555555:0x6742138900ef9b43"}
{"user_id": "104970697428248117138", "name": "Gavin Lawler", "time": 1551926198928, "rating": 5.0, "text": "5 stars.", "pics": null, "resp": null, "gmap_id": "0x88890dc555555555:0x6742138900ef9b43"}
{"user_id": "113469307841248397870", "name": "Robin Ricks", "time": 1622074954659, "rating": 5.0, "text": "Super-nice, knowledgeable people, huge selection, and they gave me a great deal!  Loved that I could try out so many different keyboards hands-on.  Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "100644189284951177146", "name": "D M", "time": 1555982691503, "rating": 5.0, "text": "Great selection of name brand pianos and organs including Yamaha and Hammond.  Their prices are very reasonable for what they sell.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOppdVU70TwyDCRn1Sz_4vpNzfFxEYD3FnS2-mw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOD1a0kNc6O6_8xdQS_LJKV3WJa1wBjiDD8Wwth=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN3ZHpCgXcXVYG1xrdI9goeGduTz86_D6F0spa-=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN0o6mWFOZrXTSNHZaOnpsHCQVYKjpxYKB2nCqM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipML83BPOpfeAa5dyJxFZjghQdDMPNjndy9RaZL8=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMSrfRe36TQAXpltGCXhOMj0i7hh4Ot3wViOetB=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "111662239498819613694", "name": "Anna Soltani", "time": 1616625345591, "rating": 5.0, "text": "I spoke in-depth with David Ellis about a Yamaha grand piano and he was very knowledgeable and extremely honest. He gave me so much of his time. I truly valued his opinion and would highly recommend Ellis Piano!", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "105705542174405422415", "name": "Fred Westrom", "time": 1605135966071, "rating": 5.0, "text": "Ellis Piano is a too notch shop.\n\nThey have a little of everything,\nFrom entry level electric pianos,\nAll the way up to the nicest concert grands that money can buy.\n\nYou will not find a piano store with a better selection, and definitely not with nicer people.\n\nThey are not pushy, and are so friendly that they will spend a little extra time to show you how cool the products that you wish you could afford are.\n\nIf you are thinking of getting a piano, this is definitely the place to go, explore, play, learn, and eventually buy the piano that is right for you, and maybe even the piano of your dreams one day too.\n\nAsk for Jason Ellis, and if you think of it, tell him that I sent you.\n\nI am sure that you will be as impressed and satisfied as I have been with them.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "101080815740163609727", "name": "Valencia King", "time": 1551915411776, "rating": 5.0, "text": "Very friendly staff. Really good people. Awesome pianos.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO6azmKF5-BkJ_zdKI9gHNtNFOivyW9pq2Lf8a6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMvHjdHMNoWF-jwUWlb4z0SfIgpnVAyS0hxflJk=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "102096260059049267508", "name": "john condon", "time": 1621724383534, "rating": 5.0, "text": "(review by full-time pro-musician) Ellis is awesome! And take note, David Lambert is the in-house electronic repair \"wizard\" with a degree in Electrical Engineering. Awesome inventory of acoustic and the best in elec keys including NORD, KAWAI, ROLAND, YAMAHA, etc. Plus hybrids which are the latest designs that combine acoustic/elec by using a whole new trigger system that's NOT the midi triggers on each key which slows down the action. It's a completely new technology you have to see. Btw, if you walk in and don't know it there's a room in the back with over a $million in concert grands that blew my mind!", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "112801141358444577390", "name": "Jonathan Hart", "time": 1602220903634, "rating": 5.0, "text": "Fantastic family-owned business! I was in the market looking for a new digital piano, and decided to check the place out. Got to talking with one of the family members named Jason about all sorts of piano-related topics. He showed me around the place, helped me get familiar with the layout of the store, answered questions I had about their keyboards, and overall was extremely helpful. Extremely passionate about what he does as well — I enjoyed discussing some of their piano history with him. Ended up purchasing a Roland FP-30 along with a stand and bench for a fantastic price! If you're in the market for anything piano-related, I would highly suggest Ellis Piano!", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "116260528175263832757", "name": "Christy Donovan", "time": 1606280812108, "rating": 5.0, "text": "Our favorite piano music store. We try to visit every so often when we are in the Birmingham area. Great selection of music, and plenty of pianos to play it on to see if we like it.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "118317806934458958220", "name": "Kristi Gill", "time": 1611964334885, "rating": 5.0, "text": "I went in for some general information and Cory helped me tremendously\n5 stars go ellis oiano", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "102003740648044982564", "name": "Wendy Jessup", "time": 1572980339100, "rating": 5.0, "text": "❤️🎹❤️ Ellis Piano Store in Birmingham, Alabama, is filled with people who truly have compassion for their customers! Their dedication to excellence is off the charts! I have been shopping at Ellis for over ten years, and every time I walk into the store, they treat me like loving family! They have the very best pianos, accessories, and music at the very best prices! I am beyond pleased with the piano I bought from them! Every time I visit Ellis Piano Store I am blessed! It is the best and most loving family business I have ever seen! It will always be my favorite store!", "pics": null, "resp": {"time": 1574102800097, "text": "We're so glad you choose to shop with us for any piano needs you have! 10 YEARS? That's loyalty and we appreciate that so much."}, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "106053219834463264725", "name": "Yun Jian", "time": 1604099040035, "rating": 5.0, "text": "We bought our piano from here. They are have reliable services.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "108193513562002346577", "name": "D mckenzie", "time": 1584480807697, "rating": 5.0, "text": "I would like to thank the Ellis family for such wonderful service and attention to our Church's needs. Please don't change a thing about how you do business in the community, because you are a pillar of excellence on how to provide awesome customer service and great products. Thank you again for a great experience on the phone and in the store.\n\nThanks Kindly\nGreater Lily Star Baptist Church Family", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "102155996666713963873", "name": "Krystal McCarty", "time": 1579137100001, "rating": 5.0, "text": "I cannot recommend Ellis Piano enough!  Jason and his dad, David, were absolutely amazing through the entire process of piano shopping and purchasing!  If you are in need of a piano (or sheet music) Ellis piano is hands down the place to go!  It is clear that they take pride in their work, and that they want the very best for all of their customers!", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "108831394462764944954", "name": "Mary Evans", "time": 1624929240115, "rating": 5.0, "text": "Lots of choices and friendly employees.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "116719126000786713731", "name": "Bob Clocker", "time": 1599965828252, "rating": 5.0, "text": "Excellent place to do business. Helpful, knowledgeable and friendly.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "107379355955868403523", "name": "Patrick Cash", "time": 1578018487164, "rating": 5.0, "text": "I can't say enough good things about my experience here. I had been looking, waiting, researching a Roland RD-2000. Finally stopped in and talked with Cory Ellis and then his Dad.\nThey both helped me and I felt very at home. Both were super nice and very friendly. You can tell they genuinely care about their customers. I would HIGHLY recommend Ellis Piano if you are needing a piano or keyboard. Check them out. You won't be disappointed.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "118409397586047919711", "name": "Anabel Sanchez", "time": 1597791534249, "rating": 5.0, "text": "We loved Ellis piano!  They go above and beyond and far as customer service!  Very kind people!", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "117338219481207571487", "name": "gail tucker", "time": 1554341630808, "rating": 5.0, "text": "After driving by this place for years with intent to stop in, I did finally stop in ... for only some piano music. I was greeted upon my entrance and made to feel welcome. I was definitely awestruck by the beauty of so many gorgeous pianos gathered in one place !\nI was helped and allowed to browse through music and this adventure has added to my desire to begin playing My piano again .  I will definitely be back!", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "114769520970925276864", "name": "Dana", "time": 1553804488987, "rating": 5.0, "text": "Had a great experience shopping here.  They were super patient while I looked at used pianos and then helpful when I finally made my decision to go electric.  When something would work with the Roland app they stopped by to see if they could help, even though I know they were having a super busy day.  And they checked back in with me months later to make sure an accessory had arrived.  Thanks y'all!", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "116819620911585758527", "name": "Jeremy Sams", "time": 1584148333566, "rating": 5.0, "text": "These guys really made my dream come true of owning a Nord Piano  the customer service is outstanding ! Thank you guys! They are out doing their competition", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "107674773353864506612", "name": "Allen Jones", "time": 1550533300173, "rating": 5.0, "text": "The purchase of my piano made a lifelong dream come true. Completing the experience was the service of the Ellis family. Family owned businesses have a pride and mindset like no other. Fully attuned to my interests and needs, the Ellises guided me to just the right piano and provided excellent delivery service and guidance on long term care for the piano. I cannot imagine a better experience and am deeply grateful. Sincerely, Allen Jones", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "103176055082092245829", "name": "Allison Walls", "time": 1542165908633, "rating": 5.0, "text": "If you're in need of a piano or keyboard, this is the place to go.  They are not only experts in their field, but they will make you feel extremely comfortable and right at home.  My mom is a private piano teacher and has shopped here for as long as I can remember.  They have, by far, the best selection in Alabama, and their floor room is filled with absolutely beautiful pianos.  Mr. Ellis and his sons are honest and loyal, and we will never buy from anywhere else.  Do yourself a favor when piano shopping and just make one stop here.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "109566530114305587140", "name": "Tiffany Walls", "time": 1541432296429, "rating": 5.0, "text": "Mr. Ellis and his sons are amazingly kind, knowledgeable and honest. My wife's family have been friends and patrons of Mr. Ellis for decades. We would recommend Ellis Piano for the purchase or repair of your piano. You'll never feel more like family than you would here. The store is set up beautifully and these guys will take the time to walk you through features, the history of each piano and feel out your needs to make sure you find the perfect addition to your home and family.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "108820928193929927829", "name": "Luca Guazzotto", "time": 1533917051880, "rating": 5.0, "text": "Great store for piano buyers. Cory and David are very helpful. They will spend the time to knowledgeably talk with you about the various instruments and to let you try on even the ones that are above your goal or budget. They won't press you into buying anything, nor try to convince you that some expensive piano is \"the best piano in the world\" or that some cheap one is a great deal. I didn't buy a piano, but I will definitely be back for one when I am ready.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "100272983077853455931", "name": "Brian Farrar", "time": 1519173532251, "rating": 5.0, "text": "Talk about a class act organization. My wife and I purchased a baby grand piano from this loving and welcoming establishment in September  of 2017. After having the instrument in our home for 4 months 2 keys at the very far end of the piano were sticking. I called Mr. Ellis told him the problem and he sent out a professional to fix it in a very timely manner. Not only did they fix the 30 second minor problem Mr. Ellis had my piano tuned at no expense to us. If that is not customer service I don't know what is. If anyone who reads this post is contemplating purchasing a piano please please please rest assure from the time you meet Mr. Ellis, his sons, and the staff that work there, you will be well taken care of. These people are genuine from the word go. They will assist you if you know absolutely nothing about  a piano to help you find the right instrument for you. Words cannot express how wonderful this business is. Thank you, thank you, thank you Ellis Piano & Organ for being who you are.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "109163112225142637396", "name": "Enoch Ko", "time": 1531756236570, "rating": 5.0, "text": "I recently purchased a Yamaha gc2 from Ellis Piano. Mr. Ellis and Cory were fantastic from showing me their inventory all the way to purchasing. Very approachable and down to earth people. Fantastic people. They could not have made the buying experience any easier. Piano also arrived quickly and I could not be happier with the purchase. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "112222387225320975707", "name": "Andrew Carter", "time": 1553541798082, "rating": 5.0, "text": "They have a great selection of pianos and sheet music!!! Music for all skill levels and all genres! Music Staff is super friendly, very knowledgeable and always willing to help!", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "112408207506991275610", "name": "David Porter", "time": 1525810541919, "rating": 5.0, "text": "You might as well call this \"World of Pianos\" because it is FILLED with beautiful new and used instruments. Mr. Ellis and his sons are wonderful people who will go out of their way to help and will work with you to get the right piano in your home. They have a wealth of experience and knowledge. If you are thinking of buying a new or used piano, sheet music or electronic keyboard, you owe it to yourself to check with Ellis Piano.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "104654767959016746921", "name": "Kim Beverage", "time": 1549302627239, "rating": 5.0, "text": "Ellis piano is simply THE BEST place to not only buy a piano but to enjoy the experience of doing so.  Purchasing a piano is a matter of very personal taste and preference...what matters most to David Ellis and his sons is quite simply whatever matters most to you.  My husband recently surprised me by taking me to Ellis to pick out the piano of my dreams.  While they could have pushed me to purchase on the spot, they did exactly the opposite and accommodated me on multiple visits to make certain I went home with the instrument I not only liked....but with which I fell in love (as did my husband).  They went out of their way to educate us about the instruments and encouraged me not to settle.  Not once did I feel pushed to make a purchase.  David and his sons knew this was a very special gift from my husband and they went above and beyond to make sure it was all he wanted for me...and all I wanted as well.  The Ellis family knows pianos, they know the value of a good investment, they know the value of superior customer service, they are approachable and meet every pianist on their level - from the young child just beginning lessons to the most accomplished world-renown performers and everyone in between and they treat them all with the same utmost care and respect.  When you select a piano from Ellis, you receive not only a stellar instrument suited just for you, but also the benefit of a family legacy based on fulfilling musicians’ dreams.  If you’re in the market for a piano, question no further where you should go...Ellis Piano is your answer.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "102677519364029701049", "name": "Gary Kendrick", "time": 1606944497767, "rating": 5.0, "text": "Wonderful visit with the Ellis family.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "100203204711961058003", "name": "Anja Willis", "time": 1608070919761, "rating": 5.0, "text": "Very knowledgeable staff", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "110706796979307173825", "name": "Susan Hanshue", "time": 1523478306471, "rating": 5.0, "text": "My mother was in the store thus past Monday and was very pleased not only with her purchase but the service as well. Cory and Jason were great on all counts. She received a good deal and great service.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "110516190378052860309", "name": "Ken Schmidt", "time": 1609794618910, "rating": 5.0, "text": "Awesome Store!", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "102833127230372590892", "name": "Eric Morrison", "time": 1515426515225, "rating": 5.0, "text": "Place is awesome. Family owned business, they go out of their way to accommodate their customers. Salesman walked around explaining everything to us and playing so we could hear the difference between the pianos. Great experience.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "117847787445135229374", "name": "Deborah Hatchett", "time": 1595887309250, "rating": 5.0, "text": "Very personable and ease of purchasing.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "107302468916664438793", "name": "Dustin Wheat", "time": 1502009238738, "rating": 5.0, "text": "I recently bought a digital piano at an wonderful price for my family from this store. The owner and his family of employees helped me choose the right piano that suited our needs. They took the time to help me with all my concerns. I truly felt taken cared of from start to finish with the purchase. I will be sure to go back if I need anything else.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "110155729712176639847", "name": "Roxanne Kutzer", "time": 1493744875603, "rating": 5.0, "text": "My family and I were so excited to purchase our first digital piano and the experience of buying it at Ellis just contributed to that. David, our sales rep, asked us some simple questions about our playing experience and goals and helped us find a great entry-level piano that suits our needs. We're really pleased with our purchase and will return when we're ready to upgrade!", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "108255715688584953941", "name": "Robin Leece", "time": 1499651404123, "rating": 5.0, "text": "The owner and his son as well as all the other staff were kind, considerate and professional with obvious integrity. I enjoyed my visit and would only buy a piano here. I wish more of today's business owners took this much pride in their work and were as sincere in helping customers!", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "115233342624986170577", "name": "Batman 67C", "time": 1529621208288, "rating": 5.0, "text": "AWESOME STAFF!!!!! One of the employees went out of his way to show/ tell me about practically everyone of the pianos in the main showroom!! Had the best time in here!! Will definitely be buying a piano from here in the future!!", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "105356074816387381622", "name": "ines villarreal", "time": 1506489318375, "rating": 5.0, "text": "The Ellis family is one of a kind. Since the first time I walked in, till I finally left with my piano, they were stupend, thoughtful, and inquisitive.\n\nThe father has all of his boys working at the store, which makes it seem like if you were coming home for lunch. They always have good suggestions and fun stories to tell.  On top of that, they are experts on the subject of music, piano and organs.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "115540654412385238950", "name": "Sue Oden", "time": 1473707507117, "rating": 5.0, "text": "There is something wonderful about coming to Ellis Piano to browse through their music.  I am always treated so courteously and feel valued and wanted as a customer.  This is a rare experience in today's society.  I don't feel like a transaction; I feel somewhat like family.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "114937060095745626999", "name": "Lisa Hall", "time": 1544378173679, "rating": 5.0, "text": "Salesman David was so nice. He was very informative about the product. Very pleasant experience", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "112624522857495453849", "name": "Matthew Langkamer", "time": 1569195716867, "rating": 5.0, "text": "Great selection of classical and pop sheet music. And about three dozen pianos I wanna buy.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "105073025225261485030", "name": "Clay Barnett", "time": 1557853259719, "rating": 5.0, "text": "Great service and helpful folks explaining things. Good sheet music collection too.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "112363574607264582263", "name": "Coby Fuson", "time": 1567899439509, "rating": 5.0, "text": "An awesome place with awesome pianos and kind people.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "106812794086520904637", "name": "Jill Carter", "time": 1521664514829, "rating": 5.0, "text": "I love this place.  They are always so helpful and kind. And because I am a teacher, I recieve 10%off. Which is so wonderful of them.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "117259978054771811622", "name": "Angela Manasco", "time": 1514597570815, "rating": 5.0, "text": "Wonderful experience. Knowledgeable friendly staff. Excellent selection for every budget", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "115214418687047774609", "name": "Ricardo Pedraza", "time": 1546888782602, "rating": 5.0, "text": "Beautiful piano selection with very friendly personnel. If looking for a good piano this is the place.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "101459032627051506681", "name": "StevieD Life Vids", "time": 1480187657109, "rating": 5.0, "text": "Worked with Cory who had watch my wife and I come in a few times over the years.  We finally narrowed down our options in the price range we were looking to spend.  Couldn't be happier with the purchase.  Delivery and setup were perfect and we had no issues.  I would buy from them again!", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "106118232643256540733", "name": "Casey Middlebrooks", "time": 1460377266563, "rating": 5.0, "text": "You can always tell when you buy from a quality, family owned business.  The folks at Ellis Piano were very courteous, knowledgeable, and helped us pick out the best piano for our needs.  I would highly recommend buying from Ellis Piano.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "108073061521346595386", "name": "Brenda Reaves", "time": 1454386461375, "rating": 5.0, "text": "Wonderful experience all the way around! Great Piano, Great Price and Great Service, what more can you ask? :) This piano is a gift for our son, who is graduating college as a piano major and he picked it out. See Chris Reaves review for more details, he's my husband.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "111506453182554934735", "name": "Chris Byrd", "time": 1598839403918, "rating": 5.0, "text": "Beautiful selections", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "106197121139812433422", "name": "Linda Bartlett", "time": 1528906671501, "rating": 5.0, "text": "They are always very helpful and they usually carry the music that I need for my students.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "114578683997239747709", "name": "John Green", "time": 1520708105245, "rating": 5.0, "text": "Beautiful, beautiful piano's. The staff is awesome. Very friendly.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "116364124460632507436", "name": "Kim Vinson", "time": 1458155777649, "rating": 5.0, "text": "David, Corey and Jason Ellis were very helpful recently in helping me choose and purchase a nice upright piano. The staff at Ellis Piano is always very helpful in meeting my needs either as a singer, piano teacher or purchasing an instrument.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "103419430664304935450", "name": "Rus Hardy", "time": 1498777169161, "rating": 5.0, "text": "Some of the friendliest people around!!  Great selection.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "112187373128068655943", "name": "Virginia Blackwood", "time": 1504047594495, "rating": 5.0, "text": "Best music store I have ever been in!", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "115342890563357368190", "name": "TImothy Burns", "time": 1566066240727, "rating": 5.0, "text": "Incredible selection of fine pianos", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "112767678362645238479", "name": "Tony Riddle", "time": 1458834164740, "rating": 5.0, "text": "We have always had a great experience dealing with the staff at Ellis Piano.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "113767253062565218129", "name": "Aaron Joyner", "time": 1518566190556, "rating": 5.0, "text": "Beautiful Pianos and helpful, knowledgeable staff.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "117729702020867245109", "name": "Joel Hinkle", "time": 1555626828375, "rating": 5.0, "text": "Great people and great deals", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "115484730936948464842", "name": "George Benson", "time": 1490140435529, "rating": 5.0, "text": "Great selection of acoustic and digital pianos.", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "104157465691080144718", "name": "Sylvia Jones Davis Stevenson", "time": 1555447921575, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
{"user_id": "100685460720006466165", "name": "jessie pugh", "time": 1496212480675, "rating": 4.0, "text": "Nice, helpful staff", "pics": null, "resp": null, "gmap_id": "0x888918a3544961c1:0x4e608e6bb337b439"}
