{"user_id": "115051376952314422520", "name": "Catie Murphy", "time": 1625685840744, "rating": 5.0, "text": "I was looking for a new way to exercise and mix up my routine. A friend suggested this and I took her up on the offer.  I love the way I feel after each class: strong, toned and refreshed in mind and body.\nI have been taking classes since April and love the changes I see and feel.", "pics": null, "resp": null, "gmap_id": "0x888c2c8177bc0f3d:0x95cc726fbd971dab"}
{"user_id": "110485306258530375688", "name": "Brenda & David Duos", "time": 1629084308980, "rating": 5.0, "text": "I have been enjoying and benefitting from these classes for 3 months! From the very first class, they make sure you feel comfortable and fit right in as if you've been doing this for years! The instructors are so good that you won't miss a beat on your very first class! The variety of classes allows you to select the type of workout you like best! If you're looking for a total body workout with low impact on your joints, I highly recommend it! It's a great way to destress, get energized and get rid of those stiff, achy body pains!", "pics": null, "resp": null, "gmap_id": "0x888c2c8177bc0f3d:0x95cc726fbd971dab"}
{"user_id": "100109229053978717010", "name": "Ann Ron", "time": 1627005803242, "rating": 5.0, "text": "I personally feel better and have more energy and strength throughout an entire day than I used to have. The full body workouts have really helped reduse stress and improve my quality of life.", "pics": null, "resp": null, "gmap_id": "0x888c2c8177bc0f3d:0x95cc726fbd971dab"}
{"user_id": "108417596638783122380", "name": "Molly Gray", "time": 1618496618789, "rating": 5.0, "text": "I have been going to Club Pilates for several months now and have complete over 30 classes. It is a great workout every single time. Everyone on staff has been super friendly! I look forward to Pilates every week. Would highly recommend to anyone who wants a good workout without the high impact on your joints.", "pics": null, "resp": null, "gmap_id": "0x888c2c8177bc0f3d:0x95cc726fbd971dab"}
{"user_id": "117078357670343778324", "name": "Kayla Carothers", "time": 1627648701840, "rating": 5.0, "text": "Love this studio! Great staff and willing to work with you on learning the moves!", "pics": null, "resp": null, "gmap_id": "0x888c2c8177bc0f3d:0x95cc726fbd971dab"}
{"user_id": "112131719858001484388", "name": "Anna K", "time": 1618597278314, "rating": 5.0, "text": "I have enjoyed the experience here so much! The equipment allows for such a great stretch and you use muscles you never realized you had. All levels of fitness can benefit from the classes.", "pics": null, "resp": null, "gmap_id": "0x888c2c8177bc0f3d:0x95cc726fbd971dab"}
{"user_id": "115423118795521981959", "name": "Jennifer Asbury", "time": 1621448134635, "rating": 5.0, "text": "Pilates at Club Pilates has been so beneficial to me already by getting me in tune with my body & learning how to make my muscles work for great strength and tone!  My 11th class was yesterday & I FEEL GREAT!  I'm so happy with the difference I feel about my body & am looking forward to the 20th class to see the difference in my body!  Slow & steady wins the race in this game, so don't be disappointed if you don't immediately see results.  I have had a few people make comments about my arms looking more toned!", "pics": null, "resp": null, "gmap_id": "0x888c2c8177bc0f3d:0x95cc726fbd971dab"}
{"user_id": "102761538603222289649", "name": "Bella Bedgood", "time": 1629212879276, "rating": 5.0, "text": "Love this place! 1 hour class is all you need", "pics": null, "resp": null, "gmap_id": "0x888c2c8177bc0f3d:0x95cc726fbd971dab"}
{"user_id": "101465337151378191065", "name": "Heather Bland", "time": 1618503763135, "rating": 5.0, "text": "Great staff!  Great workout!  I feel better even after only 2 classes!", "pics": null, "resp": null, "gmap_id": "0x888c2c8177bc0f3d:0x95cc726fbd971dab"}
{"user_id": "112683619884424738848", "name": "mori wallace", "time": 1618163893200, "rating": 5.0, "text": "My favorite place to get in a good workout!!! It has really helped with my strength and flexibility", "pics": null, "resp": null, "gmap_id": "0x888c2c8177bc0f3d:0x95cc726fbd971dab"}
{"user_id": "106400612360684161760", "name": "Lora Schumacher", "time": 1618499772901, "rating": 5.0, "text": "I started 11/2/2020 and i feel amazing! My body improves with every class! Yhe ladies are amazing amd fun! Club Pilates is a staplr in my life and um grateful for it!", "pics": null, "resp": null, "gmap_id": "0x888c2c8177bc0f3d:0x95cc726fbd971dab"}
{"user_id": "100268254803701906559", "name": "Heidi Lee", "time": 1599495628296, "rating": 5.0, "text": "Club Pilates is my favorite workout experience.  The teachers are excellent. The class variety keeps it so interesting. In just three months, I feel stronger and more flexible. I do not want to miss. Give it a try. You will not be disappointed.", "pics": null, "resp": null, "gmap_id": "0x888c2c8177bc0f3d:0x95cc726fbd971dab"}
{"user_id": "105431857764393494233", "name": "Latizia O Ceasar", "time": 1625775320403, "rating": 5.0, "text": "The staff and workouts are amazing!", "pics": null, "resp": null, "gmap_id": "0x888c2c8177bc0f3d:0x95cc726fbd971dab"}
{"user_id": "114847380215843144308", "name": "Becky Saunders", "time": 1618602070511, "rating": 5.0, "text": "I love Club Pilates. The instructors are wonderful and the workouts are great!!!!", "pics": null, "resp": null, "gmap_id": "0x888c2c8177bc0f3d:0x95cc726fbd971dab"}
{"user_id": "111546144589603616386", "name": "Natalie Unger", "time": 1600271978014, "rating": 1.0, "text": "I do NOT recommend Club Pilates. I signed up for a three month membership at the ZELDA location in March of 2020, before the pandemic hit. I did one month, and at the very beginning of the pandemic the studio closed. Eventually, the studio decided to re-open in the middle of a pandemic, even though cases were spiking in Alabama. I was (and still am) unable to continue a membership during the pandemic because I have severely immune compromised people in my family. I told them this and they said they'd cancel my membership ... but to my great surprise, I just noticed that they decided to go ahead and charge me for TWO MONTHS - $438 - on my credit card. I received NO notification of this charge at all, and as a result I paid late fees on my credit card. I find it outrageous that in the middle of a pandemic, when people are struggling emotionally, physically, and financially, a business would exploit its clients in this manner. I had hoped to return to Club Pilates once a vaccine is out, but now I will never return or recommend this studio to anyone. I have no initiated a dispute with my credit card company, which means more stress for me in an already stressful time. Shameful.", "pics": null, "resp": null, "gmap_id": "0x888c2c8177bc0f3d:0x95cc726fbd971dab"}
{"user_id": "110364583550903578164", "name": "Deloris Elmore", "time": 1604685987136, "rating": 5.0, "text": "Very friendly atmosphere and everyone there are very helpful to include staff and clients. A small studio which i like very much. I had an excellent workout. Looks like I will be joining this club.", "pics": null, "resp": null, "gmap_id": "0x888c2c8177bc0f3d:0x95cc726fbd971dab"}
{"user_id": "106008235151747934304", "name": "Tanya Hollinshed", "time": 1600709563441, "rating": 5.0, "text": "I am enjoying the classes at club Pilates. I am feeling powerful, my flexibility has improved and my core is getting stronger as well. The staff is amazing and such a friendly atmosphere.", "pics": null, "resp": {"time": 1600809479405, "text": "Thank you for your sweet comments, Tanya! We have SO enjoyed having you as a member in our studio and look forward to seeing you for each class! Being on this fitness journey with you is so much fun!"}, "gmap_id": "0x888c2c8177bc0f3d:0x95cc726fbd971dab"}
{"user_id": "100576844473918346389", "name": "Julianne Hess", "time": 1618586769148, "rating": 5.0, "text": "The staff is great and you ALWAYS get a great workout", "pics": null, "resp": null, "gmap_id": "0x888c2c8177bc0f3d:0x95cc726fbd971dab"}
{"user_id": "109722433164985851995", "name": "Shelby N. Patterson", "time": 1606151699725, "rating": 5.0, "text": "Accessible location. Clean atmosphere. Variety of classes. Knowledgable instructors. Fun times!!!", "pics": null, "resp": null, "gmap_id": "0x888c2c8177bc0f3d:0x95cc726fbd971dab"}
{"user_id": "107642330367765827429", "name": "Ben Arellano", "time": 1599255556630, "rating": 5.0, "text": "I always look forward to my Pilates sessions. I enjoy the physical challenges, satisfaction in my progress, and the atmosphere of professionalism, competence, and expertise of the staff as well the energy from classmates. During this season of social distancing I’m thankful for the opportunity to enjoy the comradery of fellow classmates.", "pics": null, "resp": null, "gmap_id": "0x888c2c8177bc0f3d:0x95cc726fbd971dab"}
{"user_id": "116577942807441389580", "name": "Pam", "time": 1599560706183, "rating": 5.0, "text": "I Love Pilotes!  It is physically challenging, low impact and is an excellent way to get and stay in shape!", "pics": null, "resp": null, "gmap_id": "0x888c2c8177bc0f3d:0x95cc726fbd971dab"}
{"user_id": "100680619367243303342", "name": "Karen Chen", "time": 1592844879210, "rating": 1.0, "text": "do not sign up!!!! the company is a fraud!!!! No one answer the phone!!! I tried to cancel my membership but was told that cancellations are not being processed at this time and I could freeze my account for $15 a month. This is unacceptable!!!!!!", "pics": null, "resp": {"time": 1592876994758, "text": "Dear Ms. Chen,\nWe were quite disappointed to see your comments regarding our studio as we have gone to great lengths to try and keep our members informed of the latest updates and how they would be impacted. We have tried to contact you on multiple occasions without success. We did see that you had called our studio today while we were on the phone with another member and apologize for the inconvenience.\nAs you are aware, when the government ordered businesses such as ours to cease operations, we stopped invoicing all our members for April and May even though the Stay at Home order affecting our studio was lifted on May 11. We moved into June with our operations re-established. We also tried to contact you about the status of your account when your agreed-upon draft was not honored by your bank and we had not received or agreed to any request to modify your agreement.\nI am glad to talk with you about your account if you will let me know a convenient time."}, "gmap_id": "0x888c2c8177bc0f3d:0x95cc726fbd971dab"}
{"user_id": "112467676153580650352", "name": "rjm122763", "time": 1565637172247, "rating": 5.0, "text": "Club Pilates has a variety of classes. There are different levels, so it’s great for beginners as well as advanced athletes. The instructors are very knowledgeable and make each class challenging, but also fun.\nIf your looking for an exercise regimen that will provide you with strength and flexibility, where you will have fun and meet people, Club Pilates is perfect!", "pics": null, "resp": null, "gmap_id": "0x888c2c8177bc0f3d:0x95cc726fbd971dab"}
{"user_id": "114948965734298586024", "name": "Kimberly Mathews", "time": 1618411662987, "rating": 5.0, "text": "Best full body low impact workout ever....each class includes stretching and core strength work that will keep me flexible and strong for all my other sporting activities.", "pics": null, "resp": null, "gmap_id": "0x888c2c8177bc0f3d:0x95cc726fbd971dab"}
{"user_id": "111778163340932975086", "name": "Barbara Eaves", "time": 1515614731213, "rating": 5.0, "text": "Love Club Pilates!  All of the instructors are great and the classes are fun.  This is the first workout that I look forward to going to each day.  You do have to plan ahead and book your classes but once you get the hang of that it is no big deal.", "pics": null, "resp": {"time": 1515622147281, "text": "Hi Barbara! Thank you so much for your great review. We are so glad that you enjoy our classes. We love having you as a member here as well! Looking forward to seeing you in the studio."}, "gmap_id": "0x888c2c8177bc0f3d:0x95cc726fbd971dab"}
{"user_id": "117846579076615735374", "name": "A A", "time": 1513106712225, "rating": 3.0, "text": "The classes and fun and each one is unique. Wish they were more transparent about pricing and fees. Finding an open class that works with my schedule can be next to impossible and it doesn’t help that they do not allow any credits to roll over month to month. I’ll make the most of my membership now but will likely not renew.", "pics": null, "resp": {"time": 1513115506052, "text": "Thank you for your feedback, we truly appreciate it. We are so happy that you enjoy our classes, and that you find them unique! It is never our intention for any member to not understand the pricing and fees, we do review them at the beginning of the contract duration, and send a copy of the contract to the members via e-mail. Please come and speak with the front desk, we would love to help clarify any questions that you may have regarding pricing and help you get scheduled into classes as soon as possible.  Give us a call at 334-603-8055. Looking forward to hearing from you soon."}, "gmap_id": "0x888c2c8177bc0f3d:0x95cc726fbd971dab"}
{"user_id": "109648698539287926918", "name": "yolanda byrdsong", "time": 1581635148902, "rating": 5.0, "text": "I have enjoyed 28 months of strength building at Club Pilates. Come and join the workout on the reformer and other apparatus .", "pics": null, "resp": null, "gmap_id": "0x888c2c8177bc0f3d:0x95cc726fbd971dab"}
{"user_id": "110635303103934638792", "name": "Karen Phillips", "time": 1581435636280, "rating": 5.0, "text": "I have done over 200 classes and it’s been wonderful for my balance and my arthritis! Try a free intro class today !!", "pics": null, "resp": null, "gmap_id": "0x888c2c8177bc0f3d:0x95cc726fbd971dab"}
{"user_id": "101386389191453105774", "name": "Becky Dines", "time": 1508965207316, "rating": 5.0, "text": "I can do workouts at Club Pilates that I can't do at home, stream online or complete in a gym. The equipment is unique and helps me work my muscles in a way that I can't do on my own. The instructors are great and each person brings unique qualities to the variety of classes (would love to see Rob again) and the equipment is really nice. Yes, it is expensive, but attending the classes costs less than purchasing the equipment myself + having reservations keeps me from making excuses not to show up for my workout. Loving it so far! Thank you!", "pics": null, "resp": null, "gmap_id": "0x888c2c8177bc0f3d:0x95cc726fbd971dab"}
{"user_id": "112779659809021979417", "name": "Laura Hodges", "time": 1508334572584, "rating": 5.0, "text": "This is a great experience! Lanie and the staff are very encouraging and helpful. I've done more than I ever imagined here.", "pics": null, "resp": null, "gmap_id": "0x888c2c8177bc0f3d:0x95cc726fbd971dab"}
{"user_id": "110852405838162004338", "name": "Angela B", "time": 1599179621057, "rating": 5.0, "text": "Love this place!", "pics": null, "resp": null, "gmap_id": "0x888c2c8177bc0f3d:0x95cc726fbd971dab"}
{"user_id": "110387503844446862199", "name": "Patricia Williams", "time": 1527274609559, "rating": 5.0, "text": "I have been attending club pilates since it opened. It is one of the best things I could have done for me. I am not athletic and have no prior experience with pilates. I attended the intro class to learn what to expect. I knew from that class and that experience that this was for me. The instructors start each class asking if anyone has injuries they should know about.  There is no pressure to do more than you are capable of. The exercises can be modified based on your abilities. The instructors are ready, willing and knowledgeable about how to modify exercises. As an adult, it is my responsibility to know my body and what I can do. I am stronger and more confident because of these classes and because of the guidance of the instructors. I could go on and on about club pilates east Montgomery. I encourage anyone to experience it for themselves. The instructors are wonderful, friendly, fun and funny. I am a fan.", "pics": null, "resp": null, "gmap_id": "0x888c2c8177bc0f3d:0x95cc726fbd971dab"}
{"user_id": "100746621537565930934", "name": "Natalie Stanley", "time": 1511118127847, "rating": 5.0, "text": "Beneficial and enjoyable exercise...Awesome, well-trained instructors...highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888c2c8177bc0f3d:0x95cc726fbd971dab"}
{"user_id": "107458448834308504197", "name": "Theresa Shanks", "time": 1565801364455, "rating": 5.0, "text": "Always a great experience!!!!", "pics": null, "resp": null, "gmap_id": "0x888c2c8177bc0f3d:0x95cc726fbd971dab"}
{"user_id": "106625911825499007238", "name": "Ed Hinson", "time": 1615754223459, "rating": 5.0, "text": "A great place for movement! They are the best at working with clients to restore range of motion with a holistic approach. All kinds of different classes based on customer needs. They are truly special.", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x131916dc856c04d3"}
{"user_id": "107074339162277475101", "name": "Zoe Wendle", "time": 1510248983806, "rating": 5.0, "text": "Excellent studio for Pilates. Modern and the best equipment with top notch instruction and support. As a former dancer I can appreciate the high quality of the thoughtful workouts they prepare and take you through.  Enjoy it.", "pics": null, "resp": null, "gmap_id": "0x88626b5a58dee519:0x131916dc856c04d3"}
{"user_id": "117330932784253247321", "name": "N H", "time": 1593448721342, "rating": 5.0, "text": "The previous reviews for Studio G say it all—this is an all-around, top-notch holistic experience for the mind, body, and soul. I just recently met Genevieve and Ryan as leaders in the local health and wellness community; you don’t need to have known either of them long to get a deep appreciation for the expertise, passion, and drive that they individually have and collectively share for movement that brings balance to the mind and body. Check them out in person, or, if you’re interested in the art of pilates and intentional healing and want to learn more first—visit Studio G’s fantastic webpage: pilatesgmethod.com!", "pics": null, "resp": {"time": 1593571249479, "text": "Thank you, Natalie! We look forward to seeing you again soon! 😍"}, "gmap_id": "0x88891965b0a72bcb:0x4ef23b7738b92124"}
{"user_id": "115484642538141739506", "name": "Brooke Mason", "time": 1558544807729, "rating": 5.0, "text": "Ryan and Genevieve are amazing!!  Love this place!  I have been going for over a year and can see and feel what a difference it has made in my life.", "pics": null, "resp": null, "gmap_id": "0x88891965b0a72bcb:0x4ef23b7738b92124"}
{"user_id": "104072870705930072610", "name": "Bob Mitchell", "time": 1581538761830, "rating": 5.0, "text": "At age 64 I decided to remove myself from the day to day operations of my business. Early on in my career I had learned the importance of staying in shape.  I found that being physically in shape kept my mind sharp, a real advantage in business.  So, realizing now that I would have more free time I assumed I would work out even more.  The opposite occurred, without the structure of working every day I began to enjoy a leisurely lifestyle.\n\nIt became very easy to just relax and put off exercise until the next day which became the next day and the next day and so on until I quit going all together.  As time went on I began to gain weight and my mind was no longer as sharp.  One day I said to my wife enough is enough I need to do something about this now.  As a longtime client of Studio G – who along with a chiropractor cured her vertigo- she convinced me to try pilates.  I did not even know what pilates was but I thought something different from what I had always done could be fun.\n\nThe first time I did pilates on the reformer I could not believe the total workout I could do without hurting myself.  In fact, I have been going to Studio G for almost 2 years now, I am now 68 years old and I have never hurt any part of my body.  Something I could not say about my other exercise routines, especially as I aged.\n\nPilates with Genevieve and Ryan at Studio G has changed my life.  I go 2-3 times a week where not only do I have an hour of Pilates but spend another hour being stretched and doing release work.  They even taught me how to walk properly - most people don’t walk correctly and it makes a big difference.\n\nNow, I am considerably stronger, more flexible, have better posture with broader shoulders, I have more energy and mentally I feel GREAT.\n\nGenevieve and Ryan make the experience even more enjoyable as they are just wonderful people who I enjoy being around.  Today, besides my wife and I, my two daughter and son go as well.  Ryan and Genevieve feel like a part of our family as we all spend so much enjoyable time together.\n\nI highly recommend Studio G and their entire team.  Thanks Studio G for getting me back in the game of life.\n\nBob M", "pics": null, "resp": null, "gmap_id": "0x88891965b0a72bcb:0x4ef23b7738b92124"}
{"user_id": "102633105624105290593", "name": "Brice Jackson", "time": 1518187949959, "rating": 5.0, "text": "Yesterday I had my first active isolated stretching session with Genevieve. It was amazing! It’s astounding how much knowledge she has. I feel amazing today! I am a local massage therapist and was in severe need. Studio G is wonderful! I will be back soon!", "pics": null, "resp": null, "gmap_id": "0x88891965b0a72bcb:0x4ef23b7738b92124"}
{"user_id": "112883610549380708396", "name": "Mike M", "time": 1554405583856, "rating": 5.0, "text": "G Studio and its founder, Genevieve, are Genius!\n\nThe discipline of Pilates is already a thoughtful blend of mechanics, philosophy, and personal will. Genevieve has added her insights on soft tissue therapy to precise Pilates practice. The results will amaze you.\n\nHer combination of Active Isolated Stretching (AIS) and Myofascial Release (MFR) in a Pilates framework is unique. The many physical fitness benefits of expertly supervised Pilates are a given. The many physical therapy benefits with G Studio stretching and release work mixed in are a huge plus. Experiencing healing while strengthening is a wonderful gift.\n\nAnd all this is housed in a cozy, multi-room facility in easily accessible Homewood. Don’t delay. Sign Up and Thrive!", "pics": null, "resp": null, "gmap_id": "0x88891965b0a72bcb:0x4ef23b7738b92124"}
{"user_id": "104295195749799653182", "name": "Whitney Lutz", "time": 1550939172566, "rating": 5.0, "text": "I’ve been going to Studio G for a year now. Genevieve and Ryan are wonderful. They are truly dedicated to their clients and dedicated to getting you to your fitness goals. They were able to help me get rid of my diastases after having two children. I finally have my pre-pregnancy body back!", "pics": null, "resp": {"time": 1550942958302, "text": "Thanks, Whitney! We love working with you and are so excited you have achieved great results and feel like you again! 😉"}, "gmap_id": "0x88891965b0a72bcb:0x4ef23b7738b92124"}
{"user_id": "107510735349284091962", "name": "Lynn C", "time": 1551820170529, "rating": 5.0, "text": "Studio G is the best pilates studio in all of Birmingham.  Genevieve and Ryan are both passionate about what they do and are so supportive and dedicated to their clients needs, whatever it may be.  I have been a client for many years and love the continued challenge and results I feel and see with every session.  If you are looking to get started with pilates or have prior experience, give Studio G a try.  You will NOT be disappointed, in fact you will thank me!", "pics": null, "resp": null, "gmap_id": "0x88891965b0a72bcb:0x4ef23b7738b92124"}
{"user_id": "106470003765955309216", "name": "Matt McCants", "time": 1513342170753, "rating": 5.0, "text": "What a great amazing place!! I was suffering from back pain and I also had pain in my feet as well as shoulder pain. My posture was off, and I had many imbalances.Since my first day visiting a few months ago until now I am completely pain free!!! I noticed a difference after the first session and that had me hooked!! When you are in pain it’s as if you are bound by shackles and chains. I’m so thankful for Studio G and there awesome staff for freeing me from my Pain and allowing me to enjoy life without limitations!! This place deserves 10 stars!!!!!!", "pics": null, "resp": null, "gmap_id": "0x88891965b0a72bcb:0x4ef23b7738b92124"}
