{"user_id": "112026243492240901233", "name": "Beverly Jones", "time": 1629921064245, "rating": 5.0, "text": "I had a consult with Dr. Pearce for a breast augmentation and possible full Mommy makeover and immediately knew I was in the right place for me! From the moment I walked in the door I felt such a calm and welcoming atmosphere. The entire staff made sure to make me feel welcomed, valued, and comfortable from the time I entered the waiting room until leaving their office. Dr.Pearce was so personable, super informative, down to earth and most importantly made me feel comfortable and at ease the entire visit. I never once felt pressured or like just another person to him. He made sure that I knew he was there for me and answered any and all questions that I had and made me feel like I was his only patient that day! I would recommend this office and their entire staff 100 times over!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "107818783870282095238", "name": "Renee S.", "time": 1628636670756, "rating": 5.0, "text": "I am one to read reviews but never write them.   I really felt today I should take the time to mention how wonderful Dr. Pearce and his staff are.   Dr. Pearce listens to your concerns and then offers great suggestions.   The entire staff makes sure everything is perfect as far as medical history, medications needed, and appointments times confirmed.   Very happy with results.   I would highly recommend Dr. Pearce!!!!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "102427215022468456537", "name": "Bonnie Bartelt", "time": 1626815071875, "rating": 5.0, "text": "Dr. Clinton is not only a great and experienced Plastic Surgeon, he is very knowledgeable, compassionate, honest, patient and a great listener. He is very honest about expectations and makes sure he understands your motivation for the procedure. He suggests procedures that will provide results his patients want.  Dr. Clinton is patient with consultations and gives the patient as much information as possible. He encourages questions and concerns. His office is beautiful, clean and safe. The staff are very welcoming, personable, well trained and accessible.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "110052406277948168690", "name": "Amanda Favret", "time": 1628872869869, "rating": 5.0, "text": "I had a lovely experience at Reveal Beauty. I was immediately and kindly greeted at the entrance and promptly brought to my consultation room. My nurse, Amanda was so professional and patient with me. She noted importantly things in writing and was patient in answering all of my questions. Dr. Pearce then met with me and further answered questions. He made me feel so comfortable and I never felt rushed. He is extremely knowledgeable and dedicated to the best result for me! I’m so pleased with this practice.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "116320076063752448614", "name": "Becky Corbin", "time": 1629755930131, "rating": 5.0, "text": "I couldn’t ask for a better experience than I had here!!  From the first phone call to the surgery itself everyone was Great!!  Dr. Pearce did a wonderful job with my surgery.  He was very caring and personable!!  I highly recommend them!!!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "104205917921472322269", "name": "Greg Craven", "time": 1630103115377, "rating": 5.0, "text": "My wife visited Dr. Ben and she is very happy.  She was concern because she needed to remove a pimple from her face. Since it was on her face she was worried about the scar. Ben answer all her questions and listen to her concerns. Today she feels very happy with her treatment and totally recommend Reveal Beauty.  Happy wife.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "103794560695178676957", "name": "Hayley Jordan", "time": 1627939944957, "rating": 5.0, "text": "I felt right at home! They make everything feel so comfortable. Extremely warm and welcoming. My constant was amazing. Dr. Clinton has excellent bedside manner and I can’t wait to get my procedures done with him.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "106993705007275958401", "name": "Dena Burt", "time": 1629754525601, "rating": 5.0, "text": "Very professional and friendly staff... Very caring atmosphere and always available.  Would definitely recommend Reveal Beauty to others.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "101402254410662750034", "name": "Katherine", "time": 1626889910032, "rating": 5.0, "text": "Dr. Pearce is very personable and has a calm demeanor- which is wonderful if you are trying out a treatment for the first time. He gives his advice but also listens to your input. I highly recommend seeing him at Reveal Beauty. I will be back!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "107478467670964153529", "name": "Jessica Wright", "time": 1620174466246, "rating": 5.0, "text": "I came to see Dr. Clinton for breast augmentation. He was so thorough in explaining to me my options during the consultation. I booked my surgery with ease and the price was very reasonable! I am extremely pleased with my brand new breasts. Dr. Clinton and his staff took excellent care of me before, during and after my surgery. I recommended Reveal Beauty to everyone I can!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "115927017983349733906", "name": "Jasmine “Queen Jazz” Webster", "time": 1628706258333, "rating": 5.0, "text": "I would highly recommend this office! Everyone was very welcoming and understanding! They explained everything thoroughly and were very honest!!Cant wait to come back!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "106656710418601987094", "name": "Elizabeth Sandoval", "time": 1620334025777, "rating": 5.0, "text": "This is not a practice that tries to get as many patients moved through as possible. They truly care about the individual. They take as much time discussing your treatment with you as you need. They make you feel as if you are their only patient. Professional atmosphere, highly skilled doctors, amazing results, and competitive prices. I have used both doctors for several treatments and procedures and will return. The staff deserves as much praise as the doctors.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "114674314465351263819", "name": "Marshella Dimples", "time": 1615306870531, "rating": 5.0, "text": "I got a tummy tuck and liposuction on December 23, 2020. Everyone there is very nice. Dr. Ben Pearce did my surgery, he was upfront about everything and I did exactly what he told me in order to heal properly. I love my results even though it's only been 2 months since my surgery. Just starting to work out again and I'm loving that as well. Thank you Dr. Pearce for a wonderful new beginning for me!🙏👍😃. By the way he has a very pleasant demeanor 🤭", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "104432013513888637001", "name": "Ashley Peck", "time": 1620408850349, "rating": 5.0, "text": "I am very happy with my breast augmentation results! Dr. Pearce and his staff did an amazing job from consultation to post-op appointments. I have wanted this procedure done for several years but have been nervous to follow through with it. Dr. Pearce and his team calmed my nerves through thorough explanations. He also heard my concerns and answered all questions I had. I am very happy with how they turned out how natural they look!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "100940892227686590874", "name": "Kayla Carlisle", "time": 1626796572937, "rating": 5.0, "text": "Dr. Pearce and Amanda have been so amazing!!! I had a breast reduction and lift and from the time I scheduled my consult to my surgery and recovery Dr. Pearce and his team have been nothing but amazing. They have always made me feel welcome and comfortable. I am EXTREMELY pleased with the way my breast look! I was so nervous of a botched surgery but that was the furthest thing from what I got.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "114436413897210839830", "name": "Sharon Jacobs", "time": 1628873456487, "rating": 2.0, "text": "I was discharged and it was not caught until the day of my surgery.  I had to ask about a refund again on my one week check up.  I got breast implants, but the did not listen and put in smaller than I requested. The staff are very nice as is the dr.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "109310350645111110251", "name": "Angel Tumlin", "time": 1623169297429, "rating": 5.0, "text": "Excellent Experience! Dr. Pearce and Staff are Amazing! They are Professional Christians, Courteous and Patient.  I'm 5 weeks out from a Breast Removal & Replace and an Abdominalplasty, I can't help but smile every time I see myself in the mirror.  (Mainly because of the Abdominalplasty).  My results are Fabulous. Thank you Dr Pearce and Staff for getting rid of something my vigorous workouts couldn't.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "108323740588458895113", "name": "Kristen Steffes", "time": 1612988618255, "rating": 5.0, "text": "I cannot say enough great things about Reveal Beauty! Dr. Pearce is amazing! I had a tummy tuck done 2 months ago, and I could not be more pleased with my results! Dr. Pearce was able to answer every single one of questions as well as give me answers to questions I didn’t think to ask! He is very professional and his bedside manner is great! He makes you feel extremely comfortable, and his work is phenomenal! I highly recommend Reveal Beauty and Dr. Pearce for any work you need done!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "110404015474441503061", "name": "ciara staley", "time": 1628897227761, "rating": 5.0, "text": "The process from beginning to end has been exceptional! I couldn’t have asked for a better surgeon. Dr. Pearce is professional, kind, willing to answer any questions to ease your mind of any doubts. He performed a breast reduction on me. My preop appt was very organized & had everything laid out to perfection. As someone who loves organization & wonderful staff.. I definitely give 5 stars! I came in nervous in the beginning because I was unsure of what I was getting myself into, but I will be coming back & will recommend anyone to use this facility! Thank you for everything, Dr. Pearce ❤️", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "109166528605394248210", "name": "Addy M", "time": 1626801563698, "rating": 5.0, "text": "I had a breast reduction done by Dr. Peace and was thoroughly satisfied with my end results. Dr. Pearce and his staff made the experience very comfortable and professional!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "113875461594369777068", "name": "Mary Rogers", "time": 1624885785554, "rating": 5.0, "text": "Very pleasant first time visit. Reid was so sweet and explained what she was going to do and how it would feel and sound. I am looking forward to next visit.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "101752389183448433809", "name": "anne m.", "time": 1619194729957, "rating": 5.0, "text": "The entire office is calm, friendly and efficient.  Dr.Pearce performed my procedures and is fantastic.   I have been beyond pleased with the results!  Dr. Pearce also takes the time to listen and address any and every question.  I highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "108530787917842534866", "name": "Julia Eaton", "time": 1620838149358, "rating": 5.0, "text": "I absolutely love Dr Clinton and his staff. They truly practice what they preach on their ads. He wants you to love the body and features God gave you by just revealing the beauty you already have.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "112364991743331151534", "name": "Mia H", "time": 1615313884290, "rating": 5.0, "text": "I attended a consultation today with Dr. Pearce. I really enjoyed myself!!! Dr. Pearce was very kind, attentive, informative and honest. I am so excited about scheduling my procedure with Dr. Pearce. He really made me feel very secure about choosing him for my procedure (bbl). His assistant Abigail was very pleasant, professional and represent the center well.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "105795136752822848562", "name": "diane clark", "time": 1621436649706, "rating": 5.0, "text": "Never have a met a more compassionate staff and physician. I am always pleased with the care and professionalism that I receive there. Thank you, Dr. Clinton and staff!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "108398719596201097153", "name": "Bj Babineaux", "time": 1614045957670, "rating": 5.0, "text": "Reveal Beauty   Dr.Pearce is wonderful, polite,clean, caring, all around wonderful man and doctor. I came in alil worried with a lot of questions, but Dr.Pearce made me comfortable from the moment he stepped in the room, he listened to what I wanted, explained how it all would take place step by step, didn’t rush me at all. Dr. Pearce called himself to check on me and was always available so if your looking for a comfortable secure safe trusted doctor please go see Dr. Pearce you’ll feel so safe and satisfied. I knew I had found my perfect doctor at that moment. The staff are a group of beautiful kind hearted young women that make you feel so welcome and so attentive to everyone.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "115092804693793169452", "name": "Leighton Hope", "time": 1626709795277, "rating": 5.0, "text": "Dr. Ben Peace did an amazing job and was very thorough in answering any questions I had throughout the entire process!!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "100496601275715415874", "name": "Andi Watson", "time": 1622845006995, "rating": 5.0, "text": "Dr. Pearce was great! He was respectful and really listened to my concerns and questions.\n\nMy surgery was today and his entire staff were angels. I couldn’t request Dr. Pearce and reveal beauty more!!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "106280962465577133427", "name": "Abby Jones", "time": 1618409623818, "rating": 5.0, "text": "I loved my time at Reveal Beauty! I have gone to both Dr. Pearce and Dr. Clinton for injectables and cannot recommend them enough. They make the experience comfortable and enjoyable. I love that my results have a natural look - my friends notice a beautiful change but never “too much” work!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "117040747808528741272", "name": "ashley phillips", "time": 1617996547052, "rating": 5.0, "text": "Dr. Pierce did 1cc on my lips an they are amazing! I plan on coming back for another! He is nice, intelligent, and professional with his work. I have absolutely no worries about my upcoming 300cc breast augmentation surgery.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "117224495669370471237", "name": "Kathi Conn", "time": 1618069884804, "rating": 5.0, "text": "This experience was such a delight because everyone who assisted Mike Clinton the surgeon were so delightful. Everyone made it so comfortable for me and the time there was so pleasant. I was introduced to all staff and they were such beautiful people.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "117815413590442661993", "name": "tracye roberts", "time": 1616794792870, "rating": 5.0, "text": "I had a phenomenal experience at Reveal Beauty with Dr Ben Pearce.  I have had fillers with him and recently the baby pixel.  I am loving the results!!  Everyone there is friendly,  informative and made me feel very comfortable and at ease about the procedure!!  They are simply the best!!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "101961806929468494559", "name": "Lori Deavers", "time": 1623173527501, "rating": 5.0, "text": "Dr. Pearce and the staff are very knowledgeable and personable. The care is comprehensive and everyone makes you feel comfortable during your visits!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "106453049076351066542", "name": "Caroline Moore", "time": 1620334994720, "rating": 5.0, "text": "I am so impressed by Reveal Beauty.  I had always been reluctant to go into a plastic surgeon’s office, unsure of what to expect. I am in my late 50’s and I didn’t think it was something I would ever do. However, after hearing recommendations from friends I decided to give it a try. I am so glad that I did! From the moment you walk in the door you are greeted with professionalism and friendliness. It is such a serene and easy experience. I went in for a consult with Dr. Clinton and was so impressed. He is a great listener and spent so much time with me. He listened to my concerns and what I wanted to address then offered solutions ranging from surgery to less intrusive options. One of the things I like best about this office is the absence of pressure to do anything that you may not feel comfortable with or ready for. Their office policy is truly reflected in their name “Reveal Beauty”.  The doctors emphasize enhancing your individual beauty, with the objective of achieving a relaxed more youthful look rather than an overdone look. I underwent the C02 laser treatment and the results are amazing! So worth it! In addition to the professionalism and competence of the doctors, the staff is so friendly, kind, patient and helpful. I especially appreciated their follow up after my procedure. They are all so focused on the patient’s wishes and comfort during consult and treatment. I was so impressed that I will be returning for a bleph.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "109800919414892745307", "name": "Carol Colbert", "time": 1629237064552, "rating": 5.0, "text": "Always courteous and kind.  Dr. Clinton listens intently to your desires and then makes it happen to the best of his ability while exercising his best judgment.  I have always been grateful for his care and look forward to my next procedure!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "106625872096916195428", "name": "Karin Favret", "time": 1618759648004, "rating": 5.0, "text": "I recently received injectables from Dr. Ben Pearce and I had the most pleasant experience. I am new to injectables and he was patient, gentle, and made my experience so enjoyable. My results are more wonderful than I could’ve imagined. I booked my next appointment right after so I can keep my skin looking so radiant. Thank you Dr. Ben Pearce and Reveal Beauty staff. See y’all soon!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "114305229994471316624", "name": "Erica Culver", "time": 1614196033303, "rating": 5.0, "text": "I have nothing but great things to say about Dr. Pearce and the Reveal Beauty staff. They are very personable, respectful and patient. I am very pleased with my experience and my results. Highly recommend!!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "111447198974765983985", "name": "Lena P", "time": 1618414525982, "rating": 5.0, "text": "The staff made you feel welcomed and they were friendly. They made you feel special. The Dr. even took the time out to speak to my boyfriend over the phone about my situation.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "108049339704528247718", "name": "Courtney Ridgeway", "time": 1626122325989, "rating": 5.0, "text": "The staff are wonderful and make you feel comfortable every visit.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "111714263326062142531", "name": "Candy Pruitt", "time": 1625241497472, "rating": 5.0, "text": "Very Professional and wonderful environment. Will go back for facials.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "102565549156991076414", "name": "katie caldwell", "time": 1617043903217, "rating": 5.0, "text": "I can't say enough about Dr. Pearce and all of his staff! The whole experience succeeded my expectations- his knowledge of what I needed and understanding exactly what I wanted, the extreme friendliness of the staff, etc. This is the only plastic surgery clinic I will ever use or recommend.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "108470955564269040465", "name": "Donald Smith", "time": 1615303581163, "rating": 5.0, "text": "Great experience, friendly, courteous and responsive team led by Dr. Pearce. Took care of my issue and I'm happy with the results, wholeheartedly recommend Dr. Pearce and the entire team at Reveal.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "111660154875585703749", "name": "Tonia Patterson", "time": 1616792233054, "rating": 5.0, "text": "I was lucky enough to meet Dr. Ben Pearce on March 17, 2021 for Botox and my very first ever fillers around my laugh lines and jowls. What a difference I immediately saw with the filler. He put my serious fear at ease about needles and numbed me up really well before he began. I appreciate how he examined my face to determine the best areas to inject and took his time while injecting both the filler and Botox.  I absolutely love the results. I highly recommend Dr. Pearce and will definitely be seeing him in the future for Botox and touch up filler! Wonderful experience!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "108275616061571585783", "name": "Brandy Erickson", "time": 1614901156733, "rating": 5.0, "text": "Dr Pearce and the amazing staff at Reveal Beauty made this a no brainer! From beginning to end I have felt comfortable with the decision I made to undergo a tummy tuck. I have had scars across my abdomen from pyloric stenosis & an appendectomy. Unfortunately, I have also had no ability to get a six pack, no matter how hard I worked out nor how thin I was...this was a favorite benefit of the surgery as Dr Pearce fixed my abdominal muscles so they’re United, I have the ability to actually use and feel my abdominal muscles! The care, patience & thoughtfulness I received while under Dr Pearce’s care was unlike any other! I highly recommend anyone interested in having “you’re best You” going forward, check out Revealing Beauty! You will absolutely be impressed with them & your new You!!!!\nPS\nThere are some amazing side effects of this bright new YOU.... you’re going to love your results so much that you’re likely to be dedicating much of your time to fitness, which is going to force you outta the coronavirus depression & into a vibrancy & inner confidence that is an extraordinary bonus!! Hello Healthy, Happy, New You!!! 😍🥰😍", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "112777326084003334509", "name": "Lauren Nathanson", "time": 1597340248364, "rating": 5.0, "text": "Dr. Ben Pearce did a fantastic job in aiding me on my journey of  becoming more comfortable in my own skin with his treatment. He has excellent bedside manner and is genuinely kind. One of my favorite things about Dr. Pearce is his honesty. I went in wanting two treatments, and he was open about me only needing one and not both. He was able to kindly and gently offer suggestions about products or treatment I may need or from which I would benefit the most. I could not have been happier with my choice of doctor.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "106973249638788602338", "name": "Jack Burnette", "time": 1613001597118, "rating": 5.0, "text": "Dr. Clinton and Dr. Pearce are wonderful to work with and I am very pleased with the procedures I have had done to improve my self image. All of the staff are wonderful to work with as well.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "116971096314887989165", "name": "Malcolm Bonds", "time": 1597539499730, "rating": 5.0, "text": "I was impressed with Dr. Pearce from the moment I met him. He's very caring and attentive.  He said something at my initial visit with him that really made me decide it was he that I wanted to do my surgery.  He said, \"I like doing surgery, but.\"  The \"but,\" was in reference to the procedure I wanted him to preform, with some doubt if the surgery would achieve what I wanted.  I really appreciated his honesty. So I agreed, regardless of the outcome, because I didn't like looking my  turkey neck. I was more than satisfied.  I was so happy to see my new look.  I think of him everyday when I look in the mirror.  As well as being more than satisfied with his work, I enjoyed his bedside manner.  He was fun to get to know.  I can't say enough good things about his work and his personality.  I am forever grateful.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "103293470413906752223", "name": "Jenah Connell", "time": 1614812621269, "rating": 5.0, "text": "I am so pleased with my experience! I love Dr. Pearce!! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "106821457141938104848", "name": "Lindsey Kurnick", "time": 1604422012844, "rating": 5.0, "text": "I have had the best possible experience with Dr. Pearce. From the moment I made my consultation the service was first class and he made me feel incredibly important. Each time I walked in the door I was greeted by name and seen rather promptly. I had a full tummy tuck, breast lift and Lipo off my lower back. Just as anyone else my end result was really important to me and Dr. Pearce went above and beyond, he didn’t leave me with a narrow straight up and down body that I see so often with TT, he made sure I had a nice hour glass shape, he worked some serious magic with my breasts also, they don’t look like I’ve breast fed 3 kids at all. Dr. Pearce listened and understood my lifestyle and I could not be any happier with my results. I am so glad he is whom I trusted to do my procedure. I truly cannot say enough good things about him as a surgeon. After consulting with several surgeons there is no doubt that Dr. Pearce was the absolute right choice. Thank you so much for giving me my confidence back.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "101681631126507351574", "name": "Jamie Loyd", "time": 1596588780754, "rating": 5.0, "text": "I’ve been wanting lip fillers for a long time and I finally got the courage to do it.. Dr Pearce made me feel super comfortable with my decision and did an amazing job. I’m super happy with the results!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "103331145800892253587", "name": "corey hooks", "time": 1613592410099, "rating": 5.0, "text": "Staff is always so helpful and friendly. Nice, clean office and rooms.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "108892750223586502413", "name": "Lorrie Lawson", "time": 1614099151685, "rating": 5.0, "text": "Everyone here is so friendly and professional. I wish all clinics had to set their standards after this one", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "115069428222293044941", "name": "Sarah Singleton", "time": 1598222091401, "rating": 5.0, "text": "I recently had a surgical procedure with Dr. Pearce. He was amazing to work with. He was patient with when I had so many questions about what I wanted to have done. He was honest and helpful in making my decision for what I needed and wanted. I was absolutely amazed at my results. I couldn’t have picked a better surgeon.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "113203346116619643353", "name": "Tannas Knox", "time": 1597091794891, "rating": 5.0, "text": "I had a Mommy Makeover 8 weeks ago and I am very pleased with the work Dr. Pearce did.  He had great bedside manners and was a professional at all time.  My results are wonderful!  (Full tummy tuck with breast lift and implants).", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "112023012641543168432", "name": "Sarah Raines", "time": 1597090763060, "rating": 5.0, "text": "Dr. Pearce gave me fantastic Botox! In fact it’s because of him that now I’m hooked! Thank you Dr. Pearce! Not only did it get rid of my wrinkles, it made my self confidence about getting older so much better! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "109145480824201918841", "name": "Saray Jimenez", "time": 1616608151821, "rating": 5.0, "text": "Great service! Wonderful pleople!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "115526081453099315629", "name": "Heather Wills", "time": 1597106557619, "rating": 5.0, "text": "Dr. Pearce was simply fantastic to work with. He listened carefully to what my goals were and he explained carefully how we were going to get there. Throughout entire process (from consultation through post operative visits) Dr. Pearce was very responsive. I am thrilled with the results of my bleph and eyebrow lift", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "109509792058881069360", "name": "rm martin", "time": 1597359996884, "rating": 5.0, "text": "Over 20 years ago, I had a breast reduction and have never been happy with results...scarring was horrible  and the left side significantly larger. I consulted Dr. Pearce for a scar revision and breast lift. He took the time to really listen to my concerns and ensured that we were agreement about how to correct my issues while still getting a desired result. I am truly amazed and thrilled with the results! My breasts are symmetrical, the scars are now clean and match on both breasts, and they are so perky! Dr. Pearce made himself available to me for any post-op questions or concerns via text or email, even after hours. He is very pleasant and friendly. I highly recommend him for any procedure!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "102449678090596944426", "name": "kimberly hockett", "time": 1597011921624, "rating": 5.0, "text": "I have had such a great result  from my surgery with Dr. Pearce. He is so professional and patient with answering your questions. I had liposuction done abdominoplasty and also my breasts done and I must say I do look amazing .I want to thank him for all the work that he's done for me. He's a great surgeon.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "107435723756011240083", "name": "Morgan Hepburn", "time": 1597062329015, "rating": 5.0, "text": "Dr. Pearce repaired my earlobes after I had gauges. He did a wonderful job. It was a painless experience, and I’m without scars. Dr. Pearce is attentive to his patients and listens to their needs. I highly recommend his work.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "100761744466251540006", "name": "Marc Stowe", "time": 1597026442272, "rating": 5.0, "text": "I had a facelift, neck lift, facial fat transfer and blepharoplasty done by Dr. Ben Pearce, and I could not have had a better experience.  This talented young doctor and I were on the same page from day one as to what results I should expect.....he's extremely personable, and I was very comfortable and at ease at every step of the process.  I have had so many compliments on Dr. Ben's work, and if I ever want anything else done, he is the only surgeon that I will consider.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "100432279153255092958", "name": "since since", "time": 1600334345402, "rating": 1.0, "text": "The operation was performed and we injected fat. As for the back fat sculpting, the result was negative, as the area was not sculpted.  As for the waist, one more area was carved than the other for fat injection, so the result was not very satisfactory.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "101793818919204255863", "name": "karin mayes", "time": 1597008015031, "rating": 5.0, "text": "Dr Pearce is really great. Takes time with patients and my results were the best. I highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "117131004280846183970", "name": "Katherine Hilton", "time": 1600818320180, "rating": 5.0, "text": "Dr. Pearce was great, and the office staff is absolutely the friendliest, most personable group I’ve ever met in a doctor’s office. Great experience!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "115653337496094062205", "name": "Dan Back", "time": 1580759448568, "rating": 5.0, "text": "Very Pleased with my results from the surgery I had done. I was pain free after my second day post operation. Dr. Clinton’s staff is also very good, they always greeted you with a smile and were happy to help you with anything you needed. Overall great experience for me and will be recommending people in the future if they are looking for a plastic surgeon in the Birmingham area", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "113750725057884982844", "name": "Jill butler", "time": 1597006162540, "rating": 5.0, "text": "I cannot say enough good things about Dr. Pearce and his bedside manner. I have had 2 rounds of plastics with him. First round included breast lift with augmentation, tummy tuck and lipo of my lower back. Second round consisted of a thigh lift and brachioplasty. After losing 100+ pounds I needed a complete overhaul and Dr. Pearce delivered. Dr. Pearce answered every question and concern I had throughout the process. I could not be more pleased with my results and the surgeon I chose.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "112609001276318413787", "name": "McKenzie seale", "time": 1568739391377, "rating": 5.0, "text": "I can not say enough good things about Dr. Michael Clinton and his staff. He made me feel so comfortable during my consultation. He knows exactly what to do with your body type and how to make you feel confident in your own skin! I highly recommend Dr. Clinton for anyone wanting plastic surgery. He is the absolute best! I am two weeks out of surgery and feel and look amazing! Thank you, Dr. Clinton.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "101182763387778661774", "name": "Kayla Posey", "time": 1594996628310, "rating": 5.0, "text": "Amazing staff and doctor! Great results! Everyone is very helpful and kind! Will visit again.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "116891258207485219507", "name": "rio suiter", "time": 1597006738229, "rating": 5.0, "text": "I couldn't be more thankful for Dr. Pearce and his staff! He is a wonderful surgeon and has great bedside manner! He has done fillers for me as well as extensive plastics after my 100+ pound weightloss! My first round included a tummy tuck with muscle repair, mons lift, lipo to flanks and breast augmentation. I couldn't have chose a better doctor if I tried!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "102305406849022843866", "name": "Holly Davis", "time": 1597176890166, "rating": 5.0, "text": "Dr. Pearce performed my surgery TT,MR, explant/implant , lipo to face and neck , arms , and flanks, and inner and outer thigh area . I am elated  with my results . He is an amazing doctor. With my consultation he took so much time with me and listened to what I wanted to achieve also offering his recommendations also which I valued as a patient .  I couldn’t have asked for a better doctor with my care . Also aftercare he was available for every question I had with the healing process and what to expect He absolutely loves his patients . I would highly recommended him to anyone .   And I definitely will be back in the future !", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "100729660947715814836", "name": "Dinah Wilson", "time": 1616273283929, "rating": 5.0, "text": "Staff is very friendly and accommodating.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "115617848946511888534", "name": "Brett Lane", "time": 1597020839856, "rating": 5.0, "text": "Dr.Ben Pearce- did a fantastic job ! Happy with all the results- Very professional- very happy !", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "116733555559653516617", "name": "Juanetta jemison", "time": 1556764720420, "rating": 5.0, "text": "Very friendly and caring staff. Dr. Clinton is an awesone Christian man. He makes you feel  comfortable with his care. I immediately fell in love with Dr. Clinton and his staff because they treat you as though you're their only patient. There is no overbooking, so you're seen at your appointment time. If you're driving from outside of the area, you have the option to stay in a very comfortable suite over night after surgery. The office is beautiful and serene. Dr. Clinton and his staff would be my only choice for future surgeries.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "107781298211084903827", "name": "tori watkins", "time": 1580919684576, "rating": 5.0, "text": "I absolutely love Dr Clinton and his staff! So warm yet professional.  This was my 2nd breast reduction and I could not be more pleased!! I had very little pain and had no problems reaching someone when I had questions or concerns. I recommend on the highest level!!!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "117181083170385520784", "name": "Meghan Bullard", "time": 1496355381746, "rating": 5.0, "text": "So glad I went to Dr. Clinton over all the other surgeons!! First, the office is beautiful and makes you feel at home. The nurses are incredibly sweet and go the extra mile to give you all the information to help decide what's best for you. I had such a dilemma deciding whether to use saline or silicone, and the nurse even met with me an additional time before surgery to help me decide. Best of all, Dr. Clinton is excellent! I trusted him completely to do the best job and he did! I am thrilled with my results and he always made me feel comfortable. The office staff knows you on a first name basis and worked with me so much to make it all possible! Thank you all so much!!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "114172221238102040442", "name": "Chris C", "time": 1475715251978, "rating": 5.0, "text": "Dr. Clinton and his staff are incredible!  They treat you like you're part of the family.  I was so impressed by the professionalism and overall care they provide.  Dr. Clinton is a gifted surgeon and his work is proof of that.  I highly recommend him for all your PS needs.  I know I wouldn't go anywhere else.   I love everything about this office!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "102550042637337149472", "name": "Jo Ann Milam", "time": 1478273579254, "rating": 5.0, "text": "Great staff, office run very well. Medical assistant very informative and helpful. Dr. Clinton has great bedside manner, very respectful of my feelings and concerns. Due to my age (62) he was especially cautious about my overall good health and required my internist to sign off on surgery. Dr. Clinton did a phenomenal job, I'm extremely pleased with entire experience!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "104046441067294581738", "name": "Lila Bowman", "time": 1593553861159, "rating": 1.0, "text": "Don’t waste your hard earned money!! Lipo 👎🏾", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "104802796768613823837", "name": "Patricia Sanford", "time": 1451597423334, "rating": 5.0, "text": "Everyone has been so kind and helpful. My husband was very pleased also with the care I received. It really impressed him when Dr. Clinton said that he had consulted with another doctor about my procedure. He said that let him know Dr. Clinton was not arrogant, even though he had been doing this for a long time: he didn't think he knew everything. He was also impressed when Dr. Clinton called that night to check on me. My experience was great.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "111303462107814301296", "name": "Stacy Lovoy", "time": 1529420639836, "rating": 5.0, "text": "I am only 1 month post op and I am already so pleased with my breast reduction and abdominoplasty! The entire staff at Clinton Plastic Surgery Staff has been so helpful with every question or concern I had. Dr. Clinton goes above and beyond to not only to meet my expectations but to also help me understand the work he can do. Bar none...I will be a return patient!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "113915624348548161714", "name": "Tiffany Horne", "time": 1528317314522, "rating": 5.0, "text": "Dr Clinton and his staff are top notch. I went in for a breast reduction and then 2 months later had him fix an unrelated issue that was going on. Everyone there is so nice and understanding. I never felt uncomfortable or embarrassed. They truly care about making their patient’s lives better.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "111726792489017953331", "name": "Jessica Jennings", "time": 1532726744923, "rating": 5.0, "text": "Absolutely grateful and completely happy with my results. The people are amazing. Dr. Clinton is beyound heaven sent. If I could say Thank you a million times it still would not be enough. My life is forever changed and every single person whom I have got the plessure to speak to or deal with through out this amazing journey I owe my Thanks to. Dr. Clinton himself will forever hold a special place in my heart for giving me this chance to feel normal and beautiful. Thank you a million times ❤", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "102664563082042986110", "name": "Marie Walker", "time": 1470245007938, "rating": 5.0, "text": "Over a period of several years, our each and every encounter with Dr. Clinton, his expertise and professional, caring office staff has been a wonderful experience. Not only is Dr. Clinton a skilled and qualified surgeon I feel can trust, but the atmosphere is one of respect,warmth and integrity.. I absolutely would recommend Clinton Plastic Surgery!! An answer to prayer for me!😊", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "110146811821611530628", "name": "Meredith Stutts", "time": 1487211627335, "rating": 5.0, "text": "From consultation to post surgery follow up Dr. Clinton and his staff were amazing. My only regret is that I didn't do the surgery years ago. I would highly recommend Dr. Clinton. If you are questioning surgery go for a consultant and you will not regret it.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "116658687072069349306", "name": "Desiree Spies", "time": 1521139441089, "rating": 5.0, "text": "I had upper and lower eyelids,  lower facelift and Pixel treatment on Dec 4. Could not ask for better care. Recently went back for more filler around my nose and mouth, quick and relatively painless!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "105626595467630908793", "name": "Leah Carmichael", "time": 1466469693662, "rating": 2.0, "text": "I saw Dr. Clinton several times for various non-surgical procedures over a period of years. I went to  another doctor to save money once and came right back to Dr. Clinton. Even though he isn't the cheapest place in town, I felt his expertise was worth the extra cost. However, the last time I was in his office the staff was extremely rude. He instructed me to call anytime with questions about the products I purchased. When I did his assistant refused to come to the phone. She told the receptionist that I needed to schedule an appointment if I had any questions. I made a comment to the receptionist that I could purchase products from another doctor if they weren't willing to support me. She told me not to get defensive. Considering I've spent thousands of dollars with the practice I expected to be treated with more respect. It's unfortunate that I will have to find another doctor with the same good qualities as Dr. Clinton, but I refuse to put up with snobbish office staff.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "101220539530012974324", "name": "Misty Doles-Busic", "time": 1486662327127, "rating": 5.0, "text": "Dr Clinton and his staff have always been so accommodating and compassionate. I always feel relaxed knowing that I'm taken care of when I'm in their hands. I would recommend Dr Clinton to anyone!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "103924015391053054446", "name": "Vicki Grey", "time": 1486668843088, "rating": 5.0, "text": "The staff and doctor were very informative, friendly and honest. After leaving my appointment, I was very satisfied and knew that I did not need to look any further. I found the doctor for my surgery. I feel at ease and confident about choosing Xlinton Plastic Surgery.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "100033516828101139358", "name": "Chelmense Gladness", "time": 1486667918371, "rating": 4.0, "text": "Really nice atmosphere. The doctor was very personable and he explained everything thoroughly.   He answered all of my questions as well.   The staff was very nice too.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "102385238273217299293", "name": "Heather Read", "time": 1495461958035, "rating": 5.0, "text": "A truly great experience!!  The staff was so friendly and warm, the office was so inviting and comfortable!  Will definitely go back and recommend to all of my friends and family!!!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "106480919617111303005", "name": "LISA MCDANIEL", "time": 1559746702384, "rating": 5.0, "text": "Great staff. DR. Clinton is so nice! Very good experience!!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "104497701922802239280", "name": "Milca Hernandez", "time": 1542215460434, "rating": 5.0, "text": "Docto Clinton, is excellent in what he does, his staff is very professional and go above and beyond what their duties are.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "116626871350128736542", "name": "Sheila Snoddy", "time": 1486665051181, "rating": 5.0, "text": "What an amazing helpfu group. They made what could have been a scary experience the absolute best with so much one on one attention and care.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "111443709517492356675", "name": "Cassandra Hall", "time": 1508279522515, "rating": 5.0, "text": "Iam60 yrs. old and  I had an  adbominalplastic sugery. I was very pleased with my results. Dr. Clinton and his staff was professional , kind an made my experience comfortable which I felt safe and in good hands. Dr.Clinton  listen very carefully as to what I was looking for an what was the best option for my body in terms of what was Needed to enhance it. I am recommending Dr. Clinton to every one I know who are working hard to get their body in shape ,so they can do their best to get their weight down if not all the way , but as close as possible to make their sugery a success. Iam looking forward to seeing  Dr.Clinton an his staff again for my next goal I have in mind......HE IS THE BEST !!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "109594622113703007131", "name": "Nadia Wilder", "time": 1508188348748, "rating": 5.0, "text": "Love Dr. C and his staff!  Always helpful and friendly!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "115724210230577685438", "name": "Elizabeth Levant", "time": 1507645023227, "rating": 5.0, "text": "I was treated for Hyperhidrosis (excessive sweating) with the INFINI and have amazing results.  I can finally go and dance at a wedding without looking like I have just stepped out of the shower.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "118271245958360486478", "name": "Pam Buck", "time": 1473541101089, "rating": 5.0, "text": "Professional, friendly staff, & lovely office. They took good care of me.", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "106259224566591743372", "name": "sally westendorf", "time": 1471471727079, "rating": 5.0, "text": "From the very beginning, the office staff, nurses, and the Doc were unbelievably professional and so fun and sweet!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "113522748680855499010", "name": "Dawn Hoffman", "time": 1489200977913, "rating": 5.0, "text": "Wonderful office personnel....everyone was very kind and professional!!", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "103921980893128914610", "name": "Theresa Reese", "time": 1564100382359, "rating": 1.0, "text": "He is the worse doctor!!! I told him small and gave me a 36 DD.   Had them removed and never checked in me or gave me directions on what to do.   Stay away from him he is a rip off", "pics": null, "resp": null, "gmap_id": "0x88891671b0905011:0xd68eae853ba7f63c"}
{"user_id": "105143744866993955564", "name": "anthony saint", "time": 1617278702099, "rating": 5.0, "text": "0n 8/25/90 I was involved in an auto accident that caused major head trauma and facial fractures at which time I had to have screws and plates put in. Dr steinmetz done an incredible job . I thought I was gonna  be permanently disfigured  the swelling was horrendous dr steinmetz assured me it was just temporary and put my mind at ease and for that I owe him a great deal of gratitude God bless! He and his staff were incredible", "pics": null, "resp": {"time": 1617328108311, "text": "Anthony, we are glad to hear you are doing so well! Yes, Dr, Steinmetz is a miracle worker. We appreciate you taking the time to leave a nice review.  Blessings to you, Steinmetz Plastic Surgery"}, "gmap_id": "0x88891bca1fb51d1b:0xeb5fbed5e46c4282"}
{"user_id": "115816483976344585475", "name": "Jaí Frenshá", "time": 1603333221368, "rating": 5.0, "text": "I just had a reduction on 10/20 and everyone was AMAZING! The people who took care of me after surgery were so amazing. Cheyenne, calvin, Mary... stood out. And the nurse who got me ready for surgery was great i forgot her name. I hope i can leave this review somewhere else to recognize them more. They deserve it. Dr Steinmetz is amazing very straight forward i must say lol... the only thing i would say is the front desk at his office should do a better job communicating with patients on things because it was a little all over the place up until the time of my appointment. But i did voice that to them.", "pics": null, "resp": {"time": 1603338206243, "text": "Thank you for your kind words. We are thrilled you are pleased with your procedure and the great care you received. Dr. Steinmetz does work very hard and always has the patient's interest as a top priority. Thank you for your feedback about the front desk. We are in the process of refining our front desk protocol to best meet the needs of the many patients we are blessed to see.  We always strive to give the highest quality of customer service. Thank you again. Steinmetz Plastic Surgery"}, "gmap_id": "0x88891bca1fb51d1b:0xeb5fbed5e46c4282"}
{"user_id": "103758982044881628274", "name": "J. B.", "time": 1590636062532, "rating": 5.0, "text": "I just had a breast reduction and lift 2 weeks ago and Dr Steinmetz has been amazing. I was able to go through the process with a friend of mine who used him and then with my own procedure. He was kind, funny and easy to talk to and ask all the questions I had. At the hospital after surgery I was having a response to some medication and he stayed on top of it, checking in to make sure I was ok and progressing well, before releasing me to go home. At all of my visits, his staff is nice and helpful and they have all been great from starting my consult to surgery and now followup care. I'd definitely recommend them.", "pics": null, "resp": {"time": 1602288627265, "text": "Thank you for your kind words. Dr. Steinmetz takes great pride in  His work. Much appreciated,  steinmetz plastic surgery"}, "gmap_id": "0x88891bca1fb51d1b:0xeb5fbed5e46c4282"}
{"user_id": "108769343925248021848", "name": "shannon Prado", "time": 1555443422888, "rating": 5.0, "text": "Dr. Steinmetz is the BEST. He listened to me, made suggestions, told me what could and could not be done. I felt very confident when I made the decision to let him do my breast reduction. I had two of my other physicians compliment him on how meticulous his work is. (one being my gynecologist!)  Dr. Steinmetz was kind, patient, thorough, and respectful. I LOVE my new breasts! They are beautiful and I am SO much more comfortable and can breath easier! I would HIGHLY recommend him to anyone looking to improve their body. I may even go back for some chin work one day!", "pics": null, "resp": {"time": 1618270159123, "text": "Thank you Shannon! Yes, Dr. Steinmetz is extremely meticulous and treats all patients like family. We are so glad you love your results! Thank you for your review. Steinmetz Plastic Surgery"}, "gmap_id": "0x88891bca1fb51d1b:0xeb5fbed5e46c4282"}
{"user_id": "112799444229656366161", "name": "Wendy Lowe", "time": 1568755461366, "rating": 5.0, "text": "Dr. Steinmetz and his staff is amazing !  I was diagnosed with Breast cancer . Had the Bilateral mastectomy,  expanders then the exchange surgery..(with a tummy tuck) Him and his staff  was so nice and understanding through  it all. And Dr. Steinmetz  has done amazing work on me and although  at the time he was a very busy man I never felt less important and I can't wait to go see him again so they can see my tattoos that is covering my scars(that you could barely see).\nI highly recommend him !", "pics": null, "resp": {"time": 1606000149220, "text": "Thank you, we appreciate your kind words. Steinmetz Plastic Surgery"}, "gmap_id": "0x88891bca1fb51d1b:0xeb5fbed5e46c4282"}
{"user_id": "108540866549613074571", "name": "Yosha Blakney", "time": 1566445034531, "rating": 5.0, "text": "Amazing Doctor! Had a Breast reduction one year ago and I love it! Dr Steinmetz bedside manners is Amazing! He really cares! Although my scars hasn’t completely gone,I’m pleased ! Now back to him for a tummy tuck! I love that nice looking Man😊And he’s so funny", "pics": null, "resp": {"time": 1606000309274, "text": "You are so kind! We are glad you are pleased and look forward to seeing you soon. Steinmetz Plastic Surgery"}, "gmap_id": "0x88891bca1fb51d1b:0xeb5fbed5e46c4282"}
{"user_id": "105766777650575457297", "name": "Sonya Barwick", "time": 1568811492440, "rating": 5.0, "text": "What an amazing group of people!  I couldn’t be happier with the entire experience.  Dr. Steinmetz worked nothing less than a miracle on my reconstruction.  He doesn’t rush his patients in and out like other doctors (which explains the waiting room time).  For the patients that didn’t have the patience to wait...big mistake.", "pics": null, "resp": {"time": 1603338277218, "text": "thank you for your kind words! Steinmetz Plastic Surgery"}, "gmap_id": "0x88891bca1fb51d1b:0xeb5fbed5e46c4282"}
{"user_id": "105822490615783153781", "name": "Christopher Daniel Faulkner", "time": 1565729174902, "rating": 5.0, "text": "Great doctor and staff. They all are kind and thoughtful. He takes the time to explain procedures and does all he can to make you feel comfortable.", "pics": null, "resp": {"time": 1606000407003, "text": "Thank you Christopher! Yes, Dr. Steinmetz works very hard to make all his patients comfortable and happy. Steinmetz Plastic Surgery"}, "gmap_id": "0x88891bca1fb51d1b:0xeb5fbed5e46c4282"}
{"user_id": "110977127598767480903", "name": "Rhonnie Graham", "time": 1474045703246, "rating": 5.0, "text": "Outstanding surgeon, I have never had a Doctor treat me so well! My results from a tummy tuck and breast reduction are amazing!  I highly recommend this Plastic Surgeon.", "pics": null, "resp": null, "gmap_id": "0x88891bca1fb51d1b:0xeb5fbed5e46c4282"}
{"user_id": "116566063230967311885", "name": "Nancy McLemore", "time": 1458154905734, "rating": 5.0, "text": "Dr. Steinmetz is an extrememly skilled surgeon with a great bedside manner.  He is meticulous, thorough and not haughty.  His staff is very helpful, giving great advice and caring tips.  Dr. Steinmetz goes over and above most doctors!!!!", "pics": null, "resp": null, "gmap_id": "0x88891bca1fb51d1b:0xeb5fbed5e46c4282"}
{"user_id": "104055757669211128481", "name": "Cori Byrd", "time": 1467421824499, "rating": 5.0, "text": "I went to Dr Steinmetz because my mom had a tummy tuck by him and really liked him as well as his staff.. And of course he did a really great job. I had a breast augmentation done by him... He did an amazing job!!!!! I was very stressed out and scared before the surgery and he & his nurses calmed me down.. Plus everyone there said he is the doctor who everyone goes to. :D I couldn't be happier and his office staff is awesome too!", "pics": null, "resp": null, "gmap_id": "0x88891bca1fb51d1b:0xeb5fbed5e46c4282"}
{"user_id": "114439325843303691676", "name": "Joyce E.", "time": 1568862182304, "rating": 5.0, "text": "Dr. Steinmetz and his team have been very professional and responsive. I appreciate how they have handled a very personal and sensitive situation.", "pics": null, "resp": {"time": 1603338240007, "text": "it was our pleasure and we hope you are doing well. Steinmetz Plastic Surgery"}, "gmap_id": "0x88891bca1fb51d1b:0xeb5fbed5e46c4282"}
{"user_id": "101658600926714869846", "name": "Heather fowler", "time": 1531298448869, "rating": 1.0, "text": "I was so excited for my consultation for breast augmentation. The staff was friendly, but Steinmetz was so incredibly awful. I felt judged the entire time he was in the room, and he rolled his eyes at me at least 4 times over my life choices, such as how long I breastfeed my children, my goals for better looking breasts, etc...I felt humiliated. It was already very  uncomfortable for me to show my breasts, and have them handled and analyzed by a strange man in front of my husband....and would have been the same (or worse) even if my husband wasn't w me...I fought back tears after he left the room. He acted like I was ridiculous and freakish for favoring larger implants over anchor scars bc of my current breast size. And how dare I consider that possibility...not knowing anything about plastic surgery....\n\nHis assistant was very \"salesy\" and tried to talk me into a lift or reduction instead of implants. Maybe that's my only option...but the scars were VERY visible no matter how hard she tried to convince me they weren't. I understand bc of my anatomy, I may have limited options, but we said from the beginning, anchor scars were a deal breaker. His portfolio was unimpressive, and a lot of women's breasts looked better to me and my husband in the before pics than the afters.\n\nI wouldn't hire a plastic surgeon for their personality, and this one was supposed to be a \"perfectionist,\" but the way he judged me the entire time, and pretty much made me feel incredibly unattractive and stupid made me want to leave his office as fast as possible. I'll have a second opinion this Friday. Hopefully this surgeon will have some respect for the people who are considering hiring him.", "pics": null, "resp": null, "gmap_id": "0x88891bca1fb51d1b:0xeb5fbed5e46c4282"}
{"user_id": "105915947862857966538", "name": "K S", "time": 1594105787915, "rating": 2.0, "text": "He was extremely rude and unprofessional. Never gave proper answers or explanations. This was just after a consultation. Not sure if we will go back.", "pics": null, "resp": {"time": 1594124657245, "text": "If you would like to contact me directly at jskinner.sps@gmail.com . Dr. Steinmetz is very thorough with his consultations. I would like to understand what happened so we can address this matter."}, "gmap_id": "0x88891bca1fb51d1b:0xeb5fbed5e46c4282"}
{"user_id": "102691072418226997596", "name": "Nora Fulton", "time": 1519173474694, "rating": 2.0, "text": "I had a breast reduction done and I was suppose to have a lift with it but that didn’t happen.  I will not recommend him to anyone, I also still have those puppy ears on the side where the drainage tubs were. I have talked with him and he didn’t show any concern as far as trying to satisfy me as a patient.", "pics": null, "resp": null, "gmap_id": "0x88891bca1fb51d1b:0xeb5fbed5e46c4282"}
{"user_id": "107914131475542674329", "name": "Unique MissD", "time": 1546142025556, "rating": 5.0, "text": "He's the best! I'm very satisfied", "pics": null, "resp": {"time": 1618270171698, "text": "Thank you!"}, "gmap_id": "0x88891bca1fb51d1b:0xeb5fbed5e46c4282"}
{"user_id": "100750781506821796880", "name": "Elisa Ledbetter", "time": 1461184013568, "rating": 5.0, "text": "Dr. Steinmetz is not only an amazing, skilled surgeon, but he along with his wonderful team have been a blessing! From the first conversation with his wonderful office manager, Jennifer, to meeting Dr. Steinmetz for the first time, I felt so at ease knowing I was with a team who generally cared about me as a person, not just another patient! Dr.Steinmetz uses something that I do not believe any other plastic surgeon does for their post mastectomy patients that was absolutely instrumental in me having almost NO PAIN post op! He uses a Marcaine \"ball\" that slowly releases the anesthetic into the wound over several days! I literally took no narcotic for post op pain (although I did have a prescription for it) and walked for almost a mile 3 days post op! This was absolutely unbelievable and my family and friends could not believe I had a double mastectomy! As an RN and CRNA, I so APPRECIATE the wonderful advocate I have in Dr. Steinmetz to assure to the best of his abilities that his patients are optimally covered for pain relief without having to rely so heavily on narcotics and all the side effects! Dr. Steinmetz and his terrific staff, Jennifer, Ashley and Hope, continue to care all during your \"journey\"! They offer such helpful advice and, very important, the end results are beautiful! With much appreciation, great respect and sincere gratitude, Elisa Cogen", "pics": null, "resp": null, "gmap_id": "0x88891bca1fb51d1b:0xeb5fbed5e46c4282"}
{"user_id": "101231590923885905919", "name": "Michael Whitehead", "time": 1504620148945, "rating": 5.0, "text": "Amazing results.", "pics": null, "resp": null, "gmap_id": "0x88891bca1fb51d1b:0xeb5fbed5e46c4282"}
{"user_id": "115901558842711864736", "name": "Rossie Stoops", "time": 1617803640780, "rating": 5.0, "text": "Dr. Howard is a top plastic surgeon in Birmingham, AL. I first went to him in 2013 for a surgical procedure. The results I got from Dr. Howard were simply amazing and gave me years of beauty and personal confidence and happiness. I know that I cannot attribute those results to anything but to the skill of Dr. Howard's hands. I went back to him for the same procedure two weeks ago and I could not not be happier with the results. I hesitated about my timing, but from the very first call into his office, I felt confident about my decision to come back to Dr. Howard. The magic of his hands is there as it was in 2013.  Dr. Howard and his staff are absolutely wonderful, caring, nice. After the procedure I have been treated with kindness and I feel reassured. I could not be happier with my results again this time. I recommend Dr. Howard with ten stars out of five.", "pics": null, "resp": null, "gmap_id": "0x8889197717a0aa61:0x458973a76ce4d7aa"}
{"user_id": "102855540793553316672", "name": "JAN Holt", "time": 1610415135858, "rating": 5.0, "text": "Great doc and great office staff!  Have used Dr. Howard in the past - great then and great now!", "pics": null, "resp": null, "gmap_id": "0x8889197717a0aa61:0x458973a76ce4d7aa"}
{"user_id": "105014601722947587354", "name": "Amputed Finger Beauty", "time": 1561738415084, "rating": 5.0, "text": "I had a breast augmentation over a year ago by Dr. Howard.  He and his staff are amazing.   He listens to you and does his best to achieve what you desire.  He has great bed side manner.   His staff is very sincere and caring.  I will be seeing him soon for a tummy tuck.  I highly recommend him for any plastic surgery needs.", "pics": null, "resp": {"time": 1570558753437, "text": "Thank you for this wonderful review! You’ve been a great patient and we look forward to assisting you in the future with your cosmetic goals!"}, "gmap_id": "0x8889197717a0aa61:0x458973a76ce4d7aa"}
{"user_id": "106294737779136916171", "name": "Judy Linn", "time": 1534970431815, "rating": 5.0, "text": "Doctor Howard is one of the most amazing and talented surgeons I have ever met.  He and his entire staff are extremely knowledgeable and caring.  The office atmosphere is very warm and friendly, which calms any feelings of anxiety you may be experiencing.\nI have  been a patient of Doctor Howard for over twenty years and would never consider a change", "pics": null, "resp": null, "gmap_id": "0x8889197717a0aa61:0x458973a76ce4d7aa"}
{"user_id": "113861111990093688979", "name": "Kendra Walden", "time": 1561696449064, "rating": 5.0, "text": "I had a breast augmentation 6 weeks ago and couldn’t be happier. The staff and Dr.Howard was very professional. They helped answered all my questions and kept me comfortable during my healing stage. I freaked out at first because one breast sat higher than the other (which is totally normal in the beginning) and Dr. Howard kept telling me to be patient it would be perfect, which it is. I went with 650 CC silicone implants and I could not be happier. I am looking forward to having A tummy tuck with Dr. Howard this Fall.\n\nAlso, I do have scaring. My scars sit perfectly in the folds and the bottom of my breast and are not visible at ALL unless I lift my breast purposely to see. I’m surprised my scars are as small as they are.\n\nCouldn’t have chosen a better doctor.", "pics": null, "resp": {"time": 1570558841667, "text": "Thank you for your awesome review! You have been a great patient and we look forward to seeing you again!"}, "gmap_id": "0x8889197717a0aa61:0x458973a76ce4d7aa"}
{"user_id": "100412746949661204149", "name": "Dyan Wells", "time": 1541552194889, "rating": 5.0, "text": "Dr. Howard and his staff are very knowledgeable, caring and totally honest about what results are reasonable to expect. I was extremely happy with the results of my procedure. Dr. Howard is not only a gifted surgeon but a true artist in his field. I wouldn’t think of going to anyone else.", "pics": null, "resp": null, "gmap_id": "0x8889197717a0aa61:0x458973a76ce4d7aa"}
{"user_id": "107902641975737832564", "name": "Rhonda Usry", "time": 1563105953886, "rating": 1.0, "text": "Arrogant,  less than good results. Scars visible. Doesn't care about his MISTAKES.\nCondescending to the patient. Maybe ok long time ago, not now.  Wish I had never gone there.", "pics": null, "resp": {"time": 1561567648697, "text": "I'm shocked by your review and concerned regarding your statements as you didn't show for your last appointment. Like any specialty, surgeons are not always able to control how patients heal, especially when the patient fails to return for post-operative appointments. I'm sorry you have chosen such a public platform to express your dissatisfaction of your surgical results, instead of honoring your last appointment. We were very appreciative of you and enjoyed having you as a patient. Not to mention, we loved your gifts of fresh fruit.  We wish you the best."}, "gmap_id": "0x8889197717a0aa61:0x458973a76ce4d7aa"}
{"user_id": "115065161840263993600", "name": "James Frink", "time": 1542298494968, "rating": 5.0, "text": "Dr. Howard and his staff have been great to work with; performing excellent surgery, with more to come.  They have also been understanding with my change of plans on occasion while my father was critically ill.  I would recommend Dr. Howard to anyone!", "pics": null, "resp": null, "gmap_id": "0x8889197717a0aa61:0x458973a76ce4d7aa"}
{"user_id": "100225909641297344403", "name": "macey prince", "time": 1457466136196, "rating": 5.0, "text": "Oh. This man. I cannot say how grateful I am to him & his staff. He is absolutely amazing. 20 years ago, I had a cleft pallet surgery. The surgery was a great success! He give me my life in a sense of saying. He gave me the gift of speech. He is truly a remarkable surgeon & an all around amazing person! I remember as a child being scared to death to see another doctor wondering what they were going to find that time as I had been to so many. He gave me peace and comfort that no other doctor had given! If there were more stars to be given, he would get them all!!!", "pics": null, "resp": null, "gmap_id": "0x8889197717a0aa61:0x458973a76ce4d7aa"}
{"user_id": "102738679067605622473", "name": "Lisa Powers", "time": 1562939696857, "rating": 5.0, "text": "I met  Dr. Howard  and his staff when I went in for botox.  The plastic surgeon I had used for botox  years passed away and I decided to try Paul Howard after looking at his web site.   I'm so glad I happened upon it as  I've been very pleased with the results of  his work.\nMost recently I had fat transfer to my face which has turned out very well.  An older acquaintance of mine had a face lift, a couple of years ago, by dr Howard , and her outcome appears excellent , in my opinion.  Another(younger) friend recently went to him and I am thrilled for her , as her results are absolutely wonderful!\nDr Howard is not your average/usual  doctor !  On the contrary , he's very open and\nsurprisingly  personable and will  take time to talk with you if you want that.  Or you can get in and out very quickly. His office staff (office manager is his wife) is efficient and they, too,  are very personable. Of course the most important thing is that he is highly skilled... His office is so easily accessed.. right off highway 31 in Hoover behind full moon barbeque and across 31 from Krispy Kreme.\nI am happy to highly recommend dr. Howard from my personal results and those of my 2 friends.", "pics": null, "resp": {"time": 1570558682032, "text": "Thank you for all of your kind words. We appreciate you and your referrals! You have great friends and you are a great friend to them too!"}, "gmap_id": "0x8889197717a0aa61:0x458973a76ce4d7aa"}
{"user_id": "106725067996149726516", "name": "S Mcginester", "time": 1512441964807, "rating": 5.0, "text": "Thank you guys so much.  My husband and I are extremely satisfied with the  results.  Great experience", "pics": null, "resp": null, "gmap_id": "0x8889197717a0aa61:0x458973a76ce4d7aa"}
{"user_id": "107840456793717117869", "name": "Denise Mayo", "time": 1599499156213, "rating": 5.0, "text": "I went to Dr Moor for breast surgery following a bilateral mastectomy for breast cancer. I absolutely can not say enough good things about him and his staff! He is always there to listen.  I love his expertise and ability to relate to what you are going through.  He is absolutely brilliant and could not have made me feel more comfortable in his office! I highly recommend him!", "pics": null, "resp": null, "gmap_id": "0x88891986153716a1:0xbd9779af420afeb3"}
{"user_id": "104981830905731407294", "name": "Brandi Luv Burns", "time": 1600450403420, "rating": 5.0, "text": "I went to Dr Moor in 1998 for a Breast augmentation it was the best decision EVER! I would recommend him over and over!  Thank you Dr Moor!", "pics": null, "resp": null, "gmap_id": "0x88891986153716a1:0xbd9779af420afeb3"}
{"user_id": "108331073680668813599", "name": "Lavon Allen", "time": 1557432728786, "rating": 5.0, "text": "Dr. Moor and his staff are amazing. I had breast augmentation and liposuction (abdomen-had this small amount of stubborn fat) and could not be more pleased. It has only been three weeks but I am already in love. He is always available to answer questions and is genuinely concerned about how you feel and what you think is best for YOUR body. He really listened to what I wanted to achieve and he nailed it for me. I love that! If I decided to \"Upgrade\" some more then it will be with Dr. Moor.", "pics": null, "resp": {"time": 1558463566163, "text": "Thank you so much your review. We do appreciate it!"}, "gmap_id": "0x88891986153716a1:0xbd9779af420afeb3"}
{"user_id": "115145068192307104660", "name": "vakeshia ellison", "time": 1550604207972, "rating": 5.0, "text": "Dr. Moor is the absolute BEST! He has helped me began my transformation into the new me. It was the end of the year last year and everyone in the city seemed too booked to help me. I called the office and Dr. Moor called me back personally to let me know he would take care of me. From that moment forward, I knew he was the one! I have gained confidence in ways I didn't think were possible. His bedside manner is top notch and the fact he has YEARS of experience makes me feel so comfortable. His staff is as amazing as he is. I highly recommend!", "pics": null, "resp": {"time": 1550612247681, "text": "Thank you for the kind words Vakeshia!"}, "gmap_id": "0x88891986153716a1:0xbd9779af420afeb3"}
{"user_id": "107919601649431999936", "name": "Tammy Williams", "time": 1547156001428, "rating": 5.0, "text": "I went to Dr. Moor for a breast reduction 7 years ago. I had no complaints whatsoever! I’ve recommended him numerous times since then to friends and immediate family members. I highly recommend Dr. Moor!", "pics": null, "resp": {"time": 1547648238790, "text": "Thank you for the kind words Tammy!"}, "gmap_id": "0x88891986153716a1:0xbd9779af420afeb3"}
{"user_id": "118369548679616719954", "name": "Kim Farmer", "time": 1486755919203, "rating": 5.0, "text": "I have never felt more comfortable in a doctors office in my life. Dr.Moore is a wonderful doctor with a great personable personality.  I have never had a doctor call me himself to follow up and just to check up on me. I love the results of my tummy tuck and couldn't have been more pleased with my entire experience with this doctor and his staff. Y'all are great and I'm kinda sad that I'm a few weeks from total recovery and my time there will be over. Highly recommend this doctor!!", "pics": null, "resp": null, "gmap_id": "0x88891986153716a1:0xbd9779af420afeb3"}
{"user_id": "113585531990731031267", "name": "Darielle Burts", "time": 1566502999815, "rating": 2.0, "text": "Horrible service the receptionist a elder lady which I’m guessing is Dr.Moor wife has a very nasty attitude and is very unprofessional she slammed the door during our consultation and also told the dr she wasn’t going to call my insurance company to go over my policy again and told the Dr he can just cancel my surgery I’m guessing because I was black and couldn’t easily produce $780 as fast as there other patients could I gave it two stars 1 for Dr. Moor who was always awesome and helpful and 1 for his other receptionist who was also always so lovely", "pics": null, "resp": null, "gmap_id": "0x88891986153716a1:0xbd9779af420afeb3"}
{"user_id": "114772173220527737947", "name": "Rachell Hall", "time": 1555790111344, "rating": 5.0, "text": "Dr. Moore is a wonderful person and doctor. He ensures that everything is taken care of and that you as a patient is doing well. He explains everything to you before the surgery.", "pics": null, "resp": null, "gmap_id": "0x88891986153716a1:0xbd9779af420afeb3"}
{"user_id": "104745404526037518770", "name": "Virginia Swarttz", "time": 1612642824489, "rating": 1.0, "text": "Was scheduled for a consultation that got canceled same day (three hours prior to my appointment). Rescheduled and that day ,after working all day since 6am, I had to wait for 3 hours for just the consultation. The consultation was for surgery on my face which is something I think most people would be very nervous about. The consultation seemed very rushed. Also, on the phone they told me I would have a simulation done of what the results would possibly look like but they did not do that either. Very disappointed. I ended up going to have a consultation with a surgeon in Birmingham and having it done with them. They got me straight in and out. The surgeon here was very knowledgeable and confident.", "pics": null, "resp": null, "gmap_id": "0x888c2b806763795b:0xc72ab4ad6a97a1f7"}
{"user_id": "113677742624387314890", "name": "Shena Moran", "time": 1619061425453, "rating": 5.0, "text": "I am about 5 weeks post-op after a breast reduction. Dr. Budny was my surgeon and I can’t say enough good things about him and his staff. From the consultation, to scheduling, the surgery and recovery it has been a seamless process. I am so happy that I made the decision to go ahead with the procedure. I highly recommend Dr. Budny!", "pics": null, "resp": null, "gmap_id": "0x888c2b806763795b:0xc72ab4ad6a97a1f7"}
{"user_id": "104702148352466489830", "name": "Traci Davidson", "time": 1610998525518, "rating": 5.0, "text": "I had my Liposuction and a Tummy Tuck on Dec. 7, 2020. It was a great experience. I was so nervous when I went for my consultation. Because I had been watching YouTube and seen all the pain and misery people were going through. And how they were having bad experiences with the company they choose.\nBut I did not have that experience, the entire staff was very nice, from the front receptionist to the nurses. My doctor was Dr. Budny, he was welcoming, funny, attentive, honest and listened to my desires. And he did an awesome job with my procedures. Even on the week he was off from the facility he said if I had any concerns or problems to call the office and he would come in to assist me.\nThis is a great place to have your procedure done.", "pics": null, "resp": null, "gmap_id": "0x888c2b806763795b:0xc72ab4ad6a97a1f7"}
{"user_id": "101148576881501047607", "name": "Kaye Kelley", "time": 1616796481456, "rating": 1.0, "text": "About late 1997 or early 2000 I went in to Dr Budny  as I was coming out of my anesthesia,  I heard him say I was the first one he had to ever done lipo on legs.   Since then I still can’t wear a bathing suit.   He did an incision on the inside of both legs.  I should have gone back to him I couldn’t because being cut was the most painful thing I had ever been through.  Always wanted to feel comfortable about wearing a bathing suit but still to this day I can’t.   What should I do.     Kaye Kelley", "pics": null, "resp": null, "gmap_id": "0x888c2b806763795b:0xc72ab4ad6a97a1f7"}
{"user_id": "100929204512847373360", "name": "Lakeshia Peake", "time": 1602016261596, "rating": 4.0, "text": "Very nice staff. Dr Bentley is very good at what he does. The only thing I hate is that I waited for about 3hrs at my post op visit.", "pics": null, "resp": null, "gmap_id": "0x888c2b806763795b:0xc72ab4ad6a97a1f7"}
{"user_id": "107990405614467137943", "name": "Karen Blackmon Caldwell Somerset", "time": 1598249099378, "rating": 3.0, "text": "They say that those fat cells will never reappear...\nWhat they don’t say is there is plenty of fat cells to take there place.\n\nThey should tell you that the large amount of money you are spending... is for not!!!", "pics": null, "resp": null, "gmap_id": "0x888c2b806763795b:0xc72ab4ad6a97a1f7"}
{"user_id": "106459102896980171514", "name": "Barbara Ann Ewer", "time": 1539365615091, "rating": 5.0, "text": "Dr. Bentley is amazingly talented and skilled at what he does. He cares for his patients and their welfare. Everything you could ask for in a Plastic surgeon! The staff is amazingly supportive and so helpful walking you through any process. So grateful for all of them!", "pics": null, "resp": null, "gmap_id": "0x888c2b806763795b:0xc72ab4ad6a97a1f7"}
{"user_id": "118394886261492726231", "name": "Jessica Matthews", "time": 1492822111098, "rating": 5.0, "text": "Dr. Clark did an amazing job, I am beyond happy and feel like my augmentation looks completely natural. He has a talent! The staff is helpful and kind. Even after surgery the care has continued. I would highly recommend Dr Clark!!", "pics": null, "resp": null, "gmap_id": "0x888c2b806763795b:0xc72ab4ad6a97a1f7"}
{"user_id": "101869267458407413763", "name": "Vicki Smith", "time": 1543509491254, "rating": 5.0, "text": "I love Dr. Robertson.  He has removed several skin cancers and has done a great job.  He also has a great bedside manner.", "pics": null, "resp": null, "gmap_id": "0x888c2b806763795b:0xc72ab4ad6a97a1f7"}
{"user_id": "117080027663820128973", "name": "Alexus Clayton", "time": 1581034538443, "rating": 5.0, "text": "Dr.Bentley is great. Everyone in the office is amazing.", "pics": null, "resp": null, "gmap_id": "0x888c2b806763795b:0xc72ab4ad6a97a1f7"}
{"user_id": "106459325732755325109", "name": "Wallene Prudames", "time": 1440531794458, "rating": 5.0, "text": "Love the caring and service that accompanies our visit here!  Incredible work by knowing professionals.  Five stars all the way!", "pics": null, "resp": null, "gmap_id": "0x888c2b806763795b:0xc72ab4ad6a97a1f7"}
{"user_id": "108617264351649264095", "name": "Naomi Powell", "time": 1541547983885, "rating": 5.0, "text": "So far my experience with Plastic Surgery Associates is AMAZING. The staff is so helpful and kind Dr. Clark put me at ease about my surgery he was very professional.", "pics": null, "resp": null, "gmap_id": "0x888c2b806763795b:0xc72ab4ad6a97a1f7"}
{"user_id": "100930821911145552888", "name": "Derek Olson", "time": 1402079822788, "rating": 5.0, "text": "Dr. Robertson is fantastic! My wife got bit by a jack russell terrier on the lip and he was the plastic surgeon working at the ER that night. The ER doctor recommended plastic surgery (as opposed to regular stitches) and we took her advice and are so glad we got Dr. Robertson. The dog bite was a really traumatic experience but Dr. Robertson was so calm and collected from start to finish. He was constantly explaining the procedure and what he was about to do, which my wife said was comforting and reassuring. He is professional and has a very confident demeanor. I highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x888c2b806763795b:0xc72ab4ad6a97a1f7"}
{"user_id": "115268989982614107731", "name": "Jacqueline Reems", "time": 1447498991951, "rating": 1.0, "text": "My experience with Plastic Surgery Associates has been absolutely horrible.  I had a rhinoplasty done over 6 months ago.\n\nAnd I am learning that I  done an injustice.  My nose after surgery looked like it had been butchered inside and outside.\n\nFrom other patients who have had surgery of this nature, I have learned that their physician's office staff took time to clean their nose and rid the nose of the dried blood because of the sensitivity and nature.  This was not done for me.\n\nMy cuts were not in line.  I was cut on skin instead of along the clean lines of the nostril.  My nose inside looks like he was drunk when he did my surgery.\n\nThe outcome was not what I expected at all.  He did not make my nose look natural at all.  I am actually wondering what was Dr. Bentley thinking when he was doing the work.  My finished product looked nothing like the image that l was given.\n\nThe lady Kristin who answers the phone can be very rude and abrasive.\n\nI came to appointments and had to wait excessively.  I am so upset and hurt.  And the problem is that it cannot be undone.", "pics": null, "resp": null, "gmap_id": "0x888c2b806763795b:0xc72ab4ad6a97a1f7"}
{"user_id": "113957385676635058146", "name": "Nicole Hicks", "time": 1561024137516, "rating": 5.0, "text": "Did a great job on my daughter and I.", "pics": null, "resp": null, "gmap_id": "0x888c2b806763795b:0xc72ab4ad6a97a1f7"}
{"user_id": "104418344911026859758", "name": "Debbie McKinnon", "time": 1551298802608, "rating": 2.0, "text": "I scheduled an appointment days in advance ask for the price of my chemical peel. I was given a Hydra Facial instead.  When I checked out my bill was more than what she originally quoted me over the phone. When the lady finished my facial she didn’t even turn the light back on and she left the blue hair net on my head. I gave them two stars because they were there on time and they were friendly but they were clueless and lost on the business side of things. ( I am still wondering why she didn’t turn the light on and left the blue hair net on my head)  I will not be going back. This was my first facial. I hate I was quoted one price but charged more at check out.", "pics": null, "resp": null, "gmap_id": "0x888c2b806763795b:0xc72ab4ad6a97a1f7"}
{"user_id": "111295169038079082906", "name": "Terri Adams", "time": 1571250189628, "rating": 3.0, "text": "Takes forever for someone to call you back to schedule an appointment.", "pics": null, "resp": null, "gmap_id": "0x888c2b806763795b:0xc72ab4ad6a97a1f7"}
{"user_id": "107333992818056728339", "name": "Julianna Cannon", "time": 1524240525862, "rating": 1.0, "text": "Do not recommend.", "pics": null, "resp": null, "gmap_id": "0x888c2b806763795b:0xc72ab4ad6a97a1f7"}
{"user_id": "102033134908762505809", "name": "Lance Siler", "time": 1518224294933, "rating": 5.0, "text": "I am coming to see hem this Monday .need to get in asap", "pics": null, "resp": null, "gmap_id": "0x888c2b806763795b:0xc72ab4ad6a97a1f7"}
{"user_id": "104668754701344051337", "name": "Lindsay Bailey", "time": 1489499334444, "rating": 5.0, "text": "Wonderful experience", "pics": null, "resp": null, "gmap_id": "0x888c2b806763795b:0xc72ab4ad6a97a1f7"}
{"user_id": "101024153256558621060", "name": "Stephanee Simmons", "time": 1623269842777, "rating": 5.0, "text": "I wish I could have done this sooner! Dr. Rousso is an absolute artist and couldn’t be more happy with choosing him as my doctor! My results are natural, beautiful, & life changing! 10/10 Recommend!", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "106809771703882061362", "name": "lily slater", "time": 1615831595665, "rating": 5.0, "text": "Dr. Rousso did my nose about 5 years ago. He absolutely changed my life. The only thing I saw in the mirror was my nose and I hated it. Now I love my nose, and my side profile. By far the best decision I ever made. Whenever I tell someone that I had a nose job they are always surprised because my nose looks so natural and perfect on my face. I had consults with two other doctors and both of them said that they would do it but they recommended Dr. Rousso because he specializes in faces and noses. They said he would do a much better job than they could have done. I 100% recommend going to Dr. Rousso for anything face related.. because why wouldn't you want someone who specializes in faces to do your face?", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNKck6bo4s08qh1U_zqAhbCS3YG2wrmdvpIX-nq=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "117108190343559792963", "name": "Patricia Clark", "time": 1621864183455, "rating": 5.0, "text": "I had a face lift (temple cheek neck lift w/endoscopic forehead, upper & lower eyelids, SMAS lips, nasolabial & melolabial folds) 3 months ago with Dr. Daniel Rousso.  He came with very high recommendations from numerous people I know, both personally and in the healthcare field, which led to my decision to choose him to do my surgery.  The care and expertise I received from Dr. Rousso and his team was exceptional.  My results far exceeded all expectations I had prior to surgery, and I am so grateful I made the decision to choose Dr. Rousso.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "100854122181563192947", "name": "Virginia Limbaugh", "time": 1613866850116, "rating": 5.0, "text": "I had the best experience at Dr. Rousso’s office. The staff were so nice, helpful, and thorough with helping me with everything that I needed. Dr. Rousso is the best and I could not be happier with my results!", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "103017059977426964356", "name": "Randy W. Harris", "time": 1576621644711, "rating": 5.0, "text": "Dr. Russo and his amazing team are absolutely the best in the business. From first consultation to my finished procedure, Dr. Russo and staff were the epitome of professionalism. Each person was kind, compassionate, and willing to make my experience as pleasant as possible. I cannot say enough food things about Russo Plastic Surgery. I will definitely return in the future. Thank you so much Dr. Russo and team!", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "110425427269765260013", "name": "Katy Santello", "time": 1591653645781, "rating": 5.0, "text": "Had a wonderful experience at Dr. Rousso’s office with Dr. Adams. The staff were friendly and efficient and I felt very comfortable in the clean and welcoming environment. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "109674941309826359631", "name": "kathi ruffino", "time": 1594752337396, "rating": 5.0, "text": "When choosing a surgeon trust is vital.\nDr Rousso   is an impeccable Surgeon. I highly recommended Dr. Rousso,  he and his staff are extremely knowledgeable and make it   comfortable to  communicate  with .\nDr. Rousso spends time during  the consultation getting to know his patients , making certain their expectations are met .", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "104751226539780635710", "name": "Bobette Brizendine", "time": 1574627185037, "rating": 5.0, "text": "Fabulous experience! Staff and Dr Rousso were extremely kind and supportive before and after procedure. Traveled from Atlanta for his expertise and it was worth it. Will never let anyone else touch my face.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "110624182272300779589", "name": "Jonatha Temple", "time": 1566564424631, "rating": 5.0, "text": "Dr. Rousso and his staff were the best! They treated me like a king! The whole staff was caring professional and kind! At one point they found a neck pillow for me so I could be more comfortable, that’s above and beyond. From beginning to end , this was a great experience! If you are looking for what they do at Dr. Rousso’s office , look no further! Your in the right place.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "114100008041920989557", "name": "Scott Smith", "time": 1582321953638, "rating": 5.0, "text": "Dr. Rousso is an excellent physician and plastic surgeon.  He does more than cosmetic work.  Don't let an ENT do surgery on your nose.  Go to Dr. Rousso for any kind of nose or face surgery.  Your insurance will pay Dr. Rousso for any kind of surgery that your ENT would do.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "107435779969152665353", "name": "JAMES HIGGINBOTHAM", "time": 1578161591216, "rating": 5.0, "text": "Dr. Rousso does a fabulous job with my Botox. He injects along my hairline to ensure that my brows don't drop. He is a true expert with faces, and I will only trust Dr. Rousso with my Botox and any other facial procedures.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "112498734654435139525", "name": "Skylar R", "time": 1487694642679, "rating": 5.0, "text": "THE STAFF WAS GREAT. THEY WERE ACCOMMODATING AND VERY UNDERSTANDING. THEY WERE SENSITIVE TO MY CONCERNS AND WERE VERY COMFORTING AND MADE ME FEEL SO AT EASE. I WAS WORKED IN AFTER A PROCEDURE WITH ANOTHER DOCTOR AND NO ONE EVER MADE ME FEEL THAT I WAS ANY TROUBLE. THEY MADE ME FEEL VERY VALUED AND SAFE.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "102773081884585976107", "name": "Susan Holt", "time": 1564170497157, "rating": 5.0, "text": "Dr Rousso and his staff were so incredibly friendly. My nose is perfect. Thank you, Dr Rousso!", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "101106699226501406188", "name": "Alexis H", "time": 1462332032446, "rating": 5.0, "text": "Very friendly and informative. :) I was shown a photo of what my nose was to look like before surgery (photos were taken and photo editing software was used to predict its appearance) which made me feel much better about having the procedure done. Had a check up a week later and a month later and will have a few more in a couple of months to a year.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "101099203044722416171", "name": "Mary Margaret Lodge", "time": 1559916289782, "rating": 5.0, "text": "I am 6 months post procedure and I am loving my new face! As a 61 year old women, I looked at myself in the mirror and didn't recognize myself. I resorted to dimming the lights in the bathroom and only taking quick glances at my sagging face. Between the turkey neck and the bulldog jowls, I had to do something. I received many recomendations to see Dr. Rousso and I have NO regrets! Thank you, Dr. Rousso!", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "110476988151433408963", "name": "Vanessa Askren", "time": 1550802956915, "rating": 5.0, "text": "Love my results. Dr. Rousso and his staff are attentive and professional.\nThis is my second procedure with Dr. Rousso.The after care is exceptional and the sitters are very  competent at their job. I highly recommend Dr. Rousso .", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "113929667931565946685", "name": "Leslie Matheson", "time": 1566490968883, "rating": 5.0, "text": "I have been extremely pleased with Dr. Rousso and entire staff! Wonderful experience!", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "102398239523025872158", "name": "Nikki Dobrzynski", "time": 1557434918588, "rating": 5.0, "text": "Dr. Rousso, Nancy and Brandi were fantastic! I had fillers done, even though I am horrible with needles, Dr. Rousso made sure I was ok and took breaks when needed. My results are fabulous and I couldn’t be happier with the service and the results I have received from Dr. Rousso and his amazing staff! I would highly recommend Dr. Rousso for any service that you need.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "101382700736629893114", "name": "Susan Mccann", "time": 1459624762110, "rating": 5.0, "text": "My experience was very pleasing. The staff were very professional and courteous. The sitter, Sharon Burton was great. I would highly recommend you and your practice.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "104142634157398861829", "name": "Peyton F", "time": 1485270912718, "rating": 5.0, "text": "Fantastic !!! Wonderful staff . I always felt in good hands with all involved in my care. Dr. Rousso is very caring, gentle but most importantly he strives to be exact in his profession. He kept me informed on what to expect . He is an excellent !!!", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "104704266463846648288", "name": "Kim B", "time": 1380381331527, "rating": 5.0, "text": "I have absolutely loved my experience with Dr. Rousso and his staff. They are incredible and are very willing to make you happy. I know I can rely on them anytime I need them. It has been 6 years since my operation and I am very pleased with my results. Great staff!", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "117192850251592414862", "name": "Ashley G", "time": 1483626591935, "rating": 5.0, "text": "I had a great experience with all the doctors here. They were extremely nice and gave me great results. I could not be more pleased with my experience here.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "105496021226623997338", "name": "Peyton L", "time": 1393763159670, "rating": 5.0, "text": "Dr. Rousso is an outstanding doctor who listens to the needs and wants of his patients. You are made to feel so very special and my results were amazing. If i knew what i know now, would I have the cosmetic surgery again. In a heartbeat.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "113558956739435755683", "name": "Devin Day", "time": 1461023446209, "rating": 5.0, "text": "Dr. Rousso is an incredible doctor who is a gifted artist when it comes to Plastic Surgery. After a few short weeks, I looked like I did 15 years ago...Many who I have not seen for sometime, wanted to know what skincare line I am using, as my skin looks firm and youthful. I have no trace of having surgery. I cannot express how incredibly satisfied I am with my outcome and would highly recommend Dr. Rousso to anyone who is considering plastic surgery.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "112209495159726186926", "name": "Harper Hale", "time": 1454869935323, "rating": 5.0, "text": "I had a great experience with Dr. Rousso. The surgery process went very smoothly and I am very pleased with my end result. My results were better than I had imagined they ever could be. If I ever had questions, it was very easy to get in touch with someone from Rousso's office. A great experience.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "102488500555491169015", "name": "Morgan R", "time": 1456360471322, "rating": 5.0, "text": "Dr. Rousso and his staff are amazing. Everyone I encountered was professional, knowledgeable, friendly, and patient. My questions were always answered in a caring manner, and this environment made me feel like a name and not just a number. I have never been more pleased. I would highly recommend Dr. Rousso to any family member or friend.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "102824466369291668541", "name": "Jillian Ryan", "time": 1511329394468, "rating": 1.0, "text": "I had a rhinoplasty done a few years ago and for the first couple years it was good, now it is terrible and my face looks incredibly uneven. My nose looks terrible now. the long term of his rhinoplasty are not good quality.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "117836750503245534706", "name": "Kim Watkins", "time": 1400495846095, "rating": 5.0, "text": "I am extremely pleased with the results, and have been treated with the utmost courtesy and respect by all members of the staff. I definitely chose the best doctor! If I need any more work in the future, I will be back to Dr. Rousso .", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "103085951940989976193", "name": "Devin Bryant", "time": 1367242391508, "rating": 5.0, "text": "Dr. Daniel Rousso is a great plastic surgeon! He gave me a refreshed appearance without changing me into someone unrecognizable. My friends comment that I look great and rested but I still look like myself, just better.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "114528437121370055124", "name": "Alexis Middleton", "time": 1488017883124, "rating": 5.0, "text": "Dr. Rousso and his staff were amazing. My results were exactly what we had discussed. I would highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "116731382964232896917", "name": "Peyton M", "time": 1461379778597, "rating": 5.0, "text": "I have been very pleased. They recovery was just as described and I have more confidence in my appearance and that was my purpose.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "111583870193441982160", "name": "Jamie C", "time": 1405548989210, "rating": 5.0, "text": "DR. ROUSSO IS HIGHLY SKILLED. MY NOSE LOOKS S GOOD AS POSSIBLE! THE HUGE SCAR IS NOT VISIBLE TO MOST OTHER PEOPLE!", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "101634109715009957751", "name": "Rylee B", "time": 1390052627154, "rating": 5.0, "text": "I love everything about this clinic. Dr. Rousso is very direct in what he tells you he can and can not do for you. The staff are courteous and beautiful. Its a feel good experience. I am 100 percent happy!...Rylee B.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "105787194183636970624", "name": "James Mayfield", "time": 1407928242449, "rating": 5.0, "text": "Outstanding experience and results were as expected. Very knowledgable and courteous staff. Excellent care and follow up.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "104854011747182412093", "name": "Jamey G", "time": 1404562253079, "rating": 5.0, "text": "Dr Rousso is the most amazing and personal physician I have ever visited. He is professional and his work is un-equal by any physician I have met. Words will not express my appreciation for his services.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "105373387303708932518", "name": "Ashley Wolf", "time": 1403789816657, "rating": 5.0, "text": "Dr Rousso was highly professional and made me feel comfortable. I was confident and assured that I would be pleased and I was. Very much so.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "112316597418148017778", "name": "Lindsey G", "time": 1369695468925, "rating": 5.0, "text": "Dr. Rousso is a perfectionist. Absolutely works to make you look your best in a very normal way. He is without a doubt the best and his staff - each and every one - is fantastic. And I adore the setter, Tony who takes excellent care of you in the hotel. --LJG", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "118081950698453545410", "name": "Kate Hale", "time": 1403139119317, "rating": 5.0, "text": "Everyone in the office is super friendly. I always feel comfortable when I come in and I like that I never have to wait long at all. I would definitely recommend dr. Rousso to others!", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "108122686413624747644", "name": "Tara D", "time": 1387566730785, "rating": 5.0, "text": "I was extremely pleased with every aspect of my procedure. The pre-op appointments, operation, post-op care, and of course the results were all well above my expectations. I recommend Dr. Rousso to anyone contemplating facial plastic surgery. -- Tara D.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "100585153338225608339", "name": "Jessica C", "time": 1377281772239, "rating": 5.0, "text": "Super. Hard to tell my age! Botox might be next to fill in a few 'laugh lines.' However, I love the results as they are. -- Jessica C.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "104195259115044264073", "name": "Jackie Vaughan", "time": 1454495834007, "rating": 5.0, "text": "Dr. Rousso and his staff have taken great care of me, and I am very pleased with the results of my surgery!", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "116837601797127001582", "name": "Shawn R", "time": 1378816918931, "rating": 5.0, "text": "Overall, have had a great experience with the staff and Dr. Rousso. I felt well taken care of during my surgery as well as throughout my recovery.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "117806816984727856391", "name": "Sidney A", "time": 1365341578268, "rating": 5.0, "text": "Dr. Rousso and his staff reflect a standard of excellence in every area of patient care. As an existing patient, but first-time surgery patient, the care I received was of the highest level. I would not hesitate to return for additional surgery or refer friends to Dr. Rousso.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "112328521330242334549", "name": "Jillian Sanderson", "time": 1408592325891, "rating": 5.0, "text": "I was very satisfied with the treatment and care from the doctor and staff, as well as with my results after the lip advancement.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "112266622694122392302", "name": "Schuyler L", "time": 1371770195266, "rating": 5.0, "text": "I was with my daughter at a modeling event when I met a lady with her grand-daughter. I could not believe she was old enough to have a 'grand-daughter'' She said she had interviewed doctors from all over the mid-south and had found Dr. Rousso to be the best. I must say after having used him twice now that I WOULD NOT ALLOW ANY PLASTIC SURGEON BUT DR. ROUSSO TO TOUCH MY FACE. Not only is Dr. Rousso an excellent surgeon but he is in tune with working with the patient to achieve the desired result.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "102740841220257194679", "name": "Candace Ho", "time": 1453934495141, "rating": 5.0, "text": "My experience with Dr. Rousso and staff has been all positive. From the beginning they worked me in super quickly! I made an appointment, and was in for my surgery within two weeks. I urge patients not to be frustrated by wait times. There are days your visit will be very quick, an other times you will wait. The wait just means he is in a procedure (one can not always control surrgical length) or he is spending ample time with another patient. You will get the same courtesy. All staff members have been top notch in their skill and customer service. Dr Rousso made my nose look completely natural again after a previous surgeon did NOT. I highly recommend a surgeon such as Dr Rousso if you plan on a rhinoplasty. You want someone that does facial work and not body work. I also want to add that he recommends an overnight stay at a hotel so you can be checked by his protege in the evening. I was not happy about this at first, but I promise it is well worth it in the end. Im so glad I stayed and Dr Richards was able to check my progress. I also appreciated the help from the sitter. Dr Rousso and staff have a very together and smooth running operation with great results.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "108134213746691371978", "name": "Gale H", "time": 1394854112003, "rating": 5.0, "text": "Dr. Rousso has measured up to all of my expectations. I am very pleased with the outcome of both my rhinoplasty and my chin augmentation.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "101622703429125570714", "name": "Hayden R", "time": 1384643505707, "rating": 5.0, "text": "Dr Rousso makes you feel as if your family. He and his staff always take the time to make you feel as if you belong. I never feel as if I am being rushed through a system. Having had two previous procedures to repair a deviated septum. It wasn't until I meet Dr Rousso, that I was finally able to breath and had a straight nose to look at in the mirror! ~ HDR", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "111112722928276042699", "name": "Ron Foster", "time": 1493391296258, "rating": 5.0, "text": "My wife and I both have used Dr. Rousso with excellent results. There is none better!", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "116075231725310362414", "name": "Morgan England", "time": 1490140005132, "rating": 5.0, "text": "Amazing! Wouldn't go to anyone else for dermal fillers.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "118221836539275246659", "name": "Rowan S", "time": 1397352533009, "rating": 5.0, "text": "Dr. Rousso and his staff made me feel comfortable through every step of my mini-facelift, mid-facelift, and bleph. The results are fabulous with a younger looking 'me'...no stretched look.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "108232739779376201826", "name": "Alice Smith", "time": 1410730152637, "rating": 5.0, "text": "Dr. Rousso was conscientious, caring, and compassionate in his demeanor with his patient, a friend of mine, and in his sharing of information regarding her surgery.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "107057462220598111160", "name": "cyndycantley", "time": 1529790725031, "rating": 5.0, "text": "Love Dr Rousso and his staff!", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "109781193179505385888", "name": "Evelyn P", "time": 1527109478186, "rating": 1.0, "text": "STEER CLEAR. Cost me $20,000 to fix what he did.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "112261710270554054591", "name": "Jaylin M", "time": 1379413593342, "rating": 5.0, "text": "It has been three years since my actual procedure, and every time I come in, Dr. Rousso and all of his staff recognize me. In addition to the check up, we have a 'catch-up' where we talk about what is happened since the last visit.--Jaylin M.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "100957296469107979806", "name": "Judy Hughes", "time": 1364229387854, "rating": 5.0, "text": "Everything was great.", "pics": null, "resp": null, "gmap_id": "0x888919841819780d:0xd19e893195c0fa7c"}
{"user_id": "101108267297244329636", "name": "Raj Patel", "time": 1615259338021, "rating": 5.0, "text": "My wife and I are both in the medical field. We were treated so graciously and with so much compassion that I have yet to see in our medical field. All of the nurses that took care of us from Labor and Delivery to discharge were amazing! I left a note for all 5 nurses ( Chelsea, Amy, Mary Ashley, a student nurse named Grace and nurse in training with Mary Ashley)  in the room who took care of us but I unfortunately left out one and her name is MARGARET, she was our nurse overnight and talk about confidence in her advice and what needs to be done. It calmed our minds so much! We thank you St. Vincent’s for one of the best experiences we could have possibly had! All the nurses were so confident and truly spectacular. Definitely hoping to have another such experience again.", "pics": null, "resp": null, "gmap_id": "0x88891bb7d40543ab:0x1ead34bac4ddefea"}
{"user_id": "114432518045914474472", "name": "Cindy Bird", "time": 1615936788062, "rating": 5.0, "text": "My husband is in ICU. They have been wonderful! The care he is receiving is extraordinary and above the norm. The nurses have treated us with nothing but compassion and caring. He was in another facility a couple of years ago and we were so upset with the care and no compassion. The nurses here have always made us feel heard and that they care not only for my husband, but also for us as his family.", "pics": null, "resp": null, "gmap_id": "0x88891bb7d40543ab:0x1ead34bac4ddefea"}
{"user_id": "107025965562238834695", "name": "Warthaddous Morris", "time": 1608584192626, "rating": 5.0, "text": "Great place, as hospitals go. You don't like them but they are necessary. They have a friendly caring staff that are there for you with what ever you need.", "pics": null, "resp": null, "gmap_id": "0x88891bb7d40543ab:0x1ead34bac4ddefea"}
{"user_id": "118027861884108062455", "name": "Ivica Vrkljan", "time": 1618450227389, "rating": 1.0, "text": "They overcharged me and, despite 3 phone calls with them where they agreed that they owed me a refund, have refused to send my refund.", "pics": null, "resp": null, "gmap_id": "0x88891bb7d40543ab:0x1ead34bac4ddefea"}
{"user_id": "104221136569032603835", "name": "Ace V", "time": 1618535764104, "rating": 1.0, "text": "Security was VERRY RUDE AND THE SERVICE IS TERRIBLE!!!!", "pics": null, "resp": null, "gmap_id": "0x88891bb7d40543ab:0x1ead34bac4ddefea"}
{"user_id": "107977415230826330308", "name": "Zhivago Enchanted Owl", "time": 1583530997974, "rating": 3.0, "text": "The first, second, third time you enter the hospital you feel like Dorothy, landing in OZ. It’s very confusing until you learn you must read the signs, and which of the three elevators in front of you goes to your appointment building. My parking ticket was $7.50. The important things, like cleanliness, courtesy, and professionalism was excellent.", "pics": null, "resp": null, "gmap_id": "0x88891bb7d40543ab:0x1ead34bac4ddefea"}
{"user_id": "111886805585653251946", "name": "Chris Ehrixh", "time": 1590686184426, "rating": 2.0, "text": "They don't care. I cannot recommend the OB/GYN dept. You never get to see the doctor and the nurses cannot answer any questions. We will change the clinic for the birth of our son.", "pics": null, "resp": null, "gmap_id": "0x88891bb7d40543ab:0x1ead34bac4ddefea"}
{"user_id": "110039771761373820689", "name": "Glenda Marsh", "time": 1592523865158, "rating": 1.0, "text": "At Saint Vincent's Hospital in downtown Birmingham I was rudely talked to. When I called to ask about my husband and to get information about his condition I was told someone would call me back but no one ever did. The doctor did call me when he was discharged to tell me to come get my husband. He did talk to me but he never really explained to me what was wrong with my husband. The doctor just gave me instructions for after my husband got home. When I called the hospital after he was discharged and asked a nurse what they found out about my husband's condition I was told \"we gave you paperwork. Read it.\" No explanation of any kind just a rude answer of \"we gave you paperword, read it\" I had read the paperword before I talked with the nurse but didn't understand what it said so that is why I called to get someone to explain to me what the medical terms in the paperwork meant, but no one would talk with me. I called the patient advocate twice. The first time I called I was told the patient advocate was not in. The second time I called I had to leave a message and asked that someone call me back, but no one ever called me. We still don't know what the doctors at Saint Vincent's Hospital in Birmingham found out about my husband. I felt the people especially the nurses were rude and would not talk with me. We asked the ambulance to take my husband to Saint Vincent's hospital, because we were told it was a good place to go for heart patients. But the way we were treated we will never go back to that hospital again. If you like being ignored and treated rudely that is the place to go. If you want kindness and concern when someone in your family is sick, find another hospital. I have been in other hospitals several times and have always been treated with dignity, respect, and kindness. If you need to be admited to a hospital don't go to Saint Vincent's hospital in downtown Birmingham.", "pics": null, "resp": null, "gmap_id": "0x88891bb7d40543ab:0x1ead34bac4ddefea"}
{"user_id": "105229429098074697224", "name": "Patrick Roberts", "time": 1528892164991, "rating": 5.0, "text": "Fantastic hospital! All employees were very helpful and eager to take care of you. Most rooms are very comfortable for longer term guest as well, some rooms with larger, newer tvs and recliners! Very clean rooms, and food wasn't bad compared to some hospitals. I will say though, the hospital is huge! Parking garage is not meant for anything bigger than a full size suv or van. Cash or card for paid parking payment. Cafe for guest is all fresh food made to order or buffet style!", "pics": null, "resp": null, "gmap_id": "0x88891bb7d40543ab:0x1ead34bac4ddefea"}
{"user_id": "107954325905439552007", "name": "barbara markham", "time": 1576120646265, "rating": 5.0, "text": "Nice and clean and all are friendly", "pics": null, "resp": null, "gmap_id": "0x88891bb7d40543ab:0x1ead34bac4ddefea"}
