{"user_id": "103147005064372166729", "name": "C W", "time": 1616666579960, "rating": 5.0, "text": "Fast turnaround and excellent work. Etched my wife’s Pink Lady and she loves it.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPDap6Jt87TmHjz1PZjGz8cmzoLh85dmHe_vLQi=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8892a2116b64a051:0x33d33224e0944cfb"}
{"user_id": "111040595895166694982", "name": "Bruce Archer", "time": 1600890235699, "rating": 5.0, "text": "Just spent some time with Bob talking about fixing up my 1911 to fit my needs. He has done work for me in the past and I’m looking forward to seeing my 1911 project completed. Great guy to work with....", "pics": null, "resp": null, "gmap_id": "0x8892a2116b64a051:0x33d33224e0944cfb"}
{"user_id": "114492495588473577248", "name": "Doug", "time": 1587425184004, "rating": 5.0, "text": "I brought three guns to Bob - two Baby Glocks and an old Lady Smith revolver.  Not only did he meticulously explain the details of the repairs these old workhorses needed he kept me abreast of the progress.  He plated all three and ported two and I could.not be happier!\n\nI absolutely will not hesitate to do business with Bob and his team in the future.  In fact I’m going back through my safe tomorrow to see if I can find anything else to accompany my Smith Fourth Model that’s next on my list.\n\nHe’s an innovator in the industry and has been for over 4 decades.  I couldn’t be more pleased.", "pics": null, "resp": null, "gmap_id": "0x8892a2116b64a051:0x33d33224e0944cfb"}
{"user_id": "100706334822882456309", "name": "Ken Hosey", "time": 1586195485600, "rating": 3.0, "text": "Does good work, very timely.  But, make sure he tells you the final price before leaving your guns with him.  He added about 45% more to my bill because he said my guns were more \"difficult\" than he expected.", "pics": null, "resp": null, "gmap_id": "0x8892a2116b64a051:0x33d33224e0944cfb"}
{"user_id": "101247255661413831823", "name": "Ansell Bradley", "time": 1577497729209, "rating": 5.0, "text": "Bob & I discussed the work to my HP. He had great suggestions.  The work is superb.  It looks & shoots better than factory.  Thanks Bob", "pics": null, "resp": {"time": 1577742072463, "text": "Thanks so much for your review.  Enjoy that HP!"}, "gmap_id": "0x8892a2116b64a051:0x33d33224e0944cfb"}
{"user_id": "115993384393886563019", "name": "Marc Chichester", "time": 1544918288574, "rating": 5.0, "text": "Recently sent Bob and his crew an old war 1924 Colt 1911 that was refinished to a nickel finish after the war. I had them do a 100% brushed hard chrome on it. Believe me when I say the Colt will take your breath away now. It looks amazing.\n\nThey did a fantastic job and the turn around time was incredible. I am so thankful for them and am now thinking about sending them another here soon. Great bunch of people to work with and very professional.\n\nThanks again.", "pics": null, "resp": null, "gmap_id": "0x8892a2116b64a051:0x33d33224e0944cfb"}
{"user_id": "117944649241392091362", "name": "George Butler", "time": 1559943292414, "rating": 1.0, "text": "Dear Accurate Plating & Weaponry Inc. customer,\nPlease be cautious when having tight fit frame to slide fit and other\nareas with tight fitting parts.  The frame became galled after I test fired two magazines to the point that I had to use a hammer to disassemble it.\n\nFinishes vary from order to order.", "pics": null, "resp": null, "gmap_id": "0x8892a2116b64a051:0x33d33224e0944cfb"}
{"user_id": "116715645488425256283", "name": "Rick Levin", "time": 1559150463279, "rating": 1.0, "text": "So the owner of this company is not only extremely rude but he does not know how to communicate very well which is probably why he is rude. They had my firearm for a little over two months. The only time I got told anything was when I called and the excuses for what was taking so long were always changing. It’s is the lack of customer service that is receiving this company a one star rating specifically the owner who’s name is bob. I did nothing but try to communicate with them and then when expressing my frustrations I’m yelled at when I never once raised my voice at them. Now not only am I retired military but I still work for the military here in Alabama as a contractor and I can honestly say that with the way I was treated as a customer I will be speaking with jag about having this company blacklisted for their customer service. All I had asked for was simply some custom engraving work done to represent the school I teach at which initially I was told would not be an issue. Then this became an issue and I had it thrown in my face that it should have costed way more when they quoted me a price based off of their price list. I have still not picked up my firearm yet and it was dropped off March 14th. It should be ready today and I’m curious to see the quality of workmanship considering this was a brand new firearm that had never been fired there should be no excuse for why it should not feel the same as I have read from some of the other reviews. All in all, after him telling me he hopes he never does business with me again and adding an extra hundred dollars to my bill above and beyond the original negotiated price I’m OK with never doing business with this company again.", "pics": null, "resp": null, "gmap_id": "0x8892a2116b64a051:0x33d33224e0944cfb"}
{"user_id": "107026601493861185081", "name": "Bama Urban Quail", "time": 1585691351132, "rating": 5.0, "text": "Great work by good people at a fair price.", "pics": null, "resp": null, "gmap_id": "0x8892a2116b64a051:0x33d33224e0944cfb"}
{"user_id": "103037712247921194481", "name": "chase walters", "time": 1552311564561, "rating": 5.0, "text": "amazing work on my pistol  to get it running perfect as well as extremely knowledgeable and helpful in building my custom AR.  Would completely recommend them for any and all gun work or questions", "pics": null, "resp": null, "gmap_id": "0x8892a2116b64a051:0x33d33224e0944cfb"}
{"user_id": "101100794780323434042", "name": "Monica Haney", "time": 1538766820753, "rating": 1.0, "text": "Sent in my 97 that I had been shooting for 5+ years, it came back a loose slide. Company stated something in the gun must have been broke but I had just shot the gun the day before mailing it in. Gun had been working perfectly, it WAS my favorite shotgun to shoot out of the 4 I have. Company never contacted stating there was an issue with a part before they mailed it back to me. When I called to discuss the matter, the owner of the company yelled at me and then hung up. Will NEVER recommend this company to any of my cowboy action friends.", "pics": null, "resp": null, "gmap_id": "0x8892a2116b64a051:0x33d33224e0944cfb"}
{"user_id": "110665449966009332849", "name": "Charles Bryant", "time": 1520027230199, "rating": 5.0, "text": "Best gunsmith I have ever worked with.  These guys stripped nickel off my old -3 smith that was in bad shape then applied a master blue finish.  The gun came back in absolutely incredible condition.  The turnaround time was the fastest of any gunsmith ive ever worked with, and the people were very responsive, helpful and nice.  I will be back with future work.  Thank you for the incredible work!   A+ business", "pics": null, "resp": null, "gmap_id": "0x8892a2116b64a051:0x33d33224e0944cfb"}
{"user_id": "115813757632488347074", "name": "Chuck Outlaw", "time": 1455152324175, "rating": 5.0, "text": "Great experience with AP&W. Taught a new gun owner tons of great info on everything from gun care to shooting tips. Installed the proper Dawson site and made sure I knew how to better my shooting and gun care!\nRecommend great service!!", "pics": null, "resp": null, "gmap_id": "0x8892a2116b64a051:0x33d33224e0944cfb"}
{"user_id": "118355812340553174416", "name": "j d", "time": 1444752450475, "rating": 5.0, "text": "Chris gave me a call right away when they received my slide and barrel which i was chroming. He told me exactly the cost i was looking at and the time it would take and was spot on with both. My slide and barrel came back even nicer than expected and packaged perfect for safe return. Thank you!!", "pics": null, "resp": null, "gmap_id": "0x8892a2116b64a051:0x33d33224e0944cfb"}
{"user_id": "105322564111349392120", "name": "Elliott Ewen", "time": 1412616872960, "rating": 5.0, "text": "Chris was a stand up guy. The Cylinders I stent him came back better than new! I will send the gun now. High QUALITY work these folks do. Thanks Dave in Tyrone.", "pics": null, "resp": null, "gmap_id": "0x8892a2116b64a051:0x33d33224e0944cfb"}
{"user_id": "112262865590686994266", "name": "P M", "time": 1509680820994, "rating": 5.0, "text": "Absolutely great experience with APW.    Did an amazing chrome job on a rare pistol slide.   Came out perfectly!   Thank you APW!", "pics": null, "resp": {"time": 1509712384534, "text": "Thank you Philip, we appreciate your business!"}, "gmap_id": "0x8892a2116b64a051:0x33d33224e0944cfb"}
{"user_id": "115262869340369050957", "name": "James H Kunkel", "time": 1495209964108, "rating": 5.0, "text": "Bob Cogan and his entire staff are the friendliest, most knowledgeable, most professional folks you could ever want to do business with.  If you are looking for the best plating and gunsmithing that you can find, stop here, you have found the best.\nI have been a customer since the 1990's.", "pics": null, "resp": null, "gmap_id": "0x8892a2116b64a051:0x33d33224e0944cfb"}
{"user_id": "112264273123122508976", "name": "Herb Bloom", "time": 1567864845890, "rating": 5.0, "text": "They took a chrome bad chrome 1911 colt came back a 1911 matte finish\nlike out the box fresh from COLT", "pics": null, "resp": {"time": 1568393026987, "text": "Thanks!  We are glad to hear that you are happy with your Colt."}, "gmap_id": "0x8892a2116b64a051:0x33d33224e0944cfb"}
