{"user_id": "102729073691078060204", "name": "Tom Katt", "time": 1623717880291, "rating": 5.0, "text": "Thanks for the great service 😀", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPj_ewnIlGPwrXM0pjE1XJur3ll2wo3u0HM78IX=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNGptr3kkR1CFsga8_IymRDiCQrOMZd4wzxIDY9=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889c934bbe20fc1:0x25b9d0710d74a833"}
{"user_id": "101475333215905469502", "name": "Tammie Johnston", "time": 1619451358073, "rating": 5.0, "text": "I love this place. I keep coming back. They are always cheerful happy and helpful. I am always happy when I leave. I will go back to them verry soon.", "pics": null, "resp": null, "gmap_id": "0x8889c934bbe20fc1:0x25b9d0710d74a833"}
{"user_id": "109444102828961632556", "name": "Darron Park", "time": 1618305358202, "rating": 1.0, "text": "He missed a sale maybe two no one there sign read open waited long time", "pics": null, "resp": null, "gmap_id": "0x8889c934bbe20fc1:0x25b9d0710d74a833"}
{"user_id": "108337674812044215372", "name": "Enrique Gomez", "time": 1596986798320, "rating": 5.0, "text": "GREAT prices and Awesome Customer Service!", "pics": null, "resp": null, "gmap_id": "0x8889c934bbe20fc1:0x25b9d0710d74a833"}
{"user_id": "105274598891415876840", "name": "Calm Delinquent", "time": 1593455659062, "rating": 5.0, "text": "Super friendly helps with your budget highly recommended", "pics": null, "resp": null, "gmap_id": "0x8889c934bbe20fc1:0x25b9d0710d74a833"}
{"user_id": "114331596391117536749", "name": "Lindsey Dilworth", "time": 1499459429532, "rating": 5.0, "text": "Wonderful place! Ordered a metal shed and the man was so kind and organized getting our order placed and shed delivered. Will use them again. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8889c934bbe20fc1:0x25b9d0710d74a833"}
{"user_id": "116371475737741208232", "name": "Jordan Dilworth", "time": 1515277382489, "rating": 5.0, "text": "We bought a shed from here. It was super easy, Calvin was very helpful in offering assistance. If there's not a shed there, they will order you one. They offer financing as well.", "pics": null, "resp": null, "gmap_id": "0x8889c934bbe20fc1:0x25b9d0710d74a833"}
{"user_id": "108139960520815113234", "name": "Ashllie Ramirez", "time": 1583856100769, "rating": 5.0, "text": "Professional caring customer service, Haley made sure I selected the best building to fit my needs. Delivery was quick and easy. The delivery men were very kind and sure to level the building and place it where I wanted. They have such a wide variety to choose from to fit everyone's needs. I was able to customize my building to my liking. Haley was honest and took time to look around with me. I spent nearly 4 hours here trying to make a decision on all their selection. Would recommend to anyone in search of a good quality building and great customer service.", "pics": null, "resp": {"time": 1598193606002, "text": "Thank you so very much Ashllie!! I do my best to make sure every customer will love their building!! Hope you’re doing well!"}, "gmap_id": "0x888a38907a642893:0x425a3e2ef5e575b7"}
{"user_id": "104103490816564750180", "name": "Becca A. Ali", "time": 1520468252293, "rating": 5.0, "text": "Gorgeous buildings and very good prices, hailey is the absolute best ! 5 stars !!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMvk0z_T15j7cgKmFlVVpsidjh1FCAWUQoD1Xty=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNBODMNHAHgs6MRYyNNcPJgso2JKHVUvDcXoxhV=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNjcV2ma5FCbjBSOwqO5JtWICfsHbEvHTJqPPQl=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNXh8Ty_E-8aHTqEFEwDf_s8ZVnCY0XRfLbnPPj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMf-Mn_jzDONHcxLnXJmw-A6z_23K1p3UaOY2yh=w150-h150-k-no-p"]}], "resp": {"time": 1568317334511, "text": "Thank you so much for your business and review!! We are so happy you love your buildings!"}, "gmap_id": "0x888a38907a642893:0x425a3e2ef5e575b7"}
{"user_id": "112283989640082688311", "name": "Kristen Smith", "time": 1598127666122, "rating": 1.0, "text": "If you ever get behind in a payment due to an illness or whatever the reason they will make payment arrangements with you to catch it up then after you’ve paid them still come get your building. 10/10 do not recommend if you are looking for someone to trust and honesty  is important to you.", "pics": null, "resp": {"time": 1621979025790, "text": "I am very sorry to hear this! Unfortunately, I can't control the financing company policies. I do know that you have so many days after a payment is due to make it up, most of our companies do let you get a few months behind before repossessing the item.\nI hate that you are displeased with our business, but there isn't anything I can do about the financing companies, but I do not believe we have ever repossessed anything that was paid for!!"}, "gmap_id": "0x888a38907a642893:0x425a3e2ef5e575b7"}
{"user_id": "116510742164835636948", "name": "Richard Groover", "time": 1605119532907, "rating": 5.0, "text": "Prices are UNBEATABLE!", "pics": null, "resp": null, "gmap_id": "0x888a38907a642893:0x425a3e2ef5e575b7"}
{"user_id": "103103952221530535047", "name": "Frank Virgintino", "time": 1623813313408, "rating": 3.0, "text": "I did business with these people twice on orders above $10,000.  first time, no issues, good service, timely delivery; all good.,\nSecond time, the “teacup” came damaged; the paint was scraped off and there was some minor damage to the top rail.\nI sent them pictures and communicated with them.  They had little or no interest and i ended up having to pay for shipping damage that was noted when delivery was made.", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "116714715364473748544", "name": "Lynn Floyd", "time": 1623240785774, "rating": 5.0, "text": "The company I work for has now installed two Playsets that we ordered from WillyGoat Toys & Playgrounds.  We are a non-profit that is raising money to put handicap accessible playsets in communities that otherwise can't afford the option. The ordering process was extremely easy, and there is always someone to talk with if you have any questions before, during or after the install.  The playsets are very well made, great colors and even during the pandemic, the wait was not extremely lengthy for delivery.  We will be ordering again soon!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOlm_iWCZqdvKYdwpBhlNAAVSqmJElp-DUBwOs=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "103656249466559957253", "name": "brandon bilamdzija", "time": 1623520524994, "rating": 5.0, "text": "Great purchased a swing for my son birthday.   He loves his swing set hard to get him off of it. Great quality product.", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "112865044173694580337", "name": "Bryanna Coons", "time": 1623196741622, "rating": 5.0, "text": "We ordered our playset from here last Spring. It took awhile to sho due to COVID but once they received it in stock, we heard from the shipping company quickly to schedule. Customer service was always great keeping me updated on the status of our order.", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "108997557519581121849", "name": "Chris Hannon Jr.", "time": 1595510890723, "rating": 5.0, "text": "We purchased the Lookout Extreme Swing Set for our children ages 2 & 4.  The process of ordering to delivery could not have been easier and the shipment arrived when they said it would.  We put the swing set together ourselves.  All parts were labeled, all of the hardware was labeled and the instructions were spot on!  This is a well made sturdy and safe swing set/playground.  Our kids love it!  Would highly recommend WillyGoat Toys & Playground to anyone in the market for a backyard swing-set/playground!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOGKcs0_OYE-FB3SjmbL_J-phlUYO1bcDtUsu5a=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "104875178058476238244", "name": "Stephanie Woodward", "time": 1623198700221, "rating": 5.0, "text": "Excellent quality products that can be used any type of weather. Would highly recommend WillGoat Toys & Playgrounds.", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "106621258519955322125", "name": "Brad Tilley", "time": 1623182003758, "rating": 1.0, "text": "absolutely the worst experience  payed the highest price and got the worst customer srvice. missing parts that they wouldn'treplace. don't go there", "pics": null, "resp": {"time": 1624461209666, "text": "Hey Brad, I'm sorry for your experience! We encourage everyone to inspect packaging within a week or two of receiving the shipment. Unfortunately, we don't typically provide replacement pieces for free for shipments over a month old, but we will take a look at that policy!"}, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "100786028771072930124", "name": "Susan Gonsalves", "time": 1623204985105, "rating": 5.0, "text": "My niece can’t get enough of the Peg Perego Gator Tractor.  We purchased the trailer for her and she loves helping dad work in the yard.", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "110475342456702853070", "name": "Dag Darwin", "time": 1596846521725, "rating": 3.0, "text": "First off, the product was well made and we are very happy with the quality. I deducted two stars due to their shipping policy, which caused us to cancel two future purchases and return business. 40% of our total cost was shipping (across the country) which we knowingly chose to pay. I assumed that shipping and delivery was inclusive. It is NOT. Once the freight company called me for a delivery appointment, I was told that I had to pay for offloading the pallet from the truck unless I had a forklift or some such thing hanging around my business. Upon calling WillyGoat and inquiring, I was told that I should have read what 'curbside delivery' actually meant. It's not curbside. Once the product leaves WillyGoat, they pocket that shipping money and leave it to you to figure out how to get the product. Not necessarily deceptive, but certainly not respectable.  Four phone calls later, I was simply told that 'if the truck driver is nice, he will help you offload it'. I said that I would take the pallet of goods apart myself and offload it by hand if necessary, but was then told that I'm not allowed on the truck. Well, there's a quandary! I can pay extra for shipping to actually receive my product. The woman at WillyGoat was unapologetic and didn't care too much to facilitate much or elaborate. Too bad, sooo sad, basically. Sorry WillyGoat, we are ordering future products from a company that has a clear and reasonable shipping procedure.", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "102622420119273996278", "name": "David Houghton", "time": 1595347605501, "rating": 5.0, "text": "The kids LOVE this hoop item we put in our playground at The Bay Kids, Inc. Willy Goat clearly had the best prices of anyone we found on line. I am really happy that I decided to contact them for our play ground. We have installed a larger play set for our 2-5 year old's, and we are installing an additional play set for the toddlers. All from Willy Goat!! They called to ensure everything we ordered arrived in great condition, and also kept in contact regarding color, panel choices, everything! Stuff I didn't even think about, they made sure I was aware! We're coming back for the big one next year!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMwE7oCo1mtyM9OKvipzjIMU3ymFkqVHwk_mMKM=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "111336198946316559876", "name": "St. George", "time": 1594312182682, "rating": 5.0, "text": "We recently bought a playground for our daycare facility. I am extremely pleased with the quality and outcome of everything. We are located in St. George Utah so the installation wasnt really an option through the company. We managed to get it up and the kids are loving it.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN_cW20ukxWv_Z5pmao0JBcJp4-QapOw1gnuQQN=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOWkjoOCexoDFt_ONgI54ogNU5q1EOgmUKc-I_P=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNWKBm_seW7FCwZwGEOWW1VrEoT4kqxY7GqeFjN=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "106166641283489506421", "name": "Mindy Drummond", "time": 1595288295621, "rating": 5.0, "text": "We had a fabulous experience with WillyGoat Playgrounds!! We ordered during the initial covid outbreak (we prefer to support local businesses than amazon and the like) AND their prices were better!! Unfortunately our package was lost by the shipping company, but WillyGoat shipped a new one immediately!!! Who does that with such a large order (a playground for us)? Great customer service!!! I would definitely order from them again!!", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "117360542824048882128", "name": "Scott Elliott", "time": 1595967166651, "rating": 5.0, "text": "Thank you WillyGoat for the quick responce and delivery of our Gaga Ball set! Our church youth groups were desperate and eagerly awaiting for its arrival. They have been using it just about every day since it arrived!  Thanks again for the great product and customer service!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM21P3-RL-2mCc4NojuVMzQ6gXjm6qCrLJae-Jn=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "108074656344324791222", "name": "Becky Broyles", "time": 1596387408778, "rating": 5.0, "text": "The selection is great! Very pleased with the customer service, and nice to know there are small businesses to support when so much of what we get comes from massive companies. Definitely give them a shot!", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "113010963535306304929", "name": "Patricia Eileen", "time": 1595360624378, "rating": 5.0, "text": "WillyGoat was great to work with! Gail was very hands on and always available to answer my questions. Our order arrived much faster then expected and we couldn't be more pleased!", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "117242604548762209768", "name": "Philip Teel", "time": 1595295092877, "rating": 5.0, "text": "The Treasure Trove  is a big hit with our grandchildren. They really love playing in the different play areas.  The set is very sturdy and well constructed. I highly recommend this play set", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "103700031403067709366", "name": "Kayla Ellis", "time": 1595346184778, "rating": 5.0, "text": "Shipping time was amazing! Very fast and brought it right to our house and helped us unload. Highly recommend and would definitely order from here again in the future.", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "108955793522454153974", "name": "Jennifer Z", "time": 1595353080137, "rating": 5.0, "text": "We ordered the Gorilla Treasure Trove II playset. WillyGoat had the best price by far. Delivery was timely and customer service was great! Would definitely recommend.", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "115851315157369738650", "name": "Isadora Tang", "time": 1595432438796, "rating": 5.0, "text": "We ordered a limited-distribution playset from WillyGoat. The customer service was fantastic (they called to confirm/clarify details of our order), our items shipped quickly, and their shipper went the extra mile to haul the pallets safely into our driveway. Highly recommend and thank you!", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "113991834042421900068", "name": "landon herzick", "time": 1595348583722, "rating": 5.0, "text": "We had a problem with a play set we ordered from another company. So we found Willy Goat and everything from the selection, customer service and delivery was exceptional! Could have been a better buying experience!", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "100827173618715383286", "name": "Our Redeemer Daycare", "time": 1599079162743, "rating": 1.0, "text": "We ordered two spring animals for our playground and even spoke with someone from sales and they sold us a lie...They sold us two platforms and wheels but NO spring animals to go on top.  I am furious and when I called the distributor they noted that this has happened before!  They either dont realize that the picture is not what that price entails or they dont care that you are NOT getting the entire play piece....only the bottom for that price! rediculous and when I called them their phones do not go thru~Worst customer service ever and NO responce to solve my problem for over a week even tho I finally found an email address", "pics": null, "resp": {"time": 1599083293345, "text": "Sorry for the confusion on your order!  Our product page does clearly state that this is just the base -- in fact, the product name is \"Spring Rider Portable Base\" and the price is a fraction of all other spring riders.  Mistakes do happen!  We will get a picture of just the base for future reference."}, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "103981133787465009092", "name": "Nicole Weddle Dehner", "time": 1594223093399, "rating": 5.0, "text": "We purchased a Peg Perego tractor for our son for his birthday. Not only was this the only place offering the one we were looking for, they also had a great price. We received much more quickly than initially expected.", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "107325074450033509547", "name": "Diane Genard", "time": 1595346533798, "rating": 5.0, "text": "It is the most adorable and well built playhouse... our granddaughter loves it! Shipping was quick and assembly was easy!! 5stars all the way!", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "118341349783377205958", "name": "Sydney Curran", "time": 1594239238810, "rating": 5.0, "text": "We purchased the KidKraft Treasure Cove Wooden Swing Set and we love it!! WillyGoat delivered on time. The person who called to schedule our delivery and the person who dropped it off were both very friendly and helpful! I would buy from this company again.", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "113813853363067833112", "name": "Dustin West", "time": 1594311155881, "rating": 5.0, "text": "One of the few places that had the John Deere Gator XUV available and we were able to buy it for our son’s birthday. Problems with the shipper caused it to miss his birthday but that is not WillyGoats fault. It has been a great product this far and Amy questions I had, WillyGoat customer service was able to give me answer for fairly quickly. Would recommend and will buy from again.", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "118381627455963859469", "name": "Chris Homan", "time": 1593618483124, "rating": 5.0, "text": "We purchased the Copper Ridge Wooden Playset & Swing and we love it!\nWe had professionals come put it together and it took them about 4 hours.\nEverything was delivered on time & no damages.\nHighly Recommend.", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "118065274951953866120", "name": "Katie Kenna", "time": 1595354643929, "rating": 5.0, "text": "We received our order sooner than anticipated! We were so grateful! Also, no other playground company had this item in stock, but WillyGoat Toys did!! Kid and parent approved! Definitely order from this great company!", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "116914994496955677416", "name": "Teresa Kerns", "time": 1595353312558, "rating": 5.0, "text": "Was able to find a suddenly 'rare' item at WillyGoat. It shipped out very quickly! Will update once we have it in service.", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "100167206167242651986", "name": "Emile Hughes", "time": 1594234917401, "rating": 5.0, "text": "Wonderful experience purchasing a playground for my 3 year old nephew. Highly recommend their products, you really can’t go wrong.", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "115959175716962575769", "name": "Mrs. Slagg", "time": 1595384776924, "rating": 5.0, "text": "The swing set has been a highlight of our children’s summer! Thank you for the quality set! Play dates at our house center around the swing set—that is how fantastic it is!", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "113070374677298318910", "name": "Christyn White", "time": 1595346261887, "rating": 5.0, "text": "We love our playscape.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN8NGNuI1GOS98biFjxeT9lk5imQ4YSt_qj8sb-=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "115881890753609894721", "name": "Katherine Trammell", "time": 1595364593876, "rating": 5.0, "text": "We love our playset from Willy Goat!  The playset was delivered on time and packed neatly for easy assembly. We will for sure order again and recommend this company to others!", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "111022430388481717415", "name": "David Hood", "time": 1595344649403, "rating": 5.0, "text": "The border product for our playground worked out perfect and shipping was very organized!! they did forget to add one item in our order but they shipped it out very fast.", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "104085565833398560408", "name": "Stephen Graham", "time": 1595367932742, "rating": 5.0, "text": "Had some issues on the first shipment with \"shipping company\", the item arrived completely busted and broken into more parts than I can count. Contacted willy goat about issue and another was sent and arrived intact. Unfortunately it arrived late for a BDay gift but willy goat got us another one pretty quick. The rzr is a huge hit in the neighborhood and I would recommend to everyone else.", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "108065892463101573007", "name": "Karen Lively", "time": 1595361043854, "rating": 5.0, "text": "We've been very pleased with WillyGoat's swingsets.  We purchased one about 15 years ago and now ordered another one for another location.  We are pleased with the quality and durability of the product.  Communication was excellent.", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "118364943238791648258", "name": "Trent Watkins", "time": 1594235976605, "rating": 5.0, "text": "Reliable and professional ownership.  Highly recommend - I will definitely be buying all of my equipment from here.", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "114831528550358354886", "name": "Ross Baird", "time": 1594234573810, "rating": 5.0, "text": "Awesome equipment. Definitely upgraded the playground and our little one begs to go back all the time!", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "100805560611440271374", "name": "Chris Burger", "time": 1594591445269, "rating": 5.0, "text": "Quality product. My nephews love the playground equipment. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "111863802024480517774", "name": "Sarah Kubacki", "time": 1594322577671, "rating": 5.0, "text": "Great deal on a playset when most were out of stock or being sold for crazy amounts! Super fast shipping and my kids love it!", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "109999225116048721243", "name": "Stephen Magyar", "time": 1594309221461, "rating": 5.0, "text": "Best set of playground and outdoor products available, great customer service, and incredibly easy website to navigate. Highly recommend WillyGoat!", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "102235303502322749257", "name": "Briana Zimmerman", "time": 1594246399612, "rating": 5.0, "text": "From order to shipping, everything was very smooth. Loving the new shade!", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "113644218441228545251", "name": "Rebecca Hansen", "time": 1597848865728, "rating": 1.0, "text": "Willygoat is the worst place to order from and will never receive my business in the future. I purchased a playset from them on may 18, 2020 and it now August 19, 2020 and still have not received my playset. They keep telling me when estimated shipping will be then apologize over and over that they are unable to ship do to not having product.  No reason to be going on 3 months with no product.", "pics": null, "resp": {"time": 1597852827176, "text": "Hi Rebecca, I'm sorry about your experience on this order -- the entire industry has been in short supply of wooden swing sets all summer 2020 due to the peak demand from people working from home.  We displayed these delayed lead times as best as we knew when orders were placed, but we're sorry that our inventory headaches due to the pandemic became your headache.  Rest assured your order will ship in the coming days as we just received this inventory!"}, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "116238080166838862996", "name": "Jon B", "time": 1595368178653, "rating": 5.0, "text": "Shipped fast. No hassles and the best price I could find.", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "110465347212710992176", "name": "Donna O'Neal", "time": 1595264051486, "rating": 5.0, "text": "We purchased the Empire Extreme AP Wooden Swing Set - Standard Wood Roof. We chose this one because as our daughter grows she will still be able to play on it and love it. This thing is huge! Delivery was fast and sent to a local company, Sia Motor Freight, that would deliver it to our home. The local delivery was where the problems started. First, they wouldn't come in our driveway saying the truck was too big. We just had a huge, fully built, shed delivered with zero problems and told them so. They still said no and they wouldn't stop on the highway because that was too dangerous for them. Luckily, we have a big company three yards down, that said we could have it delivered there. It was brought there but these guys did nothing to help get it off of the truck. My 57 year old husband would have to pull each box off himself. An employee of the drop off site saw this and got his loader and unloaded it for my husband. He helped my husband put a safe load in the back of our truck and we unloaded at our house. This took four trips for us. Maybe WillyGoat could make sure to find good freights that will also unload for the price you pay on these swings.\nWe quickly decided we could not build it ourselves. (too many age problems) so we got on a local facebook site to hire someone. We hired a husband and wife team for half the cost of the \"professionals\". They build swings for a different company for a living. We knew they would take longer with ours because they would come after work and each day and build ours. They worked 2-3 hours per day when it wasn't raining. Even with all the rain they finished in a month. He kept telling us we made a good choice with this company. He said it is quality material and will last a lifetime if we treat it and paint it every year. He said his company's is lucky to last 2-5 years.  We were pleased to hear this.\nWe had a huge 3rd birthday party for our 3 yr old daughter and unveiled the swing. She gasped, her eyes grew large and she started squealing.  Our grandchildren who are 2, 3, 7,  and guests from 2-13 were all wowed and raced to it. There is something for all ages on this one! It was the hit of the party. Since it was so hot we put a sprinkler on the roof to wet the slide they loved it! Word of caution though,  water makes the big slide a rocket slide! We had young parents loving that. Just make sure you have plenty of soft landing. We used square foam floor mats with cedar shavings under them.  The 3 slides are great the curvy, tunnel slide was a favorite for the 6 and 7 year olds the small slide was a hit with the babies to 2 yrs old. From 2 to 7 the tall slide was a favorite. They all enjoyed sitting and playing under and inside play house section. Preschool kids love the chalkboard while all ages liked pretending to steer the ship and look at the sky from the binoculars. We added a castiron home bell. Such fun for the kids to ring. Small kids seemed to be afraid of the bridge but soon got over their fear when the bigger kids would go on it.\nWe didn't have a sandpit yet but we had a table filled with water beads and put under the tallest part of the set. This was another favorite playing spot.\nI found a plastic kitchen on the side of the road one day and brought it home. At Dollar General I found a plastic kitchen set to put in it. I placed it opposite the picnic table and the kids instantly made a resturant.\nThe solar lights are awesome and put out plenty light to play at night but too many mosquitoes make that impossible during the summer.  The uncovered slides get hot enough to burn skin so be mindful of that. The play area is built to where it makes a breezeway and even on hottest days I find comfortable to sit in with a good book or bring a mat and take a nap. We've had breeze up there even on the hottest, non breezy days.\nWe are very pleased with this set and glad we spent the extra money for better quality! Everyone loves it and we've gotten so many compliments on how nice it looks from the road. Our daughter calls it her castle.", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "105626301545400174876", "name": "Kathie Sanders", "time": 1595464207383, "rating": 5.0, "text": "We ordered playground interlocking border. It was just what we needed,arrived quickly and was easy to install..the perfect surround for our backyard playground!", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "114936403280874352731", "name": "cameron coombes", "time": 1594231159780, "rating": 5.0, "text": "Had a wonderful experience with WillyGoat. Communication/Products are the best!", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "106215277737827896068", "name": "Kate Hughes", "time": 1594234775357, "rating": 5.0, "text": "Great selection, website is easy to navigate, and the customer service is really excellent as well.", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "108872708416037022796", "name": "Joshua Terry", "time": 1594231719432, "rating": 5.0, "text": "Great products, my kids love them and so do I!", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "107168044577168715120", "name": "Marshall Ferrell", "time": 1594238483736, "rating": 5.0, "text": "Great selection,  very prompt service and extremely professional staff. We will be back for all of our Toys and Playground needs!", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "114665708703160944266", "name": "Terra Hicks", "time": 1554922182947, "rating": 5.0, "text": "Due to the reviews I was hesitant. Let me tell you I am more than thrilled of this experience. I will totally recommend WillyGoat for playground equipment. The price and service cannot be beat.\n\nI called the next day after placing my order on a Sunday to get clarification and ask questions. I asked about delivery and process. Customer service was great and friendly.\n\nThe delivery went smoothly and the driver was very friendly and helpful. I think what people need to know is that this is a small business out of Mobile, AL and they send the equipment through freight delivery. So the further you are from them it, leaves the delivery more vulnerable.\n\nOverall great experience!!", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "113438767720266712024", "name": "Sheila Paredez", "time": 1595262724715, "rating": 5.0, "text": "I have purchased replacement trampoline mats several times over the last 10 years. I am always happy with my purchase and the delivery.", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "112446800912955437934", "name": "Linnae J. Magyar", "time": 1594349640390, "rating": 5.0, "text": "Highly recommend this company! Reliable and wonderful products!", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "113070374677298318910", "name": "Christyn White", "time": 1595346261887, "rating": 5.0, "text": "We love our playscape.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN8NGNuI1GOS98biFjxeT9lk5imQ4YSt_qj8sb-=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "101144657729314298361", "name": "Rainer White", "time": 1595345646289, "rating": 5.0, "text": "Great service! They really stand by their work!", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "102736603601713172891", "name": "Ato Joy", "time": 1595344665655, "rating": 5.0, "text": "We ordered a playscape, very nice.", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "107084644300066922910", "name": "Joel Ferrell", "time": 1586460067470, "rating": 5.0, "text": "Fantastic Experience at best prices I could find.", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "103611606201431613050", "name": "Layton Hill", "time": 1594234577290, "rating": 5.0, "text": "Great company with excellent customer service.", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "109758535025340173285", "name": "Manuel Allen", "time": 1553260695051, "rating": 1.0, "text": "We ordered a canyon ridge swing set for our daughters Birthday. It was 9 days from the date we ordered it , we still haven't received it and willie goat said it isn't guaranteed shipping and wants us to pay double shipping to return it.", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "101409386374322994315", "name": "Andrew Kuhn", "time": 1593617592113, "rating": 5.0, "text": "Phenomenal customer service from start to finish!", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "101367093987134170089", "name": "Tonya Williams", "time": 1543259369569, "rating": 5.0, "text": "Loved the experience shopping with this company! Great costumer service, along with fast shipping. Will do more shopping with them in the future!", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "101089997655251571305", "name": "Cindy Kenney", "time": 1595353108740, "rating": 5.0, "text": "Fast shipping and awesome product!", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "115657537352271327199", "name": "James Coombes", "time": 1594232821913, "rating": 5.0, "text": "Great play set!", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "107573667040816108953", "name": "Kala Allen", "time": 1512954075171, "rating": 5.0, "text": "Willygoat is very professional! Great costumer service, shipping was immediate, and all around a great place to purchase a swing set! A great Christmas present for the kids!", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "112771939347411930321", "name": "Jeremy Hollinger", "time": 1513208495492, "rating": 5.0, "text": "Great items and great service!  Quality of products is great as well. Will do business with again!", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "118294933105808762933", "name": "Angie Deshay", "time": 1482884347064, "rating": 1.0, "text": "I placed an order totaling over $800 for a swing set for my children for Christmas. I placed the order 7 days prior to dec 25. The particular set I chose had a bold notation next to the price that stated it \"same day shipping\". Standard freight guaranteed 2-5 business days. So I paid $180 for shipping on that day.. The order did not ship for two days. I called and was told we will have that right out and you WILL receive it before Christmas... The shipping company called me in the 20 and told me they will be dropping it off the 21st.So I took off work in that day and waited ALL day. No one called and on one came. The following day I called willy goat and did not get an answer. I could not get anyone on the phone from them nor the shipping company. Christmas came and went and the only gift my children would receive NEVER came. I called two days after Christmas because willy goat was closed the day after Christmas. I spoke with a very rude and  insensitive lady who did ABSOLUTELY nothing in her power to resolve the situation.. Before I could speak and let her know the full story she cut me off numerous times. Chuckled at my situation and told me that even if I wanted my money back that I would have to pay for shipping.. Not once did I ask for my money back. What I did ask for was for them to kindly refund the shipping I paid to guarantee it would be here in time. She continued to be very rude and cut me off until she hung up on me. I am so saddled that my children had to suffer because of the poor customer service and communication. I am a business owner myself and I would not allow any of my employees to speak to a customer in a manner this woman spoke to me. I hope anyone who reads this review purchase from somewhere else.", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "100446238153375837131", "name": "Rebecca Jacobson", "time": 1508530538107, "rating": 1.0, "text": "Horrible customer service. They advertise quick shipping which is why we chose this company. Our playset was so late and I had to spend hours tracking down how we would get it in time for or daughters birthday. We ended up having to go pick up the set from the shipping terminal to have any chance of getting it in a timely manner. The freight company was so helpful in getting to a solution but Willy Goat was not at all helpful.\n\nWhen I called their “tough luck” attitude communicated how much they don’t care about customers. I’m now out trying to figure out how I’m going to entertain all these kids at a birthday party with no playset.", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "116957539268956755060", "name": "Nelson Signs", "time": 1517786008364, "rating": 5.0, "text": "Very proffesional, great customer service. The kids love it.", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "103510997861409053490", "name": "Eric Van Dalinda", "time": 1510081725507, "rating": 1.0, "text": "DO NOT BUY FROM WILLGOAT!!!!\n\nI wish I read the Reviews before buying from them.  I ordered a Swing Set over the phone on Oct 6.  Even though they are about $300 more expensive on line than others I did this because I was told it would be there 1 week later.  I needed it by then since I was off work and had help to put it together that weekend.\n\nAfter that I was on email and phone relentlessly with no help from Gail.  The set finally arrived 18 days after I ordered it and 11 days after I was told it would be there.\n\nWG sends alternate carrier and once it leaves their lot you are responsible to figure out when it will come.  The shipping company \"says\" they tried to deliver the 20th but we werent home and left a note for them to just leave it.  No swing set left No phone call...nothing.  I had to reach out again on Monday for the next day delivery.\n\nGail is rude and although I repeatedly asked for the owner or manager to call me she refused to pass along the info.  I can only hope they eventually read this or someone that knows them reads this and lets them know she keep all complaints from them.  I requested my shipping money back and Gail laughed.  Again I must have asked to speak to the owner 20 times she said NO.\n\nLook elsewhere...you will be disappointed.", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "116752924216538288424", "name": "Fallon Henry", "time": 1510677736729, "rating": 1.0, "text": "Highly disappointed. After searching for the swing set we wanted and finding it for a good price with free shipping, we ordered. Later came an email showing added shipping costs. The manager Gayle refused to honor the $0.00 shipping charge that was shown on my screen at time of purchase, even tho I have screen shots of my confirmation page (also showing the no shipping charge again with my order number). She even called to let me know there were 2 charges on my credit card (of course the shipping was NOT a charge I had authorized). She didn't seem to want to hear my point, see my order confirmation showing the no shipping charge, or attempt to make it right, instead she just said she \"would refund it all bc there was a flaw with my computer.\" I'm not sure how the flaw can be my computer, but rather a flaw in their system and a manager that won't honor the charges that were shown on their website, that stayed the same throughout the online checkout process, and even showed up as $0.00 shipping on my order confirmation page. Very disappointing for a new customer. I'll attach images of the confirmation page showing that their website did indeed take me through the checkout process with NO shipping cost only to be charged the added $202.64 after the order went through.", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "109049122810092782639", "name": "Beth M", "time": 1587438279354, "rating": 3.0, "text": "Gail is beyond unhelpful.", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "117670637467015088723", "name": "Larenzo Frazier", "time": 1482939638031, "rating": 5.0, "text": "Great prices and a large selection of merchandise", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "102590786408470773622", "name": "Yesn Bwnqn", "time": 1594234893218, "rating": 5.0, "text": "Love this", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "107652900955206071462", "name": "Pinto Chacko", "time": 1505446634826, "rating": 2.0, "text": "I bought the Gorilla Mountaineer TS Wooden Swing Set, Product ID 01-0005-TS from Willy Goat almost a year ago. After 6 months the telescope broken. I have called them later and they advised to call Gorilla directly. Finally I had to pay for a new telescope.", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "104946101183403840455", "name": "Garret Warr", "time": 1498691304223, "rating": 1.0, "text": "Bought a swingset, almost $5k guaranteed 3 day shipping, paid extra for Fed Ex guaranteed 3 day and they did not deliver on time.", "pics": null, "resp": null, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "110451306620798197095", "name": "Erika Olivera", "time": 1624493550174, "rating": 1.0, "text": "The worse customer service ever.\nWe spent close to 20,000 with this company. We bought a playground and paid for install. They installed our playground during the winter assured us that they previously did installs over snow. Come spring; snow is melted and you can see how unleveled our playground is. Not to mention they left the ground screws pointing up, leaving hazards for the children at our daycare. If you are a residential daycare, do not buy from this company. The customer service is only two people and the lady who claims to be the manager clearly shouldn’t be the manager. She is rude and nasty. Her name is Gail. They do not take responsibility for there mistakes and lack of communication. They try to rush you off the phone and never follow up! They hire a third party to do your installs and they do NOT have communication with the contractors, they pretty much send you off to another company.. meanwhile your paying Willy Goat. They make you hire someone else to fix there errors, I had 3 different companies come check and they were all shocked as to how this playground was installed.\n\nWilly Goat does not care for the safety of children.\nWilly Goat does not care about their customers.\nI have been waiting for 3 months to solve this problem. They refuse to fix our playground and refuse to admit they messed up on the install.\n\nI do not recommend this company to any child care programs.\n\nThey say they will send someone to fix the screws and blame “post” installation instructions to be followed. However the whole playground is not straight; it’s crooked. They also don’t install all the parts correctly. Installer left a big gap in between the stairs.. another hazzard. I will be contacting the Business Bureaur on this company because they are not taking responsibility to fix playground leveling NOR the stairs. I got a faster response from the “owner” through google than a phone call.. as they mentioned the owner will be contacting me for weeks already. Spend thousands for unprofessional work. Worst customer service who rush you off the phone and tell you lies.", "pics": null, "resp": {"time": 1624460949143, "text": "Hi Erika, thanks for your feedback -- we take all feedback seriously! We do install play systems in the snow very regularly and take seriously the safety of children!  That's our business!\n\nWe know this installer very well, but had someone local we did not know come back out to look into it for the sake of urgency. If the post-installation written/verbal instructions were followed, this wouldn't have been a problem. Fortunately, as discussed, the fix is very simple, and we can have our installer back by to tap the bolts back in place when he's free to take care of it!"}, "gmap_id": "0x889bb5556866c317:0x7cfb6402d6281f05"}
{"user_id": "116950228458303536884", "name": "Narinder Sandhu", "time": 1600725532960, "rating": 5.0, "text": "Picked up load from this place for Davis California. Loaded in 15 minutes after checked in. No complaints for this place.Keep it up guys for your good service. 👍👍", "pics": null, "resp": null, "gmap_id": "0x888a783bed3efeaf:0x7487c183faabc9e9"}
{"user_id": "101208393973151479288", "name": "Blue Magic", "time": 1604637684412, "rating": 5.0, "text": "Great place to unload! Nice people!", "pics": null, "resp": null, "gmap_id": "0x888a783bed3efeaf:0x7487c183faabc9e9"}
{"user_id": "111099294706359370228", "name": "PickledAbyss", "time": 1604584422994, "rating": 5.0, "text": "Great place to work.", "pics": null, "resp": null, "gmap_id": "0x888a783bed3efeaf:0x7487c183faabc9e9"}
{"user_id": "114651819920588256667", "name": "Angel Molina", "time": 1493210930237, "rating": 5.0, "text": "Good place to go to pick up the load and quickly loading nice people", "pics": null, "resp": null, "gmap_id": "0x888a783bed3efeaf:0x7487c183faabc9e9"}
{"user_id": "108040071153208210389", "name": "Gary Holder", "time": 1594242033378, "rating": 5.0, "text": "Friendly", "pics": null, "resp": null, "gmap_id": "0x888a783bed3efeaf:0x7487c183faabc9e9"}
