{"user_id": "102120868122884085975", "name": "Sam Cook", "time": 1597772561816, "rating": 1.0, "text": "The older man at the front desk is rude and is hard to deal with every time me or any other of my employees go into the store needing something. the previos review before mine says this has been dealt with and obviously it hasn't been or this wouldn't be an issue 1 year later.", "pics": null, "resp": {"time": 1597856497993, "text": "We greatly apologize for the disappointing visit.  We have talked to the store personal and the manager will address this issue.  I hope you will give AHP an other opportunity to make a better impression."}, "gmap_id": "0x8862851d0155626f:0x63b5c76524e9176c"}
{"user_id": "111049030120653330908", "name": "Joshua Wagnon", "time": 1488650620977, "rating": 5.0, "text": "Always have what I need in stock with quick in and out service. Little pricey but you get what you pay for with a knowledgeable staff and quality parts. I always recommend them when someone is in need of hose related parts.", "pics": null, "resp": null, "gmap_id": "0x8862851d0155626f:0x63b5c76524e9176c"}
{"user_id": "108205001349694561114", "name": "Shawn Holmes", "time": 1553699456006, "rating": 1.0, "text": "Need someone else working up front that can actually help instead of being smart.", "pics": null, "resp": {"time": 1553711060848, "text": "Shawn,\nWe greatly apologize for your experience at the store.  AHP strives for excellent customer service. This issue will be addressed immediately."}, "gmap_id": "0x8862851d0155626f:0x63b5c76524e9176c"}
{"user_id": "102009875895164431145", "name": "Daniel Hall", "time": 1481251483643, "rating": 4.0, "text": "Very helpful staff. They figured out what I needed even though I wasn't sure. I explained the best I could what type of hose I needed and they figured it out from there. I took the Hose to the job and it fit perfectly", "pics": null, "resp": null, "gmap_id": "0x8862851d0155626f:0x63b5c76524e9176c"}
{"user_id": "106545198555243293023", "name": "Patrick", "time": 1531144915158, "rating": 5.0, "text": "I use TotalHose in Decatur and Huntsville regularly.  They are the only source for hydraulic hoses and parts that I trust in huntsville and decatur.  Scott and team do a wonderful job.", "pics": null, "resp": null, "gmap_id": "0x8862851d0155626f:0x63b5c76524e9176c"}
{"user_id": "111756221796426435762", "name": "Jon Madrigal", "time": 1457513545896, "rating": 5.0, "text": "I got hosed and was happy about it", "pics": null, "resp": null, "gmap_id": "0x8862851d0155626f:0x63b5c76524e9176c"}
