{"user_id": "109083070091680002357", "name": "Lisa Norris", "time": 1569121071894, "rating": 5.0, "text": "If  you want to eat some real New Orleans home cooking! This is a great little spot to get it!! Amazing food and the staff was very friendly. Nice to see a family owned business open up in Foley! Good luck to your success!", "pics": null, "resp": null, "gmap_id": "0x889a0f0b5587911d:0x758d8ed806dec138"}
{"user_id": "109797983277085920435", "name": "Joe Byrd", "time": 1574376645972, "rating": 5.0, "text": "Excellent food and service. Home made sauces and amazing French bread. Can't go wrong with anything on the menu.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPxFWGAnOFNA8dYffXC1DYTWjY7Wv3ebKe8zgAK=w150-h150-k-no-p"]}], "resp": {"time": 1574381286653, "text": "Thank you very much it’s well appreciated. Hope to see you all again."}, "gmap_id": "0x889a0f0b5587911d:0x758d8ed806dec138"}
{"user_id": "115347369722981776916", "name": "Sean S.", "time": 1576957981444, "rating": 5.0, "text": "Lovely people and great food! Very clean (yes even in the back!), and prompt service. Worth it for a damn good sandwich!", "pics": null, "resp": {"time": 1576966471392, "text": "🥰😍👍🏻👊🏻"}, "gmap_id": "0x889a0f0b5587911d:0x758d8ed806dec138"}
{"user_id": "105410350230218535305", "name": "Darin Ness", "time": 1570551050080, "rating": 5.0, "text": "Great food. Awesome price. Such amazing restaurant. Great owners and they support the military. 100 starts if I could", "pics": null, "resp": {"time": 1570755272408, "text": "Sooo wonderful we appreciate you lots, hope to see you again soon. Happy you enjoyed your food. Next time you remind me to give you that well deserved military discount : )"}, "gmap_id": "0x889a0f0b5587911d:0x758d8ed806dec138"}
{"user_id": "105920548332225583331", "name": "Chip Dalton", "time": 1574447313000, "rating": 5.0, "text": "Friendly staff with incredible food! My food came out hot and fast, If I wouldn't have been so hungry I would've taken a picture. I tried both the roast beef and sausage patty po'boy and they were so good.", "pics": null, "resp": {"time": 1574452331316, "text": "Thank you so much for your kind words. We appreciate your business and hope to see you again real soon."}, "gmap_id": "0x889a0f0b5587911d:0x758d8ed806dec138"}
{"user_id": "116929687811862882618", "name": "Kip Morrissette", "time": 1572775091466, "rating": 5.0, "text": "Everything I've had has been excellent. My favorite is something I wouldn't have thought I'd be ordering but it's a FAVORITE now, 'Hot Sausage Patty Po'Boya' with Cheese and standard Red Onion and sliced Pickles. Haven't had anything I haven't enjoyed.  Super owners and it's NOT a FRANCHISE, just family owned.", "pics": null, "resp": {"time": 1572789937598, "text": "We are so happy you enjoyed, it’s going to be hard to have another cheese burger again after the hot sausage  Po’Boy lol... see you again soon, and thank you lots."}, "gmap_id": "0x889a0f0b5587911d:0x758d8ed806dec138"}
{"user_id": "111999782075774943809", "name": "Cassandra Huffman", "time": 1576284086526, "rating": 5.0, "text": "Absolutely delicious and very friendly staff! We just moved here and ate at Po'Boys Paradise on our first night in town - based off reviews. They did not disappoint. Shrimp Po'Boy, Gumbo, burger and Gravy (for the fries) were all delicious. You will not be disappointed. We will definitely frequent.\nHighly recommend!", "pics": null, "resp": {"time": 1576338845995, "text": "Thank you very much we appreciate you, welcome to our wonderful little town, look forward to having you all as local regulars 😃😍"}, "gmap_id": "0x889a0f0b5587911d:0x758d8ed806dec138"}
{"user_id": "103069619554998573280", "name": "Hadashah Jael", "time": 1570913027761, "rating": 5.0, "text": "The seafood 🦐 is awesome and the owners are friendly - highly recommend shrimp platter, onion rings, gumbo ❣️  This is a REAL local restaurant. Wonderful, very clean too!", "pics": null, "resp": {"time": 1570921426258, "text": "Thank you so very much for your review it is very much appreciated. See you again real soon."}, "gmap_id": "0x889a0f0b5587911d:0x758d8ed806dec138"}
{"user_id": "107365884695369524413", "name": "Dan S", "time": 1573923502690, "rating": 5.0, "text": "I keep forgetting to write my review. I've eaten here twice now. I've tried at least five things and will say that everything has been very good. I hope they continue to succeed!", "pics": null, "resp": {"time": 1573929070973, "text": "We greatly appreciate you taking the time to write a review. We will continue to provide great food and customer service. Can’t wait to have you in again."}, "gmap_id": "0x889a0f0b5587911d:0x758d8ed806dec138"}
{"user_id": "100777399868149688222", "name": "Kelvin Allen", "time": 1569269628871, "rating": 5.0, "text": "Excellent food, excellent service great experience. Keep up the good work.", "pics": null, "resp": {"time": 1569270400983, "text": "Thank you sooo much. We appreciate it lots. Hope to see you all again 😊"}, "gmap_id": "0x889a0f0b5587911d:0x758d8ed806dec138"}
{"user_id": "116916976966398004099", "name": "Tony Vidal", "time": 1573175872905, "rating": 5.0, "text": "These people are the greatest...down to earth, family first, and dont get me started on the food...if you dont check them out you are missing the BEST po boys outside of the BIG EASY...I should know I'm from there..keep up the good work..who dat....", "pics": null, "resp": {"time": 1573180319607, "text": "This is truly appreciated. Support from customers like you make everything worthwhile. We can’t wait to see you again and you are definitely part of the Po’Boys Paradise family. Who Dat!!!!!!"}, "gmap_id": "0x889a0f0b5587911d:0x758d8ed806dec138"}
{"user_id": "104010588147813289822", "name": "Zach Rutledge", "time": 1572395463587, "rating": 5.0, "text": "Everything I’ve tried here has been really good so far.  The family that runs it is really nice, too.  The menu is pretty small but they seem to put effort into everything they sell.  Case in point, the roast beef is tender and the gravy homemade.  That same gravy graces the Glory Fries, and they are a savory alternative to sad regular fries.  Speaking of which, the fries here are not “regular” at all!  They are some sort of unusual ribbon cut that’s folded almost in half.  It’s a design that maximizes the outer crunch while preserving the interior’s soft creamy center and holy cow why isn’t everyone making fries this way!?  There are a couple of seasonings you can add to them; I sampled the Cajun one and it’s slightly spicy, but my favorite will always be the Glory Fries since cheese plus gravy = heaven.\n\nThe bread for the po-boys is excellent quality as well.  Too often down here I’ve eaten po-boys where the bread is either incredibly chewy to the point it’s almost inedible, or so heavily toasted it dissolves into crumbs on the first bite.  But not this.  It’s tender on the inside and has just the right light crispness on the exterior.\n\nI’ve also had a cup of the gumbo and it really is some of the best I’ve had anywhere, with several good shrimp and sausage bits in it, plus plenty of rice and a nice red pepper kick that made the spiciest thing I’ve found on the menu so far.\n\nAt the time my family and I dined in, they were testing something in place of the regular coleslaw, that they were calling Swamp Slaw.  It was white corn with tomatoes, cucumbers and a homemade ranch dressing, with light seasoning.  It’s not something I’d want but my family member who tried it absolutely raved about it, since it was so flavorful and out of the ordinary.  She also had onion rings instead of fries and they were a thumbs up from everyone, too.  The onions were sweet and the batter was crisp and crunchy without being messy.\n\nThe other diner in our group had the spicy sausage po-boy and he enjoyed it, but complained that it was not the least bit spicy even by our bland local standards.\n\nWe’ve also had a chance to try the beignets and they are very good, too.  They’re not nearly as big as some of the ones I’ve had elsewhere here or in New Orleans but they are cooked just right, with a fluffy interior and crisp exterior, and of course plenty of powdered sugar.  A fitting end to an excellent meal.\n\nOverall, a really good experience.  It’s not a big place, and it’s definitely out of the way but worth seeking out.  If there’s one complaint to lodge, it’s the lack of a fountain drink dispenser; they only offer bottles of Coke products and Gold Peak tea, which is not ideal.  Still, that’s a minor quibble for what is an otherwise really, really good authentic New Orleans-style po-boy.", "pics": null, "resp": {"time": 1572789786636, "text": "Thank you very much for all of your honesty we greatly appreciate it. We are happy we could bring a little bit of Louisiana to Alabama. Hope to see you again soon."}, "gmap_id": "0x889a0f0b5587911d:0x758d8ed806dec138"}
{"user_id": "111260481677447621137", "name": "lanya bass", "time": 1568489263290, "rating": 5.0, "text": "I’m not a big fan of fried seafood, but I ordered the fried shrimp poboy, with the voodoo sauce, and I really enjoyed it! I recommend the shrimp poboy with a side of the garlic parmesan pot wedges! I would give 6 stars, but the maximum is 5!!", "pics": null, "resp": {"time": 1568501672565, "text": "Thank you!!! Awesome to hear we appreciate it a lot 😍"}, "gmap_id": "0x889a0f0b5587911d:0x758d8ed806dec138"}
{"user_id": "110372059272538730894", "name": "gerald bandura", "time": 1568487204799, "rating": 5.0, "text": "Shrimp po boy and gumbo was excellent. Service fast and friendly.", "pics": null, "resp": {"time": 1568488981165, "text": "Thank you lots. We are so glad you enjoyed it.  Hope to see you again. 😊"}, "gmap_id": "0x889a0f0b5587911d:0x758d8ed806dec138"}
{"user_id": "110051926112337645726", "name": "Lisa Wilson", "time": 1570316638402, "rating": 3.0, "text": "Food was good very friendly people little to hot in restaurants to enjoy food", "pics": null, "resp": {"time": 1570319525402, "text": "We do apologize and plan on getting that straightened out ASAP. Hope you will give us another chance in the near future thank you."}, "gmap_id": "0x889a0f0b5587911d:0x758d8ed806dec138"}
{"user_id": "103569353171718077992", "name": "Bryan Robinson", "time": 1570481517265, "rating": 5.0, "text": "We are from chattanooga Tennessee and.found this little slice of New Orleans and it was awesome had the shrimp poboy and jambalya, will make this a have to when passing through.", "pics": null, "resp": {"time": 1570482904306, "text": "We are happy you all enjoyed. Have a safe trip and hope to see you guys again. Thank you lots."}, "gmap_id": "0x889a0f0b5587911d:0x758d8ed806dec138"}
{"user_id": "103812679018701196611", "name": "Darrell Balsamo", "time": 1569531529450, "rating": 5.0, "text": "I try something different when I eat their never dissatisfied with the what I order", "pics": null, "resp": {"time": 1569533108402, "text": "You have no idea how much that means to us. We are happy to have you as an official regular 🥰 thank you!!"}, "gmap_id": "0x889a0f0b5587911d:0x758d8ed806dec138"}
{"user_id": "118241252225895529734", "name": "Terry Stokes", "time": 1568513811719, "rating": 5.0, "text": "WHO DAT MAK'N DEM PO BOY'S?\nI CAN TASTE 'EM ALL THE WAY FROM THE FREE STATE!!", "pics": null, "resp": {"time": 1568562950473, "text": "❤️🥰😍😘"}, "gmap_id": "0x889a0f0b5587911d:0x758d8ed806dec138"}
{"user_id": "101192903055957045239", "name": "Cornelia Thrash", "time": 1623040778665, "rating": 3.0, "text": "Boi did I have to work for this food! 3 times I ordered the fried fish and shrimp and 3 times they brought out a partial order! I must say, \"They weren't even worth the wait! The only seasoning I could taste was the pepper. The onion rings were free due to the constant order mix-up. I'm glad cause if I had paid for them the level of disappointment would have been overwhelming. They are the low quality frozen onion rings that has the very thin supposedly sliced onion that has no onion flavor that's breaded in breading that has no flavor! I also ordered the crawfish that's boil-in-bag with potatoes,  sausage,  and corn. I imagine it would have tasted alright if I could have eaten it! There was so much grease in the bag and on the food I was afraid to try it! I don't know if the grease came from the cheap sausage that was included or if they added margarine thinking that would add flavor. The corn literally had to be rung out with paper towels before it was edible!\nAll-in-all the jewel in this experience was the waitress Ashanti! Her patience and her professionalism spoke volumes! Not once did she even sigh amidst the order mishaps. Thank you Ashanti! I only wish that all those who work in customer service had your attitude,  patience,  and humility!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOBddXIAPhIUSdiSm73Uk7fPQDhnUqLcCTN3KLC=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPQR9VWCrJXh3N1KfHmyUyJJCaOUrRPFIDS9OPI=w150-h150-k-no-p"]}], "resp": {"time": 1623284405069, "text": "Hi,Cornelia.\nThank you for your time to give us a feedback.\n\nfirst of all,I’m glad you like Ashanti’s work! We’ll pass along the kind words.”\n\nSecondly,I’m sorry your experience with us didn’t go well.\n\nWe use Conecuh original smoke sausage,I think it is pretty good quality and it’s local favorites.\nAnd Our fried onion is one of our popular items ,that’s why we gave it on the house as we made a mistake on your foods. I’m sorry you didn’t like it.\n\nOur seafood served in the bag,It’s kinda a trend in big cities like New York and Atlanta.I understand that some people not familiar with it,since it is different from local .\n\nAnd also Our seafood boil is served with our house sauces,which contains butter,And they all taste great,It’s new and different from local ,but we have confidence that our seafood boil soon will become a favorite to the local."}, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
{"user_id": "116718931166716692484", "name": "Eric Richardson", "time": 1610077211203, "rating": 5.0, "text": "We had fried oysters and calamari appetizers as well as steamed King crab and shrimp with corn, potatoes and sausage. The menu says steamed, which I usually equate with bland. Royals great seasonings and spices, however, make it more like the great boiled seafood South Louisiana is so famous for, and far from bland. We especially liked that Royal offers several different seasoning combinations levels as well as heat levels. It was all very fresh and delicious. Service was great -attentive but not bothersome. Very clean and spacious. I highly recommend Royal Seafood.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM0u4u-eflEmuYZqBERqlvGQFE_ynmbd_456kES=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNB6YkWSIvaCzRTcekXmfbV_brXjJV_KMFhD1Dw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMzwyuU0J62-VgXTzG5U1A7Y6JpLM3YD34YEhAe=w150-h150-k-no-p"]}], "resp": {"time": 1610154877091, "text": "We are grateful for your kind words and your time to leave us this amazing reviews,Thanks for sharing your review with us and the community."}, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
{"user_id": "115059324309733851292", "name": "Matt Simon", "time": 1622941045282, "rating": 5.0, "text": "This is a hidden gem!! The food and service was great. If you are looking for great seafood, go here!!  Better than all the other places on Airport Blvd. (And better prices). We had a great mix of food and it was all great and cooked perfectly.", "pics": null, "resp": {"time": 1622942183890, "text": "Thanks for leaving our business a 5-star rating, Matt. I’m glad that you had wonderful experience with us.\n\nYour review,WAW! one of my favorites,it means a lot to our team,thank you so much,it’s truly appreciated!"}, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
{"user_id": "111759391031118641450", "name": "Joshua Chancey", "time": 1614386885600, "rating": 5.0, "text": "Service and food is amazing. Me and my kids loved the presentation of the steamed seafood bags on the platter as well as getting to wear the crab bibs. The butter seasoning sauce on the shrimp and crawfish is some of the best I've ever tasted. Will be back again soon!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM9XTcaj3wPWH3y9_YA7_tpW8L5Y9oavTc2RqrY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN9_r5GDgxiOP0Phxuz1fdYO0xE1P_YgkKszO90=w150-h150-k-no-p"]}], "resp": {"time": 1614387897598, "text": "Thank you so much for taking the time to leave us this amazing review.\nLooking forward to seeing you soon"}, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
{"user_id": "104814663456214683710", "name": "Clint Cobb", "time": 1620583697512, "rating": 5.0, "text": "The food is really good and there's plenty of it.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMr_2974AcAbo6yyUzDzSdwsA2tch-lWSqA3s-8=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPm2oX3DUqhMlw2PQToxLy8kWQOY4wt4HbjANZj=w150-h150-k-no-p"]}], "resp": {"time": 1620603138818, "text": "Thank you so much for taking your time to give us a 5 stars review, we are very happy you like our foods.\n\nCome back and see us soon. Cheers!😀"}, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
{"user_id": "109095386538694541817", "name": "William Ellison", "time": 1622857279414, "rating": 5.0, "text": "Good food, and lots of it! Helpful, friendly staff, too. I could wish for some veggies on the menu though. 😊", "pics": null, "resp": {"time": 1622942889411, "text": "Thank you for your time to leave us 5 stars reviews,William.\nI like that idea,hopefully in the future menu we will have some veggies available."}, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
{"user_id": "114277536852777010523", "name": "Wade Parnell", "time": 1617396054270, "rating": 5.0, "text": "Awesome food.\nAwesome service.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPKgTgZtv47ristaiqLdCHQGLV3zwkBGNHzuxfX=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOa-SXWPMyxu08GP-86-AQ6iNL-QW81DjYGnZM2=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN3fxeLriNbblKMG6HmIN8DGbXFBzjWIiQs3erP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPK81E-3BFb21GOEsLuK77H_jtcQ3ALV5ffzfFs=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNDDoJTfy1vZucnKroXxtahHXZ_SrVUzoHn8MVl=w150-h150-k-no-p"]}], "resp": {"time": 1617479818619, "text": "We are glad that you like our food and service .looking forward to seeing you soon"}, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
{"user_id": "108230012881994445560", "name": "Julie Stokes", "time": 1621713605609, "rating": 2.0, "text": "I wasn't impressed by any means. The cup that I got had nasty residue all around the rim. The forks were bent to the point of where they were just impossible to use. It's a little pricey for what you get, but the seafood did have good flavor. I think I'll just make the drive to the causeway the next time I go out for seafood.", "pics": null, "resp": {"time": 1621731753163, "text": "Hi,Julia.\n\nWhile It’s great you like our seafood flavor,I apologize for the cup and fork,it’s an uncommon instance,thank you for bring this to my attention,we will fix it right away and ensure this won’t happen again.\nLooking forward to seeing you soon."}, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
{"user_id": "113786681668356877047", "name": "Tobbi White", "time": 1621123659804, "rating": 5.0, "text": "Good seafood and really excellent seafood.   Our waitress was just as sweet as could be.", "pics": null, "resp": {"time": 1621125642155, "text": "Tobbi,thank you for the great review! We’re so happy you loved your experience and can’t wait to have you back for your next visit."}, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
{"user_id": "114277536852777010523", "name": "Wade Parnell", "time": 1617396054270, "rating": 5.0, "text": "Awesome food.\nAwesome service.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPKgTgZtv47ristaiqLdCHQGLV3zwkBGNHzuxfX=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOa-SXWPMyxu08GP-86-AQ6iNL-QW81DjYGnZM2=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN3fxeLriNbblKMG6HmIN8DGbXFBzjWIiQs3erP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPK81E-3BFb21GOEsLuK77H_jtcQ3ALV5ffzfFs=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNDDoJTfy1vZucnKroXxtahHXZ_SrVUzoHn8MVl=w150-h150-k-no-p"]}], "resp": {"time": 1617479818619, "text": "We are glad that you like our food and service .looking forward to seeing you soon"}, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
{"user_id": "104685368974533421474", "name": "S S", "time": 1620601850106, "rating": 3.0, "text": "Food was seasoned well but the quality of the food was very disappointing.  The headless shrimp were like the medium size frozen easy peel headless and deveined ones you get from Walmart.  The snow crab were small but ok.  Over priced because of the quality of the food.", "pics": null, "resp": {"time": 1620602910599, "text": "Thank you for the review.And Thank you for letting us know about this. Your feedback helps us get better\n!"}, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
{"user_id": "110573848331311301951", "name": "Hades Flow", "time": 1616288734480, "rating": 1.0, "text": "Price is high for so little food. Shrimp was good (nothing to write home about) but the chick tenders are pathetic. Wont make it with the tough competition of seafood places around the area.", "pics": null, "resp": {"time": 1616519441624, "text": "Thank you for the review ,and bring this to my attention,I’m glad that you enjoyed our shrimp ,and sorry you didn’t like chicken tender ,we will look into it , And strive to do better."}, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
{"user_id": "104576253488139508880", "name": "Stephen Carter", "time": 1618526326466, "rating": 5.0, "text": "I had a friend raving about how good this place was on Facebook so I decided to give them a try. I ordered online and my only complaint is that I didn’t order more. Everything we got was extremely good and tasted really fresh. I got the crawfish po’boy and that thing would make a tadpole slap a whale. My wife got the garlic butter crawfish and hasn’t stopped talking about how flavorful it is. We will be back", "pics": null, "resp": {"time": 1618531222304, "text": "I love how you described it .thank you so much for taking your time to leave us this amazing review and share your experience.\n\nHope to see you soon!"}, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
{"user_id": "102363102242532040806", "name": "Jerry Morris", "time": 1619125887863, "rating": 4.0, "text": "Great food and portions. Service could be better.", "pics": null, "resp": {"time": 1619212911776, "text": "Thank you for your review ,we will use your feedback for future improvements."}, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
{"user_id": "103545683079038041989", "name": "Ge Ge M", "time": 1615238142104, "rating": 5.0, "text": "I love their lobster tail and snow crabs! Fresh and favorable always!", "pics": null, "resp": {"time": 1616519749093, "text": "Thank you so much .This review made our day!"}, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
{"user_id": "117617467539302418703", "name": "William Melson", "time": 1615082149408, "rating": 5.0, "text": "I was skeptical but I was blown away the shrimp and catfish was cooked perfectly and the gumbo was great I will definitely be back", "pics": null, "resp": {"time": 1616520317137, "text": "We are glad you had a good experience with us .We set a timer for each of our dishes,so it will cook just right .\n\nWe Really appreciate for your time to write this wonderful review and share with the Community."}, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
{"user_id": "110905842917720201327", "name": "Timothy Roy Whitley", "time": 1620084024282, "rating": 5.0, "text": "Great hot food at a fair price 👌 😋", "pics": null, "resp": {"time": 1620095232757, "text": "This review made our day,thank you so much!🙏"}, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
{"user_id": "114425997432715069246", "name": "Renea D", "time": 1616494895354, "rating": 4.0, "text": "I had to get my own silverware because the waitress felt like I didn't need it I guess! The food was awesome besides that.", "pics": null, "resp": {"time": 1616518704320, "text": "Thank you for the review.\nWhile We are glad you loved our food,we are really sorry about the silverware,we will\nMake sure it won’t happen again ."}, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
{"user_id": "115308753646942037320", "name": "Vickie Newell", "time": 1620429407742, "rating": 5.0, "text": "Clean, great service, Food was exceptional and very fresh!!", "pics": null, "resp": {"time": 1620486112775, "text": "Thanks for the awesome review, Vickie!"}, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
{"user_id": "108115012793427415816", "name": "Helen Harris", "time": 1620189517792, "rating": 5.0, "text": "A little high but food was good", "pics": null, "resp": {"time": 1620430123131, "text": "We are glad you like our food, and Thank you for the 5 starts review."}, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
{"user_id": "113547561341195179921", "name": "Elizabeth Downey", "time": 1621183834622, "rating": 4.0, "text": "Good food n great service!", "pics": null, "resp": {"time": 1621191303772, "text": "Elizabeth,thank you for the review,we are happy you visit with us went smoothly!😃"}, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
{"user_id": "112985198893362561338", "name": "Jasmine Rushing", "time": 1607293176693, "rating": 5.0, "text": "The food is great! I got the crab and crawfish combo with potatoes and corn. I loved the decoration, the menu wasn't incredibly crowded. It was a little more expensive than I usually buy, but I would love to eat here again!", "pics": null, "resp": {"time": 1607406605264, "text": "Hi,Jasmine.\nWe are so grateful for your kind words. Thanks for sharing your review with us and the community.”\n\nwe look forward to seeing you again."}, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
{"user_id": "113562403255859165024", "name": "April Jenkins", "time": 1608502022535, "rating": 5.0, "text": "Love the atmosphere and food was great. Clean resturant and bathroom. Friendly service, the gumbo and fried catfish  was delicious.", "pics": null, "resp": {"time": 1608531202052, "text": "We are so grateful for your kind words,looking forward to seeing you again🙂"}, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
{"user_id": "101427069571937219202", "name": "Eden Zhang", "time": 1618844275071, "rating": 5.0, "text": "My new seafood spot.\nGood food,good service!!!", "pics": null, "resp": null, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
{"user_id": "111477331470961451251", "name": "gbrownie86", "time": 1607648550895, "rating": 5.0, "text": "The main food is essentially a shrimp boil in a bag but with any seafood you want. It is really good.", "pics": null, "resp": {"time": 1608356865000, "text": "We’re glad you loved Our foods,and Thanks for sharing your review with us and the community."}, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
{"user_id": "114234775173873190474", "name": "Louis Bird", "time": 1621710262023, "rating": 3.0, "text": "Getting better as they grow", "pics": null, "resp": {"time": 1621789825331, "text": "Thank you for the review Louis."}, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
{"user_id": "102303980239145119220", "name": "Joe Jackson", "time": 1610236194693, "rating": 1.0, "text": "Fried Shrimp tasted like boiled with batter added. Catfish not \"Southern\" enough. VERY Stingy with sides. Order took too long.", "pics": null, "resp": {"time": 1610244576246, "text": "Thank you for letting us know about this. Your feedback helps us get better. We are looking into this issue and hope to resolve it promptly and accurately."}, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
{"user_id": "102803439662437435971", "name": "Edward and gidget davis", "time": 1618234500467, "rating": 5.0, "text": "Very awesome yummy food!! Thank you!!", "pics": null, "resp": {"time": 1618239117234, "text": "Thank “you” ,this review made  our day!"}, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
{"user_id": "106215569769764523799", "name": "Joshua Necaise", "time": 1604614341925, "rating": 2.0, "text": "Just looking at the menu. Crawfish $10.00 a lb ? Lol y’all are smoking crack. Especially when you can buy crawfish for half that somewhere else", "pics": null, "resp": {"time": 1604636444963, "text": "Hi,Joshua .thank you for your time to write us your opinion.\n\nYou are right that you can buy crawfish for half somewhere else.\n\nJust so you know that our crawfish comes with corn,potato,and sausage.\n\nPlease take this for consideration... that price are not only food costs, but also labor costs, rent, taxes, insurance, maintenance and so on.\n\nOur menu isn’t perfect for everyone,but everyone’s opinion is valuable to us. If necessary,we will optimize our menu to meet the most people’s needs.\n\nThank you!"}, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
{"user_id": "113456552774785447742", "name": "evan carmadelle", "time": 1604951286394, "rating": 5.0, "text": "I’m so glad they checked that dusty crusty Chinese buffet into something worth my time!!", "pics": null, "resp": null, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
{"user_id": "113590032186618112775", "name": "Josh Hancock", "time": 1618262165496, "rating": 4.0, "text": "Shrimp was very good", "pics": null, "resp": {"time": 1618262948465, "text": "We are glad you had a good experience with us ,and Thank you for your time to leave us the review!"}, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
{"user_id": "101504184523305570784", "name": "Jessica Watkins", "time": 1623270419690, "rating": 5.0, "text": "Great food", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPvWIG2qzTsAxQ_CH2DvHvSYm74NAiNKfbUWPzQ=w150-h150-k-no-p"]}], "resp": {"time": 1623280826344, "text": "Hi Jessica ,thank you for rating and reviewing Royal seafood.❤️"}, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
{"user_id": "101018465454033236650", "name": "Mary Marzett", "time": 1615028788262, "rating": 3.0, "text": "Seafood combo not good.", "pics": null, "resp": {"time": 1615045209422, "text": "Thank you for posting a review\n.We would like to know why.Please could you contact me at royalseafood.official@gmail.com ."}, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
{"user_id": "102213316236036955344", "name": "Allison Simmons", "time": 1604951112425, "rating": 5.0, "text": "Very clean and the management is very sweet!", "pics": null, "resp": null, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
{"user_id": "100967347023087601644", "name": "Janell Ayala", "time": 1604951672949, "rating": 5.0, "text": "The food is great...", "pics": null, "resp": null, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
{"user_id": "112109889391678810638", "name": "U.S美国 分享与学习 频道", "time": 1604950286067, "rating": 5.0, "text": "Can’t wait to Try", "pics": null, "resp": null, "gmap_id": "0x889badb7bf05aa07:0x4fe5b6b443224cb5"}
