{"user_id": "110552451479692436185", "name": "Brad Miller", "time": 1623552015197, "rating": 4.0, "text": "Actually went 5o the Madison County License and Tax office inside the precinct. Real friendly ladies run the office and there is virtually no line.  Both times I've been there to renew my licenses and to renew my auto tags and pay the ad valorem tax on the cars I've have benn in and out in less than 15 minutes.", "pics": null, "resp": null, "gmap_id": "0x886212f5794f11df:0x673d610eec7d0ffd"}
{"user_id": "105259088216959999427", "name": "Dan Kashefska", "time": 1601083529186, "rating": 1.0, "text": "Called at 8:00 pm to report a theft of a sign and got a friggin answering machine. Pretty piss poor when you get an answering machine when yo call the cops to report a theft.", "pics": null, "resp": null, "gmap_id": "0x886212f5794f11df:0x673d610eec7d0ffd"}
{"user_id": "107886391048829545425", "name": "Somer Moody", "time": 1593006969977, "rating": 5.0, "text": "If you are a law enforcement officer and need a break, you can come park outside my home.  If you are thirsty I will bring you a drink.  If you are hungry I will fix you food.  If you are hot I will invite you inside to cool off.  If you need additional ammo just ask.  If you need backup, I will stand with you.  If you need to cry, I will hug you and let you.  If you need to talk I will listen.  If you need to pray, I will kneel with you.  If you are wrong, I will tell you.   If you are right I will support you.\nI only ask that you don't lose faith in Americans.  We are NOT all against you.  Our lives matter, as do yours.  Take off your sunglasses and see the good people that are here for you.\nGod Bless you and your family.   Copied from a friend!   💙💙💙", "pics": null, "resp": null, "gmap_id": "0x886212f5794f11df:0x673d610eec7d0ffd"}
{"user_id": "114812432340347797675", "name": "Jeff K", "time": 1545848950419, "rating": 1.0, "text": "It's too bad that an officer or two (Garner) have to give other fine police officers a bad name. I've never been arrested for or charged with any crime. I haven't even had a traffic ticket in over 30 years. I'm a law abiding citizen. When I am forced to call the police to my home to help me with a problem I don't expect the officer to take a bad attitude and talk to and treat my like garbage. I'm not the problem. I'll be filing formal complaints with Internal Affairs and this officer's Sergeant.", "pics": null, "resp": null, "gmap_id": "0x886212f5794f11df:0x673d610eec7d0ffd"}
{"user_id": "110683480549743321806", "name": "Tommy Thompson", "time": 1535344867070, "rating": 1.0, "text": "I have always been a supporter of the police, and always donated to the police, but now I'm no longer going to be one. The motto is suppose to be serve and protect, but needs to be changed to harass and bully. Having 5 police cars park about a quarter mile away from a 65 speed limit sign and pull over so many cars knowing that the citizens are going to go the speed that they see is just harassment. Instigation should also be illegal for police officers to do. If they are really doing this to keep the citizens \"safe\" how about putting up more speed limit signs? rather than putting up traps. Shows how busy our police officers are when they can have 5 cars just waiting on people to give tickets.", "pics": null, "resp": null, "gmap_id": "0x886212f5794f11df:0x673d610eec7d0ffd"}
{"user_id": "114869395840219232435", "name": "Tommy McCutcheon", "time": 1502986375436, "rating": 1.0, "text": "I took my disabled mother, from her home in Owens Cross Roads, and my grandmother over to visit my aunt who had just recently left the hospital after being in there over a month suffering from broken bones internal bleeding and massive damage to her leg. All injuries she received at work from a severe mechianary accident. Needless to say my mother and grandmother wanted and needed to see her. So I went and got my grandmother with alzhiemers from her home. Anyway, monday just after 12 I got to my mother's house where my grandmother was staying with her. I helped get them get loaded in my mothers van, which would be much easier to travel in than my 2 door mustang. I drove them to visit my aunt, their sister and dauther. I helped get them loaded back into my mother's van along with my aunt and her wheelchair this time and took them to visit some people we go to church  with that they haven't seen and really missed. After getting back to my aunts house from visiting, I unloaded my passengers and helped them inside. Inside someone from church had made food so we stayed for dinner together. So around a little after 10pm my mother was ready to go so I loaded everything back up and drove from Morgan County where my aunt lives to Owens cross roads where my mother lives and dropped her off at home. She was worried because of my terminal illness I had pushed myself to hard that day and insisted I had to talk with her on the phone my entire ride home back into Huntsville. She didn't want me to be sleepy and drive. Keep in mind though this is getting close to 11pm and I haven't been in my car since around 12 noon. So I hop in my carand cranked my Mustang. I turned my lights on and start heading on my way home to Huntsville. Before I get pulled out of the subdivision I get the call from my mom and we talk while driving home. As I am driving through Owens Cross Roads my left head light goes out. I thoght that's weird so I switched my lights off and on real fast thinking maybe it was just some glitch. The light came back on for a short duration and went back off. Since there wasn't much traffic at all this late I turned my bright lights on when I could without blinding people. Like any other law abiding citizen I was afraid I may get pulled over for this. So I prayed I would make it home without any trouble so the next morning I could go get this light fixed. I made it into Huntsville and less than 2 blocks from home when I saw a police car behind me. I told my mom I needed to let her go and before we could say bye I saw the police lights. So I got pulled into a shopping center. This lady ,Officer Peterson, walks up and says my head light is out. I tried to explain what happened and the steps I was doing to try to be safe and how I was already planning to get it fixed first thing the next day when businesses reopened. She was not concerned with any of that and interrupted me asking for license, registration, and insurnace. I get out my license and registration noticing another male officer pulled up and was back there talking to her partner. As I'm pulling up my esurance app to show my insurance id cards I mess up my password forgetting I needed a capital letter. Before reattempting she orders me to give her the license and registration and then walks off with them. I got my card pulled up immediately as she had stepped away and was flashing my phone out of the car to let her know. To my surprise she comes back awhile later with 2 tickets 1 for improper lights and 1 for failure or refusal to display insurance. When I tried to ask questions I was agressively interrupted and shut up. I tired showing her the insurance card and she refused to take saying it wasn't legal I needed a paper copy. Again she was agressively shutting me until I was afraid to say anything else so I took my tickets and left. I hate when cops like that give other good cops that kind of reputation that's why I left this comment in great detail. She abused her authority, broke the law, and intimidated me into silence.", "pics": null, "resp": null, "gmap_id": "0x886212f5794f11df:0x673d610eec7d0ffd"}
