{"user_id": "101495942545451720016", "name": "ALABAMA SHINE", "time": 1618504156979, "rating": 1.0, "text": "This place is unprofessional in customer service and products are defective.  I don’t recommend them to anyone.   I called about a defective product and there so called team leader was not professional and I drove over 25 miles one way.  I know this is only store for these products but once out the door and u leave.   It’s yours So beware of what they recommend and google it first then save money order the product on eBay or Amazon", "pics": null, "resp": {"time": 1618590873239, "text": "We apologize that we didn't meet your expectations. We have thousands of different products and we try to only carry the best products available, but even the best products sometimes have issues. We will be happy to exchange the product for you or if you would like to discuss it further please feel free to call us and ask for the Director of Operations."}, "gmap_id": "0x8862844cc1241183:0x4f6ee3036691fd9f"}
{"user_id": "110126636736649858715", "name": "Oleta Bruner", "time": 1612451956826, "rating": 5.0, "text": "Love it best in the state of alabama", "pics": null, "resp": {"time": 1612453593810, "text": "Thank you very much Oleta!"}, "gmap_id": "0x8862844cc1241183:0x4f6ee3036691fd9f"}
{"user_id": "108907030983422430641", "name": "David Goodwin", "time": 1554336999199, "rating": 5.0, "text": "Great uniforms , custom badges , gun belts an accessorys , custom name tags etc,etc", "pics": null, "resp": {"time": 1570203396603, "text": "Thank you David. We are happy to have you as a customer!"}, "gmap_id": "0x8862844cc1241183:0x4f6ee3036691fd9f"}
{"user_id": "115946586675132783261", "name": "Jason Clark", "time": 1605051857485, "rating": 5.0, "text": "Awesome place! Great selection! and the guys there know firearms in and out. They're very knowledgeable and know their stuff! The atmosphere there is very chill also. They didn't try to push me into buying something that i didn't even want. They make their suggestion when you tell them what you are looking for and they just kind of step back and let you make your own decision about it.\n\nI appreciate that! I Can't stand to be pressured about buying something.\nTop notch business and Top notch people there!\nI'll be back👍", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "103382617581800818873", "name": "Rob Jordan", "time": 1602094427142, "rating": 5.0, "text": "Today was my first time going in here, and the guys really helped me out I gave them what I wanted and price range and they made it happen. They are very knowledgeable guys and know everything it is when it comes to guns. The guys in there are easy to talk to and truly want to help you. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "108349891544577937801", "name": "Anthony Thomas", "time": 1599312525439, "rating": 5.0, "text": "Great shop, stopped in this week for the first time after my local shops all disappointed me with bad customer service.\n\nDrove 40 minutes to get here. Staff was great, had a great selection, purchased me a new pistol chambered carbine for a great price.", "pics": null, "resp": {"time": 1599345031190, "text": "Thank you Anthony, We take pride in our customer service, and by the way we stand by our guns. We hope to have a big shipment of ammo next week. Safe shooting. Don"}, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "117373659457946131307", "name": "Alex Medlin", "time": 1623965184815, "rating": 2.0, "text": "High prices and poor customer service", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "108969089308146354604", "name": "Mr. K", "time": 1586132185367, "rating": 5.0, "text": "Really enjoyed the salesman I worked with. I knew exactly what I wanted however he showed me a more recent model that I had no idea about. His recommendation was more ideal for the purpose of my purchas . Every concern I had, he showed me a viable solution.  Thanks for the professionalism and knowledge.", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "105108120626084339381", "name": "Bobby Kilgore", "time": 1564586726783, "rating": 5.0, "text": "Great store!  Anything and everything you could ever want for shooting.  People are great and know what they are doing!  Highly recommend this store.  You won't be disappointed.", "pics": null, "resp": {"time": 1564631934764, "text": "We try to please. It's all about customer service."}, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "108073278894094514513", "name": "Joshua Mitchell", "time": 1513091551775, "rating": 5.0, "text": "Very knowledgeable and helpful guys. At first look it may seem they don't have as many guns as a place like Academy but they actually have way cooler and more quality stuff. Plus they actually know their guns. Tom helped me find a perfect concealed carry weapon as I wasn't very familiar with the different types of handguns. They have a lot of cool surplus gear too. They are a very experienced crew who can also make a new customer feel comfortable so I would recommend this shop to new shooters or professional ones the same.", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "114614299712948496014", "name": "Herman Daniel", "time": 1587605736318, "rating": 5.0, "text": "They have almost anything that you can find online but you are standing there talking to a real person. They are awesome and the only thing that I am sorry for is the fact that I had not found them sooner. Found my go to  tactical shop. Glad I found yall!!", "pics": null, "resp": {"time": 1587654511702, "text": "Thanks for finding us. We try hard to give great customer service. Thank for your business."}, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "103218374166278954563", "name": "agbond003", "time": 1464285216103, "rating": 5.0, "text": "Overall, my experience at Southern Survival Store has been absolutely positive.\nThe Products they carry are of great quality and prices are more then reasonable. The customer service is top notch and I always feel welcome to approach them. When I ask a question or ask for an opinion on certain items, the staff will answer in a fashion that illustrates both honesty and integrity. When you have an interest in a particular item, the staff will not give you a few sale's pitch lines; instead they will tell you their actuall experience with the product. Knowing that these guys really use what they sale brings confidence in my purchases. Long story short, this is the best example of an army surplus store in every category that can be graded.\nI highly encourage anyone one with outdoors, survival, or defense needs to check this place out.", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "100993980818099815845", "name": "Brian Mccall", "time": 1570673178398, "rating": 4.0, "text": "I was greeted as soon as I walked in the door, really nice staff. I was under the impression I was walking into a oldschool millitary surplus somthing like heart of dixie was so i must say i left a little disapointed but i will be back for hunting ammo for m1\nI notice it was almost half price of what i paid last time", "pics": null, "resp": {"time": 1570724301056, "text": "Brian, thanks for coming into our store. We used to have lots of surplus but as you saw we are selling out of that business. We now focus on Tactical Guns and Training. Thank you for your review. Don"}, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "112715800980453130933", "name": "Leon Stark", "time": 1492123106743, "rating": 5.0, "text": "They don't treat you like an idiot for asking what something is or about firearms. That alone makes them better than most places I decided not to do business with. Very good selection of products.", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "112654725991574923182", "name": "Nguyen Huy", "time": 1504138141590, "rating": 5.0, "text": "This place is amazing. The staffs are so friendly and they are ready to help you when need. Their price are reasonable and worth it.", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "104836423185618051576", "name": "Nicholas Molinari", "time": 1458512928648, "rating": 5.0, "text": "Great trip out there. I spoke with the owner Don and he was very kind and honest. The prices are great and the store very organized.", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "107283470282825060744", "name": "Demetrios", "time": 1564022010019, "rating": 5.0, "text": "This place is a build a gun Masterpiece.  Love this place.", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "113302232812233103769", "name": "Melanie Lankford", "time": 1513723768566, "rating": 5.0, "text": "This store has top quality equipment, trainers and gun experts. The classes they offer are very impressive survival and preparedness skills in a realistic atmosphere for a variety of situations.", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "114984773301672558090", "name": "Sherry Kilgore", "time": 1564661468602, "rating": 5.0, "text": "Great customer service before and after the sale!", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "107276760296871815254", "name": "Robert Bennett", "time": 1461874949703, "rating": 5.0, "text": "They make feel welcomed and ready to help.\nGreat selection to choose from.", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "100380985408513726797", "name": "Bart Rushing", "time": 1469883160884, "rating": 5.0, "text": "Friendly and knowledgeable staff... Seems to be about everything you could need...", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "115046506707736352231", "name": "John M", "time": 1487547566553, "rating": 5.0, "text": "Wide variety of survival supplies, firearms, & ammunition. Knowledgeable staff.", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "111769571857013359938", "name": "Roy Aaron", "time": 1492868372540, "rating": 5.0, "text": "Best place for all outdoor gear hands down", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "109206010153870487430", "name": "Randy Norred", "time": 1441823248398, "rating": 5.0, "text": "This place is amazing and they are very helpful.", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "100557899186541022141", "name": "michelle cloutier", "time": 1469660238438, "rating": 3.0, "text": "Friendly staff kinda musty inside.", "pics": null, "resp": null, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "107073613417132993075", "name": "Jerred Hall", "time": 1616358388853, "rating": 5.0, "text": "Get-R-done!!!!!!!!!", "pics": null, "resp": {"time": 1616377854557, "text": "Thank you Jerred, we are trying. Don"}, "gmap_id": "0x888c94a0e06a209d:0x9745d7d38e9b7cc"}
{"user_id": "105762787131711383670", "name": "Mike McGrunt1994", "time": 1600468788235, "rating": 5.0, "text": "Blaze Defense Systems is amazing. I placed my order less than a week ago, and I already have my top quality, made in the USA gear for my vest.\nThey came highly recommended from guys on our SWAT team, and now I know why.  Thank you for your outstanding quality and service!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPVTvLNs2AQyM2B9CPlTYxtIlaw8SY9W5xAbovA=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88892410f9b2f365:0xf43c56d2894dd8bc"}
{"user_id": "116109440194621234970", "name": "val/John Longo’s", "time": 1597831504201, "rating": 5.0, "text": "This is one heck of a company my first two orders breech pen and tactical fire extinguisher when I got the order I checked it there was a match for the pen missing they sent me two in a couple days. This place is awesome they know what there people need will be ordering soon. Stay safe y’all", "pics": null, "resp": null, "gmap_id": "0x88892410f9b2f365:0xf43c56d2894dd8bc"}
{"user_id": "113061876916424229164", "name": "Lawrence Pugliese", "time": 1548459109777, "rating": 5.0, "text": "Awesome people here, customer service and products are top notch.", "pics": null, "resp": null, "gmap_id": "0x88892410f9b2f365:0xf43c56d2894dd8bc"}
{"user_id": "107783484300594982481", "name": "Austin", "time": 1579130334778, "rating": 5.0, "text": "Nice people! Thanks", "pics": null, "resp": null, "gmap_id": "0x88892410f9b2f365:0xf43c56d2894dd8bc"}
{"user_id": "105482756761817422819", "name": "Robert Mashburn", "time": 1545324320990, "rating": 5.0, "text": "Excellent customer service and quality work! Highly recommend", "pics": null, "resp": null, "gmap_id": "0x888979b92bc02927:0x4a16ddf34bbc9923"}
{"user_id": "107366996616720336874", "name": "Robert Cantley", "time": 1528564079629, "rating": 5.0, "text": "Not just an upfitter. They have current and former LEOs so they have experience using the equipment and can suggest the right equipment for the application. The shop is well set up, organized (meticulously clean), and in an area where your vehicle is safe while being serviced or upfitted. Excellent service after the sale and they care about the customer. I would definitely recommend them.", "pics": null, "resp": null, "gmap_id": "0x888979b92bc02927:0x4a16ddf34bbc9923"}
{"user_id": "113830714027386679317", "name": "Pam Everidge", "time": 1563445423923, "rating": 5.0, "text": "Wonderful customer service ,great product", "pics": null, "resp": null, "gmap_id": "0x888979b92bc02927:0x4a16ddf34bbc9923"}
{"user_id": "109217563221244814332", "name": "Paul Becker", "time": 1548008432393, "rating": 5.0, "text": "Best vehicle up fitter and graphics in the area", "pics": null, "resp": null, "gmap_id": "0x888979b92bc02927:0x4a16ddf34bbc9923"}
{"user_id": "116180907794297326974", "name": "Tony Glass", "time": 1508951007535, "rating": 5.0, "text": "Wonderful people to deal with fair pricing will bend over backwards to satisfy the customer great guys", "pics": null, "resp": null, "gmap_id": "0x888979b92bc02927:0x4a16ddf34bbc9923"}
{"user_id": "103990461370590982565", "name": "Lee Reese", "time": 1541425847731, "rating": 5.0, "text": "These guys do a great job on everything I need. No job is too small and they are very professional.", "pics": null, "resp": null, "gmap_id": "0x888979b92bc02927:0x4a16ddf34bbc9923"}
{"user_id": "103299223737308141582", "name": "Jacob Pearce", "time": 1606363298629, "rating": 5.0, "text": "I initially had a hard time getting correspondence from them after placing an order but once I did, they went above and beyond to address my concerns. I was impressed by the response from Ashley and definitely plan on using them again in the future.", "pics": null, "resp": {"time": 1606230070894, "text": "Hi Jacob, I apologize for the lack of correspondence regarding your web order. Please reach out to me directly at ashley@uspglobal.com and I will be more than happy to look into your order and get you an update. We appreciate your business and want to ensure your satisfaction!"}, "gmap_id": "0x888e86bee2473eb7:0xcfa7efe294e24cc4"}
{"user_id": "112771630543701700845", "name": "CJ Russo", "time": 1558050637145, "rating": 3.0, "text": "Kind of small and a bit pricey but it’s the only place in town to get most of the stuff you would need for deployment.", "pics": null, "resp": {"time": 1558051390162, "text": "Thank you for your review. We strive to offer the items that you need at an affordable price. We continually evaluate our inventory and pricing, so please be sure to check back with us. If you have any suggestions for additional product please let us know! Hope we can assist you in the future."}, "gmap_id": "0x888e86bee2473eb7:0xcfa7efe294e24cc4"}
{"user_id": "106833792344166671229", "name": "MaddMatt !", "time": 1543520350937, "rating": 5.0, "text": "Amazing company, amazing service, amazing people. I worked with Patrick and he was able to get me all the answers I needed to place the proper order. Its not normal for people to go the extra mile nowadays but the folks at Fleetsafety do!! Will be buying more stuff!!", "pics": null, "resp": null, "gmap_id": "0x88897d7e323b2301:0x6fe009843599d220"}
{"user_id": "107622694254969878810", "name": "IntuitSolutions Company", "time": 1323114523870, "rating": 5.0, "text": "We were scrambling to find a good deal on fire retardant gloves for our fire college.  Fleet Safety was the best!  Thanks for all of your help, guys!  We'll be sure to go to them for any equipment we need!", "pics": null, "resp": null, "gmap_id": "0x88897d7e323b2301:0x6fe009843599d220"}
{"user_id": "109760760829844338137", "name": "Chris Grace", "time": 1395116354748, "rating": 5.0, "text": "Very professional,competent and knowledgeable. Nate really goes out of his way to make sure we receive the utmost in customer service. My cars will not go anywhere else!", "pics": null, "resp": null, "gmap_id": "0x88897d7e323b2301:0x6fe009843599d220"}
{"user_id": "105616877333016717317", "name": "J-Paul Villagomez (Kahuna_671)", "time": 1544645177988, "rating": 5.0, "text": "If you're looking for light-bars and emergency lights as well as installation this is the place you want to be", "pics": null, "resp": null, "gmap_id": "0x88897d7e323b2301:0x6fe009843599d220"}
{"user_id": "108191505809021863012", "name": "Carlos M. Fernandez", "time": 1623449410463, "rating": 5.0, "text": "UPDATE 6-11-21 This business is truly worthy of a ten (10) Star rating! Once again they have come through in a professional, technically competent, and competitively priced manner. I had the barrel of my 20 gauge shotgun cut down to the regulatory length for home defense (18.5\") and it came out perfect. The weapon looks like it just came out of the box! Truly a professional and talented job by the resident gun smith's! Thank you to all. Your results may vary.\n\nBREAK\n\nShould be in the 10+ Star club! I was extremely impressed with my first interaction with your staff. Erin (Counter Lady) and Gerald (Gunsmith) pulled it together in a timely manner installing a P365 Safety Conversion Kit on my weapon. The work was done in minimal time resulting in me feeling much safer with 12+1 configuration. Customer service was without par, quality of the work was perfect and the pricing was very competitive. Wishing you guys the best in biz. Stay safe, be alert. Best. CMF sends...", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "100769589719365023254", "name": "Chris Knight", "time": 1621818125040, "rating": 5.0, "text": "I stopped in today to test fire a new mossberg 88 I picked up. Had a hard time finding ammo before I arrived, but they happened to have a couple boxes of ammo i could use.\n\nThe staff is friendly, courteous, and very informative. They take the time to explain what it takes to fire at the range with ease, and have a cushy waiting area to view a quick training video. The whole process was smooth and easy.\n\nThe range safety officers are well on their game. I felt safe the entire time on the range, and they were able to quickly explain the touch screen track interface, and further explaining that safety is a top priority.\n\nI signed on for 30 minutes, and decided to fire my .40 before testing the shotgun. The touch screen interface has me sold on coming back to bullet and barrel. With just a click, the target goes the exact distance. Takes all the guesswork out of the experience.\n\nI fired my pistol, and was pleased with the range itself. The design is new and clean. And with the RSOs keeping an eye on everything, it's a great environment to enjoy your firearms.\n\nI tried the 88, and it performed beautifully. I added some extra cushion due to a shoulder injury. For those that would ask, you can't shoot bird shot here. But you can fire buck shot and slugs. But I'll tell you, it's fun firing a shotgun at this range.\n\nAfterward I wandered around and struck up conversations with some of the staff, and showed me a selection for sale. I was impressed with the inventory, as well as pricing. I see myself buying my next firearm from here.\n\nFor me, it's a bit of a drive from Madison. But good business is where you find it, and Bullet and Barrel is my newest one stop shop for all things firearms. Plus, open on Sunday!\n\nDont take my word for it, stop in and check them out today! I'll be back soon, keep up the good work guys.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOvuz95o_d6-D6-jouQmBd1MO6aeWVF21SXCr48=w150-h150-k-no-p"]}], "resp": {"time": 1621814100195, "text": "Thank you for coming down! Please come back soon and....May the force be with you ;)"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "105860791059418933903", "name": "Karen Smith", "time": 1621466501646, "rating": 5.0, "text": "State of the art range! The employees are always friendly and helpful - from the sales team to the RSOs! Everyone is very professional and committed to ensuring the safety of everyone who walks through the doors. I would absolutely recommend this place to any of my friends or family without hesitation!", "pics": null, "resp": {"time": 1621467285522, "text": "Thank you so much! Please come back soon!"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "105590913039818165206", "name": "JonPaul Wise", "time": 1614614054310, "rating": 5.0, "text": "I recently moved to Huntsville and wanted to find a new class 3 place to call my \"local shop\". This place is a perfect example of how to do things right, treated me like I was a long time customer right from the start and after just a few visits I feel like I've been coming here for years. Very veteran friendly and the facility is far beyond just a gun shop. I've lived in 8 cities over 5 states in the past 10 years and this place is on the top without a doubt!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "107829370627486097339", "name": "Justin W (JdogAwesome)", "time": 1572148367485, "rating": 5.0, "text": "Extremely well maintained and high quality range! The firearm rentals where great and the guns where in pristine condition! The range officers where super nice and helped us a ton as it was my first time using a pistol. Can't recommend this place enough!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMDlyDfxXpPyzsXqCRSa0kV6DEUR1WPKZLKpMIO=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOrLZ6vFpaPFT2Pzw-iNZIaHq5Mg26oG-mH4aRy=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "110771848172386740724", "name": "Adrian Farrales", "time": 1608333886826, "rating": 5.0, "text": "Bullet and Barrel is a great place! They have a wide selection of firearms and a very nice indoor range, but what I like most about this place is that they offer excellent classes relating to firearms. Jeff is one of the staff members there and he is a great teacher. The folks working at Bullet and Barrel are experts and they'll make sure you get everything right. If you're looking for instructional classes on anything related to firearms, then Bullet and Barrel is definitely the place!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "110386124523052422004", "name": "Lynn Watts", "time": 1616244148179, "rating": 5.0, "text": "Took the handgun cleaning class with Jeff.  It was very informative.  I learned how to disassemble, clean and reassemble a firearm.  The tip about the grease was especially good since I have trouble at times with pulling the slide.  Thanks for the exceptional training.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "117265596001971072007", "name": "David Norg", "time": 1616899491974, "rating": 5.0, "text": "Needed my scope mounted on a new rifle.\nMade the mistake of taking it to another popular local business to get it done. Clearly was not a professional installation.\nGerald with Bullet and Barrel reinstalled the scope and rings on the spot and did it right!\nGreat people and service!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "103561447289124441166", "name": "Carrie Givens", "time": 1611358036525, "rating": 5.0, "text": "I just made the best investment today, my new Wilson combat edcx9l firearm and I love It. Jeff was extremely helpful and the experience was awesome. I just started taking classes, and Jeff made sure I knew everything that I needed to know about the firearm before I left. He was very patient, considerate, and knowledgeable. Thank you Jeff, you’re awesome!\n- C T Davis", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "100683797676367632405", "name": "Marquiz Liner", "time": 1608675278286, "rating": 5.0, "text": "Can’t recommend Bullet and Barrel enough! The staff is very knowledgeable and extremely helpful! The range is clean, well-maintained, and well-managed by the excellent RSOs. Everyone we’ve encountered has been super nice! If you’ve never been, I highly recommend you check them out! They’re awesome!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "116868464070051506322", "name": "Telia Norg", "time": 1616879069127, "rating": 5.0, "text": "Just had a scope remounted correctly.  Took to another gun shop and they apparently had no idea what they were doing. As soon as we showed the clerk the firearm he immediately knew what was wrong. This is our place from now on.  Thanks", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "107087569882439689247", "name": "Hilary Crimmins", "time": 1610233838344, "rating": 1.0, "text": "Nice clean and well ventilated facility.\nBut honestly it is overpriced, and has extremely long waits. Members get preference and can be observed jumping the line before non-members for range access. I've even had a staff member tell me that they only had 4 boxes of ammo left and would only sell to members.\nToday we, two of us for one lane, arrived at 2:15pm and paid for 30 minutes on the range. We waited well over 2 hours and did not get our full 30 minutes because they were closing. It's not worth it.", "pics": null, "resp": {"time": 1610234764887, "text": "We totally understand the frustration. We were extremely busy today as I'm sure you saw! With everything going on in the firearm industry we are trying to do everything we can. But we do have members who pay a monthly fee and part of that benefit is jumping the line. Kind of like Disney! We would love for you to give us another opportunity. Please reach out to me, Louis, at 256-384-4867 and we will make sure you have a 5 star experience"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "104579732206294547798", "name": "Joyce Maxwell", "time": 1605533390164, "rating": 5.0, "text": "Had a wonderful experience Saturday with my daughter's. Took a class with Tommy, can't say enough about his wonderful teaching skills. We were nervous but with Tommy's great personality it wasn't long till we were calm and enjoying ourselves. Thank you so very much. We'll definitely be back!!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "113159052817495728647", "name": "Andrew Emmerton", "time": 1605922208706, "rating": 5.0, "text": "I took a private lesson with Jeff and he was very knowledgeable, I highly recommend taking a lesson. The rest of the staff were also great and they have a great selection of firearms for sale as well as some to rent for their indoor range.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "116606637947680991772", "name": "Chad Jones", "time": 1608750494221, "rating": 5.0, "text": "Louis and the crew at bullet and Barrel are first rate and so is their facility.  I've had some minor gunsmithing done as well, mainly to check suppressor alignment and get a few breaks lockset on, service has been fast and very affordable.  I've had a few problematic firearms inspected as well and John, their gunsmith, has always been straight forward and accurate.  Of the range facilities in the area, BnB stands head and shoulders above the rest.  I have range passes to go to other ranges for free, but I would rather spend some money at BnB to be with a better crowd and make sure their level of commitment to the average gun owner is rewarded.  When it comes to stores that are in your corner as a gun owner, these guys are bar none best of the best in our area.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "108753319473049978968", "name": "pauline bracken", "time": 1595624122120, "rating": 5.0, "text": "Sarah did a fantastic job teaching me how to firearm! I actually would give her 10 ⭐️ Since I haven’t in years!! I probably will take another class before I actually buy a pistol! Thank you again for your patience and spending over 2 hours with me! I had a wonderful time!!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "111412710532941403652", "name": "Catherine Stower", "time": 1597345578493, "rating": 5.0, "text": "Sarah was a wonderful instructor!  Her patience went above and beyond what I would have expected from an instructor, and her knowledge is tremendous.  In addition, she is continuing to work with me to help me figure out the best firearm for personal use.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "115165443956734656168", "name": "Steven Gaffin", "time": 1593188132496, "rating": 5.0, "text": "I went because I was having the hardest time removing the retaining pin from the firing pin of my Remington 870. So I took the bolt down to Bullet and Barrel. Front Desk (not really front more like back left corner) staff was very welcoming and friendly. The gunsmith was able to remove the pin and lathe down a manufacturing defect in it that was keeping it in the bolt.\nI was very satisfied and impressed with Bullet and Barrel and will definitely return for the many other services they offer.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "116606637947680991772", "name": "Chad Jones", "time": 1608750494221, "rating": 5.0, "text": "Louis and the crew at bullet and Barrel are first rate and so is their facility.  I've had some minor gunsmithing done as well, mainly to check suppressor alignment and get a few breaks lockset on, service has been fast and very affordable.  I've had a few problematic firearms inspected as well and John, their gunsmith, has always been straight forward and accurate.  Of the range facilities in the area, BnB stands head and shoulders above the rest.  I have range passes to go to other ranges for free, but I would rather spend some money at BnB to be with a better crowd and make sure their level of commitment to the average gun owner is rewarded.  When it comes to stores that are in your corner as a gun owner, these guys are bar none best of the best in our area.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "108753319473049978968", "name": "pauline bracken", "time": 1595624122120, "rating": 5.0, "text": "Sarah did a fantastic job teaching me how to firearm! I actually would give her 10 ⭐️ Since I haven’t in years!! I probably will take another class before I actually buy a pistol! Thank you again for your patience and spending over 2 hours with me! I had a wonderful time!!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "115165443956734656168", "name": "Steven Gaffin", "time": 1593188132496, "rating": 5.0, "text": "I went because I was having the hardest time removing the retaining pin from the firing pin of my Remington 870. So I took the bolt down to Bullet and Barrel. Front Desk (not really front more like back left corner) staff was very welcoming and friendly. The gunsmith was able to remove the pin and lathe down a manufacturing defect in it that was keeping it in the bolt.\nI was very satisfied and impressed with Bullet and Barrel and will definitely return for the many other services they offer.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "111412710532941403652", "name": "Catherine Stower", "time": 1597345578493, "rating": 5.0, "text": "Sarah was a wonderful instructor!  Her patience went above and beyond what I would have expected from an instructor, and her knowledge is tremendous.  In addition, she is continuing to work with me to help me figure out the best firearm for personal use.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "106958615455349640396", "name": "MaryAnn Green", "time": 1595662212612, "rating": 5.0, "text": "Took a beginner's gun safety class.  Sarah was my instructor and was extremely knowlegeable.  She answered all my questions and gave me good advise on how to properly handle a fire arm.  She provided helpful hints on the firing range.  I plan on meeting with her again for more instruction.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "108678911012212882076", "name": "Steve S", "time": 1592359008165, "rating": 5.0, "text": "Excellent instruction and advice from Jeff White! He is extremely knowledgeable and taught me a ton of tips to correct my technique. Thank you so much! It's just a great facility. Clean, professional, helpful.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "114560596622958917468", "name": "Ethan Brewer", "time": 1597445293885, "rating": 5.0, "text": "Alberto is the man. Great customer service. We talked about many different guns. He knew the product, and I could tell he was genuinely trying to help me.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "118391526411006229340", "name": "Eugene Mayo", "time": 1581772020215, "rating": 5.0, "text": "My first visit to Bullet & Barrel was a very pleasant experience. I expected the normal indoor gun range with no frills and a lack of management personnel for the amount of customers. Not at Bullet & Barrel! You enter the establishment and find yourself in a first class gun store with very tastefully displayed products. When you check in to the range most of the paper work is done electronically and there are plenty of well trained staff on hand to help you, not only at check in but on the range also. Defiantly not a Mom & Pops business. Top notch!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "109063956324002300964", "name": "J Cowan", "time": 1593199430181, "rating": 5.0, "text": "Great place for learning how to shoot or just for practice. My husband and I visited and enjoyed it. Truly learned at lot from our instructor Sarah. She was very knowledgeable and very patient. We learned so much. She walked through every detail with us together and separately, as we each own two different guns. Highly recommend! Thank you Sarah!! We will be back.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "100133391775176345084", "name": "Dorothy Loftin", "time": 1574159741642, "rating": 5.0, "text": "Thank you Tim for a great lesson on learning to get comfortable with a gun! I was with my sister and friend, both of whom had experience with guns.  Tim tailored the class for all 3 of us with varying abilities.  I had never touched a gun and was shooting with multiple guns by the end of the session.  The best part of it all is now I’m comfortable with the gun we have in our home.  Thanks again Tim!  We will definitely be back for more lessons!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "118358975380986036935", "name": "Randy Chavez", "time": 1602194615105, "rating": 5.0, "text": "Went in the is morning for the first time to sight in my hunting rifles. WOW!  Got hooked up with George and he did it all. Helped me sight in four rifles is one hour, explained everything he was adjusting and just made the experience unbelievable. Couldn't have asked for anything more. Thanks George!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "116572371350412508177", "name": "Emilee Taritero", "time": 1591582714575, "rating": 5.0, "text": "My twins took the Youth Marksmanship Class  with Sarah as part of their 13th bday weekend. She was amazing! She was so patient with the group of kids. She explained everything very well and made sure the class understood all the points of gun safety and operation which allowed them to have an amazing time once they got the hands on experience on the range. My twins DID NOT want to leave.  We will definitely be back!", "pics": null, "resp": {"time": 1591656147147, "text": "Thank you do much!!! Sarah is a great instructor! Please come visit us again soon!"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "111271810573390878118", "name": "vivaswanth c", "time": 1568135892378, "rating": 5.0, "text": "Great range. Courteous people and very encouraging trainers.\nModern equipment and look. Highly recommend!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMyR6ROAdKi2X5TpiB72VhtnB1uGTqAuMAxmpTM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN86bGQj2aQsjpkoMZaFjlurUool5SQozkFD-Fd=w150-h150-k-no-p"]}], "resp": {"time": 1568137186635, "text": "Thank you for the kind words! Please come back and visit soon :)"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "105728822323416055853", "name": "Nelly Belly", "time": 1558874620802, "rating": 5.0, "text": "Best range in Huntsville.... and it’s not even close. I became a member when they were still building it because I knew it would be a great place and they have exceeded my expectations. The ranges are well lit and spotless. The thickness of the barriers between the ranges was a major selling point to me. I feel safe and secure when I am on my lane. The range masters are helpful and add another layer of protection for the customers/ members that are throwing lead at a target. I strongly suggest you give Bullet and Barrel a shot (pun intended) if you are looking for a place to shoot. Beware, this place can become addictive.", "pics": null, "resp": {"time": 1558881232991, "text": "Thank you for the kind words! We appreciate your continued support"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "102414268234017561216", "name": "diane rigsby", "time": 1595023888840, "rating": 5.0, "text": "A friend and I took the first steps class from instructor Sarah.  Sarah gave great instruction emphasizing safety first.  She was very patient.  I learned A lot and will go back in the future.  Also the facility was very clean.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "116207865826871015356", "name": "Jasmine Tucker", "time": 1560554577222, "rating": 5.0, "text": "If you’ve heard about this place and have not stop by, WHAT ARE YOU WAITING FOR? This place is awesome! It’s clean, and there’s safety videos which made me feel safe and my favorite part was that the staff made me feel comfortable. I encountered Sarah who is so patient and knowledgeable. This was my first time using my new .380 and she encouraged me to practice more with it and not be discouraged. Just when I thought the place couldn’t get any better I even had the same experience as I exited by Pam she’s so sweet she explained to me about how to become a member. This place sells everything too!", "pics": null, "resp": {"time": 1560555262695, "text": "Thank you so much!!! Please come back soon 😃"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "108293537391808136874", "name": "Larry Parker", "time": 1591551886484, "rating": 5.0, "text": "Excellent facility. Great instruction on gun safety and usage from Jeff White. Highly recommend Jeff for a private or group lesson.", "pics": null, "resp": {"time": 1591656262064, "text": "Jeff does an awesome job!!!! Please come visit us again soon!!! And let us know if we can help you further"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "110574924617358983360", "name": "Ivica Ristovski", "time": 1587601671836, "rating": 5.0, "text": "This is a very good place. Staff is super nice. Clean building, very nice shooting range. I would say best in town. Perfect for pistol shooting.", "pics": null, "resp": {"time": 1591656325335, "text": "Thank you!! All of lanes are also rifle rated as well!"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "105971127545111666382", "name": "Clint Beavers", "time": 1591917294765, "rating": 5.0, "text": "The staff is very knowledgeable and friendly. Sarah answered all my questions, demonstrated gun safety, and made my first time experience an enjoyable one.", "pics": null, "resp": {"time": 1591921224228, "text": "Thank you for the kind words!!! Sarah is a great part of the team! Please come see us again soon"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "116644672468733693372", "name": "Zachary Talley", "time": 1574911954300, "rating": 5.0, "text": "This is the best gun shop in Alabama. Fastest and most professional service. I dropped my gun off with new scope John amd Alberto had all the necessary mounting hardware in stock.  1 hour they mounted ,bore sighted and zeroed in at there 100 yard range. EXCELLENT SERVICE and very well trained gun smith and employees.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "116291605423341650990", "name": "FryingPan", "time": 1565375236426, "rating": 5.0, "text": "Got a membership to this place and its worth every penny. Excellent range officers and all very professional. The ranges themselves are very clean and ventilated. There is ample space for any weapons you want to bring. They have a huge selection of weapons to rent (free with membership) which was one of the big selling points of the membership for me. Once you shoot here you won't go anywhere else again.", "pics": null, "resp": {"time": 1565377333532, "text": "Thank so much! We appreciate you joining the family!"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "103434953636452611588", "name": "braxton guthrie", "time": 1591989101486, "rating": 5.0, "text": "Extremely respectful over the phone was very refreshing, normally because of my age (21) I'm in between being treated as an adult and an adult.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "109763709233762642653", "name": "david schachle", "time": 1590858780273, "rating": 5.0, "text": "If you are looking to learn how to shoot, I highly reccomend Jeff. He is very nice and profesional. They have a clean range and store. Very fun experience.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "104230763638810113614", "name": "Bryson Hill", "time": 1574896334045, "rating": 5.0, "text": "After going to three other places in Huntsville and the big box store across from Bridge street that has the street named after them along with there sales add and waiting in line for hour two find out that they did not have one or ever had one.\nFor now on Bullet and Barrel has my business best prices in town Thomas was my sales person he was a great help . Everyone was very nice I encourage anyone that is in the market for firearm visit Bullet and Barrel", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "114657207870938196902", "name": "donald reimer", "time": 1590874698341, "rating": 5.0, "text": "Very clean, safe and very nice range people are very helpful and friendly no attitude will definitely return when back in town", "pics": null, "resp": {"time": 1591656282169, "text": "Come back and see us! Travel safe"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "106343797249030979973", "name": "Charles Pruitt", "time": 1579522040394, "rating": 5.0, "text": "The staff is friendly and knowledgeable, and the gun range is awesome. Whether you're a beginner or a pro, if you're looking for a place to shoot, try them out. They've definitely earned my business.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "101946007405696258910", "name": "Galvin Freeman", "time": 1558740390867, "rating": 5.0, "text": "First visit here to shoot and I was very, very impressed with the entire staff from start to finish! This place has that it factor and has lots of potential to become a gem here in Huntsville! The indoor range takes it to another level. Definitely recommend checking this place out! You won't be disappointed! I enjoyed my visit and will be back.", "pics": null, "resp": {"time": 1558881195682, "text": "Please come back soon!"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "104809396136423875469", "name": "J B", "time": 1578778773597, "rating": 1.0, "text": "First, I must say that the range facilities are quite nice with helpful staff. The range facilities are up to date, very comfortable and the RSOs are very professional.\n\nHowever, I made the mistake of using the gunsmith services. This has not gone well. This particular saga has been going on since the end of November. I always had to call or email them to get any status and the answer was always the same...it will be ready Saturday, it will be ready next week, it will be ready \"sometime next week\". I do not believe that they have devoted any significant time to my project. The first time I checked in with them after a week, that is when they informed me I needed to bring in other components. They never reached out to me. Very frustrating. Now that it is in Jan I have given up working with them and I am now taking the project somewhere else.\n\nI get the feeling that they want to work on things when they feel like it, have no obligation to provide status or time estimate to the customer. Furthermore, I do not believe that they have fulltime gunsmiths which feels a little misleading from the website.\n\nSo if any readers know a professional, hardworking gunsmith in the area I am certainly looking!", "pics": null, "resp": {"time": 1591656700106, "text": "Hey JB! we're so sorry this was your experience. Normally our Gunsmiths can offer quick turn around times. Some thing may change that with parts availability and waiting on other parts we need from our customers. I am sorry we were back logged at the time and when we received your receiver in late December we began to diagnose the problem. But again that's no excuse for a lack of communication. Please let us know if we can be of further assistance"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "113576949989515699496", "name": "Andre Harris II", "time": 1585429501688, "rating": 5.0, "text": "Went to buy a light for my handgun and I received quick and friendly service. I was also lucky enough to receive a small discount while I was there.\nClean and an open environment also", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "108816635150288248569", "name": "Ethan Owens", "time": 1558740549520, "rating": 5.0, "text": "A truly epic indoor shooting range. Truly the best in Alabama. Seriously. Plus I don’t have to worry about lead poisoning or negligent discharges by employees. They’re prices are really decent as well. Not the cheapest but well worth the price because of the great value they represent.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "103451963558862652488", "name": "Sara Bozeman", "time": 1580511041825, "rating": 5.0, "text": "Jerrell, the gunsmith, literally saved my weekend. I went in on a Friday needing to sight in a new rifle before going hunting for the weekend. My mounts were machines improperly and couldn’t hold a zero. Jerrell skipped his lunch to fix my mounts, and did an amazing job. The rest of the staff was very helpful, kind, and generous with advice. I love how clean and fresh the facilities are as well. Not many gun ranges are so well kept! I’ll be going back, and definitely using Jerrell for any work I need done on a gun.", "pics": null, "resp": {"time": 1580517107049, "text": "We love our gunsmiths!!! Please come back and see ya soon!  😀"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "100547152685670753677", "name": "Kenyon Stone", "time": 1563320910192, "rating": 5.0, "text": "Such a great place! Staff very helpful and friendly. Brought a 12 year old, they had some options for her, and were making sure she enjoyed herself as well. Tim was a great help, felt very welcome", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "102037781289923717364", "name": "Caitlin Thomas", "time": 1597631194156, "rating": 5.0, "text": "Such an enjoyable experience.  Highly recommend Bullet & Barrel", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "106614678154707483995", "name": "Destiny Freeman", "time": 1558314434981, "rating": 5.0, "text": "We had such a great time here! Friendly, knowledgeable, and attentive staff. The range and facilities are very well maintained and clean. Wonderful range and personable people. Win win. Thank you!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "110461008165691452570", "name": "DAN From the SOUTH", "time": 1561317289625, "rating": 5.0, "text": "This is by far my favorite shooting range to use in Huntsville! Very friendly environment and extremely kid friendly. My son always says \"Bullet and Barrel\" when I ask him where he wants to go!! Well done guys!", "pics": null, "resp": {"time": 1561390714672, "text": "Thanks!!!! We like to think we're all a big family 😀😀😀"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "107390012346107880803", "name": "Matt Ray", "time": 1573618184224, "rating": 5.0, "text": "No better place in Huntsville to buy a silencer.  You can even use it in the range while waiting on the government.  Silencer shop kiosk makes the process super simple, and the staff are excellent to work with.", "pics": null, "resp": {"time": 1573670286724, "text": "Thank you so much!"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "104827550966101539236", "name": "Mike K", "time": 1550189378117, "rating": 5.0, "text": "I took Louis up on his offer of a tour of Bullet and Barrel as my previous experience was less than stellar.  The experience this time was quite the opposite of my last visit; even before I met Louis.  I was greeted as soon as I entered the building and was pointed in the right direction to meet Louis.  The tour was thorough, and as suspected the facilities are top notch, and they offered quite a bit more than I expected.  The gun range is state of the art and the RSO's are extremely helpful.  The staff is friendly, professional and quite knowledgeable .  Thank you Louis, and the entire Bullet and Barrel staff for an exceptional experience.  I most definitely will be back.", "pics": null, "resp": {"time": 1548979366048, "text": "Mike, I am so sorry that this is what you experienced with us today. We pride ourselves on giving our customers an awesome experience. As our reviews reflect that this is not our norm. But I'd love to personally invite you back and I'll give you a behind the scenes tour of our facility. Thank you for the feedback and we truly hope we can deliver a 5-star response on you next visit. If you'd like to set this up my personal email is louis@bulletandbarrel.com~ Louis, General Manager"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "103903206891610443238", "name": "Rick Morgan", "time": 1532730611397, "rating": 5.0, "text": "Jason did an excellent job teaching me how to shoot. He caught and corrected all my aiming problems.\nA really great teacher!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMRgjz8BUYXxEwl6X0Smo9A1AvaXsY150NFGatA=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "100405558825939297594", "name": "Thomas Webber", "time": 1575035130290, "rating": 5.0, "text": "I have been to Bullet and Barrel many times. Always a great time and the staff treat you right. Best place in Huntsville!!!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "106267637187803387277", "name": "Danta Simonsen", "time": 1533174684407, "rating": 5.0, "text": "My son and I took a gun safety class and had a great time. The instructors were knowledgeable and made the class fun without loosing the seriousness of what we were there to learn. Tim took extra time to help my son making him feel confident. He was very encouraging no matter how bad my aim was. Excellent service, great facilitie. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "113245599041872880690", "name": "Michael Mauro", "time": 1562616299543, "rating": 5.0, "text": "Hands down, the best Gun Range I've ever visited. I've lived across 5 states and have visited ranges in each one. This one has, by far, exceeded my expectations in all areas. The staff are immensely helpful, friendly and professional. Thank you for your clean facility and expert staff!", "pics": null, "resp": {"time": 1562617489096, "text": "Thank you so much for the kind words!!!! And for bringing us some cool guns to work on~louis"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "118333425931884060775", "name": "Bridgette Bradley", "time": 1525802349268, "rating": 5.0, "text": "We had our corporate event here. The employees were simply wonderful! Everyone was very knowledgeable and cared about each person in attendance. The facility is immaculate! The shooting range itself is the best in Huntsville. Highly recommend Bullet and Barrel!!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "102393979441459658862", "name": "Jacob Boyett", "time": 1563741077206, "rating": 5.0, "text": "Went in as a newbie shooter and within 2 minutes of being in the range Dave stepped up and immediately told me things I could correct and even went so far as to give me some drills to run. I would recommend Dave and B&B to anybody. See you guys next week!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "108820322193839483013", "name": "Barrett Eimer", "time": 1525906827869, "rating": 5.0, "text": "Great range to shoot at with nice lanes and technology; they have a decent selection of quality guns and rifles too. They also sell apparel for men and women.  It comes together as a welcome and unique blend of ideas for a place to shop.  There is a ton of space and it will be cool to see how they intend to make use of it all.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "109025203305171759456", "name": "Weston Hall", "time": 1569251261077, "rating": 5.0, "text": "What a fun professional place! Very clean and the staff was very friendly. They weren’t intimidating and was nice when I asked them questions.", "pics": null, "resp": {"time": 1569252581260, "text": "Thank you so much! Please visit us again soon!!"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "102887651973201008984", "name": "Ira Merritt", "time": 1574448818035, "rating": 5.0, "text": "I have used the range at B&B  a number of times and the staff is always friendly, helpful, knowledgeable and safety conscious. I also recently did a trade and had gun smithing done on an AR. My interactions have all been very satisfactory. John, the gunsmith, and others went far out of their way to resolve a non-standard hardware problem in a way that I greatly appreciated. Great staff and operation.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "110357112194904816846", "name": "Jay Graham", "time": 1535079128730, "rating": 5.0, "text": "My wife and I shot guns for the first time. We had an excellent experience. We took a personal class from Colt, a fantastic instructor! He is very knowledgeable, explains things clearly, and kept us feeling confident throughout the entire process. We're already looking forward to our next visit.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "100806952164329730825", "name": "Miki Heaton", "time": 1527632572973, "rating": 4.0, "text": "First time to visit this range, very nice facility and clean well maintained range. I would have given it 5 stars if not for two things. When we walked in the door two employees behind the counter were on their cell phones and didn’t look up until we spoke. Then when we walked on the range the range officer was also on his phone. In each case neither were talking only looking at the screen.  I personally have a problem with employees being on their phones at work but on a firing range just seems like a really bad idea.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "100342808309986601209", "name": "Will Booker", "time": 1601499206445, "rating": 1.0, "text": "I drove all the way across town to get there still in line for 5-10 minutes they let two people in front of me go on to the range and then told me that they just took the last person on the range and turned me away. It wasn't covered related because they weren't busy. I won't be going back thanks for nothing", "pics": null, "resp": {"time": 1601498220549, "text": "Thank for leaving this feedback! As you can see typically the strong majority of our guests have 5 star experiences. Talking this over with our team we looked back at your trip. We do have a pretty firm rule on not allowing shooters on the range 30 minutes before we close. The folks who went ahead of you are some of our members and one of their perks is lane priority. We would absolutely love for you to give us another chance and I would like to invite you back as my guest and comp you your range time. ~Louis S."}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "108600997079562543514", "name": "Matt White", "time": 1563936713669, "rating": 5.0, "text": "I am so happy with the experience I had shopping for my gun parts and my new purchase of the noveske space invader! They have answered every question that I have had. I usually give a name to ask for but theres no need in this best gun/shooting range in north alabama! Everyone is very knowledgeable. This place is amazing!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "107642431437483050675", "name": "Matt Hamblin", "time": 1561389897751, "rating": 5.0, "text": "Great staff and an amazing range. Oozes professionalism and safety. Highly recommended!", "pics": null, "resp": {"time": 1561390688298, "text": "Thank you so much! Come visit us again soon"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "105776846650904642011", "name": "Ariel Eisenstadt", "time": 1566439900442, "rating": 5.0, "text": "Lots of fun, friendly staff very helpful. Terrific selection of rental firearms very fair pricing", "pics": null, "resp": {"time": 1566442213205, "text": "Thank you so much for the kind words! Please come visit us again soon and if there is anything we can do please let us know~Louis"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "112326583337221270939", "name": "Pat Shores", "time": 1534036843316, "rating": 5.0, "text": "Great place to shoot!  Awesome service and staff especially the range officers.  They were both friendly and helpful all while being professional.  This was my first trip but it sure won’t be my last!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "115529393377274868126", "name": "Seth Webb", "time": 1526070121908, "rating": 5.0, "text": "These is the best range in North AL. The range is well lit, climate controlled, and each lane is very spacious. But the best part are the people who work here. I cannot give enough praise for my favorite place in Huntsville.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "104096609437544748955", "name": "Ron Volinski", "time": 1526501956453, "rating": 5.0, "text": "First time at a gun range. The staff was very helpful and accommodating.  Very nice place and the people are friendly and attentive.  Jason was really great with helping me with gun control and site alignment.  Great experience!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "114439284211049144142", "name": "Caleb Hollingsworth", "time": 1538696898727, "rating": 5.0, "text": "Never thought I would go to an indoor range again after a poor experience at Larry's range. The range here is nice and well lighted! Love it!", "pics": null, "resp": {"time": 1545166371276, "text": "Thank you! Come visit during the holidays!"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "112355749499904037575", "name": "tim watson", "time": 1545519504534, "rating": 5.0, "text": "Nice and friendly staff. Clean and well run. Will definitely go there again.", "pics": null, "resp": {"time": 1545520900312, "text": "Thank you so much!!! Merry Christmas and we look forward to seeing you soon"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "111511835336164488913", "name": "alfred keely", "time": 1538869657969, "rating": 5.0, "text": "The facilities are very nice, clean,  and comfortable. The staff are also very nice, and knowledgeable. It was an outstanding experience. My wife and I will be back.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "109464143699365618625", "name": "Tom Copeland", "time": 1561481305196, "rating": 5.0, "text": "Great place.Great people. Wouldn't think of going anywhere else.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "103218440390554545205", "name": "Wayne Roddy", "time": 1545944295636, "rating": 5.0, "text": "This a real nice place. The staff is very friendly, the decor and range is super clean.", "pics": null, "resp": {"time": 1545945035431, "text": "Thank you so much Wayne!!! Please come back soon"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "114059350885411774905", "name": "Mandi Harbour", "time": 1560721467241, "rating": 1.0, "text": "Me && my husband went today and talked with a guy name Jeff. Let’s just say we WILL NOT be going back. He was rude and his costumer service was trash 🗑 this place won’t last long at all with the prices and the non friendly staff such as Jeff!", "pics": null, "resp": {"time": 1560723746117, "text": "I do apologise that this was your experience! This is so strange to hear because Jeff is one of our most lauded employees. Although we do apologise that we didn't meet your expectations I'd love to discuss your experience. Please call me on Tuesday at 256-384-4867 ~Louis GM"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "115775298099401313508", "name": "Jack Stripling", "time": 1525574831045, "rating": 5.0, "text": "This place is awesome! Loved the rifle range. Great experience. I'll be back!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "114321005151885743844", "name": "Anthony Williams", "time": 1536346579366, "rating": 5.0, "text": "Came in looking for a gun that they had out of stock. One of the workers really helped me  out by looking for the weapon at other stores. Then helped me understand the paper work process. One thing that stuck out to me was friendly customer service and needs of the consumer met.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "116363061391476258604", "name": "Louisa G", "time": 1525571373580, "rating": 5.0, "text": "State of the art facility.  Super friendly and comfortable environment.", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "105291196920222164577", "name": "Paige Burchel", "time": 1527170772276, "rating": 5.0, "text": "Precious ladies items - jackets, tees, hats, scarves, etc...not to be missed!", "pics": null, "resp": {"time": 1545166240120, "text": "Come again! We have a great sale going on!"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "114303609354564449561", "name": "Dean Hammer", "time": 1529639799002, "rating": 5.0, "text": "Very clean place and helpful staff! Will return!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "107677483136872137909", "name": "Dave Rausch", "time": 1532822765536, "rating": 4.0, "text": "Well maintained facility & Staff", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "112604359372434499692", "name": "Jason Denny", "time": 1542731976741, "rating": 2.0, "text": "You range does include a 100 yard range. However, put the fact that it is CLOSED ON MONDAYS on you site!!!  What a waste of time!", "pics": null, "resp": {"time": 1542734472100, "text": "Jason I am so sorry for the inconvenience. We are closed on Mondays so we can keep Bullet and Barrel to our high standard of a clean and safe range. However we do have our hours posted on our Website as well as here on Google and Facebook. But please come in tomorrow and we'll give you a 5 star experience"}, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "111961657292195059673", "name": "DM M (DMM)", "time": 1549498784663, "rating": 5.0, "text": "Amazing!!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "108361401863922310598", "name": "Susan Hoskins", "time": 1563321219157, "rating": 5.0, "text": "Great place to visit!!!!!", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "110062649847321220660", "name": "Charlie Donner", "time": 1539531075735, "rating": 4.0, "text": "Very nice", "pics": null, "resp": null, "gmap_id": "0x88626df1260d9461:0x5d953fe1a8db0303"}
{"user_id": "117347360354055969099", "name": "Wes Phillips", "time": 1611043284885, "rating": 1.0, "text": "Went to this place looking for some uniform gear and possibly a new pair of boots however, the store was empty and a sign in the window saying that it was for rent or lease. Don't bother going here because nobody's at home. since it's been a little while since I had visited that place I'm not sure how long they've been closed up. Covid-19 must have got them. They were kind of a struggling business anyway last time I was in there their stock was almost depleted.", "pics": null, "resp": null, "gmap_id": "0x88626ca3ef951fd1:0xde96c18e5773d091"}
{"user_id": "107296266572904653695", "name": "Josh Davis", "time": 1599687653109, "rating": 1.0, "text": "I wish there was a half a star rating. Our police department used state grant money to buy $600 worth of equipment. Six months after the full payment, we called to find out where our gear was and was told it was on back order. Two more months went by and we call, only to be told they are not sure what's going on with the order. Later that week, we called and were told they had to order the equipment from a different vendor. Now 14 months later, we cannot get anyone to answer to get our money back. Worthless crooks and I would not advise anyone doing business here.", "pics": null, "resp": null, "gmap_id": "0x88626ca3ef951fd1:0xde96c18e5773d091"}
{"user_id": "113363326513093680070", "name": "James Burton", "time": 1596213945610, "rating": 5.0, "text": "Sorry to hear their closing, but I did get great deals on several things!", "pics": null, "resp": null, "gmap_id": "0x88626ca3ef951fd1:0xde96c18e5773d091"}
{"user_id": "111552035113085343222", "name": "Donna Johnson", "time": 1565238923747, "rating": 5.0, "text": "Awesome... The staff and selection are great. Will be purchasing all my uniform needs here from now on.", "pics": null, "resp": null, "gmap_id": "0x88626ca3ef951fd1:0xde96c18e5773d091"}
{"user_id": "108260297179757054718", "name": "Caroline Graham Craig", "time": 1531093535625, "rating": 5.0, "text": "We use Duty Gear for all our work apparel. They even make custom patches! Friendly staff and great prices on monogramming", "pics": null, "resp": null, "gmap_id": "0x88626ca3ef951fd1:0xde96c18e5773d091"}
{"user_id": "116332176422395677435", "name": "tim deen", "time": 1495482653996, "rating": 1.0, "text": "On 4/6/17 I ordered three uniform shirts and was told they would be in in two weeks. After two weeks I call back and was told they were on back order. This went on every week until on 5/19/17, I was told they were in and were on the seamstress' table to have stripes and patches sewn on first thing Monday morning. I arrive Monday afternoon to pick up my shirts, only to be told that they would not be in until the next day. I get a little hot and just told the cashier to refund my money and I'll order from Amazon. When I asked to talk to the manager, the cashier informs me that he was the person who just ran to the back of the store. NO CUSTOMER SERVICE!!!!! I understand that items will be back ordered, but it is an entirely different issue to be lied to and to waste your gas to find out that the management lied to you. I will never set foot in this place again and I will notify my department and every other officer that I know, what a poor quality business that this is. Ordered from Amazon and they will be in on 5/26/17. Should have started there first.", "pics": null, "resp": {"time": 1495550671906, "text": "We certainly regret the miscommunication that occurred yesterday while Mr Deen was here. As he states he was informed late last week that his shirts were here and waiting for our seamstress to apply the patches he had provided. That was indeed the case, but when she came to these shirts, there was some confusion as to which patches were to be applied. As a result, the shirts were not complete when the customer arrived. I have personally spoken with this customer and explained that there was a misunderstanding that resulted in his impression that the shirts were not here and that he had been misled. My offer to him was and is to do whatever I can to make this up to him, including immediately applying these patches at no cost to the shirts he is purchasing online. Understandably, he is quite upset, but my offer will stand and I sincerely hope that given time, he will allow me to rectify this issue and regain his trust as a customer."}, "gmap_id": "0x88626ca3ef951fd1:0xde96c18e5773d091"}
{"user_id": "108132131279029241660", "name": "Justin Craig", "time": 1505661637491, "rating": 5.0, "text": "They are always so friendly and welcoming. We use them mainly to monogram our work shirts and they always turn out great!", "pics": null, "resp": null, "gmap_id": "0x88626ca3ef951fd1:0xde96c18e5773d091"}
{"user_id": "101777770321361684802", "name": "Big John", "time": 1421682396534, "rating": 5.0, "text": "I have always been treated with respect when I went in there. Maybe they did not have exactly what I wanted but I am hard to please and they really try hard. They stop what they are doing to help you. I do wish they were in a better neighborhood but their location is centrally located for the majority of their customers so I cannot really fault them for that. I am not a police officer but I go in to buy stuff for my sons who are with the local VFD and they have a good selection of  the 5.11 and black boots that I wear. They are quick to point out the specials and any type of sales they are having. This kind of thing helps a lot when you don't get reimbursed for your gear.", "pics": null, "resp": null, "gmap_id": "0x88626ca3ef951fd1:0xde96c18e5773d091"}
{"user_id": "108741778249200069338", "name": "Nicole W.", "time": 1509558412034, "rating": 5.0, "text": "Nice staff. Good selection of duty clothing for Leo's, EMS, and fire fighters. Prices are fair.", "pics": null, "resp": null, "gmap_id": "0x88626ca3ef951fd1:0xde96c18e5773d091"}
{"user_id": "104058576312646016369", "name": "kenneth Becker", "time": 1569549311384, "rating": 5.0, "text": "Loved it great place to get uniform", "pics": null, "resp": null, "gmap_id": "0x88626ca3ef951fd1:0xde96c18e5773d091"}
{"user_id": "106486158761783121812", "name": "Devin Hadden", "time": 1490794052518, "rating": 5.0, "text": "Very friendly staff. I love how they speak to everyone as they walk in. Plus it's open to the public.", "pics": null, "resp": null, "gmap_id": "0x88626ca3ef951fd1:0xde96c18e5773d091"}
{"user_id": "107690236973303705195", "name": "Kenneth Provitt", "time": 1525123155752, "rating": 4.0, "text": "Salesperson was very helpful in trying to assist locate the right.", "pics": null, "resp": null, "gmap_id": "0x88626ca3ef951fd1:0xde96c18e5773d091"}
{"user_id": "102791515555049870214", "name": "Bart Butler", "time": 1518130057028, "rating": 5.0, "text": "If your a cop, fireman, and, whatever, they have what you are looking for at reasonable prices!", "pics": null, "resp": null, "gmap_id": "0x88626ca3ef951fd1:0xde96c18e5773d091"}
{"user_id": "109549937861137108503", "name": "Carol Foster", "time": 1575505454913, "rating": 2.0, "text": "Not as good of a selection as I expected.", "pics": null, "resp": null, "gmap_id": "0x88626ca3ef951fd1:0xde96c18e5773d091"}
{"user_id": "112632201222729808935", "name": "Jorsher", "time": 1396287175414, "rating": 5.0, "text": "It's a small place and I wish they had a bigger selection of 5.11 Tactical clothing, but the service was great and prices were great.", "pics": null, "resp": null, "gmap_id": "0x88626ca3ef951fd1:0xde96c18e5773d091"}
{"user_id": "114235080096724657017", "name": "Eddison “Trintobajan” Lucombe", "time": 1488306289025, "rating": 4.0, "text": "Best place in town to get uniform equipment", "pics": null, "resp": null, "gmap_id": "0x88626ca3ef951fd1:0xde96c18e5773d091"}
{"user_id": "100734363435341980587", "name": "glen ponder", "time": 1515462507640, "rating": 2.0, "text": "Friendly staff but limited selection. Pretty much out of luck if you wear any kind of brown or khaki uniforms.", "pics": null, "resp": null, "gmap_id": "0x88626ca3ef951fd1:0xde96c18e5773d091"}
{"user_id": "117352062534076977070", "name": "Scott Hostetter", "time": 1552410017803, "rating": 5.0, "text": "Great staff!", "pics": null, "resp": null, "gmap_id": "0x88626ca3ef951fd1:0xde96c18e5773d091"}
{"user_id": "117352062534076977070", "name": "Scott Hostetter", "time": 1552410017803, "rating": 5.0, "text": "Great staff!", "pics": null, "resp": null, "gmap_id": "0x88626ca3ef951fd1:0xde96c18e5773d091"}
{"user_id": "104289850267512187691", "name": "Whoday 100", "time": 1495527254346, "rating": 2.0, "text": "Not much in store to buy better to shop online.", "pics": null, "resp": null, "gmap_id": "0x88626ca3ef951fd1:0xde96c18e5773d091"}
{"user_id": "117301458361886826514", "name": "James Pettus", "time": 1525858418731, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x88626ca3ef951fd1:0xde96c18e5773d091"}
{"user_id": "110482036352592267122", "name": "Manuel Holstein", "time": 1491143957172, "rating": 2.0, "text": "not so hot", "pics": null, "resp": null, "gmap_id": "0x88626ca3ef951fd1:0xde96c18e5773d091"}
{"user_id": "115590253572384971512", "name": "kim rosario", "time": 1517394016604, "rating": 5.0, "text": "Fast service", "pics": null, "resp": null, "gmap_id": "0x88626ca3ef951fd1:0xde96c18e5773d091"}
{"user_id": "103793864888512136312", "name": "Dusty Nix", "time": 1435420917266, "rating": 3.0, "text": "Expensive", "pics": null, "resp": null, "gmap_id": "0x88626ca3ef951fd1:0xde96c18e5773d091"}
