{"user_id": "108586730893762503800", "name": "Rainy Day", "time": 1516292724257, "rating": 4.0, "text": "Haven't actually been to the department, but I deal with the police on a daily. It's a small town department and they are all pretty nice and know the people in our community. They do their job well, but aren't overly excited about giving out tickets. (Thank u)", "pics": null, "resp": null, "gmap_id": "0x889bce9d93f2e6bf:0x21d6bf4f29846306"}
{"user_id": "103929078396464607263", "name": "Darren Corlett", "time": 1559485769950, "rating": 3.0, "text": "Bayou LeBatre is a speed trap. Got a ticket going 55 in a 55. The officer thought there was a speed limit sign that was 40 mph before a caution light when in fact it wasn’t until 200 yards past the caution light. It’s 55 up to the caution light and that’s where they got me. Needless to say I’ll try and fight it. The officer was super nice and had a great since of humor. Just didn’t know the speed limit right there.", "pics": null, "resp": null, "gmap_id": "0x889bce9d93f2e6bf:0x21d6bf4f29846306"}
{"user_id": "104378528486561627158", "name": "carl mccullers", "time": 1589049427576, "rating": 1.0, "text": "Is it true that you broke up a little league baseball practice?\nIf untrue,  I will remove my rating", "pics": null, "resp": null, "gmap_id": "0x88861cd698bd2b0d:0x1d29046acfc16150"}
{"user_id": "104227888665795296048", "name": "Cindy Wiley", "time": 1562197444881, "rating": 5.0, "text": "Wonderful Police Officers. Thank you, Northport Police. #BackTheBlue #StayStrong #Believe", "pics": null, "resp": null, "gmap_id": "0x88861cd698bd2b0d:0x1d29046acfc16150"}
{"user_id": "103642966784236774564", "name": "Amirali Minsariya", "time": 1490586181786, "rating": 5.0, "text": "Very secure and helpful", "pics": null, "resp": null, "gmap_id": "0x88861cd698bd2b0d:0x1d29046acfc16150"}
{"user_id": "103779401352923264529", "name": "Tommy Swiney", "time": 1499864934970, "rating": 1.0, "text": "Officer inside is very rude and disrespectful to someone asking questions who was robbed.", "pics": null, "resp": null, "gmap_id": "0x88861cd698bd2b0d:0x1d29046acfc16150"}
{"user_id": "108257637444632352534", "name": "D'Atra Montgomery", "time": 1534772130069, "rating": 1.0, "text": "Rude officers and workers at the department.", "pics": null, "resp": null, "gmap_id": "0x88861cd698bd2b0d:0x1d29046acfc16150"}
{"user_id": "103741087369897147434", "name": "Vicki Hager", "time": 1461182918306, "rating": 5.0, "text": "Great policemen", "pics": null, "resp": null, "gmap_id": "0x88861cd698bd2b0d:0x1d29046acfc16150"}
{"user_id": "117523520561947576111", "name": "thomas reed", "time": 1554816792309, "rating": 1.0, "text": "Terrible.", "pics": null, "resp": null, "gmap_id": "0x88861cd698bd2b0d:0x1d29046acfc16150"}
{"user_id": "108279380736909214718", "name": "Brenda Lee Young", "time": 1564177104040, "rating": 5.0, "text": "Everyone I come into contact with was very nice, polite and offered to help in any way possible.", "pics": null, "resp": null, "gmap_id": "0x888e8e4420b641c3:0x2db3828cd3a12e9f"}
{"user_id": "112783753596662460237", "name": "Bryan Roberts", "time": 1547844970178, "rating": 5.0, "text": "They were very gentle when they handcuffed me, and there patrol cars are incredibly roomy. Overall, very professional. I will definitely be getting arrested by them again. 😀", "pics": null, "resp": null, "gmap_id": "0x888e8e4420b641c3:0x2db3828cd3a12e9f"}
{"user_id": "102684924984963033887", "name": "Brady Galloway", "time": 1552115326612, "rating": 5.0, "text": "Great guys! Love when they talk to the school!", "pics": null, "resp": null, "gmap_id": "0x888e8e4420b641c3:0x2db3828cd3a12e9f"}
{"user_id": "101469427156492448252", "name": "Tiffiny Smith", "time": 1470761066194, "rating": 5.0, "text": "You guys will never know how grateful I am to you for helping out my son as he was driving thru on his way to Panama City Beach. Officer Karr you are my hero.  I respect each and every one of you. Thank you from the bottom of my heart!", "pics": null, "resp": null, "gmap_id": "0x888e8e4420b641c3:0x2db3828cd3a12e9f"}
{"user_id": "100244859695966641706", "name": "Dannion Cicero", "time": 1448288887191, "rating": 5.0, "text": "Some of Prattville's Finest", "pics": null, "resp": null, "gmap_id": "0x888e8e4420b641c3:0x2db3828cd3a12e9f"}
{"user_id": "103884374611955668887", "name": "Shawn Bracey", "time": 1583186134474, "rating": 4.0, "text": "I have been dreading this visit to reinstate my DL for a long time and must say, the young lady was very king, professional and helpful. I believe it was Brittney. Because I did part of it on-line I was in and out pretty fast.", "pics": null, "resp": null, "gmap_id": "0x887d48c268230c13:0x1d922c9f6fca799"}
{"user_id": "112694709685235397408", "name": "milan patel", "time": 1578517972705, "rating": 1.0, "text": "These people don't even know the rules they're supposed to enforce. They sure do love wasting everyone's time but God forbid you waste theirs. What a joke", "pics": null, "resp": null, "gmap_id": "0x887d48c268230c13:0x1d922c9f6fca799"}
{"user_id": "108061864301966983115", "name": "Beth Eason", "time": 1516391362950, "rating": 5.0, "text": "Expect wait times late in the day or in peak hours but by my experience: quick and efficient.", "pics": null, "resp": null, "gmap_id": "0x887d48c268230c13:0x1d922c9f6fca799"}
{"user_id": "102482964787474950976", "name": "Tommy Vercetti", "time": 1553895404615, "rating": 1.0, "text": "Jessica Walden - no integrity\n\nJudge dissmissed her ticket and governers office is investigating statementa made by her and her CPL who was suppose to already have cancled the ticket no integrity here in either one", "pics": null, "resp": null, "gmap_id": "0x887d48c268230c13:0x1d922c9f6fca799"}
{"user_id": "101184902286654198542", "name": "Izzy Hickman", "time": 1523582980587, "rating": 4.0, "text": "Friendly staff. Long wait at peak hours but usually quick and efficient.", "pics": null, "resp": null, "gmap_id": "0x887d48c268230c13:0x1d922c9f6fca799"}
{"user_id": "113389088351940925357", "name": "Cory Sauls", "time": 1493813585445, "rating": 3.0, "text": "Long waits sometimes. It's what you would expect from a government building/ dmv", "pics": null, "resp": null, "gmap_id": "0x887d48c268230c13:0x1d922c9f6fca799"}
{"user_id": "102799017408443159159", "name": "Deborah Corum", "time": 1502192771185, "rating": 5.0, "text": "Like it was just what I wanted to know.", "pics": null, "resp": null, "gmap_id": "0x887d48c268230c13:0x1d922c9f6fca799"}
{"user_id": "117833750026913158503", "name": "Stefanie McGregor Patton", "time": 1508870478439, "rating": 1.0, "text": "Have no respect for others time.", "pics": null, "resp": null, "gmap_id": "0x887d48c268230c13:0x1d922c9f6fca799"}
{"user_id": "100228313354583957094", "name": "Brittany Fortson", "time": 1557770159103, "rating": 1.0, "text": "The worst when attempting to find out information about a ticket. Ms. Wanda was helpful, but everyone else was rude. Worst customer service experience, hire more friendly people or fire the hiring department.", "pics": null, "resp": null, "gmap_id": "0x88906701b88e9bd7:0xf5b8bf2c8b076469"}
{"user_id": "112708801854868770075", "name": "John Lance", "time": 1543300689751, "rating": 1.0, "text": "God only knows I hope everybody see what I posted. Just saying I've been treated like I'm the crenton no more when they knew that guy ain't been there but a few days I ain't been out of prison I'm hot year and I come home and this is what I find some dude with a fire in my backyard. And walking in and out of my house like he ran it. Well just so everyone knows I called the law and they helped him more than they did to me officer Powell badge 150 and his employees they all seems that it was cool I reckon I can just go to any house that don't have lights and water and go up in it and say I live here the doors were locked just know you pay taxes you're paying it for the wrong reason you don't get help you get invaded. And it's okay the law loves it it's okay they go to the man it's blind and says you go back to your files eviction more money when I pay my taxes for you to get this whoever off my property. Thanks again, yes the department of corruption. Yes I am sick to my stomach and how I've been treated all the way from home San Jose California. Yes you can Google me at San Jose radiator. Well I guess there is a reason why my mother-in-law wants to play everybody's got their finger in the honey everybody wants something for nothing. Well it's going to end up costing me, why pay taxes when you're treated like nobody. But you have the bomb can come home your property and take it. Yes and just so everybody knows if there's anything wrong with the property besides needs to mow the grass I will charge it towards Flomaton Police Department because of unprofessional and they let that dude just stay there and told me to leave, yeah Donald Trump would be so proud", "pics": null, "resp": null, "gmap_id": "0x88906701b88e9bd7:0xf5b8bf2c8b076469"}
{"user_id": "108024015299647049666", "name": "Blake Shipp", "time": 1490907336223, "rating": 5.0, "text": "Great people who care for there community!", "pics": null, "resp": null, "gmap_id": "0x88906701b88e9bd7:0xf5b8bf2c8b076469"}
{"user_id": "105940403300132962572", "name": "Kia Linzy", "time": 1516721347385, "rating": 1.0, "text": "Can not ever get anyone on the phone", "pics": null, "resp": null, "gmap_id": "0x88906701b88e9bd7:0xf5b8bf2c8b076469"}
{"user_id": "112665275983123022477", "name": "Shalaina Kimmons", "time": 1516811885903, "rating": 1.0, "text": "Corrupt little town cops", "pics": null, "resp": null, "gmap_id": "0x88906701b88e9bd7:0xf5b8bf2c8b076469"}
{"user_id": "116430771961756431280", "name": "McKelvey Woodworks", "time": 1539126132328, "rating": 5.0, "text": "Some time back I called the Helena Police on their non-emergency line because of an incident.  They were prompt to respond and to look into the matter.  I gave them 5 stars because they do a great job keeping us safe in our town.  I also appreciate seeing them direct traffic every morning at the local schools.  Many thanks to the men and women in blue that keep us safe in Helena.", "pics": null, "resp": null, "gmap_id": "0x8889275838c95881:0x381f8be4029ba76d"}
{"user_id": "115293634271916084153", "name": "David Fisk", "time": 1527979600755, "rating": 1.0, "text": "Definitely money making scheme. Got a ticket the other day for \" not yielding right of way\" . Officer paused long enough at the light giving the impression he wanted me to go 1st. I went and he pulled immediately behind me and asked if I knew why he pulled me over. I said I didn't have a clue ... that's when he said failure to yield right of way. I explained what I saw him doing and that it appeared that he wanted me to go first. He said he didn't see it that way. It was definitely entrapment and I told him so. He wrote the ticket and when I drove off I could see him and another officer laughing about it. By the way it was last day of the month... obviously quota time. I've been driving for over 40 years - I certainly know who has the right of way on a green light without an arrow and I also know what baiting and entrapment looks like. They're not all like this, but it's a shame that some of them think that because they wear a uniform and have a badge that you're insignificant and have to bow down or go to jail. No way to win when the officer demands respect and doesn't have a clue that respect is earned.", "pics": null, "resp": null, "gmap_id": "0x8889275838c95881:0x381f8be4029ba76d"}
{"user_id": "102957207690548922390", "name": "Stephanie Young", "time": 1571456591696, "rating": 1.0, "text": "All about writing those tickets and not keeping people safe that live here in Helena! Not to mention rude!!!  Women have no rights here!\nOh yeah...trying to get a copy of a police report one day... made me wait....while a Farmers Insurance lady walking in with over 10 boxes of assorted doughnuts from Publix was buzzed right on in. I was denied a copy of the police report!\nThe trash that started the whole argument and threatened me didn't get Jack done to them. Later on I found out some total BS the cops wrote everybody up for... No Justice!", "pics": null, "resp": null, "gmap_id": "0x8889275838c95881:0x381f8be4029ba76d"}
{"user_id": "107960155749652872954", "name": "Albert McWilliams Sr", "time": 1495723313613, "rating": 1.0, "text": "This Department does not care about the lives of Black people. I have call them several times about my dad being terrorized by his nephew and they will not take a report. They only say that they can not do anything until they catch the nephew on the property. I supposed they will make a report  after someone gets hurt! Maybe.", "pics": null, "resp": null, "gmap_id": "0x8889275838c95881:0x381f8be4029ba76d"}
{"user_id": "106206944244032182085", "name": "SW Productions", "time": 1553987243185, "rating": 1.0, "text": "Often pull people over for minor incidents (sometimes when they did nothing wrong) and ticket them just to make money", "pics": null, "resp": null, "gmap_id": "0x8889275838c95881:0x381f8be4029ba76d"}
{"user_id": "105012049896192749244", "name": "Iler Kitchens", "time": 1559589714817, "rating": 3.0, "text": "Last time they stopped me was for walking down the road from the store when my car was broke down", "pics": null, "resp": null, "gmap_id": "0x8889275838c95881:0x381f8be4029ba76d"}
{"user_id": "106087938532895401849", "name": "Dani Garner", "time": 1563484542784, "rating": 1.0, "text": "rude staff", "pics": null, "resp": null, "gmap_id": "0x8889275838c95881:0x381f8be4029ba76d"}
{"user_id": "102834714156701341898", "name": "Kim R", "time": 1538335855086, "rating": 1.0, "text": "Rudest people.", "pics": null, "resp": null, "gmap_id": "0x8889275838c95881:0x381f8be4029ba76d"}
{"user_id": "113484197808985568457", "name": "King Of Pharts", "time": 1570160083028, "rating": 5.0, "text": "Every encounter I have had with the Lincoln AL Police Department from the Chief to the patrol officers has been nothing but positive. Very professional, courtious and efficient. Take a few seconds to approach an officer and thank them for their service!", "pics": null, "resp": null, "gmap_id": "0x888bd1b25fc9538d:0xd008c079525cb2dc"}
{"user_id": "111541009229704698420", "name": "Michael Medders", "time": 1519185134709, "rating": 1.0, "text": "Anonymous means anonymous, not stand in front of the guy I called about and blatantly say “This man called us”", "pics": null, "resp": null, "gmap_id": "0x888bd1b25fc9538d:0xd008c079525cb2dc"}
{"user_id": "112900146975099966728", "name": "David Quarrels", "time": 1553886278210, "rating": 5.0, "text": "I was born and raised in Rainbow City and still live in this great city. I am friends with several of our officers, council members and I have no doubts that we have the best officers and new police chief that you could ever find. I have the up most respect for each one of them and also for Sheriff Jonathan Horton.", "pics": null, "resp": null, "gmap_id": "0x888a3a517e9efb05:0x7948b4207467f593"}
{"user_id": "108988679358464729539", "name": "Tanner Hays", "time": 1522395335703, "rating": 5.0, "text": "Had a creepy car riding around my neighborhood and stopped in front of my house for about 10 minutes so I called RBCPD and within 5 minutes of me calling there was an officer patrolling the neighborhood. I felt like it might have been a waste of time for them but it made me feel safer knowing that they came to check it out. Especially when there was a break in just a couple of house down from mine several months ago. And around that time they were patrolling and had stopped me to let me know what they were doing and to make sure I lived in the house I was parked in front of. Thanks for all you do for our city!", "pics": null, "resp": null, "gmap_id": "0x888a3a517e9efb05:0x7948b4207467f593"}
{"user_id": "114555914405093770863", "name": "Sandra Wood", "time": 1511801818993, "rating": 5.0, "text": "Thank you Officer Holderfield for coming to the rescue of my husband and I on Saturday!  We appreciate you so much!  Thanks to all of you for making our area a safer place to live!", "pics": null, "resp": null, "gmap_id": "0x888a3a517e9efb05:0x7948b4207467f593"}
{"user_id": "107816534398712091892", "name": "Montiveale Cortorez", "time": 1500071397478, "rating": 1.0, "text": "There's a video of your officers beating a  man to death and throw him off a bridge...it's now viral..in Facebook for the whole world to see...I hope you got some good reps..because those offficers that are involved..is going to federal prison for life...goodluck with your departments future.", "pics": null, "resp": null, "gmap_id": "0x888a3a517e9efb05:0x7948b4207467f593"}
{"user_id": "117813012553344864078", "name": "Jennifer Rodriguez", "time": 1500073309343, "rating": 1.0, "text": "All i got to say is that i hope you people that call your selfs cop's ask for forgiveness on what you did to that poor black man. There is a place call hell for you PEOPLE.", "pics": null, "resp": null, "gmap_id": "0x888a3a517e9efb05:0x7948b4207467f593"}
{"user_id": "107840948508766478189", "name": "Paula Stewart", "time": 1489943553746, "rating": 5.0, "text": "Took my granddaughter with allergic reaction, they were very kind and took great care of her!!!", "pics": null, "resp": null, "gmap_id": "0x888a3a517e9efb05:0x7948b4207467f593"}
{"user_id": "108078893417371163113", "name": "Roger Brooks", "time": 1498169081170, "rating": 5.0, "text": "Storm shelter & friend's and city council", "pics": null, "resp": null, "gmap_id": "0x888a3a517e9efb05:0x7948b4207467f593"}
{"user_id": "107653669994842677342", "name": "Anthony", "time": 1537229613542, "rating": 5.0, "text": "They just moved into a new building.", "pics": null, "resp": null, "gmap_id": "0x8884e3c6f2731531:0x3c45bcfe6a9ec7de"}
{"user_id": "108712514804647397132", "name": "Walt Gay", "time": 1481256084729, "rating": 3.0, "text": "Smaller facility", "pics": null, "resp": null, "gmap_id": "0x8884e3c6f2731531:0x3c45bcfe6a9ec7de"}
{"user_id": "110552451479692436185", "name": "Brad Miller", "time": 1623552015197, "rating": 4.0, "text": "Actually went 5o the Madison County License and Tax office inside the precinct. Real friendly ladies run the office and there is virtually no line.  Both times I've been there to renew my licenses and to renew my auto tags and pay the ad valorem tax on the cars I've have benn in and out in less than 15 minutes.", "pics": null, "resp": null, "gmap_id": "0x886212f5794f11df:0x673d610eec7d0ffd"}
{"user_id": "105259088216959999427", "name": "Dan Kashefska", "time": 1601083529186, "rating": 1.0, "text": "Called at 8:00 pm to report a theft of a sign and got a friggin answering machine. Pretty piss poor when you get an answering machine when yo call the cops to report a theft.", "pics": null, "resp": null, "gmap_id": "0x886212f5794f11df:0x673d610eec7d0ffd"}
{"user_id": "107886391048829545425", "name": "Somer Moody", "time": 1593006969977, "rating": 5.0, "text": "If you are a law enforcement officer and need a break, you can come park outside my home.  If you are thirsty I will bring you a drink.  If you are hungry I will fix you food.  If you are hot I will invite you inside to cool off.  If you need additional ammo just ask.  If you need backup, I will stand with you.  If you need to cry, I will hug you and let you.  If you need to talk I will listen.  If you need to pray, I will kneel with you.  If you are wrong, I will tell you.   If you are right I will support you.\nI only ask that you don't lose faith in Americans.  We are NOT all against you.  Our lives matter, as do yours.  Take off your sunglasses and see the good people that are here for you.\nGod Bless you and your family.   Copied from a friend!   💙💙💙", "pics": null, "resp": null, "gmap_id": "0x886212f5794f11df:0x673d610eec7d0ffd"}
{"user_id": "114812432340347797675", "name": "Jeff K", "time": 1545848950419, "rating": 1.0, "text": "It's too bad that an officer or two (Garner) have to give other fine police officers a bad name. I've never been arrested for or charged with any crime. I haven't even had a traffic ticket in over 30 years. I'm a law abiding citizen. When I am forced to call the police to my home to help me with a problem I don't expect the officer to take a bad attitude and talk to and treat my like garbage. I'm not the problem. I'll be filing formal complaints with Internal Affairs and this officer's Sergeant.", "pics": null, "resp": null, "gmap_id": "0x886212f5794f11df:0x673d610eec7d0ffd"}
{"user_id": "110683480549743321806", "name": "Tommy Thompson", "time": 1535344867070, "rating": 1.0, "text": "I have always been a supporter of the police, and always donated to the police, but now I'm no longer going to be one. The motto is suppose to be serve and protect, but needs to be changed to harass and bully. Having 5 police cars park about a quarter mile away from a 65 speed limit sign and pull over so many cars knowing that the citizens are going to go the speed that they see is just harassment. Instigation should also be illegal for police officers to do. If they are really doing this to keep the citizens \"safe\" how about putting up more speed limit signs? rather than putting up traps. Shows how busy our police officers are when they can have 5 cars just waiting on people to give tickets.", "pics": null, "resp": null, "gmap_id": "0x886212f5794f11df:0x673d610eec7d0ffd"}
{"user_id": "114869395840219232435", "name": "Tommy McCutcheon", "time": 1502986375436, "rating": 1.0, "text": "I took my disabled mother, from her home in Owens Cross Roads, and my grandmother over to visit my aunt who had just recently left the hospital after being in there over a month suffering from broken bones internal bleeding and massive damage to her leg. All injuries she received at work from a severe mechianary accident. Needless to say my mother and grandmother wanted and needed to see her. So I went and got my grandmother with alzhiemers from her home. Anyway, monday just after 12 I got to my mother's house where my grandmother was staying with her. I helped get them get loaded in my mothers van, which would be much easier to travel in than my 2 door mustang. I drove them to visit my aunt, their sister and dauther. I helped get them loaded back into my mother's van along with my aunt and her wheelchair this time and took them to visit some people we go to church  with that they haven't seen and really missed. After getting back to my aunts house from visiting, I unloaded my passengers and helped them inside. Inside someone from church had made food so we stayed for dinner together. So around a little after 10pm my mother was ready to go so I loaded everything back up and drove from Morgan County where my aunt lives to Owens cross roads where my mother lives and dropped her off at home. She was worried because of my terminal illness I had pushed myself to hard that day and insisted I had to talk with her on the phone my entire ride home back into Huntsville. She didn't want me to be sleepy and drive. Keep in mind though this is getting close to 11pm and I haven't been in my car since around 12 noon. So I hop in my carand cranked my Mustang. I turned my lights on and start heading on my way home to Huntsville. Before I get pulled out of the subdivision I get the call from my mom and we talk while driving home. As I am driving through Owens Cross Roads my left head light goes out. I thoght that's weird so I switched my lights off and on real fast thinking maybe it was just some glitch. The light came back on for a short duration and went back off. Since there wasn't much traffic at all this late I turned my bright lights on when I could without blinding people. Like any other law abiding citizen I was afraid I may get pulled over for this. So I prayed I would make it home without any trouble so the next morning I could go get this light fixed. I made it into Huntsville and less than 2 blocks from home when I saw a police car behind me. I told my mom I needed to let her go and before we could say bye I saw the police lights. So I got pulled into a shopping center. This lady ,Officer Peterson, walks up and says my head light is out. I tried to explain what happened and the steps I was doing to try to be safe and how I was already planning to get it fixed first thing the next day when businesses reopened. She was not concerned with any of that and interrupted me asking for license, registration, and insurnace. I get out my license and registration noticing another male officer pulled up and was back there talking to her partner. As I'm pulling up my esurance app to show my insurance id cards I mess up my password forgetting I needed a capital letter. Before reattempting she orders me to give her the license and registration and then walks off with them. I got my card pulled up immediately as she had stepped away and was flashing my phone out of the car to let her know. To my surprise she comes back awhile later with 2 tickets 1 for improper lights and 1 for failure or refusal to display insurance. When I tried to ask questions I was agressively interrupted and shut up. I tired showing her the insurance card and she refused to take saying it wasn't legal I needed a paper copy. Again she was agressively shutting me until I was afraid to say anything else so I took my tickets and left. I hate when cops like that give other good cops that kind of reputation that's why I left this comment in great detail. She abused her authority, broke the law, and intimidated me into silence.", "pics": null, "resp": null, "gmap_id": "0x886212f5794f11df:0x673d610eec7d0ffd"}
{"user_id": "109900238421898662507", "name": "Roger Coleman", "time": 1550442963887, "rating": 1.0, "text": "Great job serving and protecting the woman sleeping in her car on her lunch break! No wonder everyone hates police. It’s just going to get worse until people are so sick of it you’ll have a fight on your hands. You think the blue line entitles you to breaking laws, the constitution and common decency. The worst part is tax payers will be ultimately on the hook when you get sued repeatedly. Well done to you all.", "pics": null, "resp": null, "gmap_id": "0x8889f8d691df00ef:0x957313f27d451972"}
{"user_id": "107392212385728753689", "name": "ken bubbett", "time": 1502300965356, "rating": 5.0, "text": "Well I work here. So I guess it all depends on the reason you are here and the part of the location you visit. This is on the back of Guntersville City Hall. And the City Jail is also on site. So safe to say some experiences may differ.", "pics": null, "resp": null, "gmap_id": "0x8889f8d691df00ef:0x957313f27d451972"}
{"user_id": "116420663640860694876", "name": "Diane Swan", "time": 1537174281138, "rating": 4.0, "text": "Well my experience with the city from the beginning to the end was pleasant you get respect if you give respect including the judge wich I found favor with he genuinely cared about my feelings the only thing that I give an F on is the officer that arrested me had my car towed and kelp my license. Really!?", "pics": null, "resp": null, "gmap_id": "0x8889f8d691df00ef:0x957313f27d451972"}
{"user_id": "103989924628946563243", "name": "Marc Rogers", "time": 1504463564057, "rating": 1.0, "text": "They don't understand basic constitutional law and they speed without lights and siren, which is a violation of state law.  Much more training is needed.", "pics": null, "resp": null, "gmap_id": "0x8889f8d691df00ef:0x957313f27d451972"}
{"user_id": "111473634413319286508", "name": "Vera Baker", "time": 1521840176984, "rating": 1.0, "text": "I believe  your so called officers need training in how to interact with the public. Not to mention the laws they have no grasp of especially (title:15) you need to know when to enforce a law, and not to escalate a situation to gain revenue or save your egos from being bruised. Very disturbing.", "pics": null, "resp": null, "gmap_id": "0x8889f8d691df00ef:0x957313f27d451972"}
{"user_id": "116005997192594650460", "name": "James Cabral", "time": 1525498461024, "rating": 1.0, "text": "So you have nothing vebett to do than arrest Woman sleeping in a car. What a bunch of Scumbags !", "pics": null, "resp": null, "gmap_id": "0x8889f8d691df00ef:0x957313f27d451972"}
{"user_id": "101578342493017490770", "name": "D", "time": 1549283311233, "rating": 1.0, "text": "I have heard from many people of corruption in the dept. To bad the ABI is to lazy to investigate them.", "pics": null, "resp": null, "gmap_id": "0x88882cb189b2668d:0xf28560be6a9fe80e"}
{"user_id": "107374745402318721793", "name": "HYENA REVIEWS", "time": 1497140377848, "rating": 5.0, "text": "I asked one of the officers if he could demonstrate how the breathalyzer works, when he blew into the device his blood sugar level was just over 2 Boston creams.", "pics": null, "resp": null, "gmap_id": "0x88882cb189b2668d:0xf28560be6a9fe80e"}
{"user_id": "108946821609597339250", "name": "Jamie Wells", "time": 1508781972074, "rating": 1.0, "text": "A bunch of cow town hillbillies with a std infested chief who was a punk in High school and still is .", "pics": null, "resp": null, "gmap_id": "0x88882cb189b2668d:0xf28560be6a9fe80e"}
{"user_id": "111283491795238641796", "name": "Aaron Burgess", "time": 1479874286275, "rating": 5.0, "text": "Great Department!", "pics": null, "resp": null, "gmap_id": "0x88882cb189b2668d:0xf28560be6a9fe80e"}
{"user_id": "107265067572440615530", "name": "Shawn Driver", "time": 1545823986929, "rating": 1.0, "text": "They don't take crime seriously,I was out there once visiting a friend when my lawn mower got stolen from the back of the truck and I went right away to the pd,because wasn't a resident,I wasn't allowed to file a police report,talk about some big bs,they told me to file it in the state I live in, they'll never see me there again", "pics": null, "resp": null, "gmap_id": "0x888b175a25bf141d:0xa9e7497b14636822"}
{"user_id": "114798400830314344674", "name": "Danica Barton", "time": 1566453733226, "rating": 5.0, "text": "Every experience Ive had with this police department has been pleasant. Even when being pulled over. The officers are very professional and happy to help when help is needed. Dispatch is always pleasant and quick to help you out. I honestly cannot say anything bad about this PD", "pics": null, "resp": null, "gmap_id": "0x8861ef1f0189170b:0x4de19ee46a50dbab"}
{"user_id": "107050509492806257163", "name": "Paul Gilliam", "time": 1582915246194, "rating": 5.0, "text": "Considering I did get to spend the night with them for Missing a court date they were nice , understanding and patient with me they treated me like a human being and respectful.thanks for the good work and professionalism", "pics": null, "resp": null, "gmap_id": "0x8861ef1f0189170b:0x4de19ee46a50dbab"}
{"user_id": "103401672865910239302", "name": "YANKEE West", "time": 1568515070568, "rating": 1.0, "text": "Mr s. Davis is a rude officer when it comes to talking to the public when theres a problem also he fail to identify himself when asked he said he didnt have to i identified myself i have this on video but is there anything going to be done hmmmm", "pics": null, "resp": null, "gmap_id": "0x8861ef1f0189170b:0x4de19ee46a50dbab"}
{"user_id": "116285027592057483079", "name": "lildawg Aviation", "time": 1534443073624, "rating": 5.0, "text": "recently my vehicle was struck and officers Mclemore and Sexton were of great assistance....I work with law enforcement often and these guys were excellent...thanx again", "pics": null, "resp": null, "gmap_id": "0x8861ef1f0189170b:0x4de19ee46a50dbab"}
{"user_id": "113555899574053554064", "name": "Cece Sonya", "time": 1513281695844, "rating": 5.0, "text": "If you've ever lost something on an airplane, you'll be calling these guys. There is an unclaimed baggage center located in their jurisdiction. They were a great help in providing me the contact number when my lost ipad showed up in Scottsboro, AL. Thanks!!!", "pics": null, "resp": null, "gmap_id": "0x8861ef1f0189170b:0x4de19ee46a50dbab"}
{"user_id": "104956179295827298229", "name": "Sherrod Ruffin", "time": 1563695145769, "rating": 5.0, "text": "I think Irondale Police Department has wonderful Cops. I like the fact that they all do their Jobs.\nIf they see anything suspicious they react instantly to secure and protect before things get out of control! They have wonderful Sergeants! We need more cops like Irondale Police to be exact!\nI am even thinking about joining the team to help make a difference myself. They are good cops and believe it or not they work ethic shows that we do have wonderful cops out here today.\nGood Job Guys!", "pics": null, "resp": null, "gmap_id": "0x8889105180a1a9f7:0xfc66f9193cf55350"}
{"user_id": "109128353043521491170", "name": "Russell Dye", "time": 1554242575943, "rating": 5.0, "text": "Irondale has a GREAT police department! Best officers and staff in the area. We are always happy to see them patrol in my neighborhood.", "pics": null, "resp": null, "gmap_id": "0x8889105180a1a9f7:0xfc66f9193cf55350"}
{"user_id": "100018574572471849966", "name": "Gus Zilla", "time": 1563303575547, "rating": 1.0, "text": "This Police department will violate your rights. Sergeant Perkins is a hypocrite not understanding the oath he swore to protect. stay far away from this place in Alabama unless you want your Constitutional rights violated.", "pics": null, "resp": null, "gmap_id": "0x8889105180a1a9f7:0xfc66f9193cf55350"}
{"user_id": "107776225810442302672", "name": "Randie Owens", "time": 1562724009737, "rating": 1.0, "text": "1 star based on video I saw.  Officer perkins is a perfect example why people have bad attitude towards cops.  He got his feelings hurt and then coerced a business owner to make a customer leave.  While his gang of other cops waited out side to find any reason to pounce on this guy.  I've run into these types of attitudes myself.  Makes me sick to my stomach.", "pics": null, "resp": null, "gmap_id": "0x8889105180a1a9f7:0xfc66f9193cf55350"}
{"user_id": "105262619774747440018", "name": "Tyrone Patton", "time": 1562764690708, "rating": 5.0, "text": "They're professional, kind and polite. There good and bad officer's where. I love living here.", "pics": null, "resp": null, "gmap_id": "0x8889105180a1a9f7:0xfc66f9193cf55350"}
{"user_id": "107002696027919360754", "name": "Nancy Gravlee", "time": 1577676604954, "rating": 5.0, "text": "Very helpful.  Follow police orders and thank them for their help.", "pics": null, "resp": null, "gmap_id": "0x8889105180a1a9f7:0xfc66f9193cf55350"}
{"user_id": "100164316844454883847", "name": "Donna Manuel", "time": 1504048842169, "rating": 5.0, "text": "Officer Key let my autistic grandson see his police car, took time with him and turned on the flashing lights for him to see.   I can't thank him enough!!  Also, the dispatcher whose name is Amanda was just as nice as she could be when I called to praise Officer Key.  Thank you both SO much!!", "pics": null, "resp": null, "gmap_id": "0x8889105180a1a9f7:0xfc66f9193cf55350"}
{"user_id": "115790706399788617747", "name": "Robin", "time": 1562725238626, "rating": 1.0, "text": "I recently saw a video showing a man exercising his first amendment right.  Officer Perkins immediately became the officer that most people would consider a tyrant.  Although the man videoing was not suspected of committing a crime, Officer Perkins demanded the man to give him his information.  When the man videoing refused to answer any questions or give up his information, that is when Officer Perkins started being belligerent.  He went as far as to get the store owner to trespass him.  And as he was leaving as requested, you can hear officer Perkins yelling at him.  I hope I never have any encounters with a police officer that thinks it's ok to deny people their rights, harass them and be belligerent when they are sworn to serve and protect.", "pics": null, "resp": null, "gmap_id": "0x8889105180a1a9f7:0xfc66f9193cf55350"}
{"user_id": "116398662025945437067", "name": "DeAnna Pond", "time": 1583515891869, "rating": 5.0, "text": "The guys do a great job! !!!", "pics": null, "resp": null, "gmap_id": "0x8889105180a1a9f7:0xfc66f9193cf55350"}
{"user_id": "103323050013210560635", "name": "Frog Price", "time": 1489180914710, "rating": 5.0, "text": "Great police service.", "pics": null, "resp": null, "gmap_id": "0x8889105180a1a9f7:0xfc66f9193cf55350"}
{"user_id": "117393526052726370178", "name": "Carl Burgess", "time": 1465398452855, "rating": 1.0, "text": "Recording the police will get you in trouble.", "pics": null, "resp": null, "gmap_id": "0x8889105180a1a9f7:0xfc66f9193cf55350"}
{"user_id": "107714975707768711033", "name": "Bridgett Glaze", "time": 1518374150131, "rating": 1.0, "text": "The Dept racial profile", "pics": null, "resp": null, "gmap_id": "0x8889105180a1a9f7:0xfc66f9193cf55350"}
{"user_id": "116797365570203671411", "name": "Rosalyn Jones", "time": 1582414027097, "rating": 5.0, "text": "I am the Manager at Advance America in Ladonia today we hosted a safety event Phenk. City Police Dept without hesitation came out and fingerprinted children Ident a kid program.  They were kid friendly ,  prompt and brought coloring pages and important information that OUR children need to know.   We had an awesome turn out. I want to thank you for everything you did to make this a Successful event.    THANK YOU AGAIN  Rosalyn Jones and Susan Tucker Advance America", "pics": null, "resp": null, "gmap_id": "0x888ccdb8cef8e23d:0x1e4dd300bfc28048"}
{"user_id": "108186265405205522300", "name": "Tyler Sellers", "time": 1552916049884, "rating": 5.0, "text": "I stopped by to get a case number and received prompt, professional service from the records department.", "pics": null, "resp": null, "gmap_id": "0x888ccdb8cef8e23d:0x1e4dd300bfc28048"}
{"user_id": "116952495857844833644", "name": "ryan 1981", "time": 1533495630579, "rating": 1.0, "text": "People who have been assaulted or stalked and cyber stalked by their neighbors. Can't get any justice because the instigator trouble making neighbor lies about what happen to the police. Then the phenix city police get an attitude with you! and you are GUILTY until proven innocent. Ken davice DOES NOT GET JUSTICE FOR EVERYBODY!  And the phenix city police have the gall to say that your story is DIFFERENT than the false accusers. Of course my story is DIFFERENT! This phenix city cops just ANGER me so much!\n\nIt just angered meThe phenix city police just stood their. When I told them that me and my family member didn't deserve to be assaulted. When my black neighbor along with their kids had followed us on 05/29/2018. There son cut us off on woodland dr in phenix city.\n\nAnd  they continue to follow us on hiway 80 all the way downtown phenix city headed into columbus. Where he started screaming at me telling don't mess with me. And he was saying PROVANITY at me verbal abusing me.\n\nThey instructed their son not to let us pass them. And they was driving slowly on purpose, Which I recorded on my cell phone. Then th eloud mouth mother got out of the car, during a traffic light in Columbus. Yelling at me to stop fliming her son. She is full of it after how he was cutting us off.\n\nThen he her husband got out of the car demanding me that I stop fliming or he would do it himself. So he slapped the phone out of my hand violentely and it hit my elderly grandmother, who was sitting in the drivers seat.\n\nThe they falsely lied to the police saying my mother. Who was driving was break checking them and driving slowly. And the phenix city police seemed to belive their side of the story more. And the one of the phenix city police ANGERLY told me, that they don't take sides.\n\nThey also didn't believe that I recorded it. Then they told me they are two sides to every story. Yes they are and my neighbors left out how her husband slapped the phone out of my hand violently and it hit my grandmother.\n\nThe police department is not FAIR. Like how they show favortism to certain neighbors and let their dogs roam around the neighbor without a leash. And they fine other neighbords and pick up their dogs.\n\nThe phenix city police claims that they. Follow the laws of the state of Alabama! HA! the police department makes up their own laws! And they aren't fair or transparent to victims of assault or harassment. Instead they allow anyone to FALSELY ACCUSE people!\n\nThis is why my neighbors walk around so hawtie. I'm not allowed to have fun or enjoy the summer. It just out rages them when I don't let them bother me! Why should I let them control my mind or live in fear with them falsely accusing me. Because the phenix city police deparment don't do their job!\n\nBecause they don't enforce the current laws. But make up their own! The corruption has never left phenix city when the national guard came into town  over 60 years ago. When they don't file charges on the assaulter their is corruption involved and kick backs that the police are receiving!\n\nThe police are told by their bosses not to listen to both sides! That proves how corrupt and criminal  and UNFAIR! the phenix city police department is!\n\nThe phenix city police don't treat everyone fair or equally. Because they rather believe the neighbors who are falsely accusing their neighbor they are harassing. Calling the police falsely on the neighbor you're harassing is harassment to!\n\nOther cities in the country prosecute people for falsely calling 911.  But not here in phenix city!\n'\nI'm  sure that if i had to shoot this man for assaulting me. The phenix city police department would not enforce the stand your ground law for me. Even though he ran out of his car during a red light and slapped my cell phone out of my hand.\n\nThese trouble maker neighbors in phenix city. Are able to convince the phenix city police that the victim me instigated everything. And of course the police ignore our side of the story.. The police don't treat everyone. EQUALLY!", "pics": null, "resp": null, "gmap_id": "0x888ccdb8cef8e23d:0x1e4dd300bfc28048"}
{"user_id": "101100077945413492771", "name": "PSS", "time": 1531725456357, "rating": 1.0, "text": "I pray someone doesn't die tonight at the hands of the drunk driver we called TWICE about!! We are traveling with our children and were almost hit several times. If they do kill someone it's thanks to rude dispatch and police who drive on by!! Hahaha I see why y'all have 2 stars!", "pics": null, "resp": null, "gmap_id": "0x888ccdb8cef8e23d:0x1e4dd300bfc28048"}
{"user_id": "109412916488672133166", "name": "Carrissa Holmes", "time": 1579897597418, "rating": 1.0, "text": "Called them twice on the same person and they did nothing to help us the person is still free", "pics": null, "resp": null, "gmap_id": "0x888ccdb8cef8e23d:0x1e4dd300bfc28048"}
{"user_id": "115067264506610131743", "name": "Jacqueline Posey", "time": 1565712638620, "rating": 1.0, "text": "Call 911 Twices who ever Answer the Phone Was Very Nasty Attitude !!", "pics": null, "resp": null, "gmap_id": "0x888ccdb8cef8e23d:0x1e4dd300bfc28048"}
{"user_id": "106873909196691473014", "name": "Chris Underwood", "time": 1571001033868, "rating": 5.0, "text": "I have had nothing but good service from them.", "pics": null, "resp": null, "gmap_id": "0x888ccdb8cef8e23d:0x1e4dd300bfc28048"}
{"user_id": "114095054865053673464", "name": "Steve Kacer", "time": 1565796040381, "rating": 5.0, "text": "Was nice and understanding", "pics": null, "resp": null, "gmap_id": "0x888ccdb8cef8e23d:0x1e4dd300bfc28048"}
{"user_id": "118297904951469526608", "name": "Patrick Pallesen", "time": 1561724345343, "rating": 1.0, "text": "Why call? All you get is voice mail and no one returns your call.", "pics": null, "resp": null, "gmap_id": "0x888ccdb8cef8e23d:0x1e4dd300bfc28048"}
{"user_id": "108349891544577937801", "name": "Anthony Thomas", "time": 1544905535789, "rating": 1.0, "text": "Under 18 get away with murder in PC.", "pics": null, "resp": null, "gmap_id": "0x888ccdb8cef8e23d:0x1e4dd300bfc28048"}
{"user_id": "113457032829931736892", "name": "Mo Prince", "time": 1508341916423, "rating": 1.0, "text": "Highly paid criminals", "pics": null, "resp": null, "gmap_id": "0x888ccdb8cef8e23d:0x1e4dd300bfc28048"}
{"user_id": "112084883239829245145", "name": "Joel", "time": 1538668824148, "rating": 1.0, "text": "Pure incompetence", "pics": null, "resp": null, "gmap_id": "0x888ccdb8cef8e23d:0x1e4dd300bfc28048"}
{"user_id": "106741270653134453184", "name": "Scott Plagmann", "time": 1497820274293, "rating": 5.0, "text": "Glad to live in the city of Gardendale because of the first rate police here. I have lived in many other municipalities over the years but I have always felt safe and secure in Gardendale. The police are very fair and professional . THANK YOU for the service you provide for our city!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMwKYVRe4ysOjVuPPpS00RnphzlyVjDOjXlU5zc=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMuEL7gEbWTBGV-qOQH1OsKjwvoTRaTk1rxqVmx=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOy9WayeyRg1Cy6lcGfRLSrARqEOVK2R_7IyhCc=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888904124ffd9ab1:0xccebe85c725a40c3"}
{"user_id": "106110107149429393870", "name": "Heather Michelle Stephens", "time": 1582049151071, "rating": 5.0, "text": "I’m very pleased with Gardendale Police Department. Detective Pannell went above my expectations to help me with a case. He understood the seriousness of what It was and I am very pleased with the work and time he put on this case! The Officers have always been fair and I have nothing but respect for ALL LEO’S", "pics": null, "resp": null, "gmap_id": "0x888904124ffd9ab1:0xccebe85c725a40c3"}
{"user_id": "111506924696105345645", "name": "Jessica April", "time": 1526393365830, "rating": 5.0, "text": "Not having had the most positive encounters with law enforcement I must  say that every interaction I've had with Gardendale patrol deputies have been ones to positively change my outlook and have honestly stopped my negative stereotypical attitude twds them. Very understanding , respectful,  moral and  courteous group of men they have patrolling in addition  to being thorough ,reliable, responsive, dutiful and courageous in their work. Thank you again to the officer I spoke with last night. So very much.", "pics": null, "resp": null, "gmap_id": "0x888904124ffd9ab1:0xccebe85c725a40c3"}
{"user_id": "115662112798919420738", "name": "Charles McKinney", "time": 1495999643557, "rating": 5.0, "text": "Great officers. Great location. Great group of men and women.", "pics": null, "resp": null, "gmap_id": "0x888904124ffd9ab1:0xccebe85c725a40c3"}
{"user_id": "104017794118878473808", "name": "Anthony Cornelius", "time": 1576119893119, "rating": 5.0, "text": "To protect and serve", "pics": null, "resp": null, "gmap_id": "0x888904124ffd9ab1:0xccebe85c725a40c3"}
{"user_id": "101880788937721007398", "name": "Nat B", "time": 1510601176948, "rating": 1.0, "text": "Worst city police department I have every had to deal with. No officer or worker there knows how to be a somewhat decent person . Get the stick out of your asses..", "pics": null, "resp": null, "gmap_id": "0x888904124ffd9ab1:0xccebe85c725a40c3"}
{"user_id": "106557981959566411249", "name": "C Taylor", "time": 1535950342807, "rating": 5.0, "text": "Nice people with a smile. Not always what you would normally encounter with county or city employees but here you do. Always helpful and courteous.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP25dcj5oPQUko4wrRff-KA_oR_CCHxnIF8ypxk=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPrmxkniUR6y74-yH_Tk078OmeL87_bh29B0O2q=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPhnDI52xRcAEsGZOFdNqqBPsmjsXu6r9kqsMIH=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMlWCRWm7zdyRw0AJ3iA4FwOf9IrpCcTpSpeaRc=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPGt30CUiTXHGXAlmiQTosGNmaOjkhIaxeNCUOD=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a2640dfe9b37b:0x492abfef7d143924"}
{"user_id": "106456949975824239912", "name": "Emory Daniel", "time": 1535459406349, "rating": 4.0, "text": "Facility is nice enough people and employees are nice unless you're suspected of anything criminal guilty or not. Small town values and prejudices for the whole of the city not just in the police. Officers in my opinion seem fair unless given a reason not to be.", "pics": null, "resp": null, "gmap_id": "0x888ca4758ec80273:0x36594aa642b5ffce"}
{"user_id": "117206728447971281482", "name": "Jeffrey Wentz", "time": 1481921731070, "rating": 5.0, "text": "Met a young officer last night while delivering pizzas. Nicest police officer I've ever met.", "pics": null, "resp": null, "gmap_id": "0x888ca4758ec80273:0x36594aa642b5ffce"}
{"user_id": "116723133917487058826", "name": "Kristen R", "time": 1570989272852, "rating": 1.0, "text": "A joke of a police department! Our boat was stolen, never received a follow up call from “detective” as promised.", "pics": null, "resp": null, "gmap_id": "0x888ca4758ec80273:0x36594aa642b5ffce"}
{"user_id": "108333285687161874316", "name": "Art Of Valor", "time": 1578751094776, "rating": 4.0, "text": "Highly skilled and adequately trained police officers at this department. Takes a lot of guts to do their job. Officers at this department have to have a survival mindset and be on top of their game at all times. Professional and courteous.", "pics": null, "resp": null, "gmap_id": "0x888bb394c9b53941:0x10157ab8f9d3a865"}
{"user_id": "108964816255651922449", "name": "Holly Gates", "time": 1559349944226, "rating": 5.0, "text": "I see alot of them in my store and they are all so sweet", "pics": null, "resp": null, "gmap_id": "0x888bb394c9b53941:0x10157ab8f9d3a865"}
{"user_id": "101441138476543961956", "name": "Justin Price", "time": 1554350314562, "rating": 1.0, "text": "Wish I could do 0 stars. Lazy worthless police. My wife locked her keys in her car and she was in a dark unsafe place but the dispatcher told her that it was too bad. Wow. Help the public and do your job. Don’t depend of them showing up unless they have to bring an ambulance.", "pics": null, "resp": null, "gmap_id": "0x888bb394c9b53941:0x10157ab8f9d3a865"}
{"user_id": "102818573714887692457", "name": "Ryan D", "time": 1488240382530, "rating": 5.0, "text": "Very helpful with a few questions I had. The lady was kind and willing to help the entire time.", "pics": null, "resp": null, "gmap_id": "0x888bb394c9b53941:0x10157ab8f9d3a865"}
{"user_id": "106707088787138828276", "name": "I.O.U", "time": 1483487391759, "rating": 5.0, "text": "Today was AMAZING AND A BLESSING to see the officers playing football and basketball with the children of Glenn Addie Homes thank you so much for showing you love lyfe is sweet", "pics": null, "resp": null, "gmap_id": "0x888bb394c9b53941:0x10157ab8f9d3a865"}
{"user_id": "105044096719705039247", "name": "Abby Thrasher", "time": 1552530515039, "rating": 5.0, "text": "That officer Curvin is a cool cat!", "pics": null, "resp": null, "gmap_id": "0x888bb394c9b53941:0x10157ab8f9d3a865"}
{"user_id": "106426617878352567132", "name": "Debbie Ball", "time": 1513619013778, "rating": 5.0, "text": "Hat goes off  to the police department. After I think 4:00 ish. The office is closed but door, Is still open to my knowledge", "pics": null, "resp": null, "gmap_id": "0x888bb394c9b53941:0x10157ab8f9d3a865"}
{"user_id": "115205768018387384895", "name": "Venus L.C.S", "time": 1506273254674, "rating": 2.0, "text": "Slow,  lazy and act like they're better than anyone", "pics": null, "resp": null, "gmap_id": "0x888bb394c9b53941:0x10157ab8f9d3a865"}
{"user_id": "111376203750712285141", "name": "Chrystal C Mullinax", "time": 1509994995706, "rating": 5.0, "text": "Taking care of those bad boys and girls", "pics": null, "resp": null, "gmap_id": "0x888bb394c9b53941:0x10157ab8f9d3a865"}
{"user_id": "106350767182777437343", "name": "Nicole D", "time": 1572207478628, "rating": 1.0, "text": "I had to call numerous times to talk to my lawyer about my case and all i got was document. It seems like i am just a number not a person. Also  was unable to get any couseling services. I am the victim why do i have to be treated and punish again and again. I will not refer anyone in need to this facility.", "pics": null, "resp": null, "gmap_id": "0x888e8172b97721a7:0x2006b1e8f3981510"}
{"user_id": "102548782099643070514", "name": "Melissa Ortiz", "time": 1474902478386, "rating": 1.0, "text": "The counselor left the room to talk with another counselor and they were talking bad about me, I know this because she didn't close the door and I overheard them laughing about it. I know that swallowing your pride and asking for help is the hardest part but don't do it here unless you want people talking trash about you. This place is the reason a lot of women don't want to ask for help!!!", "pics": null, "resp": null, "gmap_id": "0x888e8172b97721a7:0x2006b1e8f3981510"}
{"user_id": "101001191648368458237", "name": "Magic Daddy", "time": 1535641771734, "rating": 5.0, "text": "Great dept. Always helpful and willing to serve and protect. You guys and gals have a hard stressful job. No one is perfect as we all have flaws but I want you all to know how much I am thankful for you. Shout out to my friend officer Jasson Todd Smith. I'm praying for all you great people who make our city safe. Keep up the great work. God bless", "pics": null, "resp": null, "gmap_id": "0x8889e42ae56962f1:0xcaa21d941650e12b"}
{"user_id": "101703824478687549292", "name": "Mr. Sport's guy", "time": 1562808392792, "rating": 1.0, "text": "My sistet was qorking fir a in home care place and she qas taking care of a 80 yr old woman who had dementia and was helping her pay gor things she wanted off of the tv and the lady turned around and clamied that she was stealing money and pills feim her to this detective at arab police department and he  called my sister and my sister tried too explain too him that she had dementia and he was not listening to her. They are crooked there in arab and are lyers", "pics": null, "resp": null, "gmap_id": "0x8889e42ae56962f1:0xcaa21d941650e12b"}
{"user_id": "102713725746238750035", "name": "Tomeka Bartlett", "time": 1521318470857, "rating": 1.0, "text": "Very rude cocky police officers,no respect,not helpful at all. Don't pretend to be someone for the good of a town when you are not trying to offer any assistance.", "pics": null, "resp": null, "gmap_id": "0x8889e42ae56962f1:0xcaa21d941650e12b"}
{"user_id": "103987448279847234433", "name": "Jeremy Phillips", "time": 1538943117736, "rating": 5.0, "text": "Oct 7th 2018 I was in my rig, 69SB crossing guntersville lake. I looked in my mirror and observed this small car halfway on the road and the other half of the vehicle was in the grass that separates NB and SB traffic. At a60 mph pace, I knew right away, this person is not correctly thinking or is impaired.  As we went thru the stop light at pier 69(green light)  towards the mtn., this driver steers to the fast lane of the oncoming traffic.  Swerving at cars yet, maintained his speed,  never touched the brakes.  I immediately called 911. Told them the situation, and I was losing sight of him, due to my rig pulling the grade.  Within 10th minutes I catch up the law enforcement pursuing the car and watch it all unfold.   They did an awesome job boxing him in.  The thing that impressed me was one officer pulled up the the side of the car and observed a small child in the car. Great job guys!  Very quick response.  I appreciate that👍🏻", "pics": null, "resp": null, "gmap_id": "0x8889e42ae56962f1:0xcaa21d941650e12b"}
{"user_id": "115908737924493143766", "name": "Kevin Humphreys", "time": 1506076614279, "rating": 3.0, "text": "They do a good job for a small town.", "pics": null, "resp": null, "gmap_id": "0x8889e42ae56962f1:0xcaa21d941650e12b"}
{"user_id": "113157979019947298150", "name": "Christine Moore", "time": 1489592540141, "rating": 2.0, "text": "Want to know if theres a billy nathan morton is in arab.city jail", "pics": null, "resp": null, "gmap_id": "0x8889e42ae56962f1:0xcaa21d941650e12b"}
{"user_id": "106214128239278494423", "name": "losing the will to live", "time": 1503818871421, "rating": 5.0, "text": "This is the world's finest police department", "pics": null, "resp": null, "gmap_id": "0x8889e42ae56962f1:0xcaa21d941650e12b"}
{"user_id": "105082659691695917149", "name": "Samantha Walker", "time": 1520727508933, "rating": 5.0, "text": "We have a WONDERFUL Police department,and Mayor.", "pics": null, "resp": null, "gmap_id": "0x8889e42ae56962f1:0xcaa21d941650e12b"}
{"user_id": "106135962646173985224", "name": "Kory Roberts", "time": 1521756993523, "rating": 5.0, "text": "Very respectful and responsive. Have only dealt with Tony and Kevin, but they are very nice. If you live in Midland City and need the police, they are there for you.", "pics": null, "resp": null, "gmap_id": "0x88928ede130dd60d:0xc098c80ed8f87527"}
{"user_id": "114223164015026720203", "name": "Elaine Knight", "time": 1533901399629, "rating": 1.0, "text": "Called about dogs trying to attacking me in my yard. Dispatcher said we no longer have animal control to take the dogs away to the pound. So I guess I'm on my own, if I get attacked it's my problem! I do not feel protected by the Midland City police department.", "pics": null, "resp": null, "gmap_id": "0x88928ede130dd60d:0xc098c80ed8f87527"}
{"user_id": "113591779697282258526", "name": "Nicole Exum Creel", "time": 1544071771882, "rating": 5.0, "text": "Friendly police officers! Hard working and really protecting the community. Great staff Chief Walker!!", "pics": null, "resp": null, "gmap_id": "0x88928ede130dd60d:0xc098c80ed8f87527"}
{"user_id": "106272573433378461343", "name": "Mark Fox", "time": 1475881204546, "rating": 5.0, "text": "Very polite and professional officer. I was very upset at first but once the situation was explained to me by officer Kriss I calmed down and it descalade the situation. Support Blue lives! They protect us!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNpWnM3jdJknVthoWj_nHCAWBLLrA_UYkdOhJg=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a04d49c54f859:0x4b974e1265cfadaa"}
{"user_id": "102737353409014821130", "name": "Bill Pee", "time": 1465539650141, "rating": 5.0, "text": "Look at these ignorant, bad posts... They start with \"my friend\". Well news flash, you aren't getting the whole or real story!! If \"your friend\" wasn't breaking the law in the first place, they wouldn't have encounter the police! I've been coming here for 20 years and I can say I have NEVER had a bad run in with the police. The other night I was at the hangout and I saw 2 police officers walking through and you know what went through my head? No, it wasn't they are here to get me. I was thinking it was great police work with these gentlemen walking through and keeping me safe from the criminals! Wake up people and stop demonizing the police for your mistakes. They are here to protect us and keep us safe. Remember this, they enforce laws, not make them. If you have and issue take it up with your law makers. I support the peace keepers!", "pics": null, "resp": null, "gmap_id": "0x889a04d49c54f859:0x4b974e1265cfadaa"}
{"user_id": "113359552491533105038", "name": "John Briscoe", "time": 1565420811873, "rating": 5.0, "text": "Brought my family down on vacation for the second year in a row. We instantly fell in love with Gulf Shores. Tonight I reluctantly called the police on a group of 10 at our pool due to lewd behavior. The police responded within 15 minutes and broke up the ruckus going on. The guilty parties weren’t staying at the condominiums but were belligerent and loud past 1 am. The police removed them without incident and were very professional! I wanted to go down to the partiers to say something, but 10 on 1 are not good odds. Thank you to Gulf Shores PD for doing what was needed.", "pics": null, "resp": null, "gmap_id": "0x889a04d49c54f859:0x4b974e1265cfadaa"}
{"user_id": "116044136768576588155", "name": "Jon McCrorie", "time": 1523358736735, "rating": 5.0, "text": "Nothing but the best from GSPD. Every time I've been to gulf shores, these officers are quick to address issues,  professional,  and protective. It is good knowing that no matter what where I go in gulf shores,  there's a department I can reach that genuinely cares about the people that it protects and serves.", "pics": null, "resp": null, "gmap_id": "0x889a04d49c54f859:0x4b974e1265cfadaa"}
{"user_id": "117276980913309981451", "name": "Marina Morse", "time": 1525612517007, "rating": 5.0, "text": "I want to say how proud I am of my Son Chris Brown you are an amazing Son... I pray that our Father God and St. Christopher keep you protected in every thing you do ... I pray that God Shows you the way to every good situation in the line of duty may all your fellow Officers be by your side as I know you'll be by theirs ... You've made an amazing Choice for your Career... I Love you with all my heart Son. To all Law Inforcement in Alabama thank you all for bringing my Son Aboard to do the line of duties that give you all family like feelings may God Bless you all for your love, strength, Happiness, Joy, Truth and Honorship... Love to you all.", "pics": null, "resp": null, "gmap_id": "0x889a04d49c54f859:0x4b974e1265cfadaa"}
{"user_id": "116399100787206548844", "name": "Melissa Conner", "time": 1537648047936, "rating": 2.0, "text": "Amazing C.O.'s work here but the food is terrible! I know it is jail. It is not a requirement to give great food to inmates, but there are only so many banquet meals a person can eat! Also, the meal times could be scheduled different so the inmates do not go to be hungry because dinner was at 6 with not even a snack before lock down. Other then that, as far as a jail goes, it isn't disgusting and the C.O.'s make sure the inmates are taken care of.\n\n**I have only been to 2 different jails so my opinion about the jail is only based from experiencing one other facility.\n**Just like the Trustee once told me \"Don't come to jail and you wont have to eat the banquet meals.\" Lol the food could be worse, I know!!!", "pics": null, "resp": null, "gmap_id": "0x889a04d49c54f859:0x4b974e1265cfadaa"}
{"user_id": "105980069332839545898", "name": "Donna Morgan", "time": 1540396084551, "rating": 5.0, "text": "We have so much respect for the Gulf Shores police Department,Thank You For all you do !", "pics": null, "resp": null, "gmap_id": "0x889a04d49c54f859:0x4b974e1265cfadaa"}
{"user_id": "115393442116528728318", "name": "Sumer Jayy", "time": 1464708730299, "rating": 1.0, "text": "My friend was walking down the street and held at gun point by near by residents. They called the police and charged him with \"attempt to commit\"\n\nWalking down the street. Literally, on the side of the road. The color of your skin reflects violence in all residential eyes. Do not walk alone. I pity the ignorance in the state of Alabama. \"Sweet home Alabama\", is very sour and disgusting. I pray for the ignorance and hope they wake up to see the beauty in all individuals.", "pics": null, "resp": null, "gmap_id": "0x889a04d49c54f859:0x4b974e1265cfadaa"}
{"user_id": "104141326542361525267", "name": "Anne Wilson", "time": 1458332483046, "rating": 1.0, "text": "All the people giving reviews on how bad the PD is I'd like to say this. These officers put their lives on the line every day, so many people come down here to get away from mommy and daddy and want to raise a little hell destroy our beaches and rental properties and think they shouldn't have to answer for it. How do the officers know your not going to try and kill them ? If you want to act stupid and stay drunk for a week, please STAY IN YOUR HOME STATE.", "pics": null, "resp": null, "gmap_id": "0x889a04d49c54f859:0x4b974e1265cfadaa"}
{"user_id": "105331137879718283430", "name": "Lauren Todd", "time": 1435110289892, "rating": 1.0, "text": "I live in Washington and although I have never even been to Alabama, let alone to this station, I am absolutely appalled at the story I just read about one of your officers and how he left an innocent dog in a hot car which eventually led to the dogs death. I am not trying to bash the officer himself in any way. Although he does need to improve his memory. I simply believe that just because he is an officer he shouldn't be put on a higher pedistool than the rest of the citizens. No charges will be filed? If this were any other man or woman who did this they would be charged within seconds. He should be punished in some way, whether it be time off of work or at least being charged a fine.", "pics": null, "resp": null, "gmap_id": "0x889a04d49c54f859:0x4b974e1265cfadaa"}
{"user_id": "111219510634172294535", "name": "benjamin powell", "time": 1488690643138, "rating": 1.0, "text": "They do not follow constitutional ammendment rights, they will enter your home without a warrant and get physical with you. I have no respect for the gulf shores police they are crooked and thieves", "pics": null, "resp": null, "gmap_id": "0x889a04d49c54f859:0x4b974e1265cfadaa"}
{"user_id": "114652513325649777434", "name": "Jordan Cox", "time": 1458092298130, "rating": 1.0, "text": "GSPD arrested a friend of mine, after he tossed  a beer can in the grass. After being breathalyzed, he blew a .071(a legal limit when 21)... The cop was very physical and very aggressive. My friend described his experience as an experience where he was \"treated unfairly\" and considered it a \"somewhat abusive, physical, and inhumane incident\" after being violently pulled to the side of the police car. He was given an MIP (which was fair) then was required to stay in a jail cell for the night. He was never read his rights, nor did he receive any food during the entirety of his stay, since the GSPD ran out of honey buns (literally the food they were giving out) to give away to their prisoners which were being detained because they had drank a couple of beers. My friend's experience with the Gulf Shores Police Department sounded very ethical to me. Well done GSPD.", "pics": null, "resp": null, "gmap_id": "0x889a04d49c54f859:0x4b974e1265cfadaa"}
{"user_id": "102582347771499413607", "name": "Chase Gunter", "time": 1545234056732, "rating": 1.0, "text": "Parks every off duty vehicle in fire lane infront of Walmart to show off the money the county has spent on them to waste obviously.", "pics": null, "resp": null, "gmap_id": "0x889a04d49c54f859:0x4b974e1265cfadaa"}
{"user_id": "111433196324509937486", "name": "Chris Needham", "time": 1535057893029, "rating": 3.0, "text": "Too much trash on the beach at gulf shores . I picked up two beer bottle caps , could have cut the mess out of my feet . How about some fines ...", "pics": null, "resp": null, "gmap_id": "0x889a04d49c54f859:0x4b974e1265cfadaa"}
{"user_id": "117441416515887537242", "name": "Dillon Heidrick", "time": 1458091344323, "rating": 1.0, "text": "Low quality buildings, low quality cells, low quality officers. Ran out of food for their inmates so they weren't fed. Policemen wouldn't fill out forms when appropriate. Overall not how inmates should be treated.", "pics": null, "resp": null, "gmap_id": "0x889a04d49c54f859:0x4b974e1265cfadaa"}
{"user_id": "116481900380058351540", "name": "Kamar Taj", "time": 1605592095361, "rating": 5.0, "text": "I just gave them some money and they let me slip 10 out of 10", "pics": null, "resp": null, "gmap_id": "0x88926282bdc55555:0x93079dea8d92b241"}
{"user_id": "115357008372227713853", "name": "Gary Cross", "time": 1488499926959, "rating": 5.0, "text": "Our local Police who do a great job keeping the peace, helping those who need it and serving our community!", "pics": null, "resp": null, "gmap_id": "0x88926282bdc55555:0x93079dea8d92b241"}
{"user_id": "113911126810466754450", "name": "Clint Louis", "time": 1498534117959, "rating": 1.0, "text": "Today while driving to dothan Al. I saw a Newton police officer with his gun pointed at a car of African Americans he had pulled over. You could see their hands raised up inside the car. The second officer arriving didn't even have his blue lights on. My gf and i pulled over and watched as more cops came and left. Ozark police were there too. All I could think was here's another unhinged white police officer's who could kill unarmed civilians.", "pics": null, "resp": null, "gmap_id": "0x88926282bdc55555:0x93079dea8d92b241"}
{"user_id": "104987693949609743896", "name": "julius goodmon", "time": 1579722663202, "rating": 1.0, "text": "Awful. My brother was dumped there deceased and I see why. They're better having no police department at all. Simply pitiful.", "pics": null, "resp": null, "gmap_id": "0x8888e0f18318f4df:0xc4eb314ea003c577"}
{"user_id": "105016140974023303821", "name": "Dell p", "time": 1528319495266, "rating": 1.0, "text": "Police department is a joke.🤣🤣🤣 Corrupt and crooked officers working with drug dealers (on payroll). Harassing residents to acomplish there agenda of turning a blind eye and supporting drug trafficking for there personal gain. Illegal searches and seizures of property in vehicles and homes. This is the wild west, only enforcing laws on dealers and drug houses not paying out. Allowing a city to crumble for personal gain and power.", "pics": null, "resp": null, "gmap_id": "0x8888e0f18318f4df:0xc4eb314ea003c577"}
{"user_id": "110198870831757988481", "name": "Amy Kuhn", "time": 1542837551945, "rating": 1.0, "text": "A complete joke of a department!\nMy husband had a wreck, they came took all his money $350 saying to pay or go to jail ( which he did nothing wrong, wasn't drinking or under the influence) and took his phone. Also they have his keys but when I call they have nothing.\nCorrupt corrupt corrupt!", "pics": null, "resp": null, "gmap_id": "0x8888e0f18318f4df:0xc4eb314ea003c577"}
{"user_id": "105531141080697559493", "name": "Erik Seymore", "time": 1476292413072, "rating": 5.0, "text": "The courts system is willing too help you.", "pics": null, "resp": null, "gmap_id": "0x8888e0f18318f4df:0xc4eb314ea003c577"}
{"user_id": "109864602294290726341", "name": "Jenna Herring", "time": 1522945960513, "rating": 1.0, "text": "I will give them worse than a 1 star. They do stuff very illegal. I'll see them in court", "pics": null, "resp": null, "gmap_id": "0x8888f7be27a2152f:0xad052fb0b900af0e"}
{"user_id": "105488585442769126086", "name": "Tracy Thrasher", "time": 1474318988723, "rating": 5.0, "text": "Dora police department is amazing I locked my keys in my truck at work and Jared Hall was amazing he came out and got my keys out there the best thank you", "pics": null, "resp": null, "gmap_id": "0x8888f7be27a2152f:0xad052fb0b900af0e"}
{"user_id": "105025038923011959660", "name": "Ambria Collazo Edwards", "time": 1550407610174, "rating": 1.0, "text": "My grandfather went missing and they waited 5 days until we forced the news to say something to put out a missing person report. They knew he had  PTSD Alzheimer's and still didnt care. They claimed to have looked around the bus station where he went missing but we all know it was a lie because he was found under a bridge next to the station deceased due to the weather's elements! Shame on you BPD. You didnt take your jobs serious and now my family is dealing with the after math. I now see why people dont trust yall.", "pics": null, "resp": null, "gmap_id": "0x88891b60bf967cb5:0xdfd9d9efbf4bbbcf"}
{"user_id": "101757759084316889037", "name": "Ishmael II", "time": 1496776976273, "rating": 1.0, "text": "I called the headquarters 254-1700 at 2:10 and the phone rang 30 times before I hung up. I then called the 254-2000 number which was answered immediately. The operator then tried to connect me with the headquarters and I let the phone rang another 30 times and nobody answered. I guess everybody is out protecting the Southside.", "pics": null, "resp": null, "gmap_id": "0x88891b60bf967cb5:0xdfd9d9efbf4bbbcf"}
{"user_id": "105660623355413320002", "name": "Brandon Castleberry", "time": 1206139010098, "rating": 1.0, "text": "I wouldn't try calling the 311 call center... I was left on hold for nearly an hour! I just don't understand, there is NO reason a police department should have to leave someone on hold without ever speaking to the first person even if it's the \"non-emergency\" number. It is simply a combination of our city not willing to pay the man hours for enough people and the people they do have are just like the DMV workers who are using our tax dollars to sit around doing nothing while we wait.", "pics": null, "resp": null, "gmap_id": "0x88891b60bf967cb5:0xdfd9d9efbf4bbbcf"}
{"user_id": "109125389600800621394", "name": "Christophermichael James", "time": 1508081992276, "rating": 5.0, "text": "If you need assistance urgently call 9-1-1. If it's not an \"emergency\" let them know as soon as they answer and they'll get you to the right place!", "pics": null, "resp": null, "gmap_id": "0x88891b60bf967cb5:0xdfd9d9efbf4bbbcf"}
{"user_id": "101546454464555403723", "name": "Lucas Payne", "time": 1621892172640, "rating": 1.0, "text": "Officer almost Hit me running a red light no sirens no emergency lights. I went immediately to the court house to report it 30 mins later a Sargent calls me an says he can meet me later to talk about it. Now if I had put someone's life in danger they policewoman be all over me but since it was just another cop abusing he's powers nothing is handled. Been outside the courthouse for about 30 mins I requested a officer to co.e talk to me but yet all I get is a phone call from a Sargent saying he's getting  he's oil changed an he can meet me later. HPD where's the honor or dignity? Enjoy my footage of the cop from my go pro.", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "104468058432505263145", "name": "james m", "time": 1620664834993, "rating": 5.0, "text": "I can't believe how low their review is, they're great!", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "100736090779519183777", "name": "Nolan Burton", "time": 1593336466039, "rating": 5.0, "text": "I've been caged from society 4 times for non payments of misdemeanor moving violations. This organization of law enforcement was the only team or committed civil servants that treated me like a child of God. I pray He keeps them safe as they continue working to provide a safe and prosperous community for the City of Hoover.\n\n#tbtg🙌", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "114278491861479783636", "name": "Matthew Lambert", "time": 1570462033417, "rating": 5.0, "text": "Professional, The Hoover PD Should Be The Standard For Other Police Departments.\n\nI Want To Give A Shout Out To\n\nOfficer Barnes\nAnd Officer Lowery\nTwo Of The Most Professional And Courteous Officer You'll Ever Meet.\n\nThe Hoover Police Department Truly Redefines What It Means To Serve The Public.\nThanks For All That You Guys Do And God Bless You All", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "103697119300454007644", "name": "LilVi", "time": 1591200158443, "rating": 1.0, "text": "This is actually horrible. Sticking your hand through people’s cars without reason, is violation of privacy. When I ask you what I did wrong I expect you to answer, not to continue your unwanted and unneeded search.", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "114126321545216928040", "name": "matt barrett", "time": 1593264001709, "rating": 5.0, "text": "Most professional and well trained department I know!", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "106768665561912731127", "name": "Andrei Bombin", "time": 1541098069765, "rating": 5.0, "text": "I was trying to get to the car service on a flat tier. The officer helped me to change it for an extra one, so I would not damage a wheel. Very nice of him!", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "117417771825565275614", "name": "Dave niudsiodv", "time": 1548526258170, "rating": 5.0, "text": "I was arrested and taken to their jail for 5 days, we were feed hot pockets and hungerman meals, had a huge 4K tv mounted on the wall in our cell block and every cell had its own shower. Best jail iv ever been to! Hate to be in a jail but this one is the best.", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "116937905297008614736", "name": "mehul patel", "time": 1543167807677, "rating": 1.0, "text": "“Graham vs Connor” isn’t a license for you to shoot first and do your job later (protect and serve). I wonder what version of the “I feared for my life” defense you will use.", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "117241438197601348012", "name": "Aaron Hawkins", "time": 1562617983597, "rating": 1.0, "text": "One set of rules for them… One set a rules for us. Double standard… As long as they ride around in those Hoover Police vehicles they can do whatever they want. Just because you have a badge doesn’t make you right.", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "111697741321165592187", "name": "Brandi Roberts", "time": 1576934792929, "rating": 5.0, "text": "Love my new city!!", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "105606172631982902654", "name": "Taylor Roden", "time": 1514999314674, "rating": 1.0, "text": "Called about a neighbor having domestic violence, stayed up for two hours in case they needed to talk to me, eventually went to bed because I didn't want to stay up any longer. Don't know if they ever came.", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "107627520643556162197", "name": "Lindi Pearson", "time": 1526758039567, "rating": 1.0, "text": "I hate everything about Hoover. I used to live there and have moved out because it has gotten so bad. And the police are more of a hindrance than a help.", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "116217101740041719697", "name": "Shun albo", "time": 1370160008428, "rating": 2.0, "text": "I allowed my daughter to attend the Rave in Hoover with friends because it was a good clean place. My daughter and friends were kicked out as they should have been as they were making noise. The problem came in when the management asked the 12 year old girls to leave the property instead of them waiting for their parents to arrive to pick them up around 8 pm at night. I thought this was irresponsible and not very professional. No matter what the issue was the girls should have been looked after a little better until the parents arrived. My daughter was in a state of panic and crying uncontrollable by the time my wife arrived to pick her up. Also, a white Hoover police officer quickly reminded me that I was black in Alabama very quickly as he agreed with the management about kicking the young black girls off of the property @ 8 pm then telling me that I was being a disturbance.. WOW! God Speed is all I got to say. This bad experience happen on 6/1/2013.", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "108776147928649311771", "name": "dewey seymour", "time": 1544107433374, "rating": 1.0, "text": "If the tape showed A black man shooting a police Hoover would release the tape to every tv news", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "107275082901345161735", "name": "Drew Sharpe", "time": 1553547625739, "rating": 5.0, "text": "There’s a reason Hoover is a great place to live!!!!", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "104294551098919214317", "name": "Angela Valentine", "time": 1599700808640, "rating": 5.0, "text": "Thanks😇", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "113758960898751406506", "name": "Treyson Burder", "time": 1416358008029, "rating": 1.0, "text": "hoover gives me a ticket to fix my headlight but messed up the date he gave it to me so now i half topay the fine when i fixed it the day he pulled me over", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "115003561455312122566", "name": "Carl White", "time": 1371753699310, "rating": 2.0, "text": "This is the worst place to vist, its sad to say but its the truth. The only way i go to hoover is if i have no choice, and everybody i know feels this way!!", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "108290060883878376300", "name": "Lorenso Perez", "time": 1378759504674, "rating": 5.0, "text": "(Translated by Google) Agency portal in huwe\n\nr in alabama\n\n(Original)\nAgencia porta en huwe\n\nr en alabama", "pics": null, "resp": null, "gmap_id": "0x8889220ddc9d1911:0x8043aa2bc77db8b9"}
{"user_id": "117525280884621542844", "name": "Bettie Lamar", "time": 1585799287535, "rating": 1.0, "text": "I went to the Police Headquarters on 04/01/2020. First of all it's just common courtesy to speak to a customer. I needed to get 4 different reports for court. Secondly the young lady must have been new. The gentleman that was in front of me complimented what good hair she had and how cute she was. Well my turn finally came around and i said that because she was very slow. I kept saying to the young lady i could not hear her. Why because i do have hearing loss in both my ears. The young lady went and got her supervisor i am assuming that's who she was. She informed me that i had to bring my daughters birth certificate, ok the other person said  i would  get one or two of the copies i needed. Well in the end i left with nothing. The supervisor came out and mouth something again i could not hear her. Its like they refused to speak into the mic. My biggest problem is the supervisor was just rude. She has a very nasty attitude. Somebody help her.", "pics": null, "resp": null, "gmap_id": "0x88891b92529aa485:0xab4ce9ad21518004"}
{"user_id": "106821886955715523280", "name": "Bo Lassalle", "time": 1588947358089, "rating": 1.0, "text": "They will welcome you just remember to wear your mask 😷.... nice 👍 move This really helped things ... And they love ❤️ women .... not !!!!", "pics": null, "resp": null, "gmap_id": "0x88891b92529aa485:0xab4ce9ad21518004"}
{"user_id": "104078294945571303833", "name": "Tambatha Sias", "time": 1583283203367, "rating": 5.0, "text": "Each time I go to pick up reports I get in and out quick. Maybe its the time of day I go but I've never had a waiting issue.", "pics": null, "resp": null, "gmap_id": "0x88891b92529aa485:0xab4ce9ad21518004"}
{"user_id": "112559317598172963609", "name": "Donna Spell", "time": 1561141176101, "rating": 5.0, "text": "Would like to thank one of your finest God sent officers you have.after attending 21 pilots concert last Tuesday June 18.\nMy schizophrenia daughter delusional jumps out of my moving car as we're headed back to Gadsden , forcing me to ditch car in tiny tiny church drive way.god is good.while I run after her miles in the empty streets of Birmingham .till he found us in our situation. Heaven sent .took 45min to find us back to our car .then helps me get her into back child retrant doors. Thank you from the bottom of my heart.\nThat's true service to the people.we are ok thanks to you", "pics": null, "resp": null, "gmap_id": "0x88891b92529aa485:0xab4ce9ad21518004"}
{"user_id": "109627610947285462203", "name": "Roger Keel", "time": 1560423143621, "rating": 5.0, "text": "I own a small business downtown, have dealt with them many times, they’ve always been wonderful.", "pics": null, "resp": null, "gmap_id": "0x88891b92529aa485:0xab4ce9ad21518004"}
{"user_id": "102940799367871026140", "name": "Zen", "time": 1574636673945, "rating": 1.0, "text": "Had me waiting for an hour with no one else in line .to get a document that take 2 minuts", "pics": null, "resp": null, "gmap_id": "0x88891b92529aa485:0xab4ce9ad21518004"}
{"user_id": "108075713013634785229", "name": "Izamar Vazquez", "time": 1576185809773, "rating": 1.0, "text": "Got my phone stolen and filled a report had a video of the incident every detail and they didn’t do anything about it!", "pics": null, "resp": null, "gmap_id": "0x88891b92529aa485:0xab4ce9ad21518004"}
{"user_id": "115391069021668812509", "name": "Cam Mitchell", "time": 1475936111421, "rating": 1.0, "text": "No because i just got pulled over and then came up the car with a attitude", "pics": null, "resp": null, "gmap_id": "0x88891b92529aa485:0xab4ce9ad21518004"}
{"user_id": "116430628610841736137", "name": "Matthew Tackett", "time": 1438115954701, "rating": 3.0, "text": "fantastic", "pics": null, "resp": null, "gmap_id": "0x88891b92529aa485:0xab4ce9ad21518004"}
{"user_id": "103738445435276471273", "name": "Tamika Jones", "time": 1504883432759, "rating": 3.0, "text": "Just found out about Family Tree tracing back to Evergreen, Alabama.  Amazing can't wait to see you Cone-shaped County 😀😄", "pics": null, "resp": null, "gmap_id": "0x88902dbce1809933:0x5591c85f9c4a4687"}
{"user_id": "108333285687161874316", "name": "Art Of Valor", "time": 1570607688975, "rating": 5.0, "text": "These officers are dedicated to serving their city and its residents. Traffic is strictly enforced on the busy state hwy 77. Very helpful, professional and informative police officers.", "pics": null, "resp": null, "gmap_id": "0x888a3a1747d1a337:0x5f6c4beb7a2798da"}
{"user_id": "103689486983816871863", "name": "Jason Morgan", "time": 1483844191705, "rating": 5.0, "text": "Friendly people.  Help when you need it.  Support the blue .", "pics": null, "resp": null, "gmap_id": "0x888a3a1747d1a337:0x5f6c4beb7a2798da"}
{"user_id": "102329790719619431605", "name": "June Clark", "time": 1569265697624, "rating": 1.0, "text": "Call to get a copy of an incident report and they are off the grid in Gadsden. They need to update their system a policies for people living out of state. Get a PDF system or email updated format. Plus a Credit/Debit machine please. Now, that's safety...", "pics": null, "resp": null, "gmap_id": "0x888a3eb06ebaf23d:0x639c869c4ef456c"}
{"user_id": "102873784553806987050", "name": "USA NORTE AMERICA", "time": 1570650704900, "rating": 5.0, "text": "the best police department that I have known all are very friendly help you no matter race color origin very good people God bless", "pics": null, "resp": null, "gmap_id": "0x888a3eb06ebaf23d:0x639c869c4ef456c"}
{"user_id": "115775667651620516731", "name": "Miss La'Heaven Martin", "time": 1501039808838, "rating": 5.0, "text": "All \"police officers\" are not bad..sgt/Ltd morrow not! He has changed my life for the better and im thankful for having him as a uncle and role model..He served 28 yrs in the service too become a legal officer of law enforcement...", "pics": null, "resp": null, "gmap_id": "0x888a3eb06ebaf23d:0x639c869c4ef456c"}
{"user_id": "107969841061117710983", "name": "Eric Hunter", "time": 1499843150775, "rating": 1.0, "text": "KEEP CALM & HIRE SOME MORE CORRUPT COPS", "pics": null, "resp": null, "gmap_id": "0x888a3eb06ebaf23d:0x639c869c4ef456c"}
{"user_id": "108078893417371163113", "name": "Roger Brooks", "time": 1498170175635, "rating": 5.0, "text": "Important place information and communication technology.", "pics": null, "resp": null, "gmap_id": "0x888a3eb06ebaf23d:0x639c869c4ef456c"}
{"user_id": "103151168948975034076", "name": "Evan Jones", "time": 1535829310214, "rating": 1.0, "text": "Total lack of any tact. Just yelled at everyone and wouldn't listen to facts. A complete joke of an officer. H. Wells.", "pics": null, "resp": null, "gmap_id": "0x888a3eb06ebaf23d:0x639c869c4ef456c"}
{"user_id": "114855347717156565691", "name": "Mary and Rylee 64", "time": 1540689373220, "rating": 1.0, "text": "I have always taught my children to respect the police but after the way my family was treated after the death of my 23 year old son i don’t know if I will ever feel the same about law enforcement again.  They were rude to my husband when he went to get car release after they had our car towed.  They refused to do any investigation even though we had legitimate concerns as to what had happened. They acted as if we were second class citizen s when we went to talk to the detective about our sons case the day after he passed he didn’t even have the decency to have his notes so that he could give us accurate information to our questions. He kept saying his notes were upstairs and when he was asked if he wanted to get them he didn’t want to.  He had several hours to make sure he was ready before we came and yet he didn’t feel it was necessary to have his notes.  He was wrong on several things we asked because he wasn’t prepared.  I could go on and on about how terrible our experience was.  He absolutely could have cared a less about our son and our devastating loss. We have just recently received the coroner s report which only raises more questions,  and my husband has called him and he has yet to return his call.  We loved our son very much and just want to know what really happened but the Homewood police have no interest in helping us.", "pics": null, "resp": null, "gmap_id": "0x8889197b0def99b5:0x9d646d97677607c2"}
{"user_id": "116956283730418606976", "name": "kelley moore", "time": 1534510172735, "rating": 5.0, "text": "I was a witness to a wreck on lakeshore and the officer that responded was super nice and thorough but quick. He arrived to the scene in under 5 minutes, had the car towed and us out of there in less than a 1/2 hour. I was very impressed with his professionalism with all parties. Props to this PD for a job well done.", "pics": null, "resp": null, "gmap_id": "0x8889197b0def99b5:0x9d646d97677607c2"}
{"user_id": "112408858498333947081", "name": "Terry Hopson", "time": 1565186714703, "rating": 5.0, "text": "Thanks for y'all good service have a great and blessed day today", "pics": null, "resp": null, "gmap_id": "0x8889197b0def99b5:0x9d646d97677607c2"}
{"user_id": "100948918289279938355", "name": "Bagby Hall", "time": 1495649980682, "rating": 5.0, "text": "Had a burglary at my home in the middle of the afternoon and the HPD was there in 5 minutes. The officer was very honest with me and super helpful. The office phone etiquette was gruff but I'll take that any day if I have good cops doing the right thing and taking great pride in their service. Thank you Homewood PD!", "pics": null, "resp": null, "gmap_id": "0x8889197b0def99b5:0x9d646d97677607c2"}
{"user_id": "117832370444382689801", "name": "Acinok Acinok", "time": 1520268309821, "rating": 1.0, "text": "My husband and I was looking at a home for rent, near the Hall Kent Elementary School, where my daughter attends.Two cops pull up on us, one was nice and the other one was very rude and mean. They ask what we was doing, we explained we was looking at the home it was for rent. The rude cop stated that just cause the sign said for rent we shouldn’t be on the property.. I was like, I never heard of that before. He proceeded to ask for ID. We started to walk to the car, where the ID was located, he hollered at us and told us to stop walking he put his hand on his gun. And ask where we going. We stated the ID’s are in the car. He check my husband ID but not mine. The other cop stated there was burglaries in the area, when I ask him what was the cause for all this, I ask him was it because we are black. The lady across the street was telling them we was just looking at the house. They eventually let us go...I have never been so upset and discriminated in my life. My husband and kids live in the Homewood area. In this is just sad, not all black people are criminals....", "pics": null, "resp": null, "gmap_id": "0x8889197b0def99b5:0x9d646d97677607c2"}
{"user_id": "110156811049658285979", "name": "Bark Bark", "time": 1549562664917, "rating": 3.0, "text": "On 01-31-19 I called the detective division and left messages to call me. I even called  dispatch to see if any detective was working and was told to call another number which I did and left a message with my contact information.I called again on 02-01-19 and left messages again. Does anyone at this department answer a phone or have the courtesy to at least call back? I am still waiting after more than 24 hours! Update: A few days after posting this reveiw, I did get a call back and the detective was helpful. I just found it frustrating how hard it is to get a hold of anyone at this department. I will add a couple of stars.", "pics": null, "resp": null, "gmap_id": "0x8889197b0def99b5:0x9d646d97677607c2"}
{"user_id": "102746982691423821026", "name": "Bradley Gilbert", "time": 1544487610779, "rating": 5.0, "text": "Homewood Police officers are cut from a different cloth. They are kind and courteous and are steadfast in their professionalism.", "pics": null, "resp": null, "gmap_id": "0x8889197b0def99b5:0x9d646d97677607c2"}
{"user_id": "102589325795058661892", "name": "Chriztofer Bonkerz", "time": 1532277310080, "rating": 1.0, "text": "I have dashcam footage of a Homewood police officer unit #464 running cars off the road in Pelham. No lights no sirens if that is an excuse anyway and got off Pelham Helena exit. This is pure example of cops doing whatever they want with zero cares. Unit 464 needs to drive the way he wants others to drive. Safe and following laws. 100% they would have pulled over any other vehicle doing the same thing.", "pics": null, "resp": null, "gmap_id": "0x8889197b0def99b5:0x9d646d97677607c2"}
{"user_id": "106895494635108954052", "name": "Matthew Oliver", "time": 1503866763274, "rating": 1.0, "text": "Omniscient and all seeing eyes here, infallible judgement & best of all, pro ginger", "pics": null, "resp": null, "gmap_id": "0x8889197b0def99b5:0x9d646d97677607c2"}
{"user_id": "104030787542289085438", "name": "Lamhro", "time": 1532035823562, "rating": 1.0, "text": "Its sad to have a department that represents the community like this. They are rude and are harassing civilians.", "pics": null, "resp": null, "gmap_id": "0x8889197b0def99b5:0x9d646d97677607c2"}
{"user_id": "109706557153502318047", "name": "Geneva Bedell", "time": 1529292906588, "rating": 5.0, "text": "Great department  patrols and keep  us.safe", "pics": null, "resp": null, "gmap_id": "0x8889197b0def99b5:0x9d646d97677607c2"}
{"user_id": "104132762947247988698", "name": "TM Flemons", "time": 1477949047481, "rating": 3.0, "text": "Ok", "pics": null, "resp": null, "gmap_id": "0x8889197b0def99b5:0x9d646d97677607c2"}
{"user_id": "102725896242949205947", "name": "wolf", "time": 1499673664663, "rating": 5.0, "text": "Great Police Department The Officers are always professional.", "pics": null, "resp": null, "gmap_id": "0x888ed20859f20c77:0x53b7a2b94dbb99e9"}
{"user_id": "106241194028973667011", "name": "Dylan Wilton", "time": 1570315079016, "rating": 5.0, "text": "I have had several run ins with the Troy police. They have been polite and professional everytime even on occasions when I am being pulled over. Honestly my favorite police station that I've had the pleasure of interacting with.", "pics": null, "resp": null, "gmap_id": "0x888decf658e9e305:0x5f2aededc11e289d"}
{"user_id": "115409020206731660428", "name": "Kim Fields", "time": 1530971387509, "rating": 5.0, "text": "Officer Jenkins and officer Kirkland were the first on scene after a pretty serious accident with myself, my adult son, his wife and my granddaughter. They were kind and courteous and brought me to the hospital we to see how the kids were doing   They came to check on us and then since we were from out of town they helped us find a hotel at 4am and drove us to it.  My granddaughter was not traumatized at all and it was greatly due to officer Jenkins. She had lost her shoes in the accident and he toyed her around so she wouldn’t have to walk barefoot. Jenkins was the epitome of what a police officer should be.", "pics": null, "resp": null, "gmap_id": "0x888decf658e9e305:0x5f2aededc11e289d"}
{"user_id": "117501070729017081216", "name": "Ben Hutsler", "time": 1504942271372, "rating": 5.0, "text": "After having a traffic jam and a disappointing phone call with a police officer in Ozark about the traffic issues due to Hurricane Irma evacuation, imagine my surprise when I got up to Troy and there were 4 or 5 police cars and officers out directing traffic on Hwy 231 and there were even people controlling the lights to help move traffic through more quickly.  Great job Troy! You can teach your fellow officers in Ozark a thing or two!", "pics": null, "resp": null, "gmap_id": "0x888decf658e9e305:0x5f2aededc11e289d"}
{"user_id": "114380946952760382847", "name": "John Carlson", "time": 1514617794307, "rating": 5.0, "text": "We are living in divisive times. People are quick to take sides to either condemn or support before receiving all of the facts. Jesus tells us those who condemn will be condemned those who judge will be judged but those who forgive will be forgiven. Since I don’t want to be either judged nor condemned   I just want to say a prayer for all those personally affected by this event that has affected both families. Lord you are a loving and merciful God. I ask you to pour out your love and comfort both sides. Lord lead them to common ground. For we are all created in Your image. Jesus you died on that cross colored blind. You died that none shall perish but have everlasting life through accepting You as our Lord and Savior. Father pour out Your peace upon this community unite us don’t let the wicked divide and conquer Your children. We are all part of the Human Race though I sometimes fall short because I am human I pray Father you will forgive me. I am so thankful Jesus that you are long suffering and not quick to judgement though we deserve punishment for our sins You Father show us mercy. Father forgive them take away their anger and replace it with compassion. Lord protect these brave man and women who choose to put on the uniform everyday to protect and serve us. Give them wisdom and courage to make these split second decisions that mean the difference between life or death. Father I trust in you that you will bring comfort and peace for both families involved. I pray for the day for people to start walking in other shoes before they cast stones. A sign of a failing church is a failing community. The church is not the building people go to for a hour on Sunday the church is the temple and the temple are the people who profess to know and follow Jesus Christ as their Lord and Savior. Today instead of spreading more hatred try truly Loving your neighbor Be Blessed and Amen. From the Spirit of God the Holy Spirit", "pics": null, "resp": null, "gmap_id": "0x888decf658e9e305:0x5f2aededc11e289d"}
{"user_id": "103172594637895783473", "name": "Toni Ridge Me Time LLC", "time": 1539118545639, "rating": 5.0, "text": "Everyone I've met there has been so nice! I'm glad we have a caring and kind police department full of hard working folks!", "pics": null, "resp": null, "gmap_id": "0x888decf658e9e305:0x5f2aededc11e289d"}
{"user_id": "117362851536368838428", "name": "Joseph Norman", "time": 1509181229797, "rating": 5.0, "text": "Lovely city.\nWonderful people.\nThis city is color-blind.\nWhen I was there, I was treated with respect and dignity..😉😉😊😊🤗", "pics": null, "resp": null, "gmap_id": "0x888decf658e9e305:0x5f2aededc11e289d"}
{"user_id": "105622191464468826312", "name": "This is Jesse", "time": 1514518347509, "rating": 5.0, "text": "Great police department, always getting the job done. I salute your men and woman for a job well done.", "pics": null, "resp": null, "gmap_id": "0x888decf658e9e305:0x5f2aededc11e289d"}
{"user_id": "102700143555643470314", "name": "Terrie Lassiter Gowan", "time": 1546716706796, "rating": 5.0, "text": "The officer helpme open my car thanks a lot. We at Wal-Mart in Troy on row 8 and he came quick ..and fast to open the door thanks", "pics": null, "resp": null, "gmap_id": "0x888decf658e9e305:0x5f2aededc11e289d"}
{"user_id": "104335130195857236704", "name": "Corey Wambles", "time": 1554821102487, "rating": 5.0, "text": "Keep up the good work!", "pics": null, "resp": null, "gmap_id": "0x888decf658e9e305:0x5f2aededc11e289d"}
{"user_id": "109954015419221209459", "name": "Tommy Wheeler", "time": 1514640665445, "rating": 1.0, "text": "The citizens DEMAND dash cam and body cam video NOW! The people of Alabama need to RISE in PEACEFUL protest and do not stop until there is justice.", "pics": null, "resp": null, "gmap_id": "0x888decf658e9e305:0x5f2aededc11e289d"}
{"user_id": "115043315621285466277", "name": "Emily Farmer", "time": 1524098643257, "rating": 1.0, "text": "Called about some lost dogs with collars and the lady just shrugged it off and said animal control was “off duty.” Are you understaffed? That’s really bad for a police station.", "pics": null, "resp": null, "gmap_id": "0x888decf658e9e305:0x5f2aededc11e289d"}
{"user_id": "113522781926826047245", "name": "Brent O'Connor", "time": 1514506853056, "rating": 1.0, "text": "When I was there I was handcuffed and beaten nearly to death..........", "pics": null, "resp": null, "gmap_id": "0x888decf658e9e305:0x5f2aededc11e289d"}
{"user_id": "110822727790625505182", "name": "kacie lane", "time": 1563536416986, "rating": 1.0, "text": "Racist", "pics": null, "resp": null, "gmap_id": "0x888decf658e9e305:0x5f2aededc11e289d"}
{"user_id": "105172396174848322471", "name": "Timothy Jackson", "time": 1514564368467, "rating": 1.0, "text": "Cowards..", "pics": null, "resp": null, "gmap_id": "0x888decf658e9e305:0x5f2aededc11e289d"}
{"user_id": "100175924095218852348", "name": "Debbie Alford", "time": 1505384560500, "rating": 5.0, "text": "Thank you for your professionalism!!!!", "pics": null, "resp": null, "gmap_id": "0x888decf658e9e305:0x5f2aededc11e289d"}
{"user_id": "117451733717408040961", "name": "Bridgette Carnley", "time": 1514863564333, "rating": 1.0, "text": "Not good", "pics": null, "resp": null, "gmap_id": "0x888decf658e9e305:0x5f2aededc11e289d"}
{"user_id": "115909212209690291806", "name": "Shael espaillat", "time": 1514444325163, "rating": 1.0, "text": "They beat black people\nThey are racist scum of the earth", "pics": null, "resp": null, "gmap_id": "0x888decf658e9e305:0x5f2aededc11e289d"}
{"user_id": "116366214515934036861", "name": "Justin Kim", "time": 1514407643957, "rating": 1.0, "text": "Go look at Ulysses wikersons face.", "pics": null, "resp": null, "gmap_id": "0x888decf658e9e305:0x5f2aededc11e289d"}
{"user_id": "107811843898030150947", "name": "Ann Wood", "time": 1602739922195, "rating": 5.0, "text": "I was in an accident and these police officers were so professional, helpful and kind. They are the best.", "pics": null, "resp": null, "gmap_id": "0x889a0bdfbe46864d:0xa26a7c5481bfa63f"}
{"user_id": "111659191304811028894", "name": "MrJonugget", "time": 1591746260786, "rating": 1.0, "text": "I called the Department of Public Health to inform them that we had just left a business, that is supposed to be at 50% capacity, but were totally ignoring the Covid-19 guidelines that they had posted everywhere. After explaining what we had experienced, I was told that this business was absolutely in violation and could be fined or even shut down. They advised me to call the local law enforcement, which is Foley Police Department. When I called, the lady who answered the phones informed me that all of the Covid-19 guidelines put forth by the governor, were merely suggestions. Obviously  the almighty dollar is more important than everyone’s health. Thanks so much for your help, Foley PD!", "pics": null, "resp": null, "gmap_id": "0x889a0bdfbe46864d:0xa26a7c5481bfa63f"}
{"user_id": "117799273793683767359", "name": "J", "time": 1566167087561, "rating": 5.0, "text": "Witnessed a minor car accident today. Called Amy at the PD; she was very alert, attentive and kind in taking the info for the call. An officer arrived in 12 minutes and instructed both the members involved how to proceed. Everyone was safe and calm. Thank you Foley PD for your service!", "pics": null, "resp": null, "gmap_id": "0x889a0bdfbe46864d:0xa26a7c5481bfa63f"}
{"user_id": "103733386563679037662", "name": "Chris Hoonbag", "time": 1598139422033, "rating": 1.0, "text": "Kids hang out in the academy parking lot with loud radios and bad language coming out of radios, I do not recommend shopping here. Police department said they could not do anything. This is\nMy last vacation here.", "pics": null, "resp": null, "gmap_id": "0x889a0bdfbe46864d:0xa26a7c5481bfa63f"}
{"user_id": "103182040948510353171", "name": "Gail Wins", "time": 1588157380622, "rating": 5.0, "text": "The FOLEY FORCE,  just AWESOME 🇺🇸", "pics": null, "resp": null, "gmap_id": "0x889a0bdfbe46864d:0xa26a7c5481bfa63f"}
{"user_id": "104611517392606409333", "name": "Ricky Howard", "time": 1560766916263, "rating": 5.0, "text": "These officers deserve and WILL get respect. Shout out to my fav peeps😄 thanks for the serve and protect men and women in blue!", "pics": null, "resp": null, "gmap_id": "0x889a0bdfbe46864d:0xa26a7c5481bfa63f"}
{"user_id": "104650074200748157122", "name": "Kayleigh Wilson", "time": 1590447476450, "rating": 5.0, "text": "Extremely fast, friendly and professional!! Thank you Foley PD!!", "pics": null, "resp": null, "gmap_id": "0x889a0bdfbe46864d:0xa26a7c5481bfa63f"}
{"user_id": "107777898807619487692", "name": "Debra Dixon", "time": 1564341322480, "rating": 5.0, "text": "I work in Orange Beach Alabama and get off on exit 49 at the Buc-ee's to go to work 5 days a week. The exit is almost always backed up but never have I seen anybody sit on the shoulder of the road in a line waiting to get off the exit. There was as least 10 cars on the shoulder of the road before we even came upon the exit. I wasnt sure what was going on, I thought maybe there was a wreck so I continued to slow down until I saw the exit lane appear and when I did I turned on my blinker so I could get over. I saw an officer in a police truck with Owens Cross Roads on the side and assumed the police would surely let me over. I continued inching slowly to the right with my blinker on and the police officer pushed forcefully up so I couldnt get over and then rolled down his window and started yelling at me, \"you better watch where you're going.\" I am in shock at how disrespectful and rude you're police officer acted when a car is simply trying to get over in a correct and legal manner. I can't believe your police officer would rather have a car sit at a halt on I10 blocking traffic than let them over. Chivalry is surely dead.\n*I posted this on the Owens Cross Roads police department page as well but thought I should post here also so the Foley police department is aware that people are now using the shoulder as a new turning lane. I have not had any problems with the Foley police department. *", "pics": null, "resp": null, "gmap_id": "0x889a0bdfbe46864d:0xa26a7c5481bfa63f"}
{"user_id": "116987898473313041978", "name": "Noah Longshore (Cooljerk69atgmail)", "time": 1486522293139, "rating": 5.0, "text": "Decent people work here..give respect to get it", "pics": null, "resp": null, "gmap_id": "0x889a0bdfbe46864d:0xa26a7c5481bfa63f"}
{"user_id": "106661301735559142860", "name": "Natasha Phillips", "time": 1535877955504, "rating": 5.0, "text": "Everyone was very nice.", "pics": null, "resp": null, "gmap_id": "0x889a0bdfbe46864d:0xa26a7c5481bfa63f"}
{"user_id": "100665965008898744223", "name": "Chris Uptagrafft", "time": 1536595387139, "rating": 5.0, "text": "Blue lives matter", "pics": null, "resp": null, "gmap_id": "0x889a0bdfbe46864d:0xa26a7c5481bfa63f"}
{"user_id": "101024238584605769557", "name": "Brian R", "time": 1450172745514, "rating": 5.0, "text": "Responded very quickly & helped with my mother's wreck. Thank you", "pics": null, "resp": null, "gmap_id": "0x889a0bdfbe46864d:0xa26a7c5481bfa63f"}
{"user_id": "105041316939843263868", "name": "SL Studios", "time": 1574957924089, "rating": 5.0, "text": "Amazing officers very friendly and well trained, Office Hard one day was out patrolling and saw me shooting basketball outside and he stopped and shot with me for a little while and he’s done that a few more times since he is very nice and well trained", "pics": null, "resp": null, "gmap_id": "0x888a1cd15ec466d5:0xd32ccd7cc2300ab3"}
{"user_id": "109497804078006590357", "name": "Stacey Vandergriff", "time": 1561211042672, "rating": 5.0, "text": "I just let the Chief know how proud I was of Sgt. Morgan. I do not know him but he was called to my house on Friday 6/21. We had an incident and my mom called you guys. It's been a very tough time for my family and I . We lost my dad suddenly 4 months ago yesterday. My mom was very upset and so was I. But he never once made us feel like we shouldn't have called. Instead he showed extreme compassion, understanding and explained everything to us. He will never know how much that meant to us. I applaud Sgt. Morgan and your whole department. Chief you're doing something right.\nGod bless each and every one of you....thank you for your service.\nStacey Vandergriff", "pics": null, "resp": null, "gmap_id": "0x888a1cd15ec466d5:0xd32ccd7cc2300ab3"}
{"user_id": "116233651757463573141", "name": "Doug Tucker", "time": 1579092424395, "rating": 5.0, "text": "My experience has always been very positive. Very professional and helpful.", "pics": null, "resp": null, "gmap_id": "0x888a1cd15ec466d5:0xd32ccd7cc2300ab3"}
{"user_id": "102152862732602396727", "name": "Mike Smith", "time": 1523822923948, "rating": 5.0, "text": "Albertvilles police force has an excellent reputation in the area for being well trained and protecting the citizens. They have always been polite anytime I have interacted with them which has been often over 35 years living here. If all police forces were like ours the US would be a better place.", "pics": null, "resp": null, "gmap_id": "0x888a1cd15ec466d5:0xd32ccd7cc2300ab3"}
{"user_id": "108333285687161874316", "name": "Art Of Valor", "time": 1524853526763, "rating": 5.0, "text": "Some of the finest police officers I've ever met are employed here. Very friendly and professional. This is a great career opportunity for anyone interested in getting into law enforcement. These offices do so much for the community that they serve.", "pics": null, "resp": null, "gmap_id": "0x888a1cd15ec466d5:0xd32ccd7cc2300ab3"}
{"user_id": "109673889469334318803", "name": "Christopher Sheeler", "time": 1538604258836, "rating": 1.0, "text": "Most useless and rude police department ever... I had a Semi truck abandoned 4 miles away from their office. I explained there might be theft involved. The officer went over, knocked on the door and left. They never called back. Then 5 hours later, I called them and all they could tell me is there was no driver inside. Was the trailer secure? I don't know... Were the tires missing? I don't know.. Was the door unlocked? I don't know. Completely useless!", "pics": null, "resp": null, "gmap_id": "0x888a1cd15ec466d5:0xd32ccd7cc2300ab3"}
{"user_id": "116531930781576955393", "name": "Ice Chillin", "time": 1535900427880, "rating": 2.0, "text": "hanged up on me", "pics": null, "resp": null, "gmap_id": "0x888a1cd15ec466d5:0xd32ccd7cc2300ab3"}
{"user_id": "106424946457269809013", "name": "Jackie Thomas Rice", "time": 1464314491087, "rating": 1.0, "text": "Was looking for names of officers", "pics": null, "resp": null, "gmap_id": "0x888a1cd15ec466d5:0xd32ccd7cc2300ab3"}
