{"user_id": "101813243907080488371", "name": "Rahim Valliani", "time": 1602125839792, "rating": 1.0, "text": "Do not hire this company to install pool liner\ndid a horrible job installing pool liners left all the wrinkles in the liner\n\nOkay I will give you one  opportunity to fix it, if i am satisfied with your work I will remove my comments. But do it during morning time\n\nRegarding your shop vac, u cannot leave a loud machine running through the night in a neighborhood.  So leave it on during day & nobody will stop u.", "pics": null, "resp": {"time": 1602105512796, "text": "Hi Rahim, we are sorry to hear that you feel this way. We have had a number of a successful and wrinkle free liner installations.  Unfortunately, you went against our professional advice about leaving the shop vac in the pool to prevent wrinkles. We advised you that was for the purpose of keeping wrinkles away but you chose to have it removed. We offered to come back to your house and let us remove the wrinkles but you refused and did not want us to return.  You did not give us an opportunity to fix your issue.\nThe offer still stands to come back and remove the wrinkles if you are willing. Thank you."}, "gmap_id": "0x888923ced4902a31:0x670cdc0ce3d770ff"}
{"user_id": "107193490606007948724", "name": "Helen", "time": 1619828228244, "rating": 1.0, "text": "They do not respond  to e-mails\nFill the form out on your website two times I was assuming that meant it sent you an email if not you need to talk to your website person and get this fixed", "pics": null, "resp": {"time": 1619826890658, "text": "Hi Helen! Sorry to hear that but I checked and we don’t have an email from you. Please try again. Thanks!"}, "gmap_id": "0x888923ced4902a31:0x670cdc0ce3d770ff"}
{"user_id": "112285096139985250377", "name": "Artley Young", "time": 1591402541324, "rating": 5.0, "text": "Backyard Pool Service did a wonderful job on my pool! They were very professional and responsive to any questions I had! My pool looks great and very ready for the summer parties! We would definitely recommend to anyone with a pool!", "pics": null, "resp": null, "gmap_id": "0x888923ced4902a31:0x670cdc0ce3d770ff"}
{"user_id": "100557424579057756268", "name": "Adde Rego", "time": 1591376219873, "rating": 5.0, "text": "Awesome owner and employees! They get the job done right and on time. Highly recommended above all other pool companies.", "pics": null, "resp": null, "gmap_id": "0x888923ced4902a31:0x670cdc0ce3d770ff"}
{"user_id": "115145029074759770284", "name": "Leighanne Davis", "time": 1594847254102, "rating": 2.0, "text": "Did not meet expectations.", "pics": null, "resp": null, "gmap_id": "0x888923ced4902a31:0x670cdc0ce3d770ff"}
{"user_id": "105370637472981511851", "name": "Kelly Kiernan", "time": 1618485742841, "rating": 5.0, "text": "Had my skimmers and pool liner replaced. They did an excellent job and went out of the way to make sure I was satisfied with the job. Recommend them to my friends and they had the same outcome. Great!", "pics": null, "resp": null, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "116834028412069615371", "name": "Ralph Ekonen", "time": 1618432942995, "rating": 5.0, "text": "ASP replaced my liner in half the time they told me it would take.  Communication was excellent, service was excellent and prices were comparable.  I would definitely recommend this company.", "pics": null, "resp": null, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "100266137714461124871", "name": "Lori Rasmussen", "time": 1596165126516, "rating": 5.0, "text": "Great company!! I was so impressed by their team’s responsiveness and honesty. Brad and Terrell provided outstanding customer service and were so helpful. Cannot say enough great things. I will definitely use them in the future!!", "pics": null, "resp": {"time": 1598818126134, "text": "Thank you Lori. We appreciate your business and your and Reid's service to our country."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "116500337693487021930", "name": "Linda Mcintyre", "time": 1598817935509, "rating": 5.0, "text": "ASP has done a wonderful job resurfacing my gunite pool!  They were punctual and professional and did everything they said they would do and more!  Brad was especially helpful in answering questions and in providing immediate help with any concerns!", "pics": null, "resp": {"time": 1598818051489, "text": "Thank you so much Mrs. McIntyre. It was and is a pleasure working for you. BC"}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "106707431196780497033", "name": "julia armstrong", "time": 1583882004698, "rating": 5.0, "text": "ASP recently replaced my pool's sand filter, pump, salt cell, rerouted my backwash hose, and cleaned my pool.  I am very pleased with the work, as well as the friendliness and professionalism of Brad and his team. ASP did an excellent job, used quality parts, and were on schedule. I feel like I received my money's worth. I will call on them in the future.", "pics": null, "resp": {"time": 1598818148605, "text": "Thank you Julia. We really appreciate your business."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "111101825950272554607", "name": "Stephanie Starr", "time": 1565719974970, "rating": 5.0, "text": "I have hired several local pool companies over the years and have experienced at best mediocre pool service / cleaning. I finally hired ASP - America’s Swimming Pool and I can say this is a top notch company that cares about their customers and does what they say they will do.\n\nI have told the owner several times that he needs to keep hold of Abel Rios. I am in the kitchen most times that he comes and have watched him. He does every single thing you have paid for regardless if it needs to be done or if he could easily skip that step without you knowing.  He does all of it...every single time he comes. I never question if he has been at the house to clean the pool. And he always takes pictures of the pool after servicing and sends them to you through email.\n\nI have had other pool companies where I have questioned did they really do anything...for several months. I kept missing them when they were here. I finally was home and saw the guy literally walk in the back yard ...toss in a chlorine tab in the skimmer basket..come to my front door and leave the card stating he has been here and did this and that...which he had done none of. He didn’t even empty the skimmer basket. Upon calling the owner ...he gave the excuse of “ Well, he’s a big guy and doesn’t like to get down on his knees”. Unbelievable.\n\nI highly recommend ASP. The service you will receive is worth every single penny.", "pics": null, "resp": {"time": 1598818580851, "text": "Thank you Stephanie. We appreciate you."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "100580303245632591854", "name": "Heather T", "time": 1591808949390, "rating": 5.0, "text": "I love this company and trust the owner! Great and prompt service. If you need anything pool related give them a call.", "pics": null, "resp": {"time": 1591823376542, "text": "Thank you so much!"}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "116951742121392216569", "name": "Laquita king", "time": 1581689159326, "rating": 5.0, "text": "Brad and his team are professionals, it was a pleasure working with them. ASP does an excellent job, are always punctual.  ASP did my property pool re plaster and it looks amazing! I highly recommend ASP.", "pics": null, "resp": {"time": 1598818178327, "text": "Thank you Mrs. King. It's been an honor to work for y'all."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "102945179231462588273", "name": "Adrienne Henderson", "time": 1598705909043, "rating": 5.0, "text": "The guys came out and did an amazing job!", "pics": null, "resp": {"time": 1598818086048, "text": "Thank you Mrs. Henderson. You are a very kind person."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "106238085012205506899", "name": "Melanie Whitaker", "time": 1565737771745, "rating": 5.0, "text": "I am so happy I hired ASP.  It is so worth the money.  I never have to worry about a green pool anymore.  Abel Rios is the best!  I get a report and picture every week.  The few times I have had issues, all weather related, he has come here promptly and fixed the problem.  ASP cannot be beat.", "pics": null, "resp": {"time": 1598818554256, "text": "Thank you Melanie. We appreciate your business."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "107707065668562118103", "name": "Marquita Hunter", "time": 1559620747543, "rating": 5.0, "text": "The service with ASP is awesome. Brad went above and beyond (having to come out 2 separate days back to back) to install a new pump and make sure our pool was completely clean and algae free just 2 days before we were having a birthday for my daughter. He made sure i was satisfied before he left.", "pics": null, "resp": {"time": 1598818765067, "text": "Thank you Mrs. Hunter. We really are thankful for your trust in us."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "109288249169613317102", "name": "Dana Wilson", "time": 1599961970382, "rating": 5.0, "text": "This business owner is aware of customer satisfaction and serves the Troy area, so we were fortunate after terrible service experiences, to have them come summarize our pool and bow maintenance it. We kove ASP!!", "pics": null, "resp": null, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "101938982094107854940", "name": "Kris Yancy", "time": 1563376584064, "rating": 5.0, "text": "Brad and his team are great to work with. Good prices and prompt service. They cleaned up my pool and helped this new pool owner understand what she was doing.", "pics": null, "resp": {"time": 1598818677845, "text": "Thank you Kris. Let us know if you ever need us."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "107029744946197170741", "name": "Jennifer Akridge", "time": 1565962275475, "rating": 5.0, "text": "We have been using ASP for many years for our business pool.  Joe is a pleasure to work with and goes over the call of duty every day.  He is always on time and makes sure our pool is resort ready every day.   If you are in need of pool service for your personal or business pools, call ASP.", "pics": null, "resp": {"time": 1598818481451, "text": "Thank you Jennifer. You are the best."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "104490062270823252278", "name": "Christina Wilkins", "time": 1565394709798, "rating": 5.0, "text": "Brad and his team are the greatest!! The service is excellent and timely Brad goes out of his way to take care of any pool problems I have. He treats you like family honest and good prices.. Thank you Brad", "pics": null, "resp": {"time": 1598818625839, "text": "Thank you Christina! We appreciate y'all."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "105448225038218642755", "name": "Kathy Weimar", "time": 1565891294648, "rating": 5.0, "text": "We love ASP and the consistently great service we get each week from Abel Rios. He's thorough, friendly, and knowledgeable whenever we have a question. With each service visit, we receive a written report with what chemicals were added and other important info. Highly recommend!", "pics": null, "resp": {"time": 1598818506589, "text": "Thank you Kathy. It's a pleasure working for y'all."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "112683265491532944767", "name": "Tom Burge", "time": 1566067663262, "rating": 5.0, "text": "I have used ASP ever since they came to Montgomery and have always found their work to be outstanding.  Our current service professional, Abel Rios does a wonderful job at maintaining our pool in tip-top shape.", "pics": null, "resp": {"time": 1598818463807, "text": "Thank you Tom. We appreciate your loyalty and trust."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "114244957695205898059", "name": "Debbie Miller", "time": 1551888151870, "rating": 5.0, "text": "We have been using ASP of Montgomery for 4 years for weekly service. This is a VERY PROFESSIONAL pool company. Brad is by far the BEST pool person around!! He has gone above and beyond for our family. Brad is a Christian and truly cares about his customers and would do ANYTHING to help them. His employees are very kind and do a wonderful job. Thanks Brad Cole and Staff!!  ASP of Montgomery Voted #1", "pics": null, "resp": {"time": 1598818860424, "text": "Thank you Debbie. It is an honor to help with your pool."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "100376140841474171513", "name": "Ashley Spisak", "time": 1553714063515, "rating": 5.0, "text": "Brad came out to do an inspection on our pool and he was wonderful! He was knowledgeable and did a great job explaining things to me and addressing all my concerns and questions. We will definitely use them again for our pool needs!!", "pics": null, "resp": {"time": 1598818839131, "text": "Thank you Ashley.It was our pleasure. Please advise if you ever need us."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "103686854723317246670", "name": "Shakelya McKinney", "time": 1522419610907, "rating": 5.0, "text": "Brad has been the most helpful in any pool service that I have received. He was very professional, kind, and warm hearted. Brad explained every detail thoroughly and step by step. The service was unbelievably fast! If i have any more pool trouble, I definitely won’t hesitate to call Brad and his ASP team. I fully recommend this company!!!!\n🤩🤩🤩🤩🤩", "pics": null, "resp": {"time": 1598819437985, "text": "Thank you Mrs. McKinney for such a thoughtful review. You are a very kind person."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "101948344833145752540", "name": "Shannon Trotter", "time": 1528984482894, "rating": 5.0, "text": "The guys at ASP have been great!! Brad is awesome! They helped us get an old run down pool back up in tip top shape! We switched to salt water, had broken line repairs, & all around great service!! ASP is definitely a great pool company & I highly recommend them!", "pics": null, "resp": {"time": 1598819260531, "text": "Thank you Shannon. It's been our pleasure."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "117463136122792205325", "name": "Eva Roberts", "time": 1559867343940, "rating": 5.0, "text": "I had to go through a surgery and my old maintenance pool person disappeared during that time so I wasn’t able to maintain it through the winter.  A lot of frogs and green.  After the surgery within 2 weeks ASP not only got the pool clean without having to drain it, they took me through the steps on how to maintain it.  The staff was always courteous, professional, patient and friendly.   Their services dial it up to 11 and I will be sticking with them.", "pics": null, "resp": {"time": 1598818700464, "text": "Thank you Eva. You are a great customer."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "101503134333014049175", "name": "Clifford Lanier", "time": 1503939364311, "rating": 5.0, "text": "This is a very professional outfit that does outstanding work. Brad and his team truly care about customer satisfaction. One of Brad's excellent employees, Abel Rios, found a valuable gold bracelet at the bottom of our pool. He immediately turned it over to Brad to get back to me. Just how many pool cleaning outfits would have done the same? I doubt many. That speaks to Abel's character of course but also to the character of the company he works for.  Hire them you won't regret it. -Cliff", "pics": null, "resp": null, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "100352696088602232659", "name": "Tomika Owens", "time": 1522944815046, "rating": 5.0, "text": "Brad is absolutely awesome!!!! It is refreshing to get excellent customer service, professionalism, and compassion. He was truly helpful in addressing all of my concerns and went above and beyond to make sure that I was taken care of. I trust ASP with all of my pool needs and look forward to many years of service from them.", "pics": null, "resp": {"time": 1598819394904, "text": "Thank you Tomika. You are definitely one of the nicest people to work for."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "117843637133273861941", "name": "Miriam Perry", "time": 1566436077484, "rating": 5.0, "text": "The young man who services my pool is punctual, does not disturb me and the water is sparkling clear when finished.  I would recommend this company without hesitation.   His name is Maaliq Williams", "pics": null, "resp": {"time": 1598818421763, "text": "Thank you Mrs. Perry. It's an honor to care for your pool."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "104206017153936219165", "name": "B Mc", "time": 1528994809343, "rating": 5.0, "text": "We used ASP since the beginning after we purchased a house with a large pool and have no complaints. I recommend this company to anyone who needs monthly maintenance or repair services to their pool. Always very prompt and, whenever an emergency arrived, we received quick turnaround of someone coming out to take care of it.", "pics": null, "resp": {"time": 1598819169596, "text": "Thank you so much!"}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "109399194176660568273", "name": "John Lee", "time": 1566560345561, "rating": 5.0, "text": "Brad and his team do a great job! Joe Peacock in particular is fantastic. Great work, on time and at great value", "pics": null, "resp": {"time": 1598818395131, "text": "Thank you John. We appreciate your business."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "101678740804015348839", "name": "May Jennings", "time": 1452190719831, "rating": 5.0, "text": "We finally found ASP and were glad we did. We now live out of town and rely on ASP to take care of all of our pool needs. I can call or text Brad with any concerns and he takes care of it promptly. Brad is quick to call me if he feels the pool equipment needs maintenance. Brad, Eric and the rest of the team work hard to keep our pool looking good for potential buyers. I know that I can trust them with our pool. In addition, Brad and Eric work with us to keep our costs down.", "pics": null, "resp": null, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "105626200148985153731", "name": "Dara McGonigle", "time": 1345858504262, "rating": 5.0, "text": "I highly recommend ASP.  Brad was terrific.  We needed a pool pump and liner replaced and we're out of towners (property is in Montgomery).  Brad coordinated everything.  Getting information and pictures was very important to us not being about to see what was going on.  Brad was very helpful and took care of everything.  We were quick to build trust based on his great attitude and responsiveness.  I'd recommend their service to everyone!", "pics": null, "resp": null, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "114479014566210665313", "name": "Nicole Pastika", "time": 1554638167105, "rating": 5.0, "text": "Brad came out multiple times to our neighborhood splash pad to make sure it was working for my son’s 4th birthday! Thanks for all your hard work. :)", "pics": null, "resp": {"time": 1598818806843, "text": "Thank you Nicole. We appreciate y'all and we really don't like to see kids disappointed."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "100289104240166533011", "name": "Steve Cizek", "time": 1525052135128, "rating": 5.0, "text": "My experience with ASP has been exceptional.  I know I can count on them to do the weekly pool maintenance on time with excellent results.  Recently they replaced my liner and the results were top tier.", "pics": null, "resp": {"time": 1598819350219, "text": "Thank you Steve. We appreciate your years of patronage."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "104870564605119593952", "name": "Beth Roper Stewart", "time": 1565695979625, "rating": 5.0, "text": "Brad and the crew are fantastic! They handle problems promptly and efficiently. Abel has been consistent and kind, We never have to worry about the pool, he just handles it!", "pics": null, "resp": {"time": 1598818601089, "text": "Thank you for your trust in us all these years."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "104337401132089341990", "name": "W. Clark Boutwell", "time": 1544584724863, "rating": 5.0, "text": "Very business like and communicative. Prompt and well organized. My wife thinks their text messages a bit cryptic but I find them clear and instructive", "pics": null, "resp": {"time": 1598818949645, "text": "Thank you Dr. Boutwell. Your patronage is an honor and we appreciate it."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "108814840035914373146", "name": "Martel Calhoun", "time": 1528916766389, "rating": 1.0, "text": "ASP HAS POOR SERVICE, DON'T SHOW UP ON TIME..JUST WANT THERE PAYMENTS ON TIME!! YOUR FIRED AS OF NEXT MONTH, GOING ON YELP TOO REPORT YOUR SERVICE TO THE CITY, AND SOCIAL MEDIA. I RECOMMEND YOU TIGHTEN UP YOUR SERVICES.", "pics": null, "resp": {"time": 1528992725313, "text": "Mr. Calhoun,\n\nThank you taking the time to post a review. We would love to make things right with you regarding your concerns, but we think you’ve made an honest mistake. ASP has no record of having done any work or having communicated with you in any way.\n\nWe are located in central Alabama and it appears that you may have confused us with your pool company in Washington state. We hope you get the remedy that you deserve as a paying customer.\n\nThank you and kind regards - ASP of Montgomery, AL"}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "100595652845161783058", "name": "Pam R", "time": 1527398480240, "rating": 5.0, "text": "ASP sent one of their employees out to change the sand in my sand filter and replace the laterals.  The poor young man continued working even when it began pouting down rain.  He not only did what was agreed, but also went the extra mile by removing the broken pvc pipe from my multi-port and putting in new pipe.  I appreciated that so much.  The pool looks much cleaner already.   Highly recommended.", "pics": null, "resp": {"time": 1598819303986, "text": "Thank you Pam. You are an awesome customer."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "112797105674027637472", "name": "Dianne Dennis", "time": 1463000537407, "rating": 5.0, "text": "ASP is a professional pool service that we have used for over a year.  They have kept our pool clean and clear.  They are always eager to help solve any problem that you may have.  I highly recommend them for all pool needs!  Thanks for a job well done!", "pics": null, "resp": null, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "110839619258425317320", "name": "Jean Havens", "time": 1545763697221, "rating": 5.0, "text": "ASP did a great job maintaining my pool in top shape for several years in the Mitylene Forest area.  They also helped me out when I needed some quick help getting some problems fixed with the pump system so I could get it ready for a home sale.  I would highly recommend them.", "pics": null, "resp": {"time": 1598818889109, "text": "Thank you Jean. It has been our sincere pleasure."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "113629620916836353719", "name": "Gwen Checho", "time": 1496592497834, "rating": 5.0, "text": "Brad Cole and the entire staff are professional and happy to help with anything I need. We have. Been using them for more than 3 years. We had the pump go out right before Memorial Day and they got it fixed and back to crystal clear water in less than 3 days.", "pics": null, "resp": null, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "116001818823419439296", "name": "Holly Edwards", "time": 1519673652649, "rating": 5.0, "text": "Brad is definitely the best pool person around!!\nHe has gone above and beyond to help me get my pool questions answered...I would highly recommend him for all your pool needs....He isnt just gonna clean your pool and walk away but he invests in your pool just like u do! If u have any questions day or night he is there to answer.\nAwesome company!!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "112264764511763176545", "name": "Natalie Patrick", "time": 1409850003745, "rating": 5.0, "text": "We had a pool leak for over 1 year.  I had dealt with the company in Montgomery that put my pool in.  They came out, looked it over and stated that we needed to get a new liner since it was over 10 years old.  Their \"theory\" did not make sense to me because it would leak only some of the time.  I refused to spend the $2700 on the new liner and dealt with the \"sometime leak\".  We finally decided to give Brad Cole a call at ASP, and he quickly was able to determine the problem.  It was a very simple fix that saved us a lot of money.  I appreciate his time, honesty and helpfulness.  He asked questions and gave us great advice not only with our leak problem, but with maintenance tips that will help us maintain our pool better. My only regret is not calling him sooner.  It is nice to know that there are still good business people out there.", "pics": null, "resp": null, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "105512282575305936991", "name": "Anita Speir", "time": 1521561341856, "rating": 1.0, "text": "This has been the worst experience I have ever had with a pool company. I've had a pool in Montgomery for years and have used Hughes as well as Mr. Pool, both of which were very professional. Brad, on the other hand, signed a contract in November for a drain and clean, and then outright lied to me telling me I mailed my check late, then told me he was at a funeral- and sent me pictures of it for some reason. After I offered my condolences and asked to reschedule he informed me he mailed my check back then asked why I wanted it done so soon... 3 months after I requested the drain and clean- I expected to wait this long due to the weather, but the week it was to be done Brad found every reason under the sun to refuse me service. I suspect the original quote he gave me of 900$ was too low ( I usually pay 1,200$) for him to complete the contract. I did not ask for the check to be sent back, or for it to be cancelled, so he voided a contract illegally. After I APOLOGIZED to him for asking for my services to be rendered, even once again offering my condolences for his loss, I assumed his erratic behavior was because of this, Brad still snubbed me, telling me we didn't communicate well. His texts to me were strange and obnoxious and I was completely confused the entire time I had to deal with him. Terrell, however, was pretty helpful and tried to answer my questions to the best of his knowledge.", "pics": null, "resp": {"time": 1521727539765, "text": "Ms. Speir, This is Brad. Thank you for your review. Since you live in Denver, Colorado we didn't get the opportunity to meet face to face or even speak on the phone for that matter but I believe I would have avoided my mistakes if we would have had the opportunity to do either. It has been my experience and strongly held belief that text messaging is a poor means of communicating one's thoughts or interpreting the meanings of others. Therefore, it is 100% my fault for relying on this means of communication with a potential customer. This was against my best judgement and I was wrong. I sincerely apologize for your having had a negative experience with our company, specifically with me. I will remember and use this experience to better myself and avoid these strategic mistakes that lost the company a valued potential customer. Kind regards, Brad Cole"}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "116554476152094066905", "name": "Steve Walters", "time": 1414424286566, "rating": 5.0, "text": "I moved into a new home with a pool that needed attention and I called ASP.  They were quick to respond, attentive to my needs, and even though I knew little about how to take care of my pool, they took the time to clearly explain what was needed and brought me up to speed on how to keep it beautiful and clean.  They also brought my pool back from the dead- it is beautiful now! The price was more than fair for all they did.  I will definitely use them again.", "pics": null, "resp": null, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "104635558527192353282", "name": "Michael Kometer", "time": 1487272865752, "rating": 5.0, "text": "Excellence - my saltwater system had been broken, then my pump went out on a Saturday. Brad returned my call in less than an hour, got some info, and gave me a quote by text. Then he worked with me to tailor the quote with options and recommendations. He was ready to schedule the job for Monday, I wasn't, so Erik showed up Thursday at my request. He finished the job quickly and the cost was less than the quote because the install was not complicated. Erik also gave me lots of advice on maintenance while he was installing. Unbelievable service!", "pics": null, "resp": null, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "100197195856267100289", "name": "JJ spencer", "time": 1566222935986, "rating": 5.0, "text": "Abel Rios is our poolman.  He is GREAT.  Our pool always looks amazing!!!!!", "pics": null, "resp": {"time": 1598818440787, "text": "Thank you JJ. We appreciate your business."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "114189799348141316270", "name": "Aprill Vaughan", "time": 1423096118995, "rating": 5.0, "text": "Amazing Service its February and they are here replacing my liner!! The owner Brad is honest and cares about his customers!! He made all efforts to avoid extra cost while do this job and in todays economy this is a must!! I addition to installing the liner they have cleaned every aspect of the pool which gives the new liner an amazing look!! Clean steps, clean diving board and all clean up being done with out me needing to get involved or help! AMAZING!!", "pics": null, "resp": null, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "114660421763641473693", "name": "Cindy Ahrendt", "time": 1545226346237, "rating": 5.0, "text": "ASP converted our pool to a salt system.   They were very responsive to any requests or questions.   They stand behind their work and products.  I will definitely use ASP again.", "pics": null, "resp": {"time": 1598818909704, "text": "Thank you Cindy. We thank you for your patronage."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "113158597771368463777", "name": "Caleb Hawk", "time": 1394806341964, "rating": 5.0, "text": "My wife and I just bought our first house.  Luckily it came with a fantastic pool.  The first thing we knew we wanted to do was get it converted to salt water.  Feels so much better on your skin while swimming.  I called several other pool companies around Montgomery, and they either tried to talk me out of getting a saltwater solution (to sell me chemicals) or they seemed way to busy to even be talking to me on the phone.  Brad was awesome, and told me all about saltwater solutions and pool upkeep.  He came and checked out our pool and installed the system the very next day.  I'm so glad we decided to go with ASP!  Brad is now just a phonecall or a text away, and is a true professional.  If you have any pool needs at all, don't be hesitant to give ASP of Montgomery a call!", "pics": null, "resp": null, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "100005100461117753833", "name": "Kirk Curnutt", "time": 1439393044714, "rating": 5.0, "text": "I've used ASP and Brad in particular for the past two years for my pool maintenance. He and his employees have always been amazingly responsive, replacing pumps and repacking the sand filter and helping get rid of algae when some sneaked in. This summer I needed a new liner. I can't believe how quickly they made it happen. I had to run an errand, was gone an hour, and basically the new one was installed. At all times the service has been professional and dependable. I highly recommend Brad and his team. You won't be disappointed!", "pics": null, "resp": null, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "103719450459579736425", "name": "Nancy Parker", "time": 1462972731222, "rating": 5.0, "text": "Brad (owner) and Eric with Montgomery ASP have provided our weekly pool service for over a year and had made repairs occasionally prior to that.  Recently, the pool needed a much needed super clean-up.  This is a plaster pool in a rural setting so plant staining is fairly common over time.  Both agreed their initial results from a \"hot bath\" were not good enough to meet their professional standards.  They repeated the process and ultimately did a third step for good measure, of course at no additional cost to us.  On top of everything else, Brad and Eric promised to have the pool ready for my annual Mother's Day spring pool party.  This company is one of the most ethical we have dealt with.  The pool looks like new, the party was a big success,and we couldn't be happier with the final results.", "pics": null, "resp": null, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "117109132853356293497", "name": "Renita Main", "time": 1528985915923, "rating": 5.0, "text": "ASP responded quickly and professionally! Great customer service! I won't ever use another pool company again!", "pics": null, "resp": {"time": 1598819241066, "text": "Thank you Renita. Y'all are awesome people."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "116302372460898271906", "name": "Matthew McKinnis", "time": 1559648388113, "rating": 5.0, "text": "ASP always provides me with outstanding service, and the technician completed the job during the initial service call.", "pics": null, "resp": {"time": 1598818737635, "text": "Thank you Matthew. We appreciate your business all these years."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "101236917592566152122", "name": "Brad Conaway", "time": 1487283619781, "rating": 5.0, "text": "These guys were great. Walked me through every step of the process of getting a new pump. I never felt pressured or like I was asking a dumb question (which I'm sure I was).\nThe pump had been out for a bit, so my pool had turned into a bit of a green swamp. These guys knew exactly what to do, and less than a wee later, it's crystal clear, and making me wish it was 20 degrees warmer outside.\nThanks ASP!", "pics": null, "resp": null, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "114819137637733137506", "name": "Jeremysara Maloy", "time": 1529094588550, "rating": 5.0, "text": "ASP has been great.  We are a military family with a rental property in Montgomery .  We live out of state and ASP has been very easy to work with on the few problems that have come up!", "pics": null, "resp": {"time": 1598819142910, "text": "Thank you Sara. We appreciate the business."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "117223681560111964939", "name": "Mike McVay", "time": 1464785129475, "rating": 5.0, "text": "I thought my sewer pit of a pool could not be recovered. Brad and Eric did an outstanding job getting it swimmable in 2 weeks. I thought it would take 3 or 4 but it is clear and clean. They are professional and will answer any questions, This is the only company I trust to get my pool perfect and keep it that way and they are worth every dime.", "pics": null, "resp": null, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "117768393865445154517", "name": "Barry McNamara", "time": 1537377536348, "rating": 5.0, "text": "Dependable, courteous, and rescued me in an urgent situation.  They have done work for me now on multiple occasions with the same quality of work.", "pics": null, "resp": {"time": 1598819003196, "text": "Thank you Dr. McNamara. We are thankful you chose us to help with your pool."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "112249112074881357999", "name": "Michael Houston King", "time": 1462988650585, "rating": 5.0, "text": "I recently purchased an apartment complex in Montgomery and the pool had been down for probably 10 years.  IT WAS 10 MILES OF BAD ROAD!   Brad and his team put together an aggressive plan to rehab it and the baby pool.   Last week they finished and the process has been seamless.  I am an owner based in Florida and Brad kept in communication with me daily.  He sent daily updates with BEFORE & AFTER pics.   It meant so much to me and gave me significant peace of mind throughout the process.   I couldn't be happier with the final result - a true professional.", "pics": null, "resp": null, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "116147653020779826757", "name": "Brian Jackson", "time": 1521769437236, "rating": 5.0, "text": "Fast service, very responsive, and VERY reasonable prices. Will definitely use them again!!", "pics": null, "resp": null, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "111618859075618278712", "name": "Jimmie Meece", "time": 1345818656667, "rating": 5.0, "text": "Brad and Angie with ASP of Montgomery provide fantastic customer service and quality pool service. I highly recommend there full service swimming pool company to any other pool owner in the Montgomery area! Great work America's Swimming Pool Company of Montgomery!!!", "pics": null, "resp": null, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "101969650479740318237", "name": "Pamela Tillman", "time": 1450204971291, "rating": 5.0, "text": "I am so greatly satisfied with Mr. Brad and ASP Pool Maintenance. Mr. Brad did an amazing job and is so respectful. I would highly recommend Mr. Brad and ASP Pool Maintenance to anyone!!", "pics": null, "resp": null, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "109535370318171200609", "name": "Scottie Haynes", "time": 1528986836243, "rating": 5.0, "text": "Brad Cole and his staff do great work. I highly recommended them.", "pics": null, "resp": {"time": 1598819221721, "text": "Thank you Scottie. We really appreciate this."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "107902781350768404717", "name": "Ivy Pittman", "time": 1466460802253, "rating": 5.0, "text": "Called Brad last Friday.  Monday one of his team was out to our house to check our pool.  The last pool company we called had told us we needed to replace our salt system which would have cost $300 plus.  The problem wasn't the system it just wasn't getting enough salt.  Thanks to Brad and his team for the honest answer.  I will call ASP first next time.  Thanks so much!!!", "pics": null, "resp": null, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "111984686945014738420", "name": "Noelle Wright", "time": 1437406326841, "rating": 5.0, "text": "Brad and his team were amazing!  Not only were their prices very affordable, but their work cannot be beat!  They got my nasty pool clean and ready to be the summer heat.  I HIGHLY recommend Brad and his team at America's Swimming Pool Company!", "pics": null, "resp": null, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "109722081674583479763", "name": "Chris Price", "time": 1342829807280, "rating": 5.0, "text": "I called 2 other companies in the area and was told they were full or wouldn't come to Tallassee because to far. I was referred to a guy named Brad with ASP. I called, and from very beginning, he was very helpful and let me know he could help me. He goes above the expected service by returning phone calls quickly or making that return trip the following day for something that could have waited. The service and work have been great. I have already shared with a couple of friends with pools of this service if needed. The big thing is his service is saving me money compared to what I was spending in trying to get pool back and chemicals that were breaking me. I would highly recommend ASP and Brad Cole.", "pics": null, "resp": null, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "106083290364611395579", "name": "Andrew Dominguez", "time": 1431027755211, "rating": 5.0, "text": "You won't receive better service from any other company. Brad is his team are the best there are. Brad came out to give me an estimate and diagnose an issue that I had with my Hotel swimming pool, and to my surprise he was nearly a thousand dollars lower in price than a competitors bid. Now, this isn't because Brad was trying to take the cheap way out, but rather Brad has taken the time to look through my existing set up, and rather than tell me that I needed to replace everything, he made my problem go away by just replacing one part. My pool now runs property, and has passed inspection because of Brad and his team. I highly recommend Brad to anyone who has pool issues. His honesty and integrity are second to none. Thank you ASP for the fantastic work you did!", "pics": null, "resp": null, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "111620822065353685139", "name": "Adam Hall", "time": 1528981556407, "rating": 5.0, "text": "Brad is an honest guy. His work is top notch!", "pics": null, "resp": {"time": 1598819277304, "text": "Thank you Adam. We appreciate the review."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "101829931798348875077", "name": "Fan Yu", "time": 1374529180382, "rating": 5.0, "text": "I was in the process of purchasing a house which needed a number of costly renovations that just so happened to include the pool. Well, pool might be a bit of stretch to describe what in fact appeared to be in the process of becoming a protected wetland. The pool, like the house, was in a state that was the result of years upon years of deferred maintenance. I called several companies with ASP being among the first. And before I continue, let me say that many of these companies won't even call you back, answer their phones or come out for visits like they say so ASP is ahead of the curve just for that reason alone. Brad was exceptionally busy with it being the beginning of the pool season, which he told me right off, and that he would try to get over to the house to inspect the pool. The price I was told it might take to get the pool in a usable state took my breath away! But I wasn't too surprised by it. He stated several times that it could be a little more or much less depending on what was found beneath the cover and behind walls. He was sure to prepare me for the worst. However, after that initial few calls and the visit, I didn't hear back from them. This wasn't a major problem because there was roofing and foundation issues to tend to before swimming could even be considered. Why would you need a backyard water feature when the roof itself was becoming one all by itself? Being that I needed someone to get out to do it fairly quickly once it came time address it, I called another company and they gave me a lower quote and could get started fairly quickly. Well, that went bust because we required a contractor with insurance, just in case of a problem. This guy didn't have it and didn't tell us until AFTER he was supposed to show up to do the job. I called and then he lets me know all that. ABSOLUTELY UNPROFESSIONAL BEHAVIOR that seems to be the hallmark of many service businesses like that these days. I was ready to just put the pool stuff off for awhile until I could find someone trustworthy until Brad calls out-of-the-blue! Just in time!! I was glad because, honestly, I really wanted to work with them from the start due to the good reviews on Google. Not only have they performed all the work needed so far, they did it for WELL under what they told me initially. It seems they prefer to brace you for the worst rather than underestimate costs just to get the job. We have a few more issues to address with the pool, again from the previous owners, that I'm sure Brad will help us iron out. These people have been tremendous and I can't say enough good things about them. They do what they say they're going to do, are available anytime just about and HONEST. I will only call ASP for any of my pool needs. Save yourself some frustration, money and anxiety--CALL ANGIE AND BRAD AT ASP!!!!!! Love them!!!!", "pics": null, "resp": null, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "103471618210776299151", "name": "YOLANDA GARCIA", "time": 1493255273545, "rating": 5.0, "text": "Words aren't enough to describe what an awesome experience I have had in regards to ASP of Montgomery. Due to unexpected military orders, the pool was unfortunately neglected which caused heavy staining of the liner and steps.  The staining caused an unsightly appearance and kept us from enjoying the pool to its maximum potential and subsequently interferred with our ability to lease the home.  Within minutes of reaching out to ASP of Montgomery I was able to receive a quote for services and thoroughly explained what to expect. The attention to detail provided, overall customer service, as well as timely responses has by far exceeded my expectations. My pool is the bluest I have seen it in 3 years and is therefore the reason I will be contracting there services for routine cleanings. I am beyond greatful.", "pics": null, "resp": null, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "101370420247324936359", "name": "J McCormick", "time": 1518011669198, "rating": 5.0, "text": "Can get you squared away and keep it that way. If there isn't something you aren't sure about or completely satisfied, they will make sure you are informed and make sure it's right.", "pics": null, "resp": null, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "114071790078751742568", "name": "Sharon Johnson", "time": 1563566400811, "rating": 5.0, "text": "Great service received employees are outstanding", "pics": null, "resp": {"time": 1598818650625, "text": "Thank you Sharon. This means alot to us."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "114015438273360838306", "name": "Melanie Webb", "time": 1440522987473, "rating": 5.0, "text": "Very pleased with the cleaning and maintenance services we have received from ASP.  We have tried multiple pool companies in the Prattville/Montgomery area and they far exceed the competition. We would recommend ASP to everyone.", "pics": null, "resp": null, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "102360096339172489597", "name": "Kelly Adams", "time": 1454014743519, "rating": 5.0, "text": "Several months ago I purchased a home with a pool.  I initially used a different pool business for the pre-purchase inspection and the first few months of maintenance.  Unfortunately, that decision turned into a catastrophic mistake.  I was spending a lot more money and problems arose that had I been using ASP I'm confident would not have occurred.  A couple of months after moving in, I starting looking for a new pool company to use and I found ASP.  Brad and Erik were extremely responsive.  They gave me a fair price for weekly pool maintenance.  When we found significant problems with the pool, they worked with me to figure out the best solutions.  I have nothing but great things to say about them and will recommend them to anyone I know who needs pool work/maintenance.", "pics": null, "resp": null, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "106331168416842635386", "name": "Jennifer Bach", "time": 1528987989594, "rating": 5.0, "text": "Good folks!  Excellent customer service!!  Highly recommended!!!", "pics": null, "resp": {"time": 1598819200694, "text": "Thank you Jennifer. You are awesome."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "105236690487245055689", "name": "Jackie Waller", "time": 1342479295507, "rating": 5.0, "text": "Very pleased with the cleaning and maintenance services we have received from ASP.  Brad Cole is a great people person and is committed to make the client happy.  We have tried multiple pool companies in Montgomery, AL and they far exceed the competition.", "pics": null, "resp": null, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "102476785225603632215", "name": "Charles Jones", "time": 1421941956587, "rating": 5.0, "text": "What a pleasant surprise!!  I have a 12,000 gallon KOI pond that is 4 ft. deep and has 2 large bottom drains and a skimmer that feed a filter system much like that of a swimming pool except the media in the filter is plastic beads instead of sand.  It pumps 9,000 gallons of water through the system an hour and runs 24 hours a day.  The water after passing through the filter returns over a waterfall back into the pond.  There are 2 large river birch trees that overhang the pond and the shed a lot of leaves and small twigs into the pond.  Over time I had an accumulation on the bottom of the pond and the drain pipes running under the pond had stopped up and after a routine backwash of the pond the pump lost its prime and I was unable to restart it.  I got the bright idea that since it was similar to a swimming pool to call a swimming pool maintenance company for help.  I looked on the internet and found and called ASP.  Brad answered the phone and when I described my problem he said he could help and he could come 2 days later.  When I explained that I had 60 large KOI fish that required the water flow to keep the water oxygenated he said he was leaving for an appointment and would come as soon as he finished.  He worked on my problem the rest of the day and returned the next morning and got everything working great.  He also altered the plumbing to give me the ability to blow out trash in the drain line.  He found a problem with the multiport valve which we decided needed replacing and added a shut off valve on the waste line to solve the problem until I could get a replacement.  He was great to work with and communicated his findings and suggestions well and his pricing was very reasonable.  I plan to use his service on a regular basis.", "pics": null, "resp": null, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "112362742060016655556", "name": "kerri lucido", "time": 1493410838542, "rating": 5.0, "text": "ASP did a great job installing my new pool pump!!!", "pics": null, "resp": null, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "102492136260269058634", "name": "Judith Wallace", "time": 1532539527264, "rating": 5.0, "text": "Friendly, prompt, great work! Our go to!", "pics": null, "resp": {"time": 1598819059981, "text": "Thank you Judy. It has been our pleasure to work for y'all."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "110335120368416863185", "name": "Judy Powell", "time": 1576718773316, "rating": 1.0, "text": "Pool  maintenance extremely  poor.", "pics": null, "resp": {"time": 1598818367694, "text": "We're sorry that you were dissatisfied with our services Judy. We're not a great fit for every person but we try hard and we always do the right thing."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "110943188051818609225", "name": "Michael Bradsher", "time": 1514520364170, "rating": 5.0, "text": "The best!!", "pics": null, "resp": null, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "118009929879502383656", "name": "BOB HUDSON", "time": 1443011962828, "rating": 1.0, "text": "bad service", "pics": null, "resp": {"time": 1442864031527, "text": "It is unfortunate that this review is posted.  We have confirmed with our Corporate Office and Darren Kessler that this review is not from Darren Kessler, but is from a former employee of the Dallas, Texas location, named Robert Hudson.  We are sorry that Mr. Hudson had issues with his former employer and it is unfortunate that Mr. Hudson feels the need to post these items on our site and other franchise location sites as this has nothing to do with our franchise."}, "gmap_id": "0x888c2c461872e37b:0xbc765d666f41deb4"}
{"user_id": "109403780434343779653", "name": "Pamela King", "time": 1624887422996, "rating": 1.0, "text": "Have read other reviews now and have had the same experience! Bought products/services 3/30. Friends and family now having to do the work! Excuse after excuse. Lady in the office was so rude she upset me so much. Never saw the owner. She said he was always busy working even Saturdays and Sundays but yet the trucks were always there as was the bobcat. Will never use them again!", "pics": null, "resp": null, "gmap_id": "0x888a4bd88852b149:0xca182711ee8bf344"}
{"user_id": "111850947077592900223", "name": "Daphne Hinds", "time": 1617664645046, "rating": 5.0, "text": "We have been so happy with the work Matthew has done for us.  As a matter of fact, we will never call anybody but Swimple pools.  Matthew is honest and he goes wayyyy above and beyond what he has to do.  When we couldn't find anybody else in a two county radius that would come out to help us we got blessed to find him!  5 stars!!!!!  Call him.  You won't regret it!!!", "pics": null, "resp": null, "gmap_id": "0x888a4bd88852b149:0xca182711ee8bf344"}
{"user_id": "115012624101031547796", "name": "jamie keith", "time": 1621703132752, "rating": 1.0, "text": "DO NOT USE!!! We hired them to open our pool, replace sand and check plumbing. The water was green so I know it takes a little time. They sent the cleaning employee out 4 times and he shocked and flocked it. I have no problem with him. He tried but it still remained light green. So fast forward a week I go by the store to get a new bucket and talk to the lady about our pool. I was told the owner is the only one that can change the sand or check plumbing. We'll thats fine as well except the owner never calls or even follows up behind his employees to make sure they are doing things properly ,this is important when your told well the pool boy is learning . The lady then tells me that WE need to shock and brush and backwash. So let me get this straight you want us to clean our pool while you are not there making your job easier so you can collect the cash. Surly I'm not the only one that sees a problem with me paying them for a service I am doing. I understand me backwashing and keeping an eye on the filter while they are not there and I'm good with that.I canceled and still have never heard from the owner. I never leave reviews but please stay away. You only important if you are spending thousands at his business", "pics": null, "resp": null, "gmap_id": "0x888a4bd88852b149:0xca182711ee8bf344"}
{"user_id": "105978347058608830255", "name": "Holly Hinchman", "time": 1623439662411, "rating": 1.0, "text": "DO NOT use Swimple pools! My husband bought an above ground pool in February. It wasn’t the cheapest either, but you pay for what you get, or so we thought. So they come out to install Thursday before Memorial Day. While digging they find a “sink hole” as they called it. It was an unfilled perc test. We filled it in that weekend and let them know. (This is NOT their fault, just setting up for the next two weeks it hasn’t been dealt with.)That next week we are told the installation would resume. Later that week the installer said he would be out Friday and that someone needed to be there to sign “sink hole” liability papers. Saturday comes still no show or call. So my husband calls the owner. We ask if we could get our money back, and husband tells him their contracted installer won’t call or show up like he’s promised several days to do. After that the installer calls immediately and says he will be out Monday. He comes for 30 minutes. He comes back Tuesday and digs it out and leaves because of weather ( didn’t rain). Thursday my husband asks when we can expect him again. He gives another day and says once again he promised it would be up, my husband told him if he couldn’t keep that commitment then we would find someone else. He told us to go ahead and find someone else. So, I go to the store front and speak to the lady in there. She was very defensive of the whole situation, said we couldn’t have our money back because pools are special order. So I ask when it would get installed. She said she didn’t know. Mathew would do it. She then told me the installer was in tears over us. I tried showing her the screenshots of the conversation to prove we weren’t rude and was simply needing someone to come when they say. I asked to speak with the owner, she refused to give me his information and told me to leave or she was calling the police. I had my children with me who were scared she was saying that. I was not disrespectful. We left as requested. Still no word from anyone 5 hours later. Total disrespect to my property, my time and my kids.", "pics": null, "resp": null, "gmap_id": "0x888a4bd88852b149:0xca182711ee8bf344"}
{"user_id": "114697350535269842707", "name": "Jerolyn Davis", "time": 1565018089228, "rating": 5.0, "text": "So happy with our pool and the help we got from the owner. Great prices, Excellent quality, and easy to work with. Love this place!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMdXWu1M3Jz7jWxAewn7-iCNB9q1hhp1eeGNJiN=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOkl-XkyQaN9YwjnwFBnYpznXff2eSBbqPY8GOU=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOdGQvOle3IgPFTN5eABdEBxCM0AaUpVeZkMZxc=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN5FfBcicRbBEvXvGA9kbm_-DCpzbYCid9wDXMn=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN5XWZ-djRWVTzSSSPa484G7u_fw-OPTRo7xex8=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPdpGqvgf5APsvF1tpptb-FDeIJBhSOH04VQ1XO=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOIg0O3FGN1fV0ZC1QZgY6sBKsbs_PssPeRIk5c=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMHquQc6tU6_XLdCh48cEuz4V3kQR7SM1aEakn_=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMgBHgWozwzWV95c_uNkZ00_Z_gepEQcm_fU8T1=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM-09cE7YE4EfXJw-oSkzo48RntjJ8NMjyIsS1i=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPr2dEb14YAEv0jFYJ5Qe_RSVtSz5qKApiMJ-dP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPyyR_gV8rk57MQ7V1lDEGUhR3WKwr8pdSXjMF1=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNhjFpi_JQqxhYTTjRIQKD760Q-vGCXyRO1XXj7=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO3VbQMOKDzjv3VjRNfhJDorCbrLhxMUGislsnD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPr66YW20OPuTmuCiKZDm9Hzd_rhBKsdgzmgXaC=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN-orTFwwbgIu-9gtyBEVdfn_CALf4Ky6C1b20h=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNhwD0T52zG0KY7Ef4YbByUvGjUy30WV8s7Ddls=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPQv7eyY9u2IxONwgRIb5xc9bFVUBiTaMNY66Ng=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOHk6aUTO9u0OsbBTWPIEJ6EMB57XQbv_opBvX7=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a4bd88852b149:0xca182711ee8bf344"}
{"user_id": "106993254669707487831", "name": "Michelle Riggs", "time": 1618747531298, "rating": 5.0, "text": "Great people , service and prices.", "pics": null, "resp": null, "gmap_id": "0x888a4bd88852b149:0xca182711ee8bf344"}
{"user_id": "115293088444055486012", "name": "Tammy Barber", "time": 1597858402166, "rating": 5.0, "text": "Great job on new pool!! Very helpful and knowledgeable getting me set. First time pool owner and I highly recommend Swimple pools!", "pics": null, "resp": null, "gmap_id": "0x888a4bd88852b149:0xca182711ee8bf344"}
{"user_id": "117779606362600413200", "name": "Lee Biddle", "time": 1585425057684, "rating": 5.0, "text": "It was a pleasure to meet Mathew and he was extremely helpful and informative. As far as I'm concerned, Swimple Pools is the best in this area by far. We have found our pool supply/repair company. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888a4bd88852b149:0xca182711ee8bf344"}
{"user_id": "107938082578243478422", "name": "LGreen0605", "time": 1570456415159, "rating": 5.0, "text": "Great service! He is very easy to work with and extremely professional! Very knowledgeable and cares about his work!", "pics": null, "resp": null, "gmap_id": "0x888a4bd88852b149:0xca182711ee8bf344"}
{"user_id": "111489052450191302996", "name": "Susan Perry", "time": 1597682820253, "rating": 5.0, "text": "By far... the best in this area!!", "pics": null, "resp": null, "gmap_id": "0x888a4bd88852b149:0xca182711ee8bf344"}
{"user_id": "111911354960609015660", "name": "Dawn Gabelman", "time": 1568295057478, "rating": 5.0, "text": "They're very helpful!  Great service! Kind!  Mathew goes the extra mile for you!", "pics": null, "resp": null, "gmap_id": "0x888a4bd88852b149:0xca182711ee8bf344"}
{"user_id": "103454790938360549225", "name": "Ally Morrison", "time": 1591466465037, "rating": 1.0, "text": "Called 7 times 6 of those times a new work order was put in for me to be called back. Our pool was scheduled to be done in the beginning of May and I have still yet to hear back from anyone and I don't expect to either.", "pics": null, "resp": null, "gmap_id": "0x888a4bd88852b149:0xca182711ee8bf344"}
{"user_id": "111671048742646052746", "name": "Michelle Hart", "time": 1565103659430, "rating": 5.0, "text": "Every time I call they are helpful.", "pics": null, "resp": null, "gmap_id": "0x888a4bd88852b149:0xca182711ee8bf344"}
{"user_id": "103873246920685092592", "name": "Steven Gornik", "time": 1618533532883, "rating": 5.0, "text": "The people at Blue Wave are awesome. As a first time pool owner I'm a little overwhelmed by the task of getting the pool ready for the season. The Blue Wave staff is very knowledgeable, patient and answered all my questions. They happily set me on the right path to a beautiful pool.", "pics": null, "resp": {"time": 1618536073033, "text": "Thanks Steve! We know it can be a little overwhelming at first, but we are here to help. Let us know if you need anything."}, "gmap_id": "0x8888e725ddc57231:0x2130dad159d5e182"}
{"user_id": "114592867120005473575", "name": "Pensacola Pools, Inc Foley Branch", "time": 1625244291979, "rating": 5.0, "text": "Dont often review another pool store, but these guys really helped us out with a hard to find product!\nThanks so much!", "pics": null, "resp": {"time": 1626446366315, "text": "Glad we could help!"}, "gmap_id": "0x8888e725ddc57231:0x2130dad159d5e182"}
{"user_id": "105563967089329131466", "name": "Bee Lewis", "time": 1626207511885, "rating": 5.0, "text": "Very friendly staff. Very knowledgeable. Clean and nice show room.", "pics": null, "resp": {"time": 1626446305381, "text": "Thank you, Bee. Always good to see you!"}, "gmap_id": "0x8888e725ddc57231:0x2130dad159d5e182"}
{"user_id": "105471741117438330584", "name": "Scott Crabbe", "time": 1622072426834, "rating": 5.0, "text": "Every time I use Blue Wave I get the best personal attention. They know so much about what your pool will need and never tries to over sale you  items you do not need. I have and will use them for as long as I have a pool.", "pics": null, "resp": {"time": 1622315013921, "text": "Thank you so much Crabbe! See you next time!"}, "gmap_id": "0x8888e725ddc57231:0x2130dad159d5e182"}
{"user_id": "110025929408358997136", "name": "Katherine Hilburn", "time": 1625773423738, "rating": 5.0, "text": "Love Blue Wave Pool & Spa! Great service, always has the right chemicals, super nice employees!", "pics": null, "resp": {"time": 1626446378085, "text": "Thank you!"}, "gmap_id": "0x8888e725ddc57231:0x2130dad159d5e182"}
{"user_id": "103949771088986179618", "name": "Sheila Harrison", "time": 1620097785375, "rating": 5.0, "text": "Very knowledgeable. Great customer service. I will definitely be back. Thanks again 😊", "pics": null, "resp": {"time": 1620156151206, "text": "Thanks Sheila! See you next time!"}, "gmap_id": "0x8888e725ddc57231:0x2130dad159d5e182"}
{"user_id": "112900964265647846746", "name": "Glenda Gail Davis", "time": 1621994103460, "rating": 5.0, "text": "Service was quick and friendly. I searched several pool locations and this was the only one that had what I needed to open my salt water pool!  Will be back!!", "pics": null, "resp": {"time": 1622057696451, "text": "Thank you Glenda! Glad we could help!"}, "gmap_id": "0x8888e725ddc57231:0x2130dad159d5e182"}
{"user_id": "102903074640085222139", "name": "Crystal Miller", "time": 1621519731291, "rating": 5.0, "text": "HUGE SHOUT TO patrick @ elite pool and spa in gardendale and his sister shelby at blue wave / elite in hueytown !!! They both are very sweet and respectable people and they listen to your pool issues with care . they deff know their stuff when it comes to pools and chemicals. Please go see them for ALL your pool needs !!!!! 100 % /100% will be VERY HAPPY THAT YOU DID 😉", "pics": null, "resp": {"time": 1622057493281, "text": "Thank you so so much! See you next time! - Shelby"}, "gmap_id": "0x8888e725ddc57231:0x2130dad159d5e182"}
{"user_id": "116003694054559909328", "name": "Trenia Coleman", "time": 1622270954855, "rating": 4.0, "text": "All pool needs very helpful", "pics": null, "resp": {"time": 1622315845800, "text": "Glad we could help!"}, "gmap_id": "0x8888e725ddc57231:0x2130dad159d5e182"}
{"user_id": "113159628162289979291", "name": "Henry Irby", "time": 1619109859690, "rating": 5.0, "text": "I received outstanding customer service!", "pics": null, "resp": null, "gmap_id": "0x8888e725ddc57231:0x2130dad159d5e182"}
{"user_id": "109591808742337441343", "name": "Brandi Thomason", "time": 1619730189861, "rating": 5.0, "text": "Ronni was friendly & very helpful", "pics": null, "resp": null, "gmap_id": "0x8888e725ddc57231:0x2130dad159d5e182"}
{"user_id": "117297357304338238329", "name": "Shirley jones", "time": 1623113401376, "rating": 5.0, "text": "Alway good", "pics": null, "resp": {"time": 1623184360943, "text": "Thank you!"}, "gmap_id": "0x8888e725ddc57231:0x2130dad159d5e182"}
{"user_id": "109510531600296246048", "name": "Phillip Peoples", "time": 1559276268716, "rating": 5.0, "text": "Great place for everything you need for your pool. From Chemicals to Tarps. Pump motors and opening and closing of pools. Selling you new pools. Installing new pools. The friendliness people you will ever meet.\nI highly recommend them to everyone. Located in Hueytown, Alabama .", "pics": null, "resp": null, "gmap_id": "0x8888e725ddc57231:0x2130dad159d5e182"}
{"user_id": "108791759615368625617", "name": "melissa joyner", "time": 1590517561442, "rating": 4.0, "text": "Excellent and friendly staff. Very knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x8888e725ddc57231:0x2130dad159d5e182"}
{"user_id": "102397225728216411019", "name": "Tammy Adkins", "time": 1562902442042, "rating": 5.0, "text": "Such a wonderful staff and Debra is so friendly and knowledgeable. They are awesome! I would give them 10 stars if I could!!! ❤", "pics": null, "resp": null, "gmap_id": "0x8888e725ddc57231:0x2130dad159d5e182"}
{"user_id": "107158441528754966879", "name": "Lanea Head", "time": 1464709524028, "rating": 5.0, "text": "Great service, polite, and Always friendly!! Debra, & her Staff are AMAZING!  They ALWAYS help me with what ever pool problem I'm having. Debt gives me step by step instructions on how to balance my waters PH so my pool so it's crystal clear.\nGreat Atmosphere....I love going in this store. It has a little bit of EVERYTHING, & I WANT IT ALL!\nIF YOU HAVE A POOL I RECOMMEND BLUE WAVE POOL.", "pics": null, "resp": null, "gmap_id": "0x8888e725ddc57231:0x2130dad159d5e182"}
{"user_id": "106646870500267657232", "name": "Sam Benefield", "time": 1597367476661, "rating": 5.0, "text": "Very friendly and knowledgeable staff.", "pics": null, "resp": null, "gmap_id": "0x8888e725ddc57231:0x2130dad159d5e182"}
{"user_id": "101636485612497597528", "name": "Annette Mixon", "time": 1533944452657, "rating": 5.0, "text": "The owner, Deb, has an excellent knowledge of all things related to swimming pools.  She has an outstanding stock of parts when something breaks.   Even better - her customer service skills are beyond anything you'd expect to find.  She always goes above and beyond for her customers!!  I can't say enough good things about this place!", "pics": null, "resp": null, "gmap_id": "0x8888e725ddc57231:0x2130dad159d5e182"}
{"user_id": "112036850969005289319", "name": "Alicia Rainwater", "time": 1459606789753, "rating": 5.0, "text": "Debra is Awesome!!! My pool was green with stuff growing in it and swimming in it. Debra and her staff were able to help me get my pool clear by the end of a week!! They are always kind, friendly and helpful. Love them!", "pics": null, "resp": null, "gmap_id": "0x8888e725ddc57231:0x2130dad159d5e182"}
{"user_id": "105079223285691999166", "name": "Jonathan Bartlett", "time": 1524070213958, "rating": 5.0, "text": "Wonderful people with quality products and services. Highly recommended for any surrounding areas of Birmingham to do your business here. I promise you won't regret it", "pics": null, "resp": {"time": 1526398121571, "text": "Thank you! Let us know if you need anything!"}, "gmap_id": "0x8888e725ddc57231:0x2130dad159d5e182"}
{"user_id": "110184859492440163283", "name": "choppy praytor", "time": 1593109605517, "rating": 5.0, "text": "Best pool place in town", "pics": null, "resp": null, "gmap_id": "0x8888e725ddc57231:0x2130dad159d5e182"}
{"user_id": "108380389840128225361", "name": "Marcie Speakman Skinner", "time": 1561331458743, "rating": 5.0, "text": "Knowledgeable friendly staff eager to help & advise on pool & spa care.", "pics": null, "resp": null, "gmap_id": "0x8888e725ddc57231:0x2130dad159d5e182"}
{"user_id": "113690369261329542299", "name": "Lanea Head", "time": 1508972294454, "rating": 5.0, "text": "This is the best pool supply store in bessemer/ Hueytown. They will check your water, tell you exactly what you need to do get your pool water clear and ready for summer.", "pics": null, "resp": {"time": 1526398143174, "text": "Thank you so much! Let us know if you need anything!"}, "gmap_id": "0x8888e725ddc57231:0x2130dad159d5e182"}
{"user_id": "101588628354719405568", "name": "Richard Skinner", "time": 1569079468779, "rating": 1.0, "text": "Try to sell you stuff you don't actually need and aren't open when they need to be.", "pics": null, "resp": {"time": 1572992069864, "text": "Hey Mr. Skinner, we would like to apologize for your negative experience at Blue Wave. We would like to learn more about your specific situation.  A water sample test always help. We are a seasonal business and our hours change and are posted on the front door and also on our answering machine.  Sorry for any inconvenience."}, "gmap_id": "0x8888e725ddc57231:0x2130dad159d5e182"}
{"user_id": "109442129458186717434", "name": "katie vickery", "time": 1532014868940, "rating": 5.0, "text": "They are very knowledgeable and helpful.  They had everything I needed for maintenance of our new pool", "pics": null, "resp": null, "gmap_id": "0x8888e725ddc57231:0x2130dad159d5e182"}
{"user_id": "116536733453342750130", "name": "David Scoggins", "time": 1592889816255, "rating": 5.0, "text": "Good service", "pics": null, "resp": null, "gmap_id": "0x8888e725ddc57231:0x2130dad159d5e182"}
{"user_id": "109158595289496673795", "name": "Jennifer Lyle", "time": 1561331405574, "rating": 4.0, "text": "Very helpful and nice.", "pics": null, "resp": null, "gmap_id": "0x8888e725ddc57231:0x2130dad159d5e182"}
{"user_id": "118062564116310415640", "name": "Steven Dillon", "time": 1541700312351, "rating": 5.0, "text": "awesome service and knowledge", "pics": null, "resp": null, "gmap_id": "0x8888e725ddc57231:0x2130dad159d5e182"}
{"user_id": "113553285480872630627", "name": "James Hicks", "time": 1531517255396, "rating": 5.0, "text": "Very knowledgable", "pics": null, "resp": null, "gmap_id": "0x8888e725ddc57231:0x2130dad159d5e182"}
{"user_id": "102886022971514263637", "name": "Aaron Fontes", "time": 1599753402133, "rating": 5.0, "text": "They are the best of all the pool stores I've been to in Decatur, AI. One pool place Wells me something EVERY time i go. The other one is just too far, not sure about their care, but I recommend Pool Dr's. Oh, I've had my pool for about 12 years so I speak with experience, I've only had to buy the closing down, opening up, and weekly shock and chlorine tablets from them. Started 3 years ago, and ain't goin' nowhere else. Steve, Missy, and Britany are great to answer your questions too. Definitely a 5 star operation!", "pics": null, "resp": null, "gmap_id": "0x88628426b43c255d:0x3913c6a863bf8d69"}
{"user_id": "105030277581837240658", "name": "Terri James", "time": 1622090068568, "rating": 5.0, "text": "Knowledgable, friendly, profeshional", "pics": null, "resp": null, "gmap_id": "0x88628426b43c255d:0x3913c6a863bf8d69"}
{"user_id": "105405911412898885506", "name": "Amanda Lacy", "time": 1624118199417, "rating": 1.0, "text": "Will not sell you pool supplies unless you bought from them in the past", "pics": null, "resp": null, "gmap_id": "0x88628426b43c255d:0x3913c6a863bf8d69"}
{"user_id": "101691173239719781697", "name": "Caleb Morris", "time": 1618269583984, "rating": 5.0, "text": "They do a wonderful job.", "pics": null, "resp": null, "gmap_id": "0x88628426b43c255d:0x3913c6a863bf8d69"}
{"user_id": "108005448247758960945", "name": "James Read", "time": 1602861618186, "rating": 5.0, "text": "These people are highly knowledgeable very friendly and their prices are reasonable. I love doing business with them.", "pics": null, "resp": null, "gmap_id": "0x88628426b43c255d:0x3913c6a863bf8d69"}
{"user_id": "107563288751211096164", "name": "Eduardo Gonzalez", "time": 1619217211210, "rating": 4.0, "text": "Have great  service", "pics": null, "resp": null, "gmap_id": "0x88628426b43c255d:0x3913c6a863bf8d69"}
{"user_id": "111174405312343571243", "name": "Mike Williams", "time": 1591918517238, "rating": 5.0, "text": "I do all repair myself and the Pool Doctors are always very helpful...thanks guys...", "pics": null, "resp": null, "gmap_id": "0x88628426b43c255d:0x3913c6a863bf8d69"}
{"user_id": "114037694837573589373", "name": "Nic Jolley", "time": 1590868771200, "rating": 5.0, "text": "Very knowledgeable and helpful! Excellent customer service", "pics": null, "resp": null, "gmap_id": "0x88628426b43c255d:0x3913c6a863bf8d69"}
{"user_id": "102066858351875512022", "name": "Jill Smiley", "time": 1587590085473, "rating": 5.0, "text": "Love this place! Locally owned and very personable!", "pics": null, "resp": null, "gmap_id": "0x88628426b43c255d:0x3913c6a863bf8d69"}
{"user_id": "115693548172041834014", "name": "T Richie", "time": 1535857535937, "rating": 5.0, "text": "Always honest and reliable service! You won’t be disappointed! A wealth of knowledge and they are willing to teach you anything about pool care if you’d rather do it yourself. Great folks!", "pics": null, "resp": null, "gmap_id": "0x88628426b43c255d:0x3913c6a863bf8d69"}
{"user_id": "109459325257244791566", "name": "J Williams", "time": 1522674301571, "rating": 5.0, "text": "This is a full-service Pool Store. They can test your water there, or they can come to your house and work on your pool. I have used pool doctors for over 15 years. They have always gone the extra mile, explaining how to use their product. Let The Pool Doctors help you get ready to swim this summer.", "pics": null, "resp": null, "gmap_id": "0x88628426b43c255d:0x3913c6a863bf8d69"}
{"user_id": "107794888554830079006", "name": "Melissa Escamilla", "time": 1556032738068, "rating": 5.0, "text": "Extremely Helpful! Super informative and has a very comfortable professional atmosphere sprinkled with kindness :)", "pics": null, "resp": null, "gmap_id": "0x88628426b43c255d:0x3913c6a863bf8d69"}
{"user_id": "102009875895164431145", "name": "Daniel Hall", "time": 1570300293482, "rating": 5.0, "text": "Very knowledgable people that seem to enjoy helping you with your pool", "pics": null, "resp": null, "gmap_id": "0x88628426b43c255d:0x3913c6a863bf8d69"}
{"user_id": "111474004972308283748", "name": "Mark Drane", "time": 1566615364876, "rating": 5.0, "text": "Great staff.. good place for all your pool needs", "pics": null, "resp": null, "gmap_id": "0x88628426b43c255d:0x3913c6a863bf8d69"}
{"user_id": "107934951539565104144", "name": "John Moore", "time": 1552793175415, "rating": 5.0, "text": "Did a great job opening my pool this year super nice people.", "pics": null, "resp": null, "gmap_id": "0x88628426b43c255d:0x3913c6a863bf8d69"}
{"user_id": "108952152305809385935", "name": "Mike L", "time": 1522791266016, "rating": 5.0, "text": "Been a customer for years now. Great attitude. Great service.", "pics": null, "resp": null, "gmap_id": "0x88628426b43c255d:0x3913c6a863bf8d69"}
{"user_id": "117412425718737031193", "name": "Bill Kelley", "time": 1590268197109, "rating": 5.0, "text": "great people ,very helpful", "pics": null, "resp": null, "gmap_id": "0x88628426b43c255d:0x3913c6a863bf8d69"}
{"user_id": "116424236329109685500", "name": "Melissa Escamilla", "time": 1557949696773, "rating": 5.0, "text": "Friendly Staff, Great Follow up", "pics": null, "resp": null, "gmap_id": "0x88628426b43c255d:0x3913c6a863bf8d69"}
{"user_id": "100051948006460333027", "name": "ACE MANAGEMENT", "time": 1536846537408, "rating": 5.0, "text": "Thankful for their service.", "pics": null, "resp": null, "gmap_id": "0x88628426b43c255d:0x3913c6a863bf8d69"}
{"user_id": "100165017085716045506", "name": "parker smith", "time": 1559504611235, "rating": 1.0, "text": "We have been waiting on our slide to be fixed for 3 weeks if they do not do something we are better off going to blue dolphin", "pics": null, "resp": null, "gmap_id": "0x88628426b43c255d:0x3913c6a863bf8d69"}
{"user_id": "108481454104978872170", "name": "john franklin", "time": 1570473656454, "rating": 5.0, "text": "Great people", "pics": null, "resp": null, "gmap_id": "0x88628426b43c255d:0x3913c6a863bf8d69"}
{"user_id": "115402983024697573166", "name": "Gailen Carrasco", "time": 1561821968600, "rating": 5.0, "text": "We would highly recommend All Seasons Pools! Our entire experience was seamless beginning with our initial design consultation throughout construction. Tom was great in helping to explain the process and show us our options. By the time we finished our first meeting we had a complete visual of our finished pool! The entire team has been responsive and has gone above and beyond to exceed our expectations. We love our new pool!", "pics": null, "resp": null, "gmap_id": "0x888c327272ec6c25:0xc2ea3b8d8979456"}
{"user_id": "104542874766187656535", "name": "william wesson", "time": 1593545958632, "rating": 5.0, "text": "Great service and fresh seafood", "pics": null, "resp": null, "gmap_id": "0x888c327272ec6c25:0xc2ea3b8d8979456"}
{"user_id": "110850119223506280398", "name": "Wulf Koch", "time": 1425395588944, "rating": 5.0, "text": "Courteous and experienced crew. Been serving our pool since '08. No issues at all.", "pics": null, "resp": null, "gmap_id": "0x888c327272ec6c25:0xc2ea3b8d8979456"}
{"user_id": "112866646919155814817", "name": "Walter Bellamy", "time": 1621787791367, "rating": 5.0, "text": "Great place for all supplies and parts.. the people here are so knowledgeable and willing to help.. their advice has always been spot on.. I don't know of anyone I would trust more for a healthy and safe pool !", "pics": null, "resp": null, "gmap_id": "0x888a3bc8e4e3e9bd:0x8ec7324eb41abde0"}
{"user_id": "112067082982624472352", "name": "Mary O'bryant", "time": 1591847269164, "rating": 5.0, "text": "Really helpful staff for our first purchase at the pool center", "pics": null, "resp": null, "gmap_id": "0x888a3bc8e4e3e9bd:0x8ec7324eb41abde0"}
{"user_id": "113206716683665211355", "name": "Faith Morris", "time": 1559995205703, "rating": 5.0, "text": "Motor went out on our pool pump. Richie came out himself to fix it. He was kind and very willing to teach us. They have also changed our sand in our filter. We have no complaints! Prices were reasonable and they showed up when they said they would.", "pics": null, "resp": null, "gmap_id": "0x888a3bc8e4e3e9bd:0x8ec7324eb41abde0"}
{"user_id": "110666727194990098855", "name": "Josh Goddard", "time": 1563064929764, "rating": 4.0, "text": "Needed a hose search for a week. Bought 1 off walmart Website to big.. went to the pool center they were very helpful. Had exactly what I needed. Thank u very much. . Pool center appreciate ur business.", "pics": null, "resp": null, "gmap_id": "0x888a3bc8e4e3e9bd:0x8ec7324eb41abde0"}
{"user_id": "109284417233662459200", "name": "Trevor Jacobs", "time": 1531173040183, "rating": 5.0, "text": "I have shopped at the pool center for five years now my pool was on salt and they switched me over to Pristine Blue. I absolutely love it my pool hasn’t turned green since their son Gavin has installed a new pump for me he is very professional!  They are great people who share knowledge and take time to help! Would definitely check them out for your pool stuff!!", "pics": null, "resp": null, "gmap_id": "0x888a3bc8e4e3e9bd:0x8ec7324eb41abde0"}
{"user_id": "110607904826738232524", "name": "Glenn Gould", "time": 1557594095992, "rating": 5.0, "text": "Great folks. Long time there. Know how to keep you swimming not skimming.", "pics": null, "resp": null, "gmap_id": "0x888a3bc8e4e3e9bd:0x8ec7324eb41abde0"}
{"user_id": "116372464794119940458", "name": "Kenny Haney", "time": 1592227925926, "rating": 5.0, "text": "Great place and good people", "pics": null, "resp": null, "gmap_id": "0x888a3bc8e4e3e9bd:0x8ec7324eb41abde0"}
{"user_id": "105227440860237343680", "name": "Bret McGlaun", "time": 1522941612427, "rating": 3.0, "text": "Great place to go for service, but if there is any chance that you can buy what you need elsewhere, do so. Their prices are almost double what you will find at other places. A 4' piece of hose, 2 pvc fittings, a pump filter lid, and an o-ring cost $120.00. All of this could have been purchased elsewhere for about 1/2 of this price, but I was retrofitting a pump and needed advice on how to make it work which they were actually very helpful with. They really do have impeccable service, but their prices are not close to being competitive.\nThis review could have been split into two reviews:\n1 STAR FOR PRICES\n5 STARS FOR SERVICE", "pics": null, "resp": null, "gmap_id": "0x888a3bc8e4e3e9bd:0x8ec7324eb41abde0"}
{"user_id": "101642990203017176481", "name": "Chris Perkins", "time": 1491658776517, "rating": 5.0, "text": "They have always helped me out when I come in or called needing advice about my pool or hot tub. Very knowledgeable and willing to help!", "pics": null, "resp": null, "gmap_id": "0x888a3bc8e4e3e9bd:0x8ec7324eb41abde0"}
{"user_id": "100945408318633528390", "name": "Debbie Thomas", "time": 1462566245069, "rating": 1.0, "text": "We had purchased a liner from another dealer, but called The Pool Center in Rainbow City since they were local to get the liner installed.  We were told they did install liners for individuals, so we agreed to have it put in by The Pool Center.  Gavin Johnson came to install the pool liner for us and was here for around 4 hours and was paid $500 when the job was finished.  I didn't inspect the pool as I thought they were professionals and I was working,  I work online for a corporate office.  When my husband came home, he saw the liner was crooked and not aligned straight.  He call Gavin and left a message.  Gavin returned his call and said he would drive up and look at the following day, which he did.  When he arrived, I was told by Gavin  that they saw the liner was not straight after they had finished, but the holes had already been cut for the returns.  They thought the water would straighten the wrinkles out.  Gavin and his helper tried to pull a few of the side wrinkles out, but did not correct the problem.  My husband was talking to Gavin and told him the liner was not centered in the pool, Gavin said it was probably just a bad liner and left.  I called The Pool Center and talked with the owner and she said they couldn't do anything about it since we did not buy the liner from them.  They would only correct their error if we had bought the liner from them.  My husband has been undergoing chemo and this is the only reason we didn't install ourselves in the past.  It is bad when a company doesn't stand behind their labor even if you buy the product elsewhere.  I have also posted photos of our pool on the site and am contacting the BBB.", "pics": null, "resp": null, "gmap_id": "0x888a3bc8e4e3e9bd:0x8ec7324eb41abde0"}
{"user_id": "105804476630149485966", "name": "Rachel Watson", "time": 1496434612140, "rating": 5.0, "text": "Very friendly! I had alot of questions and trouble with my filter and the lady walked me through how to fix it. Great Service !!", "pics": null, "resp": null, "gmap_id": "0x888a3bc8e4e3e9bd:0x8ec7324eb41abde0"}
{"user_id": "104181574828216268728", "name": "Danny Powell", "time": 1594670861164, "rating": 4.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x888a3bc8e4e3e9bd:0x8ec7324eb41abde0"}
{"user_id": "109775945410288534787", "name": "Ramona Williams", "time": 1499286916138, "rating": 5.0, "text": "When my old hottub died, I set out to find the perfect hottub. I found it! I bought a Hotsprings Hotspot Relay and I couldn't be happier. The customer service I received from Lori, Gavin, and Lori's husband, I didn't get his name, was the best I think I've ever received anywhere. It was so nice to deal with a locally owned business and people who really care about their customers. They delivered everything that they promised. Gavin couldn't have been more professional and timely with the delivery and installing the cover cradle, pillows, filter, etc.  My hottub is awesome and this was an awesome experience!", "pics": null, "resp": null, "gmap_id": "0x888a3bc8e4e3e9bd:0x8ec7324eb41abde0"}
{"user_id": "113515428249954327534", "name": "Paula Stewart", "time": 1536702447082, "rating": 3.0, "text": "Took a long time to get the right chemicals to clean up our pool. Finally had to use a pool service.", "pics": null, "resp": null, "gmap_id": "0x888a3bc8e4e3e9bd:0x8ec7324eb41abde0"}
{"user_id": "110653552037290767262", "name": "Lynn Shelhart", "time": 1520988267619, "rating": 4.0, "text": "They were really helpful", "pics": null, "resp": null, "gmap_id": "0x888a3bc8e4e3e9bd:0x8ec7324eb41abde0"}
{"user_id": "113162274453237038355", "name": "Rose Parker", "time": 1538061712600, "rating": 5.0, "text": "Had the parts I needed to get things going for summer", "pics": null, "resp": null, "gmap_id": "0x888a3bc8e4e3e9bd:0x8ec7324eb41abde0"}
{"user_id": "111358825442834089712", "name": "Annette Thompson", "time": 1501154101054, "rating": 5.0, "text": "Great people!", "pics": null, "resp": null, "gmap_id": "0x888a3bc8e4e3e9bd:0x8ec7324eb41abde0"}
{"user_id": "104146607796122412734", "name": "Kimberly Cole Zemke", "time": 1599153972428, "rating": 5.0, "text": "He had everything we needed a heater and thermisters for our jacuzzi..  Thanks to the owner we got our jacuzzi fixed and my Mum's birthday party was a huge success.  I am eternally grateful to Tony the owner.", "pics": null, "resp": {"time": 1600786761865, "text": "Fantastic news!  Glad you got things rolling before the party!  Lynn"}, "gmap_id": "0x8888a9edffc4cfc5:0x36b9b7154f8bf57d"}
{"user_id": "114647869238456610397", "name": "Wes Jones", "time": 1566417368814, "rating": 5.0, "text": "Lynn, Drew & Margerat are always helpful. They are very knowledgeable about any issues I have. great place, highly recommend.", "pics": null, "resp": {"time": 1566440236350, "text": "Thank you, Wes.  Some people make it so easy to take care of!"}, "gmap_id": "0x8888a9edffc4cfc5:0x36b9b7154f8bf57d"}
{"user_id": "106816396734449417501", "name": "sam myrick", "time": 1566014634494, "rating": 5.0, "text": "Friendly staff and good selection", "pics": null, "resp": {"time": 1566581252743, "text": "Thank you, Sam.  We appreciate your business!"}, "gmap_id": "0x8888a9edffc4cfc5:0x36b9b7154f8bf57d"}
{"user_id": "118366224036778841275", "name": "James Wilson", "time": 1555973746220, "rating": 5.0, "text": "Friendly staff and very knowledgeable about products", "pics": null, "resp": {"time": 1566581318007, "text": "Somehow, I missed thanking you for the 5 stars, James!  We appreciate your business!"}, "gmap_id": "0x8888a9edffc4cfc5:0x36b9b7154f8bf57d"}
{"user_id": "116385531531207291766", "name": "Michael Clark", "time": 1539894505659, "rating": 5.0, "text": "The best place for pool supplies.", "pics": null, "resp": {"time": 1566581379743, "text": "Thanks for the 5 stars, Michael!  We appreciate your business!"}, "gmap_id": "0x8888a9edffc4cfc5:0x36b9b7154f8bf57d"}
{"user_id": "105114077276540157464", "name": "Danny Hodge", "time": 1572761318664, "rating": 5.0, "text": "I love it", "pics": null, "resp": {"time": 1600786862747, "text": "And we love you!"}, "gmap_id": "0x8888a9edffc4cfc5:0x36b9b7154f8bf57d"}
{"user_id": "109956590333851989651", "name": "Fox101", "time": 1537633270806, "rating": 5.0, "text": "Great service and great staff", "pics": null, "resp": {"time": 1566581397942, "text": "Thank you, Chris!  We appreciate those 5 stars!"}, "gmap_id": "0x8888a9edffc4cfc5:0x36b9b7154f8bf57d"}
{"user_id": "112551598749785937977", "name": "Judy Elliott", "time": 1567617741695, "rating": 4.0, "text": "Very knowledgable about pool problems", "pics": null, "resp": {"time": 1567625315324, "text": "Thank you, Judy.  We certainly try hard!  Thank you for your business."}, "gmap_id": "0x8888a9edffc4cfc5:0x36b9b7154f8bf57d"}
{"user_id": "102786413455361026301", "name": "cara vaughan", "time": 1622157042570, "rating": 1.0, "text": "Last year I called them to do an education summary. The company that built my pool is now out of business, go figure. They quoted me one price on phone then after he came and instructed us on pool maintenance I received a bill for another $135.\nThis year I called for pump repair/replacement. We were quoted one price that was to include new salt cell and replumb so we could maintain salt cell.\nThe tech that came out said “oh, I don’t know anything about salt cells I’m just here to replace pump.”  I was not hone my son was there and did not know the whole agreement.\nWhen my daughter in law called back to discuss she was told no the quote was for pump replacement only. If we had repaired pump it would have included the salt cell.\nThis is totally unacceptable.\nI will not use them again!!", "pics": null, "resp": null, "gmap_id": "0x8889160c0cb33e79:0xf7f0ec7acbfe0330"}
{"user_id": "104907493161419427807", "name": "Jeremy Elkourie", "time": 1621908559426, "rating": 5.0, "text": "I previously used another service that was so frustrating I did not know what to expect from Shoemaker pools.  I was surprised at how responsive they were returning their calls within 48 hours.  They were able to resolve an issue in less than a month that the previous company couldn't resolve in a year.  They treated me more like a friend than a random customer.  I have called them every year to open and maintain my pool for the last 3 years and have yet to be disappointed.  I highly recommend giving them a call for whatever your pool needs may be.", "pics": null, "resp": null, "gmap_id": "0x8889160c0cb33e79:0xf7f0ec7acbfe0330"}
{"user_id": "102862903885572430267", "name": "Kalmisha Carter", "time": 1621293962295, "rating": 5.0, "text": "Awesome Service! Great Quality Products. Owner is a great guy to do business with.", "pics": null, "resp": null, "gmap_id": "0x8889160c0cb33e79:0xf7f0ec7acbfe0330"}
{"user_id": "109421680609307307869", "name": "Elizabeth Jackson", "time": 1608429908925, "rating": 5.0, "text": "If you are looking for a new pool service company Shoemaker should be first on your list. From my first contact Landon and his team have been incredibly responsive. They do what they say they they are going to do every single time. My service professional is David and he is caring and considerate. He does beautiful work and always goes over and above what is expected. For reference I have a pool, hot tub and fountain. They have never looked better!", "pics": null, "resp": null, "gmap_id": "0x8889160c0cb33e79:0xf7f0ec7acbfe0330"}
{"user_id": "104199122910579571381", "name": "Carol Brooker", "time": 1608060318110, "rating": 5.0, "text": "We have always used Shoemaker pools for years. Starting with Mike the owner over the years they have provided us with excellent service. Only one call to ask for extra service if we have a storm or if we are having a special event and it is take  care of. You could not ask for a better pool service. Now Landon is helping us but I suspect Mike is still around. This is truly a wonderful family business providing excellent service.\n\nCarol Brooker and Stan Faulkner", "pics": null, "resp": {"time": 1608320405985, "text": "It’s been a pleasure to work and continue working with you and Stan! Thanks for taking the time to give us a review."}, "gmap_id": "0x8889160c0cb33e79:0xf7f0ec7acbfe0330"}
{"user_id": "100289857737343284961", "name": "Jeff Smith", "time": 1608047557459, "rating": 5.0, "text": "We’ve used Shoemaker pool’s for 5 years. They do excellent work. We don’t have to think about our pool. Their guys are very knowledgeable. Always on time. What little interaction I’ve had with corporate has been very positive.", "pics": null, "resp": {"time": 1608050742558, "text": "Thank you for taking the time to leave us this amazing review!"}, "gmap_id": "0x8889160c0cb33e79:0xf7f0ec7acbfe0330"}
{"user_id": "107013373112412292202", "name": "Dean Thornton", "time": 1608052423777, "rating": 5.0, "text": "Shoemaker Pool Service has been a reliable company for our pool maintenance for several years now. They take care of everything we need including any repairs. Every week, they send us an email confirming they have completed our service including a photo of our nice, clean pool.", "pics": null, "resp": {"time": 1608054464424, "text": "We are thrilled that you enjoy the weekly service emails of your pool. Thank you for the review!"}, "gmap_id": "0x8889160c0cb33e79:0xf7f0ec7acbfe0330"}
{"user_id": "102199188715175538257", "name": "C Michelle Harris", "time": 1623670643833, "rating": 1.0, "text": "Never heard back from them. So I don't know", "pics": null, "resp": null, "gmap_id": "0x8889160c0cb33e79:0xf7f0ec7acbfe0330"}
{"user_id": "101937006619211029336", "name": "Mr. PNUT", "time": 1583162395793, "rating": 5.0, "text": "Excellent, knowledgeable and friendly staff.\nGreat showroom!", "pics": null, "resp": {"time": 1569504994175, "text": "Thank you!"}, "gmap_id": "0x8889160c0cb33e79:0xf7f0ec7acbfe0330"}
{"user_id": "110493877804612685559", "name": "Lynn Souissi", "time": 1551537822280, "rating": 5.0, "text": "Experienced staff and super friendly.  They've been around for a long time and their  knowledge is unsurpassed. I wouldn't use anyone else", "pics": null, "resp": null, "gmap_id": "0x8889160c0cb33e79:0xf7f0ec7acbfe0330"}
{"user_id": "116329482656602134621", "name": "justin maddux", "time": 1523372754045, "rating": 5.0, "text": "I had the pleasure of meeting  Nicole today, she was super friendly. I strongly recommend shoemaker pools!!!!", "pics": null, "resp": null, "gmap_id": "0x8889160c0cb33e79:0xf7f0ec7acbfe0330"}
{"user_id": "106086262103082141782", "name": "TG Fxte", "time": 1555095727353, "rating": 1.0, "text": "Terrible customer service and very rude staff. Was told wrong chemicals to put in my pool.", "pics": null, "resp": {"time": 1555159481564, "text": "I am sorry to hear about your experience . Please email me to discuss your experience so we can make sure that we can improve in the future. scott.fuller@shoemakerpools.com .\nThanks for your feedback."}, "gmap_id": "0x8889160c0cb33e79:0xf7f0ec7acbfe0330"}
{"user_id": "100688060459065612599", "name": "Rudy Howard", "time": 1605187112592, "rating": 5.0, "text": "clean and professional", "pics": null, "resp": null, "gmap_id": "0x8889160c0cb33e79:0xf7f0ec7acbfe0330"}
{"user_id": "104221693756549383338", "name": "Billy Cooper", "time": 1561065328530, "rating": 1.0, "text": "Never got back with", "pics": null, "resp": {"time": 1561068464533, "text": "I'm sorry for your  experience. Did you speak to a representative from our company to leave a message?  Did you come into our store?  I would like your feedback so we can improve in the future."}, "gmap_id": "0x8889160c0cb33e79:0xf7f0ec7acbfe0330"}
{"user_id": "103520693613177132330", "name": "Pure Bliss", "time": 1568465029219, "rating": 4.0, "text": "Service was awesome", "pics": null, "resp": {"time": 1568466299088, "text": "Thanks for your review. What can we do in the future to get 5 Stars?"}, "gmap_id": "0x8889160c0cb33e79:0xf7f0ec7acbfe0330"}
{"user_id": "108102753850718109323", "name": "David Mauricio", "time": 1531698000656, "rating": 5.0, "text": "God pool  company", "pics": null, "resp": null, "gmap_id": "0x8889160c0cb33e79:0xf7f0ec7acbfe0330"}
{"user_id": "108061412271635176982", "name": "Mrs Tuck", "time": 1616779517843, "rating": 5.0, "text": "I’ve used this cleaning company more than once! Anyone can do a great job the first time but to continually do a great job and be professional is very rare in the time we’re living in! I can honestly say that I’m truly grateful for this company. They left my building smelling like lemons it lasted up to 3 weeks!! They arrived within the appointed time frame and really gave me a fresh perspective on using cleaning companies! I have to say that I was pleased from booking to seeing the results of the work! Thank you for your professionalism and a job well done!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "110280413325210889562", "name": "tor zaleski", "time": 1546372850873, "rating": 1.0, "text": "I paid $285 for a \"deep clean\" so that my wife could relax and start off the new year less stressed. We selected for the baseboards and doors to be cleaned. Keep in mind, our house was so clean when the two cleaners arrived they even commented on this. Here is a photo of just one of the baseboards in our master bathroom and the magic eraser after my wife cleaned it herself. Not only did my wife have to do the cleaning herself, which is what I was trying to avoid, but now she is upset about having wasted so much money on something to be done poorly. Will not use again, nor will I recommend.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPRi78nyZLVEtDWk3WPkKwEmpwAO3MGSbdpn9mF=w150-h150-k-no-p"]}], "resp": {"time": 1546466516411, "text": "Mr Zaleski, We want to thank you for allowing us to rectify our error! We are thrilled you are satisfied with our service and our team looks forward to servicing you again in the near future! ECC strives to deliver the best possible experience to all of our customers. Expeditious, courteous, professional, detailed service is our goal for every customer, every single time. Guaranteed!\nBest regards,\nMrs. Burden\n334-246-2230"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "103348245218605346379", "name": "Shemeka Brock", "time": 1622492407394, "rating": 5.0, "text": "I booked Expert Cleaning Concepts for a messy closet makeover and to organize my cabinets. In the 3 hours that they were at my home. They cleaned my entire apartment and left it spotless. The workers were friendly and very attentive.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "109844368738949867351", "name": "Hayden J", "time": 1611414287913, "rating": 5.0, "text": "I can not share enough good things about this company! When I call these sweet ladies, I feel like I am talking to a bunch of my friends, not a corporate cleaning service! These women are amazing, professional, always on-time, very affordable and just so kind and willing to work with you for what you need. I am so thankful for Expert Cleaning Concepts, they have helped me in many tight schedule situations and they always do an amazing job! Use this company!! You will love them and use them forever!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "109173031692438852187", "name": "Amber Daniel", "time": 1613858938495, "rating": 5.0, "text": "Expert Cleaning Concepts is friendly, flexible, very reliable and care about their clients. I like the fact that the team shows up when scheduled and get the job done. My experience as an intern was a breath of fresh air. I was provided all the tools I needed to perform my duty. The people at ECC were courteous which made my job easier. I didn’t feel like a burden if I needed to ask for assistance. I learned not to limit myself and that it’s never too late to pursue your dreams.\nThe CEO is simply amazing. She is  the epitome of professionalism. I highly recommend the company for your next cleaning service.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "111847033679332176584", "name": "Jay calloway", "time": 1613171023491, "rating": 5.0, "text": "I’ve been here for a week and I absolutely love it. Good team work , very professional and I would refer anybody who wanna get better with business and office work to apply for the internship here and of course mrs. Johnson is absolutely a nice lovely women who I much look up too.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "116004775598421544548", "name": "Toyar Holstick", "time": 1611347739797, "rating": 5.0, "text": "Expert Cleaning Concepts is a very professional and profound business. They offer good quality cleaning to each and every customer. I recommend Expert Cleaning Concepts for your cleaning needs.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "116643895421576103564", "name": "Hillary Caldwell", "time": 1609815904168, "rating": 5.0, "text": "This company is amazing, professional, and they take pride in what they do. I was very impressed with how they went the extra mile to make my business look extraordinary for my staff and clients. I definitely recommend this company, you will not go wrong!!!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "104085357080517366717", "name": "Hustle Inc Films", "time": 1600123690465, "rating": 5.0, "text": "I had just went through a break up and I’m a guy, that works long shifts and I just didn’t have the energy to clean like I’m suppose to.. ECC came and did a wonderful job... I have a lovely home and when ECC finished it looked like a brand New Home again, they was on time, and professional, I’ve told family and friends! If u looking for finial confirmation, my experience should be it!", "pics": null, "resp": {"time": 1602596802724, "text": "We know how hard this can be. Thank you for opening up your home to us. Please do not hesitate to give us a ring again!"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "117277473205720004595", "name": "Teresa Hicks", "time": 1602599763772, "rating": 5.0, "text": "My name is Teresa and I have recently concluded my Summer 2020 internship program with ECC. I greatly enjoyed being a part of the Expert Cleaning Concepts' staff during internship. I became immensely inspired working directly alongside the CEO, Mrs. Johnson, and her phenomenal management & staff. The program helped me to master my interpersonal skills as well as learn the dynamics of running a successful company. It also gifted me the opportunity to gain office experience to amplify my resume. I highly recommend to the youth to join ECC's internship program if they are interested in starting their own business, a non-profit organization, or desire an experience to enhance their resume.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "102286607813888488387", "name": "Betty Janigan", "time": 1597969288740, "rating": 5.0, "text": "This cleaning service is exceptionally professional. Friendly. Courteous and very prompt.  They went above and beyond to meet my needs and more.  Expert Cleaning is definitely a company that I will refer as well as continue to use their services at any cost, the prices as well are amazing.", "pics": null, "resp": {"time": 1602596973241, "text": "Thank you Mrs. Betty. You're one of a kind. We appreciate you."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "112087446669521944386", "name": "Jeanne Manning", "time": 1604755726133, "rating": 5.0, "text": "Extremely professional and did a fantastic job.  Top Notch!  I have used others and won't go back.  Thank you ladies!!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "114719237108219352815", "name": "Erika Byrd", "time": 1605637683218, "rating": 5.0, "text": "“ Expert cleaning concepts is a professional and reliable cleaning company, they are always on time and put 100% into everything they do! They are an amazing business to work with and I will be using them again...", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "103144182908697744261", "name": "Natalie Winston-Calloway", "time": 1594922898990, "rating": 5.0, "text": "Expert Cleaning Concepts, INC is a one of a kind business! Not only does this business provide excellent cleaning services for their customers, they also invest into the community! This business not only values their customers, they value each individual in the community and this is apparent in the numerous community service projects that this company has undertaken! The owner of this company had a strong vision for what this company would stand for and it is amazing to witness such a wonderful asset in the community!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "117646201494246139141", "name": "editoria thompson", "time": 1600524678186, "rating": 5.0, "text": "KoKo and Dorthy did a great job on my apartment. I wasnt there because I had to work so my friend let them in when I got home my apartment was nice and clean they did an AMAZING job I definitely will use this company again and the same cleaners!!", "pics": null, "resp": {"time": 1602596687231, "text": "Oh WOW, this is awesome news! We appreciate your business and feedback."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "106476171222533696614", "name": "Jayla Young", "time": 1623338205987, "rating": 5.0, "text": "Team 3 did an amazing job", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "101084324556244846686", "name": "Timothy Gary", "time": 1604961335351, "rating": 5.0, "text": "I've been working with Mrs. Johnson at Expert Cleaning Concepts and working for ECC has been an excellent experience and an on time blessing! I have enjoyed every week as I have learned how the company operates and how I should run a business when I start my own. Mrs. Johnson and the rest of the office crew were so welcoming but very professional and I dearly enjoy my mornings with them all. I have seen our field workers do an excellent job as well with cleaning residents for our customers. Mrs. Johnson holds our cleaners to a high standard and they set themselves to met those expectations! ECC is a wonderful place of business and also has great internship and job opportunities.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "100793870347909550256", "name": "Sherry Grady", "time": 1606522523064, "rating": 5.0, "text": "Love these ladies! They are wonderful. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "100793870347909550256", "name": "Sherry Grady", "time": 1606522523064, "rating": 5.0, "text": "Love these ladies! They are wonderful. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "114135886059632608692", "name": "Chantel Snow-Hall", "time": 1594248653253, "rating": 5.0, "text": "I am very pleased with Expert Cleaning Concepts! From the staff to getting the job done, they are always professional. They get the job done in a timely manor and complete the job with excellence! If you are looking for good quality cleaning services I highly recommend Expert Cleaning Concepts! They are THE BEST!!!", "pics": null, "resp": {"time": 1594304093790, "text": "Thank you Mrs. Hall for your feedback."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "100059063313620454661", "name": "Adri", "time": 1605627335491, "rating": 5.0, "text": "Everyone was so professional and polite....It made my experience that much more enjoyable!!! I definitely will be coming back!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "117891055889717584945", "name": "Shay Edwards", "time": 1592152696615, "rating": 5.0, "text": "I must say exceeded my expectations thus far!!! Wonderful staff and very professional. I actually won a free deep clean and when i say they went above and beyond they truly did. I have been in my duplex for 4 years so to come back from my vacation to my home looking like we just moved in was amazing.", "pics": null, "resp": {"time": 1592169954333, "text": "Ms. Shay, WOW! Thank you for the feedback. We hope to see you soon for another house cleaning."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "112513883971139253441", "name": "danielle nelms", "time": 1595293123385, "rating": 5.0, "text": "I wanted to do business with them when I seen them do the free baskets for the elderly. They gave them free cleaning supplies and free rides to wherever they needed to go. When I called to book with them, they answered all of my questions and was very professional. They service was very detailed and affordable. I will book again very soon", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "102872702587099605286", "name": "jessica dunn", "time": 1597961711027, "rating": 5.0, "text": "I would highly recommend This Cleaning Company. The service they provide is excellent and they exceed my expectations every time.\nThey always do a thorough clean,\nthey are prompt and very reliable.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "103977994403431270925", "name": "Betty King", "time": 1600126899302, "rating": 5.0, "text": "Expert Cleaning Concepts, is the most professional service I know, bring back life and light to your home. Give them a call you will not be disappointed. Thank you again", "pics": null, "resp": {"time": 1602596725967, "text": "Mrs. Betty, we truly appreciate your feedback. You're fantastic."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "116391508695011887938", "name": "Ryan Conner", "time": 1597720378198, "rating": 5.0, "text": "Great job by GREAT people. Upon meeting the cleaning crew they all greeted me very professionally and energetic. I Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "105077713063742401485", "name": "Felicia Jones", "time": 1602179731271, "rating": 5.0, "text": "Hey,  The experience were tremendous and work very remarkable and quality was good so if anyone wants good service One call that all Love them🖒🖒🖒", "pics": null, "resp": {"time": 1602596649033, "text": "Hi Ms. Felicia! You're awesome! Thank you for the feedback."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "107571891034678982110", "name": "Jacqueline Felton-Williams", "time": 1592051420627, "rating": 5.0, "text": "I must admit, great company!!! Professional and caring. Not only a cleaning service but they take time to give back to the community. Every deed is appreciated. A blessing to the community 🙏🙏🙏", "pics": null, "resp": {"time": 1592170049574, "text": "Thank you Mrs. Williams! You're terrific. Thank you very much for your feedback."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "105945195523466207860", "name": "BRANDON DIXON", "time": 1599500351268, "rating": 5.0, "text": "Exceptional cleaning service. Highly recommend. Will not hire or turn to any other company. Lifetime customer here.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "115054062717262949751", "name": "House of K Boutique & Beauty", "time": 1594910573805, "rating": 5.0, "text": "This company is amazing for your cleaning needs. They were very responsive and attentive to the things we needed done. I highly recommend booking them.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "105782660506005877156", "name": "cellabianca gray", "time": 1604030451082, "rating": 5.0, "text": "Definitely a great cleaning company that get the job done to perfection! No complaints", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "115379306594258051071", "name": "Kelli Coulter", "time": 1575946025026, "rating": 5.0, "text": "I booked the 2 maids for 2 hours for my house and was able to add on some additional services for a very reasonable price. They came out early and got started right away. They did such an amazing job in all of the rooms but especially the bathrooms. I will definitely be using them again!", "pics": null, "resp": {"time": 1578182946279, "text": "Hi Kelli, thank you for leaving us your feedback. We truly appreciate it. Looking forward to seeing you soon!"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "106691272834494532737", "name": "Alfreda Hyman", "time": 1605628353590, "rating": 5.0, "text": "What a rewarding experience, nothing like a Clean Home, ready for the Holidays. Thanks ECC.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "116559098163740682815", "name": "Tasha Burks", "time": 1597968497940, "rating": 5.0, "text": "Very passionate about their customers needs. Also ECC is always giving back to their community. Highly recommend!!", "pics": null, "resp": {"time": 1602597021128, "text": "Thank you Mrs. Tasha. It's an honor to know you. We truly appreciate your kind words."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "117839974235027440483", "name": "Jacarl Gullatte", "time": 1594827965152, "rating": 5.0, "text": "I recommend ECC hands down. This is the best cleaning service there is. The staff is always trustworthy, professional and prompt. There’s no other cleaning service like it.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "105753341787675241580", "name": "Mercedes Benford", "time": 1599772664486, "rating": 5.0, "text": "Wonderful cleaning service ♥️♥️.. They definitely aim to please every single time !! Book an appointment, you won't be disappointed !!!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "110564799669835256848", "name": "FrezzKnow Vlogs", "time": 1591706186174, "rating": 5.0, "text": "I highly recommend this awesome cleaning service and their staff.  Very punctual with time, no corners cut, and they made sure I was satisfied. The price is right and there was no spot left in sight!", "pics": null, "resp": {"time": 1592170109222, "text": "It was great cleaning your come! Once again, CONGRATS."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "114542152738061225221", "name": "Kelli Linander", "time": 1572008495974, "rating": 5.0, "text": "I highly recommend Expert Cleaning Concepts to come clean for you! My experience was a great one. My house was such a mess, but when they got done, it was spotless!! They were so thorough and highly professional. I look forward to having them back every other week. I assure you that if you give them a call for your cleaning needs, you will not regret it.", "pics": null, "resp": {"time": 1572281092740, "text": "Thank you Mrs. Linander for your feedback. It is always a pleasure to service you. You are a pleasure to work with.:-)"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "101281110754948266979", "name": "Altumura Rosencrantz", "time": 1597425098334, "rating": 5.0, "text": "I love this company very dependable and they do an outstanding job.  The girls are awesome and very nice!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "110734919219272876945", "name": "Michael Martin", "time": 1594256190750, "rating": 5.0, "text": "ECC has great a quality service. The staff is so amazing and really care about the job and customers. ECC is very active in the community is well. I applaud them for everything they do and the hard work that they put in.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "101725125993651266982", "name": "Nikki W", "time": 1597962629634, "rating": 5.0, "text": "Very friendly cleaners came. They did an exceptional job. Everything was to my liking.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "103773432059572047330", "name": "Al Dixon", "time": 1580854571955, "rating": 5.0, "text": "Best cleaning service in town! I was skeptical about hiring cleaners for my home initially but my coworker recommended this business. I was blown away by their professionalism and their excellence! I will definitely be using them in the future. Thanks so much team!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "113854749791217480347", "name": "Iciameka Baker", "time": 1579141125427, "rating": 5.0, "text": "The two ladies were on time and very friendly. They introduced themselves and asked was there any specific thing they should focus on!  They were very meticulous and paid great attention to detail. It felt good knowing everything is clean and sanitized. I really didn’t think they would clean an entire 4 hours, but once I went back into my new home, it was spotless! NOW we’re ready to be moved in!!! I would highly recommend them!", "pics": null, "resp": {"time": 1579276807320, "text": "Mrs. Baker, once again Congratulations on your new home. It is truly beautiful. Our team enjoyed making your home perfect before the big move. You and your husband deserve the BEST from us. Thank you for recommending us. We are looking forwarding to servicing you in the future."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "116082061771669344850", "name": "Tina Stevenson", "time": 1594269256414, "rating": 5.0, "text": "ECC is the best company EVER!!! Caring and professional.. A blessing to the elderly during this pandemic. I would definitely recommend ECC for all your cleaning needs", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "110221342821970875674", "name": "Latrica James", "time": 1588718854684, "rating": 5.0, "text": "This company cleaned our church due to COVID 19. They are very friendly, very professional and were very responsive. I contacted the owner because that was the only contact info I knew and she never rerouted me! She scheduled gave me quotes, scheduled my appointment and emailed me what was to be expected! The clean up ladies were very friendly and professional also. I will definitely be using them again  and referring them to everyone needing services! I highly recommend ECC!", "pics": null, "resp": {"time": 1589738303893, "text": "Mrs. James,\n\nThank you for giving us your feedback. We truly appreciate you. It was our pleasure to clean your church."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "110240837285116335661", "name": "Mixti Cox", "time": 1582393222831, "rating": 5.0, "text": "Expert Cleaning Concepts did an absolutely brilliant job on a horribly filthy trailer.  In one day they got it to near perfect condition.  The staff was punctual and very professional and got right to work.  The owner, office people and crew were so friendly and easy to work with that I will never use any other cleaners service.", "pics": null, "resp": {"time": 1583169609434, "text": "Mrs. Cox, it was truly a pleasure to assist you. We made it our business to ensure you were well taken care of. Thank you so much for entrusting us with the large project."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "103021227692319094301", "name": "roderick autry", "time": 1605635026158, "rating": 5.0, "text": "Very professional and precise would definitely recommend repeatedly and immediately!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "101060525772985858908", "name": "Martavious Johnson", "time": 1592160392159, "rating": 5.0, "text": "This is an amazing company with a true passion for what they do. They care about people and you can definitely count on them to get the job done precisely & promptly every time you call them.", "pics": null, "resp": {"time": 1592169830382, "text": "Thank you! We truly appreciate your feedback.:-)"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "109496663830987824136", "name": "Mona McDonald", "time": 1600119896668, "rating": 5.0, "text": "Expert cleaning did an Awesome job and very helpful and such a Blessing to our community.", "pics": null, "resp": {"time": 1602596882522, "text": "You are so kind Mrs. Mona! Thank you for everything. See you soon."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "114291329548217488902", "name": "Donnie Smithwick", "time": 1579893704370, "rating": 5.0, "text": "Expert Cleaning always does a great job! It is wonderful to come home to a clean home. The business that I work for recently had to change their cleaning crew. We hired Expert Cleaning to do the job. Excellent work and very dependable.", "pics": null, "resp": {"time": 1579907918129, "text": "Mrs. Donnie, you are such an AMAZING client. We truly love cleaning your home and office. Thank you for your generosity and always making the environment so pleasant. We wish we could clone you 10X. Thanks a lot for everything.. We'll see you again within a few days."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "104427289016552852268", "name": "Shirley Miles", "time": 1592172700014, "rating": 5.0, "text": "Not only does the company have an excellent cleaning service but she serves the community as well through feeding the elderly and creating care packages for them. This is especially important in times like these. Thank you for all you do!!!!", "pics": null, "resp": {"time": 1592169886942, "text": "Thank  you Ms. Shirley! We truly appreciate your feedback.:-)"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "105212834932065117284", "name": "Brandon Gage", "time": 1580657424077, "rating": 5.0, "text": "I invited Expert Cleaning to help me with my home and I couldn't be more thankful. These guys are awesome at what they do. Everyone is very professional and nice. I sure will have them back to assist me with cleaning and I will refer them to a friends and family. Thank you guys!!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "100564856000520634580", "name": "Jessica Oliver", "time": 1581613293514, "rating": 5.0, "text": "This is my third time using the company and the service has been excellent. Very professional and always on time. The owner is caring and makes sure that the customers are always satisfied. I would definitely recommend this company to anyone.\n-Mrs. Oliver", "pics": null, "resp": {"time": 1582240603738, "text": "Thank you for your heartwarming compliments to our ECC family, crew and services, Mrs. Oliver. You deserve our very best."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "112829739728545873581", "name": "Laura’s floyd", "time": 1592055853024, "rating": 5.0, "text": "I recently volunteered for an event hosted by this business that gave away free care packages to the elderly and it was amazing! This company goes above the regular standard of a business and gives back to their community. I loved every second of it!", "pics": null, "resp": {"time": 1592170006926, "text": "Ms. Laura, thank you for volunteering at our most recent event. You're awesome and we thank you for your feedback."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "104102278705146883314", "name": "Kiryana Newton", "time": 1591843423067, "rating": 5.0, "text": "I ABSOLUTELY JUST LOVE EVERYTHING ABOUT THIS BUSINESS !!!\nVery great communication, friendly staff , not to mention this has been the best cleaning i’ve encountered during my lifetime ! HIGHLY RECOMMEND!!", "pics": null, "resp": {"time": 1592170084221, "text": "Thank you! We truly appreciate your kind words."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "104125532003817834821", "name": "Serlanda Hannah", "time": 1579048866997, "rating": 5.0, "text": "Very Fast, Friendly & professional service! Very punctual. Staff is very trustworthy. I was more than pleased. I definitely will be calling them again!!", "pics": null, "resp": {"time": 1579276639170, "text": "Thank you Mrs. Hannah. We truly appreciate your feedback! You're truly phenomenal!"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "112024403204211805132", "name": "Stephanie Tucker", "time": 1592277578914, "rating": 5.0, "text": "what a awesome company not only do you and your team clean, but you and your team are blessing others through giving. keep giving and do what you were called to do. i know the community thanks you.", "pics": null, "resp": {"time": 1592482377011, "text": "Ms. Tucker, thank you very much. We truly appreciate your feedback. Our team absolutely love giving back to our communities."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "105007879585565915481", "name": "Lucy Winn", "time": 1580860626876, "rating": 5.0, "text": "The best cleaning service around town. Trust me, you will not be disappointed. I enjoy coming home to a clean home after a long day of work. I been using Expert Cleaning Concepts for many years & highly recommend this company. Two of my favorite teams are Aaron & CeCe, & Jessica & KoKo. They does an amazing job & has my home spotless every visit!!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "104132358779959219136", "name": "Inez Ottis", "time": 1605634066537, "rating": 5.0, "text": "My place never smelled soo good until I contacted Expert Cleaning Concepts INC. thank you ladies", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "102981866134770642772", "name": "Emperor KJ", "time": 1580861422768, "rating": 5.0, "text": "My first time using an cleaning company and I must say I am amazed. The ladies came out and done a wonderful job. They was on time, friendly , and was very detailed with their work. Thanks ECC, I will definitely be using again.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "106214597111090550360", "name": "Desiree Ross", "time": 1592155395311, "rating": 5.0, "text": "I would like to extend gratitude for ECC amazing community service. Recently this awesome company blessed 100s of elders with essential care packages and offered free rides to assist with servicing our elders during this pandemic safely as possible. ECC is more than a cleaning company ECC is our community! Thank you ECC for always going above and beyond for your customers and community!", "pics": null, "resp": {"time": 1592169918286, "text": "Ms. Desiree, you have warmed our heart with your review. We truly appreciate you."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "108834541600111463769", "name": "Cheryl Bowers", "time": 1583025939846, "rating": 5.0, "text": "I have been using Expert  Cleaning Concepts  for the last several years. I would never use another cleaning company.  They are awesome and treat your home as if it was their own. Completely satisfied!!", "pics": null, "resp": {"time": 1583169679448, "text": "Mrs. Bowers, you're so awesome! We cannot thank you enough for the continued business."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "107292899058626104971", "name": "Judy Fernandez", "time": 1568468730224, "rating": 5.0, "text": "RECOMMENDATION: ⭐️⭐️⭐️⭐️⭐️\nExpert Cleaning Concepts!!!!\nWOW! This company consistently delivers exceptional service!\nI’ve been using them a while and  they are thorough and detailed oriented. EVERY. SINGLE. TIME!\nMy house is sparklingly clean!\n\nOther cleaning companies are great at first then service dies down. Not with ECC!! I am so impressed that the cleaning is AMAZING every time!!  Rates are reasonable, too!\nNeed a cleaning service? I highly recommend this one for A-1 service!!!!", "pics": null, "resp": {"time": 1570822571086, "text": "Hi Mrs. Judy, we appreciate your feedback. Thank you for being a long time client for the past 3 years!"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "108342695138295376460", "name": "Xavier Thoms", "time": 1553967571425, "rating": 5.0, "text": "Very professional,  arrived on time, and call to confirm  appointment.  Pressure wash my two story home. Never had it wash in 9 years,  so you can imagine how dirty and stained it was.  This guy took his time & went over it thoroughly.  And I was HAPPY. Thank God we do have some honest people in this world.  Who want to do right by you. Highly recommend. Going to continue using this service,  for all my cleaning present tent and near future .", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "112645542725274179714", "name": "Robbie Futrell", "time": 1575567077242, "rating": 5.0, "text": "Did an outstanding job! Attention to detail, professional, polite, quick (they don't mess around!). We will use them again, and we highly recommend.", "pics": null, "resp": {"time": 1575648397089, "text": "HI Mr. Futrell,\nYou're the best. Thank you for allowing us to service your home before the Holidays. Merry Christmas and may 2020 be fruitful!\n\n-Shan J.\nOwner"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "103576615805291874548", "name": "The Mayo", "time": 1570428524323, "rating": 5.0, "text": "All I can say is Ms. Jessica and Mr. Aaron are a “GODSEND!” They did a FANTASTIC job in a timely manner. Both of them assured me that I would be taken care of and they did not disappoint🥰 I am sold on this service and will continue to use them in the future!! YOU GUYS ROCK♥️♥️", "pics": null, "resp": {"time": 1570822380477, "text": "Thank you. You're awesome. We appreciate your business. :-)"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "113278605425886874794", "name": "Claude Jarrett", "time": 1581565953444, "rating": 5.0, "text": "This Company is professional and were very understanding of my needs. ECC ensues me 100% satisfaction and WOW! I was very impressed. Will call them again and I highly recommends ECC Cleaning Concepts...", "pics": null, "resp": {"time": 1582240709342, "text": "Thank you so much. Your appreciations boost our morale to deliver the very best of our asurances to you."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "117572109291017983033", "name": "T Stokes", "time": 1552617701287, "rating": 5.0, "text": "We have a game day rental house that they clean regularly. Every single time, the house looks perfect for our guests. Tonight I completely forgot that we have people coming tomorrow, and didn't reach out to them until 9pm. They wrote me back instantly and let me know it would be taken care of. Couldn't ask for better, more trustworthy or dependable folks!! 5 Stars!!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "116141553852339671469", "name": "Tweet Gray", "time": 1604030637817, "rating": 5.0, "text": "COVID-19 doesn’t stand a chance cause I called Expert Cleaning Concepts to sanitize my home.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "113203307975031283126", "name": "Kerry Hancock", "time": 1568504682824, "rating": 5.0, "text": "These guys are on point! I love using their services! Ms Williams and Princess come to work and make miracles in my toddler overtaken house 😂. They have great availability and the price is worth it! I get so excited every time we have a cleaning!!", "pics": null, "resp": {"time": 1579276943888, "text": "Mrs. Hancock, you're AMAZING! We always enjoy cleaning for you! See you soon."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "108750438289965456555", "name": "BeatsByWhite FTSM", "time": 1581023908445, "rating": 5.0, "text": "I have been using ECC for over 2 years. As always, great service.  You will be hearing from me soon to book before Spring Break.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "117936585530756903980", "name": "Theresa Love", "time": 1547403714272, "rating": 5.0, "text": "The ladies always do a GREAT job! I have been using them for over 7 months. I'm comfortable with them and trust them to clean while I'm working. I work 50 to 60 hours a week. Honestly, I only have time to feed my dog, eat supper, shower and rest. Leah and her partner really take the stress away. I highly recommend to do something for yourself. Its a relief to have them.", "pics": null, "resp": {"time": 1549665493741, "text": "You deserve it! Thank you for using our service. We appreciate you sooo much!!!"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "117401052384152165899", "name": "June Bage", "time": 1579361015548, "rating": 5.0, "text": "Expert cleaning is number 1!! The cleaners always do an amazing job. Everyone is always polite from the office to the cleaners. I recommend to Expert Cleaning Concepts to anyone looking for a honest company.", "pics": null, "resp": {"time": 1579633259980, "text": "Thank you Ms. Bage! We truly appreciate your feedback. Our team truly pride ourselves on being polite and giving each client 200%. :-)  We are looking forward to doing more business with you this year."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "109253467531098556020", "name": "Carrie S.", "time": 1549410126513, "rating": 5.0, "text": "They did such a great job and I called late in the day and they came the next day!!!!  Sabrina and CC came to clean my daughter's dorm room at Auburn and they did a great job!  We will use them again, and use them when my daughter has to move out of the dorm at the end of the year. I highly recommend them and the communication was excellent as well!  Great job!!", "pics": null, "resp": {"time": 1549665441901, "text": "A true SWEETHEART! Thank you for trusting us. You're totally AWESOME! Looking forward to cleaning your daughter's dorm again. I have a daughter who attends college out of town so I know how important it is to ensure they are well taken care of.:-)"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "109605585187581948372", "name": "Jordan Jackson", "time": 1553717516809, "rating": 5.0, "text": "I can’t say enough about how great Princess and Annetta were. They were extremely thorough and my house looked and smelled cleaner that it ever has. I can’t wait to have them back to clean again!! If you’re looking for a company that is easy to work with and does a fantastic job this is it!!", "pics": null, "resp": {"time": 1553787708630, "text": "Hi! You're simply one of the sweetest clients. Thank you for re-booking for next week. As always, we will take GREAT care of you. We appreciate you giving us your feedback. See you then! Can't wait!!"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "107878638872796891398", "name": "Kay Walker", "time": 1570161511236, "rating": 5.0, "text": "Professional and sweet staff. They never disappoint and my house smells amazing for days. Highly recommend booking an appointment  today!", "pics": null, "resp": {"time": 1570822449964, "text": "Hi Mrs. Walker! Thank you for being a long standing client. We truly appreciate you."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "102941867359516803861", "name": "Karrie Roberts", "time": 1569296221999, "rating": 5.0, "text": "I have used this company for the past three months. Pleased with the work and customer service. I love coming home for work to a freshly cleaned home.", "pics": null, "resp": {"time": 1579277000900, "text": "You're the BEST! Thank you for allowing us to servicing you each month. We always enjoy it! See you soon!"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "111346866988324214796", "name": "Yuying Liu", "time": 1574877479371, "rating": 5.0, "text": "I was really satisfied. At first I didn't know the living room didn't include our open kitchen. Our living room didn't need to be cleaned, but the kitchen was very messy. When I was annoyed that I had wasted my money, shan, the manager, told me that I could arrange a cleaning for us. This time, I not only cleaned the living room but also cleaned the kitchen. I will really come back.", "pics": null, "resp": {"time": 1575064589191, "text": "Hi Mrs. Yuying! We are thrilled that you are SATISFIED. We were happy to help. See you soon!"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "108868217058658753634", "name": "Chasing Bliss", "time": 1535391218894, "rating": 5.0, "text": "I have had my apartment cleaned by ECC about three times. Each time they have been amazing. My home is clean and smells good. They even arranged my pillows on my couch to look better than where I had them. :)Thank you so much to Princess and Annetta for all of their hard work! I will be booking again!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "110890189215333791300", "name": "Judy Fernandez", "time": 1549664691816, "rating": 5.0, "text": "Expert Cleaning Concepts delivers 1000% service AGAIN & AGAIN! Their team comes in and spot cleans to perfection! They are always\nprofessional, courteous and expeditious.\nI wouldn’t dream of calling any other cleaning company! Thank you Expert Cleaning, you truly are experts!", "pics": null, "resp": {"time": 1549665345030, "text": "Hello, you're the SWEETEST!! Thank you so much for everything. We love cleaning your home. You know each time you book we will ALWAYS take care of you."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "116764622546681856812", "name": "Jillian Martin", "time": 1483462122022, "rating": 5.0, "text": "ECC cleans my home twice a month and those are my absolute favorite days of the month.  It feels so good to come home to a perfectly clean home.  They are always so nice and professional.  They do a fantastic job and my whole house looks and smells amazing.  They always call me that afternoon to make sure I am happy with the services they have provided.  I have and do recommend them to everyone I know.  You will not be disappointed. They are reasonably priced and wonderful!!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "117242351400727799758", "name": "A True Worshiper of God", "time": 1561933205941, "rating": 5.0, "text": "Annetta and Princess they are really really great kids enjoy being around them they didn't even wake them up when they was sleep also they wash dishes you can help me folding clothes I was sick that day I'll recommend him to anyone who needs help what is a deep clean are just a few room they did an amazing job both bathrooms with shiny dishes with all nice to put it up if I was a little bit of clothes that I had all in all I was able to rest which was much needed", "pics": null, "resp": {"time": 1562204473008, "text": "Hi Chelsey, thank you for the feedback. Annetta and Princess are always great with children.:-)  This is one of our TOP things that we LOVE about them. We have enjoyed cleaning for you and look forward to the next visit. Once again, THANK YOU!"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "114800514346718231800", "name": "Michael Murray", "time": 1581186366911, "rating": 5.0, "text": "They have been extremely professional and I would highly recommend them. Very responsive to requests and glad I have someone I can trust.", "pics": null, "resp": {"time": 1582241079195, "text": "With utmost pride and joy, we thank you for your kind word of support, Mr. Murray. We dedicate our growth in the horizon to all wonderful customers like you."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "100699595257070906572", "name": "Kathryn Shepard", "time": 1502216208885, "rating": 5.0, "text": "Two ladies are just finishing up my house.   They went right to work and stayed busy.  They dusted and swept and mopped.  The house looks so much better than it did before they came.\nThis was a one-time experience for me but I have enjoyed it and look forward to a time when I can make it a regular thing.\nWell worth the money.  Thanks so much.\n\nKathryn Shepard", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "103155446919752583176", "name": "Sarah Price", "time": 1564427099769, "rating": 5.0, "text": "Super kind, very accommodating to your schedule! Owner even makes herself available personally. Phenomenal service, will recommend to all of my Auburn friends!!", "pics": null, "resp": {"time": 1564511722463, "text": "Hi Sarah, it was my pleasure working with you.Smile\n\nThank you very much for allowing my company to service you\nand your friend Jessica.\n\n(Even if it consisted of me getting it done at 5AM for you, lol)\n\nPlease let me know if you ever need anything.\n\nYou’re the best! Awesome working with you. 💖❤💖❤💖"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "107027897090134962823", "name": "Chasidy Mangram", "time": 1504825336576, "rating": 5.0, "text": "Just had some cleaners come to my house to do a 2 maids 2 hours general cleaning. I could not be any happier with the result! As soon as I walked in it smelled so clean and fresh. They did an amazing job and I would highly HIGHLY recommended their services to anybody. I can't wait for my next house cleaning!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "107889072934309329949", "name": "Amy Trevathan", "time": 1506783962626, "rating": 5.0, "text": "I have always cleaned my house but recently my weekends have been so busy that I wasn't giving my house the best cleaning to my standards that I usually do. I saw an advertisement for Expert Cleaning Concepts,read the reviews and decided to give them a try. I've never used a cleaning service before to clean my house so I was a little nervous. I was concerned with \"will they clean it to my liking? \" \"will I have to go behind them? \" Let me just say they did a fabulous job! They were supposed to arrive at 3:00, they were early and started immediately. When I got home, my house smelled so good and clean. It was a wonderful knowing that my weekend is free to do whatever I want without worrying about cleaning the house! Thank you ECC, I will definitely be using you more in the future!!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "100266070019047702191", "name": "Thomas Chadwick", "time": 1483057552692, "rating": 5.0, "text": "I will recommend this cleaning company to all of my friends and family. Everything was GREAT from the beginning. Thank you all so very much, my home feels so fresh and clean and smells wonderful! I also loved the fact how well you all interacted with my dog as he (spot) is very much so an important part of my family :) I will DEFINITELY be using your services again!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "102768419342784697147", "name": "Walter Reaves", "time": 1483112897596, "rating": 5.0, "text": "I am so impressed on how they paid attention to listen and interact to figure out my exact housecleaning instructions and needs. My recent move-out clean order was quite extensive and must pass the building administrator's move-out inspection. I feel that these ladies are surefooted with their capability and they amazed me. Expert Cleaning Concepts fulfilled what they promise to deliver.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "112504443166192090057", "name": "Katie Harris", "time": 1540244273265, "rating": 5.0, "text": "I love them.  They always call before they come and are punctual.  They  do a very thorough job and they take pride in a job well done.  They do anything that I ask them to do.  I  highly recommend them to anyone that needs this service.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "117939400180264554729", "name": "Destiny Pitts", "time": 1591751715906, "rating": 5.0, "text": "Great Company! Highly recommend !", "pics": null, "resp": {"time": 1591792723583, "text": "Thank you Destiny for your feedback!"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "116877578422471464462", "name": "Alfreda Hyman", "time": 1580854644218, "rating": 5.0, "text": "Thank you so much for your Team of professional's, outstanding job!!!.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "110640158932637651250", "name": "christian stirling", "time": 1533065431445, "rating": 5.0, "text": "Amanda and her crew did a fantastic job deep cleaning my trailer. ECC was able to come out on relatively short notice and was exceptionally thorough and ambitious with their cleaning, going above and beyond to make sure that the place was spotless. I would definitely hire them again in the future.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "104745370467079555760", "name": "Gateway Life", "time": 1532488508343, "rating": 5.0, "text": "I'm so lucky I found such a great company. They are reasonably priced and extremely nice. I thoroughly enjoy the way they clean my house. It is emaculent EVERY TIME! If you are looking for a maid service in Columbus Ga I strongly suggest you call them...", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "118335185031631477619", "name": "Kashundra Brewer", "time": 1546712947762, "rating": 5.0, "text": "I highly recommend Expert Cleaning Concepts! I have used them multiple times since moving into my home over a year ago.  As an entrepreneur, I need the relief at times of having others clean for me when my schedules doesn’t allow. With them, I don’t have to worry one bit about something being done right.  The staff is very friendly. What I appreciate most is that they clean as I would.    Small things that matter to me such as wiping my trash can etc are done.  I keep my home rather clean, but they find areas that to clean that some think are minimal.  I’m slightly OCD; so, I notice any and everything that’s not done.  They are the only cleaning service that I use because they are very thorough, and I trust them to get things done. They also have ᵃ loyalty card hat I utilize.  I’m almost on a new card. Thank you all for always helping me out.  I’m certain I will be calling you soon. It’s time for ᵃ deep cleaning with the spring cleaning add ons:)", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "107950255920631393770", "name": "Lamar Winston", "time": 1578183638051, "rating": 5.0, "text": "Very professional and I will call again and I highly recommend ECC", "pics": null, "resp": {"time": 1579277034621, "text": "Thank you for recommending us Mr. Winston!"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "118319318063112743768", "name": "Safiyyah Thomas", "time": 1531881254586, "rating": 5.0, "text": "Excellent cleaning service! They are thorough and have budget friendly service packages. Very easy to book online and very friendly cleaners. When I needed a quick tidy up before houseguests or a move out cleaning they’ve always done excellent work for me.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "109769051847816634942", "name": "Summer Williams", "time": 1547748639362, "rating": 5.0, "text": "I love that the ladies went the extra mile to help organize my kids rooms AND found cash and placed in in a spot where I would find it. I love \"extra\" and trustworthiness! ECC days are my favorite days!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "118435376707180521324", "name": "Terry Carlson", "time": 1476407303023, "rating": 5.0, "text": "As Auburn engineering students my roommate and I have such demanding schedules, we are always stressed for time and the ladies at Expert Cleaning Services are exactly what we need.  They are extremely professional, trustworthy, and friendly.  This is the second time we’ve had them to clean (more like sanitize) our dorm room.  They do an awesome job cleaning.  They even wipe down baseboards, wipe down doors, wash dishes.  Thank you! Thank you! Highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "114239766676143793351", "name": "abby kelly", "time": 1372795167346, "rating": 5.0, "text": "Expert Cleaning Concepts came and cleaned my house on the very last day of my vacation. Even though I was out of town, communication was impeccable! I knew exactly when they arrived and left. It was so nice to come home to a clean home! They are extremely kind, conscientious and thorough. Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "113053840477731252677", "name": "JB Nesmith", "time": 1549670294474, "rating": 5.0, "text": "CC and Sabrina did a great job.  I look forward to them coming back.  Dusted, mopped, swept, cleaned restrooms, granite surfaces, all.  I am impressed.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "115166044744683118107", "name": "Tracy Coxwell", "time": 1509108477175, "rating": 5.0, "text": "I really LOVE working for this company. You couldn't ask for a better company to work for. This company truly believes in making their clients happy. You couldn't ask for a better place. The owner, office staff, and cleaners are the greatest. Everyone truly needs to try us out, you won't regret it.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "104711129362115307272", "name": "Anthony Bethea", "time": 1531969271193, "rating": 5.0, "text": "I was very impressed with the job the ladies did to my condo. They were prompt, professional and efficient. I highly recommend their services. Great Job Ladies!!!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "103991226900615929922", "name": "Jimmy Johnson", "time": 1539449824639, "rating": 5.0, "text": "They did a great job on my condo last Friday! Just in time for game day! Amber and Brittany saved the day because I didn’t have time to clean. Highly recommended!!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "114852603180393145345", "name": "Mia Wright", "time": 1591270399205, "rating": 1.0, "text": "Would not recommend. CEO treats her workers unfairly", "pics": null, "resp": {"time": 1591796503396, "text": "Hello Ms. Wright,\nThank you for being a former employee at Expert Cleaning Concepts, Inc. We have enjoyed training you this year. Here at our organization we treat each employees with the highest respect and fairness. As always, my door is open if you would like to speak with me.\n\nYou are bright and multi talented. We wish you the best in your future endeavors.\n\nBest Regards,\nMrs. Johnson\nCEO/ Founder"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "112182567207196825589", "name": "Kara Bowling", "time": 1503684811150, "rating": 5.0, "text": "Expert cleaning concepts never fails to impress me with their cleaning. They always get up all the cat hair in my house which is a ridiculous amount. They leave the bathrooms and kitchen spotless and sparkling. I will continue to use them to clean my house!!!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "118284415406835234820", "name": "Cheryl Waller", "time": 1477783429482, "rating": 5.0, "text": "This cleaning company is just what I needed! They were great from start to finish. Great customer service and professional staff made this move in a breeze for me and my family. They came in and got to work immediately. The house was a wreck from the previous owners. Full of cat fur and trash left behind. Appliances were so bad I thought we would have to trash them. But these lady's came in and cleaned house!!! Literally!!! I highly recommend giving them a call for your light cleaning all the way to the tough stuff. Thanks ECC for making this move so much better.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "109047689239571478425", "name": "BeeTV Network", "time": 1433865719197, "rating": 5.0, "text": "I am a very busy mother of 3 that works from home. My schedule is so hectic that my house looked a mess until I contacted Expert Cleaning Concepts. These ladies were so professional and left my house immaculate. My baseboards, windows,  and bathrooms were left spotless. I am very satisfied and HIGHLY RECOMMEND THIS COMPANY. Speaking as a busy mom, this company has made it possible for me to spend time with my children instead of worrying about keeping my house clean. CALL THEM TODAY...THIS IS ONE HAPPY MOTHER!!!!!! #bestcleaningcompany...#spotless...#professional..#VERYAFFORDABLE..", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "118284415406835234820", "name": "Cheryl Waller", "time": 1477783429482, "rating": 5.0, "text": "This cleaning company is just what I needed! They were great from start to finish. Great customer service and professional staff made this move in a breeze for me and my family. They came in and got to work immediately. The house was a wreck from the previous owners. Full of cat fur and trash left behind. Appliances were so bad I thought we would have to trash them. But these lady's came in and cleaned house!!! Literally!!! I highly recommend giving them a call for your light cleaning all the way to the tough stuff. Thanks ECC for making this move so much better.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "101266854275208688764", "name": "Kenny Mathews", "time": 1412944853813, "rating": 5.0, "text": "Thumbs up! Great prices. Early response time. And very thorough. I will recommend and re-hire when needed.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "114852603180393145345", "name": "Mia Wright", "time": 1591270399205, "rating": 1.0, "text": "Would not recommend. CEO treats her workers unfairly", "pics": null, "resp": {"time": 1591796503396, "text": "Hello Ms. Wright,\nThank you for being a former employee at Expert Cleaning Concepts, Inc. We have enjoyed training you this year. Here at our organization we treat each employees with the highest respect and fairness. As always, my door is open if you would like to speak with me.\n\nYou are bright and multi talented. We wish you the best in your future endeavors.\n\nBest Regards,\nMrs. Johnson\nCEO/ Founder"}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "115950905889734854459", "name": "Jasmine Grady", "time": 1529860315692, "rating": 5.0, "text": "ECC was highly recommended by my sorority sister. The move out cleaning covered everything on the checklist. Honestly, after the packing it was almost impossible to clean the required areas. Thank goodness, this process is now over! I’m relieved. #NextChapter If this help my cleaners were Donna and Leah.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "108673515943946926719", "name": "Amanda Streeter", "time": 1429814792047, "rating": 5.0, "text": "This is such a great group of ladies. They have an excellent response time, and they always do such an outstanding job. I had the pleasure of working with Kelly and Ms. Spence this past Saturday and they made my home smell and look soooooo great! I will continue to use them in the future!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "113136178084007975127", "name": "Mariel Morris", "time": 1402336572192, "rating": 5.0, "text": "Stephanie always make sure my apartment is cleaned thoroughly each month. She has a great attitude  and always work the FULL 3 hours without taking breaks and wasting time. In the near future I would like to see more later appointment options.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "107249343471398435740", "name": "Mike Simpson", "time": 1496950508935, "rating": 5.0, "text": "Expert Cleaning Concepts is by far the best!!  Their staff is attentive to any clients needs and will go above and beyond to ensure total customer satisfaction, from general cleaning to deep cleaning they will make you smile with joy!  Go ahead and contact Expert Cleaning Concepts relax and watch them work!!!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "115551111312862943807", "name": "Cambrie Rodriguez", "time": 1504824988428, "rating": 5.0, "text": "This company absolutely blew me away! From the moment I called and spoke with the office to book my appointment to the moment the girls left. I feel like so much has been lifted off my shoulders. Thank you so much ECC for everything. Will definitely be booking for recurring and referring to all my friends! Tha k you again!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "102873294952714261317", "name": "craig milbry", "time": 1546713170695, "rating": 5.0, "text": "Great service friendly staff on time , the ladies That clean my house was really good thanks a million", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "108530670554064952284", "name": "Marlin Ross", "time": 1540139513510, "rating": 5.0, "text": "I will hire again. They’re the only company that answered my call. The prices are good.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "115950905889734854459", "name": "Jasmine Grady", "time": 1529860315692, "rating": 5.0, "text": "ECC was highly recommended by my sorority sister. The move out cleaning covered everything on the checklist. Honestly, after the packing it was almost impossible to clean the required areas. Thank goodness, this process is now over! I’m relieved. #NextChapter If this help my cleaners were Donna and Leah.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "113136178084007975127", "name": "Mariel Morris", "time": 1402336572192, "rating": 5.0, "text": "Stephanie always make sure my apartment is cleaned thoroughly each month. She has a great attitude  and always work the FULL 3 hours without taking breaks and wasting time. In the near future I would like to see more later appointment options.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "108275023047912605165", "name": "Brianna Hera", "time": 1483081973697, "rating": 5.0, "text": "So happy to say here that I have made the right choice. Been away from home for so long chasing a college degree and working here in AU and it's the first time that I felt cleanliness like being at home. The ECC girls cleaned my room and entire apartment unit spotless like my mama did. Thank you, ECC.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "103318462852348940635", "name": "Nikki Dictson", "time": 1502818102259, "rating": 5.0, "text": "Expert Cleaning Concepts is the Best Cleaning Service! The ladies work hard the entire time and always have a smile, while they do a fantastic job cleaning your house.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "107848434492046120628", "name": "Samson", "time": 1518114372913, "rating": 5.0, "text": "I requested for a quick clean up of my room in the university, they came on time and the job was wow. My friends came around and gave good comments too. I will order your services again when next they come back to Ashburn.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "118425714014203837363", "name": "JILL Yates", "time": 1374848594639, "rating": 5.0, "text": "I can't say enough about the ladies that cleaned my parents home and the job that they did.  They took so much time making sure that everything was spotless and were so pleasant to work with.  I had the deep scrub cleaning and highly recommend them.  I am about to use them again for a new home that my son bought.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "106209724040989279245", "name": "linda lulu", "time": 1531700001184, "rating": 5.0, "text": "The Cleaners, Shandra and A’Jah, were very friendly and rendered excellent services. I highly recommend their cleaning services!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "102628049821551295426", "name": "Leonard Davis", "time": 1461446918403, "rating": 5.0, "text": "Great experience. Milan and Kay were sent to my residence in auburn. Both were very mannerable, fast paced, and knowledgeable. I would recommend this company to all friends and family.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "110976598699256692798", "name": "Sapphira Glemaud", "time": 1510159847444, "rating": 5.0, "text": "Expert Cleaning Concepts has been so helpful! The are friendly, and do a great job! Easy to work and great staff!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "109959029412277311481", "name": "Robert Moore", "time": 1401390805396, "rating": 1.0, "text": "They wont show up, hope your not on a timeline!!!\n\nAfter talking me into not using somebody else......\nNow I have to figure out how to get this stuff done before the realtor and potential buyers get here.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "104522017529299006958", "name": "Kaitlynn Griffith", "time": 1444177429731, "rating": 5.0, "text": "Great communication up until my scheduled cleaning, during, and after... My home was cleaned thoroughly and I highly recommend this company to anyone looking for any type of cleaning service!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "108741892956220787308", "name": "Maurice Maynard", "time": 1468427556550, "rating": 5.0, "text": "My parents have been using EEC for years. Now, they are cleaning my apartment once a month. So far, so good!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "101720240630427836575", "name": "Sweetest Taboo", "time": 1493679427529, "rating": 4.0, "text": "The office staff is very friendly. I filled out an online form and Shan called me back within 7-10 minutes. LOL Whew! That was fast. Earlier that day I contacted 2 other cleaning companies and no one called me back. :-(  Well, I made the right choice. I LOVE Cierra and Stephanie. I will use them again within a few months.\n\nGreat job! I did give them a tip.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "114805257130833004862", "name": "Ashley Castellanos", "time": 1510082317862, "rating": 5.0, "text": "Always do a great job when they come to clean my apartment which is sometimes not the easiest. Also some of the nicest people I know and can't wait to have them back!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "107319579532920140158", "name": "craig milbry", "time": 1476486074075, "rating": 5.0, "text": "Great on time friendly and did a spectacular job I will recommend them", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "109812373624233462276", "name": "Alexia Frazier", "time": 1476118000644, "rating": 5.0, "text": "Just had my home cleaned for the 3rd time by ECC !! Can't wait to see them again in 2 weeks !! Thanks for such a clean home !!!!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "112602673595764642087", "name": "Malcolm Waller", "time": 1531536502731, "rating": 5.0, "text": "Complete and a very professional service , I highly recommend this company.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "114200510035851251593", "name": "April Nicole Baldwin", "time": 1440797083657, "rating": 2.0, "text": "I am a recent college graduate who resides in Tuskegee, AL (about 20 mins from Auburn). I work two jobs (6 days out of the week) and have been in the process of moving for almost a month now. I want to have my apartment deep cleaned before I move my belongings in. When I called yesterday to set up the appointment, the service award great! Quick and easy to schedule. However today when the appointment was scheduled to take place between 12 and 4 pm,  I received no call to let me know that someone was on their way by 3:30. I called the 334 number twice; no one answered. I went to their website and   contact Sunny, the online chat window saying that no one had contacted me. She said that a representative would be right with me. Someone called maybe ten mins later to say that THEY HAD TO CANCEL THE APPOINTMENT. THEY SAID THAT ONE OF THE CLEANERS HAD A BAD EXPERIENCE IN THE AREA AND WASNT COMFORTBALE COMING OUT. These sentiments are fine and dandy but I WAS GIVEN NO PRIOR NOTIFICATION THAT MY APPONTMENT WAS CANCELLED. Not a good way to conduct business.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "103017026143909547504", "name": "Stewart Tucker", "time": 1456878281987, "rating": 5.0, "text": "Great and reliable service. Friendly owner and home-like staff.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "103683150031052602923", "name": "Andrew Carlson", "time": 1483993839210, "rating": 5.0, "text": "They are quick and easy and they get the job done.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "108983120423545411580", "name": "Service AtYourFingertips", "time": 1457011804689, "rating": 5.0, "text": "Professional and works fast definitely would recommend trying", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "103811149479830548007", "name": "Marques Johnson", "time": 1504714195419, "rating": 5.0, "text": "Excellent services provided! Friendly and professional!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "109980234675059941930", "name": "Kev Nelson", "time": 1484244944360, "rating": 5.0, "text": "Outstanding Service! Will do business again!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "116804740643912465772", "name": "Sherry Grady", "time": 1583104764825, "rating": 5.0, "text": "Amazing company!", "pics": null, "resp": {"time": 1583169633453, "text": "It was our pleasure Mrs. Grady, thank you."}, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "105643398145437006129", "name": "Chris Welcher", "time": 1453639011352, "rating": 2.0, "text": "They came in started to clean then told us we don't do this and we don't do that for the price I expected a whole lot more would not use them again", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "100711150458318956129", "name": "B Wynn", "time": 1517428826493, "rating": 5.0, "text": "Great friendly servicce!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "115324876343662504455", "name": "Stephanie Young", "time": 1483999873845, "rating": 5.0, "text": "Very pleased with my services!!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "107426788892051884179", "name": "Ambee Lockhart", "time": 1580444273998, "rating": 5.0, "text": "Great service!!!!I was so speechless!!!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "103932921099262004821", "name": "Harry Williams", "time": 1505748185173, "rating": 5.0, "text": "Excellent service.", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "112186263054173495166", "name": "Shea McCutchen", "time": 1498329377905, "rating": 5.0, "text": "Great!", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "105643398145437006129", "name": "Chris Welcher", "time": 1453639011352, "rating": 2.0, "text": "They came in started to clean then told us we don't do this and we don't do that for the price I expected a whole lot more would not use them again", "pics": null, "resp": null, "gmap_id": "0x888cf2a543bc3d5f:0xc9f67d1651e8ffb9"}
{"user_id": "117315435165337995231", "name": "Jennifer Sloan", "time": 1621439784395, "rating": 5.0, "text": "From scheduling to pool liner install to balancing to billing, Anders staff were efficient, professional, thorough, knowledgeable, and provided an excellent product at a very reasonable price. Refreshing to work with.", "pics": null, "resp": null, "gmap_id": "0x88626b9030e73f55:0x77c49d0f0e266ebe"}
{"user_id": "103440163937483100260", "name": "Sam Porter", "time": 1534290950542, "rating": 1.0, "text": "I have used them for the past year and a half and have had consistently small issues with them. Maybe it’s just my attention to detail, but those details are important to me. Like making sure the screws on my filter assembly on my pump are screwed down all the way so it’s not sucking in air, cross threading the drain on my sand filter and when I tell people at the store about it it takes them two weeks to finally replace it and fix it, when they opened up my pool for the first time this year and started the pump they opened up a access panel on the electric motor side and left it open and didn’t tell me about it leaving it accessible to rain and debris. Two weeks ago I had to replace my pump, just a coincidence. I don’t think so. Between all the details that they don’t pay attention to and the absolute horrible communication between the front Store staff, the staff that clean the pools and the general manager. I could no longer put up with their horrible service. They might be knowledgeable, but all they did was cost me more money.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMiHwee41ZrX6X__zDLhEc0LR44WjOP5TCNwgX_=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPMGSFPWwBx_FYG1QKRDFnC0oam2IDM9Fm-DR1_=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626b9030e73f55:0x77c49d0f0e266ebe"}
{"user_id": "116308973210466675796", "name": "Eric Hardin", "time": 1618256280626, "rating": 5.0, "text": "Awesome as always. I've been doing business at Anders Pool co. for years and it always  excellent service and great experience. Thank you.", "pics": null, "resp": null, "gmap_id": "0x88626b9030e73f55:0x77c49d0f0e266ebe"}
{"user_id": "117196198806155533104", "name": "jay Roberts", "time": 1620600279467, "rating": 5.0, "text": "Service is always outstanding delivery is always faster than I could ever have dreamed.", "pics": null, "resp": null, "gmap_id": "0x88626b9030e73f55:0x77c49d0f0e266ebe"}
{"user_id": "108735580019755328893", "name": "Alan Smith", "time": 1617371281638, "rating": 5.0, "text": "These guys are great to do business with. I discovered them back in 2019. So far, last year, they replaced my pool liner. They did a first class job. This year, I had them replace my chlorinator. Again, a first class job. I went there to obtain some O-rings, a pressure gauge and a gasket. The staff were brilliant, in getting me alternate options for the seals I needed. Due to Covid-19, there are shortages, in many of the spare parts availability. These guys, always go the extra mile, to satisfy your needs.", "pics": null, "resp": null, "gmap_id": "0x88626b9030e73f55:0x77c49d0f0e266ebe"}
{"user_id": "112358415027329775332", "name": "Ed Minett", "time": 1621776202877, "rating": 5.0, "text": "Always excellent help. Terrific company", "pics": null, "resp": null, "gmap_id": "0x88626b9030e73f55:0x77c49d0f0e266ebe"}
{"user_id": "111704016909374193463", "name": "Ty Tyson", "time": 1591413694860, "rating": 5.0, "text": "Love Anders. We have been using them for many many years. Have always taken care of all our pool and hot tub needs. Jim and Jay are always so friendly and so helpful each week we come in. We use them for everything from replacing liner to testing our water each week. Thanks for always being honest and fair and keeping our pool and spa sparkling and clean.", "pics": null, "resp": null, "gmap_id": "0x88626b9030e73f55:0x77c49d0f0e266ebe"}
{"user_id": "112149619154797255079", "name": "Kaleb Smart", "time": 1571852915038, "rating": 5.0, "text": "After seeking assistance from two other pool companies with no luck, we lucked upon these guys. Their extremely knowledgeable staff was able to clear up our pool from a pretty intense algae bloom in a week. We had been trying other recommendations for over two weeks prior. These guys know their stuff, and their prices are very reasonable!", "pics": null, "resp": null, "gmap_id": "0x88626b9030e73f55:0x77c49d0f0e266ebe"}
{"user_id": "104664824816401583840", "name": "Marty Thomas", "time": 1596132153910, "rating": 5.0, "text": "Very nice people. Great service", "pics": null, "resp": null, "gmap_id": "0x88626b9030e73f55:0x77c49d0f0e266ebe"}
{"user_id": "107392703699953398075", "name": "Cheryl Muskevitsch", "time": 1591370814069, "rating": 1.0, "text": "Individual I spoke with regarding my salt cell was rude and displayed bad customer service. You can explain the process for warranty replacement  without acting like an elitist pool store employee. I will never go back.", "pics": null, "resp": null, "gmap_id": "0x88626b9030e73f55:0x77c49d0f0e266ebe"}
{"user_id": "115948506998129768254", "name": "Alan Smith", "time": 1585311954399, "rating": 5.0, "text": "Last December, we approached Anders Pool Company, to install a new liner in our in-ground swimming pool. In beginning, the staff were extremely polite, courteous , knowledgeable  and pleasant to interact with. We picked out the pattern we wanted, and paid 50% of the total cost, to cover the  price of manufacturing the liner which, was very reasonable indeed. Steve came out in late December, to take the measurements of the pool, to pass onto the liner manufacturer. We then agreed to call Anders Pool, early March, to set a date to install the liner. I called Anders Pool, March 9th, and spoke with Steve, and set the date to install the new liner on Wednesday, March 27th. Steve touched base with me, a few days before the install date, to make sure we were good to go. Chris and two other staff, arrived early Wednesday, and drained the pool with a gas pump. They removed the old liner, thoroughly, and I mean thoroughly, cleaned, the pool walls and floors, smoothed over the pool floor and installed the new liner without any issues at all. Then, they set up a vacuum pump and a set a vacuum hose between the pool wall and the pool liner, to suck the trapped air out as we filled the pool from the faucet. The Anders pool liner installers, were extremely Professional and polite throughout the entire operation. They did a fantastic job, far, far, better than their local competition, that I'd used for the two previous liners, over the past 30 years. This liner fits snuggly up against the 4 ft. radius walls of the pool. Anders Pool, took the time, to accurately measure the pools dimensions. The previous pool company, when measuring up, rounded down the measurements, to get an even number. Which, resulted in a poor fitting liner. If you need a new pool liner, make sure you get a quote from Anders Pool Company. Trust me, they'll get you the best price and, the best quality liner, and the best possible installation. This company is well worth my 5 star rating.", "pics": null, "resp": null, "gmap_id": "0x88626b9030e73f55:0x77c49d0f0e266ebe"}
{"user_id": "109895355611621200562", "name": "Jeff Martin", "time": 1559326375338, "rating": 5.0, "text": "My first time at Anders pools was a great experience. The guys there made me feel welcome and answered all my questions.\nGreat customer service!\nI will be buying all my pool supplies there from this point forward!", "pics": null, "resp": null, "gmap_id": "0x88626b9030e73f55:0x77c49d0f0e266ebe"}
{"user_id": "108047317820299713274", "name": "Kenneth Hicks", "time": 1592664362175, "rating": 5.0, "text": "Best pool store in Huntsville! Wouldn’t go anywhere else!", "pics": null, "resp": null, "gmap_id": "0x88626b9030e73f55:0x77c49d0f0e266ebe"}
{"user_id": "106808333188239452387", "name": "David Low", "time": 1470417219705, "rating": 5.0, "text": "I've used Anders for several years. I've had 2 liners installed along with a safety cover over the years. They have done a great job every time. They work hard and are always there when they say they'll be there. Also their liners are cheaper than everyone else in town (price not quality). Both liners fit great!!", "pics": null, "resp": {"time": 1471534234615, "text": "Thanks! We appreciate your business!"}, "gmap_id": "0x88626b9030e73f55:0x77c49d0f0e266ebe"}
{"user_id": "102242320992876172972", "name": "Pavlos Honderich", "time": 1526618896112, "rating": 5.0, "text": "Best pool supply in Huntsville. Extremely knowledgeable staff.  They also have a pool maintenance service as well as install liners and sell big green eggs as well.", "pics": null, "resp": null, "gmap_id": "0x88626b9030e73f55:0x77c49d0f0e266ebe"}
{"user_id": "100381046781694346365", "name": "Brett Crow", "time": 1570748615433, "rating": 5.0, "text": "Jim was knowledgeable and very helpful.  👍🏼👍🏾👍🏿", "pics": null, "resp": null, "gmap_id": "0x88626b9030e73f55:0x77c49d0f0e266ebe"}
{"user_id": "109813185147938611741", "name": "Jaime Sallis", "time": 1572797795306, "rating": 5.0, "text": "Did a pool inspection for a client, courteous, timely, and thorough.", "pics": null, "resp": null, "gmap_id": "0x88626b9030e73f55:0x77c49d0f0e266ebe"}
{"user_id": "109207453819156312264", "name": "Candice Russell", "time": 1593448473094, "rating": 5.0, "text": "Very quick to unload", "pics": null, "resp": null, "gmap_id": "0x88626b9030e73f55:0x77c49d0f0e266ebe"}
{"user_id": "100425849897903387171", "name": "Lisa Kim", "time": 1435669940276, "rating": 1.0, "text": "Some of the people that work are very rude, its like you bothered them when you ask a question, or if they have to take something out to your car,not good customer service at all in my book.  I don't care if you are having a bad day, you suck it up and be nice to whom ever walks in that door.  I have purchased many things from Anders, but I am going to give another company a chance, maybe they can be nice..... that is all it takes.......so simple.", "pics": null, "resp": {"time": 1443458105035, "text": "We apologize that you had a bad experience.  We have talked with our staff and can assure you that this will not happen in the future. If you have any further issues, please contact the manager directly at Jim@anderspool.com"}, "gmap_id": "0x88626b9030e73f55:0x77c49d0f0e266ebe"}
{"user_id": "109908485915580246702", "name": "Donald Kellogg", "time": 1443563201581, "rating": 5.0, "text": "I only go there to get my pool serviced and chemically treated.  Great bunch of folks!  Wouldn't go anywhere else!", "pics": null, "resp": null, "gmap_id": "0x88626b9030e73f55:0x77c49d0f0e266ebe"}
{"user_id": "109207453819156312264", "name": "Candice Russell", "time": 1593448473094, "rating": 5.0, "text": "Very quick to unload", "pics": null, "resp": null, "gmap_id": "0x88626b9030e73f55:0x77c49d0f0e266ebe"}
{"user_id": "106673263133012700255", "name": "James Tate", "time": 1591669368544, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x88626b9030e73f55:0x77c49d0f0e266ebe"}
{"user_id": "104963312394180955038", "name": "TG", "time": 1528636846301, "rating": 5.0, "text": "They will do a great job and reasonable priced.  Two years ago I bought a pool cover because Anders had the best price. This year I needed a new liner and was given a free upgrade to a thicker 27 mil liner. The installation was very profession and went beyond. After removing the old liner, they treated and clean the walls and flooring. In some spots they refloat to level any dips / imperfection in the foundation. They even cleaned and removed the stains on my steps at no extra cost. Btw their price for the new liner was very competitive. I would recommend Ander pools. TG", "pics": null, "resp": null, "gmap_id": "0x88626b9030e73f55:0x77c49d0f0e266ebe"}
{"user_id": "102128516049759978201", "name": "T. Barnes", "time": 1495048368297, "rating": 5.0, "text": "Very friendly staff and a great repair crew----highly recommended.", "pics": null, "resp": null, "gmap_id": "0x88626b9030e73f55:0x77c49d0f0e266ebe"}
{"user_id": "114988587933230816666", "name": "Laurel Rose", "time": 1471532211383, "rating": 5.0, "text": "I've used Anders for years for everything from maintenance to liner replacement.  I have a sand bottom pool which can be challenging and wouldn't consider going with anyone else.  Recently had a liner, filter and motor replaced and they kept to their schedule, were friendly and professional and answered every question I asked.", "pics": null, "resp": {"time": 1471534171728, "text": "Thank you for your feedback!"}, "gmap_id": "0x88626b9030e73f55:0x77c49d0f0e266ebe"}
{"user_id": "109268866410834239465", "name": "Jennifer Fox", "time": 1503358201301, "rating": 5.0, "text": "I like their products and their shock works better than Walmarts", "pics": null, "resp": null, "gmap_id": "0x88626b9030e73f55:0x77c49d0f0e266ebe"}
{"user_id": "102237982210265786965", "name": "Amanda Wallace", "time": 1448377931546, "rating": 5.0, "text": "I've used this company at every property I work at and they're amazing.", "pics": null, "resp": {"time": 1471534356096, "text": "Thanks! We are glad to help!"}, "gmap_id": "0x88626b9030e73f55:0x77c49d0f0e266ebe"}
{"user_id": "104832483425240477099", "name": "Thomas “Tom” Goundry", "time": 1558635906183, "rating": 5.0, "text": "Great  service, trustworthy team.", "pics": null, "resp": null, "gmap_id": "0x88626b9030e73f55:0x77c49d0f0e266ebe"}
{"user_id": "104832483425240477099", "name": "Thomas “Tom” Goundry", "time": 1558635906183, "rating": 5.0, "text": "Great  service, trustworthy team.", "pics": null, "resp": null, "gmap_id": "0x88626b9030e73f55:0x77c49d0f0e266ebe"}
{"user_id": "112143399091642279383", "name": "Jim Hennessy", "time": 1553911375677, "rating": 5.0, "text": "great service,  great people", "pics": null, "resp": null, "gmap_id": "0x88626b9030e73f55:0x77c49d0f0e266ebe"}
{"user_id": "116763826694177006662", "name": "Dick Bourget", "time": 1574648534153, "rating": 5.0, "text": "Good prices", "pics": null, "resp": null, "gmap_id": "0x88626b9030e73f55:0x77c49d0f0e266ebe"}
{"user_id": "110559710323179857676", "name": "Ashlynn King", "time": 1597083648927, "rating": 1.0, "text": "WORST customer service ever. Been using this “company” for a few years under my husbands name, but he wouldn’t post a review, so I did. They do not call you back. Since the allegedly moved stores, they put up a sign to text Candice but she doesn’t reply, so don’t waste your time. I also have a close friend that they have wronged as well. I would suggest Bama pools. They always answer the phone & return calls when they are unable to answer the phone. Do not recommend", "pics": null, "resp": null, "gmap_id": "0x887d49e14516f6f7:0x1f6afd74c7070d5c"}
{"user_id": "108741368463629636588", "name": "Whitney Dawson", "time": 1597108508361, "rating": 1.0, "text": "I’ve been using asp since 2013. Candi has always been good about what to do with the chemicals but the Jeff guy has been nothing short of rude. They put in our new liner in 2017 & did a shoddy job. Wouldn’t come back out & fix it. They put in a brand new salt pump for us in 2018 & I’ve been trying since May to get them to come look at it but all I’ve gotten is the run around. they came once, after I commented on their Facebook page & said no one would respond to my private messages or phone calls, but still haven’t fixed the problem. My husband and I have spent thousands here, & we have shamefully sent other people here. Please don’t waste your money!", "pics": null, "resp": null, "gmap_id": "0x887d49e14516f6f7:0x1f6afd74c7070d5c"}
{"user_id": "102802841579749549163", "name": "Phil Smolen", "time": 1623466800140, "rating": 1.0, "text": "Never called me back", "pics": null, "resp": null, "gmap_id": "0x887d49e14516f6f7:0x1f6afd74c7070d5c"}
{"user_id": "114810702500271353041", "name": "Patricia Wilkens", "time": 1563996700813, "rating": 5.0, "text": "I have two homes in the Shoals area that have pools.  One had severe maintenance issues due to problems with another pool company in town that never showed up all last year, and the other had not been opened in over a year.  They not only were extremely knowledgeable and helpful, but very pleasant to work with.  Whenever they have told me they would do something, they followed through and got it done!   Best pool company in the area!", "pics": null, "resp": null, "gmap_id": "0x887d49e14516f6f7:0x1f6afd74c7070d5c"}
{"user_id": "104444914755900887976", "name": "Joann Hannah", "time": 1562679768295, "rating": 5.0, "text": "Best “hidden” secret in Florence Al for pool knowledge.\nPatient, kind and EXTREMELY HELPFUL.", "pics": null, "resp": null, "gmap_id": "0x887d49e14516f6f7:0x1f6afd74c7070d5c"}
{"user_id": "103203382107667694470", "name": "DeonnaS", "time": 1557172877572, "rating": 5.0, "text": "My pool is in the best shape ever since I started using ASP. Candi is awesome! Love this place, worth the wait!", "pics": null, "resp": null, "gmap_id": "0x887d49e14516f6f7:0x1f6afd74c7070d5c"}
{"user_id": "111381130052654356331", "name": "Walt Lewis", "time": 1496269071329, "rating": 5.0, "text": "Family owned and Operated! They are knowledgeable and  VERY helpful for all pool and hot tub stuff. I've used them for three years and love everything they do for me!", "pics": null, "resp": null, "gmap_id": "0x887d49e14516f6f7:0x1f6afd74c7070d5c"}
{"user_id": "112212116850725941505", "name": "Richard Todd", "time": 1501541960765, "rating": 1.0, "text": "I had a Dolphin Pool cleaner that did not work I had purchased on line a new Power Unit so that was not the problem which I explained.  I left it there called in a week they said had not had a chance to get to it, stopped by there the next Saturday had not had a chance to work on it.  After 3 weeks without a phone call or explanation i picked it up when i was going to Atlanta.  Went to Atlas Pool in Atlanta dropped it off this morning at 10:30 , Atlas Called in 5 hours and the pool cleaner had a bad motor and Power Cord and was ready to pick up.  If ASAP , oops sorry ASP did not have time to work on it a simple explanation would have been suffiecient this was a miserable experience, don't take anything that needs to be repaired!", "pics": null, "resp": null, "gmap_id": "0x887d49e14516f6f7:0x1f6afd74c7070d5c"}
{"user_id": "104023640422910546583", "name": "John Harris", "time": 1499361913923, "rating": 5.0, "text": "Very helpful", "pics": null, "resp": null, "gmap_id": "0x887d49e14516f6f7:0x1f6afd74c7070d5c"}
{"user_id": "118320287343762913105", "name": "Casey Blaskowski", "time": 1622641565104, "rating": 5.0, "text": "I am extremely grateful to Aquaman pools. As a freshman pool owner Aquaman was really helpful they took the time to explain some things I was doing wrong and really helped me understand my pool system. Also I called late in the day and they came same day to help me out. Not to mention it’s a Veteran owned business in SW Huntsville. Anytime I have pool questions I know exactly who I’m going to from now on.", "pics": null, "resp": {"time": 1622674433551, "text": "Thank you for the review!!"}, "gmap_id": "0x88620dd63370e02d:0x5b7e234ec130cbb4"}
{"user_id": "117259102613383291477", "name": "R Butterfly", "time": 1616431735173, "rating": 5.0, "text": "We were extremely happy with the service provided. We will be using them for any of our future pool service needs!\n\nAquaman Pools was able to come out and quickly assess our pool and within a few days of that come back out to open it for the season. Everyone was extremely professional, courteous, and knowledgeable. I liked that I was able to communicate through Facebook messenger to set everything up and arrange anything needed or to discuss any details. This made for very quick response times overall which was wonderful. Prices are also extremely competitive for the area\n\nThey were able to open our pool, shock it, go over everything needed and explain everything to us since we’ve never owned a pool before, and give follow up instructions all within a few hours. Our pool hadn’t been opened up in over a year and a half, it looked like it might need a miracle. Within 36hrs it was a beautiful shade of blue and you could see the bottom. I was impressed. This was before we even started running the filter at that!\n\nCompared to stories I’ve heard from many local people and reviews I’ve read their timelines and customer service are far better than anyone else in the area currently. Very happy we chose them and didn’t waste our time with anyone else.", "pics": null, "resp": {"time": 1616437625090, "text": "Thank you! I am so glad we could help you. We really appreciate you taking the time to give us a review. Have the best day!"}, "gmap_id": "0x88620dd63370e02d:0x5b7e234ec130cbb4"}
{"user_id": "102164737598842617860", "name": "Megan Barger", "time": 1617204705951, "rating": 5.0, "text": "I can not express how professional this company is. Not only did they come out to give me a quote for a pool cleaning but started working on it right away! The price can’t be beat nor can the business ethics they go by. I will definitely refer, and I couldn’t be more pleased with my experience with them.", "pics": null, "resp": {"time": 1617205514364, "text": "Thank you SO much for this sweet review!"}, "gmap_id": "0x88620dd63370e02d:0x5b7e234ec130cbb4"}
{"user_id": "110295339387205266149", "name": "Christi McDowell", "time": 1616078997363, "rating": 5.0, "text": "Finally found a pool service that does the job correctly. They are punctual, experienced, and professional.  I will not use anyone else!", "pics": null, "resp": {"time": 1616437654199, "text": "Thank you for taking the time to give us a review. We love our customers so much!"}, "gmap_id": "0x88620dd63370e02d:0x5b7e234ec130cbb4"}
{"user_id": "111427434452304470627", "name": "Samantha Atkinson", "time": 1614954920223, "rating": 5.0, "text": "Wonderful customer service and attention to detail! Definitely my choice for service going forward!", "pics": null, "resp": {"time": 1616078416041, "text": "Thank you, we appreciate your business!"}, "gmap_id": "0x88620dd63370e02d:0x5b7e234ec130cbb4"}
{"user_id": "109369635378706974132", "name": "Laquita Williams", "time": 1621985273418, "rating": 5.0, "text": "Seen with my own eyes what a wonderful job Glenn and his crew does and would recommend everyone to them if u want ur pool done right", "pics": null, "resp": null, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "111742110124987616471", "name": "Matt Ezell", "time": 1544050561853, "rating": 1.0, "text": "If you like simple projects turned nightmare, this is a post for you...\n\n$3,000 spent on a simple re-tile job, months of frustration, damage to our property, and within months our pool looks far worse than it did before.\n\nWe now have additional significant damage as a result of them improperly attempting to do the job multiple times that we’re going to have to pay to have fixed (coping bricks separating from pad due to shifting due to multiple improper drainings). And of course we now have to pay someone else to do the tile job we already paid Swimming Pool Services for.\n\nSwimming Pool Services drained our fiberglass pool twice (tried for a 3rd before I told them to stop) without first sumping (we have a sump line - they indicated they didn’t know what it was), they used no bracing any of the 2 times they drained our pool, and then left it empty during rainy days - look up ‘drain fiberglass pool’ to learn how terrible this all is. The whole time, they’ve dismissed our concerns via long drawn out email back and forths and continue to assert that they did everything correctly and are trying to help. After they failed to make things right, I requested a refund, which they’ve refused - they will only agree to keep sending guys out to redo portions of the job the same way that resulted in the problems that we have today. It's always worth mentioning that what was estimated to be a \"2 to 3 day job\" took more than a month - lots of no call/no show and terrible communication across the board. No thanks.\n\nI’ve since spoken to multiple other local FIBERGLASS experts as well as the manufacturer, all of whom assert this was 100% NOT done correctly (with the owner and manager have simply dismissed this, acting as if we’ve only learned info from the Internet. Despite every other expert and resource saying SPS is wrong, SPS continues to assert that they are the experts, even having gone as far as attacking other local businesses work). I’ve been asked no less than 3 times “are you sure they were reputable?”. The manufacture literally put me on speakerphone so everyone could hear my story, to which they responded with gasps, “oh my” and “I’m so sorry”. The warranty manager actually said “it’s a good thing you didn’t have any remaining warranty because that would have definitely voided it - we wouldn’t touch it now”. I’ve also been told that the tiles, grout and adhesive used for the job are incorrect for this size/shape/type of pool, which is something that SPS vehemently argues against - I’ll attach some pictures of the current state of our pool so that you can be the judge for yourself.\n\nThe Manager (Dave) AND Owner (Glenn) will act as if they’re trying to help, but it’s seemingly just an act to keep things looking positive online (look here and at the BBB for examples). In conversations they remain friendly/polite, but will only offer to continue doing the very things that have led to us now having a damaged pool. I fully anticipate that the owner will follow up on all reviews acting as if they’ve tried to make things right, just as he seemingly does on all negative reviews, but their idea of making things right is continuing to do things incorrectly - ‘the customer is always wrong’, seems to be their approach to customer service. No thanks.\n\nUnfortunately there’s a max character count for reviews, so I can’t share everything - though I will be elsewhere.\n\nI personally wouldn’t allow these guys to put a bag of salt in my pool going forward.\n\nUpdate based on owner's claims:\n- The response, as expected, is full of misleading statements in an attempt to come across more helpful than is actually the case.\n- I turned them away ONCE, not several times. I turned them away because they refused to proceed with repairs without 100% draining my pool and indicated that properly bracing it was out of the question.\n- Notice he's not mentioning the 'remedy' that they proposed? Because they didn't propose a remedy. They said they would 100% drain my pool, and would not brace it - which is actually the opposite of a remedy.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNWFp0EfHj0oSG3ApdvzMCI-80MWmgJqno06aEE=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO4tjuqvHvrZEA5bY-MTV8G8oir5Z0Iv8cYzC8K=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOokYi54tLnNqMDkPCSmSNJeG9E7ld1w77GtA2R=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO_9RUO7otQifznO9h9uUp-qHfdspKF1zWj_yZP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMRB_x9TPBN3U87jCmN-8mL89RSnax0kerjyxbl=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMpjtsEvUANahj3v54DKdWZNW6A4o7RaMjPINIw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPeiwPiGcL3HpVwZB2Ivtop56JpIE9fTggW-e4y=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMSN89--TjXMUceMLKEvQc0Y-iKMm5BBho0Sa7d=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPI-zJ2OcILKZGHMe4cqdKmz1M438l2gTyJSJBH=w150-h150-k-no-p"]}], "resp": {"time": 1544041452230, "text": "Matt, I am sorry that you feel this way and felt it necessary to resort to social media! We have been attempting to communicate with you and correct the tile issue which we have explained previously. We have tried several times to complete the work on this project and have been turned away each time. Any work would require lowering the level some at this point which is all that was to be done. We have done many projects like this with no issues and the remedy we proposed should take care of any future shifting as fiberglass pools are prone to do. I would be glad to speak with you personnaly to discuss either completion or other resolutions.  Please also note for reviews online that there is always more to the story..."}, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "106479490566909564942", "name": "christian Hood", "time": 1622337577053, "rating": 1.0, "text": "This is reference to he post concerning Mr Hood, I\nAm the owner for Clover Land Service and have first\nHand knowledge of the events, I\nWas with him. You represent nothing but lies and unfaithfulness and dishonesty, your current customer is still working with us to get us paid and a Mechanics Lien is in place and will remain on you and your\ncompany as well as the customer until the matter is resolved.  I was present that night and directed Mr Hood to\nFill the pool back up partially for your refusal to make\nPayment, furthermore the police arrived because you called them and said there was nothing they could do it was a civil matter and later returned after being asked could we keep filling it up and say go\nAhead. The homeowner spoke to\nMr Hood and I\nAnd asked if we could handle it another way, which we have, you now have a mechanic Lien in place. The truth of the matter is you refused to make payment when given a bill, and just as one of your prior contractors told us, you would haggle prices, when given the bill you stated you had to go and see what had to be fixed and haven’t even stepped foot on the site. So I instructed Mr Hood to give you something to fix.  There is the matter of clearing and bringing to\nGrade the back yard prior to the dig on the pool 4 hours work that you still owe. The Mechanic lien will stay in place.", "pics": null, "resp": {"time": 1622340515878, "text": "Again this is a totally false post. Have never seen you on this site, there is no way you have first hand knowledge as to what has transpired. There was no refusal to make payment and in fact payment was offered that was never picked up. Not sure who you say is a prior contractor but this is also inaccurate. There was also no \"haggling\" of price and Mr. Hood gave a price too low for the job and we agreed to pay more even though we could have held to the original price offered by Mr. Hood. Mr. Hood was offered a draw on the job which was done improperly and never completed. Please stop the harassing posts and text."}, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "111010589820748125868", "name": "Kari Snipes", "time": 1615906179961, "rating": 1.0, "text": "Only one star... I wouldn’t have given even a one star! These people cut off my pool ladder and rain that was on the steps going into the pool when they came to close it at the end of the year. Today they came to open it and were supposed to put ladder and rail back on, as well has fix a pipe that is letting water out.  They left a ROCK on top of the leak and told us to go to Lowe’s to buy a pipe. They didn’t put the handrail back on bc of a crack in the cement. (Which they should’ve seen before taking it off when they closed the pool) so now, there is a big sharp piece of metal coming up out of our concrete.  The ladder has a huge gap. It’s totally UNACCEPTABLE. I would not recommend these people.", "pics": null, "resp": {"time": 1615932629059, "text": "Ms. Snipes, I'm sorry that you felt the need give this rating. I have spoken to both of the Technicians that came to your pool and they talked to and walked the pool with your husband when they completed your pool opening. The ladder and handrail were removed at homeowner request in the Fall. Our Technician spoke with your husband about a pipe that he broke. We don't typically carry adapters for that size pipe and gave your husband the option of us returning to repair and gave instruction on repair if he wanted to save the cost of our return. Our Technicians had the parts to repair and reinstall your rail goods but along with your husband determined that the concrete surrounding the rails were in too bad condition to install them at this time. Our Technician has tried to contact your husband since your review to discuss what happened since he was pleased when they spoke with him before they left. Please feel free to contact me if you would like to discuss. 205-601-3385 ask for Glen."}, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "118433513514912205715", "name": "Eric Parish", "time": 1614894552654, "rating": 1.0, "text": "Earlier in the year, I called and successfully set up an appointment to have someone look at my hot tub. However, the weather took a turn and the appointment had to be postponed.\n\nToday, I called back and the lady who answered told me that my hot tub was too old for them to look at - which may be true. However, her rationale was \"once you fix one thing, another one just pops.\" I kid you not...a service company doesn't want multiple issues to service. She's not in sales, but she's no better at customer service. She didn't want my business and, lucky for her, she won't be getting it.", "pics": null, "resp": {"time": 1614893875427, "text": "Mr. Parish, I am sorry that you feel that way. We work on many hot tubs and have found from our experience that working on older tubs like yours is almost always an issue. The lady you spoke with tried to explain correctly the reasons for this. We try to look out for the best interest of our customers while protecting our Technicians and their time. I hope you can see your way to remove this review. This is only because you didn't like the answer you received and we hope you find someone that can meet your expectations."}, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "109791805986318870548", "name": "Andrea Kayla", "time": 1621980405376, "rating": 5.0, "text": "This is a very good company I will refer them to any and everyone", "pics": null, "resp": null, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "106813361054963426137", "name": "C Rod", "time": 1621974463001, "rating": 5.0, "text": "This is a very good company and I would recommend them to everyone.", "pics": null, "resp": null, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "102222411365110893152", "name": "Lee Williams", "time": 1621968812273, "rating": 5.0, "text": "Does a very good job and would recommend to anyone", "pics": null, "resp": {"time": 1621973490704, "text": "Thanks for the kind words"}, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "105396155948274746529", "name": "Sydney Allen", "time": 1621987860469, "rating": 5.0, "text": "Awesome experience! 👍🏼", "pics": null, "resp": null, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "105545770709657206746", "name": "Greg Doss", "time": 1589470226163, "rating": 5.0, "text": "Ryan from Swimming Pool Services came out today and changed the sand filter. Ryan was very professional and his work was outstanding. He explained everything he did and went above and beyond to take care or our pool. I recommend Swimming Pool Services and their staff for anything your pool needs. Thanks to all at Swimming Pool Services for the outstanding service. They should be your first call.", "pics": null, "resp": {"time": 1589479193828, "text": "Greg, Thanks for the review! We agree, Ryan is a great tech. Let us know if we can help you in any other way."}, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "111474427939458980668", "name": "Jenny Johnston", "time": 1582074289532, "rating": 5.0, "text": "So happy to have found Swimming Pool Services. They did such a great job bringing our pool back to life! Very friendly and hard working staff. We really appreciate their high quality of standards and care, which is why they will continue to be our go to place for any of our pool needs. Highly recommend.", "pics": null, "resp": {"time": 1582078029794, "text": "Ms. Johnston, So glad we could help. We look forward to working with you moving forward!"}, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "114510926131564739042", "name": "Jack Russell", "time": 1571169664296, "rating": 5.0, "text": "Glenn and his team do an amazing job. Not only are they courteous and hardworking, but they really know the business inside and out. There is nothing they cannot handle. I wouldn't trust a new pool construction, maintenance, or repair to anyone else. They are the best and I couldn't be more happy with their work and professionalism.", "pics": null, "resp": {"time": 1571171528933, "text": "Thanks Jack. we appreciate you also."}, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "103773133951462250431", "name": "Erin", "time": 1570689267752, "rating": 3.0, "text": "Associates are more focused on selling their services than helping owners care for their own pool. I understand they are for profit but some of us enjoy doing our own maintenance.", "pics": null, "resp": {"time": 1570705532525, "text": "Erin, Thanks for your comment. We will always use these to improve our in store customer service. We always support the DIY'er. Please let us know if we can help in any way."}, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "107676781045440470539", "name": "Elaine Naccarato", "time": 1567777286670, "rating": 1.0, "text": "ADVISE EVERYONE NOT TO USE THIS COMPANY.  We had a pool liner replaced and it took over 3 months and then they broke our equipment and didnt replace it, we had to fix it ourselves.  On of their workers turned a switch and our pool turned green since we were away over the weekend.  Now they are trying to bill a late fee charge since the bill has not been paid in full since it is in dispute since they have not paid us for the broken equipment.  BEWARE IF YOU USE THEM", "pics": null, "resp": {"time": 1567789249322, "text": "Ms. Naccarato, I'm sorry to see that you felt it necessary to post a review like this and that your assessment of what happened as it is not accurate. There was a delay in your liner due to some of the measurements that the factory needed, your husband gave us a bad review then and a week later asked us to move forward with the liner. As far as your equipment goes the clips for the top of your chlorinator broke which have no bearing on its operation. I tried to discuss this with your husband but he continued to hang up on me! I am not aware of any switch that was turned off or of your pool turning green but would be happy to discuss this just like, I tried with your husband. Please call us at the store if you would like to discuss."}, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "112434293733426817307", "name": "Yoni Padan", "time": 1548454087955, "rating": 5.0, "text": "Best Customer Service, great pricing.  I switched from a different company to them and I am SUPER pleased. SO MUCH better!", "pics": null, "resp": {"time": 1548456915424, "text": "Mr. Padan, Thanks for the great review. We are happy that you are pleased, Let us know if we can help with anything else."}, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "114019013241028393389", "name": "Mr B", "time": 1537805390911, "rating": 5.0, "text": "I called 5 different companies trying to hire someone to open/clean my pool, and change the sand in the filter. Three said they didn't provide the services and two never showed.  Then I found Swimming\nPool Services. From the moment Ashton answered the phone I knew I was dealing with a professional and reputable company. They gave  me a price  and schedule my service( I called on a Friday afternoon and they were at my house on the following Monday afternoon) .  The service staff was friendly, knowledgeable, and highly professional.  I would highly recommend Swimming Pool Services.  The experience was outstanding!!!!  I will be making an appointment soon to have the pool closed and winterized.  Thanks to all of you that I interacted with during this service!!", "pics": null, "resp": {"time": 1537806525568, "text": "Mr. B, Thanks for your review. We look forward to working with you in the future."}, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "103687736326017011250", "name": "Michael Ray", "time": 1559223213469, "rating": 5.0, "text": "These guys do amazing work! On time and professional. They were highly recommended and did not disappoint.", "pics": null, "resp": null, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "107304012896912361459", "name": "William Phillips", "time": 1570726985367, "rating": 5.0, "text": "Glen and his team of professionals will take great care of you and your pool needs!", "pics": null, "resp": {"time": 1570730515014, "text": "Thanks for the kind comments William."}, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "107977997279462866725", "name": "Lisa Caldwell", "time": 1568244573052, "rating": 5.0, "text": "So easy to work with! Reliable service on my schedule! Would totally recommend!", "pics": null, "resp": {"time": 1568248551158, "text": "Thanks Lisa, we like working with you also!"}, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "105953041235705137882", "name": "LAURA MANSEL", "time": 1568246846494, "rating": 5.0, "text": "Good service, staff was professional. Would recommend", "pics": null, "resp": {"time": 1568248609330, "text": "Thanks Laura we appreciate your business!"}, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "117519822572625143778", "name": "Nicole Morris", "time": 1570740003447, "rating": 5.0, "text": "Great service and prices!! Highly recommend!!", "pics": null, "resp": {"time": 1570741317366, "text": "Thanks Nicole, we appreciate your business!"}, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "105553392088633698785", "name": "Sandra Wilder", "time": 1560971647969, "rating": 5.0, "text": "It’s a shame that more people that have great experiences don’t leave reviews! When someone is impossible to please,  they are very quick to leave a negative review.   I actually contacted these guys last because of the review rating and that was a big mistake! The service was excellent not to mention the cost will be over half the cost of everyone else.  As a matter of fact I haven’t paid a penny yet and the pool is ready!  They were on time and our pool went from  A mosquito maternity ward to Crystal clear in less than a week!   If you are not a pool professional then I would be contacting these folks to take care of your pool! Relieve yourself of some stress and make the call.  🤗😎", "pics": null, "resp": {"time": 1561028616557, "text": "Ms. Wilder, Thank you for your review and I agree totally with your comments. I am glad we could help you out."}, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "109594622113703007131", "name": "Nadia Wilder", "time": 1538668246466, "rating": 5.0, "text": "Friendly and professional service!  Great in-store help with weekly water testing, advice on chemicals and treatments, etc.  Whether you want regular maintenance service or prefer to DIY,  this place can help keep your pool looking perfect year-round!", "pics": null, "resp": {"time": 1557956625865, "text": "Thanks Nadia, we appreciate your business!"}, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "107208550802483649830", "name": "Hayley Douglas", "time": 1532010817788, "rating": 1.0, "text": "Very poor customer service on the owners end.  After a mistake was made on my pool I requested to speak to someone in charge and was told the owner would call me.  I've waited over 3 weeks for a call and not once has he tried to get in touch with me.  I called back several times requesting to speak to him only to be told \"he wasn't in and would call me back\".\nHorrible customer service to not even return a call. He should have reached out to me the second he heard about the mistake.  Granted I do have a small above ground pool but I'm still a paying customer.  We will never shop here again or recommend this business to anyone.\n\nEdited to add after owners response... The things you stated are false.  I did provide a picture of my pool along with the dimensions of it to your staff member.  She put 12'x30' (feet) instead of 12'x30\"(inches).  Also, I was told multiple times by your staff that YOU would call me or when I would call back to try to get you they would tell me something you said so I know there was some communication going on.  Another thing I was NOT asking for free chemicals.  I even told the girl that when I went back in in person to have the water checked again to see how bad was. I'm not sure where the miscommunication is happening between you and your staff but that needs to change.   But when someone leaves a review it is that person sharing their experience, good AND bad, they had with that particular business.", "pics": null, "resp": {"time": 1531956104640, "text": "Ms. Douglas, I am truly sorry if you were trying to reach me but I did not have a message to call as after speaking with my staff, they said they handled your issue and after hearing about what happened they did handle it exactly as I would have. We can't be responsible for chemical dosages used when we are not given the proper gallons for your pool. Our dosages given are all based on information that is supplied by our customers unless we send a Technician out to the pool to measure and get accurate volumns. My staff in an effort to help after getting the proper size of your pool did in fact give you chemicals at no charge to treat. My understanding is that you wanted a continuing supply of chemicals at no charge. We make every effort to ensure that you have what you need and are very conservative when dosing a pool typically, however in this case the overdosing was not something we could control based on the information that we had. Social media and review sites are an easy way to try to hurt a smalll business when we are trying to do the right things. If you would like to discuss now that I know you would like to speak with me offline please send a contact number to my email at gij@swimmingpoolservices.net and I assure you that I will call you to discuss. Again, sorry if there was any misunderstanding but feel free to reach out to me by email."}, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "102337490347886097174", "name": "shannon Mcrae", "time": 1568295272591, "rating": 5.0, "text": "Christy was amazing! Definitely going back!", "pics": null, "resp": null, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "102633105624105290593", "name": "Brice Jackson", "time": 1520103884414, "rating": 5.0, "text": "Great facility! Knowledgeable and friendly staff. If you have any questions regarding a pool or spa, Swimming Pool Services will be very helpful!", "pics": null, "resp": null, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "103147111960932094207", "name": "Michael Weber", "time": 1508196978999, "rating": 5.0, "text": "Glen was kind enough to help me trouble shoot my Polaris.  He made several suggestions on things I can do to improve my pool experience and they've all been true.  I highly recommend Swimming Pool Services for their expertise and professionalism!", "pics": null, "resp": null, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "101216743082299773656", "name": "Robert Evans", "time": 1508167633818, "rating": 5.0, "text": "We are very happy with the work that we had done on our pool. So happy to have found some honest contractors who do what they say they will do and keep us in the loop along the way.", "pics": null, "resp": null, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "109456710734037597303", "name": "Ryan Brasher", "time": 1531880436320, "rating": 5.0, "text": "Great people with visible passion for the work they do. Always a pleasure doing business with this company.", "pics": null, "resp": null, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "109675262312600729026", "name": "steve lessing", "time": 1445486906911, "rating": 5.0, "text": "Great place to find all of your pool supplies. I have used their cleaning services for over a year. Friendly staff and great customer service.", "pics": null, "resp": null, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "110882954649776734427", "name": "Tommy Daspit", "time": 1444918651909, "rating": 5.0, "text": "Amazing attention to detail and knowledge. Been working with them for 2 years. Highly recommend them to everyone I know with a pool!", "pics": null, "resp": null, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "106593543888362688320", "name": "Valerie Sawyer", "time": 1453566549608, "rating": 5.0, "text": "We have been shopping here for several years. Great staff in the store and they did a great job on our liner. They always make sure we are satisfied and have helped solve chemical problems. They even came out on a freezing Saturday morning to repair the pump and avoid further problems from the cold!", "pics": null, "resp": null, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "108815118350255098371", "name": "Amy Self", "time": 1559223214634, "rating": 5.0, "text": "Great customer service and very professional.", "pics": null, "resp": null, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "108661753938861861634", "name": "James Brown", "time": 1444953086543, "rating": 5.0, "text": "I used swimming pool services for all of my pool maintenence.  I never had to worry about the condition. Very professional company with competitive prices.", "pics": null, "resp": null, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "115008367664782796332", "name": "Dave Stephenson", "time": 1443099895633, "rating": 5.0, "text": "I have worked with swimming pool services and used  them personally. If you want an experienced, quality and honest company company to deal with Swimming pool services are definitely the company to use.", "pics": null, "resp": null, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "109479465163016315443", "name": "Dale Pangman", "time": 1492445835640, "rating": 1.0, "text": "Very dissatisfied. We had been using Swimming Pool Services (SPS) since we moved into our home in 2008. They opened and closed our pool each season and we bought our chemicals for our pool and hot tub from them as well. The last few years, the service began to drop. When we called to complain, we were told it's hard finding good help. In Oct 2012, we bought a hot tub from them. In Oct 2016, the hot tub quit running. When the repairman came out, he said we needed to buy a new pump. After waiting a few days for SPS to give us an estimate on a new pump, my wife called the maker of the hot tub, Shoreline Dynasty Spa, and got an estimate from them. We decided to try to fix it ourselves and took the pump to Alabama Pump and Supply who fixed it for much less. We then reinstalled it. After reinstalling the pump, we decided to move the spa a few feet and called SPS and were told Glen would call us back shortly as he was on a job. I waited until 2 PM. When I called back, I was told they wouldn't be able to help us until sometime the next week. TIME TO MOVE ON. We had experienced poor service many times over the years, but weren't sure who to use. Thanks to SPS's poor service, we now open and close our pool and we use Shoemaker pool services for our supplies.", "pics": null, "resp": null, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "116758975419096739774", "name": "Tracy Tindle", "time": 1508201224133, "rating": 5.0, "text": "Friendly staff and very helpful in the store!", "pics": null, "resp": null, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "100068309862939552418", "name": "Leta Goolsby", "time": 1461424069620, "rating": 5.0, "text": "Great place to buy Swimming Pool Supplies!", "pics": null, "resp": null, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "100068309862939552418", "name": "Leta Goolsby", "time": 1461424069620, "rating": 5.0, "text": "Great place to buy Swimming Pool Supplies!", "pics": null, "resp": null, "gmap_id": "0x8889160edb55cccb:0x23ec29414e6d595e"}
{"user_id": "116501029675856444579", "name": "Christy Webley", "time": 1621282687436, "rating": 1.0, "text": "Initial response by Pools Plus in March was positive. Called for Hayward pool heater service call. Pools Plus is the ONLY authorized repair dealer for Huntsville. First call went fine, but I was told we needed a new heat exchanger and it would have to be installed by an electrician. I contacted the recommended electrician and he said he would coordinate with Pools Plus. That was April 1. When I heard nothing from anyone, I began following up with Pools Plus again the week of April 19. I have called no less than 10 times and NEVER get a call back. NOT ONCE. Everyone says they need to check with John, but John never calls back. I got ahold of the electrician  the week of May 10 and he said he spoke to John about it the week before and the part hadn't even been ordered. Stay as far away from this company as you can. I will be reporting to the Better Business Bureau and filing a formal complaint with Hayward. They need better representation in this area or people need to buy another brand.", "pics": null, "resp": null, "gmap_id": "0x88621191312db391:0x954e67b70c4591df"}
{"user_id": "116337750171208002553", "name": "Elli Maye", "time": 1616621921235, "rating": 1.0, "text": "Typical salesmen tactics. Promise you everything and deliver on nothing. Took our business elsewhere.", "pics": null, "resp": null, "gmap_id": "0x88621191312db391:0x954e67b70c4591df"}
{"user_id": "107234246403720074653", "name": "Michael Salmon", "time": 1594343595911, "rating": 1.0, "text": "Worst customer service experience I have ever had! Purchased the pool and everything was going well until we refused to accept the wrong liner that they order. After that the started dragging their feet. I had to run the electrical conduit because they wouldn’t. Finally a guy showed up to run the electrical and did it wrong, failing the inspection and two weeks later still no fix. Took them three weeks to install the ladder. Still waiting on the yard to get fixed , huge mound of dirt and mud. Looks like a lot of wasted money seeing how I’m going to have to pay another contractor to come fix their disaster! Avoid this company at all cost. I will be reporting them to the BBB! 4 months on a basic install, nothing fancy.", "pics": null, "resp": null, "gmap_id": "0x88621191312db391:0x954e67b70c4591df"}
{"user_id": "113820598771064284464", "name": "Stuart", "time": 1589592861600, "rating": 5.0, "text": "Helpful. Not pushy. Great advice. Great prices. Worth going over the mtn...", "pics": null, "resp": null, "gmap_id": "0x88621191312db391:0x954e67b70c4591df"}
{"user_id": "114916921107303491808", "name": "Ypsilanti Rox", "time": 1532969700942, "rating": 1.0, "text": "One star because I can't give zero. Hands down the worst customer service and quality of work in the area for pools. Gary came to look at my liner in fall 2017 and we agreed on a new liner in April 2018. April 2018 arrived and I called Gary to get the new liner installed. After at least half a dozen calls, called the main number again and  asked the guy who answered the phone what was going on. They said I was on the liner list for 2017! That doesn't explain Gary not returning calls or texts. And how could we be on the liner list for the previous year!? Just an awful place to do business with. Also had a problem with a Polaris vacuum and called for service a week ago. No call back - NOTHING. Contacted a better company and they responded quickly. Three days after the call, Pools Plus people were in my backyard looking at the pumps. No call to confirm they were coming and then had the nerve to say I could be charged because I didn't call to cancel! Well, they didn't call back to say they were responding to the service call.\n\nThe service was much much better five years ago. Now it's garbage and you're better off using anyone else. Horrible service. Horrible communication. It's like they're TRYING to go out of business. Let's hope that happens soon so other customers don't have to deal with this place.\n\nI can’t prove it but I’m fairly confident any positive reviews are anomalies, family or friends of the owner, or paid reviews. This place is inexplicably bad in every regard. If you are thinking of doing business with them, take a moment and ask yourself if your money and time is well spent on people who will ignore you and outright lie.", "pics": null, "resp": null, "gmap_id": "0x88621191312db391:0x954e67b70c4591df"}
{"user_id": "103549717148165907179", "name": "Tina Hunter", "time": 1563820520754, "rating": 5.0, "text": "Pools Plus employees Alex is always a wonderful source of information.  Strongly recommend going there", "pics": null, "resp": null, "gmap_id": "0x88621191312db391:0x954e67b70c4591df"}
{"user_id": "103439175387278177206", "name": "S R", "time": 1528166682759, "rating": 1.0, "text": "Pools plus was the worst mistake we have ever made with a “contractor”. The travertine around our pool was installed incorrectly (and never grouted). The “owner” never checked for leaks before installing the liner (which he said he would do), and the liner is now pulling away at the top of the pool after finally being filled. The installment began over one year ago and our end result is a screwed up job that we will have to have redone by professionals. The electricity to the light in the pool does not work and the installers broke our brand new salt system during this debacle. Please check with the Better Business Bureau before using this “company” -we regret that we did not do our research before being duped by the “owner”.", "pics": null, "resp": null, "gmap_id": "0x88621191312db391:0x954e67b70c4591df"}
{"user_id": "117445412575644229541", "name": "Dana Craig", "time": 1512507978951, "rating": 2.0, "text": "Initial purchase was ok. Bought a floor model that was a good buy. But you get what you pay for. Bought a lemon. Service is impossible. Called for service. They were too busy and put us on a list. Called us 6 months later after we had someone else fix.", "pics": null, "resp": null, "gmap_id": "0x88621191312db391:0x954e67b70c4591df"}
{"user_id": "103718806674624159020", "name": "Pam Haws", "time": 1526576399464, "rating": 1.0, "text": "Can't give 0 stars or I would!\n\nThey have had our 700 bucks up front for 2 months to \" fix\" our jacuzzi...Still not working -and I was just told we owe them another $200..When i complained Alec hung up on me..Owner hasn't called back to address our problem like he was supposed to last week...Must be relatives or friends giving them positive reviews b/c this is worst company we have dealt with in a long time!! Don't pay upfront!! Pay when it's fixed if they can fix it!", "pics": null, "resp": null, "gmap_id": "0x88621191312db391:0x954e67b70c4591df"}
{"user_id": "107907431039386808868", "name": "David Makowski", "time": 1524354602416, "rating": 5.0, "text": "Went above and beyond, really more than he should have, to solve my problem.  Verrrry happy customer.", "pics": null, "resp": null, "gmap_id": "0x88621191312db391:0x954e67b70c4591df"}
{"user_id": "107813088468778274745", "name": "Kip Hicks", "time": 1492433460440, "rating": 1.0, "text": "I had to have other professionals fix what they wouldn't per our agreement. One of the worse contractor experiences I (personally) have ever had, period.", "pics": null, "resp": null, "gmap_id": "0x88621191312db391:0x954e67b70c4591df"}
{"user_id": "114246121589072014313", "name": "Jackie Fisher", "time": 1520645361072, "rating": 1.0, "text": "My girlfriend said everybody was rude\nLow class pools and way overpriced.", "pics": null, "resp": null, "gmap_id": "0x88621191312db391:0x954e67b70c4591df"}
{"user_id": "104312777296877421358", "name": "David Reid", "time": 1539973555336, "rating": 1.0, "text": "They took ten thousand dollars from me", "pics": null, "resp": null, "gmap_id": "0x88621191312db391:0x954e67b70c4591df"}
{"user_id": "102128516049759978201", "name": "T. Barnes", "time": 1528728193485, "rating": 4.0, "text": "Full service pool care.", "pics": null, "resp": null, "gmap_id": "0x88621191312db391:0x954e67b70c4591df"}
{"user_id": "103026927169268668533", "name": "FJ B", "time": 1502230934632, "rating": 4.0, "text": "Prices are high!", "pics": null, "resp": null, "gmap_id": "0x88621191312db391:0x954e67b70c4591df"}
{"user_id": "107737648039548191264", "name": "Alicia Ott", "time": 1499874902913, "rating": 5.0, "text": "Helpful and friendly folks", "pics": null, "resp": null, "gmap_id": "0x88621191312db391:0x954e67b70c4591df"}
{"user_id": "105034730303035268603", "name": "Dominic Medici", "time": 1497023948755, "rating": 5.0, "text": "Be sure and ask them for an Imperial pool!", "pics": null, "resp": null, "gmap_id": "0x88621191312db391:0x954e67b70c4591df"}
