{"user_id": "107138705211410703313", "name": "The Stig", "time": 1629752299688, "rating": 5.0, "text": "Nice folks! Very tasty handmade treats and gelato.", "pics": null, "resp": null, "gmap_id": "0x88626845272a3d95:0xbd3a8a29d6a83428"}
{"user_id": "115290952165659817516", "name": "Ebonie Williams", "time": 1615564902743, "rating": 5.0, "text": "The amount of attention and love that goes into these treats is INCREDIBLE. I had the toffee almond popcorn and it will forever be my favorite. The popcorn is light, evenly coated, and all around one of the best flavors of popcorn ever! Zion popcorn has the best recipes hands down!!", "pics": null, "resp": {"time": 1615945595584, "text": "Thanks Ebonie for the 5 Starz review. I appreciate your business at Zion Gourmet Popcorn Store. We look toward to sending you more yummy treats."}, "gmap_id": "0x88626845272a3d95:0xbd3a8a29d6a83428"}
{"user_id": "100744552592572634773", "name": "Vernon Herron JR", "time": 1618769578049, "rating": 5.0, "text": "Great snacks and Gelato here. Love to see a teachers discount too!", "pics": null, "resp": {"time": 1619800523664, "text": "Vernon Herron thanks for the 5 stars. We appreciate your business."}, "gmap_id": "0x88626845272a3d95:0xbd3a8a29d6a83428"}
{"user_id": "113187805573733995888", "name": "Chris Hamilton", "time": 1614227589662, "rating": 5.0, "text": "Great folks here, wonderful service and food. Reasonable prices", "pics": null, "resp": {"time": 1614241386140, "text": "Chris Hamilton we appreciate your business. Thanks for the outstanding 5 star rating for Zion Gourmet Popcorn Store."}, "gmap_id": "0x88626845272a3d95:0xbd3a8a29d6a83428"}
{"user_id": "111808640908769233033", "name": "CC G", "time": 1602026372689, "rating": 5.0, "text": "The fudge is amazing! I had the chocolate and pecan fudge. My daughter had the oreo fudge! The owner is so sweet! She conversed with me for a while! A nice clean environment!", "pics": null, "resp": {"time": 1602032462139, "text": "Thanks CC G for giving Zion Gourmet Popcorn Store a 5 star. I enjoyed serving you and your daughter yummy treats today. We appreciate your business very much.\nSandra Polk owner"}, "gmap_id": "0x88626845272a3d95:0xbd3a8a29d6a83428"}
{"user_id": "108298885083004676406", "name": "Ellen George", "time": 1599405102639, "rating": 5.0, "text": "The owner is super kind and friendly and everything I've tried has been delicious!(gelato, fudge, and chocolate) I highly recommend the blue cookie monster gelato if you have kids! The fudge is always soft and delicious and they have lots of unique flavours each time I visit!", "pics": null, "resp": {"time": 1599409263698, "text": "Thanks Ellen George for the lovely comments about Zion GourmetPopcorn Store. We really appreciate your business very much. We do our best to treat our customers like Kings and Queen.\nSandra Polk owner"}, "gmap_id": "0x88626845272a3d95:0xbd3a8a29d6a83428"}
{"user_id": "106984870059584322804", "name": "Taylor K", "time": 1579901001222, "rating": 5.0, "text": "It's so much more than just popcorn. Don't get me wrong, the popcorn options are delicious, unique and homemade. They also have chocolates, truffles, turtles, bon bons, candy/caramel apples and fudge. I could write for days about the fudge. All homemade by the owner. Coconut, chocolate peanut butter, pistachio, raspberry, salted caramel... seriously all amazing! They will give you samples of most products to try before you buy. Not that you need to because you can't go wrong with anything there.", "pics": null, "resp": {"time": 1579913329698, "text": "Thanks Taylor for your 5 Stars reviews we truly appreciate your business very much. We look forward to servingyou yummy treats soon from Zion Gourmet Popcorn Shop."}, "gmap_id": "0x88626845272a3d95:0xbd3a8a29d6a83428"}
{"user_id": "110804346038023249892", "name": "Dawn Fields", "time": 1580765125125, "rating": 5.0, "text": "This place is a wonderful Madison small business. The gelato and homemade candy is SO delicious and affordable. Great family atmosphere in historic Madison. Darling and the owner is a sweetheart!", "pics": null, "resp": {"time": 1580769508725, "text": "Thanks Dawn for the 5 stars review. We appreciate your business very much at Zion Gourmet Popcorn Shop."}, "gmap_id": "0x88626845272a3d95:0xbd3a8a29d6a83428"}
{"user_id": "106760380598672854451", "name": "Jenny Mayers", "time": 1583946092062, "rating": 5.0, "text": "Sandra and her son Will are both so friendly and helpful and helped me choose what I needed for a gift for my hubby. Her chocolates and popcorn are amazing!", "pics": null, "resp": {"time": 1583965763287, "text": "Thanks Jenny for the 5 stars today. We appreciate your business very much."}, "gmap_id": "0x88626845272a3d95:0xbd3a8a29d6a83428"}
{"user_id": "110212378577499512379", "name": "Dana May", "time": 1533677943950, "rating": 5.0, "text": "I was very disappointed to discover that Sallie's Whistle Stop Sweet Shop closed. Thankfully, Zion Gourmet Popcorn moved into it's location and kept the sweets selection from Sallie's. Zion Gourmet Popcorn offers the same variety of fudge, chocolate treats, bagged candies, and ice cream as Sallie's did. In addition to this, they have gourmet popcorn that is air popped and made on-site. They currently offer butter, caramel, cheese, and savory white cheddar flavored popcorn. The store was redecorated but still has the \"cool candy store\" vibe that it did before. My kids and I stopped in to grab a sweet treat for their new teachers for the first day of school. We also grabbed some popcorn for ourselves and it was delicious! We will definitely return to try out the fudge, ice cream and other goodies!! I love supporting local businesses and am so glad that Zion Gourmet popcorn has opened!", "pics": null, "resp": {"time": 1534647123919, "text": "Thanks Dana for purchasing  some yummy treats from Zion Gourmet Popcorn Shop.  We appreciate your business. We look forward to seeing you again soon. Sandra Polk"}, "gmap_id": "0x88626845272a3d95:0xbd3a8a29d6a83428"}
{"user_id": "110354401155566279573", "name": "Nickie Juarez", "time": 1560529583182, "rating": 5.0, "text": "We've gone in store and also bought their popcorn online to be shipped as gifts. They are super friendly and nice. It's always fresh and the flavors are amazing. I'm very excited to try their fudge and Gelato the next time.", "pics": null, "resp": {"time": 1560565926009, "text": "Thanks Nickie for sharing your postive experience at Zion Gourmet Popcorn Shop. We appreciate your business very much."}, "gmap_id": "0x88626845272a3d95:0xbd3a8a29d6a83428"}
{"user_id": "115831349602504123088", "name": "Kaitlin Bailey", "time": 1555555699173, "rating": 5.0, "text": "They have amazing popcorn and wonderful treats! Definitely recommend coming here! The staff is so friendly and always let you sample things! Shop local!", "pics": null, "resp": {"time": 1555806345882, "text": "Thanks Kaitlin for sharing your great experience at Zion Gourmet Popcorn Shop.  We appreciate your business very much and we look forward to serving you yummy treats."}, "gmap_id": "0x88626845272a3d95:0xbd3a8a29d6a83428"}
{"user_id": "100639136317701567985", "name": "Carlos Matamoros III", "time": 1542331920279, "rating": 5.0, "text": "Great customer service!!  GREAT FUDGE!!! And five thumbs 👍🏻👍🏻👍🏻👍🏻👍🏻 Up for the GREAT POP CORN!!! This will be the place I order my pop corn from now on. I will be ordering stuff for my staff for Christmas. Thanks Zion popcorn for your quick deliveries and your fresh popcorn!!!", "pics": null, "resp": null, "gmap_id": "0x88626845272a3d95:0xbd3a8a29d6a83428"}
{"user_id": "117060067129521183708", "name": "Keiana Mcnabb", "time": 1542469192807, "rating": 5.0, "text": "My family and I love this popcorn. It's always fresh and makes for a great snack around the holidays. I've even given it away as a gift before. Love love love it!", "pics": null, "resp": null, "gmap_id": "0x88626845272a3d95:0xbd3a8a29d6a83428"}
{"user_id": "105267126837133211386", "name": "Kristin Brewer", "time": 1553035154233, "rating": 5.0, "text": "Awesome service. Gelato was amazing! Popcorn was delicious. I didn't try the fudge but I'm betting it's as good as everything else.", "pics": null, "resp": {"time": 1553100010555, "text": "Thanks Kristin for sharing your experience on Google from Zion Gourmet Popcorn Shop. We appreciate your business very much.  We look forward to seeing you  again for some more yummy treats. Sandra"}, "gmap_id": "0x88626845272a3d95:0xbd3a8a29d6a83428"}
{"user_id": "115238724387379134650", "name": "Kayla Drake", "time": 1542468584655, "rating": 5.0, "text": "Very nice people! Always there to help you when you need it!! Definitely will be making another visit soon! And the popcorn is great and the fudge is AMAZING! ❤️❤️", "pics": null, "resp": null, "gmap_id": "0x88626845272a3d95:0xbd3a8a29d6a83428"}
{"user_id": "101326005815752368533", "name": "Christy Russell", "time": 1584645061036, "rating": 5.0, "text": "The most amazing milk chocolate turtles!! Praline fudge is heaven!!!", "pics": null, "resp": {"time": 1584653430863, "text": "Thanks Christy for the 5 stars review on Google. We appreciate your business very much. Sandra Polk Zion Gourmet Popcorn Shop"}, "gmap_id": "0x88626845272a3d95:0xbd3a8a29d6a83428"}
{"user_id": "102889755266221118606", "name": "Loring Brister", "time": 1566581041159, "rating": 5.0, "text": "Friendly employees with good verity of ice cream and popcorn clean place to eat", "pics": null, "resp": {"time": 1566583192164, "text": "Thanks Loring we appreciate your business very much and we look forward to eating some more yummy treats.  Sandra Polk Zion Gourmet Popcorn Shop."}, "gmap_id": "0x88626845272a3d95:0xbd3a8a29d6a83428"}
{"user_id": "115140292454134123903", "name": "Lee-Anne Hooks", "time": 1559070770738, "rating": 5.0, "text": "Terrific popcorn and gelato! Such nice people too.", "pics": null, "resp": {"time": 1559087432916, "text": "Thanks Lee-Anne for trying our yummy treats. We have lots of new Gelato and popcorn flavors coming this summer. We appreciate your business."}, "gmap_id": "0x88626845272a3d95:0xbd3a8a29d6a83428"}
{"user_id": "112559308593436580564", "name": "tyler brown", "time": 1542495560183, "rating": 5.0, "text": "The customer service was very efficient. I enjoyed my pop corn in different flavors, be sure to experience this place you won’t be disappointed.", "pics": null, "resp": {"time": 1552328426546, "text": "Thanks Tyler we appreciate your business.  We look forward to you returning to Zion Gourmet Popcorn Shop for some more yummy treats."}, "gmap_id": "0x88626845272a3d95:0xbd3a8a29d6a83428"}
{"user_id": "115520096876225897705", "name": "K Turner", "time": 1542468029370, "rating": 5.0, "text": "Looooooove their popcorn! So professional, friendly, and welcoming. You won’t be disappointed.", "pics": null, "resp": null, "gmap_id": "0x88626845272a3d95:0xbd3a8a29d6a83428"}
{"user_id": "111319295537283479609", "name": "audriana elizabeth", "time": 1541160517259, "rating": 1.0, "text": "The man working yesterday around 5, was very rude and asked a lot of inappropriate questions, we had the intention of buying popcorn but instead we decided not to because of his rude remarks and awkward persistent behavior, he simply could've answered our question. And asked if we were filming within the store multiple times which we would not do without permission. I will not recommend Zion to anybody because the treatment of potential customers was not immaculate and was extremely disrespectful.", "pics": null, "resp": {"time": 1541167394007, "text": "To whom it may concern, the students asked to perform or do a music video in the store. The questions I asked the group that came in was the name of their group and the song that they where performing. I let them know that they could possibly perform the video at a later date because things like that would need to be cleared by management. I sincerly apologize if those questions seemed rude. I also asked for the lyrics of the song they where performing or playing because lyrics or just as important as an amazing beat or musical selection. Much success to those students in life and the teachers teaching them."}, "gmap_id": "0x88626845272a3d95:0xbd3a8a29d6a83428"}
{"user_id": "104637866085315194320", "name": "Stephen Robinson", "time": 1576270108631, "rating": 5.0, "text": "Amazing fudge and great popcorn!", "pics": null, "resp": {"time": 1579986360673, "text": "Thanks Stephens we appreciate your business very much. Sandra"}, "gmap_id": "0x88626845272a3d95:0xbd3a8a29d6a83428"}
{"user_id": "113402996472439284320", "name": "Veta Joiner Rodriguez", "time": 1542312597880, "rating": 5.0, "text": "My family and I love the cheese and caramel popcorn. They provide awesome customer service.", "pics": null, "resp": {"time": 1542331813342, "text": "Thanks Veta we look forward to seeing you again at Zion Gourmet Popcorn Shop in downtown Madison City ."}, "gmap_id": "0x88626845272a3d95:0xbd3a8a29d6a83428"}
{"user_id": "103412146645165783933", "name": "Robin Nichols", "time": 1542471047713, "rating": 5.0, "text": "Awesome ppl, great popcorn and candy..", "pics": null, "resp": {"time": 1552328629525, "text": "Thanks Robin for trying Zion Gourmet Popcorn Shop.  We look forward to seeing you soon to purchase your Cajun popcorn. Bring your daughter she will love the shop ."}, "gmap_id": "0x88626845272a3d95:0xbd3a8a29d6a83428"}
{"user_id": "115550369279425958417", "name": "Quincy Kelly", "time": 1542316541370, "rating": 5.0, "text": "I love the cheese popcorn.", "pics": null, "resp": {"time": 1542331899526, "text": "Quincy we enjoy seeing you eating our cheese popcorn."}, "gmap_id": "0x88626845272a3d95:0xbd3a8a29d6a83428"}
{"user_id": "114970479527889928957", "name": "Chantera Smith", "time": 1542469214017, "rating": 5.0, "text": "Amazing Service!!! Very Pleased!", "pics": null, "resp": null, "gmap_id": "0x88626845272a3d95:0xbd3a8a29d6a83428"}
{"user_id": "103782170531041405719", "name": "Shakira Lovett", "time": 1542467340390, "rating": 5.0, "text": "Best gourmet popcorn in town, you will not be disappointed!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x88626845272a3d95:0xbd3a8a29d6a83428"}
{"user_id": "113677359973401200497", "name": "Semper Paratus", "time": 1601400913785, "rating": 5.0, "text": "Fairhope sweet shop is an adorable little shop in a quaint little town on the Eastern shore of Alabama that one must visit if you happen to be exploring the area. They offer classic candy as well as New and exciting treats that is sure to satisfy just about any craving. Be sure to try their delicious Frios Ice pops too! They will cool you down from the Hot Alabama heat!", "pics": null, "resp": {"time": 1601606685738, "text": "Thank you so much for your review!"}, "gmap_id": "0x889a411892b1dbc3:0x5c6e3b678d3e06f8"}
{"user_id": "118105667728402126004", "name": "Deanna", "time": 1576153725441, "rating": 5.0, "text": "My favorite sweet shop around!!! They have all the fun cute candies, even the ones you may be searching for. Cute environment/ set up. Family friendly and very nice worker. My experience there is always positive. Good pricing and selection. Definitely worth more than a five star review. ☺️❤️", "pics": null, "resp": {"time": 1576514780713, "text": "Thank you so much for the review!"}, "gmap_id": "0x889a411892b1dbc3:0x5c6e3b678d3e06f8"}
{"user_id": "110795021128052619314", "name": "Barbara Williams", "time": 1592259421128, "rating": 3.0, "text": "Great little candy shop with all the familiar candies we have learned to love.  When i visited the store while we were in Fairhope, I did not feel like we were welcome in the store, but the clerk could have been having a bad day.", "pics": null, "resp": {"time": 1592274642950, "text": "Barbara, I’m so sorry that you felt unwelcome while visiting our shop. I will make sure I address the issue with our employees to make sure we correct this problem. Thank you for your feedback, we are always wanting to change for the better and feedback will help us do that. Hope you visit again soon."}, "gmap_id": "0x889a411892b1dbc3:0x5c6e3b678d3e06f8"}
{"user_id": "104581477742751529256", "name": "Kara Morgan", "time": 1546124065090, "rating": 5.0, "text": "Fairhope Sweet Shop is a great place to take the kids or yourself for a treat! They have all kinds of treats and candies. Cute little shop, I will definitely take my kids back next time we are in Fairhope.", "pics": null, "resp": {"time": 1557164500028, "text": "Thanks so much for your review, we are so happy you enjoy our shop!"}, "gmap_id": "0x889a411892b1dbc3:0x5c6e3b678d3e06f8"}
{"user_id": "111693475354630593037", "name": "Jason Temple", "time": 1607307577835, "rating": 4.0, "text": "Cool little boutique shop", "pics": null, "resp": null, "gmap_id": "0x889a411892b1dbc3:0x5c6e3b678d3e06f8"}
{"user_id": "107984271522260161021", "name": "Chantle Uthe", "time": 1576009096112, "rating": 5.0, "text": "Love all the different yummies from my childhood.", "pics": null, "resp": {"time": 1576514750142, "text": "Thank you so much for your review!"}, "gmap_id": "0x889a411892b1dbc3:0x5c6e3b678d3e06f8"}
{"user_id": "107946540472451210678", "name": "jack jaquess", "time": 1546491408492, "rating": 5.0, "text": "Such a cute little store! Loved the atmosphere and great candy", "pics": null, "resp": {"time": 1557164459702, "text": "Thanks so much for your review! We are so happy you enjoy our shop!"}, "gmap_id": "0x889a411892b1dbc3:0x5c6e3b678d3e06f8"}
{"user_id": "107961865676463778701", "name": "halle vines", "time": 1531362472617, "rating": 5.0, "text": "Such an awesome place!!!", "pics": null, "resp": {"time": 1557164518966, "text": "Thanks so much for your review!"}, "gmap_id": "0x889a411892b1dbc3:0x5c6e3b678d3e06f8"}
{"user_id": "104415879197228152047", "name": "Maxwell Walden", "time": 1625102039942, "rating": 5.0, "text": "Loved trying the blue Hawaii shaved ice & purchasing the red velvet cake gourmet popcorn for my first visit in downtown Hartselle.", "pics": null, "resp": null, "gmap_id": "0x88882b798da2723d:0xd57e4d3f4c4d1056"}
{"user_id": "117750054185959533996", "name": "Tammy", "time": 1589662101642, "rating": 5.0, "text": "This place has the most amazing dill pickle popcorn, awesome customer service, perfect frozen lemonade, delicious shaved ice!", "pics": null, "resp": {"time": 1589672994940, "text": "Thank you for letting us know how we are doing. We will keep trying to keep our five stars. Thanks. Lisa"}, "gmap_id": "0x88882b798da2723d:0xd57e4d3f4c4d1056"}
{"user_id": "109365042174976590460", "name": "Jacob Charest", "time": 1573590634747, "rating": 5.0, "text": "Awesome place with so many affordable varieties of gourmet popcorn. The salt N' vinegar is amazing! They have samples too!", "pics": null, "resp": {"time": 1574685675086, "text": "Thank you so much for the review."}, "gmap_id": "0x88882b798da2723d:0xd57e4d3f4c4d1056"}
{"user_id": "110497785421291645549", "name": "Darius Haney", "time": 1623334426270, "rating": 5.0, "text": "I've been a PopHead every since this Kettle 🌽 Shop has popped up in the Woodlawn Community! They bring Unique Flavors & Genuine Camaraderie that aren't as common as they used to be. It's a family oriented environment filled with Joy & Humility 💜🎶 Might I add, samples are available however if you want to know my favorite ask the the team to set you up with a Birmingham Mix 2.0!!! Why Orville when you can be a little Naughty But Nice🍿", "pics": null, "resp": null, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "103359013265102997413", "name": "Kimberly Bivins", "time": 1614738800850, "rating": 5.0, "text": "I popped into the store for the first, but far from last, time today. The staff was friendly and helpful! I was able to sample several flavors and ultimately, bought a variety to bring home for my family to try, also. Great, local company that all should support!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM_HTSayzyPwi562oOe1zqr2vLFJ19n-qB7wDLd=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMqYC7-ABJ9fbOEloJxZcVr01vgrsdw1KVQeG2-=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "113467396452553618508", "name": "Amber Callen", "time": 1618838743813, "rating": 5.0, "text": "Superb service from this beautiful minority owned business. I had a last minute event and Naughty But Nice came through. The entire guest list loved the kettle corn.", "pics": null, "resp": {"time": 1618839562105, "text": "Amber thank you so much for taking time to share your experience and jumping into on the Pophead Bandwagon .... ! We are glad you and your guest enjoyed this treat and hope to serve you for many more events to come!"}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "118103038750597037716", "name": "Leo Bettel", "time": 1615403857803, "rating": 5.0, "text": "These people are amazing! I ordered a get well soon package for a friend of mine and somehow the package got lost in transit (it was never supposed to leave Birmingham and somehow went to Tennessee and Georgia?!, thanks USPS...). I contacted them and they were super nice to make a replacement package with some extras (to cover the shipping cost). My friend picked it up from them and he said the popcorn is super good. Would definitely buy from them again.", "pics": null, "resp": {"time": 1618840084733, "text": "Leo,\n\nThank you for your patience and understanding. We value every Pophead and always want you to be able to snack on the best kettle corn in the land. We hope your friend is well and that our kettle corn helped ! We hope to pop with you soon !"}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "106407297865675815761", "name": "KIYA HOLMES", "time": 1612563786469, "rating": 5.0, "text": "My first encounter with NBN was maybe around 2015 or 2016. I immediately fell in love with the Cheddar Makes It Better. Since that time, the flavor and professionalism has been consistent. The owners and staff are pleasant and dependable. I even utilize them for bulk company orders and they've never disappointed me. My orders are always fresh and ready for pickup earlier than expected. If you're looking for a local popcorn company with impeccable service and a quality product, NBN Kettle Corn Co. is it.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO2vc35VDl42oyjjXfT42QNwOg1vA5M0PBvefPz=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "105353758993487250941", "name": "Cheryl Coman", "time": 1615342165916, "rating": 5.0, "text": "My order did not arrive on time because of the delay with the USPS and the weather but when I received my order it was accurate and the popcorn was still fresh .    A special THANK YOU to Clem that contacted me by phone and email about the delay which the company had NO control over the delay.    I will place another order and I am SUPER HAPPY To support BLACK OWNED BUSINESSES.    THANK YOU MSNBC .......", "pics": null, "resp": null, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "109180322573300495918", "name": "bear fisher", "time": 1614978058110, "rating": 5.0, "text": "Whoa.  This kettle corn is just insanely good.  I bought a variety pack with three flavors and my main challenge will be not eating them all in one sitting!   Truly delicious and will definitely be ordering again!", "pics": null, "resp": null, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "112643817786935957578", "name": "Jeff Hickam", "time": 1614868757339, "rating": 5.0, "text": "This place is awesome.  Everyone I worked with was polite and very accommodating.  I'll definitely come back and buy more for of this fantastic popcorn for my customers and myself.  Thanks guys!", "pics": null, "resp": null, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "110935541388288827706", "name": "A O", "time": 1612464989857, "rating": 5.0, "text": "I've had the pleasure of doing business with this great company for a little over a year. The Kettle Corn is THE BEST!! They also provide excellent customer service. I also, love that this business is making a positive impact on our community.\nYes, I'm a Pophead!", "pics": null, "resp": null, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "109991412419340641275", "name": "Abbey Mitchell", "time": 1616957257257, "rating": 5.0, "text": "First time trying NBN, and the French toast popcorn is sooo good!! Also tried the Eugene’s-seasoned popcorn which is also delicious! Will definitely be buying more in the future", "pics": null, "resp": {"time": 1618839784203, "text": "Abbey you tried some of our top flavors. We are so glad you enjoyed both flavors and hope you’ll get to try out others. Thank you for taking time to leave a review. We hope to pop with you soon !"}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "111379144477523000549", "name": "frederick porter", "time": 1613830143838, "rating": 5.0, "text": "Absolutely awesome. The employees were very helpful and courteous.", "pics": null, "resp": null, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "114692176548005946665", "name": "Whitney Bryant", "time": 1593565772045, "rating": 5.0, "text": "It’s one thing to support a company with a great product. It’s another thing to support a company with excellent product AND stellar values. The kettle corn is phenomenal and the service is impeccable. Not only is the team great at what they do, but they also have a heart for community. Now THAT’S a business that can have all of my money! 😂", "pics": null, "resp": {"time": 1593579054356, "text": "Thank you so so much for taking time to share your experience. Your review is poppin. We are so glad that the passion that we put into our snack food as well as our community shines through. Your support makes our mission possible. You are the best Pophead . We can’t wait to serve you soon!"}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "114200014110055200024", "name": "rachelanaylor", "time": 1595357703282, "rating": 5.0, "text": "Their kettle corn is AMAZING. A neighbor brought me some and I ordered 4x bags for friends and family the next day. Being from Chicago, I grew up with popcorn - Naught but Nice is better. WAY better. Not only is there product amazing, they are absolutely lovely and so helpful. Stop reading this review and buy a bag  NOW! Buy 10!!", "pics": null, "resp": {"time": 1595426161679, "text": "Thank you soooooooooo much for your support and becoming a Loyal Pophead. What an amazing compliment to be compared to such a renowned popcorn company. We strive to offer the most unique blends of kettle corn while providing stellar poppin service. We look forward to serving you for years to come! 🍿❤️🍿❤️"}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "110184561563235959720", "name": "Jenny Crump", "time": 1592930737546, "rating": 5.0, "text": "Got a Father's Day package, and we have LOVED it!  Ate a whole bag in one sitting yesterday!  It's very light and fluffy with the perfect amount of flavor!  Will definitely order more!  They also have excellent customer service!", "pics": null, "resp": {"time": 1593579752206, "text": "Jenny ,\n\nThank you so much for taking time to share your experience. We are Poppin with joy that you enjoyed each and every kernel. Our goal is always to create the freshest product using the most qaulity and unique flavor combinations possible.\n\nMost importantly, we appreciate you inviting us into your home to celebrate the important people in your life. We are excited to welcome you to our Pophead Family. We loom forward to serving you soon. Keep Poppin with a Purpose !"}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "100418463723889783568", "name": "Keri Harper", "time": 1594403550442, "rating": 5.0, "text": "I can’t say enough nice things about these people or their products. They have the most amazing popcorn, and after talking with them a while as I waited on fresh popped corn they seem like great people. Looking forward to my next purchase!", "pics": null, "resp": null, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "108972175708741691794", "name": "Crystal Ford", "time": 1587771239639, "rating": 5.0, "text": "Deliciously addictive! Their popcorn is so fresh, light and tasty. Love the original with cheddar makes it better, green apple, strawberry, etc. We love it all! Be sure to get a big bag. Trust me it won’t last long😋❤️🍿", "pics": null, "resp": {"time": 1592273624349, "text": "Hey Crystal, FRESH is definitely the key.  Our brand is Fun, Fresh and Festive.  We are extremely grateful for you taking time to share your experience with other potential fans.  We proudly welcome you to our Pophead Family!"}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "105429144607571982072", "name": "Darius Jones", "time": 1591318935644, "rating": 5.0, "text": "Today was my first experience with this amazing company! Such a welcoming face when you pull up and the kettle corn was absolutely remarkable!! I will definitely be back for more because the “Birmingham Mix” did not last long!!!", "pics": null, "resp": {"time": 1592273444451, "text": "Thank you so much Darius for taking time to share your experience.  We are so excited to welcome you into our Pophead Family. The Bham Mix is always a hit.  We look forward to serving you soon!"}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "112958149310460515378", "name": "Lauren Bethune", "time": 1616243055397, "rating": 5.0, "text": "Good snacks made by good people!", "pics": null, "resp": {"time": 1618839932163, "text": "Lauren,\n\nThank you for Poppin with us and sharing your thoughts and feedback. We appreciate the support and hope to serve you addictive kettle corn for years to come !"}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "108972175708741691794", "name": "Crystal Ford", "time": 1587771239639, "rating": 5.0, "text": "Deliciously addictive! Their popcorn is so fresh, light and tasty. Love the original with cheddar makes it better, green apple, strawberry, etc. We love it all! Be sure to get a big bag. Trust me it won’t last long😋❤️🍿", "pics": null, "resp": {"time": 1592273624349, "text": "Hey Crystal, FRESH is definitely the key.  Our brand is Fun, Fresh and Festive.  We are extremely grateful for you taking time to share your experience with other potential fans.  We proudly welcome you to our Pophead Family!"}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "115269852406915138109", "name": "Khadijah Smith", "time": 1586554215222, "rating": 5.0, "text": "I love coming to pick up popcorn! Always service with a smile. My favorite flavor is Chedder makes it better. It is worth your time to try it. So pop on over!👍👍😍", "pics": null, "resp": {"time": 1592274664455, "text": "Khadijah... We absolutley love serving you.  Cheddar Makes Everything Better, it's truly a crowd pleaser. We are grateul for you sharing your experience. We hope to Pop with you soon!"}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "112958149310460515378", "name": "Lauren Bethune", "time": 1616243055397, "rating": 5.0, "text": "Good snacks made by good people!", "pics": null, "resp": {"time": 1618839932163, "text": "Lauren,\n\nThank you for Poppin with us and sharing your thoughts and feedback. We appreciate the support and hope to serve you addictive kettle corn for years to come !"}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "115931527293912595390", "name": "Amy Fineburg", "time": 1592503299295, "rating": 5.0, "text": "Best popcorn around! I LOVE the French Toast...it's so very good! Convenient location, great food, lovely people...happy to support a local business!", "pics": null, "resp": null, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "113222310227692124226", "name": "Aliah Summers", "time": 1586372396669, "rating": 5.0, "text": "The best popcorn I've ever had! The original flavor is my absolute favorite. Bought a huge order for a baby shower and it was a hit! You will not be disappointed.", "pics": null, "resp": {"time": 1592274781944, "text": "Aliah, thank you so much for being a Loyal Pophead.  We are so grateful to serve you are fresh and addictive kettle corn. We especially love when our Popheads welcome us into their family with the \"She's About to Pop\" kettle corn."}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "116239100778843059914", "name": "Kimberly Frost Barry", "time": 1602115649068, "rating": 5.0, "text": "Great service! This kettle corn is sooooo good! Jalepeno Poppers and Caramel!!", "pics": null, "resp": {"time": 1602164490993, "text": "You chose an explosive combination. Thank you so much for taking time to share your experience. We are excited to have you apart our Pophead Family! We hope you keep popping with us and spreading the word.\n\nKeep Poppin with a Purpose !"}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "114240506149089538605", "name": "Chris Campbell", "time": 1592269401677, "rating": 5.0, "text": "I had a chance to buy a few bags of kettle corn on Saturday and my only regret is that I only got two bags!!\n\nI tried the regular kettle corn and jalapeño cheddar kettle corn. The regular was great - fresh, sweet, salty. The cheddar jalapeño though was the perfect amount of heat that makes you keep reaching for another handful!\n\nI will certainly be back to buy more!", "pics": null, "resp": {"time": 1592273330770, "text": "We are more than excited to welcome you to our Pophead Family. We pride ourselves on our addictive fresh unique sweet and salty flavors.  We appreciate you taking time to share your experience and attending the awesome event. You will be welcomed with open arms and superior service when you return.  Keep Poppin with a Purpose."}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "109002257788526565754", "name": "Monica Baity", "time": 1587497175602, "rating": 5.0, "text": "I love this Kettle Corn! It's a sweet treat that I can't pass up!  Not only is the popcorn delicious, but the customer service is always on point.  Thank you!", "pics": null, "resp": {"time": 1592274174158, "text": "Monica thank you so much for being a Loyal Pophead.  We appreciate you sharing your experience and we will always strive to keep it fresh and interestingly different. We hope to Pop with you soon!"}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "102221337384697179804", "name": "Demetrice Burton-Swanson", "time": 1587590825742, "rating": 5.0, "text": "I purchased the jalapeno popper popcorn.  It was fresh and flavorful. Great customer service as well. I highly recommend Naughty Bit Nice Kettle Corn. You will not be disappointed!!", "pics": null, "resp": {"time": 1592273903415, "text": "Demetrice you are Poppin. Thank you so much for taking time to share your experience.  We love the jalapeno popper. Our dehydrated jalapenos gives each kernel just enough heat.  It's so exciting to have you apart of our Pophead Family.  Keep Poppin with a Purpose."}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "102588044384788491187", "name": "KaISaWhEel", "time": 1572114392246, "rating": 5.0, "text": "Hey had a vendor at my son's elementary school fall festival. I bought a bag and was completely blown away by how much that I liked it. The guy selling the popcorn was awesome, too. This company has made a BIG fan out of me! Keep up the great work!", "pics": null, "resp": {"time": 1574834367669, "text": "Yay!!! We are so happy we could support your son’s school and we are delighted that you enjoyed our addictive kettle corn and have joined our PoPhead Family. We hope to Pop with you soon."}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "107291459572131936017", "name": "John Stone", "time": 1594144669930, "rating": 5.0, "text": "Mayyynnnnneeeeeeee...this popcorn right here....this popcorn right here...maynnneeeeee.. This is some of best tasting popcorn ever. I just received my shipment today up here in Huntsville.  Got the Bham mix, Lemon Ice, Cheddar Makes It Better, and Jalapeño Popper. All the flavors are delicious. We about to put another order in and we haven't finished what we got.", "pics": null, "resp": null, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "103373108529083730172", "name": "Jessica Coates", "time": 1587651282517, "rating": 5.0, "text": "Naughty but Nice Kettle Corn, by far, is the best kettle popcorn on the market! I’ve been hooked for years. I’m in Maryland and every chance I get, I’m ordering more to be shipped to my home.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNGW2QO63fMkmNT0WiADXEXHK219rYBtvKMQVhQ=w150-h150-k-no-p"]}], "resp": {"time": 1587751790126, "text": "We are more than grateful for your support and the opportunity to share our addictive snack all the way in Maryland. We will continue to work to provide the freshest and most flavorful kettle corn. Thank you for being a Pophead 🍿❤️"}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "105867866687394722119", "name": "Brittany Clayton", "time": 1577416286239, "rating": 5.0, "text": "I placed a large order on behalf of the company I work for! NBN took time with me to make sure what I ordered was perfect, along with attaching Christmas gift tags to all 300 bags. Their customer service is superb, the popcorn is DELICIOUS, and I will definitely be using them again. I highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "110747502828941854982", "name": "Adrienne", "time": 1586971716248, "rating": 5.0, "text": "Love the popcorn!  My favorite so far is the green apple.  Can’t wait to try the other flavors!  This is the place for great popcorn and great service!", "pics": null, "resp": {"time": 1592274547191, "text": "Green Apple Pie is a crowd pleaser...a perfect mix of sweet, salty and sour. We are so extremely excited to have you as a Pophead.  We can't wait for you to experience our other amazing flavors and appreciative of you sharing your favorite flavor."}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "106671957843686077860", "name": "Betsy Schmitt", "time": 1564611170814, "rating": 5.0, "text": "I ordered 3 flavors of the popcorn for an end of summer gathering with my teacher friends.  The online order and payment process was super easy.  I chose to pick up my order from the Woodlawn location, and I am glad I did.  The owners are delightful, and I enjoyed hearing about future plans for the business.  And yes, the popcorn was a big hit, very fresh and flavorful.  Definitely give this business a try!", "pics": null, "resp": {"time": 1574834983049, "text": "Thank you so much and welcome to the PoPhead Family. We are glad we could help to spread the sweetness to the teachers. We hope they enjoyed it as much as you did. It means a lot that you would consider our addictive kettle corn to make them feel special. We appreciate your feedback and we hope to pop with you soon."}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "104009608524947204380", "name": "LaTonja Samuels", "time": 1559661223737, "rating": 5.0, "text": "I am not a huge popcorn fan! However, this Kettle corn has blessed my taste buds! The product is amazing!!! Fresh, tasty, incredibly DIFFERENT! The Naughty But Nice Kettle corn is an experience!!! I am in love! If you want a QUALITY GREAT tasting twist to Popcorn..treat yourself to Naughty But Nice😊", "pics": null, "resp": null, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "104365939804423483901", "name": "Zacchary Cook", "time": 1593818573319, "rating": 5.0, "text": "The BHAM mix is amazing and the owners are extremely nice. Thank you for coming to Longmeadow and come back soon!", "pics": null, "resp": null, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "104110224995250696022", "name": "Rachel Ashcraft", "time": 1581303988607, "rating": 5.0, "text": "My husband and son ordered the popcorn as a surprise gift and it was the absolute best!  My son lived visiting the store and the popcorn is sooo good!  We had the Bham mix, jalapeno popper, and salty caramel.   All were delicious!  This is our new favorite!", "pics": null, "resp": null, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "107702334332424868694", "name": "T&D Spencer", "time": 1582748059679, "rating": 5.0, "text": "The absolute most delicious kettle corn you have ever tasted! Fresh and delightful! Staff full of smiling faces! Can’t wait to reorder!", "pics": null, "resp": null, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "101080815740163609727", "name": "Valencia King", "time": 1551915239448, "rating": 5.0, "text": "The kettle corn is so good. You just can't  have one bag. My family and I shared 2 gallon bags and it was not enough. This picture is from National Popcorn Day.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMUT9L6mx19zVMEswOShl1RmqPxmaKdWB26iRSr=w150-h150-k-no-p"]}], "resp": {"time": 1556862166943, "text": "We love our PoPheads and are delighted to share the joy of kettle corn with you."}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "115477608375640757910", "name": "Shawn-Telle Williams", "time": 1559325887095, "rating": 5.0, "text": "The product is presented in a convenient  bag.  I had the French Toast . So it was amazing because it tastes exactly like what you would actually have for breakfast. I totally would recommend this business and I would recommend the company I got the opportunity to meet the owner and she's truly genuine and authentic. Which I think her product is the reason why the food is so good.", "pics": null, "resp": {"time": 1574834753355, "text": "Welcome PoPhead and we are glad you enjoyed the French Toast. This favor is so perfect for all seasons. We hope to pop with you soon."}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "113512551606454729922", "name": "Amelia Lewis", "time": 1587643898192, "rating": 5.0, "text": "I've been eating naughty but nice kettle corn since they opened over 4 years ago. It's absolutely amazing!! When my son was 4, he started out eating a gallon bag on his own and wouldn't share with me! But I can't blame him because it's just that good and addictive!! My absolute favorite is cheddar makes it better with the salted caramel coming in a strong 2nd. Its always fresh and magical! Yes I said magical cause it makes me do my happy dance! I have ordered from naughty but nice for my sister's wedding (cocktail hour snack), my son's birthday party (kids grab bag favors), my baby shower, and just whenever I can! I'm a loyal Pophead all day! Lol. And the owners (Tanesha and Clem) as well as the workers are always so friendly and welcoming. If you haven't tried them you are definitely missing out.", "pics": null, "resp": {"time": 1587751874700, "text": "Our customer are more than customers , that are apart of our Pophead family! We cannot thank you enough for your ongoing support. You keep us Popping:-) we look forward to continuing to serve you and your family 🍿❤️"}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "117480467179400331616", "name": "Erica Lawson", "time": 1616957329428, "rating": 5.0, "text": "French Toast is AMAZING!!", "pics": null, "resp": {"time": 1618839699630, "text": "This is a  a crowd favorite and always hits the spot for Cinnamon Lover. Thank you so much for your review !\n\nWe hope to Pop with you soon!"}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "113346712452487644367", "name": "Kawitta Johnson", "time": 1592619155822, "rating": 5.0, "text": "I love this kettle corn!!! Sweet and salty is my favorite, but lemon ice is my new favorite!!", "pics": null, "resp": null, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "114540130165445288951", "name": "kgspirit17", "time": 1570068849384, "rating": 5.0, "text": "What an exceptional experience I had with my 1st ever order with this company. I live a Georgia, but my daughter attends college at UAB. We wanted to do something special for her birthday and she absolutely loves popcorn. I searched the net trying to find a place that would allow same day delivery and these nice people made it happen on such short notice. My daughter loved the popcorn and raved about how she had sampled it on campus. Thanks NBN for going the extra mile and bringing smiles not just to my daughter but for all three of her roommates as well!", "pics": null, "resp": {"time": 1574834473828, "text": "Thank you to our newest PoPhead. We value your business and are PoPpin with joy that we could make her day special. Thank you for including us in the celebration. We certainly hope to Pop with you soon."}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "113058386816155560979", "name": "Amy Gresk Smith", "time": 1580408336276, "rating": 5.0, "text": "Delicious kettle corn!  Especially the French toast flavor!  Great customer service as well!", "pics": null, "resp": null, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "100288715318598809605", "name": "Letesha Foster", "time": 1587580093318, "rating": 5.0, "text": "By far my favorite brand of popcorn and the customer service is simply amazing! 😊", "pics": null, "resp": {"time": 1592274081409, "text": "This makes our heart Pop. Thank you for being a Loyal Pophead.  You keep us going. We are committed to offering superior service and the most unique, fresh and addictive sweet and salty kettle corn flavors. We hope to Pop with you soon!"}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "104094101199474071730", "name": "James Little", "time": 1617800785060, "rating": 5.0, "text": "Great service", "pics": null, "resp": {"time": 1618839588014, "text": "Thank you so much for the review!"}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "111413143554190661248", "name": "Gwendolyn Wallace", "time": 1567540496832, "rating": 5.0, "text": "I enjoyed talking with the owner. She is very nice. I will be going back and recommending her to others.", "pics": null, "resp": {"time": 1574834592220, "text": "We love getting to know our PoPheads and most importantly, finding ways to always offer the best product and service to make life a little sweeter. Thank you for your business . We hope to pop with you soon."}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "112186862140273230158", "name": "Tish Dunklin", "time": 1559662418094, "rating": 5.0, "text": "The CEO, Mrs. Summers, came out to do some motivational speaking to a class I attended she gave me the cheddar kettlecorn during a Q&A session. It was sooo delicious! The information she shared was great as well.", "pics": null, "resp": {"time": 1574834684893, "text": "We are honored that we could speak to you and your class. We exist to make relationships sweeter and we are always striving to pop with a purpose. Thank you for taking time to leave feedback regarding your encounter and experience. We hope to pop with you soon."}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "105059143246541015108", "name": "rodgetta colvin-jett", "time": 1557003240910, "rating": 5.0, "text": "I am so upset 🤦‍♀️ I drove across town with the hours SHOWING  that you were open but of course you were CLOSED...Gas doesn't grow in TREES to pick for FREE! I called to make a complaint but the owner was so gracious.\nThe owner made it right apologized. Thank you for having an awesome attitude ❤", "pics": null, "resp": {"time": 1556862815288, "text": "Rodgetta, we apologize that you had a less than exceptional experience with Naughty But Nice Kettle Corn Co. We strive to offer the most qaulity product but service is our passion. It seems that our marketing team had submitted operation hour changes on Google as well as FB and the changes were pending. Your unfortunate experience allowed us to catch this oversight so that we can continue to share our addictive Snack with the world. We hope that we will have the opportunity to serve you and add you to our PoPhead family. We are a 5 Star company that serves 5 star customers. We are happy to offer a complimentary product for your trouble. We hope to PoP with you soon !"}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "112186862140273230158", "name": "Tish Dunklin", "time": 1559662418094, "rating": 5.0, "text": "The CEO, Mrs. Summers, came out to do some motivational speaking to a class I attended she gave me the cheddar kettlecorn during a Q&A session. It was sooo delicious! The information she shared was great as well.", "pics": null, "resp": {"time": 1574834684893, "text": "We are honored that we could speak to you and your class. We exist to make relationships sweeter and we are always striving to pop with a purpose. Thank you for taking time to leave feedback regarding your encounter and experience. We hope to pop with you soon."}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "103574179415098269771", "name": "Valerie Chavez", "time": 1553179196735, "rating": 5.0, "text": "The best popcorn you will ever eat! Shop local! They offer so many great flavors!", "pics": null, "resp": {"time": 1556862210325, "text": "The best PoPhead ever. We hope to taste the love in every kernel."}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "103312065615934157180", "name": "Joy", "time": 1555692741234, "rating": 5.0, "text": "The best kettlecorn ever! The owners are soooo nice. It's addictive but totally worth it!", "pics": null, "resp": {"time": 1556862105081, "text": "Thank you so much Joy for taking time to leave  a review. We are PoPpin with Joy that you had a great experience. We hope to PoP with you soon."}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "105327532530192744959", "name": "Terrie Young", "time": 1551725901042, "rating": 5.0, "text": "I had the pleasure of trying this wonderful kettle corn, and I will never eat regular popcorn again! It was the perfect mixture of sweet and salty!!!! I am officially a PoPhead!!!!! Thanks for the experience!", "pics": null, "resp": {"time": 1556862285822, "text": "Heyyyyy PoPhead you are amazing. Thanks for leaving a review and sharing your experience. We value every interaction and we look forward to PoPping with you soon."}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "112767710753580256626", "name": "S J", "time": 1559087619704, "rating": 5.0, "text": "Tried the traditional flavor and HOT DAMN 😍 ITS SO GOOD!", "pics": null, "resp": {"time": 1574834827162, "text": "Wooohooo .... now that’s a PoPhead. Thank you for leaving a review and we hope your enjoyed every single kernel. 💋💋💋. We open to pop with you soon."}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "115127841094270105588", "name": "Dr. David Peters", "time": 1539115614855, "rating": 5.0, "text": "Delicious kettle corn! Such nice people and great customer service!", "pics": null, "resp": null, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "103085872391869275920", "name": "Nurah Walton", "time": 1583946139975, "rating": 5.0, "text": "Best popcorn on the planet!!! Hands down...Bar none!!", "pics": null, "resp": null, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "101355381774069330425", "name": "Rebecca Duncan", "time": 1529099240065, "rating": 5.0, "text": "I just discovered this place & cannot say enough about how wonderful their customer service is! I didn’t realize you had to make an appointment or send your order over email, so I unknowingly went to their manufacturing facility in Woodlawn. I couldn’t find it & called. Tanesha (I hope I spelled that correctly!) was so nice! She told me they were having an event today & told me what product she had left. She waited on me to get to the event & even threw in an extra bag for my inconvenience! The popcorn is calling my name, but it’s a gift, so I’ll have to wait a couple of days to try it! I will definitely buy from Naughty But Nice again!", "pics": null, "resp": null, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "113901880487034909372", "name": "Shakethia Kennebrew", "time": 1554421946602, "rating": 5.0, "text": "This place is the BEST! The owner is a Awesome!", "pics": null, "resp": {"time": 1556862348437, "text": "Thank you Shakethia for your amazing review. It’s easy to be awesome when you have extraordinary PoPhead Fans like you. Let’s keep popping!"}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "113901880487034909372", "name": "Shakethia Kennebrew", "time": 1554421946602, "rating": 5.0, "text": "This place is the BEST! The owner is a Awesome!", "pics": null, "resp": {"time": 1556862348437, "text": "Thank you Shakethia for your amazing review. It’s easy to be awesome when you have extraordinary PoPhead Fans like you. Let’s keep popping!"}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "107448242750036705475", "name": "Janee Dickinson", "time": 1577994459585, "rating": 5.0, "text": "Delicious kettle corn!!!!!", "pics": null, "resp": null, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "103207753273241259325", "name": "Gloria Gamble", "time": 1545105136220, "rating": 5.0, "text": "The popcorn is delicious!!!", "pics": null, "resp": {"time": 1556863053072, "text": "Gloria thank you for allowing us to serve your and family as well as your clients for two years in a row. This is the highest compliment tomjave repeat PoPheads. We look forward to keeping you full of our addictive kettle corn."}, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
{"user_id": "113844626463306150690", "name": "Shawn Berry", "time": 1523812212054, "rating": 5.0, "text": "Their popcorn taste great worth the price", "pics": null, "resp": null, "gmap_id": "0x888919358424e65d:0x750dddcd8d93b82f"}
