{"user_id": "115043355422474242759", "name": "Andrew Nuckols", "time": 1625769336235, "rating": 5.0, "text": "Honest Mechanics that know their stuff. May not be the cheapest but you absolutely get what you pay for. Job is always done right the first time.", "pics": null, "resp": null, "gmap_id": "0x88891bb72b363395:0x6279d6750ae5f07f"}
{"user_id": "107861465996015858272", "name": "Tiffany Alexander", "time": 1500835892659, "rating": 5.0, "text": "Great place to get your car fixed, or get a  performance modifications especially if you have a German or Asian car, they specialize in Porsche and BMW", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOPnjvY-fHk64MAiGumahSrA2KGrKv_esA6v6kE=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO2j17vikcNIvgfA_2uswIJSkzFNY07X-OwPpJc=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMcCspFVVMzNGVEUhvDqTqtc815Deb38-91-nAi=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMTsXcbuN6GRJ2cikUKZvNo1888rIRVB6pPPO16=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891bb72b363395:0x6279d6750ae5f07f"}
{"user_id": "102793911254239446671", "name": "Clint Fillingim", "time": 1606401068678, "rating": 5.0, "text": "Awesome service! Was driving through the area and these guys went above and beyond to take care of me. Would highly recommend, they are very knowledgeable.", "pics": null, "resp": {"time": 1606487549506, "text": "Thanks for the review Clint. Glad to help"}, "gmap_id": "0x88891bb72b363395:0x6279d6750ae5f07f"}
{"user_id": "110289588658253797314", "name": "Alton Hill", "time": 1605053713284, "rating": 1.0, "text": "Terrible experience they try to rip you off depending on what you know about parts I’ll rather take my Porsche to Porsche of Birmingham instead rip offs!!", "pics": null, "resp": {"time": 1615215420873, "text": "I do not have a record of ever doing business with you."}, "gmap_id": "0x88891bb72b363395:0x6279d6750ae5f07f"}
{"user_id": "113519031964328627121", "name": "David O'shea WOODRUFF", "time": 1582406387842, "rating": 5.0, "text": "Need your classic Porche repaired or restored? Then, look no further.", "pics": null, "resp": null, "gmap_id": "0x88891bb72b363395:0x6279d6750ae5f07f"}
{"user_id": "114616615027763617158", "name": "NIckSellsCars Bham", "time": 1520353029425, "rating": 5.0, "text": "Took my 911 here a while back for some preventive maintenance (and some needed) and they took fantastic care of the car. They upgraded the IMS and a myriad of other known weak points in these cars, as well as gave it a new clutch. Top notch work in a laid back environment.", "pics": null, "resp": {"time": 1520356803624, "text": "Thank You! We appreciate your review"}, "gmap_id": "0x88891bb72b363395:0x6279d6750ae5f07f"}
{"user_id": "110334569985586804046", "name": "Jekyll H", "time": 1607974390289, "rating": 5.0, "text": "Good job guys!", "pics": null, "resp": null, "gmap_id": "0x88891bb72b363395:0x6279d6750ae5f07f"}
{"user_id": "107563204725036923852", "name": "Jessica Rogers", "time": 1561673974293, "rating": 5.0, "text": "Place is great. The guys are very friendly. Always a pleasure", "pics": null, "resp": null, "gmap_id": "0x88891bb72b363395:0x6279d6750ae5f07f"}
{"user_id": "101333392980680016561", "name": "Randy James", "time": 1449517426043, "rating": 5.0, "text": "I purchased a 2006 Porsche Carrera S (997) earlier this year in Atlanta. I drove it to Birmingham to have Eurasian perform a pre-purchase inspection. They were very thorough and answered any and all questions I had for them. They put my mind at ease as to a couple of issues. I purchased the car and I have continued to use Eurasian for my service needs even though I live in Montgomery. All of the guys are excellent technicians and mechanics. I give them two thumbs up!", "pics": null, "resp": {"time": 1449789412263, "text": "Thanks Randy !!\nWe really appreciate you business and look forward to seeing you in the future.\nCasey"}, "gmap_id": "0x88891bb72b363395:0x6279d6750ae5f07f"}
{"user_id": "115401493223725355923", "name": "Bert Ellis", "time": 1476967672060, "rating": 5.0, "text": "These guys are the best.   Austin, Casey, and Devin are competent, enthusiastic, honest, and friendly.    I highly recommend them for anything your Euro / Asian car wants or needs.", "pics": null, "resp": null, "gmap_id": "0x88891bb72b363395:0x6279d6750ae5f07f"}
{"user_id": "112651661697691180519", "name": "Ty Hottel", "time": 1408902864207, "rating": 5.0, "text": "Knowledgeable people and reasonable pricing. Don't be put off by the non-descript appearance on the outside. It's like a Porsche toy store inside", "pics": null, "resp": null, "gmap_id": "0x88891bb72b363395:0x6279d6750ae5f07f"}
{"user_id": "113857458025046541931", "name": "Joseph Lathem", "time": 1476728424551, "rating": 5.0, "text": "These guys have integrity, knowledge, and competent skill. I highly recommend them and look forward to using their services in the future.", "pics": null, "resp": null, "gmap_id": "0x88891bb72b363395:0x6279d6750ae5f07f"}
{"user_id": "112635696426496015807", "name": "Corey Crowe", "time": 1573070318728, "rating": 5.0, "text": "Great work on my Porsche", "pics": null, "resp": null, "gmap_id": "0x88891bb72b363395:0x6279d6750ae5f07f"}
{"user_id": "101165565782576882273", "name": "Andre' Greenwood", "time": 1409679189651, "rating": 5.0, "text": "Real advice you can trust and service second to none. Keep up the great work guys!", "pics": null, "resp": null, "gmap_id": "0x88891bb72b363395:0x6279d6750ae5f07f"}
{"user_id": "105244773759432642643", "name": "Frank Samuelson", "time": 1493259543510, "rating": 5.0, "text": "Fantastic Porsche experts!  Extremely knowledgeable and professional.", "pics": null, "resp": {"time": 1493382728953, "text": "Thanks Frank! Much appreciated."}, "gmap_id": "0x88891bb72b363395:0x6279d6750ae5f07f"}
{"user_id": "117359251825971223489", "name": "Euge", "time": 1424965888358, "rating": 5.0, "text": "I live in Wisconsin and found a car in Alabama I wanted to buy. A friend recommended Eurasian Auto to do the PPI so I gave them a call. I spoke with Devin, who also did the PPI. Devin was very helpful in explaining the PPI process and covering what they look for. Fast forward a couple days, and I got a call from Devin and he talked me through everything they had found with the car. After having them look over the car I'm flying down to buy it this weekend with no fears whatsoever.\n\nIf you need a PPI or need work done to your vehicle, I feel like this shop is honest and does thorough work.", "pics": null, "resp": null, "gmap_id": "0x88891bb72b363395:0x6279d6750ae5f07f"}
{"user_id": "107118653345836586141", "name": "Tiffany Alexander", "time": 1408903638960, "rating": 5.0, "text": "Great, friendly,  professional, and they provide honest care of one of my prized possessions", "pics": null, "resp": null, "gmap_id": "0x88891bb72b363395:0x6279d6750ae5f07f"}
{"user_id": "100641359340524806009", "name": "Patricia Seymour", "time": 1623160948150, "rating": 5.0, "text": "Love Gulf Coast Auto Group staff.  It’s the Audi that’s the problem.  I only have approximately 46K miles on the car.  She’s pretty.  But the convertible top has leaked since the purchase.  Then there have been so many problems with other parts, and a 3x AC problem/fix (qualifying it as a lemon), that it has been in the shop as much as it’s been with me.  I have a color-coded chart. When I let the “powers that be” at Audi know about the first few years of problems, they basically said, “FU with a smile”.  This car was actually built in Germany.  My German friends would be appalled.  They take their car quality very seriously.", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "100112269567781664576", "name": "Emily", "time": 1625625044646, "rating": 5.0, "text": "I had a great experience purchasing my new car from Gulf Coast Auto Group. I highly recommend Mr. Kenny Cunningham. He was professional, honest, friendly, and made my buying experience easy and fast. All of the staff I spoke with were friendly and professional. I will use them in the future.", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "111938768679638661524", "name": "Ellie M", "time": 1621556496921, "rating": 5.0, "text": "My service representative, Laura Collier, is wonderful! She always ensures that every issue is resolved. We have been extremely satisfied with the service that she and the mechanics at Audi of Mobile have provided to us over the past 5 years with our two Audis. My son took his Audi to another local repair shop and they caused damage to the vehicle because they lacked the knowledge and skills to properly perform the repairs. We then took his car to Audi of Mobile and they corrected everything! I will ONLY have my Audi Q5 serviced at Audi of Mobile.", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "100565455965795209337", "name": "Makenzie Brenner", "time": 1613921814076, "rating": 5.0, "text": "I admit I was nervous to purchase a car online from a dealership over 6 hours away, but Gulf Coast Auto, specifically Devon made the experience seamless. Great communication, fantastic customer service and product knowledge. It was honestly the best experience I could’ve hoped for. 100% worth the road trip down and I am obsessed with my new car!", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "110817360332479332803", "name": "Queen Royalty", "time": 1613779269412, "rating": 5.0, "text": "Everyone there is so nice and helpful. The finance department and the sales person (Alfredo Montes) made sure we understood the offer for our Volkswagen Atlas.", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "112805924154645928935", "name": "Myra C.", "time": 1565860456598, "rating": 5.0, "text": "I went to Porsche of New Orleans and they were trying to blantantly make the 2018 Macan I wanted inaccessible. These fools really tried to make me put down 20,000 for a 500/month car payment. AVOID THAT DEALERSHIP AT ALL COST. They did not want to sell to a African American woman. Anyways, I found 2 more 2018 Macans in the Mobile area the same evening so we decided to go the next day. BEST DECISION EVER! I traded in my 2014 Infiniti Q60S that I loved dearly for a 2018 Porsche Macan! As a traveling CVOR tech, I needed more space and Kendarrius ensured that I didn’t leave without the vehicle that I wanted! I literally pulled up at 12:15 and was driving off at 4:30!! That was crazy fast, but if you are looking for an amazing deal on a beautiful car, THIS is the place to go. My monthly payment is 585/month on a PORSCHE!! That’s unheard of! They knew I wanted the car and this dealership made sure I left in it without having to eat bread and water for the next couple of years!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPPMjuE6t-nrGp_VDRqaVxv5wut1tkjJYEmrndB=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMGI3mdzmpiG-nORkuYFClc2Bpn_6tWSNfTCmxE=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNE_6zHkKNIJ5awTKYKW-RG0rZr0tyuCKJiQUJs=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "104784565688095890916", "name": "Monica Mingo", "time": 1592176454485, "rating": 5.0, "text": "My last two vehicles were Land Rovers.  I narrowed this purchase to an Audi or a Land Rover.  Devon took me on my test drives after donning a mask and I left with total knowledge of the Q5.  I went to the Land Rover dealership and was left knowing the same about their vehicles as I already knew upon arrival.  I was also unhappy with the attitude once I requested the salesman wear a mask during the test drive.\n\nI called Devon the next morning to let him know that my husband and I would be returning and, when we got there, Devon was ready to go.  This young man has received several awards and accolades based on his performance and knowledge of Audi vehicles. I noticed two certifications on his desk.\n\nHeaded there my husband told me we were not going to buy the vehicle today and that this was simply an exploratory mission and that he wanted to test drive and then get the information in order to make a thoughtful decision.  After speaking with Devon at length, we ended up buying the Q5 same day.\n\nDevon simply makes you feel good.  You sense his honesty right up front and there were no questions he couldn't answer.  We truly felt we were in extremely competant hands.\n\nThank you to Devon, the auto group, and for making it easy to jump the Land Rover ship and become a member of the Audi family.", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "113176571186060876778", "name": "Keri Van Atta", "time": 1595680381439, "rating": 5.0, "text": "Alfredo Montes was very helpful and nice. We ended up not being able to afford the car we wanted, but he never made us feel bad or embarrassed. And most importantly he didn't make us feel like we wasted his time. He went above and beyond for us and I really appreciate it! Thanks Alfredo!!😊😊😊", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "106232225682313082666", "name": "Lee Lee", "time": 1602366220389, "rating": 5.0, "text": "Courtney was so accommodating & super nice. Thanks Courtney- appreciate!", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "110987515900613283838", "name": "Daniel Flores", "time": 1591199633862, "rating": 5.0, "text": "Purchased a VW all over the phone with Doug Klezmer. Doug took great care of me with a very smooth and convenient purchase. Very happy all the way around. Wish all car purchases were this easy! Thanks, Doug!", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "110270196807091139158", "name": "Michele", "time": 1563422147881, "rating": 5.0, "text": "Me and my husband have had so many bad experiences here before the name change and new management or whatever. We always made appointments and would be there for 3 or 4 hours, we hated going there and the customer service was horrible! Today was the first time we've been there in at least a year or more and we were amazed at how much more better it is now. Our appointment was at 1 and we were out in less than an hour. Sean took great care of us and kept updated about what was going on with our car! The customer service was AMAZING! We have never experienced such great service like we did today. Thank you so much Laura and Sean and everyone for such a great experience and service we received today from you all!", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "113746022303116937483", "name": "Wayne Douglas", "time": 1590879460985, "rating": 1.0, "text": "This dealership is very deceptive and dishonest. My salesperson was Alfredo. I specifically asked them to run my credit only through VW and stated that on the credit application. I found out a few days later that they had run it through all 3 credit bureaus instead and when I confronted Alfredo about it he said that that is just the way they do business and that my credit won't be hurt if I buy a car from them. My credit score dropped 24 points because of their unethical sales tactics. Most car manufacturers have their on inhouse financial arm so when you run your credit directly through them you only take an 8 point hit so that's why I made the specific request. Because I value my credit score so much it is very high and now I am reluctant to have it run at another dealership to get the car I want because of Alfredo and his companies dishonesty. This is just the worst fo many misleading statements Alfredo made to me. You're better off driving to one of the surrounding cities to buy your next vehicle than from here.", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "112133886211962111704", "name": "Krista Blanton-Goguen", "time": 1545329722940, "rating": 5.0, "text": "We recently bought our first Volvo. AJ has gone out of his way to make this experience as seamless as possible. His knowledge about the car far surpasses any other dealership we have worked with.\nThe vehicle is amazing and capable of so many things.  Each time the technology out smarts me he is always available to answer my text or phone call and walk me through it.\nI just appreciate the extra effort he always goes to to make us feel valuable. I love my Volvo and don’t plan on going anywhere else for my future vehicles.", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "108163161375008211605", "name": "Robert Sanders", "time": 1581438953720, "rating": 5.0, "text": "Had a wonderful experience from my first contact to walking out the door. Zach was great and took care of my wife and I. Recommended this place to everyone since buying a car and will go back for our next vehicle.", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "112669531542555598298", "name": "Patrick Isbell", "time": 1557610667316, "rating": 5.0, "text": "My wife recently purchased a used 16 Beatle convertible that was a recent lease turn in. Devon was an awesome salesman and made us feel like family during the entire experience. I believe we got a quality vehicle and a reasonable price. I know she will be thinking of her buying experience and the welcoming employees whenever she drops the top this summer!", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "106560910201391584571", "name": "Edward Thomas", "time": 1566620902121, "rating": 1.0, "text": "Gulf Coast Auto Group should change their name again, because of one simple question- do you give military discounts? No one in the service department knew or was unwilling to give at least 10% off. The parts department gave 10% off for military when I purchased 4 spark plug not less than 15 minutes laters. Military service people active and retired I will inform you don't buy anything from there without a discount 10% or higher, & at this point it should be higher.", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "117340162641036974729", "name": "june newton", "time": 1537998509908, "rating": 5.0, "text": "THIS THE PLACE!!\nConsidering a new car, this is the place! My husband and I bought 12 cars in our lifetime - this experience was by far the most professional/personable buying experience. The consultant, Santwan, was knowledgeable beyond measure, unlike the run-of-the-mil hunting salesman. The entire experience, from consultant, to floor manager [John], to Finance [Danny], to the GM [Mark].  Wow, treatment like the customer is a REAL PERSON not just a customer buying one of their cars - really, they have hearts and personality? We couldn't believe the care and the detail in service.  You go Gulf Coast Auto Group!!", "pics": null, "resp": {"time": 1537998874907, "text": "Hi Ms. Newton, thank you so much for the kind words! We are thrilled that Santwan, John, Danny and Marc are an integral part of our team. We are so humbled that you chose Gulf Coast Auto Group!\n\nAshley Allen\nBusiness Development Director"}, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "113503513070520340384", "name": "Elizabeth Millette", "time": 1542572891504, "rating": 5.0, "text": "I recommmed this dealership to anyone. They made the car buying process easy! We first contacted Melissa from their online sales department. She was always quick to respond and answer our questions about a specific car, but never pushy or bothersome. When we were ready, she set us up an appointment to come in to the dealership. From that point we worked with Brittany Smith! She was a pleasure to do business with. Brittany was very friendly, knowledgeable and never made us feel rushed or pressured. We couldn’t be happier with our new car and the service we received at Gulf Coast Auto Group.", "pics": null, "resp": {"time": 1542573666666, "text": "Hi Elizabeth, we are so happy you’re loving your new vehicle! Brittany and Melissa are key members to our sales team, and we are lucky to have them! I’ll pass your kind words on to them and our management staff Monday morning! Thanks again for giving us the opportunity to earn your business and we look forward to serving you!\n\nAshley D. Allen\nBusiness Development Director"}, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "100488610636773159059", "name": "Chris Mayfield", "time": 1532990891732, "rating": 5.0, "text": "These guys were amazing. They knew I wanted the car, and got the price and interest down to what I could afford. I would highly recommend this dealer.", "pics": null, "resp": {"time": 1534967088249, "text": "Thank you Chris! We appreciate your business and congrats on your new car!"}, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "100214355400301326809", "name": "Christian", "time": 1537998404303, "rating": 5.0, "text": "I had an awesome experience with Gulf Coast Auto Group, after 7 months of searching for the right car and having poor experiences with other dealers across the nation as I live in Colorado, I was thrilled with my experience here. Santwan Wiley is the MAN. If you guys are looking for an excellent client advisor who will do everything in your best interest in helping you get into an awesome vehicle, he is your guy. I appreciate all the effort the team put in and his effort in to making sure that car was mine. I did not feel pressured at all and this was by the far the bestcar buying experience that I have had. I Cannot wait to get down there and take receipt of my new 2015 BMW X5! Thanks guys for an awesome experience!!", "pics": null, "resp": {"time": 1542990194503, "text": "Thank you for the great review Christian."}, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "114598941876604798679", "name": "Carly Martinez", "time": 1574792357594, "rating": 5.0, "text": "thanks to mr devon for helping me buy my first car!", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "110632320059569299864", "name": "Becky Dunn", "time": 1557355942950, "rating": 5.0, "text": "The is the best car dealer i have ever dealt with and mr. Paul Stanley is the best to deal with!! He will treat you right i love my Volkswagen !!!", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "112970522726811636072", "name": "Anthony Cook", "time": 1535766796869, "rating": 1.0, "text": "I leased a 2018 Volkswagen Jetta from this dealership on June the 27th. It is now August  6th and I have yet to get my tag paperwork. I had to call the bank to get my old car loan extended so my old car loan would not go in collections. Not only that shortly after I leased I noticed a small ding on my hood. I went to the dealership to see what they could do and they said it would be no problem to fix. It has now been over a month I haven't received a call or a text. I know the dealership has recently changed owners, but the management at this establishment really dropped the ball. My family will no longer purchase or lease any vehicles from this dealership.\n\nI did try to call you. I left a message and no response. Why would I have expected anything different.", "pics": null, "resp": {"time": 1533650839757, "text": "Anthony- I sincerely apologize for this inconvenience. We expect exceptional customer service, and we regret that we missed that mark. My name is Ashley Allen and I am the Business Development Director here at Gulf Coast Auto Group. Please call me directly at 251.301.0013 so we can get you what you need asap."}, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "100253325127820996916", "name": "Michael Kolbe", "time": 1558022068423, "rating": 5.0, "text": "Thanks Devon! Great experience and a perfect vehicle!", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "111104329649903391423", "name": "Lisa Wurst", "time": 1566833164216, "rating": 1.0, "text": "Stated that they did not have to follow through with what was written on my leasing contract “Since Dean sold it to us.”", "pics": null, "resp": null, "gmap_id": "0x889a4dcbea473dff:0xc79a4b79a21641d6"}
{"user_id": "103292869186794737097", "name": "William Deacon", "time": 1619099429301, "rating": 5.0, "text": "I was on a road trip 650 miles from my local dealership, when the vehicle developed a problem. Turns out the wheel speed sensors where the issue. I call my dealer who advised me to find a dealership that could make the repair... easier said than done. I was told 10-14 days before the service could be performed... until I spoke to Shannon Stull at Century Auto. I briefly defined the situation in hope that the parts and time might be available. In record time Shannon with the cooperation Chris Pope, where able to order overnight the proper parts and squeeze the car in for service. The parts did arrive and the service was performed without issue. I’m sure it was a team effort to make this happen, and thanks to the professionals who actually installed the parts! Clearly this Dealership, Century Auto has the service and professional staff to get the the job done. My night mare hunting trip was saved by the team, to include transportation to and from the rental car. Everyone I met at the dealership was outstanding, but I can’t say enough about Shannon and Chris.. true professionals. THANK YOU, for all the efforts and the time you saved me!", "pics": null, "resp": {"time": 1619102019009, "text": "William, thank you for sharing your experience and I am glad the team was able to help."}, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "111572106926877147558", "name": "Necedah Townsend", "time": 1623247487556, "rating": 2.0, "text": "My Porsche was at the Huntsville shop for over an week after I told and showed the parts guy and manger Shannon what was wrong with my Porsche.  We pulled up the part and I left under the impression that the part was being ordered because it was going to take at least two days to arrive. Therefore when the part was scheduled to arrive was the timing I was told my car would be looked at by the technician. Lies lies lies .... I had to keep calling Shannon the manager to find out if there was any information on the arrival of the part ... how much will it cost and never an direct answer. Every time  it was let me call you back and I am about to go follow up. And never return the call/s. After my car was there for a week I called again to only find out the part was not ordered and they were ordering it that day. Which meant at least another two days waiting for the one part that we knew I needed to arrive. The sad thing is this is the only place locally that are certified to work on my car or get parts from. I had to get a rental twice for a week because I never knew when my car would be ready. Extremely Poor Customer Service. Lastly they called me at 4:00 to tell me my car was ready when they close at 5:00 with only an estimate for cost. Never stating that they did not except certain payments. Noted on my receipt I had a premium car wash lol.  My car was so dirty on the outside. I had just gotten the inside detailed myself. Such a joke.", "pics": null, "resp": {"time": 1623335361449, "text": "We are so sorry about the miscommunication regarding our service scheduling. While we can accommodate walk in clients, our customers who book appointments are priority to have their vehicles serviced. We take pride in our service departments commitment to thorough inspections and quality work, and sometimes both of those take some time. Our team worked as quickly and as diligently as they could to try meet your expectations. We apologize your vehicle was not diagnosed and repaired as quickly as you wanted."}, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "104457923544869029894", "name": "Chris Haury", "time": 1617400064389, "rating": 5.0, "text": "Professional, as expected from Porsche. Even though they were backed up and hampered by an employee out sick and weren't able to provide the loaner vehicle requested, they honored my appointment and provided an excellent door to door shuttle service that was really efficient and quick. When they phoned to tell me my service was complete, the driver was already 10 min from my house. The service on my vehicle was excellent as expected, and the Porsche tech sent a video going over my vehicle and the work done. Very happy.", "pics": null, "resp": {"time": 1619644834953, "text": "Thank you for your five star review! We are happy to see you received exceptional care from our team."}, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "104664120033561012397", "name": "matthewsleila", "time": 1613850325640, "rating": 5.0, "text": "I have had issues with my Macan, too many in my opinion,  however this team of mechanics and the service team are the reason why I stick with it and remain patient and positive. They truly care and always have done their very best to ensure,  although there have been issues, that they provide the best service possible and always go out of their way to please the customer. Amazing team, technical knowledge and certainly understand and practice high quality customer service. Shout out to Jacob,  Randy and Chris. I appreciate you guys.", "pics": null, "resp": {"time": 1614036770831, "text": "Thank you Leila, the guys will continue to strive to provide the service that you appreciate and deserve."}, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "110846411595413594788", "name": "Bill Brown", "time": 1614353306058, "rating": 5.0, "text": "Great experience for a long time coming first buyer. Total professionalism from all Century employees. No pressure and all were extremely helpful in explaining the new world of Porsche, to include those not directly involved in the sale.  Highly recommend Century and the Porsche Brand.", "pics": null, "resp": {"time": 1614363139506, "text": "Welcome to the Porsche family and Porsche of Huntsville, a Century Automotive dealership. Congratulations on your purchase and thanks again for your business."}, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "108672930597939262496", "name": "raymond fernandez", "time": 1622556347839, "rating": 1.0, "text": "About over a year or so ago Porshe of Huntsville did inspection service on my Cayenne without informing me of the cost. When I called this out to the service manager he said he would make it right and explained the dealership would provide the next service at no cost to me. He said he would document it in their computer records. I counted on that all this time, so when my vehicle was brought in for service I fully expected them to honor that promise. We'll there service manager said they could not find any record. Please note that I confirmed this way back with the previous service manager that it was noted on their record.\nI am completely dissatisfied with the lack of commitment to what was promised by the dealership.\nI therefore  refused any additional service and just agreed to pay for an oil change (which costs $430), The car was kept for 4 hours.\nI will never buy a Porshe again.", "pics": null, "resp": {"time": 1623335536948, "text": "We wanted to follow up and and thank you for speaking to our service manager Shannon about your experience and hope the resolution  you came to together was satisfactory."}, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "112303540470647911322", "name": "Dave Vaupel", "time": 1615565795264, "rating": 5.0, "text": "I flew to Huntsville from Jacksonville to buy a Cayenne e-hybrid and drive it back home. From my pickup from the airport to drive-off it was a great experience.  Bradley D. and Jon C. Took great care of me. I will definitely be talking to them when it’s time for the 2 seater. Thank you Porsche of Huntsville!", "pics": null, "resp": {"time": 1619644921196, "text": "Thank you for your five star review! We are happy to see your trip was well worth it and that you love your new Cayenne!"}, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "116526793439823058368", "name": "Ronnie Honbuckle", "time": 1618597803609, "rating": 5.0, "text": "Exceptional Service staff from the service managers desk, shop mechanics, parts department, shuttle service personnel, the folks who cleaned and washed my Porsche and bookkeeping departments. Thanks for the courteous, timely and a job well done. Cheers\nR. Hornbuckle 4/16/'21", "pics": null, "resp": {"time": 1619644794512, "text": "Thank you for your five star review! We are happy to see you received exceptional care from our team."}, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "105092294605453202146", "name": "Mike Kurbanick", "time": 1616980320608, "rating": 5.0, "text": "What a great experience!  Everyone was friendly and knowledgeable.  Our car was exactly what we were told it would be and then some.", "pics": null, "resp": {"time": 1617061380479, "text": "Thank you for putting your trust in us and flying up to Huntsville. I hope you had a safe and enjoyable drive back to Florida."}, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "107811573041690781066", "name": "Todd Lackey", "time": 1614014320992, "rating": 5.0, "text": "Century and the team at century Porsche are always top notch. Above and beyond the call of duty is always my experience. Jacob and Chris make it easy. A+ service. Good job!", "pics": null, "resp": {"time": 1614036635061, "text": "Thank you Todd"}, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "118076638583764284777", "name": "Kelley Snook", "time": 1606058054286, "rating": 5.0, "text": "Exceeded expectations. I purchased my car sight unseen and had it shipped to Michigan. Bradley walked me through the entire process including what to expect and timing of each step. He is a knowledgeable professional that I would make an effort to work with again—even though there are three Porsche dealerships within 25 miles of me. Everything was exactly as he said it would be and he continues to be a willing resource for me after the purchase. Outstanding communication. Thank you!", "pics": null, "resp": {"time": 1606067749091, "text": "Kelley, Thank you for the kind review. Purchasing a vehicle sight unseen from several states away can be a difficult. We try very hard to represent our vehicles to long distance customers as if they were looking at them person, yours was easy. Thank you for your business and entrusting us with your purchase.\n\nDrive safely.\n\nPorsche of Huntsville"}, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "110685701365422704781", "name": "Ken Boustani", "time": 1621361955821, "rating": 5.0, "text": "As always,great service.My Porsche is ready now.", "pics": null, "resp": {"time": 1623175617623, "text": "Thank you for your five star rating! We appreciate your business!"}, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "105568400473740386468", "name": "Len Nelson", "time": 1614128507142, "rating": 5.0, "text": "Per usual, Century Porsche and my mechanic  Graham Boccino are the best. Top shelf service for your Porsche at reasonable rates. He installed the PSE exhaust on my Carrera S and it sounds incredible.", "pics": null, "resp": null, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "113789139437028295587", "name": "Justin Manzanares", "time": 1612220802981, "rating": 5.0, "text": "Ray Diaz is the best. Kept me informed the whole way through the build.", "pics": null, "resp": {"time": 1612279675726, "text": "Thank you for the kind words and your continued business. You spec'd out a beautiful Spyder, enjoy it!"}, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "117356975885895360372", "name": "Roy Duvall", "time": 1618697314176, "rating": 5.0, "text": "Great experience and communication throughout the process.", "pics": null, "resp": {"time": 1618971813887, "text": "Roy, thanks for taking the time to share your experience."}, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "106149974551586679067", "name": "Joseph Owens", "time": 1592513336466, "rating": 5.0, "text": "The service department is absolutely amazing. I have never experienced the level of care and detail that they provide..  Randy and Jacob are the nicest and most professional people I have dealt with.  I cannot say enough good things about them.  I will let them service my cayman every time i need something done.  By the way having the videos sent to me while it was being serviced was amazing.  Thank you very much for your help..", "pics": null, "resp": null, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "107036533789000012474", "name": "Clint Cosper", "time": 1614382220416, "rating": 5.0, "text": "Service was great, car was complete at time stated. Thanks", "pics": null, "resp": null, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "102391008505483716403", "name": "David McKenzie", "time": 1612886258464, "rating": 5.0, "text": "Knowledgeable techs, convenient location, will use again.", "pics": null, "resp": {"time": 1612968627896, "text": "Looking forward to seeing you next time David"}, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "112961845091353942865", "name": "Mel g (missy)", "time": 1593708630311, "rating": 5.0, "text": "We traveled from Florida to pick up our 2018 Porsche Cayenne sight unseen and was exactly as Bradley told us. Great working with Bradley. Would not hesitate purchasing again from this dealer.", "pics": null, "resp": null, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "103697440188589699323", "name": "C Wells", "time": 1583461034909, "rating": 5.0, "text": "I highly recommend the service department at Porsche of Huntsville. Randy Carter and Jacob Holt consistently provide a great experience and high quality. The service work is always done correctly and the pricing has been very competitive to the market. This dealership is a valuable asset for the local community!", "pics": null, "resp": null, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "117978028098213686384", "name": "Felecia Hives", "time": 1616877546395, "rating": 5.0, "text": "Tried to charge up my car, only for their vehicles", "pics": null, "resp": null, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "107308517238530862214", "name": "Minibike King", "time": 1595536058222, "rating": 5.0, "text": "Love this place but I always leave without a car. Maybe after my next stimulus check fingers crossed.", "pics": null, "resp": null, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "104568478572497192617", "name": "Jacqueline Wade", "time": 1591244729474, "rating": 5.0, "text": "I have used this dealership’s service department twice. Not only are the service folks knowledgeable and seem trusting, I’m so happy that each  and every person are very professional with a commitment to customer service. Quite a class act.  Thank you!", "pics": null, "resp": {"time": 1591282808027, "text": "Thank you Jacqueline for the kind words. Porsche of Huntsville strives for this kind of service and relationships with all of our customers."}, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "106978957525986366209", "name": "Becky Cobb", "time": 1562637715242, "rating": 5.0, "text": "I live halfway between Huntsville and Memphis. I took my car to Memphis for its annual service a year ago. My check engine light had popped up several times before I took it.   I was told there was nothing they could do for my car’s issue unless my check engine light was “on”.  The issue persisted and became worse.  I decided to try Huntsville to see if they could help.  To my surprise, your dealership exceeded my expectations!  I was provided with a loaner car and constant updates.  Your service manager, Randy Carter, was amazing. After my disappointing experience in Memphis, Randy and Chris Pope will be my “go to guys” for as long as I drive my Cayenne.  This car was our first Porsche purchase and being cared for the way I was in Huntsville, it will not be my last.\nThank you for everything you did. I am a satisfied customer and will continue to use  you for my future purchases.\nSincerely, Becky Cobb, Iuka Ms,", "pics": null, "resp": null, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "108610824819769381382", "name": "Charles Phillips", "time": 1566480704184, "rating": 5.0, "text": "I had a major service performed on my Panamera this week.  Jacob and Randy provided excellent service. From the time I dropped the car off to getting the loaner car to pick up.   Everything went smoothly. Communication was very good.  Definitely recommend this service team.", "pics": null, "resp": null, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "116133842060206932501", "name": "J Williams", "time": 1582152658653, "rating": 1.0, "text": "I’m am glad others have had a good experience with this dealer. We have not. We found the car we wanted here in Huntsville while shopping from out of state. Initially the process was smooth, easy, friendly...until the salesman, Bradley, sold the car out from under us. This was after several attempts to call, email, and yet for 24 hrs no word back, nothing. Only to receive a call hours after all the attempts to reach...to say the car was sold. Having dealt with other dealers and more specifically, Porsche dealers...the lack of communication and poor salesmanship was absolutely horrible.\n\nI know, in our case, we can shop at other dealers...I can only hope they treat their customers better than they did us.", "pics": null, "resp": {"time": 1582226754768, "text": "J Williams,\nI am sorry that you had a bad experience. Feel free to call me if you would like to discuss.\nJon Cunha, Sales Manager"}, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "114324551232494600637", "name": "shane Gadomski", "time": 1567803229123, "rating": 5.0, "text": "Beautiful and luxurious and sporty all in one! Jacob in service is very knowledgable, helpful, and professional. Great overall experience!", "pics": null, "resp": {"time": 1567804692380, "text": "Thank you for the kind words Shane"}, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "114518714406385230458", "name": "Maria Ivette Rivera-Del Valle Anaya", "time": 1618326615702, "rating": 5.0, "text": "Excellent service!!!", "pics": null, "resp": {"time": 1619644799942, "text": "Thank you for your five star review! We are happy to see you received exceptional care from our team."}, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "112345931099250410200", "name": "Carl Weimer", "time": 1546118469780, "rating": 5.0, "text": "Randy does a pretty great job in service. I bought a 2017 Macan S, had a few issues, but they were resolved quickly and got me back on the road.", "pics": null, "resp": {"time": 1546124561933, "text": "Thanks for the kind words Carl. We are proud to have Randy and his service team."}, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "116088828191253155931", "name": "Richard Schwartz", "time": 1583455326733, "rating": 5.0, "text": "I love love ❤️ my new Porsche.\nYeah yeah YEAH!", "pics": null, "resp": null, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "100668572015883680001", "name": "Robert Nelson", "time": 1532453920769, "rating": 5.0, "text": "We have another dealership closer but we make the drive to this location because of the excellent service department. If you want to feel like your business is appreciated go here.", "pics": null, "resp": null, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "107086719425349286823", "name": "HC Kwok", "time": 1556236260817, "rating": 5.0, "text": "I bought a pre-owned 911, and have been coming to Century for service.  I track and abuse my car...and I'm kind of picky about the work done.  Randy and his team have been outstanding in dealing with my numerous requests and getting my 911 ready for every weekend when I need it to perform at Barber Motorsports Park.", "pics": null, "resp": null, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "108948225715407734269", "name": "Keith Jackson", "time": 1471980499368, "rating": 5.0, "text": "Randy Carter and the maintenance team are great.  The sales lobby is nice, too.", "pics": null, "resp": null, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "108605859928234826773", "name": "Vytautas Pukis", "time": 1509377780127, "rating": 5.0, "text": "Helpful knowledgable staff. Highly recommended!!", "pics": null, "resp": null, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "104131304197496737316", "name": "Steven Payne", "time": 1567546154267, "rating": 5.0, "text": "Super service!", "pics": null, "resp": null, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "100884076193143824449", "name": "Matt Tucker", "time": 1548169827886, "rating": 5.0, "text": "Excellent experience", "pics": null, "resp": null, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "109832105320595149556", "name": "Brad The Volfan", "time": 1505291272528, "rating": 5.0, "text": "😎🏁", "pics": null, "resp": null, "gmap_id": "0x88626b825d20c2a1:0xc176680644f93a21"}
{"user_id": "109652864890062964845", "name": "Ken Williams", "time": 1618879964033, "rating": 5.0, "text": "Jonathan did a great job of keeping me up to date on the process of getting some warranty work done on my 911.  Although they were short handed, they completed the work in a reasonable time once they got the nod from corporate to proceed.\nKW", "pics": null, "resp": {"time": 1619015180761, "text": "Thanks so much for the review, Ken Williams! We truly appreciate you.\nJack Ingram Motors, Inc."}, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "105190172877643297295", "name": "Thomas Lyles", "time": 1617045680725, "rating": 5.0, "text": "Wonderful experience with this car purchase.  Richard Conniff is so brand savvy and personable. Usually, I know as much or more about the product than the salesperson I’m dealing with.  Not in this case.  Plus, we never felt rushed or unappreciated.\n\nThis vehicle was the most expensive we’ve ever purchased.  However, our interaction with this dealership was such that we’ve never enjoyed it more.\n\nThank you Richard and Jack Ingram Porsche!", "pics": null, "resp": {"time": 1619015415906, "text": "Thanks so much for the review, Thomas Lyles! We truly appreciate you.\nJack Ingram Motors, Inc."}, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "101449163519315805856", "name": "Erik Westerlund", "time": 1609297706228, "rating": 5.0, "text": "I had a complicated repair service need and the service team at Jack Ingram Porsche in Montgomery went to remarkable lengths to make sure that every element of the experience went as smoothly as possible.  They provided concierge-level personalized service and earnest attention to detail that exceeded even the usual high-standard that defines Porsche.  Sincere thanks to Rhiannon Coley and the entire team of service professionals that she so well represents at Jack Ingram.  Excellent in all respects.", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "102132874669309353704", "name": "Denise Dukes", "time": 1614899330107, "rating": 5.0, "text": "Great Porsche and great experience at Jack Ingram Porsche.  Richard was always polite,  knowledgeable,  and very helpful.\n10 out of 10 for my Porsche adventure. And definitely 5 stars.", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "104238547073385386831", "name": "Karen Bell", "time": 1618251460317, "rating": 5.0, "text": "The customer service displayed at Jack Ingram Porsche was outstanding. Please keep up the good work.", "pics": null, "resp": {"time": 1619015370778, "text": "Thanks so much for the review, Karen Bell! We truly appreciate you.\nJack Ingram Motors, Inc."}, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "115764731079612905142", "name": "charles tatom", "time": 1613434602538, "rating": 5.0, "text": "Very pleased with the service we received on our Cayenne. Our service writer, Rhiannon, listened well and was very attentive to our concerns. She kept us updated throughout the repair process. The repair was finished before expected and we’ve had no issues since. Every minor issue (apart from the main reason we were there) we was addressed and documented. Magen Lassiter was helpful as well. We don’t know who the technician was, but so far, so good, as to his work.", "pics": null, "resp": {"time": 1619015218978, "text": "Thanks so much for the review, charles tatom! We truly appreciate you.\nJack Ingram Motors, Inc."}, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "104936972674220127012", "name": "michael brown", "time": 1617658645795, "rating": 5.0, "text": "I took my Boxster in for evaluation and received straight forward answers...good communication and service..", "pics": null, "resp": {"time": 1619015385364, "text": "Thanks so much for the review, michael brown! We truly appreciate you.\nJack Ingram Motors, Inc."}, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "109099187248232470092", "name": "dresdamanx", "time": 1611084064974, "rating": 5.0, "text": "Rhiannon was fantastic!  Took great care of me and provided excellent and caring service.  Mike was a great driver and the service manager offered her personal vehicle for a ride back to the dealer.  Hometown care personified!", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "108175451654511661654", "name": "dennis madison", "time": 1601726960798, "rating": 5.0, "text": "The people at Jack Ingram were professional and knowledgeable.  I drove up at the time of my appointment.  The service lead service member met me at my door and called me by name.  They allowed me to explain the problem I was having with my car.  Then they went to work while I relaxed in their showroom waiting area.  With complimentary coffee and Wifi,  it wasn’t long before they came to tell my my car was ready.  It was a enjoyable experience.", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "117916109688086196392", "name": "Sharon Jalieba", "time": 1619223741673, "rating": 5.0, "text": "Excellent and professional, very knowledgeable staff about the cars", "pics": null, "resp": {"time": 1623443709812, "text": "Thanks so much for the review, Sharon Jalieba! We truly appreciate you.\nJack Ingram Motors, Inc."}, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "113550848331374772966", "name": "Rick Smith", "time": 1595421339338, "rating": 5.0, "text": "Great experience this week as I arrived for service on my Porsche Cayenne. The service advisor was very helpful and the entire service was very efficient. They did a great job with distancing and making me feel safe.", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "110908715131362066515", "name": "Ben Freeman", "time": 1611930239089, "rating": 5.0, "text": "Great to work with very helpful with any problems", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "112439346825998056830", "name": "Mac", "time": 1612905016342, "rating": 5.0, "text": "Have to admit, I received great service.", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "104766755219968142857", "name": "Parker Bembry", "time": 1596480370900, "rating": 5.0, "text": "After scouring the internet for days for the best car deals, we found the best one within a 500 mile radius at Jack Ingrams. They also delivered the vehicle free of charge! They’re great at communicating while also respecting your time. Highly recommend purchasing a car from these outstanding professionals.", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "103501385915359766975", "name": "James Lucas", "time": 1618350476019, "rating": 5.0, "text": "The team was very responsive and got me in early!", "pics": null, "resp": {"time": 1619015328038, "text": "Thanks so much for the review, James Lucas! We truly appreciate you.\nJack Ingram Motors, Inc."}, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "106823832265564958771", "name": "Shirley Davis", "time": 1578481063908, "rating": 5.0, "text": "Jack Ingram have wonderful customer service. Everyone is very welcoming and kind. I've done business with them for over 20 years from Nissan, Mercedes and now Porsche. My experience whether purchasing a vehicle or service has always been great!", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "100665315880754851952", "name": "David Hayes", "time": 1582832683317, "rating": 5.0, "text": "From scheduling my service appointment to driving away absolutely a great experience! Everyone Treated me very professional and extremely courteous. It made me realize that this is the dealership that I am trusting my Porsche with.", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "102483287065699401133", "name": "Joanne Hise", "time": 1618858857450, "rating": 5.0, "text": "Great service!", "pics": null, "resp": {"time": 1619015189337, "text": "Thanks so much for the review, Joanne Hise! We truly appreciate you.\nJack Ingram Motors, Inc."}, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "116634455978230923325", "name": "Lee Howard", "time": 1573817578259, "rating": 5.0, "text": "1st time buying a Porsche. Richard made us feel very comfortable and went out of his way to work with us. Awesome guy and great place!", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "106228555351887169585", "name": "Larnetta Moncrief", "time": 1566848262873, "rating": 1.0, "text": "I haven't had the best experience with Jack Ingram Porsche Service Department. I was experiencing issues with parking. My car will continue to move even though the car was in park and turned off. I took my car in to get checked and the Service guy told me I should always use my Parking brakes and that would solve my problem.  I told him that wasn't normal. Why would I purchase a Vehicle that I have to use my parking brakes each time I park? Come to find out, it was a recall on the issue. My Shift Cable end had broken. I paid for the initial repairs and Porsche are suppose to reimburse me back my money, in which I haven't received yet. I have been so disappointed in Jack Ingram Porsche and their service staff.", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "100333618619667250974", "name": "Rex Stanley", "time": 1593110621525, "rating": 5.0, "text": "Everyone was friendly and professional. Work was finished in less time than estimated.", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "110040531335054603354", "name": "Dricaleak's Mom", "time": 1597872277218, "rating": 1.0, "text": "Not sure if it was the color or the age,,but the entire staff was rude and unprofessional...I mean they looked purely disgusted....NOT 1 EMPLOYEE GREETED US nor assisted us...Instead they over looked us and when they did assist us they put us off on other workers claiming they had no clue what we were talking about ...mind you we only went for a turn signal switch smh.....its so disappointing to be spending money like everyone else and watching them happily and eagerly assist people of their own color ... I will never return", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "103557676412745280147", "name": "george bradford", "time": 1548854591644, "rating": 5.0, "text": "Even though I lived about 200 miles away, Jack Ingram Motors gave me the best deal, service & support when shopping for my new automobile.  I would recommend this dealership to my friends & family over other places.  Thank you for making my car buying experience a memorable one!", "pics": null, "resp": {"time": 1550849453761, "text": "Thank you for your business and congratulations on your new Porsche!"}, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "109341640489697188828", "name": "Floyd Madrid", "time": 1574882284812, "rating": 5.0, "text": "Great customer service. The entire team were extremely helpful in servicing my auto and keeping me appraised of any cost estimates.", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "103819670290865140800", "name": "Kenneth Coons", "time": 1619473032348, "rating": 5.0, "text": "Jonathan and Jennifer made sure everything was perfectly arranged and executed. Thanks!", "pics": null, "resp": {"time": 1599083148150, "text": "Thanks so much for the review, Kenneth Coons!"}, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "115508496330694892222", "name": "Kenneth Yohn", "time": 1584991598423, "rating": 5.0, "text": "Good appointment by phone. Efficient & courteous log in.", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "111945626560768236169", "name": "Sue Kirchoff", "time": 1516844427204, "rating": 5.0, "text": "What a great experience!!  We were traveling through Montgomery to vacation at the beach. Warning lights came on. So we went by the dealer and they checked it out for us!  Fast and knowledgeable!!  Friendly too!  Thank you, Jack Ingram Porsche!  We were back on the road within the hour with a reassurance that all was well with the Cayenne!", "pics": null, "resp": {"time": 1518025310697, "text": "We're always happy to help! Hope you had a great vacation."}, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "107244167648527341156", "name": "Jacqueline Olivie", "time": 1557272353935, "rating": 5.0, "text": "Great experience… Everyone was pleasant, a loaner car was available, the work was done on time and as expected. Thank you to the whole team!", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "101827639502035825577", "name": "Peter Veneziano", "time": 1548771230396, "rating": 5.0, "text": "Justin and Caleb are great to work with. My 07 Targa needed some work recently. Unexpectedly the car needed to be kept. I live in Enterprise and Justin arranged a rental. Communication has been excellent. Thanks", "pics": null, "resp": {"time": 1550849474106, "text": "Glad to hear it! Thank you."}, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "111162970237586505027", "name": "Ken Biddulph", "time": 1567107741167, "rating": 5.0, "text": "I took my 2002 Boxster here to have a check-engine light diagnosed, after having the light looked at by my local European Motors mechanic. My local mechanic changed out the catalytic converter, but the light came back on (was not a Porsche cat). He next put the old cat back on, refunded me the money, and tested and changed the oxygen sensors. Still, the light came back on after driving it about 50 miles. He suggested I go to a Porsche dealer. (In hindsight, I wish we would have left the other cat on that he put on in the first place, but we were troubleshooting, and this stuff is expensive anyway.) I took it to Jack Ingram Porsche. They put on a Porsche cat (still expensive, paying for the Porsche name) but I’ve gone over 100 miles now without the light coming back on. The original code was for a bank 2 catalytic converter. Before this, I only went 30 to 50 miles before the CEL light came back on. So, I have hope that the Porsche cat fixed the problem, along with the new oxygen sensors (which the old ones were visibly defective). The dealership worked with me pretty well, as I live an hour and a half away. I dropped it off on a Sunday.  It stayed the week until they could get the parts. It then took me a couple days before I could come get the car. The only thing I could say as far as improving service was that sometimes they were busy and it took a while before they would call me back. However, the other staff relayed messages and helped arrange for me to pick it up after the service department was closed, because that’s when I could make it to the dealership.  In the end, it worked out. If the problem is fixed, I’m happy. I’d go there again.", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "105198450189506606193", "name": "Bill Holcomb", "time": 1570472853205, "rating": 5.0, "text": "One of the finest buying experiences I have ever had, everyone was extremely professional and well prepared     Hats off to a class organization, job well done.", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "109320704438633377813", "name": "Bill Haigler", "time": 1533689293158, "rating": 4.0, "text": "I was unable to make an appointment using the online scheduling software due to all available appointments being filled for almost two weeks.  All I needed was an oil change & inspection; an easy & not difficult short process; however I felt compelled to rearrange a trip out of town with another vehicle because I felt uncomfortable using my Porsche on a long trip &/or getting this taken care of.  After a week & my return I was able to schedule an appointment but was still upset not being able to enjoy my top-down travel time to north Georgia & back!!", "pics": null, "resp": {"time": 1534524698776, "text": "Thank you for the feedback, Mr. Haigler. We apologize for any inconvenience that was caused with the appointment scheduling."}, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "114100564153268279703", "name": "Carl Crawford", "time": 1611113778813, "rating": 5.0, "text": "Good Service", "pics": null, "resp": {"time": 1506364116184, "text": "Thank you Mr Crawford."}, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "115779591407396603809", "name": "Anna Coffman", "time": 1553895208209, "rating": 5.0, "text": "Great customer service:  Mr Justin and Mr Caleb, very professional.\nExplained everything crystal clear more than we expected. Great service. Thank you.", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "109596965698630093187", "name": "Restoration Millenia Church", "time": 1525393227690, "rating": 5.0, "text": "Jack Ingram provided me with phenomenal service on my Porsche. Although, I only came in to have my key & fob programmed, it was a wonderful opportunity to experience excellence in car care. Yes, going forward I will be back because there is nothing more important to me than you sharing me that yk care. My service technician, Lin was the best. Thanks friend.", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "107067884880958155554", "name": "Henry Gray", "time": 1572871184826, "rating": 5.0, "text": "Took my car in to check out a small issue. There was a little hiccup in scheduling as my name wasn’t on the list. However, the service desk worked me in to get things looked at without even much of a wait. Best of all they quickly diagnosed the problem and also offered to fix another small cosmetic item under warranty! I also appreciated their follow up call to make sure things went well.\n\nBack again for another repair on different wear item. I went in for a diagnosis and estimate expecting to see serious $$$. Imagine my surprise when the service manager came back to tell me it would be covered under the CPO extended warranty. Definitely didn’t expect to save over $2000 today! They also took care of a couple other minor things while I was there. Every time I come I drive away thinking this is by far the best vehicle repair experience I’ve had. If you’re reluctant to visit the dealer for repair done be with these guys, they treat you right!", "pics": null, "resp": {"time": 1519243671470, "text": "Thank you for your business. We apologize for the mix up on the appointment. We're always happy to help!"}, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "102259317585381802833", "name": "Rh Houston", "time": 1572917245246, "rating": 5.0, "text": "They are awesome to work with and take excellent care of my 911!", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "100329463130991471701", "name": "Ron McDaniel", "time": 1537480236941, "rating": 5.0, "text": "Took our new Boxter S in for service recently.  The service experience was one of the best that I have ever experienced.  Both the Service Mgr. and Service Tech discussed options and presented recommendations in a professional manner.  This will be our home for Porsche service!!!  Top notch folks.", "pics": null, "resp": {"time": 1537975091220, "text": "Happy to hear it! Thank you for the kind words :-)"}, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "118083909153460017569", "name": "Marc Olivie", "time": 1551741649598, "rating": 5.0, "text": "Great service. Picked up my car and brought it back the next day. Perfect!", "pics": null, "resp": {"time": 1553783496212, "text": "Always here to help, Mr. Marc. Thank you."}, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "116289471242560388386", "name": "UNICORN LOVE", "time": 1562005392209, "rating": 5.0, "text": "Love my new Cayenne, thank you Lin Williams for great and quick buying experience!", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "110298061421194956303", "name": "Amy J", "time": 1516909551101, "rating": 5.0, "text": "Always a great experience! Lin is wonderful and so helpful. Not only did they service my car, but got the dings out of my doors all in the same day. I really appreciate the wonderful service.", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "106162007174851985348", "name": "Melissa Heitzenroder", "time": 1524591591567, "rating": 5.0, "text": "Hands down BEST car buying experience I have ever had. Thank you to everyone that helped us make my dream of purchasing a Porsche come true. Mr. Cade and the rest of the Jack Ingram team were super helpful and professional. It was truly a wonderful experience!! Thank you!!!!!!", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "118230067263820033563", "name": "Gene Becker", "time": 1590172253684, "rating": 5.0, "text": "Great service!  Thanks!", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "103024598191061210286", "name": "Darius Bettis", "time": 1605337599175, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "108115902781811810336", "name": "Chuck Ludwig", "time": 1549312195977, "rating": 5.0, "text": "Lin did a good job of walking me thru the set up.  Like drinking from a fire hose.  Need multiple passes at the set up protocol", "pics": null, "resp": {"time": 1550849427753, "text": "Thank you for your business Mr. Ludwig :-)"}, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "102928367682450138059", "name": "Glenn McPhillips", "time": 1542147697939, "rating": 5.0, "text": "Easy to work with! I was able to get a loaner vehicle. Thanks", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "114782214958555707272", "name": "Corbin Ervin", "time": 1547357833828, "rating": 5.0, "text": "I really enjoyed my test drive with Robbie. He was very friendly and provided great customer service.", "pics": null, "resp": {"time": 1550849493260, "text": "Thank you for the feedback. :-)"}, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "115710627857153487911", "name": "Chance Webster", "time": 1547506592952, "rating": 5.0, "text": "Excellent customer service. Were professional and knowledgeable about the vehicle being serviced.", "pics": null, "resp": {"time": 1550849574952, "text": "Thank you Mr. Webster :-)"}, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "103024598191061210286", "name": "Darius Bettis", "time": 1605337599175, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "115710627857153487911", "name": "Chance Webster", "time": 1547506592952, "rating": 5.0, "text": "Excellent customer service. Were professional and knowledgeable about the vehicle being serviced.", "pics": null, "resp": {"time": 1550849574952, "text": "Thank you Mr. Webster :-)"}, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "116507713312302887674", "name": "Sherry White", "time": 1520023408604, "rating": 5.0, "text": "Danielle and the staff at Jack Ingram made my car purchase a smooth and stress free process! She was a true blessing to work with.", "pics": null, "resp": {"time": 1520286424439, "text": "Happy to hear it Ms. White. Thank you for your business!"}, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "101052730305489651809", "name": "Willie thomas", "time": 1565318554243, "rating": 5.0, "text": "Service staff are great people and very courteous", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "109983395992005666609", "name": "Tom Nowlin", "time": 1545497230064, "rating": 3.0, "text": "Nice but confused staff. No signage to pull in for Porsche service. People/cars moving both ways through single lane drive thru area.\n\nRequested tire rotation when calling in for service and reminded them at check in. Found out tire rotation not performed driving home.  Shouldn't they go over service before paying?\n\nProvided car while waiting helped a lot", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "114815089524902538641", "name": "Ralph Frohsin", "time": 1576100908503, "rating": 5.0, "text": "Good communication and work was done as described .  Appreciate the use of a nice loaner.", "pics": null, "resp": {"time": 1550849507064, "text": "Thank you."}, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "109787708040339989628", "name": "Sam Mcguffie", "time": 1543455097267, "rating": 5.0, "text": "Customers Service is very polite and the repairs are done well and in a timely manner.", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "107577559836995537557", "name": "Nadda Bankham", "time": 1508379256950, "rating": 5.0, "text": "I decided to drive 4 hrs trip to Jack Ingram Porsche although there is a Porsche dealer in my area. because they promptly got back with me with all credit applications, fast approval and quote me with many options for payment for the car that I am interested in. And when I got there I was impressed with how professional they are and so infomative to explain to me how to work with my new car. I drove back home with my dream car and now have hope that there still people that they truely care and take pride for what they do.👍🏻", "pics": null, "resp": {"time": 1508532318831, "text": "Thank you for the kind words! We're happy to hear that you love your Porsche, and we appreciate you trusting us with your business!"}, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "105784961291003068545", "name": "xiaofu li", "time": 1595310644237, "rating": 5.0, "text": "Very satisfactory!", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "100803744620132645129", "name": "Richard Frederick", "time": 1529951542716, "rating": 4.0, "text": "Fine service. Car sat outside, no one notified me car was ready. Otherwise OK.", "pics": null, "resp": {"time": 1531512595304, "text": "We apologize for the lack of communication. We appreciate your business."}, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "105918961806798156338", "name": "Eric Hunter", "time": 1556895487566, "rating": 5.0, "text": "Friendly and courteous is what I always find at this dealership. Never have I felt rushed or strong armed into any deal and I've dealt with them for 30 years", "pics": null, "resp": {"time": 1531512575786, "text": "We appreciate your business. :-)"}, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "100803744620132645129", "name": "Richard Frederick", "time": 1529951542716, "rating": 4.0, "text": "Fine service. Car sat outside, no one notified me car was ready. Otherwise OK.", "pics": null, "resp": {"time": 1531512595304, "text": "We apologize for the lack of communication. We appreciate your business."}, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "107537307280936999992", "name": "Terrance Caffey", "time": 1524242746537, "rating": 2.0, "text": "I had a terrible experience. They didn’t offer me a loaner car while keeping mine 8 days. Replaced/fixed things without first asking. Poor communication, failed to return calls. Understaffed. Just an awful experience.", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "117551579435877866298", "name": "R G", "time": 1509550165546, "rating": 5.0, "text": "My first experience with Jack Ingram Porsche. I set up a service appointment via website. Website very user friendly and quick. Set appointment and received a call from Winfrid to review my vehicle and why I was coming in. Arrived early and Winfrid got vehicle in immediately. The tech came out to go over the service issues. Both were very professional and courteous. It is the best service experience I’ve had with any vehicle. The entire staff was pleasant. Winfrid and the tech were both well trained and versed in every aspect of my 2012 Cayenne S Hybrid which is not the most popular model. I was very impressed and highly recommend them.", "pics": null, "resp": {"time": 1510586476562, "text": "Great to hear, Mr. Glass! Thank you for trusting us with your Porsche."}, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "106185574722238354098", "name": "David Hagopian", "time": 1521193971571, "rating": 5.0, "text": "The team at Jack Ingram leaned in and got us a great 991 GTS.  They partnered with us to overcome my reluctance and nervousness about making an internet purchase of this significance and magnitude.  The sales management team brought in the service management team to resolve a couple of items that could not have been foreseen.  Jack Ingram Porsche made our first internet buying experience a good one.  See Danielle, she was our sales ambassador and she hand walked us through each step of the experience. Thanks, Dave", "pics": null, "resp": {"time": 1522353974159, "text": "Thank you for the kind words, Mr. Hagopian. We appreciate your business and your trust. We hope you're enjoying your new Porsche."}, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "107151826418943098798", "name": "terry steieglman", "time": 1543954860753, "rating": 5.0, "text": "There can't be a better service dealership anywhere.  Jack Ingram is absolutely the best.", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "113817587974787260925", "name": "David H", "time": 1612969340396, "rating": 5.0, "text": "I was very pleased with my Annual Service on my 2010 Boxster at Jack Ingram Porsche Feb 4th, 2021. Service Reps Johnathan and Rhiannon took care of everything...from letting me know what service items my car needed, updating my service booklet, having a new Macan S ready for me to drive as a loaner, to texting me when my car was ready to pick up.\nI look forward to dealing with both Johnathan and Rhiannon in the future.\nThank you...\nDave H", "pics": null, "resp": {"time": 1518025257548, "text": "We are happy to help. Thank you for trusting us."}, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "111221587716309092734", "name": "Jay Jaxon, Jr.", "time": 1591812064278, "rating": 5.0, "text": "Very pleased as always. Have been a customer over 15 years.", "pics": null, "resp": {"time": 1520286431982, "text": "We appreciate you!"}, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "115532025117014441200", "name": "Phillip Coley", "time": 1584644735618, "rating": 5.0, "text": "Great experience.", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "107560299520660914671", "name": "DUODUO ITS", "time": 1578074560216, "rating": 1.0, "text": "Worst dealership and bad experience. The service man said I can not drop my car there. Are u sure u are the dealership？", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "112471584092378119835", "name": "Elaine Daniels", "time": 1552753276593, "rating": 5.0, "text": "Great Experience !!! See Ya Next Year !🚘", "pics": null, "resp": {"time": 1553783472995, "text": "See you then! Thank you, Ms. Daniels :-)"}, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "115543524313784197207", "name": "Paul Cooper", "time": 1527556345960, "rating": 5.0, "text": "Winfred always does a excellent  job for me.", "pics": null, "resp": {"time": 1529521021217, "text": "We appreciate you Mr. Cooper!"}, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "104160506630343405960", "name": "Scott Stewart", "time": 1505841221843, "rating": 5.0, "text": "Great experience. Quick and easy.", "pics": null, "resp": {"time": 1506364127552, "text": "We appreciate your business Mr. Stewart"}, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "110847811627442876501", "name": "Wendy Cavey", "time": 1580776633071, "rating": 5.0, "text": "Impressive service!", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "112214052838376538547", "name": "Praful Patel", "time": 1563929096169, "rating": 4.0, "text": "Not 5 stars because it’s been a year and no one can still resolve an issue with my Porsche connect. I drive 2 hours and spent 4-5 hours and still no resolution. I was told someone would call me today, it’s 8 pm and still no one has", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "112958744764288545979", "name": "Young Boozer", "time": 1547667199430, "rating": 5.0, "text": "Awesome craftsmanship.", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "100518737749204127775", "name": "Jeremy Coyle", "time": 1522495123449, "rating": 5.0, "text": "Extremely helpful folks.", "pics": null, "resp": null, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "112767676979652822666", "name": "Henry Rolle", "time": 1532629088548, "rating": 5.0, "text": "Flexible, honest and courteous.", "pics": null, "resp": {"time": 1533756259520, "text": "Thank you, Mr. Henry."}, "gmap_id": "0x888c2bce41a12a7f:0x591cc58520f98b50"}
{"user_id": "102315462562279775887", "name": "Eliz Laudun", "time": 1623455543776, "rating": 5.0, "text": "Both Ronnie and Tracey were fabulous!  I was traveling from out of town, they squeezed me in and promised to do everything possible to get me back on the road ASAP.  They not only delivered, but surpassed all expectations!  Friendly, and knowledgeable as well!  Great experience!", "pics": null, "resp": {"time": 1623780431890, "text": "Hi there, thanks for your praise and kind comments about our team. If you ever need anything else from us, please feel free to give us a call or stop by. Have an awesome day!"}, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "112049388084511648905", "name": "Steven Mccornack", "time": 1532882147129, "rating": 5.0, "text": "This has been THE most positive experience I've EVER had with a Porsche dealership.  I had my 1985 911 Targa shipped out to Birmingham from Oregon this past May.  The car has been in my family since new - purchased in January 1986 - and is all-original.  But it had been in storage at my folks' place for several years.  Not only did the folks at Birmingham Porsche help me coordinate shipping delivery straight to their service department, but they immediately got the car in and did a full PPI on it, and produced a detailed report of everything that needs to be done.  Throughout the process, they gave me multiple different recommended options, and were consistently friendly, courteous, and kind.  For instance, the engine is due for a rebuild.  But I just can't financially swing it right now.  Instead of ANY hint of judgment or pushiness, they were completely understanding, and were like, \"Don't worry AT ALL - just bring it back in when you're ready!\"  :-)  In particular, Rodney and Tracy went out of their way to take phenomenal care of me and my car - treating me throughout as if I was a millionaire owner of a new 918 rather than a UAB Professor with an old 911.  I cannot begin to tell you how much it means to me to have guys who truly LOVE these cars - and are dedicated to taking meticulous care of them - right here in town.  They will be the ONLY ones who handle my \"baby\" from now on.  You can trust your beloved Porsches to them as well!\n\nREVIEW #2:  For some jank reason, Google won't allow you to post MULTIPLE reviews, even if you have multiple EXPERIENCES to share, so I'm doing it this way.  I was driving my 911 around town, and started feeling my right heel slip on my floormat.  If you're an old-school Porsche owner, you immediately know that this can only mean ONE thing: master brake cylinder.  :-(   Sure enough, got home, put my hand on the mat, and it came up shiny and wet.  SAD FACE.  Immediately took it to Porsche Birmingham.  Figured they wouldn't be able to get to it for days, but instead they had it checked out within 24 hours, even though I (obviously) hadn't created an appointment in advance.  Two days later a new master cylinder had been installed.  When I picked up my baby, I was STUNNED to see that the floormat had been STEAM-CLEANED - along with the PASSENGER one as well.  They even DRIED them, prior to my pickup!  It's the little things, people, that speak to quality in service.  When asked about it, both Rodney and Tracy were like, \"We didn't want your mats to be soiled!\"  Exactly: thoughtful, considerate, and meticulous.  A++ Folks.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO-R-4RptlePYXBACBdoq5VNLFdezXxU8j87dxF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM2_7VWRIdxYRAoV6n2r9bi4O3LxLsxDSvJhU1N=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "106835463082472536975", "name": "Merle Wade", "time": 1620781714653, "rating": 5.0, "text": "Excellent experience all around.  I loved the relaxed vibe.  Everyone was professional.  Lee Goodson was excellent, 5 stars to him.  I never felt any pressure to buy or make any unnecessary changes.  He was always available by phone or email.  He made very helpful suggestions when it came to the purchase.  I also went back to the dealership recently due to a nail in the tire and it was the best service experience I have ever had.  Highly recommended.", "pics": null, "resp": {"time": 1620831644150, "text": "Hi there, thank you so much for taking the time to leave a review for us. We're thrilled we could meet your expectations! We look forward to assisting you in the future, and hope you have an excellent day!"}, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "107224877671170240427", "name": "Melinda Corder", "time": 1621279433724, "rating": 5.0, "text": "Michael was very knowledgeable about the vehicle and was a pleasure to work with throughout the process. Lee, the finance manager, had everything ready, which made it so nice to be able to sign without any issues.   Easiest car purchase I've ever made.  Love my new Porsche!", "pics": null, "resp": {"time": 1621280838115, "text": "Hi there, thanks for your praise and kind comments about our team. If you ever need anything else from us, please feel free to give us a call or stop by. Have an awesome day!"}, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "111625781034406017181", "name": "Sh1rl Squ1rl", "time": 1622197809115, "rating": 5.0, "text": "Top notch experience! Michael and the crew treated me like family from the moment I drove up. I brought my car in to see about getting a trade in. Michael walked me through the inventory of SUVs, got to go on a few test drives and well I fell in love! This is my fourth car to purchase from Michael. Porsche Birmingham is where you need to get your next car 🚗 Take a ride over there 👉🏼 this weekend and tell them I sent ya’🤩 Seriously, I wasn’t pushed through the car buying experience, never pressured to go above my budget and was treated like a Queen for the day!", "pics": null, "resp": {"time": 1622580447795, "text": "Hi there, thanks for your praise and kind comments about our team. If you ever need anything else from us, please feel free to give us a call or stop by. Have an awesome day!"}, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "107318915672795521686", "name": "Jeff king", "time": 1542252304704, "rating": 4.0, "text": "BEAUTIFUL STORE", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNi3ASHRTsx-VKr09AnE2LeuQuC7p2liTtHYwAE=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "107432298328287536348", "name": "Greg Fahey", "time": 1618950586907, "rating": 5.0, "text": "I had an outstanding Porsche CPO remote (AL to MN) buying experience with Ernest Garver at Porsche Birmingham.  From the first call to the delivery to my home in Minnesota, Ernest was most helpful, responsive, professional and respectful!  I had many questions, and Ernest answered immediately, or quickly responded with the information sought.  I was nervous about \"buying remote\", especially a Porsche, but Ernest and the Porsche Birmingham team made it easy for me to buy with complete confidence!", "pics": null, "resp": {"time": 1619031693490, "text": "Greg Fahey, we strive for 100% satisfaction, and it is great to see you had such a positive experience at Porsche Birmingham. Please don't hesitate to reach out if there's anything additional we can do for you."}, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "117114653304040181256", "name": "kau", "time": 1619100041709, "rating": 5.0, "text": "I finally pulled the triggered on a 991.1 manual over the weekend!  I started correspondences with Chuck Gardner remotely from Atlanta a couple of weeks ago.  He was super responsive, and gotten me all detail documents, history and clear pictures of the car.  I drove out to Birmingham this past weekend while Chuck was on vacation, and had a warm welcome by Earnest Garver.  He was helpful, courteous and very transparent on the deal.  I walked away with a great deal!  I can honestly say they are the best car dealer experiences I've ever had.  Thank you, Earnest, Chuck and Lee who helped me gotten this dream car!", "pics": null, "resp": {"time": 1619100916515, "text": "Kau, thanks for your praise and kind comments about our team. Please don't hesitate to reach out if there's anything additional we can do for you, and enjoy your summer road trips in your new 991.1!"}, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "100160552570011693863", "name": "Shannon Lipham", "time": 1620355194549, "rating": 5.0, "text": "I have been a customer of porsche Birmingham for just a few short months. Tracy has helped me tremendously and spent time explaining the intricacies of all of the porsche service protocols. Tracy and more recently Cesar are both very well informed, friendly, professional and it’s a pleasure to walk through the doors and see them. I know that my favorite car is in good hands!", "pics": null, "resp": {"time": 1620839050377, "text": "Hi there, thank you so much for taking the time to leave a review for us. We're thrilled we could meet your expectations! We look forward to assisting you in the future, and hope you have an excellent day!"}, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "104799959613675634351", "name": "Brenton Boozer", "time": 1613668018041, "rating": 5.0, "text": "If you truly want the best experience with your next car purchase you need to see Chuck Gardner.  He is the best when it comes to customer service and will go the extra mile for you. Don't just take my word for it...look at all the other reviews he has.  Truly the best experience I have ever had buying  a car.", "pics": null, "resp": {"time": 1613746418854, "text": "Brenton Boozer, thanks for your praise and kind comments about our team. We're looking forward to your next visit with us!"}, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "113505190519996521466", "name": "Sarah Howard", "time": 1613700967485, "rating": 5.0, "text": "Chuck Gardner did an outstanding job finding a great vehicle for us at a great price!  I was actually sitting on the beach when he orchestrated our deal on a Lexus!  When we arrived to look at the vehicle it was everything he had told us!  Chuck had every detail worked out!  Quick, easy, seamless transaction!", "pics": null, "resp": {"time": 1613747230439, "text": "Sarah Howard, we strive for 100% satisfaction, and it is great to see you had such a positive experience at Porsche Birmingham. We sincerely thank you for the positive review, and look forward to seeing you again soon!"}, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "100833110689700188502", "name": "Frankie Sarris", "time": 1621279204526, "rating": 5.0, "text": "Excellent Customer Service.  Tracy and Rodney did an excellent job working me in for the repair.", "pics": null, "resp": {"time": 1621280452981, "text": "Hi there, thank you for taking the time to leave a review for us. We're happy we could meet your expectations! We sincerely thank you for the positive review, and look forward to seeing you again soon!"}, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "110528658754595455756", "name": "Ingram Worley", "time": 1614271426760, "rating": 5.0, "text": "Chuck was a huge help.  Found the exact vehicle I was looking for- arranged a test drive, was in and out in less than an hour and Chuck even brought the final paperwork to my house so I wouldn't have to bring my 2-year old to the dealership.  Great experience, highly recommend!", "pics": null, "resp": {"time": 1614289416696, "text": "Ingram Worley, we strive for 100% satisfaction, and it is great to see you had such a positive experience at Porsche Birmingham. Please don't hesitate to reach out if there's anything additional we can do for you."}, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "101968099833712613247", "name": "David Tritt", "time": 1621174649304, "rating": 5.0, "text": "Great experience in purchasing a used Cayman. Great car and very fair price .", "pics": null, "resp": {"time": 1621278576570, "text": "Hi there, thanks for your praise and kind comments about our team. If you ever need anything else from us, please feel free to give us a call or stop by. Have an awesome day!"}, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "109108954957595962210", "name": "Miles Cobia", "time": 1613769176495, "rating": 5.0, "text": "I've never had an easier experience making a major purchase in my life. From research to discussions about alternatives to price comparison to shipping, Michael Freeman not only made this an effortless process, I also felt I learned a great deal and he truly was looking out for me regardless of whether I bought from him or not. This is the type of service I expect when buying a premium car. I'm not looking for a car salesman. I'm looking for a consultant to discuss my options within my budget. That's what I got with Porsche Birmingham, specifically Michael Freeman. I will be going back to this dealership for my next car, without question.", "pics": null, "resp": {"time": 1614004782934, "text": "Miles Cobia, we're happy you found our staff to be so supportive during your experience here at Porsche Birmingham. Please don't hesitate to reach out to us if there's anything more we can do!"}, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "117805288521021373615", "name": "Chris Morales", "time": 1613610832788, "rating": 1.0, "text": "Their service department folks are great. Friendly thorough and professional. Unfortunately the same can’t be said for the sales people. I have bought three Porsches in the last three years I’ve always gone to Birmingham first and never bought a car from them. Two of the cars came from Porsche Chattanooga and the other Porsche of North Houston. Every time I encounter sales people at this dealership I feel like they can’t be bothered. This last time the sales person was pretty rude actually mumbling under his breath and not taking me seriously buyer. So instead of buying the Bentley they had, I just bought a jaguar off of Carvana today. I honestly cannot see myself ever buying a car from this dealership. Their inventory is always really low and  I’m not willing spend my money somewhere they act like the customer is a nuisance. I would not have written a review but they are three for three, and it was a different sales person every single time. I do not know whether or not their attitude is because I am young or they treat everyone this way. I recommend Chattanooga or really any other Porsche dealer.", "pics": null, "resp": {"time": 1613664554884, "text": "We are very sorry to hear that the experience you had during your visit did not meet the exceptional experience that we set out to deliver. The management team here at the store would love the opportunity to speak to you directly to see how we can better serve you for any future needs. Please reach out at your convenience to 205-397-2700"}, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "107479545245206548965", "name": "Stroud Williams", "time": 1613786495178, "rating": 5.0, "text": "After years of buying used Porsches, I just pulled the trigger on my first vehicle purchase from Porsche Birmingham, A Sonic Automotive dealership.  My experience with the service department had always been excellent and my new experience with the Sales Team was exceptional.  Michael Freeman efficiently worked all aspects of the purchase. Awesome salesman and awesome dealership!! #lovemyporschecayenne", "pics": null, "resp": {"time": 1614005711227, "text": "Stroud Williams, we strive for 100% satisfaction, and it is great to see you had such a positive experience at Porsche Birmingham. We sincerely thank you for the positive review, and look forward to seeing you again soon!"}, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "108838995536704443865", "name": "Z Girl", "time": 1603151412695, "rating": 5.0, "text": "I just purchased a \"new to me\" 2017 vehicle at this dealership and let me tell you..... my experience was absolutely amazing!!!!!  I could not have asked for a smoother transaction.   I had the vehicle in transport from this dealer all the way to Boise, Idaho.    And it was absolutely seamless.   The communication I received at this dealership is one you dream about. I wish all corporations,  businesses had this level of customer care.   Thank you Porsche Birmingham!!!!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "109088407329374622643", "name": "Brittany Hudgens", "time": 1617388698101, "rating": 5.0, "text": "Excellent inventory and outstanding customer service! Michael Freeman went out of his way to help my dad and I buy a Certified Pre-Owned Macan. We certainly didn't make it easy for him because I'm in school in Virginia and my dad works full-time in Birmingham. My dad and I are very impressed with Michael's composure and communication with joint buyers in different states. On the day of purchase, I called about an online listing before any pictures were posted, but Michael took the time to text pictures directly to me. Even though Birmingham was experiencing severe weather, Michael was patient as my parents made their way to the dealership. He was extremely knowledgeable and answered all of my parents' questions. Despite the nasty weather and distance between joint buyers, Michael orchestrated the sale on the same day as my initial call! He overnighted paperwork to me and kept me up to date. Michael is passionate about Porsche and customer service. I couldn't be more grateful that he was our salesman!! The Macan is gorgeous, in excellent condition, and drives like a dream!! Thank you, Michael Freeman and Tom Williams Porsche!!", "pics": null, "resp": {"time": 1617720587248, "text": "Brittany Hudgens, we strive for 100% satisfaction, and it is great to see you had such a positive experience at Porsche Birmingham. If there's anything further we can do for you, we are happy to help! Thank you and have a wonderful day!"}, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "101419606376534657466", "name": "brad young", "time": 1605712608045, "rating": 5.0, "text": "Had a great experience with this dealer. Michael Freeman was our rep and always took my call and gave us quick answers to questions we needed to make the decision to buy our 2020 Macan.  When we came to pick up the car Had been detailed and looked amazing.", "pics": null, "resp": {"time": 1610373901931, "text": "Hi Brad Young, thank you for taking the time to leave a review for us at Porsche Birmingham. We're happy we could meet your expectations! Please don't hesitate to reach out if there's anything additional we can do for you."}, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "113828756119695811575", "name": "Ronda Parsons", "time": 1606769807996, "rating": 5.0, "text": "We are so impressed with the service department at Porsche Birmingham! They went above and beyond to figure out the issue with our car and fix it!! We'll definitely buy from them again!! 5 stars!!!!", "pics": null, "resp": {"time": 1610373890769, "text": "Ronda Parsons, we're glad you had such a wonderful experience with us! Please don't hesitate to reach out if there's anything additional we can do for you."}, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "107599715052384568664", "name": "Scarlett Canedy", "time": 1603385145679, "rating": 5.0, "text": "My husband and I bought a 2017 Camry XLE from Chuck Gardner! He went above and beyond in making car buying a pleasant experience! My husband called Chuck about the Camry and Chuck went and got the car! He took multiple pictures and sent them to us! When we got to the dealership Chuck had everything ready! We drove the car and signed the paper! Truly the easiest car buying experience ever!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "116830741691626106005", "name": "kwayne jones", "time": 1605407344741, "rating": 5.0, "text": "I saw the listing on Thursday, touched bases that day, talked to Greg who gave me the rundown. Michael Freeman called me back later that day, I asked him if the car had certain things, he took the time to walk out to the car & check everything I asked, I told him I was coming from MS to Birmingham on Saturday. He was waiting when I got there, the customer service was exemplary, cudos guys well done. I was headed back to MS in my new car within an hour. Very pleased!!", "pics": null, "resp": {"time": 1610373908099, "text": "Kwayne Jones, we're glad you had such a wonderful experience with us! Our team strives to deliver an excellent experience, and are glad you found this to be the case during your visit. If you have further needs or questions, please reach out!"}, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "100382855168062358668", "name": "D C", "time": 1603336236029, "rating": 1.0, "text": "Terrible Customer Service, Poor follow up,They are a buy now or We dont care dealership.I was so shocked.It was better under other management. I purchased my vehicle from Mercedes. I promise you people that I am not lying ! Go to Mercedes over 459 or Anywhere for better Customer Service....This is a Real review; Not an emotional or angry review...", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "106162636295979078890", "name": "A. Corbett", "time": 1603801330641, "rating": 5.0, "text": "I have purchased 3 vehicles from Porsche Birmingham and every experience has been super! Friendly staff, wonderful service department, always been greatly taken care of! Chuck and Tracy have always been very nice and helpful!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "109124003239809866673", "name": "S G", "time": 1613667924320, "rating": 5.0, "text": "Great service...very friendly and professional! You can always count on Chuck to go the extra mile!", "pics": null, "resp": {"time": 1613746404930, "text": "S G, thank you for your kind words and this wonderful review! Our team strives to deliver an excellent experience, and are glad you found this to be the case during your visit. If you have further needs or questions, please reach out!"}, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "108775657888516698297", "name": "Drew Ramsey", "time": 1584192116053, "rating": 5.0, "text": "My scheduled maintenance visit was outstanding! From the time I arrived to the time I left Cesar was very approachable and interested in the concerns I had with my Porsche. All of my issues and concerns were addressed under the CPO and while my car was in the shop for a week I was provided with a new 992 as a loaner vehicle! When I picked up my vehicle it had been washed and vacuumed and all issues were resolved to my complete satisfaction .\n\nThank you Cesar! Best experience yet!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "118266937979147202514", "name": "kristina carr", "time": 1622902246088, "rating": 5.0, "text": "Satisfied with my purchase", "pics": null, "resp": {"time": 1623089331312, "text": "Hi Kristina Carr, thank you for taking the time to leave a review for us at Porsche Birmingham. We're happy we could meet your expectations! We do hope we can be of assistance in the future. Take care!"}, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "108775657888516698297", "name": "Drew Ramsey", "time": 1584192116053, "rating": 5.0, "text": "My scheduled maintenance visit was outstanding! From the time I arrived to the time I left Cesar was very approachable and interested in the concerns I had with my Porsche. All of my issues and concerns were addressed under the CPO and while my car was in the shop for a week I was provided with a new 992 as a loaner vehicle! When I picked up my vehicle it had been washed and vacuumed and all issues were resolved to my complete satisfaction .\n\nThank you Cesar! Best experience yet!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "118266937979147202514", "name": "kristina carr", "time": 1622902246088, "rating": 5.0, "text": "Satisfied with my purchase", "pics": null, "resp": {"time": 1623089331312, "text": "Hi Kristina Carr, thank you for taking the time to leave a review for us at Porsche Birmingham. We're happy we could meet your expectations! We do hope we can be of assistance in the future. Take care!"}, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "110376487820087965536", "name": "Anthony Rhoades", "time": 1619802560562, "rating": 5.0, "text": "This place is really nice", "pics": null, "resp": {"time": 1620053821564, "text": "Anthony Rhoades, thank you for your kind words and this wonderful review! We're looking forward to your next visit with us!"}, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "116608139783138533501", "name": "Ben Noe (MisterBen)", "time": 1579188912593, "rating": 5.0, "text": "Amazing experience! A+, super easy process. Sam and the salesmen are wonderful. Completely transparent process, very easy to do business with. Even with all the construction going on, it was never an issue. Speaks volumes for the management and staff at the store. Would recommend.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "114220592178834017780", "name": "Joan Krawcheck", "time": 1622719886041, "rating": 5.0, "text": "Fabulous service !", "pics": null, "resp": {"time": 1622725270431, "text": "Hi Joan Krawcheck, we are very happy to have provided you with such a positive experience! We hope to be of service to you again in the future. \rBest wishes, \rPorsche Birmingham"}, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "112925894008884428008", "name": "Aubrey Smith", "time": 1581821927948, "rating": 5.0, "text": "Steve and Sam were extremely helpful in helping my husband and I purchase our vehicle. We are first time car buyers and they were very thorough in explaining things to us and helping us to understand the car buying process. We are in love with our (new to us) Ford Explorer. I highly recommend them if you are looking for a new or used vehicle.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "109916933042196021631", "name": "V K (Vestelle)", "time": 1581643153010, "rating": 5.0, "text": "I have been a customer of Porsche of Birmingham for many years. Steve Huett has always been the Brand Ambassador helping me with my purchases and any questions or assistance I have needed. He is very kind and cares about his customers and their satisfaction. He has always been very honest and straightforward. We have our cars serviced there and have received excellent service. The entire team is great but Tracey Hebert is the the service advisor that usually takes care of us and does so very professionally. Can’t say enough good things about this dealership and Steve and Tracey and the entire team. Love my car and how well they take care of it!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "103742968474966965169", "name": "Matthew Blevins", "time": 1564892544117, "rating": 5.0, "text": "Excellent experience at this Porsche dealership. Everyone was very helpful and friendly and worked with us on everything that we asked for. I especially want to point out Porsche Salesman Josiah for being extremely helpful, friendly, and having an extensive knowledge about everything Porsche. It is a rare thing these days to find a salesperson who is passionate for what they do and Josiah definitely has it. Sam was also a great help and met all of our terms to make the deal happen. Overall A++ experience!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "101394599354933260936", "name": "Charles Vacarella", "time": 1579207236433, "rating": 5.0, "text": "Porsche of Birmingham is an excellent dealership.  The staff is friendly and very professional of the cars they represent and how they handle you from the you arrive to the time you leave. I have purchased of 20 cars from the dealership in the last 15 years. A Great Parts Department, Great Service Center and a wonderful showroom staff. The Staff of Sam, Lee , Katie and involved are excellent.  I reccommend this dealership to anyone who wants to be treated the right way.  No Pressure just very knowledgeable about their cars.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "111810551208436748130", "name": "Matt Panepento", "time": 1566947727714, "rating": 5.0, "text": "I have purchased numerous vehicles from Porsche of Birmingham and could not have had a better experience. From the time I walked in the door to the time I drive off the lot I felt like I was dealing with family. My every request and question was met with care, understanding, and a sense of urgency. I would recommend the dealership to anyone in the market. From the managers, sales professionals, and service department they are top notch from top to bottom!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "103517579694457129810", "name": "Harper McGee", "time": 1579294211513, "rating": 5.0, "text": "Awesome service department!\nThank you so much Mr Rodney and crew for always taking good care of me.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "112222030478741875156", "name": "Kepp Thorn", "time": 1590894199141, "rating": 5.0, "text": "Excellent buying experience...Chuck was amazing!  Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "113656742433045085748", "name": "Haul Videos", "time": 1535408616041, "rating": 5.0, "text": "Mike Freeman was my salesman and he did a wonderful job assisting me and my son.\nHe was very helpful and knowledgeable on the vehicle and spent time going over the details of the car with my son.   The lady in the accounting and purchasing dept was very friendly and helpful also.  And all this was after closing I might add!\nThanks again for a great experience!\nThis was my third car that I have purchased here!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "113241985490900520912", "name": "Jerry Blevins", "time": 1573336651025, "rating": 1.0, "text": "Bought a 2019 Porsche 911 Carrera GTS this weekend. Our salesman was Josiah. He was very knowledgeable about the car, helpful, polite, and professional. Sam spent the time and effort to negotiate the deal with us and was also very polite and professional. In short, we had an excellent experience at the dealership and love the car! I would highly recommend both Sam and the dealership if you are in the market for a Porsche.\n\nUPDATE: I changed my original 5-star rating to 1. I was told when I purchased the car by Sam (a manager at the dealership) that the Porsche would lose very little value over time. I returned to the dealership after having the car for about two (2) months and inquired as to the value of the automobile as I was thinking about getting rid of it because it seemed to be aggravating a prior back injury. I was offered almost $40,000 less than what I paid for the vehicle about 2 months earlier. I do not like being misled. If you purchase a vehicle from this dealership, I would not rely on anything they tell you. .", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "108347376705871127774", "name": "adam stacks", "time": 1580592801098, "rating": 5.0, "text": "Great service and great people. Finance department was great to deal with and so easy. Thanks Katie!!!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "105850109756050662912", "name": "John Thompson", "time": 1560842080083, "rating": 5.0, "text": "Very professional sales staff. Beautiful dealership. On point. Would purchase again from them. This dealership is much better then the Land Rover-Jaguar dealership right across the street.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "113817587974787260925", "name": "David H", "time": 1547303835347, "rating": 5.0, "text": "I was very satisfied with the service I received from Porsche Birmingham. I had a short shifter installed on my 2008 Carrera.\nTracy (Service Advisor) handled everything in a very professional manner.\nThe facilities are first rate. I waited for the work to be done, and it was completed in the time promised.\nThank you for a job well done....", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "117562041203521719475", "name": "Jess Lewis", "time": 1566354936076, "rating": 5.0, "text": "I just bought a GTI from here and the people were absolutely wonderful. Huge shout-out to Josiah Posey for helping me out! Definitely would recommend seeing him if you're in the market for a new car", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "104527257177432363443", "name": "Mike Urioste", "time": 1554337139238, "rating": 5.0, "text": "I had a terrific experience with the service department. Rodney and Tracy were very professional and a pleasure to work with. I’m glad my 911 has good home to go to for quality service.\nThanks fellas!\nMike", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "101180041757109341657", "name": "Cheryl Herritt", "time": 1544031795866, "rating": 5.0, "text": "Tracey is fantastic!!! His explanation of the service to do is exceptional.  He knows the cars, their issues and the car service is done in a timely basis IF parts are there.  Which is not his fault.  Tracey and I are friends as well as my guy for professional service👍🏻👍🏻🎄\nSherry Herritt", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "117312635976901182767", "name": "Rob Rukstalis", "time": 1547064661119, "rating": 5.0, "text": "Five stars! These guys pick you up at home when your car is ready and then if it's gonna be more than a few hours or a few days they give you a Porsche loaner !   Prices are no higher than at your local shop and it's the Porsche dealer so they stand behind their work perfectly.  When you call them you don't have to talk to you an operator,  it goes right to Robin or Tracy and either one of those guys will make the experience great.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "117793741087111714282", "name": "Kari Craft", "time": 1525534012502, "rating": 5.0, "text": "I had a fantastic experience with Porsche Birmingham.  They went above and beyond my expectations making the trade-in and purchasing part unbelievably easy for me! When other dealers wanted me to come in to the dealerships and talk (which I really didn't want to do...I knew what I wanted and that was that...) they allowed me to do the transaction over the phone and delivered my car to my front door! They gave me the best trade-in price out of all the dealerships that I had contacted (6 total) and the best price on my new Porsche! Thank you again for making the process fun, enjoyable and easy! I will be back for sure!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "111152798385102236506", "name": "philip james", "time": 1541265703293, "rating": 5.0, "text": "Got my water pump replaced on my Volkswagen. Mechanics name was William he was very friendly and very helpful and quick. I would recommend him and this dealership to anyone with a German car or someone who wants their vehicles taken care of", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "111854020119015169988", "name": "Lane Parsons", "time": 1475503709192, "rating": 5.0, "text": "Purchasing our Cayenne from Porsche Birmingham was an awesome experience.  We were somewhat intimidated going to a Porsche dealership in the first place, but everyone was very nice, very professional, and made us feel right at home.  In addition, our purchase was very smooth, very fast actually, and extremely simple.  Thank you everyone at Porsche Birmingham, and you definitely have customers for life (well worth our 2 hour drive).\n\nLane Parsons", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "114309411836532086833", "name": "Lori McCord", "time": 1602457043436, "rating": 5.0, "text": "Excellent service department", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "114311622409795879562", "name": "Kenneth Thompson", "time": 1511197853932, "rating": 5.0, "text": "Great buying experience. Michael Freeman went the extra mile to get the deal done, including driving down to Tuscaloosa to pick me up so I could take delivery of my Porsche.  It was as easy of a buying experience as I've ever had.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "108854042023407336534", "name": "Lisa Garrison", "time": 1545086177453, "rating": 5.0, "text": "This was a seamless, no stress experience.  Everyone I came into contact with was very professional and respectful. I love the Rav4 that I purchased.  I will absolutely do business again with Porsche Birmingham!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "107391604159128819515", "name": "Cj Young", "time": 1567899166559, "rating": 5.0, "text": "Good customer service we've ever been , interms of Porsche product", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "111091799109698826616", "name": "Christy Harding", "time": 1606678731285, "rating": 4.0, "text": "Awesome experience", "pics": null, "resp": {"time": 1610373896723, "text": "Hi Christy Harding, we are very happy to have provided you with such a positive experience! We are always more than happy to assist you if anything else comes up. Take care!"}, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "106412933795420442619", "name": "William Gullung", "time": 1547064194643, "rating": 5.0, "text": "I highly recommend Tracy Hebert and the Porsche team on Tom Williams Way.  I brought my 911 in with a fault message on my dash and they correctly diagnosed the problem and corrected it for a small fee the same afternoon with little wait time.  ( I got to test drive a Cayenne while i waited.)  Notable, is that I was seeking another opinion after being told by another dealer in another town that it would cost about $3000 to repair.  Hats off to you Tracy!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "109551346440783910979", "name": "Lindsay Masson", "time": 1422133335709, "rating": 5.0, "text": "I had been looking around at buying a new luxury SUV. I had the pleasure of working with Lily Young and Steve Colter. I cannot say enough about how wonderful they have been to work with! Lily made this an extremely easy, enjoyable and stress free experience for me! She was in constant communication, very knowledgeable and a complete pleasure to work with. This has by far been the best experience I have had buying a car. I would, without a doubt recommend this dealership!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "106642727262219535441", "name": "Bryant Gilmer", "time": 1554341024330, "rating": 4.0, "text": "A little snooty. Was there for a wheel lock key that they kept  on my customers last visit. Service guy Tracy was VERY accomodating.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "109062660924469291073", "name": "ej7447", "time": 1498506771793, "rating": 5.0, "text": "This first trip was to repair the A/C unit, which was done and all is well. Also had and oil/filter change and replaced fluid in brake lines. I asked about changing the coolant and the mechanic thought it was find but car was returned today after running hotter than normal. The Service Department is on this now and have a great attitude about insuring the vehicle is running as it should. Great car and very nice people to deal with.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "100520891100748460850", "name": "Tyrone Henderson", "time": 1548103787341, "rating": 5.0, "text": "My visit and service received at your Porsche dealership have been both refreshing and pleasant. The service  personnel have been professional and helpful in every way. I appreciate the way I have been valued as a customer.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "111327312023330752320", "name": "Kee Tan", "time": 1502726111772, "rating": 5.0, "text": "I have bought several vehicles from Tom Williams, by far this was the best experience I have had!  My sales specialist, Micheal Freeman, was very knowledgeable about the vehicle I was interested in and made the whole test driving/ purchasing/ delivery processes easy and fun!!  Thanks Michael!!!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "113174545253170701054", "name": "B K", "time": 1503373861083, "rating": 5.0, "text": "Had a very positive experience purchasing a car from 4 states away. Chuck and Bart were extremely responsive, attentive, and patient with all of my questions and requests. Outstanding sales department!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "104094796488298822473", "name": "R VZ", "time": 1548119271704, "rating": 5.0, "text": "The people in the service department could not have been more pleasant. Everything was done just as they said. I am very pleased.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "113013365671873882169", "name": "tcape100", "time": 1463574337400, "rating": 5.0, "text": "Steve was very thorough and responsive on the phone. The service at the dealership exceeded expectations. The entire process was painless and very professional. The only little glitch was the detail shop not doing a good job the first time but they detailed the car much better the second time. My buying experience from Porsche Birmingham was excellent and I would buy from them again and reccommend everyone to check them out before buying a Porsche.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "102172197540764172718", "name": "Bill Kelley", "time": 1512446184423, "rating": 5.0, "text": "I had Porsche Birmingham install a factory performance upgrade and do an alignment on my Cayman. They did a great job, perfect alignment, car was clean when I picked it up. Will definitely use them for my next regular maintenance.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "115947326615101773134", "name": "jim hunter, jr.", "time": 1528468327892, "rating": 4.0, "text": "I think Porsche of Birmingham is the best Porsche dealership that i have been to. I went to Montgomery AL. Atlanta and Florida to look at the Porsche Macan.Birmingham was for the best.Salesmen Steve Hewlett was the best.I was walking looking around to get some floor mats and other items and some one came out of the shop and ask me did i need some help.I SAID THIS GUY IS GOING TO WORK ON MY CAR ! The dealership was clean and the service department.I GIVE IT FIVE STARS!!!!!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "109377289724658623833", "name": "Steven Schullo", "time": 1534785412233, "rating": 3.0, "text": "Generally pleased with the used car purchase process at the dealership.  The sales associate and financing representative were a pleasure to work with.  However, I was disappointed in the vehicle prep process as the dealership failed to identify an issue with the rear lift-gate.  This issue will require a visit to the vehicle manufacturer dealership to have corrected and is something that should be have been taken care of by Porsche of Birmingham.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "111839861131993732317", "name": "Matt Hocutt", "time": 1407761813139, "rating": 5.0, "text": "Great group of people here that will make your buying experience one to remember. Michael was a great asset in helping us purchase our car. No pressure and there for the buyer! Give them a shot, you will enjoy your next car buying experience.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "111568157164184137746", "name": "Enrique Garcia", "time": 1379545295326, "rating": 5.0, "text": "I recently purchased a used car from this dealership. I had some help from Michael Corely. He is definitely one of the coolest guys I've met in a while. He was very professional, helpful, down to earth. I recommend going to Tom Williams Porsche Audi to purchase your next vehicle. They will do what they can to make sure you are taken care of and have a great experience.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "113931084021340600007", "name": "William Teague", "time": 1403454670916, "rating": 5.0, "text": "We bought our first Audi from Hannah Griffin this past Thursday.  It was a great experience in every way. We test drove both the Audi and a Lexus.  The Lexus salesperson, Robert Cunningham, was as professional and personable as Hannah, and it we ever decide to buy a Lexus, we'll go to Robert.  But the Audi won the day. We got a fair price on our trade, a good price on the Audi, and there was absolutely no pressure.  We'll be back!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "105048736769687235510", "name": "Matt Scalici", "time": 1530023130734, "rating": 5.0, "text": "The service manager and sales manager at Porsche Birmingham are the best I've ever experienced. My Macan has only needed routine service in its first 40,000 miles, but they have done a superior job of communicating and servicing my needs.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "106392605824957123601", "name": "Josh Goodwin", "time": 1520718227132, "rating": 5.0, "text": "Great experience and very competitive pricing on parts and labor! Robben, Seth and Tracy made sure that all of my questions were answered and I feel confident that the service performed on our vehicle was thorough and completed by highly trained specialists. They really know these vehicles and that makes a huge difference for me.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "109467944643433161841", "name": "Barry Walls", "time": 1439517221849, "rating": 5.0, "text": "I purchased my 2015 Audi Q7 CPO from Tom Williams Porsche Audi,and it was the best SUV purchase I have ever had. Steve Huett my salesman was awesome to work with. He made ever thing so easy for me being that I live 210 miles away and all business was done on the phone. I will do business with them again for sure and tell all my family and friends about Steve and Tom Williams Porsche Audi. Thanks for all your help.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "113456656919488787346", "name": "Eric Nelson", "time": 1540233042885, "rating": 5.0, "text": "This is the second Macan I have purchased from Porsche Birmingham, and each time the customer service has been outstanding.  Steve Huett is a well informed salesman, and Sam the Manager is very candid and honest when negotiating a price.\nI highly recommend them for your future car buying choice.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "103237988572303741753", "name": "Joshua Argo", "time": 1497581304209, "rating": 5.0, "text": "My experience with their service department was excellent.  The level of service I received exceeded my expectations, and repairs were completed in a timely manner.  I will definitely continue having my car serviced at Porsche of Birmingham.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "104298027688098323694", "name": "H.Peter Schmidt", "time": 1476709018859, "rating": 5.0, "text": "Thank you,\nfriendly and efficient service, very knowledgeable associates who met my expectation as I am used too.\nNo surprises exactly what I was told as far as the price and timing is concerned, actually it was two days early.\nThis is what you expect when owning a Porsche.\nGood Job!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "108046292273185689571", "name": "Pete Morgan", "time": 1400718545821, "rating": 5.0, "text": "Great experience. I am a retired new car dealer with over 40 years owning the businesses. I had never purchased a car that wasn't from my old dealership before, and was pleasantly surprised to find my treatment was just like I expected from my friends and employees at my dealership. Bernard, my salesman was very friendly, professional and knowledgeable. He made every effort to accommodate my purchase decision. The Audi FS 5 was the car I wanted, but due to limited supply in the Southeast it was difficult to find the exact car. Every effort was made by Bernard and Sam, the sales manager, to find what I wanted. After the purchase, Jordan handled the paperwork quickly and was great fun to talk with about the process. This is a well run dealership with a very professional staff. A great place to do business.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "106211890190311268767", "name": "8NIN8", "time": 1408114239740, "rating": 5.0, "text": "Salesman MICHAEL WILSON is FANTASTIC!  Before I got to the dealership, he had found a car for me and had the financing lined up; therefore, the transaction was efficient and faster than normal.  Michael was very forthright and honest with me about the kind of car I needed.  He found a low-mileage, very new pre-owned car and worked tirelessly to arrange everything to my benefit.  This is the second car I've bought from Michael.  I intend to return to him whenever I need a new car.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "109686882464506657718", "name": "Stan Banks", "time": 1490642160105, "rating": 5.0, "text": "For the last 10 years I have been considering buying a Porsche Cayman.  I currently drive a CLS 500 Benz and I plan to keep that car.  I was looking for more of a weekend car that could become a daily driver if needed and the Cayman fits that plan perfectly.  The car is one item to consider but the company to buy from is just as important of a decision.  I have bought 2 other cars from Porsche of Birmingham when it was know as Tom Williams Porsche/Audi.  I always received first class care and felt like I was treated well with the price on both cars.  Coming back to the same dealer was not a difficult choice.  I had the privilege of conducting a test drive with the Sales Manager, Bart Irvine, and he was open to me putting the care thru the paces.  I drove the car late Friday after work and returned Saturday to make the purchase.  They are very organized and the process was fast and painless.  This is my 3rd purchase from the same location and I think that says it all when considering where you go to buy your first or next Porsche.  Have fun and drive safe!\nStan Banks", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "111046999598248544268", "name": "Philip Royall", "time": 1525443818900, "rating": 5.0, "text": "Steve Hewitt sold me an upscale Boxster S.  Of the six  comparable  convertible vehicles in this price range I chose the Porsche.  I've never driven anything like it; gorgeous, functional  and solid inside and out.  It is an exemplary and fun driving experience!  It was also a  pleasurable  buying experience.  At least once or twice a week  people ask me questions about it.\n\nRecently I went back and traded in my 718 ☹️ for an upscale 911 😀. Same great sales service and tech service. I really miss my 718 but when I romp ⚡️ down on the 911, there is no comparison", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "107062292629392223577", "name": "David Orienti", "time": 1411919015142, "rating": 4.0, "text": "Was looking for a particular used car and found one at Tom Williams Porsche/Audi. Set up an appointment to see it, drove it, liked it and purchased it.  Steve Huett treated us as  reasonably intelligent human beings, unlike some other car salesmen I've met in the past. As you can tell, I'm not a fan of car salesmen.  Would rather have a root canal done than deal on a car, but I was very happy with the experience at Tom Williams.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "103256442230171306653", "name": "Harry Buttelwerth", "time": 1492093383737, "rating": 5.0, "text": "I cannot give this dealership high enough marks!!!!! Their immediate honest and complete concern about my purchase, made the entire experience absolute perfection!!!!! My personal dealings with Bart could not have been better. I believe that this will be the first of many purchases from Porsche Birmingham. You should take great pride in setting the bar of customer satisfaction, to a new level, and achieving that goal. My absolute sincere thanks!!!! Harry Buttelwerth", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "101169251403425795204", "name": "Diane Derzis", "time": 1520273279341, "rating": 5.0, "text": "Tracey is fabulous. He always takes care of me and the babe quickly, courteously and genuinely cares about the customer.\nAbsolutely 5 stars", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "111630910055017275345", "name": "christopher rambo", "time": 1394248376241, "rating": 4.0, "text": "Overall a fantastic experience. I bought a car sight unseen and we ran into a few obstacles that were all overcome. I would have preferred to have dealt with the same person throughout the entire process, but it worked out just fine. They even delivered the car to me and picked up my trade.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "111741805918711044836", "name": "Adolfo Ibarra", "time": 1549546829792, "rating": 5.0, "text": "Clear and honest report on what was needed to be performed as well as any potential risks.  Awesome job getting us back on the road.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "118245496657087531068", "name": "Donna Cox", "time": 1546010045751, "rating": 5.0, "text": "Very nice experience in purchasing my Porsche Macan at Porsche Birmingham.   Steve Huett, our salesman and all the staff at Porsche Birmingham were very helpful and made the process a pleasure versus a chore.   Highly recommend the vehicle, the dealership, and the salesman!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "106844388491544904806", "name": "Timothy Johnson", "time": 1550513511413, "rating": 5.0, "text": "Easy and Convenient, the service department is setup very nicely.  Out of the weather drop off and pick up area, service advisors has clear view of your arrival, paper work was ready to start the process and quick payment when completed.  Recommend highly to call a few days early to schedule an appointment to be sure any recalls or parts can pre-order if need.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "109122937254407133347", "name": "taj101276", "time": 1466697636366, "rating": 5.0, "text": "I purchased a used truck from Chuck Gardner. The whole experience was amazingly easy and I felt like they took excellent care of me in regards to my trade and the financing. I would highly recommend giving them a call and if you see a used vehicle on any of the dealerships give Chuck Gardner a call first.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "109473642677069875530", "name": "Sandy Willis", "time": 1545766052582, "rating": 5.0, "text": "Excellent service and prompt completion. Always a pleasure doing business with Porsche Birmingham.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "117157126327963058425", "name": "Nir Menachemi", "time": 1398351731147, "rating": 5.0, "text": "I picked up my Audi this week after it arrived ahead of schedule (2 weeks early!).  The service, especially by Bernard (my sales agent) was superb.  He was extremely knowledgably about the vehicle and demonstrated a genuine passion for what he does.  It was a pleasure interacting with him.  He has promised to help me learn all the “bells and whistles” of my new car-- and I look forward to taking him up on that offer.  Thanks!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "109367847241834443556", "name": "Adrienne Reed", "time": 1411068341414, "rating": 5.0, "text": "Own a Lexus bought at Tom Williams, a Jaguar and Porsche. Lexus service is always great. My first Porsche service experience and it was great. My service guy Richard is fantastic. Professional knowledgeable and fast service. Highly", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "110961562386118254171", "name": "Tammy Cook", "time": 1410635732570, "rating": 5.0, "text": "I contacted Tom Williams Audi a few months ago inquiring about the new Q3, Hannah Griffin answered all my questions and told me she would call as soon as they arrived to the dealership.  As promised, I received the call from Hannah that the Q3 had arrived and I promptly drove to see her and test drive the vehicle.  She is very knowledgeable about all of the Audi vehicles and other brands as well.  She has an excellent way of dealing with her customers and made the experience comfortable, informative and no pressure!  I decided the purchase a 2015 Q5 instead of the Q3.  She and the staff at Tom Williams Audi made the experience wonderful.  From the time I was greeted at the door by Greg Garrison to the finance experience with Jordan.  We look forward to a long relationship with Tom Williams Audi.  We always like to purchase Audi care, so we know we will be back often to have our Q5 serviced by the professionals at their dealership!  Thank you Hannah and all of the staff at Tom Williams Audi!  We will recommend you to our friends and neighbors!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "100058312495210858475", "name": "Mike White", "time": 1543612114208, "rating": 5.0, "text": "Great selection and exceptional customer service.  We had a great experience with everyone there, especially Michael Freeman.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "102556100814140300048", "name": "Robert Mitchell", "time": 1465562896356, "rating": 5.0, "text": "My experience was excellent.  The service writer was courteous, knowledgeable and demonstrated a \"be of service\" demeanor.  I will certainly utilize their services again and highly recommend others do the same.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "101642989646199745994", "name": "Chung Hsu", "time": 1529347632747, "rating": 5.0, "text": "Very professional service team. Drop off and pick up time spot on per quote and loaner vehicle was provided exactly as promised.  All service items explained in detail.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "102805553062012666990", "name": "Joseph Zakhary", "time": 1504275495005, "rating": 5.0, "text": "Tracy was excellent and communicated with me several times throughout the day to keep me updated of progress. Car came back spotless after the service appointment. They had a Cayenne for me to take for the day.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "101642989646199745994", "name": "Chung Hsu", "time": 1529347632747, "rating": 5.0, "text": "Very professional service team. Drop off and pick up time spot on per quote and loaner vehicle was provided exactly as promised.  All service items explained in detail.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "107802982406035911175", "name": "Amy Wade", "time": 1436208133434, "rating": 5.0, "text": "Spend July 4th with Bernard @ Tom Williams Audi. What a great guy to deal with! So knowledgeable and helpful about making our first Audi purchase. Everyone there was so courteous & professional. Highly recommend Tom Williams Porsche/Audi for any of your new car needs.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "107782062056316669929", "name": "Joan Currier", "time": 1473424533486, "rating": 5.0, "text": "My servicing was a shining example of the best service.  I happened in as a result of being nearby for routine oil change and was out in an hour.  Best service ever!\n\nJoan Corr Currier", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "105635099160658765544", "name": "Clayton Hudson", "time": 1472097268666, "rating": 5.0, "text": "Wow! Tracy in the service department was spot on with top quality service and updating me throughout the process. This dealership is one of the best I have used! I am now a complete Porsche Owner!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "102805553062012666990", "name": "Joseph Zakhary", "time": 1504275495005, "rating": 5.0, "text": "Tracy was excellent and communicated with me several times throughout the day to keep me updated of progress. Car came back spotless after the service appointment. They had a Cayenne for me to take for the day.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "113125121337068016092", "name": "taryn legvold", "time": 1438025905496, "rating": 5.0, "text": "Best experience buying a car yet. Super quick and everything went smooth. They are very eager to please ;)", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "104643089252650789545", "name": "Steve Mccluskey", "time": 1441038054989, "rating": 5.0, "text": "very good dealership. we are more than pleased with how they handled our purchase. they went out of their way to help make our purchase work.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "107774792670486380335", "name": "Konie Bryant Clark", "time": 1518448846456, "rating": 5.0, "text": "Always the best service from Tracy and Robben!!! Very welcoming, friendly, and informative!! My car is serviced well by the mechanics also ...I always leave happy!!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "103653126787951267216", "name": "Kris Williamson", "time": 1531147006711, "rating": 5.0, "text": "Best customer service! Michael is well knowledgable about the vehicles and very professional. Great first experience with porsche!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "109842513909699132719", "name": "GT3PDL", "time": 1531137823688, "rating": 5.0, "text": "I love this dealership, Tracy and the team always go out of their way to make sure the customer is taken care of.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "116887575661471265826", "name": "Lyndsey Hirin", "time": 1445464841581, "rating": 1.0, "text": "0 stars for the Porsche service department. 5 stars for Porsche/Audi sales department. My dad and I have bought 2 Porsches here and I absolutely loved it - I have a lot of appreciation for the sales department here. They are respectful, professional and very knowledgeable. However, I honestly get the WORST service from Richard, the service department employee. If I am going to spend minimum $500 - $1000 for service/repairs, I expect at least a little bit of respect or a decent customer service. He always has a belittling tone and most disrespectful way of treating me. I don't know if he thinks it's okay to treat me this way because I'm a minority or because I look younger than other customers. I didn't say anything when he forgot that I needed a ride back to work for 30 minutes. I didn't say anything when he forgot to call me when my car was ready. But, when I was trying to figure out a time for a driver to pick me up, Richard nearly yelled at me with the most disrespectful voice saying they cannot give me a ride because they are too busy and the drivers will get overtime. Then I asked him what the total will be and he said he does not know with the most annoyed tone. Was I not supposed to ask what the total was going to be??? Very unprofessional. It's okay if they can't pick me up, then they should've let me know in the morning when they dropped me off. Or at least be polite and professional about it. I really DO NOT recommend the service department for any Porsche customers. I will not be back to purchase another car here.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "113692477531293715595", "name": "Samuel Corbin", "time": 1468499229192, "rating": 5.0, "text": "Excellent customer service. Lee's attention to detail is extraordinary. Great staff all-around. Finished in an acceptable timeframe.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "104643089252650789545", "name": "Steve Mccluskey", "time": 1441038054989, "rating": 5.0, "text": "very good dealership. we are more than pleased with how they handled our purchase. they went out of their way to help make our purchase work.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "113125121337068016092", "name": "taryn legvold", "time": 1438025905496, "rating": 5.0, "text": "Best experience buying a car yet. Super quick and everything went smooth. They are very eager to please ;)", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "117947612238820968496", "name": "Brenda Brock", "time": 1532131403954, "rating": 5.0, "text": "Walked in \"just to look\" and drove out in a brand new Porsche Macan!  Loved the experience and love the car!\nJune 2016...Just had my first service with my Macan and everything went smoothly.  Left it with the service dept around 9:30 and picked it up early afternoon.  Everyone was pleasant to deal with and my car looked and smelled like new when I picked it up!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "115017658165889583508", "name": "Brynley King", "time": 1525262921615, "rating": 5.0, "text": "Accurate diagnosis of problem. Very attentive to my needs. Thanks, guys!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "104292835644643375529", "name": "Anthony Marino", "time": 1565126695369, "rating": 4.0, "text": "Great Cars and Nice people !", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "110766076790094900478", "name": "Praydeep K", "time": 1557182582400, "rating": 5.0, "text": "Good people to deal with..", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "110148964850692710880", "name": "Whitney Morgan", "time": 1546889083170, "rating": 5.0, "text": "The Porsche Birmingham service department got me in quickly and had my car serviced and ready sooner than they promised.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "106354457867235314198", "name": "Robert Tant", "time": 1581691610638, "rating": 5.0, "text": "Steve goes above and beyond to make the sales happen.  I have bought two cars from him and I could not be happier!  I will follow him to buy a vehicle wherever he works.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "113807118718559263391", "name": "Michael Ryan", "time": 1528384970433, "rating": 5.0, "text": "Service team was very attentive and took time to explain in detail what the team did on my car and why. Appreciated the time spent with me!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "106411383032609210187", "name": "Sondra Personal", "time": 1513575892593, "rating": 5.0, "text": "Everyone was so nice, straightforward and respectful. I bought a car here because Chuck and the entire team appreciated my business.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "102060810979829654326", "name": "Jeff Faust", "time": 1392166661842, "rating": 5.0, "text": "It was a pleasure dealing with the Tom Williams Audi team. Our sales associate was Steve Colter. Steve did an outstanding job of explaining and answering all questions about the car! We especially appreciated the fact that everyone was extremely friendly and did not apply any pressure in making this decision.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "105261747328036353098", "name": "Brandon", "time": 1486537909613, "rating": 5.0, "text": "I felt quite welcomed here and quite comfortable. The staff are great and helpful people who will make you and your Porsche feel cared for.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "111202514148965189908", "name": "Melissa Barbercheck", "time": 1445521096897, "rating": 5.0, "text": "We came all the way from Ohio to purchase our Audi.  The staff was very friendly and made everything easy for us.  Michael Wilson was our sales representive and he was very honest, knowledgable and prepared.  It was a great experience, and we wished we lived closer so we could continue working with this dealership!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "102912827386844620557", "name": "Michael Dupre", "time": 1406652824700, "rating": 5.0, "text": "Just bought my second car from Mark Colvin.  He and the entire staff from the top manager, sales associates, finance, and service reps are quite simply the best.  Couldn't ask for a more fair price and trade in with no pressure sales.  Constantly ensuring my comfort with the process as well as sodas and the like.   Mark has been and is always professional courteous, and friendly.  Extremely easy to deal with.  If you are in the market for an Audi or a Porsche, and your comparing these cars with other dealerships or similar.  Go Tom Williams Porsche.  Service before and after sale can not be beat. Oh and ask for Mark Colvin.  You'll be glad you did.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "112088683225480124968", "name": "Tony Halsey", "time": 1517504999501, "rating": 5.0, "text": "First time visit and my first impression of the staff was that they were knowledgeable about their brand and eager to serve.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "108127212526948896044", "name": "frederick gear", "time": 1547650958261, "rating": 5.0, "text": "Great car, dealer is responsive to my needs and gets it done fast!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "104776149474132165100", "name": "James krouse", "time": 1453397652990, "rating": 1.0, "text": "Tom Williams Porsche Audi, Mini Cooper is the most arrogant, rude and ignorant people I have ever done business with in 41 years. Their internet sales is horrible. I tried to purchase a 2003 Mini Cooper from them and they were all over me until the financing didn't go through and I am not sure if that was the problem because once the application went in I heard NOTHING back from them.\n\nI sent 3 emails to Benjamin Noe asking what the results were and if we could come and test drive the car and still heard nothing. I even offered to pay cash and still heard nothing. Then I got an automated email that the car in my saved folder was no longer in stock. They have others!!!\n\nIt just goes to show you that probably because my \"Financial Status\" did not measure up to the \"high standards\" of their dealership, I was ignored as some kind of low life, and left to wonder and dropped. Well I feel I have been misjudged. They should at least have had the decency or courtesy to let me know that, An email or a phone call would have been nice and I could have paid cash for the car if they would have at least contacted me. I felt that I should not have to call them. This car  was going to be a Christmas present for my wife.\n\nI came to Tom Williams because I knew I would get a good car as I have other friends that have bought BMW's there in the past (whom I was with), and they were very happy.\n\nI will NEVER come to ANY Tom Williams dealerships again! This is a direct reflection on Benjamin Noe, and the dealership he represents on how they conduct their business.\n\nBY the way, I bought a 2005 Mini for cash that afternoon and it will NEVER go there for servicing either. I am sure Mr. Williams would pleased to know that!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "115638222620648543168", "name": "Dr. Kevin Sims", "time": 1491483202477, "rating": 5.0, "text": "The Tom Williams service advisors are great.  Took care of everything without any hassle.  Best experience ever!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "114814384074449656393", "name": "freddy duron", "time": 1380934551083, "rating": 5.0, "text": "I bought a used car there, they were great.  The finance person, Jordan, and the saleman, Tom Hardy, had all the paperwork in order and were extremely professional.  I was in and out in a under an hour.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "108652479907490054492", "name": "Randy Yarbrough", "time": 1535048705005, "rating": 4.0, "text": "Excellent service.  Personal touch that Porsche owners appreciate", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "103430441396802272118", "name": "Kathy Zuelzke", "time": 1518574571388, "rating": 5.0, "text": "I have always received great service, including very courteous and clean. Highly recommend !", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "111713308844575681243", "name": "Ricky DeFilippo III", "time": 1494501604756, "rating": 5.0, "text": "This was my first time at the dealership. Service department and parts department provided emotional customer service; very friendly, informative and timely service. Thank you.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "112404012734551839466", "name": "Christopher McDonald", "time": 1526387843644, "rating": 5.0, "text": "Very good experience with my purchase and fairly treated.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "100207253468622436128", "name": "Terry Riney", "time": 1512665274779, "rating": 5.0, "text": "I am very pleased with my recent service at Porsche Birmingham and with service advisors Robben Tindle and Tracy Herbert.  Even though I did not purchase my Porsche at this dealership, they treated me with respect as if I was a long time customer when I brought my car in for some warranty repairs.  This was the best service experience I've ever had.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "113773759812735693859", "name": "Garry Terrell", "time": 1506231770997, "rating": 5.0, "text": "Dem boys know all about fast cars. Tracy and Roben be the top shelf service gurus!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "104200635848348498453", "name": "Robert Reeve", "time": 1482148579380, "rating": 5.0, "text": "Very nice car purchase experience. We love our new Cayman GTS.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "112277463062059735099", "name": "John Duda", "time": 1457015708205, "rating": 5.0, "text": "Quick and friendly service that knocked out exactly what I wanted on the date asked for.  Not sure about all of the Tom Williams dealerships but I plan on using their Porsche service in the future.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "114004090145981720368", "name": "Al Ellison", "time": 1529337886653, "rating": 5.0, "text": "What a terrific team!  Thanks Fred, Tracy, Rodney, Greg, Sam & Terrance.\nGreat experience.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "114653190776372920220", "name": "Michael Antonetti", "time": 1521559855329, "rating": 5.0, "text": "another great experience with Robben, the guys at Tom Williams never cease to amaze me with their courtesy, professionalism, and excellent service! would highly recommend him and the guys at TW Porsche!!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "109937712253798286319", "name": "Ashton Arrington", "time": 1517448399936, "rating": 5.0, "text": "We recently had our car serviced with Robben and the guys at Porsche and they did an awesome job of taking care of us and of our vehicle. THE guys for all your local Porsche needs.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "111013839732216049615", "name": "Alan Pizzitola", "time": 1547769109171, "rating": 5.0, "text": "Great to work with you guys--Thanks", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "100126249707916949771", "name": "Linda Holcomb", "time": 1424988484073, "rating": 5.0, "text": "I visited Tom Williams Audi web site looking for an Audi A5 Cabriolet.  I found one and hit the Save This Car button.  Anna Ethridge emailed me and follow-up with a call right away.  My husband and I drove from Decatur, AL to Tom Williams to look and drive the A5.  We decided that we wanted a different color interior which they did not have on the lot.  Anna and Steve Huett patiently look for an A5 at different dealers to match the color we wanted but couldn’t find a car.  They then help us put a car together that we wanted and order the car from the factory.  Over the 3 months that it took to get the Audi from Germany Anna was in constant communication, very knowledgeable and a complete pleasure to work with.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "113893479368236428296", "name": "Matt Kellum", "time": 1415025612571, "rating": 5.0, "text": "Mike Wilson and his team are exceptional and helped me get the car I wanted at a great price! I would highly recommend this dealership to anyone looking for a great car, new or used.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "117786580482837820075", "name": "Melodi Shephard", "time": 1498130120328, "rating": 5.0, "text": "Robben and Sam did an overtop job in helping us with our Porsche. Friendly and courteous while also providing a fantastic individualized service.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "113160228098952898313", "name": "Casie Coggin", "time": 1375718601883, "rating": 5.0, "text": "We recently purchased a car with the help of Mark Colvin.  Mark was very professional, helpful and honest.  This was the easiest, no pressure car buying experience we've ever had.  We highly recommend Mark Colvin and the rest of the crew at Tom Williams Porsche Audi.  They will take good care of you and do all they can to make your car buying experience a pleasant one!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "108165976070041363648", "name": "Glenn McPhillips", "time": 1483110436643, "rating": 5.0, "text": "Fast friendly and thorough pre-buy inspection.  They were very pleasant to deal with.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "112940863019143203156", "name": "John Huber", "time": 1485485797820, "rating": 5.0, "text": "Service is professional and efficient.  Above and beyond expectations.  Tracy explains all services down to the last detail.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "114188529058766438610", "name": "mike callahan", "time": 1528647276702, "rating": 4.0, "text": "Trey is awesome! Put my radio on Osteen who gave me the message I needed to hear! Amen!!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "115245478144121393845", "name": "The Power of Choice", "time": 1559654635533, "rating": 5.0, "text": "Corey was the best sales person", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "114380375105271566682", "name": "Paul Elwyn", "time": 1489770199720, "rating": 5.0, "text": "Excellent service beyond our expectations! Robben provided a new Porsche loaner when our replacement tire could not be delivered until the next day.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "116244718000221580379", "name": "T Borton", "time": 1520601318571, "rating": 5.0, "text": "My service advisor, Robben Tinsley, did a great job for me when I had my Porsche Macan S serviced. He arranged a loaner vehicle so I coul work while the car was serviced, got me a convenient appointment time promptly, save some items I left in the loaner vehicle when I returned it, and was professional, cheerful, and efficient throughout the experience. Bravo service experience all the way. Best Porsche service experience I’ve had", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "106801224526570824212", "name": "Stan Holland", "time": 1491915638648, "rating": 5.0, "text": "Absolutely wonderful service from Mr. Robben Tindle and his technicians. I had to tow my Porsche to Birmingham and upon arrival, he scheduled my service in the middle of the day. The service was thorough and he was prompt in notifying me of the status and made solid recommendations. After living in the north and being new to the area, his personal touch made me and my wife feel welcomed and treated us with dignity and respect. The icing on the cake was knowing that the dealership does an incredible job hiring veterans of the armed services. As retired Army officer, it was great to talk and share experiences with another veteran. I look forward to my next visit. They were not able to clean my car due to the lateness of the hour, but I was invited to stop by when in the area to get it done. Kudos to Mr. Tindle and his team!!!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "110157955294898220958", "name": "David Stopak", "time": 1470230495631, "rating": 5.0, "text": "The service rep, Lee was very personable and listening to my needs and concerns. The whole process was smooth and preformed quickly.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "105498304842866094047", "name": "Adriann Stone", "time": 1419650853607, "rating": 5.0, "text": "I had been looking for a nice luxury SUV for over 5 months.  I had test driven just about everything on the market and nothing was \"the one\". On a whim, my husband and I visited Tom Williams Porsche so I could test drive the Audi Q5. We were immediately greeted by Mark Colvin who took great care of us and made the test drive one of the most pleasurable I had ever experienced!  As soon as I started the ignition and backed out of the parking lot, I knew I had indeed found \"The one\", Once I decided on the color and options, Samuel Fuller assisted us with the financial negotiation.  Although we never buy a car on the first day, we took a chance and haven't regretted it.\nBoth gentlemen made us feel like our business was a priority and we never felt pressure to purchase.  I am so excited to be a part of the Audi family and I look forward to being a repeat customer of Tom Williams Porsche.  I will definitely recommend them to my friends and family!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "111463805018491905073", "name": "Francois Braine-Bonnaire", "time": 1522418194167, "rating": 5.0, "text": "I was very satisfied with my experience with Tom Williams Porsche in Birmingham. When needed, ask for the Service Specialist: Robben Tindle, he's really great.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "105800903560519478408", "name": "Joseph Nabors", "time": 1429753761710, "rating": 5.0, "text": "Absolutely love everyone there. They are always very professional and courteous.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "114201998400900254055", "name": "Justin Boyd", "time": 1459896090114, "rating": 1.0, "text": "Disappointed - Had them do an inspection for me before I purchased a 2014 A6 TDI that I was paying cash for. The car passed the inspection with flying colors and so I purchased at the agreed price. After hearing a knock in the passenger front wheel area over the next few days, I took it to my local shop. They were immediately able to confirmed my fear that the strut on that wheel was completely bent and needed to be replaced to the tune of $1495. My new car that I had for 3 days now needed a repair because of something that should have been found. When I called to ask how this would be handled, I was told that I needed to talk to the manager. Two weeks later, I have still not received a call back.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "107542737244174009444", "name": "Ted Powell", "time": 1428954323426, "rating": 5.0, "text": "Hannah made the car buying experience an enjoyable event. I love Tom Williams!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "107404882328229533339", "name": "Clay Canedy", "time": 1490472878715, "rating": 5.0, "text": "My mothers car was totaled and Chuck Gardner took her a car she looked at on the website for a test drive. She purchased the car and Chuck went above and beyond in helping have through the transaction. I will be purchasing all my vehicles through Porsche Birmingham and Chuck Gardner.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "105003892779705161121", "name": "Dan Resnick", "time": 1399908401843, "rating": 5.0, "text": "Tom Williams Porsche employees were very helpful and walked me through every step of buying a new car.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "110086584394291664942", "name": "Preston Goldfarb", "time": 1539195598227, "rating": 5.0, "text": "The absolute best service advisors and service anywhere! Thanks", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "105124454187813409107", "name": "Jennifer van Arcken", "time": 1521421146311, "rating": 5.0, "text": "Brought car in for service at this location for first time. Visit was on a Saturday and Tracey was very helpful, pleasant and informative.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "113431818642605755513", "name": "Darryl Jones", "time": 1531308243486, "rating": 5.0, "text": "All services planned were completed as required. Professional treatment by service staff. A quality dealership all around.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "105306084374795442423", "name": "Nestor Cruda", "time": 1461028792540, "rating": 3.0, "text": "This review could really go either way depending on who experienced it. Most people might go 1 star but for the sake of transparency and benefit of the doubt I'm giving them 3 stars. Don't get me wrong I would recommend this dealership to anybody. Please read along and I'll explain why and maybe future clients/customer can learn from my experience.\nMy sales guy was Bart. And he was excellent. I'll give him 5 stars if I have to rate him alone. Make the story a little shorter, I made an offer to buy their Cayman. Was not accepted nor rejected. After a few days, the listing went down lower than what I offered.\nCalled them immediately and asked them why it was listed lower than my offer. Was told it was a mistake, which was fine by me. Some may think otherwise. The next day Bart called me telling me that they want to maintain the integrity of the company and wanted to offer my the lower listed price instead of my offer. I was ecstatic. They didn't have to do that. They could've  said, it was a mistake but they'll take my first offer. I salute them for that especially Bart who made it happen.\nNow, I sent all my info for financing so I will know what's my APR and I can decide if I'll try my bank here in Florida if I can find a lower rate before I fly to Birmingham to get the car.  Finance manager Katie called me and said my APR was 3.18%. (Btw, my credit score was 821).  I know I heard it right because I made her tell me my monthly payments and wrote it on paper.  I wanted  my monthly payment to be at 550 per month. When I asked what is the payment if I put 13k down payment, it was way lower, around 539 per month, so I asked her what if it's 12k down payment, she said it was 556 per month which is where I wanted to be. Also, I'm sure it was 3.18% because I went and try the autotrader calculator if it's accurate. Put the numbers in including tax and dealers fee and It was very close to what she told me. So I accepted it. She said she's gonna get it ready when I get there. I did not bother going to my bank since I thought 3.18% was about right basing on my research with excellent credit score (821).\nI was picked up from the airport by Lee who was a great guy. Very patient, accommodating and just a very nice person. 10 stars for him if you ask me.\nNow, the surprise, upon signing of papers. The same finance manager I talked to over the phone told me my APR was 4.18%!!! Surprise!!! I told her how did it happen? She said it's been like that. I insisted and reminded her about our conversation over the phone and she offered to take off some extras to lower the payment. So now I'm paying 562 per month with my 13k down payment without extras instead of 539 per month with extras. I could've have walked out but I flew from Florida to Alabama. Also, I gave her the benefit of the doubt that she may have type a wrong number in her computer while she was on the phone with me. Still, the difference between the two APRs is 23 dollars per month x 72 months = I lost 1,656 dollars for a simple \"mistake\". I know It's not a lot of money, but very disappointing if you're expecting something different. It could be an honest mistake. I'll let the reader decide.\nThis is a great company with excellent staffs. I  still recommended them to my friend whom after driving my Cayman want to buy one too. Although,  I advised him to make sure they send him a copy of the APR agreement before flying there so there's no \"mistake\" or surprises.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "116257375407802485088", "name": "Shandra Reece", "time": 1534794320877, "rating": 5.0, "text": "Very informative and great customer service!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "111081395573620758580", "name": "John Lyons", "time": 1386434274890, "rating": 5.0, "text": "I recently leased an Audi 6 TDI from Tom Williams Audi and could not be more pleased with my experience. Previously I had driven BMWs and old habits die hard so it shows how much the Audi folks did to help me make the decision to change \"brands\" so to speak. I can certainly strongly recommend the dealership and my salesman (Lee Goodson) to one and all.  John Lyons", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "107708678898368263580", "name": "Brian Cab", "time": 1492108407877, "rating": 1.0, "text": "I have brought a Boxter to have a transmission gear replace for the soft top, it was done but when drove the car home notice that the telescopic adjustment on the steering wheel was moving free, brougth the car back to the service dep. next morning and now they are telling me that the steering column needs to be replace, how this happend ?   The steering was working fine when I brought the car and now I got it back with a problem .  and service dep. says the steering column cost $2,000 .\nI need somebody who can help with this problem , I don't want to pay for something somebody else broke", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "104091871625578168085", "name": "Melissa Yeager", "time": 1429301718651, "rating": 1.0, "text": "We were certain that we had found the \"Perfect SUV\" via web with Tom Williams Porsche. We live 2 hours away and wanted to get as much details via phone before deciding to make the drive. While speaking with the sales manager via phone, we were assured that the vehicle was in tip top shape, excellent condition, and had been detailed, minus one small scratch on the passenger side door that they could buff out and the timing belt which hadn't been replaced (as you can tell by now, that this isn't a brand new vehicle, but it was brand new to us and our budget).  With the great phone call and all the details worked out, we were certain that this was \"The One!\" We set up an appointment and made the 2 hour road trip. We arrived on time and was told that our sales rep wasn't at work yet, so we started working with an alternate, she was pleasant.  Walking over to the vehicle, I noticed right away that this vehicle was NOT in excellent condition by any means, 3 out of the 4 rims were scuffed up pretty bad, and the 1 minor scratch had turned into 3 separate gouges on 3 different locations of the vehicle. We asked if an inspection had been performed and were assured that yes, everything worked. My husband decided to try everything out and we found that the right side blinker wasn't working. By no means was the vehicle detailed or even cleaned, gum was stuck on the side door, a sticky jam substance was on the roof lite and cd's from the previous owner were left in the glove box.  At this point I was deeply disappointed and regretted the 2 hour one way drive but I had my heart set on this particular vehicle. So, I pulled my husband aside and we agreed that if the dealership could fix those things, then we would be willing to move forward. We talked with the sales agent and she said that she completely understood and would go get the manager. During the wait, the original sales rep showed up to work and she then stated they only perform certain things because they strive to be like \"Car Max\".  At this point, I was just ready to hear what the manager said, hoping for a better outcome. The manager arrived and absolutely refused to budge on any of our requests, and basically told us that this wasn't a brand new vehicle, that they weren't doing anything. He had offered to give us $500 off for the timing belt that needed replaced which was actually a $940 part and said that we could use the money for them to buff out the rims instead but that would be it. Then proceeded to tell us that the blinker wasn't a safety issue and they would not be fixing it, nor fixing any of the gouges that were present, nor would the vehicle be cleaned. After listening to what he had to say, I gave him back the keys and we left. (I was so disappointed in not getting the car, and even more disappointed with the customer service).  Needless to say, Tom Williams Porche must only be into customers who are willing to spend the big bucks!!!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "114394819511478316378", "name": "Daniel Marchand", "time": 1422930727207, "rating": 5.0, "text": "Great dealership, bought a pre-owned car from Steve Colter, he was great, and so was the rest of the staff at the dealership. Easy transactions, full disclosure, it was the CarMax experience no haggle, low pressure.  Their waiting area is great, it's stocked with coffee, snacks, and a mini fridge of beverages (of course TV and WIFI), and they even gave my toddler a carfax fox when she was having a tantrum.\n\nI'd do business here again.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "116081884278717256333", "name": "Bennie Adams", "time": 1594839604328, "rating": 5.0, "text": "Beautiful!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "111479181537420690157", "name": "Jimmy Gullatte", "time": 1529954408936, "rating": 5.0, "text": "Had an emergency heading to Barbers with my Boxster.  Robbie and the guys in the service department went above an beyond in their efforts to get me and my wife back on the road.  Without me asking, they even gave me a new Porsche to drive till mine was ready. Made a frustrating afternoon much much better.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "111735882581537668971", "name": "Rick Smith", "time": 1441208481911, "rating": 5.0, "text": "We very recently purchased an Audi Q5 from Tom Williams Audi.  We traveled approximately 200 miles and made arrangements to stay overnight, knowing that it would take a while for us to test drive vehicles and complete the deal.  Our salesperson, Anna Ethridge, was very accommodating and VERY knowledgeable about the vehicles' features.  We weren't sure whether we wanted a 2.0, 3.0, gas burner, or TDI.  After driving 5 vehicles, we settled on the TDI.  Anna was also a very good instructor when she demonstrated using all of the Audi controls, including the Audi Connect.  She took her time, and had me press the controls as she walked me through everything.  This really helped me operate the sound system, NAV and Bluetooth on the drive home!  Very nice ride - we love it!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "117645516154246822810", "name": "Omar Zuberi", "time": 1517503496764, "rating": 5.0, "text": "Very Accomodating for my schedule.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "100049788753535251442", "name": "Thomas Gwaltney III", "time": 1476889749289, "rating": 5.0, "text": "The service department was great all a round.  I will be using them in the future for sure.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "114061255700954433684", "name": "D Leonard", "time": 1492713201564, "rating": 5.0, "text": "Awesome! Great work and great people.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "103834929625591533684", "name": "Juan Pablo Claude", "time": 1501075235413, "rating": 5.0, "text": "Friendly people, excellent service and nice cars.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "106146337618408448704", "name": "Mark G", "time": 1529839903896, "rating": 5.0, "text": "As always - thorough, professional, courteous and timely.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "104185533375826375858", "name": "Ronald Brunson", "time": 1523027556440, "rating": 5.0, "text": "Excellent.  Great car, great service visit.  Thanks.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "102873170665372484384", "name": "Kathy Nguyen", "time": 1467902871151, "rating": 1.0, "text": "I went there to gets my car oil change. Left my car there for 6hrs and realized they didn't put oil in my car. And I still pay$165. I'm so unhappy now.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "109746365796978640223", "name": "Tom Buchanan", "time": 1514465617999, "rating": 5.0, "text": "Tracy Hebert was awesome to work with.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "111709041009787724032", "name": "jimmy skinner", "time": 1539200348530, "rating": 5.0, "text": "Great people to deal with, very good service.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "104946951799757948476", "name": "Milton Jackson", "time": 1491916212451, "rating": 4.0, "text": "Very pleasant experience and courteous service.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "110513761966952745065", "name": "Bobby Phillips", "time": 1483989075171, "rating": 5.0, "text": "Great people and service!!! Highly recommend", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "105267281317928820882", "name": "DMAN", "time": 1522671012811, "rating": 5.0, "text": "Outstanding customer service!  Highly recommend!!!!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "109308168243485528775", "name": "Greg Cromeens", "time": 1492283228654, "rating": 5.0, "text": "Great service especially the service writer Robin.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "112421885836481754649", "name": "Dr. Craig Ross", "time": 1469206346829, "rating": 5.0, "text": "Outstanding service!! Friendly, quick and professional", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "101861137000159652892", "name": "Arthur Moss", "time": 1468845438694, "rating": 5.0, "text": "Great guys to work with. Very responsive and professional!!!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "106704140872867545170", "name": "Dick D Briggs Jr", "time": 1508087663309, "rating": 5.0, "text": "Good people and great service.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "105956677998371635414", "name": "Steven Ballard", "time": 1458678817373, "rating": 5.0, "text": "Porsche service has always been promt as possible and friendly. Staff continues to exhibit cordially before and after sales.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "108251284061550782257", "name": "Preston Goldfarb", "time": 1518705278725, "rating": 5.0, "text": "Always courteous and efficient!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "109619627748662167154", "name": "Chiquita Williams", "time": 1523483146520, "rating": 5.0, "text": "My husband and I purchased a Porsche Panamera from Steve. Him and the staff made sure we were taken care of.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "106766537331330768202", "name": "Barnett Lawley", "time": 1526476751773, "rating": 5.0, "text": "Perfect", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "100820500113735794057", "name": "John Copeland", "time": 1542053872148, "rating": 5.0, "text": "Great service !! Thanks!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "114267061768121841152", "name": "Gary Campbell", "time": 1508504683466, "rating": 5.0, "text": "Perfect experience", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "107923441562578070699", "name": "roger suttle", "time": 1520864600312, "rating": 3.0, "text": "Service was excellent", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "110714282774126627241", "name": "Jimmie Lay", "time": 1525866104047, "rating": 5.0, "text": "Had my car diagnosed within a couple hours.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "115221007174530180458", "name": "Cowanda Reynolds", "time": 1523833412868, "rating": 5.0, "text": "Good staff pleasant experience", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "116381757876851525941", "name": "Christy Quade", "time": 1486470899272, "rating": 5.0, "text": "Great customer service. Very friendly!!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "104304385725670600806", "name": "LaTonya Jones", "time": 1494425100171, "rating": 5.0, "text": "Promt and Professional!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "103752706806272710389", "name": "HaHa Clinton-Dix", "time": 1487442122026, "rating": 5.0, "text": "Great service!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "115572683939917867851", "name": "Stephanie Casterline", "time": 1500465823128, "rating": 5.0, "text": "Great buying experience!!!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "103427804908583257296", "name": "Ricky Ault", "time": 1496525515688, "rating": 5.0, "text": "Very nice and friendly", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "104390841832065883507", "name": "William Holcomb", "time": 1493338023044, "rating": 5.0, "text": "Prompt. Courteous.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "117748529012505073515", "name": "Patrick Bishop", "time": 1463749985368, "rating": 5.0, "text": "Excellent service, professional and complete.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "105053275025560035572", "name": "Y.T. Elliott", "time": 1467031457727, "rating": 3.0, "text": "Painless.", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "100848706702366466261", "name": "David Jordan", "time": 1393337988110, "rating": 5.0, "text": "Great dealership, they are very helpful!!!", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
{"user_id": "115813712755334225088", "name": "Jusohe2154517", "time": 1514327101050, "rating": 4.0, "text": "(Translated by Google) The treatment is very friendly, service is very fast, prices are somewhat high\n\n(Original)\nEl trato es muy amable, servicio es muy rapido, precios algo elevados", "pics": null, "resp": null, "gmap_id": "0x8889117dca6bc5eb:0x58c749fe1353fe82"}
