{"user_id": "103302182571237457246", "name": "Fine Life", "time": 1629681751188, "rating": 5.0, "text": "Best photography studio in town, very talented photographers", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNLr2H21iS0IpBDaFsZRUcJOll_znHNocZXT_Rc=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOvHQy63_PMbuxIRAuIdfnEqWOM7knKOx2miudL=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMCfzkKgrSIH1x-IjyIf6kT9xD0z6dX_OlWTSMO=w150-h150-k-no-p"]}], "resp": {"time": 1629765608155, "text": "Thank you for your business...We really enjoyed working with you and your husband.  see you next time!!"}, "gmap_id": "0x889a518511fe050d:0x9d6448855a645701"}
{"user_id": "106145229897843665742", "name": "CHARITY HOLMES", "time": 1623437178502, "rating": 5.0, "text": "Photography very patient and clean organized and on time I loved it", "pics": null, "resp": {"time": 1623441484350, "text": "Thank you for your business...we always enjoy working with kids!!"}, "gmap_id": "0x889a518511fe050d:0x9d6448855a645701"}
{"user_id": "109280153157250018264", "name": "Sandra Williams", "time": 1622146772689, "rating": 5.0, "text": "💘 the pic turn out very nice", "pics": null, "resp": {"time": 1622165290178, "text": "Thank you...we are glad you are satisfied!"}, "gmap_id": "0x889a518511fe050d:0x9d6448855a645701"}
{"user_id": "107043767545638872862", "name": "Shantavia Lutin", "time": 1606691238777, "rating": 5.0, "text": "Great Photographer, very professional. He really brought my vision to life.", "pics": null, "resp": {"time": 1623441524034, "text": "Thank you!!  we always try to capture memories that will last a lifetime."}, "gmap_id": "0x889a518511fe050d:0x9d6448855a645701"}
{"user_id": "108309053887836921783", "name": "Channel Fiend", "time": 1530488320315, "rating": 5.0, "text": "I originally found KC Photography, Graphics, & Printing on Instagram. He had a print ad up for printing Tees and business cards. I was thoroughly impressed with his end product and with the timely delivery of the Tees and Cards. Even though he had to UPS them to me, I found his pricing to be reasonable. I will be using him again for future projects.", "pics": null, "resp": {"time": 1530501938066, "text": "Hey Dax! Thank you for the kind words! Whenever you need some new tees. I've got you covered! Pun Intended!"}, "gmap_id": "0x889a518511fe050d:0x9d6448855a645701"}
{"user_id": "109497274118691947198", "name": "Crystal Reynolds", "time": 1529506825923, "rating": 5.0, "text": "KC is a quality photographer that help me grow as a photographer due to his knowledge and letting me assist him on shoots and in the studio he also does print production t-shirts and a number of other things that can help individuals like me grow their business through promotion in marketing material most of his things have a one-day turnaround or if not only a couple of hours quick convenient and professional", "pics": null, "resp": {"time": 1530501869672, "text": "Thank You for your business Crystal. I look forward to working with you again!"}, "gmap_id": "0x889a518511fe050d:0x9d6448855a645701"}
{"user_id": "114303288899056959829", "name": "Busi Gram", "time": 1530499981960, "rating": 5.0, "text": "I found him on instagram. I needed business cards really quick. I sent him my files and he printed them and UPS'd them the same day. The quality was worth the express fee.", "pics": null, "resp": {"time": 1530501989062, "text": "I really enjoyed working on your cards. I look forward to working with you again!"}, "gmap_id": "0x889a518511fe050d:0x9d6448855a645701"}
{"user_id": "104162426283436559790", "name": "Cassandra Curtis", "time": 1492948386736, "rating": 5.0, "text": "Very professional and helpful", "pics": null, "resp": {"time": 1530560502746, "text": "Thanks Mrs. Curtis....thanks for your business."}, "gmap_id": "0x889a518511fe050d:0x9d6448855a645701"}
{"user_id": "112789440330047517483", "name": "Abbie Reinsma", "time": 1628260743533, "rating": 5.0, "text": "Amy McDaniel with Dewdrops Photography is in a league of her own.  Visiting her newer studio in Olympia, WA is the best decision we could have made.  Our daughter had spent some time in the NICU and we couldn't get photo's taken until 7 weeks.  I was a little bit nervous but upon arrival Amy immediately put us at ease.  She is extremely kind and professional.  With an extensive array of props/colors she soothed our baby girl and captured brilliant moments that we will cherish forever.  You will not be disappointed!  I have not stopped raving to my friends and family and hope that she is flooded with success in Olympia.  Definitely worth every penny-they grow so fast!", "pics": null, "resp": null, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "103397979164156936158", "name": "Kati Thomas", "time": 1626887740003, "rating": 5.0, "text": "Amy was amazing she did a really great job even when my little girl got a little bit fussy she is amazing and she has such a way with newborns", "pics": null, "resp": {"time": 1626927076996, "text": "She is beautiful and I'm so honored that you allowed me to capture her at this stage of her life!"}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "116925162144719901298", "name": "Samantha Andrews", "time": 1602813076216, "rating": 5.0, "text": "Amy is incredible! We drove from Atlanta just to see her. I have followed and admired her work for years now, and when my daughter was born I knew I wanted Amy to photograph her. We arrived and Amy made us feel comfortable and at home. My daughter was fussy of course due to the long car ride, but Amy patiently soothed and comforted her and made sure she got plenty of set ups and poses. She had the studio set up so that we could get multiple props and colors in so that we have plenty of pictures to choose from. I am so glad we made the trip to Auburn— the whole experience was well worth it! Not only is her work incredible as you can see online, but the overall experience was awesome and I highly recommend hiring Amy. You will not be disappointed!", "pics": null, "resp": {"time": 1602814328843, "text": "Thank you so much! It was great to meet you and your sweet girl!"}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "116978803542919212520", "name": "tawyna evans", "time": 1612830987992, "rating": 5.0, "text": "Amy has always been my newborn photographer crush. I too am a newborn photographer and always dreamed of doing an in person workshop. When I found out she was coming to a town near me I jumped on the opportunity. SHE DID NOT DISAPPOINT! The workshop was phenomenal and my work was taken to the next level. She is a natural teacher and I promise if you do a workshop you will not be disappointed!", "pics": null, "resp": {"time": 1612840665229, "text": "Thank you so much! It was so great to meet you!"}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "106204596532949777508", "name": "Jennifer Traylor", "time": 1595538476757, "rating": 5.0, "text": "I have been a part of many Dewdrops sessions and every session has been planned out with utmost care, wonderful props, custom made headbands, outfits, etc. She is both professional and extremely pleasant and fun. Babies LOVE her! She just has an incredibly special way with babies and adults as well.\nHer images both on her social media, as well as her online proofing galleries, are exceptional. HIGHLY RECOMMEND to all my friends, family, and everyone else. She does not disappoint.\n\nAs for her mentoring classes and workshops, she is thorough, professional, fun, funny, and offers an immense wealth of knowledge both during the training and as a follow up in her online mentoring group that she generously shares in!", "pics": null, "resp": null, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "109270208353390342613", "name": "Rebecca Stoltz", "time": 1596514816252, "rating": 5.0, "text": "Hands down the best newborn photographer you can find!  Amy has done a handful of sessions for our family from a one year old session to two newborn sessions over 8 years.  We absolutely love her work.  Amy doesn’t do the same repetitive props for her sessions.  She has incredible experience and her portfolio speaks for itself.  When your husband is even excited about the session, you know it is going to be good! The amount of props, wraps, etc, Amy had our first session blew me away.  Babies don’t stay newborns long and these images are something we will cherish for decades to come. I would pay for newborn photography over and over; hiring Amy each time.  I am so thankful she captured two of my three babies. I only wish I had found her sooner for my oldest!", "pics": null, "resp": {"time": 1602814373486, "text": "Thank you so much!"}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "102229600029973372655", "name": "Kristin Dabbs", "time": 1619539171407, "rating": 5.0, "text": "Excellent! This is my second time using Dewdrops Photography for newborn pictures and I haven't been disappointed yet! 100% worth every penny!", "pics": null, "resp": null, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "111467702946800623005", "name": "Angela Moss", "time": 1595631990184, "rating": 5.0, "text": "Dewdrops Photography is the best photographer I've seen thus far. Her creativity is out of this world and her props are absolutely stunning. I will always recommend Dewdrops to anyone whether for newborn photos or family photos! Such great work", "pics": null, "resp": {"time": 1595705495506, "text": "Thank you so much!"}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "104509972069466402348", "name": "Shirah A", "time": 1596155616052, "rating": 5.0, "text": "My wife and I definitely enjoyed the photoshoot Amy did for our 1 year old daughter. She was professional, friendly, and knew exactly how to make our daughter smile. We love our pictures. Our families are fighting over pictures right now!\n\nThanks again Amy! We will see you soon.\n\n-Shi, Ty, and Baby J ❤️", "pics": null, "resp": {"time": 1596159311993, "text": "Thank you so much! I truly enjoyed meeting you and your family!"}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "113648056637315854551", "name": "Hayley Benson", "time": 1596156592524, "rating": 5.0, "text": "First of all, have you seen the pictures? What else is there to say, really? They're so sweet I have to clench my teeth every time Amy makes a FB post.\nWe did newborn photos when I was 10 days post partum, and she took so much care to make sure I was comfortable in every pose. My fresh c-section appreciated it.\nThe real actual Santa Claus comes to the studio for a couple days every Fall bc Amy's on the Nice list. I actually cried when I got the finished images, and I'm pretty sure there was magic involved.\nShe's got props and precious outfits for days. Just bring a clean baby, and stand back while she does her thing.\nAlso, have you seen the pictures??", "pics": null, "resp": {"time": 1596218001574, "text": "Awwww! You’re the best! Thank you so much!"}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "103751943584328010347", "name": "Melanie Resch", "time": 1595528583151, "rating": 5.0, "text": "Seriously the best newborn photographer in the country.  She is truly gifted at what she does and her passion and creativity show in all of her work.", "pics": null, "resp": null, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "117782907908183352182", "name": "Fatima Gilbert", "time": 1595514504220, "rating": 1.0, "text": "I would NOT recommend DewDrop Photography.  Amy McDaniel was supposedly a great children photographer.  WRONG!!  She had no creativity, no patience, no cute props, she offered nothing!!  The pictures were ok at best, absolutely nothing special, nothing a phone camera could not have captured.\n\nWe were told, as per her contract, that proofs would be sent in one week and then final selections in one week.  NO!  We had to contact her numerous times after weeks.  We never got our final pictures.  Eight pictures!!!  We got an entire wedding album in two weeks!!  So after three weeks we got a refund.\n\nAmy McDaniel is extremely unprofessional, rude, and as I stated the pictures were nothing special.  She ruined our sons first photography experience.\n\nI would NOT recommend you use Amy McDaniel at Dew Drop  photography!!!!!  You will be disappointed.", "pics": null, "resp": {"time": 1595526392223, "text": "This review is completely false. Client brought in two dogs to be photographed with her 1 year old. I was assured both dogs were under strict voice command but they weren't. We spent two hours over two days to try to get a photograph of their baby and dogs. (Session is normally 30 minutes so patience wasn't the problem.) I understand how important pets are as we have three dogs at home and we love them. I bent over backwards for this session and even added a bubble bath at the end. My studio is packed with props and outfits for babies but creativity is challenging when you spend the entire session trying to get dogs to sit. She mentions a contract but she never received a contract so I'm not sure where that is coming from. I explained the timeline to her in person and that I am visiting my parents in Washington State while my mother has a tumor from her breast removed. Her images were going to be two days later than the verbal timeline but she didn't care. I would hope that people could show a little more compassion during this time but there is no pleasing this client. I have enjoyed over a decade with amazing and repeat clients who have been an absolute pleasure to work with but I felt it was important to reply with the truth. Client was refunded immediately after realizing there was nothing that would make her happy."}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "110744950262202222923", "name": "Lauren Kelly", "time": 1535671433997, "rating": 5.0, "text": "I have admired Amy’s work for quite some time and I have been fortunate enough to attend 2 workshops of hers to date, and another later this year.  Seeing her in action is very inspiring!  She takes such care in handling new little babies and pays attention to every tiny detail—from posing to set design. She is truly the baby whisperer! (And that is the newborn session aspect of it. As a workshop attendee myself,  she is wonderful at explaining things as she goes and WHY she uses the techniques that she does.)", "pics": null, "resp": null, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "115848859906992784254", "name": "Veronica George", "time": 1538877679617, "rating": 5.0, "text": "I took Amy's newborn workshop review in July 2018. What an amazing learning experience!! She is just pure magical with the babies & a great teacher. The way she handles the babies and the parents is so professional, sweet & caring. Her teaching ability is commendable as well. She is always answering questions even though the workshop was months ago- there's no extra fee for that help. I cannot wait to work with her again next summer!", "pics": null, "resp": null, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "111895680332666534148", "name": "Jamie Clute", "time": 1539310183633, "rating": 5.0, "text": "I just went to Amy's newborn workshop in Michigan, WOW! I have gone to 3 other in person workshops before hers...AMY'S was THE BEST BY FAR! I can't put into words the amount of learning I did. Not only did we learn, but we had a fun, relaxed day too! Amy was so sweet, funny and just so down to earth! I loved meeting her! I would attend another one if I ever have the chance!", "pics": null, "resp": {"time": 1539312725973, "text": "It was my absolute pleasure!"}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "106612476218511655499", "name": "Mindy Turnbull", "time": 1537687477065, "rating": 5.0, "text": "The experience that we had with Amy has been nothing short of exceptional. She is the absolute best in the industry. I LOVE my newborn photos! Amy captured exactly what I hoped for - she has an eye for beauty and her photos are amazing. She was great with our daughter and has provided us with beautiful photos to enjoy for a lifetime.", "pics": null, "resp": null, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "115993087819399279196", "name": "Adris Ludlum", "time": 1571346254872, "rating": 5.0, "text": "Literally the best! Babies are unpredictable (at least I think, because I only have one), and Amy knows how to handle the situations that arise (my wife was pooped on). Not only that, the photos she takes are AMAZING. She is not only a pleasure to work with, she loves what she does. We will definitely use her again. Thanks Amy!", "pics": null, "resp": {"time": 1595526413822, "text": "Thank you!"}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "117012301411209038442", "name": "Tiffany", "time": 1516238152553, "rating": 5.0, "text": "BOOK HER NOW!!!!  My family was truly amazed at the poses and props Mrs. Amy nicely did during the photo shoot with our newborn. Keynotes about her: Professionalism, the utmost patience, kindness and she makes you feel at home during the shoot. I would recommend her to ANYONE in the world!!! We will be doing sessions with her in the near future. She's a God-sent Photographer!", "pics": null, "resp": null, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "113903408995569829945", "name": "J C", "time": 1536593575917, "rating": 5.0, "text": "Hands down THE BEST newborn workshop I have ever attended.  I have been in the business for about eight years and have attended several workshops around the country. None compare to what Amy taught me. She is so down to earth and forthcoming with every detail of how she shoots, poses, edits, etc. It has been a game changer for my business!!!", "pics": null, "resp": null, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "115441537189188611998", "name": "Rachel Martin", "time": 1561757983410, "rating": 5.0, "text": "I was in absolute awe at the patience, knowledge, and professionalism Amy displayed during our newborn session. Her work speaks for itself. PHENOMENAL work that I will treasure forever. Highly recommend!", "pics": null, "resp": {"time": 1561759569606, "text": "Thank you so much Rachel!"}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "105782472725714631711", "name": "Shelby Marie", "time": 1510717914500, "rating": 5.0, "text": "This lady has some serious skills. As a first-time mom, I'm highly proficient at worrying. But Amy handled my daughter with such care and caution that I felt I could place complete trust in her. She was extremely professional and quick to reply to all of my questions. During our session, she explained what she was going to do so that my mind would be at ease. I'm so grateful I got the opportunity to work with her. Thank you so much Mrs. Amy!", "pics": null, "resp": {"time": 1510719888833, "text": "Thank you so much Shelby!"}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "100901846598733776252", "name": "Chaya Braun", "time": 1534734525467, "rating": 5.0, "text": "Amy McDaniels is an incredible newborn photographer!  I traveled to Auburn, Alabama from Baltimore, MD for 2 days to learn from her.  She was so patient with me, and guided me to perfect the baby's posing, all the while asking me what it was that I wanted to learn next.  She had 2 baby models at the studio at all times, to maximize our learning, in case one baby was fussy or needed a break to eat.  Amy's art is so beautiful, and I'm so grateful to have had this opportunity to learn from one of the most skilled newborn photographers in the world!", "pics": null, "resp": null, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "106803708287907521046", "name": "C'est l'Amour Photography", "time": 1462193789411, "rating": 5.0, "text": "Amy is a fantastic photographer and mentor! Her attention to detail is what sets her apart. I took her workshop last summer and it's because of her, my confidence has grown. I am so thankful I have met her! I wished I lived closer so she could capture my future babies. Thank you Amy for blessing me and so many others with your God given talent xo", "pics": null, "resp": {"time": 1510718943264, "text": "Thank you so much!"}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "112449817518640858431", "name": "Vera Davis", "time": 1538916821367, "rating": 5.0, "text": "Amy's newborn workshop for photographers was amazing, I am so grateful to have had the opportunity to learn from her. I learned so much and very much appreciate her straightforward manner and fun personality!! Definitely recommend working with her if you have the chance!", "pics": null, "resp": null, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "115431647568050634084", "name": "Amber Robinson", "time": 1492003030059, "rating": 5.0, "text": "Amy is absolutely wonderful. That doesn't even begin to describe our experience with her. The care and love she shows in her work is so evident while she was working with our newborn. I was in awe at how she calmed him & the images she captured brings tears to my eyes. I was so thankful we were able to have Amy as our photographer, those newborn days go by SO fast, and this being baby number 4, I knew I needed a skilled photographer. I cannot thank Amy enough for the moments she froze in time for us. His sweet peachfuzz and flaky skin are already gone at 3 weeks old, but I will always be able to look back in sharp clarity at my precious 7 day old baby. She is the best, and obviously I would recommend her. I will no doubt be using her again & cannot wait!", "pics": null, "resp": null, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "110207290464368748819", "name": "Heather Gappi", "time": 1539054619075, "rating": 5.0, "text": "I just want to say I have taken so many classes  and I have never felt like I’ve got my moneys worth until yesterday. Thank you so much Amy, you are truly amazing and talented. You allowed us to be involved and gave us so much knowledge along the way. You have inspired me and I cannot wait to try out some of the new poses I have learned from you.  If you ever decide to come back to Michigan please let me know!!\n\nAmy Pearsall McDaniel", "pics": null, "resp": null, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "100229886638419576063", "name": "Stacey Houston", "time": 1567222347945, "rating": 5.0, "text": "Im not one to typically leave a review - however I’m just getting settled from a two day Newborn/ Family workshop with Krystal Sandefur & Amy McDaniel in Milwaukee Wi. As I’m taking a moment to reflect on the last 48 hours. To say I’ve been blown away would be an absolute understatement . If you can secure a seat-  I can’t recommend this joint workshop enough! They will not disappoint. Their joint process and workflow will change your routine for the better- having both of these ladies teach in one room is a complete LUXURY.\n\n- I have attended several well known workshops in the past this is one for the top of the charts.\nAmys brings her wealth of newborn  knowledge,  experience and safety training to a new level. Covering each pose piece by piece.\n\nKrystals unique approach to posing families allows you to seamlessly and effortlessly capture those real life personalities with out the pressure of being in front of a photographer\n\nI walked away feeling inspired and refueled- my recent loss of passion has a new spark.\n\nBoth Krystal And Amy are extremely informative and their method of delivery was easy to receive from all attendees at every experience level.", "pics": null, "resp": {"time": 1567255065806, "text": "Oh girl thank you so much!!!"}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "107832010128393218070", "name": "Heidi Weinmann", "time": 1535667592458, "rating": 5.0, "text": "I don't think there are enough words to adequately explain how amazing Amy is! I am so thankful for the opportunity I have had to work with her and I look forward to seeing her again in the future!", "pics": null, "resp": {"time": 1535674101970, "text": "Thank you! It was my absolute pleasure and I can't wait to see you in November!"}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "100489083754804520652", "name": "Lori Booth", "time": 1567274748219, "rating": 5.0, "text": "Amazing experience at the Milwaukee Workshop!  Great at what she does for sure!", "pics": null, "resp": null, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "104874322455733504688", "name": "Juliana Rodrigues", "time": 1538876226898, "rating": 5.0, "text": "I attended to Amy’s newborn photography workshop and it was life changing ! I learned so much , my confidence improved tremendously! This was one of the best investments I make in my business!", "pics": null, "resp": null, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "105235107078474495421", "name": "Karl Antoine", "time": 1561602147724, "rating": 1.0, "text": "This individual is not professional at all. I contacted her over two months before my baby would arrive, to see if scheduling would work for a newborn shoot. She responded with an email of her package pricing and the services provided. My wife and I felt we could work with her, so I replied letting her know the package we wanted, and if she would be able to also do the maternity shoot for my wife. I made attempts to contact her via phone for a conversation to fully understand her process, and communicate what we were looking for. Getting her on the phone was nearly impossible. The failed attempts were due to her workshop held in Canada in late April. I made additional calls, with no success, and no capability of leaving a voicemail, as hers was full. My only other option was to send another email. She replied a few days later in between her workshop with one available day in May for the maternity shoot. She did say it would be difficult to fit my wife in for the maternity, but would try. My wife and I initially agreed to the date, and Amy sent an email with an invoice. Throughout this whole interaction, no phone conversation took place. I paid for the maternity shoot in full since the date was about 3 weeks out, and placed a deposit for the newborn shoot. I did this to make sure we could get on her calendar, despite still not talking with her. After I paid her, I still was not able to make contact to coordinate the maternity shoot. I also made her aware that we live in the metro Atlanta area, and would be driving to her. Due to the lack of communication, and not being familiar with the Auburn area, her studio, caused my wife and I to cancel. Again, not being able to get her on the phone to communicate this, I texted her to about a week and a half prior to the maternity shoot to cancel. I asked if the balance I paid could be moved to a larger newborn package, and she was pleased to do so. Fast forward to June 14, I contacted her to let her know the exact date our baby would be born, understanding that we would finally have a phone conversation. Still no success on that front. She responds with one date for the newborn shoot that did not work for my wife and I. I then asked if she would be able to do the shoot on a different day, and that too did not work for my wife and I. It wasn't until I sent her an email letting her know I wanted to cancel everything was when we finally spoke on the phone. I let her know I wanted all my money back and explained the reasons why. She offered no apology, no option, only another date, that still did not work. Her only response was to take it up with PayPal, so I did. I never write reviews of this length, or do review at all, but Amy brought this on herself. She texted me 3:50 AM, then again at 5:03 AM, clearly upset about the outcome of the PayPal dispute. If she did not decide to harass me, and move on, I would have done so as well. There is always 2 sides to a story. I disclosed everything to PayPal, also citing that I was not provided any contract, offered three dates, that did not work, and minimal communication from Amy. Writing all of this took time I did not want to give do so, but having worked with multiple business owners and professionals from different industries, Amy lacks attributes of a business owner. Primarily that of being ethical. Doing research provided me insight on what Amy's true passion is, and that is holding workshops. He lack of availability is due to the abundance of workshops she is scheduled to hold. If she disclosed this material information to me from the very beginning, I would have made the decision to work with her or not. There are so many workshops planned for the remainder of this year, as well as 2020, both domestically and internationally. It's also clear that workshops are her passion, when 100% of her positive 5 star reviews are from workshop attendees. Amy I truly hope you use this as a learning opportunity to improve your business model, and just stick to doing workshops, or fully disclose how you work.", "pics": null, "resp": {"time": 1561641320879, "text": "This gentleman sent red flags from the very beginning so having a phone conversation with him was definitely out of the question. I knew I needed a paper trail to have proof of our conversations via email and text messages. I’m so grateful I have the documents that I’ve sent to PayPal. I was more than professional and when he cancelled his maternity session I was more than happy to let him transfer that money to his newborn session. This is after sending pictures of all of my maternity gowns and giving him several dates for his maternity session. They simply didn’t want to make the trip to Auburn. I was more than flexible by giving him 3 available dates for the newborn session. Baby hasn’t even been born yet! His assumptions about workshops are false. My family will be on vacation on the exact date that he wanted which is why I always advise my clients that we both remain flexible because we never know when babies are going to make their appearance into the world. My passions are my own family and newborn photography.  Workshops are how I put food on the table. I’m so glad I didn’t speak to this guy in the beginning because I wouldn’t have all the documentation of our many emails and text messages to prove how above and beyond I went for him. This scammer did get a full refund but because of the documents I sent, PayPal covered my expenses. I have a feeling this guy is very familiar with ripping people off."}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "116036768015559934782", "name": "Betty McGillis", "time": 1461444107151, "rating": 5.0, "text": "I've done a newborn workshop with Amy, she is a gifted prefessional..beyond talented.. I cannot thank her enough for sharing her gift with other newborn photographer's like myself. My business has thrived since doing the workshop, thank you Amy..", "pics": null, "resp": {"time": 1510718929748, "text": "Thank you so much Miss Betty!"}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "116644915025050584605", "name": "JR S", "time": 1433797794673, "rating": 1.0, "text": "I'm sure she'll send the National Reserve out to find me for writing what I endured. I tried contacting this photographer before my daughter was born and she never returned my phone call or writing via Facebook. I didn't like how I was treated- she acts like everyone else in this rotten town- treats people like money bags than a breathing and valuable human being.", "pics": null, "resp": {"time": 1433800671482, "text": "Congratulations on your new arrival but I don't think you actually tried contacting me.This is the strangest thing I've ever read! I'm sorry for what you've \"endured\" by me not replying to you. How can I treat you like anything if I never actually spoke to you?"}, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "109098625208237991923", "name": "Лена Леденцова", "time": 1548840048158, "rating": 5.0, "text": "Very beautiful Job", "pics": null, "resp": null, "gmap_id": "0x888c93385490d5e9:0x32ec6f64678e0c93"}
{"user_id": "108078237682843775728", "name": "Jeff Harper", "time": 1539038382176, "rating": 5.0, "text": "Professional but personable service. Ken really cares about his craft and it shows.", "pics": null, "resp": null, "gmap_id": "0x89ac61cc619093f3:0x607fca2e4f5af854"}
{"user_id": "112408454097468725414", "name": "Lashandra D", "time": 1511581955061, "rating": 2.0, "text": "So I would have gave three stars but I called earlier Today to see if I could change my appointment to a later time and was told No. We arrived on time with about 5 mins to spare to walk in with two families still taking pictures and another family waiting ahead of us to take pictures. Our appointment time was at 6:30pm but we didn’t take pictures to until an hour later. If I was told when I called at 2:30 yes then it would’ve eliminated us sitting around for an hour. The time management or lack there of  was a big issue for me. When we did start taking pictures I think our photographer name was Josh, he was good. Our youngest just wasn’t getting it right but he worked with him. The furniture in the waiting area could use a shampoo. The bathrooms/dressing room was clean. With it being an portrait studio an additional mirror in the sitting area or hallway would be nice to make last minute adjustments.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPjyqdY33TR5Vlm8vKSIRUzt1ALUuo_dUR430sA=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPqKYouYlMinLvfyRabL9kUVjpOY24mRFo2UwqF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPtIsHfwHVJffCh9K2xflRkVECYTleenNiggQ67=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN7D9xPiXuU8KS8eY46PbEpqsQc5d3qvuKmk7Py=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOvVFUHmCJc6eYlf4S9pk4dZcbNCx9NyKU4wjRm=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "113359488662814657667", "name": "Robert C", "time": 1533352220359, "rating": 4.0, "text": "I'm a seasoned portrait innovations customer, so here's an honest review. Most of the one star reviews below have to do with making an appointment, do yourself a favor and NEVER make an online appointment with them. Always call to make an appointment and make sure you request a specific photographer so you know you have a good one. We called today and made appointment with Amber at noon and when we showed up we got started immediately. We have made online appointments in the past and they never work out well; long waits, poor service. Amber has been great with our kids and she takes fantastic photos.\n\nAlso know going in you have to take like 100 photos, and it takes an hour to an hour and 1/2. this was very frustrating for me in the beginning especially if we only wanted one photo, but as long as you know beforehand you can plan for it.\n\nAs far as the facility goes, they have a play area for children, clean restrooms, great scene changes / props / background, and it's air-conditioned. If you're thinking to yourself you will just use competition in the area, there's not much. A lot of photographers want to take outdoor pictures which can be very hot and only one scene.\n\nWe bought a rather big package today and it was about $350.. Ouch! So lastly let's talk about pricing strategy. The cheapest way to go is get a single photo for about $20, which comes with about 35 prints (one pose). Not a bad deal and your pretty much guaranteed to get a great picture because you'll have like 100 to choose from. The catch is there's 100 professional photos of your family and you're bound to like more than one. So to get the most bang for your buck, I recommend the very first package that gets you all the digital prints. I believe it's the package with 6 poses + ALL the digital ones and it's around $70. Get home and post all those photos to Facebook and you'll know you made the right choice.\n\nOnce you pay, all your pictures are printed and ready to pick up in about 20 minutes. Same day service is a huge bonus! Specialty items however do take a few days (books, calendars, canvas).\n\nFour stars because there are some real shortcomings here, however if you go in with a strategy, you will definitely end up with frame worthy pictures that will make you smile for a long time to come.\n\n--> If you found this review helpful please give it a like!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPc6plN6DpWDIoHlmlRv2EAZITkZabf9Ybw4wVT=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNhpJ6KMthBqfr9HVTCQqj-Rj4eeH-6mTgyM79d=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOHs0_PV1Gctz345AFbgZIKFNhAAQ33oCG7ojGD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOaXLfgsiBrm02DfC_qJXfzX5LkbclJ9cJ0Qma1=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM2F4u_xOMh9bYF1qOoHvpO-M2EBWNpN4hhc-UL=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOGwFLnczKFpUdZCSgNa4QPriOixtO0j1tet04g=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOqdPW96QvP9--4nKIcub34KVsWZyESDnMAcfc2=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM3zTGVHOoQ3h8OYRzGqcHUOf3KtyG0P61j3Iuv=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "108236684327385804601", "name": "Jeremiah Bradford", "time": 1562340934655, "rating": 4.0, "text": "Love our pictures! The service was great even though they were short on staff the day of. However, the pricing was very expensive. We were not expecting to pay the amount we did with the number of  poses we chose. Besides the pricing being able to get printouts the same day was great! We would go back when they have a good sale or if we need a specific picture/print!", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "118330609690430672782", "name": "Heather Wilson", "time": 1563327775251, "rating": 5.0, "text": "I made a mistake on the day of my appointment by going in at the time I thought it was.  Turns out my appointment was earlier that morning.  They still let me keep an appointment and fit me right on in.  I was very happy to be able to have my son's graduation picture made, and they looked great.  The staff was very nice and professional.", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "116418526036756046664", "name": "Deidra J", "time": 1576594080218, "rating": 1.0, "text": "Got my daughters pictures taken with her cousin the man did not tell us that if we do the pictures together we can’t keep them. We wanted to get 2 of the 29.99 package with the canvas. Ended up losing all the pictures because of this except for 1. He also did not tell us that this package does not come with the online account to access the pictures. The pictures didn’t even look professional. It also does not state anywhere that when you get the canvas you have to pay for shipping of the canvas! They tell you that at the end! I will never go to portrait innovations again. There are plenty of local photographers with better backgrounds and better packages.", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "116043469987633343533", "name": "Bri Pena", "time": 1576777050273, "rating": 1.0, "text": "We waited until an hour after our appointment time and they still had not taken us back. We ended up just leaving and not having our pictures done. We did not even receive an apology. Just don't waste your time!", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "105407797836779026233", "name": "Deedrik J 2015 Smith", "time": 1551331931978, "rating": 5.0, "text": "Prompt. Great pictures. Good with kids. Prices are high but the pictures are too good to leave behind. Went to spend $14.99 for Valentine's Day special and spent $300. Yep, he got me good.", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "101797080517987905807", "name": "Manners 62", "time": 1562089257859, "rating": 2.0, "text": "I took my family up for Christmas pictures. I booked online & expected a wait because of the holiday's....just not a 2 1/2 hours wait. There wasn't much seating due to the staff getting so behind. We were rushed during pictures and ultimately I chose the very bare minimum because I was so unsatisfied with how they came out. I would rate this a 1 star but since it was the holidays and I know how busy that time can get so I'm being understanding. They also print the pictures right there for you in less than 30 minutes so that's a bonus.", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "107387594232032897281", "name": "Jazzy Caprice", "time": 1556981822503, "rating": 3.0, "text": "I didn't really like my experience at this location. I feel like they could have been better and more energetic. I have only used Portrait Innovation twice for my baby. The first time was in Pensacola and I had a great experience. Then this time I used the Montgomery location. They seemed frustrated and not so patient. My baby didn't do so well with those types of vibes. He has been getting pictures done since he was born and has always done great. The staff kept saying that they were short handed but that doesn't mean they couldn't be more friendly/upbeat!  People kept coming in talking about their pictures. Heck, I didn't even get greeted at first. Then the lady said the photographer will be back (I had an appointment) and then she just magically said she will take the pictures. By that time of waiting my baby had got hungry again. The girl there wasn't knowledgeable about the sales and the manager kept having to leave me to help her, he yawned the whole time while I picked my pictures and my book does not look great. It is full of pictures I didn't want in the book. I was just thinking maybe it was a bad day for them and I just paid for a bunch of pictures I didn't really like at all; I went back to pick up my child's book and it was the same vibes (low energy,not really concerned and feeling rushed). I actually got his Easter pictures redone with another company.", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "110178422610320601245", "name": "Jenn Pierre", "time": 1547420816298, "rating": 3.0, "text": "I booked online for Christmas and was not prepared for the wait to be so long. We loved the photos we got and the photographers were very friendly. I only gave 3 stars because the company needs to change its method of booking appointments. If you have to wait 2-3 hours you may as well just take walk in appointments only.", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "111812437989372538699", "name": "Telease Ellison", "time": 1514774622274, "rating": 1.0, "text": "I wish I could give a zero because this place doesn't deserve one star. We were on time still had to wait nearly an hour the photographer Amber was very rude and has no business working with small children she talk to my four year old granddaughter as if she was not a small child. I wish I had read these  reviews first I would never have come to this business. If you're looking for great customers service and a friendly atmosphere you better keep looking cause this not it . Just  rude for no reason. I want be back", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "112657508146337754165", "name": "Jasmine Conner", "time": 1577157670005, "rating": 5.0, "text": "Someone paid for my pictures for me but unbeknownst to me, they didn’t pay for them all so I began irate & started going off. That was until Joshua G. (the photographer/associate) calmed me down & assisted me with correcting my issue. He was very professional, understanding & helpful. We need more ppl like him for ppl like me. Lol. I’ll recommend him to everyone I know! Thanks Joshua G.", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "111919553249895842533", "name": "Cynthia Allen", "time": 1515280696439, "rating": 1.0, "text": "We arrived for our appointment and had to wait for almost 2 hours to get our pictures taken. Then we had to wait to wait another 1 1/2 to go through our pictures and pick our package. If they know they are going to have large groups that take more time, they should book two appointment time slots for them. At one point there was 7 families waiting for either pictures or packaging. We only stayed because we were already late on getting the pictures done and we didn’t want to wait again the next weekend. I miss JCPenney Portraits!!", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "106050293408322016131", "name": "Meredith Duke", "time": 1544042076379, "rating": 3.0, "text": "Let me start by saying that the pictures came out great! That is the ONLY reason why I am giving this place 3 stars. We have been here before. 5 years ago actually & our prior experience was wonderful. The Caucasian lady with short dirty blonde hair & glasses was extremely impatient & rude. I made a comment saying \"I like this picture, but do not like the lighting but I like this one.\" Her reply, \"Cameras have lights! That's normal.\" Her tone was very condescending. When we were doing our newborn photos we asked what other pose options we had as far as poses, backgrounds, seats, etc & her reply \"You mean besides what all I've already done?\" \"NOTHING\". I've never been treated like that before. I honestly wanted to leave, but since my mother in law was paying for the portraits I did not want to cause a fuss. I had my father in law & mother in law with me & my 2 children & we all felt the same way that she was very rude. We did ask for different poses, etc but in my opinion when you are spending your hard earned money somewhere then it's the businesses job to uphold at least a customer service professional attitude. That definitely was lost during our experience. They may have gotten money from our visit this time, but we will not be returning.", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "101809631944670347209", "name": "alise ellis", "time": 1514074474408, "rating": 1.0, "text": "There’s no point in scheduling an appointment because it’s unbelievably packed out. Really ridiculous. Won’t be back. Hopefully y’all won’t waste your time there and will find another place to go.", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "117122779814937254946", "name": "Natasha Moorer", "time": 1557419682911, "rating": 5.0, "text": "The staff was very professional and did an excellent job. My portraits turned out gorgeous.", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "115831036122771209497", "name": "Adam Quates", "time": 1493576884432, "rating": 1.0, "text": "If you want pictures taken the way you want good luck \"protocol\" says they have to take random poses and lots of shots... we came just to get some pictures taken for mothers day of my wife and two kids and we were very dissatisfied didn't get what we wanted would give no star but that's not an option...will never go back", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "104538720787419223468", "name": "Clay Copeland", "time": 1483554856165, "rating": 5.0, "text": "The manager Josh stopped what he was doing to help me. This kind of service is respectful and he cares about keeping his customers happy. 5 STARS!!", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "100413869539870656648", "name": "Melony Lawson", "time": 1555715596519, "rating": 5.0, "text": "I loved my baby pictures n josh was good with her", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "112320499601022675011", "name": "Julius Whatley", "time": 1555004553041, "rating": 5.0, "text": "Great customer service and my wife just love her maternity photos", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "108222324389430227109", "name": "Tim Evans", "time": 1550722428143, "rating": 5.0, "text": "Me and My Husband enjoyed Amber and Melody,They were very patience with our 7mths.daughter, they went above and beyond to make sure we were satisfied with our\nportraits, we highly recommend them to anyone,if we could rate them a 10 we\ndefinitely would", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "116719849216125958588", "name": "Courtney Myers", "time": 1511621680860, "rating": 1.0, "text": "If I could do 0 I would. This is misrepresentation from beginning to end. They lied about everything,  the wait time, the pricing, your ability to purchase additional pictures later. I have lost irreplaceable memories. I will NEVER NEVER NEVER NEVER go there again. I called corporate and was offered $25 credit like I would ever use it.", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "118090528673441354417", "name": "Javorace Jackson", "time": 1555947772988, "rating": 5.0, "text": "I loved the staff and how cooperative they were with my twins and I loved the pictures thanks again I reccomend them to anyone", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "109475058010271547472", "name": "KimKay C.", "time": 1549987063753, "rating": 5.0, "text": "Recently went this past Sunday & Josh was amazing. My daughter never cooperates with photos but this session was breath taking.", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "102403927701977271750", "name": "La'Toya Jessica Smith", "time": 1546458458707, "rating": 1.0, "text": "I am disgusted with my experience...I get it was holiday time, and they over booked to get sells from their promotions, but they are unprofessional when it comes to satisfying customers...they are short on staff, they watch you come in, and don't address you, they don't get to you in a timely manner, they talk reckless, they don't fully explain where the extra fees come from, they make you think you're getting a deal when you're really not, they make you go through the entire different packages which is time consuming when you yell them up front what you want, they scam you into paying more than what you intend to, etc...my order came with an ornament, and mug...they never called, nor sent an email to inform me when the products arrived; I go back to check to see if they arrive...had to wait forever, I was brushed off by 1 on the employees heading out of the door, and was approached with an attitude by the 1 who had to come assist me...she got smart asking if I received an email; I told her I didn't receive an email, but was told when it would arrive, she then saw that only the mug came in, and not the ornament...luckily I took a look at before departing the premises...both objects from what I had seen on display were extremely small as to why I cringed a bit, but not only that the quality of the photo on the mug was distorted...I sent my boyfriend back in to address the concern, but I had to go back in myself after I calmed down a bit to see what was being said, as I walk back in, the same girl that waited on me says well what's wrong with it; looking at the display, and my mug as if she didn't see what the issue was, then calls for backup, an Lord behold it's the one that took the pictures, who was giving the worst attitude to people the day of the shoot, and as the girl was telling her what the issue was, she was acting as if she was just over the whole situation, and the photographer was like yeah whomever took the photo cropped it to close...\"well hello, it was you\"...smh; I was asked to write down my contact, and address info so that the remake could be sent to my home...I have been calling the studio, and I can't get through...I still have received an email, or anything...at this point; I would just like a refund!!!!", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "118116328668599807162", "name": "MP3 STUDIO", "time": 1464392096662, "rating": 5.0, "text": "To all of the men, women and children that have experienced a session at any Portrait Innovations, allow me to give you the run down of the operation. As a former employee of PI, I can honestly tell you that EVERY employee is aware of your issues and can DO NOTHING ABOUT IT. Yes.... they know that they are overbooked but they can't tell you they are or they'll lose their job. They are overbooked because half of the appointments are made from a call center. True...Its wrong but let's be real. If you have a large group, you can't possibly expect to walk in and out in 30 minutes.It takes that long to look at the pictures. Here's another something about the employees that most of you aren't aware of. Keeping their job is based on their SALES average which has to stay higher than $110. This is something to take into consideration when you only show up to spend $15. Please don't mistake that they do appreciate your business but having session after session spending only the bare minimum means their SALES AVERAGE is well below $110 and now they may not have a job next week. THINK ABOUT IT! How often have you stepped into one and seen a new face or your favorite photographer is gone. That would be why. Them trying to force pictures and products on you is them fighting to keep their jobs....That's the only reward that they get for selling $600 in photos. NO PRIZE.....NO PAT ON THE BACK....JUST  ANOTHER  STRESSFUL WEEK OF FIGHTING TO PAY YOUR BILLS. Yes... they can play with you kids, make them laugh, and get that perfect picture but believe me when  I say that they are stressed out. So please, coming from someone who has been in their shoes, be patient and understanding. They are just a small part of cooperate America... the little guys that take ALL of the blame but has no power to change any of it.", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "117661596148615800398", "name": "Kinda Cannon", "time": 1550163808856, "rating": 5.0, "text": "Thanks amber for always doing a great job with my baby pictures!!", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "104380223800264331425", "name": "Sinda Jones", "time": 1555466926114, "rating": 5.0, "text": "Beautiful! The pictures are good quality.", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "101467896768729621922", "name": "Janae Lacy", "time": 1534528974499, "rating": 5.0, "text": "I always get my pictures done by them and I must say they do a excellent job with my girls and I will be returning.", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "105247990360686169320", "name": "Kathy Jones", "time": 1538097375774, "rating": 5.0, "text": "They took so many pictures to choose from and they did a wonderful job on the pictures", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "111098012736202868179", "name": "Michael Pettaway", "time": 1535470609514, "rating": 5.0, "text": "Great service and friendly and professional staff. It was a lot of fun.", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "114023746354701661676", "name": "Melodie Roy", "time": 1576867291018, "rating": 4.0, "text": "Good pictures a little behind", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "115300284545848412459", "name": "Stephney Johnson", "time": 1549292886602, "rating": 4.0, "text": "Very busy I loved my pictures", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "114387170920695629611", "name": "jessica miller", "time": 1544998910564, "rating": 1.0, "text": "My first experience was pretty good then the next was okay and the last was terrible. Will not be returning. Made an appointment, they said they gave it to someone else because I never answered my phone to verify even though I text AND email verified. I still showed up 20 min before appt but didn't bother to mention we had been removed from list. Then when I complained the photographer, a black man with glasses, totally checked out and didn't care at all. Didn't try to get posses, didn't do different backgrounds, nothing! It was the worst. Will never return and let everyone I know about it.", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "100434278783476251209", "name": "Judy Reeves", "time": 1542291830329, "rating": 5.0, "text": "Great experience and photographer was so patient and professional.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO-U1hFDZ9LJpn7YHP27NuDBlt_GDxwtDn3Q8X1=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "103652720900295706657", "name": "Teshawnia Phillips", "time": 1450196277113, "rating": 2.0, "text": "Ok I had an appt for 4:20 a member from my party was on time and told them we'll be a little late once I arrived it was 4:25. And the place was packed , standing room only. I still had some members coming and they were backed up. So an hour later we were asked were we ready? I said yes and continued to wait for another hour. My mom asked when we would take our pictures and they said since the whole party wasn't there at the same time we were bumped to the bottom. EVEN THOUGH THEY WERE OVER BOOKED ! After waiting those 2 hours we finally got to take our pictures and I hated it. The photographer was not personal at all , she said turn this way turn that way do this do that. Not asking what I wanted or what I may like. She was very snappy pushy when we were picking our pictures. That was my first time there and I was lost she knew that and continued to talk fast like I knew everything. My pictures was for my birthday and my experience sucked. It put a damper on my day to be honest. From the looks of reviews the time situation is ridiculous and customer service needs major improvement. I wouldn't go back if you payed me.", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "100599125632549809777", "name": "Diamond Bright", "time": 1525839596842, "rating": 1.0, "text": "I took my pictures on a Saturday usually they will give it back on the same day. I spent $357 on these pictures and still didn’t receive my pictures and it’s currently Tuesday I want a damn refund......", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "112369861063062593091", "name": "Debra Stewart", "time": 1512893256182, "rating": 5.0, "text": "I have taken all of my 3 year old grandbaby's pictures here since she was 2 months old. They have a great staff.", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "117131182288823571513", "name": "Miranda Lawson", "time": 1506814252636, "rating": 1.0, "text": "My one star is for LaDaja.\n\nRIP OFF. I purchased the $19.99 fall package with free canvas and was charged nearly DOUBLE because they make you pay their shipping costs. They no longer allow you to go back and purchase photos at a later date so, if you don't spend an additional $100+, they immediately delete your photos. You can't even purchase a CD!\n\nAs far as the operation of their business goes, the girl who took my sons photos was the most polite, patient, and helpful person there. We arrived on time and had to wait an hour past our appointment time with one studio clearly available for use. The manager was extremely rude to my pre-schooler after he came to show me the prop SHE let him play with. We were notified after leaving that \"a couple\" photos were left out of our package, it was really SEVEN PAGES of photos. Our pavket had been checked before leaving because someone else's photo cards were mixed into our pictures. After the 40 minute round trip back to the store for the pictures they left out, I wasn't offered so much as discounted session for their mistakes. The woman tried to hand me the packet and walk away. I informed her of my problem and all she had to say was \"sorry\". We won't be back.", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "114843006175702055984", "name": "Shanty Melvin", "time": 1514491488407, "rating": 1.0, "text": "If I can give 0 stars and still leave a review I Would!\nArrived on time and still had to wait at least 45 mins... then when time to take photos me and my family were Rushed after waiting for 45 mins. Amber was extremely rude and impatient with my children as we had to tell her to CALM DOWN!!! First and last time . I will not RECOMMEND anyone to come to this place with terrible customer service", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "102302227863090002168", "name": "Ebony Morton", "time": 1449785686390, "rating": 4.0, "text": "Love my pictures, Amber was amazing with my boys!! Didn't get 5 stars because of the traffic..lol", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "105867726515707091397", "name": "Katerra H", "time": 1542126950818, "rating": 5.0, "text": "The photographer was very nice!", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "103970517741756719288", "name": "Carolyn Finley", "time": 1439321162310, "rating": 1.0, "text": "Had the same experience as one reviewer. Was only 10 minutes late due to a thunderstorm and having an infant in tow. Called 20 minutes ahead of appointment to let them know. The manager was rude and bumped our portrait time down to be taken after someone scheduled  after us although we arrived 30 minutes before them. Will never use this portrait studio again .", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "109102068990717840944", "name": "George Davis", "time": 1553621871925, "rating": 5.0, "text": "Great", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOWyU6D2SZ2cVU11Cu5LTADcOHANPoRCDW8FHQZ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM3EACt24NIL7_yp2yQOA3UAnsrcKwLj8AfqatM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMYMNCXG1_-VS7sseUpXv0KlLpk6KCCTxY-c4ZE=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMmhB15Zi7_yQGASK_YV3AzZQ5iSpyOcbanwAwD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNdGnWPCPsBwlEExM0spWAJOW9O-eFDLh-GTiSI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNz7ResSQdQPKQFLNDyqiWLpmieGfWT6sloYOWc=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM1QYYIqARW0qkNNAXliLCeyN4-VkrM4iXXkCFg=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOcMGTcA9_HyOQ-hxil5YLASWRjJUmVIZqc2HIq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMGDDmwEZ-c7EKnmAzVZEMpghQ8xSRn5W-1IWBD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPx6l6Tc8bHuLw9ta4w5lpgUlvwDn3i6wDWUA9-=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN6E2SCElzL2mshk-sO8Hdga5IFs32NBnUuxTUK=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOCPdhIhpbdevsoNdu9hhkfmXzKUYbSyWfSTmCU=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "112916003651138923922", "name": "Cari Lewis", "time": 1532834112552, "rating": 5.0, "text": "Takes great pics.", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "116665329249557570543", "name": "ashley smith", "time": 1549030420968, "rating": 5.0, "text": "Very helpful, great pictures", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "109303119615891502983", "name": "Frank Cartwright", "time": 1448240750287, "rating": 1.0, "text": "Will never use this place again. Had an appointment at 6:10 P.M. and got there 30min early. Our scheduled time arrives and we do not get called. Went to the lady at the front desk and she stated that they are 45min behind schedule. They didn't even let us know when we arrived.", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "101754776743483144958", "name": "Ninja's Mama", "time": 1479851564633, "rating": 1.0, "text": "Making an appointment is a total waste of time!!! Employees have NO customer service & could care less if you have other things to do! They are on the clock so don't care how long it takes for your pictures.", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "107129640623555994721", "name": "Lakeshia Gross", "time": 1555631744581, "rating": 5.0, "text": "Friendly and helpful people", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "102195347289075715795", "name": "Narkesha Milner", "time": 1522091320491, "rating": 1.0, "text": "My son’s appointment was at 12:00 noon, at 11:45am as we were pulling in to the parking lot, I received a call notifying me that their printer was down and they were unable to print my son’s pictures that day. I was really irritated because I live 45minutes away and would have to come back on a different day to pick up his pictures and that was the only reason why I chose them because part of their advertisement is same day pick up. When we walked in the studio they had about 5 other families in front of us, which irritated me even more because we were on time for my son’s appointment and when I asked the two ladies at the front desk why they were so behind and how long the wait was.  One lady pretended as if she didn’t hear me so I got louder so the other lady said an hour, which wasn’t true they were 2 hours late taking my son’s pictures and I was pissed by this time because I scheduled his appointment according to his sleep schedule and since they started so late he begin to cry because he was exhausted so we only got in a few good pictures. Their customer service was in very poor taste because even though they were not on time, they did not offer any type of discount to correct their mistake because a broken printer has nothing to do with your camera because they were still working so there was no reason they should have been 2 hours late taking my son’s pictures. Another thing, the props they use with the kids need to either be washed or thrown away and new ones need to be purchased because they looked gross. On top of that when I went back to get my son’s pictures they had ordered some of the wrong prints in the wrong sizes or not the correct prints at all so I still have to go somewhere else to have more pictures printed out which means I have to spend more money.  I am very disappointed.", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "115405314771827990009", "name": "Whitney Roberts", "time": 1483992744231, "rating": 1.0, "text": "My family and I got there at 3:30 our appointment was at 4 we didn't get to take our pictures until 6 and didn't leave until 7. They allowed people who were late and got there after us to go ahead of us. The people were extremely rude !!!!! Prices are way to high ....\nHorrible experience I'LL NEVER GO BACK 😠", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "110729045429917280441", "name": "Willa Hardamon", "time": 1545073943693, "rating": 5.0, "text": "Josh is a great photographer", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "100834825806511851946", "name": "Team girl roblox", "time": 1482094453083, "rating": 1.0, "text": "They are booking appointments for no reason. The wait time was 1 1/2 over the appointment time. Very professional...NOT!!", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "110636705696727654118", "name": "pamela knight", "time": 1567558680327, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "109634480125473316915", "name": "Deandrea Bell", "time": 1543164126917, "rating": 5.0, "text": "Amber was great!", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "107961410523736878634", "name": "Squeakyyr 4 Brown", "time": 1521941169713, "rating": 1.0, "text": "Don't waste your time nor money going...they are always 3 hours behind schedule and never take good photos...they should be closed down...", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "115810353199661815565", "name": "Natalie Blankenship", "time": 1458398013686, "rating": 1.0, "text": "The people are rude rude rude... the wait time is ridiculous....", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "112829250903574118100", "name": "Samantha Gomez", "time": 1543537211894, "rating": 5.0, "text": "Great pictures!!", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "116000324948873954502", "name": "Kenneth White", "time": 1545087097217, "rating": 3.0, "text": "Ideal place", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "110838051708865853356", "name": "Neicy Agee", "time": 1420389401217, "rating": 5.0, "text": "I like it 10045679", "pics": null, "resp": null, "gmap_id": "0x888c2c6debc5a42f:0xcab5e9c5166fba5d"}
{"user_id": "107392212385728753689", "name": "ken bubbett", "time": 1500512005926, "rating": 4.0, "text": "He is a great guy and easy to work with. His products turn out great. Prices are reasonable as well.", "pics": null, "resp": null, "gmap_id": "0x8889f98273da35f9:0xc1d9cfff6652b7c1"}
{"user_id": "118354383778389196708", "name": "Justin King", "time": 1527122164488, "rating": 5.0, "text": "The lecroys are known through out the schools and town.  Service with a family atmosphere.", "pics": null, "resp": null, "gmap_id": "0x8889f98273da35f9:0xc1d9cfff6652b7c1"}
{"user_id": "113284232153758697811", "name": "Craig LeCroy", "time": 1487644595517, "rating": 5.0, "text": "Craig and.Kim took time to make sure they were capturing the experience that we were looking for Leslie enjoyed the session as they made us feel comfortable which made better pictures, we were looking for a wall portrait for 16 years and LeCroys delivered. Tess Daves", "pics": null, "resp": null, "gmap_id": "0x8889f98273da35f9:0xc1d9cfff6652b7c1"}
{"user_id": "117041214544778297167", "name": "Krystal’s Storytime", "time": 1606407466720, "rating": 5.0, "text": "Working with Clay Spann last weekend was such an incredible experience and I know I will be back again in the future!! If you are looking for a photographer for your pageant headshots, then look no more because Clay’s work is remarkable!! I also want to say a big Thank You to Joey and Ms. Terri who were helping that day too.", "pics": null, "resp": null, "gmap_id": "0x889292153d69e6a5:0x7d4cf576b10e5b42"}
{"user_id": "113202563187479013066", "name": "Mary McCoy", "time": 1523741506387, "rating": 5.0, "text": "The most personable staff, highly talented and the very best at what they do. I left there feeling absolutely beautiful and confident, not something that is natural for me. I really cannot say enough about this place. Kaila is pure talent. Everyone there is. 5+ stars!  Thank you again.", "pics": null, "resp": null, "gmap_id": "0x889292153d69e6a5:0x7d4cf576b10e5b42"}
{"user_id": "106347299451349924707", "name": "Leon Edwards", "time": 1569410975807, "rating": 5.0, "text": "Sadly the photo business has closed. The trophy, awards, plaques and personalized products business, SubHub is open.", "pics": null, "resp": null, "gmap_id": "0x886267d1b03c0e81:0x846c8b37a58893ba"}
{"user_id": "105509293168662138513", "name": "Renson Dalizu", "time": 1543612905452, "rating": 5.0, "text": "Great place", "pics": null, "resp": null, "gmap_id": "0x886267d1b03c0e81:0x846c8b37a58893ba"}
{"user_id": "114382053935373777285", "name": "Alyson Trimble", "time": 1620263619620, "rating": 4.0, "text": "This is the best place in the southeast to have your pictures taken.", "pics": null, "resp": null, "gmap_id": "0x888b92657fa59a67:0x61ad1fbca5859391"}
{"user_id": "111940064832327851077", "name": "Emily Wallace", "time": 1600982740466, "rating": 5.0, "text": "Amazing! The photoshoot was so much fun and the senior pics turned out beautiful!", "pics": null, "resp": null, "gmap_id": "0x888b92657fa59a67:0x61ad1fbca5859391"}
{"user_id": "108283264463727102458", "name": "Brandi Keedy", "time": 1625836894480, "rating": 5.0, "text": "Tony customized a package that was exactly what I needed at an affordable price. He met us in Perdido Key, FL and knew exactly the right spots and time of day to shoot. He was able to combine an extended family shoot with senior sessions for two of our group members. The photos were amazing! There were three teenage boys in the group that always complain about being photographed…my husband is the same way…and they all said it was the most pleasant photo shoot they’ve ever experienced! My youngest even said that he wants Tony to do his senior portraits when it’s time in 3 years. We will definitely book him again!", "pics": null, "resp": {"time": 1625838337943, "text": "Thank you soooo much! I'm happy you like your photos! See you all next time :) Tony"}, "gmap_id": "0x889a409071d7c00f:0xe0a653d05da8b2bc"}
{"user_id": "109196310559518408888", "name": "Sarah Skiebe", "time": 1620249305375, "rating": 5.0, "text": "Look no further! My family and I were traveling to Fort Morgan for vacation and we wanted to get family photos done on the beach. I did a Google search and called up a few places. Tony was recommended by another highly rated photographer and I decided to go with him. So glad I did! He was wonderful! Great communication and great value! We had a group of 11 with 5 young children and we managed to get many great photos! He was great with the kids and very patient. We did not feel rushed at all. He was also great at directing us and had great photo ideas. Thank you Tony!!", "pics": null, "resp": {"time": 1620253045414, "text": "wow! thank you so much, I hope to see you all again on your next beach trip!"}, "gmap_id": "0x889a409071d7c00f:0xe0a653d05da8b2bc"}
{"user_id": "108232076611775128148", "name": "David Kimball", "time": 1618158774488, "rating": 5.0, "text": "We just spent a week in Gulf Shores on Orange Beach and Tony came and took family pictures for us on the beach.  HE WAS AWESOME!  He worked with a very large group of 14 and 5 of them were children.  We are so happy with the pictures.  Best money i have ever spent on family pictures.", "pics": null, "resp": null, "gmap_id": "0x889a409071d7c00f:0xe0a653d05da8b2bc"}
{"user_id": "116472214537279236140", "name": "Randall Harrop", "time": 1593738154841, "rating": 5.0, "text": "We have used Tony 4 times now for family pictures on the beach. He has seen our family grow over the the last 7 years and we recently had pictures taken with extended family. He’s our favorite photographer and we will never use anyone else! Highly recommend him! 😊", "pics": null, "resp": {"time": 1593746260172, "text": "Wow, thanks so much. That means so much to me!"}, "gmap_id": "0x889a409071d7c00f:0xe0a653d05da8b2bc"}
{"user_id": "108811423685999523035", "name": "Chris Young", "time": 1559160505891, "rating": 5.0, "text": "Highly recommend.  Used Tony for 50th Wedding Anniversary pics, 3 families, 12 individuals.  Pictures turned out GREAT!!", "pics": null, "resp": null, "gmap_id": "0x889a409071d7c00f:0xe0a653d05da8b2bc"}
{"user_id": "105308477458048191654", "name": "Greg Brady", "time": 1439075417942, "rating": 5.0, "text": "Tony was not only a pro but he was also fun to work with.  He was great with our 2 younger kids which isn't always easy and even they had a pleasant experience getting their pictures taken on the beach.  All communications were very efficient.   Best of all, the family pictures on the beach turned out well beyond expectations.   They are so amazing!  My wife and I keep looking at them daily because they are so great.  Thanks for doing such a great job, Tony!", "pics": null, "resp": null, "gmap_id": "0x889a409071d7c00f:0xe0a653d05da8b2bc"}
{"user_id": "104174983722619621038", "name": "Cathy Lowe", "time": 1419875300008, "rating": 5.0, "text": "My family used Tony for beach pictures while in Gulf Shores last spring break.  He was fabulous!  The communication was perfect - he returned phone calls and emails promptly and followed up with directions a day or so before the shoot.  Our disk of images arrived as expected (maybe 2 weeks after the shoot...I don't remember exactly.) He was very friendly and easy to work with.  My kids responded well, which is especially challenging with my son.  He doesn't tend to look at the camera if he can avoid it, so Tony snapped away until he accidentally caught him looking. Lol.  Tony knew the perfect location and time of day.  Our pictures turned out truly breathtaking.  I plan to use him next spring break as well.", "pics": null, "resp": null, "gmap_id": "0x889a409071d7c00f:0xe0a653d05da8b2bc"}
{"user_id": "110620217594569393760", "name": "Brian Panos", "time": 1606160812290, "rating": 5.0, "text": "A level of professionalism I did not think possible in a small town in Alabama. The staff was did such a good job, my family can't stop talking about it. I strongly urge anyone who needs professional photography for your family or business to use yellowhammer photography.", "pics": null, "resp": null, "gmap_id": "0x8889856511d649fd:0xa7089dd144111082"}
{"user_id": "102743907362060309011", "name": "ELIZABETH TOLBERT", "time": 1562952309557, "rating": 5.0, "text": "Thank you Yellowhammer Photography- you guys are the BEST!\nI can always count on Beth and Joel to provide me with beautiful photos and an overall great experience.\n👍🏼👍🏼Highly recommended", "pics": null, "resp": {"time": 1562979836675, "text": "Thank you for the review. We had so much fun working with you and your family the other day and look forward to working with you again in the future."}, "gmap_id": "0x8889856511d649fd:0xa7089dd144111082"}
{"user_id": "102665349064096526769", "name": "Jacob Smith", "time": 1562943702792, "rating": 5.0, "text": "Yellowhammer Photography is a phenomenal company. We have used them for everything from a single photo to our wedding pictures, and everything in between. Joel and Beth are not only extremely talented, but they are wonderful people. We will never use another photographer, no matter what we are needing or where we are.", "pics": null, "resp": {"time": 1562947876197, "text": "Thank you so much for the kind words. We always love it when we get a chance to work with you guys. We look forward to working with you again in the future."}, "gmap_id": "0x8889856511d649fd:0xa7089dd144111082"}
{"user_id": "102151979056391604805", "name": "Benard Tamburello", "time": 1562990467234, "rating": 5.0, "text": "Beth and Joel have been covering the food scene of all my restaurants for over half a decade now! They offer amazing professional commercial photography with an easy going approach. Their attention to detail really shows in our food and beverage photos. We will continue to use them again in the future as we love their competitive pricing!!", "pics": null, "resp": {"time": 1563111406348, "text": "Thank you for the review! We always look forward to each time we get to work with you and your teams. The AMAZING food and atmosphere you provide in your restaurants make our job so much easier. And it’s always nice to get some awesome samples. 😃 Looking forward to our next session."}, "gmap_id": "0x8889856511d649fd:0xa7089dd144111082"}
{"user_id": "102934541034554985685", "name": "Brianna Tamburello", "time": 1562989611534, "rating": 5.0, "text": "Beth and Joel offer amazing quality pictures with a professional experience and competitive pricing. Their attention to detail is top notch! Their creativity and keen eye made our wedding picture experience at Sloss Furnaces perfection! We will book them again and again for years to come.", "pics": null, "resp": {"time": 1563110762550, "text": "Thank you for the review. We LOVED working with you guys on your unique wedding shoot. We always love it when someone has an out of the box idea that we are able to make happen, and yours was super FUN! We hope to work with you guys again soon."}, "gmap_id": "0x8889856511d649fd:0xa7089dd144111082"}
{"user_id": "112590073010885746340", "name": "Traci Vice", "time": 1562949374413, "rating": 5.0, "text": "Yellowhammer Photography has been our family's photographer for years. Joel and Beth are a pleasure to work with! They are thorough, very professional and an overall delight to be around. We genuinely look forward to working with them every single time.\nThrough the years we have had family portraits, my daughters wedding (when he did weddings) and both of my daughters senior portraits. He has also made head-shots for a couple of pageants. All were beautifully edited. Beth and Joel work together to come up with realistic poses that are very natural and flattering for all!\nWe would never consider looking anywhere else for a photographer- Yellowhammer is the best you can get- I can't say enough great things about them!", "pics": null, "resp": {"time": 1562951724358, "text": "Thank you so much for this review. We really LOVE working with you guys and always look forward to the next time you may have a milestone requiring photographing. Your family is beautiful and wonderful people and we are just so happy that we have been allowed to capture some of these special moments for you guys!"}, "gmap_id": "0x8889856511d649fd:0xa7089dd144111082"}
{"user_id": "104960201953346248195", "name": "Tina Butts", "time": 1563017100379, "rating": 1.0, "text": "After using Joel on two occasions to do photos for me and my family, I booked a Maternity Session more than 3 months in advance. During that time, I texted him to gain an understanding of what the cost would be. He asked a few questions and then never got back with me. Since I had used him on 2 other occasions (most recently 9 months ago) and his prices were reasonable... and this session would be no more work than the previous sessions, I didn't press the issue and figured we would just discuss it later. Well..when I texted him a month before the event to confirm my date, he mentioned he noticed he had never responded to my text regarding the price.  After asking a few more questions he came back with a price of $800?!?!?!??? This is almost as much as I paid for my wedding pictures and they were ABSOLUTELY GORGEOUS with tons of editing (much better than any session that we had with Joel). I have spoken with several licensed photographers since this time and NONE of them charge anywhere near this high. Going price for this type of session was $150-450 for a 1-2 hr session and digital photos (Max). Unfortunately this put me in a real bind because now it was extremely hard to find another photographer that was available for my date. Joel mentioned he would come down to $550...but this was still higher than \"average\". This high pricing also was not in line with the pricing on his website. Although he did not have Maternity specifically listed, he had Engagement Sessions for the same length of time (2 hr session and digital photos) for $400 and this was synonymous to my requested session since it would be only me and my husband for a couple of hours. Given that he put me in such a stressful bind at an already stressful time in my life, I would definitely NOT recommend him. I tried to work out the pricing with him to be more reasonable and even explained my issue of having troubles finding someone else this late...but he was unwilling to work with me...even though he knew that it was his fault because he never answered my text regarding pricing 3+ months ago. Do yourself a favor...use someone who responds to text messages and honors pricing listed on their website. At a minimum,  select someone who is willing to take responsibility when they make a mistake...that unfortunately does not appear to be Joel at Yellowhammer. :(", "pics": null, "resp": {"time": 1562982443833, "text": "Thanks for taking the time to share your feedback. We have always enjoyed working with you and your family and are glad you were so pleased with our work in the past that you decided to reach out to us for your maternity session. While we strive to accommodate almost any budget, we understand that sometimes that does not work out. While we do offer lower-priced photography collections, those price points do not include the digital copies of edited photographs that you requested. We hope you were able to use one of the many photographers we recommended, who may be able to offer a lower price point. Thanks again for your business, and we wish you all the best in the future."}, "gmap_id": "0x8889856511d649fd:0xa7089dd144111082"}
{"user_id": "106397101774934225554", "name": "Stacy Cash", "time": 1621785823284, "rating": 1.0, "text": "Booked a senior portrait session a wasn't able to get pictures made due to Covid issues. It took a year to get a refund!", "pics": null, "resp": null, "gmap_id": "0x888602e8fc22bceb:0xaca51304763f7825"}
{"user_id": "116961272333378724378", "name": "Hortense Prewitt", "time": 1565493925242, "rating": 5.0, "text": "They were ready patient and took there time with my grandson", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMn3DCD1rAwL3tyiBf09DQxah1ByzbpwEBHamJK=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPudKb9EetzbJXYmaAaA53CeUo7YC4jfIjr3UFj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPNQJlvC-1vFQ1BfmMxkbVCyX-jxWN0YXelvTDG=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNGhjSr366WTFnvg-eJaefmMLQai2-hf3Lz2DUy=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888602e8fc22bceb:0xaca51304763f7825"}
{"user_id": "106441381397093298106", "name": "Melissa Ann Milano", "time": 1588002759003, "rating": 1.0, "text": "No one is responding to an email I sent weeks ago, regarding a photo session my son had for his senior photos (2014).  I wanted to know why they only hold digital copies for TWO years? I lost my 11x14 of my son and wanted to reorder. But apparently I cannot due to that fact. So, when I emailed to ask why, I still have not gotten a reply.", "pics": null, "resp": null, "gmap_id": "0x888602e8fc22bceb:0xaca51304763f7825"}
{"user_id": "103899086154774273596", "name": "Jenn Plowman", "time": 1562547851056, "rating": 2.0, "text": "I, unlike many others, did not have an appointment issue or wait for weeks to be called back. That part was fine. However, the professionalism of their “secretary” at the Tuscaloosa location was nonexistent. She was too young to be given that type of responsibility. The 2 photographers were super nice... no complaints there. BUT THEN, our proofs come in and we check out the prices. W O W. Can you say OVERPRICED?!?! Most of my son’s shots are great and I would love to have some prints made but who in their right mind would pay those prices???? The “better” deal, yet still crazy expensive, is to get a package, but that’s such a waste. No one cares about 50+ wallet pictures. That’s silly. So why order something that you won’t use?!\nSo, I gave 2 stars only because the pictures themselves were great.... based on everything else, 1 star!!!! If they sell enough of those price-gouged prints they can afford to buy their own stars 😡", "pics": null, "resp": null, "gmap_id": "0x888602e8fc22bceb:0xaca51304763f7825"}
{"user_id": "104664185484517371140", "name": "Lisa Bailey", "time": 1566133619833, "rating": 1.0, "text": "I was very disappointed with how the senior portrait session was set up. We were given a time to be there, but when we show up there were 8 other students there also and 3 photographers. One of the photographers also was taking money and checking people in. My son's pictures were not good. His shirt clashed with his background. They easily could have changed the background, but because they were so rushed they didn't. I over heard a photographer saying they really want had lunch or much of a break. I was just very dissatisfied because this was a time as a mom I've anticipated and looked forward to. It should have been a fun and good experience, but it was neither. When I got his pictures back, I'm even more disappointed. The problem is I have to use 2 of these pictures for his year book 😓 I can't find one that I like. I'm just really frustrated.", "pics": null, "resp": null, "gmap_id": "0x888602e8fc22bceb:0xaca51304763f7825"}
{"user_id": "107502699567295500522", "name": "Randie Watkins", "time": 1594334175528, "rating": 4.0, "text": "Staff at the Tuscaloosa office we're great, the main office is a different story.", "pics": null, "resp": null, "gmap_id": "0x888602e8fc22bceb:0xaca51304763f7825"}
{"user_id": "106925988771669753766", "name": "Jamie Beck", "time": 1558464663799, "rating": 1.0, "text": "I have been trying to speak to someone about senior portraits for weeks. No one calls you back. It's a complete racket that you have to use this company exclusively for your child's picture to be included in their highschool yearbook!", "pics": null, "resp": null, "gmap_id": "0x888602e8fc22bceb:0xaca51304763f7825"}
{"user_id": "100095950208666402431", "name": "Marsha Coleman", "time": 1562861203863, "rating": 2.0, "text": "Photographer were super nice, friendly, polite, and professional. The receptionist was very UNPROFESSIONAL and a bit racist...she assisted everyone that shares her ethnicity and was dry and unwelcome to EVERYONE that didn’t look like her. Will not be going back; would rather take pictures with my phone using a communal bathroom as the background. 🤬", "pics": null, "resp": null, "gmap_id": "0x888602e8fc22bceb:0xaca51304763f7825"}
{"user_id": "117922026362464929960", "name": "Randie Watkins", "time": 1546817433707, "rating": 1.0, "text": "The prices are outrageous!", "pics": null, "resp": null, "gmap_id": "0x888602e8fc22bceb:0xaca51304763f7825"}
{"user_id": "104432694747298214775", "name": "Melanie Spence", "time": 1622986399052, "rating": 5.0, "text": "The whole vibe and experience is really wonderful. The photographer is personable, and has a way making you feel very comfortable in your journey. Client's are treated to a beautiful and meaningful experience. Each individual and/or family come away with their stories captured in a creative and memorable way.", "pics": null, "resp": {"time": 1622987744544, "text": "Thank you so much for taking the time to provide this review! 😊 We appreciate it!"}, "gmap_id": "0x88626982904d5311:0x5ea021d416b744ea"}
{"user_id": "105075038705965168381", "name": "A Todd Baker", "time": 1605740997624, "rating": 5.0, "text": "This is a quality photographer her photo and services are impeccable! You will be more than happy.", "pics": null, "resp": null, "gmap_id": "0x88626982904d5311:0x5ea021d416b744ea"}
{"user_id": "115408019708605745939", "name": "The Booth Fam", "time": 1576425779685, "rating": 5.0, "text": "Let’s just start by saying, Gianna Snell Photography is definitely an experience. She was professional, prompt and inviting. Her studio is so peaceful and calm, just good energy. The photos she took of us was just beautiful. She was prepared for us and it made the session flow really smoothly. She helped us with posing and gave good direction. If you are looking for a place that will get the job done and bring your vision to life. I highly recommend Gianna Snell Photography.", "pics": null, "resp": null, "gmap_id": "0x88626982904d5311:0x5ea021d416b744ea"}
{"user_id": "114619336304912158925", "name": "Shavavian Allister", "time": 1585584857251, "rating": 5.0, "text": "Warm, friendly and professional. Our pictures came out BEAUTIFULLY!! 10 out of 10, would recommend.", "pics": null, "resp": null, "gmap_id": "0x88626982904d5311:0x5ea021d416b744ea"}
{"user_id": "115303907332562746291", "name": "Yooky Shin", "time": 1624239919819, "rating": 5.0, "text": "Meredith was great to work with. She was very responsive with email/ texts and was understanding when we had to reschedule the newborn session.  Newborn photos were delivered within few days and they were so precious.", "pics": null, "resp": null, "gmap_id": "0x888916102edfe53f:0x82e178074a54dcb7"}
{"user_id": "110099438043346290973", "name": "Faye Heard", "time": 1617116231655, "rating": 5.0, "text": "We booked Meredith for a newborn photoshoot and couldn't be happier with the results. Leading up to the shoot, she was very responsive to my questions and shared helpful suggestions to make the most of our session. During the shoot, she was extremely professional, and her patience with our baby was amazing to watch. You can tell she's very experienced working with little ones; she knew all the tricks to keep him quiet, content, and perfectly posed for his pictures. I highly recommend her, and we will certainly be back for future sessions.", "pics": null, "resp": null, "gmap_id": "0x888916102edfe53f:0x82e178074a54dcb7"}
{"user_id": "111287784616269887500", "name": "Kelly Johnstone", "time": 1617044127184, "rating": 5.0, "text": "Meredith has been our family photographer since my 1st daughter was born in 2015. She has this magical way of turning photo shoots with uncooperative kids into gorgeous memories. I have done around 10 photo shoots now and have never been disappointed.   She has a gift and we will continue booking with her indefinitely. We are always so grateful to her and she is great with kids.", "pics": null, "resp": null, "gmap_id": "0x888916102edfe53f:0x82e178074a54dcb7"}
{"user_id": "105351624788525778391", "name": "Alyssa Rice", "time": 1617147830082, "rating": 5.0, "text": "We had our son’s first birthday pictures taken with Meredith and we could not be more pleased with the outcome!! The quality of the images and response time was unbeatable. We will be using her again for future pictures! We would definitely recommend to friends and family!", "pics": null, "resp": null, "gmap_id": "0x888916102edfe53f:0x82e178074a54dcb7"}
{"user_id": "107344579290252354797", "name": "Morgan Moore", "time": 1619791792301, "rating": 5.0, "text": "We had a wonderful experience getting newborn shots! Absolutely amazed at the pictures and can't wait to go back!", "pics": null, "resp": {"time": 1619792982758, "text": "Thank you so much! Can’t wait to see you guys again"}, "gmap_id": "0x888916102edfe53f:0x82e178074a54dcb7"}
{"user_id": "105516644798092744433", "name": "VaQuita M. Curry", "time": 1603733744480, "rating": 5.0, "text": "Meredith has been great to work with. We have completed two different sessions with her, and have two more booked.  Her work speaks for itself, and she has captured priceless memories for us. Great photographer!", "pics": null, "resp": {"time": 1603734420375, "text": "Thank you so much for trusting me with your families pictures! ❤️❤️"}, "gmap_id": "0x888916102edfe53f:0x82e178074a54dcb7"}
{"user_id": "111865608835158501448", "name": "Shivani Patel", "time": 1606104763460, "rating": 1.0, "text": "Due to lockdown my first born twins couldn’t get their pictures done, I mentioned that to Ms. Rowlen plenty of times. We got our boys six months photoshoot done with her including my husband, our fur baby and I. She neither guided us for any poses nor I got a single picture of my boys. Without even looking at our pictures, I paid money in full as I understand we all are struggling at this times. I even requested her if we can get us in again for the boys pictures again yet she hasn’t responded. I couldn’t send out my family any holiday pictures as there aren’t any pictures of them alone. Very disappointed with her service. My husband who never finds a fault in any person, made a comment about her being a lazy photographer. I hate to write a bad comment about anyone but this was so special to me for being the first time mom. I wish she would’ve understood that and worked with us with ideas and suggestions. Also I clearly mentioned to her that I’m trying to her pictures done in Beautiful Alabama Fall Foliage but that didn’t happen as well. 😭😭😭", "pics": null, "resp": {"time": 1606137619680, "text": "I have emails and messages to show where Ms. Upadhyay was told the time her session started, how long it would be, the fact most areas were still green but might be changed by her desired session date, (she had a specific timeframe she wanted and didn't want to wait) as well as the fact it was better if the children sat up for the session. She insisted on wanting them asap and then sent me a photo of the twins sitting up. Then at the session, that they arrived late for they took awhile getting kids dressed, mom getting her shoes on etc.. she told me they could NOT sit up. So I explained to her and her husband that the children had to be leaned against them or they had to be holding them and I would focus on just the child. I will NOT take photos of ANY child and put them in harms way just to get a shot. They both were told this and I still took photos of just the boys together as well as each individual child with their parents holding them. So I am not sure why she is saying she didn't get a single picture of the boys.  I directed them in every pose and even asked if they wanted different ones where she indeed asked for extra poses and we did them. They went well over their scheduled shooting time of 45 minutes, as I had a babysitter and know how much I paid them and I checked my camera data to see the exact shooting time. I never once rushed them and stayed longer, even though they were late cause I knew she wasn't happy. She complained the entire time that the boys wouldn't smile and I tried, she tried and dad tried, the boys wouldn't have it. (kids will be kids this happens often with my own kids too) She has beautiful images of her family and she downloaded them all before she complained to me. As stated on my website I can not guarantee children will smile or be able to do any specific poses as kids will do what they want to do. I asked at the session if they had any other things they wanted to do after I was done with my poses and she said yes, I did them and then we were done. Not once did she mention she didn't like the location or any poses I suggested or did at the session. I feel I was far from lazy accommodating their wants and needs as well as making sure not only her twins were looking her dog was as well. I do my best but again can not guarantee smiles, I wish I could.. but in this case even mom and dad couldn't get the littles to smile. :("}, "gmap_id": "0x888916102edfe53f:0x82e178074a54dcb7"}
{"user_id": "106827682347877206518", "name": "Jennifer Humber", "time": 1574707447167, "rating": 5.0, "text": "Meredith is an excellent photographer and always does an amazing job. She has done family pictures for us for many years and also did our wedding photography. We always get many compliments on our pictures. She does great editing and we get our pictures back very quick. Meredith is very reliable and professional and would never cancel or reschedule unless it was for a reason such as weather which is obviously outside of her control. Highly recommend!!", "pics": null, "resp": null, "gmap_id": "0x888916102edfe53f:0x82e178074a54dcb7"}
{"user_id": "109529411824727882891", "name": "Melissa Espinoza", "time": 1561928232590, "rating": 5.0, "text": "Meredith is the most amazing photographer and if you’re searching for one for any occasion, look no further. She has been my life long photographer, my house is filled with canvases of pictures she has taken. My son is terrible when getting professional pictures done.. every photo shoot I leave thinking there’s NO WAY she got a picture of his smile that he flashed for maybe 2 seconds.. but she gets it.. every time. She has an eye for photography, she can literally make any location look amazing! I have been with her at some questionable venues over the years and I always wonder how she can make it look good.. but the pictures are ALWAYS stunning. She is flexible and great to work with.. when you get your pictures back you will NOT be disappointed. Meredith, thanks for taking pictures of all our big life moments over the years, from prom to babies.. we will cherish them for a lifetime!", "pics": null, "resp": null, "gmap_id": "0x888916102edfe53f:0x82e178074a54dcb7"}
{"user_id": "111120518727613349942", "name": "LeeAnn Smith", "time": 1575137958683, "rating": 5.0, "text": "Meredith has been shooting my family’s pictures for over 12 years.  I absolutely love her work and my kids adore her.  She has captured countless precious memories of my kids. Can’t wait for her to shoot my oldest kiddo’s senior portraits.", "pics": null, "resp": null, "gmap_id": "0x888916102edfe53f:0x82e178074a54dcb7"}
{"user_id": "109205271301059744597", "name": "Misty Weldon", "time": 1562895891342, "rating": 5.0, "text": "Meredith did engagement photos and wedding photos for us. They are beautiful, crisp, clear photos that I will cherish forever!! They look so great printed on canvases and metal prints in our house. She is so down-to-earth, and she was so patient working with us through my husband’s squinty eyes and our energetic dog! She also edited every bit of my armpit fat and my husband’s sweaty hair! I will definitely be using Meredith in the future to photograph all our milestones. Would highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888916102edfe53f:0x82e178074a54dcb7"}
{"user_id": "100568667787506176843", "name": "Melissa Daniel", "time": 1574716819595, "rating": 5.0, "text": "Meredith has an amazing talent. She goes out of her way for clients, takes great shots, and is always professionally. I would highly recommend her services!", "pics": null, "resp": null, "gmap_id": "0x888916102edfe53f:0x82e178074a54dcb7"}
{"user_id": "109844545328235365542", "name": "Colleen Quinn", "time": 1561337188434, "rating": 5.0, "text": "Meredith is the absolute best! She has pretty much photographed every big event in my adult life! Engagement, wedding, birth announcement and newborn photos! They are all photos we will cherish forever! You can tell she takes pride in her work and you will love to show off the photos you get from her!", "pics": null, "resp": null, "gmap_id": "0x888916102edfe53f:0x82e178074a54dcb7"}
{"user_id": "111412851040148538528", "name": "ANNE-MICHELLE BARNETT", "time": 1542471264682, "rating": 5.0, "text": "Meredith has been taking pictures for us since our six year old old was born and does at least three to four photo shoots of our family a year. She is a total professional and somehow manages to get wonderful shots of my two wild boys no matter their mood. We’ve done both studio and location shoots and the pictures are always beautiful with unique poses.\n\nWe always get the photos back quickly and edited beautifully. I found Meredith via Facebook so we were thrilled to see that she shared some of our shots on her page. I highly recommend Meredith for any of your professional photos! I use her pictures for our Christmas cards EVERY year!", "pics": null, "resp": null, "gmap_id": "0x888916102edfe53f:0x82e178074a54dcb7"}
{"user_id": "100775033932750942848", "name": "Lauren Wetzel", "time": 1542460361414, "rating": 5.0, "text": "Meredith has taken pictures of my kids & family for the past three years. Every experience has been a great one. Seriously. Every experience and we’ve had a lot - 3, 6, 9, 12, 18 month pictures, 2 year pictures, 3 year pictures, family pictures, Santa, Easter - amazing!! She is easy to work with, reasonable, and so much fun!  She takes pride in her work and it shows. As long as she’s in business, she will have us as clients.", "pics": null, "resp": null, "gmap_id": "0x888916102edfe53f:0x82e178074a54dcb7"}
{"user_id": "110214795950638633091", "name": "Monica S.", "time": 1550696910865, "rating": 1.0, "text": "I was extremely disappointed by my experience.\n\nI told the photographer it would be our first time shooting as a family and asked for any tips prior and told her this was primarily for family photos to use as a Christmas card. The only tip told ahead of time was: not to wear totally matching outfits, but ones that coordinate.\n\nAt the shoot, it was cold, so\nI understand it wasn’t the most ideal environment, but the photographer seemed checked out.\n\nWe got a mix of photos that were heavily edited, and in my opinion, poorly edited (overly whited out) and mostly solo pictures of the baby. (I am a snap happy mom so I have many pictures of the baby solo, and not many of the family as a whole—which I mentioned during the shoot).\n\nI was really disappointed by the emailed gallery, conveyed such, and asked for maybe even the unedited copies of the photos\n(I respect the time it takes to edit the photos).\nWhen requesting the unedited copies, even offering to pay more, I was denied even though I was really disappointed by the edited results.\n\nMost of all, I found photos of my child online without consent or request. Totally horrified. This was never mentioned (nor was permission asked). I only found them after looking for a place to read other reviews to see if I was the only person not happy with the results of this particular photographer.\n\nEdit: I’ve spoken to more photographers in the area for future sessions and mentioned my experience, and they noted that they would have offered to re-edit them or have given the unedited photos (for free, and especially for an additional fee).", "pics": null, "resp": {"time": 1550688910915, "text": "Sorry that you were unhappy with your experience. We both have completely different opinions to how this all went down and I'm not going to argue each one of your comments above with you. Your son was precious and it was nice to meet you guys, I wish you the best in future portrait sessions."}, "gmap_id": "0x888916102edfe53f:0x82e178074a54dcb7"}
{"user_id": "108023665144902271638", "name": "Marsia Brothers", "time": 1563473821026, "rating": 5.0, "text": "She is an amazing photographer. She has an eye for getting the best angles, smiles, and moments. The best...you won't be disappointed.", "pics": null, "resp": null, "gmap_id": "0x888916102edfe53f:0x82e178074a54dcb7"}
{"user_id": "100348889415489402837", "name": "Norine Wilson", "time": 1574697770459, "rating": 5.0, "text": "Just AMAZING - takes her time, works really hard to get the best angle & picture plus edited really fast.", "pics": null, "resp": null, "gmap_id": "0x888916102edfe53f:0x82e178074a54dcb7"}
{"user_id": "105009219794280799900", "name": "Naveen Bade", "time": 1542336121000, "rating": 5.0, "text": "We had a very pleasant experience with Meredith. She accommodated us for a newborn shoot on a very short notice. She was very thorough with her work and was exceptional with handling the baby.. y'all new parents, ur baby is in safe hands!! I couldn't thank her enough after we saw the final pictures.. everybody shud just go for MRP👌", "pics": null, "resp": null, "gmap_id": "0x888916102edfe53f:0x82e178074a54dcb7"}
{"user_id": "104370893024102436114", "name": "Corinthean Mitchell", "time": 1561327117607, "rating": 5.0, "text": "Very professional and friendly.  Her work is beautiful.", "pics": null, "resp": null, "gmap_id": "0x888916102edfe53f:0x82e178074a54dcb7"}
{"user_id": "105832960487353220669", "name": "Michael Sims", "time": 1596571641836, "rating": 1.0, "text": "Disconnected or No Longer In Service", "pics": null, "resp": null, "gmap_id": "0x8862837d2d28f299:0x1bb5ddae42b594b1"}
{"user_id": "104299655345818806120", "name": "Alabama Reloader", "time": 1515725426962, "rating": 4.0, "text": "Good value", "pics": null, "resp": null, "gmap_id": "0x8862837d2d28f299:0x1bb5ddae42b594b1"}
{"user_id": "102656924420647144741", "name": "Mernia Ganote", "time": 1608222646232, "rating": 1.0, "text": "35 sitting fee, ok, but unprofessional assistant and very disorganized isn’t a good thing, with the assistance of the younger person I ordered the economy package, a few weeks later I received a email stating ready, so went in and they weren’t the lady apologized, so a few weeks later went in, gave my name etc, the older person couldn’t find my photos asked me numerous times what name would they be under, and even if I was sure I didn’t pick them up, she went on to give excuses that she was out all month over COVID, so I made sure my hands were clean and my-mask stayed on, anyway she got on the phone chatted with whom I have no idea then stated I found them let me all you back after I get these to her and she leaves, ok well she handed me some wallets, I’m like really? This isn’t what I ordered, she is yes they are! No woman I know what I ordered I ordered while talking to an employee who told me which to click and pay, ok, I’m like just refund my money, a second later the photographer came up, asked if they made a mistake, I’m like yes, I was suppose to get the economy 8x10 2 5x7 and a few wallets, ok, I’m like I need these I’m leavin* for SC and he said they’ll be ready this after noon, the woman cuts in, were closed at 5 I’m like np I don’t live far I’ll be here, we’re I barely returned home and sat down received a call they’re ready, hmm that fast, no drying time, so I went in, arrived at the desk was told here, so I looked at them nothing really saying they were high quality, in fact they were sticky to the touch, when I stated this the woman replies have a good day and walked away, hmm, ok son looked at them and even sticky to him so he laid them out, well I posted on FB my experience and the photographer responded I’ll call you in the morning, I’m like ok, we’ll sitting in my drs office he called, I informed him of the stickiness and how I felt about this experience and not even getting a apology, we’ll bring in I’ll redo I’m like I have no time, I’m being rushed as it is trying  to get packed up for the trip, one wax a gift to my sons grandmother he placed in the frame the next day and wrapped, I told my son to unwrap so we could return and behold it’s stuck to the frame, now I’m getting text after text come in I’ll replace do this return I’m like dude I’ve been there wasted my gas and want me to keep coming in?\nI called a trusted photographer who told me he should of let them dry and that with that experience he would of just refunded and offered to retake.\nI the last text was trying to make the stickiness my fault over using hand sanitizer, I’m like wrong answer my hands were dried off and I didn’t use it the second time, look ppl might have good things to say but I do not, heck Walmart prints better photos then this, and trust I’ll not go back..", "pics": null, "resp": null, "gmap_id": "0x889292620e0bd67f:0xcf9a37564b4ef173"}
{"user_id": "107989365652977596273", "name": "Amanda Kay Whiddon", "time": 1601968280731, "rating": 5.0, "text": "Amazing photographer who has been capturing memories since I was in elementary school!  Creative, honest, dependable and affordable.", "pics": null, "resp": null, "gmap_id": "0x889292620e0bd67f:0xcf9a37564b4ef173"}
{"user_id": "116162120120749552019", "name": "Mary Williams", "time": 1607194575534, "rating": 5.0, "text": "Very professional. Excellent portraits and nice selection of packages with personalized options", "pics": null, "resp": null, "gmap_id": "0x889292620e0bd67f:0xcf9a37564b4ef173"}
{"user_id": "113586308153896829630", "name": "Lala Singletary", "time": 1601174691787, "rating": 5.0, "text": "Art Solomon did a great job taking my picture and he does great work made it fun!! Definitely it 5 thumbs up👍👍👍👍👍", "pics": null, "resp": null, "gmap_id": "0x889292620e0bd67f:0xcf9a37564b4ef173"}
{"user_id": "109798496630478626712", "name": "Deborah Pearson", "time": 1580916512001, "rating": 5.0, "text": "Art Solomon is a top notch professional and a great photographer. I highly recommend him for individual, family and event photos.", "pics": null, "resp": null, "gmap_id": "0x889292620e0bd67f:0xcf9a37564b4ef173"}
{"user_id": "104398205839321328411", "name": "Michelle Rackstraw", "time": 1608225495067, "rating": 5.0, "text": "Very quick and professional.", "pics": null, "resp": null, "gmap_id": "0x889292620e0bd67f:0xcf9a37564b4ef173"}
{"user_id": "106745089997212867419", "name": "Lois Maher", "time": 1546115531612, "rating": 5.0, "text": "He takes great photos! The package prices are affordable!! I won't go anywhere else.", "pics": null, "resp": null, "gmap_id": "0x889292620e0bd67f:0xcf9a37564b4ef173"}
{"user_id": "108453837910861026348", "name": "Claire Machamer", "time": 1496348663678, "rating": 5.0, "text": "Excellent photographer - a blast to work with.", "pics": null, "resp": null, "gmap_id": "0x889292620e0bd67f:0xcf9a37564b4ef173"}
{"user_id": "118382480682314110419", "name": "abby mcneil", "time": 1492405737809, "rating": 5.0, "text": "Love the office assistants", "pics": null, "resp": null, "gmap_id": "0x889292620e0bd67f:0xcf9a37564b4ef173"}
{"user_id": "113121191270935540147", "name": "Lisa Bronaugh", "time": 1601735337686, "rating": 5.0, "text": "Great place. They do all my child's school pictures. Love them al", "pics": null, "resp": null, "gmap_id": "0x888a1bf203186a0d:0xff4d6172d46d9dcc"}
{"user_id": "114053880471687721512", "name": "Taryn Horton", "time": 1564665001578, "rating": 5.0, "text": "They have always taken wonderful pictures of my children through then years. Not only that they know my kids and remember their names. He's very personable. I love them. 😊❣️", "pics": null, "resp": null, "gmap_id": "0x888a1bf203186a0d:0xff4d6172d46d9dcc"}
{"user_id": "116522790685246551386", "name": "Meredith McGee", "time": 1594601478236, "rating": 5.0, "text": "Mr. Gray has photographed our daughter for school and extracurricular activities since she was a young girl. All of them look great, and we love his creativity with different styles and poses!", "pics": null, "resp": null, "gmap_id": "0x888a1bf203186a0d:0xff4d6172d46d9dcc"}
{"user_id": "107609983450938231480", "name": "Selena Rose", "time": 1535687655290, "rating": 5.0, "text": "The owner is so sweet! He's actually very funny and friendly! I would definitely go back again!", "pics": null, "resp": null, "gmap_id": "0x888a1bf203186a0d:0xff4d6172d46d9dcc"}
{"user_id": "115326882843967106675", "name": "Delilah Darden", "time": 1574820467402, "rating": 5.0, "text": "Bentley is the best! Wonderful senior portraits!", "pics": null, "resp": null, "gmap_id": "0x888a1bf203186a0d:0xff4d6172d46d9dcc"}
{"user_id": "107600648197257543971", "name": "Peggy Whitehead", "time": 1560034905820, "rating": 5.0, "text": "They take the very best pictures!", "pics": null, "resp": null, "gmap_id": "0x888a1bf203186a0d:0xff4d6172d46d9dcc"}
{"user_id": "108575710224048338052", "name": "Jeff Walker", "time": 1531098461391, "rating": 4.0, "text": "Well stocked studio, very professional and knowledgeable.  Only disappointing aspect is after not quite 2 weeks, the proofs are not posted on their website.", "pics": null, "resp": {"time": 1531106700604, "text": "Hi Jeff thanks for the review. Exactly who’s proofs are you looking for?"}, "gmap_id": "0x888a1bf203186a0d:0xff4d6172d46d9dcc"}
{"user_id": "100406513620951978320", "name": "Connie Meeks", "time": 1513429238658, "rating": 5.0, "text": "My son had senior photos done here . Was fast & good at it.", "pics": null, "resp": null, "gmap_id": "0x888a1bf203186a0d:0xff4d6172d46d9dcc"}
{"user_id": "109235308951984884590", "name": "Lynise McSpadden", "time": 1564210900832, "rating": 5.0, "text": "Absolutely love this photographer", "pics": null, "resp": null, "gmap_id": "0x888a1bf203186a0d:0xff4d6172d46d9dcc"}
{"user_id": "103800406810927530577", "name": "Steve Pennington", "time": 1510773014491, "rating": 5.0, "text": "Amazing work with professional staff!", "pics": null, "resp": null, "gmap_id": "0x888a1bf203186a0d:0xff4d6172d46d9dcc"}
{"user_id": "117178246061066956079", "name": "Stephanie Colquitt Landrum - kissybear7", "time": 1555717892586, "rating": 5.0, "text": "Love it", "pics": null, "resp": null, "gmap_id": "0x888a1bf203186a0d:0xff4d6172d46d9dcc"}
{"user_id": "100459570947972448838", "name": "Wendy Blame", "time": 1624635418427, "rating": 5.0, "text": "They did a great job with my daughter's photo shoot for her senior portraits.", "pics": null, "resp": null, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "104740810995821765268", "name": "Trequilla Bennett", "time": 1620696855484, "rating": 5.0, "text": "Very professional, did a wonderful job, I absolutely love the photos.", "pics": null, "resp": null, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "103977420933194626082", "name": "Blackgirl 574321", "time": 1611422857330, "rating": 5.0, "text": "The ppl are very nice and helpful with taking the pictures.", "pics": null, "resp": null, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "109685223486922938193", "name": "Madeline Burbank", "time": 1603243592034, "rating": 1.0, "text": "Worst experience I've had with anything in years. Staff left me uncomfortable and did awful job of accommodating. Incredibly traumatic experience I'd rather die than repeat.", "pics": null, "resp": null, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "107283760270432898349", "name": "Lisle and Jessica Babcock", "time": 1611550847322, "rating": 4.0, "text": "Great service, not bad cost, and responsive staff.", "pics": null, "resp": null, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "111924379022693180205", "name": "Darious hill", "time": 1597509612981, "rating": 1.0, "text": "You would think since they handle the majority of local high schools senior portraits, there would be a more organized set up. They were well over an hour late for our session.They know the kids needs the senior photos for their yearbook  and have no other option. MPS, please find another company.", "pics": null, "resp": null, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "106351497798726770964", "name": "Andre Hodges", "time": 1602555188594, "rating": 5.0, "text": "Great customer service 👏 👌.   Did all 3 kids senior portraits there", "pics": null, "resp": null, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "107954325905439552007", "name": "barbara markham", "time": 1595977839629, "rating": 5.0, "text": "Everyone was so nice and professional! A wonderful experience!!", "pics": null, "resp": null, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "106679956492427651701", "name": "Dorothy Schaffer", "time": 1563397507152, "rating": 5.0, "text": "Wonderful place to get your pictures made. They did an excellent job.", "pics": null, "resp": null, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "107996396135002918603", "name": "cynthia ferguson", "time": 1603391628695, "rating": 5.0, "text": "Very professional and nice", "pics": null, "resp": null, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "103366958376477253066", "name": "Joy Hunter", "time": 1563287579522, "rating": 5.0, "text": "Very organized with friendly customer service... I haven't received my pictures yet... so this is only a half review", "pics": null, "resp": null, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "109005429598326768848", "name": "Sophie Glenn", "time": 1531144790549, "rating": 1.0, "text": "I signed up to just take my senior portraits and it gave me a date and time for next week on Monday. I then get an email confirmation confirming the time and the time is set for last month??? No one is answering the phone and I'm very confused.", "pics": null, "resp": {"time": 1532375241302, "text": "We appreciate all reviews, and appreciate you giving us the chance to improve by providing us with this feedback."}, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "106360328221386633360", "name": "elaine cochran", "time": 1560006437833, "rating": 5.0, "text": "People there know what they are doing. Wonderful group of photographers.", "pics": null, "resp": null, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "104465747698400501464", "name": "Erin Putter (Chasing Life's Adventure)", "time": 1560304330295, "rating": 4.0, "text": "Went here for my daughter’s senior portraits. Very professional and polite. The only issue was the young girl at the front seemed annoyed with me.", "pics": null, "resp": null, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "108116788136493882487", "name": "Robbie Poole", "time": 1520807102132, "rating": 1.0, "text": "Absolute racket.  They get exclusivity with the local high school for senior portraits, and then try to charge you $96 plus shipping for 1 11x14 because you won't buy their $400 ridiculous package.  Would never use.", "pics": null, "resp": null, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "116012574803087693169", "name": "Krista Murphy", "time": 1567490997894, "rating": 4.0, "text": "Jasmine senior pictures oh she is beautiful", "pics": null, "resp": null, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "100924743878612869239", "name": "Tandrea Mcdaniel", "time": 1596834717022, "rating": 4.0, "text": "Amazing photographers.", "pics": null, "resp": null, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "103742968474966965169", "name": "Matthew Blevins", "time": 1540095079486, "rating": 5.0, "text": "The staff was super helpful and made the process stress free. The photographer was very experienced as well and took excellent pictures.", "pics": null, "resp": null, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "112589607879561037736", "name": "Carmekia Lawrence", "time": 1535320513393, "rating": 5.0, "text": "The staff is so friendly and fun but professional at the same time. They have a lovely studio.", "pics": null, "resp": null, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "110956545403273766356", "name": "Latasha Kelly", "time": 1531178939281, "rating": 5.0, "text": "They seen us very quickly we were  in and out the pictures came out beautiful!", "pics": null, "resp": {"time": 1532375237929, "text": "We appreciate your positive review about your recent experience with us!"}, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "107356237390828131696", "name": "Melissa Golden", "time": 1530543032609, "rating": 5.0, "text": "I had a great experience with the photographer,  he took up alot time with my son while taking his pictures. The time was great.", "pics": null, "resp": {"time": 1532373700436, "text": "Melissa Golden, we really appreciate your positive review!"}, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "109770319308990007688", "name": "Michelle McKenzie", "time": 1564237258484, "rating": 4.0, "text": "Vey nice pics\nThe packages are just too expensive!", "pics": null, "resp": null, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "114488773086839919884", "name": "Temi T", "time": 1528209286396, "rating": 5.0, "text": "Caring and detailed.  Very charismatic, lighthearted and professional staff.", "pics": null, "resp": {"time": 1528476328370, "text": "Temi T, we are so pleased you enjoyed your visit to Prestige Portraits!"}, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "108052935216080532648", "name": "Danielle Earley", "time": 1501014051968, "rating": 5.0, "text": "They took my son's senior pictures and were very friendly and took great photos as well 😁", "pics": null, "resp": null, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "116026881132975845802", "name": "Amelia Casby", "time": 1534798474724, "rating": 4.0, "text": "They were very nice, helpful, and welcoming and the pictures are amazing... I look like a star.", "pics": null, "resp": null, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "102836315308043950186", "name": "Alexander Dubose", "time": 1555126952622, "rating": 4.0, "text": "Friendly Staff but it didn't feel personal I'm thinking it was just because of graduation", "pics": null, "resp": null, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "108933069867223566278", "name": "Debra Todd", "time": 1532207983185, "rating": 3.0, "text": "Great staff. Too many appointments at one time.", "pics": null, "resp": null, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "118020650581067451520", "name": "Marquita Crayton", "time": 1563176638234, "rating": 4.0, "text": "Wasn't organized", "pics": null, "resp": null, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "102741830680596262649", "name": "Haley Madison", "time": 1529379368002, "rating": 1.0, "text": "Staff was rude and rushed. Pictures were poorly taken. They scheduled half of the school at the same day and time then got very unorganized with who needed to take pictures. Very dissatisfied.", "pics": null, "resp": {"time": 1529507968692, "text": "We are disappointed to hear that you did not have a more positive experience with us at Prestige Portraits. Thank you again for taking the time to let us know how we can improve. We hope you will consider us again in the future. Take care."}, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "117596790244509604385", "name": "Mollie Waters", "time": 1540220248545, "rating": 4.0, "text": "Great pictures!", "pics": null, "resp": null, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "108419445145211670707", "name": "Bobby Bethea", "time": 1563917020638, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "103890276107437353310", "name": "Anthony Moore", "time": 1555420298772, "rating": 5.0, "text": "Great place", "pics": null, "resp": null, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "111228685956873612822", "name": "Esmeralda Reyes", "time": 1530548141529, "rating": 3.0, "text": "Expected more but it was ok", "pics": null, "resp": {"time": 1532373906678, "text": "Thanks for taking the time to leave us this information about your recent visit. Take care!"}, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "103203715345648346274", "name": "Catina Jackson", "time": 1530315492336, "rating": 3.0, "text": "Unorganized", "pics": null, "resp": {"time": 1532372856865, "text": "Catina Jackson, it's upsetting to hear that your experience was anything but stellar."}, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "102264314141241126400", "name": "Missy Lawrence", "time": 1517847260723, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "113997721678884514324", "name": "Va", "time": 1531139767680, "rating": 4.0, "text": "Great place for portraits", "pics": null, "resp": {"time": 1532375908570, "text": "Hi Va! We're so happy we were able to help you out!"}, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "111755851986492976838", "name": "Jimmy Haynes", "time": 1497897435294, "rating": 5.0, "text": "Nice and friendly", "pics": null, "resp": null, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "116490490113318560419", "name": "Teressa Vigneault Millwood", "time": 1497470910869, "rating": 4.0, "text": "5 separate shooting places set up for all kinds of photos", "pics": null, "resp": null, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "106068983547259977726", "name": "Herbert Smith", "time": 1498742115115, "rating": 5.0, "text": "Take excellent pictures.", "pics": null, "resp": null, "gmap_id": "0x888e8f8b3b8326e3:0xb06e66151bdaa4c2"}
{"user_id": "103729734249989627561", "name": "Jenniffer Whyte", "time": 1618968133567, "rating": 5.0, "text": "We love using the services of R L Moore Photography because we are always satisfied with the end result of the product. My daughter, who is 15 years old and a little shy at times with a photographer absolutely loves Rickey and his lovely wife Deb. They made her Quinceañera photo shoot a complete success!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM-gD2pImqZvfTCVqat9cwornL8oDCe0MDX4sZp=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMzG4O7Dx7-1-M7e12bV0oadEVbsjQRIwuvDzL5=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNsgUvp8SPd_3j7fMZHZCvNgLL1sxURS6OP9Wkl=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO6W2C8QDYddPwr4A7dZ8x4XyVKWs_1X5d7aw_b=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP1uIY1IF6WVzCXkE-sjAmGyhx48CSKNtmz2UvR=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOSQXWO5EGmO8l-KkQroynf8m5G6c0Uk66-9VdS=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPQOZ4rY8m8C-3DaFiGpI4xCFNJg7gk4UWjq6CS=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPmPgveCUsDERQg9PV7AmwX0IiTc60GjAwZUQlH=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMQ6S9PlZ_EO5-1dYjx4WdQo5Fxht6qVoFzrAiu=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM8zu015554AmS0tP_ALDLNm_t5M99qhb6BD-2W=w150-h150-k-no-p"]}], "resp": {"time": 1618968812767, "text": "Thank you Jennifer for such an awesome review.... We love y’all too."}, "gmap_id": "0x888bb21d843bff25:0xdbf1aea023c113c5"}
{"user_id": "116511980566051565991", "name": "Jill Scott", "time": 1620752462075, "rating": 5.0, "text": "This was hands down the best experience I've ever had with getting portraits taken. Rickey and Deb are friendly and accommodating, and the photographs are fantastic. I am quite pleased with my son's senior portraits. A big thank you to you both!", "pics": null, "resp": {"time": 1620756579909, "text": "Thank you Jill, we had so much fun getting to know you and Andrew.  We look forward to many more adventures!"}, "gmap_id": "0x888bb21d843bff25:0xdbf1aea023c113c5"}
{"user_id": "104159071056430067167", "name": "Teresa Towns", "time": 1621044232031, "rating": 5.0, "text": "I am always pleased with every photo shoot! Mr and Mrs Moore is very professional and patient when working with my family.", "pics": null, "resp": {"time": 1621045592881, "text": "Thanks Teresa for the kind words.... We love your family and can't wait for the next opportunity."}, "gmap_id": "0x888bb21d843bff25:0xdbf1aea023c113c5"}
{"user_id": "110540028889883161215", "name": "Layton Wiemer", "time": 1603398079952, "rating": 5.0, "text": "I cannot say enough about how excellent my experience was working with R L Moore Photography! Rickey was able to work me into his schedule without issue despite my request being with very short notice and the quality and value of the service he provided was outstanding. I would absolutely recommend him to anyone looking for a professional, experienced, and personable photographer for any purpose/event.", "pics": null, "resp": {"time": 1603398909677, "text": "Thanks Layton for the kind words . . . We truly enjoyed working on your project and look forward to what the future holds for you.  Let us know when we can serve you again."}, "gmap_id": "0x888bb21d843bff25:0xdbf1aea023c113c5"}
{"user_id": "104126064964193064311", "name": "jwtotherow", "time": 1564748062461, "rating": 5.0, "text": "Rl Moore Photography is the best.  His sense of humor will keep you smiling for the best pose.", "pics": null, "resp": {"time": 1564750424705, "text": "Thank You Jack. . . it is easy to smile around you and your wonderful family."}, "gmap_id": "0x888bb21d843bff25:0xdbf1aea023c113c5"}
{"user_id": "114232616457993850332", "name": "Robert Houston", "time": 1413685679071, "rating": 5.0, "text": "When I think of R L Moore Photography, LLC, these words come to mind:\n\n1.  Service above self\n2.  Customer's first\n3.  Integrity\n4.  Value driven\n5.  Character\n6.  I am not done until the job is done right\n7.  Results driven\n\nIf you want someone that can provide a holistic approach to your business opportunity, you need not look any further.\n\nRobert Houston - R&R Consulting - Speaking with a Purpose", "pics": null, "resp": null, "gmap_id": "0x888bb21d843bff25:0xdbf1aea023c113c5"}
{"user_id": "115318794814944940369", "name": "Sam Castillo", "time": 1471967594445, "rating": 5.0, "text": "Mr. Moore completed a virtual tour of Christian Corner Meats, and he did a great job. Nice guy, good heart. Highly recommended.", "pics": null, "resp": {"time": 1471971834682, "text": "Thanks Sam for the review.... It is always a pleasure working with Christian Corner Meats...."}, "gmap_id": "0x888bb21d843bff25:0xdbf1aea023c113c5"}
{"user_id": "103217788467077880933", "name": "Bill Armistead", "time": 1604716468891, "rating": 5.0, "text": "Image Hive did an outstanding job of transferring over 100 super eight videos onto a thumb drive with outstanding quality. And, they are right here in Birmingham. So there is no need to box up your videos and ship them off to another state to have them transferred. I could not be more pleased!  I highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "110914903018948010338", "name": "Theodore Campbell", "time": 1614076726838, "rating": 5.0, "text": "Great quality in and out I no time fast service will use again", "pics": null, "resp": {"time": 1614135354397, "text": "Thank you, glad we could help."}, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "107947153725319859167", "name": "D. Seibert", "time": 1579375895579, "rating": 5.0, "text": "The staff at Image Hive are incredible to work with!  So far, they have done script prep, teleprompter, studio shooting and final editing of over 30 of my online course videos and are now working on a new course with me.  I just love working with Steven, Dimi, Kat and the others there, that are most professional and caring about me and my projects.  They go overboard and I would strongly recommend them if you have a video project.", "pics": null, "resp": {"time": 1579544761841, "text": "Dear Don, thank you so much for your kind words. You are a great client to work with too. We hope your goal for many more people quit smoking be very successful."}, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "104356530368415532220", "name": "Barbara Franklin", "time": 1558556091270, "rating": 5.0, "text": "I prepared a video history for my organization and had Image Hive to reproduce it for me.  Kat was so helpful.  She converted the format, added chapters, assisted me with the cover graphics and produced my requested copies very quickly.  She provided superb service and helped us provide an amateur video that looked professional.  Everyone was pleased.  She was great and very professional.  Thanks, Kat.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "112946115069474444206", "name": "CLIFF STROUT", "time": 1559082988847, "rating": 5.0, "text": "When my mother in law passed away, I took her old 8mm Home movies to these people. They went above and beyond cleaning the dust, adding shots of film titles in her handwriting. They made a wonderful movie for us as a family keepsake. Everyone loved it.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "115173656244661117081", "name": "Jacob delaRosa", "time": 1547494097918, "rating": 5.0, "text": "Image Hive is my go-to choice for studio rental when I need an indoor location for my clients. They offer all the lighting equipment and backdrops you could ask for. Their enormous cyc wall is just amazing! You can comfortably shoot anything from products, large groups of people and even vehicles in their space. They also offer film scanning services for old home movies on VHS and super 8 film. Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "114437570016322460272", "name": "Jeff Nelson", "time": 1558466826083, "rating": 5.0, "text": "We had several old 8mm movie reels that we needed transferred to digital and DVD formats.  The results were great and we were very happy.  I would recommend your services to anyone with a similar need.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "101039468108346282478", "name": "Micah Wade", "time": 1547315488676, "rating": 5.0, "text": "The folks at Image Hive have been helping me secure my family’s memories for over three years now. Steven, Mark, and their staff are professional and helpful. As a mom, I was so stressed out about saving videos of my children, since I didn’t have the time or skills to do it on my own. Someone referred me to Image Hive and I’ve been so relieved ever since. They also run regular specials! 5 STARS, Image Hive!", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "113249054387056761263", "name": "Hilda Johnson", "time": 1558613663049, "rating": 5.0, "text": "Great job on my videos and great people to work with. Very quick return getting my videos back. Very pleased and anxious to have more done.\nHilda Johnson", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "109268273710875462007", "name": "Lee Winnige", "time": 1558462254581, "rating": 5.0, "text": "These guys did a great job of scanning my old family photos. Great service and friendly staff. I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "111309645251360108410", "name": "Richard Schlinkert", "time": 1578065424867, "rating": 2.0, "text": "I took in about thirty 35mm slides to transfer to digital, and while they turned the order around quickly, the slides had dust and lint in them and were very low resolution for the cost, which is about twice what the mail-in services charge for twice the resolution.  Unless you are in a hurry, look elsewhere", "pics": null, "resp": {"time": 1578078597457, "text": "Thank you for sharing your experience with us.  We're sorry that the final results of your scanning order did not meet your expectations.  We pride ourselves on giving each order personal attention and all of the work we do is done in our Birmingham location (in the historic Avondale neighborhood).\nWe recall your order very clearly.  You chose our PROOF quality (700 ppi) for your slide scanning order, which our lowest resolution (and lowest priced).  We also offer ARCHIVE quality scans (1700 ppi) at a slighlty higher cost.  Our scanning service, whether Proof or Archive level, includes the utilization of dust removal software, which can remove superficial debris and blemishes on the scanned images.\nOur technician specifically noted the high concentration of dust on your slides before scanning your slides.  Prior to scanning your order, our tech  attempted to manually clean each of your slides by hand to remove the dust and lint you described.  Unfortunately, dust and lint are often stuck to the film itself and may not be removed except by rewashing or physically wiping the film with a chemical solution.\nWe are generally unwilling to do such aggressive cleaning, out of fear we might damage our clients irreplaceable originals.  More often, if the condition of the originals is so bad that our usual cleaning and post-production are insufficient, we can do restorastion to the scanned images.  This digital retouching is not inexpensive, but for extremely valuable or badly deteriorated images, it is often the best option.\nAgain, we're sorry to hear you were not completely satisfied with our service.  We would welcome the opportunity to regain your confidence."}, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "103333855802638099393", "name": "Floyde Young", "time": 1607305734144, "rating": 5.0, "text": "Nice spot for photography", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "117818375670235475378", "name": "Dave Loftin", "time": 1558476871063, "rating": 5.0, "text": "Image Hive did a great job transferring some old video tapes for me. Awesome folks to deal with.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "110791981266546984577", "name": "Lisa Wienhold", "time": 1546988468648, "rating": 5.0, "text": "Hive did a great job with a bunch of old family photos.  I was very pleased.   Fast great service !", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "109031672118015331782", "name": "Robin Anderson", "time": 1572474512907, "rating": 5.0, "text": "Very helpful staff, she did a great job, this is a good place!", "pics": null, "resp": {"time": 1572478428230, "text": "Thank you! Cat is wonderful, glad to hear from happy customers!"}, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "111820436179064136417", "name": "tania mendoza", "time": 1476826841000, "rating": 5.0, "text": "I rented the photography studio at Image Hive recently to see if I could get a professional-looking profile pic for my CV, having a friend to take the picture instead of hiring a professional photographer. It turned out way better than I'd imagined. I'm so glad we did it ourselves! The place has a very creative vibe about it and the people there were very encouraging and helpful, without being intrusive. I also discovered that they convert all kinds of old media, like vhs tapes, film reels, and slides to digital. So, I'll be making a return trip after I go through my closets!", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "103003612105934390320", "name": "Linda Bryant", "time": 1533832827361, "rating": 5.0, "text": "Great studio rental price. The people at Image Hive are experanced and helpful. Overall perfect shoot.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "107842547183007232002", "name": "Tyler Kemp", "time": 1533753591342, "rating": 5.0, "text": "Great and experanced staff. Great studio for everything I needed. They also do film and tape transfers!", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "107842547183007232002", "name": "Tyler Kemp", "time": 1533753591342, "rating": 5.0, "text": "Great and experanced staff. Great studio for everything I needed. They also do film and tape transfers!", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "117513114308618465022", "name": "Jennifer Ralph", "time": 1546893925000, "rating": 5.0, "text": "Image Hive converted some of my old VHS tapes to DVD's and computer files, and I was very pleased with the service and results!", "pics": null, "resp": {"time": 1546896244992, "text": "Great, thank you so much for great review! We are so happy we were able to help!"}, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "107479741111646750395", "name": "Lee Walthall", "time": 1558562213953, "rating": 5.0, "text": "Image Hive has helped me convert old video recordings to digital files and duplicate CDs on several occasions and I was extremely pleased with their timely high quality service and reasonable price", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "101134386956469162515", "name": "elizabeth cypher", "time": 1559081570094, "rating": 5.0, "text": "Staff very knowledgeable and efficient. Prompt and just what I needed!", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "107237744589396884880", "name": "Collin Balentine", "time": 1533740724101, "rating": 5.0, "text": "Had a great studio perfect for shooting photography and video.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "114529658832792709921", "name": "Dima Ant", "time": 1464723079142, "rating": 5.0, "text": "Service is great and fast. Everything was done to my specifications. Great people in general.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "108459037081760182904", "name": "Cameron Balentine", "time": 1533143191604, "rating": 5.0, "text": "Can restore and duplicate and enlarge old photos..check them out! Great poster size made at a great price!", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "111647182964218600487", "name": "Mike Bryant", "time": 1533753306192, "rating": 5.0, "text": "Had a great set-up and knowledgeable staff. Also flexiable with time.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "101888309380030128580", "name": "Norman Virciglio", "time": 1491255009466, "rating": 5.0, "text": "Great Job on transferring 50 year old 8mm to digital.", "pics": null, "resp": null, "gmap_id": "0x88891a5120593795:0x418ab9e005e5647d"}
{"user_id": "105520675178066408246", "name": "Abbey Bice", "time": 1519736049336, "rating": 5.0, "text": "my grandfather works the take your pic  also amazing action and individuals 💯💯id rate a 5 star plz", "pics": null, "resp": null, "gmap_id": "0x88628440b90397e9:0xf04f6d5692d7d4d7"}
{"user_id": "103276174758767265745", "name": "Patricia Holt", "time": 1562852336890, "rating": 4.0, "text": "Great fun change of food to enjoy", "pics": null, "resp": null, "gmap_id": "0x88628440b90397e9:0xf04f6d5692d7d4d7"}
{"user_id": "102880256479452405413", "name": "vickey tomas", "time": 1567123793034, "rating": 5.0, "text": "Went to the New Eporium, it is a great shop, in the back is Let's on photo shop. I loved all the homemade soaps, all the jewelry us one if a kind! Lisa Letson has done a great job", "pics": null, "resp": null, "gmap_id": "0x887d48b4cf7d5547:0x103762639cfa006f"}
{"user_id": "107537353608067489381", "name": "Donna Davis", "time": 1568153466112, "rating": 1.0, "text": "Wow.  As grandparents, we received a link to see the photographs of our granddaughter.  The price list was so blurry that we could not read it and it was not on the website.  The pictures of our newborn granddaughter were on a very busy, multi colored quilt which did not highlight our granddaughter.  We selected a photograph from the limited selection that we wanted to purchase for our home.  After meeting and looking over the photographs, we called for pricing.  \"Lisa\" who answered the telephone was asked for pricing.  She inquired how we were related to the baby and stated that they were not trying to 'hide\" the pricing.  I told her the price list was blurry and we did not infer that they were hiding anything.  We told her that we were interested in one photograph to which she grumbled \"only one\" and asked what size.  I told her that we would like to see a price list but we only have 45 minutes left to order due to the deadline.  She curtly stated that we had \"one week\" to call or decide on an order.  Unfortunately, it took us this long with our work schedules to take time to call about the price list and have everything ready to place an order.  However, we were still within our allotted time frame.   We told her that we were interested in pricing on an 8x10 or larger since we were not sure what sizes they offered at this studio.  She barked out the prices for an 8x10 and a 5x7 then demanding to know what we wanted to order.  I told her that we would hire our own photographer rather than order from her since she did not sound like she wanted to me a sale.  Sadly, we did not order from this studio due to the unprofessional staff on the telephone.  My husband asked who we had spoken to so I called back and asked \"Lisa\" if there was someone else or a manager that we could speak to and she replied that she was \"the owner\".  I thanked her and hung up.  She was snickering, barking, and making other annoying sounds during the conversation to which the children in the car commented how rude and nasty she was in both phone calls.\nApparently, this studio does not need our business or yours since the \"owner\" can rudely talk to customers who want to order even one photograph.  We were looking to order a large 16x20 or 24x36 photograph of our granddaughter but we could not get information on the larger sizes when calling to inquire over the phone.\nThe photographs were not tasteful, nor well laid out to compliment a baby.  If you are looking for artist, skilled photographs it would suit you to look further than this studio/photographer.  Walmart would be able to offer you same level of artistry with better customer service.", "pics": null, "resp": null, "gmap_id": "0x887d48b4cf7d5547:0x103762639cfa006f"}
{"user_id": "109651106447361655813", "name": "Vicki Alewine", "time": 1554743017303, "rating": 5.0, "text": "Nice, love it!", "pics": null, "resp": null, "gmap_id": "0x887d48b4cf7d5547:0x103762639cfa006f"}
{"user_id": "110107421618750053689", "name": "Rachel Rhodes", "time": 1588438622806, "rating": 4.0, "text": "Suzannah does a great job doing photos for our dance studio. She is always very helpful when choosing and picking up the prints also.", "pics": null, "resp": null, "gmap_id": "0x888c471ecf06d0db:0x8d971a307ac74190"}
{"user_id": "115036345216611178341", "name": "Linda Singleton", "time": 1578273163441, "rating": 5.0, "text": "She is such a great photographer, with a awesome personality.\nFor some really great photos of those special moments, suzannah is the perfect person.\nHer prices are as awesome as her photos.\nHighly reccomended", "pics": null, "resp": null, "gmap_id": "0x888c471ecf06d0db:0x8d971a307ac74190"}
{"user_id": "114457028610680257555", "name": "Sabrina Johnson", "time": 1570597728575, "rating": 5.0, "text": "I have known Suzanna for 25 years or more, she has been in business for atleast that long. Her work is great and prices have always been reasonable.", "pics": null, "resp": null, "gmap_id": "0x888c471ecf06d0db:0x8d971a307ac74190"}
{"user_id": "103314777823663876025", "name": "Aimee Turner-Holloway", "time": 1539922667396, "rating": 5.0, "text": "An amazing photographer! We love all our pictures that come from her that she takes of our kid's sports teams and solo pictures!", "pics": null, "resp": null, "gmap_id": "0x888c471ecf06d0db:0x8d971a307ac74190"}
{"user_id": "107300596541943533295", "name": "Steve E", "time": 1535329218577, "rating": 5.0, "text": "Susannah does fantastic work. I highly recommend", "pics": null, "resp": null, "gmap_id": "0x888c471ecf06d0db:0x8d971a307ac74190"}
{"user_id": "106444758285217352981", "name": "Carrie Lloyd", "time": 1545245349555, "rating": 5.0, "text": "Suzannah and her staff are very friendly, great prices, cozy atmosphere", "pics": null, "resp": null, "gmap_id": "0x888c471ecf06d0db:0x8d971a307ac74190"}
{"user_id": "103854199547802522312", "name": "jennifer jarvis", "time": 1531581522681, "rating": 5.0, "text": "Very professional. Great quality studio pictures.", "pics": null, "resp": null, "gmap_id": "0x888c471ecf06d0db:0x8d971a307ac74190"}
{"user_id": "113025167355354586474", "name": "You see me now", "time": 1463143303999, "rating": 5.0, "text": "Brilliant photographer know how to capture the right angle.", "pics": null, "resp": null, "gmap_id": "0x888c471ecf06d0db:0x8d971a307ac74190"}
{"user_id": "116899332994094093470", "name": "Christine Tourtellot", "time": 1617213009912, "rating": 5.0, "text": "Best photographer for any of your needs.", "pics": null, "resp": null, "gmap_id": "0x886211a95648aae9:0x112b78d4649ecf47"}
{"user_id": "107249464403708671078", "name": "Jason Bragg", "time": 1540772721479, "rating": 5.0, "text": "Great place for a photo shoot!  Maria does a fantastic job coordinating and setting up some superb shots for you and your family.", "pics": null, "resp": null, "gmap_id": "0x886211a95648aae9:0x112b78d4649ecf47"}
{"user_id": "105882763110776208651", "name": "Angel Hernandez", "time": 1544581997870, "rating": 5.0, "text": "Loved the experience", "pics": null, "resp": null, "gmap_id": "0x886211a95648aae9:0x112b78d4649ecf47"}
{"user_id": "110792094125388460028", "name": "Tiffany Cope", "time": 1619372349130, "rating": 4.0, "text": "Typical school photographer. Took decent photos of the kids at school. But I would REALLY love if he had more color background choices for fall photos other than Basic B**** Blue. Pleeeeeeease?!", "pics": null, "resp": null, "gmap_id": "0x88626f6ab3b43197:0x4b9213fda9bfd824"}
{"user_id": "116899332994094093470", "name": "Christine Tourtellot", "time": 1617212910840, "rating": 5.0, "text": "Always a pleasure doing business with Greg Machen Photography.", "pics": null, "resp": null, "gmap_id": "0x88626f6ab3b43197:0x4b9213fda9bfd824"}
{"user_id": "110425815788760099512", "name": "Darlene Hanson", "time": 1607597250567, "rating": 1.0, "text": "Very expensive quality not the best for the price", "pics": null, "resp": null, "gmap_id": "0x88626f6ab3b43197:0x4b9213fda9bfd824"}
{"user_id": "104897628157350062970", "name": "Middle Tennessee", "time": 1608598948846, "rating": 5.0, "text": "Great photographer.", "pics": null, "resp": null, "gmap_id": "0x88626f6ab3b43197:0x4b9213fda9bfd824"}
{"user_id": "112479041722214482072", "name": "cindi purinton", "time": 1564262252675, "rating": 5.0, "text": "So..., our school uses Greg solely for Senior portraits.  $40 just for the sitting fee. I've had three to get their senior pictures with him and they've all turned out amazing.  Pricy but you can't put a price tag on visual memories that only happen once.", "pics": null, "resp": null, "gmap_id": "0x88626f6ab3b43197:0x4b9213fda9bfd824"}
{"user_id": "109609616256795952437", "name": "valerie bryson", "time": 1581102436636, "rating": 5.0, "text": "I'm very pleased with my son Senior Pictures...", "pics": null, "resp": null, "gmap_id": "0x88626f6ab3b43197:0x4b9213fda9bfd824"}
{"user_id": "101592339923168775432", "name": "Sarah Mabe", "time": 1538419295335, "rating": 3.0, "text": "Great service, the pics were easy to take. My only problem was that senior portraits are supposed to look amazing. I look like a horse. I dont like any of the pictures and am very disappointed because the lighting makes my nose take up the whole picture.", "pics": null, "resp": null, "gmap_id": "0x88626f6ab3b43197:0x4b9213fda9bfd824"}
{"user_id": "100754645069294340966", "name": "Donna Cannington", "time": 1571331156092, "rating": 4.0, "text": "The ladies there were very understanding with my case\n\ne", "pics": null, "resp": null, "gmap_id": "0x88626f6ab3b43197:0x4b9213fda9bfd824"}
{"user_id": "116415718567438874856", "name": "Jen Kontak", "time": 1565659012774, "rating": 5.0, "text": "Great location shoots for senior portraits!", "pics": null, "resp": null, "gmap_id": "0x88626f6ab3b43197:0x4b9213fda9bfd824"}
{"user_id": "106588830710280263857", "name": "Christelle Lindner", "time": 1525894425055, "rating": 5.0, "text": "Not only are the portraits beautiful, but the staff is absolutely wonderful. I will recommend this photography studio to all of my friends and family.", "pics": null, "resp": null, "gmap_id": "0x88626f6ab3b43197:0x4b9213fda9bfd824"}
{"user_id": "111905319049094593029", "name": "lastride881", "time": 1542311015105, "rating": 5.0, "text": "The girls took great care of my needs", "pics": null, "resp": null, "gmap_id": "0x88626f6ab3b43197:0x4b9213fda9bfd824"}
{"user_id": "114245430278871686579", "name": "Jeremy Schram", "time": 1516066704788, "rating": 5.0, "text": "These guys are the best in town hands down. Beautiful photos and wonderful customer service!!!", "pics": null, "resp": null, "gmap_id": "0x88626f6ab3b43197:0x4b9213fda9bfd824"}
{"user_id": "112711541959540653161", "name": "Comedian Crayz Ray “Crayz Ray” Scanlon", "time": 1521231678836, "rating": 5.0, "text": "Owner is one heck of a nice guy. Very talented and a gentleman!", "pics": null, "resp": null, "gmap_id": "0x88626f6ab3b43197:0x4b9213fda9bfd824"}
{"user_id": "113222896924400143285", "name": "Monicka Lemon", "time": 1565139968108, "rating": 4.0, "text": "They take great pictures", "pics": null, "resp": null, "gmap_id": "0x88626f6ab3b43197:0x4b9213fda9bfd824"}
{"user_id": "104562390493820542910", "name": "Matty B", "time": 1577585193298, "rating": 5.0, "text": "Great School Pics", "pics": null, "resp": null, "gmap_id": "0x88626f6ab3b43197:0x4b9213fda9bfd824"}
{"user_id": "100746528732323536390", "name": "Tabatha Castelein", "time": 1509674003334, "rating": 4.0, "text": "Just wish they would have more staff.. But the staff that was there was so friendly.", "pics": null, "resp": null, "gmap_id": "0x88626f6ab3b43197:0x4b9213fda9bfd824"}
{"user_id": "113720271610981160347", "name": "Jodie Dietz", "time": 1563582439891, "rating": 3.0, "text": "Excellent customer service", "pics": null, "resp": null, "gmap_id": "0x88626f6ab3b43197:0x4b9213fda9bfd824"}
{"user_id": "118094068161250156099", "name": "Delaina Foust", "time": 1519787266071, "rating": 3.0, "text": "They were really nice and friendly", "pics": null, "resp": null, "gmap_id": "0x88626f6ab3b43197:0x4b9213fda9bfd824"}
{"user_id": "109073266735438285424", "name": "avitra johnson", "time": 1539268091363, "rating": 5.0, "text": "Great work", "pics": null, "resp": null, "gmap_id": "0x88626f6ab3b43197:0x4b9213fda9bfd824"}
{"user_id": "110067526458136944876", "name": "Devin Kirkley", "time": 1521251801953, "rating": 5.0, "text": "Great place good people", "pics": null, "resp": null, "gmap_id": "0x88626f6ab3b43197:0x4b9213fda9bfd824"}
{"user_id": "101468179129942731537", "name": "Rose Rayborn", "time": 1507133146506, "rating": 5.0, "text": "A nice place", "pics": null, "resp": null, "gmap_id": "0x88626f6ab3b43197:0x4b9213fda9bfd824"}
