{"user_id": "113556854975709947808", "name": "Nathan Wise", "time": 1629242226015, "rating": 1.0, "text": "We found the representative to be nice, but didn’t seem to be able to answer my brother in laws questions with confidence. I checked out the sheds…they looked nice, but told told him to pass. It looked like particle board that was used. These things are an investment as they are very expensive, and I just don’t believe that these sheds will last the test of time.", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0xad45a5db47081659"}
{"user_id": "102686758324697369874", "name": "Kolby Smythe", "time": 1629310351758, "rating": 5.0, "text": "My family has been in the construction business for over 30 years and I can say that these buildings will absolutely stand the test of time. No other shed company we looked into could back their buildings with a written lifetime warranty as well. Our HOA was also very impressed with their quality, had no issues at all getting it approved.", "pics": null, "resp": {"time": 1630450965057, "text": "Kolby, we're so glad you were able to quickly get it approved with your HOA. We do pride ourselves on building something that lasts. Thanks so much for your kind review!"}, "gmap_id": "0x888ccde614f9cee3:0xad45a5db47081659"}
{"user_id": "118020065659956939654", "name": "Ralph Scoggins", "time": 1628019440840, "rating": 5.0, "text": "Nick was super easy to work with and made the sales process painless. I would definitely buy another shed from Cook.", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0xad45a5db47081659"}
{"user_id": "107711632589647721452", "name": "Ted Taylor", "time": 1626348970579, "rating": 1.0, "text": "Save yourself a trip and avoid this place at all costs. Their fees on the rent 2 own is nothing but a rip off, and the shed is ok at best. Nothing special, unless you like exorbitantly overpaying.", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0xad45a5db47081659"}
{"user_id": "117701161048576930794", "name": "George Masey", "time": 1625946877521, "rating": 1.0, "text": "I stopped by this place wanting to compare quality/prices.\nHonestly, I never got to the point of pricing them because the build quality was so terrible. They used some type of fiber board for the siding and OSB fir the flooring. I’ve never seen such terrible choices if materials. This thing would rot out in a few years.", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0xad45a5db47081659"}
{"user_id": "114503642027172203631", "name": "Johnnie Ferguson", "time": 1616894011047, "rating": 1.0, "text": "We drove by a total of 3 times and nobody has ever come to help us.\n\nWhen we left and called on the phone, all they wanted to do was give rent to own monthly payments.\n\nI’ve never done anything in a rent to own in my life, and am not going to start now.\n\nNot to mention non existent customer service.\n\nCan you say, rip off company!", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0xad45a5db47081659"}
{"user_id": "106081842701387480960", "name": "Jack Wodock", "time": 1628723029229, "rating": 4.0, "text": "Cook is clearly the highest quality building in the business. Buying any other is a big step down", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0xad45a5db47081659"}
{"user_id": "110293395556016266208", "name": "Alfred Williams", "time": 1628714253785, "rating": 5.0, "text": "I got my wife a she-shed here. Best thing I've done for us in years.", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0xad45a5db47081659"}
{"user_id": "102139178190234782846", "name": "Rashad Williams", "time": 1628298600268, "rating": 1.0, "text": "Shed seemed way to expensive for what you get. Dude was ok, but those rent to own payments were ridiculously high.", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0xad45a5db47081659"}
{"user_id": "106561184026569098049", "name": "Christopher Dill", "time": 1628797984285, "rating": 5.0, "text": "Very easy to deal with, didn't feel pressured into buying anything. Customer service was great, delivery took a while but totally worth the wait.", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0xad45a5db47081659"}
{"user_id": "104197045674190654429", "name": "Brenda Hughes", "time": 1623237316674, "rating": 1.0, "text": "Repo or 45% on a refinance during a pandemic because of a missed/late payment?? Absolutely disgusting.", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0xad45a5db47081659"}
{"user_id": "106114613223984224467", "name": "Jody Johnson", "time": 1614686818313, "rating": 1.0, "text": "We’ve driven by a total of 3 times...and all 3 times either no one was there, or no one would come out to help us.\n\nWe did browse around at the sheds they had on site. Frankly we were not impressed as they look like they were made of particle board. We had a house in Montgomery made of Masonite years ago, and the stuff they are using reminds me of that.\n\nI was not impressed with this company at all, and recommended anyone to look elsewhere!", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0xad45a5db47081659"}
{"user_id": "100657596345910347449", "name": "Christina Dunn", "time": 1599582321194, "rating": 1.0, "text": "My Husband and I visited Cooks portable building on July 18 2020 . After looking at Several we finally chose a 8× 10 Lofted Barn .The Salesman was Very Nolagable in helping us decide .We Signed our Contract and made a Deposit of 100.00 and went on our way planning for our she'd to Arrive in maybe a month .On Monday the 20th I received a call from the Salesman letting me know he made a mistake and our she'd had to be Custom built but I also needed to pay another 100.00 for , Okay I'm okay with that ! I received a Email from Corporate on August 14th that I have a Scheduled Delivery for Either September the 7th or the 14th .I contacted Corporate Today September 9th to see if our She'd is on Schedule ,I was Told it was being Built 🤔.It has been almost 3 months and I still have no shed and don't know when I will receive it .Be prepared to wait on your shed or use another company .If I don't receive my shed by the 18th of September I will not be needing the one I ordered .", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0xad45a5db47081659"}
{"user_id": "117580304372656410757", "name": "Martha Sheldon", "time": 1621651035764, "rating": 1.0, "text": "Extremely predatory lending practices. Buyer beware and then just go somewhere else.", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0xad45a5db47081659"}
{"user_id": "108483987176597717664", "name": "Ryan Masterson", "time": 1621133085429, "rating": 1.0, "text": "45% apr for a refinance or repossession of the building when the customer was sick during the pandemic and asked for an extension on the payment. Unprofessional and sickening.", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0xad45a5db47081659"}
{"user_id": "115795374763279265688", "name": "Elsie Jordan", "time": 1620783326564, "rating": 1.0, "text": "You don’t get to just take things from people because they are down on their luck and 45% refinancing!?!? That is price gouging. Do not take your business here.", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0xad45a5db47081659"}
{"user_id": "115836371105306869644", "name": "Debra Miller", "time": 1629729224358, "rating": 5.0, "text": "Very kind and respectful people", "pics": null, "resp": {"time": 1630450706017, "text": "Thank you Debra so much for your kind review!"}, "gmap_id": "0x888ccde614f9cee3:0xad45a5db47081659"}
{"user_id": "115114112563246074724", "name": "George Massey", "time": 1628178396174, "rating": 5.0, "text": "I did business with this company and they were legit. I would buy from them again.", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0xad45a5db47081659"}
{"user_id": "114386139346999779823", "name": "Ean Ross", "time": 1598750824254, "rating": 1.0, "text": "I didn’t see where the sales rep was professional at all. It looked like they used OSB on the walls. I  can’t imagine that stuff lasting a long time. For the prices they asked, I figured they’d offer Hardi Plank or something much longer lasting.", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0xad45a5db47081659"}
{"user_id": "112605343904602316961", "name": "Emily Burnside", "time": 1597884358555, "rating": 1.0, "text": "The sheds don’t look bad from the outside. On the inside is when I was very disappointed. Homemade doors like on a wooden fence and my daddy called it chipped board siding. My daddy bought a shed from Cooks in Valdosta in the 80’s when I was a little girl, but he said his was much better built then than these are now.\n\nAlso, me and my husband have great credit, and they have no financing options that we saw at all. Only options were for people with bad credit.\n\nDue to these reasons we didn’t buy from this business, and couldn’t recommend others to buy from them either.", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0xad45a5db47081659"}
{"user_id": "111969406603865922186", "name": "Melissa Cooper", "time": 1599184224214, "rating": 1.0, "text": "Do yourself a favor and go somewhere else. The other 1 star reviews are legit.  I called, very rude man. Glad I didn't pursue a purchase. My neighbor, who initially referred me to this company, is totally being screwed on their rent to own.", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0xad45a5db47081659"}
{"user_id": "115577332740289287785", "name": "Victoria Cooley", "time": 1604519340737, "rating": 5.0, "text": "I enjoyed working with this local business. Great and reliable people.", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0xad45a5db47081659"}
{"user_id": "108843483410265615999", "name": "Famous Nate", "time": 1585964911127, "rating": 5.0, "text": "Nick was super easy to deal with, found a killer shed to turn into an outdoor \"mini bar\" next to our pool. Thanks again! We'll definitely be back when we move on to our next venture!", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0xad45a5db47081659"}
{"user_id": "111270176133659528723", "name": "Perry Mack", "time": 1618888209554, "rating": 1.0, "text": "You couldn’t give to me these cheap sheds. Pressed board siding and sky high prices!", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0xad45a5db47081659"}
{"user_id": "118374993648195116275", "name": "Jerome Stinson", "time": 1617388568869, "rating": 5.0, "text": "Reasonable price and easy to deal with", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0xad45a5db47081659"}
{"user_id": "117003808437283754570", "name": "Ron Caudill", "time": 1552828296183, "rating": 2.0, "text": "Local sales rep (Nick) is great, building quality is great, delivery and corporate support not so great.   I ordered a building on 1/31/19.   I've taken two days off work to meet the delivery person, only to have them cancel a couple hours ahead of time.  Last cancellation was last Wednesday 3/13/19.   I asked Tim Cook when it would be delivered and the answer I get is he can't tell me, he has no idea.   Finally the local rep Nick found out it is scheduled for 3/25/19  Who knows if they will meet that.  If I can find a building somewhere else that can be delivered before then I'm cancelling the Cook building.  It has been sitting on the lot in Phenix City for two weeks now, they just can't get it delivered.     I was offered a solution, I could hire and pay for an outside source to deliver it.    If you can live with a you get when you get it attitude, then consider these guys.  If you need a building by a certain date, I wouldn't recommend Cooks.", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0xad45a5db47081659"}
{"user_id": "102450828965634747917", "name": "Mike Hutton", "time": 1583263526141, "rating": 1.0, "text": "I can’t ever find anyone here. Not to mention it looks like all their buildings are made of particle board. Not impressed at all!", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0xad45a5db47081659"}
{"user_id": "107746038493979577044", "name": "Paul Ford", "time": 1594465861553, "rating": 1.0, "text": "I wasn’t impressed with their product, or lack of professionalism.", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0xad45a5db47081659"}
{"user_id": "105267556263620948704", "name": "Dominic Marchio", "time": 1538407168192, "rating": 5.0, "text": "Excellent construction and friendly customer service!", "pics": null, "resp": null, "gmap_id": "0x888ccde614f9cee3:0xad45a5db47081659"}
{"user_id": "108532172732616349604", "name": "Rebecca Law", "time": 1623423413279, "rating": 5.0, "text": "Buildings Plus has closed. No longer in business. There's a landscaping company there now. McKracken Landscaping.", "pics": null, "resp": null, "gmap_id": "0x8888ab8e8dfb575f:0x135110b7dbd88352"}
{"user_id": "100893983935156827066", "name": "Taylor Wall", "time": 1487193480688, "rating": 5.0, "text": "Customer for life!!! From start to finish they made buying a new shed simple & easy. They delivered my new shed and had it set & level faster than I thought. The quality & craftsmanship of my new shed is excellent as well. Best prices, best terms on a rent to own, & best of all they are a Christian family owned business. If your in the market for a new shed or larger building, go here first.", "pics": null, "resp": null, "gmap_id": "0x8888ab8e8dfb575f:0x135110b7dbd88352"}
{"user_id": "101098322576540633883", "name": "michael price", "time": 1444932241232, "rating": 5.0, "text": "Friendly staff. Just a hard place to find", "pics": null, "resp": null, "gmap_id": "0x8888ab8e8dfb575f:0x135110b7dbd88352"}
{"user_id": "102729073691078060204", "name": "Tom Katt", "time": 1623717880291, "rating": 5.0, "text": "Thanks for the great service 😀", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPj_ewnIlGPwrXM0pjE1XJur3ll2wo3u0HM78IX=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNGptr3kkR1CFsga8_IymRDiCQrOMZd4wzxIDY9=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889c934bbe20fc1:0x25b9d0710d74a833"}
{"user_id": "101475333215905469502", "name": "Tammie Johnston", "time": 1619451358073, "rating": 5.0, "text": "I love this place. I keep coming back. They are always cheerful happy and helpful. I am always happy when I leave. I will go back to them verry soon.", "pics": null, "resp": null, "gmap_id": "0x8889c934bbe20fc1:0x25b9d0710d74a833"}
{"user_id": "109444102828961632556", "name": "Darron Park", "time": 1618305358202, "rating": 1.0, "text": "He missed a sale maybe two no one there sign read open waited long time", "pics": null, "resp": null, "gmap_id": "0x8889c934bbe20fc1:0x25b9d0710d74a833"}
{"user_id": "108337674812044215372", "name": "Enrique Gomez", "time": 1596986798320, "rating": 5.0, "text": "GREAT prices and Awesome Customer Service!", "pics": null, "resp": null, "gmap_id": "0x8889c934bbe20fc1:0x25b9d0710d74a833"}
{"user_id": "105274598891415876840", "name": "Calm Delinquent", "time": 1593455659062, "rating": 5.0, "text": "Super friendly helps with your budget highly recommended", "pics": null, "resp": null, "gmap_id": "0x8889c934bbe20fc1:0x25b9d0710d74a833"}
{"user_id": "114331596391117536749", "name": "Lindsey Dilworth", "time": 1499459429532, "rating": 5.0, "text": "Wonderful place! Ordered a metal shed and the man was so kind and organized getting our order placed and shed delivered. Will use them again. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8889c934bbe20fc1:0x25b9d0710d74a833"}
{"user_id": "116371475737741208232", "name": "Jordan Dilworth", "time": 1515277382489, "rating": 5.0, "text": "We bought a shed from here. It was super easy, Calvin was very helpful in offering assistance. If there's not a shed there, they will order you one. They offer financing as well.", "pics": null, "resp": null, "gmap_id": "0x8889c934bbe20fc1:0x25b9d0710d74a833"}
{"user_id": "111403256743468306614", "name": "Shontaea Heard", "time": 1628950740410, "rating": 5.0, "text": "The staff there is awesome. From Trevor the office sales person to the delivery drivers. They always keep alot of units on the lot but mostly everyone of them had a sold sign on them. However,  Trevor advised me what they had coming in and showed me the colors as well as the pictures. There customer service was awesome they went over and beyond to make sure they communicated with me before they left the lot with my unit and when they arrived at my home. Even though they arrived at my home before my daughter got there and they waited but advised me the information on what the cost if they redeliver. I have to say is that the patience and customer service was outstanding and I will continue to do business with them.", "pics": null, "resp": {"time": 1628957068649, "text": "Thanks for sharing your experience Ms. Heard. Customer service is our top priority. We appreciate your business and look forward to seeing you again."}, "gmap_id": "0x888c2be47bee9dd3:0x1ae331f54074da48"}
{"user_id": "115900982594637390968", "name": "Katie Bush", "time": 1628338901366, "rating": 1.0, "text": "I didn’t see anything here that I’d want to look at in my backyard. I work too hard to see an ugly metal shed when I’m drinking coffee in the morning. Not to mention they really hardly have anything to look at.", "pics": null, "resp": {"time": 1628342839786, "text": "Katie,\n\nThank you for your feedback. We agree in that what we offer is an affordable option for those looking for a quality aluminum shed at a great price. We understand this is not for everyone. We would advise going to H&H for more custom finish options that they custom build if this is the style you desire.\n\nBe Blessed!\n\n- Thrifty Buildings"}, "gmap_id": "0x888c2be47bee9dd3:0x1ae331f54074da48"}
{"user_id": "112560590275116012294", "name": "John Midkiff", "time": 1609808801639, "rating": 5.0, "text": "Trevor in the office is very helpful and informative on what best satisfies our needs. Luke came out to the possible location of the building to make sure that the unit we wanted would fit due to it not being accessible from the driveway, extremely courteous and helpful... second unit purchased from Thrifty !! Definitely Recommend !!", "pics": null, "resp": {"time": 1609853099752, "text": "Thanks John. We appreciate your business and the kind words. Thank you for being a loyal customer. Let us know if you need anything additional from us."}, "gmap_id": "0x888c2be47bee9dd3:0x1ae331f54074da48"}
{"user_id": "103397500160957285743", "name": "Chad Summers", "time": 1618888011942, "rating": 1.0, "text": "Very little to no selection of sheds. We found a much better selection and price at Premier Buildings’s.", "pics": null, "resp": null, "gmap_id": "0x888c2be47bee9dd3:0x1ae331f54074da48"}
{"user_id": "103599201115634406384", "name": "Max Walsh", "time": 1618013897211, "rating": 1.0, "text": "When we went here looking for a garden shed, there was hardly no inventory to choose from. Not to mention where I’m from in Massachusetts we would never build a shed that cheaply.", "pics": null, "resp": {"time": 1618014758243, "text": "Sorry for your experience. Our inventory is low because buildings are selling faster than our manufacturer can build them for us. We are happy to order a building for you. If you do not like the quality of the building, we hope you find something that satisfies you elsewhere. Good luck."}, "gmap_id": "0x888c2be47bee9dd3:0x1ae331f54074da48"}
{"user_id": "116056672547957122545", "name": "Renaye Perry", "time": 1609209915024, "rating": 5.0, "text": "The staff at Thrifty was nice, professional and efficient. Thanks for your excellent service. 🙂", "pics": null, "resp": {"time": 1609447369835, "text": "Thanks for the kind words. We appreciate your business."}, "gmap_id": "0x888c2be47bee9dd3:0x1ae331f54074da48"}
{"user_id": "104411177678826174532", "name": "Bruce Macpherson", "time": 1601991967750, "rating": 5.0, "text": "Love my new shed! The delivery guys were  excellent and installed it without any problems!", "pics": null, "resp": {"time": 1609447191497, "text": "Thanks Bruce. Enjoy your new portable building. Come see us when that one is full!!"}, "gmap_id": "0x888c2be47bee9dd3:0x1ae331f54074da48"}
{"user_id": "116276489916254423463", "name": "Clarence Kendrick", "time": 1606433723850, "rating": 1.0, "text": "I went to the lot expecting to find a large selection, and quite frankly I didn’t see where they had much of anything to choose from. The salesmen was nice, but frankly I’m not interested.", "pics": null, "resp": {"time": 1609447131870, "text": "We appreciate the feedback. Due to increased demand and shortages in supply, it has been difficult for us to keep stock buildings on our lots. Most of our building loads are pre-sold when they arrive. We are happy to order you a building if you are still interested. We have the best quality buildings you can buy. Call and ask for Trevor."}, "gmap_id": "0x888c2be47bee9dd3:0x1ae331f54074da48"}
{"user_id": "107104160488181744469", "name": "Shekita McGary", "time": 1549140508366, "rating": 4.0, "text": "Nice buildings!!", "pics": null, "resp": null, "gmap_id": "0x888c2be47bee9dd3:0x1ae331f54074da48"}
{"user_id": "115456278350109820792", "name": "Rodney Moody", "time": 1559057836249, "rating": 4.0, "text": "A quality and trustworthy company. They do a great job and are the best in the business.", "pics": null, "resp": null, "gmap_id": "0x889ba9a95d50b055:0x7becd5efda8b17ec"}
{"user_id": "106981070387540048851", "name": "Cora West", "time": 1582564394478, "rating": 5.0, "text": "Very professional, haven't purchased yet, but we're going to.", "pics": null, "resp": null, "gmap_id": "0x889ba9a95d50b055:0x7becd5efda8b17ec"}
{"user_id": "106477425478545141695", "name": "Renee Martin", "time": 1551284704878, "rating": 1.0, "text": "Fraudulent warranty. We purchased a shed 3 yrs ago. You can even call the business directly and their hold messages promise top quality craftsmenship. We told them the day we bought it that we were purchasing this to pay floor, put walls, heating and air, and create an apartment type space for my son. We were reassured and “sold” on the quality promised and the guarantee of it they stood by with their warranty. Since buying the building for $10,000 cash 3 yrs ago, we have had two leaking doors everytime it rains for 3 straight yrs. we have utilized the warranty each time. After the 4th or 5th time of having them try and fix it (we were promised a FIX not an attempt at a fix) we said we wanted our money back. We cannot lay floor over wet floor to be ruined. The entire operation has been halted for three whole YEARS waiting on this promised fixed. We were told to give them one more chance by completely replacing the inward swinging doors with outward swinging doors. If they did not fix it, they promised they would discuss with me a possible refund or partial refund. Even a 50% refund would allow us to have a porch made. At this point however, a 50% refund keeps me connected to a crooked company. They replaced the doors and the next rain came and it was still leaking. We took pictures each time of course. So I called in about the promised conversation about a refund. I was transferred to a lady who took my number and would call me back, and I never heard from her. In the mean time they were sending out (same repair man each time) the repair man to “fix” it for the 5th ish time. So he did, well I just went out there and it’s a soggy soaking wet mess again. This will be the SECOND time since what they called their “last resort” by replacing the doors. They basically told me if that didn’t fix it nothing would. So I have a 10,000 box in my yard. Even the mattresses we placed out there are now ruined from the leaking doors and had to be thrown away. I’m unable to use it. I called again today and they wanted to come “fix” it even tho they told me they had done everything they can. These floors in my opinion need to be replaced now by the doors if they’re going to keep it leaking. I didn’t pay for floors exposed to rain for 3 solid yrs. I asked again anout a refund and was told because the building is as old as it is, they can’t do anything about it. Well, it’s only as old as it is because they kept telling me they’d fix it. I’ve been kind and patient for 3 YRS! If they can’t stand by their written warranty statement to fix and REPAIR (not bandaid) the issue of THEIR building THEY built, the I deserve a refund! When you buy a car and the engine blows each time it’s replaced, you get another car under a warranty or a refund. It’s called a lemon at some point. They’re refuse to work with me.", "pics": null, "resp": null, "gmap_id": "0x8889c9e2e7679e99:0xd3031e9ff6035b08"}
{"user_id": "111459257107851597270", "name": "Kim Gray", "time": 1595854365941, "rating": 5.0, "text": "Great quality and delivery. Set up how i want it not where they wanted it.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP-0yv90HEK-hizybk48BeLMaFEhDvv60pqevWF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNQQmVVGKeNr2fIHjjOBq3uJ91aCgOxGDZDgtCA=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMsE11zvQeExaujWBYFfK_IjA3zpOaT-0hY8hTy=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPqOQRKX7SOg_BKRHeoAaGRujOQ_U-CkMLwjnTU=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOQbbmASlTzbnqd4kT57khLOxchGhIMyByF44N1=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNz4bUpQ7wQS_lVgZ_mFejhCfJ4CqcQudpUQ59o=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMSX8kB1Zz7d0RblQ1zvaAV057IGF74oxUKwESb=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNRV06KJbrDgT-aCMWH9vG--Fa4sYd2QhroRDVB=w150-h150-k-no-p"]}], "resp": {"time": 1595864443098, "text": "Oh Good I am so glad you liked it. Thank You!"}, "gmap_id": "0x8889e67999630b23:0x9f642dea8df5c94"}
{"user_id": "105896821624358212480", "name": "Bobbie Daniel", "time": 1602625678422, "rating": 5.0, "text": "Stopped by to browse & the lady in the office was very nice & showed me what I was thinking of buying. It was allot more spacious than I'd imagined & financing is reasonable so will definitely consider a purchase in the near future.", "pics": null, "resp": {"time": 1602624717370, "text": "Thank you"}, "gmap_id": "0x8889e67999630b23:0x9f642dea8df5c94"}
{"user_id": "107064758798591285969", "name": "D Hofstadter", "time": 1558363029323, "rating": 5.0, "text": "We had a 8 x 12 storage unit for years. Not we have a much larger building in the back yard that matches our house and we own it! so... Over all we are very excited and pleased with 10k Barns. If we had to do it over again we would still use 10K Barns. Quality build, delivery, setup, level, and friendly. So Yea, we are very pleased!", "pics": null, "resp": {"time": 1601737443017, "text": "Thank You!"}, "gmap_id": "0x8889e67999630b23:0x9f642dea8df5c94"}
{"user_id": "102618094987722968645", "name": "Ron Furgason", "time": 1558362568011, "rating": 5.0, "text": "We've ordered 2 of these buildings for each of our rental properties. Very very impressed with the workmanship as well as the overall aesthetics. We will be using 10k for our next property storage building.", "pics": null, "resp": {"time": 1601737438128, "text": "Thank You!"}, "gmap_id": "0x8889e67999630b23:0x9f642dea8df5c94"}
{"user_id": "109369685873395739095", "name": "John Ryan", "time": 1554937994743, "rating": 5.0, "text": "Its alot bigger than we thought!! We love it!", "pics": null, "resp": {"time": 1554938295963, "text": "Thank you for the stars John. Hope you enjoy your new Man Cave! o.O"}, "gmap_id": "0x8889e67999630b23:0x9f642dea8df5c94"}
{"user_id": "102388871037382010690", "name": "LinEvBlaine", "time": 1594824071824, "rating": 5.0, "text": "Best prices, selection, setup!!", "pics": null, "resp": {"time": 1594830990376, "text": "Thank you! We appreciate you!"}, "gmap_id": "0x8889e67999630b23:0x9f642dea8df5c94"}
{"user_id": "104453314314670557661", "name": "Zandra Kimbrell", "time": 1520513351659, "rating": 1.0, "text": "To many rules by owners to follow. Some things r hard to keep up perfect and if u don't the owner fuss about it! I would not give one star, but had to for posting.", "pics": null, "resp": null, "gmap_id": "0x88885ddf74336e1f:0x8243ede2f95bbd78"}
{"user_id": "117724788417691693510", "name": "Sheila Uptain", "time": 1539011958383, "rating": 1.0, "text": "Used to be a good . don t move in this park .You will be sorry if you do. The rent goes up but he dose nothing for you if you ask. People come in here and visit and they arent good people.move it on your own land.the ground is wet on one side of the mobile home i think the field lines are leaking.i have told them over and over.he dose nothing.I can't afford to move right now but I'm looking for something else.I may have to sell it to get out of here.there is a smell and I have been all under my home no leak on my part.yesterday the ground was all wet between me and the other mobile home next to me\nTwo mobiles homes moved out this week.going up on the rent this month.so I'm looking in been living here since 1999. The maintenance  of the park is not kept  up  like it needs to be but the rent keeps on going up.\nI am tired of the smell.He always says if you don't like it hitch your mobile home up and move it out.A we pay rent on is to have it on his land nothing else gets done. When it rains water washes all under my home.the smell is what is bad... I am so tired  of being treated like this.", "pics": null, "resp": null, "gmap_id": "0x88885ddf74336e1f:0x8243ede2f95bbd78"}
{"user_id": "112955106974001870061", "name": "Carlton Tipper", "time": 1566972977768, "rating": 1.0, "text": "Don't go to this place. They have way too many rules and owner badmouths people.  And everyone in that place are not ones you want to be friends with. Worst mistake of my life.", "pics": null, "resp": null, "gmap_id": "0x88885ddf74336e1f:0x8243ede2f95bbd78"}
{"user_id": "108351043443606946215", "name": "GavinIthink", "time": 1516681016341, "rating": 1.0, "text": "Cuz this place is boring", "pics": null, "resp": null, "gmap_id": "0x88885ddf74336e1f:0x8243ede2f95bbd78"}
{"user_id": "113309017627360566761", "name": "Nevaeh Jones", "time": 1515645215142, "rating": 1.0, "text": "BC people are snitches here", "pics": null, "resp": null, "gmap_id": "0x88885ddf74336e1f:0x8243ede2f95bbd78"}
{"user_id": "108138455383481347524", "name": "E.C. Hensley", "time": 1539289184520, "rating": 5.0, "text": "The staff was so helpful. I had stopped at other locations and here I received all the answers and help in determining what size building would work.   Charletta was very patient and knowledgeable about her business and patient!!!!  I was concerned about the delivery, but they were excellent. Placed the building right where we wanted and were so helpful to answer any questions and continued to ask if we were satisfied!!!!! Great customer support!!! Thank you for making this so easy!!!", "pics": null, "resp": null, "gmap_id": "0x889bb3c4fc2f78c9:0x52c0c7bed4ae278e"}
{"user_id": "111847787575874666262", "name": "Kimberly Davis", "time": 1554310221576, "rating": 5.0, "text": "What can I say the experience always amazing.The owner was friendly and informative. Providing great customer experience will definitely shop again. Highly recommend this business.", "pics": null, "resp": null, "gmap_id": "0x889bb3c4fc2f78c9:0x52c0c7bed4ae278e"}
{"user_id": "107541151950604877286", "name": "Nfamous 1989", "time": 1575579631496, "rating": 5.0, "text": "I visited this place around July, the Lady at the front desk was so helpful and precise. Super sweet lady and a great company to work with.", "pics": null, "resp": null, "gmap_id": "0x889bb3c4fc2f78c9:0x52c0c7bed4ae278e"}
{"user_id": "105888193761690473779", "name": "MnG", "time": 1554349763405, "rating": 5.0, "text": "This place is outstanding. From the wide variety of barns you can choose from and the staff. You’ll be able to find exactly what you are looking.", "pics": null, "resp": {"time": 1580834848053, "text": "It was a pleasure doing business with you. Blessings be yours"}, "gmap_id": "0x889bb3c4fc2f78c9:0x52c0c7bed4ae278e"}
{"user_id": "101284090373844549718", "name": "Kennethia Singleton", "time": 1554233250391, "rating": 5.0, "text": "The service was excellent. They were able to assist me with all my needs. I definitely recommend this place.", "pics": null, "resp": {"time": 1580834573843, "text": "Thank you so much, blessings be yours"}, "gmap_id": "0x889bb3c4fc2f78c9:0x52c0c7bed4ae278e"}
{"user_id": "103663805457666095531", "name": "Joshua Tackett", "time": 1503771527612, "rating": 5.0, "text": "Amazing customer service. Even though I could have found something closer and possibly cheaper. I didn't care. It was the first and last place I looked. Super friendly", "pics": null, "resp": null, "gmap_id": "0x889bb3c4fc2f78c9:0x52c0c7bed4ae278e"}
{"user_id": "101029477985030955634", "name": "Fatboy 196", "time": 1555590960805, "rating": 5.0, "text": "I stop by to get some information the young lady was very lovely and attractive beautiful personality and very detailed with the information she gave I will order my carport and building next month", "pics": null, "resp": null, "gmap_id": "0x889bb3c4fc2f78c9:0x52c0c7bed4ae278e"}
{"user_id": "107108537415831266696", "name": "brusting Playz", "time": 1555591210617, "rating": 5.0, "text": "The Woman Charlett is a doll she went out her way to design me the perfect shed. I just adore her, if you want the perfect design she’s your girl.", "pics": null, "resp": null, "gmap_id": "0x889bb3c4fc2f78c9:0x52c0c7bed4ae278e"}
{"user_id": "104801439239051786850", "name": "Charletta S. Sanders", "time": 1540842257461, "rating": 5.0, "text": "My name is Bobbie Hills 4th, I had a wonderful time shopping for a very affordable building CeeCee had just what I needed. If you are wanting quality and excellence this is the place. Thank you", "pics": null, "resp": null, "gmap_id": "0x889bb3c4fc2f78c9:0x52c0c7bed4ae278e"}
{"user_id": "115916106238285784803", "name": "Frontdesk Ashbury", "time": 1518043584951, "rating": 5.0, "text": "We were in need of a storage building and  the people were very friendly and helpful. If we need another building we will always come here. THANKS COTTON STATE", "pics": null, "resp": null, "gmap_id": "0x889bb3c4fc2f78c9:0x52c0c7bed4ae278e"}
{"user_id": "114197944731922942847", "name": "Gerald Sanders", "time": 1518049095895, "rating": 5.0, "text": "Great place to find the right storage building. They have a nice variety of buildings and you can easily find the right one for you.", "pics": null, "resp": null, "gmap_id": "0x889bb3c4fc2f78c9:0x52c0c7bed4ae278e"}
{"user_id": "108411052489345282204", "name": "DBS Chosen", "time": 1554220923735, "rating": 5.0, "text": "Excellent service and the sales woman is sweet and they are dependable", "pics": null, "resp": null, "gmap_id": "0x889bb3c4fc2f78c9:0x52c0c7bed4ae278e"}
{"user_id": "106465172040412389778", "name": "William Hildreth", "time": 1518038192043, "rating": 1.0, "text": "You cann’t get what u order been almost 6 weeks and still no barn. Please stay away from Cotton State Barns forever", "pics": null, "resp": null, "gmap_id": "0x889bb3c4fc2f78c9:0x52c0c7bed4ae278e"}
{"user_id": "108775437467749206187", "name": "Bryson Gill", "time": 1554141200279, "rating": 1.0, "text": "Very poor service and very rude", "pics": null, "resp": null, "gmap_id": "0x889bb3c4fc2f78c9:0x52c0c7bed4ae278e"}
{"user_id": "106309389006522002781", "name": "Bob Kelly", "time": 1529980301443, "rating": 1.0, "text": "Stay away, bad business practice.", "pics": null, "resp": null, "gmap_id": "0x889bb3c4fc2f78c9:0x52c0c7bed4ae278e"}
{"user_id": "117519200920797716586", "name": "Toni Tyson", "time": 1571065450063, "rating": 5.0, "text": "Love the people. They're very friendly and payments are cheaper than the place behind waffle house.", "pics": null, "resp": null, "gmap_id": "0x889a62274c4ef33f:0x20cb8e70a3f049c4"}
{"user_id": "104801439239051786850", "name": "Charletta S. Sanders", "time": 1540843398970, "rating": 5.0, "text": "A superb company to buy from All the Cotton States are  great quality building.", "pics": null, "resp": null, "gmap_id": "0x889a62274c4ef33f:0x20cb8e70a3f049c4"}
{"user_id": "107279200326631415336", "name": "Chris Copeland", "time": 1612206942443, "rating": 3.0, "text": "It's pretty good. My sister has used them for years and she loves them.", "pics": null, "resp": {"time": 1612207796863, "text": "Hey Chris! We appreciate the review, but, are puzzled about the 3 stars. What have we sold you, or, how have we done business with you?"}, "gmap_id": "0x88885e1fc3931be1:0xe60339c773b15336"}
{"user_id": "117763055932949630340", "name": "Richard thomas", "time": 1598300860481, "rating": 5.0, "text": "Great folks to deal with , honest , down to earth. Good carts and prices! Regards: Richard “ SemperFi “ 🇺🇸", "pics": null, "resp": {"time": 1598365120856, "text": "Thank you so much Richard! It was a pleasure to meet you and your beautiful wife!! Customers like y'all make our job so easy!!"}, "gmap_id": "0x88885e1fc3931be1:0xe60339c773b15336"}
{"user_id": "116264018776111601929", "name": "Jonathan Peters", "time": 1610152255914, "rating": 5.0, "text": "Fantastic selection and the staff is top knotch", "pics": null, "resp": null, "gmap_id": "0x88885e1fc3931be1:0xe60339c773b15336"}
{"user_id": "104940916665609246990", "name": "Josh Pope", "time": 1588609491088, "rating": 5.0, "text": "Excellent selection and service! They treated us like family and made sure we were satisfied with our purchase.", "pics": null, "resp": {"time": 1590871640269, "text": "Josh, we appreciate your business, and, that you trusted us to get you in the cart that suited your family! We hope you all enjoy your beautiful ride!!"}, "gmap_id": "0x88885e1fc3931be1:0xe60339c773b15336"}
{"user_id": "110696274492321266800", "name": "Johnny McKenney", "time": 1590184318693, "rating": 5.0, "text": "Was really a nice place of business,\nThey were closed for holiday weekend,\nWe will go back when they are open", "pics": null, "resp": {"time": 1590871577094, "text": "Thank you Johnny! We're sorry we missed you. All of us have been working very long, hard hours through this Covid 10 madness, and, needed to take a break for some rest and to get de-stressed.\nWe hope you can make it back to see us soon, and, that we will have a good inventory built back when you do, so we can get you fixed right up!!"}, "gmap_id": "0x88885e1fc3931be1:0xe60339c773b15336"}
{"user_id": "107708816940235872159", "name": "Christopher Dobbins", "time": 1600384127866, "rating": 5.0, "text": "Very nice and courteous...ill recommend this place...", "pics": null, "resp": {"time": 1600436179235, "text": "Thanks Christopher! Customers like you make our job enjoyable!!"}, "gmap_id": "0x88885e1fc3931be1:0xe60339c773b15336"}
{"user_id": "107530413225171030665", "name": "Larry M Chancy", "time": 1603891184687, "rating": 5.0, "text": "I've bought batteries there and a golf cart. Always treated us very well", "pics": null, "resp": null, "gmap_id": "0x88885e1fc3931be1:0xe60339c773b15336"}
{"user_id": "105005915690552256684", "name": "Mark Drake", "time": 1537484798599, "rating": 5.0, "text": "Great business. I take my golf cart there for any repairs they are always reasonably priced with quick turn around time on the repairs. We'll run business. Highly recommend them.", "pics": null, "resp": {"time": 1537623514151, "text": "Thanks Mark! We appreciate your business, and look forward to many years of continued service!!"}, "gmap_id": "0x88885e1fc3931be1:0xe60339c773b15336"}
{"user_id": "104540808225228400606", "name": "Kathy Chancy", "time": 1552703861148, "rating": 5.0, "text": "Golf cart", "pics": null, "resp": {"time": 1553545337623, "text": "Thank you so much Kathy! We hope your family enjoys your beautiful golf cart!"}, "gmap_id": "0x88885e1fc3931be1:0xe60339c773b15336"}
{"user_id": "106925609775628464172", "name": "Edward Nalls", "time": 1555518895515, "rating": 5.0, "text": "Very friendly people!!!!", "pics": null, "resp": {"time": 1555594286725, "text": "Thank you so much Edward! It was a pleasure to meet you, and we certainly appreciate your business! We look forward to serving you again!"}, "gmap_id": "0x88885e1fc3931be1:0xe60339c773b15336"}
{"user_id": "104697992485908801092", "name": "ashley Moran", "time": 1392220629134, "rating": 5.0, "text": "These guys are awesome! They have great attitudes and are very easy to work with. I bought a car from them recently and they worked with me in every way possible. I highly recommend Austin & Tommy (the owners). I wouldn't go anywhere else to buy a vehicle, they truly care about their customers. LOVE them!!!!", "pics": null, "resp": null, "gmap_id": "0x889a56ecd3f46485:0xf7b65ad97c94017"}
{"user_id": "103720768888593899717", "name": "Jodie McKinley", "time": 1499961000647, "rating": 1.0, "text": "As much as I would like to leave more stars for the quick and efficient buying of a truck from Kip, I have to say that TNT sold us a lemon. The truck we bought in November has something wrong with it every week which means my husband is throwing money at parts instead of trying to make the payment. They sold us an expensive extended warranty that we knew nothing about and when the air conditioner went out in the truck, we were told the warranty covers powertrain ONLY. Save time and money and shop elsewhere, There are plenty more reputable dealers around that won't sell you a piece of junk.", "pics": null, "resp": null, "gmap_id": "0x889a56ecd3f46485:0xf7b65ad97c94017"}
{"user_id": "104606053889471411491", "name": "Clint Chance", "time": 1416081161773, "rating": 4.0, "text": "They welcomed us in with open arms, were more than accommodating. Staff was friendly, however pre-occupied. We bought our vehicle in September. The owner was willing to pay for faulty sensors on the vehicle found at time of purchase. The only major complaint that I have is to Make sure that they complete ALL the paperwork before you leave to help you avoid frequent subsequent trips to sign your name.", "pics": null, "resp": null, "gmap_id": "0x889a56ecd3f46485:0xf7b65ad97c94017"}
{"user_id": "111342646363098496440", "name": "Kylee Hovel", "time": 1451495470516, "rating": 5.0, "text": "Absolutely the best in the business!!! We got an excellent deal on our Acadia.  It's fully loaded, excellent condition and we couldn't be happier.  Highly recommended!!", "pics": null, "resp": null, "gmap_id": "0x889a56ecd3f46485:0xf7b65ad97c94017"}
{"user_id": "114924872766340475313", "name": "Michael Goins", "time": 1359505915182, "rating": 5.0, "text": "I went to 2 of Mobile's highest rated car detailers with my car due to me having sap dried on my paint.  WIth no luck at either of these places I contacted TNT and took the car in and in no time my car was back to looking brand new again!!  I refer this place to anyone now who is looking for someone to detail their vehicle..  Staff could not have been nicer and accommodating!!", "pics": null, "resp": null, "gmap_id": "0x889a56ecd3f46485:0xf7b65ad97c94017"}
{"user_id": "105147745987844494595", "name": "Daniel Woods", "time": 1474549383830, "rating": 1.0, "text": "The worse car lot ever they payments is very expensive they cars are not worth it. They screwed me an my family over on a truck that we had purchased they signed an agreement saying that they was gone fix it in they didnt. Than they told me not to worry about the payments an to use the money to fix it cause they couldn't find the problem. So I found the problem but it was to expensive for me so I told them yesterday that I would catch the payments up today an let them fix it. Than they came got it saying I didnt make payments an told me I was a liar on Facebook. They are very bad people.", "pics": null, "resp": null, "gmap_id": "0x889a56ecd3f46485:0xf7b65ad97c94017"}
{"user_id": "115628843011264628002", "name": "Carlos Garcia", "time": 1494959656144, "rating": 5.0, "text": "One of the best lots ive ever been to.\nGot a good deal on a nice truck. Payments are reasonable. The staff is awsome. Thank you david and kip for being down to earth and honest. Will definitley be buying my next truck from here.", "pics": null, "resp": null, "gmap_id": "0x889a56ecd3f46485:0xf7b65ad97c94017"}
{"user_id": "110204432044830960481", "name": "john milligan", "time": 1392164029851, "rating": 5.0, "text": "great group of guys:) made my car buying easy !!! nice selection of vehicles and the warentys are a plus!!! was in and out in no time with a realy nice car!! would deffenty deal with again in the future and i highly recomend these guys for your car buying needs.", "pics": null, "resp": null, "gmap_id": "0x889a56ecd3f46485:0xf7b65ad97c94017"}
{"user_id": "115160726920482923383", "name": "Jenna Burfield", "time": 1589911567521, "rating": 5.0, "text": "Fantastic service, very friendly technician.", "pics": null, "resp": null, "gmap_id": "0x8888259bed861a8f:0xa07ed90fe5827e2c"}
{"user_id": "107875474310874255473", "name": "Cynthia Eaton", "time": 1583844837022, "rating": 5.0, "text": "Great people to do business with!", "pics": null, "resp": null, "gmap_id": "0x8888259bed861a8f:0xa07ed90fe5827e2c"}
{"user_id": "104415879197228152047", "name": "Maxwell Walden", "time": 1625340754414, "rating": 5.0, "text": "Loved to come here just me & my brother to come see the band Tremain performing & watching the fireworks show to become a extravaganza.", "pics": null, "resp": null, "gmap_id": "0x8888259bed861a8f:0xa07ed90fe5827e2c"}
{"user_id": "108139960520815113234", "name": "Ashllie Ramirez", "time": 1583856100769, "rating": 5.0, "text": "Professional caring customer service, Haley made sure I selected the best building to fit my needs. Delivery was quick and easy. The delivery men were very kind and sure to level the building and place it where I wanted. They have such a wide variety to choose from to fit everyone's needs. I was able to customize my building to my liking. Haley was honest and took time to look around with me. I spent nearly 4 hours here trying to make a decision on all their selection. Would recommend to anyone in search of a good quality building and great customer service.", "pics": null, "resp": {"time": 1598193606002, "text": "Thank you so very much Ashllie!! I do my best to make sure every customer will love their building!! Hope you’re doing well!"}, "gmap_id": "0x888a38907a642893:0x425a3e2ef5e575b7"}
{"user_id": "104103490816564750180", "name": "Becca A. Ali", "time": 1520468252293, "rating": 5.0, "text": "Gorgeous buildings and very good prices, hailey is the absolute best ! 5 stars !!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMvk0z_T15j7cgKmFlVVpsidjh1FCAWUQoD1Xty=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNBODMNHAHgs6MRYyNNcPJgso2JKHVUvDcXoxhV=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNjcV2ma5FCbjBSOwqO5JtWICfsHbEvHTJqPPQl=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNXh8Ty_E-8aHTqEFEwDf_s8ZVnCY0XRfLbnPPj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMf-Mn_jzDONHcxLnXJmw-A6z_23K1p3UaOY2yh=w150-h150-k-no-p"]}], "resp": {"time": 1568317334511, "text": "Thank you so much for your business and review!! We are so happy you love your buildings!"}, "gmap_id": "0x888a38907a642893:0x425a3e2ef5e575b7"}
{"user_id": "112283989640082688311", "name": "Kristen Smith", "time": 1598127666122, "rating": 1.0, "text": "If you ever get behind in a payment due to an illness or whatever the reason they will make payment arrangements with you to catch it up then after you’ve paid them still come get your building. 10/10 do not recommend if you are looking for someone to trust and honesty  is important to you.", "pics": null, "resp": {"time": 1621979025790, "text": "I am very sorry to hear this! Unfortunately, I can't control the financing company policies. I do know that you have so many days after a payment is due to make it up, most of our companies do let you get a few months behind before repossessing the item.\nI hate that you are displeased with our business, but there isn't anything I can do about the financing companies, but I do not believe we have ever repossessed anything that was paid for!!"}, "gmap_id": "0x888a38907a642893:0x425a3e2ef5e575b7"}
{"user_id": "116510742164835636948", "name": "Richard Groover", "time": 1605119532907, "rating": 5.0, "text": "Prices are UNBEATABLE!", "pics": null, "resp": null, "gmap_id": "0x888a38907a642893:0x425a3e2ef5e575b7"}
{"user_id": "103195488274278472920", "name": "Arizona Pastorcich", "time": 1618201956276, "rating": 5.0, "text": "This place is wonderful! So friendly and super quick. If I need any other buildings that's where I'll go!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMTT4EhoZ-xP8d64xJetERhjDycJXr_fHtBhLo5=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO28FGUH1OeZ5OwEGnBwlK0E56bYuRFk4qsQsy_=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889baea50e5f960f:0x153d707193c0114"}
{"user_id": "117176364859831372836", "name": "Dr.David Callaway", "time": 1615237834428, "rating": 5.0, "text": "The best prices, and Quality building's The staff were really nice. Great customer service.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPzIpRQKFSpQF6Ew7hsvQaWQp01k--KRAIIw0kZ=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889baea50e5f960f:0x153d707193c0114"}
{"user_id": "111300941301796806237", "name": "della gray", "time": 1614880910632, "rating": 5.0, "text": "The girl that works there is such an AWESOME person I love her. JDMB 😁", "pics": null, "resp": null, "gmap_id": "0x889baea50e5f960f:0x153d707193c0114"}
{"user_id": "114815175519479884480", "name": "Mac1776", "time": 1596673555605, "rating": 5.0, "text": "Excellent folks to work with.", "pics": null, "resp": null, "gmap_id": "0x889baea50e5f960f:0x153d707193c0114"}
{"user_id": "101424485412924240699", "name": "Kaylene Prather", "time": 1616616596353, "rating": 5.0, "text": "Helpful and informational staff,made me want more info on barndominiums.", "pics": null, "resp": null, "gmap_id": "0x8889cb17623d750d:0xb1491cec51232b69"}
{"user_id": "105986132755786066605", "name": "Stephen Moss", "time": 1618361250997, "rating": 5.0, "text": "Joe and Beth were great to work with. Very knowledgeable, they spent all the time I needed to help me figure the best solution for our storage needs given we have a smallish lot.\n\nI referred a neighbor and had he the same experience.", "pics": null, "resp": {"time": 1618362659376, "text": "Thanks for the kind words, we appreciate your business and support."}, "gmap_id": "0x88892e69f95e35e5:0x496a03f0b69382fc"}
{"user_id": "107421486196074744764", "name": "Wesley Ward", "time": 1580960339914, "rating": 5.0, "text": "When I contacted Suddenly Structures about a building, I had some pretty specific needs.  The biggest was I wanted a roll-up style garage door in the end.  I use the building primarily for storage and needed this style door to get my zero turn mower in/out.  The team from Suddenly Structures easily accommodated my request and we have loved our building.  From purchase to delivery it could not have been easier.  Go see Jo & Beth before you even look at anyone else!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP_kw3bVK7cAmaA4Ij0d83sWW_sdQu7rVRTf1pj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNuf7_yLeYwoCSnCSjNoE8tJv5j1orRvhB6GsV9=w150-h150-k-no-p"]}], "resp": {"time": 1580961573883, "text": "Thanks for the kind words and for your business. We appreciate you"}, "gmap_id": "0x88892e69f95e35e5:0x496a03f0b69382fc"}
{"user_id": "110871794344879289080", "name": "Ashley Lodge", "time": 1617063682864, "rating": 5.0, "text": "Would definitely recommend this place to anyone looking for a building! Great prices and friendly people!", "pics": null, "resp": {"time": 1617064597898, "text": "Thank you for the kind words, it was our pleasure to serve you."}, "gmap_id": "0x88892e69f95e35e5:0x496a03f0b69382fc"}
{"user_id": "106639688981838527434", "name": "Chad Brantley", "time": 1617998879319, "rating": 5.0, "text": "I highly recommend calling Joe if you are in the market for a new building! He is very reasonable and easy to work with!", "pics": null, "resp": {"time": 1617999577586, "text": "Thanks for the kind words we appreciate you"}, "gmap_id": "0x88892e69f95e35e5:0x496a03f0b69382fc"}
{"user_id": "106676869028021318362", "name": "Paul Miller", "time": 1580748002179, "rating": 5.0, "text": "Great friendly customer service. Wide selection of products that I can select from to fit my needs. Very knowledgeable, fielded all questions concerning buildings, price, installation and end even on site evaluations. No doubt I will be recommending this company to anyone who is looking for a building for vehicles, storage or a work shop. I would like to add at no time did I feel pressured or feel as if I was talking to a salesperson. One more point I was driven around the lot in an ATV to see all the options they had to offer. When we got back to the office we sat down to talk and I was offered refreshment. I will say the bar has been set high for the level of customer service delivered. Five stars all day long.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMKDA9K4RtC8YZaKm1eVV5jxtNZ3zPHuNsqiX5y=w150-h150-k-no-p"]}], "resp": {"time": 1580751725107, "text": "Thanks for the kind words we appreciate your business!"}, "gmap_id": "0x88892e69f95e35e5:0x496a03f0b69382fc"}
{"user_id": "101830776166903575991", "name": "Tom Sigg", "time": 1616185613973, "rating": 5.0, "text": "Great people! Straight forward pricing too", "pics": null, "resp": {"time": 1616186292277, "text": "Thanks Tom we appreciate the kind words!"}, "gmap_id": "0x88892e69f95e35e5:0x496a03f0b69382fc"}
{"user_id": "107976277778124218749", "name": "G Wymer", "time": 1586829426131, "rating": 5.0, "text": "What a wonderful experience from start to finish!  Joe was patient and informative as we made decisions about building choices.  He was so accommodating, even coming to our house to verify site readiness.  The installers were friendly, professional, thorough, and efficient.  They ensured that everything was level and square.  We could not be more pleased with the finished product.  It met or exceeded all expectations.", "pics": null, "resp": {"time": 1589920908736, "text": "Thanks for the kind words and thank you for your business, it was our pleasure working with you."}, "gmap_id": "0x88892e69f95e35e5:0x496a03f0b69382fc"}
{"user_id": "106032671822229098636", "name": "Patricia Horton", "time": 1604100756790, "rating": 5.0, "text": "They are one of a kind.I wouldnt buy from anybody else.We are on a fixed income .They have been great .and Their prices cant be beat .", "pics": null, "resp": {"time": 1610458323921, "text": "Thanks for your business Patricia, we love working with you always."}, "gmap_id": "0x88892e69f95e35e5:0x496a03f0b69382fc"}
{"user_id": "112466486664634795198", "name": "Monica Stalling", "time": 1561441620819, "rating": 5.0, "text": "Very Professional  Staff went above and beyond to  ensure  our storage buiding  was  perfect and delivered on time..Highly  recomend", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPc5O4j9FeKouUsLDhKPY6l_SeHJQ2dp0SvUC38=w150-h150-k-no-p"]}], "resp": {"time": 1561467561273, "text": "Thanks for your business Monica it was a pleasure working with you!"}, "gmap_id": "0x88892e69f95e35e5:0x496a03f0b69382fc"}
{"user_id": "105135431986178206522", "name": "redheaded stepchild", "time": 1583370711105, "rating": 5.0, "text": "Joe and Beth are no nonsense, friendly and extremely knowledgeable about all of the products they offer. They are able to finance if needed. You aren't left alone after your purchase. They stay with you through delivery and placement. Highly-qualified and recommend them all the way around.", "pics": null, "resp": {"time": 1583374436634, "text": "Thank you for the kind comments, it was our pleasure doing business with you."}, "gmap_id": "0x88892e69f95e35e5:0x496a03f0b69382fc"}
{"user_id": "108231214529194498253", "name": "Barbara Nichols", "time": 1580943323013, "rating": 5.0, "text": "Josef and Beth (owners) provide incredible customer service.  They are extremely knowledgeable about their products, do what they promise, and are a pleasure to do business with.   They go above and beyond to insure customer satisfaction.  Highly recommend them!", "pics": null, "resp": {"time": 1580944649059, "text": "Thanks Barbara for the kind words, we appreciate your business and it was our pleasure to work with you!"}, "gmap_id": "0x88892e69f95e35e5:0x496a03f0b69382fc"}
{"user_id": "101715229893053663908", "name": "Robert George", "time": 1593821542898, "rating": 5.0, "text": "Best buildings,, best customer service,, couldn't ask for a better team than Joe and Beth.", "pics": null, "resp": {"time": 1593825218688, "text": "Thanks Robert! We appreciate your business and all your help!"}, "gmap_id": "0x88892e69f95e35e5:0x496a03f0b69382fc"}
{"user_id": "118032402517015904606", "name": "Michael Wylie", "time": 1558722363424, "rating": 5.0, "text": "What an amazing experience, these guys know what they’re doing. They are here for their community as well. Calera Bark Park was donated one of these great products so people could have a place in the shade to picnic or just enjoy watching their dogs play. Thank you again Suddenly Structures!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP_9Pz_3-9Ubk6UyNBVEF3Ak_FsR9K0aHwzjUb2=w150-h150-k-no-p"]}], "resp": {"time": 1558730376023, "text": "Thanks Michael we love helping our community and furry friends, can't wait for the dog park to open!"}, "gmap_id": "0x88892e69f95e35e5:0x496a03f0b69382fc"}
{"user_id": "101190221323779562854", "name": "Ashlyn Ragsdale", "time": 1581646302797, "rating": 5.0, "text": "Joe was super helpful and extremely nice!! NO b.s.! Excellent customer service!! I wouldn’t recommend anyone else more highly!! If you need any kind of utility building or tiny home GO talk to Joe!!!!", "pics": null, "resp": {"time": 1581649994042, "text": "Thanks for the kind words, we appreciate your business"}, "gmap_id": "0x88892e69f95e35e5:0x496a03f0b69382fc"}
{"user_id": "113916842998910169093", "name": "Marie Duke", "time": 1580757497897, "rating": 5.0, "text": "Very nice family. If you just can't quite help yourself with a selection, they can. Highly recommend.", "pics": null, "resp": {"time": 1580757695877, "text": "Thanks for the kind words! We appreciate you"}, "gmap_id": "0x88892e69f95e35e5:0x496a03f0b69382fc"}
{"user_id": "114815175519479884480", "name": "Mac1776", "time": 1603235316724, "rating": 5.0, "text": "Awesome folks to work with.", "pics": null, "resp": {"time": 1603235501738, "text": "Thanks Richard we appreciate you!"}, "gmap_id": "0x88892e69f95e35e5:0x496a03f0b69382fc"}
{"user_id": "103695283318642280009", "name": "Francietta Fuller", "time": 1567109159060, "rating": 5.0, "text": "The owners are so very nice and caring, once you walk through the door it's a warm welcome. They will talk you through whatever you need to know and will make the process so easy, their buildings are beautiful and i will most definitely be choosing them again.", "pics": null, "resp": {"time": 1567115683335, "text": "Thanks so much Francietta we appreciate your business."}, "gmap_id": "0x88892e69f95e35e5:0x496a03f0b69382fc"}
{"user_id": "111952541361073849920", "name": "Donald palazzolo", "time": 1551531282052, "rating": 5.0, "text": "My wife and I are in the market for a shed And I pass this place everyday on my way to work so we stopped by to check them out. This is a good example of why \"you should never judge a book by its cover\". I told my wife just by looking at the buildings they have there they probably want a fortune but when we stopped by and actually took the time to go in and talk to the owners we found the EXACT opposite. Absolutely nice ,friendly people. And I doubt if you will find a shed or building anywhere around that's gonna be of such quality for so little money. If you are in the market for a shed, storage building or whatever I highly recommend suddenly structure's on highway 22!!!! These are some of the 2 sweetest, caring, people I ever met in my life!! Real talk we put next to nothing down, left with a $25 Visa gift card in hand 2 days later my sheds at my house!!!!!", "pics": null, "resp": {"time": 1555432768992, "text": "DJ, thank you so much for your kind words. It was a pleasure working with you to get the right building for your needs!"}, "gmap_id": "0x88892e69f95e35e5:0x496a03f0b69382fc"}
{"user_id": "109534178826226760580", "name": "Zanuiit Unknowable", "time": 1579816738569, "rating": 5.0, "text": "Awesome customer service, they know how to build a relationship with their customers. Great proces as well as convenience", "pics": null, "resp": {"time": 1579822751548, "text": "Thanks for the review we appreciate your business!!!"}, "gmap_id": "0x88892e69f95e35e5:0x496a03f0b69382fc"}
{"user_id": "106796254561076708884", "name": "Marty Lawrence", "time": 1572104122352, "rating": 5.0, "text": "Very satisfied with the services provided by Suddenly Structures.  Will use again.", "pics": null, "resp": null, "gmap_id": "0x88892e69f95e35e5:0x496a03f0b69382fc"}
{"user_id": "112197797792848097259", "name": "Kristie Nolen", "time": 1559261080626, "rating": 5.0, "text": "Just had my building delivered and I couldn't be happier.  I originally wanted to have a building built but a bigger repo came up on FB marketplace.  Joe and Beth were great working with me getting the repo and getting it delivered.  Got a great deal on the building and superb customer service.  Would highly recommend!!", "pics": null, "resp": {"time": 1559261780081, "text": "Thanks Kristie we appreciate your business, it was great working with you and your husband."}, "gmap_id": "0x88892e69f95e35e5:0x496a03f0b69382fc"}
