{"user_id": "116360763903501209036", "name": "Willie Kitchens", "time": 1605557704948, "rating": 5.0, "text": "These are very nice and honest people. A family owned company that takes care of their employers and customers.", "pics": null, "resp": null, "gmap_id": "0x888a47e179c25afb:0x4b8770ce1f4ff400"}
{"user_id": "108204809502468578802", "name": "Wendy Wallace", "time": 1451585148855, "rating": 1.0, "text": "Would love to say great service but unfortunately I never received their service. I called and setup service to pump out RV the week before Christmas and was told they'd be out the following week. I waited and never received a call or a visit. I called the next week and was told that he forgot to dispatch the information. I reiterated the need for the pumping as we had holiday guests and really who wants to ask their guests to do their business in the woods. I was told they would be out Thursday. On Wednesday my 13 year old and I put gravel going to the RV to make sure the truck wouldn't get stuck with heavy rains. Not exactly a fun chore. On Thursday I called to see when the service truck would arrive only to be told that it wouldn't be this week at all. I explained that this had inconvenienced me, 13 year old, and a 91 year old and I would like to know exactly when they will provide the service. Chad then proceeded to tell me essentially.....we were out of his way. At this point I've decided to go elsewhere. Horrible customer service, lack of concern, and apparently unable to show up. If your looking for someone to get the job done you might have to call someone else just like I have too.", "pics": null, "resp": null, "gmap_id": "0x888a47e179c25afb:0x4b8770ce1f4ff400"}
{"user_id": "100975769239787276051", "name": "Ann Ridgeway", "time": 1495658472690, "rating": 5.0, "text": "Timely, good service, good price. Hard working guys who did a good job. I would use them again.", "pics": null, "resp": null, "gmap_id": "0x888a47e179c25afb:0x4b8770ce1f4ff400"}
{"user_id": "112168306541679721205", "name": "Mary Suggs", "time": 1490211357208, "rating": 4.0, "text": "Justin came out and put in a tank and lines, broke my water and electrical lines to the pier, he repaired the water line at the time. He acknowledges he saw the electrical lines, but failed to repair. Abel Septic has sent 2 electricians out, but no repairs have been made. That was 11 months ago. Still waiting.... I will update review if repairs  are made....\n\nUPDATE... Justin called in late February and reported he didn't realize my electricity had not been restored. He sent electricians who actually repaired my electricity in about an hour.\nThank you Justin and Abel Septic", "pics": null, "resp": null, "gmap_id": "0x888a47e179c25afb:0x4b8770ce1f4ff400"}
{"user_id": "102709428013638951295", "name": "Clay ROUTON", "time": 1532412505942, "rating": 5.0, "text": "He is great guy and got a good company why all y’all hatin", "pics": null, "resp": null, "gmap_id": "0x888a47e179c25afb:0x4b8770ce1f4ff400"}
{"user_id": "106202922282019589564", "name": "Carolyn Pritts", "time": 1503101630916, "rating": 1.0, "text": "Well, I would love to be able to say i had good service but that would be a lie. I called on wednesday for porta potty cleaning. Was told they would have a guy out in my area on Friday. Which was great for me. The guy said he was driving and couldnt take my info at time. Said he would call when he got back to office. LATE that evening i called him back again to give him the info. Said they would call before they came out. So now its friday....i called to see if he could give me a estimated time he would be out. He said he would have to call his driver and would return my call. After setting at home all day waiting for his call or someone to show up, guess what...NOTHING! So i had my husband call him and he tells my husband \"oh all of my guys are gone home, it will be monday\". Which he was told from get go that it needed done by friday. So  i would consider this company to be unprofessional and would NOT recommend to anyone. If they didnt want to do it all they had to do was say so and i would not have wasted my time.", "pics": null, "resp": null, "gmap_id": "0x888a47e179c25afb:0x4b8770ce1f4ff400"}
{"user_id": "101368354669053251994", "name": "Carrera Hallett", "time": 1628010080366, "rating": 1.0, "text": "Worst customer service ever! And they do not pick up your garbage but will definitely charge you for it. Paid for twice weekly service and trash has only been picked up TWICE FOR THE ENTIRE MONTH.", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "115818935040832273373", "name": "Kyle Nichols", "time": 1628600724660, "rating": 1.0, "text": "The services provided are not within their contract terms. They are regularly late by days and fail to complete the pick up. We are still waiting for them to come an complete our regular scheduled services from Last week! We have called everyday since the failed service and have done multiple online complaints. We were told every day that they would be out by the end of the day to complete service.  It has been 5 days and they have not shown up yet! I am beginning to wonder if there is a Lawyer out there who would take on a class action; as this is an on going problem in our area. Every customer who has had to deal with this on a regular basis should be given a prorated credit for their breach of contract.", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "109028974594145799180", "name": "Sharmene Smith", "time": 1624888253178, "rating": 1.0, "text": "Positive: The drivers are absolutely great! No complaints about them.\n\nNegative: This company took over for Advanced Disposal in my neighborhood. First, everyone on my street received a trash can except for my family. We have to get up to put our garbage bags on the curb before the trash is picked up. We have to keep everything in our garage because animals tear into the trash if we keep it outside.\n\nI've emailed through all channels with no solutions. Calling is even worse. It's been almost 3 months with no solution. We are getting charged for a 95 gallon cart that we have yet to receive.\n\nAt this point, we have no idea what to do.", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "114033817245547877525", "name": "Glenn Blakely", "time": 1628689804938, "rating": 1.0, "text": "I have been displeased with this company ever since Saraland has gone with them. They do not pick up large piles of limbs and yard debris like our last company. They are late and have a habit of leaving the empty can in the middle of your driveway. It might be ok if you live in a neighborhood, but living along a main street, it is not wise to stop your car in the street.", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "110157669568502235621", "name": "Lori Rueschenberg", "time": 1619457301690, "rating": 1.0, "text": "Previous waste removal company collected bins three weeks ago. Amwaste is my neighborhood’s new removal company.  I have called six times asking for a bin as the majority of my neighbors have all received their bins. One house even received 3 bins! I called on trash collection day to tell them to see if I could have one of those but was told the trash collectors do NOT deliver bins. Each time I have called I have been told they would get a bin to me. I was told that I was a customer in good standing as my bills were up to date. I am in the process of moving and have explained that I have less than a month to move. I still don’t have a bin for my trash. What kind of waste company does not provide paying customers with trash bins!!!  I have written only a few a Google reviews but this company takes the cake for being the worst ever!", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "102413510437936224363", "name": "Benjamin Taylor", "time": 1627509784535, "rating": 1.0, "text": "I will file a formal complaint to whoever is the government authority. I have lived in my new rental house 2 months and they will not respond to phone or email. It is impossible to contact them. I need to be able to get trash service and pay for it.", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "100255262549325073711", "name": "David Black", "time": 1623151032985, "rating": 1.0, "text": "It is hard to rate a service that is paid for, but not provided. We wait on the phone forever just to be told, “we’ll get someone right out there” yet they never show up. They don’t respond to emails. Extremely poor customer service to match their equally poor performance. Very disappointed our trash collection changed to this company. Please do better!!", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "105628139999213050595", "name": "Jennifer Gardner", "time": 1623853056624, "rating": 1.0, "text": "No communication at all and horrible service!! We requested two trash cans when we built our house and were told that they did have enough cans to give us two. So whatever, but then a few weeks later our neighbors finished their house and moved in and were given two cans 🤔   Then we set up auto pay when we called to set up service and get our can, and they pick up our cans until all of the sudden they didn’t. Call and they tell us they haven’t received a payment since a date that was before we even moved in and even got our can or set up payment. We have not received anything in the mail to tell us there was an issue until we call to question things. When we start asking how a payment was made before we even moved in, what happened to the payment that was set up when we set up service, and how we have gone this long with them picking up our trash if a payment hasn’t been made they have no idea and no answers for us. We have never had a problem with any other waste company until now. Zero communication from them and then when you have an issue because of their lack of communication they don’t care and it is just your problem to figure out!", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "100074822173265396106", "name": "Karen Williams", "time": 1619433761985, "rating": 1.0, "text": "This company provided very spotty service. I had 2 day garbage and then 1 day recycle. My trash pick up was not consistent and neither was the recycle. I've called and complained several times. The last time I called they tried to tell me I only had 1 day trash pickup which was a lie. I didn't always use the Tues service but was paying for it... she said that all I had was the Fri service so they took a day away because THEIR DRIVERS ARE INCOMPETENT. I will be pursuing another company", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "104997862970377091214", "name": "janice jordan", "time": 1620859651110, "rating": 1.0, "text": "Terrible company, sometimes will pick up trash other times will pass it even though I keep my bill paid up. This company collect what they are TRASH!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "112921122599143406553", "name": "paul trunec", "time": 1619787454565, "rating": 1.0, "text": "It took three weeks and three phone calls for the first pick up. Now, waiting two weeks for the current one. I  would have gladly paid the increase for Advanced  Disposal.", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "113315500257282775501", "name": "JerseyGirl InAlabama", "time": 1626968162639, "rating": 1.0, "text": "Every single week I have to call them to come pick up my recycling and household garbage. They are unreliable considering how much they charge every three months for weekly pick-up", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "106192925067540716442", "name": "Trill Team", "time": 1616921576339, "rating": 1.0, "text": "Apparently this company took over Advanced Disposal’s bid in my area. We have a week of trash that has not been collected. We never received any updates from Advanced Disposal that Amwaste was taking over and we for sure have not heard from Amwaste! We only found out about Amwaste because our new neighbors next door informed us that supposedly they will now service our area. We have not received our new Amwaste trash cans and Advanced Disposal have not picked up there old cans. I am turned off already and I am extremely frustrated! I will be contacting the city and commissioners office first thing Monday morning!", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "105639871993907080312", "name": "Dave Williams", "time": 1620141783123, "rating": 1.0, "text": "Company does not respond to email contact on their website.  When I call the phone number on their LaGrange website, no one picks-up.  The driver does a good job on pick-up.", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "101103234684424231261", "name": "Kim McClafferty", "time": 1618924710113, "rating": 1.0, "text": "Since AMwaste has become the provider for Jefferson County, AL waste removal the  company has not provided information related to the day of the week for our collection and and our trash container was removed and has no replace it with a new one (so far no container for 6 days).  The drivers have been great but the administrative group leaves a lot to be desired.", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "117279621093967087266", "name": "wethreesawyers Sawyer", "time": 1619733975288, "rating": 1.0, "text": "Did not pick up garbage and trash. When I try to get ahold of them and fill out a message through internet like they asked. It then says oops something went wrong. I have tried four different times to submit a request for help, and each time it says oops something went wrong. I cannot get ahold of anybody to rectify the situation.", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "108868428873391945897", "name": "gilbert Pereida (G_peda)", "time": 1624656461635, "rating": 1.0, "text": "They raised my bill from $60 a quarter to $93 without any warning verbal or written and was told \" That's the new rate \" I don't expect a discount but I do expect something in the mail the rate is going up by 50%.. there would be times they'd not pickup my garbage or recyclables ...", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "103323889212653274150", "name": "number1tealady", "time": 1621028139960, "rating": 1.0, "text": "They promised to pick up side of the road garbage today, Friday, May 14th. Has not been picked up. Time is after 4 p.m. Other people have the same problem with them. We need to go back to the other company. Tney had a truck that came by every other Saturday.", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "100502235457771988068", "name": "Jess", "time": 1617906066741, "rating": 1.0, "text": "Amwaste took over for advanced disposal in my area. We have not even received a trash can from them yet!! Cannot get anyone on the phone! The customer service is a joke. What am I suppose to do with the trash until then?!", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "111130127407288159396", "name": "Jason Raney", "time": 1622733862798, "rating": 2.0, "text": "Should change their name to waste oftime they are no better than Advanced Disposal", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "115380720955601165839", "name": "Cody Lane", "time": 1626829549453, "rating": 1.0, "text": "They are rude, they don’t offer anything other than a bad attitude and a garbage trucks. Customer service is non existent. The one I’m referring to is in Pickens County. It’s a shame to have to pay $62.23 every quarter for garbage pickup!!!", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "104179979633065059654", "name": "Rhonda Carter", "time": 1619551180309, "rating": 1.0, "text": "Horrible company they will charge you and never pick up your trash. If you call they never return your call. Very disappointed with the service!", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "100189455566292095721", "name": "Lacy Chadwick", "time": 1618606733200, "rating": 1.0, "text": "This company is very very terrible it's been three weeks since anyone pickup our trash we still haven't received our amwaste trash can in every time on Monday they drive by our house. Every time we call the company they always coming up with excuses.", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "105710933475742558844", "name": "Mark Stokes", "time": 1598288132234, "rating": 4.0, "text": "I've seen a lot of negative reviews.  I signed a contract 9 months ago.  They missed my pick-up the first week, but from then on were great.  I sold my house 7 months into the contract after paying the third quarter bill and expected to have to pay the final quarter bill as well, even though I no longer lived there.  Not only did they cancel my contract, but they refunded me my third quarter payment that was already a month or so in.  There are ups and downs with any business, but I feel like they treated me more than fair, and I would recommend them if you need garbage service.", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "116385356207575600822", "name": "Tiana Rodgers", "time": 1604946032937, "rating": 1.0, "text": "This company is TERRIBLE!!! They never pickup trash on time. They do not provide quality customer service to their customers. They make up lies EVERY TIME they miss a trash pickup. Michelle on the phone is a total mishap for the company. She lies about managers names and laughs when you call to complain over the phone. PLEASE STEER CLEAR OF THIS COMPANY !", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "106481790256049531562", "name": "James jeter", "time": 1594668369451, "rating": 5.0, "text": "We was with another company that kept going up on us. One day a young nice sales. Salesman came to our door and we let him in to hear his pitch. He was very polite and caring. Their price was actually better than what we was paying so we decided to make the change.\nOne day we  put the wrong can out and filled it with stuff that she was throwing away. Well later the next day, I noticed that day the team didn't pick it up since it wasn't a Amwaste can. So I called and talked to Lisa. They explained that since we pay for 1 can pick up twice weekly that the guys did not pick it up because it wasnt their can. I went to my bedroom for like 10 minutes and the can was empty when I came back in the front and looked out the window. Now that is service there my friends.", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "100755861823022463707", "name": "Romara Ahallow", "time": 1619539063111, "rating": 2.0, "text": "Rarely do I have to jump through so many hoops to give a company money.", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "102939765441061472423", "name": "Kamehamemami", "time": 1620059162165, "rating": 1.0, "text": "Sucks. DoNOT USE. Called twice, Been waiting 2 weeks for a new trash can, trash is piling up and have gnats in my house thanks to these idiots.", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "110810276595958165955", "name": "Tarpon Time", "time": 1612994295872, "rating": 1.0, "text": "Terrible service! If your thinking ab signing up DONT and if you already have IM SORRY!", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "105308237100355854833", "name": "barry smart", "time": 1621725307853, "rating": 1.0, "text": "It’s been month after my neighborhood switched to this company. First almost everyone got their garbage can but few of us didn’t. Then after asking for months calling every week it’s still not here. They have been promising next Wednesday from the beginning but that Wednesday isn’t here after 4weeks gone", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "104941095043477603277", "name": "Denise Chandler", "time": 1617378743925, "rating": 1.0, "text": "After several missed pick ups and several complaints we discontinued our service", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "111160505710428089400", "name": "Rachael Abney", "time": 1571873472343, "rating": 1.0, "text": "I read all of these bad reviews and then I had to learn myself just to give them the benefit of the doubt. They need improvement at best. I switched to have recycling and they have yet to pick up my recycling consistently. The woman in the office who answered my calls is really nice but they get one star from me and I’m switching back to my old company.", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "115208844181017413483", "name": "Lillian Roberts", "time": 1597256102787, "rating": 2.0, "text": "The company’s service is horrible. They only pickup once a week and never on time. This has been going on since COVID 19. I’m going back to Waste Management for $10 more per month.", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "102360162130060004269", "name": "Tammy brumfield", "time": 1591310185234, "rating": 1.0, "text": "This is the worst customer service I have ever dealt with. They care nothing about the customer and will not pick the trash up at all but they will bill you for no service, they used excuse after excuse for not picking up our garbage and then an out right lie saying the truck could not go over a culvert which we do not have. Do not do business with these people you will definitely regret it if you do.", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "100855211774556239001", "name": "Michael “Miggles” Migas", "time": 1601397411241, "rating": 1.0, "text": "I pay for both debris and recycling pickup once per week. They come about every other week. The regular trash doesn't always get picked up either.", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "114173611482070014974", "name": "Autumn Demeranville", "time": 1577195020144, "rating": 4.0, "text": "We have been with them since September. We experienced some of the things people are complaining about, but I understood they were getting used to a new route and customers. We received a friendly letter apologizing for the late recycling pick up. Explanation was the response was larger than they expected and had to make adjustments. Haven't had problems in weeks. They do handle Holiday pick up differently than the last company I used. I don't really know when they are going to pick up on a Holiday week, but other than that no real complaints.", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "108787073841850446360", "name": "A. A. Gapud", "time": 1586443733413, "rating": 5.0, "text": "Doing a search for a phone number for this company, I happened to notice all these bad reviews, and felt compelled to say something positive. Perhaps I'm living in an alternate universe from everyone else, or maybe there's been some changes, but we've had nothing but positive experiences with this company. Our account is a residential weekly pickup of recyclables and garbage, and we switched to them last Fall 2019 because we were really taken by their salesman -- probably not the salesperson described in some of these reviews. Since then, we've had reliable pickup every single week, including holidays. Every time I had a billing question over the phone, I received great service (special shoutout to \"Tori\") and pleasant conversation. This current week was the only time they missed a pickup, and a call to Tori clarified that, not surprisingly, they are not picking up recyclables because of the current pandemic. Really sorry about the bad experience the others have received: We've had bad service from previous waste collection companies before, so I totally understand. But we've been happy with our service so far, and even highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "101687047280137257117", "name": "John Cleverdon", "time": 1568667694001, "rating": 1.0, "text": "Service was supposed to start on Tuesday, Sept. 6th.  Pick ups on Tuesdays and Fridays, recycling on Wednesdays.  Because of Labor day, I was told (by a neighbor) they were running a day behind, didn't find out until after they didn't pick up my trash that week.  Then the next week only picked up on Wednesday because I called after they didn't pick up on Tuesday.  Then they didn't pick up on Friday.  I called and left a message that it wasn't picked up.  When I called today (Monday) to make sure it was going to be picked up as scheduled, was told my contract was closed, and that I had called and left a message that I wanted to cancel my contract.  I didn't do that.  Was told they would re-open my account, and my trash would be picked up as scheduled.  I guess I'll see.  Maybe I should have left it cancelled and gone back to my old company.  They didn't do recycling, but at least they did what they said they would do - pick up my trash twice a week.", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "115580093923161365577", "name": "BRAD WALKER", "time": 1592596784488, "rating": 1.0, "text": "Poor customer service good luck on getting your debris  or trash picked if I could give leass the 1 star I would", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "118190914186962846415", "name": "Alan Bowman", "time": 1599774576162, "rating": 1.0, "text": "They are supposed to pick up on Tuesday... today is Thursday and they still haven’t picked up the trash. This happens at least once a month.", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "116990308444704034235", "name": "Jessica Whitney", "time": 1572991538282, "rating": 1.0, "text": "They are awful! I’ve had them for a month they have changed my trash day 4x and then don’t pick it up so it sits in my yard for days. I’ve called over and over and told I would hear back from a manager and never did. I’ve been hung up on just becuase they don’t want to hear me out... don’t waste your time or money", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "115881169186242966202", "name": "Scott Knowles", "time": 1566658448934, "rating": 1.0, "text": "The rudest freaking customer service I've EVER had to deal with! This is twice ive had to call for questions & they act like i disturbed their tea party! The next time i get this rudeness, i wil cancel & go back to my previous trash carrier! I'll be more than happy to pay a little more! At least my previous carrier wasn't RUDE when you had to call for questions 🤬", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "115539392309086031495", "name": "Tameka Love", "time": 1562093485386, "rating": 1.0, "text": "This company had a young man in my neighborhood going door-to-door yesterday. I clearly had a “No Soliciting” sign up, but this young man didn’t care. Even when I told him to please leave my property three times he was determine to get his sale pitch out to be heard. I have a question for Amwaste: What person in their right mind would sign up for service with your company, when the people you employ is disrespectful? I will never do business with this company. I wish I could give a zero star.", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "111473218751803415069", "name": "Dustin Snyder", "time": 1583944718662, "rating": 1.0, "text": "Terrible customer service. Moved and didn't restart service for 2 quarters. They are trying to charge me for the 2 quarters that I did not receive any service from them before I can restart. They are a monopoly in rural areas and know people have no other options.", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "104642527452848624186", "name": "Raúl Berríos", "time": 1567824863103, "rating": 1.0, "text": "What a bad company! No recycling pick up, wich I paid for and they pick up the trash whenever they feel like it! Shame", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "101636375532244651700", "name": "Carol Mathers", "time": 1566409668881, "rating": 1.0, "text": "HATE this company. We only agreed to switch because their solicitor practically harassed my husband and I. Switching was a huge mistake. They only picked us up ONCE and then missed us every subsequent week. It took weeks to get a hold of someone in order to cancel, and they wouldn't refund me for the months I had paid for that I wouldn't be using. Do not use this company!!", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "115480853896812629853", "name": "Noir Gold", "time": 1562623391634, "rating": 1.0, "text": "BEWARE OF THIS COMPANY-HORRIBLE CUSTOMER SERVICE!!! Waited on hold for over an hour, second time- over 45 minutes..... When I finally got through to there customer service department- The lady had a horrible attitude and hung up in my face twice. I have never received this type of disrespect to this level. But I see others have ran into the same issue so I’m not surprised.", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "110221498219989088124", "name": "Lennon Steadham", "time": 1564435428202, "rating": 1.0, "text": "Amwaste has been a nightmare. We bought in to the promises of recycling pickup when they sent their scavenger around to solicit our neighborhood. We  immediately regretted our decision after reading their reviews and called to cancel the service before it even began. They have absolutely zero customer service over the phone. I called no less than 20 times over the course of a day to FINALLY get a very aggravated woman on the phone who said our service would not be started. A week later and we have their can sitting in our front yard with, once again, no communication for them to come pick it up. We’re so glad that our current trash provider was understanding and made sure to not change our current service. Don’t. Waste. Your. Time. They get one star because google forces you to give at least one.", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "101262866304765078777", "name": "Herbert Miller", "time": 1570532580880, "rating": 1.0, "text": "They make a living by stealing your money and not providing the services  they promised. This is the second week my trash wasn’t picked up.", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "108540288121636624895", "name": "brett", "time": 1563581165908, "rating": 1.0, "text": "This sketchy company has begun price gouging small, reliable garbage companies that have been operating in southern AL for 50 years. They go door to door (even when told not to or when people have no soliciting signs in their yard) and tell people they'll pick up twice a week, which if you look at their website for 2 seconds, they only pick up once a week everywhere else. Seems like an obvious ploy just to get people to switch. Don't buy into the shady sales tactics. I've heard of them pre-filling out their cancellation cards before, and even saying that they'll send out the cancellation cards for you causing people to literally be afraid this company is going to try to cancel their other garbage pickup service. I know on the surface an *initially* cheaper and *initially* more frequent garbage service that's coming into town may seem attractive, but remember to stop and think about what they stand to gain from you, and to research if they actually hold up what they promise in other areas. There's a reason that certain companies in this area have been around for literally 5 decades, and it was done by building a clientele through RELIABLE, FAIR PRICING slowly instead of lying to people about services / going door to door price gouging other companies until they raise the prices after those companies go out of business.", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "103320020588005148719", "name": "Scott Angus", "time": 1566055748911, "rating": 1.0, "text": "Opps...we made a big mistake changing to Am Waste. Our contract began August 2nd for pick up on Friday and Tuesday. They came Friday August 2nd, then it was Wednesday August 7th not Tuesday the 6th. Last time they picked up was late Saturday August 10th, not Friday as contracted and nothing this week. I called Thursday August 15th and was told that the gal on the phone would get a hold of the Supervisor and have someone come out. Now it is Saturday, I have an over-flowing can by the street and no sign of an Am Waste truck at all.\n\nI want our money back so we can go back to a reliable service and I must warn you...DON'T DO BUSINESS WITH THIS COMPANY!!! THEY DO NOT HONOR THEIR CONTRACTS!!!", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "112529640386449551228", "name": "Matthew Booth", "time": 1565618245866, "rating": 1.0, "text": "This company is an absolute joke. Called one day after signing on with their service to cancel because I read the reviews after I signed up on July 10th. Called the 11th to cancel. Called the 15th to confirm to find out that they had not cancelled. I wasn't getting off the phone until it was cancelled. Called back on the 30th to find out where my refund was and was told that they processed refunds at the beginning of the month. Just called today August 12th, one month after cancelling, still no refund. I was told that they didn't have a refund request on file. What kind of company has a separate refund request AFTER you cancel the service. This company needs to be put to the curb. Please don't sign up for this service! It will only bring you a massive headache.", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "116797126889231921026", "name": "Lisa Walker", "time": 1566245942191, "rating": 1.0, "text": "I’m only giving 1 star bc you have to in order to review. Yes the young man came to our door to solicit business. Due to the lower cost of the service we agreed to switch. This was on Thursday June 6. However my husband and I both had a change of heart and decided to stick to the service we’ve had for over a year with NO PROBLEMS. We have 3 business days to cancel per the contract. I canceled on Monday June 10. I was told they wouldn’t cash the check they were given and they’d send it back. Surprise!! They cashed it and after almost a month of the runaround from calling I was just told “they’ll issue the checks by the end of the month”. So here it is July 8th and I’m so grateful we actually didn’t switch bc their customer service is awful. I don’t have any problems with American Waste Solutions. Don’t be fooled by the “we’re cheaper” pitch. We decided the grass wasn’t greener on the other side and decided to stay with our current provider!  I want my $57 back and I will keep in them until I receive it. Again don’t be fooled just bc you wanna save $$.\n\n****Follow up***. Here it is August 16 and I’ve yet to receive a call back from JUNE!!! I guess I’m let the BBB in on this transaction. It’s not even about the $57 even tho it’s NOT THEIRS!!!  I got a lady  today and she said they received the request in 8/5. Don’t make me get out my phone records and show you where I been calling since June. STAY CLEAR OF THIS DREADFUL  BUSINESS!!! You’ve been warned.\n\nFINAL UPDATE:  Today 8/19/19 we FINALLY received our refund today!! It’s dated 10 days ago and no one has ever called back. I called again this morning for the office manager and I think it’s a safe bet  that she ( Mary Ann) ISNT gonna call me back but this nightmare is now OVER!! Good luck to anyone else in the same boat we were in.", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "102387398869462469428", "name": "Mrs.", "time": 1561986750317, "rating": 1.0, "text": "They pick up trash only, saved plastic bottles for 3wks instead of trashing them regularly and no one even picks up the black container. All over Saraland there are black boxes by driveways and the recycleable trash just gets strewn all over the side of the road. When called about it, received lackluster customer service.", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "102273423218303958393", "name": "Rendee Gullatt", "time": 1571234265430, "rating": 5.0, "text": "Just got off the phone to set up service.\nAwesome customer service!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "108097653183236287784", "name": "Savannah Touchet", "time": 1566535757488, "rating": 1.0, "text": "I hate this company would give 0 stars if I could will be switching they dont send bills in the mail when you set it up to be done that way you can never get ahold of them through email or by the phone and even when your bill has been paid they try to suspend your services I hate this company!!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "104415075038610718956", "name": "speaksbe 1.0", "time": 1564009763841, "rating": 1.0, "text": "Very harassing came to the front door twice today. Then went to all my neighbors bugging us about recycling. This is very ridiculous. Stop harassing people!!!!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "104954698127403728626", "name": "C Lynn", "time": 1561584205740, "rating": 1.0, "text": "Refuses to stop door to door soliciting even after seeing posted signs and being told they’re not allowed in our neighborhood/on our properties. Shady.", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "113031067685039846412", "name": "Josh Harrison", "time": 1560900673106, "rating": 1.0, "text": "Please stop harassing me at my door. Thanks.", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "107224461984462364974", "name": "Tia Howard", "time": 1553280630786, "rating": 1.0, "text": "Terrible customer service. Apparently customers are just a number and they don't care about anyone but money.", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "111362275351803999531", "name": "Dynamite Dumpsters", "time": 1506531469571, "rating": 5.0, "text": "Great company to work with. Professional!", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "100231243116479037973", "name": "Sean Clark", "time": 1562206545449, "rating": 5.0, "text": "There a lot cheaper than some other garbage services, and offer more services, like recycling!", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "109893641513940102537", "name": "Kenneth Davis", "time": 1562461949710, "rating": 1.0, "text": "This company said switch to our services we'll pick up twice a week FIRST WEEK THEY MISSED THE 2ND PICK UP DAY I wish I wouldn't have left my previous service provider they where honest with me unlike......if they miss another day I'm going to cancel with them and go back to my previous\n\nI'll update next time they break the contract", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "117627900509644413595", "name": "Sherry Clark", "time": 1569334339325, "rating": 1.0, "text": "I am about to driver my garbage down to their home office and dump it on their lawn, maybe then they will come by and pick mine up", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "101926914963270766293", "name": "April Tomlinson", "time": 1567796842739, "rating": 1.0, "text": "Terrible service and TERRIBLE customer service!", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "105215104033931842684", "name": "Jeanstte Barber", "time": 1571952331996, "rating": 1.0, "text": "Sorry customer service!", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "114081903817612226777", "name": "Michele Robinson", "time": 1538765851768, "rating": 1.0, "text": "Terrible service....", "pics": null, "resp": null, "gmap_id": "0x889a4fb390038f77:0xfdf085053b546d73"}
{"user_id": "115527130331115130935", "name": "Gordon Phillips", "time": 1592259322533, "rating": 1.0, "text": "My company used this company only once.  The toilet sat on job for 7 months and was never serviced.  We use East Alabama Portables now. They know what good service is!!!!!", "pics": null, "resp": null, "gmap_id": "0x888905706ef30a55:0x464ab3a79eb03605"}
{"user_id": "111575447369057132831", "name": "Heather Timmons", "time": 1554934457643, "rating": 5.0, "text": "These guys are the best at what they do! The restroom trailers they have are for any event, and they are amazing!! I have been in homes that don't have restrooms this nice. Perfect for weddings and pretty much any occasion that need restrooms. Very well serviced and friendly. The lady that works the phone is amazing and so sweet. We come to them with all of our sanitation needs!!!", "pics": null, "resp": null, "gmap_id": "0x888905706ef30a55:0x464ab3a79eb03605"}
{"user_id": "103425922334039278433", "name": "Coach Jimmy", "time": 1612380006370, "rating": 1.0, "text": "Lack of communication....very unprofessional...all I needed was a CLEAN place for the ladies to go and they couldn't even keep ONE unit cleaned weekly like they promised!", "pics": null, "resp": null, "gmap_id": "0x888905706ef30a55:0x464ab3a79eb03605"}
{"user_id": "106526306621511365573", "name": "John Arwood", "time": 1521802806653, "rating": 5.0, "text": "HHH is who we turn to when we need waste services in their area. My Company Arwood Waste has worked with them for years and we always enjoying with their entire team!", "pics": null, "resp": null, "gmap_id": "0x888905706ef30a55:0x464ab3a79eb03605"}
{"user_id": "103136168224154012801", "name": "Destiny Fitch", "time": 1483042492816, "rating": 5.0, "text": "Great people with amazing service! We use AAA solutions for all our sanitation needs!", "pics": null, "resp": null, "gmap_id": "0x8889057069315cb5:0x86580a67806a2b9a"}
