{"user_id": "110792094125388460028", "name": "Tiffany Cope", "time": 1600657529511, "rating": 5.0, "text": "Went to a birthday party here. The kids had a great time! They do such a good job of making sure they all had an actual nice painting to take home! After the kids fill in their pictures, the workers go back and outline and add in details to really bring it to life.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPPu5BX08Vm0ijYoaQzvnvqtR6TYTEUC9BSO3mP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO0NqN3VrAzYsAgYTrvQRDUX5E2w04x9s4aWEDs=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOwp6EurKPMMQFAKye0L_RJnBdEIhQ3FGY9-rys=w150-h150-k-no-p"]}], "resp": {"time": 1623180116349, "text": "Thank you for the review! We hope to see you back soon!"}, "gmap_id": "0x88628b429faac5db:0xb11d47d73171010c"}
{"user_id": "106599616760699546349", "name": "Lisa Self", "time": 1619634972936, "rating": 5.0, "text": "The Broken Brush is such  a great place to go relax, paint, meet up with your family and friends. The staff is awesome & will help you in anyway they can. They make your visit so enjoyable that it becomes addictive. If you haven’t been what are you waiting for? This should be in your bucket list.", "pics": null, "resp": null, "gmap_id": "0x88628b429faac5db:0xb11d47d73171010c"}
{"user_id": "101126759321836525954", "name": "Bree Harrison", "time": 1623181601825, "rating": 5.0, "text": "Love this place! Everyone is so helpful and it’s the best little paint place!", "pics": null, "resp": null, "gmap_id": "0x88628b429faac5db:0xb11d47d73171010c"}
{"user_id": "104556143805900108670", "name": "Jessica Pratt", "time": 1619493967140, "rating": 5.0, "text": "Great little studio located in downtown Athens, Al! Locally owned and operated.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNnsEcjkBOjhjkuvYWRtZMNHA6PqpEOGIpY6CEF=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88628b429faac5db:0xb11d47d73171010c"}
{"user_id": "104688326861236251755", "name": "Blake Williams", "time": 1613548377473, "rating": 5.0, "text": "Amazing experience every time with Jessica, Jarred, Lisa or Stephanie! Great painting studio in downtown Athens!", "pics": null, "resp": null, "gmap_id": "0x88628b429faac5db:0xb11d47d73171010c"}
{"user_id": "107110734827450346897", "name": "Charles Stanford", "time": 1550252851411, "rating": 5.0, "text": "Great for date night. Instructors were very helpful and you will amaze yourself of what you can do. We went on Valentines and it was for Couples only. Had a great time! Would recommend this very highly.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPAj5KqQMa2j_2wlj--vFCEBgo0l0Pw0ZRGeq5x=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNHXmrBTnGTq_V6GRUlAVV3liRqxFAW2GizVGuO=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88628b429faac5db:0xb11d47d73171010c"}
{"user_id": "107848199641416274868", "name": "Vickie Clemmons", "time": 1569941680042, "rating": 1.0, "text": "My daughter paid $45.00 each for both of our projects 2/3 weeks prior to the class. When we arrived, we were told they did not have anyone signed up for that class. My daughter showed her email for payment conformation. The instructor said she would have to cut our pieces. It seemed a bother. We stood around for a while & she finally told us to sit with another class. I feel like we were not shown the attention as everyone else. We had to ask for paint, brushes, & water to clean the brushes. We are pretty crafty so we just looked at the sample and completed it on our own. We did not get holes drilled for the hanger...she could not work the drill and the piece was not sealed. I do not recommend this business. Everyone should be treated with the same attention.....very disappointed!!", "pics": null, "resp": null, "gmap_id": "0x88628b429faac5db:0xb11d47d73171010c"}
{"user_id": "113811335308211893182", "name": "Nameless Faceless", "time": 1582618416739, "rating": 1.0, "text": "My mom, niece, and I had a pretty abysmal experience here.\nIt was our third time doing a sip and paint class (I don't even want to call it a class at this point). There was little to no direction by the \"instructor\" who made it VERY clear that she was not supposed to be there that late and informed us that the girl who was supposed to teach the class couldn't make it.\nLike many other establishments like this, they offer a variety of painting classes at different levels of difficulty. You also have the option to \"upgrade\" your painting by purchasing a larger canvas.\nAnother thing that most of these places do is sell the paintings that the instructors do during every class. I wish I could say that they're affordable and worth the price, but that definitely is not the case. When I inquired about which paintings were for sale and about the general cost, the woman got snarky with me. After paying well over $100 to for little to no instruction and having an overall bland experience, I did not want to give this place any more of my money.\nPAINTER'S TIP:\nI would suggest stopping by Walmart (or ordering off Amazon) and getting a cheap variety pack of paintbrushes (I posted a photo of the pack I purchased). I found that the brushes they supplied were a little worn out and often I couldn't get my lines as thin as I wanted them (I have a heavy hand).", "pics": null, "resp": null, "gmap_id": "0x88628b429faac5db:0xb11d47d73171010c"}
{"user_id": "110220065633890231747", "name": "Brandi Paustian", "time": 1490068503702, "rating": 5.0, "text": "We love The Broken Brush! Jessica is a great teacher and it is always so much fun. My 12 year old son loves it too.", "pics": null, "resp": null, "gmap_id": "0x88628b429faac5db:0xb11d47d73171010c"}
{"user_id": "101865143184490254843", "name": "Sipping Tea", "time": 1594834119135, "rating": 1.0, "text": "I just can't even with this place", "pics": null, "resp": null, "gmap_id": "0x88628b429faac5db:0xb11d47d73171010c"}
{"user_id": "106082176348483947142", "name": "Jeremiah Blackmon", "time": 1608485634857, "rating": 5.0, "text": "Had a great time shopping Samdra’s fun and unique pottery. Look forward to collecting more 😃", "pics": null, "resp": null, "gmap_id": "0x8888359e8ff94d05:0xddf7978af7bc4acb"}
{"user_id": "112843628969373485454", "name": "Royce Pritchard", "time": 1490826765864, "rating": 5.0, "text": "Some absolutely beautiful pottery! Very unique.", "pics": null, "resp": null, "gmap_id": "0x8888359e8ff94d05:0xddf7978af7bc4acb"}
{"user_id": "106379512170157711120", "name": "Royce Pritchard", "time": 1489972384849, "rating": 5.0, "text": "Fantastic teacher and great Potter.", "pics": null, "resp": null, "gmap_id": "0x8888359e8ff94d05:0xddf7978af7bc4acb"}
{"user_id": "108350080573902326157", "name": "Kippen Gallagher", "time": 1589822327257, "rating": 5.0, "text": "Stacy is a wonderful artist potter. She is constantly evolving with her designs and her glaze work. She's a fascinating artist. Her work is a pleasure to have in my home and being used on a daily basis. From plates for my grandchild years ago to more recent mugs.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMx9hDjVuwOoLVT9umos4AKWG5UwWLGEdKcBak0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN7-Otu6pyL8XdIYayFLHcRwDOr5_VKgVkUdeRd=w150-h150-k-no-p"]}], "resp": {"time": 1589921691772, "text": "Kipper, I appreciate that so much. Thank you. It’s been a pleasure getting to know you"}, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "105747637445411874202", "name": "Kitten Kaos", "time": 1589842041580, "rating": 5.0, "text": "I have taken two classes with Stacy at the Mill over this summer.\n\nThe Octopus class was incredibly detailed and amazingly cool. Nothing held back; Stacy is invested in her students having as much success as possible in the process. She was accommodating to my flight schedule and carry-on restrictions and worked with me on the things I could not bring on the plane. The class was fun and I got to meet and make new friends with a great bunch of clay folk. And, I made a crazy octopus bowl to boot!\n\nLater in the summer, I was able to take another class, Slip Trailing, on my way to a work seminar. This was a tremendous compliment to the octopus work, and will have applications in a lot of my other work. It adds a dimension (literally) that is not available through glaze or underglaze. She was detailed enough in the chemistry that I was hooked, but not so much that the class was lost. The demos and slip play go a super long way in understanding the intricasies of the process.\n\nNow to the area. Alabama is just lovely! The hot sticky weather that they were having was perfect for my cold northern blood. The flora in Alabama is completely different to mine, and I enjoyed driving around to take it all in. The Mills are an amazing space dedicated to the arts and I could have spent days wandering the booths. And!! Anyone visiting Stacy who is gluten free or paleo; I found the most delightful bakery and eatery. Their dedicated gluten free facility has some of the best stuff, and that includes BEFORE my diagnosis. Try the jalapeno cheddar scones at Mason Dixon Bakery, you’ll never want to leave.\n\nSo seriously, if the opportunity comes to have class with Stacy and S.P.Morgan Studios, take it; you will have no regrets.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPIe6G8pfkAKvVmaeVWdTqCVFZ-KmMOg_B6chwA=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOv4tW9XFJaxXLyvtizsXfGb3AaEk10zOiKZ9RQ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN5voVbbuE5ouJtKV0l6OBBXkc-PMB3pbehYnDF=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "105807565686999285384", "name": "Betsy", "time": 1599498499842, "rating": 5.0, "text": "I have purchased several pieces from Stacy Morgan and every piece is as beautiful and well crafted as the last. The glazes and her techniques make each piece truly special whether it is functional like a great noodle bowl or decorative. Stacy responds quickly and is very helpful. I will keep ordering more.", "pics": null, "resp": {"time": 1599502310587, "text": "Thank you so much, Betsy! I appreciate your kind words and your support."}, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "104871657528943276772", "name": "Kathryn Somers", "time": 1589813067171, "rating": 5.0, "text": "I have taken 2 workshops from Stacy.  She is a wonderful instructor who is able to communicate and demonstrate effectively to her classes.   She is funny, passionate, curious and caring, thoughtful and a fountain of knowledge.   The facility at Lowe Mill in Huntsville is fantastic and her studio there is an artist's dream - open and full of light.    Her work is fully of whimsy and charm and is always flawless in its execution.   I am delighted to have a piece of her work and it makes me smile whenever I walk by it.", "pics": null, "resp": {"time": 1589822621366, "text": "Thanks, Kathryn! I hope we get to reconnect soon."}, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "113304264549191890176", "name": "Cheryl Krebs", "time": 1589814277200, "rating": 5.0, "text": "An incredibly talented potter with a ♡ of gold. I own a few of Stacy’s pieces and enjoy them even more each day. They are durable and SO FUN! I am also a potter so I have pretty high standards for skill and aesthetics... her pieces exceed the quality of most potters and the aesthetics speak for themselves. If you get a chance to meet Stacy... do it... then when you drink from one of her vessels you can think of her and enjoy the moment even more.", "pics": null, "resp": {"time": 1589822774153, "text": "Thanks so much, Cheryl. I learned by being a part of our community. <3"}, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "100345693656110350196", "name": "Daniela Perallon", "time": 1589905183186, "rating": 5.0, "text": "I'm so picky about pottery, but Stacy's work is incredibly unique, hitting all the notes from moody and dark to bright and whimsical and everywhere in-between. She's always experimenting with new designs and techniques while maintaining top notch quality. I'm proud to own her artwork! We are running out of room on our mug shelf because we can't stop purchasing her mugs.", "pics": null, "resp": null, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "115522302593406981517", "name": "Kiley Salmon", "time": 1589817857113, "rating": 5.0, "text": "I love every piece that I have from here. They are each so unique and beautiful. If you are like me and love the feel of textures on your hands you will love her work. I don't think that I truly ever appreciated the work that goes in to someone making coffee cups and vases but after touching my first cup and following her page I am always in awe of the things that she can make.", "pics": null, "resp": {"time": 1589822979360, "text": "Thank you! I appreciate the support."}, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "113786080905706081803", "name": "SofaQueen OG", "time": 1589852084159, "rating": 5.0, "text": "Her work is simply mesmerizing, the glaze work is the coolest I've ever seen. I had to get a purple squid mug and it's one of my absolute favorites.  Almost too pretty to use. I've gotten so many compliments on it and considering I've used it at least twice a week since last June, I think it's holding up well for hand made pottery. I look forward to expanding my collection.", "pics": null, "resp": null, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "115564202689522177280", "name": "Brittani Tkacz", "time": 1589817417144, "rating": 5.0, "text": "Stacy Morgan is not only a talented artist, but an excellent business owner who communicates well and is extremely accommodating. I had several questions that she answered quickly, and she shipped my purchase quickly. Upon arrival, I was amazed to find the item I had purchased (one of her awesome frog mugs) was even more beautiful in person. The design is excellent too, as the handle is sooo comfy in my hand! I give SP Morgan Studio my highest recommendation!", "pics": null, "resp": {"time": 1589822833126, "text": "Thank you, Brittani!"}, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "118166178418156667395", "name": "Deacon Wolfwood", "time": 1589810115000, "rating": 5.0, "text": "Great shop! Full of wonderful pottery for sale, the owner is super friendly, full of wonderful knowledge, and open for custom orders. Mrs. Morgan has a great idea for detail, has amazing glaze techniques, and some beautifully unique pieces, you simply MUST SEE! 10/10 WILL VISIT AGAIN.  She also has an online shop that is Mobile optimized 💛", "pics": null, "resp": null, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "109521232561880058537", "name": "Daniel Ruiz", "time": 1589814767991, "rating": 5.0, "text": "Simply some of the most amazing functional ceramic art I've ever seen. Stacy's a great person and teacher as well. Visit her, buy some of her stuff. You'll be forever grateful. Makes great gifts too!", "pics": null, "resp": {"time": 1589822797495, "text": "Thanks so much, Daniel!"}, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "101215927813649639018", "name": "Lisa Andrew", "time": 1589857130447, "rating": 5.0, "text": "I have been an admirer of Stacy Morgan's beautiful unique pottery for a while, so I jumped on the chance to take one of her workshops.  What a fun, outstanding learning experience.  Stacy is not only a talented artist, but also a skilled communicator and teacher.  I enthusiasically recommend her workshops.  When I can't make it to her studio in person, I keep an eye on her website and jump at the chance to add another piece to my collection.", "pics": null, "resp": null, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "114115630400727499809", "name": "Maria Hathcock", "time": 1589811201812, "rating": 5.0, "text": "Stacy is one of the most creative people I know. After falling in love with her techniques at creating her octopus pieces I decided to make the long trek from Texas to her studio at Lowe Mill in Huntsville, Alabama. Not only did I learn all about how to make pieces with her techniques we also quickly became friends. Her easy manner and southern hospitality were endearing and welcoming. We planned a second trip out with the original group we had but were very disappointed to have to reschedule due to Covid-19. It’s been the highlight of my year to return and take more classes with Stacy.", "pics": null, "resp": {"time": 1589811776184, "text": "Thank you, Laura. I am holding high hopes we get to have our reunion this fall and I am so looking forward to seeing you all again."}, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "114819719526592183276", "name": "Mark Campbell", "time": 1589809743065, "rating": 5.0, "text": "Stacy is a very talented potter and a great person.  Her work is thought provoking and beautiful.  I like that she steps out of normal boundaries. I would recommend her work to anybody.", "pics": null, "resp": {"time": 1589810868970, "text": "Thank you, Mark!"}, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "113212756137298390719", "name": "Barbara Russell", "time": 1589808907445, "rating": 5.0, "text": "Ordered a lil mug online & it arrived super fast & very well packed. Craftsmanship is excellent. Texture is silky, mug is lightweight but sturdy. Beautiful & exactly as pictured. Thank you so much Stacy! I'll continue collecting your pieces.", "pics": null, "resp": {"time": 1589810853576, "text": "Thank you Barbara, for your kind words and continued support."}, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "103187781800764695125", "name": "Lisa Malone", "time": 1589808459973, "rating": 5.0, "text": "I am privileged to own several of Stacy’s pieces; each is lovely and unique. When I have ordered online with shipping the pieces have been carefully packed and arrived safely. If you are looking for some amazing art, you’re in the right place!", "pics": null, "resp": {"time": 1589810803323, "text": "Thank you, Lisa! I so appreciate your support...you’ve been with me since day one and I am forever grateful."}, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "116785692692530811127", "name": "Amanda Conger", "time": 1589810338622, "rating": 5.0, "text": "Stacy's mugs are my handsdown favorites. They are a generous size but not to heavy/bulky to hold with a perfect little thumb spot and gorgeous designs. Whenever we open the cupboard, they are the first mugs everyone makes a beeline for. They wash in the dishwasher (nothing fussy) and have held up wonderfully.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOdiT23PuDm6MpwnPj8Rp4OK3e1suplurUt2wSk=w150-h150-k-no-p"]}], "resp": {"time": 1589811680496, "text": "Thanks, Amanda. There is no finer compliment to a potter than to know their work is being used and loved regularly!"}, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "112686972813814146101", "name": "Joseph Bott", "time": 1589848203202, "rating": 5.0, "text": "I have dealt with Stacy at S.P Morgan Studio many times. Her work and business are both amazing and respectful. She works hard to treat customers with care and always has a smile on her face. Without a doubt, one of the best pottery people in the business.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNAm8aPIVkhwrivkAIXj8Lsabu7hScNPF_Z33Rc=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "111593871006738813889", "name": "Dave Edens", "time": 1589810315979, "rating": 5.0, "text": "When visiting Lowe Mill Stacy's studio is always a must stop. On top of the amazing finished works on display, it is a working pottery studio and you can see her at her craft pretty much most of the time. I have a couple of her pieces and they are both wonderful and functional.", "pics": null, "resp": {"time": 1589811631580, "text": "Thank you, Dave! Always a pleasure to see you!"}, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "101397237459516443452", "name": "William Wolf", "time": 1589809748643, "rating": 5.0, "text": "Stacy's artwork is sublime. From the everyday objects like mugs and plates, to the fantastic sculptures of sea creatures and fae beings, everything is beautiful, functional, and most of all filled with her love of her art. I would recommend getting your hands on some of it as soon (and as often) as possible.", "pics": null, "resp": {"time": 1589810886098, "text": "Thank you, William!"}, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "107460077824286907633", "name": "gail armand", "time": 1589823384387, "rating": 5.0, "text": "Some of my favorite pottery ever. It is in my personal collection and is one of my favorite things to give people I love. Highly distinctive. I would recognize SP Morgan anywhere, including the Smithsonian. Yes, it is that good.", "pics": null, "resp": null, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "105593963203575487506", "name": "Yvonne Castillo", "time": 1589825891559, "rating": 5.0, "text": "Stacy’s art work is stunning with gorgeous details. I’ve had the pleasure of taking classes from her and learned even more than the class was about. Stacy is always makes sure you understand the reason behind the process as well as the process of the class material. I definitely recommend her classes and beautiful art.", "pics": null, "resp": null, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "104708377708536677566", "name": "Darlena Dettmer", "time": 1589812649427, "rating": 5.0, "text": "I absolutely LOVE this place! Each piece is carefully handcrafted with unique detail and made with the finest of quality! I would give S.P. Morgan Studio more than 5 stars if Google had it.", "pics": null, "resp": {"time": 1589822584939, "text": "Thank you, Darlena!"}, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "116251004713992261776", "name": "Jules W", "time": 1589813658423, "rating": 5.0, "text": "I love S.P. Morgan's pottery. I love her creative side along with great quality of mugs, bowls and vases. I live out of state and have never had a problem with receiving my items through shipping.", "pics": null, "resp": {"time": 1589822700380, "text": "Thank you so much. I try my best"}, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "111522154945875635361", "name": "OkRandom Art", "time": 1589891104142, "rating": 5.0, "text": "Stacey is a prime example of why I work with local artisans. Every time I pick up a piece of her work I learn something new about her process. The transaction is more personal...it comes with a story...and her work is simply stunning . You will not find these things in a department store. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "117312004753838018857", "name": "Heidi See", "time": 1589831166221, "rating": 5.0, "text": "I ordered a cup from Stacy. It came really fast. It was packaged very securely the mug arrived in perfect condition and was exactly what i wanted. She even sent me an extra surprise with it. Thank you so much", "pics": null, "resp": null, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "105396620473268256577", "name": "Helen Lien", "time": 1589854967152, "rating": 5.0, "text": "I have purchased several pieces from Stacey for both myself and as gifts. I could not be more satisfied with each and every purchase. Her designs are creative, unique, and well-executed. Be sure to follow her on Facebook to see her latest glaze experiments and works in progress.", "pics": null, "resp": null, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "105402985386294846218", "name": "Robin Lucas", "time": 1589812491478, "rating": 5.0, "text": "I’ve not only purchased Stacy’s fabulous work, but I’ve taken a workshop as well.  She’s a great teacher and the passion in her work shows in every piece she makes.  I’ve been won over as a fan for life!", "pics": null, "resp": {"time": 1589822570782, "text": "Thanks, Robin!"}, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "114188035470243568520", "name": "Elizabeth Lobdell", "time": 1589836094095, "rating": 5.0, "text": "I bought 2 lovely mugs from SP Morgan as gifts. I shamelessly kept them and found something else to give. I absolutely love the way they feel in my hand.", "pics": null, "resp": null, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "104456536240435151746", "name": "Tonya Sitko", "time": 1589838515878, "rating": 5.0, "text": "Stacy’s art is amazing. As an example, her octopus bowls and tentacles are simply extraordinary. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "105732530667589142025", "name": "Diahn Ott", "time": 1590079807340, "rating": 5.0, "text": "I’m honored to not only own two of Stacy’s pieces, but to have taken a fantastic workshop on slip-trailing with her. She is a truly wonderful teacher, an inspired artist, and I look forward to a time when I can collect some more of her work and take another class.", "pics": null, "resp": {"time": 1599502327542, "text": "Thank you, Diahn!"}, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "109404722877222250868", "name": "Kathryn Phelan", "time": 1589813335268, "rating": 5.0, "text": "Love my mug. The textural details and colors are wonderful. The handle and lip edge are very comfortable.", "pics": null, "resp": {"time": 1589822634937, "text": "Thank you"}, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "107825172386363526673", "name": "Ronda Bynon", "time": 1589822417869, "rating": 5.0, "text": "Ms. Morgan's potter has a unique quality that makes me keep coming back to purchase something new.  She is also extremely knowledgeable about her art and willing to share that knowledge.", "pics": null, "resp": null, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "101020557298376071891", "name": "Miki Bowman", "time": 1589819809018, "rating": 5.0, "text": "I have a few pieces of her work and I've drooled over many more! Her style is unmistakable and pulls at my heart. Plus, her dog is freakin' awesome.", "pics": null, "resp": {"time": 1589921627449, "text": "Ha! Thank you! And Whiskey says hello!"}, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "105493494019003770971", "name": "Susan Burlingame", "time": 1589817628868, "rating": 5.0, "text": "Took a workshop with Stacy. She is generous with her information and process.  A really nice person too.", "pics": null, "resp": {"time": 1589822918922, "text": "Thank you, Susan!"}, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "101663478592325976225", "name": "j cole", "time": 1589821280498, "rating": 5.0, "text": "Some of the most beautifully crafted pottery I have ever seen! The octopus pieces are so delicately sculpted and are so incredible!", "pics": null, "resp": {"time": 1589921653605, "text": "Thank you so much!"}, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "114018358512442284909", "name": "V Wyatt", "time": 1589813417141, "rating": 5.0, "text": "I call it my \"Tuesday mug,\" and have been using it most Tuesdays for at least a couple of years. It has been in the dishwasher and the microwave countless times, and so faithfully continues to bring me visual delight as I trundle through my day.", "pics": null, "resp": {"time": 1589822676411, "text": "That’ll make a potter smile....love hearing that my work is holding up well to real use!! Thank you!"}, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "104819205906346272598", "name": "Denise Joyal", "time": 1589809872553, "rating": 5.0, "text": "Wonderfully talented artist. A must-have for your ceramics collection!", "pics": null, "resp": {"time": 1589810910580, "text": "Denise, I so appreciate the kind words! Thank you."}, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "107541876621797816353", "name": "Jeanna Wing", "time": 1589819663853, "rating": 5.0, "text": "This studio has some amazing, original work! Wonderful person, great atmosphere!", "pics": null, "resp": null, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "118303380032793028654", "name": "Brenda Armistead", "time": 1589823079104, "rating": 5.0, "text": "Absolutely LOVE this artist's studio.  Wonderful work, great atmosphere.", "pics": null, "resp": null, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "103429336585281919000", "name": "Rebekah Krieger", "time": 1589857672408, "rating": 5.0, "text": "I love my little cup, it’s well made and arrived quickly!", "pics": null, "resp": null, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "106548843315608496823", "name": "Joanie Nash", "time": 1589814165613, "rating": 5.0, "text": "Stacy is a wonderful teacher. Thank you for everything you do and share.", "pics": null, "resp": {"time": 1589822712817, "text": "Thank you, Joanie!"}, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "111929617456679017269", "name": "Rebecca Ziemer", "time": 1589820484942, "rating": 5.0, "text": "Stacy is AWESOME!!!!! Great personality, flawless products, and entertaining as heck.", "pics": null, "resp": {"time": 1589921640329, "text": "Thanks, Rebecca!"}, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "113511020496972690335", "name": "ambi dreamt", "time": 1484383066102, "rating": 5.0, "text": "Talented artist & potter living her dream, with a gleam in her eye & a wit to her banter.  Check out her craft!", "pics": null, "resp": {"time": 1484670592743, "text": "Thank you, Jennifer!"}, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
{"user_id": "102960989055679887674", "name": "Kris Gibson", "time": 1483140252437, "rating": 5.0, "text": "Amazing pottery!", "pics": null, "resp": {"time": 1483140761891, "text": "Thank you so much, Kris!"}, "gmap_id": "0x88626cbcca324b2d:0x6d862a64a6cb230d"}
