{"user_id": "107611210647546268924", "name": "Doc Spook", "time": 1510169007462, "rating": 5.0, "text": "very happy with this entire experience.\nfriendly people willing to meet me after hours or bring parts to meet me in Dothan as i am from out of town.   Quality work done fast and cheap!", "pics": null, "resp": null, "gmap_id": "0x8892982a8f233cf3:0xccb63ce34a4b592c"}
{"user_id": "100081269801367890626", "name": "Helena Banks", "time": 1597791333266, "rating": 5.0, "text": "Very old glider & chairs that belonged to my Mother.  Stateline did an awesome job restoring them for me.  I picked a textured finish in rust color and truly love them.  Great company to work with.\nTerri Hooper", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO-lN4AIvgmtX_2vN57mDmVM1d-jvkU1cWooQ5R=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNDh2Yv-_rzgxS9gK4f-KzUbbDQHdcoot0rTMfr=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM-GbNIFnFVftCEMiAnEeWviwFF0o6vNndeiTjT=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM_YVwebNYCSDwaq1yCwCIisQYo9Bq4ZQM7o0Er=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMB92DA6tvp3XwqcsYio1BZhs7gLz0XI8fVnHHP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO8gzXfxRZ7EZEa7YJD6nXDQfhK14OZMHWUDGEf=w150-h150-k-no-p"]}], "resp": {"time": 1598038057621, "text": "Terri, we love being able to take our customers antique pieces and restoring them with the unique color that you chose.  While these priceless pieces were originally your Mother's, you've added new life to them & will treasure them for years to come.  Thank you for trusting us with this project!"}, "gmap_id": "0x8862457c2888ce9d:0x82673dd217a5652e"}
{"user_id": "109063956324002300964", "name": "J Cowan", "time": 1601429992012, "rating": 5.0, "text": "Stateline Powder Coating did a great job on my swing.  Our swing is over 45+ years old. They did an amazing job on it. So excited to get it hung back up. I am in love and look forward to many more memories shared in this swing. Thank you so much!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMbU8QhyfG1p3ZXjSIhNAstqqMiF2LleleGNK7x=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNEDKRJSTmPLr1wN29622pAPeGBYJPqCtxEcVIt=w150-h150-k-no-p"]}], "resp": {"time": 1597410884567, "text": "Jolie we love being able to take a family heirloom & help our customer restore it to original.  We hope you spend many happy hours swinging and creating lasting memories.  Thank you for trusting us with your project!"}, "gmap_id": "0x8862457c2888ce9d:0x82673dd217a5652e"}
{"user_id": "106702689161907782228", "name": "turbopromodified", "time": 1597786388978, "rating": 5.0, "text": "I have done a lot of business with Stateline Powder Coating, and I have always been thrilled with the results. The quality of work is as good as it gets; they always pay special attention to masking off threaded parts and machined surfaces. The prices are more than fair, and turnaround times are very fast. They have the ability to process parts that vary in size from small fittings all the way up to complete chassis. I plan on continuing to use Stateline in the future on all of my projects.\n\nTravis Q.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOK0Nwu8he3KOJ1UY2gBiaNh6xIrDoF-DnwDm6E=w150-h150-k-no-p"]}], "resp": {"time": 1598038409325, "text": "Travis, we consider it an honor to work on your projects!  Thank you for trusting us with all of your work.  We look forward to seeing what you'll bring next!  BTW that car is absolutely amazing!"}, "gmap_id": "0x8862457c2888ce9d:0x82673dd217a5652e"}
{"user_id": "100361552913579761820", "name": "Aaron Barnes", "time": 1600299189469, "rating": 5.0, "text": "I needed a high-quality result for a 4130 helicopter frame. I traveled to the shop and was sold upon arrival. No additional stops required which was nice. Staff is exceptional, shop is professional with quality equipment.\nDelivery was scheduled with a completion eta of 2 weeks. Within the first week I had an unsolicited update with pictures. That was unexpected and very much appreciated. Again, professional. Ahead of schedule, great start. At day 10 I was informed that the job was complete and ready for pickup at my convenience. The cost was exactly that quoted. Underpromise, overdeliver. I'm very pleased with the performance, service and result and will be back for any coating I need. Pics unavailable but I'll add them if possible when able.", "pics": null, "resp": {"time": 1600722847031, "text": "Aaron, we truly appreciate you trusting us with your unique project!  We will be talking about your Helicopter for years to come & are looking forward to seeing the finished work & you flying it out to visit us.  Thank you again for allowing us the opportunity to work with you on this awesome piece."}, "gmap_id": "0x8862457c2888ce9d:0x82673dd217a5652e"}
{"user_id": "111074996317891519703", "name": "Joe G", "time": 1597369016898, "rating": 5.0, "text": "This is a professional shop that is always willing to take on my unusual projects.\nTheir preparation surpasses the industry standards and their coatings are strong and wear admirably.\nI use them for all my custom table bases but they are willing to  try and push the envelope to coat flame-colored copper and my metal etches and patinas.\nOrdinary paints and lacquers wouldn't do what I needed.\n5 Star Service at reasonable costs!!", "pics": null, "resp": {"time": 1597410044986, "text": "Joe, Thank you for trusting us with your projects.  We are honored to help complete whatever is needed, and we look forward to your future business."}, "gmap_id": "0x8862457c2888ce9d:0x82673dd217a5652e"}
{"user_id": "107622710298574848578", "name": "JJ'S Coffee", "time": 1597346618466, "rating": 5.0, "text": "My sign was coated in a custom red and put up within the week. It's been in direct sun and Tennessee weather it has not faded or scratched in the year it's been up. Very pleased with my sign and thankful to have this business in our community. If you are in Ardmore come on by the shop and see their great work for yourself. Highly recommend", "pics": null, "resp": {"time": 1597410454503, "text": "Jamie, Thank you so much for trusting us with your projects!  That sign is an eye catcher & it sure sparkles & shines.  Give us a call for any future projects that we can help you complete!"}, "gmap_id": "0x8862457c2888ce9d:0x82673dd217a5652e"}
{"user_id": "115886514580990376880", "name": "Brennan Bell", "time": 1597861489434, "rating": 5.0, "text": "Brought a dirt bike frame to have powder coated. Looks amazing and will be bringing more things for them to powder coat. Super friendly and very helpful!! Would definitely recommend using them!!!", "pics": null, "resp": {"time": 1598037670268, "text": "Brennan Thank you for allowing us to help you with restoring your Dirt Bike!  We look forward to working with you on future projects & are glad that you're happy with our work."}, "gmap_id": "0x8862457c2888ce9d:0x82673dd217a5652e"}
{"user_id": "107171913735931149764", "name": "Gwyn Wright", "time": 1597347307544, "rating": 5.0, "text": "They did a wonderful job on the wheels for my 17 year old horse trailer. Look BRAND new, even better than new! Better than paint as this will last forever!", "pics": null, "resp": {"time": 1597410290362, "text": "Gwyn Thank you for trusting us with your trailer wheels!  I agree they look awesome & with proper care will last forever!"}, "gmap_id": "0x8862457c2888ce9d:0x82673dd217a5652e"}
{"user_id": "110823205582737380891", "name": "Joel Ratley", "time": 1621705649077, "rating": 5.0, "text": "Won a door prize", "pics": null, "resp": {"time": 1622035680868, "text": "Joel, Thanks for attending our Open House!"}, "gmap_id": "0x8862457c2888ce9d:0x82673dd217a5652e"}
{"user_id": "113848512581917043774", "name": "Glenn Rumer", "time": 1597857424854, "rating": 5.0, "text": "I have had several car parts done and some were done almost 3 years ago with zero problems, still look new as the day I had them done!!!! Awesome people to deal with. People that are giving them bad reviews must have issues. Trust them with anything!!!", "pics": null, "resp": {"time": 1598037838311, "text": "Glen, Thank you for allowing us to powder coat your parts with those amazing unique colors!  We're thrilled that you're pleased with our work and we look forward to working with you on all of your future projects!"}, "gmap_id": "0x8862457c2888ce9d:0x82673dd217a5652e"}
{"user_id": "112811073454052076548", "name": "MJK M", "time": 1597548695852, "rating": 1.0, "text": "Don’t trust their work looks good until it fades a few days later.", "pics": null, "resp": {"time": 1597693032440, "text": "We're so sorry that you're not pleased with our work.  Please provide us with more information about your items.  Your Invoice will have an Invoice number, date and your name on it, if you'll provide us with this information we'll look into this situation in depth."}, "gmap_id": "0x8862457c2888ce9d:0x82673dd217a5652e"}
{"user_id": "113503669766552665192", "name": "Shannon Hagerman", "time": 1598612755946, "rating": 5.0, "text": "An absolute pleasure to do business with. A family business that is professionally operated with quality work and reasonable prices.", "pics": null, "resp": {"time": 1599054280300, "text": "Shannon, Thank you for the 5 Star Review.  It's been our pleasure to work on your projects and perfect them to your satisfaction.  We look forward to seeing you with all of your future projects!"}, "gmap_id": "0x8862457c2888ce9d:0x82673dd217a5652e"}
{"user_id": "107505844496318131160", "name": "logan mcclain", "time": 1597252399161, "rating": 1.0, "text": "This is the worst business ever by far the powder coating wears of in 3 weeks and then it fades and looks absolutely horrible. They charge tons of money and when you ask to redo the service they did they try to charge you again and won’t refund you. Never EVER go here please.", "pics": null, "resp": {"time": 1597347833904, "text": "Logan, I'm so sorry that you're not pleased with our work.  We searched our records and aren't able to locate you as being one of our customers.  If you could please provide us with a copy of your detailed invoice, the date the work was completed and it will also have your name on it.  Once you provide me with this information I will check into the issue."}, "gmap_id": "0x8862457c2888ce9d:0x82673dd217a5652e"}
{"user_id": "106709054007656324547", "name": "Jamie Jordan", "time": 1555281877710, "rating": 5.0, "text": "These guys have done anything from tumblers, chairs, tables, all the way to creating my custom sign for my shop. They're professional, affordable, and deliver beyond my expectations everytime. Absolutely, recommend this company! Thanks again guys!", "pics": null, "resp": {"time": 1599054533416, "text": "Jamie, Thank you for trusting us with all of your powder coating needs!  We look forward to serving you on your next project!"}, "gmap_id": "0x8862457c2888ce9d:0x82673dd217a5652e"}
{"user_id": "108430477653673952459", "name": "mark roller", "time": 1590095515562, "rating": 5.0, "text": "Great people to work with and they do great work", "pics": null, "resp": {"time": 1597411087753, "text": "Mark,  I hope your wife is enjoying those columns & that arch, they are definitely  unique pieces.  Thank you for allowing us to restore them for you!  We look forward to working with you on any future projects that you have!"}, "gmap_id": "0x8862457c2888ce9d:0x82673dd217a5652e"}
{"user_id": "110174013562611693341", "name": "Mark Jarrell", "time": 1615902132279, "rating": 5.0, "text": "Make sure to call before you go if you are dropping off or having something quoted. Office staff and all the associates I dealt with were professional and courteous. I had two relatively large pieces blasted. A steel after market bumper and a steel core support out of a heavy duty truck. They did a fantastic job on both for a very reasonable price. They even helped me load them when I went to pick the items up. I will use them again for any items I need blasted, big or small.", "pics": null, "resp": null, "gmap_id": "0x88891b8832f863e7:0xb103fe190435298e"}
{"user_id": "102700679102256503662", "name": "Dewayne Coleman", "time": 1599584111527, "rating": 5.0, "text": "Super nice folks to work with", "pics": null, "resp": null, "gmap_id": "0x88891b8832f863e7:0xb103fe190435298e"}
{"user_id": "110485217694617256183", "name": "Don Froelich", "time": 1607799985320, "rating": 5.0, "text": "Very good place to get powder coating done. I'm a welder and have been taking projects to Windsor's for many years.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPDjNB286WYV3iHgTDh7jNpE-3G41twfXAmHbeV=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPbiXgkCk3nhPrI-fLqs5XrOOj-iCqJqWWqLgO6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNc96NHWGTDBPAhEzZ3wYIKd9b9-xSP8tWqHz6T=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNB1MYe2HFnlrp0ty9H8_mh-4IG3tCvU0688H7U=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889cd40eff18759:0x2a038810d60b0307"}
{"user_id": "117818445955111787783", "name": "Moses Brown", "time": 1592591333007, "rating": 5.0, "text": "There aren’t word to describe the impeccable service/great family atmosphere that Mr Windsor and his Staff exhibit that I’ll continue to travel from Huntsville to have my projects done.....period....truly a ⭐️⭐️⭐️⭐️⭐️ Operation................“Keep up the Great works..SFC M. Brown US Army (Retired)", "pics": null, "resp": null, "gmap_id": "0x8889cd40eff18759:0x2a038810d60b0307"}
{"user_id": "117255496115456228356", "name": "David Flanary", "time": 1590160806877, "rating": 5.0, "text": "Great service and product from this family owned and operated business! Always honest and fair in every aspect of their work!", "pics": null, "resp": null, "gmap_id": "0x8889cd40eff18759:0x2a038810d60b0307"}
{"user_id": "106431617364995187152", "name": "Mel Cowan", "time": 1501022412219, "rating": 5.0, "text": "These guys are the greatest! Very professional, and will go out of their way to please any customer. I just love how they give a personal touch to every thing they touch!", "pics": null, "resp": null, "gmap_id": "0x8889cd40eff18759:0x2a038810d60b0307"}
{"user_id": "113830530147287918611", "name": "John RISTINE", "time": 1591630672379, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x8889cd40eff18759:0x2a038810d60b0307"}
{"user_id": "105735763905092870095", "name": "Latoya Sumerlin", "time": 1594294075967, "rating": 1.0, "text": "Okay place to work but needs pay increase and better supervisor.", "pics": null, "resp": null, "gmap_id": "0x888925d68a1cafa9:0xaf9f090ea031bd0e"}
{"user_id": "105521578316394131707", "name": "Fronanda Strickland", "time": 1597877871746, "rating": 5.0, "text": "So so not bad anytime you're dealing with car parts the wait time is unpredictable...", "pics": null, "resp": null, "gmap_id": "0x888925d68a1cafa9:0xaf9f090ea031bd0e"}
{"user_id": "111863789933067049731", "name": "Hayley Boteler", "time": 1543601035819, "rating": 1.0, "text": "Lady at the front desk was very rude, and didn’t really care to help out a customer. Should probably make sure your employees have a good attitude before you hire them.", "pics": null, "resp": null, "gmap_id": "0x888925d68a1cafa9:0xaf9f090ea031bd0e"}
{"user_id": "108272615915076817700", "name": "Max TheSavage", "time": 1500660172298, "rating": 1.0, "text": "3 hours in dock waiting for unloading and they  not even start", "pics": null, "resp": null, "gmap_id": "0x888925d68a1cafa9:0xaf9f090ea031bd0e"}
{"user_id": "104391327731926206475", "name": "Jon Lauterbach", "time": 1523224685575, "rating": 5.0, "text": "Good prices and great work. Highly recommend!!", "pics": null, "resp": null, "gmap_id": "0x888bb19e6dc53279:0x2c8561f9d0d34a95"}
{"user_id": "109761080054486226757", "name": "William Hayward", "time": 1408651352353, "rating": 5.0, "text": "Roll bars and brush guards look perfect!", "pics": null, "resp": null, "gmap_id": "0x888bb19e6dc53279:0x2c8561f9d0d34a95"}
