{"user_id": "100096693228699639303", "name": "A D", "time": 1568142607210, "rating": 5.0, "text": "They were so caring to my wife and so concerned about my wife's health my kids health and continued to call and check on us and offer us encouragement for a long time after we left the area. They are wonderful people never pushy never snooty or judgmental as some have claimed. They are just loving people that want to try their best to help. e love you all and thank you for what you did to try to help our family.", "pics": null, "resp": null, "gmap_id": "0x889a4d12c2e3b3d7:0xd4ee3f0c97b7ea3"}
{"user_id": "102449366774885605306", "name": "Brandi Frye", "time": 1579849476474, "rating": 5.0, "text": "I found out I was pregnant and couldn’t get an appt with my obgyn until three weeks out . My friend recommended me here and I literally got in that Monday . No wait , very sweet and caring . They confirmed I was pregnant and did me a free ultrasound a week later . They stayed in touch my whole pregnancy and after I had the baby they told\nMe to come pick up a gift bag for the baby . They made my pregnancy go so smooth . They are wonderful.", "pics": null, "resp": null, "gmap_id": "0x889a4d12c2e3b3d7:0xd4ee3f0c97b7ea3"}
{"user_id": "101129737574810046493", "name": "Bethany Wattier", "time": 1552852289522, "rating": 5.0, "text": "Wonderful place! Wonderful staff! Everyone is so kind and informative!", "pics": null, "resp": null, "gmap_id": "0x889a4d12c2e3b3d7:0xd4ee3f0c97b7ea3"}
{"user_id": "116743193455876384050", "name": "Meriem Nadir", "time": 1480678411535, "rating": 5.0, "text": "Two years after the loss of our son we found out we were expecting. Unfortunately financially things were difficult. I saw a billboard that said \"pregnant and afraid\" call this number, so I called and made an appointment. I came in took a pregnancy test and they scheduled me for a free ultrasound. About a week later I came in for my ultrasound. I was overcome with emotions that it was hard for the nurse to see what was going on due to my crying and shaking. She was very kind and understand. All in all the women's resource center changed my life and made it possible for me to grow in my relationship with the Lord. I am forever grateful!", "pics": null, "resp": null, "gmap_id": "0x889a4d12c2e3b3d7:0xd4ee3f0c97b7ea3"}
{"user_id": "107619700641579473464", "name": "April Starling", "time": 1462168342626, "rating": 5.0, "text": "Great people! Very helpful.  And they all nothing in return.", "pics": null, "resp": null, "gmap_id": "0x889a4d12c2e3b3d7:0xd4ee3f0c97b7ea3"}
{"user_id": "102708087387209457198", "name": "Lkhagvatseren S", "time": 1582346778419, "rating": 5.0, "text": "Wonderful place 😘", "pics": null, "resp": null, "gmap_id": "0x889a4d12c2e3b3d7:0xd4ee3f0c97b7ea3"}
{"user_id": "106039323366896874713", "name": "Bridgette Jordan", "time": 1485477237010, "rating": 5.0, "text": "great place at helping keep babies Alive", "pics": null, "resp": null, "gmap_id": "0x889a4d12c2e3b3d7:0xd4ee3f0c97b7ea3"}
{"user_id": "103237600361427725709", "name": "catherine chung", "time": 1560005309335, "rating": 1.0, "text": "Doesn't offer pro choice services, and entangles its so called Christian agenda in local school systems to persuade women against abortion.", "pics": null, "resp": null, "gmap_id": "0x889a4d12c2e3b3d7:0xd4ee3f0c97b7ea3"}
{"user_id": "117006222463746454518", "name": "Just Me", "time": 1618336887949, "rating": 2.0, "text": "All the staff has been quite friendly, but I've never waited less than an hour and half after my scheduled appointment just to be called back, and then at least another hour just be seen afterwards. Even for simple follows ups, where Dr. Voss is in the room for less than ten minutes. My first appointment there had me waiting for four hours to be called back. Clearly, too many people get scheduled at one time in place that may also need to make time for random emergencies.", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "104760267049157418039", "name": "G B", "time": 1616817449395, "rating": 5.0, "text": "I've had nothing but great experiences with Dr.Voss as well as the entire staff. They are very thorough and patient with any of my questions or concerns. I'm ok with waiting at times because some situations need a little more attention. The longest I've waited has been an hour and that was because she was delivering a baby that day.  People will wait in a restaurant for hours to eat but gripe about the time it takes to take care of your health.  Great job to this staff dealing with today's society.", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "114014106900595446128", "name": "A01", "time": 1611451595986, "rating": 1.0, "text": "DO NOT GO TO DR. VOSS. I moved to Dothan towards the middle of my pregnancy in 2018. I was initially seeing another doctor who I loved but Voss delivered my son. At my 6 week check up, I informed her that I have fibroids and wanted to be prescribed the same medication that I was on prior to pregnancy to decrease the pain from menstrual cycles. She flat out told me that SHE did not believe in pain reliever medication and would not prescribe it. She also stated that my birth control should “handle it” and walked out of the room without allowing me to respond. I never returned to that office. She is a horrible doctor! She showed me that day that her views were more important than my health and my pain. That’s more than unprofessional.", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "112003339453418919088", "name": "Tore Hudson", "time": 1620874301870, "rating": 3.0, "text": "People are great. Wait times are ridiculous.", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "117199341596309856827", "name": "Jill Biggs", "time": 1627868116138, "rating": 5.0, "text": "They are the Best .", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "117582040360246825390", "name": "Angelique B.", "time": 1603221344879, "rating": 1.0, "text": "Dr. Voss is the worst. I have waited for over an hour after my schedules appointment for all my appointment. This appointment today I’m at 2 hours and still waiting. She’s so disconnected with her patients. She a promonda that knows if a patient is her we need help. But instead she makes you wait until she’s ready to see you. I will call my insurance and change her as my caregiver. The worst ever!!!", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "100403564597629937587", "name": "Ronniesha Oliver", "time": 1603386812051, "rating": 5.0, "text": "Dr. Voss is great. It takes some time but she's very thorough with her patients and make sure all your needs and complaints are taken care of I couldn't ask for a better doctor.", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "107445200889437566583", "name": "ARLEA MCDANIEL", "time": 1551371611365, "rating": 4.0, "text": "Dr. Torrance has been my gynecologist since I moved back to Alabama since 2016.  She did my hysterectomy and I must say she is one of the best doctors that I have had since moving back.  For me she is very comfortable to talk to and very thorough.  Now I can say a few times that I have been there I have had to wait at least 45 minutes for her or her assistants to come in the room and one time I thought that they forgot I was there.", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "107472875204423251029", "name": "Beth Holland", "time": 1557334710168, "rating": 5.0, "text": "I've been a patient of Ladies First for 6 years. Dr. Voss spends time with me to answer any questions that I may have.  She is attentive and listen to my concerns. The nurses are quick to call back me back with any questions I may have. The staff is professional and knowledgeable, always accommodating!  I am especially fond of the Enterprise office, these ladies are true caretakers and love their jobs, it shows!  I've also used Sabrina Kelley for weight loss and got great results.  I recommend Ladies First of Dothan for any type of women's needs.", "pics": null, "resp": {"time": 1567878214331, "text": "What a marvelous comment. Thank you!"}, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "109416616248172225195", "name": "Wendy Golemon", "time": 1574089604804, "rating": 5.0, "text": "My overall experience was great at. Ladies First. I was greeted when I walked in and made to feel like a friend not a patient. Angeline and Skyler at the front desk make you feel welcome and answer any questions you have. The nurses assistant Jamila was friendly and helped with my anxiety of being there. Then, I met Pam Jones the ARNP and she was wonderful at easing your mind and very knowledgeable. Dr.Voss also stopped in and introduced herself. She was really friendly and explained everything she was doing and answered all questions I had. I definitely will keep this provider! Great service!", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "113873479524397395047", "name": "Aubrey Miller", "time": 1578864521922, "rating": 5.0, "text": "I want to start off by saying I was hesitant to come to this OBGYN office based on some other reviews. I noticed a pattern that a lot of reviewers complained of the wait time and I will say that I did have a couple appointments where I waited a little longer to be seen. It really wasn’t that long so it was barely worth mentioning but I figured I would since it seems to be an issue with other patients. But knowing what I know now I understand why. Dr. Voss is amazing. I came in for my pregnancy and ended up being high risk. She explained everything in great detail and what the plan would be for my pregnancy. She even addressed why there may be a longer wait time sometimes, which I didn’t even bring up, but I thought it was nice that she did. It shows that she’s aware of patient concerns and doing what she can about it. They see patients for regular appointments but also unscheduled appointments if there is an issue that isn’t severe enough for the ER but still needs to be addressed quickly. This was me on a couple of occasions. I called in the morning on 3 separate occasions and was seen within a couple of hours due to complications with my pregnancy. So I really appreciate being seen so quickly and will take waiting a little bit longer for scheduled appointments because of it. The entire staff is very friendly and attentive. When things got serious with my pregnancy Dr.Voss was on top of it and I couldn’t have asked for better care. Things could have gone a lot worse for a lot of reasons but her quick action due to her vast knowledge made sure that the outcome was best case scenario. She followed up with me a couple of times after everything to make sure I was doing okay and I really felt like she took her time. She spent a considerable amount of time talking with me about everything, which is not always the case with some doctors. Very often I feel rushed when I am seeing a physician so in the situation I was in it was nice to feel like I had her ear and care. I wouldn’t hesitate to come back to Dr. Voss for future pregnancies or any other needs. Thank you so much Dr. Voss ❤️", "pics": null, "resp": {"time": 1578869195862, "text": "Your thoughts are very much appreciated! Thank you. Sending you and your family the best of wishes 🙏"}, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "117085700490143859906", "name": "angelia martin", "time": 1574332268374, "rating": 5.0, "text": "I absolutely LOVE Ladies First Med Spa, they are ALL so warm, genuine and welcoming and make you feel special, not just another client. Christy takes extreme pride in her work and strives for optimal results tailored specifically for each of her clients concerns, goals and desires, her enthusiasm is contagious and she is truthful about what to expect and will guide you in making the best decisions to achieve the best results. Dr. Voss wants her patients to feel comfortable, relaxed and happy with any and all services provided, just as much as Christy. They work together as a team and make your experience a very warm and positive one and will go above and beyond to ensure that you have the absolute best experience and results!", "pics": null, "resp": {"time": 1574340905935, "text": "Thanks so much!!!  We love you and your always lovely smile!!! Your personality warms your path!!!"}, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "105859481932552293897", "name": "Jessie Holmes", "time": 1523467759530, "rating": 5.0, "text": "I’m honestly surprised at the negative reviews. We had our second child with Doctor Torrence, who is an absolutely amazing woman. We just found out we are pregnant with our third and are excited to be back. The staff have always been kind and helpful, never had any issues in the full 9 months we were there before. They Always returned our calls, always kept us informed. Repeat customers here!", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "108750497058104384728", "name": "Deborah Isler Mercer", "time": 1523905685615, "rating": 5.0, "text": "I went here a few years ago, but switched to my regular physcian so I could get it all done in one place. Well, my physician has left town and I went back to Ladies First last week for my checkup. I saw Haley McDaniel on my visit  and she was great!  She was very professional and didn't seem to be in a rush or act like it was a bother to  answer any questions. Everyone that I encountered there was very nice!", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "108605896228700484175", "name": "DV8", "time": 1580512581130, "rating": 5.0, "text": "Have been friendly and helpful with our first pregnancy , thank you .", "pics": null, "resp": {"time": 1580517060942, "text": "Thank you so much for your kind thoughts.  It is our privilege to care for our pregnant patients and wish the best for our future generations of babies♥️"}, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "117703231372164457365", "name": "Kaitlyn Bluto", "time": 1521140090557, "rating": 1.0, "text": "There is absolutely no communication on appointments. They call me and when I call back they claim they never called. Then I miss an appointment and they never even told me of that appointment. I just want my results and birth control and that's not even happening. Never go there.", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "110973497051056802192", "name": "Mr. Locke", "time": 1504016747441, "rating": 1.0, "text": "Years ago, this review would be four stars, however, lately the appointment Times seem to be suggestions. You arrive early, as usual, but don't get seen till an hour or two past the appointment time, despite your appointment time is 30 minutes after the office is opening.\n\nLiterally the best time for an appointment is 8:00am, when the office first opens. In that case, you only have to wait twenty to thirty minutes to be seen!", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "108194989887795136953", "name": "Jennifer Simmons", "time": 1556056110710, "rating": 5.0, "text": "Love Dr Voss! Wait times have been long in the past but my last two appointments have been very quick.", "pics": null, "resp": {"time": 1567878284391, "text": "We are always improving and growing to accommodate wonderful people like you. Thank you for your honest comment."}, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "109425812603081723601", "name": "Shametrice Barnett", "time": 1558448962340, "rating": 5.0, "text": "Although Dr. Torrence is my OBGYN I've had the pleasure of seeing Dr. Voss as well. Dr. Torrence has been my physician for over 10 years and I must say she is very attentive, through, and nothing short of amazing. If you're looking for someone to tell you what you want to hear or look at you as just a \"number\" Dr. Torrence ISN'T THE DOCTOR FOR YOU!! The main thing I admire about Dr. T is the fact that she's genuinely concerned about her patients. I also like if you have any issues and you make Dr. Torrence AWARE she does everything in her power to make it right. The entire staff is phenomenal and truly care about their patients! :)", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "105225394777167499142", "name": "Hannah Staples", "time": 1566489038852, "rating": 5.0, "text": "I had such a great experience with Ladies First. Dr. Voss delivered my son who decided to come 6 weeks early, and she made my birthing experience peaceful and at ease while I was worried about my baby boy coming early.", "pics": null, "resp": {"time": 1567878084106, "text": "Thank you so much for those kind words! We appreciate you Hannah."}, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "102286081252284814198", "name": "Melissa Whigham", "time": 1557942136822, "rating": 1.0, "text": "I will begin by saying Dr. Torrence is a very good doctor but she does not manage her time well.  I got to the office as requested 15 minutes before (2:45) my appointment (3:00).  I was called back to see the doctor at 4:35.  I walked out of the office at 4:50.  Not once did Dr. Torrence apologize about my wait time.  It shows a lack of respect for the patient when you have them wait for 1 1/2 hour for an appointment. This is not the first time this has happened.", "pics": null, "resp": {"time": 1574341060138, "text": "Dr Torrence is no longer with us at LadiesFirst. We appreciate your business and would like another chance to care for you if you would like to visit us again."}, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "114086596706140915305", "name": "Abby Mcneil", "time": 1552625096429, "rating": 1.0, "text": "Run as fast as you can . Long long wait times . Rude nurses . I was crammed in an area with other people to have my weight and BP checked (which should be private) went on a rant saying I need to be checked for diseases even though I’m married ‘because I’m young and there could be risky behavior’  , which was really a slap in the face and embarrassing to me. I left in the same situation I was in before , just $80 less in my pocket and pretty shocked", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "106042776649070897971", "name": "Yvonne Kovalchick", "time": 1574303810077, "rating": 5.0, "text": "I love this office and staff! I have been using their Med Spa services for over a year. Christy is amazing and so informative. Dr Voss is so sweet she really cares about her patients. She has given me cosmetic injections... Botox and Juvederm. She takes her time and really listens to me, carefully addressing my concerns and meeting my expectations. Christy has given me facial treatments, she always makes me feel special. I like knowing that my concerns are their concerns. I would highly recommend Ladies First. ❤", "pics": null, "resp": {"time": 1574311540461, "text": "Thanks so much!! We appreciate your support of our business and your kind words.  Always let us know how we can serve you better. ♥️♥️"}, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "104595580612895569924", "name": "Sophia Sage", "time": 1547578744973, "rating": 1.0, "text": "In 2015 I had my son with these doctors. I had previously gone here for my female checkups and had a lovely Dr. When I returned to have my son my Dr. Had moved her practice and I took another one. From day one my new dr. Was looking down her nose at me and generally fat shamed me every chance she got. Being a first time mom I was scared and followed what ever I had been told to the letter. I was given countless tests and had more than a few \"inconclusive\" results with preeclampsia. In the end I was induced before my due date due to an inconclusive movement test and ended up with an emergency c-section that took me months to bounce back from. For even 2 years after I've suffered from crippling pain in my abdomen. Muscle weakness. In general a longer than 'normal' recovery time. To further the issue a couple of weeks ago I tried to get a check up here to remove my IUD and the nurse was so loud pushy and rude on the phone about discussing my insurance over the phone before I could even make an appointment made me just give up completely. I won't be going back to this place ever again. I don't trust them and from the other reviews I've seen on here, you should reconsider trying them.", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "100993080526529387832", "name": "Asha Voss", "time": 1574299471869, "rating": 5.0, "text": "I am posting a review of my own practice to not just celebrate over 20 years of private practice in a very difficult healthcare economy and environment but also to celebrate more importantly and MOST importantly my incredible employees who have remained loyal and stunningly amazing. They are the greatest people around. For those who do not appreciate their diligence and hard work I encourage you to take your negative comments elsewhere - as you have absolutely no idea how hard they work and what their stressors are in all parts of their lives. As for my Aesetician - we work together as a team we will always work together as a team as that has always created the most beautiful outcomes for our patients.\nDoctors who rush through bruising injections do not create the elaborate beautiful outcomes that I have with Christy - who has achieved the status of master aesthetician- and who spends time understanding the contours and the nuances of need and translating them to me as we work as a team.  This is precise injecting work that I am trained and certified to do - as well as an artistic level of teamwork that I don’t think anyone else achieves especially around this region and therefore anyone who criticizes us has no understanding of what we really do and possibly intends us harm  and ill wishes - which is a very sad (and abysmally low) method of demanding a refund.\n\nWe adhere to the strictest guidelines in hygienic standards and we have some of the most creative combinations of med spa packages that are unlike any around as we are not just any MedSpa but we are gynecologic med spa and we have everything female just for you and more ;)\n\nPlease take some of the negative comments below as encouragement for us to get better especially with our waiting room time -we run into obstetrical emergencies and take immaculate care of our patients and apologize in advance for waiting room misfortunes. We are constantly taking these as constructive criticism for us to get better as negative as they may seem.\n\nHowever I do take exception to one very negative comment below as you will see I believe this person has reflected more of her own self explanatory emotional disabilities than anyone else’s. I truly think her calling herself a freak is more of her own reflection of what she has always seen and her obvious lack of self love - areas of improvement I would assume.", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "102680814850234491484", "name": "Margo Battenberg", "time": 1571969202324, "rating": 5.0, "text": "Dr Voss has been my provider for 6 years.  It is always a pleasure to see her.  Dr Voss truly loves her profession and it is felt in her care.  She provides up to date procedures and has added esthetics!  What a great adjunct to help each woman feel their best.  Dr Voss, thank you for being your upbeat, positive self.  You are loved and appreciated!  I highly trust and recommend Ladies First!", "pics": null, "resp": {"time": 1574311245043, "text": "Thank you !"}, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "101390270984166453510", "name": "Brittany Galland", "time": 1507325670233, "rating": 1.0, "text": "The people at this facility have no personality. No one is friendly, no one smiles at you, and it certainly doesn't make you feel any less awkward when you're getting your lady bits examined. Definitely will be finding a new gynecologist.", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "117239556584157531220", "name": "Vickie Smith", "time": 1529002535157, "rating": 1.0, "text": "I've never seen such poor doctors in my life!\nWhen you have a patient in the hospital bleeding a good doctor wouldn't want to release, but Voss & Torrence tried to.", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "115151120768365379381", "name": "Alyson Aplin", "time": 1558398371817, "rating": 5.0, "text": "Dr. Torrence and her staff are amazing!! They go above and beyond for their patients!! Highly recommend!", "pics": null, "resp": {"time": 1558444220874, "text": "Thank you!"}, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "109455403846149390959", "name": "lianna mejia", "time": 1559078365653, "rating": 1.0, "text": "My friend is pregnant and goes their she says that were good in the beganing but when she went to her appointment when she was suppose to they were closed. now she can't get them on the phone even when they say are open till 5 Monday thru Friday.", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "113145718725278549126", "name": "Common Sense", "time": 1554242521641, "rating": 5.0, "text": "Have seen DR Voss for 5 years.  She is always  professional,cheerful,\nhelpful and informative. Personally work in health care and find there phone, front desk , and room staff courteous and helpful. Wait times are compatible with my other providers, family doctor and specialist. I bring a book or read  the magazines provided. Thank you Dr Voss and Ladies First for providing female  Ob and Gyn services", "pics": null, "resp": {"time": 1554254450134, "text": "Thank you!"}, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "116721075632233257020", "name": "Trey Jackson", "time": 1523617568559, "rating": 5.0, "text": "My name is Latoya Nunnally. I have been going here for a few months now and I love it. My doctor is Dr. Torrence and she is simply amazing.I would recommend her to anyone. There are so many negative reviews on here but to each his own because I am very hspph with my doctor and will continue going.", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "113843523072030153918", "name": "eraisys herrera", "time": 1577993849753, "rating": 5.0, "text": "Honestly Pam Jones and Dr. Voss are the best!!\nUpdate: Oh my god I have to say it again. These doctors are the best. I gave birth the 28th of December and Dr. Voss is such a sweet person and so understanding. She literally went to my room after giving birth everyday to check on me .", "pics": null, "resp": {"time": 1567878111645, "text": "Thank you so very much!"}, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "105468132205787469292", "name": "Azucena Hernandez", "time": 1557791184860, "rating": 5.0, "text": "Had a wonderful experience over the phone very helpful and informative !Very friendly !", "pics": null, "resp": {"time": 1567878176566, "text": "Thank you for your kindness!"}, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "112731500157298959922", "name": "Jennifer Lee", "time": 1559228229106, "rating": 1.0, "text": "Terrible wait time. Expect to be there for 3 hours or more for a pap smear. My appointment was at 8am (which is when they open). I was third to be seen. At 9:40 I still had not seen dr. Voss. At 9:52 I was seen by the dr, then went for lab work and checked out at 10am. Needless to say the exam was very quick and I didnt have an opportunity to discuss my concerns. Would not recommend.", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "112086793093658455692", "name": "Anna Manley", "time": 1504195758088, "rating": 1.0, "text": "This place is ridiculous. They prescribed a low dose birth control pill that they knew had reduced effectiveness on overweight women, I am pretty noticeably overweight, and wouldn't give me a straight answer when I asked about it several times. I kept having to play phone tag with the nurse when I was redirected to her line; yet, whenever I got fed up and asked the phone operators to get the nurse, she was there in seconds. All of this after being prescribed a birth control I didn't want that was in such high doses almost everyone on it had side effects.\nBesides the never ending phone tag, the waiting times are insane majority of the time. I went to get the last shot in a 3 part series to help prevent cancer, just a shot, never had to see the doctor, anyone could give it to me, but I had to wait TWO hours. They were not full, it wasn't even half full, I just waited while so many people who arrived after me went first. It took a minute or less for that shot. And yes, I had an appointment.\nIf you value your time or your respect, just find somewhere else.", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "103957366307330048543", "name": "Becky Gavin", "time": 1553896759990, "rating": 1.0, "text": "I love Dr. Voss but the wait times are just absurd. I’ve never waited this long at a doctors office. Usually wait times are 1-2 hours. Sometimes more than that. The lobby is never crowded, the back doesn’t seem busy. No one is in hurry here.\n***Editing my review after my LAST appointment with Dr. Voss.\nComing from someone who has worked in healthcare for eight years, this office is poorly managed. The staff doesn’t care because the Doctor’s don’t care. Simple as that. Ladies, steer clear of Ladies First.", "pics": null, "resp": {"time": 1553889740904, "text": "Thank you for being a patient of Dr. Asha Voss. We apologize for the long wait time. Sometimes delivery calls our physicians to the hospital. We appreciate your patience when these situations arise."}, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "100148576428067449969", "name": "Donna DeVane-Trippe", "time": 1546531118680, "rating": 1.0, "text": "Let me start by saying that I love Dr. Torrence, but the lack of time management has completely done me in. I have had 6 visits in the last year and each time I have had to wait 2 to 2-1/2 hours. One visit i was forgotten about (sitting in the exam room). the next visit 3 patients had the same appt time of 330. When i complained about the long wait times the nurse told me to make early morning appointments.  So my next 2 appointments were the very 1st ones. Both times Dr. Torrence didn't even show up until 45 minutes to an hour after my scheduled appointment. Needless to say I am done. My time is just as valuable as theirs.", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "105108904467504002561", "name": "Sheena Guettler", "time": 1509415086304, "rating": 5.0, "text": "I recently had twins and Dr. Torrance is my doctor.  I would recommend anyone seeking a practical, thorough obgyn to see Dr. T. The nurses and staff have always been courteous. My usual wait time is around 30 minutes.", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "106873791610705511140", "name": "JA Cole", "time": 1543683603562, "rating": 5.0, "text": "Dr. Voss is wonderful. She always takes a lot with me and explains everything! Very knowledgeable and caring!!!", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "104934388712777452796", "name": "Bethany", "time": 1561254894127, "rating": 4.0, "text": "I saw Dr.Voss a few days ago to start a new birth control as a new patient. After reading all the horrible reviews online,I was a little hesitant about keeping my appointment but,decided to proceed and give it a chance. Upon arriving walking in at 11:00am my appt. was at 11:15am, I was a little confused by all the dermatology products and was unsure I was in the correct building until I asked the receptionist who was very polite and helpful. After filling paperwork out for a new patient visit,I was asked to urinate in a specimen cup. I went to the bathroom,sat my cup in the lab window however,I noticed about 6 other cups full of urine with patients names labeled on them as I also work in the medical field,I thought this was VERY dirty and also a HIPPA violation,I proceeded anyways. I was called to the back fairly quickly,there was only one other patient waiting. I was sat down for the nurse to get vitals,then told to sit at the chairs near the lab until I was called. I waited there about 30mins. The nurse then took me to the exam room, as I sat there for at least another hour maybe a little more. I became anxious but,tried to be patient. Dr.Voss walked in,she was very polite however,I felt as soon as she come in and I gave her my reason for seeing her she was showing me all these brochures about weight loss and dermatology products. I weigh 100lbs.,I was not interested in any of this but, listened. She spent about 20mins or so in the room with me she explained everything in great depth and reassured me questions that I worried about were nothing to be concerned about. I then got dressed,went to check out,which was 2:00pm. I had a good experience other than the urine in the bathroom and the long wait time. It wasn't a horrible experience but,I suggest they change some things. I also was concerned that my last period was in February and it is now June,no pregnancy test was done nor was could you pregnant asked, that is a major concern for me even though I knew the answer they didn't seem to ask.", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "102634308937382799559", "name": "Erica Hamilton", "time": 1459794174618, "rating": 1.0, "text": "was talked down to and treated like I didn't matter at all. And since I don't have steady transportation to appointments they found it necessary to make me feel even lower by lecturing me every time I go to the hospital or call their office. I have several severe issues going on with my pregnancy, and I'm not heartless, so OF COURSE I WANT prenatal care!! But not all of us have the money to pay for rides and it is way too far to walk to the office. In my opinion they need SOMEONE there that can identify with the less fortunate and not just cater to those that have everything readily available!", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "116428297876855443632", "name": "Jenna Enfinger", "time": 1542736485209, "rating": 1.0, "text": "Literally the slowest dr office I have ever been to. I waste my whole day here everytime I have an appointment. Their communication skills with their patients also aren't very good.", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "100844099288431444593", "name": "galaxy- king", "time": 1544112771442, "rating": 5.0, "text": "I'm so confused on the negative reviews.... Doctor Torrence is amazing she is always smiling and friendly.... She has preformed a C-section on me twice and I've survived thus far I trust her with my life..... I get the wait times but I believe they are short staffed and births are pretty unpredictable so while it's frustrating on the receiving end of long wait times I understand that if I was in labor I'd want MY doctor to be available.... Maybe they will figure out a better way to handle this in the future..... The nurses and assistants are great always friendly to me and so is the receptionists, the lady who draws blood is as sweet as can be and the same with both ultrasound techs..... I only met doctor voss once at the hospital but she seemed very kind amd took the time to talk to me...I juat adore this whole practice.... Sometimes you have to check people out leaving these bad reviews maybe it's them.with the bad attitudes.... Some of these reviewers give 5 stars to Wendy's, and McDonald's but write a bad review for a busy doctors office I'm not buying it at all.... Probably didn't get there own way is more like it", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "100591282478556165651", "name": "Jessica M", "time": 1479229675095, "rating": 3.0, "text": "I went for a check up because most sources say you should start going around the age of 16. Nothing was wrong, but I am 20 and thought I was behind. When I arrived, I filled out the paperwork and waited (total time of about an hour). When I saw the doctor she told me I didn't need to do anything until I was 21 and unless I was having problems I didn't need to have anything done. I drove an hour and paid $40 to have someone tell me I didn't need to be there. They asked me my age and if I was having any problems when I made the appointment, so it should have been avoided.\n\nI gave them 3 stars because everyone was really friendly and the facility was very clean.", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "106801506270240458566", "name": "C Moff", "time": 1505478175438, "rating": 5.0, "text": "Very polite staff.  They listen to you.  I love it there.", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "109109278336020677213", "name": "Ashlee Preston", "time": 1505832340963, "rating": 2.0, "text": "The nurse that took my vitals had no personality not real friendly. Been waiting over an hour.. People have to get to work do they not think of that. Why do they make appointments if they dont follow them really", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "116586527686485971410", "name": "Kristen Guidry", "time": 1539704703645, "rating": 1.0, "text": "If you're bored and have all the time in the world this is the right place. If not , I suggest you find somewhere else to go.", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "107944341976652607352", "name": "Alexis Bastidas", "time": 1582665859926, "rating": 1.0, "text": "Worst service ever. Three hours waiting to being seen by the doctor with appointment.", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "103133689828984391031", "name": "c.j. mato-toyela", "time": 1571145929546, "rating": 1.0, "text": "Won't call back after multiple attempts to get in touch.", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "103895288933251523637", "name": "Brittany R", "time": 1531242985851, "rating": 1.0, "text": "I had my daughter with Ladies 1st over 13 years ago. Dr. Torrence was fantastic and the experience was great. When we moved back to the area, I was so excited to return for the same experience. HAH! Should've known better. Dr. Torrence seems to be the only capable staff member, which means you wait for 3+ hours for OB appointments. As I had a child to take care of, I couldn't do that. So I switched to Dr. Voss. Biggest mistake of my life. I tore with a 6 pound baby. So when my 9 pound baby shot out like a freaking rocket because she kept turning up the pitocin, you can only imagine the aftermath. When I went to my 6 week checkup, I asked her why she didn't give me a c-section to begin with since my son was measuring huge, she told me that I was crazy with hormones and if I spoke to her like that again, we'd have to involve lawyers. I immediately switched to Dr. Heim whom when he saw the size of my son could not believe that I had him vaginally. These women are running a chop shop and I'm not sure why they are the first practice that Tricare refers to. I'm guessing it's probably because they need the business once people realize how shady they are. Do your research and AVOID, AVOID, AVOID!!!!!", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "100394502747692997524", "name": "kelsey mardis", "time": 1510268572287, "rating": 1.0, "text": "Sadly, I have to agree with all of the other negative reviews. My appointment was at 1:00, I got there at 12:20, and didn't get called back until almost 2:30. I met with my Doctor for 2 minutes (literally) and she had to leave to go to the hospital. No biggie, but the way the other nurses handled the situation pissed me off. They popped in 10 minutes after she left to tell me that someone would be with me in 15-20 minutes! After I already waited almost 2 hours to be seen. I got up and walked out. The customer service was HORRIBLE. I called my insurance and changed doctors immediately.", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "108379321205900861287", "name": "Alexis Boykin", "time": 1532630995945, "rating": 1.0, "text": "They are the slowest . Had an appointment at 9:45 got there at 9:30 because they ask you to be there 15 minutes early for paperwork. I literally walked out of that place at 1:40 and all I was only getting was a freaking pap and breast exam that took all of 5 minutes ! Will not be going back", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "106090180344000013191", "name": "Salman Imtiaz", "time": 1530028220096, "rating": 1.0, "text": "Too too much wait time...its third time that we had to wait 2 long hrs before dr. Came to see us for 5 mins even though we had appointment and the nurses just kept on saying 5 mins every time we asked...poor service and waste of time and at the end dr. Came in hurry just for 5 mins...", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "100869924758642174195", "name": "Nate (NateDog)", "time": 1540925698536, "rating": 1.0, "text": "The wait times are too long. Dr.  Voss is incredibly rude. They have no respect for anyones schedules.  They dont want to work with people that have transportation issues.  I have never been talked to so disrespectful by a dr in my life.  She refused to give me the ultrasound that i know i am due for Because I verified with another obgyn that my insurance does cover it at this set week in my pregnancy. She was very nasty to me and to make it worse in front of my children.", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "100285688866539063079", "name": "Cinnamon Clarke", "time": 1524156097415, "rating": 1.0, "text": "I've been going to ladies first off and on for the last couple years, and the experience has been pretty ok in the pass...but today I seen doctor Voss and I can honestly say this was my last time coming here...she made me feel like she was not caring, she was trying to hurry and get to the next patient, and just didn't have the best attitude,  I didnt feel like she really cared about what I felt day to day....however I love doctor candice short, she is awesome! She has a heart and understands what ppl go threw...And if I did recommend anyone to go here it would be to see doctor candice short ❤..but I would not reccomend doctor Voss,  i dont think she really cares", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "104684956599257657136", "name": "Paige Dewberry", "time": 1535469867385, "rating": 1.0, "text": "Absolutely horrible. They made me change my appointment from August 22 to the 28th cause of their dr and I’ve been waiting an hour since my appointment time to even get out of the stupid waiting area. They have no concept of time and that some people do not take off a full day for a morning appointment.", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "110655128230000286006", "name": "Ashley Lamb", "time": 1508091877705, "rating": 1.0, "text": "I wouldn't recommend this place to my worst enemy.  I feel bad giving them 1 star.  I saw Dr. Raines who I don't believe is there anymore (I wonder why).  I can't speak for all the women that work here but the ones that I encountered came across as very  condescending.  I felt very uncomfortable.  Dr. Raines didn't seem to listen or act like she wanted to answer my questions.  I would see her in the back while they were taking my vitals and she wouldn't  even speak to me. I'v heard several horror stories about this place and am very surprised they are still in business. They told me they would mail my yearly pap smear results.  I never received them and had to call to find out.  They then told me that I had to come in for the results like something was wrong.  I came in and had to pay another copay.  Then Dr. Raines proceeds to ask me why I am there.  Really??!!  Then she says my results were fine.  In my opinion, it was like they wanted another copay from me. I now see Dr. Scott at Women's Medical Center and he is the best.  He has been a blessing to me and it is such a relief to have a DR that sincerely cares.  Come to find out I had a large cyst on my ovary that had to be surgically removed and have PCOS which they never detacted. I recommend you go elsewhere.  And if you read the reviews for this place, I am not the only one!", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "101659808733322812008", "name": "Sonny Gilbert", "time": 1483043849197, "rating": 1.0, "text": "The lady at check in is rude....we are currently sitting here waiting to be seen...coming up on a 1hr....got here 45 mins early and still waited a hour past my wifes appointment....asked the lady upfront what was going on and the only response was ill see....no response back...so really rude and dis courteous staff....", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "103818685406249915762", "name": "lunarxraindrop", "time": 1489182929437, "rating": 1.0, "text": "Definitely not doing business here again!", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "114614608723315987770", "name": "Bebstee b", "time": 1531191908504, "rating": 1.0, "text": "Im 31 years old and pregnant with my first child. Im currently seeing Sharon Bush but i will be finding somewhere else to go. Its almost as if she is looking down on you the moment she walks into your room. The place has treated me like im nothing more than a waist of their time. I would encourage any first time mothers to go somewhere else. Rude staff and cold hearted physician. *update* being that I was so far along I decided to stay with Ladies First. I will never use them in again. At six months I began having pain in my lower back hip and leg. I called the office countless time and mentioned it to Dr. Bush and her nurse only to be treated like I was a bother. it took me being seen by Dr. Malone (while Bush was on vacation) to learn that I was having sciatic nerve issues. Dr. Malone said she would recommend Bush set me up with physical therapy. I mentioned physical therapy to Bush at my follow up appointment only to be told\" I never heard of pregnant women doing physical therapy\". Then out of nowhere I received a phone call from a therapy center letting me know ladies first had sent a referral *tada* three weeks before my due date. I went to one appointment and the therapist was shocked that they waited so late to finally send me and stated that there was not much (if anything) they could do for me. not to mention that it was not safe for me to do physical therapy do far into my pregnancy. on the day of my due date I went in for my check up. I told the medical assistant that I was having minimal fetal movement she just said ok and left the room. Bush came in assessed me and we discussed induction. I left the office only to be call back to return. When I spoke to Bush She said that she was unaware that I told the medical assistant a having minimal movement from my baby. (do they not communicate with one another??) I was sent for a BPP an was informed that I would be induced that day due to low amniotic fluids. these women for the receptionist to the nurse practitioners to the physicians care nothing about their patients. I would not recommend this place to my worse enemy.", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "108154688963226374472", "name": "Amanda Brockway", "time": 1427746975861, "rating": 5.0, "text": "I am due with my first baby in 3 weeks, I have been seeing Dr. Voss and Lisa Gowan....and amazing midwife...at their Enterprise office my entire pregnancy.  The doctors, nurses, staff, and midwife are friendly, professional, and knowledgeable.  I am absolutely in love with Lisa Gowan, she provides amazing care, takes time to answer all of my questions, and innovative with her practice.  I am fortunate enough to be a part of her new group care classes that she recently started.  Once a month pregnant women, at all stages of their pregnancy, get together to discuss important information and stages of pregnancy (like nutrition, exercise, and changes in your body, experiences, and concerns).  They teach you to take your own blood pressure, Lisa measures your belly and listens to the baby's heartbeat, we sit down and talk as a group for about 2 hours, oh and did I mention free food and snacks?!?! It doesn't get any better for a pregnant lady's doctor appointments :).  It is really a great opportunity to network with other pregnant women and form a support network.  I only wish she could deliver my baby, she is working on getting approval to deliver in the Wiregrass...just won't be done in time for my little one.  I have enjoyed my health care with this group of doctors and I hope you do too.", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "107707764653871011969", "name": "Ashley Andrews", "time": 1454767059428, "rating": 5.0, "text": "dr Voss and all the nurses have taken great care of me during My last surgery and have taking the time to explain exactly what to expect during my upcoming da Vinci hysterectomy I love then all and highly recommened I had not been to an ob since I was 18 and I'm 35 and she was very gentle she could sense my nervousness and they kept my husband up to date while I was in surgery so he wouldn't b worried. you won't b ashamed if u give them a try thank you dr Voss and entire staff", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "109376615675558018645", "name": "Bee Tee", "time": 1465989836357, "rating": 5.0, "text": "Best doctors. Friendly service.", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "103098882155064951463", "name": "LaNae Allen", "time": 1551988768107, "rating": 1.0, "text": "It should be called money first. They don't care about their patients, they only care about their wallets.", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "116722329915313832666", "name": "Carolyn FRANCO", "time": 1445524188837, "rating": 5.0, "text": "Love there service", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "115331008839082617067", "name": "New Generation", "time": 1531334424429, "rating": 1.0, "text": "Disrespectful and the wait is to long", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "108847061493249026030", "name": "Danna Britt", "time": 1492732762643, "rating": 5.0, "text": "Wonderful", "pics": null, "resp": null, "gmap_id": "0x88928d90d74cf4a3:0xc1fb9798454c799a"}
{"user_id": "109459205921970950243", "name": "The1rstNoel", "time": 1624001223434, "rating": 5.0, "text": "Dr. Zaharias Delivered me, my first baby, and now my second would highly recommend never plan on switching!", "pics": null, "resp": null, "gmap_id": "0x888925db8da4c019:0xaa748e2d4be904fa"}
{"user_id": "109076131049174899862", "name": "Beth Almeida", "time": 1568924768375, "rating": 3.0, "text": "I absolutely LOVE my doctor, Dr. Simmons. BUT, I have a problem with being told I can't schedule a visit to SPEAK with him about a very scary situation without registering with some other program. If I'm scared or having some health issue that I need clarification on, I should be able to speak to the doctor who knows my health history without being blocked by some woman who answers phones.\nThey really need to re-educate these people or, if it's an office policy, it needs to be redone.", "pics": null, "resp": null, "gmap_id": "0x888925db8da4c019:0xaa748e2d4be904fa"}
{"user_id": "106592306296126105521", "name": "Heather Brandon", "time": 1534461686890, "rating": 4.0, "text": "Dr. Simmons is fantastic. Listened to all my concerns. The staff was okay at best. Whoever works the phone lines needs a lesson in manners though.", "pics": null, "resp": null, "gmap_id": "0x888925db8da4c019:0xaa748e2d4be904fa"}
{"user_id": "112339120080584429614", "name": "KS S", "time": 1502815957626, "rating": 1.0, "text": "For the last two years I have waited for 45 minutes to a hour to be seen for my annual visit following my scheduled mammogram appointment. Appointment was set first thing those business mornings. Staff was less than accommodating in remedying the situation. Will be seeking a new physician that has respect for my time and others", "pics": null, "resp": null, "gmap_id": "0x888925db8da4c019:0xaa748e2d4be904fa"}
{"user_id": "116543825484191979432", "name": "Robin Gossett", "time": 1474312501867, "rating": 5.0, "text": "I am 9 months pregnant due any day now. Dr.Conti is my doc, I love the staff they are wonderful. The only drawback to this office is that there is no after hours # to call other then the hospital. Which I am not complaining they are great as well. I would and do recommend this office often. I get a reminder for every appointment via phone. The wait time is not that bad for the most part but they are a very busy office but hey I say that is a great thing b/c that means people like the doctors.", "pics": null, "resp": null, "gmap_id": "0x888925db8da4c019:0xaa748e2d4be904fa"}
{"user_id": "117318390433384399155", "name": "Hillary Matchen", "time": 1500482504425, "rating": 5.0, "text": "Was told by UAB there was nothing wrong with me, but I've been bleeding almost nonstop for a year. Dr. Z took one look, booked me an appointment and removed 2 benign tumors the next week. Even with me screaming my head off from pain they were still the most professional and nice OBGYN clinic I've ever been to. This will be my OBGYN clinic for life.", "pics": null, "resp": null, "gmap_id": "0x888925db8da4c019:0xaa748e2d4be904fa"}
{"user_id": "108588761969067371172", "name": "Sierra Souter", "time": 1538409069012, "rating": 3.0, "text": "I love my doctor (Dr.Gooding), but the staff is almost always really rude. When I call they seem to not care what I’m saying at all, the nurses act like my concerns are ridiculous. If not for my doctor, who I have been seeing for 10 years, I would not return.", "pics": null, "resp": null, "gmap_id": "0x888925db8da4c019:0xaa748e2d4be904fa"}
{"user_id": "101058030737390930825", "name": "Cheyenne Wells", "time": 1532958223302, "rating": 5.0, "text": "I love simmons. Hes the absolute best doctor to have. He birthed me and my sisters and now hes gonna birth my baby in october and hes over the moon about it!!", "pics": null, "resp": null, "gmap_id": "0x888925db8da4c019:0xaa748e2d4be904fa"}
{"user_id": "100310962811842525784", "name": "N. Hope", "time": 1486171077286, "rating": 5.0, "text": "Dr. Z is quick in his exams and very thorough in explanations to any questions. Their staff is very polite and will return calls quickly.", "pics": null, "resp": null, "gmap_id": "0x888925db8da4c019:0xaa748e2d4be904fa"}
{"user_id": "116106060484621088853", "name": "Carolyn Davidson", "time": 1462058244516, "rating": 5.0, "text": "Unlike the past review, which I think she may have the wrong practice, I have had nothing but a great experience with Dr. Z and Shelby obgyn in Alabaster, AL.  The wait times at Shelby obgyn are less than any other practice I have used in the Birmingham area.  The staff and doctors take the time to make sure their patients are healthy and that is worth the wait.  I have had at least 15 appointments at this office and can remember only a few that I had a 45-60 min wait, but it was a midday appointment.", "pics": null, "resp": null, "gmap_id": "0x888925db8da4c019:0xaa748e2d4be904fa"}
{"user_id": "106057852725319996278", "name": "Kalyn Falls", "time": 1501793009999, "rating": 1.0, "text": "They did a surgery yesturday on me hit a artery amd the stitch came loose amd i was bleeding out had to finally go to the er before i bleed to death. The er stitched me uo and said if i would have waited till the next day i woukd have bleed to death. Call and tell them i need stronger pain meds they say youll just have to go back to e.r", "pics": null, "resp": null, "gmap_id": "0x888925db8da4c019:0xaa748e2d4be904fa"}
{"user_id": "100252732228887378951", "name": "Kimberly Nation Morton", "time": 1468952452099, "rating": 1.0, "text": "Dr.z was my doctor he did a hysterectomy on me 5-28-02. I was admitted in Shelby hospital on 8-24/05 with complications from ovarian cysts, Dr.head was on call and said he would be doing my exploratory surgery, he said he removed fluid in my abdomen and remove scar adhesions off of my colon and ovaries , I was admitted again 11-17-2012 for the same thing, dr. Head did surgery for ovarian cysts, and said he removed tons of scar adhesions from my colon and ovaries and he said he put mesh over my colon and ovaries to keep adhesions from attaching. On 5-28-2013 I was admitted again with ovarian cysts and scar adhesions problems dr. Head said he didn't want to do surgery because it would make more adhesions, I asked him to explain to me what kind of mesh he used in me in the last surgery. He would not discuss it. I was in ER this past Thursday, was diagnosed again with scar adhesions problems. I called Dr.heads office, I have never been treated so rudely the receptionist told me she could not have a nurse call me because I was banned and flagged, when I asked what that meant she told me I was discharged because Dr. Head said there was nothing he could do for me. Dr. Head never told me in the hospital that he would not see me again. I have never in my life been treated in this manner. I explained to the receptionist that Dr.z was my real doctor that I couldn't help Dr. Head was on call and did my surgeries. I think it is  un ethical of Dr. Head and his staff to treat patients in this way, and it is a patients right to know what is put in their body on their organs during surgery. I would never recommend Dr.head to anyone. I have been reading numerous reviews and find I am not the only patient with the same complaints on him and his staff.", "pics": null, "resp": null, "gmap_id": "0x888925db8da4c019:0xaa748e2d4be904fa"}
{"user_id": "112521924951743765361", "name": "Dikia Areli Iraheta", "time": 1519836398913, "rating": 5.0, "text": "Dr. Zaharias is the best", "pics": null, "resp": null, "gmap_id": "0x888925db8da4c019:0xaa748e2d4be904fa"}
{"user_id": "100553489206488171718", "name": "Jess Simpson", "time": 1466231694736, "rating": 5.0, "text": "Very nice services", "pics": null, "resp": null, "gmap_id": "0x888925db8da4c019:0xaa748e2d4be904fa"}
{"user_id": "104340281623722602688", "name": "Carolina Lecaros", "time": 1602796108880, "rating": 2.0, "text": "(Translated by Google) I would have liked to be able to give it a better rating but the truth is I regret having chosen this clinic to do my follow-ups and controls.\nAll the staff are very friendly (only reason for the stars)\nI am quite a patient person and I have taken a long view because the truth is I do not like to get into arguments. The comments I am making will be in the photos below since it is very extensive and I exceed the allowed limit.\n\n(Original)\nMe hubiera gustado poder darle una mejor calificación pero la verdad me arrepiento de haber elegido esta clínica para hacer mis seguimientos y controles.\nTodo el personal es muy amable (única razón de las estrellas)\nSoy una persona bastante paciente y me he hecho de la vista larga porque la verdad no me gusta entrar en discusiones. Los comentarios que estoy haciendo quedarán en las fotos a continuación ya que es muy extenso y excedo el límite permitido.", "pics": null, "resp": null, "gmap_id": "0x888925db8da4c019:0xaa748e2d4be904fa"}
{"user_id": "111819921676280763827", "name": "Sonya Franklin", "time": 1594306711432, "rating": 5.0, "text": "My daughter goes here they have been extremely nice and helpful", "pics": null, "resp": null, "gmap_id": "0x88891b772128acef:0x927529ba7404a651"}
{"user_id": "103876312507288366395", "name": "Octavia Webster", "time": 1455764224827, "rating": 5.0, "text": "A great place! I have not yet achieved pregnancy but I have gone there for tests before. I wish they had programs for people actually wanting to get pregnant, but that aside I think what they do is great! They are Christian minded and have wonderful programs to help get ready for motherhood such as a shop that you can get baby needs from!! I am going tomorrow to drop off some donations!", "pics": null, "resp": null, "gmap_id": "0x88891b772128acef:0x927529ba7404a651"}
{"user_id": "102801856765132333715", "name": "Keshia Coleman", "time": 1554917182729, "rating": 1.0, "text": "The business is great. Meet new people learn new thing accomplish things", "pics": null, "resp": null, "gmap_id": "0x88891b772128acef:0x927529ba7404a651"}
{"user_id": "108119369501093399231", "name": "Amanda Reyes", "time": 1510064067478, "rating": 1.0, "text": "Their ad on Google says they provide free abortion services, but that is not true. For accurate and non-judgemental information about your options, call Planned Parenthood. The closest place to get an abortion is West Alabama Women's Center in Tuscaloosa.", "pics": null, "resp": {"time": 1510078488467, "text": "The North Jefferson Women's Center provides free, non-judgmental abortion information and ultrasounds.  Many clinics charge a patient a substantial amount for the same services that this clinic offers for free.  This person has never been a patient and is not familiar with this clinic.  Call the North Jefferson Women's Center for , non-judgmental option information."}, "gmap_id": "0x88891b772128acef:0x927529ba7404a651"}
{"user_id": "108050624685937833180", "name": "Joy Whitehead", "time": 1363630515594, "rating": 5.0, "text": "The staff is always VERY friendly and helpful. I have been going there since day one with my pregnancy. They programs/services they offer are very informative and helpful. Not only that, but they are always willing to pray with you about situations and just lend a listening ear or a shoulder to cry on if you need it.  I would VERY highly reccomend the North Jefferson Women's Center to anyone!", "pics": null, "resp": null, "gmap_id": "0x88891b772128acef:0x927529ba7404a651"}
{"user_id": "106045380638469769242", "name": "Jennifer Valle", "time": 1565364684696, "rating": 5.0, "text": "They are so nices. Varying helpful", "pics": null, "resp": null, "gmap_id": "0x88891b772128acef:0x927529ba7404a651"}
{"user_id": "116323382568569586970", "name": "Emerald Flowers", "time": 1541178782817, "rating": 5.0, "text": "I'm in the Mommy Money Program & it is so helpful they help me get all the basic things I'll need for my 1st baby from Diapers and Baby food to Clothes and Toys.", "pics": null, "resp": null, "gmap_id": "0x88891b772128acef:0x927529ba7404a651"}
{"user_id": "117977176130904268788", "name": "Crow Cousin", "time": 1530418923712, "rating": 5.0, "text": "Their service is totally profession, and without a doubt some of the friendliest staff I have ever encountered.", "pics": null, "resp": null, "gmap_id": "0x88891b772128acef:0x927529ba7404a651"}
{"user_id": "106468089732548383983", "name": "Krystle Gallegos", "time": 1364307115279, "rating": 5.0, "text": "I had a sneaking suspicion I was pregnant around the holidays in 2011. You know when something isn't quite right with your body. My husband and I had never talked about having children so I was literally scared to even bring it up to him. He had literally told me before we married he really didn't want children. I didn't know who to talk to when I looked up a clinic to visit near me NJWC was my closest hope. I finally told my husband and he went with me to my appointment. I was only two weeks away from the second trimester! It was very overwhelming but the staff was so supportive - their classes are very informative. I knew NOTHING about babies but I felt confident I could care for a child after completing their program. I can still go pick up supplies if I need anything and I have made some lasting relationships with the women who helped me through it all. They are a true blessing!", "pics": null, "resp": null, "gmap_id": "0x88891b772128acef:0x927529ba7404a651"}
{"user_id": "117586443809190515020", "name": "Ebony Richardson", "time": 1493229930021, "rating": 5.0, "text": "Love the atmosphere of the place and wonderful workers! I would recommend anyone to visit!", "pics": null, "resp": null, "gmap_id": "0x88891b772128acef:0x927529ba7404a651"}
{"user_id": "107551082303743116119", "name": "Marie Johnson", "time": 1363669191938, "rating": 5.0, "text": "the staff were truly a blessing to me when I felt as if I nowhere to turn. the work they do there  is wonderful.", "pics": null, "resp": null, "gmap_id": "0x88891b772128acef:0x927529ba7404a651"}
{"user_id": "101320709651318510559", "name": "Laqundra Rice", "time": 1526131733687, "rating": 5.0, "text": "Love love love it here! Would recommend to everyone.", "pics": null, "resp": null, "gmap_id": "0x88891b772128acef:0x927529ba7404a651"}
{"user_id": "107346724497068060600", "name": "Amanda Isales", "time": 1537037841286, "rating": 5.0, "text": "Love these women and classes they offer", "pics": null, "resp": null, "gmap_id": "0x88891b772128acef:0x927529ba7404a651"}
{"user_id": "114879665888624593110", "name": "Alabama Norml", "time": 1354671573112, "rating": 3.0, "text": "They mean well. They could most certainly be more professional.", "pics": null, "resp": null, "gmap_id": "0x88891b772128acef:0x927529ba7404a651"}
{"user_id": "102920519085027402449", "name": "James Nelson", "time": 1559171888815, "rating": 1.0, "text": "I do not know how North Jefferson Women's Clinic is I have not been there.", "pics": null, "resp": null, "gmap_id": "0x88891b772128acef:0x927529ba7404a651"}
{"user_id": "103483314905230771837", "name": "Dixie Godette", "time": 1568427421153, "rating": 5.0, "text": "Helped me when I needed them.", "pics": null, "resp": null, "gmap_id": "0x88891b772128acef:0x927529ba7404a651"}
{"user_id": "111061788249517169284", "name": "Katelyn Cox (HappyHappyHouseWife)", "time": 1565155713220, "rating": 5.0, "text": "Wonderful facility", "pics": null, "resp": null, "gmap_id": "0x88891b772128acef:0x927529ba7404a651"}
{"user_id": "117864232366703836922", "name": "Renae Allen", "time": 1545750715361, "rating": 5.0, "text": "Friendly staff. Lot of information.", "pics": null, "resp": null, "gmap_id": "0x88891b772128acef:0x927529ba7404a651"}
