{"user_id": "103350191571697816316", "name": "David Santos", "time": 1615504247003, "rating": 5.0, "text": "What can I say, well to start with, I was not ready for the change to a New Company because I have been with Xerox for over 25 + Years. I have always been treated very well from them so, NO I did not want to change. After a while of thinking about it SEVERAL MONTHS and my Son hammering me with the RJ YOUNG name, I did it. I purchased a machine from RJ YOUNG.\nAt first I was skeptical and to be honest I really didn't want to give it a chance (The Machine), but I did and after several months and barely using the machine I starting coming more around it and using it a little more & more. Then I began to really like it because it really printed so nice and pretty fast. It only took me  8 to 10 months to like it but you have to understand I WAS A XEROX Man and I thought there was NOTHING out there but Xerox. The Xerox machine has ALWAYS  performed outstanding and the SERVICE was the best, I was spoiled from that. However, I found out that there was more out there than XEROX! I found out that RJ YOUNG was REAL and believe me they have made a believer out of me. The Service that I thought would not compare to XEROX, has showed me they are just as good and if not BETTER. I never thought I would say that but it is so true. I can not believe how fast the Service Technicians reply to the service calls. They are always polite, and get me back up and running in a very quickly manner. They have such good personalities and a smile! As for the Ladies at the Home Office, Oh My How can you NOT like them. They are AMAZING. They always tell me they will have my supplies on the way or a Technician asap. IT IS JUST SO HARD TO PUT IN WORDS what RJ Young has done for my business. This is a very caring company and to be honest I am so glad that I have some of their product and that I was introduced to the World outside of XEROX. RICO machines have made my life SO MUCH Better and I am so happy that I have changed. If you are not a part of RJ YOUNG, you are probably missing out on good PEOPLE and Great Machines.\nDavid Santos,\nSantos Printing Co.", "pics": null, "resp": {"time": 1615567331024, "text": "Thank you so much for your feedback, David! We truly appreciate it."}, "gmap_id": "0x88891fa9c3d70915:0x822d0b967d10b421"}
{"user_id": "107060019385402490294", "name": "SBNABN Nelson", "time": 1596815182481, "rating": 5.0, "text": "RJ Young was very helpful! They were very knowledgeable and worked quick to help deliver and service our devices! I highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x88891fa9c3d70915:0x822d0b967d10b421"}
{"user_id": "104972628291985606322", "name": "Tom Sommerville", "time": 1596541843874, "rating": 5.0, "text": "Great Company, top quality products, service and support. More that a Copier Company, They sell Technology, gear. and the Latest Security Camera;s Printers from desktop to Print Shop.\nAV installations, Managed Print and Network Services. Full line of PPE.", "pics": null, "resp": null, "gmap_id": "0x88891fa9c3d70915:0x822d0b967d10b421"}
{"user_id": "111391196337052808128", "name": "Chris Smith", "time": 1578669178257, "rating": 5.0, "text": "Great place with great people!", "pics": null, "resp": null, "gmap_id": "0x88891fa9c3d70915:0x822d0b967d10b421"}
{"user_id": "104420937470922492672", "name": "Sarah Kuykendall", "time": 1537234260415, "rating": 5.0, "text": "Best place to buy a printer and the service is amazing!", "pics": null, "resp": null, "gmap_id": "0x88891fa9c3d70915:0x822d0b967d10b421"}
{"user_id": "104122743274703043189", "name": "Ronnie Butler", "time": 1537250043970, "rating": 5.0, "text": "Great place", "pics": null, "resp": null, "gmap_id": "0x88891fa9c3d70915:0x822d0b967d10b421"}
