{"user_id": "107433703946694834273", "name": "Lauren Chang", "time": 1614304331913, "rating": 4.0, "text": "Very nice and helpful staff!", "pics": null, "resp": {"time": 1614376075012, "text": "Thank you for your kind words. We truly appreciate you as a Bryant Bank customer!"}, "gmap_id": "0x889a0de42cba3df3:0xd52fb03f748eea2c"}
{"user_id": "110643888097061292484", "name": "Jewelene Lowry", "time": 1497538384846, "rating": 5.0, "text": "The Foley branch of Bryant Bank is great! The people are nice, attentive and really take the time to get to know you. It's professional service with a true hometown touch!!", "pics": null, "resp": null, "gmap_id": "0x889a0de42cba3df3:0xd52fb03f748eea2c"}
{"user_id": "111315972582355469268", "name": "Sue Wright", "time": 1613833332669, "rating": 5.0, "text": "We moved during the pandemic and when we opened our accounts at Bryant Bank there was no opportunity to go into the bank and meet the people.  My husband handled most of it by phone and then we went to the drive through to finalize everything.  Laura, at the Trussville branch, could not have been nicer or more helpful.  By the time we drove away, we did not miss the “going in the bank” experience.", "pics": null, "resp": {"time": 1614004230994, "text": "We’re so glad to hear that you had such a great experience. Bryant Bankers work hard to put care into action for our customers and to provide unbeatable service!"}, "gmap_id": "0x88890ce147499737:0x771efa5f2e4a23d8"}
{"user_id": "105250583770302113701", "name": "Rod Hansen", "time": 1599794542402, "rating": 5.0, "text": "Melissa at Bryant Bank helped me get a pre-approval letter for a loan. She was very professional, quick and knowledgeable. They were honest and upfront about interest rates, terms and monthly payment quotes. I was very impressed with their customer service.", "pics": null, "resp": {"time": 1599926875633, "text": "Hi Rod! Thank you so much for sharing your Bryant Bank experience with us.  We are grateful for our bankers and their commitment to serving their customers.  Welcome to the Bryant Bank family!"}, "gmap_id": "0x88890ce147499737:0x771efa5f2e4a23d8"}
{"user_id": "100829050008264850832", "name": "Diane Cole", "time": 1483978360474, "rating": 5.0, "text": "Best Bank around!  Trussville employees are professional but you feel more like friends. I've used other banks in the past but have been with Bryant from beginning & have NEVER been disappointed. Thanks to all my friends there!\n😇", "pics": null, "resp": null, "gmap_id": "0x88890ce147499737:0x771efa5f2e4a23d8"}
{"user_id": "109271714641076580778", "name": "Jay Hall", "time": 1497620057906, "rating": 5.0, "text": "My wife and I came from a \"big\" bank - in fact one we had been with for over 40 years - one she had actually worked for - for nearly 20 years. But after leaving their employ, the bank sold out to a larger bank- twice -  and we felt like a \"number\". We were recommended to talk to Bryant and when we did it was like meeting family! Natalie Norton and her excellent group of ladies just make us feel SO welcome EVERY time we go. They know us by name and go out of their way to greet us with smiles and serve us so splendidly. We wouldn't dream of going elsewhere for banking services. We are spoiled !!!!", "pics": null, "resp": {"time": 1497640744618, "text": "We are so glad that you love Bryant Bank and have experienced our unbeatable customer service.  Natalie and the team in Trussville are wonderful.  If we can ever do anything for you and your wife, please let us know!"}, "gmap_id": "0x88890ce147499737:0x771efa5f2e4a23d8"}
