{"user_id": "111346380229396536236", "name": "Reading Mom", "time": 1597866857256, "rating": 5.0, "text": "My 6 year old boy has been learning playing the piano with the Madison Music Academy for about 6 months. He has been progressing very fast. Mr. Brown built him a strong foundation of learning the rhythm and beats in the music first. From there he introduced playing the melodies and chords. Mr. Brown teaches theories and techniques along with musical creativity in a balanced way. He encouraged my boy to compose a 8 measure of song in the very beginning of his lessons. Now, my son can play a children song with both hands playing chords and melodies. He comes to the piano -voluntarily-playing all the major scales, 2 octaves going up and down by himself! Mr. Brown uses many unconventional methods to teach music to his students. But they works! I have seen it from my son. Mr. Brown is also good at communication. He listens to parents' concerns and ideas to make the lessons more suitable to the child. I am pleased about my son's progress and music experience with Madison Music Academy.", "pics": null, "resp": {"time": 1597859047058, "text": "Thank you so much for your kind words. I am so glad you guys chose to take piano lessons from the academy."}, "gmap_id": "0x886265578504d7fd:0xe60a41fb1df932dd"}
{"user_id": "100078304015521961378", "name": "Sarah Bogardus", "time": 1604953150374, "rating": 5.0, "text": "Eric has a passion for music and loves sharing his knowledge with kids. He is a patient and encouraging instructor and my daughter enjoys her lessons. As a parent, I appreciate the additional emphasis on music theory and exposure to different genres.", "pics": null, "resp": {"time": 1609699482084, "text": "Thank You So Much Sarah. It has been a true pleasure to teach your daughter in our plucked strings curriculum."}, "gmap_id": "0x886265578504d7fd:0xe60a41fb1df932dd"}
{"user_id": "108887419716749396086", "name": "Melissa Wright", "time": 1596520638320, "rating": 5.0, "text": "Mr Brown is a patient guitar, piano, and voice teacher. He not only teaches how to play the instruments but educates the kids on how to read music and have a true understanding of the music they are reading. The kids are excited for their lessons each week. Music homework is fun and informative and actually gets completed without me having to say anything.\nThanks Mr Brown!", "pics": null, "resp": {"time": 1596523399781, "text": "Thank you so much. I am glad to know that your children are enjoying their music lessons."}, "gmap_id": "0x886265578504d7fd:0xe60a41fb1df932dd"}
{"user_id": "111814776514080456891", "name": "Jeff Burns", "time": 1596500170293, "rating": 5.0, "text": "Eric is an awesome instructor.  Our 5 yr old boy Will has learned so much from him and enjoys the weekly lessons.  He’s going to be a guitar rock star soon!  Highly recommend for getting young children involved in music!", "pics": null, "resp": {"time": 1596501330522, "text": "Thank you for your kind words. It a pleasure to see him learn and be excited about his music lessons."}, "gmap_id": "0x886265578504d7fd:0xe60a41fb1df932dd"}
{"user_id": "110861964336777899674", "name": "Brandon Terry", "time": 1583909091103, "rating": 5.0, "text": "Mr. Eric Brown is an awesome music teacher and an awesome person! He gave me my very first job years ago when I was still in high school. Now he is helping to spread the joy and knowledge of music with those who otherwise wouldn’t have the opportunity. I would highly recommend him and his new program!", "pics": null, "resp": {"time": 1583952032927, "text": "Thanks Brandon!  It was a pleasure teaching you way\nback then."}, "gmap_id": "0x886265578504d7fd:0xe60a41fb1df932dd"}
{"user_id": "117811877158218875015", "name": "Tracy Morris", "time": 1583953773059, "rating": 5.0, "text": "We're very pleased to have found a music school as awesome as Madison Music Academy. Fantastic instruction, awesome owner, pleasant atmosphere. What else could I possibly as for? Very highly recommended!", "pics": null, "resp": null, "gmap_id": "0x886265578504d7fd:0xe60a41fb1df932dd"}
{"user_id": "112818987448656385381", "name": "Taylor Carter", "time": 1583967307266, "rating": 5.0, "text": "Eric is a wonderful teacher and great person! He always showed up ready to teach and always with a smile! :) highly recommended!", "pics": null, "resp": {"time": 1596485313448, "text": "Thank you Taylor"}, "gmap_id": "0x886265578504d7fd:0xe60a41fb1df932dd"}
{"user_id": "111582878258044987499", "name": "Chris Schafer", "time": 1583266568569, "rating": 5.0, "text": "Finally found a music school where the teachers really care and make learning music fun!!  Thank you for all you do. Highly recommend!", "pics": null, "resp": {"time": 1583952095141, "text": "Thanks Chris! Your kind words mean a lot."}, "gmap_id": "0x886265578504d7fd:0xe60a41fb1df932dd"}
{"user_id": "100171990055349991735", "name": "Jeff Comas", "time": 1583248430417, "rating": 5.0, "text": "Caring and Knowledgeable staff. A great place to learn music. 🎶", "pics": null, "resp": {"time": 1583952108152, "text": "Thanks Jeff!"}, "gmap_id": "0x886265578504d7fd:0xe60a41fb1df932dd"}
{"user_id": "111745591716749971672", "name": "Jeff Comas", "time": 1579353650860, "rating": 5.0, "text": "Eric is a brilliant musician, experienced music educator, and strong comunicator. A great choice to help you on your musical journey.", "pics": null, "resp": {"time": 1579625308184, "text": "Thanks Jeff! Since you are the owner of the largest music school in Tennessee, what an honor to have you think that."}, "gmap_id": "0x886265578504d7fd:0xe60a41fb1df932dd"}
{"user_id": "100888295940022057340", "name": "Lori Black", "time": 1579246818741, "rating": 5.0, "text": "Great professional school that goes beyond the standard of other music schools. Love it!!!!", "pics": null, "resp": {"time": 1579250300107, "text": "Looking forward to serving you guys for many years to come."}, "gmap_id": "0x886265578504d7fd:0xe60a41fb1df932dd"}
{"user_id": "102061525648735658062", "name": "Amy", "time": 1579248404877, "rating": 5.0, "text": "Finally a Music Academy on County Line Road! Great place to learn piano and guitar lessons.", "pics": null, "resp": {"time": 1579250183602, "text": "We are glad to be here to serve you."}, "gmap_id": "0x886265578504d7fd:0xe60a41fb1df932dd"}
{"user_id": "108324358837323663112", "name": "Derrick Green", "time": 1579248856326, "rating": 5.0, "text": "I wish that Madison Music Academy was here when I was a kid. Wow! Music lessons taught the right way.", "pics": null, "resp": {"time": 1579250170171, "text": "Thanks Derrick!"}, "gmap_id": "0x886265578504d7fd:0xe60a41fb1df932dd"}
{"user_id": "107602840420322876740", "name": "Tiffany Dortch", "time": 1595003109525, "rating": 5.0, "text": "We had such a positive experience with Sylvan in Montgomery, AL. The owner, staff and teachers are all wonderful!", "pics": null, "resp": null, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
{"user_id": "113003993805946009866", "name": "Cameron Sheffield", "time": 1565381020930, "rating": 5.0, "text": "Sylvan made school work during the summer fun!! The staff is very caring and friendly. They were able to accommodate our busy schedule and most importantly help our children master the needed course work.", "pics": null, "resp": {"time": 1569246851349, "text": "Thank you for your feedback, Cameron!  I'm so proud of your children and all of their hard work this summer!"}, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
{"user_id": "117246863388269659024", "name": "Heidi Ingraham", "time": 1574127528428, "rating": 1.0, "text": "My children tried the after school Robotics program for 2 months. The concepts they learned had very little to do with robotics, mostly coloring sheets. Also, on the final day we intended to participate, the staff emailed at 1:45pm that they would not have the after school program due to staffing shortage and that parents should pick their children up at 3pm. When I inquired about my refund for that date they indicated  that there wouldn't be one because the program was a subscription. So even though they made it impossible for me to use my subscription for the day they refused me a refund for that day.  I do NOT recommend this location.", "pics": null, "resp": {"time": 1575326956218, "text": "Greetings Ms. Ingraham.  First of all, thank you for sharing your lovely children with us for after-school Robotics.  We had so much fun with that bright group of little learners!\nCoding is very heavily involved in Robotics.  It is important to introduce new skills and concepts in a way that is best for the students to understand and grow their basic working knowledge.  At times, it is necessary to use unplugged activities to set each student up for success in these new coding concepts, especially in such a young group of engineers.\nAs for the subscription / final session:  We have been conducting after-school programs since the beginning of the school year for this particular school.  We charge a flat subscription fee no matter the number of weeks included in the month.  Some months had 5 sessions and some had 4 making it even out in the end.  Canceling the last session in the month was a worst case scenario for us.  We regret it was unavoidable due to mass sickness, leaving us with no teaching options.\nI believe in what we do and I'm so proud of how we do it!"}, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
{"user_id": "117129150128969149226", "name": "Joel Stephens", "time": 1569026744424, "rating": 1.0, "text": "They guaranteed that my son would receive one on one tutoring,  and he never ever received one on one tutoring at all. The people that work here are very pushy and rude. Every parent that I talk to that has used Sylvan states the exact same thing. Please save your money and time and headaches and go elsewhere. We were referred to Huntington Learning Center,  and they are absolutely the best ever. They are one on one as described and very professional.", "pics": null, "resp": {"time": 1569246788352, "text": "Good morning Joel.  Thank you for your feedback.  Will you please confirm this occurred at the Montgomery location on Lomac Street?  We strive to give the very best service and this doesn't sound like our level of service.  Please give us the opportunity to make this right if it is, in fact, us in Montgomery.  Please feel free to contact me directly.\nMisty Mitchell\nEducation Director\nSylvan Learning Center\n334-262-0043 md@montgomerysylvan.com"}, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
{"user_id": "108952846401498897697", "name": "Delane Alexander", "time": 1610751726937, "rating": 1.0, "text": "No stars if I could ... Enough said", "pics": null, "resp": {"time": 1611069943345, "text": "Your student accomplished so much in her time here!  I am amazed at her progress and mastery of skills and concepts.  I have no doubt she will continue to be successful.  She overcame a substantial obstacle, and for that, I am extremely proud!  I am sorry you feel the way you do about our organization.  We give chances and options where there often aren't any options left.  I wish you shared the same positive feelings as us as we cheered her on during her time here.  Thank you for your feedback."}, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
{"user_id": "104391823304518753595", "name": "Karen Jones", "time": 1606786233592, "rating": 5.0, "text": "Great tutoring facilities!", "pics": null, "resp": null, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
{"user_id": "113848128360815880609", "name": "Misty Mitchell", "time": 1437496514212, "rating": 5.0, "text": "Both of my children took the Math EDGE course over the Summer.  They loved their teacher, Ms. Shan, and loved the math games they played as a group with their peers.  We are looking forward to the after school robotics classes coming this fall!  The newly renovated building is nice too.", "pics": null, "resp": null, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
{"user_id": "103771973521769588525", "name": "Keith Wheeler", "time": 1520968257880, "rating": 5.0, "text": "Daughter really likes her teacher, flexible hours, great staff.", "pics": null, "resp": null, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
{"user_id": "117978169329440241304", "name": "Andrea Cheatham", "time": 1497563444952, "rating": 4.0, "text": "The staff and teachers are amazing.", "pics": null, "resp": null, "gmap_id": "0x888e81c389684d93:0x98e1599fff497dfc"}
