{"user_id": "108640041363496634275", "name": "Daniel Porter", "time": 1569498204695, "rating": 5.0, "text": "Nice place nice people", "pics": null, "resp": null, "gmap_id": "0x888a3eea5c347f99:0x8044ed73ea2a8cdd"}
{"user_id": "100583780984566820260", "name": "Alyssa Green", "time": 1611942852879, "rating": 5.0, "text": "My son has been here for 2 years and loved every minute. Sports are exceptional as well.", "pics": null, "resp": null, "gmap_id": "0x887d37d3779818e5:0xf4b7b6e8a703a15e"}
{"user_id": "112968651902844960865", "name": "Edward Mann", "time": 1617240047950, "rating": 5.0, "text": "Sports are great. Band is great.", "pics": null, "resp": null, "gmap_id": "0x887d37d3779818e5:0xf4b7b6e8a703a15e"}
{"user_id": "103489122345617721268", "name": "Edward Mann", "time": 1614636530455, "rating": 5.0, "text": "GREAT school", "pics": null, "resp": null, "gmap_id": "0x887d37d3779818e5:0xf4b7b6e8a703a15e"}
{"user_id": "118022264486288564164", "name": "Kevin Olsen", "time": 1534633607399, "rating": 1.0, "text": "I would not recommend anyone take a child here. You talk about a place that needs to be shut down it would be this place. I went to go pick up my daughter and no teacher was in sight. Who in the world is watching my child? What was I paying for? They watch way to much t.v. I don't pay you guys to have my child watch t.v. I pay you to teach them. The place smells like urine. Ever hear a cleaning up the place? I wouldn't want these people watching my snow shack let alone a kid. I wish I could give 0 stars.", "pics": null, "resp": null, "gmap_id": "0x887d37d3779818e5:0xf4b7b6e8a703a15e"}
{"user_id": "101482831178354008444", "name": "Davis Hamm", "time": 1555043507769, "rating": 5.0, "text": "Teachers were alright band is good and sports is too", "pics": null, "resp": null, "gmap_id": "0x887d37d3779818e5:0xf4b7b6e8a703a15e"}
{"user_id": "103432775365866944270", "name": "Stephen Clark", "time": 1494892911921, "rating": 5.0, "text": "There is no place better to have your children educated in a Christian environment!", "pics": null, "resp": null, "gmap_id": "0x887d37d3779818e5:0xf4b7b6e8a703a15e"}
{"user_id": "116221122958291884456", "name": "Ashley Harris", "time": 1480228721475, "rating": 5.0, "text": "Enjoyed my years as a student at Mars Hill", "pics": null, "resp": null, "gmap_id": "0x887d37d3779818e5:0xf4b7b6e8a703a15e"}
{"user_id": "108475931629852748165", "name": "Blake Stephenson", "time": 1546395356867, "rating": 5.0, "text": "Attended from K -12.", "pics": null, "resp": null, "gmap_id": "0x887d37d3779818e5:0xf4b7b6e8a703a15e"}
{"user_id": "106053051640200016524", "name": "Allison Merrell", "time": 1625679211537, "rating": 5.0, "text": "Would highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888e9b0fd3317975:0xf778c37972961140"}
{"user_id": "111579823567459407418", "name": "Beth Huckabee", "time": 1562603857641, "rating": 2.0, "text": "Would not recommend if you or your child is LGBTQ. The student atmosphere thrives off of gossip around the sexual orientation of other students. Not an accepting environment and most students are not open-minded at all. School discipline policy is strict if you like that. School faculty (teachers) are very dedicated to their jobs and want you to succeed. Mrs. Snow is one of the best teachers I've ever had and will make sure that your child succeeds at New Life.", "pics": null, "resp": null, "gmap_id": "0x888e9b0fd3317975:0xf778c37972961140"}
{"user_id": "114444792259979609238", "name": "Steve Thornton", "time": 1527430692381, "rating": 5.0, "text": "Great education, great staff and kids. So glad to be a part of NLCA. Editing post to say my son Graduated a couple days ago and my daughter still has 2 years remaining. This school has the staff, character and sports that are top notch. Christian athletics is somewhat better than public in that it tries to leverage competition while maintaining a Christian attitude which is the burden of the league to enforce and direct in my opinion. The fans, kids and coaches may not always get it right but you do have accountability. I see one negative post below and find those accusations unbelievable. Pastor Cova takes exceptional care of the grounds and facility. I have never seen anything but care, love and compassion from him and all the staff. I assume most can read the resentment and poor taste with hate posts on Google  reviews that are often very distorted or fake.", "pics": null, "resp": null, "gmap_id": "0x888e9b0fd3317975:0xf778c37972961140"}
{"user_id": "118360510075196652586", "name": "April Love", "time": 1481391394083, "rating": 1.0, "text": "This place sucked. The principal at that time Alan Cova was a true hypocrite, pretending to be a Christian while swinging out back to smoke cigarettes and cuss kids out. Once he threw a chip bag on the ground outside the classroom building. I can remember looking at him puzzled, then laughing and throwing down an orange peel. He gave me detention for an hour to pick up trash. Another time, I was sent to his office for talking in class. He decided 2 paddles licks was in order and one hit me across my lower back. I had a bruise for almost two weeks. Coach Thompson was told me to shut my \"goddamn mouth\" during a softball practice. I still remember him being right up in my face and his spittle flying everywhere.  Micki Jackson was another hypocritical nightmare of a \"teacher\" who egged kids on to pick on one another and chose favorites. She was loud and fat and thought herself a goddess. Lots of sexual misconduct and harassment was experienced. I know times and faculty have likely changed, but I still wouldnt recommend this school or church to anyone that has any integrity. Worst two year school experience of my life.", "pics": null, "resp": null, "gmap_id": "0x888e9b0fd3317975:0xf778c37972961140"}
{"user_id": "101163906713098185851", "name": "Anna Jackson", "time": 1615233685533, "rating": 5.0, "text": "GREAT!!!School", "pics": null, "resp": null, "gmap_id": "0x888c9b10525c3d8d:0xc0268e8c8940a1fb"}
{"user_id": "110360737657234362675", "name": "madison jennings", "time": 1394210704526, "rating": 5.0, "text": "WERE VERY AWESOME LIKE YOU WILL LOVE IT HERE THERE IS SO MUCH FRIED FOOD ITS CRAZY", "pics": null, "resp": null, "gmap_id": "0x888c9b10525c3d8d:0xc0268e8c8940a1fb"}
{"user_id": "107663754476212138518", "name": "alyssa j sorrells", "time": 1415395445272, "rating": 5.0, "text": "This is an awesome school like its so cool I can't put it into words", "pics": null, "resp": null, "gmap_id": "0x888c9b10525c3d8d:0xc0268e8c8940a1fb"}
{"user_id": "107548778246489069221", "name": "123 Powell", "time": 1618424330459, "rating": 5.0, "text": "We love sending our 4 month old son to Heritage Preschool. Being a first time mom with a newborn, my husband and I searched diligently to find the best fit for us and our family. After visiting several daycares, we knew immediately after we visited that Heritage was perfect for us.\nWe always have an amazing experience with everyone we ever encounter in all departments.\nSo I believe their staff all share the same vision.\nI am confident and at ease when I drop my son off, because I truly believe he is loved and well taken care of... what more could a mom want.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "103857139478884580385", "name": "Ali Wesson", "time": 1618339139885, "rating": 5.0, "text": "My two babies who are now 2 and 4 have been at Heritage since the infant room. They are the only facility we would ever consider. The staff is amazing, the facility is top notch. Not to mention the curriculum. I would recommend them to anyone I know. Thank you Heritage for taking such great care of my babies!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "112630661301553325517", "name": "Amy Barnett", "time": 1618364783739, "rating": 5.0, "text": "Heritage\n\nWe started our journey with Heritage amongst a pandemic. Around us the world lived in fear of getting sick and hid behind masks and shelter in place orders. As we started to venture out we knew we needed to put our daughter in a place that was welcoming, caring, God fearing, and safe. When we walk through the doors at Heritage there is no way to not feel this comfort. We are greeted each morning by the office staff with warm hello’s in a clean and welcoming atmosphere. As you transition throughout the building it is impossible to not feel welcome and see how safe and cared for the children are. The entire staff always goes out of their way to help and ensure your child is getting the utmost care. If you are on the fence about a day care let me help you make the decision. Heritage of Pelham is hands down the best daycare in our area. We are blessed to have them help us raise both of our girls.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "108205421969520103869", "name": "Samantha P", "time": 1618543296873, "rating": 5.0, "text": "Heritage Pelham is the best!!! All the teachers we’ve had have all been truly precious people and always taken great care of our little one!! They love the kiddos so much and make each one feel special. I’m so grateful for all they do and that we are apart of the Heritage family. I always recommend them and tell everyone how happy we are with them!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "108403785627861765743", "name": "Kate Waudby", "time": 1618352238115, "rating": 5.0, "text": "This is the best preschool around town! Every staff member is so kind and welcoming. The second time I ever walked through the door with my baby, they knew him by name. The rooms are very well taken care of and exceptionally clean. I would definitely recommend it to anyone and everyone looking for a preschool for their child.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "110396967236934452510", "name": "Jessica Porterfield", "time": 1618409783804, "rating": 5.0, "text": "We moved our son (3 yo) to Heritage from a different local daycare a year ago, and are so happy with our decision. We have been so impressed with the love they show him every day, and the education that he receives. I can trust that he is in good hands for the 9+ hrs that I am away from him at work. Heritage is a great school with great office staff and teachers!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "102575521635550231267", "name": "Alison Howell Steineker", "time": 1618323226772, "rating": 5.0, "text": "We love Heritage Preschool.  It has been a great experience for our two year old.  The management and teachers are top notch.  The facility is beautiful and our little girl loves it there. I would highly recommend to other parents.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "103992992988265627864", "name": "Christina Dennis", "time": 1618430091860, "rating": 5.0, "text": "We went through a few preschools until we found Heritage. Our little girl was adopted, and the other schools we tried were not willing to work with us on our daughter's needs as she became adjusted to a new culture. We finally tried Heritage Preschool of Pelham, and were blown away. The staff is amazing, and assured us that they would work with our child as she became accustomed to a new culture, new school, and any past traumas she had dealt with. They have done just that! Our daughter now wakes up excited to go to \"school\" and jumps out of bed. She immediately talks about her friends, her teachers, and runs in the door with excitement upon arrival. We can also tell that Heritage puts a ton of effort into teaching our little one, as her speech has highly improved. She's learning so much, and we couldn't be more grateful for the staff at Heritage! Thank you for giving us the confidence to leave our girl in your hands, and for showing her that she is in a safe place to be free to learn and discover new things! We couldn't ask for any better!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "106754749569257705291", "name": "Katie Haggard", "time": 1618436660938, "rating": 5.0, "text": "I have such a piece of mind dropping my kids off everyday knowing they are learning, socializing, and having fun. The best part is I know they are being well taken care of and I do not have to worry! I would 100% recommend this school.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "113051054236845780263", "name": "Peyton Penfield", "time": 1618586989661, "rating": 5.0, "text": "We are so excited to have joined the Heritage family. We had a difficult time with our 2 y/o daughter at her last school and spent a lot of time trying to figure out if it was just the terrible two’s or if she just wasn’t getting enough out of the school. We started to seek out other schools and looked at a few in the area and our heart gravitated towards Heritage. I believe God led us to these wonderful people and since joining our girl has gone 180 from where she was. She is engaged all day, is happier when she comes home, her mood is fun and spunky, her language is exploding and the teachers there truly love and care for her. From the moment you walk in you are greeted with joy from everyone. I have much thanks and am so grateful for the amazing staff at Heritage and look forward to watching our girl grow with them.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "112112577322382546613", "name": "Josh Buchanan", "time": 1629147885063, "rating": 1.0, "text": "Larry Vann needs to go. Also, they'll occasionally give away a months tuition for a five star review so I'm curious how many of these \"reviews\" are legitimate.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "105189177001833809618", "name": "Shannon Davis White", "time": 1618539828610, "rating": 5.0, "text": "Heritage is such a great place. It’s more than a daycare/preschool they are a part of our family helping to mold and shape our kids. The best choice you can make is enrolling your children here.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "109057022824028875632", "name": "Oreal Hixon", "time": 1618510926300, "rating": 5.0, "text": "My son has attended this school since he was 6 months old and now he is in kindergarten.  He has learned so much and received great care. The teachers and front staff are just like family.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "106955693202899981180", "name": "April Hubbard", "time": 1603376891774, "rating": 5.0, "text": "Heritage Preschools is a wonderful place to send your children! 2 of my children have gone through the whole program from 6 weeks to 6 years and my 6 month old is currently attending. The quality of care they give the children is so high. We have made some really good friends there that we still talk to even though they aged out of Heritage. My oldest 2 were academically ready for school when they left Heritage. The staff is so loving and they care about the children and their families. I highly recommend Heritage Preschools for your little ones!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "115456164234946425502", "name": "Miranda McClanahan", "time": 1618532823793, "rating": 5.0, "text": "When we started looking for childcare for our baby boy, Heritage easily made it on our list of places to look into. And then, they blew us away and easily became the very clear choice for us! After years of investigating abuse and neglect (including daycare settings), I have extremely high expectations when it comes to childcare. I was not going to send my child just anywhere. I am also super strict when it comes to safe sleep practices. Like many parents, the thought of leaving my child with someone else gave me a lot of anxiety to say the least. However, I have had so much peace knowing my child is cared for by the very best! I do not have to worry about his safety, and his teachers have proven time and time again how much they care for him and love their jobs. My son has been in the Infant II class with Charla, Suzy, and Mykah. I already know how hard it’s going to be when he’s ready to move up to the next class because these teachers are so wonderful! He has learned and developed so much. He loves going to see his teachers and friends each day! They keep me updated on him, and they love sharing about his day!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "111720728292359326685", "name": "Ashley Murry", "time": 1578436226133, "rating": 5.0, "text": "The Heritage is always spotless and the teachers are always very pleasant. My daughter has attended The Heritage Preschool of Pelham since she was 5 months and she is now 3 and still loves it to this day .  Every morning when I drop her off she greets her teachers and classmates with a smile, which makes it a lot easier to feel comfortable going to work.  I feel this way because the Director and Teachers are more like family than anything else .", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "107280509047977737572", "name": "Rachel Seaborn", "time": 1579023875706, "rating": 5.0, "text": "I highly recommend Heritage Preschools. We’ve had a great experience. It’s exceptionally clean and well kept. The teachers and staff are supportive, friendly and take great care of the children. We transferred our daughter from another daycare and their structure, curriculum, and atmosphere has been wonderful! We're thankful for their Christ-centered curriculum and hearts for the kids there. It really shows. Our daughter has just blossomed and learning so much at Heritage!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "110787787163769028758", "name": "Beth Simpson", "time": 1578952187302, "rating": 5.0, "text": "Words can't describe the LOVE we feel at Heritage! Our two girls are loved so much and have learned so much from their teachers! I never worry about the safety of our children while at work because I know they are in the best of care. They truly love the kids like they are their own!!\nAnd when your child comes home and tells you she can do all things through God you know you are sending her to the right place!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "105688356547102328377", "name": "Lori Cannady", "time": 1576764981971, "rating": 5.0, "text": "My 2 sons go to heritage in Pelham and I cannot think of anything negative to say about this place. They are so kind and always make sure we’re happy. The teachers are so caring and love on my babies like their own! The admin go above and beyond to help with anything we need. Through thick and thin, this school has always put us first! And the building is beautiful! Highly recommend this location.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "114054417791963527329", "name": "David and Katy Bush", "time": 1578434083004, "rating": 5.0, "text": "We have had a wonderful experience! Our boys are well loved and encouraged to be their best. I love that Ms Doris keeps me in the loop when my son has a tough day so we can help him when he's struggling. I feel like it's a team effort. The admin staff is so welcoming and Larkin is wonderful. I cant speak highly enough of the experience we have had so far!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "102242513818275068683", "name": "John Haggard", "time": 1578442446718, "rating": 5.0, "text": "We have had a great experience with Heritage. Our son used to ask not to have to go to school but now that he’s at Heritage he gets excited for school in the morning. He thrives under the structure, discipline,\nand guidance of his teachers. His teachers really care about him and truly want what’s best for him.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "114474255352478065466", "name": "Gina Borgosz", "time": 1578438376833, "rating": 5.0, "text": "I have nothing but great things to say about my experience at Heritage! We’ve been there for a year and I feel that my daughter has grown and learned so much, she loves to be around people, and is so loved by her sweet teachers! The administration and office staff are very friendly and keep me informed weekly. This was the first daycare we toured, and we looked at two others after, but nothing compared to Heritage! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "107991444761873434501", "name": "Mary Gray", "time": 1576704588910, "rating": 5.0, "text": "We LOVE Heritage!  The facility is clean and beautiful, their infant care is amazing, and their curriculum will give your little ones a strong foundation for their early learning years.  They are far more than just a daycare and truly care about the WHOLE family!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "100807575411967493142", "name": "M. Crocker", "time": 1577365575831, "rating": 5.0, "text": "Amazing staff! The teachers genuinely care for their students and the admin team goes above and beyond every day, not just for the students but for the parents and the staff as well. The curriculum is far more than I expected, they actually teach the students how to read so they are more than prepared for elementary school.  Highly recommend!!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "105097048826536648987", "name": "Lia Brady", "time": 1576702319792, "rating": 5.0, "text": "Great management and teachers - all of the Heritage locations far exceed any expectation you could ever have about a preschool. I would honestly never take my child anywhere else. Once you have the best, it's hard to go anywhere else!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "115944271822776124180", "name": "Colby Nicholson", "time": 1578433811128, "rating": 5.0, "text": "Fantastic Preschool! Our daughter has been going here for a little over a year now. The teachers and staff are very friendly and take exceptional care of the kids. You can tell that they really care. The facility is always very clean which is a BIG deal to us and I am sure very hard to do with so many children. The Godly manner in which they teach the kids and run the preschool is unmatched and very hard to find anywhere else. Our daughter sang the \"God Our Father\" prayer song that they sing everyday before having a tea party with her toys the other day and it melted our hearts. That is the kind of stuff that you want your kids learning from the people that they spend the majority of time with. We love Heritage!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "103704608010324281996", "name": "Lakenya Wilson", "time": 1576703926207, "rating": 5.0, "text": "There is no where I would rather my children attend. We have some of the best teachers, and they are all CPR certified (A PLUS) . The management is phenomenal! The facility is spotless, and safe. We love Heritage!!!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "105381839324171587080", "name": "Ali Wesson", "time": 1578451570077, "rating": 5.0, "text": "My children have been with them since they were infants. We love the school and the staff. The teachers truly care about their students and it shows. They have a great facility and an excellent curriculum.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "103264253202825430321", "name": "Chibi Maruko", "time": 1578684207289, "rating": 5.0, "text": "Both of my kids like the Heritage preschool. We moved our kids from another daycare and it was a big decision to make for us. Now, we are glad we made that decision. Our oldest son is learning so much stuff from school and I can easily see that because he tells me what he did at school everyday. Sometimes, he even gives me a little lecture using his small white board how to write letters and numbers (his name, his brother's name, blends...etc). Our young one shows a big smile and looks so happy when he sees his teacher every morning which makes me happy and feel so relief as well.  And I have to mention that the facility is really clean.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "105299005113423680197", "name": "Jessica Howland", "time": 1578625230159, "rating": 5.0, "text": "Our two children have been at Heritage for the past year and a half. We moved them there from another center, and we are so glad that we did. They love it there. They have had great teachers, and they have both learned so much. It is such a relief to trust the people who take care of your children and not have to worry about them all day. We can’t recommend Heritage enough!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "108771880478844710722", "name": "Melody Jordan", "time": 1578945266994, "rating": 5.0, "text": "My son (2.5) attended a home daycare and didn’t start until he was 4 months old. I was a little hesitant about our daughter starting at a “real” daycare at 8 weeks old.  Ms. Rachel and Ms. Kim are amazing with  her and you can really tell that she LOVES being there. They go above and beyond to make sure she is happy and well cared for. I could not be any happier with our experience at Heritage in Pelham. Everyone from the front office to the directors to the teachers go out of their way to help, pray and make your child feel welcomed and loved!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "104936373940227419437", "name": "amanda moore", "time": 1578942848606, "rating": 5.0, "text": "Hands down the BEST preschool around! Every teacher has been so kind and truly invested themselves into my daughter.. I will always recommend Heritage Preschool!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "113677293010907942361", "name": "Erin Sullivan", "time": 1578456723405, "rating": 5.0, "text": "As a first time mom I had severe doubts/concerns/fears about sending my new baby somewhere ... until we started here at Heritage. The staff is welcoming and learns everyone’s names, the place is spotless, and they genuinely care for the kids. My son is in the infant 1 classroom and his teachers have become a huge part of our lives helping us with milestones/advice/showing he can do things or play with things - before we even knew he could - helping him learn and grow. It is worth every penny having peace of mind he’s being loved on and cared for each day.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "109285476220903445679", "name": "Rachel Etheridge", "time": 1576801541966, "rating": 5.0, "text": "I have thoroughly enjoyed my time at Heritage. There is such a great atmosphere and it is a great place to work. We aim to spread the love of Christ to every family that walks through our doors.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "105348703662129544564", "name": "WTGardner", "time": 1578945216388, "rating": 5.0, "text": "One of the best places to have your young children learn and socialize as they grow.  We love having both of our girls there!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "102789889152596392620", "name": "Coley Robichaux", "time": 1578940116524, "rating": 5.0, "text": "Heritage has been a blessing to my family! I was very apprehensive about sending my child to school since my oldest child hasn’t done preschool. Heritage calmed my nerves by showing so much love and attention to my child. I thought morning drop offs would be difficult but seeing my child light up when she sees her teacher makes me so happy! Getting daily updates and pictures puts my mind to ease as well. No matter how many people are coming and going in the front lobby, my child is always acknowledged by name from any employee to start and end our day. ❤️", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "116386011935017213922", "name": "Jordan Uptagrafft", "time": 1576770392955, "rating": 5.0, "text": "We love Heritage Preschool! My kids are so excited to run down the hallways and greet their teachers and friends each morning. The teachers are so hands on and loving! My kids have learned so much and not just about their ABCs and shapes but also that they have a Savior that loves them so much. They are taught the ten commandments and are challenged to memorize bible verses! Heritage is family and we love it so much!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "104671133905199226450", "name": "Natalya Winters", "time": 1578438333597, "rating": 5.0, "text": "Reviews are so important. Actually, my husband does not purchase items or visit locations without reading the reviews! My 4yr old started in September 2019 and it has been such a wonderful experience. For our family [like many], it's important that our daughter is in an environment that uplifts her. Pre-K is such an important time is a child's educational and social transition. Our sweet girl has a syndrome and has been teased at another school; It left me feeling hopeless about what was to come [starting kindergarten], but she has not come home with any stories about being teased since starting at Heritage. I attribute that to the welcoming environment that you are greeted with from the front door to the classroom and everything space in between. They have listened to and explored every concern my husband and I have had. They keep us updated weekly on events and news, which is important for me as a working mom. (I'd hate for her to miss out on PJ day because no one informed me) It is a great school with great staff who love patiently on all the children. We thank God for this experience as we prepare for Kindergarten!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "109060624930144108753", "name": "Charla Jex", "time": 1576802399382, "rating": 5.0, "text": "I love this school, it has brought me great joy and happiness for many years. Heritage is the best daycare for your precious children.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "103074922479554079597", "name": "Natalie Jenkins (NatBug)", "time": 1618831072626, "rating": 5.0, "text": "This is a really good daycare. My little one loves it here! The teachers are amazing and treat everyone like family💜 and you can tell they love their students as if they were their child. Best decision when choosing a daycare!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "111556422172679070967", "name": "Rochelle Newby", "time": 1582220498153, "rating": 5.0, "text": "Best daycare ever! I was terrified when I thought about leaving my 8 week-old in the arms of a stranger, but the moment I toured the school, I was sold. I was not impressed with the other daycares that I visited because they were either lacking in cleanliness, preparedness, or security and Heritage Preschool of Pelham was on point with everything. Miss Rachel and Miss Kim were the best!!!! Aniyah is no longer with them but she still loves to stop by their room just to say hello.  My precious baby is now 16 month-old and I still have no regrets. She loves every one of her teachers from Miss Anna and Miss Netty (who used to be in 2B) to Miss Ashley (in 3B). I have yet to meet a teacher that I have issues with, and management has been nothing short of amazing. Heritage is like an extension of our home and I am at peace at work each day because I know she is safe and surrounded by love.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "106207523485526176174", "name": "Tanna Roberts", "time": 1576702101216, "rating": 5.0, "text": "High quality care that implements a curriculum that promotes social, emotional, physical, language, and cognitive learning and development. Positive relationships are promoted & families are encouraged to participate in their child’s learning.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "107049547984406096861", "name": "Amanda Nicholls", "time": 1578934374338, "rating": 5.0, "text": "We love heritage. I moved my kids a little over a year ago to heritage. It is an amazing school. My kids have grown soo much. My son had his first seizure at heritage and they were on the ball when responding to his needs. The office staff and teachers are amazing. They have truly became family,. The Director Larkin has literally been a a gift from God to my family. He has helped me through a lot of things. If you are looking for an amazing family for you kids to become close with this is it.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "103838094767729227132", "name": "Lindsay Smith", "time": 1578936907872, "rating": 5.0, "text": "Heritage Preschool is a great school and daycare. My oldest son has been going to this daycare for over 3 years now and I also have an 8 month old son who attends the daycare as well. The teachers are friendly and provide your children with a great education. My 3 year old has learned so much from the teachers at Heritage and he amazes me every day with something new that he has learned. They also love on your children and treat them like they are their own. I never worry about my children when I leave them because I know they are in great hands. The office staff is very friendly and do a great job to ensure that parents are happy. Whenever I have had questions or concerns, they have always been willing to sit down with me to discuss those concerns and to figure out a solution to the problem or discuss ways to make things better. My 3 year old son also loves Bible Study and learning about Jesus with Mr. Larkin, the director.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "109402263344983678758", "name": "Regina Gentry", "time": 1602121848704, "rating": 1.0, "text": "Its so sad to say that the school leadership has changed since the split of CCS. I believe in the vision of the owner but don't feel that the vision is being led correctly. I was told that my precious rainbow baby and my kindergartener could no longer attend the school because I mentioned a competitors school to a teacher. (my job has changed and I was looking elsewhere for care) what kind of company immediately kicks out precious children (my 5 year old and a 1 year old) because a competitor was mentioned? There was no animosity, mal intent or anything! It was mentioned in passing. Then I get a call out of no where saying their stuff has been packed up and I can pick it up the next day and it was because I mentioned Ardent to a teacher.\nThis is not a daycare that is about the well-being of the children anymore. They just kicked my babies out! They could care less about what is to happen to my children or where they are to go. My children are good children! They dont deserve to be left high and dry from the one place we prayed over and trusted to care for them!\n\nMy beautiful rainbow sustained chemical burns just two weeks ago from the cleaner they use. Did I up and pull them? No, because I still had faith in them. Then just two weeks later they are kicked out. I just dont understand. Are they so scared of the competition that just mentioning it they will make your kids leave? I dont know but one thing I do know is Mia and Skylar DO NOT DESERVE to be kicked out of the one place that was entrusted   with their care.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "110714652277720069670", "name": "Katherine Cardwell", "time": 1576704933335, "rating": 5.0, "text": "Heritage preschool is a wonderfully well rounded, loving, Christ centered environment for little ones! I wouldn't want to send my child anywhere else.", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "100836181896454454687", "name": "Paul Vest", "time": 1576704093663, "rating": 5.0, "text": "Very thankful for the caring and attentive staff at Pelham!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "105127760162334549090", "name": "Lacey Aman", "time": 1518229594889, "rating": 5.0, "text": "I am so thankful for CCS! My twins have attended for a little over 3 years and my 5 MO since she was 8 weeks. I decided to change daycares for several reasons and regretted it the entire week. Yes, O N E week and I had to move the girls back. CCS Pelham is our ‘home’ and we are happy to be back!\nThe curriculum is awesome and the daily teaching of the Bible is amazing! The girls have learned so much thanks to the staff and we look forward to many more years!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "102202956938878219341", "name": "kelly", "time": 1576792598174, "rating": 5.0, "text": "We love Heritage!", "pics": null, "resp": null, "gmap_id": "0x8889244f9e37e06b:0x5b3869988f0dbd19"}
{"user_id": "107686257092079969678", "name": "Rylee Guerra", "time": 1559853901761, "rating": 5.0, "text": "Bf goes here and he loves it", "pics": null, "resp": null, "gmap_id": "0x8884e3dd4981da87:0x24cb95db15f323c5"}
{"user_id": "103371901251820012481", "name": "Lauren Lehmkuhl", "time": 1488686342342, "rating": 5.0, "text": "Top 10 best dining experiences I have ever had. Will definitely be back for the pinwheels.", "pics": null, "resp": null, "gmap_id": "0x8884e3dd4981da87:0x24cb95db15f323c5"}
{"user_id": "106851874867244368450", "name": "Sup Boi", "time": 1621866649574, "rating": 1.0, "text": "IDK.  I have simply lost my will to coexist here.", "pics": null, "resp": null, "gmap_id": "0x88928d91dbf303f5:0x99d1908a469088e6"}
{"user_id": "110779025736028459122", "name": "Carie A.", "time": 1616517913995, "rating": 5.0, "text": "Love this place!!! The people are really nice and the service is awesome!", "pics": null, "resp": null, "gmap_id": "0x88928d91dbf303f5:0x99d1908a469088e6"}
{"user_id": "116113831825916372152", "name": "Jamie Peacock", "time": 1490307782046, "rating": 5.0, "text": "Houston Academy is our home away from home. You feel like family when you enter the school. Everyone is warm and inviting. You are called by name from the faculty and administrators. We have two children that are pushed academically and we feel certain will become successful adults. This is a college preparatory school and your children are well prepared for college. We love being a part of the Houston  Academy Raiders.", "pics": null, "resp": null, "gmap_id": "0x88928d91dbf303f5:0x99d1908a469088e6"}
{"user_id": "114095879062936286015", "name": "Jenna Kate Strickland", "time": 1610646468009, "rating": 5.0, "text": "great school, just absolutely great", "pics": null, "resp": null, "gmap_id": "0x88928d91dbf303f5:0x99d1908a469088e6"}
{"user_id": "114402691413494063168", "name": "Erin Kelly", "time": 1489679009094, "rating": 5.0, "text": "More than anything, I feel like Houston Academy teaches your children to strive for excellence academically.  It is the only college preparatory school in our area. The faculty, parents, and students strive for excellence collectively in all areas, teaching our children integrity and to be well-rounded individuals that are ready for college and the rest of the world when they finish!  It is a family and there is NO place like it!", "pics": null, "resp": null, "gmap_id": "0x88928d91dbf303f5:0x99d1908a469088e6"}
{"user_id": "103951504986830348711", "name": "Charlie Knowles", "time": 1557332832447, "rating": 5.0, "text": "Amazing School! Teachers are amazing! Shawna=BOT!", "pics": null, "resp": null, "gmap_id": "0x88928d91dbf303f5:0x99d1908a469088e6"}
{"user_id": "107641974063814518822", "name": "Austin Washington", "time": 1542065230269, "rating": 5.0, "text": "Good school and make sure you get Mrs. Dean!", "pics": null, "resp": null, "gmap_id": "0x88928d91dbf303f5:0x99d1908a469088e6"}
{"user_id": "117420994188911385977", "name": "Bloom Mint", "time": 1538229003162, "rating": 1.0, "text": "Worst school I have ever put my children into. I have 2 boys who are part of Houston Acandemy, and they’re both asian. I can’t even tell you how much they come from this “College Prep School” crying, because of bullying. They tell me “Why can’t I do that”, or “Why can’t they pick me”. It just breaks my heart from the racially comments spoke from this school. My children are now part of Providence Christian School, and I don’t regret a thing. Highly don’t recommend HA if you come from a different origin, and your scared of your child getting bullied. Recommend Provi or Northside for you. Thank you.", "pics": null, "resp": null, "gmap_id": "0x88928d91dbf303f5:0x99d1908a469088e6"}
{"user_id": "108039609466303422774", "name": "Jameson Flowers", "time": 1539042724773, "rating": 5.0, "text": "Great school!", "pics": null, "resp": null, "gmap_id": "0x88928d91dbf303f5:0x99d1908a469088e6"}
{"user_id": "109359793597032427391", "name": "Zehnz", "time": 1445026161018, "rating": 5.0, "text": "It's freaking HA what do you expect", "pics": null, "resp": null, "gmap_id": "0x88928d91dbf303f5:0x99d1908a469088e6"}
{"user_id": "104098638407107190480", "name": "Prerna Suradkar", "time": 1479312835950, "rating": 5.0, "text": "I love this map", "pics": null, "resp": null, "gmap_id": "0x88928d91dbf303f5:0x99d1908a469088e6"}
{"user_id": "107765308777452861952", "name": "Sara Paige Baggett", "time": 1564195674111, "rating": 5.0, "text": "I enjoy being there most days.", "pics": null, "resp": null, "gmap_id": "0x888e855591c46a99:0xb10b5c77e53854ef"}
{"user_id": "116878687751380442511", "name": "Blake Ball", "time": 1509890097393, "rating": 5.0, "text": "Great Christian school with a lot of diversity. Quiet location and great faculty.", "pics": null, "resp": null, "gmap_id": "0x888e855591c46a99:0xb10b5c77e53854ef"}
{"user_id": "106643339899469627251", "name": "Ed The Man McBride", "time": 1579306223539, "rating": 4.0, "text": "Nice facilities", "pics": null, "resp": null, "gmap_id": "0x888e855591c46a99:0xb10b5c77e53854ef"}
{"user_id": "114101754777146779750", "name": "ProGamer9163", "time": 1509227525695, "rating": 4.0, "text": "Uhh...", "pics": null, "resp": null, "gmap_id": "0x888e855591c46a99:0xb10b5c77e53854ef"}
{"user_id": "114375147838279182380", "name": "Hannah Rollins", "time": 1554996415514, "rating": 1.0, "text": "I would strongly recommend not placing your child into their daycare facility! The daycare staff has zero patience. Your child will come home with marks they have no idea about and the ones they do know about are the more severe marks and the reason behind the marks are completely ludicrous and do not match up. The director could be informed by EVERY parent and she still would not do anything about it. Please do not place your child there!", "pics": null, "resp": null, "gmap_id": "0x889a0fbb0f64d445:0x76938fcd0ced65f1"}
{"user_id": "106313534279226591720", "name": "C DD", "time": 1575482231150, "rating": 5.0, "text": "My family went to the Sunday morning service while on vacation. We felt welcome and the pastor preached a good message.", "pics": null, "resp": null, "gmap_id": "0x889a0fbb0f64d445:0x76938fcd0ced65f1"}
{"user_id": "114336636403451880972", "name": "Zondra Watson", "time": 1538765757405, "rating": 5.0, "text": "The staff is very friendly and my son loves going. When my son wants to go to daycare and smiles so wide when we pull in it makes me I know it’s a wonderful place. We’re very blessed to have them in our area.", "pics": null, "resp": null, "gmap_id": "0x889a0fbb0f64d445:0x76938fcd0ced65f1"}
{"user_id": "107915103329617493488", "name": "aesuji", "time": 1581993291728, "rating": 1.0, "text": "Don’t place your kids in school here, unless you want them wrongfully accused of a wrong doing and then unenrolled without reason. Too many students per class, and horrible administration.", "pics": null, "resp": null, "gmap_id": "0x889a0fbb0f64d445:0x76938fcd0ced65f1"}
{"user_id": "103639427980917241177", "name": "Woodland Frolicker", "time": 1393552295529, "rating": 1.0, "text": "I strongly do not recommend this daycare to any parent.  My three old son was a teacher's pet and loved his teacher dearly, and she was a fantastic teacher.  After she left the school over some sort of dispute with another teacher we not even informed.  Our son came home deeply upset over the loss of his teacher and began sucking on his shirt while at school (never at home) to cope with the loss.  After about three weeks we begin getting reports that our son was biting and hitting other children, which he has never been aggressive before.  Upon having a meeting with the pastor we were told that there have been multiple situations (which we were never informed of before nor received incident reports) of our son being aggressive. The pastor even said our son had hit someone the previous day, even though the teacher had report that day that he was perfect all day long. The teacher that was assigned to his class has a  daughter who also works there whose son frequently bites and pushes other children.  A friend of ours whose son no longer goes there was catching the blame for the other child's biting. The daughter was suspended (I am assuming) and after her return with her son in our son's class our son now suddenly has a biting problem (which he has never had).  My son's father has walked up upon the boy pushing our son down and after the third time our son went to hit him and his father stopped him, though the teacher was there the whole time and did nothing. After making the decision to change daycares our son came home crying and upset because the teacher would not let anyone play with him do to him going to be going to a new school.  It is deeply saddening when a three year old must stand up for himself because his teacher will not stop bullying and misbehavior to cover up for their grandchild.  It is absurd to let adult teacher to teacher drama be taken out onto a three year child.  If you want a daycare that actually watches what the children are doing, provides a safe and loving atmosphere, and a model environment this NOT the place. I would have given zero stars if possible.", "pics": null, "resp": null, "gmap_id": "0x889a0fbb0f64d445:0x76938fcd0ced65f1"}
{"user_id": "110302093785727919678", "name": "Rachel White", "time": 1555939665226, "rating": 1.0, "text": "We were there a few days and it was horrible. My daughter stayed in a play pen all day long and never had her bottle with her. Always someone else's bottle.", "pics": null, "resp": null, "gmap_id": "0x889a0fbb0f64d445:0x76938fcd0ced65f1"}
{"user_id": "115930686912242185433", "name": "Alyssa", "time": 1574452284197, "rating": 1.0, "text": "I reccomend NOT placing your child here. Very disappointed . Teachers yelling at kids and to many kids per teacher.", "pics": null, "resp": null, "gmap_id": "0x889a0fbb0f64d445:0x76938fcd0ced65f1"}
{"user_id": "116658192539177671952", "name": "Tammy Nance", "time": 1472347096321, "rating": 5.0, "text": "My children loved attending day care and school here.\nExcellent staff.\nHigh ethical and moral standards.", "pics": null, "resp": null, "gmap_id": "0x889a0fbb0f64d445:0x76938fcd0ced65f1"}
{"user_id": "102377014844242500237", "name": "Guerro rai", "time": 1620472467625, "rating": 4.0, "text": "Small community masjid, more spacious inside than what it looks like on the outside. It's about 2-3 miles from the UAH campus. It's this masjid and one in nearby Madison that serve the broader Huntsville region.", "pics": null, "resp": null, "gmap_id": "0x88626beee4aecde7:0xb7695647cfc648ed"}
{"user_id": "103369462266145346417", "name": "jack jakcette", "time": 1616722754386, "rating": 1.0, "text": "No school lunches. During assemblies? Haha what assembly? Most parents pay around 4,500 dollars for this. When tech breaks then it rarely ever gets fixed. They have old tech, Dont worry about it getting fixed just upgrade it.\n\nThe administration is rude and disrespectful ,, and this is a really bad indicator for how they are going to be communicating with you during the school year", "pics": null, "resp": null, "gmap_id": "0x88626beee4aecde7:0xb7695647cfc648ed"}
{"user_id": "107012869192217778192", "name": "Marwan Alsanabani", "time": 1621616502644, "rating": 5.0, "text": "Spiritual and calmness place for all", "pics": null, "resp": null, "gmap_id": "0x88626beee4aecde7:0xb7695647cfc648ed"}
{"user_id": "111748243452077279194", "name": "Ramy Ben Othman", "time": 1617073567515, "rating": 1.0, "text": "Very poor and unfriendly people\nDon’t suggest to ho there to anyone\nThe school there and its administration are a joke...", "pics": null, "resp": null, "gmap_id": "0x88626beee4aecde7:0xb7695647cfc648ed"}
{"user_id": "106029185468246316510", "name": "M Ali", "time": 1601996433785, "rating": 5.0, "text": "Nice masjid with good facilities and very friendly people.", "pics": null, "resp": null, "gmap_id": "0x88626beee4aecde7:0xb7695647cfc648ed"}
{"user_id": "114823674401500740687", "name": "Lasker Lasker", "time": 1584578317525, "rating": 5.0, "text": "One of the best Islamic centers in USA. Very beautiful community with highly educated people who are multi cultural and very diverse. Imam Ragab is very knowledgeable. Love Huntsville Islamic Center.", "pics": null, "resp": null, "gmap_id": "0x88626beee4aecde7:0xb7695647cfc648ed"}
{"user_id": "115941533049497895345", "name": "Waj Far", "time": 1574468469950, "rating": 5.0, "text": "Although all mosques are clean. But this one is extra extra clean.", "pics": null, "resp": null, "gmap_id": "0x88626beee4aecde7:0xb7695647cfc648ed"}
{"user_id": "118145400373978386247", "name": "Mahmood Alasmi", "time": 1531016394820, "rating": 5.0, "text": "Love to go there.  Alhamdulellah for all his blessings on us", "pics": null, "resp": null, "gmap_id": "0x88626beee4aecde7:0xb7695647cfc648ed"}
{"user_id": "117051988843349329526", "name": "Nimmi Mitali", "time": 1437758134705, "rating": 5.0, "text": "So beautiful\nAnd good Imam Ragab", "pics": null, "resp": null, "gmap_id": "0x88626beee4aecde7:0xb7695647cfc648ed"}
{"user_id": "100984464682400206426", "name": "exedera gamer", "time": 1429881906256, "rating": 5.0, "text": "Suphanallah", "pics": null, "resp": null, "gmap_id": "0x88626beee4aecde7:0xb7695647cfc648ed"}
{"user_id": "117235879189854308511", "name": "Toby LeDesma", "time": 1477801363720, "rating": 1.0, "text": "Poor", "pics": null, "resp": null, "gmap_id": "0x88626beee4aecde7:0xb7695647cfc648ed"}
{"user_id": "103913052756485269745", "name": "Farqad Saeed", "time": 1614660517869, "rating": 5.0, "text": "(Translated by Google) It is the house of God. I am very beautiful and all mosques are beautiful\n\n(Original)\nانه بيت الله انا جميل جدا وكل مساجد جميله", "pics": null, "resp": null, "gmap_id": "0x88626beee4aecde7:0xb7695647cfc648ed"}
{"user_id": "112554992326868700494", "name": "Jobs Bham", "time": 1580837030791, "rating": 5.0, "text": "We have been here almost a year and LOVE it. My son started when he was just over a year old in the Starfish class. Hannah, Haley, Olivia, Stephanie, Brittany,Nate, Kelsey, Melissa, are all so responsive. Everyone is very nice, they have a great curriculum and my son has learned SO much since he has been here. He just transitioned to the next class, and has done great. Miranda is so sweet and loving to all her children in the class. Can't say enough good things about this place.  Only downfall is that tight parking lot.", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "115711114034754827075", "name": "Shyesa Granger", "time": 1531835316904, "rating": 5.0, "text": "Where do I begin to express the level of love, passion, and appreciation not only as parents I have for this school but our has daughter too! They are hands down the best place for your babies. From infant to school age care, they are well equipped for the academic, cognitive,emotional, and world adventures ahead of them. My daughter has been here since 1.5 yrs old and she’s well prepared for Kindergarten, as she asks to be quizzed in the car daily on math, science, spelling, and most importantly her facts on the Lord!! Thanks to all the staff and their love for our precious little ones, we as parents never had to worry a day she’s there. Thank you!!", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "111525890168679962999", "name": "Catherine", "time": 1551399125597, "rating": 5.0, "text": "My son has been going to this school since he was 11 months old, he’s been in 3 classrooms and all the teachers have been incredible. The staff is so kind and sweet, they always let us know when something happens to him. He’s so well taken care of, I wouldn’t want him to be anywhere else!", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "112147048019439728339", "name": "Adam Owens", "time": 1551380197758, "rating": 5.0, "text": "My son has been going to this daycare for over 2 and a half years and we love it. I have always enjoyed spending time with my son so it is not uncommon for me to him off in the morning and stay for 20 minutes or longer to hang out with him and his friends in his class.  The teachers have always been appreciative of me spending time with him and when he was younger, I would stop by at random times without warning just to check on him, to see him and was always greeted and got a chance to know his teachers. I have appreciated the curriculum because my son always comes home having learned new words, colors, shapes or just singing a new song. He loves to go to school and loves to be with his friends. All the kids I see usually are really happy and smiling. He moved up into classes with older kids at times which I appreciated because in order for him to learn to crawl or even walk, it was helpful for him to see other kids who were already doing those thing so he could mimic what they did. We love the staff and the hours and I feel confident that he is taken care and truthfully the teachers as a whole are not appreciated as much as they should be because it's a hard job and not everyone can handle that stress. We have recommended this school to numerous friends who have their kids now and it is nice for us to watch them grow up together.", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "110056607960264182440", "name": "Latraunda Smith", "time": 1500390052723, "rating": 4.0, "text": "My Daughter has been here since she was 8 months old.  She likes it and enjoys her little friends. I can tell she is learning so many different things. I really appreciate the meals they provide they are well balanced and fresh!", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "103454785843009009204", "name": "Rachel Samuel", "time": 1465785111671, "rating": 5.0, "text": "Wonderful people, excellent school. Both our kids went there for 3 months and loved it. We had to change only because it was way too far for us and if they open a branch in Hoover, it would be amazing.\nMr. Chris is very supportive and really good with kids. They personally know each kid and how their day was. A special mention and a big thanks to both teachers, Miss Kendrika and Miss Taylor. Our babies still miss you guys. God bless you people for all the good work you do. Thanks", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "108549760505356603610", "name": "Joshua Perry", "time": 1570222968254, "rating": 1.0, "text": "This daycare is below standards in the personnel running this daycare and its staff. Unprofessional and unclean. This is more like a place to drop off your children to be babysat than to learn and grow. The rooms are small and the building is old and the staff is very young and unprofessional.", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "110769963648522258386", "name": "Stacey McIntyre", "time": 1464285953813, "rating": 5.0, "text": "Great school for many reasons:  they teach children in a loving way to read,, write, exhibit good character traits, have a love for learning Biblical lessons along with wonderful teachers, staff and owners.  And the cherry on top....at a reasonable price for what all you get!!", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "118248202318085508053", "name": "Autumn Hiett", "time": 1551286822188, "rating": 1.0, "text": "My son is 10 months old now and started at Grace in the guppy class at the Ridge location. We loved the teachers and that class so much. One morning when he was in the guppy class I was dropping off my son and the lead teacher of sea turtles was opening that class. My son had a blow out so the teacher was changing him and I was standing there helping her. As I’m talking to her she is taking his clothes off and then begins to use his outfit to wipe his stool off his entire body. His outfit ended up having to be thrown away because after three washes it was stained. I mentioned it to the admin and the director and nothing was done. Everything was great until he moved up to the sea turtle class. We did not want him moving up to that class because he was only about 7.5 months old. He wasn’t even crawling, but was attempting to crawl. They kept pushing me to move him up even though I expressed my feelings towards it several times. They stated he was “too big” for the guppy class and he couldn’t fit in the swings anymore. He was a 7.5 month old who couldn’t even crawl, in a class full of 1 year olds who are walking. After he moved up to the sea turtle class we started having issues instantly. The lead teacher would tell me what to do and not to do with my son. He came home with three knots on his head over the period of time from when he moved up until this week. Nobody called me to inform me that he had hit his head either. When I picked him up the teachers or admin staff would state they didn’t know how he got the knots and bruises on his head. Also, every day when I pick up my sons nose is crusted with snot. It clearly hadn’t been whipped off all day. His clothes would be covered in the foods they had eaten that day too. Several times I would have to change his clothes and clean him up before leaving because he looked so bad. On many occasions he came home with 3 out of 4 bottles still filled with formula that I had pre made that morning. The teachers would state he refused to eat. Let me mention that my now 10 month old is 27 lbs, he doesn’t miss a meal. When I would pack his bottles up to leave he would get so excited like he wanted one, so I would give him one and he would drink it so fast like he hadn’t eaten all day because he hadn’t. They only gave him one bottle for an entire 10 hours. When my son was close to 9 months old he came home for a week straight throwing up randomly and having bad stools. I finally took him to the doctor thinking he was sick. I came back to the daycare the following week and told his teacher that his doctor said he was fine. That is when I find out that his lead teacher had been giving him whole milk with his formula without asking me or even telling me for an entire week. What if my kid was allergic or I didn’t want him to have milk? The doctor even recommends children not have whole milk till they are a year old. I expressed my feelings towards her stating all my concerns about it and she states in that class they train the children on whole milk. I told her not to give it to him anymore but I would find out from the other teachers that she continued to give it to him. One day I had to pick my son up during nap time for a doctors appt and she told me to shhh that I would wake the children up. Let me mention I was whispering asking how my son was that day. The same teacher has gotten a stern tone with two of the other kids in his class while I was in there talking to her during drop off, so it makes me wonder how she is talking to my son without me there. These are only a few things that have happened. The director was aware but never did anything about it.", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "114329012990978862549", "name": "Jenifer Phelps", "time": 1472481050331, "rating": 5.0, "text": "Wonderful place! Our daughter loves it here. She is always talking about her school now. She's learned so much since she started. She talks about all her friends, water day, her teachers, and about the songs and lessons she's learned at school.", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "103030316341926541305", "name": "Melissa Jackson", "time": 1551402400626, "rating": 5.0, "text": "Great place to work!!!! Great place for your child/children!!!!", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "105483069876778988960", "name": "Ray Reynolds", "time": 1576602778476, "rating": 5.0, "text": "Love this school. Great staff, amazing teachers, and a quality Christian education.", "pics": null, "resp": null, "gmap_id": "0x889a127ebf24b839:0xe5efd749cedd96ca"}
{"user_id": "117352807249681764049", "name": "Anthony Chaney", "time": 1523808369175, "rating": 5.0, "text": "Great school. We have notice a big difference in my sons education. The teacher actually take pride in what they do.", "pics": null, "resp": null, "gmap_id": "0x889a127ebf24b839:0xe5efd749cedd96ca"}
{"user_id": "110699672722625420488", "name": "Lindsey Chaney", "time": 1524581393682, "rating": 5.0, "text": "5 stars hands down! Our son has a health condition and also struggles some academically. We had him in public school for over 5 years and LOVED the school he was in, but it was growing so large that we felt our child was being left behind. We decided to set up a meeting with the SCA principal so that we could learn more about the school. We left with great feelings and knew that this would be our son's new school! We have now been there for 2 years and don't regret a thing! Our son loves this school and so do we! If you are looking for a positive change in your child's education, then I highly recommend SCA!", "pics": null, "resp": null, "gmap_id": "0x889a127ebf24b839:0xe5efd749cedd96ca"}
{"user_id": "115962875381002071652", "name": "Eliception", "time": 1506530349767, "rating": 5.0, "text": "Amazing, quality, Christian school. One of the best, if not THE BEST.", "pics": null, "resp": null, "gmap_id": "0x889a127ebf24b839:0xe5efd749cedd96ca"}
{"user_id": "102983302357433380450", "name": "Isaiah Edwards", "time": 1557945707563, "rating": 1.0, "text": "Mediocre at best. Left a bad taste in my mouth.", "pics": null, "resp": null, "gmap_id": "0x889a127ebf24b839:0xe5efd749cedd96ca"}
{"user_id": "113611238282488352674", "name": "Jennifer Turner", "time": 1627397363143, "rating": 5.0, "text": "My daughter attended public school and was struggling in reading and the school kept pushing her along as she fell further behind. We were losing hope and came to tour the school and fell in love with the beautiful campus and classroom environment. At the time I knew little about the Montessori method of teaching but knew my daughter needed a different approach. My daughter has excelled in this environment and is now reading above grade level. I love this school and it was well worth the sacrifice to drive 30 minutes to get her to this school. The teachers are amazing and care about the success of each child.", "pics": null, "resp": null, "gmap_id": "0x88893d2553bb505f:0x7a041fc9ebf50993"}
{"user_id": "100028200474431300602", "name": "Carolyn G.", "time": 1624989854580, "rating": 5.0, "text": "Bruno Montessori is truly an incredible Montessori school.  The teachers and staff are both friendly and professional. The open campus is beautifully maintained and has multiple outdoor classrooms.  There is a wide range of enrichment activities offered. My two children received a top notch education that set them up for success. I highly recommend Bruno Montessori.", "pics": null, "resp": null, "gmap_id": "0x88893d2553bb505f:0x7a041fc9ebf50993"}
{"user_id": "114294522959417669081", "name": "K Smith", "time": 1569594761087, "rating": 5.0, "text": "We were incredibly fortunate that our son was able to attend JBMA from his enrollment in the toddler program at age two until his graduation from eighth grade. The faculty and staff are talented, compassionate, generous, patient, and endlessly supportive. The educational programs and class trips are first-rate. The facilities and grounds are wonderful. JBMA was—and always will be—an instrumental and profoundly positive component of our son's life, and we are forever grateful.", "pics": null, "resp": null, "gmap_id": "0x88893d2553bb505f:0x7a041fc9ebf50993"}
{"user_id": "109589493728875844803", "name": "easy e", "time": 1610780720348, "rating": 1.0, "text": "bad school its not safe for students", "pics": null, "resp": null, "gmap_id": "0x88893d2553bb505f:0x7a041fc9ebf50993"}
{"user_id": "109701567578557362161", "name": "Miriam Anderson", "time": 1460235704404, "rating": 5.0, "text": "I went to school here and the experience was wonderful! The teachers are patient, kind, and very helpful. Montessori teaches not just academics but important life lessons. I would definitely recommend this school to anyone! :)", "pics": null, "resp": null, "gmap_id": "0x88893d2553bb505f:0x7a041fc9ebf50993"}
{"user_id": "114439235087587669411", "name": "Ragav Baskar", "time": 1527221101832, "rating": 5.0, "text": "I can't even describe how amazing this school is. If you here you are really lucky. Best school I have ever been too.", "pics": null, "resp": null, "gmap_id": "0x88893d2553bb505f:0x7a041fc9ebf50993"}
{"user_id": "111418896220350394606", "name": "Dana Maxfield", "time": 1394735435102, "rating": 5.0, "text": "Both of my girls went here and the vision of Joseph Bruno Montessori Academy is to provide children and families with an education according to the Montessori philosophy and curriculum. JBMAs focus is not only to provide cognitive education for its students, but to also model a commitment to creating peace and care for the environment for years to come. In theory and practice, they explore how the traditional Montessori curriculum can be combined with current best practices in education as well as technological advances in order to develop a successful group of 21st century learners. JBMA treats each child as an individual, building on their strengths and abilities to become life-long global learners. I could not have been happier with the education and social skills my girls developed at JBMA.  They are now on their way to exploring what else the world has to offer them.", "pics": null, "resp": null, "gmap_id": "0x88893d2553bb505f:0x7a041fc9ebf50993"}
{"user_id": "111214276239609077278", "name": "RagavBaskar", "time": 1488242987706, "rating": 5.0, "text": "Best school ever", "pics": null, "resp": null, "gmap_id": "0x88893d2553bb505f:0x7a041fc9ebf50993"}
{"user_id": "109091072104947311966", "name": "Spencer Goodwin", "time": 1617049474386, "rating": 1.0, "text": "loved the teachers i had when i attended, but the people running it dont care about anything other than the money you donate.", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "113183761402940415429", "name": "Alan Broom", "time": 1590566549417, "rating": 5.0, "text": "Growing up “local” we all knew of Lyman Ward Military Academy. Our girlfriends swooned over the sharply uniformed cadets at the theater on Friday nights. Best to go on Saturday night! Or perhaps it was our parents telling us they were looking into it! All of my “local” buddies will understand that. Well friends, I finally made it. My dad would be so proud! Everyday I go to the beautiful campus of The Southern Preparatory Academy. It’s not at all the place I pictured when dad threatened. As a man, it is a place I wish I had experienced in my youth. As a father, it is a place I wish my son could have experienced. The keys to success exist in this place; delivered by some of the finest people I’ve ever known. I consider my part of this mission a privilege and I wish EVERY American male had the opportunity to experience Southern Prep.", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "115945851910430300679", "name": "Craig Cochran", "time": 1570161386622, "rating": 5.0, "text": "There is simply no institution anywhere that cares as much about the development of young men as Southern Preparatory Academy. The staff are 110% dedicated to the success of the cadets. I can confidently say that Southern Prep changed my son's life, and he will never forget the valuable lessons he has learned.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNjdwBr4CI9JmEHbQbajHUFFeAMN4-kFF20tl2W=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "113686125083898738227", "name": "Brandi Cherry", "time": 1588273393828, "rating": 5.0, "text": "Such a great, positive environment for young men! I can't say enough about the staff at Southern Prep. They genuinely love these boys and want the best for them! I continue to see great things happening on campus... i know these things wouldn't be possible without the leadership and staff at Southern Prep. Their dedication to Southern Prep and these young men doesn't go unnoticed.", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "108527121004674042617", "name": "Mitchell Hicks", "time": 1610429808530, "rating": 5.0, "text": "I went to LWMA in the same years that two gentleman who have left bad comments about hazing and other stuff like fighting. I was small and not that tough when I got there but absolutely nothing happened to me like that. I learned so much about life and how to be a person that people would look up to and how to be a leader and live life responsibly. I was there with Col. Bill Jenertte who, even after I Graduated stayed in contact and anytime I was in a fork in the road after I graduated I could call him and if he didn’t answer he would call me back or if he was busy another staff member would call me back and they all remember their students. They saved my life. I graduated as the Battalion Commander and I started there like everyone else, a scrub. I went through leadership trading and left at the top of the ranks. I loved that place so much some weekends when we had the opportunity to go home for open weekend I would choose to stay on campus. And I’m from Destin Florida where it’s warm and I could go on my dads boat and jet skis and have a great weekend but LWMA became a family to me too that some weekends I would want to stay there. If I could say one thing with 100% certainty is that if I never attended LWMA I honestly know I wouldn’t of been able to have the life I have now and I sure wouldn’t know how to live life with character. I live by a cadet code. That is\nTo be faithful, honest, and sincere in every act and purpose and to know honorable failure is better than success by unfairness or cheating.\n\nThat cadet code has made it possible to now own a house and own two charter boats and I also have a 500 Ton captains license. I have a baby on the way and I was just telling my wife that I would love to drive up there this year to visit the campus.\n\nLong story short: Every teenager should go because it would save their lives and the education they would get with the sports and the more one on one with teachers can not compare to any other school in America. I am forever greatful to LWMA. And bad reviews left on LWMA is from kids that probably never had the mindset to become a better person", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "101426413357085277464", "name": "Jill Jones", "time": 1581654759739, "rating": 5.0, "text": "Southern Prep is an all-male military boarding academy serving grades 6 through 12.  If your son needs more structure and self-discipline, this is the school you are looking for.  While they offer sports, technical training, aviation, and a college-prep curriculum, it is the expectation of excellence, accountability, and self-reliance that sets Southern Prep apart from other schools.  If your son is going through the mine field of adolescence and you feel he is not living up to his potential, let him attend Southern Prep. Get him away from those unnecessary distractions and go to a place where boys learn what it takes to succeed in life and become successful young men, whether that be in college, the military, or a career. The life skills they learn at Southern Prep Academy will serve them their whole life.", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "101117721856737194944", "name": "Morgan C", "time": 1583447041223, "rating": 5.0, "text": "I have worked at Southern Prep for a little over 6 months, but it only took me a few days to realize how special this academy is. I have seen many boys transform and discover their potential while forming bonds that will last a lifetime. I definitely recommend sending your son to Southern Prep!", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "100630632196107868363", "name": "Kimberly Wicker", "time": 1583263052400, "rating": 5.0, "text": "I have worked in the education field for 15 years and this will be my 3rd year at Southern Prep. I feel beyond blessed to have this opportunity to work in a place that goes above and beyond for each one of the boys that steps onto this campus. This is an amazing school that offers so many opportunities for young men to become our future leaders.", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "117121430949934026368", "name": "Bobby Alaimo", "time": 1580603039057, "rating": 5.0, "text": "Lyman ward Military Academy saved my life...\n\nI was born in Brooklyn New York and raised in Miami during the 80s and 90s.\n\nLyman ward guided me into becoming the man I am today, a Combat Veteran with a distinguished record, and a proud father of two beautiful children.\n\nI give special thanks to Col. Jenrette and 1st Sgt Frank for believing in me from day one.\n\nGo Rangers\nClass of 1994", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "110838464403001586356", "name": "Darrel Davis", "time": 1598830833307, "rating": 5.0, "text": "I attended in 1980. Still draw upon on the code of conduct I was taught there.", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "101761362408903554398", "name": "Pamela Webber", "time": 1583268627206, "rating": 5.0, "text": "Southern Prep has a community feeling, which is one of the things I love about this school . Teachers care, classes are small, the boys become brothers and life lessons are learned.. Im honored to be a part of this school and family!   A great place to bring your son to learn!", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "107792835584663257086", "name": "Matt Bristow", "time": 1589322422878, "rating": 5.0, "text": "Southern Prep is an awesome school. They do a great job of preparing future leaders!", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "102875758039047157058", "name": "Matt Bristow", "time": 1589321686120, "rating": 5.0, "text": "Southern Prep is an awesome school. They do a great job of preparing future leaders!", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "100097158329207682396", "name": "Jeremy F", "time": 1580597401384, "rating": 5.0, "text": "This is an amazing school for growing future leaders of the world. I graduated from here in 1995 and it prepared me to be a strong leader in so many ways.", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "108590896605694022442", "name": "San Geronimo", "time": 1565050933702, "rating": 5.0, "text": "I attended the academy from 1977 to 1982. The experience I gained at the school prepared me as a young man for the future. I look back at my days at the academy and think how fortunate I was to have attended such a wonderful school.", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "111187521635731754060", "name": "Cole Leonard", "time": 1582125679405, "rating": 5.0, "text": "Incredible school. The transformations that take place are awesome  to see in all of these students.", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "103821641130331056023", "name": "Brian S", "time": 1554415025337, "rating": 5.0, "text": "I had an awesome experience while attending 1981-83. It gave me a solid foundation for LEADERSHIP, character, honor, and other dimensions that you rarely find at other public or private schools. I only wish that we had the Aviation program during my day.", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "108665293135315846599", "name": "Cole Boston", "time": 1500000630410, "rating": 5.0, "text": "I attended Lyman Ward my Junior year and for the following Summer School Program. My experience at the Academy was life changing! Not only did their rigorous classes and committed teachers help me realize my academic potential, the staff in the Military Department taught me the virtues of leadership and instilled within me a moral code to keep myself on the right path! During my time at the Academy I played football, basketball, and soccer. Our team even went to the State Championship! I also was a member of the elite Sword Drill team. (Video of Sword Drill performance on their website! Check it out!) Some of my bests friends that I have today I met at the Academy, but sadly I see other classmates of mine posting troubling reviews that are untrue as I was in attendance at the Academy when they were. These individuals never took hold of the great opportunity that they were given at the Academy and were consistent trouble makers that refused to use their great potential for good. I highly recommend Lyman Ward Military Academy to youth that want to step past their traditional peers and set themselves on the path to excellence, and for parents who want such for their children!", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "102146873412660586309", "name": "John Sheveland", "time": 1456778236428, "rating": 5.0, "text": "My son went from being a lost boy into a fine young man under the care of Lyman Ward. He attended Lyman Ward for six years and through their support and guidance he is now enrolled in a University and has even made the President's list (top 5 in the school). I know it may not fit every student but those students needing structure and discipline, Lyman Ward made a positive difference in my son.", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "111160247266620542326", "name": "James Ezell", "time": 1497977898996, "rating": 5.0, "text": "This has been a fantastic school choice for us.  Lyman Ward has made a tremendous difference in my son's life.  He is thriving in the structured environment, his grades are improving, his attitude about himself and others is improving, his dedication to self improvement and forward thinking is something I am most proud to see in him... all because of the great folks at Lyman Ward Military Academy!", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "110558071407458563917", "name": "leslieyoung1972", "time": 1449290273782, "rating": 5.0, "text": "Best decision we ever made sending our son to Lyman Ward. The academic  faculty are very caring and helpful. The Dean has been a role model and very helpful to our son. He is graduating a year early.\nIt's turned our son into a polite, responsible, focused young man.\nThank you........!", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "101228773476883330771", "name": "Mark Morgan", "time": 1583268187376, "rating": 5.0, "text": "Southern Prep works hard to prepare young men for the work of life.", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "117335753467595647401", "name": "Christian Weckwert", "time": 1464575826572, "rating": 5.0, "text": "While my time at Lyman Ward was definitely hard at times, now that I have graduated and entered the world as an adult, I now see that this school was a blessing to me, whether I knew it or not while I was attending it. I went through hell at times, being challenged mentally and physically until I was at my breaking point. While I wouldn't want to go through it again I am grateful I went through it. I wouldn't be the person I am today if I hadn't attended. I truly appreciate ALL faculty, staff, and cadets that made this life changing experience for me.", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "104898643122364254819", "name": "Alejandro Ubilla", "time": 1559528362469, "rating": 4.0, "text": "I learned a lot attending LWMA. Good friends and good staff.", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "103400054636662856087", "name": "Terry Trey", "time": 1565639579067, "rating": 5.0, "text": "Learned so much from this Academy. I'm a former Cadet/Student and loved this school and it's Campus! Learned Discipline traits and Life Skills that I use even in my life as a Student at The University of North Carolina @Charlotte.Graduated with Honors from Junior College and I attribute my 3.65 GPA to Southern Prep Academy. I learned Study Discipline and had the best teachers who were great in teaching. The love I received from this Academy and the Discipline will always be with me and I cherish my experience @Southern Preparatory Academy. U will read some of these reviews from former Cadets who turned out to be Sour Apples but im one of the Former Cadets that LOVED Southern Preparatory Academy and am Taking what I learned there to my advantage.I just graduated with Honors from Junior College and am a 2 time Army Achievement Medal Awardee in the The U.S. Army. I will always look back on this school as the School that shaped me into a WINNER:)", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "101234473910962252992", "name": "Jared Norrell", "time": 1463521365995, "rating": 5.0, "text": "My two sons attend Lyman Ward and I could not be happier with the men they are becoming.  Take some time and look closely at the school.  Don't believe all the hype out there on the internet that is being posted by bitter, unsuccessful people.  There are thousands of young men that have passed through the ranks of the Lyman Ward Corps of Cadets and gone on to be extremely successful in almost every walk of life.  Fact of the matter is, most of the people putting negative things out there about the school really don't like themselves.  I know for a fact that one of the gentlemen that posted a negative comment here should have been arrested but instead the administration just kicked him off campus for his own benefit...and yet he is still spiteful.  Is Lyman Ward for everybody?  Absolutely not.  The academy has a great mission and a wonderful staff that truly care about the boys there.  Simply put, Lyman Ward Academy turns boys into respectable men that any parent can be proud of....", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "110199051630334676234", "name": "Nick Myers", "time": 1551623033919, "rating": 5.0, "text": "I attended and graduated from Lyman Ward in 1980.  My brother also attended but withdrew so I can honestly say that LWMA is not for everyone.  The school provides the environment and tools but as well know some teenagers will conform and some are unable to change their ways.  The school isn’t there to raise kids but to grow them, raising children will always be a parents responsibilty.  Again, the school isn’t for everyone but can be a positive influence for those who do stick it out.", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "111801445671833196923", "name": "Wilson Scott", "time": 1500995730670, "rating": 5.0, "text": "I am very proud to say I attended Lyman Ward for 5 years of my teenage life. I give this school full credit for making me the man I am today. There is no telling where I would be now if I had not spent those years there. Thank you LWMA!!!", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "118288074813690188756", "name": "Stanley Chapman", "time": 1368059411540, "rating": 4.0, "text": "I had read many reviews prior to sending my son to this school.  Some reviews were bad and a few were good.  Well, I have decided to share my experience as a parent.  I have been very impressed with the people who help run this school.  I have visited the school and engaged cadets there in open and honest discussion.  I agree, the school can be very difficult for students who are very determined NOT to make an inner change and correct incorrect behavior.  There is a chance that your child may not change, but I feel it is very slim.  Many of the students will tell you that it is not helping them and they have not changed but that is just so that you will bring them back home.  If you stick with it, you will notice a change in behavior regardless of what they will try to tell you.  The school has been very open and honest with me.  Even when the biggest misfortunate event took place this past semester, they kept every parent informed continuously and immediately.  The price is somewhat high, but if you can somehow afford it, even one semester is worth it.  I wish the school was somehow more affordable because there are many young men out here whose lives would be saved and changed for the better.  If you have a troubled teen, you can either do nothing (which can eventually lead to jail or the grave) or you can make an attempt to correct their path and possibly save them.  Sending your kid here does not promise to save your child, but if the worst is eventually going to happen(fate), you would rather look back later and know you did eveything you could have done.  Even though it was a difficult decision to make, I am glad that I sent my son here.  I will more than likely enroll him back into the public school system next semester.  He may not be perfect, but I feel confident that after going to this school this semester, he will not get anywhere close back to the person he was.  If he does, I know the doors of Lyman Ward are still open and the people there will be willing to help.", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "105561838847067109421", "name": "Angela Murray", "time": 1500865401059, "rating": 5.0, "text": "My two sons currently attend LWMA and it has been a life changing experience for both of them. They are thriving academically and athletically and are becoming two incredible young men to be very proud of as adults! This is an amazing institution and serves many young men well now and has done so for several generations. I think as parents we must be careful when looking for educational and \"life\" opportunities or options for our children that we are careful to dig deep and do research to validate the opinions and statements being posted on the internet or in print. There have certainly been times when my boys weren't \"happy\" at school, but that's the hard part of being a parent... actually being a parent and not always a friend.", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "111017948895472459779", "name": "Trina Barrett", "time": 1497915285218, "rating": 5.0, "text": "My son went to Lyman Ward. Due to his own issues, he did not complete the program. However, I credit LWMA with saving his life and getting him as far as went. If you have a son who is need of redirection, please consider this school. Disgruntled former students have posted some bad reviews. This is a military school, aligned with the Army Corps of Cadets. They do not go easy on the boys, but \"easy\" is a sure ticket to a hard life. Many kids have gone through this school and turned everything around. They are productive men, fathers and husbands, who would have had a very different outcome with out LWMA.", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "109742934740902592449", "name": "Steve Trowbridge", "time": 1498087782230, "rating": 5.0, "text": "Great experience there as an adolescent. Got my grades turned around and met a lotta good friends in process.", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "108587285300934146322", "name": "Randy Lee", "time": 1475162821201, "rating": 5.0, "text": "Great school close to where I grew up and currently live in the Alexander City / Lake Martin region.", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "111900055240550419031", "name": "Webb Adams", "time": 1380040317231, "rating": 4.0, "text": "I've read reviews of Lyman Ward Military Academy, some good, some bad. Most of the good ones come from parents who have seen their sons change and learn discipline and respect and attitude and improvements in their grades. Most of the negative ones have come from the cadets themselves though some of these are also positive. I am an alumus of Lyman Ward. To be truthful, I didn't like it when I was there. I hated being uprooted from friends and family and stuck in an all-boys school 100 miles from home. In my case I was sent there because my dad had always wanted to go to a military school when he was growing up so he gave me the opportunity that he never had. (Thanks Dad.) I don't know to this day whether Lyman Ward helped me or not. I was not a bad kid, I didn't get in trouble and I made decent grades. But I know that it helped the vast majority of boys that I went to school with, most of whom had a choice of military school, reform school or juvenile hall.\n\nWhat I know about Lyman Ward is that it's hard. It's hard being taken from everything you know and placed among strangers. I also know this. There are many young men who would not be where they are today if it were not for their parent's courage to send them to Lyman Ward. I also know young men who would not be alive today if not for the discipline of Lyman Ward.\n\nLWMA is an extremely hard experience but most students come out of that school with a love that is hard to explain except for the pride of what they endured and accomplished and the men that they have become.\n\nIf you have a son who is struggling with his life, Lyman Ward may be the answer that you are looking for. I disagree with those who would put their son here for a semester or a year unless they only have one year left. The longer they stay, the more they will grow into young men that you can be proud of.", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "115523831488068698086", "name": "Holli Renfroe", "time": 1483987258001, "rating": 5.0, "text": "I have been working at Lyman Ward now going on three years. I came to the school straight out of college. Needless to say, it took some time getting use to. When I first drove up for my interview, I immediately wanted to drive away, but something made me stay. I'm glad I did. By the end of the day, I was completely enamored with the school, the people, the landscape....all of it. There are going to be ups and downs at every school. We have and continue to work through our troubles just like an other institution. But the thing I wish more people could understand is that when students get sent to us, they don't stay students for long. They become family. Sometimes we have kids who go here from sixth grade to twelfth. Some of the kids have even been here longer than me. They feel like a part of the place, and when they leave, they take a piece of it with them. I hate to see them leave, but I am glad because I know we have done everything we can for them in order to teach the to \"walk of life.\"", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "109855177615073702603", "name": "Dwight Michael Logan", "time": 1501086839234, "rating": 5.0, "text": "Most people's bad expierences or what they at least claim from here is because they didn't want the choice of making the best of a life changing opportunity right in front of them but luckily I was one to change my ways & my life, at first I hated it because I thought I was right about everything in life & I didn't know what the school was about or what it could do for me, my parents & I didn't get along at all & I didn't have a single ounce of respect from them. After a month of being stubborn at the school I came to realization that it was time to grow up and try to see what I could do with the opportunity.. I took full advantage of it. I completed AP psychology with a 90% overall along with making the President's List (grades I had always wanted but always came up short in public school) I started the school first track & field team ( accomplished a state championship) & joined the prestigious Sword Drill team only other performed by The Citadel, my parents & I came together soon & now I have their absolute & complete respect. My 2nd year I chose to go back because I loved it, realized I needed it, & I could do so much more with my accomplishments. To put it short I was a Cadet Captain & Company Commander throughout the year, I made the President's List all 4X, I got a scholarship to Marion Military Institute (50% Tuition). The place is challenging but it's amazing what it presents, you have to want it & make the most of your potential, it changed my life & I have a band of brothers that will be friends for a lifetime, it's brought out confidence & strength that public school couldn't & all I have to say is for those who want a great challenge with great rewards come here & remember anything easy isn't worth having.", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "101317105190088145183", "name": "Nathan Shipman", "time": 1418604876475, "rating": 3.0, "text": "I went to Lwma for the 2013 year and if what the guy in the review after this said was true its gone downhill. Yes we had great faculty and staff but the students were horrible. I was in 7th grade and I was constantly running from people trying to beat me up for either anger that was being taken out on me or just plain for fun. I would not suggest sending your kid here if they aren't tough and big people. But even after all that I got a really good education. My grades went way up and the teachers were really nice. Over all I give Lyman ward a 5 out of 10.", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "116575556928988459232", "name": "Mostapha M. Howaidy", "time": 1501124757002, "rating": 5.0, "text": "I'm 40 now and my experience at LWMA remains the most valued in my entire life. It simply prepared me to face the world with all it's difficulties. I'm grateful to everyone at LWMA for their efforts and dedications. Col. Bill Jennerette was an idol and a man to look up to, I miss him. My classmates are still close to each other after 22 years since graduation. We love each other and still connect no matter where we are. Thank you Lyman Ward for being part of my life.\n\nMostapha M. Howaidy (95')", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "108355873359154198468", "name": "Wil Kelley", "time": 1497973161528, "rating": 5.0, "text": "Greatest school experience of my life. Would go again.", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "106468687033993704610", "name": "Brendan Curran", "time": 1458214267409, "rating": 4.0, "text": "So I attended Lyman ward when I was 15. And to be honest I was a complete jack ass and was going to die from drugs or go to prison etc. I was lazy never worked never worked out barley socialized with people and ran with a few bad kids growing up . To make a long story short it was partially my desicion to go . The first day I hated it so much you couldn't understand it was like I was beaten and locked in a room but a few squad leaders and the patlion leader told when you start your a scrub for 28 days and it was honestly horrible i was beaten l. And i kept getting in trouble and wanted to leave. After my 28 days it Sort of mad all sense it was ment to break you down see how much you can take. There was actually very fun memories there it gives you oppertunities to try new things . I played football on a team for the first time. Took tactical tranning and weight lifting. Met some friends that were very nice and still talk to till this day. I was expelled 4 days left for being a dumb ass and picking a fight with someone whom did not deserve it. I was expelled . But the point is last week I thought about it. And you don't realize it while your attending but it was one of the best things to ever happen I didn't realize till a week ago. The on istinct didn't act like a dumbass, didn't do drugs, didn't hang with the wrong people. It was just natrul it just came became a good way of life. I am now 20 years old work as a armed security officer. Starting college in a few weeks and enlisting in the military after college. So again it is a good desicion at the out come. But It is bullshit while attending.  Thank you Beverley, Erickson, King, kernel, and the goodman\nBrendan CURRAN from Boston", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "106750608587480254800", "name": "Robert Bush", "time": 1449274735061, "rating": 4.0, "text": "I attended lwma for 5 years class of 2014 graduate, lwma was a great experience for me the staff trully care for you, tough love is a daily...but its just that...tough love. The memories you make at lw will be apart of your life forever shout out to miss baker and dean damron thank you so much for helping me graduate a year early", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "102044499627908562431", "name": "Sheila Watts", "time": 1425497937940, "rating": 1.0, "text": "Jeff Damron has absolutely no business working with young people.  He is abusive and has caused lasting psychological damage to students.", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "111619546905531449635", "name": "Unknown Unknown", "time": 1499269619968, "rating": 1.0, "text": "This school help me lose weight it was okay school but it was really really dirty and a lot of roaches in the barracks the food was not good all the time they gave us moldy pastries people got their shoes stolen people getting beat up couple kids killed their selves a lot of disrespect a lot of cussing a lot of the staff members putting their hands on some of the cadets which is not supposed to happen every time they did like at or they will make us like like nothing was wrong in the school was good it's also a lot of races that goes on that that's cool they don't tell you what your kids going to go today only tell you that your kid is not going to be able to talk to you for 28 days but that's not all that happens I would not recommend there school for anybody that's looking for military this is not a good school at all", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "106017877215373898597", "name": "Daniel Kent", "time": 1497924702202, "rating": 1.0, "text": "My experience was bad. A mixture of hazing and lack of awareness on a TACs position makes this school a dangerous environment for a growing mind.", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "114062865590110204970", "name": "Vicki Wade", "time": 1583931860473, "rating": 5.0, "text": "Love this school!!", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "115416032173439381560", "name": "Kenneth Nolen", "time": 1582078177766, "rating": 5.0, "text": "Good School", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "109477918758622230544", "name": "ALAIN SFC", "time": 1501174256553, "rating": 5.0, "text": "Change my life for good", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "106004062889077712487", "name": "Samie Granger", "time": 1545309931583, "rating": 1.0, "text": "Horrible camp experience, not a camp but a prison", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "113135145706714164667", "name": "Tim Niles", "time": 1543852913719, "rating": 1.0, "text": "One of the worsts schools in America.", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "110632275922925088237", "name": "Ephesus RH", "time": 1495630728539, "rating": 1.0, "text": "This place was and still is the worst school.", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "100673650345009130896", "name": "ben callahan", "time": 1582946708569, "rating": 5.0, "text": "LYMAN WARD", "pics": null, "resp": null, "gmap_id": "0x888c633de0bee293:0xb7186d4ccab73737"}
{"user_id": "117550390449760843597", "name": "Cheryl Ingram", "time": 1556197477528, "rating": 5.0, "text": "My daughter is so happy at this school. She is making real friends and succeeding in a supperior education. The best part of her experience is the genuine Christian Brothers and Sisters in Christ. Do you want the same values taught at Home and Church to continue at School? This is the School for your Children. Check them out on May 6th at 6:30pm for an Open House to learn about every aspect of this amazing school. Academics, Sports, Invested Parents, but most importantly; Christian Education.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPj2dH2C23kLUd4VrHf1v2BN429ip9dzhjRi437=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPR6kVtwdrQbmsZli82USvPNR8kmMT-6G6QbCqq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPGdeeWdTT2wli_e6_u4uxf5ZPJrOJQVey4Q8nu=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMmXIdwXWlQ91Q7Q5DGMrMYhoOWT4PAs9a23CBr=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOxm-fkWwicifg1Y9NWtZ8UFaugEdaR9tvjfIR6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNVwixK-nlC-3WxcewCVsEk94r7aSvjOYTZwxQ4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP5Tx5LGNUVGsrKgvX1OhSsHUdkqu7oi_iCozzJ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPRTWz-i4hoDQndYShSVlvsqNnebvyno6gurlTx=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
{"user_id": "105665355440873872790", "name": "Angela Bevelle", "time": 1578439707588, "rating": 5.0, "text": "I have two children at Heritage and the love that the teachers display and pleasant peaceful atmosphere that the director Larkin gives is awesome. It really puts me at ease with leaving them with loving compassionate people. May God continue to Bless all the employees at Heritage.", "pics": null, "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
{"user_id": "109757775629335565337", "name": "Monica Rayford", "time": 1554562582122, "rating": 5.0, "text": "Great Christian based school with loving and caring teachers and staff. My son loves attending and we are overall happy with the education he is receiving. I love the fact that the school is conveniently located near our jobs which makes it very convenient for us.", "pics": null, "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
{"user_id": "114574832366244275823", "name": "Brad King", "time": 1554144397483, "rating": 5.0, "text": "I have 3 kids that attend Heritage Christian Academy.  My family and I love the fact that we feel like the school and the teachers are partnering with us in both educating our kids and nourishing them spiritually.  We love the fact that they are seeing the Gospel lived out through their education and are being prepared to enter adulthood with a Christian worldview.", "pics": null, "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
{"user_id": "110781816636208325133", "name": "Mick Vigneulle", "time": 1554338452119, "rating": 5.0, "text": "Our family has had 5 children graduate from HCA over the last 2 decades. The headmaster is providing outstanding leadership and there is an excellent sports opportunity to compete at a very competitive level. The class sizes are perfect for more personal attention from teachers. Students are taught in a safe environment and the quality of education, along with technology, has improved greatly over the years and continue to advance. The teachers are very caring and not only teach academics, but also teach from a Christian Worldview. Our children have excelled with honors and leadership at the University level as a result of their undergraduate foundation. We are thankful to have had Heritage partner with us in training our children to live out their faith in a growing secular society. Thank you HCA!", "pics": null, "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
{"user_id": "105767410147643925364", "name": "Hendrick CDJR Hoover, AL", "time": 1568080690630, "rating": 5.0, "text": "It has been such a blessing to our company to be involved with a school who looks to provide a quality product to our area.", "pics": null, "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
{"user_id": "115740278520844390821", "name": "Corbin Smith", "time": 1552963517086, "rating": 5.0, "text": "I am an alumni from HCA and it has shaped me who I am today. The teachers truly invest their time into the students and care for their education, but also their spiritual lives. I still have teachers email me saying that I am on their minds. I have two younger siblings who attend HCA and I know that they might not realize what they are gaining from this school at this moment, but I know they will be impacted in greater ways than they can imagine. I am prepared both in my education and my spiritual life and I owe it all to the teachers and staff at this school.", "pics": null, "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
{"user_id": "100883706902267156007", "name": "Bill Vandiver", "time": 1458936113693, "rating": 5.0, "text": "I have been engaged and involved with Shades Mountain Christian School in one way or another since 1975.  I'm a graduate and have two girls who currently attend.  It's been so amazing to see how God has used this school over the years to impact kids and families for His kingdom.\nSmall class sizes, godly teachers who really care, excellence in academics and the arts and athletics, and everything taught from a biblical worldview perspective are just a few of the things that makes SMCS great.", "pics": null, "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
{"user_id": "108168543468685485882", "name": "Jon Stevens", "time": 1556196259614, "rating": 5.0, "text": "We love our Heritage Christian Academy school! Our son started when he was beginning Kindergarten and he is now in 5th grade. The teachers are amazing and the leadership is full of integrity. They are all very good at communicating everything all the time to the parents so we always know what is going on. We have every intention of letting our son attend HCA until he graduates 12th grade. We ask him every year if he wants to go back and every year he says definitely YES!!\nWe are praying for you and your family to find this school family like we have. It will change your lives forever!! God bless you all who are looking into Christian education. It is life changing.", "pics": null, "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
{"user_id": "101298697750569988427", "name": "Diane Rigdon", "time": 1554251568724, "rating": 5.0, "text": "We have been at HCA since kindergarten and our oldest is now in 7th grade (youngest is in 5th). We have loved being a part of such a wonderful Christian family atmosphere. We are so fortunate that a couple of friends attending shared with us about the school 8 years ago. The staff loves the Lord and our kids. They are excellent educators as well. We are blessed!", "pics": null, "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
{"user_id": "107544060775041669580", "name": "Debbi Moses", "time": 1554480449704, "rating": 5.0, "text": "As grandparents of three children that attend HCA, we couldn’t ask for a better school, teachers, or atmosphere for them. We are so thankful that they have teachers that pray FOR them and WITH them. HCA is also very supportive of grandparents, having a special day set aside for them to celebrate their grandchildren. We absolutely love HCA!", "pics": null, "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
{"user_id": "100660880957399160385", "name": "Kristen Majors", "time": 1470198740687, "rating": 5.0, "text": "This school not only impacts its students but its teachers as well. Going on my 5th year teaching, this school has become more than a workplace but  my family. It is truly a family-oriented school with loving and caring staff members.", "pics": null, "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
{"user_id": "110909139663330839619", "name": "Jeff Brown", "time": 1554730289763, "rating": 5.0, "text": "My family’s first interaction with Heritage Christian Academy (HCA) was a little over two years ago. Prior to enrollment, my pre-school son was being cared for by family members instead of a daycare. The decision to enter him into a regular kindergarten program was a big one for us, and after considering several options we chose HCA. Some positives for us as outsiders to the school were the smaller class sizes, education from a Christian worldview, AdvancedEd (formerly SACS) accreditation, location and opportunities to continue his education through high school if desired. The end of my child’s second year is approaching, and all of us (including him) are pleased with our decision to select this school. My son has progressed so much over the last two years, and he is still excited about going to school every day. It is great to experience his teachers’ dedication and love for him and his love for them. He regularly talks about school even after finishing for the day. As my son grows older, I look forward to him being able to take advantage of the sports programs, and increasing his participation in the fine arts offerings he is experiencing now. I feel confident he will continue to get an exceptional education at Heritage Christian Academy that will help him develop into a well-rounded individual.", "pics": null, "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
{"user_id": "105500754007228460486", "name": "Gwynne Mountz", "time": 1458263632860, "rating": 5.0, "text": "Our daughter has attended SMCS for two years and she LOVES it here. She has grown so much in these two years academically, emotionally and spiritually. The teachers here truly love their students. We love the small class sizes! They make the learning environment that much nicer. If you're considering a private Christian school, check out SMCS!", "pics": null, "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
{"user_id": "101056136645478624126", "name": "Sissy Spence", "time": 1458230477244, "rating": 5.0, "text": "It has been an honor to work with the faculty, staff and school families at SMCS! I can't wait to see what the future holds as the school prepares for the move to their new facility in Riverchase.", "pics": null, "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
{"user_id": "106557998851713963775", "name": "Josh Cooley", "time": 1441294520071, "rating": 1.0, "text": "I went to this school from kindergarten through high school and it was hell. When I once asked what the difference was between our version of Christianity and others, like Catholicism for example, I was regarded with great suspicion and asked why I would want to know. That is a sure sign of a cult. During my senior year one of our worst teachers took over as principal and redirected the institution from any educational focus to almost purely one long religious pep rally. Time was shaved off of every class time to make room for a brainwashing session in the gym every day. Nearly every one I knew who went to this school was tremendously damaged by the whole experience. Some completely turned away from religion, others fled, and a few actually succumbed to the brainwashing and ended up sending their own children back into the fire. Take it from someone who escaped by the skin of their teeth; do NOT subject your children to this torturous environment.", "pics": null, "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
{"user_id": "100079996005630150015", "name": "Karen Gray", "time": 1548021041976, "rating": 5.0, "text": "Awesome School and Day Care", "pics": null, "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
{"user_id": "103425922334039278433", "name": "Coach Jimmy", "time": 1462893608023, "rating": 5.0, "text": "All my children go here!!! the BEST!!!", "pics": null, "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
{"user_id": "104658162122919928891", "name": "Lance G", "time": 1543685075787, "rating": 5.0, "text": "These folks are awesome Christian teachers.  Outstanding learning environment, with knowledgeable, professional staff. It's clear they truly love what they do. Highly recommended for education of children of various ages.", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "114697395845187932043", "name": "Daniel Stephens", "time": 1505341664159, "rating": 5.0, "text": "Huntsville Christian Academy is an exceptionally amazing school. The individual attention that each child receives is extremely valuable to me as a parent. You can really tell that the teachers love the children and get excited when they succeed and excel in their studies. The volleyball, basketball and other athletic programs are just as good, if not better, than public school. Additionally, the children are encouraged to be respectful, obey their parents and live with integrity. What more could you ask for...?", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "110647012684728898899", "name": "Saul Fitzgerald", "time": 1424099762732, "rating": 5.0, "text": "My son is in his 1st year at Huntsville Christian Academy. The teachers really do a great job of keeping me informed on all of his classes and everything like that. His core courses are good and he also takes art as an elective and really enjoys it. I'm very happy with the school.", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "116002341872662978518", "name": "Vanessa Holland", "time": 1396300191905, "rating": 5.0, "text": "I love Huntsville Christian Academy, because they allow my son to work at his own pace. We have tried other private schools and HCA has been the only school that can challenge him academically. The classes are small and the students really look out for one another. Pastor Reggie is a great mentor and is always willing to the take time to help his students and pray with them whenever needed.", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "102137991271732428918", "name": "benonai", "time": 1485191667500, "rating": 4.0, "text": "School is great for the price. The Pace format makes it tailorable to individual needs. The atmosphere is good for the kids., and they get a strong, biblical message and instruction as well. As they continue to grow, hopefully more extracurricular will be offered.", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "112134165085323540080", "name": "Joshua French", "time": 1426101502509, "rating": 5.0, "text": "I very much like the curriculum here. The school does a good job of instilling a strong Christian learning in their students. The class sizes are nice as well, it doesn't let the kids get lost. Praise God for this school!", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "106974976728860557246", "name": "Marie Glor", "time": 1441049972776, "rating": 5.0, "text": "The positive atmosphere at Huntsville Christian Academy is truly inspiring. My son feels so comfortable and loves going to class everyday. They are doing everything right there, so keep up the good work!", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "116707279910971296921", "name": "Mary McNairy", "time": 1523471347979, "rating": 5.0, "text": "HCA has been a blessing to our family. Our daughter's teacher is wonderful, and the staff is very supportive. Absolutely love it!", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "106864711352567201092", "name": "Thomas Patrick", "time": 1431098319555, "rating": 5.0, "text": "They are serious about instilling discipline and integrity right away. The courses are good, and they actually will take the time to listen to the parents if you have any input on something you think could be done better.", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "108635924084678946297", "name": "Katie Harris", "time": 1400254003175, "rating": 5.0, "text": "My daughter is very happy. But what I really like is that she is getting the best education and that's what matters. She will be thanking me later.", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "115575135178038828992", "name": "Iris Johnson", "time": 1411150827130, "rating": 5.0, "text": "The BEST place for a child to grow as an individual and as a child of God, through daily chapel. Love how the build character, love for our country, morals and standards where needs to be, creating godly leaders for generations to come.", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "100803192768332534137", "name": "XEX archive", "time": 1518126660000, "rating": 5.0, "text": "Hi, im Maddox in 7th currently, I LOVE this school and have been here two years now. I really encourage going to this school.", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "116027043720397694974", "name": "Tina Polk", "time": 1447363745363, "rating": 5.0, "text": "While academics are important, so is the love every staff member has for Christ and the students at Huntsville Christian Academy.  The school has a great atmosphere.", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "112050126462076021683", "name": "Lashay Amore", "time": 1479777899661, "rating": 5.0, "text": "My nephew attended HCA for four years beginning in the 3rd grade, before relocating to California. From the initial meeting with Pastor Reggie, my family knew this was \"home.\"  My nephew felt immediately comfortable with Pastor Reggie, and we knew he would feel happy and safe here. This was of upmost importance, and HCA did not disappoint.", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "107413490365086332014", "name": "Bryan Jennings", "time": 1509851351293, "rating": 5.0, "text": "Im one of the students, and this is probably the best thing that has ever happened to me.", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "117213496544206557870", "name": "Faith Williams", "time": 1505921743096, "rating": 5.0, "text": "This place has been nothing but a blessing to our family!! The school has challenged my son and he has rose to the challenge and excelled!!!", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "104641135686480045396", "name": "Milissa Gainey", "time": 1461426172361, "rating": 5.0, "text": "Love!!!!!", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "104313749927466992488", "name": "Max Reese", "time": 1416345314067, "rating": 5.0, "text": "Huntsville Christian Academy is a school where a student can feel safe without peer pressure of being in unwanted groups; therefore, he or she can concentrate on their academics.", "pics": null, "resp": null, "gmap_id": "0x88626924b3a59901:0x3811a966b3618169"}
{"user_id": "117933292116740353993", "name": "qukipr4", "time": 1454614926794, "rating": 5.0, "text": "We love this school for our children!  The teachers are more than qualified with degrees and certifications.  Our children have and continue to receive a top notch education from these dedicated, passionate teachers.  We love the nurturing environment for our children as well!", "pics": null, "resp": null, "gmap_id": "0x888917feeece9269:0x50cdd0f40b0d52b2"}
{"user_id": "104483053885249004304", "name": "Rob McDonald", "time": 1449109711185, "rating": 1.0, "text": "If you're looking for the \"Montessori\" environment and the caring, nurturing setting that normally implies, don't waste your time here. You might want to ask a few questions like:\n- Is Stonecreek accredited by the AMS (or any recognized Montessori organization)?\n- How many Stonecreek teachers have received Montessori certification?\n- What is the background of the Stonecreek board, it's founders, and specifically it's Educational Director? *Do some homework here; the words \"shocking\" and \"sordid\" still ring in my mind.\n- What's the average tenure of the teachers at Stonecreek? (Hint: Not very long)\n- What's the financial state of this facility, and is it sustainable for the long term? They will likely refuse to address this, but you can find out if you look hard enough.\nIn fact, if you start asking questions like these you're likely to get the \"Stonecreek is probably not a good fit for your family\" type of line.\nIf you're still even considering giving over the oversight and education of your children to this place, you might want to speak with some of the surprising number of teachers who have left, and to the many parents who have removed their children from this secretive and agenda-driven \"school\". They certainly paint a pretty picture, but do your children a favor and take a good long look before entrusting their education and care to Stonecreek. The cover DOES NOT resemble the book.\nKeep in mind that these are my opinions. You should do your due diligence and form your own.", "pics": null, "resp": null, "gmap_id": "0x888917feeece9269:0x50cdd0f40b0d52b2"}
{"user_id": "117078416625055217360", "name": "a nonymous", "time": 1477043883316, "rating": 1.0, "text": "Our family was only at Stonecreek for a very short while, but we have heard many stories from families who left or are planning on leaving. Impatient, inconsistent teachers. Gossiping and cliches among students but even more among staff and parents. We left when our child started displaying negative effects from her time there. Some teachers and families were great, but they left. As another reviewer mentioned, check the tenure of teachers. This is a huge sign. Either mistakes were made when they were hired in the first place or they decided to leave a sinking ship.", "pics": null, "resp": null, "gmap_id": "0x888917feeece9269:0x50cdd0f40b0d52b2"}
{"user_id": "107483576065952024650", "name": "Amanda Miller", "time": 1460481548964, "rating": 5.0, "text": "I am almost moved to tears as I write this review and reflect upon how much Stonecreek Montessori has enriched our family. We moved to Birmingham in 2015 from a small family farm in pursuit of a great education for our then 4 year old daughter. We toured several private schools in the Birmingham area, including other Montessori schools, and were beginning to feel so discouraged. Of course we were impressed by the emaculate facilities and extensive list of extracurriculars at some of the other schools we toured, but there was always something missing. That is until we walked into Stonecreek. It was apparent to us that there was something special happening in this Montessori school that we had yet to find. It is not necessarily something that can be expressed with words, but must be felt with the soul. The atmosphere was buzzing with energy, enthusiasm, and love. We had found our new home. We were so excited to find out that not only was Stonecreek \"ok\" with parental involvement, but they actually encourage it. Parents are given an open door policy, and I have seen it work beautifully. I was also impressed with the credentials of the teachers! My daughter is excelling, and most importantly she is excited and engaged in her own education. I am so grateful for Stonecreek.", "pics": null, "resp": null, "gmap_id": "0x888917feeece9269:0x50cdd0f40b0d52b2"}
{"user_id": "101219156956811700058", "name": "Nathaniel Bray", "time": 1458744173563, "rating": 5.0, "text": "We send both our daughters (one high school and one middle school now; started in middle school and upper elementary) to Stonecreek Montessori and couldn't be happier.  The learning experiences provided by this school, in a small school setting, are remarkable.  There are a couple of things I believe make Stonecreek unique.\n\nFirst of all, its toddler - high school classes are taught using Montessori philosophy and draw on current cognitive research.  The majority of teachers either have IMC or AMS certification.  It is unlike any school I have ever seen for level of attention by the teachers to knowing my children as individuals. My kids learn not only their subjects but also strategies to balance short and long-term projects, study skills, etc., all while being surrounded by high level students performing well in class and on standardized tests. Furthermore, students advance at their own pace although they are pushed as well.  Both my daughters finished algebra before the end of the year, and then they started right into Geometry while in middle school. This allowed them to earn high school credit in 8th grade.\n\nSecond, I have appreciated my daughters coming home and discussing Socratic conversations they have had in class.\n\nThird, my daughters have loved the unique learning opportunities that go well beyond the classroom. Stonecreek students have excelled in these...\n* participating on robotics teams, winning awards all three years\n* earning Duke TIP recognition,\n* winning poetry competitions,\n* receiving regional/national writing awards,\n* being invited to leadership conferences,\n* earning state level debate awards.\n\nMy girls have created meaningful and fun memories from overnight school trips:\n* Cahaba Environmental Center\n* Montessori Model UN in NYC\n* Yosemite\n* Yellowstone (high school trip this spring)\n* Puerto Rico\n* Dismals Canyon\n* Dauphin Island\n* Huntsville Space and Rocket Center\n\nIn short, is Stonecreek going to have the fields and facilities of other private high schools that cost nearly twice as much? No. However, that isn't my main concern for my girls' development.  What they have gotten has been perfect for them.", "pics": null, "resp": null, "gmap_id": "0x888917feeece9269:0x50cdd0f40b0d52b2"}
{"user_id": "106242431505630651154", "name": "Nathanael Renfro", "time": 1447622831307, "rating": 1.0, "text": "Was underwhelmed", "pics": null, "resp": null, "gmap_id": "0x888917feeece9269:0x50cdd0f40b0d52b2"}
{"user_id": "113987111627052615492", "name": "Kristie Sori", "time": 1478139858679, "rating": 5.0, "text": "This is the best school I've ever known. They teach the children so much. The teachers are wonderful and so is the staff. My children and I love this school! :) God bless them!", "pics": null, "resp": null, "gmap_id": "0x888e9b442457b383:0xbd28a06366ee2cb"}
{"user_id": "104285027359998150050", "name": "Ashley Crim- Smith", "time": 1504225140243, "rating": 5.0, "text": "Absolutely, hands down the best school in Millbrook. Mr. & Mrs. Chapman work with kids& their families during what can be rough times; and the curriculum is exactly what some kids need...short& to the point!!", "pics": null, "resp": null, "gmap_id": "0x888e9b442457b383:0xbd28a06366ee2cb"}
{"user_id": "117589987412675463365", "name": "LD W", "time": 1499099620071, "rating": 5.0, "text": "I graduated there in 2008. Yes it's been a while since I've been by there but Mr. and Mrs. Chapman are wonderful people and their teachers are great Christian people who love teaching. They not only teach school subjects but also life lessons. I learned more there in a week than I did in 2 months at another private school. If you want your child to get an amazing, valuable education, then CCA is the place you want to send your child to get his/her high school diploma. Plus, it's only a 3.5 hour school day. They teach core classes as well as Bible each day. Thank you Mr. and Mrs. Chapman for a great education!\n\nDavid Weatherly\nMr. CCA Class of 2008", "pics": null, "resp": null, "gmap_id": "0x888e9b442457b383:0xbd28a06366ee2cb"}
{"user_id": "108661905364744914873", "name": "Alexandria Pryor", "time": 1512052297798, "rating": 5.0, "text": "This is an incredible atmosphere for a child exploring their world. It gives them opportunity to grow and learn what it means to become a good global citizen. It's a wholesome, enriching environment!", "pics": null, "resp": null, "gmap_id": "0x88891a65c4d9e65b:0x7a24f24cc2dd32a9"}
{"user_id": "113189514956067407990", "name": "Phyllis Scalici", "time": 1498157692250, "rating": 5.0, "text": "Wonderful atmosphere for children. The teachers are exceptional, caring, and devoted to these children. I am so pleased Jack's parents chose to send him to this school so his entrance into education will be a positive one.", "pics": null, "resp": null, "gmap_id": "0x88891a65c4d9e65b:0x7a24f24cc2dd32a9"}
{"user_id": "112666881975399713858", "name": "John", "time": 1536636030058, "rating": 1.0, "text": "Our child experienced consistent bullying, which the teacher denied. Do a search for Waldorf schools and bullying, and you'll see what a pervasive issue it is.", "pics": null, "resp": null, "gmap_id": "0x88891a65c4d9e65b:0x7a24f24cc2dd32a9"}
{"user_id": "110405192721185060366", "name": "Ryan Schumacher", "time": 1475611273993, "rating": 5.0, "text": "A beautiful school for our son!", "pics": null, "resp": null, "gmap_id": "0x88891a65c4d9e65b:0x7a24f24cc2dd32a9"}
{"user_id": "108626695024420924146", "name": "J Lynn", "time": 1513583517793, "rating": 5.0, "text": "We absolutely love the Alabama Waldorf school!!", "pics": null, "resp": null, "gmap_id": "0x88891a65c4d9e65b:0x7a24f24cc2dd32a9"}
{"user_id": "111224867586356117488", "name": "Chameka Thompson", "time": 1580237670957, "rating": 1.0, "text": "Freshman year my son was well adjusted finally after not wanting to go then here comes sophomore year (currently). Now he’s popular and well mannered clean and the harassment and embarrassment is approaching fast. He cannot go to class and back home without someone complaining about him! I don’t like it! Administration is assuming that anything going on has to do with my child and it is very discomforting for him to be a 15 year old and not enjoy his high school years with people that favors 1 class of kids over the other! Be careful everything that looks good is not! Dealing with Ms Kidd has been wonderful but others not so much!", "pics": null, "resp": null, "gmap_id": "0x88891dc019781abd:0x5dd0a0e2cfacbda8"}
{"user_id": "103684462260430254004", "name": "ter b", "time": 1564363086491, "rating": 5.0, "text": "My son just started and i am very excited, they have an amazing program for teens, college prep, work study and what makes it more amazing the wonderful staff that this school has they really care about these children. I am looking forward to the new school year.", "pics": null, "resp": null, "gmap_id": "0x88891dc019781abd:0x5dd0a0e2cfacbda8"}
{"user_id": "108498792970773775199", "name": "Frank Franklin", "time": 1490489410307, "rating": 5.0, "text": "Well organized school whose graduates receive multiple college scholarships.", "pics": null, "resp": null, "gmap_id": "0x88891dc019781abd:0x5dd0a0e2cfacbda8"}
{"user_id": "116836520731330227944", "name": "Chanskillet", "time": 1467864684826, "rating": 1.0, "text": "O.L.F.  is getting rid of middle school now that sucks bc now my friend has to go here and that rlly sucks", "pics": null, "resp": null, "gmap_id": "0x88891dc019781abd:0x5dd0a0e2cfacbda8"}
{"user_id": "111419887632094568877", "name": "DaNisha Harris", "time": 1548028261745, "rating": 5.0, "text": "Excellent School", "pics": null, "resp": null, "gmap_id": "0x88891dc019781abd:0x5dd0a0e2cfacbda8"}
{"user_id": "105592560154232160969", "name": "Dylan Watson", "time": 1464107052886, "rating": 5.0, "text": "I ain't never been and ain't never gonna go", "pics": null, "resp": null, "gmap_id": "0x88891dc019781abd:0x5dd0a0e2cfacbda8"}
{"user_id": "113477232981556747207", "name": "BeingHeath", "time": 1576072664520, "rating": 5.0, "text": "So happy this is my parish! The pastoral staff at OLV are true God seekers and Godly men. I don't feel that there's an issue I couldn't address with any of them that would shake them. Whenever I walk through the front door I feel peace, warmth and a welcome that's hard to describe.", "pics": null, "resp": null, "gmap_id": "0x88893d28e8b4730b:0x78ea69b7e1fcfde1"}
{"user_id": "111349299455310253891", "name": "Ronnie Holmes", "time": 1574783737869, "rating": 5.0, "text": "Absolutely the friendliest parish I know.  Beautiful people worship here ❤️", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPWnEUxEYPf4fIeznU2-bIDtQn-CcPmgRGy_4fn=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOxqZcEWZa8hu8qH7s3ovYe10nY8Wm3emmkq48w=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP_Q8FEz31MtlQ-S9YtqpU4yGBKR8yXvRjARVy3=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNQ3NZRxOrTlNjXCM4chjq24phZm2CpMOLXx99G=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88893d28e8b4730b:0x78ea69b7e1fcfde1"}
{"user_id": "118078637767134549555", "name": "Catherine Summers", "time": 1560562353665, "rating": 5.0, "text": "A lovely place with lovely welcoming people.  We are not of the Catholic tradition but we attended a funeral service here and felt so welcome comfortable.", "pics": null, "resp": null, "gmap_id": "0x88893d28e8b4730b:0x78ea69b7e1fcfde1"}
{"user_id": "118090487163929673139", "name": "Jerry Vazquez", "time": 1558322236373, "rating": 5.0, "text": "I feel close to God and relaxed", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOUuK8upuxbdGf_Sd5xXCrR-paDmaQc-UZovxQr=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88893d28e8b4730b:0x78ea69b7e1fcfde1"}
{"user_id": "105180060494538581450", "name": "Scott Gloor", "time": 1574609038647, "rating": 5.0, "text": "Loving and welcoming Church in the Catholic tradition. ❤️✝️🙏", "pics": null, "resp": null, "gmap_id": "0x88893d28e8b4730b:0x78ea69b7e1fcfde1"}
{"user_id": "115167867017837569190", "name": "Ronald White", "time": 1540653564511, "rating": 5.0, "text": "Great masses. They really welcome you here. I would highly recommend if you are looking for a place to worship.", "pics": null, "resp": null, "gmap_id": "0x88893d28e8b4730b:0x78ea69b7e1fcfde1"}
{"user_id": "117066130027758512639", "name": "Nemstro Circles", "time": 1558929801917, "rating": 5.0, "text": "A great place to connect with God our Savior.", "pics": null, "resp": null, "gmap_id": "0x88893d28e8b4730b:0x78ea69b7e1fcfde1"}
{"user_id": "114514912305078366275", "name": "tristan", "time": 1551374837951, "rating": 5.0, "text": "Love this church! 10/10 would Mass again", "pics": null, "resp": null, "gmap_id": "0x88893d28e8b4730b:0x78ea69b7e1fcfde1"}
{"user_id": "104023218625881247350", "name": "Elizabeth Carlisle", "time": 1517148638631, "rating": 5.0, "text": "Wedding! Pretty church. Lovely setting.", "pics": null, "resp": null, "gmap_id": "0x88893d28e8b4730b:0x78ea69b7e1fcfde1"}
{"user_id": "114121634564982481334", "name": "Charles J. Brooks", "time": 1565919016529, "rating": 5.0, "text": "Great place to  worship...", "pics": null, "resp": null, "gmap_id": "0x88893d28e8b4730b:0x78ea69b7e1fcfde1"}
{"user_id": "103750346457568919078", "name": "Remy Helu", "time": 1555898027908, "rating": 5.0, "text": "Place of worship", "pics": null, "resp": null, "gmap_id": "0x88893d28e8b4730b:0x78ea69b7e1fcfde1"}
{"user_id": "101838772542027880872", "name": "drew reardon", "time": 1548803524362, "rating": 5.0, "text": "Love our parish!", "pics": null, "resp": null, "gmap_id": "0x88893d28e8b4730b:0x78ea69b7e1fcfde1"}
{"user_id": "115266393655888049016", "name": "Jack Lyons", "time": 1541017572616, "rating": 5.0, "text": "Its awesome", "pics": null, "resp": null, "gmap_id": "0x88893d28e8b4730b:0x78ea69b7e1fcfde1"}
{"user_id": "108444523293906862154", "name": "Dena", "time": 1520353613030, "rating": 5.0, "text": "Wonderful school and church !", "pics": null, "resp": null, "gmap_id": "0x88893d28e8b4730b:0x78ea69b7e1fcfde1"}
{"user_id": "117294809153207167936", "name": "D Corbin", "time": 1545603493362, "rating": 5.0, "text": "Wonderful sweet church!", "pics": null, "resp": null, "gmap_id": "0x88893d28e8b4730b:0x78ea69b7e1fcfde1"}
{"user_id": "113899849274396195908", "name": "Jackie Gravelle", "time": 1564025497095, "rating": 4.0, "text": "Great church", "pics": null, "resp": null, "gmap_id": "0x88893d28e8b4730b:0x78ea69b7e1fcfde1"}
{"user_id": "113078759911729914026", "name": "Amanda Rhodes", "time": 1543536932144, "rating": 3.0, "text": "Peaceful", "pics": null, "resp": null, "gmap_id": "0x88893d28e8b4730b:0x78ea69b7e1fcfde1"}
{"user_id": "106587051401793073838", "name": "Jeff Olson", "time": 1480212178302, "rating": 5.0, "text": "The priests being Jesus Christ to the altar", "pics": null, "resp": null, "gmap_id": "0x88893d28e8b4730b:0x78ea69b7e1fcfde1"}
{"user_id": "102949305990986710606", "name": "John Daniel Rose", "time": 1475959816700, "rating": 5.0, "text": "Great school", "pics": null, "resp": null, "gmap_id": "0x88893d28e8b4730b:0x78ea69b7e1fcfde1"}
{"user_id": "114940131484477228260", "name": "Don Lloyd", "time": 1450835736237, "rating": 1.0, "text": "Excellent", "pics": null, "resp": null, "gmap_id": "0x88893d28e8b4730b:0x78ea69b7e1fcfde1"}
{"user_id": "100938293655733447073", "name": "CMDR Catboy", "time": 1465278086376, "rating": 2.0, "text": "Get a concussion at this school and all the kid gets is a day of In School Suspension. Ive been bullied relentlessly and it felt like all they got was a pat on the wrist.\nIf you have a problem you are going to have to talk to the student directly which does more harm then good considering the mindset of the students here.\nSeveral teachers are downright hostile and horrible teachers, singling out students just because they are different.\nIm going to Gadsden City this year, after 4 years of this school i can comfortably say im not going to miss anyone at this school because of how rude, hostile, and utterly ignorant the students here are.", "pics": null, "resp": null, "gmap_id": "0x888a3b1ad3982323:0x3a497700ce5f355d"}
