{"user_id": "109026508507713201552", "name": "Amy Searls", "time": 1627034733396, "rating": 5.0, "text": "What an amazing hospital. The care team is knowledgeable and truly cares about making a positive difference. The best hospital in the area!!!", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "113409253191412063510", "name": "Denise Curry", "time": 1626963032222, "rating": 4.0, "text": "They were very much attentive, and guick to diagnose the problem,and very attentive.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "101563354495416136432", "name": "Carrie Burger", "time": 1626101985582, "rating": 1.0, "text": "I wouldn't take my dying dog to this hospital.\nThey didn't know what was wrong with me. They gave me a shot if morphine, walked me out to the sidewalk to wait for my ride, ride wasn't there yet so the nurse leaned me against the wall and left me.\nWas seen in Jan, paid the bill in March, got a collection notice in July saying I hadn't paid them.\nIf\nIf you vause", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "100050113496343038050", "name": "Christy Michelle Koepke", "time": 1623245582633, "rating": 4.0, "text": "Beautiful location with relaxing views! Excellent care from nurses, techs and doctors alike! 4 stars because nobody's perfect lol!", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "115008846117763165949", "name": "Brenda S Crowe", "time": 1623205649457, "rating": 1.0, "text": "I could have went to a animal doctor and got more care and respect as a human being . I don't know why they call it a emergency room because the people were so lackadaisical they had three people on gurnies waiting to be put in a room . Waited in the lobby for over a hour and a half and in the examing room for the same . Never took the blood pressure or really anything to check . Donald Woodall", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "110172791966338295520", "name": "Caleb Waddell", "time": 1623770868811, "rating": 1.0, "text": "This is the worst hospital in the state... my mother is on the 3rd floor in disgusting conditions.. nurses on 3rd floor are really cruel, unprofessional, and very condescending... I only rated this hospital one star so I could post an let everyone know DO NOT TAKE YOUR LOVED ONES HERE... I've got pics of the hospitals crimes I will be trying to post...", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "115314895445061483079", "name": "Sammy Mccurry", "time": 1604018645780, "rating": 5.0, "text": "I went to Er this morning at 8:00 am Every one there did their Jobs really good & was the fastest service I have ever seen,Dr. Chamberlain was very informative and listened to me very attentively & got things busy testing me, but What really made a great impression on me Was a New Nurse , her name Was Cami , She is Greatest Nurse Quality that there needs to be more of , I knew from her Speech I was in Good hands when she came in starting asking me about my problems & she was very easy with my I’v & was just a very caring Nurse,She needs Recognition for a Job Well Done,Oh because of her I gave Riverview a Five star Rating! Thank U Mr.Sammy Mccurry", "pics": null, "resp": {"time": 1604328505290, "text": "Thanks for the five stars and We appreciate you taking the time to write such a generous comment. Your feedback means a lot to our staff at Riverview Regional Medical Center. Sammy Mccurry! We're always here if you need us again."}, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "106852574862012816664", "name": "pink lady", "time": 1618044751117, "rating": 1.0, "text": "This is a horrible place my mother in law sat in the chair for hours screaming for a nurse like a crazy lady and still the nurses walked by like nothing noone ever checked up on her", "pics": null, "resp": {"time": 1618379973390, "text": "Hi pink lady - We are very sorry to hear about your experience at our hospital. We can promise you this is not the level of service we wish for our patients. Please reach out to our Regional Manager of Patient Experience, Avanti Ammons at AAmmons@primehealthcare.com, or by phone at 256-543-5281."}, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "107440117875640056479", "name": "Flenardo Taylor", "time": 1592746965220, "rating": 5.0, "text": "June 8th, was the day of my hip replacement. The staff and nurses were the best. They really care and made sure to assist me and every patient on the 7th floor. I am honored to have met you all.. thanks for what you do.", "pics": null, "resp": {"time": 1615457535256, "text": "Hi Flenardo Taylor, Thank you so much for taking the time to leave an excellent review. We really appreciate your feedback. It means a lot to us and our entire team."}, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "105400211420388855200", "name": "Shawna Coker", "time": 1577324337375, "rating": 5.0, "text": "Loves this hospital the staff and faculty always friendly and helpful. They have always treated me kind helpful and understanding each type I had to stay. I recommend  this hospital.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "107143812862340010184", "name": "Joe Wingard", "time": 1594405300632, "rating": 5.0, "text": "Just had outpatient surgery. Great experience. Staff was very nice, quick and efficient.", "pics": null, "resp": {"time": 1594885829261, "text": "Thanks for the five stars and feedback, Joe Wingard! We're always here if you need us again."}, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "106528420668184558021", "name": "Angelina Garner", "time": 1605998978983, "rating": 2.0, "text": "One girl has been here waiting for a hour an I'm trying to get tested for covid an its taking forever", "pics": null, "resp": {"time": 1606321266282, "text": "Hi Angelina Garner - We are very sorry to hear this. The experience you describe is very concerning to us. Please reach out to our Regional Manager of Patient Experience, Avanti Ammons at AAmmons@primehealthcare.com, or by phone at 256-543-5281."}, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "113073197079353287175", "name": "Cindy Woelfel", "time": 1591121520110, "rating": 1.0, "text": "I went there to get a CT w/ contrast & without also a 72 hour EEG paid my $300 deductible, got the CT done, went to the EEG room the technician said it would only take 30 minutes, I told her this was a 72 hour EEG, She says they don't have the equipment to do that anymore, she calls my doctor finds out I'm not lying. I read the paper at admitting where it said EEG 72 hours, now I have to go to ANOTHER hospital to get my EEG. When i went back down to admitting i got talked to so nasty. I will go to Birmingham or Huntsville next time were people know how to read before they say they can do the test.", "pics": null, "resp": {"time": 1615457693379, "text": "Hi Cindy Woelfel, We regret the inconvenience. Please allow us to understand this better. Would you Please reach out to our Regional Manager of Patient Experience, Avanti Ammons at AAmmons@primehealthcare.com, or by phone at 256-543-5281. We hope that we will have the opportunity to connect with you soon."}, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "116772206500556445168", "name": "Monique Argro", "time": 1595678386251, "rating": 1.0, "text": "This hospital need to be shut down no training help or dr sad place", "pics": null, "resp": {"time": 1615456664179, "text": "Hi Monique Argro - We are very sorry to hear about your experience at our hospital. We can promise you this is not the level of service we wish for our patients. Please reach out to our Regional Manager of Patient Experience, Avanti Ammons at AAmmons@primehealthcare.com, or by phone at 256-543-5281."}, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "104676422422942644295", "name": "Rachel Baugh", "time": 1565126887347, "rating": 5.0, "text": "New to town and had to take Mama to the Emergency room since we had not established a Primary care physician yet. They took us right in, the staff was awesome, friendly and efficient, and they referred us to a great PCP when we left. That is our hospital now. Great experience.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "105374058264989602074", "name": "Rebecka Davis", "time": 1603665033559, "rating": 1.0, "text": "extremely rude nurses on the 3rd floor they even cut my mother in laws phone off in her room where she couldnt use it", "pics": null, "resp": {"time": 1603783120624, "text": "Hi Rebecka Davis - We are very sorry to hear this. The experience you describe is very concerning to us. Please reach out to our Regional Manager of Patient Experience, Avanti Ammons at AAmmons@primehealthcare.com, or by phone at 256-543-5281."}, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "115681707660111180728", "name": "Joe Stewart", "time": 1528898669470, "rating": 5.0, "text": "Recently has surgery at this hospital.  They staff on the second floor were friendly, and made sure I and my wife were comfortable before and after surgery.  They showed concern and even sympathy. Terry called the next day to check up on me. I have has 8 different surgeries over my lifetime and this by far was the most pleasant experience I have ever encountered . The hospital is clean. The staff are outstanding,and they make you feel like you are the most important person in the building . I highly recommend this hospital.  It's clean and even the guard at the main entrance is professional and helpful. If I need another surgery this would be my choice.\nThe staff", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "102029803222284782015", "name": "Jacquelyn Harriel", "time": 1582573889239, "rating": 5.0, "text": "Wonderful hospital just slow on billing me for rest of copay. Noone answers in billing dept.", "pics": null, "resp": {"time": 1615458017701, "text": "Hi Jacquelyn Harriel, Thank you for your review! We are so happy that you had a positive experience. We'll make sure the staff are made aware of your kind review. Hope you are well!"}, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "114967579563094065327", "name": "Marc Paige", "time": 1539614375097, "rating": 5.0, "text": "Have been there several times and so has my  wife. They are very attentive and caring. Would buy them all flowers and candy if I could afford to. Best hospital in Gadsden by far.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "105613673177395084004", "name": "Mark Clark", "time": 1565182963134, "rating": 1.0, "text": "Went in to what they call a ER with a hurt ankle. They took pic and the doc came in said it wasn't broken good news and said go home. I ask about the blood that settled in my toes and ask do I get some kind of a brace for my ankle. The brought me a flip flop loof shoe the didn't even cover the ankle at all. I ask the nurse is this the best they can do and he told me not to talk about his hospital he works here. They sent me home with two ace bandages and 500 mg ibuprofen.  And told me if it dont get better to make an appointment with a orthopedic doctor. So I said to them so your telling me that I need to go see a real doctor.  No crutches no nothing and didn't even help to my truck. Don't take your dog or cat here.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "106309568613674333224", "name": "John B. Lehrter", "time": 1515958302696, "rating": 5.0, "text": "I had foot surgery and spent the night of January 10, 2018, at Riverside. The hospital was immaculate, and the food was even good. The medical staff was professional and caring. The staff couldn't do enough for me. Everyone was polite and went out of their way to make me comfortable. Thank you to the Riverside staff!", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "102627763391724737501", "name": "Alan Scott", "time": 1567180177326, "rating": 5.0, "text": "I have just had a total knee replacement and wanted to thank the administration and medical staff for the highest level of care. Am appreciative of your friendly service to both myself and my wife.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "101438312706796975543", "name": "mitchellavice", "time": 1594080808144, "rating": 1.0, "text": "I had a horrible experience here yesterday. I went in for a black widow bite with pains and difficulty breathing. They ran tests for almost 4 hours and would not give me any medicine. I was discharged with no treatment whatsoever. I will never go back to this hospital.", "pics": null, "resp": {"time": 1615457211383, "text": "Hi mitchellavice, we'd love to learn more about your experience so we can identify any concerns you may have. Would you Please reach out to our Regional Manager of Patient Experience, Avanti Ammons at AAmmons@primehealthcare.com, or by phone at 256-543-5281. We hope that we will have the opportunity to connect with you soon."}, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "113292664879411466594", "name": "Mary Ragsdale", "time": 1565483568493, "rating": 5.0, "text": "They are alot better hospital than alot of people give them credit for. They emergency waiting time is generally pretty fast. They work hard and do their job. Just because they don't hand you a prescription for a pain pill doesn't mean they aren't doing they're job. They are aware of Alabama's drug and pain pill abuse. Get high on life not drugs or pills.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "102551644897043712995", "name": "Nancy Haverly", "time": 1567050963959, "rating": 1.0, "text": "A friend of mine went to the emergency room with a severely swollen knee and a very noticeable abscess.  He was in severe pain. The doctor came in pushed and prodded the area. He was given a shot of antibiotics and 2 ibuprofen. He was told to follow up with an Orthopedic Doctor that he informed them he couldn't afford.  He was given NO CARE OR RELIEF OF PAIN NOR TREATED other than the above.\nPreviously my fiancee spent 4 days in there for pancreatitis eating ice chips because the charge nurse forgot to call the specialist who should have seen him the next day upon admission\n.My animals receive better care from their veterinarian.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "105553283260726693699", "name": "MATT ELLIS", "time": 1594080869655, "rating": 1.0, "text": "Never had a friend or family member make it out alive. Well cept one, he was bit by a black widow and they left him alone for 2 hours till he got up and went to a hospital that cared.", "pics": null, "resp": {"time": 1615457079882, "text": "Hi MATT ELLIS, We value all feedback and appreciate you taking the time to share. Your feedback is very important to us in our ongoing efforts to provide service of the highest quality to our patients and their family members. Please reach out to our Regional Manager of Patient Experience, Avanti Ammons at AAmmons@primehealthcare.com, or by phone at 256-543-5281."}, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "116647991916213855635", "name": "Lindzy Wilson", "time": 1525035389222, "rating": 4.0, "text": "Got back to a room very fast. Great service from employees. The male doctor in the ER was VERY nice!! The staff have great patience! They continued to be very helpful to me as the patient next to me begged and cussed loudly for pain meds. Great service!", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "112491161971939463348", "name": "Dannielle Sudeña", "time": 1521132944350, "rating": 1.0, "text": "DO NOT TAKE YOUR LOVED ONE HERE!\nMy grandmother went in with stomach pain and was on life support for months. Once I figured out that her condition was bad due to subpar care, The family immediately asked for her nurses to be switched and only certain nurses to care for her. Her condition has improved ever since and now she is healthy and at home.\nThe CCU and ICU unit are horrible!!!!!! My grandmother had multiple bedsores that we did not know about until she was moved to a different floor.\nThere are a handful of great nurses in those units, but certain nurses are horrible. NEVER BE AFRAID TO ASK FOR A DIFFERENT NURSE. IT WILL SAVE YOUR LOVED ONE'S LIFE.\n\nThe manager tried to defend the nurse I complained about. Stand your ground. You have a right to quality care!", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "103816532641423808960", "name": "Devin Fulton", "time": 1574840234199, "rating": 1.0, "text": "Worst hospital I've ever step foot in. They don't listen to their patients. They didnt listen to me. So i'm currently at a different hospital about to have surgery to remove my gallbladder, Which is extremely infected.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "102941202820304032735", "name": "Jennifer Craig", "time": 1543932323171, "rating": 1.0, "text": "Absolutely horrible experience there on 12/3/18. Staff sat around joking having a good time while my fiance sat bleeding for hours waiting to get stitches in his hand. The nurse practitioner showed absolutely no care to him and seemed like he didn't want to be bothered. Emergency room had been cleared out for hours and no one came. Even after asking if he was forgotten nothing was done. Walked out of ER still with no stitches after 3.5 hrs and still actively bleeding\nThere was a dirty used needle laying in the room floor as well and it was brushed off like it happened all the time", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "112667929208154619772", "name": "Don Walters", "time": 1592760456419, "rating": 1.0, "text": "They didn't  give my wife her Parkinson meds according to her daily schedule and she is still hallucinating weeks after leaving the hospital.", "pics": null, "resp": {"time": 1615457403478, "text": "Hi Don Walters, We regret the inconvenience. Please allow us to understand this better. Would you Please reach out to our Regional Manager of Patient Experience, Avanti Ammons at AAmmons@primehealthcare.com, or by phone at 256-543-5281. We hope that we will have the opportunity to connect with you soon."}, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "102125234673015887166", "name": "Jarrett Riggins", "time": 1533402573302, "rating": 1.0, "text": "No Stars. Majority of the \"nurses\" are a joke, especially in surgery. Never seen more filth under one roof. Everybody is screwing everybody, literally at work in the empty hospital rooms! Satan's playground for employees. Seriously, get a penicillin shot before you enter the place. DO NOT have surgery here.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "100536766818319700542", "name": "Diana M", "time": 1551044490253, "rating": 4.0, "text": "I want to thank the nurses and staff on the 7th floor tower for taking great care of me and seeing all needs were met. Everyone that came into my room was gracious and attentive.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "105331370771125010555", "name": "Cindy Camp", "time": 1565824603394, "rating": 5.0, "text": "Fast and clean nice staff .In and out quickly always helpful", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "117361919254286985266", "name": "Rebekah Garrard", "time": 1546644010036, "rating": 3.0, "text": "Doctors and nurses services was great! Friendly, caring staff oveeall. The food and the food service was terrible. Orders were never right or fresh.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "108024969139953629793", "name": "Heather Kladstrup Buck", "time": 1564750320730, "rating": 5.0, "text": "Tabitha Brown on 7th was one of the CNA's that took care of a family member and she was simply AMAZING!! There definitely need more CNA's like her there.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "100646747948138588613", "name": "Iconic.", "time": 1536283119784, "rating": 5.0, "text": "They made a lot of changes don't listen to theses reviews. My mom had a cardiac arrest and they had it done in a week great service. She is fine now.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "107735104347869636878", "name": "Nancy Boley", "time": 1540846067717, "rating": 5.0, "text": "So very nice always asking if i needed something and it was my husband that was in hospital and they took such great care of him I want to Thank everyone there", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "103082161389419731172", "name": "Kelley Ireland", "time": 1551730817740, "rating": 5.0, "text": "I went to er for infected cat bite, cleaned, xrays, antibiotic, shots.... sent home BUT was told if worse came back. 4 hrs later I was back... signed in at er... before I could take a seat... Dr came out ( same dr) looked at arm and said come with me.... admitted on 4th floor the spot! Care was wonderful... admitted, iv started, wound cleaned, internal infection Dr called in, procedure in place within 1 hr!!!\nNurses were FANTASTIC...  if I had questions... they were answered.... no stone was left unturned! Highest praise...", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "109220079590602619328", "name": "Lynn Dobbins", "time": 1493595834116, "rating": 1.0, "text": "This place is garbage! They do not care about the patient or family members. No one can ever be on the same accord. Nurses, tell you something totally different than doctors & when you get to the bottom of things, they all are lying. This is one facility that I WOULD NOT RECOMMEND!!! They are a DISGRACE to the medical community. If care anything about your love ones please take them elsewhere.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "108750022929895484372", "name": "Nevergivenup 123", "time": 1456333018272, "rating": 1.0, "text": "Feb 23, 2016 I was in the ER about 5 hrs. I was told after 2 hrs I was being admitted. They had a room that had to be cleaned. Then I was move after a total of 5 hrs. Anyways the ER doctor was terrible   no beside manner and didn't really even examine me. I went to the ER for shortness of breath. X-rays and blood work was ok. After I was moved to my room the 3rd floor nurses were not even concerned about my well being. I didn't use the call button all night. Then I did that morning and it took 45 min for the nurse to get to my room. And the doctor on my floor has done nothing. No test have been ordered or anything. I was in this hospital twice last year and I couldn't have ask for better top notch care. I don't know what has happened this go around. I'm writing this review as I'm laying here for nothing and me and my insurance is getting this outrageous  bill. I'm about to sign and leave on my free will. Very disappointed. My doctor this time here isn't Dr Jazwal. If it was he would not allow this kind of care..", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "114618460626472541882", "name": "joevgirl 4_ever", "time": 1546558664005, "rating": 5.0, "text": "Excellent hospital, doctors, nurses and staff. I was treated with renal failure on thanksgiving day.  They were very nice and I plan the go back and thank the staff that treated me and helped me. I am still in bad shape but trying to heal slowly. I was a GFR of 28 and now been stable at 47. This wasn't anything I done wrong but I had to take a medication that causes renal failure but usually is reversed. Can't thank all the doctors staff and nurses, even techs and imaging for all their help. Very professional and curtious. I did ask why they were so nice because I had been treated hostile at another facility and by a few specialist and their response was \" it could be one of us in your position\". They kept me calm, wasn't hateful not neglectful. When I went back on new years Eve in pain they understood, helped me and sent me home after finding out my gfr was a little better.\n\nI could go on forever and wish I had the names of ppl who treated me. All I know is it was the best treatment and hospitality I've had this past year. I guess I had been going to wrong hospital before this one.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "116939668277096635766", "name": "Gary Taylor", "time": 1538849818175, "rating": 5.0, "text": "I absolutely love the hospital, and the nurses are the very best! I have been admitted 5 times in the past 2 months. They have taken such wonderful care of me. I wouldn't use any other hospital besides Riverview hospital, except UAB. I have a specialist in Gadsden and kirklin clinic, UAB that take good care of me.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "108783245604948246897", "name": "Angela Mekertichian", "time": 1469575837176, "rating": 2.0, "text": "Avoid this hospital at all cost. There is no care. Doctors are hard to come by and they do not care. My best friend was there for 4 days and past away. They could not even find what was wrong and he got so I'll that I could not move him. Terrible place. And 2 weeks later the doctor still can't be bothered to sign the death certificate.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "113129873456629978731", "name": "S Owens", "time": 1529861947866, "rating": 3.0, "text": "MARK your parking spaces CLEARLY if you don't want anything but Emergency vehicles to park in the two spaces just outside the ER.  Neither are marked and I was told by an ambulance driver I would be towed.   That would have cost you my attorney fees and the cost of them towing my car.  By first appearance, those are legal parking places for everyone.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "111194771456558392215", "name": "Super Straight", "time": 1516409380245, "rating": 1.0, "text": "Went to this hospital last night at midnight with a family member who had an extremely high heart rate and was in a lot of pain. We were both terrified, thought this person might be having a small heart attack and could ultimately die. We get to the front desk of the ER and a young, skinny black woman was working it. Nobody was in the waiting room, keep in mind. We tried to check in, give her the insurance cards, tell her it’s very urgent.... and she’s got her head propped up on her left hand, slowly clicking things on her computer. She gives us the WAIT finger. Doesn’t say a single word. Just 👆🏻 the YOU CAN JUST WAIT A MINUTE finger. We sit down for 20 mins. She’s still clicking away. Looking disgruntled as ever. We go back up to the desk to try to reiterate how urgent this is ansnto basically beg her to take our insurance or whatever it is she needs to get us seen ASAP. We get the finger again. We then called Gadsden regional hospital and they said “Yes we will get you in immediately! Come now!!!”  They took care of my family member at Gadsden Regional and they feel better than they have in a year!!!\n\nBut I can’t figure out why these people act like that. Did we interrupt her Facebook scrolling? What did we do wrong but want to check in and get seen ASAP. We were (and always are) VERY nice and understanding. We know nobody is a miracle worker. But this is on another level of disgusting and piggish. What if my family member died while she played on the computer for almost half an hour and never ever got us checked into the system?! The place was empty. I guess she thought she could be lazy that night and was upset by us coming in and having an emergency, in turn making her have to do a little work. This was on 1/19/18 at MIDNIGHT in the ER.  Couldn’t get her name because I kept getting shoes off. She never spoke to us ONCE. I know Riverview will do nothing about this though and keep this heartless woman on as an employee. They could care less. GO TO GADSDEN REGIONAL IF AT ALL POSSIBLE!!!!!!", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "106442276754251403223", "name": "eric williams", "time": 1517064762143, "rating": 2.0, "text": "While mother was in E.R. Male nurse was very rude to the point of being mean to her. We got the er supervisor involved and problem fixed with that incident. Then afterwards they admitted her we come into her room to check on her and she tells me a male nurse was trying to bathe her which was unnecessary to say the least. The night before that garbage was overflowing and all over the room and let’s keep in mind that this is a hospital. No hand sanitizer in room after asking for days. Bed sheets had not been changed in days also. Got another supervisor involved, and this man had the nerve to not only have a security escort but accused me of being rude to his staff. I grew up in a military family and say yes sir and yes ma’am to everyone I come across. Needless to say I will be contacting the board of directors for this mans total incompetence. But the best thing I can say about this hospital is the nurses on cardiac step down are some of the best I’ve seen in any hospital, very responsive and respectful. Also, Jane Yates was great and needs to be supervisor of not just the E.R. But I would say the whole hospital.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "111256091420690663584", "name": "michael moeller", "time": 1566494707328, "rating": 5.0, "text": "No zero option. The ER  is beyond inept. The entire area around room 12 in the ER is very dirty and smells.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "108471318821194518790", "name": "Carlene Valentine", "time": 1528290019430, "rating": 1.0, "text": "I am scheduled to do the pre-op testing today for foot surgery on Friday. NO ONE CALLED ME TO LET ME KNOW WHEN TO SHOW UP FOR this. I called them even though my doctor's office had told me yesterday when it was! I detest inefficiency, especially in professionals. THIS IS UNACCEPTABLE grom MEDICAL PROFESSIONALS! Makes me wonder if my surgery will be done under proper procedures from the facility??? Will I ever go back for amy services after Friday? I doubt it at this point. I jave dealt with medical.professionals personally for over 45 years and this is the worst I have EVER seen.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "102772226039453506188", "name": "Waymond McGee", "time": 1518551716756, "rating": 1.0, "text": "I, Waymond McGee, went to Riverview Medical Center in 2015 where Dr. Donald Marshall did a verbal sexual harassment towards me. I went through every possible channel to get this matter handled and I was rejected. Since no action was taken, I wanted to inform the public on this issue so this will not happen to anyone else.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "105548214761191126251", "name": "Bravo Chakras", "time": 1516216744902, "rating": 5.0, "text": "It's a really hospital. April at New Vision is very sweet, understanding, compassionate, and awesome. @NewVision  @gadsdenregionalhospital", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "117609865530036158280", "name": "April Myers", "time": 1364439793959, "rating": 5.0, "text": "The staff was very caring. My poor mom suffered a lot and was a very difficult patient due to cancer in her brain and a lifetime of being stubborn and strong-willed. Despite her physical lashing out, pulling out her IV's and trying to go home every minute she was there, they were very kind and caring. When it was clear she was dying, they did everything they could to make us comfortable. I never ate so good as I did staying there 24/7 for a week. The seats turn into pretty comfortable beds. My only issue, and it is a significant one, is that there were a whole lot of specialists each focused on their specific area of medicine, and it didn't appear they were checking her file before they walked in. So we had a lot of bizarre and non-sensical testing trying to take place, and even in her last gasps, someone came in with a gurney to take her in for surgery. The neurosurgeon came in wondering why she hadn't gone in for the MRI that morning. The last few days, I felt like I really had to protect my mom because their system is so chaotic and overwhelming. Even if you say no to something, the word doesn't get to the everyone and they still try to do it. Don't leave your loved one there alone, whatever you do. They are going to need your care and oversight. I will never forget the kind people there, and especially the folks who prayed with my proud, fighter of a mom. She decided to accept Jesus the day before she died, I'm sure it helped having people like that around.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "103752206556278910109", "name": "Marquita Ervin", "time": 1563961672938, "rating": 1.0, "text": "What a nasty hospital.. that smell is mold... The State need to shut yall down", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "102244727860162887576", "name": "Terri Odazier", "time": 1510261991318, "rating": 1.0, "text": "Awful.  Nasty and doctors dont know anything.  I had to tell him it was my gallbladder and even then he told me that was not the problem. I told him to do an ultrasound and with hesitation he ordered it.  Yep it was inflamed and full.  Stupid.  I had to do his job.  Now they want to change me 10k.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "112150177060294461743", "name": "Regina Gallagher", "time": 1524182296292, "rating": 5.0, "text": "Best hospital ever!Very fast service and very nice  staff!", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "113909580564331987965", "name": "ChopinLover", "time": 1492984075979, "rating": 5.0, "text": "In spite of the five stars the nurse tech on duty afternoon 4/23/17 made slanderous remarks toward the spouse of her patient. These remarks are totally unwarranted. I may sue.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "103254131995116208334", "name": "Carol Lee", "time": 1372189091734, "rating": 2.0, "text": "Recently my mother was admitted to CCU. She has been there a week and a day.\nThe nurses told us on Sunday that she would be moved to a regular room on Monday. Now that it is Tuesday she is STILL in CCU. Apparently, they are waiting on the Dr. I understand that there are alot of patients to be seen but waiting on the Dr. to just allow her to be moved is not acceptable. She has improved tremendously thanks to the CCU and alot of prayers. You would think that the Dr.would take 5 minutes or call CCU and order her to a regular room. If he is too busy then the hospital needs more physicians. Not a good experience.......", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "101100477323160309772", "name": "Brandon O'tinger", "time": 1489224562322, "rating": 1.0, "text": "Hated that hospital. My dad had his prostate removed there. The nurses did not pay attention to the compression devices placed on the calves of his legs. These are used to try to prevent deep vein thrombosis, but they never even bothered to check to lake sure they were working properly. My dad ended up with.deep vein thrombosis in both legs, and suffered bilateral pulmonary emboli as a result.\n\nThe elevators are awful, you literally have to sit there and wait, and wait, and wait for the elevator to arrive, seems like it takes 5 mi utes every time you use it. Also several times i thought we were going to get stuck in one because it was ridiculously slow, and rickety.\n\nI absolutely would advise avoiding this facility unless absolutely neccessary.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "108574370813639125391", "name": "Allen Elkins", "time": 1505618799723, "rating": 1.0, "text": "From their deplorable bedside manner to their decrepit facility; this hospital deserves some sort of negative star ranking.\n\nI went to their emergency room where the Physician's Assistant (I believe his name is Brian) cut me off several times when I was speaking, wouldn't let me run off a list of symptoms I was experiencing, told me I couldn't come In there with more than a couple complaints; essentially an extremely rude individual. His demeanor was that of a cowboy cop (yes, mustach included) from a low budget action film based in the mid 1980s.\n\nAs a result of said negligence on Brian's part, I was prescribed medications for symptoms I never even stated.\n\nAlso, the doctor never even came in the room to see me. I was given a message from the doctor through one of the nurses that mirrored Brian's statement.\n\nMy overall perception of the Emergency Room visit was that I was an unwelcome burden.\n\nThe only good thing I can say about the hospital is the admitting staff, and nurses were very hospitable and kind.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "107438622568234007127", "name": "Kay Moore", "time": 1539285002864, "rating": 5.0, "text": "Staff has been excellent and service has been exceptional!", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "102366540537463471172", "name": "Freda Mincey", "time": 1456040590364, "rating": 1.0, "text": "Someone attempted a robbery and took my purse in a parking lot and come to find out the hospital has no cameras in the emergency parking lot my fiance is now sueing the hospital. This hospital is horrible and they are unbelievable my fiance calls and they hang up on him. No staff ever in the emergency room. Doctors are like street pharmacists and pill mills", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "110567557620351341846", "name": "Paul Coleman", "time": 1493834464696, "rating": 5.0, "text": "So far i have no problem.they have been good to me.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "114851715195394782663", "name": "Alex Abernathy", "time": 1476042803440, "rating": 1.0, "text": "DO NOT GO HERE. MY POOR 1 YEAR OLD HADNT BEEN ABLE TO KEEP ANYTHING DOWN FOR 2 DAYS SO WE TOOK HER TO THE ER SINCE HER PED OFFICE WAS CLOSEDTHEY KEPT US THERE FOR 4 HOURS AND AND DID NOTHING TOLD US WE DONT KNOW TAKE HER TO HER PED WHEN THEY OPEN EVEN THE NURSE SAID WE SHOULD HAVE TAKEN HER SOMEWHERE ELSE AND HES SORRY THEY ARENT A GOOD HOSPITAL! I STRONGLY RECOMMEND YOU NEVER GO HERE.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "105416530403780687936", "name": "JBL 3", "time": 1489505517924, "rating": 1.0, "text": "Almost 300 dollars was stolen out of my wallet. They refused to pull cameras..Told me one thing and told police another..There was one nurse bless her heart knew I was done wrong but I believe she was scared to say anything in fear of losing her job.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "107201331780103713930", "name": "Jeremy Mize", "time": 1429841873769, "rating": 1.0, "text": "Do not trust the doctors or staff at this facility .had to google wifes cond myself .learn from our exp go Elsewere", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "111168496561496213108", "name": "Douglas McWhorter", "time": 1517602327204, "rating": 5.0, "text": "Nursing Staff, House Keeping, and Dietary are all AWESOME !!!  Especially 5th floor!!!", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "115539572854000225464", "name": "Pamela Lucas", "time": 1406765951499, "rating": 1.0, "text": "They gave my mother the wrong meds after surgery and almost killed her. She was an independent self sufficient woman prior to surgery and now she is in a nursing home.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "109126253863898395616", "name": "Bea Phillips", "time": 1537013202902, "rating": 1.0, "text": "STAY AWAY!! GO ELSEWHERE\nZERO STARS..BAD ATTITUDES EVERYWHERE . NURSES SCREAMING AT AIDES, AT PATIENTS...CURSING.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "110248805524355220643", "name": "Steph Massi", "time": 1553364877642, "rating": 5.0, "text": "Excellent care and great nurses", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "115150755497615699682", "name": "Misty Brown", "time": 1503696839906, "rating": 1.0, "text": "Very dirty....there was blood on the walls. Ugh", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "110071628031699838572", "name": "Jessica Dison", "time": 1506752637868, "rating": 1.0, "text": "ABSOLUTELY THE WORST RUDEST DOCTORS WELL FAKE DRS AND NURSES NASTY FALLING APART AND THEY NEED TO SHUT THIS PLACE DOWN!!!", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "105503254116820522047", "name": "Donnie Outlaw", "time": 1500721764409, "rating": 5.0, "text": "It's the best hospital in Gadsden Alabama", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "104985260478402410340", "name": "Phillip Boyd", "time": 1383092950174, "rating": 5.0, "text": "Thank you so much.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "101937414752517105474", "name": "John Roden", "time": 1435932601881, "rating": 1.0, "text": "This place is terrible. Poor Service, Harassed me about paying my bills every month. Sent me a letter stating my bills would be send to collection within 10 days if not paid in full after I made payment every month, and paid over 95% of each bill! I paid them off and will NEVER visit this place again.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "112359022025421447557", "name": "Wootys Hemi", "time": 1473134151838, "rating": 1.0, "text": "Can not get anyone to do there job not a good place to go take the extra mile in a half drive to Gadsden Regional.", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "102848436845543669664", "name": "Stacy Doss", "time": 1521352866999, "rating": 5.0, "text": "Excellent care", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
{"user_id": "116097918952269892502", "name": "Angela Ellzey", "time": 1460681102270, "rating": 5.0, "text": "Everyone is nice", "pics": null, "resp": null, "gmap_id": "0x888a3eadc327df4d:0x29231de8a02bdddc"}
