{"user_id": "108888841935045550243", "name": "gloria goad", "time": 1614821143324, "rating": 5.0, "text": "We love Cuban food, it was our first try,\nThe food and service fantastic", "pics": null, "resp": null, "gmap_id": "0x88626b42958588bb:0xeaf3454e0759aea"}
{"user_id": "108888841935045550243", "name": "gloria goad", "time": 1614821143324, "rating": 5.0, "text": "We love Cuban food, it was our first try,\nThe food and service fantastic", "pics": null, "resp": null, "gmap_id": "0x88626b42958588bb:0xeaf3454e0759aea"}
{"user_id": "108888841935045550243", "name": "gloria goad", "time": 1614821143324, "rating": 5.0, "text": "We love Cuban food, it was our first try,\nThe food and service fantastic", "pics": null, "resp": null, "gmap_id": "0x88626b42958588bb:0xeaf3454e0759aea"}
{"user_id": "108888841935045550243", "name": "gloria goad", "time": 1614821143324, "rating": 5.0, "text": "We love Cuban food, it was our first try,\nThe food and service fantastic", "pics": null, "resp": null, "gmap_id": "0x88626b42958588bb:0xeaf3454e0759aea"}
{"user_id": "115046192093907056690", "name": "jlo hill", "time": 1617484171485, "rating": 5.0, "text": "Employees were great from the time we entered and left.  Going again next week with more people.  Great atmosphere.", "pics": null, "resp": null, "gmap_id": "0x88892259868046c3:0xe896dd4b84206cc2"}
{"user_id": "115681140078948493057", "name": "Lashunda Dunn", "time": 1623521760684, "rating": 4.0, "text": "Decent officers", "pics": null, "resp": null, "gmap_id": "0x88892259868046c3:0xe896dd4b84206cc2"}
{"user_id": "106117971902512440227", "name": "Robert Samuel", "time": 1561580931478, "rating": 1.0, "text": "I did a interview at the Hoover office for a arm office at the hospital HR told me that they had to send my DD214 to the head office so they could read it since it’s was dated in the the 70s HR told me that he would give me a call at the end of that day and let me know what the head office decided about give me the job in the hospital as a arm office I have my pistol permit and High school  diploma  And I have a honable discharge HR never did call me I call him a week later after the interview he tell me that he had email me I check my email and it said that I wasn’t  qualified to be a arm office for G4’s with no reason why  G4s sucks and just a waste of time and gas going to their interview", "pics": null, "resp": null, "gmap_id": "0x88892259868046c3:0xe896dd4b84206cc2"}
{"user_id": "114560737934669459247", "name": "Jeremy Fisher", "time": 1608086634239, "rating": 5.0, "text": "Great quality protection services", "pics": null, "resp": null, "gmap_id": "0x88892259868046c3:0xe896dd4b84206cc2"}
{"user_id": "108236502464278084582", "name": "James Williams", "time": 1603152112597, "rating": 5.0, "text": "I'm a new employee and in training to become a security guard and get my Alabama security guard license.", "pics": null, "resp": null, "gmap_id": "0x88892259868046c3:0xe896dd4b84206cc2"}
{"user_id": "103588853066170783326", "name": "David Morgan", "time": 1611891225927, "rating": 5.0, "text": "Awesome place to work", "pics": null, "resp": null, "gmap_id": "0x88892259868046c3:0xe896dd4b84206cc2"}
{"user_id": "110226610343240969735", "name": "Julio Zee", "time": 1526130244578, "rating": 1.0, "text": "Terrible company to work for. They lose contracts left &right. It's a buddy system, they give promotions based off of their friends. Terrible GM,  Ops Manager and HR is absolutely a joke. My two cousins lost their jobs because G4S cannot keep contracts. The Hoover office needs to be wiped and start over fresh. Stay far away from this company. They will screw you over, they don't even try to keep their contracts. The Hell with this company😣😣😣", "pics": null, "resp": null, "gmap_id": "0x88892259868046c3:0xe896dd4b84206cc2"}
{"user_id": "113677660764069122224", "name": "Robert Jackson", "time": 1544333353222, "rating": 1.0, "text": "Corruption at the highest levels.  They lie about pay all the time,  they leak and share your personal information like SSN , pay rate, address for anyone to see it. They cheat us officers on deployment pay all the time.  Worst security company ever.  They are sued left and right. Hell they are being sued by SCAD in Savannah GA because of Identity Theft.  They shared personal officers information . Exposed their social security numbers and everything.", "pics": null, "resp": null, "gmap_id": "0x88892259868046c3:0xe896dd4b84206cc2"}
{"user_id": "115721298548337402644", "name": "Kevin Williams", "time": 1542965069321, "rating": 5.0, "text": "Great company to work for!", "pics": null, "resp": null, "gmap_id": "0x88892259868046c3:0xe896dd4b84206cc2"}
{"user_id": "108274014481696647009", "name": "Rod Cooper", "time": 1506036312180, "rating": 1.0, "text": "Poor management, Lack of communication, low pay and your previous experience doesnt matter.", "pics": null, "resp": null, "gmap_id": "0x88892259868046c3:0xe896dd4b84206cc2"}
{"user_id": "116613214603802555016", "name": "Billy Newsome", "time": 1579226690179, "rating": 5.0, "text": "Job fingerprints", "pics": null, "resp": null, "gmap_id": "0x88892259868046c3:0xe896dd4b84206cc2"}
{"user_id": "110520665410847254387", "name": "Misty Cornelius", "time": 1614288890902, "rating": 5.0, "text": "I’m very grateful for Mike’s services.  He helped me out in a stressful time and provided accurate information I could count on. 5 stars for sure!", "pics": null, "resp": {"time": 1619024101349, "text": "Thanks so much for leaving us a great review. We hope you’ll give us a call the next time you’re looking"}, "gmap_id": "0x8892920a0583f493:0xf79dc682012675b6"}
{"user_id": "115656504040759973558", "name": "Steve Fuller", "time": 1623933233815, "rating": 1.0, "text": "We hired this Guy in January, as of the writing\nThis Review we have not heard a word from\nHim. Do not waste your money on this guy.", "pics": null, "resp": {"time": 1624384004510, "text": "Thank you for your feedback, SteveWe take our customer’s concerns very seriously, however, we’re unable to locate any record of having done business with you. We’d like to get to the bottom of this to make sure we can resolve any issues you might have had, so please reach out to us"}, "gmap_id": "0x8892920a0583f493:0xf79dc682012675b6"}
{"user_id": "104649992063903638913", "name": "Lesley Faris", "time": 1575173559083, "rating": 5.0, "text": "It was recommended to me by my attorney to hire a private investigator during my divorce process. Mike was very professional and quickly gathered evidence and information to help expedite the divorce process in my favor. Mike’s knowledge, experience, and hard work made him a huge asset. I could not recommend him more!", "pics": null, "resp": null, "gmap_id": "0x8892920a0583f493:0xf79dc682012675b6"}
{"user_id": "107156272194980279237", "name": "Audrey Constable", "time": 1575674854760, "rating": 5.0, "text": "Very nice man. Very compassionate . known what he is doing. Very reasonable. He is the biggest reason I done so well in my divorce. I recommend he all the time. And I would use every time I needed an investigator", "pics": null, "resp": null, "gmap_id": "0x8892920a0583f493:0xf79dc682012675b6"}
{"user_id": "115086528764327279458", "name": "Andy Hughes", "time": 1588001219104, "rating": 5.0, "text": "I've known Mike Magrino for over 25 years. He has the knowledge, skills and ability to properly handle your case in a professional and thorough manner. If you hire Mike you can be assured of his confidentiality in every respect.", "pics": null, "resp": null, "gmap_id": "0x8892920a0583f493:0xf79dc682012675b6"}
{"user_id": "118011905177322174357", "name": "Michelle Clements", "time": 1584110658249, "rating": 5.0, "text": "Our office uses M&M Investigations for our process serving as well as private investigations. M&M Investigations is very experienced, has worked with our office for over 15 years, and shows a professionalism that is valuable to this kind of industry. He is highly dependable, extremely accurate and timely. The whole office would highly recommend M&M Investigations.", "pics": null, "resp": null, "gmap_id": "0x8892920a0583f493:0xf79dc682012675b6"}
{"user_id": "103461199780061111246", "name": "Show Coat Solutions", "time": 1574354233570, "rating": 5.0, "text": "M & M Investigations was able to uncover vital information we needed to further implement the individuals who were counterfeiting our product line.  Mike obtain evidence and testified in Federal Court about the evidence he collected.  Mike has been available to assist us throughout this process.  We greatly appreciate his professionalism and highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x8892920a0583f493:0xf79dc682012675b6"}
{"user_id": "105269854590850353926", "name": "BJ Hughes", "time": 1580216116013, "rating": 5.0, "text": "I hired M & M Investigations and they were incredibly thorough and very professional and very discreet. They exceeded my expectations all the way around. I give they a 5 star rating. I would use them again for any PI work I need.", "pics": null, "resp": null, "gmap_id": "0x8892920a0583f493:0xf79dc682012675b6"}
{"user_id": "102905236360214825945", "name": "Donald", "time": 1575410349878, "rating": 5.0, "text": "The only private investigator worth hiring. I used Mike on two different occasions and he got results fast. Honest, depenable and very professional.", "pics": null, "resp": null, "gmap_id": "0x8892920a0583f493:0xf79dc682012675b6"}
{"user_id": "102344621909987158610", "name": "Amber Traylor", "time": 1541560180895, "rating": 5.0, "text": "Mike is hands- down the best private investigator in this area. We spoke with several attorneys and he came highly recommended by all. After hiring him, my husband was able to get custody of his son, an almost impossible task in Alabama. He is extremely honest and we are so grateful for all he has done for our family!", "pics": null, "resp": null, "gmap_id": "0x8892920a0583f493:0xf79dc682012675b6"}
{"user_id": "109170435092756355426", "name": "Christian Herring", "time": 1544823716014, "rating": 5.0, "text": "Our office uses M&M Investigations for our process serving as well as private investigations. Mike is an experienced investigator and shows true professionalism. He is dependable, accurate and timely. I would highly recommend M&M Investigations.", "pics": null, "resp": null, "gmap_id": "0x8892920a0583f493:0xf79dc682012675b6"}
{"user_id": "113080713062931781127", "name": "Neil H", "time": 1574803946856, "rating": 5.0, "text": "Mike is very resourceful, works hard and goes long hours to gather intel towards his objective. The pricing is good and worth every penny.", "pics": null, "resp": null, "gmap_id": "0x8892920a0583f493:0xf79dc682012675b6"}
{"user_id": "109151567361188825103", "name": "Fox", "time": 1545111126163, "rating": 5.0, "text": "Great experience. Personal service in a professional manner. His knowledge is one of the most valuable tools, which is employed to support and defend your case", "pics": null, "resp": null, "gmap_id": "0x8892920a0583f493:0xf79dc682012675b6"}
{"user_id": "101917787062089201722", "name": "Laurabeth Moore", "time": 1541460528145, "rating": 5.0, "text": "Mike's background is what made us decide to use M&M investigations, and I believe it is what makes him so good at what he does. I highly recommend M&M investigations.", "pics": null, "resp": null, "gmap_id": "0x8892920a0583f493:0xf79dc682012675b6"}
{"user_id": "118150620962395448412", "name": "Jason", "time": 1574368240511, "rating": 5.0, "text": "Great guy. Does good work!!", "pics": null, "resp": null, "gmap_id": "0x8892920a0583f493:0xf79dc682012675b6"}
{"user_id": "115318391080303714159", "name": "Todd Danford", "time": 1541990095551, "rating": 5.0, "text": "Mike is very professional, experienced, and does an excellent job.", "pics": null, "resp": null, "gmap_id": "0x8892920a0583f493:0xf79dc682012675b6"}
{"user_id": "105565219199313707812", "name": "Kendal Allen", "time": 1548383358143, "rating": 5.0, "text": "Mike is a very professional and class act guy! I would definitely recommend him to anybody looking for a private investigator!!!!", "pics": null, "resp": null, "gmap_id": "0x8892920a0583f493:0xf79dc682012675b6"}
{"user_id": "111941606837339115867", "name": "Rebecca Faulkner", "time": 1544824979552, "rating": 5.0, "text": "Mike is our go-to PI. We have used him for over a decade. He provides fast and accurate results.", "pics": null, "resp": null, "gmap_id": "0x8892920a0583f493:0xf79dc682012675b6"}
{"user_id": "106620518906652174803", "name": "Les Moore", "time": 1541507069616, "rating": 5.0, "text": "Awesome work by M&M!! They get what you need!", "pics": null, "resp": null, "gmap_id": "0x8892920a0583f493:0xf79dc682012675b6"}
{"user_id": "102773973398558014296", "name": "J LaPointe", "time": 1605451671353, "rating": 5.0, "text": "Workable Solutions, LLC exceeded my expectations with Unarmed and Armed Security Officer training.  This is a top notch training company; the facility was clean, organized, and well laid out.  The staff was competent, knowledgeable and experienced.  I enjoyed both classes very much; it was an honor to be taught by instructors of such high caliber.  I plan on returning for additional training!", "pics": null, "resp": {"time": 1605568945744, "text": "Thank you for the kind words. We aim to please. Hope to see you again."}, "gmap_id": "0x888c2bba39bf3119:0x9d32eb0cb11a8f87"}
{"user_id": "116727597917223963975", "name": "Robert Williams", "time": 1619578251942, "rating": 4.0, "text": "Great place to work", "pics": null, "resp": null, "gmap_id": "0x888c2bba39bf3119:0x9d32eb0cb11a8f87"}
{"user_id": "113523572195513268650", "name": "Loyd Jenkins", "time": 1610218092989, "rating": 5.0, "text": "Best training company around!", "pics": null, "resp": null, "gmap_id": "0x888c2bba39bf3119:0x9d32eb0cb11a8f87"}
{"user_id": "105763402119928566475", "name": "NewYorkGaming", "time": 1607363820740, "rating": 4.0, "text": "This review is for the FBI headquarters, not this specific FBI office. If I ever have an experience with this agency, I will add another section to this review about this particular office.\n\nSection 1: The male operators are very polite, and actually help you with what you need help with. The female operators, however, are very rude, and sometimes even refuse to take my complaint. That is the feedback I have received at least", "pics": null, "resp": null, "gmap_id": "0x88929283fffa066f:0x11265766abcac906"}
{"user_id": "112192235423051737245", "name": "Gabe Fox", "time": 1555710506539, "rating": 3.0, "text": "had a nice experience overall, the facilities were sub-par, very 80’s modernistic. Took one star off because some of the staff was not very friendly, got roughed up a bit during a one on one session. However the main manager was very nice, kept telling me to focus and relax. Took another star off for the other guests, they were very loud and kept screaming in the middle of the night. I was looking for the spa when I kept seeing weird glows coming from staff areas. not sure what that was about. Over all I recommend this experience for any extra terrestrial or person traveling through the Milky Way!", "pics": null, "resp": null, "gmap_id": "0x88929283fffa066f:0x11265766abcac906"}
{"user_id": "114211775379714774312", "name": "Carter McCall", "time": 1541449696564, "rating": 1.0, "text": "Kreb", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM2l-6dZLnFRogiyr0wokD_liY9O33j8E883CKA=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88929283fffa066f:0x11265766abcac906"}
{"user_id": "105547233731338633370", "name": "juan pena", "time": 1594328915087, "rating": 5.0, "text": "Great service!!!", "pics": null, "resp": null, "gmap_id": "0x8862148fffffffff:0x715067b793bd2227"}
{"user_id": "112751118145596508319", "name": "Nina Jones", "time": 1483249986746, "rating": 5.0, "text": "I was treated with noting but with respect from them today! Usually when you want to voice a concern about anything, anywhere you're treated as I'm here doing this only cause of my job! I was listened to, and respected as human being and not rushed.\nI about passed out when they taken my DL a second time lol, couldn't run, couldn't hide.\nIn all good place to go if you know they might can help or point you into the right direction! Keep up the good work!!!", "pics": null, "resp": null, "gmap_id": "0x888e816ef3ab45cf:0x93516844dff766b3"}
{"user_id": "104793184751336587357", "name": "Kel Moy", "time": 1501947676913, "rating": 5.0, "text": "I have had to reach out to FBI units in other cities across the USA. I am uncovering a criminal network where I am now. I was a staff assistant at a major Montgomery law firm also on Commerce Street. I am finding out that on the East Coast there are crime networks that involve generations of families which is why people are more guarded on the East Coast than on the West Coast. I have information about crime networks/rings where family members by-pass background checks for attorneys judges and even federal level employment. As a former active duty military personnel the hiring process does not require a phony resume but rather 19 pages including associates you have known since preschool. Luckily I have a cousin who is connected with the Snowden family i.e. Edward Snowden, chief of police, and I am related to screenwriter and producer of Married with Children. I think my half uncle I haven't met wrote Forrest Gump. My grandmother's little sister worked for the FBI in the late 1940s her first real job out of high school.  My own parents were attorneys in Corporate law in San Francisco and with the Attorney General of California. I am calling the FBI in Montgomery today. Thanks", "pics": null, "resp": null, "gmap_id": "0x888e816ef3ab45cf:0x93516844dff766b3"}
{"user_id": "103454887201849308904", "name": "Ashley Garnett", "time": 1510517464080, "rating": 3.0, "text": "Im not 100% sure on this department of the federal bureau of the investigation,im not 100% sure that the state of Alabama isn't just there to cover the state of Alabama but I have called this department many times and also spoke with other federal offices across the country and it sure seems like at least one call to the Alabama bureau of investigation would have proved successful in stopping the organized crime of the Alexander city Alabama police department cause surely the FBI in this god forsaken state would have noticed the free mason symbol on the top of the building that houses the office of Charles gillenwater who is the municipal attorney for Alexander city and this building symbol and all is located in front of the Alexander city Alabama police department also I have seen some of the police wearing rings with the same free mason symbol not to mention many attacks on me made by the citizens of Alexander city and other cities in Alabama all seem to have been police orchestrated", "pics": null, "resp": null, "gmap_id": "0x888e816ef3ab45cf:0x93516844dff766b3"}
{"user_id": "103343380776946106725", "name": "Burnie Stedham", "time": 1581707986334, "rating": 4.0, "text": "Took care of a problem. Quickly, professional and affordable", "pics": null, "resp": null, "gmap_id": "0x88620d453ecc6d2d:0xf76baec488ffa3ef"}
{"user_id": "104781721129865982810", "name": "Shawn Troughton", "time": 1569862493501, "rating": 5.0, "text": "TemperaturePro Birmingham uses EISI for all of our employee screening. The turn around time is amazing. Its nice to know a local business is looking out for our customers as much as we are. Shawn", "pics": null, "resp": null, "gmap_id": "0x88892245b41c9211:0xde89aee50e05e173"}
{"user_id": "112856602004917921444", "name": "Todd Haney", "time": 1564351789222, "rating": 5.0, "text": "This is a great company to partner with for your security and surveillance needs. All of the staff and technicians are very knowledge, and very helpful, fast and efficient. They know their stuff better than anyone.  Their prices are very reasonable as well. They responded to me as quickly the first time as they did the last time I called needing something else done. Really happy with how everything has turned out, and will always use Spy Pro Shop!! Thank you!!", "pics": null, "resp": null, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "101701922366446090627", "name": "Marilyn Hubbard", "time": 1564005453169, "rating": 5.0, "text": "I have always had great customer service from the folks at the store. They are very knowledgeable and patient with people like me who really don’t know for sure what they are looking for. I explain what I thought I needed and they gave me their recommendations. I have been very happy with what I purchased and went back to see more! They just have all kinds of neat things that you would never guess were cameras. A very fun place to go.😃", "pics": null, "resp": {"time": 1564009275328, "text": "Thank you Marilyn"}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "117034214258122051868", "name": "Shirley", "time": 1564004202634, "rating": 5.0, "text": "Great store!!! A+ customer service!!! Went in not knowing exactly what I needed but after talking with their knowledgeable staff I left with the perfect product. Will definitely shop here again and will highly recommend them!!!", "pics": null, "resp": {"time": 1564004311499, "text": "Thank you"}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "115207430185759453190", "name": "Victoria Faison", "time": 1564112240480, "rating": 5.0, "text": "These guys are great! Excited service. I felt very helped and welcomed. So friendly. 👍🏼", "pics": null, "resp": null, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "114945697833672343552", "name": "Mr Barber", "time": 1564008769343, "rating": 5.0, "text": "This is a great place nice family friendly and knowledgeable I would highly recommend.. I mistakenly left a review that was intended for another business the spy pro shop is great 👍", "pics": null, "resp": {"time": 1564000239203, "text": "Please everyone pray for this person .He gives everyone bad reviews."}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "117098541664549792522", "name": "Jack", "time": 1564004678642, "rating": 5.0, "text": "This store has great products and customer service is unmatched!\nThey are one of the best in the business when it comes to investigative services I highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "107299600524733523281", "name": "Rebecca Roof", "time": 1578281695829, "rating": 5.0, "text": "Nice people. Helpful and friendly.", "pics": null, "resp": null, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "112535199449092179179", "name": "David Schove", "time": 1564004879008, "rating": 5.0, "text": "Great customer service.  Learned a lot from the staff about cameras.  Will be back to buy more next month.", "pics": null, "resp": {"time": 1564009291416, "text": "Thanks David"}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "105138351444654433896", "name": "Jerry Quinn", "time": 1456283325530, "rating": 5.0, "text": "The Spy Pro Shop is such a cool place.  I had no idea that some of this stuff existed.  I was so impressed with the product knowledge on eveything they sell.  The GPS trackers, drones, video/audio surveillance was unbelievable.  Do yourself a favor and check this store out.  You will walk away with many ideas for sure.", "pics": null, "resp": {"time": 1465226521610, "text": "Thanks, Jerry. That's the sort of thing we love to hear our customers say."}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "106492890632772686089", "name": "Carrie Kelly", "time": 1455122359703, "rating": 5.0, "text": "I rated the Spy Pro Shop with 5 stars because I had previously purchased a trackimo from somewhere else,   and had a problem with the battery running down to fast.  I had to charge it every other day.\nAfter searching around for an extended battery with no luck, that was until I found Spy Pro  Shop! They made it possible for me to have a battery that will last from 2 to 6 months without changing it (so excited).  It has been a week now, and is still  showing 100% (yes!).\nThe Spy Pro Shop customer service was exquisite!  So friendly, patience, and prompt on returning my trackimo to me, after I asked them to fix it to where I could have an extended battery life on it.\nI would definitely recommend this shop to others!!!", "pics": null, "resp": {"time": 1464924352451, "text": "Thank you, you; we enjoyed helping you with that challenge."}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "100631821959112696948", "name": "Connie Briggs", "time": 1505852829887, "rating": 5.0, "text": "Jim walked me through the process of getting Wi-Fi enabled and was very patient.  I couldn't have done it without out.  Awesome customer service.  Thanks so much for getting me up and running.", "pics": null, "resp": {"time": 1564004384957, "text": "Thanks Connie"}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "114947854872628358644", "name": "Jack Knight", "time": 1539996859454, "rating": 5.0, "text": "Incomparable to any other businesses in Greater Birmingham, AL.  Love the concept, the store and the helpful, knowledgeable staff!", "pics": null, "resp": {"time": 1564004363981, "text": "Thanks Jack"}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "114694930595001994064", "name": "doc lamb", "time": 1543074828658, "rating": 5.0, "text": "Very interesting place with very friendly and knoledgeable staff.", "pics": null, "resp": {"time": 1564004344938, "text": "Thank You Doc"}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "118295129268261647230", "name": "Sam Osman", "time": 1474593376554, "rating": 5.0, "text": "For the first time you meet people that knows what they're doing customer service was amazing plenty of merchandise and great hospitality excellent service", "pics": null, "resp": {"time": 1474634470191, "text": "Thank you Sam and all of our customers; we appreciate everyone of you."}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "109859722064579446001", "name": "CRI Trains", "time": 1522183856429, "rating": 1.0, "text": "I was interested in purchasing a wifi security camera, purchased a unit only to get it home and find out that the unit did not have wifi.  I brought it back and they insisted that in fact it did.  Called the support number included they confirmed the unit did not have wifi.  Brought it back a second time for a refund and the lady behind the counter was quite rude and acted as if she did not believe me.  I would avoid this place.", "pics": null, "resp": {"time": 1522188092518, "text": "I'm sorry for the confusion, the camera was wifi enabled but was made to be covert therefore the controls were hidden behind a slide off panel that was not easily detected. I hope Mr. Hammer does not avoid this place as we would love to see him back as a customer. If by chance Mr. Hammer, you do order that camera online, we found that the entire rear panel will pop off with a little pressure and reveal the wifi switch. This was an upgraded model and I'm sorry that our people had not yet become familiar with it."}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "102474340518745711562", "name": "Jamie lee Hallman, Ross", "time": 1459273857656, "rating": 5.0, "text": "The customer services was great !!\nI wish I knew the ladies name working yesterday bc she was locking the door to go home for the day..she seen me see her closing so I turned to walk away she stoped asked if she could help me . then\nunlocked the door to let me look around. She did not rush was very sweet and patient with me.\nAlso bless her heart as I was leaving another customer walked in and she helped him out too 😊\nIsn't that the worst when your about to step in the door of a store and the tell u to get out they are closed, even if they wasn't supposed to close yet !?!\nI'm going back to day to get something that will let me look in at any time and see how my child is doing while I'm at work while being babysat for the first time. #💝Hwy280spypro!!!!!", "pics": null, "resp": {"time": 1465226444703, "text": "Thank you Jamie, the lady was Betty. We appreciate the review. :)"}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "108060166920348938263", "name": "Nathan Kimes", "time": 1446062419122, "rating": 5.0, "text": "Great shop with friendly people.  Would recommend to anyone.", "pics": null, "resp": {"time": 1446063174068, "text": "Thanks! We appreciate you."}, "gmap_id": "0x8889160877d942a7:0xdfecdf174aa5e49a"}
{"user_id": "106555765135728086828", "name": "Dixie Mae", "time": 1553010044134, "rating": 1.0, "text": "I'm just going to guess that the 2 five star reviews are granddaughter and friend or friend and son or people paid to review things well, because, from my experience, 1 star is all they get. USE SOMEONE ELSE!! We were wrong in Alabama and we handled it. We were arrested on a misdemeanor marijuana charge and live in another state. We agreed on 15%, instead of normal 10%. After we are released, they \"offered\" us a ride, 2 miles to where we had to pay to get our car out of impound. The owner and his wife would send our receipt by email and gave me the change from our friends who had sent bail money. Upon receiving our receipts, these people took 20% of our bond and charged us $65 for the trip to our car. When we asked them about it, we were basically told to get bent. So, if you want to get screwed in Alabama, let these people do it. Otherwise find another bondsman and line his pockets. Not sure how these work exactly, but I have a screenshot of this in case they can remove it and I have proof of everything I said, in case they want to challenge it.", "pics": null, "resp": null, "gmap_id": "0x888c2b7ddb6f34bf:0x5e99b9cf1ea3ffc3"}
{"user_id": "102824500198251475031", "name": "Jenni Daugomah Granat", "time": 1513698404811, "rating": 5.0, "text": "Absolutely amazing people to work with.  Pop & Ms. Joyce are two of the most honorable, kind, courteous, and genuine people I've ever had the pleasure of knowing.  If you, or anyone you know, is ever in a position of needing a bonding company, this is hands down the BEST company to have on your side.\n\nThank you and God Bless you both.\nJennifer Frias-Daugomah", "pics": null, "resp": null, "gmap_id": "0x888c2b7ddb6f34bf:0x5e99b9cf1ea3ffc3"}
{"user_id": "108579263861136596622", "name": "kenneth brumit", "time": 1533754503849, "rating": 5.0, "text": "Best trusted bonding co in Alabama", "pics": null, "resp": null, "gmap_id": "0x888c2b7ddb6f34bf:0x5e99b9cf1ea3ffc3"}
