{"user_id": "100410496741848524086", "name": "Keighly Laney", "time": 1499873102291, "rating": 5.0, "text": "Incredibly professional work. They will go the extra mile to get your papers served. I highly recommend their services for your apartment complex or law firm.", "pics": null, "resp": null, "gmap_id": "0x88891bcf81a1936d:0xc79ea18016dd7071"}
{"user_id": "102932560093225843725", "name": "Christopher Calvin Reid", "time": 1499895225351, "rating": 5.0, "text": "Van Slam, Inc. is extremely reliable. They will go the extra mile to get your papers served. I highly recommend their services.", "pics": null, "resp": null, "gmap_id": "0x88891bcf81a1936d:0xc79ea18016dd7071"}
{"user_id": "106053765223677059677", "name": "Brianna Gwin", "time": 1499871025605, "rating": 5.0, "text": "Van Slam is very professional and they do the job to the satisfaction of their customers. Would definitely recommend.", "pics": null, "resp": null, "gmap_id": "0x88891bcf81a1936d:0xc79ea18016dd7071"}
{"user_id": "113741336156475873366", "name": "Miranda Maxam", "time": 1541777796942, "rating": 1.0, "text": "I have tried to call twice so far to inquire about services and obtaining assistance for a large real estate company and everytime the receptionist answers, she hangs up immediately in my face without letting me finish a sentence. WOW.", "pics": null, "resp": null, "gmap_id": "0x88891bcf81a1936d:0xc79ea18016dd7071"}
{"user_id": "106555765135728086828", "name": "Dixie Mae", "time": 1553010044134, "rating": 1.0, "text": "I'm just going to guess that the 2 five star reviews are granddaughter and friend or friend and son or people paid to review things well, because, from my experience, 1 star is all they get. USE SOMEONE ELSE!! We were wrong in Alabama and we handled it. We were arrested on a misdemeanor marijuana charge and live in another state. We agreed on 15%, instead of normal 10%. After we are released, they \"offered\" us a ride, 2 miles to where we had to pay to get our car out of impound. The owner and his wife would send our receipt by email and gave me the change from our friends who had sent bail money. Upon receiving our receipts, these people took 20% of our bond and charged us $65 for the trip to our car. When we asked them about it, we were basically told to get bent. So, if you want to get screwed in Alabama, let these people do it. Otherwise find another bondsman and line his pockets. Not sure how these work exactly, but I have a screenshot of this in case they can remove it and I have proof of everything I said, in case they want to challenge it.", "pics": null, "resp": null, "gmap_id": "0x888c2b7ddb6f34bf:0x5e99b9cf1ea3ffc3"}
{"user_id": "102824500198251475031", "name": "Jenni Daugomah Granat", "time": 1513698404811, "rating": 5.0, "text": "Absolutely amazing people to work with.  Pop & Ms. Joyce are two of the most honorable, kind, courteous, and genuine people I've ever had the pleasure of knowing.  If you, or anyone you know, is ever in a position of needing a bonding company, this is hands down the BEST company to have on your side.\n\nThank you and God Bless you both.\nJennifer Frias-Daugomah", "pics": null, "resp": null, "gmap_id": "0x888c2b7ddb6f34bf:0x5e99b9cf1ea3ffc3"}
{"user_id": "108579263861136596622", "name": "kenneth brumit", "time": 1533754503849, "rating": 5.0, "text": "Best trusted bonding co in Alabama", "pics": null, "resp": null, "gmap_id": "0x888c2b7ddb6f34bf:0x5e99b9cf1ea3ffc3"}
