{"user_id": "107647112914985108830", "name": "rd G", "time": 1621607451478, "rating": 1.0, "text": "I don't know what's going on with treehaven gleen it's turned into a trashcan people throw trash in the parking lot and it's turned into a parking lot for broken-down cars one person on the backside set up a tent and in the grass and park cars in it treehaven is turning into a eyesore and darin needs to do something about it", "pics": null, "resp": null, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "100581196809242417752", "name": "Justin Kirk", "time": 1558493573638, "rating": 1.0, "text": "I’m not sure what you’re referring to that says in any way that we indicated the property wasn’t nasty from the start. The checklist we completed upon move in said the kitchen was filthy and hadn’t been cleaned, the walls needed paint, noted the broken electrical outlets and the nails/holes left from the previous tenant. We had to SCRUB this place. Not to mention all the spiders we dealt with for a month because you hadn’t been taking care of pest control. We would have noted the uncontrollable bamboo, but it was February and it wasn’t growing in the cold months. How can you even begin to think we caused a bamboo problem? The owner himself said he had tried to get rid of it “for years”. Exact words. Once again he himself saw the yard mowed before we moved out. When I went to check the yard on 5/13, it had not been TOUCHED since we left. All you do is blame your negligence on other people. From the yard to the unmanaged interior.\n\nThe water infiltration issue in the BEDROOM FLOOR was not due to “massive flooding”. EVERY TIME IT RAINED, water came through the flooring. And EVERY TIME it happened, you were notified and offered zero assistance in fixing the issue. This is not something that happened just once. I will be sure to find the business card from the man who came out from community development and assured me that if I called him the next time there was visible water coming through that he could see with his own eyes that they would condemn the house until the issue was fixed. I also have two other witnesses who were at the house for that conversation. We told them not to worry about it because we were getting out of the house to which he said “I don’t blame you, I’d hire an attorney”. He also said that a mold expert would need to come out to test the MOLD AND MUSHROOMS. Even your maintenance man left the house to get himself a mask so that he wouldn’t be breathing in the mold when you sent him to the house after LYING saying that YOU would send a mold expert out. This is all documented. Every single bit of it. You “allowed” us to move out because you knew you were caught. Anyone with common sense will be able to see that. You said yourself “the mold will dry out. It’s about to be warm outside”.\n\nYou can try to justify it all you want, but mushrooms growing in a bedroom is not normal. I was sick for a solid week after stirring it up while moving.\n\nNot fixing a water infiltration issue that you’ve known about for who knows how long? Negligent, irresponsible.\n\nBottom line- I’m not here to argue with you as it clearly gets us nowhere. That’s what attorneys are for. I can back up everything I’ve stated, unlike you. I’m here to warn other people of the sorry excuse of a landlord you are.\n\nAgain people, trust the negative reviews. I have no doubt in my mind that every single one directed toward Darin Bashaw is true. I’m willing to bet all my stolen money on it.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP60cplc3W3v3akVXdG8NaYY9-QhtZ37kYxqQrm=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP0FsjNiafn-4plcRjgR6_OFgR--aGGjy6E1k2x=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMd0UgQ9YfwIkHWNVoEWEFpDuY5Oo07BzwX6ln-=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMWc1h4nxNAWhHgjt6yAh1ro1jWLEEkjJ9rMS8y=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMZApkUUE915Cqc1loVhU-5dtPzt9cJJANI0BTc=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPKuB85LwHa1tuKf_yT-7QgL82FFAXcOE4pP_Aa=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM8OdAQP1lgp6G4-BnK3qx2HOAod1RlQ9EJyWxX=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMNZrlnpIqQQe-Br7Czi8KI0vbkNDMc5aPKvrFk=w150-h150-k-no-p"]}], "resp": {"time": 1558525758914, "text": "Mr Kirk once  again I am sorry that you were unhappy with home. We repaired the few minor items called out by the city in a few hours. This home has been under our management for years with no one else having the same issues you reported. You threatened legal action and we advised you of our attorney’s information. I truly wish you and your family all the best of luck.\nSharon"}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "108540470656292322937", "name": "Briana Wilson", "time": 1615630850068, "rating": 1.0, "text": "this business is a joke. I think its funny how all the reviews are the same with even more added nasty. lol its always the tenants. these units are trash the company is trash and so are the people. save your best of luck speech or whatever it is that's copied and pasted as a response. <3", "pics": null, "resp": null, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "118354110332852243931", "name": "William L.", "time": 1612968644992, "rating": 1.0, "text": "I'd looked at a property, got approved for the rental then right out of nowhere as I was going to pay the deposit the agent Darin rented it to someone else. I got no explanation of any type to why I was ultimately screwed over. DO NOT use this unprofessional company", "pics": null, "resp": {"time": 1613403446480, "text": "It wasn't really out of nowhere. We require a hold fee paid within 24 hours to secure the property. In this case the hold fee wasn't attempted for over 3 days. Until the hold fee is paid, a home is still very active and very available to anyone who can get the hold fee in first. It's not fair to other people for us to have to guess that someone is still interested when other customers are willing to place the hold fee."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "104416405384093567182", "name": "Rejeana Morgan", "time": 1615055287393, "rating": 3.0, "text": "Lived in a rental house for 4 years. Paint was rubbing/ peeling off a bedroom wall. We finally moved! After we moved they rented the property in SE Huntsville with in less than a month and our old neighbors has informed us that Huntsville property management never bothered to repaint the interior of house before moving others into property during Covid! Nasty management company.", "pics": null, "resp": {"time": 1615576038563, "text": "As the property manager we make sure every unit we manage is fully cleaned and disinfected after tenant change, per COVID guidelines.\nJust as an FYI since you may not have talked to the new tenants; they needed to move into the unit immediately and agreed to take it without getting fixed up or painted."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "118199020568014284054", "name": "Brittni McFarland", "time": 1614262502942, "rating": 1.0, "text": "HPM and Darin have labelled the safety issues in our home we discovered upon moving in as \"cosmetic\". The hanging exposed wires and other safety issues we clearly documented upon move in proves otherwise.\n\nETA 2/24/21: I have seen the reply that was made by the business. This home has been in possession by HPM for some time now. Darrin said to us that it was a \"funky old house\" and then when we told him the safety concerns he told us that he has successfully rented the property out for almost a decade and that my husband and I were \"too picky.\"", "pics": null, "resp": {"time": 1614275227378, "text": "Thank you for the information. The response was incorrectly posted. We are checking on this now."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "108930990740433718864", "name": "krr gee calypso", "time": 1613848433763, "rating": 1.0, "text": "These new people that took over treehaven gleen is bogus thay won't allow people to come and visit not to mention thay won't fix anything there's alot of other people out here that have more than two people in their apartment instead of worrying about how many people are in your apartment thay need to make treehaven gleen a secure place to live and fix things so don't rent from these people because you will regret it's not a safe place to live anymore", "pics": null, "resp": {"time": 1614016967066, "text": "We took over managing this property shortly before this review was posted. and have been working through the pre-existing issues at the property. Our management team hasn't addressed with anyone about number of people in their apartment."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "112295577507605508302", "name": "Larisha", "time": 1589995681425, "rating": 5.0, "text": "Very professional Company. Communicate promptly when you reach out to them; with experiences I've had with most rental agencies that's definitely a good sign.  Thanks Darin for your consideration.", "pics": null, "resp": {"time": 1589999769979, "text": "Hi Larisha, appreciate your kind words. Hope we can find you a nice house. Look forward to having  a great relationship. Darin"}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "110716203501138884552", "name": "Nina Maria", "time": 1566488234481, "rating": 1.0, "text": "I’m currently renting a house from this so called business, they barely call you back, it’s been two months in I have a room in the house that stay at 86 degrees. This house is infested with water bugs I don’t sleep knowing I have to watch over my children I need to find a way out of this lease. I’ll never rent from them again. Not to mention I went two weeks without a refrigerator before they got me a new one smfh. Really can somebody point me in the direction to just legally break my lease.", "pics": null, "resp": {"time": 1566489269506, "text": "I am sorry you are having issues. I looked through our records and we don't have a Nina Maria leasing with us so it is difficult to address your concerns with no address or name in our system. I am also not familiar with \"water bugs\". We have a full time receptionist at our front desk. We also have an on line system to log work orders. If I had more accurate information I could structure a more helpful response. Best of luck to you."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "103301257523484621434", "name": "Carla Davis", "time": 1531105400574, "rating": 5.0, "text": "Professional company with a nice staff. Just began renting a house and so far I am impressed. I will update as we go along. Looking forward to doing business with these great people. Very pretty rental home with all the amenities we were in search of!", "pics": null, "resp": {"time": 1533173438941, "text": "Thank you Ms. Davis, we appreciate your kind words!"}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "114920306616418113897", "name": "Trudy Harris", "time": 1533836382157, "rating": 5.0, "text": "I have rented from this company in the past, I received the best customer service from the staff in the office as well as the maintenance crew, they have always came out in a timely manner to repair any issues. The Property Manager was always available to speak with me or get back with me at his earliest convenience. If I did not have to move out of town, I will still be there. You Guys Rock!!", "pics": null, "resp": null, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "112075732644779066417", "name": "Thomas Geeslin", "time": 1570585059199, "rating": 2.0, "text": "Had a issue with my house when we first moved in and they addressed it immediately and when we had another problem it took over a week and several calls and a email. They called me back, the property manager was personable and seemed very willing to take care of the problem. I haven’t had a chance to recheck the problem yet but was told that they would handle the problem we are having as soon as possible.", "pics": null, "resp": {"time": 1552505382892, "text": "Mr. Geeslin, I am at a loss as to where this bad impression is coming from. You only a few weeks ago moved into one of our beautiful Madison rentals. There has been only one service request in the tenant portal for no heat, which was addressed promptly and had to do with the gas being still shut off at meter. No other complaints or maintenance issues were submitted that I am aware of. I did get the message from the office late on Monday and called the very next day to find out about your needing a working key for one of the 6 locks. It was a normal, pleasant conversation. So, I don't know why you are left thinking I am anything other than a normal and pleasant person . Sorry for the bad impression and that it took me a couple of days to get back to you over that weekend, but I rarely work in the office and provide my cell phone number to all owners and tenants, so I can be reached in urgent situations. I explained that we have keys, I personally tried the keys and they worked in all the locks. But, copies were made of our masters and maybe one was cut wrong? No big deal, just text me the lock that you don't have a working key for as I requested and I will get you new copies. I have yet to receive this text, so can only assume the keys worked after all. HPM and myself strive to always provide the best and promptest service.\n-Darin"}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "105676210195015168415", "name": "Lawaina Simpson", "time": 1551661745545, "rating": 5.0, "text": "Moved here from Florida to a great apartment. Have been in my apartment now for 3 years and I love it. The staff are all very nice and my apartment is beautiful!", "pics": null, "resp": {"time": 1551716443014, "text": "Thanks Ms. Simpson, we appreciate your honest review!"}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "102864605841614880492", "name": "Allison Hubbard", "time": 1526929333053, "rating": 1.0, "text": "Its hard to post a negative review without sounding like a disgruntled tenant; however, I just don't think this company know how to manage properties effectively. I had several maintenance issues that were extremely difficult to get repaired simply based on communication failures from Huntsville Property Managers. The worst of these issues was probably the 11 degree weather with no hot water and no one to contact about it. I called and left several messages and we went without hot water for about 3 days.\nI work in property management and I would never recommend this company to anyone. Thankfully the owners of our rental property switched management companies.", "pics": null, "resp": {"time": 1526933417302, "text": "Ms Hubbard, First of all thank you for letting us know about your concerns. Please know that we take the care of our tenants and the property we manage very seriously. You are correct. We were dealing with major burst pipes all over Huntsville during this time. We called several outside plumbers who were also slammed with frozen pipes. We got out there as soon as possible. We prioritized families with children and the elderly. After that we took care of service calls on a first come basis. One item in your complaint is inaccurate. We were let go due to the excessive amount spent (in the opinion of the owner) making repairs to your home.  I wish you all the best in your new home."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "109481431064136898700", "name": "Ke Ke", "time": 1545484084945, "rating": 4.0, "text": "I enjoyed my stay with this company. No major issues. I always paid my rent on time. I was never late paying my rent and i expected for them to never be late on providing maintenance service. I put in a request to have a continously stopped up sink and running toilet fixed. Months went by and no one ever came to fix it. When i put in my notice to vacate, then they finally came out to fix it when i was loading my things into a truck. I would definitely rent from them again...", "pics": null, "resp": {"time": 1533173800500, "text": "Thanks for the review. Unfortunately, we cannot find this name in our tenant rosters, so are unable to specifically address the issues you are reporting. I do not know how you submitted service requests or if the request made it to the proper people,. But, if the requests are made through appropriate channels, we are generally able to get clogged pipes cleared and running toilets rebuilt within a day or two."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "111911112626818008345", "name": "John Rowe", "time": 1528482545513, "rating": 1.0, "text": "I used these people to manage by  property, never received any of the rent money and they 1099 for the rent money  they kept for themselves. Also the Tenant that occupied the house never paid any of the electric bill which was left in my name. I believe they did this because I'm from the north. A word of warning to all people from the northern states if you own property in Alabama", "pics": null, "resp": {"time": 1533173339351, "text": "Mr. Rowe,\nNone of this is true. This house is in Albertville, an hour and a half away from our office, way too far to be a desirable listing. You begged us to manage this house with your tenants already installed, because you felt all the local people were criminal and corrupt. Against our better judgement we decided to help you out. You didn't want us to send you any rent money while tenant was there, hoping they would buy house and use those funds to help with their closing costs. Your tenants were dead beats, stopped paying rent and were promptly removed. They left the house in terrible shape, with rotting food in fridge, human waste in toilet, old rusting and broken down appliances, a severe cockroach infestation and a property resembling a land-fill with all the construction debris and trash strewn about evenly over an acre of land. The utility bill was attached to their final account with the back rent and other expenses. Their account was referred to collections when they refused to pay what was owed. When they were gone, you wanted us to list this property for sale. We reluctantly agreed to help you here as well. With your permission, we used the meager available funds as best we could to clean property and house for selling. This involved 2 guys over 3 days and 8 round trips with a 30 foot trailer filled with garbage hauled from the property. The house had to be seriously detrashed, scrubbed down and treated for cockroaches. We did the absolute best we would with what funds were available, spending more in fact than what was available in order to clean up completely. But, we were still about $10,000 short of what was needed to get the home ready for habitability, much less marketability and you refused to spend anything more. We 1099 for all the income received and also sent an end of the year statement which itemized all the expenses, leaving you with net income of $0 for tax purposes."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "109305115530776878152", "name": "Alyssa Feldhaus", "time": 1519743213982, "rating": 1.0, "text": "The worst service. Did not notify me of a $600 water leak in our home. Has made more than one major accounting error. Takes FOREVER to get a response. If I could give 0 stars I would. Sharon butler is only interested in serving those who have expensive homes. We own 3 properties and used this company for one of them simply because I don't have the time to deal with section 8 renting... she apparently doesn't have the time either. Go to management apex instead.", "pics": null, "resp": {"time": 1519748742874, "text": "I am very sorry you feel this way. The leak you are referring to was a frozen pipe within a wall which could have done major damage. I felt it was an emergency and as such took immediate action to mitigate damage. We actually manage several lower income properties. We absolutely value all our homes and clients no matter the price point. We wish Ms Feldhaus all the best of luck."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "105049716984992550227", "name": "Emily Cathcart", "time": 1549483949032, "rating": 5.0, "text": "Huntsville Property Mangers is great. My Grandparents have a few properties that HPM manages for them. They are wonderful with my grandparents they explain everything to them that’s happing with there properties and handles everything.", "pics": null, "resp": {"time": 1549485870200, "text": "Emily thank you for your kind words. We love being a trusted manager for their portfolio"}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "105224645237490344709", "name": "Tynika Dent", "time": 1548876966525, "rating": 5.0, "text": "I think the staff is wonderful. Rented from them then the property was sold. The new management was and is horrible. I am looking to rent from these wonderful again...asap. The new management forced me out in the middle of my lease and said nasty things about Huntsville property managers which I totally disagree with. Rock on guys. My name is Tynika btw", "pics": null, "resp": {"time": 1548878073438, "text": "Tynika, thanks so very much for the kind review. Please reach out to us when you are in need of a new place to live."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "103486693621123713767", "name": "Duane Harris", "time": 1551661284974, "rating": 5.0, "text": "Highly recommend this company, I’ve had nothing but positive experiences starting from the day I moved in.", "pics": null, "resp": {"time": 1551716468318, "text": "Thanks Mr. Harris, we appreciate your support."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "106698921660253302274", "name": "Charlsie Kirk", "time": 1558456491766, "rating": 1.0, "text": "RENTER BEWARE - 14020 SANDHURST DR SW\nToday I received an email that the property I recently moved out of is back up for rent and $225 more per month than what I was paying. I’m here for this review to warn the next renter of the nightmare that is Darin Bashaw, and how poorly this property has been maintained. First and foremost, false advertisement. This is not a 3 bedroom home. It’s a 2 bedroom (one of which is COVERED in mold) and has a sunroom that directs you to the back yard (that is an uncontrollable BAMBOO FOREST). It is NOT a clean home, but rather the complete opposite. This house is NASTY. When we moved out after only 2.5 months, there were MUSHROOMS growing in the bedroom and bathroom. Absolutely NOTHING was done about a water infiltration issue that we reported to Darin 3 weeks after move-in, which resulted in us having to send an official letter to move out without penalty. As if that weren’t enough, we weren’t informed of the uncontrollable bamboo growing in the yard. When we moved out, the yard was mowed, yet Darin stole $120 of my deposit that he was supposed to return “due to neglect of the yard” THAT HE HADNT EVEN MOWED WHEN HE STOLE MY MONEY. He let that yard grow for TWO SOLID WEEKS after we moved out. The OWNER OF THE HOUSE saw it mowed with his own eyes when he came to check on his house after the CITY came and wrote them up for all kinds of things that needed to be fixed but weren’t. This includes electrical outlets, DRY ROTTED WOOD, poorly sealed doors, the shed out back, and who knows what else. They have not had time to tackle the mold issue since we moved out. I know this because I was there last week 5/13 to get my mail and check out the yard. They hadn’t even cleaned. I know this because the overflowed trash was still sitting in the carport and hadn’t even been taken to the road for pick up. This was such a terrible experience that we now have a lawyer so that we no longer have to deal with this man. I have pictures and videos of this entire experience, which include Darin cussing my husband and being completely irate when we returned the keys. All I can say is TRUST THE NEGATIVE REVIEWS. This man ROBBED me of my deposit and three months worth of rent and let my family move into a MOLD INFESTED HOME. He is a crook and a PITIFUL excuse for a professional. I’m embarrassed for the company he works for. What a terrible representation of a business.", "pics": null, "resp": {"time": 1558466063979, "text": "Ms Kirk, I am sorry you were not happy with your home.\nYou were allowed out of your lease early. The \"mold\" was categorized by Community Development, who came out as your request, as mildew. Additionally, this was after the massive flooding experienced by all of Huntsville. The list from the city was minimal and so unimportant that they gave us until the end of summer to make repairs. The bamboo was in existence for years and controlled via mowing. You were responsible for the yard. Because you didn't maintain the bamboo is now out of control.  We have rerented the home and have now needed to deal with the bamboo.\nYour move in report rated most of the house as acceptable upon move in. Again I am sorry for your experience and wish you all the best."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "103849576635811201840", "name": "Bob Armstrong", "time": 1551719039312, "rating": 5.0, "text": "They have managed my building for 3 years now and I have 4 words to describe them, responsive, trustworthy, professional and dependable", "pics": null, "resp": {"time": 1551724928777, "text": "Thank you Mr. Armstrong, we value your business and look forward to many more years together!"}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "102564323113491251019", "name": "Eli Allen", "time": 1552493412659, "rating": 5.0, "text": "Huntsville Property Managers helped me rent my house a few years ago when it wouldn't sale. They just arranged for the tenant to purchase, though their Intero affiliate. Couldn't be happier about the 'full service' and great attitude.", "pics": null, "resp": {"time": 1552504517458, "text": "Thanks Mr. Allen, it was a pleasure doing business with you!"}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "103939242137992317217", "name": "Kelly F", "time": 1544560690265, "rating": 1.0, "text": "Don't waste your time or money.  We're now stuck in a lease and haven't even moved in yet.  Went to view the house on Monday, Dec 3.  On Dec 4 I emailed that we were prepared to pay the deposit for the house and was told \"I can probably get it finished up for you to sign the lease on Friday.\"  Come Friday we heard nothing about whether the house was ready so text the property manager for an update who replies \"The lease was ready in the office today. You weren't able to make it?\"  Well, no, no one said it was ready.  We meet at their office Saturday to sign the lease, get keys, and of course hand over money...then we go to the house.  Not cleaned.  Text the mgr to let him know it's not clean and he replies \"The carpet and linoleum are brand new, so you should be able to move your furniture into the house. I will see if I can get someone back, though it has been cleaned and may not get any cleaner looking.\"  No, this isn't cosmetic, this is filthy and lazy. That evening I email several pics of the house and receive no reply.  Three days later still no reply so I call him.  I say hello and who I am, to which he replies \"yeah?\".  I say I'm calling for an update on the house being cleaned.  He says it is clean, just not to MY standards.  He says the carpet and linoleum are new, to which I reply that doesn't mean the house is clean.  I asked him about the pic I sent of the AC return vent.  His reply was that there's a filter.  Oh, so the filth caked up on the outside is ok because there's a filter.  I ask about the storm shelter.  He says they cleared it out.  Well, my pics show otherwise.  I ask about the closet with trash on the shelf and animal hair all over the floor, how a broom has never touched the floors and that I don't want to put my groceries on the filthy pantry shelves.  He replies that he has been doing this a long time, that any other person would've moved in already, how much they have already spent getting the property ready, and that I obviously require extra care so he'll send someone back out tomorrow.  After being insulted I suggested that maybe this isn't the right thing for us and what can we do.  He said we've already signed the lease so nothing.  I asked if this is what we should expect over the course of our lease and he replied that it's up to us, not him, said have a nice day and hung up on me.\n\n**And in response to the records indicating the move in is next weekend and you \"agreed\" to early move in...that is simply incorrect.  Your records may show that as an estimated date but then why would I be told on Dec 4 that the house could probably be finished up by Friday (Dec 7)?  Doesn't make sense. If the house simply wasn't going to be ready then I would've preferred that answer over being stressed that it really wasn't yet.  But I am very appreciative of the effort to have someone out so quickly to clean.  Hopefully the relationship improves moving forward.", "pics": null, "resp": {"time": 1544557173535, "text": "Kelly I am sorry you are unhappy. Our records show you were due to move in next weekend. You asked for a weeks early move in middle of the week. The home was not ready, but we agreed to your early move in. The cleaning person is over there as we speak re cleaning. This was the first opening she had.\nThe home has new carpet and linoleum.  The storm shelter is an exterior structure. We do not clean those. I am confident you will be comfortable in your new home."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "115037586996454499876", "name": "Darin Bashaw", "time": 1570552173591, "rating": 5.0, "text": "Great company, nice working environment, nice and helpful staff!", "pics": null, "resp": null, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "111310348648223622743", "name": "Vicki Whisenand", "time": 1543699327829, "rating": 1.0, "text": "This company is rude and do not take care of their properties. When accused of not paying rent even with cancelled check on the 2nd of the month they don’t apologize. They allowed a water leak to go on for months. And when phone calls are made to them they are rude and flat out say “that’s your problem”.\n( I am reporting this for a relative that is afraid of retaliation. She has been treated very badly by the staff. Has paid her rent on time every month and has been very patient with their rude and nasty responses)", "pics": null, "resp": {"time": 1543604140884, "text": "I am sorry to hear you are not happy with our company. I have researched and cannot find your name as a tenant of ours either past or present, so it is difficult to answer with any relevant information."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "111095725822008431645", "name": "Jessica Hanes", "time": 1551660764290, "rating": 5.0, "text": "Great company, were very attentive of my needs. Definately recommend", "pics": null, "resp": {"time": 1551716499913, "text": "Thanks Ms. Hanes, we aim to please!"}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "104422822995985914588", "name": "Adam Garrett", "time": 1545283300748, "rating": 5.0, "text": "Honest and sincere peaple very satisfying  to do business with.", "pics": null, "resp": {"time": 1548889348175, "text": "Thank you Mr. Garrett, we appreciate you kind words."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "109624686710994612270", "name": "FurMair", "time": 1549502416548, "rating": 5.0, "text": "Great company, the staff are very nice and responsive to my needs!", "pics": null, "resp": {"time": 1549503341666, "text": "Thanks for your kind and supportive words. I don't recognize the name, but I am sure you are a great tenant, too!"}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "111917549816288431449", "name": "fred g", "time": 1552494886558, "rating": 5.0, "text": "Great company,  great manager, great staff", "pics": null, "resp": null, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "112722149717862097464", "name": "margaret lessa", "time": 1549563720068, "rating": 5.0, "text": "Great Company, Love my apartment", "pics": null, "resp": {"time": 1549566861185, "text": "Thanks Ms. Lessa, we appreciate your positive  review of our company."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "107831855702145853215", "name": "Decaurrey Clark", "time": 1532454381654, "rating": 1.0, "text": "Horrible company. Takes weeks to get maintenance requests filled. They half step on everything..", "pics": null, "resp": {"time": 1533171843515, "text": "This tenant issues are exaggerated and/or not true. She moved into an apartment we had been managing for exactly one day. The first time I looked at unit was when I showed to her, it wasn't ready by our standards to move into, but she had a moving truck full and wanted it immediately. We honored her request and conducted the screening and had new lease prepared the same day, letting her move in to the apartment in existing condition. She complained immediately about a leaking sink drain in kitchen. The property manager himself fixed that sink within an hour. She had a couple of other minor complaints and was instructed to properly submit service requests through the tenant portal, so maintenance can can get on them most efficiently. To date, she has never submitted a service request appropriately. She was quiet until July 18, when she just came back from a trip and said the fridge went out and all her food was spoiled. I was going to send someone to take a look, but she also said it was working again. Next, she started texting the property manager after hours on Friday July 20th, and then angry texting on Saturday the 21st at around bedtime. She was informed that nothing can be done over the weekend and maintenance would check first thing on Monday. Maintenance did go out on Monday and determined the fridge needed to be replace, she also mentioned the water heater didn't work. Water heater was discovered to have a leak at electrical control panel, causing it to short which is something we considered an emergency, and water heater was replaced the same day that Monday. We have contractual obligation to address any non-emergency issues over $300 with owner prior to spending their money. Sometimes it may take a few days to get in touch with the owner for directions, which will delay our repair response time. This owner approved for a new fridge on Tuesday and one was ordered immediately. We also have a fiduciary responsibility to  owners and have found the most expedient and affordable way to get new appliances is to order online, where we can shop the best deals and take advantage of free delivery and hauling of old appliances. When we do order, we always order something in stock for next or 2 day delivery. In this case, for whatever reason, Lowe's needed a couple of extra days but still, a new refrigerator was delivered by the end of the week. We also have a legal responsibility to tenants to address any health and safety issues within a 2 week time frame. Even if we cannot get in touch with owners or get adequate instructions, we will go out of our way to meet our legal obligations, while also meeting our fiduciary obligations. We strongly recommend our tenants carry renters insurance so they can file a claim for any damages or spoiled food."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "109186854653881715655", "name": "Fred Quiroz", "time": 1550845029081, "rating": 5.0, "text": "Love this company!!!", "pics": null, "resp": null, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "103433082787575398042", "name": "Monday Hale", "time": 1546438066245, "rating": 1.0, "text": "I wish I seen the reviews", "pics": null, "resp": {"time": 1546440996531, "text": "Ms Hale, I am sorry you are unhappy. Your review, however, gives me no information to go on. I looked through our work orders and didn't see any outstanding. Please let me know what needs are and I will attempt to resolve. Our tenants satisfaction is of course important. Please give me more information. Our office is open and you are welcome to call in and talk with our receptionist."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
