{"user_id": "115063942055065695293", "name": "Donna Hall", "time": 1622111241746, "rating": 5.0, "text": "Rudulph managed my property for over 20 years. As a property owner, they made it super easy to get property repairs completed, screen tenants, and give good advice as needed to update the property. They follow the law with tenants and do have the property owner’s best interest. They have always been fair and I always got paid on time. Highly recommend to anyone who may be considering a property manager for their rentals.", "pics": null, "resp": null, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "108564189305403949616", "name": "Brittany Wiginton", "time": 1621940830921, "rating": 1.0, "text": "I rented a house with Rudolph Realty and I have to say they are the absolute WORST company I’ve ever had to deal with. So unprofessional, unreliable, and untrustworthy. They do not have the owners best interest at heart; and definitely not the renter’s. The only way to contact them is through email, in which they don’t answer often. Had to send several follow up emails to get anything done. (Bc they don’t have a phone number to call anyone). Took two months to get my security deposit back and then they hit me with stupid charges so they didn’t have to refund the whole thing. Sooo glad to not be managed by them anymore! Just wanted to let anyone looking for a rental company know so you don’t get stuck in a contract with them and regret it.", "pics": null, "resp": {"time": 1621943117922, "text": "Brittany,\n\nBy law, we have up to 60 days to close out the security deposit. You vacated the property during one of our busiest months of the year so it took longer than usual to get to put together the invoices and close out your file.\nOverall, the move out went well except for the overpowering pet odor. The carpet cleaners you used did an insufficient job in cleaning the carpets and we had no choice but to have the carpets cleaned again.  You do not get to determine how much a company can charge for cleaning carpets.\nWe have responded promptly to each and every one of your email inquiries.  You seemed to have a bigger problem with not being able to call our staff and verbally berate them as you did when you 1st took possession of the home. Hostile/emotional phone calls from you to my staff were the main reasons we switched to email communication only.\nWe wish you the best."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "107349730751486546241", "name": "Timothy Hall", "time": 1617234345331, "rating": 3.0, "text": "Not great: They could be hard to contact at times, but if there was an issue, maintenance was always out promptly. Some of the staff weren't very friendly, some were.\nThey will give you your security deposit as late as they can (& for me falsely claimed a car was parked in the yard).\nThey also didn't communicate with the home owner about the pet deposit they collected on the owner's behalf.\nThey're inflexible when it comes to business dealings. They will do what's in your contract, nothing more and nothing less.\nThey're far, far from a slum lord, but also far, far from the best rental agency I've worked with.", "pics": null, "resp": {"time": 1617297460537, "text": "Tim, we appreciate the kind words. I hate to here you had somewhat of a bad experience.  You are correct about being inflexible.  We follow the  Alabama Landlord Tenant Act.  All tenants are held to the same standard when renting a home and when they vacate.  We try to process the security deposit refunds as quickly as possible and sometimes the we use most of the 60 days given by the Alabama Landlord Tenant Act. I'll research your comment about the pet fee.  If a pet was listed on your application, you would have paid a non-refundable $200 pet fee at the time you took possession.  Any funds collected would be credited to the home owner's account."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "104568596931290027237", "name": "Marcie Gaylor", "time": 1598058511230, "rating": 5.0, "text": "Grateful for the guidance of an excellent property management team to help us figure out how to be landlords with Rudulph Realty, Inc. for the last 6 years(!). They walked us through the finalization of the sale of our first home today. It’s been a wild ride, and I am grateful for their competence, confidence, and professionalism. 5 out of 5 stars. Highly recommend. Excellent managers, bookkeepers, maintenance staff. Everyone on their team has treated us well for years.", "pics": null, "resp": {"time": 1598063493415, "text": "Marcie, thank you much.  We appreciate the opportunity to work with you over the last 6 years."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "109145148501798279614", "name": "Adrianne Thompson", "time": 1587661465338, "rating": 5.0, "text": "We've used Rudulph for years to manage our rental property and they have provided a valuable service for a very reasonable fee. The staff has been immensely helpful with any repairs or maintenance and have always been able to quickly handle any issue that has arisen. They are easy to reach by phone or email and friendly to work with. I would highly recommend this company to anyone looking to simplify their property management.", "pics": null, "resp": {"time": 1618503792219, "text": "Adrianne, thank you much. We enjoyed working with you over the last 8+ years.  Best of luck moving forward and we welcome the opportunity to work with you again in the future."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "105729657598179872536", "name": "Robbie Shugrue", "time": 1602160149844, "rating": 1.0, "text": "Any 1 renting for this place needs 2 b aware your deposit is theres. They  charged me 500.00 dollars for loan service when the front is a drive way an the back is a little fenced area  with gravel  sent some 1    3 times before the air was working an then it went out more than 1 time. Ice maker after 2 attempts  I turned the water off.  I fixed the toilet after not hearing back. Oh but the best was u  could wait 10 days  late 2 pay during covid  virus.  Very generous. Any 1 wanting 2 rent check out continental  reality they answer the phone an have quick  maintenance  response.   I no because I worked for them. CONTINENTAL. REALITY.   People that came 2 visit was shocked at what I paid.  It was not all that . The little back yard looked like a jungle when we moved in. Remember Continental reality", "pics": null, "resp": {"time": 1602018435883, "text": "Robert,\nThe owner of the property determined the cost for putting the yard back in order.  Once you vacated the property, we were no longer involved."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "106205118766596250146", "name": "Jon Kennamer", "time": 1584817057364, "rating": 5.0, "text": "Rudulph has been managing my rentals since 2006.  I just used the company to sell one of my properties.  Great service, Rudy and his team are easy to reach when I need them.  I was pleased with the sale of my phone.  As an absentee landlord, I need a management company that can handle everything, and Rudulph does that for me.", "pics": null, "resp": {"time": 1618503865404, "text": "Jon, we appreciate your thoughts.  It has been a pleasure to work with you over the last 10 years."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "101695382141699218725", "name": "Brian Kirk", "time": 1551306338187, "rating": 5.0, "text": "I have had a wonderful experience with everyone at Rudulph over the past 2 years.   They have handled all aspects of managing my rental in a professional manner.  The staff is always courteous and quick to answer any questions that might arise.  They have also helped sell my house in a timely manner(1 week on market).\n\nI highly recommend Rudulph for your rental needs or if you are looking to put a house on the market.\n\nThanks!", "pics": null, "resp": {"time": 1551308854174, "text": "Thanks Brian.  We appreciate the opportunity to work with you over the last few years.  Please keep us in mind for anything that comes up in the future."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "101238289999219235068", "name": "Hannah Coffin", "time": 1557348203265, "rating": 5.0, "text": "Rudy and his team managed our house for the last eighteen months.. Best money I ever spent.. Their team was professional and took care of everything..  We were in CT and I never had to worry about our rental or leasee.   I highly recommend this service and believe this is the best rental management company in Alabama.", "pics": null, "resp": {"time": 1557352784789, "text": "Hannah,\nThank you much.  It was great to work with you guys.  We look forward to working with you again in the future."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "115830024513567133735", "name": "Krissi Orlando", "time": 1499876331280, "rating": 5.0, "text": "It is no wonder that Rudulph Real Estate, Inc. has almost five stars because they deliver five star service. In my opinion, they are the best property management company in the area. This is a well run, family owned Birmingham, Alabama business. They take pride in what they do, and it shows. I knew I would work with Rudy and Rudulph Real Estate, Inc. from the first phone call. They have made the property management process a seamless one. They are always very quick to respond to any questions or concerns I have, and they treat my condo like it is their own. I live almost 800 miles away from Birmingham now, but I rest easy knowing that my home is in good hands. You can bet that yours will be to.\n\n***** This is NOT a paid endorsement. This is solely my opinion.*****", "pics": null, "resp": {"time": 1499887351269, "text": "Krissi,\nThank you much.  I'm stoked we were able to get this done so quickly.  I am looking forward to getting updates from you as you start this new chapter of your life."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "113660240420184351405", "name": "Alicia Hiden", "time": 1370307498507, "rating": 5.0, "text": "As a newcomer to Birmingham, I needed help finding a place to live. I signed up with most of the rental companies in the area and Rudulph Real Estate exceeded them all. Their application process is short and straightforward. They work around your schedule and will try to accommodate your requests. The staff is very friendly and knowledgeable. They know what's available and are able to guide you to your needs. For instance, my requirements were very particular; I wanted a house with a yard for my pet, full of charm and walking distance to restaurants and groceries. Amazingly enough, there was a house available with my criteria. I could not be any happier here. Since I have moved, I have only had minor items needing to be fixed, Rudulph sent a professional crew to take care of the items in a timely fashion.\n\nI recommend Rudulph Real Estate to everyone. Best in town!", "pics": null, "resp": {"time": 1408654936075, "text": "Alicia,\n\nThank you for your feedback."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "106000568999013544720", "name": "Will Caldwell", "time": 1512407344195, "rating": 5.0, "text": "I had a great experience with Rudulph Real Estate while looking for a place to rent in Birmingham on short notice. Everyone there was very friendly, helpful, and professional. I was especially impressed how they well listened to our needs and how honest they were at every step. I wouldn't hesitate to recommend them or work with them in the future.", "pics": null, "resp": {"time": 1512408792211, "text": "Will,\nThank you much.  Im glad to hear you guys found a home that fit your needs.  Please keep us in mind for your future housing needs."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "111731759914264841384", "name": "Sean Isaacs", "time": 1519243574635, "rating": 1.0, "text": "I've rented for over 10 years and have never had a place require an application or a \"fee\" just to look at a property. This should have been a sign of how they were to work with, but we tried it anyway.\n\nWe filled out their application, paid their fee, and looked at the home. It needed a lot of work done. The floors were really scratched up, the walls had holes in them, the patchwork and paint work looked like it was done by a child. Not to mention this property hadn't been cleaned in a long time.\n\nTheir application packet came with an offer page. I made a reasonable offer, asking for a small discount to forgo them fixing the floors, paintwork, and cleaning. They said they were \"insulted\" by my offer and wanted nothing to do with us a applicants.\n\nThey told us if we followed their process, it would work out. Well, it didn't. And now we are stuck with finding a new place to live and only have a few days to do so.", "pics": null, "resp": {"time": 1519252019552, "text": "Seen (or Sean),\nLet's review the timeline of events.\nYou initially come into our office and had issues with the fact that you must pre-qualify in order to check out keys to view the property.  We do this to ensure that neither you or our staff have to waste their time if a potential renter has an unsatisfactory credit score.\nYou boldly stated that you are a car salesman and \"you know how to negotiate\".\nAfter speaking with you about your concerns where you may or may not qualify, you were instructed to turn in the application so we could process it and determine if we could rent to you and your family.\nYou offered $1,300/month on a $1,650/month rental and you demanded that my client waive the February and March rental payments.\nI took your offer to the owner who informed me that he was insulted by your offer and would not consider you as a renter.\nKeep in mind, you came to us.  You may be a car salesman but my client is not buying a car.\nYou were not charged the full application fees.  We did everything we could to work with you.  I'm sorry you are scrambling for a home and we wish you the best of luck moving forward."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "112599576930262158930", "name": "Julia Knox", "time": 1553274534665, "rating": 5.0, "text": "i can't say enough good things about Rudulph! We have been tenants since moving to Birmingham because we wanted to get to know the city before buying a home. Because we had been homeowners for over 20 years we were a bit nervous about renting, but Rudulph has been great. Responsive, friendly, and they clearly communicate well with the owners as well as the tenants. If I ever have a property that I want to rent out, or need a rental home again, I would choose Rudulph.", "pics": null, "resp": {"time": 1553275554518, "text": "Julia,\nThank you much.  We appreciate you guys.  Congrats on your new home."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "103944067393455921855", "name": "Diana Weaver", "time": 1523970254956, "rating": 5.0, "text": "We moved here from Baltimore for my husband's work & were living in a 2 bed apt. Last year, my mom came to live with us so we were pretty cramped.  I started looking for rental houses & came across Rudy's site.  While working with him,  we decided to get approved to buy.  Rudy immediately switched from rental to purchase for us.  We took up his weekend's for about 4-5 weeks as well as a few week nights as we were crunched for time with our apt. lease.  He worked his butt of to find us a house.  He is very knowledgeable about the area, very easy to talk to & has an easy going personality,  had great suggestions & knows his comps. We found a great home in Ballantrae & we could not have done it without someone who was concerned about us finding the right place. We highly recommend using Rudy when buying a house! On top of all that,  we now consider him a good friend!", "pics": null, "resp": {"time": 1524091321893, "text": "Diana,\nThank you!! I appreciate the opportunity.  You guys were the first to go through our new full service concept.  It was a great experience.  I'm looking forward to BBQ at your house for the Bama/LSU game..... RTR."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "100506859634900351692", "name": "JRicky", "time": 1500053545161, "rating": 4.0, "text": "You wrote a review for Rudolph Real Estate\n\n7/14/2017\n\nRudolph manages my 3 rental properties, one in Alabaster and two in Hoover.\nThey (Rudolph) conduct their business in a professional straightforward manner.\nNo hidden charges,  surprises or tricks.\nRudy (Rudolph) insist on the property being clean and move in ready.\nRudy is fair & does what he says he'll do.\nIf you are looking to rent or have property to manage then Rudolph Realty is the one to call.\nRichard.....Owner", "pics": null, "resp": {"time": 1500055255614, "text": "Rick,\n\nThank you for the opportunity to work with you over the last few years."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "101774529915377291736", "name": "Wayland Coleman-Dancer", "time": 1558575280923, "rating": 5.0, "text": "Rudulph Rents is nothing less than professional. The customer is their highest priority, and make sure you know that. They’re the best in the business and I highly recommend.", "pics": null, "resp": {"time": 1558579052038, "text": "Wayland,\nThank you much.  We appreciate the opportunity to work with you over the last 2 years.  Best of luck with all you guys have ahead of you.  We look forward to working with you again in the future."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "102878359084958395053", "name": "Marcus Chamberlin", "time": 1497362374434, "rating": 5.0, "text": "This company has been my rental property managers for four years. As a military member, I ask for upfront information and feedback when inquiring about my property and Rudy has been nothing short of professional, timely and a straight shooter!  I valued his opinion and welcomed his recommendations regularly. His work with my tenants ensured my home was always kept in top notch shape and his ability to swiftly handle any/all issues saved me from constantly worrying about the house.  Would I recommend Rudolph Realties, you bet I would!  Without a doubt this company is the premiere rental company in the area!", "pics": null, "resp": {"time": 1497488976498, "text": "SGM Chamberlin,\nI appreciate the opportunity to work with you over the last few years.  Good luck with what you have coming up.  We will be sure to link up with you when we get a chance to head that way later this year.\n\nRudy"}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "117299487723116120427", "name": "Mindy Dees", "time": 1533131213487, "rating": 5.0, "text": "Rudulph managed our rental property for 8 years and working with them was absolutely 100% the best decision we ever made as private landlords. When it came time to sell the property, Brittany stepped right in and handled every single detail. We live 4 hours away, and we never had travel once to the property. She handled it all - from listing to closing and had the property sold and closed in less than 4 weeks. By far the best real estate experience we had was working with Rudulph both in rental management and sale!", "pics": null, "resp": {"time": 1533133524212, "text": "Mindy,\nThank you much.  It has been a pleasure to work with you guys over the last 8 years.  We appreciate the continued support as we watch the Dees referral tree grow every year.  Look forward to catching up with you guys next time we are in your area."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "118191451635241348616", "name": "Cynthia Araujo", "time": 1450822203764, "rating": 5.0, "text": "We relocated from PA to AL with less than 2 months notice and with only 2 days to view available properties.  Having a very unique situation and little time, we needed a real estate company that was willing to work hard and fast to meet all our criteria in a home: Good School district, close proximity to work, and pet friendly were the top 3.  Rudy Rudolph and his staff had multiple properties that met many or all of our criteria.  We were able to view all the properties that we were interested in with very short notice.  Relocating to another state on short notice can be extremely stressful but Rudy and his staff made our experience very pleasant.  We have recommended Rudulph Real Estate Inc. to several people looking for a property manager and will continue to recommend Rudulph Real Estate.", "pics": null, "resp": {"time": 1450830152910, "text": "Cynthia,\nThank you much for your thoughts.  I was stoked that we were able to work out a deal on one of our homes.  It was good to see you guys at the Veteran's Day Parade.\nMerry Christmas to the entire family."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "109015481455976338106", "name": "Dan Wentz", "time": 1374510485493, "rating": 5.0, "text": "I just ended my lease after 3 years with Rudulph.  I'm updating my previous review as I now understand that the company has made many positive changes over the last 2 years.\n\nI received prompt, professional service and was treated fairly through the end of my lease and on final move out.\n\nI would rent from them again based on my experience, and you should not hesitate either.  Don't trust any reviews from more than a year or so ago... they've changed for the better.  Great, GREAT experience.", "pics": null, "resp": {"time": 1408654833229, "text": "Dan,\n\nI took over as property manager a few months after you first took possession of this home.  You and I went through a lot over the 3 years you were renting a home from us and I can not tell you how much this review means to Rudulph Real Estate.  I wish you the best with wherever you are going.  Please do not hesitate to contact us again in the future."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "112408507792710823588", "name": "Tonya D", "time": 1484865496700, "rating": 5.0, "text": "Rudulph Real Estate was ALWAYS excellent. I was a tenant for 6 years and through that time they were always quick and helpful for anything that we needed. Their office staff is always pleasant and willing to help. They even called to check on us and make sure we didn't need anything when we were going through a serious illness in our family. I would definitely recommend Rudulph Real Estate.", "pics": null, "resp": {"time": 1484870027996, "text": "Tonya,\nThank you for your kind words.  I hated to see you guys go.  You guys were one of the 1st applications I processed 6 years ago.  We wish you the best.  Please keep us in mind if you find yourself in need of our services in the future.\nRudy"}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "105500754007228460486", "name": "Gwynne Mountz", "time": 1435178952350, "rating": 5.0, "text": "My husband and I can not say enough good things about Rudulph Real Estate. If you are looking to lease your house out, definitely contact them! We started leasing our house out through them back 10 years ago. They were always responsive and took care of the house and the tenants' needs. We did have a couple of less than ideal renters and Rudy and his team always took care of any issues that we had. They kept excellent records on our home of any repairs that were made.\n\nBrittany Rudulph is an outstanding Real Estate agent. She recently sold the house mentioned above after we had it on the market for 330 days with a different realtor and Real Estate company. She was able to sell our house quickly - something we call miraculous!\n\nCheck them out today! You won't be disappointed!!", "pics": null, "resp": {"time": 1435180251684, "text": "Gwynne,\nThank you much.  I have enjoyed getting to know and spend time with you guys over the last few years.  I know Brittany and I came to the company after you had already been with us for several years.  We look forward to many more memorable dinners in the future and can't wait for the house warming party.\nRudy"}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "116845412556012158230", "name": "Mike Lee", "time": 1520022099363, "rating": 4.0, "text": "I've done business with the Rudulph family for a decade and have received an unsurpassed level of service. They know their customers and treat them how they'd like to be treated. Honest, dependable, always professional and on time. Top notch. Highly recommended.", "pics": null, "resp": {"time": 1520022783838, "text": "Mike,\n\nThank you much.  I look forward to working with you again in the future.  Enjoy the retirement!!"}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "112155995195720130960", "name": "bruce donnellan", "time": 1534284245825, "rating": 5.0, "text": "For the last several years Rudulph has managed a rental property in Ross Bridge.  Every time there was a problem, they were on it.  When it was time to renew the lease, they were on it.  When it came time to sell, they were on it.\n\nThey did a great job from start to finish and I would recommend them to anyone.", "pics": null, "resp": {"time": 1534291005697, "text": "Bruce,\nThank you for the opportunity to represent you as a property manager and as your listing agent.  Look forward to working with you again in the future."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "108408599700874330329", "name": "Terri Nicole", "time": 1428544468002, "rating": 5.0, "text": "What a great team of professionals! We rented from Rudulph for 3 years and were immensely pleased with them from start to finish. That is saying a lot because there were issues with the property owner not meeting the standard of maintenance that Rudulph requires on several occasions. Each time, Rudulph did everything in its power to encourage the owner to comply.  Eventually, Rudulph decided to end its relationship with the owner, which made sense to us as  well.\n\nUpon move out, the owner sued us for $3,500.00 in trumped up damages. Instead of leaving us high and dry, Rudulph took care of us and we only had to pay our security deposit, which was fair. We could not have asked for more support from any company.\n\nIf you are thinking of renting from Rudulph, I can assure you they operate with integrity and truly look out for their tenants. We are now looking to rent again and of course, we would not consider using anyone else but Rudy and his team of caring, knowledgeable professionals.", "pics": null, "resp": {"time": 1428545336920, "text": "Thank you so very much.  It was great to run into you today.  I'm glad it all worked out in the end.  Looking forward to working with you again."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "103826971469544463314", "name": "Coleysia", "time": 1530117134069, "rating": 1.0, "text": "Terrible company that lacks integrity. I am currently moving out of an apartment and I pay $1200 for my rent. I was inquiring about a townhouse they have listed for $1200 (I’m thinking same price, more space, makes sense). I thought this would be a simple transaction but boy was I wrong. I submitted an application and the security deposit (equal to one months rent). I passed the credit check, employment/ salary verification, and rental verification. You would think that would be enough to enter a contract.\n\nMy application was denied because the owner didn’t feel comfortable renting to me because I’m on (unpaid) maternity leave. I return back to work in August ( which was confirmed by my job). To prove I was secure financially, I offered to pay July and August rent to ease concerns. The owner still didn’t feel comfortable. I called back and offered to pay up until October (4 months). The owner still didn’t feel comfortable renting to me. At that point I knew I could offer to pay up the entire lease and it wouldn’t matter, because it wasn’t about maternity leave.\n\nI was told negative things about this company prior to my inquiry but I decided to try them out anyway. I see this is just the way these people are. I’m not going to make accusations but I’m a well educated, professional, African American woman. Draw your own conclusions.", "pics": null, "resp": {"time": 1530118513958, "text": "C C,\nYou were turned down because you did not meet our posted minimum requirements.\n1) Combined monthly income of 3 x the monthly rent in garnishable wages.\n2) Minimum credit score of 600 for all adults to be considered.  Having a 600 credit score does not guarantee that you will be accepted but your application will be considered based on the other criteria.\nYou were initially turned down because you did not meet the combined income of 3 x the monthly rent in garnishable income.  The other adult on the application reported no income on their application.  You and I spoke on the phone and you asked me if you could pay several months up front to cover the time until you went back to work.  I called the owner last night and reviewed the application with him and gave him your offer.  He said he did not feel comfortable accepting the application based on the information that was given."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "103381396086505866574", "name": "Drew Herring", "time": 1439309702442, "rating": 5.0, "text": "I rented a house from Rudulph for 2.5 years and had a great experience.  Management and staff were always friendly and very helpful.  On the occasions where repairs were needed, they were done quickly and professionally with minimal intrusion.  I would definitely recommend renting from Rudulph!", "pics": null, "resp": {"time": 1439311024879, "text": "Drew,\n\nThank you for your thoughts.  We enjoyed working with you.  Good luck on this next chapter of your life and please do not hesitate to reach out if you find yourself in need of our services again sometime in the future."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "105732666323191779056", "name": "Rick Ryan", "time": 1468014680671, "rating": 5.0, "text": "I used Rudulph Rental company to manage my property for 2 years and could not have been more impressed and satisfied with their service. Staff was always pleasant to talk with and were always very professional. I would recommend anyone who is looking for a rental company to use them. Thanks for everything!", "pics": null, "resp": {"time": 1468015810104, "text": "Rick,\nThank you much.  We enjoyed working with you guys and wish you the best in the sale of your home."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "113777842936322254210", "name": "S B", "time": 1515793372986, "rating": 1.0, "text": "I don’t want to go into complicated details, but what I will say is that miscommunication has now cost me a great deal of money. ($10k+) I will also recommend to anyone using this company: that any communication be done ALL in writing.\n\nWhat’s even sadder is that after renting/selling my home with them for years, my side of the story was considered a LIE & there was no attempt to keep me as a customer. To say I am disappointed is a huge understatement. I also just think that people should treat others better.", "pics": null, "resp": {"time": 1515796047249, "text": "Ma'am,\nThe details are not complicated.    We had a roofing company ready to take care of what needed to be done after the adjuster went to your home.  Your father said he had a buddy who was a roofer who could handle the issue.  Your father's roofer is to blame for not removing the wet/molded insulation in the attic.  Your father's roofers did not put the gutters back on after the repair.  You asked us to handle.  Our contractor said the roofer did a sub-par job. You asked us to send everything to your father.  We did as you asked and he blamed us for what his roofers failed to do. You asked us to handle the interior repairs.  Our contractor handled the repairs from the ceiling down (patch and paint).  As we were not provided a copy of the adjuster's report, we had no way to know what was going on in the attic. We are certain you were paid for mold removal/remediation yet you never received a bill/estimate for mold removal/remediation from our contractors. This is an unfortunate series of events that I would like to help you with however you feel the only remedy is for me to take responsibility for something that was mismanaged by you.  You have a claim against the roofing company.  Have you contacted them about this?  It seems that it is easier for you to lash out at us instead of taking the necessary steps to hold the person(s) responsible who dropped the ball. I enjoyed working with you and I hate to end the relationship under these circumstances.\nRudy Rudulph\nProperty Manager"}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "101739884191005718334", "name": "Ali Marie", "time": 1500644743775, "rating": 4.0, "text": "I was in a close race for a place, we were in from out of state and told the property was unavailable for viewing until the coming Saturday and that they would not accept anything until that Monday. But they showed the property that Friday, and even still I got my deposit in at business open that Monday before anyone else. I didn't get the house but they came back and helped with my search, and are very invested in making sure I find a good placef", "pics": null, "resp": {"time": 1500510194586, "text": "Alanna,\nThank you for continuing to work with us.  I'm glad you were able to find something that fit your needs.  Please keep us in mind in the future.\nRudy"}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "115362572153045740771", "name": "Dalton Newell", "time": 1523983726619, "rating": 5.0, "text": "I rented a home from Rudulph Real Estate, and the experience was fantastic. This company was easy to work with, responsive to all maintenance requests, and super fair in their handling of the security deposit that I put down when I signed the lease. 10/10. Would do business with them again.", "pics": null, "resp": {"time": 1524091140419, "text": "Dalton,\nThank you much.  We appreciate you guys being such great tenants.  Please keep us in mind the next time you need a rental home.  We would love to work with you again."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "103982952300459523120", "name": "Fran Dufour", "time": 1450968362717, "rating": 5.0, "text": "Rudulph has been managing my property for 3 years and, frankly, most of the time I forget I even have the property. They handle everything effectively and efficiently. And they are always easy to get in touch with if I have any questions. I would highly recommend them to anyone looking for a realty management company!", "pics": null, "resp": {"time": 1451327407353, "text": "Fran,\n\nThank you for your feedback. Hope you and yours had a great holiday season."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "112127633844236115899", "name": "Eddie Brightwell", "time": 1369748562529, "rating": 5.0, "text": "Rudulph Real Estate has been my property management company for over three years. In that time, they have provided excellent service. Rudy keeps me informed at all times about my property, address issues as they may arise, and make sure that the property is maintained. I highly recommend Rudulph Real Estate to home owners that have properties in need of a management company.", "pics": null, "resp": null, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "101187962957742971667", "name": "Ley Curl", "time": 1494622073957, "rating": 5.0, "text": "We had a great experience with Rudy when we listed our home for rent. He is extremely professional and responsive, not to mention just a good guy overall.  We will definitely continue to recommend him.", "pics": null, "resp": {"time": 1494628958357, "text": "Ley,\n\nThank you much.  I have enjoyed getting to work with you guys.  Good luck with your move."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "109957020929564618140", "name": "Gary Newman", "time": 1369750977571, "rating": 5.0, "text": "I have trusted them for over 10 years with the management of my property.  They have done a fantastic job.  They are timely, professional and are extremely detailed oriented.  They are extemely easy to work with and make you feel as if they are taking care of your property as if it was their own.  I trust them completely.", "pics": null, "resp": null, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "106651601474597387691", "name": "Melissa Gray", "time": 1369534342642, "rating": 5.0, "text": "Excellent property management company. Very professional, friendly staff. Any maintenance issues that arose with the property were handled immediately, same day on several occasions. We were treated with the utmost respect at all times and were always made to feel that our needs were very important. We rented from Rudulph for two years and if we were not moving out of state, we would definitely want to rent one of their properties again.", "pics": null, "resp": null, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "113017130980604575546", "name": "Chappel F", "time": 1477007032855, "rating": 5.0, "text": "I was very happy dealing with Rudulph Real Estate when I rented a home from them in Birmingham, AL.  I never had any problems and they have a warm and friendly staff to help you with what ever you need.  I really hated moving away but if ever in that area again...I would call them first.  Very professional company.\nThanks again!!\nChappel Fisher", "pics": null, "resp": {"time": 1477007688367, "text": "Chappel,\nThank you much.  We enjoyed working with you over the last few years.  Good luck with your next adventure."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "117793950571952057503", "name": "Forrest", "time": 1506924906937, "rating": 5.0, "text": "Reliable property management company.  Good subs when needed.\nDid what they said, including replacing a/c unit expeditiously. F James", "pics": null, "resp": {"time": 1506951668939, "text": "Fob, we enjoyed working with you and look forward to linking back up with you when you return.  Thank you.\nRudy Rudulph"}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "102579980489007842924", "name": "Joe Chandler", "time": 1435083488643, "rating": 5.0, "text": "I like the way they do business!! They will let you check out multiple keys at once each to a different property in order to help you see their rentals in a timely manner. No more setting an appointment with a realtor or property manager to go see houses when it's convenient for someone else. Rudy let me see lots of houses until I found the right one for me. He helped me find a great house in Homewood that has a superb location! He even made sure to rent it to me at a VERY excellent price. Could not be happier!", "pics": null, "resp": {"time": 1435084536983, "text": "Thanks Joe.  Make sure to come by and see us next time you get a chance.  Glad you are enjoying the property."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "106080361220682844445", "name": "Raheem Long", "time": 1476822091528, "rating": 5.0, "text": "Rudulph Real Estate is an excellent company to work with for all of your rental needs. They have a great amount of beautiful properties and are very quick with their process! 5/5. Would recommend.", "pics": null, "resp": {"time": 1476825439579, "text": "Raheem,\n\nThank you for sharing your thoughts.  Let us know if we can be of service to you again in the future."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "105885737747389856613", "name": "Hannah Harbert", "time": 1545078262674, "rating": 1.0, "text": "Poor management company! Very unprofessional.  When I was a resident at UAB we had a bad experience. The residents would say “avoid the yellow/red signs.” I now have friends who own rental properties and high-end rental home owners do not use Rudulph. They are known for rude customer service, to collect rent and do nothing more.", "pics": null, "resp": {"time": 1545211594967, "text": "Hannah,\nYour name does  not come up anywhere in our system.  We have never had any business dealings with you."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "110634979056340510073", "name": "keren mccollam", "time": 1468969118567, "rating": 1.0, "text": "I leased a property from them and was less than satisfied with how they did business. A few days after moving in I phoned to tell them the heat wasn't working they had it checked out and I was treated like I was just a dumb women and that the heat was fine. later when the temp dropped I had to call again since the house was at 50 degrees in January after another service call they said whoops the whole unit is bad. Upon moving out they charged me for trash under the house that was there when I moved it. Also changed me over 400 in pet cleaning fees that were not disclosed at time of lease. I also had to wait for over 2 month for the little bit of security deposit I did get back. Just not upfront and honest about stuff. 😡", "pics": null, "resp": {"time": 1468974074446, "text": "Karen,\nI am sorry if you feel we were unfair with the closeout of your security deposit.  The link below will take you to the move-out inspection slides.\nJoseph and Karen McCollum move-out inspection\nThe slides cover each of the issues that you brought up in your review.  We enjoyed working with you and trust that this should clarify any misunderstandings concerning the security deposit refund.    Rudy Rudulph\nhttps://goo.gl/3r2LoI"}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "106718306155401050123", "name": "Melissa Shawler", "time": 1437653309323, "rating": 5.0, "text": "The Rudulph Real Estate team was a complete pleasure to work with from beginning to end. I am active duty military, and the company bent over backwards to meet my needs while I was stationed in Birmingham. I recommended them to a few fellow servicemembers, who are also very happy they decided to rent from Rudulph. Of all the property managers I have dealt with, including the managers of my own property in Louisville, KY, Rudulph is lightyears ahead of their competition. They are timely when addressing issues, accommodating on methods of payment, take great care of their properties and make all of the processes for renting or moving out extremely easy. I would not use any other property manager in the Birmingham metro area.", "pics": null, "resp": {"time": 1437698737943, "text": "SFC Shawler,\n\nIt was a pleasure to work with you over the last few years.  Good luck on this next step with the military.  Please keep us in mind in the future if you ever find yourself back in Birmingham."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "110481605841294510853", "name": "JERROD SLAY", "time": 1469566215440, "rating": 5.0, "text": "My wife and I rented with Rudulphrents for around 2.5 years in a house in Crestline Park. Rudy was an excellent property manager and his team was always prompt to respond to get things fixed when needed. In the time we were there, we had several issues including AC, plumbing, trees - all items resolved quickly.\n\nWe recently bought a house (mid-lease) which would not always be the best way to go for either party. From the time that I made Rudy aware of the circumstances, he was very good about making sure we were on track to sub-lease the house quickly so that we would not have to pay both rent and mortgage.\n\nOverall, very good experience dealing with this company.", "pics": null, "resp": {"time": 1469569712343, "text": "Jerrod,\n\nThank you much.  We enjoyed working with you guys.  We hate to see you go."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "111597448468372536851", "name": "Amber Lese", "time": 1562783311803, "rating": 1.0, "text": "No callback. Called for property management, instructed by machine to email. Sent email with my info, and still have yet ro receive any callback from them..", "pics": null, "resp": {"time": 1562788893179, "text": "Amber,\nI hate that we missed the opportunity to work with you. Please forward the email you sent originally to reception@rudulphrents.com.  This is the same email address where you should have sent your original inquiry.  I just spoke with my receptionist and she confirmed that we have not received any information requests from you.  Please note the spelling of Rudulph.  Many people have made the mistake of spelling Rudulph as Rudolph and the email does not get kicked back.  I believe that is because there are at least 2 Rudolph Real Estate offices in different parts of the country.  We welcome the opportunity to bring on new clients.  Even if a  property is outside of our service area, I always try to link you up with someone who should be able to help you.  I look forward to seeing your email.\nAmber, we are still looking for your initial email.  Please forward to reception@rudulphrents.com so we can determine what happened.\n7/15/19:\nAmber: we still have not received the forwarded message from you.  Due to your lack of response, we will assume you either sent your initial request to the wrong email or you have never had contact with Rudulph Real Estate."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "115822249848912138257", "name": "Neal Bradley", "time": 1408642557364, "rating": 5.0, "text": "We've been renting from Rudulph for a few months now, and they have been spectacular.  The professional and courteous staff have been great.  We've had a couple maintenance issues that got resolved quickly through them.", "pics": null, "resp": {"time": 1408654338953, "text": "Neal,\nThank you for your review.  We appreciate the feedback."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "100191964564214716705", "name": "Cyndy Gurley", "time": 1564499394006, "rating": 3.0, "text": "I was extremely happy with this company up until just recently (hence the 3 star). I have been renting with them for around 14 months now. If you qualify and meet their standards they are wonderful to work with. If you are paying your rent in full and on time, they will go above and beyond to meet your needs. However, if there is an unexpected life turn, even notifying them will not help. I was laid off at work and could no longer afford the rent. Even their qualifications say that you must make 3x the rent in a months time. I now make less than 2x the rent. I notified them of my life changes thinking that was right thing to do, but as I had forgotten, just remember they have a contract in place and that is what they will go by like any other business. They are still a great company despite my disagreements and misunderstandings on some of their business practices, but if are going into renting with them knowing there is even a possibility of financial changes in your life, I would not recommend them.\n\nAdding in response to owners reply. They did offer me release option, but ultimately that is continuing to pay the rent in full as usual until it is released, sold, or until end of your lease (which ever comes first). This is extremely risky option for someone who cannot afford the rent in the first place. Can’t afford their rent, but they want you to pay two rents while waiting for them to find another person to lease. Great idea guys. Even when I offered to pay 3 months rent, plus them keeping deposit to end lease ( 6400 total).  They claim they can get it leased in a month or two (3200 total) so why not take the 6400 total and let me go? Hmmm, wonder if it’s because they cannot/ or don’t try to immediately lease it out??? Just a thought. You have to move out before they will begin to show, again paying two rents. Not a great option when I cannot afford their rent, so no that’s not helpful as he claims. Not sure how that helps me at all as they are “helping me out of a bad situation”. And I have signed and returned the release option papers, so I am unaware of what that is about. I even got confirmation emails they were received, which I am happy to provide to anyone showing the dates of his post vs the dates of the emails. Also, I highly doubt I am the only person that has gotten frustrated from being in a financially binding situation, so not sure how that deems me the most difficult with this type situation. Again, great company, until you are in a financial situation where you cannot make rent.\n\nUpdate on this (today 7/30/19), as if the owner below saying I did not sign and return the forms in June wasn’t enough, just got a call saying they did not have the forms (supposedly) and could not process anything. I told them I had email confirmation that all forms were received and would be glad to forward that over. Was told that worker was on maternity leave and they could not access email to get the forms. Not sure how that’s my problem??? But sure, I’ll redo everything again since you cannot properly arrange cover while employees are out on leave. 😄", "pics": null, "resp": {"time": 1561389386223, "text": "Cindy,\nThank you for clarifying the fact that we hold renters to the agreement that they signed.  You did not include the part where we gave you the choice of a re-leasing agreement that you, as of today, have not signed because you would rather us let you out of your lease.  We understand that people run into financial hardships and we do this sort of deal at least 10 times a year.  We have never had someone react as you have reacted.  Keep in mind, we are trying to work with you to help you get out of a bad situation."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "104845018122606970053", "name": "Troy Birdyshaw", "time": 1369752451116, "rating": 5.0, "text": "My family has used Rudulph Real Estate for years. They are very passionate about what they do. I had some concerns about letting someone rent my new construction home, but Rudy explained in great detail the safeguards that are in place to ease my concerns.", "pics": null, "resp": null, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "103294464615374098357", "name": "Robert OBrien", "time": 1505395893668, "rating": 4.0, "text": "I was very pleased in the way Rudulph handled our rental home for some 7 years.  They have a great staff of good people.", "pics": null, "resp": {"time": 1505402379933, "text": "Robert, thank you for your review.  I have enjoyed receiving your updates from your mission trip over the last few years.  We wish you guys the best as you transition back to Birmingham."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "114935999180101785419", "name": "Don Groom", "time": 1472921897299, "rating": 5.0, "text": "Rudulph Real Estate has effectively managed my property since 2007. They consistently handled issues professionally and courteously. Not once in our nearly decade long relationship did they give me reason to complain.", "pics": null, "resp": {"time": 1478732513533, "text": "Sir,\n\nThank you for your kind words.  It has been a pleasure working with you over the last 6 years.  Congrats on the retirement!!!! Please keep us in mind in the future."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "102044268041380971931", "name": "Kendall Headley", "time": 1478166804633, "rating": 5.0, "text": "Rudulph stepped up to the plate when it comes to working with their tenants. Rudulph  showed me that it is not all about the money, but making sure their tenants have a place to live at a very reasonable price,  even if it does not benefit them. My hat is off to Rudy Rudulph for showing he cares!", "pics": null, "resp": {"time": 1478207395302, "text": "\"Elvis\", thank you much.  You were one of the 1st clients we picked up when I started with the company back in 2010.  I have enjoyed our numerous conversations over the last few years.(not all concerning your property).  We wish you the best of luck with this next chapter.  Please keep us in mind if you find yourself in need of our property management services sometime in the future.\nRudy"}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "107001196191898115115", "name": "Corey Hood", "time": 1471356496305, "rating": 5.0, "text": "Rented a property from Rudulph and was very pleased with the way maintenance issues were handled and the customer service we received. Renting can be very stressful when it comes to getting back your security deposit however, Rudulph was very fair and prompt with sending us our security deposit. The charges we incurred were reasonable and we could not be happier with renting from Rudulph. I hope to never have to rent again but if i do i will look at Rudulph Real Estate properties.", "pics": null, "resp": {"time": 1471362819475, "text": "Corey,\n\nThank you much for your thoughts.   It was a great move-out inspection minus the minor items you mentioned above.  We look forward to working with you again in the future as a customer or a client.  Good luck with you next endeavor.\nRudy Rudulph"}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "102430781856756320703", "name": "Lori Andrew", "time": 1404820550630, "rating": 1.0, "text": "I rented a place in alabaster AL. Mid-lease this company took over the lease. After moving out August 2013 they sent me what was left of my deposit per their evaluation. They deducted several hundred dollars out due to several things that were damaged when I moved in. The most money was taken for broken $10.00 Dollar General blinds that were all broken when I moved in. I emailed Rudy on multiple occasions from 10/2013- 1/14 with photos of the day I moved in of the broken blinds and marks in closets. He last stated in january he was out of town and would review once he was back. Ive yet to hear anything. I was a great tenant for almost 2 years and left the place very very clean and this is the respect I have received. Good luck.", "pics": null, "resp": {"time": 1407008435563, "text": "Lori,\n\nThe last time we spoke, I informed you that I was no longer managing the property and that you would need to contact the new property manager about your issues with the move-out inspection.  As stated above, we were brought in after you had already taken possession of the property.  The pictures I used for my move-out inspection comparison slides were taken when I originally met you at the property.  From those pictures, I was able to determine that the charges against you were justified.\nPlease feel free to contact me if you would like to discuss as I had assumed you had taken this up with the new property manager.\nRudy"}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "105099007450829575020", "name": "Richard Huff", "time": 1476822405396, "rating": 5.0, "text": "Rudulph real estate is vary professional, the staff was vary knowledgeable and kind they helped me find the home was looking for in the area and price range I was looking in.  I would recommend them to anyone looking to rent or sale a home in the greater Birmingham area", "pics": null, "resp": {"time": 1476825378012, "text": "Richard,\nThank you for your thoughts.  I'm glad we were able to help you guys find your new home."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "110000175087124720516", "name": "Ashlea Yale", "time": 1369615180700, "rating": 5.0, "text": "My husband and I rented our first house from Rudulph Real Estate. We never had any problems with the company, and the responses to our questions were always very speedy. They worked with us when we found a house to buy, and I would recommend them for anyone!", "pics": null, "resp": null, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "100395339953077187452", "name": "Michele nobles", "time": 1498319773095, "rating": 5.0, "text": "Working with Brittany Rudulph was awesome. She really knew what she was doing! We will never work with another realtor.", "pics": null, "resp": {"time": 1498593971702, "text": "It was such a pleasure to work with you guys! Thank you so much for trusting me to find your new home.\nBrittany"}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "102152221830935827117", "name": "mokan eziski", "time": 1538546891537, "rating": 4.0, "text": "Staff is nice and would recommend the best location for your dream house.", "pics": null, "resp": null, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "104105537929297379224", "name": "Terry Kamanu", "time": 1475262197215, "rating": 1.0, "text": "This people will take all your deposit. I left the house clean & better than I found it,  but still found reasons to not return the deposit.", "pics": null, "resp": {"time": 1475264843493, "text": "Terry,\nYour review is inaccurate.  You were given a refund of $337.34   You were charged for the items which were found to be your responsibility. Please follow the link below to view the slides from the move-out inspection:\nhttps://drive.google.com/open?id=0B6qaPDisaDLRbXd3OS0xUks4eVE"}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "107711989666618451048", "name": "lindsey hutchens", "time": 1403308983800, "rating": 3.0, "text": "A misunderstanding meant we had to pay for a door repair because it looked like someone had tried to break in the apartment we'd been living in for about a year and a half.  We weren't sure - the door frame just splintered one day when opening, leaving the lock virtually useless. (The door was not in particularly good shape when we moved in.) We didn't file a police report as there was no evidence that a break in had actually occurred. When Rudulph repaired it and didn't charge us, we thought there was no issue, since nowhere in our lease did it indicate a police report would be necessary. We were a little shocked when we moved out several months later and over $400 was deducted from our deposit specifically for the repair of the door - without prior notification by the property manager of the cost of the repair, which only included a new deadbolt and a patch fix to the door and frame. Upon speaking with Mr. Rudulph, this was how they recouped their investment in the door repair. Maybe this is standard procedure for most leasing agencies, but it seems like bad practice to require your tenants to involve law enforcement before you will pay for repairs to damage they did not cause and that, if not addressed, could endanger their safety.", "pics": null, "resp": {"time": 1407008711852, "text": "Lindsey,\n\nI appreciate your thoughts.  It is standard policy that any time a tenant reports a break-in, we require them to send us a copy of the police report as soon as possible to justify the cost of sending a contractor to fix the door.  I explained this to you guys at the time of the incident and trusted that we would receive the police report after a few days.\nRudy"}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "103996023856687854578", "name": "Claude Earl Fox III", "time": 1450816306692, "rating": 5.0, "text": "I have used Rudulph Real Estate to rent several of my properties over the last few years and found them to quite responsive to my requests and very professional in their business.   I would highly recommend them!!", "pics": null, "resp": {"time": 1450820367946, "text": "Sir,\n\nWe greatly appreciate your continued support over the last few years and we look forward to many years to come.."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "111447705492486651753", "name": "Ben Hogan", "time": 1520454714335, "rating": 5.0, "text": "efficient, honest and good communication", "pics": null, "resp": {"time": 1520455571613, "text": "Sir,\nThank you much.  I've known you for most of my life.  I appreciate the opportunity to work with you and your family."}, "gmap_id": "0x8889198f4c4e74f9:0xbcc367a8d641e8f"}
{"user_id": "100824166433842907124", "name": "Mary Brown", "time": 1627157075950, "rating": 5.0, "text": "This had to be the smoothest process to go through to sell a house since I was moving to another state and didn't want to worry about having any property remaining in Alabama. The Montgomery Real Estate Buyers were great and explained the process that we would go through and closing was they shortest time ever went through.  They are Great!", "pics": null, "resp": {"time": 1627618013737, "text": "Hey Mary,\n\nThanks for the positive review! We love hearing from sellers – especially when our service is able to make a positive difference to them.\n\nI know our team put a lot of work into the closing process, so I’ll be sure to pass your kind words off to them.\n\nThanks again, and take care!\n\n- Montgomery Real Estate Buyers"}, "gmap_id": "0x888c2bc2de443fc7:0xd4fb360750ba192"}
{"user_id": "115599535430353190475", "name": "Terri Hunt", "time": 1628631422848, "rating": 1.0, "text": "A group of boys playing in the mud. They, Brandon, Eric and the owner, Joseph has no integrity nor character and are NOT trustworthy. If you get a card to buy your home from this company trash it! We will be moving on to the BBB, Montgomery Real Estate Association and any other helpful business to get the word out of the fraudulent websites and social advertising they propose but do not uphold.", "pics": null, "resp": null, "gmap_id": "0x888c2bc2de443fc7:0xd4fb360750ba192"}
{"user_id": "113209630982772725361", "name": "Joseph Banks", "time": 1616535992644, "rating": 5.0, "text": "The Montgomery Real Estate Buyers is a fantastic team to work with. I've worked with a lot of brokers and various  buyers but they were by far one of the easier and honest buyers to work with. From the first conversation we've had with them has been nothing but honest and clear communication. That's hard to find now a days especially in real estate. Looking forward to working with Joseph, Eric and the rest of their team on future properties.", "pics": null, "resp": {"time": 1617136901773, "text": "Hi there Joseph,\n\nWe appreciate the kind words! We're so  thrilled to hear that selling your property to us worked out for you. It’s always humbling to hear how we’re able to make sellers’ experience easier.\n\nWe're also happy that you found the way we communicate clear and honest. We put a lot of work into that, and so we are glad to hear it’s serving its purpose and helped you out during the whole process.\n\nHave a great day, and thanks for the review!\n\n-Montgomery Real Estate Buyers"}, "gmap_id": "0x888c2bc2de443fc7:0xd4fb360750ba192"}
{"user_id": "118001805252027504180", "name": "Jason Smith", "time": 1628806181823, "rating": 5.0, "text": "Excellent customer service! These people value their integrity and character.", "pics": null, "resp": null, "gmap_id": "0x888c2bc2de443fc7:0xd4fb360750ba192"}
{"user_id": "103355129408817520214", "name": "Pink Ladybug", "time": 1628004100168, "rating": 5.0, "text": "Eric and his team were very professional and made selling my home on Wilmington Road very easy! It was the best decision for me and I appreciate their service!", "pics": null, "resp": {"time": 1628006268011, "text": "Wow – thanks for your kind remarks! I’m so happy that we made things easy for you in selling your home.\n\nWe thrive on this type of feedback, so I’ll be sure to pass this review off to Eric and the rest of our team. Our goal is to provide homeowners like you with a solution to your situation so you can continue to do the things you love, and I’m ecstatic that we were able to make it happen for you here with your home on Wilmington Road.\n\nThanks again!\n- Montgomery Real Estate Buyers"}, "gmap_id": "0x888c2bc2de443fc7:0xd4fb360750ba192"}
{"user_id": "100063492089607361187", "name": "Norris Fitzpatrick", "time": 1628260707916, "rating": 5.0, "text": "Hey is was great from start to finish working with the whole Team on the process  of selling  my home, they were there with any question that came up through  the process they explained to process from start to finish now that's easy sailing!  You would love working with Montgomery Real Estate Buyers : )", "pics": null, "resp": {"time": 1628609847569, "text": "Hi Norris,\n\nThank you for taking the time to review us! I’m sure that the whole team will be thrilled to hear this.\n\nThanks again – we appreciate it!\n\n- Montgomery Real Estate Buyers"}, "gmap_id": "0x888c2bc2de443fc7:0xd4fb360750ba192"}
{"user_id": "100840012765962434997", "name": "Matthew Anderson", "time": 1624341093933, "rating": 5.0, "text": "Got a fair offer on a fixer upper that was more than I could tackle. I hope these guys make some money on the property because they definitely have their work cut out for them.", "pics": null, "resp": {"time": 1625752565396, "text": "Hi there Matthew,\n\nWe appreciate the kind words! It’s always humbling to hear how we’re able to make sellers’ lives easier.\n\nWe put a lot of work into our process to make sure that we come up with a fair offer, and so I’m glad to hear it’s serving its purpose and helped you out.\n\nHave a great day, and thanks for the review!\n-Montgomery Real Estate Buyers"}, "gmap_id": "0x888c2bc2de443fc7:0xd4fb360750ba192"}
{"user_id": "113257113772706508892", "name": "copper penny", "time": 1620510214833, "rating": 3.0, "text": "While Eric was professional when I met with him, I have to admit that the offer was an absolute lowball.  House needed 15k in work, but market value (looking at comps) is somewhere around $200+k, they offered $70K less than that.  I understand that investors are looking to make big profits, but I think the piece of the pie they wanted was just too big to work around.\n\nThere is a convenience factor in dealing with \"We buy houses in any condition\", just don't expect to get anywhere close to what your home is really worth.  Consult with a real estate agent in addition to them to get the whole picture.  A few thousand bucks in repairs may mean tens of thousands in return.  Market is red hot (both rental and sales) right now and homes are worth more than you would think.  Again, talk to a real estate agent as well if you are considering this route.", "pics": null, "resp": {"time": 1620836187392, "text": "Hi,\n\nThank you for letting us know about your experience with Eric. I’m glad to hear that he acted professionally when you met with him. I’ll be sure to let him know that aspect of his work is appreciated!\n\nSounds like we could be a bit better when it comes to our offer. Sorry we fell short there. As real estate investors, we inherently take on risk when buying houses and need a return on our time and money invested. We aren't the best solution for everyone, especially owners who have the time, money, and experience to make repairs to the property themselves. We are sorry we couldn't work together and wish you the best of luck selling.\n\nIn the meantime, if there’s anything else you want to share with us, you can message us at info@montgomeryrealestatebuyers.com.\n\nThanks again!\nJoseph Back, Owner"}, "gmap_id": "0x888c2bc2de443fc7:0xd4fb360750ba192"}
{"user_id": "107500604957864129079", "name": "Gary Holt", "time": 1598487258660, "rating": 5.0, "text": "This team of investors gave me the best price for my house. I signed a contract and we closed in a little less than 3 weeks. They took care of closing costs and made the entire process very easy. The closing attorney they use did a fantastic job. Left the office with a nice check, I highly recommend you talk to these folks if you need to sell your home.", "pics": null, "resp": {"time": 1599665934188, "text": "Hello Gary,\n\nWow – thanks for your kind remarks! I’m so happy that the offer we made worked out for you.\n\nWe thrive on this type of feedback, so I’ll be sure to pass this review off to the team. Our goal is to make the entire process easy and fair, and I’m ecstatic that we were able to make it happen for you here when we gave you the best price possible for your house and made the entire process easy for you.\n\nThanks again!\n-Montgomery Real Estate Buyers"}, "gmap_id": "0x888c2bc2de443fc7:0xd4fb360750ba192"}
{"user_id": "100594662483346385509", "name": "Becky Hicks", "time": 1604412831070, "rating": 3.0, "text": "If I were interested in selling my home I would contact you. I'm not interested in selling but I keep getting offers \"I'm looking to buy your home\". PLEASE STOP SENDING THESE POSTCARDS OUT! I will continue giving you 1 star as long as you do. I do not know if they are any good,but ignoring them is not working,so maybe this will. I AM NOT SELLING MY HOME!\nEdited on 11/2/2020---I am increasing the stars given (originally a 1 star) to a 3 because the response to the original post was prompt,positive,and polite. I don't have any ideas as to what they could do,maybe keep a master list and assume that those who have not responded are not interested? I was,though,impressed with the emails I got from Joe.", "pics": null, "resp": {"time": 1604001695105, "text": "Becky,\n\nThank you so much for writing this review. We are disheartened to hear that you are not happy about receiving our mail. Like many small & local businesses, we rely on proactive marketing to reach our customers. We recognize that some individuals may wish to not receive our marketing, and we have a simple opt-out solution to promptly remove them from our outreach.\n\nPlease email us at info@montgomeryrealestatebuyers.com and we will happily resolve this issue for you.\n\nBest Regards,\n\nMontgomery Real Estate Buyers"}, "gmap_id": "0x888c2bc2de443fc7:0xd4fb360750ba192"}
{"user_id": "108820831971455432895", "name": "Dwight Caples", "time": 1615933183641, "rating": 5.0, "text": "Easy process  very great people very quick I was amazed.i want to thank everyone that worked on it.", "pics": null, "resp": {"time": 1616189811978, "text": "Thank you Dwight! We appreciate you taking time to let others know that you had a good experience with us! I will definitely let the whole team know your thoughts!"}, "gmap_id": "0x888c2bc2de443fc7:0xd4fb360750ba192"}
{"user_id": "112538054862741588950", "name": "Cory Lawrence", "time": 1602991027068, "rating": 5.0, "text": "Working with Eric was great. He was very timely, professional, and made the process very easy. He also ensured there were no surprises along the way. I would highly recommend doing business with him.", "pics": null, "resp": {"time": 1603149638039, "text": "Hi Cory,\n\nThanks for taking the time to leave us a review. We're happy that you found the process very easy and will be sure to pass the kind words along to Eric - I know he will be glad to hear about the positive review.\n\nThank you,\n\n- Montgomery Real Estate Buyers"}, "gmap_id": "0x888c2bc2de443fc7:0xd4fb360750ba192"}
{"user_id": "100623382660021930819", "name": "C W", "time": 1594065063938, "rating": 5.0, "text": "When we were ready to sell our rental property, we were apprehensive about marketing it because we live out of state. Joseph made us an as-is offer that we felt was fair. The selling process was simple and it was great not to have to worry about repairs or preparing the house for listing. We highly recommend Montgomery Real Estate Buyers based on our experience.", "pics": null, "resp": {"time": 1596155779821, "text": "Hey C W,\n\nThanks for the positive review! We love hearing from sellers like you – especially when our service is able to make things simple and flexible to folks who live out of town.\n\nI know our team put a lot of work into making our offers fair, so I’ll be sure to pass your kind words off to our team.\n\nThanks again, and take care!\n\n-Montgomery Real Estate Buyers"}, "gmap_id": "0x888c2bc2de443fc7:0xd4fb360750ba192"}
{"user_id": "108790405789986162291", "name": "MarketStreet Barbershop", "time": 1598352951764, "rating": 5.0, "text": "I am extremely pleased with the Montgomery Real Estate Buyers team of my recently sold house. Even though, I live in Pennsylvania and my house is in the Montgomery, everything went very smooth. Joseph and Eric are the two most professional men that I have ever dealt with. These are the men and company to go to when selling or buying your home. Thank you both.", "pics": null, "resp": {"time": 1599666301185, "text": "Hi there MarketStreet,\n\nWe appreciate the kind words! I’m thrilled to hear that we were able to make the home selling process work out for you despite you being in Pennsylvania . It’s always humbling to hear how we’re able to make sellers’ experience smoother.\n\nI know Joseph, Eric and the rest of our team put a lot of work into making this all happen, so I’ll be sure to pass your kind words off to them.\n\nHave a great day, and thanks for the review!\n- Montgomery Real Estate Buyers"}, "gmap_id": "0x888c2bc2de443fc7:0xd4fb360750ba192"}
{"user_id": "111898519830890490358", "name": "James Reece", "time": 1616206265602, "rating": 5.0, "text": "Great experience.  Will definitely recommend Montgomery Real Estate buyers", "pics": null, "resp": {"time": 1616533028039, "text": "Hey James! Thanks so much for taking the time to leave us a review. We are happy to hear that you had a great experience selling your house to us. If you need anything, we are still here to answer questions, offer support, and lend a hand in any way.\n\nSincerely,\n\n- The Montgomery Real Estate Buyers Team"}, "gmap_id": "0x888c2bc2de443fc7:0xd4fb360750ba192"}
{"user_id": "104414811954396868822", "name": "Sheila Kelley", "time": 1595624546571, "rating": 5.0, "text": "Really good experience, easy process, nice people.  Very pleased with results.", "pics": null, "resp": {"time": 1596122118444, "text": "Hey Sheila,\n\nThanks for the positive review! We love hearing from sellers – especially when they are very pleased with the results.\n\nI know we put a lot of work into making the selling process an easy and good experience, so I’ll be sure to pass your kind words off to the team.\n\nThanks again, and take care!\n\n-Montgomery Real Estate Buyers"}, "gmap_id": "0x888c2bc2de443fc7:0xd4fb360750ba192"}
{"user_id": "107973668772001994072", "name": "Michael Lewis", "time": 1574822726588, "rating": 5.0, "text": "Of all of the cash buyers I have interacted with in Montgomery, Montgomery Real Estate Buyers is the best cash buyer I have worked with. Joseph is very professional and transparent about the whole process. Definitely recommend!", "pics": null, "resp": {"time": 1596159350372, "text": "Hi Michael,\n\nThank you for taking the time to review us! I’m sure that Joseph and the rest of the team that made this all possible will be so thrilled to hear this.\n\nThanks again – we appreciate it!\n\n-Montgomery Real Estate Buyers"}, "gmap_id": "0x888c2bc2de443fc7:0xd4fb360750ba192"}
{"user_id": "110025309239784561851", "name": "Ed Choquette", "time": 1584501000287, "rating": 5.0, "text": "Joseph was very pleasant to do business with.  Came through for me, allowing me to get out from under the home I was in and giving me options for my retirement future. Thanks!", "pics": null, "resp": {"time": 1596155984607, "text": "Hi Ed,\n\nThank you for taking the time to review us! I’m sure that Joseph will be thrilled to hear that we were able to help you with your retirement future.\n\nThanks again – we appreciate it!\n\n-Montgomery Real Estate Buyers"}, "gmap_id": "0x888c2bc2de443fc7:0xd4fb360750ba192"}
{"user_id": "103669851088624924824", "name": "Grayson Graf", "time": 1574843460333, "rating": 5.0, "text": "Joseph is a trustworthy professional with the upmost knowledge and clarity of the real estate market and holistic financial understanding of his craft. Don't hesitate to reach out to him if you're looking to sell your house! Fair.Fast.Honest.", "pics": null, "resp": {"time": 1596158883440, "text": "Hello Grayson,\n\nWow – thanks for your kind remarks! I’m so happy that Joseph was able to help you through the home sale.\n\nWe thrive on this type of feedback, so I’ll be sure to pass this review off to the team. Our goal is to make the whole process fair, fast and simple, and I’m ecstatic that we were able to make it happen for you here with the knowledge and honesty that Joseph represented.\n\nThanks again!\n-Montgomery Real Estate Buyers"}, "gmap_id": "0x888c2bc2de443fc7:0xd4fb360750ba192"}
{"user_id": "112488791466990324379", "name": "Kevin Short", "time": 1574809896900, "rating": 5.0, "text": "If you're looking for a seamless home sale, Montgomery Real Estate Buyers is the best cash buyer you'll find. Joseph is professional, responsive, and transparent.", "pics": null, "resp": {"time": 1596159472157, "text": "Hey Kevin,\n\nThanks for the positive review! We love hearing from sellers – especially when our service is able to make a positive difference to them.\n\nI know our team put a lot of work into making the home selling process seamless, so I’ll be sure to pass your kind words off to Joseph and the rest of the team.\n\nThanks again, and take care!\n\n-Montgomery Real Estate Buyers"}, "gmap_id": "0x888c2bc2de443fc7:0xd4fb360750ba192"}
{"user_id": "100848920028724573681", "name": "Camden Booker", "time": 1574464817316, "rating": 5.0, "text": "I've never written a review before but I am now because of how easy my experience was. Joseph was professional and paid me very fast. If you need to sell a house, this is the place to go.", "pics": null, "resp": {"time": 1596159607851, "text": "Hi Camden,\n\nThank you for taking the time to review us! I’m sure that Joseph will be thrilled to hear this.\n\nThanks again – we appreciate it!\n\n-Montgomery Real Estate Buyers"}, "gmap_id": "0x888c2bc2de443fc7:0xd4fb360750ba192"}
{"user_id": "117497209188845045815", "name": "Paul Eapen", "time": 1575055969705, "rating": 5.0, "text": "Joseph was very professional and worked with my schedule to sell my property. I'd easily recommend him to anyone looking to sell their property in Montgomery.", "pics": null, "resp": {"time": 1598285222598, "text": "Hey Paul,\n\nThanks for the positive review! We love hearing from sellers – especially when our service is able to make a positive difference to them.\n\nI know Joseph and the rest of the team put a lot of effort into the flexibility and ease to make the home selling process work with your schedule, so I’ll be sure to pass your kind words off to them.\n\nThanks again, and take care!\n\n-Montgomery Real Estate Buyers"}, "gmap_id": "0x888c2bc2de443fc7:0xd4fb360750ba192"}
{"user_id": "112280617992787864881", "name": "Lori T.", "time": 1583259950288, "rating": 5.0, "text": "It was very easy and efficient to work with Joseph.", "pics": null, "resp": {"time": 1596156561438, "text": "Hi Lori,\n\nThank you for taking the time to review us! I’m sure that Joseph will be very pleased to hear this.\n\nThanks again – we appreciate it!\n\n-Montgomery Real Estate Buyers"}, "gmap_id": "0x888c2bc2de443fc7:0xd4fb360750ba192"}
{"user_id": "108614218106347132040", "name": "Johnathan Mitchell", "time": 1628271145689, "rating": 2.0, "text": "My experience with Watts Realty was great up until it was time to move out. I was charged an absurd amount for not cleaning leaves off the back patio area, even though I called prior to moving out and asked if I needed to clean the area. Not to mention, the area was full of leaves and trash when I moved in. There needs to be better communication between the landlords, so this problem does not happen. I will say the representative I spoke with was always professional and pleasant. However, it is extremely frustrating to be charged for something you were explicitly told did not have to be cleaned.", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "100393639034289471497", "name": "Jeannie Evans", "time": 1625066855146, "rating": 5.0, "text": "Watts Realty has managed apartments\nfor my family for 3 generations. They have a highly qualified, professional staff who have always done an excellent job to enhance the value of our property and keep it fully occupied, while keeping the tenants happy. I would recommend them to anyone!\nJeannie Evans", "pics": null, "resp": {"time": 1625089125125, "text": "Thank you for very for your review! It has been our pleasure for our company to work with you and your family to protect, manage & grow your real property assets over the years.  We appreciate the opportunity to be of service for all of your real estate needs! Thank you for continuing to utilize Watts Realty!!"}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "116474851893345762656", "name": "Willie Frazier", "time": 1624632481825, "rating": 5.0, "text": "Brett and Cliff does quality work and very professional.  I sure appreciate them. They always do a good job.", "pics": null, "resp": {"time": 1624646222055, "text": "Thank you for your kind comments! We will let both of them know your appreciation!"}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "102737778781057098505", "name": "Lyn Bloom", "time": 1622058792840, "rating": 5.0, "text": "I reported that had an issue with my door today and they came to fix it the same day. The maintenance department here is very responsive. Brett and Cliff are professional and respectful and never leave a mess.", "pics": null, "resp": {"time": 1622737142983, "text": "We appreciate your kind words!"}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "106863628424491787359", "name": "Tiffany Ellis", "time": 1617208887866, "rating": 5.0, "text": "Me and my boyfriend are in the first week of renting here and found a few things we wanted checked on by maintenance. I made a request through the tenant portal on Sunday and today, Wednesday, maintenance came out to fix the issues. I would say three days is not a long wait time. He was very nice and listened to my requests and did everything he could to make sure it was all fixed. I’m very happy with how things are going so far into renting through Watts Realty.", "pics": null, "resp": {"time": 1622737245484, "text": "Thank you!"}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "113127606912045626463", "name": "Sheryll green", "time": 1620058615155, "rating": 5.0, "text": "My Maintenence service request was taken care of within 24 hours by serviceman Brett, who was professional, nice, thoughtful and diligent in duties. Very kind and respectful. Did not create a mess and took care of each of my requests in a timely manner and was very neat and clean in performance.", "pics": null, "resp": {"time": 1622737204318, "text": "Thank you!!"}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "111974051892195855165", "name": "Valencia Banks", "time": 1623428750376, "rating": 5.0, "text": "Brett is great he's always professional and never leaves a mess when he comes...thx", "pics": null, "resp": {"time": 1623430322521, "text": "Thank you for the kind review.  We will be sure to let Brett know he's appreciated."}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "113157758825232291867", "name": "Omarace Radford (GHOSTT)", "time": 1622665960677, "rating": 5.0, "text": "Brett is very Professional & very courteous!!! Always fixes my problems whenever I call the Realty office!!! Very appreciative of his work!!!", "pics": null, "resp": {"time": 1622737168340, "text": "Thank you for your kind words!"}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "103837046116466243909", "name": "Stephen Copeland", "time": 1599970200733, "rating": 5.0, "text": "Been with the company for almost twenty years, great management staff, very dependable, and fair with property management.  They will manage and make tenants accountable by law.", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "113511472598205751245", "name": "Jackie Williams", "time": 1616101811575, "rating": 1.0, "text": "Liars*** rent to whom they choose never was my credit ran NEVER **", "pics": null, "resp": {"time": 1616167263064, "text": "Ms. Williams.\n\nThank you for your review.  With your rental application you recently authorized Watts Realty to obtain an investigative consumer report from AppFolio, Inc., who provided us with the information regarding your credit history.  Because of privacy laws we cannot discuss in detail regarding your complaint in a public forum. However, you will be receiving a letter in the mail regarding this decision and contact information for the reporting agency.  You have the right to obtain a free copy of the report if you submit a written request to AppFolio, Inc. no later than 60 days after you receive the notice in the mail.  If you do not receive the letter providing you with the information indicated, please contact our office direct."}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "102515470534758046713", "name": "Tyiesha Jordan", "time": 1622665969129, "rating": 5.0, "text": "Brett always helpful", "pics": null, "resp": {"time": 1622737180287, "text": "Thank you!!"}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "105970757067103209668", "name": "Rosalind Lewis", "time": 1596501943910, "rating": 3.0, "text": "The clerk's at the front desk are informative and when requesting a look at an apartment , searching for the address on buildings caused tremendous stress. Numbers were different than given.", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "109287471340290177596", "name": "raven Johnson", "time": 1604332929867, "rating": 1.0, "text": "I will not recommend them to anyone they are not understanding and they do not answer maintenance requests, emails, voicemails", "pics": null, "resp": {"time": 1604953450745, "text": "Ms. Johnson, we apologize for any inconvenience you have experienced. As you are aware, we have modified your lease, at your request, multiple times and have attempted to address each request you have made. We have attempted to reach out to you via private communication regarding your last request; however, we have not received any further information or communication from you since October 20 other than this negative review.   Please contact our office to complete the final paperwork you requested."}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "101271938316157060068", "name": "Free Forme", "time": 1590557765366, "rating": 1.0, "text": "Horrible company. Stephanie was really rude. She told me that (watts) didn't want people of color in their homes. She hung up in my face repeatedly. I continued to call back and never was able to speak with anyone. This is beyond disgrace. Take your money elsewhere.", "pics": null, "resp": {"time": 1590608951305, "text": "Free Forme, thank you for your comment. Our company takes allegations of this nature very seriously. We provide equal housing opportunities to all people, regardless of race, color, religion, sex, handicap, familial status, national origin, sexual orientation or gender identity. Our staff are trained to be responsive to our callers at all times. Very rarely, a caller becomes verbally abusive. If this happens, our staff are empowered to warn the caller about any abusive language used before disconnecting the call. Our president, Chip Watts, is available to discuss this or any other issues you or any other viewers of this review may have. His direct line is 205-703-4277."}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "116605722222385552176", "name": "Priscilla Speller", "time": 1578091565344, "rating": 1.0, "text": "I do not recommend this place at all scam artist to the max I done contacted this office soo many times about so many issues done had they contractor come take pictures of mold in my house bees nests etc none has been done son got stung he’s highly allergic that’s when they finally came to do something I have this huge while in my ceiling from the rain owner is trying to swap the dates and lie about a bunch of stuff even though there been paper trails witnesses etc etc place is just something else so I’ve been paying rent for a place i can’t even stay at smh management should be ashamed of themselves", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "110047117994901560761", "name": "Hollie Deaver", "time": 1441338852085, "rating": 5.0, "text": "I submitted an inquiry email last week for an online listing at 5:30am. I received a response from each of the employees I emailed. The first response at 8:34am, and the second response came before noon. The experience I've had is flawless. Kaitlin and Michael are both extremely professional, viewing the unit was completely hassle-free, and every step in the application process has been clear. I highly recommend Watts Realty to friends, family, coworkers, and the public.", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "108660659058935916743", "name": "Xuan Huang", "time": 1504989345681, "rating": 5.0, "text": "We highly recommend Watts Realty Company.\n\nMr David Watts was our agent when we started to search for commercial property in downtown Birmingham. We were extremely picky in what we want, and because this was our first real estate investment, we were extremely cautious - for every property that interested us, we made multiple visits. In other words, David was not having an easy job being our agent, however, he showed great patience and understanding toward us. As the first-timers, we had A LOT of questions about properties, inspections, regulations, property management, etc, and David Watts always gave us satisfactory answers or referred us to other professionals. He assisted us in every step and met with us as soon as we sent in requests. With David's help, we found and purchased a property we loved, and it may not have happened if we worked with someone else.\n\nLast but least, we are thankful the the entire Watts company crew who helped us arrange the meetings, look up some paperwork, buy the insurance, etc. We highly recommend Watts company and we are thankful that David was our agent.", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "116794898271334198442", "name": "Teresa Hill Berry", "time": 1553220735303, "rating": 3.0, "text": "Most of their Apartments I do like however I've only known them to offer gas I don't want gas a lot of people don't want gas along with that I think the apartments are overpriced. I think that they should at least online tell you how much square footage and show the floor plan of the apartments as well. Today is at 8 at this review I would like to share this I have no intention of paying gas light water and rent. If I rent from Watts Realty and adding additional bills that I have not had an approximately 20 years.", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "101550303594346479564", "name": "Martin Williams", "time": 1539976536644, "rating": 5.0, "text": "Watts is outstanding to deal with... they answer all my questions and their staff if very nice.  I Highly recommend them to either tenants or property owners", "pics": null, "resp": {"time": 1539982153675, "text": "Martin, thank you for your review...we are happy to be of service for your real estate needs!"}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "116503452684472352793", "name": "Vincent (Vince) Bolus", "time": 1559678032763, "rating": 1.0, "text": "Even after dealing with predatory management in the Tuscaloosa student housing scene for the last few years, the people at Watts Realty somehow managed to be even ruder and disrespectful than I could have imagined. It was nearly impossible to get into contact with a property manager while wanting to view an apartment (I called at minimum of 10 times and was never able to get on the phone with her once). The receptionist(s) is rude as well and always tended to rush me off the phone. When I expressed interest in talking to a property manager to the receptionist, without fail, the excuse was either that the PM was either \"not in yet\" (at 11 A.M., sure), or \"on the other line.\" I will never rent from these people. Check the other reviews if you want more horror stories.", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "107631625689229352011", "name": "Cynthia Wilson", "time": 1568341619982, "rating": 1.0, "text": "I went down to the office at the end of March because the apartment i wanted was available April 1. I had already seen the apartments due to a recent tenant and I like what i seen so I  put in a application to the address 705 1st St. S  in titusville. I used my real name which is Cynthia Jenkins. The lady at the desk informed me that the apartment wasn't ready yet but I told her that was  aware and just putting in my application early so it could be processing because I had really needed the apartment. I put in my application that morning and around 3 the same day was denied the apartment by a lady in your office. She told me they would be sending me the papers why i was denied and never received them. Very poor customer service skills need a better staff I would recommend them to no one also was told to edit my review and did because apparently now i'm lieing on the company and don't know where i applied to. Just ridiculous", "pics": null, "resp": {"time": 1568302601219, "text": "Ms. Wilson (Jenkins), thank you for providing us with your \"real name\" so we can address this issue to you. Our application process usually takes approximately 48 hours to complete. As such, we do not deny applicants on the same day.  We mailed a formal letter to you via USPS that explains what information was used in regards to your application. That letter also provides contact information for the consumer-reporting agency that prepared your Investigative Consumer Report. You have a right to a free copy of the report and to dispute the completeness of accuracy of any information in the consumer report with the consumer-reporting agency."}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "104874101493045588824", "name": "Justin Forbes", "time": 1528824065652, "rating": 1.0, "text": "If negative 5 stars was an option, I would choose that. David Watts is a property manager there who blatantly violated my rights under the Alabama Uniform Residential Landlord and Tenant Act as well as several articles of his own professional code of ethics as a Certified Property Manager. If you want to receive the respect you deserve as a tenant and have your rights upheld, do yourself a favor and never rent from this company.\n\nHi Michael,\n\nIt's nice to hear your rationalizations in defense of your younger brother's behavior, but I am more interested in the opinions of the Jefferson County Court of Law and the IREM ethics board.", "pics": null, "resp": {"time": 1528734635206, "text": "Mr. Forbes, we appreciate you taking the time to rate our company and provide a review.  After reviewing your concerns and your lease, we have determined that there have been no violations of the Alabama URLTA or the professional Code of Ethics to which our company adheres. Based on the documented emails and telephone calls between you, your wife (Ms. Galang) and our office, we attempted to schedule the shower leak repair multiple times during a time when you or your wife would be present. Unfortunately, due to several miscommunications by both parties (including third-party contractors unrelated to our company), this leak was elevated to an emergency status that would allow access to be granted without your presence and/or permission under the Alabama URLTA. Upon entering the premises, multiple other lease violations were then noted, including the presence of multiple breeds of pets that previously were not disclosed by you or your wife.  We understand your concern about our respect for our residents and their rights; however, the owners of the property also have rights under Alabama URLTA. After an extended period of time not being able to schedule a time when all parties could be present, the owner’s rights to protect the property from continued damage were enforced. We do appreciate your tenancy since mid-May 2018 and apologize that our relationship has degraded in the short time you have been a resident in Alabama. Hopefully, we may be able to better serve you in the future and avoid further miscommunications."}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "100167206167242651986", "name": "Emile Hughes", "time": 1596471945151, "rating": 5.0, "text": "Great people, committed to doing a good job", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "109262868358788676851", "name": "Dawg Fan", "time": 1489009567000, "rating": 5.0, "text": "On behalf of Bailer & Brock Investments, I would highly recommend Watts Realty. We are small company with several rental properties to supplement our professional income. Watts offers responsive, thoughtful, personalized (even for smaller clients), and wise advise to help protect our substantial investment. From natural disasters, to terrible tenants, to market knowledge, for almost 10  years, Watts had us covered.", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "100355889045727756809", "name": "gcouogluhgit.Jasmine vWilliams", "time": 1513341968398, "rating": 1.0, "text": "Very unprofessional! I started out renting a home from them then one day out the blue they sold the home.. Like are you serious I pretty sure selling wasn't last minute for them so why not let me know as well. Not only that the people they sold to tried to jack up my rent and never fixed anything!", "pics": null, "resp": {"time": 1513370008705, "text": "Ms. Williams,\n\nWe appreciated you as a Tenant during your time with us.  However, we do not appreciate the 1 star and misplaced Google review.  Please recognize the following points.\n\n1)\tWatts Realty does not own property.  We manage for many different third parties.  Your lease document would have the name of the Landlord when it was under our management.\n2)\tInvestment properties are sold in the normal course of business every day across the globe.  We cannot control our Clients’ decision to sell their own property(ies).   Sometimes Watts Realty isn’t involved with the sale transaction, only to receive notice the day of a sale.\n3)\tInvestment sales fall through in the normal course of business every day across the globe.  We cannot notify Tenants of the numerous potential transactions, especially when many never coming to fruition.  Due diligence periods extend to the date of Closing in many, many cases.\n4)\tThe property in which you reside was sold over 18 months ago in May of 2016.  We promptly notified you of the sale, and have not been associated with that property since May of 2016.\n5)\tDue to this Google review, we contacted your Landlord just to inquire about the situation. We have no involvement or contribution with your problems with your Landlord.  We do not manage the property, nor are they a Client of Watts Realty. Please do not misplace your frustration on us. You need to work with your Landlord to resolve those issues."}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "111879888276420925405", "name": "Amanda Johnson", "time": 1411159900246, "rating": 1.0, "text": "Thought I found a great property but took forever to get stuff fixed and now that I have moved, they are siding with the landlord to try and get me to pay for stuff that I am not responsible for. Stuff that was not even in the lease. I figured keeping my deposit would be enough but no they want more money.", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "118368357415377647047", "name": "Cris Galang", "time": 1528691857854, "rating": 1.0, "text": "DO NOT RENT HERE. THEIR LOW STAR RATING SAYS IT ALL. These are horrible people who treated me and my husband with such disrespect. It seems like they are nice to you if you let them manage your property but they treat renters differently. It took them 3 weeks to repair leak from upstairs shower (obviously not emergent to them, didnt even bother following up the first week if the plumber they hired came and did the job). Then persisted in entering our home without prior notice even when we explicitly didnt give them permission to do so, clearly a violation of our privacy.", "pics": null, "resp": {"time": 1528490457289, "text": "Ms. Galang, we appreciate you taking the time to rate our company and provide a review.  After reviewing your concerns, we have determined that there have been no violations of your privacy outside of the lease terms you agreed to adhere by. After you reported the leak on Sunday, May 27, during the Memorial Day weekend, the leak was assigned to a third-party contractor for completion. Regrettably, the shower drain requires a special tool to repair and the contractor did not have such tool available at the time they were on the property on May 27 (the same day you reported the leak). Based on the documented emails and telephone calls between you, your husband (Mr. Forbes) and our office, we attempted to reschedule the shower leak repair multiple times during a time when you or your husband would be present. Unfortunately, due to several miscommunications by the parties involved, this leak was elevated to an emergency status that would allow access to be granted without your presence and/or permission as per the terms of your lease. We entered your premises on June 8, less than two weeks after you reported the leak, to complete the repair by the contractor while being supervised by one of our employees. After we entered your premises, several lease violations were then noted - including the presence of multiple breeds of pets that previously were not disclosed by you or your husband.  We understand your concern about our respect for our residents and their rights; however, the owners of the property also have a responsibility and rights to protect their property (and your home). After an extended period of time not being able to schedule a time when all parties could be present, the owner’s rights to protect the property from continued damage from the leak were enforced - which triggered other property rights issues that we are attempting to work with you for you to bring into compliance with the terms of our lease. We do appreciate your tenancy since mid-May 2018 and apologize that our relationship has degraded in the short time you have been a resident in Alabama. Hopefully, we may be able to better serve you in the future and avoid any further miscommunications or lease violations."}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "111597448468372536851", "name": "Amber Lese", "time": 1562783076565, "rating": 1.0, "text": "Never recieved callback for property management. Gave info to two different receptionists, both said they'd call me back....Still waiting....", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "107600611917026089533", "name": "Bogart Daniel", "time": 1534830886611, "rating": 5.0, "text": "Been renting from Watts since 2009. I appreciate the rapid response to necessary repairs.", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "101417502656593551708", "name": "Jean Hudson", "time": 1453418790806, "rating": 1.0, "text": "Was VERY uncomfortable with the request for my credit card information to view property! All other realtors gave lockbox code or met us for showing. The property and neighborhood was mediocre at best. Scammers??", "pics": null, "resp": {"time": 1487709535094, "text": "We utilize an automated showing system called Rently for the convenience of prospective tenants on the go and don't have the time to schedule a walk through with our residential property manager.  The credit card information is for security purposes to verify your identity.  It is only a $0.99 charge that allows you access to up to 20 homes that utilize the Rently system or 30 days, whichever comes first.   If you do not feel comfortable using your credit card, please call us and let us know that is the case and we can provide you access by gathering additional identifying information from you.  If you want to walk through with an agent, please call us and schedule a time to do so.  I hope that clears up any confusion."}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "104673910191656681848", "name": "David Walsh", "time": 1444224427728, "rating": 5.0, "text": "Very friendly staff. Answered all my questions and were extremely help. I didn't end up renting from them because they didn't have anything available in the area I was looking in. However next time I am looking for something, they will be the first company I call.", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "103082982533749814582", "name": "Tiffanyliiolhhhkn ijy Roberson", "time": 1545056666849, "rating": 1.0, "text": "Please do not rent from these people. you will definitely regret it.", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "102977397899624241934", "name": "Brian Burke", "time": 1361900635062, "rating": 2.0, "text": "i can't recommend my dog rent from these folks. not worth even calling them", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "100687683077362676635", "name": "Francine Jones", "time": 1540845691095, "rating": 4.0, "text": "They have the best apartment to live in", "pics": null, "resp": {"time": 1540850776206, "text": "Thank you for your positive review - we hope you enjoy your time with us!"}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "102793683616107044407", "name": "JJonathan Coen", "time": 1402709234779, "rating": 1.0, "text": "Wouldn't recommend such unprofessional property managers. Couldn't even get a response to my emails.", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "100656287352031513570", "name": "zach garcias", "time": 1487513151406, "rating": 1.0, "text": "Do not, I mean do not rent with Watts Realty. Don't even know why they still in business.", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "118079335840727972437", "name": "Tan Gamble", "time": 1487711527136, "rating": 1.0, "text": "After viewing a property that they find renters for I applied. I received a phone call the next day saying that I was denied due to credit. So I called back and asked what the minimum credit score was and there is not one. So how can the a reason why I was denied?", "pics": null, "resp": {"time": 1487785351778, "text": "Ms Gamble, we have mailed a formal letter to you via USPS that explains what information was used in regards to your application.  That letter also provides contact information for the consumer-reporting agency that prepared your Investigative Consumer Report.  You have a right to a free copy of the report and to dispute the completeness of accuracy of any information in the consumer report with the consumer-reporting agency."}, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "116899580948661063412", "name": "Susan Cotten", "time": 1445020097367, "rating": 1.0, "text": "Called yesterday to ask about property management.  Talked to Raleigh Winstead who promised I'd receive an e-mail from him by 10 a.m. today.  It's 2:49 p.m. and no e-mail.  Hasn't returned call I made to him three hours ago.", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "106487978216037651280", "name": "William “Russ” Thompson", "time": 1552329459958, "rating": 3.0, "text": "$100 application fee!!!", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "117974775966838095390", "name": "Exclusive Painting1", "time": 1505756727538, "rating": 5.0, "text": "AAA", "pics": null, "resp": null, "gmap_id": "0x88891bec3e7601ab:0xeb291356c63d2968"}
{"user_id": "104496910648102106289", "name": "J Coogan", "time": 1615738964422, "rating": 5.0, "text": "Want an agent that put YOUR best interests #1? Chris Vail is that agent.\n\nHe tells it how it is and doesn't sugar coat the facts and that's the type of real estate agent that you need. We recently purchased a large piece of land and he made the transaction fairly simple for us, thankful for him helping guide us through the process", "pics": null, "resp": {"time": 1618040998244, "text": "We appreciate your continued support and for taking your time to leave a review about your recent experience! Looking forward to many more transactions and laughs! Question remains...who wins the next race?"}, "gmap_id": "0x889a074b15f59581:0xf43a235668e7ba1d"}
{"user_id": "108065936423466300220", "name": "Amanda Fikes", "time": 1620157445087, "rating": 5.0, "text": "Chris Vail was amazing! We had a huge success in the sell of our home! He was professional, knowledgeable, and very friendly! Would definitely recommend!!", "pics": null, "resp": {"time": 1620314964648, "text": "Thank you so much for the vote of confidence. We almost hit the double digits in number of offers. 9 offers and 5 of them cash above asking makes for smooth ride! Onward we go to buy the dream home! Glad it all worked out so well for your family, very deserving!"}, "gmap_id": "0x889a074b15f59581:0xf43a235668e7ba1d"}
{"user_id": "108955150206374705572", "name": "David Gulledge", "time": 1607039691555, "rating": 5.0, "text": "Chris was really great to work with! He was very responsive when we needed him, and if he did not know the answer to a question that we asked him, he was quick to find the answer and get back to us. Chris showed us several houses and he knew a lot about each house, he even pointed things out to us that my wife and I would never have noticed. It was obvious that Chris wanted to help us find and buy a good house, and he created a smooth home buying experience for us. I would highly recommend Chris Vail.", "pics": null, "resp": {"time": 1607061180631, "text": "I appreciate the kind words. I'm so glad I could help you. Should've been smooth, throw a hurricane Sally in the mix and there were obvious delays. Thank you for being as patient as you were while the town got its feet under it. Glad we were able to snag the last available  new construction, told you those relationships go a long way! I'm here if you need anything in v at all! Thank you for trusting me to get the job done."}, "gmap_id": "0x889a074b15f59581:0xf43a235668e7ba1d"}
{"user_id": "116298338557654800261", "name": "LUXE Brows and Lashes", "time": 1606233653766, "rating": 5.0, "text": "It has been a breeze working with Chris. I was able to see a lot more properties than I even knew were out there and he handled all the details. I would highly suggest him!", "pics": null, "resp": {"time": 1606969482359, "text": "Thank you for the vote of confidence and although I'm not one to go have micro-blading done, from what I hear you are the one of the best in the business. It will be an adventure as we jump the hurdles creating value with this property!"}, "gmap_id": "0x889a074b15f59581:0xf43a235668e7ba1d"}
{"user_id": "108519545835895244859", "name": "Becky Malone", "time": 1595603424544, "rating": 5.0, "text": "Chris has helped me with purchase of two condos and the sale of one condo. He is always very professional, respectful, patient, showing me as many properties as I wanted to see. He is always available in a timely manner. He also has property of mine listed and he is constantly giving me updates on any inquiries and that is something that I really appreciate. I have recommended him to as many people as I can and I will continue to do so.", "pics": null, "resp": {"time": 1595796676336, "text": "I appreciate the vote of confidence Ms. Becky! Thank you very much taking time out of your day. Super happy for you, one more to go! Please don't hesitate to reach out if you need anything."}, "gmap_id": "0x889a074b15f59581:0xf43a235668e7ba1d"}
{"user_id": "100356926129506980275", "name": "Rebecca Guinn", "time": 1595527217858, "rating": 5.0, "text": "Chris has been great to work with during the sale of our property. He kept on top of our sale like we were his only clients and I know we were not. He was very patient with my constant questions. We had not sold anything for some time so things have changed! I would  recommend him for any of your real estate needs.", "pics": null, "resp": {"time": 1595869718257, "text": "I appreciate the kind words. I appreciate you choosing to do business with me and glad we got it done! One more closing on your gulf front condo! You know I’m here if there is anything you need!"}, "gmap_id": "0x889a074b15f59581:0xf43a235668e7ba1d"}
{"user_id": "107562034426775500491", "name": "Kyle Barrentine", "time": 1596541154751, "rating": 5.0, "text": "Chris worked very hard with us over a very long time to find that just right condo.  We had to learn about the beach market.  He is patient, concerned with the overall goals and concerns of his clients, and will protect his clients’ interests.  I highly recommend Chris!", "pics": null, "resp": {"time": 1596890835918, "text": "THANK YOU FOR THE REVIEW AND HUMBLING WORDS. I GUESS THE SAYING IS TRUE, \"3RD TIMES A CHARM!\" WITH RATES BEING SO LOW, I'D SAY IT WAS A GOD THING WE STALLED. IF I CAN HELP YOU OR SOMEONE KNOW WITH U WITH ANYTHING, I'M ALWAYS WILLING! THANK YOU FOR"}, "gmap_id": "0x889a074b15f59581:0xf43a235668e7ba1d"}
{"user_id": "113069401821808229278", "name": "Jason Fikes", "time": 1620488185742, "rating": 5.0, "text": "Chris was on point and got me a great deal.", "pics": null, "resp": {"time": 1620605464258, "text": "Thank you for taking the time to leave a review. Proud for you and your family. Hard work pays off."}, "gmap_id": "0x889a074b15f59581:0xf43a235668e7ba1d"}
{"user_id": "101232710996483286650", "name": "Jeremy Perry", "time": 1544486747746, "rating": 5.0, "text": "I am lucky enough to have known Chris for several years and when I found out he was a real estate agent, I jumped at the chance to use him to help my wife and I search for a family home in the Gulf Shores area. Chris was very up to date on the market prices and made an amazing offer for the perfect home.  After getting moved in and settled, Chris offered to help with the house we were moving out of, to get it listed. Chris went above and beyond, making the house move in ready and ensuring it had great curb appeal. The house sold at a great price because he was staying on top of the trends for our area. The best thing, is that Chris was easy to work with, and always available for phone calls or meetings.  Thank you, Chris Vail! We will recommend you to everyone buying or selling a home.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM37Zo_2HqNxI6bvB-SqmLkyAzC0g4ToUWAInL_=w150-h150-k-no-p"]}], "resp": {"time": 1582363668475, "text": "I don’t know about all that but it sure is humbling to read. I Appreciate the kind words and look forward to the next steps in your new path! Thanks Jeremy"}, "gmap_id": "0x889a074b15f59581:0xf43a235668e7ba1d"}
{"user_id": "110044670379083488741", "name": "Brian Ferguson", "time": 1588914464521, "rating": 5.0, "text": "Honest, reliable and prompt- everything you could ask for in a friend to help you navigate a real-estate investment.  Cannot say enough positive accolades. Highly recommended", "pics": null, "resp": {"time": 1589832930926, "text": "I appreciate the kind words. I'm so glad I could help you. Please don't hesitate to reach out if you need anything else."}, "gmap_id": "0x889a074b15f59581:0xf43a235668e7ba1d"}
{"user_id": "112798374429697770974", "name": "Montry Whitfield", "time": 1573773322022, "rating": 5.0, "text": "Chris Vail did a great job as our buyer agent, and again recently as our seller's agent.  He always answered my calls and promptly returned emails. he went beyond expectations making sure our home closed on time  I would recommend Chris Vail for any of your real estate needs.", "pics": null, "resp": {"time": 1581477670735, "text": "Thanks Montry! I appreciate the thumbs up! Know you wanted to go but hate you all left. You MAY come back...this place has a way of getting in the blood 😎"}, "gmap_id": "0x889a074b15f59581:0xf43a235668e7ba1d"}
{"user_id": "105265525173498214949", "name": "Philip English", "time": 1598198344426, "rating": 5.0, "text": "Very professional, Chris goes above and beyond to provide quick answers to any questions I have.", "pics": null, "resp": {"time": 1598214079526, "text": "I appreciate the kind words. I'm so glad I could help you. Please don't hesitate to reach out if you need anything else."}, "gmap_id": "0x889a074b15f59581:0xf43a235668e7ba1d"}
{"user_id": "116667872324271783365", "name": "joey grodzicki", "time": 1541908845322, "rating": 5.0, "text": "Chris Vail is an awesome realtor! Very professional with unsurpassed knowledge of the area. As a representative for us as a seller, Chris did a fantastic job negotiating on our behalf and was very astute in contract detail when buyers agent attempted to include uniquely worded requests.\n\nAs representative for us as a buyer, he works just as keenly and hard in locating the best value for our family. He is always available, and considerate, to answer even the most trivial questions or concerns.\n\nWe would highly recommend Chris to any buyer/seller of either single family or multi-residential properties in our area. We will never have the need to search out another realtor as long as Chris is in Orange Beach.", "pics": null, "resp": {"time": 1583641489764, "text": "Joey I responded to your humbling review when it was written, I apologize I’m just not uncovering there was evidently an issue and the response did not post. I appreciate your support and look forward to you all getting down here more often!"}, "gmap_id": "0x889a074b15f59581:0xf43a235668e7ba1d"}
{"user_id": "116902900269370245299", "name": "Tonya Fortenberry", "time": 1568597426823, "rating": 5.0, "text": "Chris was great! He helped us find the perfect property for our family! Very knowledgeable about the area. He assisted us in navigating through each step in the buying process and was always ready with recommendations and alternatives for every need!", "pics": null, "resp": {"time": 1583477898892, "text": "Tonya,\n\nI apologize for the delay. I did respond immediately, evidently the platform I used wasn’t working properly, even though it showed the response on my end. Nevertheless, I very much appreciate the vote of confidence and it was my pleasure! If there’s ever anything you all need, please do not hesitate to reach out. Thank you!"}, "gmap_id": "0x889a074b15f59581:0xf43a235668e7ba1d"}
{"user_id": "114463995453615533126", "name": "Daniel English", "time": 1562637883914, "rating": 5.0, "text": "Chris Vail is the best agent you'll find on the Gulf. Great knowledge of the area and great realtor overall. Thanks for helping us but our home and later sell it. Definitely using Chris if we come back to town..", "pics": null, "resp": {"time": 1583479060670, "text": "Danny,\n\nI apologize for the delay. I did respond immediately, evidently the platform I used wasn’t working properly, even though it showed the response on my end. Nevertheless, Thank you for the taking the time out of your day to leave such kind words. Reviews help future buyers and sellers a general idea of what they can expect, so they are invaluable. Hope all wis well and I’m here if you need anything. Thank you!"}, "gmap_id": "0x889a074b15f59581:0xf43a235668e7ba1d"}
{"user_id": "100475765030117156022", "name": "Beverly Campbell", "time": 1583156628821, "rating": 5.0, "text": "Worked diligently to get closing done in a timely fashion... was available throughout the process!  Great Job!", "pics": null, "resp": {"time": 1583478710843, "text": "Beverly,\n\nThank you for the kind words and for trusting to me to get the job done. If I can help with anything in the new unit, you know I’m here if you need me. Thank you"}, "gmap_id": "0x889a074b15f59581:0xf43a235668e7ba1d"}
{"user_id": "113449334309414326558", "name": "Kathy Blue", "time": 1571068814478, "rating": 5.0, "text": "Chris is extremely knowledgeable about the housing market in the area and  was key to us getting a great deal on our 'second home' purchase recently. He went above and beyond with the details and coordination of the purchase as we live out of state.   I highly Chris Vail for any real estate purchase.", "pics": null, "resp": {"time": 1596180287446, "text": "I don’t know about all that but it sure is humbling to read. I sure do appreciate you taking the time to leave a review and look forward to next time! Referrals are the heartbeat of business if you someone you know ever needs anything. Thank you both!"}, "gmap_id": "0x889a074b15f59581:0xf43a235668e7ba1d"}
{"user_id": "104318698932666930333", "name": "Linda Urquhart", "time": 1567786816508, "rating": 5.0, "text": "Chris is a very professional young man who went over and beyond helping us find our new home! Excellent person to have working for you. Let him sell your home or find you a new one.", "pics": null, "resp": {"time": 1583478490012, "text": "Mrs Linda,\nI apologize for the delay. I did respond immediately, evidently the platform I used wasn’t working properly, even though it showed the response on my end. Nevertheless, I very much appreciate the vote of confidence and it was my pleasure! If there’s ever anything you all need, please do not hesitate to reach out. Thank you"}, "gmap_id": "0x889a074b15f59581:0xf43a235668e7ba1d"}
{"user_id": "106768975385247358830", "name": "rick flanigan", "time": 1567786650897, "rating": 5.0, "text": "Chris has helped us buy our dream home as well as two investment properties in Gulf Shores.  He has always been incredibly responsive and has a superb understanding of the market.  We will buy another investment property and Chris WILL be our Realtor", "pics": null, "resp": {"time": 1583478550254, "text": "Mr Rick,\n\nI apologize for the delay. I did respond immediately, evidently the platform I used wasn’t working properly, even though it showed the response on my end. Nevertheless, I very much appreciate the vote of confidence and it was my pleasure! If there’s ever anything you all need, please do not hesitate to reach out. Thank you!"}, "gmap_id": "0x889a074b15f59581:0xf43a235668e7ba1d"}
{"user_id": "115867750895339205813", "name": "Chris Bazor", "time": 1541951779416, "rating": 5.0, "text": "Chris sold our condo and he absolutely earned his commission through excellent customer service, market knowledge, advertising, and good negotiation skills.  He made it easy for us, and he also made it equally as easy for the family who purchased our unit.  I highly recommend.", "pics": null, "resp": {"time": 1596180556538, "text": "Thanks Mr! Means a lot coming from you! We need or at least I need some salt therapy! I’m hear if you need anything."}, "gmap_id": "0x889a074b15f59581:0xf43a235668e7ba1d"}
{"user_id": "108310246509223834408", "name": "Megan Retherford", "time": 1541872240963, "rating": 5.0, "text": "Chris is honest, efficient, and will go above and beyond to help you find the perfect home! He knows the market and works tirelessly to find a property that is a perfect fit. We wouldn’t be in the home we have today if it weren’t for him. Sincerely, The Retherford’s", "pics": null, "resp": {"time": 1596180848038, "text": "Thank you for taking time to write such a humbling review, hopefully the next home I won’t have to “build” for you all the day before closing! I’m here if there’s ever anything you need!"}, "gmap_id": "0x889a074b15f59581:0xf43a235668e7ba1d"}
{"user_id": "101266154066918059709", "name": "Kate Dirkes", "time": 1555697701316, "rating": 5.0, "text": "Chris did a great job, he let me take my time and walked me thru each step of the process", "pics": null, "resp": {"time": 1582363576959, "text": "Thank you Miss Kate! Glad it all worked out, perfect timing! Win-win-win!"}, "gmap_id": "0x889a074b15f59581:0xf43a235668e7ba1d"}
{"user_id": "105060570226026545526", "name": "Shellie Wesson", "time": 1542071618741, "rating": 5.0, "text": "Chris is a wonderful agent!  He goes above and beyond to help find your dream home!  Highly recommend!!", "pics": null, "resp": {"time": 1596180700085, "text": "Thank you for taking time to write such nice things! If you all ever come back this way, i’m here to help!"}, "gmap_id": "0x889a074b15f59581:0xf43a235668e7ba1d"}
{"user_id": "105113329073886771663", "name": "June Bentley", "time": 1541880614781, "rating": 5.0, "text": "Chris helps in every aspect. He is very knowledgeable and shares it with agents and clients.", "pics": null, "resp": {"time": 1583641693490, "text": "Thank you for taking time out and for the kind words. Referrals are the backbone of  my business and your support is cherished! Until next time! I’m here if you need anything."}, "gmap_id": "0x889a074b15f59581:0xf43a235668e7ba1d"}
{"user_id": "118158155349636330042", "name": "Sarah Corby", "time": 1612563131322, "rating": 5.0, "text": "We had a great experience with Renters Warehouse! The approval process was quick and easy! I called the main number and spoke with Al. The home we were inquiring about had just been taken off the market, but Al was quick to find us something comparable! Cindy took over from there as it was her house and she was super helpful and friendly!  I definitely recommend Renters Warehouse!", "pics": null, "resp": {"time": 1612908209251, "text": "Sarah, we are delighted to hear that Al and Cindy were able to help you find your new home. We love what we do, and getting word that we are exactly what you were looking for makes us beyond excited. Our goal is to have everyone experience the sense that we are part of their family. Thank you for taking time to share your opinion with others."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "100362823988334542375", "name": "Jason Ryu", "time": 1623194279136, "rating": 1.0, "text": "Do not expect to get your security deposit back. RW does not protect tenant's security deposit.\nThey let my landlord withdraw my security deposit, without giving me any contact or information about deduction, even after, I contact them more than 15 times and it all happens after I go through moving out inspection and evict.\nI requested refund or the evidence of maintenance which I'm obviously not responsible(Can't even tell it really happend), every single email or call I make them, gave me the same answer(check posted photo).\nSo basically, if you rent place through this company, land lord can make up some reasons after you evict, and before you receive your security deposit, they can simply withdraw it without your authorization, and just ghost you, wonderful experience!", "pics": null, "resp": {"time": 1623972346797, "text": "The property owner determines any and all charges that are assessed during the move out. Our disposition manager spoke with you after you had concerns with the charges that the property owner assessed. You provided our office your written dispute of the security deposit. The disposition manager was able to send your dispute to the homeowner for their determination. Upon review, the property owner feels the amounts withheld are justified and no adjustments will be made. This is the property owner’s final decision and, unfortunately, there is no further action that Renters Warehouse can take on your behalf in regards to this dispute."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "105353911893332076686", "name": "Jay Baxter", "time": 1611930881781, "rating": 5.0, "text": "Today I sat down in front of the TV to eat some breakfast... and that's when I discovered a tornado and dangerously strong winds had hit one of the places my family purchased rental properties.  We were in panic mode since we have wonderful tenants and nice properties there.  I called Maria Guevara at Renter's Warehouse... and, in less than 2 hours, she was able to help me confirm that all of my tenants in those 8 properties were okay.  Maria, thank you so much for removing my family's migraine and ulcer this morning, we sure do appreciate you and the rest of your team!  Please stay amazing.", "pics": null, "resp": {"time": 1604630590886, "text": "What a wonderful surprise! Your words of encouragement, Jay make us feel proud of what we do. Businesses are mainly about people connecting to people and knowing that our team is on the ball makes us proud. It is great to know that Maria was able to provide you with the highest levels of service and peace of mind."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "101499298437199903986", "name": "Tiffany Parham", "time": 1597071573758, "rating": 5.0, "text": "I had the pleasure of working with Melissa Morris, and she was everything we needed, plus more! Friendly, and proved that getting my family into the home we were interested in was a top priority of hers. She was always helpful and supplied all information promptly. I would most definitely recommend her to anyone else looking to rent. Thank you Melissa!", "pics": null, "resp": {"time": 1597791499291, "text": "WOW! Tiffany, we can't begin to tell you how nice it is to hear words of encouragement, appreciation and praise.  We want every single customer that gives us the opportunity to serve them, to experience the same level of service. We are so happy to hear that Melissa is committed to our customers, making them top priority!  It is customers like you taking the time to tell us what we are doing right, that we are able to constantly strive for excellence. We will be sure to give Melissa a pat on the back."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "100578812099485049497", "name": "Crystal Jones", "time": 1623166141872, "rating": 5.0, "text": "Maria sent my documents over and waited with me on the phone until I received them.", "pics": null, "resp": {"time": 1623971163348, "text": "Thank you for your kind words and for giving Maria a high five for all that she does. We are hard at work to make our business the business of choice for those who appreciate superior quality and a passion for excellence.  It is truly nice to know that our efforts are paying off."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "102498475275976476817", "name": "Meilyn Savinon", "time": 1595108000176, "rating": 5.0, "text": "Melissa was amazing! She was so polite and pleasant to work with. She called me and let me know what was going on and made it a breeze to work with her. Quality you just don’t find anymore. Definitely looking forward to working with her again!", "pics": null, "resp": {"time": 1595352491784, "text": "Meilyn  we appreciate you taking the time to share your experience with us.  We are constantly hard at work doing everything we can to deliver high quality experiences to every one of our customers.  We are so glad we were able to help you out. We look forward to working with you again."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "116032068245508039141", "name": "Sheoakie Ray", "time": 1594314825444, "rating": 5.0, "text": "From my very first encounter with Jessica Stockdale, I knew that she represented a company of pure professionalism. She made me comfortable from the first day. She treated me with kindness and respect throughout the entire process, and worked very diligently to get the process complete....", "pics": null, "resp": {"time": 1594753777265, "text": "Sheoakie  we appreciate you taking the time to share your experience with us.  We are constantly hard at work doing everything we can to deliver high quality experiences to every one of our customers.  We are so glad we were able to help you out. We look forward to working with you again."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "106852445336821063552", "name": "Coya James", "time": 1599107383750, "rating": 5.0, "text": "I had the pleasure of working with Cindy. From the moment of the binding contract she helped me and made sure that she was accessible to ensure we all got to the closing table. I hope to work with her again in the near future.", "pics": null, "resp": {"time": 1599707345759, "text": "Coya, thank you for taking the time out of your busy schedule to share your experience. We are constantly hard at work doing everything we can to deliver high quality experiences to every one of our customers.  We are so glad Cindy was able to help you out. Helping our customers is what we love best. Everyone looks forward to the next opportunity of serving you and yours."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "104639295919075815269", "name": "Brian Nunn", "time": 1584032602467, "rating": 5.0, "text": "My realtor is Cindy Adair. She's the most amazing and professional realtor we've ever met . She's an angel whom helped me and my wife to find the perfect house. She's very amazing at her job, Renters warehouse is very lucky to have her.   To summarize it Cindy is the best . Thank you and we love you Cindy!!!", "pics": null, "resp": {"time": 1584037018662, "text": "Brian  we appreciate you taking the time to share your experience with us.  We are constantly hard at work doing everything we can to deliver high quality experiences to every one of our customers.  We are so glad we were able to help you out. We look forward to working with you again."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "113221910771019397925", "name": "Carlos L. Sayles", "time": 1595448126908, "rating": 5.0, "text": "I never ever post on these things, but I called Kim Schneider for information on investment services and she educated me about the market and answered all of my questions. Great job!", "pics": null, "resp": {"time": 1596133203016, "text": "Hello Carlos, thank you for taking the time to share your experience with us. We are thrilled to hear that Kim was able to provide you information on investment services and the current market. We hope to work with you again in the future Carlos."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "112718190055171859517", "name": "Yossi Golan", "time": 1601574971675, "rating": 5.0, "text": "VERY HELPFUL. EXCELLENT APPROACH\nESPECIALLY Myleen from RW Maintenance", "pics": null, "resp": {"time": 1602268961814, "text": "Thank you so much for your kind words, Yossi. We really appreciate you taking the time to share your experience with us."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "112526639434402954344", "name": "Carli N", "time": 1598040864644, "rating": 5.0, "text": "I called for information and Kimberly Schneider was so knowledgeable and answered all my questions! Great customer service!", "pics": null, "resp": {"time": 1598654347292, "text": "We are so grateful you were able to benefit from Kimberly's industry knowledge. We are here to help you leverage your rental property for future wealth. Be sure to check out our Education Center on our website, https://renterswarehouse.com/education, for more information!"}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "111026899720359419469", "name": "Drippy_2k", "time": 1590682731625, "rating": 5.0, "text": "Jessica Stockdale was very responsive and helpful during the process of looking for a rental property in the Birmingham area. I recommend her as an agent to anyone who is looking for a professional person to assist them in their search for a home.", "pics": null, "resp": {"time": 1591030133442, "text": "Aka_empress  we appreciate you taking the time to share your experience with us.  We are constantly hard at work doing everything we can to deliver high quality experiences to every one of our customers.  We are so glad we were able to help you out. We look forward to working with you again."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "114811735846599365758", "name": "Deborah Williams", "time": 1594315878378, "rating": 5.0, "text": "Jessica Stockdale was very professional,  very knowledgeable, & very in tuned to the needs of my family. I’m glad our paths crossed, I will definitely recommend her to family & friends. Thank you Jessica!", "pics": null, "resp": {"time": 1594753797693, "text": "What a wonderful surprise! Your words of encouragement, Deborah , make us feel proud of what we do.  Businesses are mainly about people connecting to people and knowing that our team is on the ball makes us proud.  It is great to know that we were able to provide you with the highest levels of service.  Our objective is that every client that utilizes our services is able to have a similar experience.  We hope you give us the opportunity to connect with you again."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "110227239382495359851", "name": "Mike Baker", "time": 1584272515971, "rating": 5.0, "text": "Cindy Adair in the Birmingham office recently provided excellent service to a customer of mine. She was tireless in her efforts to develop a solution benefiting both my customer and the property owner she represented. She is a true professional and a pleasure to work with.", "pics": null, "resp": {"time": 1584459162072, "text": "Mike, thank you so much for taking the time to share your experience with us. We are thrilled to hear that Carmen was able to assist you. We look forward to working with you again!"}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "108009304275452129405", "name": "James Howard", "time": 1598039175156, "rating": 5.0, "text": "I really liked Kimberly Schneider, she was great! I called Kimberly Schneider for some investment information.", "pics": null, "resp": {"time": 1598653892952, "text": "James, we are so glad to hear Kimberly was able to provide you with more information. We know the rental business. From marketing and management to maintenance and renewing, our focus is helping you have a smooth, profitable rental experience. Please let us know if we can further assist you."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "100028836510069916847", "name": "Austin S", "time": 1576123104858, "rating": 5.0, "text": "Dana Flenor has been working to find me the right house. She has been tracking down different places and digging to get the information needed to help narrow down the search. She is very nice and easy to work with and has helped make this whole process much easier. Would recommend!", "pics": null, "resp": {"time": 1576522671194, "text": "Austin  we appreciate you taking the time to share your experience with us.  We are constantly hard at work doing everything we can to deliver high quality experiences to every one of our customers.  We are so glad we were able to help you out. We look forward to working with you again."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "113375382300738134356", "name": "Madison Bentley", "time": 1591035045299, "rating": 5.0, "text": "Realtor Cindy Adair,\nhas and continues to exceed our expectations. We have looked at several homes. We are having Cindy list our home while she finds our forever home! HIGHLY RECOMMEND!", "pics": null, "resp": {"time": 1591808540769, "text": "Greetings Madison! Thank you for taking the time to share your experience with us. We are thrilled to hear that Cindy was able to exceed your expectations. We look forward to working with you again!"}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "115117898275401509987", "name": "PYLATO Cash Home Buyers", "time": 1577998421560, "rating": 5.0, "text": "I've been fortunate to have Kimberly Michael Schneider giving me insights on upgrades to my real estate business. She has extensive knowledge of her market and is a valuable asset that I recommend to my fellow Investor community.", "pics": null, "resp": {"time": 1578593047379, "text": "Pylato  we appreciate you taking the time to share your experience with us.  We are constantly hard at work doing everything we can to deliver high quality experiences to every one of our customers.  We are so glad we were able to help you out. We look forward to working with you again."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "117917013835391189994", "name": "Jessi Shields", "time": 1565629411311, "rating": 5.0, "text": "Codi was seriously the best! She has always been helpful and knowledgeable about it all! She will answer any call or email in a timely manner and is quick to get things done! If you want the best experience you should do yourself a favor and get with her! 😁", "pics": null, "resp": {"time": 1566412946655, "text": "We are so grateful for your feedback Jessi!  We recognize that at the core a business is about people. With that in mind we are always on the lookout for staff that is passionate about what they do.  As such, we are delighted to read how our staff delivered above and beyond your expectations.  We will do everything in our power to make certain every single visit is equally delightful.  Know that we are thankful for the trust you have placed on us. Know that we are working extra hard to always push ourselves to the next level.  We are looking forward to your next visit."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "102196670708446526431", "name": "Christina Parker", "time": 1583466851213, "rating": 5.0, "text": "Cindy bentley helped me as i was looking for homes and she did an excellent job. I would totally recommend Cindy as ur realtor when your looking for a house in the future or present. she is very passionate about her work and gets things done as fast as possible! She’s very dedicated to renters warehouse. thank you Cindy.", "pics": null, "resp": {"time": 1584047362781, "text": "Christina  we appreciate you taking the time to share your experience with us.  We are constantly hard at work doing everything we can to deliver high quality experiences to every one of our customers.  We are so glad we were able to help you out. We look forward to working with you again."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "109803044779383371567", "name": "Cardinal Roofing", "time": 1581963939885, "rating": 5.0, "text": "Jessica Stockdale with Renters Warehouse is top notch!! She assisted me with my lease transfer from beginning to end. Walked me through every step. Provided me with contact information to reach the office and owners if necessary. My lease was originally with GK Houses which by the way is absolutely horrible and I do NOT recommend ever working with them as you will not be able to reach anyone even during an emergency. Jessica turned this negative experience completely around as soon as Renters Warehouse took over my lease. I would highly recommend Jessica Stockdale with Renters Warehouse as your representative. 5 stars!!", "pics": null, "resp": {"time": 1582828110382, "text": "Cardinal  , thank you for taking the time to let us know how we are doing.  Our staff is constantly hard at work finding ways to exceed customer's expectations and provide seamless service.  We are so glad our efforts are paying off and you had the opportunity to experience superior service.  Your comments about our team fill us with pride and equip us to provide clear and specific examples of how excellence looks like.  Please continue to visit us and help us implement a strategy focused on constant improvement.  We are honored to have had the opportunity to serve you."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "112536744706739774736", "name": "Patty Pelfrey", "time": 1588109944718, "rating": 5.0, "text": "We needed to have the A/C unit checked, as the very hot weather here in Phoenix has returned. The Renter's Warehouse representative, Renee, was very pro-active, and the A/C is running just fine now.", "pics": null, "resp": {"time": 1589556244536, "text": "Patty  we appreciate you taking the time to share your experience with us.  We are constantly hard at work doing everything we can to deliver high quality experiences to every one of our customers.  We are so glad we were able to help you out. We look forward to working with you again."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "111030494274473994333", "name": "Percina Johnson", "time": 1574812250483, "rating": 5.0, "text": "Mrs. Kathy is awesome! I let her know what our situation was and she was able to assist us with getting approved for a property! That meant a lot to my husband and I. Thank you so much love!!!!", "pics": null, "resp": {"time": 1575486406243, "text": "Percina  we appreciate you taking the time to share your experience with us.  We are constantly hard at work doing everything we can to deliver high quality experiences to every one of our customers.  We are so glad we were able to help you out. We look forward to working with you again."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "112323770871110525119", "name": "Marcell Wrenn", "time": 1575484225480, "rating": 5.0, "text": "Dana Flenor was my realtor and she was absolutely great at her job. My intentions were to rent out an apartment, but I was unable to find a good one with my credit. Instead, she was able to find me the perfect house in the perfect area for work and school and at an even better price!!!", "pics": null, "resp": {"time": 1575913696947, "text": "Marcell  we appreciate you taking the time to share your experience with us.  We are constantly hard at work doing everything we can to deliver high quality experiences to every one of our customers.  We are so glad we were able to help you out. We look forward to working with you again."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "102022704144752056549", "name": "Hillary Conway", "time": 1586270531787, "rating": 1.0, "text": "Lazy realtor, pictures of the house were of the house when it was brand new... Not the condition I received it in.  Covered in filth, 20 bags of garbage at the road side, MOLD all over in the house.  The best answer I got for resolution was, \"you knew what you were getting when you moved in\".\nBe careful", "pics": null, "resp": {"time": 1589934081912, "text": "Hilary, our apologies for the delay in our response. Due to the COVID-19 situation, Google delayed publishing user reviews and are now gradually publishing these reviews, thank you for your patience. I am sorry to hear that you experienced these issues. Your lease began on April 1st. On April 6th you contacted us with complaints about the smell of mold and the condition of the water heater. We considered this to be an emergency case and immediately contacted the homeowner. A vendor was approved to visit the property. Upon inspection the tech found no odor that would be related to organic matter. The home was in need of a good cleaning but there were no visible signs of organic matter as well. The water heater was unable to be checked due to no power being on in the home, the tech did check for leaks and found none in its current state. Other issues throughout the home were noted and included in an estimate, the owner approved for all repairs to be made at your earliest convenience. You refused to schedule with the vendor and requested to terminate the lease. The owner approved your request on April 15th, we are currently in the process of closing your account. If you have any questions please contact our office at 844-793-4948, we will be happy to assist."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "107832909802787470107", "name": "Dharnell Carrenard", "time": 1594494906136, "rating": 4.0, "text": "Kimberly Schneider was very helpful and professional. She assisted me with all my worries and questions.", "pics": null, "resp": {"time": 1594753556967, "text": "Thank you so much for your kind words, Dharnell. We really appreciate you taking the time to share your experience with us."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "102184907930987163318", "name": "karla Orduno", "time": 1571110796550, "rating": 5.0, "text": "Jessica Stockdale was very professional throughout the process and very attentive to all of our needs and helpful with all questions we had come up. She was very outgoing to be available to help us out. We highly recommend her and are very pleased with her services.", "pics": null, "resp": {"time": 1571850605773, "text": "Karla, words do not suffice to express how grateful we are for your review.  Reviews highlighting the commitment of our people to serve every client with passion reaffirm that we are indeed living up to our core values.  We select, train and coach our team around the idea that clients deserve memorable and positive experiences and it is up to them to deliver.  We are glad to know your experience was positive in every possible way.  We look forward to your next visit!"}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "116789599508288211673", "name": "Ari Aynor", "time": 1574689419172, "rating": 5.0, "text": "I'm pleased with the service provided by Jessica Stockdale who has helped us at every part from start to finish. She is Hardworking, professional and kind. Very recommend!", "pics": null, "resp": {"time": 1575486494442, "text": "Hello Ari, thank you for taking the time to share your experience with us. We are thrilled to hear that Jessica was able to  provide you an excellent experience. We look forward to working with you again!"}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "110851330690255069706", "name": "Tony Madison", "time": 1579663194911, "rating": 5.0, "text": "Jessica Stockdale was excellent to work with! She was patient, kind, and very helpful. She made the house hunting experience easy. We are glad she was our agent.", "pics": null, "resp": {"time": 1580940363410, "text": "Tony , thank you for taking the time to let us know how we are doing.  Our staff is constantly hard at work finding ways to exceed customer's expectations and provide seamless service.  We are so glad our efforts are paying off and you had the opportunity to experience superior service.  Your comments about our team fill us with pride and equip us to provide clear and specific examples of how excellence looks like.  Please continue to visit us and help us implement a strategy focused on constant improvement.  We are honored to have had the opportunity to serve you."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "106781973677688105922", "name": "James Kosek", "time": 1579622595351, "rating": 5.0, "text": "Cindy Bentley is a joy to work with due to her knowledge, professionalism and easy going manner.   It is rare that I go out and do a review but she is certainly worth it.", "pics": null, "resp": {"time": 1580940187502, "text": "We are so grateful for your feedback James !  We recognize that at the core a business is about people. With that in mind we are always on the lookout for staff that is passionate about what they do.  As such, we are delighted to read how our staff delivered above and beyond your expectations.  We will do everything in our power to make certain every single visit is equally delightful.  Know that we are thankful for the trust you have placed on us. Know that we are working extra hard to always push ourselves to the next level.  We are looking forward to your next visit."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "107480863349833289101", "name": "butch daniels", "time": 1582733725161, "rating": 5.0, "text": "I want to thank my realtor Jessica Stockdale for all of her help and professionalism.\nYou really don't know how much you helped me.\n\nThanks again\nJL DANIELS", "pics": null, "resp": {"time": 1589556746650, "text": "Butch  we appreciate you taking the time to share your experience with us.  We are constantly hard at work doing everything we can to deliver high quality experiences to every one of our customers.  We are so glad we were able to help you out. We look forward to working with you again."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "108877952980081551778", "name": "miles gamble", "time": 1573163234735, "rating": 1.0, "text": "1st account manager scammed my tenant out of a $950 deposit that should've gone to me. After firing him I was assured the money would be refunded after the eviction was completed. After months of following up I never received the deposit.", "pics": null, "resp": {"time": 1573678986629, "text": "Hello Miles, you had a tenant placed in the home on 2/8/2018 and they were evicted from the home on 10/4/2018. After they were required to vacate the premises the disposition was proceeded with. The charges assessed to the past tenant exceeded the security deposit funds. The security deposit totaling $950.00 was to be sent to you as the homeowner. However, this balance was applied towards the outstanding balances on your account. The following charges on your account were the following; $55.00 for an estimate fee, management fees from June - October, and a portion of your re-keying of the property. Please be advised, their is still a balance owed on your account for this re-key of the property. Please submit a payment for this outstanding balance on your account. If you have additional questions please contact our office at 844-793-4948 and we will be happy to assist you."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "100830951866869302896", "name": "Ashleigh McMullen", "time": 1588625897931, "rating": 1.0, "text": "Absolutely horrible experience. After agent finally returned call,\nSet up an appointment to show us property, rented it out from under us without a word. Only reason we knew it was rented is because I called to confirmed a showing. Would not recommend at all", "pics": null, "resp": {"time": 1590507285596, "text": "Our apologies for the delay in our response. Due to the COVID-19 situation, Google delayed publishing user reviews and are now gradually publishing these reviews, thank you for your patience, Ashleigh. We are sorry to hear you were unsatisfied with your showing and application process. Our agents do have busy times and typically do not answer their phones while showing a property. They are good about returning calls when they are available. Scheduling a showing is also available through our website. Each rental property will continue to be shown and accept applications until an applicant has been approved and hold funds have been submitted. At that time, the home is no longer shown. Each individual homeowner determines whether or not to accept an applicant."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "107403957442581168632", "name": "KXNG KAMPION", "time": 1594478038032, "rating": 5.0, "text": "I was beyond greatfull for Kimberly's help & guide-thru regarding the whole process!!!", "pics": null, "resp": {"time": 1594753583247, "text": "King, thank you for taking the time to share your experience with us. We look forward to working with you again!"}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "101571563666311787913", "name": "Alicia Nyelle", "time": 1566918904193, "rating": 5.0, "text": "Dana Flenor was amazing and extremely timely. We told her that we had a certain time that we’d like to move by and she made it happen. I definitely recommend.", "pics": null, "resp": {"time": 1567709530008, "text": "Hello Alicia, thank you for taking the time out of your busy schedule to share your experience with us.  We are constantly hard at work doing everything we can to deliver high quality experiences to every one of our customers.  We are so glad we were able to help you out. Helping our customers is what we love best.  Customers just like you make doing what we do a true pleasure. Everyone looks forward to the next opportunity of serving you and yours.  Our brand promise is all about delivering seamless experiences that exceed customer expectations!  We sincerely look forward to serving you time after time."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "104475479788948971949", "name": "Pollard Capital", "time": 1550253619548, "rating": 5.0, "text": "I recommend Mrs. Stockdale for any rental property business. She is a very personable and knowledgeable person of the owner/tenant process. She exhibited patience and skill in educating her clients on the topic of property management. It is a breath of fresh air to work with a professional of this level. I recommend her services to anyone!", "pics": null, "resp": {"time": 1550863914526, "text": "Pollard Capital, thank you for taking the time to let us know how we are doing.  Our staff is constantly hard at work finding ways to exceed customer's expectations and provide seamless service.  We are so glad our efforts are paying off and you had the opportunity to experience superior service.  Your comments about our team fill us with pride and equip us to provide clear and specific examples of how excellence looks like.  Please continue to visit us and help us implement a strategy focused on constant improvement.  We are honored to have had the opportunity to serve you."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "104275312019524646958", "name": "Leondretta Davis", "time": 1573690577585, "rating": 5.0, "text": "My experience with Dana Flenor was so awesome!!!\nShe's very professional and informative from start to finish. I recommend using for any of your Real Estate needs. Thanks again Dana Flenor for the Great experience.", "pics": null, "resp": {"time": 1574280730248, "text": "Leondretta  we appreciate you taking the time to share your experience with us.  We are constantly hard at work doing everything we can to deliver high quality experiences to every one of our customers.  We are so glad we were able to help you out. We look forward to working with you again."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "106527835663711418043", "name": "Tha Fairley Gang", "time": 1564927151444, "rating": 5.0, "text": "Jessica Stockdale is awesome! She helped my husband and I get a beautiful house that caters to my family in every way. Thanks a lot Jessica, your truly God sent.", "pics": null, "resp": null, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "104224410140442512457", "name": "katelyn bentley", "time": 1583372695236, "rating": 5.0, "text": "cindy my husband and I appreciate all your help in helping us to find a home, we are new to the birmingham area. It’s amazing how professional you are about your work and how serious you take your work. i would recommend cindy adair to help you as you are trying to find a home. she is an amazing realtor.", "pics": null, "resp": {"time": 1583379916277, "text": "What a wonderful surprise! Your words of encouragement, Katelyn , make us feel proud of what we do.  Businesses are mainly about people connecting to people and knowing that our team is on the ball makes us proud.  It is great to know that we were able to provide you with the highest levels of service.  Our objective is that every client that utilizes our services is able to have a similar experience.  We hope you give us the opportunity to connect with you again."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "114024294735183907418", "name": "Bridg Bowen", "time": 1554898107262, "rating": 5.0, "text": "I had the best experience with Jessica Stockdale. She showed me the house on a weekend and made the experience so great. She always kept me informed about the process, and made sure my needs were met just like she did with the landlord.", "pics": null, "resp": {"time": 1555693517354, "text": "WOW! We can't begin to tell you how nice it is to hear words of encouragement, appreciation and praise Bridg.  We want every single customer that gives us the opportunity to serve them, to experience the same level of service. It is customers like you taking the time to tell us what we are doing right, that we are able to constantly strive for excellence.   We may not be as large as other businesses but we are committed to our customers as our #1 priority!  Thank you once again for giving us a pat on the back. Please visit us again. It will be our honor and delight to serve you."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "104894017273529204759", "name": "Cierra Hicks", "time": 1571856705386, "rating": 5.0, "text": "I was interested in a property in Birmingham and worked with Kimberly Schneider and she was wonderful! Very knowledgeable and on top of things!", "pics": null, "resp": {"time": 1572458417074, "text": "Cierra, thank you so much for taking the time to write such a nice review.  We are so delighted to hear that your experience exceeded your expectations.  It is because of feedback like yours that we are able to select meaningful services of superior quality. We are confident you will continue to be pleased!"}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "102784492480460228627", "name": "Scott Edwards", "time": 1554866334519, "rating": 5.0, "text": "Shout out to Melissa Morris who was always ready to show us properties, chat with us and answer our many many questions. She picked up the phone whenever we called with a question that had popped into our heads. She really walked us through the process. Put us at ease. And answered her phone. No one else from the other competitor companies would call us back but she did. I highly recommend her and her company Renters Warehouse if anyone is looking to rent a home.", "pics": null, "resp": {"time": 1555693426793, "text": "Hi Scott, we are so grateful for your feedback.  We are beaming with pride knowing that we hit the mark and delivered on everything that we promised.  Your opinion is valuable to us and helps us shape everything that we do.  By sharing it with us not only do you encourage our team; you give us the necessary information to constantly strive to try our best.  Your opinion also empowers other people in the community to connect with us and enjoy all the services we currently provide.  We can't wait for the next opportunity to serve you; and will do everything in our power to once again allow you to experience the best that we have to offer."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "106906536011852459182", "name": "Dror Samoelov", "time": 1581360738376, "rating": 5.0, "text": "Eventhogh this is a big prooetty management company and own few properties i got the best agent i had ever expect Jessica Stockdale , the personal service and care is a VIP service", "pics": null, "resp": {"time": 1582139630484, "text": "Hello Dror, thank you for taking the time to share your experience with us. We are happy to hear that Jessica was able to assist you. We look forward to working with you again!"}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "106899586679180326729", "name": "Stephanie Moore", "time": 1561822621867, "rating": 5.0, "text": "Jessica Stockdale with Renters Warehouse was awesome to work with! She made the process so easy, literally I was able to rent my new townhouse within 1 day! Fastest turnaround ever! She made it happen, all while out of town conducting other business! I will recommend using Jessica Stockdale anytime!", "pics": null, "resp": {"time": 1562349529208, "text": "Stephanie, we really appreciate that you took the time to share details about your experience with us.  Thank you so much for taking a few moments to let us know how we are doing.  Reading your review was of great encouragement to me personally, reminding me why we do what we do.  It is because of feedback like yours that we are able to confirm that we are heading in the right direction.  We will be sharing your review with the team as a way to encourage them to continue to strive for excellence in customer service.  We look forward to the next opportunity to serve you."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "100061370043459433108", "name": "Amaryllis Oona", "time": 1573963375778, "rating": 5.0, "text": "I worked and continue to work closely with Dana. She is simply amazing - so personable, very thorough, so caring and willing and able to work with you. I couldn't ask for a better person with whom to work.", "pics": null, "resp": {"time": 1574280740781, "text": "Thank you so much for your kind words, Amaryllis. We really appreciate you taking the time out to share your experience with us.\n\nCheers,\n\nRenters Warehouse"}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "107674091755776987626", "name": "Jeromy Mcintosh", "time": 1573690608777, "rating": 5.0, "text": "Dana flenor was friendly and very helpful and personable and was just all around fantastic 10/10 would recommend", "pics": null, "resp": {"time": 1574280718379, "text": "Hello Jeromy, thank you for taking the time to share your experience with us. We look forward to working with you again!"}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "104134949543044225235", "name": "alex ham", "time": 1567273154741, "rating": 5.0, "text": "Dana Flenor was absolutely incredible in, adapting and keeping us updated in the ever changing world of a brand new house being build as well as the renting process. She’s made it incredibly easy and super nice to work with!", "pics": null, "resp": {"time": 1567627131962, "text": "Hi Alex, thank you for taking the time out of your busy schedule to share your experience with us. We look forward to working with you again!"}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "102518727703226967568", "name": "Hands On Residential Services", "time": 1572526789798, "rating": 5.0, "text": "I enjoyed working with Kimberly Schneider . She is very professional & knowlegeable about the real estate market in Birmingham, AL.She is a huge asset to your company.", "pics": null, "resp": {"time": 1572904937112, "text": "We are so grateful for your feedback.  We are beaming with pride knowing that we hit the mark and delivered on everything that we promised.  Your opinion is valuable to us and helps us shape everything that we do.  By sharing it with us not only do you encourage our team; you give us the necessary information to constantly strive to try our best.  Your opinion also empowers other people in the community to connect with us and enjoy all the services we currently provide.  We can't wait for the next opportunity to serve you; and will do everything in our power to once again allow you to experience the best that we have to offer."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "108604598036579054564", "name": "david thom", "time": 1616481827119, "rating": 1.0, "text": "Don’t waste your time, you will regret it.", "pics": null, "resp": {"time": 1589904601699, "text": "David, we are sad to hear we did not provide you with the best possible experience. We are known for taking ownership and caring deeply for our clients, please reach out to our office with your concerns at 844-793-4948 and we will be happy to assist you."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "103509057326121084153", "name": "Ashley Sullivan", "time": 1542576892907, "rating": 5.0, "text": "Great experience!!!! I would greatly recommend others to this company. I enjoyed Mrs.Jessica and team services and highly excited about moving into new home. Thanks and great process.", "pics": null, "resp": {"time": 1542652944283, "text": "Hello Ashley! We wanted to take a moment to thank you for telling us more about your experience with us.  From the start we have made it our goal to hire individuals who are passionate about service and willing to go the extra mile.  It is good to know that our team exceeded your expectations and made your experience memorable.  Your words of appreciation make a world of difference and set the tone for our employee's morale.  We will be sure to share your review with our team on our next staff meeting.  Do allow us the opportunity to serve you again. We will do everything in our power to deliver an even better customer experience."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "108148209622691732966", "name": "Nick Chiappetta", "time": 1564961782983, "rating": 5.0, "text": "Jessica Stockdale was very professional and extremely helpful. She made it really easy for me to move in and was in the house in less then a week I would definitely recommend her. Thank you Jessica for ur help and getting me in my new home fast and easy", "pics": null, "resp": {"time": 1565196655752, "text": "Nick, we really appreciate that you took the time to share details about your experience with us.  Thank you so much for taking a few moments to let us know how we are doing.  Reading your review was of great encouragement to me personally, reminding me why we do what we do.  It is because of feedback like yours that we are able to confirm that we are heading in the right direction.  We will be sharing your review with the team as a way to encourage them to continue to strive for excellence in customer service.  We look forward to the next opportunity to serve you."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "104486015468814053689", "name": "Jsin Jenkins", "time": 1552666045638, "rating": 5.0, "text": "Jessica was an excellent partner in my real estate dealings.  She's reliable, hard working, creative and unstoppable!  She always came to me with solutions whenever she had discovered a problem. I couldn't have asked for a better person to work with.", "pics": null, "resp": {"time": 1553267591251, "text": "We are so grateful for your feedback Jsin!  We recognize that at the core a business is about people. With that in mind we are always on the lookout for staff that is passionate about what they do.  As such, we are delighted to read how our staff delivered above and beyond your expectations.  We will do everything in our power to make certain every single visit is equally delightful.  Know that we are thankful for the trust you have placed on us. Know that we are working extra hard to always push ourselves to the next level.  We are looking forward to your next visit."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "114650801169807265502", "name": "K JOHNSON", "time": 1569161153474, "rating": 5.0, "text": "Kimberly Schneider was great. Very professional. Perfect experience", "pics": null, "resp": {"time": 1569426594926, "text": "Thank you so much for taking the time to write such a nice review.  We are so delighted to hear that your experience exceeded your expectations.  It is because of feedback like yours that we are able to select meaningful services of superior quality. We are confident you will continue to be pleased!"}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "113953051139345671744", "name": "Amy Johnson", "time": 1552001304734, "rating": 5.0, "text": "Natoria was wonderful. I had a great experience, she was really on her job. Moving forward on finding me a home wish all move in would go that smooth.Thanks Tori", "pics": null, "resp": {"time": 1552504819708, "text": "Amy, thank you for taking the time to let us know how we are doing.  Our staff is constantly hard at work finding ways to exceed customer's expectations and provide seamless service.  We are so glad our efforts are paying off and you had the opportunity to experience superior service.  Your comments about our team fill us with pride and equip us to provide clear and specific examples of how excellence looks like.  Please continue to visit us and help us implement a strategy focused on constant improvement.  We are honored to have had the opportunity to serve you."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "106450615936139710706", "name": "Gillian Berardi", "time": 1569188569405, "rating": 5.0, "text": "I am moving to the Birmingham area very soon and I was very very nervous about being a single mother where to go and what neighborhoods and what to look for and when I found Kimberly💛 Schneider she eased all of my stress made me feel so comfortable the least thing I’m worried about now is moving out of state she’s already sent me multiple listings multiple options and I’m sure she’ll be with me throughout the time I need her I appreciate you for leading me there have a good day", "pics": null, "resp": {"time": 1569426558886, "text": "Hello Gillian, thank you for taking the time out of your busy schedule to share your experience with us.  We are constantly hard at work doing everything we can to deliver high quality experiences to every one of our customers.  We are so glad we were able to help you out. Helping our customers is what we love best.  Customers just like you make doing what we do a true pleasure. Everyone looks forward to the next opportunity of serving you and yours.  Our brand promise is all about delivering seamless experiences that exceed customer expectations!  We sincerely look forward to serving you time after time."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "111770849231407109157", "name": "Sharon Cook", "time": 1569077659579, "rating": 5.0, "text": "Jessica Stockdale worked hard, took extra time to make our rental process work smoothly!", "pics": null, "resp": {"time": 1569426580914, "text": "Sharon, we really appreciate that you took the time to share details about your experience with us.  Thank you so much for taking a few moments to let us know how we are doing.  Reading your review was of great encouragement to me personally, reminding me why we do what we do.  It is because of feedback like yours that we are able to confirm that we are heading in the right direction.  We will be sharing your review with the team as a way to encourage them to continue to strive for excellence in customer service.  We look forward to the next opportunity to serve you."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "110113279495932325796", "name": "Rebekah Maria Hill", "time": 1594650263702, "rating": 5.0, "text": "Kimberly Schneider was great to work with!", "pics": null, "resp": {"time": 1595352500436, "text": "Rebekah Maria  , thank you for taking the time to let us know how we are doing.  Our staff is constantly hard at work finding ways to exceed customer's expectations and provide seamless service.  We are so glad our efforts are paying off and you had the opportunity to experience superior service.  Your comments about our team fill us with pride and equip us to provide clear and specific examples of how excellence looks like.  Please continue to visit us and help us implement a strategy focused on constant improvement.  We are honored to have had the opportunity to serve you."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "106646165160958448071", "name": "Wally Garcia", "time": 1542723178430, "rating": 5.0, "text": "We worked with Nigel Gayle.  For as busy as he can be, he made sure he was available to answer our questions and provide the support we needed to get into a great home in a new place.  Thanks for all the help.", "pics": null, "resp": {"time": 1543542575387, "text": "We are so grateful for your feedback Wally!  We recognize that at the core a business is about people. With that in mind we are always on the lookout for staff that is passionate about what they do.  As such, we are delighted to read how our staff delivered above and beyond your expectations.  We will do everything in our power to make certain every single visit is equally delightful.  Know that we are thankful for the trust you have placed on us. Know that we are working extra hard to always push ourselves to the next level.  We are looking forward to your next visit."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "107129126174010466159", "name": "Shiva S", "time": 1560272638274, "rating": 5.0, "text": "Jessica Stockdale was excellent to work with at Renters Warehouse. She was always on top of the issues and was very prompt in responding.  She is a great agent.", "pics": null, "resp": {"time": 1560965025382, "text": "Thank you so much for taking the time to write such a nice review.  We are so delighted to hear that your experience exceeded your expectations.  It is because of feedback like yours that we are able to select meaningful services of superior quality. We are confident you will continue to be pleased!"}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "115458782743555398040", "name": "shameka prince", "time": 1548877198871, "rating": 5.0, "text": "Natoria Prince is one of the best agents I know, She is very knowledgeable and response quickly to her emails. I love her professionalism. I would recommend her to anyone .", "pics": null, "resp": {"time": 1549473011984, "text": "We are extremely grateful for your review Shameka!  We believe that business is all about people and the greatest compliments we can receive are those that highlight the commitment of our staff to deliver the best possible service.  We train and coach around a culture of empowerment, kindness and quality, and want everyone on our team to feel equipped to serve you as if you are family.  We will pass along your comments to our team. It is words just like these that keep us going."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "102916712066140490053", "name": "Sharon Janess", "time": 1554063869211, "rating": 5.0, "text": "Melissa Morris was a pleasure to work with. She took a lot of time with me when we needed a home, and made sure that we had all of the information that we needed about what renting a home entails, and what to expect. I am referring her to all of my friends, coworkers and fellow renters. Huntsville is lucky to have Melissa as an agent.", "pics": null, "resp": {"time": 1554479908546, "text": "What a wonderful surprise! Your words of encouragement, Sharon make us feel proud of what we do.  Businesses are mainly about people connecting to people and knowing that our team is on the ball makes us proud.  It is great to know that we were able to provide you with the highest levels of service.  Our objective is that every client that utilizes our services is able to have a similar experience.  We hope you give us the opportunity to connect with you again."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "104198612636833282093", "name": "Yvonne Turner", "time": 1563467163411, "rating": 5.0, "text": "Jessica was very friendly and knowledgeable. She worked very hard and swiftly to get me approved.", "pics": null, "resp": {"time": 1564157778515, "text": "Hello Yvonne, thank you for taking the time to share your experience with us. We look forward to working with you again!"}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "109459459483372967369", "name": "Yvonne Hunt", "time": 1559608301130, "rating": 5.0, "text": "From start to finish, my experience was awesome!!!! Jessica was very professional, and did an amazing job.I highly recommend her.", "pics": null, "resp": {"time": 1560359401125, "text": "Thank you so much for taking the time to write such a nice review Yvonne.  We are so delighted to hear that your experience exceeded your expectations.  It is because of feedback like yours that we are able to select meaningful services of superior quality. We are confident you will continue to be pleased!"}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "105388478434678300879", "name": "Victoria Baker", "time": 1562348431857, "rating": 5.0, "text": "Jessica Stockdale is AMAZING!!!! She is dedicated and passionate! We can’t thank her enough! Excellent communication, truly a Godsend!", "pics": null, "resp": {"time": 1562783783922, "text": "Victoria, words do not suffice to express how grateful we are for your review.  Reviews highlighting the commitment of our people to serve every client with passion reaffirm that we are indeed living up to our core values.  We select, train and coach our team around the idea that clients deserve memorable and positive experiences and it is up to them to deliver.  We are glad to know your experience was positive in every possible way.  We look forward to your next visit!"}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "102801735434634917984", "name": "Daniel Mccombs", "time": 1575730883277, "rating": 1.0, "text": "Turns out that RW will take a double deposit for a 3 year contract, then return NONE of it when the tenants walk out after a year. Home owners and investors beware; Renter's Warehouse is not on your side!", "pics": null, "resp": {"time": 1575913525271, "text": "Hello Daniel, the homeowner determines any and all charges that are assessed during the disposition. In the event that you have unpaid rent at the time of your move out, it will be deducted from your security deposit. All charges have been outlined within your formal disposition notice. If you disagree with the amount(s) charged, please submit your formal written dispute to our office. Once we receive a dispute, we will forward it to the homeowner for their determination. If you have any questions please contact our office at 844-793-4948 and we will be happy to help you."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "105668222759630991964", "name": "Andrea Fambro", "time": 1547565933399, "rating": 5.0, "text": "Jessica Stockdale was my realtor with rental warehouse and she is AMAZING This is definitely a great company! They definitely work with people and Jessica got the job done! I would highly highly recommend Renters Warehouse to anyone! Thank you so much Jessica Stockdale for making it happen for us!!!", "pics": null, "resp": {"time": 1548179332844, "text": "Hi Andrea, we are so grateful for your feedback.  We are beaming with pride knowing that we hit the mark and delivered on everything that we promised.  Your opinion is valuable to us and helps us shape everything that we do.  By sharing it with us not only do you encourage our team; you give us the necessary information to constantly strive to try our best.  Your opinion also empowers other people in the community to connect with us and enjoy all the services we currently provide.  We can't wait for the next opportunity to serve you; and will do everything in our power to once again allow you to experience the best that we have to offer."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "104586171172477571667", "name": "April Williams", "time": 1556898637111, "rating": 5.0, "text": "Jessica Stockdale was a great agent to work with at Renters Warehouse. I recommend this company to anyone looking to rent in the Birmingham area.", "pics": null, "resp": {"time": 1557502886791, "text": "April, words do not suffice to express how grateful we are for your review.  Reviews highlighting the commitment of our people to serve every client with passion reaffirm that we are indeed living up to our core values.  We select, train and coach our team around the idea that clients deserve memorable and positive experiences and it is up to them to deliver.  We are glad to know your experience was positive in every possible way.  We look forward to your next visit!"}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "106982088436569935507", "name": "Natoria Prince", "time": 1543500995182, "rating": 5.0, "text": "Jessica Stockdale is professional, knowledgeable, and passionate in regards to her service that she provides through Renters Warehouse.  If there was a 10 star rating she would get just that.  Thank you Jessica for all your support and help. The broker of Birmingham Renters Warehouse (Al Norman) is amazing as well. But Jessica knows her stuff and is always available to assist you when you have questions or needs.\nThanks J.Stockdale", "pics": null, "resp": {"time": 1544202353278, "text": "Getting reviews like yours ranks among our favorite things Natoria!  We could not ask for a better compliment. Knowing that your selection was exactly what you needed reminds us of the importance of considering our customer's preferences first in everything that we do.  Your thoughtful and descriptive review reaffirms that we are heading in the right direction, and it helps other community members know what we are all about.  We realize our customers are busy and knowing that they took the time to voice their opinion and give us such high accolades validates every effort we make to go the extra mile."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "111355562056498326384", "name": "Jamie Taylor", "time": 1556910381199, "rating": 5.0, "text": "Jessica is extremely knowledgeable and is always willing to go the extra mile for her clients. I was unable to locate a home within her company & she continued to assist me in my search by sending me leads & referrals.", "pics": null, "resp": {"time": 1557502900800, "text": "We are so grateful for your feedback Jamie!  We recognize that at the core a business is about people. With that in mind we are always on the lookout for staff that is passionate about what they do.  As such, we are delighted to read how our staff delivered above and beyond your expectations.  We will do everything in our power to make certain every single visit is equally delightful.  Know that we are thankful for the trust you have placed on us. Know that we are working extra hard to always push ourselves to the next level.  We are looking forward to your next visit."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "109665335795831653912", "name": "Lily9838 Enigma", "time": 1547125697602, "rating": 5.0, "text": "I would highly recommend this company. Especially the realtor that I had the pleasure of working with, Ms. Penny out of the Birmingham office. She was available  to answer my questions, punctual, and very knowlegeable. ~~~Sonia", "pics": null, "resp": {"time": 1547582088905, "text": "WOW! We can't begin to tell you how nice it is to hear words of encouragement, appreciation and praise Sonia.  We want every single customer that gives us the opportunity to serve them, to experience the same level of service. It is customers like you taking the time to tell us what we are doing right, that we are able to constantly strive for excellence.   We may not be as large as other businesses but we are committed to our customers as our #1 priority!  Thank you once again for giving us a pat on the back. Please visit us again. It will be our honor and delight to serve you."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "105969168283082643278", "name": "Don", "time": 1597435898412, "rating": 1.0, "text": "Use someone else if you’re an owner.", "pics": null, "resp": {"time": 1597447119690, "text": "Don, we are sad to hear things did not go as expected. We have a culture of constant improvement and feedback helps us shape the way we do things. Please contact our office at at 844-793-4948 or at clientservices@renterswarehouse.com, we would appreciate the opportunity to make this right."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "116742584434679013923", "name": "Alysa Vines", "time": 1565631008557, "rating": 5.0, "text": "I called about how the rental process work with this company and Codi Feltman answered all my questions. She was very pleasant and energetic over the phone", "pics": null, "resp": {"time": 1566413032912, "text": "Hello Alysa, thank you for taking the time to share your experience with us. We look forward to working with you again!"}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "116934423505312053171", "name": "Regina Peoples", "time": 1546468883974, "rating": 5.0, "text": "She' s a wonderful realtor. She will work with you till the end. She has a 👍 great attitude.", "pics": null, "resp": {"time": 1547151820216, "text": "Hello Regina, thank you for sharing your experience with us. We are happy to hear that one of our rent estate advisors was able to provide you a top notch experience. We look forward to working with you again!"}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "113166234353047492672", "name": "Vonda Richardson", "time": 1582830638554, "rating": 5.0, "text": "My move in date is Friday  thank to Miss Kathy!\nIt has been a pleasure working with you!", "pics": null, "resp": {"time": 1582837852407, "text": "We are so grateful for your feedback Vonda !  We recognize that at the core a business is about people. With that in mind we are always on the lookout for staff that is passionate about what they do.  As such, we are delighted to read how our staff delivered above and beyond your expectations.  We will do everything in our power to make certain every single visit is equally delightful.  Know that we are thankful for the trust you have placed on us. Know that we are working extra hard to always push ourselves to the next level.  We are looking forward to your next visit."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "116216448307262242676", "name": "stephanie stewart", "time": 1559609814239, "rating": 5.0, "text": "Jessica Stockdale, was amazing to work with,very knowledgeable of the area very professional highly recommend her for anyone next move experience.Kudos to Jessica Stockdale", "pics": null, "resp": {"time": 1560359424477, "text": "Hello Stephanie! We wanted to take a moment to thank you for telling us more about your experience with us.  From the start we have made it our goal to hire individuals who are passionate about service and willing to go the extra mile.  It is good to know that our team exceeded your expectations and made your experience memorable.  Your words of appreciation make a world of difference and set the tone for our employee's morale.  We will be sure to share your review with our team on our next staff meeting.  Do allow us the opportunity to serve you again. We will do everything in our power to deliver an even better customer experience."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "106806528442781534085", "name": "LaTonya Gholsby", "time": 1552140319588, "rating": 5.0, "text": "I would recommend this company,\nJessica took the time and effort ,she was very professional.helpful,and so amazing..thank u so much Jessica", "pics": null, "resp": {"time": 1552504913224, "text": "Hello LaTonya, we wanted to take a moment to thank you for telling us more about your experience with us.  From the start we have made it our goal to hire individuals who are passionate about service and willing to go the extra mile.  It is good to know that our team exceeded your expectations and made your experience memorable.  Your words of appreciation make a world of difference and set the tone for our employee's morale.  We will be sure to share your review with our team on our next staff meeting.  Do allow us the opportunity to serve you again. We will do everything in our power to deliver an even better customer experience."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "101391790454351317238", "name": "Rolonda Polk", "time": 1546951738482, "rating": 5.0, "text": "Natoria Prince is a wonderful relator! She is trustworthy and has a very positive vibe.", "pics": null, "resp": {"time": 1547231481205, "text": "Rolonda, thank you for taking the time to let us know how we are doing.  Our staff is constantly hard at work finding ways to exceed customer's expectations and provide seamless service.  We are so glad our efforts are paying off and you had the opportunity to experience superior service.  Your comments about our team fill us with pride and equip us to provide clear and specific examples of how excellence looks like.  Please continue to visit us and help us implement a strategy focused on constant improvement.  We are honored to have had the opportunity to serve you."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "103358809385505773752", "name": "Danieshia Stacy", "time": 1541099224375, "rating": 5.0, "text": "Experience with Renters Warehouse was great, everything was explained from the very first visit and I cant wait to start this journey , Thanks to Al & Mason", "pics": null, "resp": {"time": 1541711726686, "text": "WOW! We can't begin to tell you how nice it is to hear words of encouragement, appreciation and praise Danieshia.  We want every single customer that gives us the opportunity to serve them, to experience the same level of service. It is customers like you taking the time to tell us what we are doing right, that we are able to constantly strive for excellence.   We may not be as large as other businesses but we are committed to our customers as our #1 priority!  Thank you once again for giving us a pat on the back. Please visit us again. It will be our honor and delight to serve you."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "106243056114552806420", "name": "Fuzz Robinson", "time": 1565627800518, "rating": 5.0, "text": "Called for some inquires talked to a lady named Codi and she was VERY helpful and answered all my question and made sure to inform me of everything.", "pics": null, "resp": {"time": 1566412970127, "text": "Thank you so much for taking the time to write such a nice review.  We are so delighted to hear that your experience exceeded your expectations.  It is because of feedback like yours that we are able to select meaningful services of superior quality. We are confident you will continue to be pleased!"}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "103796734310722507944", "name": "Christine Barnes", "time": 1547225232790, "rating": 5.0, "text": "Natoria was awesome with helping me secure my home. Would give her 10 stars if I could.", "pics": null, "resp": {"time": 1547231456979, "text": "What a wonderful surprise! Your words of encouragement, Christine,  make us feel proud of what we do.  Businesses are mainly about people connecting to people and knowing that our team is on the ball makes us proud.  It is great to know that we were able to provide you with the highest levels of service.  Our objective is that every client that utilizes our services is able to have a similar experience.  We hope you give us the opportunity to connect with you again."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "101162131853584536226", "name": "steven kilpatrick", "time": 1549502072330, "rating": 5.0, "text": "Wonderful experience! I highly recommend renters warehouse !", "pics": null, "resp": {"time": 1550098565347, "text": "Hello Steven, thank you for taking time out of your busy schedule to share your experience with us. We are happy to hear that you have received a top notch experience with us. We look forward to serving you again!"}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "117954401358529980726", "name": "Kanesha Springer", "time": 1543855094053, "rating": 5.0, "text": "Natoria is a great agent, she is very knowledgeable and responds fast to request.", "pics": null, "resp": {"time": 1544462959084, "text": "Hello Kanesha thank you for taking the time out of your busy schedule to share your opinion with other community members.  We are constantly hard at work doing everything we can to deliver high quality experiences to every one of our customers.  We are so glad we were able to help you out. Helping our customers is what we love best.  Customers just like you make doing what we do a true pleasure. Everyone looks forward to the next opportunity of serving you and yours.  Our brand promise is all about delivering seamless experiences that exceed customer expectations!  We sincerely look forward to serving you time after time."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "103595193287162604856", "name": "nese robertson", "time": 1539891678987, "rating": 5.0, "text": "Jessica Stockdale is a great realtor and assisted me by far above and beyond!!! Thanks so much!!!", "pics": null, "resp": {"time": 1540571624432, "text": "Thank you for your kind words Nese! We work diligently to provide the best possible service to our clients and we are pleased we were able to do that with you. We look forward to working with you again!"}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "112416348160685623100", "name": "debra jones", "time": 1546486857584, "rating": 5.0, "text": "Jessica stockdale is the real Deal i swear. She will fight for you ! She will take care of you ! please contact her ! Asap !!!!!!!!!!! if you looking for a home", "pics": null, "resp": {"time": 1547152181485, "text": "WOW! We can't begin to tell you how nice it is to hear words of encouragement, appreciation and praise Debra.  We want every single customer that gives us the opportunity to serve them, to experience the same level of service. It is customers like you taking the time to tell us what we are doing right, that we are able to constantly strive for excellence.   We may not be as large as other businesses but we are committed to our customers as our #1 priority!  Thank you once again for giving us a pat on the back. Please visit us again. It will be our honor and delight to serve you."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "106710781569278289530", "name": "ZacZachh Holmes", "time": 1566918356824, "rating": 5.0, "text": "Great customer service.", "pics": null, "resp": {"time": 1567625891256, "text": "Thank you ZacZachh for taking the time to share your experience with us. We look forward to working with you again!"}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "110517193706662877823", "name": "Lil Rey", "time": 1567279390452, "rating": 5.0, "text": "The service was fantastic! Thank you Dana fleener!", "pics": null, "resp": {"time": 1567627099314, "text": "Thank you for sharing your experience with us Reynold! We look forward to working with you again."}, "gmap_id": "0x88891985f1bfc583:0xaa6f2e53245f2f24"}
{"user_id": "116858420880034616565", "name": "Baily Austin", "time": 1614370166573, "rating": 5.0, "text": "Josh was the best real estate agent we could ask for! He was attentive to our needs, thoughtful and willing to help in any way possible.  He and the staff at Bradford were great to work with and we look forward to working with them again in the near future!", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "108813267323182010679", "name": "Michael Ledbetter", "time": 1618976296980, "rating": 1.0, "text": "If I could leave a more negative rating I would. I rented from this company and they attempted to take advantage of me by using MY utilities to renovate their other apartments in the building i was renting in  (apache flats) Josh Smitherman is a low down landlord. I confronted him about this and he was a complete jacka** about it. Needless to say I ended my lease with them immediately. Dont make the same mistake I did and rent with bradford. There are better/cleaner/cheaper apartments owned by other companys to rent from in montevallo. What a joke Bradford realestate is.", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "115288773033757012044", "name": "Tracee Miller", "time": 1614369499594, "rating": 5.0, "text": "Rented from Bradford for 2 years while at UM.  Really enjoyed my time in Montevallo and my time renting a house from them.  Their office is conveniently located in downtown Montevallo close to UMOM- so it was easy to pop in and pay rent.  Super nice people, always made me feel right at home, willing to go the extra mile.", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "107110560596954515086", "name": "Anthony and Heather Bryson", "time": 1614556883683, "rating": 1.0, "text": "During the moratorium set forth by president Biden, this company has decided to through a family out on the street even though they have followed the guidelines set forth by the president and cdc and was promised to pay in full once they got the money at the end of the month. Do not recommend this unprofessional, LAW BREAKING company to anyone.", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "117931269095830965785", "name": "Perish Underwood", "time": 1614369740448, "rating": 5.0, "text": "Great, down home, friendly real estate agency.\n\nListed my house and sold it in a day- couldn't ask for better service or nicer people!", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "102501451183834563321", "name": "charleta king", "time": 1576080869540, "rating": 1.0, "text": "I placed a rental application with this company. I never received a  follow up call regarding their properties available or status of my application. I called a number of times and either they were not available or I was told they would return my call (which did not occur).  I follow up today only to be advised that my application was not approved. I would not recommend.", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "116121634817002728712", "name": "Nope Nope", "time": 1551209788236, "rating": 1.0, "text": "It seems kind of crook like to make people pay to apply for properties they may not even be able to accept because they have pets.  Please consider getting that information available to prospective tenants prior to the application process so you're not taking people's hard earned money and making them gamble.  They have beautiful properties, but I will use a different service and recommend other pet owners use a different service due to this.  $30/application with the risk of not knowing whether or not the property takes our family members?  No thank you.", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "107155138023761106524", "name": "UM LOVE", "time": 1533752089328, "rating": 5.0, "text": "Welcoming environment.  Great rental company to deal with.  They made my transition to my first apartment as easy on me as possible.  They were there to answer questions and offer help as needed.  They even came and hung my curtain rod because I didn't have the equipment.  Total 5 star company!", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "106468283138767796832", "name": "Tabbitha Conner", "time": 1545407647659, "rating": 5.0, "text": "Awesome company! Just rented my first apartment from them.  They made the process easy for me and made me feel right at home in Montevallo.  They were also helpful in helping me get my power and water set up as well as directing me to cool local things to do! Thanks Bradford Real Estate! My roommate and I would highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "103969205849195292719", "name": "Debbie Jo Killingsworth", "time": 1623994074512, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "116217976421943431650", "name": "Wayne B Colburn", "time": 1540231661954, "rating": 5.0, "text": "Josh & the crew at Bradford are awesome.  they helped me find a place to live when I was down and out and took care of me the entire time I lived there.  they go above and beyond for anyone who walks through their front door.  they're also very supportive in the community and I like to support those who give back.  thumbs up for Bradford realty.", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "108482982293514348787", "name": "Sasha Jiminez", "time": 1541444260487, "rating": 5.0, "text": "rented from this co for 6 years while I lived in Montevallo.  great to work with.  never had any major maintenance problems that they didn't take care of right away.  always kind and friendly and glad to help in whatever way possible.  lots of my friends rented from them as well.  would highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "115695639238700781512", "name": "Bowbee Outdoors", "time": 1551257414943, "rating": 1.0, "text": "Josh is disrespectful to customers. Maitnance is nonexistent. If ac goes out expect 3 days minimum before anyone even looks. Flood in your ground level apt? Not there problem for at least a week. Plenty of other options. I rather blowtorch my nipples off than deal with this company again.", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "112004816732761345068", "name": "Bethany Aucoin", "time": 1523565129752, "rating": 5.0, "text": "I have been renting an apartment from Bradford for almost a year now and I have absolutely no complaints. I have noticed other people complaining about their discrimination or problems, but as a lesbian couple in the south, we have had nothing but pleasant conversations with the employees and they have always been happy to help us with whatever we may need. Our house could have been in better shape when we moved in, but the few issues that we have had have been taken care of by the employees promptly. They are all very nice people and I always have the best conversations with the lady at the front desk.", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "116698772960655068322", "name": "Sal Vagal", "time": 1533751842298, "rating": 5.0, "text": "FANTASTIC Rental agency! I wish I could pick them up and take them with me.  They've been nothing but an absolute pleasure to work with.  I've read negative reviews but completely believe what you put in is what you get out.  I never had an issue that wasn't promptly corrected, never called and had anyone be rude to me.  They were always a pleasure.  I feel like in this world people think they can be rude and ugly to people in the service industry and expect them not to be rude back.....", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "100450214839708241739", "name": "Larry David", "time": 1534382525251, "rating": 5.0, "text": "These folks were a pleasure to work with. I’d recommend them highly. Great to work with. Always going above and beyond to make sure we were taken care of and happy", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "107648710678801688088", "name": "Brooke Morgan", "time": 1520262471836, "rating": 1.0, "text": "Do not trust this company. The house we rented from them was destroyed when we moved in—so my parents and I had to fix it up all on our own: repairs in the walls, the floors, the fixtures. It’s ridiculous. Not to mention, many people at Bradford are extremely rude and make my roommates and I feel inferior for even asking a question. Do NOT come to Bradford Real Estate. Find someone else who is worth your time, money, and cares about you genuinely as customers.", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "116281846137641312568", "name": "Penelope Wallace", "time": 1533839518232, "rating": 5.0, "text": "I'd give them 10 Stars! They're all amazing to work with, Jeannie is super friend and Josh has always been on point.  They've been nothing but helpful and accommodating in everyway.  I wish all rental managers were this awesome! Thanks for making Montevallo an awesome place!", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "109028793313587828851", "name": "Tonya Young", "time": 1545236844776, "rating": 5.0, "text": "Awesome folks! I don't know why anyone would ever complain about them!  They're timely and courteous and are always awesome to work with.", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "111404030878336791998", "name": "Apricot Pearson", "time": 1533839785494, "rating": 5.0, "text": "Great folks- would highly recommend working with them.  They represent lots of good properties.", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "104770963880023611581", "name": "Jackson Pearson", "time": 1541445187547, "rating": 5.0, "text": "I could not possibly agree more with the negative comments that I've read on here. I've lived in three of Bradford's properties over the last 10 years and have only positive things to say about them.  They're open Monday-Friday 9-5, just like their website says they are.  I will say that I've called within those hours and had to leave a message before but they've always called me back.  They have an email address for emergency maintenance which they've always been responsive to as far as I am concerned at least.  The people who work there are always polite and helpful.  I've had issues with bugs in the past as well but they sent an exterminator over for an extra spray a couple of times between the regular monthly spray and the issue was taken care of.  The guys who do their maintenance seem very nice.  They've surely never been rude or disrespectful.  I've had a couple of situations where they came to fix something and didn't have all of the parts the needed, so they had to leave and come back- once even hey had to order a part and it didn't come until the next day, but they seem to be qualified and have always made repairs that meet my standards.   I've surely never been made to feel as if they don't care about me or my issues.  I see them at least once per month to pay rents. I always have a delightful conversation with Jenny who works the front desk.  She is always kind to ask about my family and my life.  This business is very community oriented and involved in most every event that goes on in Montevallo.  I always see that they've sponsored little league and parades and festival and food drives.  I just can't imagine anything than that the people who have left negative comments created negative situations for themselves.  I'd even go so far as to say that this company goes above and beyond for their tenants.  Josh even came by to check on my heater one year on thanksgiving night because it had been giving me some issues that week.  anyone that is going to come out after hours and on a holiday just to make sure my family and I aren't cold is ok by me.  I'd give these people 10 stars if it was an option.", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "104124182356076183318", "name": "Christie Albergine", "time": 1540326058770, "rating": 5.0, "text": "I️ had a great e patience with these people. I️ have to imagine for those that didn’t that it was their own fault.", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "109690689837523278067", "name": "Reckless Love", "time": 1506007002380, "rating": 1.0, "text": "Applied for a rental house with a co-signer that was within my price range, paid the application fee, only for them to waste 3 day of my time after being told my the agent that there should be no problem getting approved. I constantly felt an air of discrimination from the front desk secretary. multiple times I was refused to speak with my agent. I was quoted a timeframe of 12 hours, it has been 3 days and they refuse to work with me. This company has lied to me, wasted my time, and now put me at a severe disadvantage with less than 24 hours to find a place to go. Gina is overall unpleasant to work with and Josh refuses to speak with clients. The power of approval is in a single mans hands (josh). there is no regulated system, but seemingly approving or denying basred of opinions of the person. the entire time I felt I was being pushed away and like they were trying to keep me out. UNDER NO CIRCUMSTANCES SHOULD YOU GIVE THIS COMPANY YOUR BUSINESS.", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "117287918538195070143", "name": "Ouida Brackett", "time": 1519270500814, "rating": 1.0, "text": "I called to deal with an issue of the company putting a check through on my account that was post dated. When I initially asked the front desk clerk if it would be okay to pay my 1st months rent,  and since I was there, give her a check for the upcoming months rent. I don't live in Montevallo and the property I was renting was in Alabaster. So since you can't pay rent online, I gave the post dated check so that I wouldn't have to drive back to Montevallo. I was assured TWICE by the clerk that this was okay. Fast forward after I paid my initial deposit as well as first month's rent. They decided to also deposit my post dated check for the upcoming month. Leaving me with an NSF due to the fact that the postdated amount wasn't accounted for in my monthly budget. ESPECIALLY after you already received $2,000 from me within a weeks time. I called and spoke with JOSH who verbally assaulted me and basically called me a criminal for writing bad checks. After he informed me that it's not their policy to take a post dated check and he doesn't know where I got that info from. I LITERALLY GOT IT FROM THE FRONT DESK  CLERK!!!! HE took no ownership, did not apologize, complained about a $50 fee he would have to pay b/c of my returned check and then hung up in my face. The crazy thing about this whole situation is that the check cleared on my end. My bank LITERALLY cleared the check and just charged me an NSF fee. All I wanted was my $30 back. He didn't even have the human decency to listen to what I was telling him before becoming beligerent!! This company is the absolute worst that I have ever dealt with in my life. And my husband is military so we have moved and dealt with numerous companies. RUN...DON'T WALK AWAY FROM THIS PLACE!!!!", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "110432035972429178946", "name": "Jansen Arceneaux", "time": 1500589758139, "rating": 1.0, "text": "If you enjoy rental companies without an after hours line, customer service agents that will lie to you about appointments and then call you the liar when confronted than this is the place for you! Worst rental experience I've had in a long time. This is a small town, small family, small minded company. They truely don't care about you. From a customer service standpoint I was so dissapointed. Do yourself a favor and look elsewhere. Also they do not do electronic payments!!! This is the 21st century Bradford!! Try and keep up 😉", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "107534835646077192320", "name": "Jennifer Patterson", "time": 1534429825223, "rating": 5.0, "text": "great company.  I'd do business with them again.", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "117299910619104093022", "name": "Thadia Newton", "time": 1471977107889, "rating": 1.0, "text": "If i could give them zero stars i would. They do not maintain their properties and take advantage of college students. Whenever I would send a maintenance request they would not come and even told me they had no record of me calling. This is a terribly run agency. DO NOT RENT FROM THEM.", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "110033887115185102705", "name": "Jeanne Roberts", "time": 1500515662403, "rating": 1.0, "text": "They could care less about their tenants. When maintenance issues occur, they ignore you! They have no sense of urgency in resolving emergency maintenance issues! Do not use this company!!!", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "105663680397806025265", "name": "Keirsten Lee", "time": 1545198903385, "rating": 1.0, "text": "paid my money for a home application and was never called back with an approval or denial... Seemed to be because of my skin color.", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "103456529164195570999", "name": "Cynthia Winegard", "time": 1545268825426, "rating": 5.0, "text": "Awesome group of people to work with!", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "105686890980815133046", "name": "Keandra Pope", "time": 1532466609728, "rating": 1.0, "text": "If you have any other options, do not rent from these people. We moved into an apartment (Crown Royal) with a full-blown German cockroach infestation. They were all smiles as we handed them money, but as soon as we started mentioning problems, they became rude and unfriendly - we were allowed to break our lease rather than them actually fixing our problems. Go to a complex that cares about its tenants.", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "108901374143140223089", "name": "Angela Smith", "time": 1556066714335, "rating": 1.0, "text": "Not a good company at all..", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "101296306824625969942", "name": "Joanna Reiter", "time": 1379130807730, "rating": 5.0, "text": "Has been using them for 4 years, no problems, maintain my house for reasonable price, rent is always on time! Couldn't be more satisfied!", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "114231870443034069719", "name": "Michael Kenny", "time": 1542197654022, "rating": 1.0, "text": "Terrible company.", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "109193697349889781055", "name": "Sallie Walker", "time": 1540314995920, "rating": 5.0, "text": "5 star company!", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "109945391054080692602", "name": "Vincent King", "time": 1516303122550, "rating": 2.0, "text": "Can be kind of rude and hard to get in touch with.", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "113598646702168090219", "name": "Cathi Tinney", "time": 1478838398321, "rating": 5.0, "text": "Great people and service", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "110162519953833725517", "name": "Stephanie Burch", "time": 1378454684098, "rating": 5.0, "text": "Really loved dealing with this group", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "103544490035643767247", "name": "Q Will", "time": 1624488714601, "rating": 1.0, "text": "I scheduled an apartment viewing with this company and it was the most filthiest thing I ever seen in my life. The apartment smelled like soggy mold and newports, but the worst part was the bugs I kid you not there were 100's of dead roaches and insects throughout the bathroom and kitchen it looked like a episode of hoarders. The fact that they even had the audacity to even show the apartment in that state is apalling even a run of the mill slumlord would be offended at the condition. Do yourself a favor and look elsewhere.", "pics": null, "resp": null, "gmap_id": "0x88892bb498c626b1:0x6191003fd3ca9e4d"}
{"user_id": "107647112914985108830", "name": "rd G", "time": 1621607451478, "rating": 1.0, "text": "I don't know what's going on with treehaven gleen it's turned into a trashcan people throw trash in the parking lot and it's turned into a parking lot for broken-down cars one person on the backside set up a tent and in the grass and park cars in it treehaven is turning into a eyesore and darin needs to do something about it", "pics": null, "resp": null, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "100581196809242417752", "name": "Justin Kirk", "time": 1558493573638, "rating": 1.0, "text": "I’m not sure what you’re referring to that says in any way that we indicated the property wasn’t nasty from the start. The checklist we completed upon move in said the kitchen was filthy and hadn’t been cleaned, the walls needed paint, noted the broken electrical outlets and the nails/holes left from the previous tenant. We had to SCRUB this place. Not to mention all the spiders we dealt with for a month because you hadn’t been taking care of pest control. We would have noted the uncontrollable bamboo, but it was February and it wasn’t growing in the cold months. How can you even begin to think we caused a bamboo problem? The owner himself said he had tried to get rid of it “for years”. Exact words. Once again he himself saw the yard mowed before we moved out. When I went to check the yard on 5/13, it had not been TOUCHED since we left. All you do is blame your negligence on other people. From the yard to the unmanaged interior.\n\nThe water infiltration issue in the BEDROOM FLOOR was not due to “massive flooding”. EVERY TIME IT RAINED, water came through the flooring. And EVERY TIME it happened, you were notified and offered zero assistance in fixing the issue. This is not something that happened just once. I will be sure to find the business card from the man who came out from community development and assured me that if I called him the next time there was visible water coming through that he could see with his own eyes that they would condemn the house until the issue was fixed. I also have two other witnesses who were at the house for that conversation. We told them not to worry about it because we were getting out of the house to which he said “I don’t blame you, I’d hire an attorney”. He also said that a mold expert would need to come out to test the MOLD AND MUSHROOMS. Even your maintenance man left the house to get himself a mask so that he wouldn’t be breathing in the mold when you sent him to the house after LYING saying that YOU would send a mold expert out. This is all documented. Every single bit of it. You “allowed” us to move out because you knew you were caught. Anyone with common sense will be able to see that. You said yourself “the mold will dry out. It’s about to be warm outside”.\n\nYou can try to justify it all you want, but mushrooms growing in a bedroom is not normal. I was sick for a solid week after stirring it up while moving.\n\nNot fixing a water infiltration issue that you’ve known about for who knows how long? Negligent, irresponsible.\n\nBottom line- I’m not here to argue with you as it clearly gets us nowhere. That’s what attorneys are for. I can back up everything I’ve stated, unlike you. I’m here to warn other people of the sorry excuse of a landlord you are.\n\nAgain people, trust the negative reviews. I have no doubt in my mind that every single one directed toward Darin Bashaw is true. I’m willing to bet all my stolen money on it.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP60cplc3W3v3akVXdG8NaYY9-QhtZ37kYxqQrm=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP0FsjNiafn-4plcRjgR6_OFgR--aGGjy6E1k2x=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMd0UgQ9YfwIkHWNVoEWEFpDuY5Oo07BzwX6ln-=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMWc1h4nxNAWhHgjt6yAh1ro1jWLEEkjJ9rMS8y=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMZApkUUE915Cqc1loVhU-5dtPzt9cJJANI0BTc=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPKuB85LwHa1tuKf_yT-7QgL82FFAXcOE4pP_Aa=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM8OdAQP1lgp6G4-BnK3qx2HOAod1RlQ9EJyWxX=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMNZrlnpIqQQe-Br7Czi8KI0vbkNDMc5aPKvrFk=w150-h150-k-no-p"]}], "resp": {"time": 1558525758914, "text": "Mr Kirk once  again I am sorry that you were unhappy with home. We repaired the few minor items called out by the city in a few hours. This home has been under our management for years with no one else having the same issues you reported. You threatened legal action and we advised you of our attorney’s information. I truly wish you and your family all the best of luck.\nSharon"}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "108540470656292322937", "name": "Briana Wilson", "time": 1615630850068, "rating": 1.0, "text": "this business is a joke. I think its funny how all the reviews are the same with even more added nasty. lol its always the tenants. these units are trash the company is trash and so are the people. save your best of luck speech or whatever it is that's copied and pasted as a response. <3", "pics": null, "resp": null, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "118354110332852243931", "name": "William L.", "time": 1612968644992, "rating": 1.0, "text": "I'd looked at a property, got approved for the rental then right out of nowhere as I was going to pay the deposit the agent Darin rented it to someone else. I got no explanation of any type to why I was ultimately screwed over. DO NOT use this unprofessional company", "pics": null, "resp": {"time": 1613403446480, "text": "It wasn't really out of nowhere. We require a hold fee paid within 24 hours to secure the property. In this case the hold fee wasn't attempted for over 3 days. Until the hold fee is paid, a home is still very active and very available to anyone who can get the hold fee in first. It's not fair to other people for us to have to guess that someone is still interested when other customers are willing to place the hold fee."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "104416405384093567182", "name": "Rejeana Morgan", "time": 1615055287393, "rating": 3.0, "text": "Lived in a rental house for 4 years. Paint was rubbing/ peeling off a bedroom wall. We finally moved! After we moved they rented the property in SE Huntsville with in less than a month and our old neighbors has informed us that Huntsville property management never bothered to repaint the interior of house before moving others into property during Covid! Nasty management company.", "pics": null, "resp": {"time": 1615576038563, "text": "As the property manager we make sure every unit we manage is fully cleaned and disinfected after tenant change, per COVID guidelines.\nJust as an FYI since you may not have talked to the new tenants; they needed to move into the unit immediately and agreed to take it without getting fixed up or painted."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "118199020568014284054", "name": "Brittni McFarland", "time": 1614262502942, "rating": 1.0, "text": "HPM and Darin have labelled the safety issues in our home we discovered upon moving in as \"cosmetic\". The hanging exposed wires and other safety issues we clearly documented upon move in proves otherwise.\n\nETA 2/24/21: I have seen the reply that was made by the business. This home has been in possession by HPM for some time now. Darrin said to us that it was a \"funky old house\" and then when we told him the safety concerns he told us that he has successfully rented the property out for almost a decade and that my husband and I were \"too picky.\"", "pics": null, "resp": {"time": 1614275227378, "text": "Thank you for the information. The response was incorrectly posted. We are checking on this now."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "108930990740433718864", "name": "krr gee calypso", "time": 1613848433763, "rating": 1.0, "text": "These new people that took over treehaven gleen is bogus thay won't allow people to come and visit not to mention thay won't fix anything there's alot of other people out here that have more than two people in their apartment instead of worrying about how many people are in your apartment thay need to make treehaven gleen a secure place to live and fix things so don't rent from these people because you will regret it's not a safe place to live anymore", "pics": null, "resp": {"time": 1614016967066, "text": "We took over managing this property shortly before this review was posted. and have been working through the pre-existing issues at the property. Our management team hasn't addressed with anyone about number of people in their apartment."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "112295577507605508302", "name": "Larisha", "time": 1589995681425, "rating": 5.0, "text": "Very professional Company. Communicate promptly when you reach out to them; with experiences I've had with most rental agencies that's definitely a good sign.  Thanks Darin for your consideration.", "pics": null, "resp": {"time": 1589999769979, "text": "Hi Larisha, appreciate your kind words. Hope we can find you a nice house. Look forward to having  a great relationship. Darin"}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "110716203501138884552", "name": "Nina Maria", "time": 1566488234481, "rating": 1.0, "text": "I’m currently renting a house from this so called business, they barely call you back, it’s been two months in I have a room in the house that stay at 86 degrees. This house is infested with water bugs I don’t sleep knowing I have to watch over my children I need to find a way out of this lease. I’ll never rent from them again. Not to mention I went two weeks without a refrigerator before they got me a new one smfh. Really can somebody point me in the direction to just legally break my lease.", "pics": null, "resp": {"time": 1566489269506, "text": "I am sorry you are having issues. I looked through our records and we don't have a Nina Maria leasing with us so it is difficult to address your concerns with no address or name in our system. I am also not familiar with \"water bugs\". We have a full time receptionist at our front desk. We also have an on line system to log work orders. If I had more accurate information I could structure a more helpful response. Best of luck to you."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "103301257523484621434", "name": "Carla Davis", "time": 1531105400574, "rating": 5.0, "text": "Professional company with a nice staff. Just began renting a house and so far I am impressed. I will update as we go along. Looking forward to doing business with these great people. Very pretty rental home with all the amenities we were in search of!", "pics": null, "resp": {"time": 1533173438941, "text": "Thank you Ms. Davis, we appreciate your kind words!"}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "114920306616418113897", "name": "Trudy Harris", "time": 1533836382157, "rating": 5.0, "text": "I have rented from this company in the past, I received the best customer service from the staff in the office as well as the maintenance crew, they have always came out in a timely manner to repair any issues. The Property Manager was always available to speak with me or get back with me at his earliest convenience. If I did not have to move out of town, I will still be there. You Guys Rock!!", "pics": null, "resp": null, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "112075732644779066417", "name": "Thomas Geeslin", "time": 1570585059199, "rating": 2.0, "text": "Had a issue with my house when we first moved in and they addressed it immediately and when we had another problem it took over a week and several calls and a email. They called me back, the property manager was personable and seemed very willing to take care of the problem. I haven’t had a chance to recheck the problem yet but was told that they would handle the problem we are having as soon as possible.", "pics": null, "resp": {"time": 1552505382892, "text": "Mr. Geeslin, I am at a loss as to where this bad impression is coming from. You only a few weeks ago moved into one of our beautiful Madison rentals. There has been only one service request in the tenant portal for no heat, which was addressed promptly and had to do with the gas being still shut off at meter. No other complaints or maintenance issues were submitted that I am aware of. I did get the message from the office late on Monday and called the very next day to find out about your needing a working key for one of the 6 locks. It was a normal, pleasant conversation. So, I don't know why you are left thinking I am anything other than a normal and pleasant person . Sorry for the bad impression and that it took me a couple of days to get back to you over that weekend, but I rarely work in the office and provide my cell phone number to all owners and tenants, so I can be reached in urgent situations. I explained that we have keys, I personally tried the keys and they worked in all the locks. But, copies were made of our masters and maybe one was cut wrong? No big deal, just text me the lock that you don't have a working key for as I requested and I will get you new copies. I have yet to receive this text, so can only assume the keys worked after all. HPM and myself strive to always provide the best and promptest service.\n-Darin"}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "105676210195015168415", "name": "Lawaina Simpson", "time": 1551661745545, "rating": 5.0, "text": "Moved here from Florida to a great apartment. Have been in my apartment now for 3 years and I love it. The staff are all very nice and my apartment is beautiful!", "pics": null, "resp": {"time": 1551716443014, "text": "Thanks Ms. Simpson, we appreciate your honest review!"}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "102864605841614880492", "name": "Allison Hubbard", "time": 1526929333053, "rating": 1.0, "text": "Its hard to post a negative review without sounding like a disgruntled tenant; however, I just don't think this company know how to manage properties effectively. I had several maintenance issues that were extremely difficult to get repaired simply based on communication failures from Huntsville Property Managers. The worst of these issues was probably the 11 degree weather with no hot water and no one to contact about it. I called and left several messages and we went without hot water for about 3 days.\nI work in property management and I would never recommend this company to anyone. Thankfully the owners of our rental property switched management companies.", "pics": null, "resp": {"time": 1526933417302, "text": "Ms Hubbard, First of all thank you for letting us know about your concerns. Please know that we take the care of our tenants and the property we manage very seriously. You are correct. We were dealing with major burst pipes all over Huntsville during this time. We called several outside plumbers who were also slammed with frozen pipes. We got out there as soon as possible. We prioritized families with children and the elderly. After that we took care of service calls on a first come basis. One item in your complaint is inaccurate. We were let go due to the excessive amount spent (in the opinion of the owner) making repairs to your home.  I wish you all the best in your new home."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "109481431064136898700", "name": "Ke Ke", "time": 1545484084945, "rating": 4.0, "text": "I enjoyed my stay with this company. No major issues. I always paid my rent on time. I was never late paying my rent and i expected for them to never be late on providing maintenance service. I put in a request to have a continously stopped up sink and running toilet fixed. Months went by and no one ever came to fix it. When i put in my notice to vacate, then they finally came out to fix it when i was loading my things into a truck. I would definitely rent from them again...", "pics": null, "resp": {"time": 1533173800500, "text": "Thanks for the review. Unfortunately, we cannot find this name in our tenant rosters, so are unable to specifically address the issues you are reporting. I do not know how you submitted service requests or if the request made it to the proper people,. But, if the requests are made through appropriate channels, we are generally able to get clogged pipes cleared and running toilets rebuilt within a day or two."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "111911112626818008345", "name": "John Rowe", "time": 1528482545513, "rating": 1.0, "text": "I used these people to manage by  property, never received any of the rent money and they 1099 for the rent money  they kept for themselves. Also the Tenant that occupied the house never paid any of the electric bill which was left in my name. I believe they did this because I'm from the north. A word of warning to all people from the northern states if you own property in Alabama", "pics": null, "resp": {"time": 1533173339351, "text": "Mr. Rowe,\nNone of this is true. This house is in Albertville, an hour and a half away from our office, way too far to be a desirable listing. You begged us to manage this house with your tenants already installed, because you felt all the local people were criminal and corrupt. Against our better judgement we decided to help you out. You didn't want us to send you any rent money while tenant was there, hoping they would buy house and use those funds to help with their closing costs. Your tenants were dead beats, stopped paying rent and were promptly removed. They left the house in terrible shape, with rotting food in fridge, human waste in toilet, old rusting and broken down appliances, a severe cockroach infestation and a property resembling a land-fill with all the construction debris and trash strewn about evenly over an acre of land. The utility bill was attached to their final account with the back rent and other expenses. Their account was referred to collections when they refused to pay what was owed. When they were gone, you wanted us to list this property for sale. We reluctantly agreed to help you here as well. With your permission, we used the meager available funds as best we could to clean property and house for selling. This involved 2 guys over 3 days and 8 round trips with a 30 foot trailer filled with garbage hauled from the property. The house had to be seriously detrashed, scrubbed down and treated for cockroaches. We did the absolute best we would with what funds were available, spending more in fact than what was available in order to clean up completely. But, we were still about $10,000 short of what was needed to get the home ready for habitability, much less marketability and you refused to spend anything more. We 1099 for all the income received and also sent an end of the year statement which itemized all the expenses, leaving you with net income of $0 for tax purposes."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "109305115530776878152", "name": "Alyssa Feldhaus", "time": 1519743213982, "rating": 1.0, "text": "The worst service. Did not notify me of a $600 water leak in our home. Has made more than one major accounting error. Takes FOREVER to get a response. If I could give 0 stars I would. Sharon butler is only interested in serving those who have expensive homes. We own 3 properties and used this company for one of them simply because I don't have the time to deal with section 8 renting... she apparently doesn't have the time either. Go to management apex instead.", "pics": null, "resp": {"time": 1519748742874, "text": "I am very sorry you feel this way. The leak you are referring to was a frozen pipe within a wall which could have done major damage. I felt it was an emergency and as such took immediate action to mitigate damage. We actually manage several lower income properties. We absolutely value all our homes and clients no matter the price point. We wish Ms Feldhaus all the best of luck."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "105049716984992550227", "name": "Emily Cathcart", "time": 1549483949032, "rating": 5.0, "text": "Huntsville Property Mangers is great. My Grandparents have a few properties that HPM manages for them. They are wonderful with my grandparents they explain everything to them that’s happing with there properties and handles everything.", "pics": null, "resp": {"time": 1549485870200, "text": "Emily thank you for your kind words. We love being a trusted manager for their portfolio"}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "105224645237490344709", "name": "Tynika Dent", "time": 1548876966525, "rating": 5.0, "text": "I think the staff is wonderful. Rented from them then the property was sold. The new management was and is horrible. I am looking to rent from these wonderful again...asap. The new management forced me out in the middle of my lease and said nasty things about Huntsville property managers which I totally disagree with. Rock on guys. My name is Tynika btw", "pics": null, "resp": {"time": 1548878073438, "text": "Tynika, thanks so very much for the kind review. Please reach out to us when you are in need of a new place to live."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "103486693621123713767", "name": "Duane Harris", "time": 1551661284974, "rating": 5.0, "text": "Highly recommend this company, I’ve had nothing but positive experiences starting from the day I moved in.", "pics": null, "resp": {"time": 1551716468318, "text": "Thanks Mr. Harris, we appreciate your support."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "106698921660253302274", "name": "Charlsie Kirk", "time": 1558456491766, "rating": 1.0, "text": "RENTER BEWARE - 14020 SANDHURST DR SW\nToday I received an email that the property I recently moved out of is back up for rent and $225 more per month than what I was paying. I’m here for this review to warn the next renter of the nightmare that is Darin Bashaw, and how poorly this property has been maintained. First and foremost, false advertisement. This is not a 3 bedroom home. It’s a 2 bedroom (one of which is COVERED in mold) and has a sunroom that directs you to the back yard (that is an uncontrollable BAMBOO FOREST). It is NOT a clean home, but rather the complete opposite. This house is NASTY. When we moved out after only 2.5 months, there were MUSHROOMS growing in the bedroom and bathroom. Absolutely NOTHING was done about a water infiltration issue that we reported to Darin 3 weeks after move-in, which resulted in us having to send an official letter to move out without penalty. As if that weren’t enough, we weren’t informed of the uncontrollable bamboo growing in the yard. When we moved out, the yard was mowed, yet Darin stole $120 of my deposit that he was supposed to return “due to neglect of the yard” THAT HE HADNT EVEN MOWED WHEN HE STOLE MY MONEY. He let that yard grow for TWO SOLID WEEKS after we moved out. The OWNER OF THE HOUSE saw it mowed with his own eyes when he came to check on his house after the CITY came and wrote them up for all kinds of things that needed to be fixed but weren’t. This includes electrical outlets, DRY ROTTED WOOD, poorly sealed doors, the shed out back, and who knows what else. They have not had time to tackle the mold issue since we moved out. I know this because I was there last week 5/13 to get my mail and check out the yard. They hadn’t even cleaned. I know this because the overflowed trash was still sitting in the carport and hadn’t even been taken to the road for pick up. This was such a terrible experience that we now have a lawyer so that we no longer have to deal with this man. I have pictures and videos of this entire experience, which include Darin cussing my husband and being completely irate when we returned the keys. All I can say is TRUST THE NEGATIVE REVIEWS. This man ROBBED me of my deposit and three months worth of rent and let my family move into a MOLD INFESTED HOME. He is a crook and a PITIFUL excuse for a professional. I’m embarrassed for the company he works for. What a terrible representation of a business.", "pics": null, "resp": {"time": 1558466063979, "text": "Ms Kirk, I am sorry you were not happy with your home.\nYou were allowed out of your lease early. The \"mold\" was categorized by Community Development, who came out as your request, as mildew. Additionally, this was after the massive flooding experienced by all of Huntsville. The list from the city was minimal and so unimportant that they gave us until the end of summer to make repairs. The bamboo was in existence for years and controlled via mowing. You were responsible for the yard. Because you didn't maintain the bamboo is now out of control.  We have rerented the home and have now needed to deal with the bamboo.\nYour move in report rated most of the house as acceptable upon move in. Again I am sorry for your experience and wish you all the best."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "103849576635811201840", "name": "Bob Armstrong", "time": 1551719039312, "rating": 5.0, "text": "They have managed my building for 3 years now and I have 4 words to describe them, responsive, trustworthy, professional and dependable", "pics": null, "resp": {"time": 1551724928777, "text": "Thank you Mr. Armstrong, we value your business and look forward to many more years together!"}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "102564323113491251019", "name": "Eli Allen", "time": 1552493412659, "rating": 5.0, "text": "Huntsville Property Managers helped me rent my house a few years ago when it wouldn't sale. They just arranged for the tenant to purchase, though their Intero affiliate. Couldn't be happier about the 'full service' and great attitude.", "pics": null, "resp": {"time": 1552504517458, "text": "Thanks Mr. Allen, it was a pleasure doing business with you!"}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "103939242137992317217", "name": "Kelly F", "time": 1544560690265, "rating": 1.0, "text": "Don't waste your time or money.  We're now stuck in a lease and haven't even moved in yet.  Went to view the house on Monday, Dec 3.  On Dec 4 I emailed that we were prepared to pay the deposit for the house and was told \"I can probably get it finished up for you to sign the lease on Friday.\"  Come Friday we heard nothing about whether the house was ready so text the property manager for an update who replies \"The lease was ready in the office today. You weren't able to make it?\"  Well, no, no one said it was ready.  We meet at their office Saturday to sign the lease, get keys, and of course hand over money...then we go to the house.  Not cleaned.  Text the mgr to let him know it's not clean and he replies \"The carpet and linoleum are brand new, so you should be able to move your furniture into the house. I will see if I can get someone back, though it has been cleaned and may not get any cleaner looking.\"  No, this isn't cosmetic, this is filthy and lazy. That evening I email several pics of the house and receive no reply.  Three days later still no reply so I call him.  I say hello and who I am, to which he replies \"yeah?\".  I say I'm calling for an update on the house being cleaned.  He says it is clean, just not to MY standards.  He says the carpet and linoleum are new, to which I reply that doesn't mean the house is clean.  I asked him about the pic I sent of the AC return vent.  His reply was that there's a filter.  Oh, so the filth caked up on the outside is ok because there's a filter.  I ask about the storm shelter.  He says they cleared it out.  Well, my pics show otherwise.  I ask about the closet with trash on the shelf and animal hair all over the floor, how a broom has never touched the floors and that I don't want to put my groceries on the filthy pantry shelves.  He replies that he has been doing this a long time, that any other person would've moved in already, how much they have already spent getting the property ready, and that I obviously require extra care so he'll send someone back out tomorrow.  After being insulted I suggested that maybe this isn't the right thing for us and what can we do.  He said we've already signed the lease so nothing.  I asked if this is what we should expect over the course of our lease and he replied that it's up to us, not him, said have a nice day and hung up on me.\n\n**And in response to the records indicating the move in is next weekend and you \"agreed\" to early move in...that is simply incorrect.  Your records may show that as an estimated date but then why would I be told on Dec 4 that the house could probably be finished up by Friday (Dec 7)?  Doesn't make sense. If the house simply wasn't going to be ready then I would've preferred that answer over being stressed that it really wasn't yet.  But I am very appreciative of the effort to have someone out so quickly to clean.  Hopefully the relationship improves moving forward.", "pics": null, "resp": {"time": 1544557173535, "text": "Kelly I am sorry you are unhappy. Our records show you were due to move in next weekend. You asked for a weeks early move in middle of the week. The home was not ready, but we agreed to your early move in. The cleaning person is over there as we speak re cleaning. This was the first opening she had.\nThe home has new carpet and linoleum.  The storm shelter is an exterior structure. We do not clean those. I am confident you will be comfortable in your new home."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "115037586996454499876", "name": "Darin Bashaw", "time": 1570552173591, "rating": 5.0, "text": "Great company, nice working environment, nice and helpful staff!", "pics": null, "resp": null, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "111310348648223622743", "name": "Vicki Whisenand", "time": 1543699327829, "rating": 1.0, "text": "This company is rude and do not take care of their properties. When accused of not paying rent even with cancelled check on the 2nd of the month they don’t apologize. They allowed a water leak to go on for months. And when phone calls are made to them they are rude and flat out say “that’s your problem”.\n( I am reporting this for a relative that is afraid of retaliation. She has been treated very badly by the staff. Has paid her rent on time every month and has been very patient with their rude and nasty responses)", "pics": null, "resp": {"time": 1543604140884, "text": "I am sorry to hear you are not happy with our company. I have researched and cannot find your name as a tenant of ours either past or present, so it is difficult to answer with any relevant information."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "111095725822008431645", "name": "Jessica Hanes", "time": 1551660764290, "rating": 5.0, "text": "Great company, were very attentive of my needs. Definately recommend", "pics": null, "resp": {"time": 1551716499913, "text": "Thanks Ms. Hanes, we aim to please!"}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "104422822995985914588", "name": "Adam Garrett", "time": 1545283300748, "rating": 5.0, "text": "Honest and sincere peaple very satisfying  to do business with.", "pics": null, "resp": {"time": 1548889348175, "text": "Thank you Mr. Garrett, we appreciate you kind words."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "109624686710994612270", "name": "FurMair", "time": 1549502416548, "rating": 5.0, "text": "Great company, the staff are very nice and responsive to my needs!", "pics": null, "resp": {"time": 1549503341666, "text": "Thanks for your kind and supportive words. I don't recognize the name, but I am sure you are a great tenant, too!"}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "111917549816288431449", "name": "fred g", "time": 1552494886558, "rating": 5.0, "text": "Great company,  great manager, great staff", "pics": null, "resp": null, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "112722149717862097464", "name": "margaret lessa", "time": 1549563720068, "rating": 5.0, "text": "Great Company, Love my apartment", "pics": null, "resp": {"time": 1549566861185, "text": "Thanks Ms. Lessa, we appreciate your positive  review of our company."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "107831855702145853215", "name": "Decaurrey Clark", "time": 1532454381654, "rating": 1.0, "text": "Horrible company. Takes weeks to get maintenance requests filled. They half step on everything..", "pics": null, "resp": {"time": 1533171843515, "text": "This tenant issues are exaggerated and/or not true. She moved into an apartment we had been managing for exactly one day. The first time I looked at unit was when I showed to her, it wasn't ready by our standards to move into, but she had a moving truck full and wanted it immediately. We honored her request and conducted the screening and had new lease prepared the same day, letting her move in to the apartment in existing condition. She complained immediately about a leaking sink drain in kitchen. The property manager himself fixed that sink within an hour. She had a couple of other minor complaints and was instructed to properly submit service requests through the tenant portal, so maintenance can can get on them most efficiently. To date, she has never submitted a service request appropriately. She was quiet until July 18, when she just came back from a trip and said the fridge went out and all her food was spoiled. I was going to send someone to take a look, but she also said it was working again. Next, she started texting the property manager after hours on Friday July 20th, and then angry texting on Saturday the 21st at around bedtime. She was informed that nothing can be done over the weekend and maintenance would check first thing on Monday. Maintenance did go out on Monday and determined the fridge needed to be replace, she also mentioned the water heater didn't work. Water heater was discovered to have a leak at electrical control panel, causing it to short which is something we considered an emergency, and water heater was replaced the same day that Monday. We have contractual obligation to address any non-emergency issues over $300 with owner prior to spending their money. Sometimes it may take a few days to get in touch with the owner for directions, which will delay our repair response time. This owner approved for a new fridge on Tuesday and one was ordered immediately. We also have a fiduciary responsibility to  owners and have found the most expedient and affordable way to get new appliances is to order online, where we can shop the best deals and take advantage of free delivery and hauling of old appliances. When we do order, we always order something in stock for next or 2 day delivery. In this case, for whatever reason, Lowe's needed a couple of extra days but still, a new refrigerator was delivered by the end of the week. We also have a legal responsibility to tenants to address any health and safety issues within a 2 week time frame. Even if we cannot get in touch with owners or get adequate instructions, we will go out of our way to meet our legal obligations, while also meeting our fiduciary obligations. We strongly recommend our tenants carry renters insurance so they can file a claim for any damages or spoiled food."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "109186854653881715655", "name": "Fred Quiroz", "time": 1550845029081, "rating": 5.0, "text": "Love this company!!!", "pics": null, "resp": null, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
{"user_id": "103433082787575398042", "name": "Monday Hale", "time": 1546438066245, "rating": 1.0, "text": "I wish I seen the reviews", "pics": null, "resp": {"time": 1546440996531, "text": "Ms Hale, I am sorry you are unhappy. Your review, however, gives me no information to go on. I looked through our work orders and didn't see any outstanding. Please let me know what needs are and I will attempt to resolve. Our tenants satisfaction is of course important. Please give me more information. Our office is open and you are welcome to call in and talk with our receptionist."}, "gmap_id": "0x88626b541142b879:0xeeab7a8b31596fa"}
