{"user_id": "109564226312361038667", "name": "Reuven Knight (Laz0r50)", "time": 1461030594448, "rating": 3.0, "text": "John Rook is an excellent counselor and helped me very much in the time that I saw him, even though he could not save my marriage at the time (it was beyond saving but he did his best) and always treated us with dignity and respect. That is why it is so sad that I have to say that I wouldn't trust him with record keeping as he lost the entire file on my marriage counseling and did not even have a digital copy. Worse, he told my legal representation who needed the file that he never, ever took notes which I knew was untrue and was contradictory to what he had said about losing the file (how can you lose something that never existed?).\nHe is good counselor to go to for advice, but I wouldn't go to him if you might need records of your therapy later.", "pics": null, "resp": null, "gmap_id": "0x88927dd36b98bfbb:0x59188415ad3155e1"}
{"user_id": "100529292969791801022", "name": "gimelnus", "time": 1621878110704, "rating": 1.0, "text": "Front office staff again! Therapist was fine though not helpful really. Called with an emergency, but couldn't be seen until June. And the older lady on the other end SHAMES me. This is no way to handle someone going through a mental health emergency.", "pics": null, "resp": null, "gmap_id": "0x888c2a6864dfea71:0xded44cdef5fd271a"}
{"user_id": "105487462656229306796", "name": "Virgo Vixen87", "time": 1601577288245, "rating": 1.0, "text": "That one (white) lady at the front desk is RUDE! She needs to retire and go home and knit blankets or something because working with the public is not the job for her! My son has just started going to this facility and I can see me cussing her out already! I DO NOT RECOMMEND!", "pics": null, "resp": null, "gmap_id": "0x888c2a6864dfea71:0xded44cdef5fd271a"}
{"user_id": "111646267817211895811", "name": "Jason Potter", "time": 1569524272210, "rating": 5.0, "text": "My wife and I ended up bringing our child to Associated Psychologist to deal with his attention and behavior problems at school. Their wonderful staff worked with us to move quickly through the process, get the proper diagnosis, and set us on the correct path to move forward with proper treatment so that our child can excel in his home and school activities.", "pics": null, "resp": null, "gmap_id": "0x888c2a6864dfea71:0xded44cdef5fd271a"}
{"user_id": "115194882237745861956", "name": "Kris Trentman", "time": 1558975090417, "rating": 1.0, "text": "My son and daughter went on the same day and I had his results weeks ago but a month later and still waiting on my daughters. Very incompetent staff which is obviously a reflection of their leadership. Would not recommend to anyone!", "pics": null, "resp": null, "gmap_id": "0x888c2a6864dfea71:0xded44cdef5fd271a"}
{"user_id": "104510869400264452432", "name": "Brenda Roberts", "time": 1572982073437, "rating": 1.0, "text": "The lady at the reception is rude and certainly off putting. If I have a problem I don’t want to fight with the receptionist before seeing my therapist. I see many reviews that underline this fact but she still presents the same issue. Hopefully she can get one of her colleagues to write a prescription for an anti depressant!", "pics": null, "resp": null, "gmap_id": "0x888c2a6864dfea71:0xded44cdef5fd271a"}
{"user_id": "117891383157409028281", "name": "Jessica Barnes", "time": 1556114219157, "rating": 1.0, "text": "I was referred by our pediatrician to this office to begin preliminary testing for dyslexia.  I Found from initial entrance and walking in through out the entire process this office is rude and incompetent. My daughter didn’t have a attention or discipline issue she had a specific area we were addressing yet they tried to determine she was ADHD. After sitting with them to go over their diagnosis or testing results I had to counter them with the facts and they looked stupid the entire time because they knew I was right. I addressed the fact my daughter who was only in Kindergarten was not ADHD anymore than the typical child in today’s technology filled world. That their testing was irrelevant at this point because she wasn’t even able to identify or understand certain instructions at this age and other examples as to how they just didn’t do what I brought her there for. I was told it would take a month or so to get her file typed up and sent to her school. I called today 5 months later and I was told that it hadn’t been done because the lady left the office and no ones done it since.", "pics": null, "resp": null, "gmap_id": "0x888c2a6864dfea71:0xded44cdef5fd271a"}
{"user_id": "106262440475910074959", "name": "Stacey James", "time": 1526513626508, "rating": 1.0, "text": "It's helpful to know that I'm not alone. It's hard enough to deal with healthcare issues but it's really exausting to have to deal with the rude and totally disrespectful front office staff at this place. Very awful and frustrating experience. That older lady really is the DEVIL... You WILL regret choosing this office.", "pics": null, "resp": null, "gmap_id": "0x888c2a6864dfea71:0xded44cdef5fd271a"}
{"user_id": "107811773050799478749", "name": "Tokeyla Nettles", "time": 1532382788620, "rating": 1.0, "text": "This place is the epitome of incompetent and rude. More specifically the front office. The woman on the phone is rude and very nasty in her demeanor, but little does she know I will be telling my child's pediatrician. When you are in healthcare, you made a conscious decision to work with the public, and she clearly needs to be at home kicking rocks or something that is more becoming of her nasty attitude.", "pics": null, "resp": null, "gmap_id": "0x888c2a6864dfea71:0xded44cdef5fd271a"}
{"user_id": "108139283803043439577", "name": "Rebecca", "time": 1541709891155, "rating": 1.0, "text": "Very rude, off putting and extremely disrespectful!! If you're dealing with any mental health issues.... THIS IS NOT THE PLACE TO CALL OR VISIT!!!", "pics": null, "resp": null, "gmap_id": "0x888c2a6864dfea71:0xded44cdef5fd271a"}
{"user_id": "107080965698343014381", "name": "Alisha Fenley", "time": 1560017129634, "rating": 5.0, "text": "After taking my son here for I believe 2 years now I can say in the beginning it was very frustrating. Never with his therapist we love her and she has helped my son in so many ways.", "pics": null, "resp": null, "gmap_id": "0x888c2a6864dfea71:0xded44cdef5fd271a"}
{"user_id": "112831310526294647352", "name": "Jamee Day", "time": 1501536411603, "rating": 5.0, "text": "been going here for awhile. the reciptionist is great and anyone who says other wise is delusional.", "pics": null, "resp": null, "gmap_id": "0x888c2a6864dfea71:0xded44cdef5fd271a"}
{"user_id": "113168118706949360496", "name": "Mysti Shamblin", "time": 1502806623868, "rating": 1.0, "text": "Sheila, a therapist there, is an absolute nut job. If you don't have Medicaid the options for people to chose from are slim to none.", "pics": null, "resp": null, "gmap_id": "0x888c2a6864dfea71:0xded44cdef5fd271a"}
{"user_id": "117871315260237187816", "name": "Lucas Fenstermacher", "time": 1624066462372, "rating": 5.0, "text": "Went here years ago, wouldn't be here today if not for Dr. Avery Berry he helped me out a lot didn't judge me once and took his time to try to understand me and my thoughts, he saw me as human being and not as a crazy person the way my last therapist did elsewhere because of him I am able to cope with having bipolar disorder better than I was before. I'd recommend this place to anyone.", "pics": null, "resp": null, "gmap_id": "0x888e81da83c25aad:0x1ef2af953e2c6443"}
{"user_id": "102406628889749483172", "name": "CHLOE CROSKEY", "time": 1626453018224, "rating": 1.0, "text": "The website for this company has no integrity.  The employees would NOT tell me (Michelle Croskey) who the CEO/President name.  This company is Not professional. Can someone have one these people to call me or give me there phone number.\nDuncan McRae, Jr. M.D., President\nPete Cobb, J.D., Vice President\nElizabeth DuBard, Secretary\nSteve Rutledge, Treasurer\nJessica Taylor, J.D., Immediate Past President", "pics": null, "resp": null, "gmap_id": "0x888e81da83c25aad:0x1ef2af953e2c6443"}
{"user_id": "107445596653551451482", "name": "Rebecca Varner", "time": 1599836936498, "rating": 5.0, "text": "I took my granddaughter’s here to see someone and they really were very helpful and the girls loved their therapist and it really seemed to help them. They are very helpful if we you really are having problems and need help. They don’t take insurance but you pay cash and they will give you a receipt to for you to file with your insurance.", "pics": null, "resp": null, "gmap_id": "0x888e81da83c25aad:0x1ef2af953e2c6443"}
{"user_id": "106362633253189940238", "name": "Debi Goodman", "time": 1588015619350, "rating": 5.0, "text": "I have seen 2 of the counselors here over the last 10 years. Another family member has seen a third. We have been extremely happy with all 3. The staff is professional but makes you feel like family. There is no judgement. They are faith based, but you decide whether or not you want that to be part of your program. I would reccomend this group to anyone of any age who needs someone to help them work  through  something. They take all major insurance and have a payment plan if you are uninsured.", "pics": null, "resp": null, "gmap_id": "0x888e81da83c25aad:0x1ef2af953e2c6443"}
{"user_id": "112550832522594320110", "name": "shelbly1", "time": 1568144564124, "rating": 5.0, "text": "I absolutely love the counselor I see here! She is so kind and caring. Helpful and compassionate about what you're dealing with.", "pics": null, "resp": null, "gmap_id": "0x888e81da83c25aad:0x1ef2af953e2c6443"}
{"user_id": "116859078028732265371", "name": "Scott McNelley", "time": 1392480560412, "rating": 5.0, "text": "This is a wonderful resource for so many in the River Region. Compassionate counseling and help provided by a very talented staff.", "pics": null, "resp": null, "gmap_id": "0x888e81da83c25aad:0x1ef2af953e2c6443"}
{"user_id": "109854390525403779788", "name": "Katie Grayson", "time": 1614289812090, "rating": 2.0, "text": "Unfortunately we didn’t have a great experience with Dr. Goff. Declining to diagnose when you were asked by another provider for a diagnosis, and then laughing at your patient when they ask why, doesn’t really inspire confidence.\n\nI’m sure Dr. Goff is great when he’s great, but that’s not been our experience with his office. It was just a waste of money and time (we had to wait weeks for a diagnostic appointment and then wait weeks after because he took so long to provide any information to the original provider).\n\nAt this point, my husband is not sleeping nor eating, and might end up hospitalized yet again. So, thanks for nothing!", "pics": null, "resp": null, "gmap_id": "0x8888a81a72f69903:0x2ea6fbffbf40c47c"}
{"user_id": "117476738405959351172", "name": "Lane Kelley", "time": 1603077798260, "rating": 5.0, "text": "Excellent doctor, very professional and puts his patients first.", "pics": null, "resp": null, "gmap_id": "0x8888a81a72f69903:0x2ea6fbffbf40c47c"}
{"user_id": "107599247305230532399", "name": "Victoria Ellis", "time": 1572536748637, "rating": 5.0, "text": "Dr. Goff is an amazing Dr.  He knows what to do and how to do it and outs his patients first.  I'm so glad for the referral to his office", "pics": null, "resp": null, "gmap_id": "0x8888a81a72f69903:0x2ea6fbffbf40c47c"}
{"user_id": "111279692767492054089", "name": "Jenny Marie Miller", "time": 1532624124500, "rating": 5.0, "text": "This doctor is wonderful he is helping me and my daughter out so much I totally recommend him", "pics": null, "resp": null, "gmap_id": "0x8888a81a72f69903:0x2ea6fbffbf40c47c"}
{"user_id": "105329885202584640645", "name": "Kim Klicker- Wenth", "time": 1403829790603, "rating": 5.0, "text": "very easy to talk too. professional and kind.", "pics": null, "resp": null, "gmap_id": "0x8888a81a72f69903:0x2ea6fbffbf40c47c"}
{"user_id": "101401463091488365266", "name": "Caitlin Shostak Lotz", "time": 1604449000814, "rating": 5.0, "text": "If you feel frustrated and misunderstood by \"most\" therapists, I would highly recommend Joel. He has a sixth sense for understanding people and the ability to tap into the best thing about them. I have the privilege of knowing Joel personally. I can attest that he is truly a brilliant, imaginative and original thinker.", "pics": null, "resp": null, "gmap_id": "0x888923adc678bfab:0xdad6ae4991d7f84"}
{"user_id": "110551372072775998996", "name": "Caleb Young", "time": 1604274844925, "rating": 5.0, "text": "Joel is such a warm, witty and compassionate human being. Anyone seeking a therapist that will truly see you as a person can stop searching cause you’ve find him. 5/5 and I actively recommend to friends and family.", "pics": null, "resp": null, "gmap_id": "0x888923adc678bfab:0xdad6ae4991d7f84"}
{"user_id": "111754692598250517577", "name": "Andy Philpo", "time": 1604447688129, "rating": 5.0, "text": "Joel is an insightful and intelligent human being who you can trust to help you process and understand the complexities of your inner self. Come away deeper self knowledge and self mastery, which in turn leads you to a more peaceful life and more fulfilling personal or professional relationships.", "pics": null, "resp": null, "gmap_id": "0x888923adc678bfab:0xdad6ae4991d7f84"}
{"user_id": "116095332748781822715", "name": "Andrew Lotz", "time": 1604340442403, "rating": 5.0, "text": "Joel is the most empathetic and intelligent person I know. He has an uncanny ability to understand people. If you need someone to really \"get you,\" this is the place.", "pics": null, "resp": null, "gmap_id": "0x888923adc678bfab:0xdad6ae4991d7f84"}
{"user_id": "110752602716911747089", "name": "Wil Heflin", "time": 1605014339406, "rating": 5.0, "text": "Joel Blackstock is a talented, kind, and empathetic therapist. He is clearly passionate about helping others and wants the best for his clients’ outcomes. He is trained in EMDR to help with ptsd and incorporates it along with his years of experience into the process.", "pics": null, "resp": null, "gmap_id": "0x888923adc678bfab:0xdad6ae4991d7f84"}
{"user_id": "100081884310488998451", "name": "Jonathan Chesney", "time": 1604336292032, "rating": 5.0, "text": "Joel is thoughtful, curious, insightful, well-trained, and cares deeply about people in general and his patients health and well-being  in specific.  If you’ve been considering therapy and counseling, or just need to talk to someone about how those things might help, I recommend giving him a try!", "pics": null, "resp": null, "gmap_id": "0x888923adc678bfab:0xdad6ae4991d7f84"}
{"user_id": "114591756848061077487", "name": "Thomas Kozak", "time": 1605224610552, "rating": 5.0, "text": "No pre-formed assumptions here.  Joel Blackstock meets you where you're at, and he responds to the unique nuances of every individual.", "pics": null, "resp": null, "gmap_id": "0x888923adc678bfab:0xdad6ae4991d7f84"}
{"user_id": "107229534905348654712", "name": "Teria Fuller", "time": 1604442469901, "rating": 5.0, "text": "Joel is extremely trustworthy.   I feel free to talk with him about anything and not be judged.", "pics": null, "resp": null, "gmap_id": "0x888923adc678bfab:0xdad6ae4991d7f84"}
{"user_id": "106870534777211389646", "name": "Joyce Goodman", "time": 1581824284132, "rating": 5.0, "text": "Best psychologist ever created. With her, I went from a very depressing life to a not perfect life, but a whole lot better. I trusted her to say things I have never said to another human being. Pat is laid back and her whole demeanor is to just take people as they come. Judgemental is not even in her life repertoire.", "pics": null, "resp": null, "gmap_id": "0x888d4783c9cd9743:0x708c665fcf363b47"}
{"user_id": "106356787355266653866", "name": "Rodney Owens", "time": 1603191720083, "rating": 5.0, "text": "Dr.Melvin has been my Doctor for 20 years off and on. Every time I talk to him I leave with a smile and a better out look and know everything is going to get better.", "pics": null, "resp": null, "gmap_id": "0x888918bff0f947ff:0x1ec4c37cc9037129"}
{"user_id": "100014756320250630752", "name": "S. A.", "time": 1571980086608, "rating": 5.0, "text": "Has been my doctor for 8 years. Has helped.me tons! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888918bff0f947ff:0x1ec4c37cc9037129"}
{"user_id": "116101048336931916947", "name": "Jeremy", "time": 1490947829423, "rating": 5.0, "text": "Best Doctor EVER!!   I HIGHLY recommend him to anyone!  Before he gets to know you he will help you think more clearly, and if you start to thing negatively again he reminds you how far you've come.  He actually cares!  ☺", "pics": null, "resp": null, "gmap_id": "0x888918bff0f947ff:0x1ec4c37cc9037129"}
{"user_id": "110789948002983889903", "name": "DJ Lowe", "time": 1519323668155, "rating": 5.0, "text": "Dr Melvin is especially knowledgeable about PTSD and anxiety disorders. I have worked with him in these areas and he has been so kind and helped me so much.", "pics": null, "resp": null, "gmap_id": "0x888918bff0f947ff:0x1ec4c37cc9037129"}
{"user_id": "106721729697382328282", "name": "ann letti", "time": 1485442155742, "rating": 5.0, "text": "I would highly recommend Dr Melvin. He is there to listen to you with compassion and help you through your problems in a very professional manner.", "pics": null, "resp": null, "gmap_id": "0x888918bff0f947ff:0x1ec4c37cc9037129"}
{"user_id": "100132548657771335259", "name": "Faith Nixon", "time": 1623601988001, "rating": 2.0, "text": "We had my daughter tested for dyslexia.  The testing was performed professionally and we were pleased.  We had a 1 hour Zoom conference with Dr. Pierce to review the results which unfortunately did not go well.  My daughter clearly tested with signs and symptoms of dyslexia.  She had NUMEROUS statistically significant scores that were far below her expected range of performance.  Dr. Pierce refused to give any real diagnosis and repeatedly said my daughter just had \"weaknesses\".  I specifically asked Dr. Pierce if she was dyslexic and Dr. Pierce repeatedly said no, she just had \"weaknesses\".  The \"accommodations\" and recommendations were a joke and included \"Help Anna learn/memorize specific and 'tricky' spellings\" - that is the point of the testing, to find out why my daughter can't memorize spelling words.  She refused to give a diagnosis which was the point of the testing.  When I complained to the office manager, she had a meeting with Dr. Pierce and I had a conference fall with the office manager.  The office manager specifically said that my daughter was clearly dyslexic, the exact opposite of what Dr. Pierce had said.  In fact, the office manager said if you google dyslexia my daughter was  text book case.  However, Dr. Pierce refused to give that diagnosis initially or really provide any useful information.  We would not recommend using this facility for academic testing.", "pics": null, "resp": null, "gmap_id": "0x889bb292338bfdb9:0x753d742db484c73e"}
{"user_id": "108777636456934584133", "name": "cliles69", "time": 1481912387366, "rating": 5.0, "text": "Dr. Pierce and her whole staff are very caring and take a personal interest in people. Dr. Pierce is wonderful. It's unexpected for both the parent and the child to like the Dr. but, in her case that's how it is.\n\nHer staff bend's over backwards to help with anything they can. I cannot recommend her enough.", "pics": null, "resp": null, "gmap_id": "0x889bb292338bfdb9:0x753d742db484c73e"}
{"user_id": "106130660871090047852", "name": "Rene Jamison", "time": 1620093783788, "rating": 1.0, "text": "Poor if I could give a zero I would. I went into their office for the first time.  I was told that I was not a good fit for there care at their office by the receptionist at the desk. Apparently they don’t treat people with mental illness.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPYQt-Jz56kSRUukDaDjxv8u9iCy5zVAFr5zs1e=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "114346522559974842004", "name": "Jessica Saxon", "time": 1618527443827, "rating": 5.0, "text": "This review goes to Nathan at Southern Psychiatry. I've never been to therapy before in my life and was utterly nervous about going my first time. Nathan was not only reassuring but he was compassionate, understanding, and attentive to my needs and helped me in ways I honestly never thought possible. Hes extremely cool and just overall easy to talk to and he feels like your best friend. He works out plans that are best for you and YOUR needs. There is laughing and so much healing within this one hour its unbelievable. I'm so happy I found the best therapist EVER. Please go see Nathan guys. Hes so awesome!", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "109088153570462072545", "name": "Shannon Lundgren", "time": 1618600977324, "rating": 1.0, "text": "I have seen several providers at Southern Psychiatry for about 18 months.  In that time, the initial concerns which drove me to seek help from them were not addressed, nor did any of the staff adequately explain to me why they gave me the diagnosises they did.  I also had to remind the healthcare providers why I was there on followup visits.  Their front office - when you can get them to answer the phone - are in capable of telling you when your appointment is or which of your medical records you are legally entitled to.  Try literally any other place first.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "117938297475328973899", "name": "Ki Freeman", "time": 1611621508499, "rating": 3.0, "text": "The ONLY reason I give them 3 stars is because of Dr. Sadler.  It took weeks for me to get an appointment, well I guess I should say a call back for an appointment.   Dr. Sadler was extremely thorough and answered all my questions during my video call.  It took them MONTHS to bill me after my insurance company processed the claim.  The website did not seem very secure to make payment so I attempted to call and make payment over the phone.  Almost 2 weeks later and 2 voice mails and I finally gave up and mailed my payment.  No call back to this day.  I hope my payment that I sent over a week ago is applied to my balance and that I am not put in collections.  Very disappointing and tough on my mental health.....", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "102400481339556782188", "name": "Meep Meeperson", "time": 1622587979060, "rating": 5.0, "text": "Dr. Sadler and Mr. Nathan are wonderful", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "113676194992147083367", "name": "Kimberly Rossler", "time": 1611992297041, "rating": 1.0, "text": "I really want to like this practice bc I see the PA Valerie who is beyond amazing! But not once has Dr.Sadler been involved with my treatment. Valerie is amazing but not a psychiatrist so it’s hard for me to believe I am getting the help that’s needed bc a actual DR should be the one diagnosing me . The office is pure horrible! Don’t even try calling ! I only will email instead of calling so I have a record to prove communication with the office staff. If you leave a voicemail you’ll be called back days later. I am trying to get help with my mental illness but it’s really hard at this place when the office staff will test your patience . It’s not a professional place at all and it’s sad!", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "118322600557296692236", "name": "Joe Pitts", "time": 1605816653939, "rating": 5.0, "text": "Dr. Sadler is amazing, Miranda is phenomenal, I love when we chat, and Nicole is phenomenal! Thank You guys so much!", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "101106945144220773112", "name": "Emily Horn", "time": 1603824450008, "rating": 5.0, "text": "The most thorough and friendly staff Ive ever been to. Ive been seeing mental health professionals for over 10 years and have never been as impressed as I am with this place.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "111092595288603289457", "name": "RKN RBN", "time": 1576721994962, "rating": 5.0, "text": "Valerie is FANTASTIC. My previous Dr closed her practice, what a blessing in disguise that ended up being! Valerie is so personable.\nMy experience at SP has been top notch. I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "102808662761612941757", "name": "Steven", "time": 1600096823667, "rating": 4.0, "text": "The doctors are fine, well at least the one I've seen. They are also quick to fix any issues brought to their attention.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "110260344436654724359", "name": "Tammie Walter", "time": 1600010360463, "rating": 5.0, "text": "Dr Sadler is the best.. Let him help you!", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "104466009919265080886", "name": "Michelle Jackson", "time": 1571415744467, "rating": 5.0, "text": "I am so comfortable with Ms. C. Threadgill, I can truly just be me,  she listens very attentively, makes sure that you understand any and all instructions that are given and will make sure that you are getting the most out of your visits. If I must say she is a phenomenal woman, excellent in her craft.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "101138774311146614400", "name": "Courtney Lang", "time": 1562548674676, "rating": 5.0, "text": "I give Dr Threadgill along with the office staff 5 stars for their kindness and their ability to make my experiences extremely pleasant. I’ve never had an issue with scheduling my appointments, in fact I’ve found that her flexibility regarding accommodating my busy schedule to be unmatched to any other provider. I feel completely confident and comfortable in her skills and her ability to address any and all of my concerns.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "101130197147328546389", "name": "Dana C", "time": 1565572923310, "rating": 4.0, "text": "I feel comfortable with Dr. Cristal. I have seen her a couple of times. She is professional and explains my medicines and reason for lab test. I did have a problem with a medicine at the drugstore but she got my message and worked it out. I like that she offers late evening appointments. She saw me on my lunch one time. Thank u", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "103728025748468098166", "name": "Charlotte Plunkett", "time": 1560428256325, "rating": 5.0, "text": "The doctors and staff at Southern Psychiatry are amazing.  They are kind, caring and want to help figure out the best treatment for you.  I had the best experience.  Thank You Southern Psychiatry.  Also love the therapy dog.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "109027071624489394856", "name": "LeAnn Miller", "time": 1580413565377, "rating": 1.0, "text": "Very unprofessional. Doctor Crystal was extremely forgetful, phone staff was rude and almost never returned my calls. Doctor Crystal made excuses for rude staff, they're hard to get ahold of because they won't answer the phone, had issues trying to refill prescriptions. They couldn't find my consent form to release medical records so they said they'd fax a new form for me to sign and they never did. Waited 45 minutes for an appointment with Dr. Bennett before they told me someone should have told me I was supposed to be in a different waiting room. Had testing set up with Dr. Bennet's office and they cancelled the day before. Found out they lied about why it was cancelled. Told me they accepted Medicaid and had no copay but after two appointments they called and told me I needed a referral from my primary care Doctor in order for Medicaid to pay which they NEVER mentioned before and said I owe over $200. Felt like doctor Crystal didn't listen and overall felt like they didn't care whatsoever. This place added to my anxiety and was probably the worst mental health clinic I've been to.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "109769632826451956607", "name": "Jamie", "time": 1561226178401, "rating": 1.0, "text": "The staff are nice enough and the lady I saw was polite, reasonable, and down-to-earth.  However, two huge issues. 1.) she seemed to be working on an almost assembly line sort of protocol and took a very short time to listen to my concerns and prescribed medications that gave me multiple concerns due to potential side effects I wanted to avoid 2.) the lady with whom they scheduled my appointment also did not have her insurance credentials in order so I ended up paying 155.00 out of pocket. I have excellent insurance and I would have had zero copay if she could’ve accepted my insurance. I paid because they assured me that by the time my follow up appointment was scheduled they would have the situation remedied. I called before I went to the next appointment and was advised she still didn’t have credentials for united healthcare so the visit would cost 90.0. I canceled the appointment and will have to find another doctor. This has also left me dealing with the side effects of those medications without any support in handling that. All around, I do not advise going here. The building is not handicap accessible which makes it more difficult for me as I don’t do that well with stairs sometimes, they don’t seem to have their business in order, they don’t seem to take the time to truly understand your issue and act appropriately, and I was left with a strong impression that they simply didn’t care much. If anything they should have said come into your appointment and we will not charge you and will handle the insurance after the fact. I do not understand why they think it is acceptable to force a patient to pay their outrageous prices for twenty minutes of their time when it’s their fault they’re not getting paid through insurance. Perhaps they have resolved the issue, perhaps not, but definitely call and question absolutely everything they tell you because they seemed to have no problem surprising me not only once with a bill I shoudn’t have had to pay, but they didn’t even call me before the follow up to advise me I would again be required to pay out of pocket.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "115628829108645125700", "name": "Bobbi Coburn", "time": 1561241149641, "rating": 5.0, "text": "Dr. Sadler and the other providers in this office strive for the best and try to help in every way possible. Mental health is a sensitive subject and the providers make it 10x  easier, and more comfortable to talk to and open up with!!! Thank you Dr. Sadler and all other providers for helping our community and raising awareness about Mental Health!!", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "102267228044728818470", "name": "Steve Avery", "time": 1566153470776, "rating": 5.0, "text": "I had been going to Delta Behavioral and they were always running a least an hr behind. I made the trip to Southern Psychiatry and to my surprise, they were on time and my session was GREAT!", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "115628829108645125700", "name": "Bobbi Coburn", "time": 1561241149641, "rating": 5.0, "text": "Dr. Sadler and the other providers in this office strive for the best and try to help in every way possible. Mental health is a sensitive subject and the providers make it 10x  easier, and more comfortable to talk to and open up with!!! Thank you Dr. Sadler and all other providers for helping our community and raising awareness about Mental Health!!", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "114666162214941126133", "name": "Don Davis", "time": 1565629252421, "rating": 5.0, "text": "After what seemed like months of trying to find an appointment, I reached out to Southern Psychiatry and was happy to hear they could get me in. I met Dr Sadler, so easy to talk to. I walked away from this first appointment feeling like this place can help.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "108591494283928291594", "name": "Jeremy Carpenter", "time": 1564584930970, "rating": 1.0, "text": "They never pick up the phone when I call and they never call back.  I had to figure out how to come off the 2 meds i was taking by myself! THESE PEOPLE ARE CROOKS! IF YOU VALUE YOUR HEALTH AND YOUR LIFE DO NOT VISIT THESE PEOPLE.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "112781490773650675454", "name": "summer moore", "time": 1578339275581, "rating": 1.0, "text": "Never able to confirm regarding they received other doctors records they are requesting. Charged me 1st visit 100$ with not even seeing the doctor. Felt as though it was a constant run around.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "114857328870029634019", "name": "Judy Woodard", "time": 1542253792881, "rating": 5.0, "text": "By far the best place around here in mobile. Great Dr's and staff. I am very thankful for them.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "100394927731833752285", "name": "Kristin McDaniels", "time": 1559733294944, "rating": 5.0, "text": "I was treated with kindness and respect the moment I walked in the door: felt very positive about my experience.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "104330011588323111560", "name": "J Watkins", "time": 1538584544128, "rating": 1.0, "text": "Most horrible experience I have ever had. The Psychiatrist is unprofessional. The office is the dirtiest office I’ve ever encountered in a Health Care setting. He brings a dog to work with him that uses the restroom on the floor. The receptionist that obtains urine for drug screens just leaves the urine laying around in open areas. The management team is unprofessional as well. Unethical behavior on charging patients for no show visits even after the patients call to reschedule appointments.  Worst service ever.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "112502801180270912807", "name": "Bart Roberts", "time": 1566422528620, "rating": 5.0, "text": "First time there and it was a great experience. Hats off to Dr Sadler", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "110430734103151623916", "name": "Bobbie Craft", "time": 1579557692306, "rating": 5.0, "text": "Friendly staff. Good Dr. And counselor.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "110430734103151623916", "name": "Bobbie Craft", "time": 1579557692306, "rating": 5.0, "text": "Friendly staff. Good Dr. And counselor.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "116437231372248503389", "name": "Kimberly", "time": 1562111747132, "rating": 1.0, "text": "I do NOT recommend this doctor’s office.  I agree with every negative review posted about them: The office is unappealing, but that can be overlooked.  People have complained about the receptionists, but they were nice to me.  People were charged no-show fees and co-pays when while on their insurance they have never owed a co-pay: the latter happened to me.  Someone said they treat you like a drug addict and I can see that as well.  You are drug screened before you see a doctor on your first visit.  Oh, and you have to use a public restroom in the main hallway of the building and carry your urine sample to them in plain view for anyone to see.  Other complaints have been about the apathy of the doctors, and I can relate to that as well.  I requested a refill for my medication 10 days before I was to run out and the doctor said she wrote me enough pills to get me to my next appointment plus 1 refill when in actuality my prescription bottle and the copy of the electronic prescription I got directly from the pharmacy shows otherwise, and in fact a lot less.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "104201822116940133834", "name": "John Sullivan", "time": 1536614336932, "rating": 1.0, "text": "My Wife preparing for a surgery in a few months and one of the requirements of her surgery is a Psych Eval.  Appointment was made with this physicians office.  Upon arriving, she's told that she has not met her deductible and that the visit would be $152.00, which doesn't make sense as she has already had surgery this year and multiple test done.  She had her debit card but had paid bills the day prior (of course) and only had $94.00.  The physician said he would see her for $100.00 but she only had $94.00 so she was not seen.   Now even though she was thoroughly embarrassed over the entire situation, she had rescheduled for another day.    Two weeks later, we get a bill in the mail charging a $100.00 NO SHOW fee.  Now I understand that they want their money in advance but ...she wasn't a NO SHOW.  The physician's office refused to see her.  I'm sorry this seems very tacky.  Now they've lost out on both ends as they lost a potential patient and she's refused to pay their NO SHOW fee.   Maybe it should be a Not Seen Fee...........", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "112372866275320936576", "name": "Amber Turrentine", "time": 1550237975906, "rating": 2.0, "text": "While I have never attended a session, I did reach out to schedule an appointment. I left a message and received a call back the next day. The receptionist said that there wouldn't be any new patient appointments until mid March. This is pretty common for first visits. My concern came when she asked for my credit or debit card number. When I asked why she seemed somewhat offended. The reason given was in case a don't show for an appointment. I have been to three different practices and not once have I been asked to give out my debit card number over the phone. I said that I didn't feel comfortable doing that and thanked her for her time.\n\nIf you dont feel comfortable giving out your debit or credit card number over the phone, I wouldn't suggest this place.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "107482146888215935076", "name": "Leigh Watt", "time": 1548273892690, "rating": 5.0, "text": "i give Mrs. Threadgill a 5 star rating but the office staff gets a 0-1 , in the past i have left several messages and not been called back and now here again i have left messages and not been called back.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "104864975723526236331", "name": "Mark Haygood", "time": 1558207059022, "rating": 5.0, "text": "Dr. Brad Sadler is an outstanding psychiatrist and I am happy to have him as a colleague in the area. I refer to his clinic as he practices with similar dignity, respect, compassion, precision, and safety. Thank you Dr. Sadler for all you do for our city!", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "115168358122505151967", "name": "Liz Ridgdell", "time": 1522298468442, "rating": 5.0, "text": "Dr Sadler has helped me so much in a very short time. I am so grateful. Also Donna Marie at the front desk is amazing.", "pics": null, "resp": {"time": 1523004004189, "text": "Thanks for 5 star rating... you are always welcome."}, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "102233911812401405352", "name": "Donna Dubose", "time": 1566153380781, "rating": 5.0, "text": "Can't say enough good things about Dr Sadler and staff. Finally found a place where i feel like they care", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "107627878756140138694", "name": "Pamela H", "time": 1505066151216, "rating": 5.0, "text": "Fabulous doctor. Holistic approaches instead of meds, if possible. He listens and understands to treat. Super happy to have found him.", "pics": null, "resp": {"time": 1523004076490, "text": "Thanks for 5 star rating... you are always welcome."}, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "100168979441490999286", "name": "Breland KO4QYX (Cobra6460)", "time": 1496708721006, "rating": 5.0, "text": "The first psychiatrist I can honestly say I like and feel comfortable and relaxed with and I have been seeing several on and off for 8 years now. Dr. Sadler has a fantastic medical background and it truly shows in his patient care.", "pics": null, "resp": {"time": 1523004093954, "text": "Thanks for 5 star rating... you are always welcome."}, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "110693541535811424551", "name": "Breanna Myrick", "time": 1542840786903, "rating": 3.0, "text": "Love Dr. Sadler but his staff is not very nice. Dr. Sadler helped diagnose me with the correct mental disorder and now I’m on the right track and the happiest I’ve ever been... I just have to deal with his office staff now.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "100168979441490999286", "name": "Breland KO4QYX (Cobra6460)", "time": 1496708721006, "rating": 5.0, "text": "The first psychiatrist I can honestly say I like and feel comfortable and relaxed with and I have been seeing several on and off for 8 years now. Dr. Sadler has a fantastic medical background and it truly shows in his patient care.", "pics": null, "resp": {"time": 1523004093954, "text": "Thanks for 5 star rating... you are always welcome."}, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "110506238947777421079", "name": "Raquel Henning", "time": 1554231494648, "rating": 1.0, "text": "It is NOT a safe place.  The one time I went in 2017, my husband would not drive through to the back because there was a drug deal going on. He was an MP.\nHaving had 6 concussions in the last 9 months, I accidentally called his office and made an appointment.  My husband finally remembered the place, and I called right away to cancel the afternoon appointment, but had to leave a message. My husband found an immediate 165$ charge on our card.  I explained to bobby, the manager, what had happened, that I got the wrong dr.  She rudely refused to make any adjustments saying that 21/2 years ago I signed an agreement.  Beware!!", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "114873456344231562970", "name": "Tammie Walter", "time": 1531051981345, "rating": 5.0, "text": "Genuine and highly knowledgeable. To say that I was at my wit's end, of a more than decade long battle to find real help, is a huge understatement. His expertise not only changed my life, I 100% know in my heart he helped me save it too. If you have lost all faith in doctor's, given up on meds, are disgusted and fed up with the lack of real mental health care, OR you've just lost all hope and given up... Please go see Dr. Sadler. I count him as one of my true blessings. If you listen to & allow him to, he will help you. :):", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "116420922191565982668", "name": "Sarah Stafford", "time": 1528644827024, "rating": 5.0, "text": "He is caring and concerned once you're established as a patient he will work with you on your co-pays and if you have any problems he will get you right in to take care of you.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "118216130242454778396", "name": "Paul Steuben", "time": 1482956743200, "rating": 5.0, "text": "I had an excellent experience at Southern Psychiatry.  Dr. Sadler took the time to get to know me and my situation and I really felt like he cared and wanted me to do better.", "pics": null, "resp": {"time": 1484212340477, "text": "Thanks for 5 star rating... you are always welcome."}, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "110631672427168001080", "name": "Alice Grayson", "time": 1554557707054, "rating": 5.0, "text": "Dr Sadler is awesome", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "116280990585945088013", "name": "John Singley", "time": 1560287653849, "rating": 1.0, "text": "Very unprofessional and the doctors act like you’re a drug addict", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "106896899835348198962", "name": "Louis Primos", "time": 1573500520161, "rating": 5.0, "text": "great place", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "106093609589524967246", "name": "Aaron VanHauter", "time": 1490109000937, "rating": 5.0, "text": "Great practice that really seems to care.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
