{"user_id": "114887793840161290840", "name": "K Hudlin", "time": 1615061937884, "rating": 5.0, "text": "Very nice office, scheduling appointments is a very easy process, and great staff!\nMrs. Kelsey Jackson is a dream! My son quickly felt comfortable with her and was willing to go out of his way and come out of his shell with her assistance. He says he likes going to \"Doctor's appointments now.\" It is so nice to receive care from someone who actually loves their job. She just has this ease about her that put my son and I in a very comfortable space. Mrs. Kelsey please keep doing what you do, you are a very bright light! You are a very valuable asset to your organization! Stay safe and well. Blessings to you and your family!!", "pics": null, "resp": {"time": 1615219345718, "text": "Thank you so much for the kind words, and especially for Kelsey! We think she's pretty awesome, too!  We're so happy that you had a great experience!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "116227978716204049887", "name": "Laura Elmore", "time": 1617657531737, "rating": 5.0, "text": "We’ve had a great experience going through autism and ADHD testing for two of our boys. The staff are friendly, knowledgeable, and professional. Scheduling is easy (I recommend emailing for appointments). The feedback from Dr Wadsworth and the therapists is great! Can’t recommend this place enough :)", "pics": null, "resp": {"time": 1617717323197, "text": "Thank you so much for this great review! We're glad that you had such a great experience!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "102262751710617203234", "name": "Terin", "time": 1600800399733, "rating": 1.0, "text": "I’ve been calling since June to schedule an appointment; I was finally able to reach someone at the clinic via phone - it’s September. To be clear, I have not been to their office... This practice was recommended by my child’s pediatrician for comprehensive developmental testing. Once I finally spoke to someone, I was informed that they only accept BCBS or cash. For the low, low price of $2500-3000, you can have 3-4 appointments (that is for testing only, no treatment).\n\nWhile their website presents this image that they aim to treat a wide array of conditions, including those individuals with disabilities and handicaps, it appears that their primary interest is taking advantage of those most in need. In many instances, those with handicaps and disabilities are unable to work with little to no income to support themselves or rely on their families for support; families in these situations are already under intense financial strain. Additionally, based on my conversation, test results are not given until a year long payment plan concludes (imagine an oncologist having this policy). A year, when it comes to a child’s development, is a long time to wait.\n\nAfter hearing the pricing, I had no interest in further details or clarification; however, I suppose it’s a good thing they offer a payment plan, if you’re willing to pay their high fees and do not want to take out a personal loan. It is likely they do not contract with Medicaid because the state will not pay anywhere close to their high fees.\n\nI have no interest in supporting a clinic more interested in lining their pockets than genuinely helping the community in which they aim to serve. I would not recommend this clinic to anyone and I will be contacting my pediatrician’s office to advocate removing this office from their list of recommendations.", "pics": null, "resp": {"time": 1600811761271, "text": "Terin,\n\nI am very sorry for the communication difficulties. I am afraid that there were some miscommunications regarding insurance coverage and cost of testing.  Additionally, test results are never withheld for payment - we always provide patients with a copy of the test results at the test result session, with payment plans continuing well beyond that date if cash is used. Please contact our office manager, Angela, at angela@silverliningsclinic.com for more clarifications.\n\nThank you,\nSLN"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "107219142762668301169", "name": "Krista Kiser", "time": 1617208472749, "rating": 5.0, "text": "Holleigh Woodward is an compassionate professional therapist. I highly recommend her.", "pics": null, "resp": {"time": 1617717382608, "text": "Thank you so much for the kind words for Holleigh!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "110785630211230592802", "name": "Jason & Amanda Page", "time": 1564781419799, "rating": 5.0, "text": "We’ve been using Silver Linings for our daughter for almost two years now. We absolutely love the doctors there. The environment is welcoming and calming. The doctors are very patient and detailed. They go over things with us at length and make sure we understand everything about a diagnosis or a therapy we’re doing. I’m just so very thankful for this place! Highly recommend it!", "pics": null, "resp": {"time": 1564958007364, "text": "Jason & Amanda,\n\nThank you so much for sharing your experience! We’re so happy that it’s been a positive one. It’s been a delight working with your family!!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "117700292109131912622", "name": "Brittnie Guise", "time": 1596550319079, "rating": 1.0, "text": "My son had an appointment for a full developmental screening and I was contacted by Angela and she told me that insurance denied to cover the testing and so I called my insurance company and they sent me information to appeal and I let Angela know this and she emailed me back once and I at that point communicated that I wanted to appeal and then sent her the information that needed to be filled out. It’s been 3 weeks and I’ve heard NOTHING from anyone. I have left voicemails for Angela  as well as emails, I have also tried contacting the front office and have left voicemails there trying to get some sort of help. My child is 4 and at the developmental level of a 2.5 year old as far as his speech & has multiple behavioral issues, I am desperate for help for him and all I want is for him to hopefully be tested and appeal the insurance decision or it’s $2600 out of pocket. It seems as though no one here cares I don’t understand it. Very unprofessional and I would not recommend this business to anyone. I’m beyond frustrated and disappointed.", "pics": null, "resp": {"time": 1596555049190, "text": "Ms. Guise,\n\nWe are so very sorry for the communication difficulties. We will be reaching out to you as soon as possible to attempt to rectify the situation.\n\nSLN"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "110126183966165584875", "name": "Jennifer Brown", "time": 1560174617330, "rating": 5.0, "text": "My son is a patient with Heather Wadsworth. Her and the rest of the staff are amazing at what they do and very friendly! The office is very clean, comfortable, and welcoming for people of all ages. By far the best place we have been for my son to get help with his issues. We love this office. My son actually gets excited for each appointment! Definitely a 5 Star facility!", "pics": null, "resp": {"time": 1560175487830, "text": "Jennifer,\n\nWe're so happy that you and your son are enjoying your experience with Heather and everyone at SLN!  It makes our day to know that your visits have been so positive!  Thank you so much for the review!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "113664281639864498400", "name": "Jessie Loveday", "time": 1593127466168, "rating": 5.0, "text": "We LOVE silver linings!! We went to numerous other places to get our son the help he so desperately needed. My son suffers from a severe case of selective Mutisim and we just kept getting told he will out grow it but we knew better and were watching our child suffer with such a debilitating anxiety disorder. Then we found silver linings. We met with Dr.Crisler and she confirmed that he would not “just out grow it” and they would get our son through this. She set us up for therapy with Emily and she is simply amazing!! Our son has been to four therapy sessions and we are already seeing amazing progress. The entire staff is so kind, compassionate, understanding, and you can tell none of them are there just for a paycheck. They TRULY care about these kids and the families. The front desk staff always make you feel so welcome and have always been upfront about there policies and do a great job going over insurance and copays prior to your first visit. I HIGHLY recommend this team!", "pics": null, "resp": {"time": 1593180395552, "text": "Jessie,\n\nThank you so much for such a warm review!! We are all so happy that you have been seeing progress and have had such a good experience with our team!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "117700435964401330954", "name": "Tasha Vineyard", "time": 1568033748910, "rating": 5.0, "text": "It's very hard to find skilled and compassionate mental health professionals but this office has nailed it. Everyone from the Office Manager (Angie) to the Psychologist (Dr. Crisler) are caring and patient. We have been patients here since the office opened and the quality of care provided has been exceptional.", "pics": null, "resp": {"time": 1568044704740, "text": "Tasha,\nThank you so much for this review and kind words!! It has been our pleasure to work with you and are delighted that you've felt so supported!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "105956955776369894907", "name": "Cassandra Roberts", "time": 1575784054952, "rating": 5.0, "text": "Silver Linings has been the best thing for our daughter. The advancements she's made since we have started going is unbelievable and we are so grateful for them!", "pics": null, "resp": {"time": 1575903069178, "text": "Cassandra,\n\nWe are so happy that you have had a great experience at Silver Linings! Thank you for the review!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "100671702607893317718", "name": "april patellis", "time": 1559681437900, "rating": 5.0, "text": "My daughter has had a wonderful experience at Silver Linings.  She is working with Brooke Sorrells, Speech and Language Pathologist, to improve her verbal social skills.  2 months ago I would have never thought that a speech pathologist could help her with her social skills, but she is improving so much thanks to Brooke's work with her!", "pics": null, "resp": {"time": 1559844959846, "text": "April,\nThanks so much for the positive review! Brooke is pretty awesome :) We're happy you have seen such great improvement!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "105935848951881922489", "name": "G G", "time": 1559834481063, "rating": 4.0, "text": "Pretty good. One odd policy like we can be late more than 15 minutes late for your appointment but if you're 15 minutes late you may not get in. Other than that pretty good and professional.", "pics": null, "resp": {"time": 1559845389300, "text": "Thanks for the kind review! We're very sorry if you were ever left waiting. If this was a significant problem, please feel free to reach out to our office manager, Angie, at office@silverliningsclinic.com  We try our best to stay on time and have the 15 minute policy in place to simply encourage our clients to do the same - especially for our shorter, 30 minute sessions.  When we are able to, though, we do make every effort to see patients who are late."}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "108051639933198824726", "name": "Lela Boggess", "time": 1556550050022, "rating": 5.0, "text": "As a homeschool family, Silver Linings provided  exactly to kind of support that we needed to get answers and solutions to a few of the issues we were facing. The staff were all helpful and polite. Billing was made clear and they helped us navigate insurance issues. I would recommend them to others.", "pics": null, "resp": {"time": 1556635913390, "text": "Lela,\nThank you so much for the kind review! We’re happy that you had such a positive experience with the entire process!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "103808072427117692694", "name": "randy williams", "time": 1553782858111, "rating": 1.0, "text": "I had a very poor experience with silver linings. I needed help with my teenage son.the attitude and atmosphere from the beginning was uninspiring at best.the reception was poor.the lack of information was poor.my son had one visit .the counselor did not even introduce himself or herself.i don't know if it was a male or female. my son will not even tell me what was discussed.please go elsewhere if you need help.", "pics": null, "resp": {"time": 1553796249200, "text": "I am sorry that your experience with SLN was unsatisfactory.  Please reach out to us at office@silverliningsclinic.com so we can better understand your complaints and how to rectify the problem in the future."}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "116656017474654651318", "name": "Christie Queen", "time": 1556335499724, "rating": 5.0, "text": "My daughter loved her experience with testing recently. The staff was very friendly and helpful. The office was clean, welcoming, and well-thought out.", "pics": null, "resp": {"time": 1556541920342, "text": "Christie,\nWe're so happy that testing went well with you and your daughter! We aim to try and make it as pleasant as possible and are so happy that you both were pleased!  Thank you for the review!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "107312898871977736000", "name": "Kathleen Dunseith", "time": 1561392398698, "rating": 5.0, "text": "The staff is great. They communicate by phone, text, and email. Most paperwork is sent ahead of time by email or their online portal.", "pics": null, "resp": {"time": 1561415999518, "text": "Kathleen,\nThank you for the wonderful review! We're happy that you have found use of the online portal and have had a positive experience with our team!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "105601826631770899498", "name": "Meg Breland", "time": 1534295780530, "rating": 5.0, "text": "Silver Linings is the perfect name for this office! These amazing women go above and beyond for you. The whole office from the receptionist to the doctors take the time to know you and your child. They REALLY listen and want to use their knowledge to help. Here you are not just another patient. (Also, They take a variety of insurances. So don't let that stop you from calling.) They provide the gold standard testing like Sparks and Glenwood without being put on a year long waiting list.", "pics": null, "resp": null, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "107035388024058210213", "name": "Pamela Kerns", "time": 1556562912954, "rating": 5.0, "text": "Everyone in this business has been kind and courteous.  Takes time to listen about needs and has been very punctual about appointment times.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOTds5VtuC3rt910RjhKLRBUDNIM5LymplJuQ4j=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOgHWuvb0lPGbUNmTrqEF9PicjyfpJkemugF7Bo=w150-h150-k-no-p"]}], "resp": {"time": 1556635998287, "text": "Pamela,\nWe greatly appreciate your kind words! We’re happy that you have had a good experience with our team! Thank you for the review!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "108963407588328066973", "name": "ALN", "time": 1554302898709, "rating": 5.0, "text": "SLN is simply AMAZING!! They offer everything from diagnostics to other services that a client may need. They are passionate and vested in their clients, and go above and beyond what one would expect from a professional setting. Personally, the wellbeing of a child is priceless, and they are more than willing to take the time to listen and then implement whatever means necessary to help a client. I HIGHLY RECOMMEND SLN! You will be blessed!", "pics": null, "resp": {"time": 1554829073573, "text": "Thank you so much for the positive feedback!  It has truly been a pleasure of ours to help!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "105012151659853195263", "name": "Norionna Cox", "time": 1554467140503, "rating": 5.0, "text": "The entire staff is amazing!! They have been so helpful and encouraging and we are so thankful for their help.", "pics": null, "resp": {"time": 1554828860143, "text": "Thank you so much for the warm feedback!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "107331701119944635207", "name": "Brenda Tapia", "time": 1555014098297, "rating": 4.0, "text": "Great support in working though and developing a plan. I appreciate the staffs professionalism .", "pics": null, "resp": {"time": 1555078837301, "text": "I'm so glad that you felt supported! Thank you for sharing your positive experience!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "117137893230451895396", "name": "Karen Rass", "time": 1554816292729, "rating": 5.0, "text": "Very nice office and wonderful staff! Dr Crisler was concerned about my child issues and listen to them! Thank u!", "pics": null, "resp": {"time": 1554828780100, "text": "Thank you so much for the kind review!  We're so happy that you had a great experience!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "111025696414748911189", "name": "Matthew “Matt S”", "time": 1539741391688, "rating": 1.0, "text": "*****DO NOT USE SILVER LININGS*****\n\nAs much as Silver Linings does to help the customer, I feel like they still need a lot of work in actually helping.\n\nThe only reason I was willing to see so many therapist and so often was because we had met our max deductible and all that would be owed was the $25 dollar co-pay as session.\n\nSomehow in their decisions, they had us using a therapist that apparently wasnt a Blue Cross Blue Shield In-Network Doctor. You would of thought that anyone in their right mind wanting to only pay the 25 co-pay would not want each session to start costing over $130 dollars a session.\n\nI know I am partly to blame, but I just stopped paying waiting for the insurance to clear on the sessions, UN-knowing she was not even running it on Insurance. Silver Linings kinda screwed me over.\n\nOn top of that, my wife is a bit forgetful but we were stuck with $400 dollars in Cancellation fees for 4 missed appointments. Pretty stiff. I never even knew that policy existed, because they never told me. And dont say well I told Jane, because I am Bob and not Jane. Tell me the one paying the bills.\n\nWell as things are now, we are not putting our son back at Silver Linings because I feel like I was screwed over and they are not willing to work with me at all.  They will take their money over time sure, but work with me getting screwed over and making things right, no they wont.\n\nIf they decide to work something out with me, I will edit my review.", "pics": null, "resp": {"time": 1539793482702, "text": "Mr. Skillman,\n\nWe are deeply sorry that you feel less than pleased with the encounters your family has had with Silver Linings.  We do our best to present all fees within initial paperwork and notify families of any higher fees related to insurance as soon as we are made aware, but also understand that you are not satisfied at present.  We will discuss as a team how to improve and make all fees as clear as possible to future families. We are sorry for the frustrations you have experienced.  Please call us at 256-489-1583 to discuss your personal encounter in more detail and how we can further help.  When calling, please ask for the Insurance & Billing Department.\n\nSincerely,\nThe Silver Linings Team"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "115916623262560252548", "name": "rachel ciliax", "time": 1555425802290, "rating": 5.0, "text": "Very knowledgeable and friendly staff, dr Emily is great with my son.", "pics": null, "resp": {"time": 1555671901061, "text": "We’re so happy that you have been pleased with everyone, especially Emily! Thank you for the kind review!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
{"user_id": "107195974654973740165", "name": "David Moak", "time": 1580312208960, "rating": 5.0, "text": "Easy parking and covered access", "pics": null, "resp": {"time": 1580851255923, "text": "Thanks for the great review!"}, "gmap_id": "0x8862132e119d97e5:0xec6f53a4b1b3fae9"}
