{"user_id": "104430640492728078666", "name": "lizzie lugo", "time": 1628381332576, "rating": 1.0, "text": "I urge you all to steer clear of Simon McClure. If you are anything like me and suffer from anxiety and depression, he will only make it worse. He completely lacks compassion and refuses to acknowledge concerns regarding mental health. When feeling uncomfortable or that his medical opinion has been challenged, he resorts to belittling. I have never worked with someone that was so narcissistic, egotistical, and overall rude! He places high priority on getting patients in and out of his office faster than one can exhale and then bills for the entire hour block. In the two sessions I have had with Simon McClure, I have left feeling worse than I did coming in. He laughed off my concerns about very addictive medications and did not offer solutions. Also, he told me to adjust medication and wrote the prescription stating the opposite of what was vocalized. This person has no business having access to any medication involving a person’s mental health recovery. If the fact that he  ignored my concerns and then scoffed at a second opinion isn't enough, he made rude comments about my weight and choice of clothing. If you are seeking help, Simon McClure is not the person you should turn to. Find a doctor that cares more about helping you than what is in your wallet. The additional suffering he has created is not worth it and I hope he does not get the chance to derail another person’s life and recovery like he has done to me.", "pics": null, "resp": null, "gmap_id": "0x88890db08be5611f:0x7d1b3bef19d6de73"}
{"user_id": "103800188345715133625", "name": "BamaBassFinder04 4", "time": 1612992657664, "rating": 5.0, "text": "These people helped me more my first appointment than any of the DR's I've seen in the last 4 years.. Ashley Graves was awesome at listening and trying to help me with my issues!!! Thank u Grayson and Associates", "pics": null, "resp": null, "gmap_id": "0x88890db08be5611f:0x7d1b3bef19d6de73"}
{"user_id": "111917799428829727647", "name": "Andrea S", "time": 1609111930083, "rating": 4.0, "text": "Dr. McClure has helped me through a very difficult period of crippling anxiety and depression. Unlike other psychiatrists I've seen in the past, he actually listens to me and doesn't treat me like a bad person just because I have mental illnesses. My only issue is that the appointments always feel rushed as they are scheduled 5 minutes apart. That's not nearly enough time even if an appointment is just for a refill and the patient has no problems to address. So I often end up leaving appointments feeling that I haven't had the chance to really discuss each problem as needed.", "pics": null, "resp": null, "gmap_id": "0x88890db08be5611f:0x7d1b3bef19d6de73"}
{"user_id": "104261104873274732469", "name": "Johny and Shelby Valladares", "time": 1603143477828, "rating": 5.0, "text": "Just had my appointment with my new doctor and as always I felt comfort being there and being able to connect with a doctor and them understand me and what’s going on and what I’ve been through, Dr. McClure is an amazing doctor even though I just had my first appointment with him he took time understanding me and issues I deal with and it felt relieving being able to talk to him it makes you feel like you’re cared about when you have someone that will listen and talk to you about things that can be hard healing from and I look forward to my next appointment, I highly recommend Dr.Mcclure to others and will recommend him to anyone needing a good caring doctor who cares about you and your well being, if I could give 10 stars I defiantly would! Thank you so much Dr. McClure for being my new doctor I feel like a big pressure has been lifted off of me", "pics": null, "resp": null, "gmap_id": "0x88890db08be5611f:0x7d1b3bef19d6de73"}
{"user_id": "109108711955073485871", "name": "Maria Greguol", "time": 1594069998026, "rating": 2.0, "text": "My Dr referee me to Dr McClure for therapy, cause I mention that I didn’t want to take meds for my anxiety. This was my first time ever in a Psychologist office, I thought it was going to be pleasant and relaxing. I get to the front office the lady asks me for my referral, to which I tell her that my primary Dr made the appointment and that I was sure they had to have one, otherwise I wouldn’t have gotten the appointment. She then gives me a number To their billing  and tells me to verify with them if they have gotten the referral. I call s and I got a voice mail. I then tell her that I wished they would of let me know about this at the time they send me the text with the appointment info. I was already feeling very anxious.\nAs I am waiting for my 2:20 appointment ( at this time it was already 2:35) I see the Dr come out and take in another patient, I am thinking, how long is it going to take before I get called in. Then I see o other lady come in to see the same Dr. at this time is like 2:50. So, finally at 3:00, a lady calls my name and not making any eye contact whatsoever, maybe cause she was eating her mask under her nose, says she is the Dr’s nurse and that I have to wait a few more minutes in this other room until he finished with the other patient.\nHe finally took me in at 3:10 ask me a few questions, prescribed me medication and send me on my way. I was in his office for 16 minutes after waiting almost an hour. Not happy at all", "pics": null, "resp": null, "gmap_id": "0x88890db08be5611f:0x7d1b3bef19d6de73"}
{"user_id": "113779865066487232182", "name": "chris causey", "time": 1551227462500, "rating": 5.0, "text": "Dr. McClure is a great doctor that listens and helped improve my quality of life tremendously. Just because people can't be responsible with their medication they shouldn't give a bad review.  If I noticed things that didn't work or had side effects I didn't like he would listen and he would change it. I now can actually sleep through the night soundly and can wake up feeling motivated to live my life outside of my house and face the world.", "pics": null, "resp": null, "gmap_id": "0x88890db08be5611f:0x7d1b3bef19d6de73"}
{"user_id": "106896706793263755194", "name": "Jennifer Cusimano", "time": 1517013941105, "rating": 4.0, "text": "Dr. McClure has been with me during the easiest parts of my life and throughout the most difficult. He has remained a font of wisdom and I do not doubt his summations. In fact my transition between phases of life with his help have gone more smoothly than expected. I could ramble for sentences and paragraphs about Dr. McClure's care. My summary: this man is a good doctor whose judgment I follow implicitly.  You should as well.", "pics": null, "resp": null, "gmap_id": "0x88890db08be5611f:0x7d1b3bef19d6de73"}
{"user_id": "115629583585243107241", "name": "Martha Lee", "time": 1578397533325, "rating": 3.0, "text": "I saw Dr. McClure on 12/30/19 for a Pre discussed hospital stay the previous week to try electro-shock therapy for ongoing debilitating depression and anxiety that medication only worsens.  I emphatically mentioned to Dr. McClure that I must return to work 1/2/20.  In my anxious state and with great hope that the electro shock therapy would assist in my return to a normal life free of this debilitating condition I thought I would have one session on 12/30 and I would be able to return to work on 1/2/20.  Dr. McClure understood this and never made any comment to the contrary.  I was hospitalized by self admission on 12/30 and was seen by Dr. McClure on 12/31 in the hospital and was told staff were out for the holidays and my first electro shock could not be scheduled until Friday 1/3/20.  I was on Christmas leave from work until 1/2/20 but was willing to take the additional 2 days believing I could return to work on Monday 1/6/20.  Later in the day on 12/31 I met with my hospital social worker and told her I would have to return to work after the treatment on 1/6/20.  The social worker stated “Honey, don’t you know you won’t be able to return to work for 2 weeks, you will have multiple continuous days (6) of electro shock and will then have to be monitored for memory loss before your return to work.”  I stated no, my doctor had never discussed the duration of the treatment and since I had emphatically informed him I needed to return to work on 1/2/20 without any comment whatsoever on Dr. McClure’s part, I assumed that it would be a one day treatment.  I had to request an immediate discharge from the hospital and relayed to the nurse to convey to Dr. McClure my extreme disappointment that he had not informed me of the treatment duration.  If this had been done I could have arranged this at a later date with proper notification to my employer.  I was subsequently informed upon my discharge from the hospital that Dr. McClure stated I need to find another doctor.  This would have been done without Dr. McClure’s request.  Any physician, particularly in a case where a patient is mentally distraught because of continuous depression and anxiety should before any medical treatment is provided to the patient thoroughly inform such patient as to the advantages and disadvantages of such treatment and the full duration of such treatment BEFORE being so recklessly admitted to a hospital.", "pics": null, "resp": null, "gmap_id": "0x88890db08be5611f:0x7d1b3bef19d6de73"}
{"user_id": "106694019916447965660", "name": "Aubrey Perez", "time": 1558389853575, "rating": 1.0, "text": "My stepmother went to this man whom she followed blindly. He performed 5 electroshock treatments on her against the wishes of her mother and husband and once asperated during one(these were all done with in a week) just to treat paranoid schizophrenia. She later shot herself while still under his treatment. Stay away if you value your life and well being.", "pics": null, "resp": null, "gmap_id": "0x88890db08be5611f:0x7d1b3bef19d6de73"}
{"user_id": "116301921618476628623", "name": "sandra connell", "time": 1582323118151, "rating": 5.0, "text": "Dr McClure is a good doctor he really listen", "pics": null, "resp": null, "gmap_id": "0x88890db08be5611f:0x7d1b3bef19d6de73"}
{"user_id": "107902973374652380314", "name": "Cecilia Riley", "time": 1531239314337, "rating": 1.0, "text": "My sister went to dr McClure and she advised him of what was going on with her. He only gave her a ton of med xanax, seroquel, risperdal, and prozac. She can be very convincing he never spoke to any of her caregivers he tried to send her back to work when she says she told him she wasn't ready well let's just say this weekend she almost burned house down and locked us outside and we had to do everything to get in. We have called to get her another dr. I have never heard of a dr not listening to his patients. He has giving her so much medicine that her pharmacy suggest for her to have narcan on standby of possible od. I suggest if you want to get some real help and not a bunch of meds get another dr!", "pics": null, "resp": null, "gmap_id": "0x88890db08be5611f:0x7d1b3bef19d6de73"}
{"user_id": "108356372951689858443", "name": "The C Show Hosted by Chris", "time": 1522636224567, "rating": 5.0, "text": "Great doctor has helped me alot.", "pics": null, "resp": null, "gmap_id": "0x88890db08be5611f:0x7d1b3bef19d6de73"}
{"user_id": "117387887586749340913", "name": "BEAUTY GEMINI", "time": 1572277219949, "rating": 1.0, "text": "I have called numerous of times and there is always no answer .I have left messages as well and yet still no call back.", "pics": null, "resp": null, "gmap_id": "0x88890db08be5611f:0x7d1b3bef19d6de73"}
{"user_id": "112520203106825222014", "name": "Christina Oates", "time": 1629238081457, "rating": 5.0, "text": "Thrive is making such an impact in my life. I love how easy and open the conversations are and how the counselors personalize the “growth” assignments to their clients. They honestly meet you were you are and are honest and helpful about where the next steps are and how to take them on your journey to a better and healthier you.", "pics": null, "resp": null, "gmap_id": "0x88891f327aae01cb:0x24745e15285e49f0"}
{"user_id": "102577419814964078798", "name": "Carly Steed", "time": 1627049974478, "rating": 2.0, "text": "Please do not book a psychiatry appointment here. I was diagnosed with a panic disorder (after being asked vague questions and made to feel uncomfortable) and prescribed a VERY outdated medicine that isn’t prescribed anymore. After speaking to my therapist about not feeling anything, and even feeling worse from the medicine prescribed, I called the office and was immediately told that I could only talk to the psychiatrist in person and would have to pay for another session rather than quickly speak to the psychiatrist about this weird medicine or ask any questions. The psychiatrist would not take questions over the phone. I went to another psychiatrist, and was told that the medicine I was prescribed was one that she had never heard of. Please take the plunge and join the waiting list to see another psychiatrist.", "pics": null, "resp": {"time": 1627051234265, "text": "While we do stand behind the knowledge and expertise of our psychiatrist, your experience following up was not acceptable. It will be addressed and we apologize for your experience. If you would like to discuss it directly you can reach me on my cell at (205) 743-9251."}, "gmap_id": "0x88891f327aae01cb:0x24745e15285e49f0"}
{"user_id": "111315312618344298253", "name": "Sarah Arnold", "time": 1628615130974, "rating": 5.0, "text": "Wonderful counselors who will really listen and do their best to help you.", "pics": null, "resp": null, "gmap_id": "0x88891f327aae01cb:0x24745e15285e49f0"}
{"user_id": "107241517556331570228", "name": "Sam Mayhew", "time": 1628615409042, "rating": 5.0, "text": "Great counciling for all of your mental health needs.", "pics": null, "resp": null, "gmap_id": "0x88891f327aae01cb:0x24745e15285e49f0"}
{"user_id": "115954176930852337511", "name": "Burgandy M", "time": 1623255212555, "rating": 2.0, "text": "Did not want to retain me as a patient. Counselor cancelled appointments. Phone sessions were cut short (counselor disinterested).", "pics": null, "resp": {"time": 1623262325084, "text": "We never want one of our clients to feel this way. You can contact me directly on my cell at (205) 743-9251 and we will do whatever we need to to make this right."}, "gmap_id": "0x88891f327aae01cb:0x24745e15285e49f0"}
{"user_id": "103083350347864768484", "name": "kyle fortenberry", "time": 1628616161003, "rating": 5.0, "text": "The best counsellors work here!", "pics": null, "resp": null, "gmap_id": "0x88891f327aae01cb:0x24745e15285e49f0"}
{"user_id": "115546509333291626148", "name": "Scott Hodnett", "time": 1628615286190, "rating": 5.0, "text": "Wonderful place with great counselors!!", "pics": null, "resp": null, "gmap_id": "0x88891f327aae01cb:0x24745e15285e49f0"}
{"user_id": "116532065080543243075", "name": "Payton H. Stantis", "time": 1583248867248, "rating": 5.0, "text": "When I say that Thrive Counseling & Trauma Therapy has saved my life, I mean THEY HAVE SAVED MY LIFE. The methods that Jeff and his team use to help their clients are different than any type of therapy I have experienced. I spent much of my life seeing talk therapists who would make me feel heard, but that never gave me the tools to handle life's difficult situations. Thrive will hear you and help you figure out concrete ways to handle life's hurdles while providing you with the tools necessary to regulate yourself in any situation. I have been going here for years and have made significant progress on managing emotions, conflict resolution, self esteem, and have processed through multiple traumas. Many of my friends and family go here as well and we are all constantly singing their praises!  If you are ready for some healing contact these wonderful humans because they are the best in the biz! Good luck!<3", "pics": null, "resp": null, "gmap_id": "0x88891f327aae01cb:0x24745e15285e49f0"}
{"user_id": "106511653386093639018", "name": "JustBeingDrè _", "time": 1494977232919, "rating": 5.0, "text": "I have known Jeff professionally for years. We worked side by side, practically sharing an office for about 2 years. He is truly passionate about his work and the healing of his clients. I know for a fact that he will go the extra mile to help clients achieve therapeutic goals, if you are willing to do your part. He is experienced and certified in substance abuse treatment and trauma therapy.", "pics": null, "resp": null, "gmap_id": "0x88891f327aae01cb:0x24745e15285e49f0"}
{"user_id": "110376672012477654972", "name": "Regina Turner", "time": 1551743775879, "rating": 5.0, "text": "Jeff has been helpful as I work through adjustments and anxiety.", "pics": null, "resp": null, "gmap_id": "0x88891f327aae01cb:0x24745e15285e49f0"}
{"user_id": "107999966181547050169", "name": "Theresa Rose", "time": 1616621123220, "rating": 5.0, "text": "I never thought I could get better and not be depressed, until I started seeing Jeff at Thrive a few years ago. The day he was getting married, I had a pretty terrible panic attack and called him, and he spoke with me for 45 minutes and was able to calm me down. Right before they walked down the aisle!!! EMDR helped even though I was skeptical of it. I’m not perfect now, but I’m far from the sad, depressed girl who walked into Thrive suicidal all those years ago. They are wonderful and I couldn’t sing their praises enough!!!", "pics": null, "resp": null, "gmap_id": "0x8889232604792c65:0x5211fff7c37f08d7"}
{"user_id": "100981674450619719385", "name": "Mellissa Goetz", "time": 1609891065023, "rating": 5.0, "text": "Great counseling! Not just someone that will just listen and give metaphors. Actually getting better with each visit. Would highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8889232604792c65:0x5211fff7c37f08d7"}
{"user_id": "117216581481955751900", "name": "Jamie Lloyd", "time": 1626980293308, "rating": 1.0, "text": "Not very pleased,  office staff never gets back to you, and always a battle to get medication refills and PA filled out….. went without meds for 2 months and finally had to find another dr.   Now my son is having the same issues and he is special needs individual", "pics": null, "resp": null, "gmap_id": "0x888a3eae36eb807f:0x4c2e9c4d1c333a7a"}
{"user_id": "116483403678853929592", "name": "Cynthia Squibb", "time": 1611014467615, "rating": 5.0, "text": "She is an awesome dr! She is very knowledgeable and kind; She treats you with respect! I’ve been seeing her for yrs.", "pics": null, "resp": null, "gmap_id": "0x888a3eae36eb807f:0x4c2e9c4d1c333a7a"}
{"user_id": "101956852726381746745", "name": "Steve Livingston", "time": 1611889406849, "rating": 5.0, "text": "Dr. Khusro is a great psychiatrist & the work staff is very helpful. I highly recommend people to see her.", "pics": null, "resp": null, "gmap_id": "0x888a3eae36eb807f:0x4c2e9c4d1c333a7a"}
{"user_id": "115170344739959638427", "name": "Calvert Crane", "time": 1595500871020, "rating": 5.0, "text": "She's a really nice doctor 😁", "pics": null, "resp": null, "gmap_id": "0x888a3eae36eb807f:0x4c2e9c4d1c333a7a"}
{"user_id": "101463176498618956131", "name": "Mitzie Freeman", "time": 1573566304546, "rating": 5.0, "text": "She us an awesome Dr between GOD and her, my daughter is doing awesome. She is a blessing.", "pics": null, "resp": null, "gmap_id": "0x888a3eae36eb807f:0x4c2e9c4d1c333a7a"}
{"user_id": "105770396806149562309", "name": "KDB _", "time": 1560934041203, "rating": 1.0, "text": "Horrible, horrible, horrible. She canceled on me 5 times in a row. She was great at first, then started treating me I was just a burden and started to have a bad attitude towards me for absolutely no reason whatsoever. Started becoming argumentative with me instead of trying to help. Even made fun of my clothes one time! I felt worse about myself coming out of her office than I did going in! I wish I could give negative 5 stars for this quack!", "pics": null, "resp": null, "gmap_id": "0x888a3eae36eb807f:0x4c2e9c4d1c333a7a"}
{"user_id": "102031816877758576541", "name": "LInda Hatchett", "time": 1580091322934, "rating": 5.0, "text": "I am very thankful to Dr. Khusro in how she continues to dedicate time and efforts in working hard with me. I just can't say enough about how much I appreciate her.", "pics": null, "resp": null, "gmap_id": "0x888a3eae36eb807f:0x4c2e9c4d1c333a7a"}
{"user_id": "107224239356902836115", "name": "Tracey Delevie", "time": 1552197303228, "rating": 1.0, "text": "She has taken me off clonzepam after 20 years with no reason....people you can die coming off cold turkey ....so she decides adivan will be better.....OMG it's in the same class of meds. When something works leave it alone...all the people at the CED in the office want her gone.....need Dr Grant back.", "pics": null, "resp": null, "gmap_id": "0x888a3eae36eb807f:0x4c2e9c4d1c333a7a"}
{"user_id": "107602780749859001355", "name": "Jessica Hunt", "time": 1455663934904, "rating": 1.0, "text": "My husband has seen her twice, now mind you he's had about 6 appointments! She cancels last min and does not call to tell you she's canceling, my husband missed 4 hours of work one time to drive 45 mins to get to her office and her rude Secretary tells him that she has to reschedule the appointment. But then she expects you to pay her if you don't call 24 hours a head of time to cancel it! She canceled one time because she was out of town, and another because she had court. One time when my husband went she didn't even talk to him she was on her computer or cell phone the whole time! Now because of the meds she put him on has put him in the ER like her voice recording says to do, the ER did nothing for him told him to call his doc and now I have called her 33 times and left a message, my husband has called her 42 times and left a message. You can't get anyone, you call once and you get a busy signal then call again and it rings to her voice mail! She's pathetic and we will NOT be going back!", "pics": null, "resp": null, "gmap_id": "0x888a3eae36eb807f:0x4c2e9c4d1c333a7a"}
{"user_id": "112814652884007248300", "name": "Dirk Diggler", "time": 1485705653764, "rating": 1.0, "text": "She is by far the worst doctor I've ever seen.  She took me off my nerve meds and now I have nothing. I've had seizures and everything because of this lousy p.o.s doctor", "pics": null, "resp": null, "gmap_id": "0x888a3eae36eb807f:0x4c2e9c4d1c333a7a"}
{"user_id": "108406898353083343914", "name": "BamaGurl73", "time": 1534877674950, "rating": 5.0, "text": "Dr K has done wonders for me...the only bad reviews on here is because she will not prescribe non essential medicines as she is a psychiatrist not a pill pusher", "pics": null, "resp": null, "gmap_id": "0x888a3eae36eb807f:0x4c2e9c4d1c333a7a"}
{"user_id": "114183400190904787708", "name": "Carolyn King", "time": 1487344944321, "rating": 5.0, "text": "Very professional!", "pics": null, "resp": null, "gmap_id": "0x888a3eae36eb807f:0x4c2e9c4d1c333a7a"}
{"user_id": "106714065417311034723", "name": "Genoc Genesis", "time": 1628010366141, "rating": 5.0, "text": "I see Maggie Kellar and her nurse Mackenzie. They are both fantastic and very personable. I drive 45 minutes just to see them specifically. My experience with Mrs.Kellar is the best doctor/patient experience I have ever had. As long as the both of them are there I will always come back.", "pics": null, "resp": {"time": 1628011594099, "text": "We appreciate the five-star review. Thank you for taking the time. I share this with the team!\nKindly,\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "111088285127167682268", "name": "melody galloway", "time": 1626799700334, "rating": 5.0, "text": "Wonderful clinical staff.  Love love LOVE Dr. Lona!  She's intuitive and kind always.", "pics": null, "resp": {"time": 1626804381575, "text": "Melody, thank you for taking the time to leave us a review. We appreciate your kind words and I will share them with the team.\nKindly,\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "112747420689615813668", "name": "Mark Gotschall", "time": 1619647761047, "rating": 5.0, "text": "This place is so much the improvement over the Mobile location.  Miss Anita has always taken good care of me.", "pics": null, "resp": {"time": 1619704167460, "text": "We appreciate the review and value your feedback. Thanks for taking the time. I will share it with our team!\nKindly,\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "107238972653597520709", "name": "Bernard Doug Cook", "time": 1618246308024, "rating": 4.0, "text": "Seeing a therapist there, Barbara Lee, she's pretty good.", "pics": null, "resp": {"time": 1618253299486, "text": "Hi Bernard, thank you so much for the review. I am happy to hear you've had a positive experience at BayView. I will share your feedback with our team!\nKindly,\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "101933426791587473106", "name": "Paula D", "time": 1611276984306, "rating": 5.0, "text": "I love this office! I recently had my first appointment there in the office with Ms. kellar. The nurse mckenzie and ms Keller we’re both very kind and i could tell they really cared about me and my mental health. As long as dr kellar and McKenzie are there i will continue to come.", "pics": null, "resp": {"time": 1611328235036, "text": "So glad you had a great experience, Paula. I will share your feedback and praise with our team. Have a wonderful day!\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "105056974580107650670", "name": "Gail GULF SHORES", "time": 1598468288749, "rating": 5.0, "text": "So far so good for the excellent help I've got online with KATHERINE DAVIS. She is a very compassionate employee,  \"goes the extra mile \". So helpful with any questions.  A keeper.", "pics": null, "resp": {"time": 1598472946760, "text": "Hi, Gail! Thank you for the five-star review. We appreciate your kind words.\nSincerely,\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "107061948462776552968", "name": "Sandi Cushway", "time": 1581717258298, "rating": 2.0, "text": "They completely changed my medications that I have been stable on for over 15 years (with not ever having to increase ANYTHING).  I have only seen the PA twice and she was pretty nice.  There seems to be little concern for what I, as their patient, am going through every single day as a result of their decisions.  They are making matters worse for me mentally to where I am barely functional at home or work.  The only reason I gave two stars is for the nurse, Anita.", "pics": null, "resp": {"time": 1581721202681, "text": "Sandi, I am sorry to hear we did not meet your expectations. Your feedback will help us improve our services. If there is anything further you wish to add you can reach a member of our patient relations department at info@altapointe.org.\nKindly,\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "101617498648064415605", "name": "Billiam Quine", "time": 1575313763900, "rating": 1.0, "text": "They have an issue with making sure their records are up to date. Their staff isn’t helpful and I’m not sure they could be even if they wanted to. Lots of “Its not my problem” going on there. Find someone else to see. Just because they may be the biggest certainly doesn’t mean they are the best.", "pics": null, "resp": {"time": 1575403907628, "text": "Hi, Billiam. I am sorry to hear we did not meet your expectations of care. We appreciate the feedback because it will help us improve our care. If you would like to share more about your experience you can send an email to info@altapointe.org or reach our Patient Relations department at (833) 921-1811.\nKindly,\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "113201579604041302758", "name": "Serena kay", "time": 1565619809891, "rating": 5.0, "text": "I found a place where I could get help for my autistic son that's transitioning into adulthood. It's nice to have a place we can call and talk to and get help with medications without coming across as different or weird.  They deal with these things on a daily basis and it feels good to be understood.", "pics": null, "resp": {"time": 1566234746100, "text": "Hi, Serena Kay. Thank you for the five-star review. We appreciate you and your feedback.\nSincerely,\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "114717128277114793724", "name": "Shae McIntyre", "time": 1578512568798, "rating": 1.0, "text": "First of all it took 3 months to get in to see a nurse practitioner to try to get different medication for my anxiety. Second, I finally get to my appointment and because I have shingles (which is a. Only contagious when the fluid in the blisters are touched but b. All of my stuff was covered and wrapped up) they said they would need to do a full decontamination sweep and I would have to get the clearance from my doctor before I can be seen  . So I spent an hour there waiting just to hear I'm the plague basically. I've never felt so offended. I already cant go to my own brothers wedding because of it but now this. I'm furious.", "pics": null, "resp": {"time": 1578522055496, "text": "Shae, I am very sorry to hear we did not meet your expectations of care. Your feedback will help us improve our services. If you would like to provide us with additional information, you can speak to someone in our patient relations department by calling (833) 921-1810.\nKindly,\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "116324311210238740165", "name": "Juli Norman", "time": 1582921058880, "rating": 1.0, "text": "Some of the most unkind judgmental unprofessional human beings I’ve ever met. Worst money I ever spent looking for help. Went here due to my doctor no longer being in practice and instead of getting back on my regular medications I Was accused of being under the influence by the NP I saw, being two days post op. She stated “you seem drowsy and irritable” I’m tired and in pain (since I was driving I couldn’t take my pain medication). The woman who took me back for my weight and BP answered her phone and began screaming at someone about what only I can assume was her boyfriend cheating on her. Not a single employee looked at me with a smile or made me feel welcome in the slightest. These woman look at you and judge you, they didn’t even talk to me before I felt like I wanted to run out of that building. I just wish I had read reviews before giving them my money.", "pics": null, "resp": {"time": 1582924708391, "text": "Juli,  thanks for sharing your feedback. I am sorry your experience didn’t match your expectations. Your feedback will help us improve. Please feel free to reach out to our Patient Relations department (833) 921-1811 with any further comments, concerns, or suggestions you wish to share.\nKindly,\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "115186632278001103758", "name": "Ingrid Hartman", "time": 1555342724085, "rating": 5.0, "text": "My family’s experience has always great!  The location is convenient, the medical staff thorough and the clinicians spend the time needed. Thank you!", "pics": null, "resp": {"time": 1556111097279, "text": "Hi, Ingrid! Thank you for the five-star review. It is our goal to deliver the utmost in care to our patients and their families so they can live their best lives."}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "116630874358668399189", "name": "Christa Bailey", "time": 1519248559272, "rating": 1.0, "text": "People who come to BayView for help have issues. I was 2 minutes late and had to check in (wait for 6 minutes in line because a computer was down and I was standing there not knowing what to do and nobody would even look at me). I was told that I was 10 minutes late and my appointment is only 20 minutes long so I could reschedule or the doctor would work me in -of course I will have a no-show fee. I have never been here and not had to wait 15 minutes to see doc-I guess it’s a one way street.", "pics": null, "resp": null, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "105519067131511202481", "name": "Samantha Wade Caraway", "time": 1513282717030, "rating": 1.0, "text": "DO NOT GO TO BAYVIEW! THESE PEOPLE DO NOT CARE ABOUT THEIR PATIENTS! They can not even file insurance correctly. If you don't agree with them, they will refuse to do ANYTHING for you. Their only option is to increase meds that do not work or put the patient in the hospital. If I could put ZERO stars, I would!", "pics": null, "resp": null, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "112670653066595001898", "name": "Richard Vin Zant", "time": 1564409121515, "rating": 1.0, "text": "Yeah worst record keeping of any business I’ve been too.", "pics": null, "resp": {"time": 1564423971258, "text": "Hi, Richard. I am sorry to hear we did not meet your expectations. Your feedback will help us improve our services. If you would like to provide any further information, please email us at info@altapointe.org\nApril"}, "gmap_id": "0x889a410b00000001:0x8d9e6ceb71550c4a"}
{"user_id": "101401463091488365266", "name": "Caitlin Shostak Lotz", "time": 1604449000814, "rating": 5.0, "text": "If you feel frustrated and misunderstood by \"most\" therapists, I would highly recommend Joel. He has a sixth sense for understanding people and the ability to tap into the best thing about them. I have the privilege of knowing Joel personally. I can attest that he is truly a brilliant, imaginative and original thinker.", "pics": null, "resp": null, "gmap_id": "0x888923adc678bfab:0xdad6ae4991d7f84"}
{"user_id": "110551372072775998996", "name": "Caleb Young", "time": 1604274844925, "rating": 5.0, "text": "Joel is such a warm, witty and compassionate human being. Anyone seeking a therapist that will truly see you as a person can stop searching cause you’ve find him. 5/5 and I actively recommend to friends and family.", "pics": null, "resp": null, "gmap_id": "0x888923adc678bfab:0xdad6ae4991d7f84"}
{"user_id": "111754692598250517577", "name": "Andy Philpo", "time": 1604447688129, "rating": 5.0, "text": "Joel is an insightful and intelligent human being who you can trust to help you process and understand the complexities of your inner self. Come away deeper self knowledge and self mastery, which in turn leads you to a more peaceful life and more fulfilling personal or professional relationships.", "pics": null, "resp": null, "gmap_id": "0x888923adc678bfab:0xdad6ae4991d7f84"}
{"user_id": "116095332748781822715", "name": "Andrew Lotz", "time": 1604340442403, "rating": 5.0, "text": "Joel is the most empathetic and intelligent person I know. He has an uncanny ability to understand people. If you need someone to really \"get you,\" this is the place.", "pics": null, "resp": null, "gmap_id": "0x888923adc678bfab:0xdad6ae4991d7f84"}
{"user_id": "110752602716911747089", "name": "Wil Heflin", "time": 1605014339406, "rating": 5.0, "text": "Joel Blackstock is a talented, kind, and empathetic therapist. He is clearly passionate about helping others and wants the best for his clients’ outcomes. He is trained in EMDR to help with ptsd and incorporates it along with his years of experience into the process.", "pics": null, "resp": null, "gmap_id": "0x888923adc678bfab:0xdad6ae4991d7f84"}
{"user_id": "100081884310488998451", "name": "Jonathan Chesney", "time": 1604336292032, "rating": 5.0, "text": "Joel is thoughtful, curious, insightful, well-trained, and cares deeply about people in general and his patients health and well-being  in specific.  If you’ve been considering therapy and counseling, or just need to talk to someone about how those things might help, I recommend giving him a try!", "pics": null, "resp": null, "gmap_id": "0x888923adc678bfab:0xdad6ae4991d7f84"}
{"user_id": "114591756848061077487", "name": "Thomas Kozak", "time": 1605224610552, "rating": 5.0, "text": "No pre-formed assumptions here.  Joel Blackstock meets you where you're at, and he responds to the unique nuances of every individual.", "pics": null, "resp": null, "gmap_id": "0x888923adc678bfab:0xdad6ae4991d7f84"}
{"user_id": "107229534905348654712", "name": "Teria Fuller", "time": 1604442469901, "rating": 5.0, "text": "Joel is extremely trustworthy.   I feel free to talk with him about anything and not be judged.", "pics": null, "resp": null, "gmap_id": "0x888923adc678bfab:0xdad6ae4991d7f84"}
{"user_id": "112170407211726858750", "name": "Rhonda Hand", "time": 1628627600892, "rating": 5.0, "text": "I took my Son for his first visit at North Alabama Family Psychiatrist & Counseling, and we were pleased with the overall experience. The Office was very secure with intercom check-in in the hallway. I liked that! It made us feel safe as no one could just walk into the facility without permission. The Office was very clean & had a pleasant & soothing vibe. The check-in was easy and the front office staff was very nice. We were met at the window by Heather, who checked him in. She was very professional & had a warm and caring smile with a positive attitude.  Amber was super nice, very friendly with a great smile and helped take the edge off our nervousness. My Son saw Katy & really liked her! Katy was a good fit for him as she was easy to talk to, made him\nfeel comfortable & showed a great concern in helping him get better. To this Momma’s heart that means so much! He’s looking forward to his next visit. I’m glad we found this place! The future for my Som just got a lot brighter .", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "118159312958469614638", "name": "That Girl", "time": 1623858879721, "rating": 5.0, "text": "Amazing doctors and staff. Medical staff seems to actually listen and care about patients, which sadly is a rarity in my experience. Works with you to find the best treatment plan and ensures you are comfortable with it. Very short wait times. Overall great place that I definitely recommend.\nEdited to add: I see Katy Frazier who is amazing and have never had problems with the front office staff like many reviews state. I have been going to the practice since spring 2020.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "108230612451641665339", "name": "abigail johnson", "time": 1618258059308, "rating": 5.0, "text": "I WILL HIGHLY RECOMMEND KATY FRAZIER. As someone who was anxious about talking to a professional about my anxiety and my hardest issues - she helps a lot and she is so patient and you can tell she just genuinely cares. I really appreciate how attentive she is and how I feel like I can openly talk without being judged. So- if you need a professional, she’s very very easy to talk to.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "117210929776059217154", "name": "Judith Jones", "time": 1623417487197, "rating": 5.0, "text": "Dr. Wilson is very kind and easy to work with.   She listens to my concerns before responding.   In addition, the front office staff with whom I have interfaced have been kind, responsive, and helpful.   Thank you.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "114713975304274332020", "name": "Heather Martin", "time": 1623251114721, "rating": 5.0, "text": "NP Angela Waldron is extremely in tuned to your needs while providing excellent care!  Angela listens to hear while setting an atmosphere that is comfortable/relaxing.  I highly recommend NP Angela!", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "100639373015448462244", "name": "Courtney Williams", "time": 1616528975632, "rating": 5.0, "text": "I see Angela (nurse practitioner) and she is awesome. She’s very attentive to my needs and what is going to help me feel better. She also makes you laugh and just seems like she genuinely cares what medications are going to help your specific needs. I’m very happy so far!", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "110804824023013706794", "name": "Felicia Fletcher", "time": 1617383568312, "rating": 5.0, "text": "I met with Katy Frazier. She is great! I felt like she understood me. And I was very comfortable talking to her. I would recommend her to anyone!", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "105207476537560930150", "name": "Joshua Evans", "time": 1618251806402, "rating": 1.0, "text": "The office staff is not professional. At least 2 members of the office staff are argumentative, and lack the general professionalism one would expect from a convenience store clerk much less a family psychiatry and counseling center. Those individuals should not be allowed to interact with patients as their combative nature can lead to a compromised metal state in the very patients they proclaim to “treat.”", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "113061884349258616109", "name": "Victoria Ahrendsen", "time": 1618356154689, "rating": 5.0, "text": "Today I had my first appointment w/ Katy Frazier, and she was very kind & understanding. The staff was also friendly. I’d recommend this practice to those of you who are seeking a psychiatric medical provider.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "107566784011872562930", "name": "Lissette Lopez", "time": 1615236990280, "rating": 2.0, "text": "Seeking help for mental health or behavioral health matters it’s hard to begin with. But then calling in for an appointment and getting someone with a negative attitude on the other End of the line Makes this process harder And dreadful. Which it should simply not be this way. We need more sensible and understanding staff members at these practices. We need people in these offices to care about this type of work and to be understanding of how the person Calling in feels or the situation that they may be in so that they can receive the help they need.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "115209797684850870987", "name": "Suprenia Waddle", "time": 1614577140291, "rating": 5.0, "text": "Mrs. Bell is UBER AWESOME !!\n\nWords alone can’t fully express my heartfelt gratitude for your kindness and unconditional support you have shown me. I can finally see there is light at the end of the tunnel.  Thanks to you, I’m on my way back to “happyville” and feeling that I belong among the stars. You have been a blessing in my life. You are that silver lining behind the cloud. When I was ready to throw in the towel, you gave me strength and encouragement to keep moving forward. Thanks for being very attentive over the past six months, I feel the recovery has begun.  I appreciate the positive contributions you are making in my life.  Your advice and guidance is on point and it’s helping me to think through my situation(s) one day at a time.  Your EXPERTISE is teaching/helping me to laugh through my pain. I really appreciate you, you are All that and then some!! I enjoy laughing with you.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "103258198904763454700", "name": "Austin Ball", "time": 1622748786306, "rating": 3.0, "text": "Katy Frasier is unbelievable ! She has helped me so much and continues to improve my mental health. But I am  continually disappointed in the office staff. I wish they appeared to care about the people that enter their office. God bless!", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "107580595563101558838", "name": "Kai K", "time": 1608595803312, "rating": 4.0, "text": "The actual trained medical staff are wonderful and really care. The front staff can be a little difficult with scheduling and calling you but overall it's a good experience to go. I recommend Katie Frazier! She is absolutely amazing and you can really tell she cares and thinks about you.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "101151635255903102379", "name": "Jim Williams (CenterFade)", "time": 1616686105270, "rating": 5.0, "text": "Katy is great.  Easy to talk to and seems very interested as a person and not just a patient. Would recommend to anyone.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "102916180532207400637", "name": "Lyfe LLC", "time": 1616538750399, "rating": 5.0, "text": "My first experience was wonderful. Dr. Wilson was very patient, professional, attentive, and caring.\n\nI would recommebd this practice for anyone looking for a practice specializing in their modalities.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "109114250334361267263", "name": "Stacey Gardner", "time": 1615319140348, "rating": 1.0, "text": "The office is terrible. Made several attempts over weeks to get an initial appointment. The provider (Katy Frazier) was awesome and the only reason I will continue to use this place. However, I have had several questions and concerns and have called 3 ..yes THREE times over the past 2 weeks. I've spoken with an office member once, said that I'll receive a return call within 48 hours. That did not happen, I called back and left voicemail. They ask you not to leave multiple voicemails so after 1 week I left yet another voicemail with no return. It's a shame. It is in no way reflective of the provider. I am concerned for the well-being of many of their patients if it is this difficult to get ahold of someone.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "102289948176389162676", "name": "TeMia Pride", "time": 1611985420268, "rating": 5.0, "text": "Doris Bell is amazing! Was hesitant on going to counseling after a very traumatic experience in my life, but Ms. Doris made me feel right at home from day 1. I am truly thankful for her!", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "111497510722839963730", "name": "A Google User", "time": 1617396732202, "rating": 3.0, "text": "ok, um, i enjoyed the overall experience, and for a presumably cisgendered office, i think they almost made me feel not uncomfortable. now, some things can’t be helped, like my legal name and the way i present as feminine. however, i don’t like the fact that behind my back my psychologist was disregarding my feelings and being downright disrespectful and not understanding of my thoughts while speaking to my mom. eh, what can i say. transphobia is a disease well hidden. that’s all the negative connotations i have. -1 star for transphobia, -1 star for dishonesty.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "115144353473315488036", "name": "Savannah Pearce", "time": 1616511319271, "rating": 4.0, "text": "Katy Frazier is the only reason I will continue going to this place. She's absolutely amazing with what she does.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "110385886281852989540", "name": "Bethany Adkins", "time": 1609428954606, "rating": 5.0, "text": "This place has been a godsend. My psychiatrist Dr. Wilson is amazing and the new receptionist is so nice and makes me feel welcome. Highly recommend", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "101801179332731346189", "name": "Joe Whitaker", "time": 1614024709663, "rating": 5.0, "text": "Angela is awsome, I always feel so much better after talking to her. The office is very clean and comfortable also. I highly recomend this place.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "117530439054375282520", "name": "Kelly Haynes", "time": 1605895369667, "rating": 5.0, "text": "I have had nothing short of an amazing experience with Dr. Wilson. She is attentive to my needs and has helped me to take steps to become better with my mental health. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "116635477288048031145", "name": "Travis Grossheim", "time": 1612888071463, "rating": 5.0, "text": "I love they're counseling. I felt very welcomed to talk about my feelings", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "115111480920628507996", "name": "Yahta Kels", "time": 1612913551017, "rating": 5.0, "text": "ALL THE LADIES AT THE FRONT DESK SUPER DUPER ROCK!!!!!\n\nNurse Practioner Angela Waldrop is the most awesome there is. Garuanteed  to have a wonderful  experience. Either way, this is a great organization. Some very wonderful people.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "109844380614834051833", "name": "Nicole Kornegay", "time": 1611181224477, "rating": 2.0, "text": "I love my counselors and therapists. The front desk leaves something to be desired. She is very unfriendly and makes it difficult to get/give messages. I've also had trouble scheduling appointments because she doesn't seem like she wants to be bothered.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "101142103761901228187", "name": "Terry Ann Kelsoe", "time": 1602772865060, "rating": 5.0, "text": "Dr.Anika Wilson is very easy to engage with. Kind, understanding, and compassionate. I've been to three psychiatrists before Dr. Wilson. Dr.Wilson has helped me more than anyone else. The office staff is professional, kind, and courteous. They have gone above and beyond keeping the facility sterile, and pleasant during the COVID 19. The office staff is faithful to send you reminders of your upcoming appointments. I give them all 5 ⭐.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "101371940474726603715", "name": "Sonia Payne", "time": 1607637354676, "rating": 5.0, "text": "Great experience. Always very attentive of my needs. I appreciate the helpfulness of the doctor and staff.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "113010665705766268733", "name": "Megan Lewallen", "time": 1609434502310, "rating": 5.0, "text": "I really enjoy going to North Alabama Family Psychiatrist. I’ve seen Dr. Wilson for years and highly recommend her and her practice!", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "109102838664448198602", "name": "Andre Lenoir Jr", "time": 1596209035882, "rating": 5.0, "text": "Dr. Anika Wilson is a very profound and thoughtful professional. Dr Anika Wilson seeks to help in the areas that are commonly overlooked based on personal needs. Her direction is clear, precise and progressive. The Staff that within that network/ facility are very patient, informative and supportive. The amount of encouragement by The Team built there is commendable and well organized. Within the best of their abilities/efforts they provide detailed instructions and emphasize the empathy they have for their patients. I am very fortunate to be in their care. They truly believe in the well being of their community. Thank You.\nAndre’", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "118313501356912648469", "name": "Jacqueline Reaves", "time": 1622668531578, "rating": 5.0, "text": "Angela always provides outstanding service", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "110982804951246516339", "name": "Jane Craig", "time": 1611940511457, "rating": 5.0, "text": "The people there are caring and compassionate. Angela Waldrop is the best!!!", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "104599630648397544601", "name": "Cheryl McCoy", "time": 1599837521308, "rating": 5.0, "text": "They are very professional, helpful, and discreet.  The office staff is so nice and personable. And my doctor is really interested in me and making sure I get better.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "107107495463591077498", "name": "Diana Johnson", "time": 1620056656522, "rating": 5.0, "text": "They’re very professional they’re taking extra precautions with COVID-19! I feel they listen to me and my issues and they actually care about my mental health!", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "101676465514958629510", "name": "Mary Headley", "time": 1596919484733, "rating": 5.0, "text": "Words cannot express how grateful I am for this office. Heather Love answered our call when we were in a crisis and worked us in. We saw Angela Waldrop CRNP and she is the best. I highly recommend their services. Thank you so much for all you do!", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "111784782004841828209", "name": "Keshun Morgan", "time": 1596078347303, "rating": 5.0, "text": "My son has been patient there for years and consistently we have seen dramatic improvement.  Dr Wilson has the perfect balance as it relates to professionalism, personality, and genuine care for her patients.  As a bonus she is a GREAT psychiatrist...I trust her judgement and recommendations unequivocally.  If I can trust her with my son...you can to.  Thank you Dr Wilson and the NAFPC team!!!", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "109843714089510617815", "name": "Zoe Terry", "time": 1596153016032, "rating": 5.0, "text": "It’s a very welcoming environment. Dr.Wilson is an amazing doctor. She’s changed my life!", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "115444840454094213507", "name": "Chris Amos", "time": 1615313028399, "rating": 5.0, "text": "Very professional, friendly and thorough 😊👍", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "113121288336562451163", "name": "Lynda Smith", "time": 1615392530760, "rating": 5.0, "text": "Awesome very caring and understanding.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "115555663134919470674", "name": "Melissa Kelly", "time": 1568814476763, "rating": 1.0, "text": "If I could give negative stars, I would. This place used to be great. I saw both Harmony Rose (NP) and James Taylor (LPC), and they were both great. I will continue to see James at his new location, and will be going elsewhere to replace Harmony who moved out of state. The office staff used to be really organized. However, there has been a lot of changes and turnover. As a result, the people are completely incompetent. I showed up for my last two appointments as written on my appointment cards just to find out that they didn't have me in the system for an appointment. The lady who helped me was the same each time, and she had the guts to tell me to make sure it was written on a card next time (WHICH SHE DID THE LAST TIME!!!!!). They also randomly started filing my insurance wrong, resulting in a copay that I had never had before. Despite bringing this up multiple times (including pointing out that my insurance said that the claims needed to be refiled and the provider had been notified), the claims have not been refiled, they continue to charge me a copay, and I haven't gotten my money back. I hate just how terrible this place has become considering how much I loved going there before.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "115007931018736247008", "name": "Aryn Philip", "time": 1563568663606, "rating": 5.0, "text": "Dr. Rose was amazing to meet with. She listened so intently and was so sweet, patient, and kind. You could tell she really cared about my treatment. I'm so happy I made my appointment.\n\nI will say that the people at the front desk could be a bit more personable, but that is a very minor note. Also, no food or drink is allowed, which is kind of a bummer!", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "117641755571370604616", "name": "Megan Determan", "time": 1594832425123, "rating": 5.0, "text": "Everyone at this clinic has taken excellent care of my children. They are amazing!", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "102928922618189536490", "name": "Petrina Allen", "time": 1595437938900, "rating": 5.0, "text": "I enjoyed talking to the NP she was very helpful and understanding of my needs and concerns.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "103575240032055986127", "name": "Kendra Castillo", "time": 1594405044582, "rating": 5.0, "text": "Dr Geist is very knowledgeable and professional! Would highly recommend this office.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "105980586853161807374", "name": "Sarah Hymas", "time": 1600887929919, "rating": 5.0, "text": "We have been seeing Dr Wilson for several years. She is a great listener and is persistent in solving problems/adjusting meds to ease our son’s difficult challenges. We are so glad we found Dr Wilson!", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "103030187312332756400", "name": "LASHAY WATWOOD", "time": 1572378824363, "rating": 5.0, "text": "They have the best customer service in Madison. I left my old clinic due to the rude customer service. However, the lady that helps me when I go in is the absolute BEST. If I recall correctly her name is Amber. She is amazing.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "110305448578002149187", "name": "Gina F.", "time": 1567627243716, "rating": 1.0, "text": "The first woman I met with had great bedside manners and seemed to genuinely care about my well being. When she left the practice I was asked if I wanted to see Dr. Wilson. I said \"yes\", expecting a similar experience. What I received was someone who seemed cold and somewhat callus. I tend to get very emotional when I talk about my past and my depression, but I did not feel comfortable or safe in her presence at all which only exacerbated the issue. She prescribed a medication that almost put me in the hospital. She was condescending and rude whenever I questioned her diagnosis. After a few sessions, I called to cancel my next appointment. Not a single person from that office called to check on me whatsoever since that time. It really showed me how much I and my well being meant to them.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "104624084478254364503", "name": "Ronald Price", "time": 1594407675720, "rating": 5.0, "text": "Outstanding Dr and staff. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "101676690013869444876", "name": "Mallory Jackson", "time": 1566511850226, "rating": 5.0, "text": "I have loved this practice since I came to them over a year ago. Dr. Wilson has changed my life and some days I wonder if I would still be here if it weren't for her.  The pracitce is growing and for good reason! Sometimes businesses go through growing pains and I could tell this had happened today at my appointment. Somehow I was not on the schedule, which has never happened before. But Dr. Wilson took the time to see me and was so attentive. She made it right even though someone else  made a mistake (someone that no longer even works there). Another reason I will continue to use Dr. Wilson as long as I can. I can not stress how amazing she is!", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "112948458576449056154", "name": "shone Tapscott", "time": 1572492116513, "rating": 5.0, "text": "I like Dr. Wilson and her staff.\nShe was very friendly to me and really seemed caring.\nHer Front office staff is the best staff she has had since I been there as a patient. Thank you to NALfPC.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "108802925500500120215", "name": "Kahlo Paints", "time": 1581091254402, "rating": 1.0, "text": "Dr. Wilson is the opposite of what someone in mental health care should be.  She is cold, distant and uncaring.  She cut me off when I would try to explain my problems and I could tell she was irritated if I tried to ask her questions about my treatment.  The office staff won't return your calls, they are rude and if they can find a reason to charge you for something, they will. Beware, this place made me worse, not better.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "113559384980024855729", "name": "Stacy t", "time": 1567000510960, "rating": 1.0, "text": "I couldn’t rate this a zero so a 1 will do. In truth I couldn’t even get to an appointment , this is all based on just getting started . I called and made an appointment a few weeks back . Unfortunately I have to have surgery, and had to reschedule . My appointment ( made in Aug) was for Sept, upon calling and being placed on hold not once but twice for over 10 min I called back and the first time had to leave a message ( no one returned my call), the second time I finally got someone , and was told it would be now 2 more months to be seen ! Obviously this practice is too big with not enough help, for how does extending by months help a patient ?!? I told them forget it , cancel the appointment I will find someone else. So based upon this , I wouldn’t go here .. they don’t care , they just put you on a never ending hold and hope you’ll go away ...", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "108453376724276166921", "name": "H Luthy", "time": 1492697961640, "rating": 4.0, "text": "We are new to Dr. Wilson's practice but have been very happy so far. She is upfront, explains her thoughts and recommendations and takes our intuition and experience into consideration. While she is very pleasant and polite, she isn't super warm and cuddly. But we aren't there for a best friend we are looking for someone to make professional and non-emotional decisions regarding the care of the situation.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "102793440546781822263", "name": "Kristen Gaufin", "time": 1582041714213, "rating": 1.0, "text": "I am extremely disappointed with my experience here. I had my son tested for ADHD with Dr. Geist and the cost was grossly underestimated. I was told it would be $600 w/o insurance but continue to receive bills in excess of that. In addition, I was charged an additional $150 just to spend 5 minutes going over the results, all without informing me first. Seems like an unethical way to do business. Testing should come with results and if for some reason you see fit to bill them separately, you have an obligation to inform the client FIRST.\n\nI was also unimpressed with Dr. Wilson when taking my 10 year old in to be evaluated. She hardly looked at him, spent most of her time typing away on her computer, and then sent us on our way with a prescription I did not want.\n\nI will not be returning to this office and would urge others to seek services elsewhere.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "104340050388946700245", "name": "Steve Trent", "time": 1548112462263, "rating": 1.0, "text": "Don’t come here unless you want them to bleed you dry. I received improperly labeled appointment cards TWICE, which they’re charging me $120 for and did not receive the text appointment notifications I signed up for both times either. I would call to confirm appointment times not only to receive their voicemail, but to never receive a callback when I left a message. I’m on a maintenance dose of my medicine yet they won’t write refills unless I come in and pay $30 every month. DO NOT COME HERE. I would give them 0 stars if I could.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "108731238983845934378", "name": "Jeff Bourland", "time": 1544463609310, "rating": 5.0, "text": "As someone who has a chronic illness, I have had a hard time finding a psychiatrist that was understanding of the emotional problems that living with a illness poses. Dr. Wilson was the psychiatrist I had been looking for. She was not only knowledgeable but committed, on day one, to aggressively get my emotional problems under control. She is someone who gets the job done and is fully committed to your needs. I feel very fortunate to have found her and am grateful for her services.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "115178142145291545287", "name": "Amy P", "time": 1571966697610, "rating": 5.0, "text": "I understand why some people have given negative reviews. There seems to have been a lot of changes recently and I assume they are for the better. They do seem to be understaffed, but are working on the issue.\n\nI receive Nuerostar TMS treatments from Dr. Wilson. They have changed my life! I don’t remember a time in my life when I didn’t struggle with depression and have tried many medications over the past 15 years with no real improvement, until TMS. I am “officially” in remission from depression, I honestly didn’t think that was possible!!!! To me, the fact that they offer a treatment with little to no side affects that actually works is a life changer.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "113557165085344401541", "name": "Jacob Torrence", "time": 1519480760384, "rating": 5.0, "text": "Dr. Wilson is exactly the sort of person that I think should be doing this kind of practice. Several reviews mention her reserved personality and say that this is a negative trait, but those who suffer from mental illness don't always need someone who just agrees with them to make them feel better in the short term. The motivation to change never comes from staying in a place of comfort. Dr. Wilson is the kind of person who will be blunt enough to keep your attention while she tells you what needs to be done.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "105284791574957290106", "name": "carston truumees", "time": 1550674409511, "rating": 5.0, "text": "Loved dr.wilson! Way better then nova center in Huntsville", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "117871087613108379798", "name": "Iggy Tate", "time": 1545402081232, "rating": 5.0, "text": "Harmony Rose is wonderful. I highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "103795970459736821686", "name": "Sandra Carlton", "time": 1534953782523, "rating": 1.0, "text": "This dr, has no care for her patients,she’s mixed drugs that should had been avoided being used together. Never called me when I left a message stating I was going off of a medication due to side effects as well.\n.Seems she’s in it for the money. Just doesn’t seem to care. Pushy. I don’t recommend her in my opinion.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "118399895969193515641", "name": "Jackie Burruss", "time": 1607645081099, "rating": 5.0, "text": "Everybody was very  professional and kind", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "106161952954966908984", "name": "Jana Pettus", "time": 1492004758627, "rating": 4.0, "text": "I think she's great. She doesn't coddle her patients or waste my time. She listens to me when I tell her my medication preferences, and I've been doing great on her medication suggestions.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "111813709736072032841", "name": "Brandi Key", "time": 1497016684882, "rating": 5.0, "text": "I've been seeing Dr. Wilson for approximately two years now and I have not been dissatisfied. At first, I was put off by her reserved demeanor but as someone else said, she is not there to be my new BFF. Once you have seen her a couple of times, she does become a \"real person\". Also, at first, I felt she was very quick to prescribe meds but then again, she is a psychiatrist and that is how psychiatrist do their part of mental health. I only have two issues with the practice; she tends to run late and they are very very strict about their cancellation policy. I can understand the need for it but they should also realize that emergencies happen in life. If an emergency happened on her part, we don't get a free session out of it so why are the patients given the same leeway at least once or twice a year? It is my understanding that this is the practice's policy and not Dr. Wilson's, so I can't fault her but it is a hassle to pay the late cancellation fee when the cancellation was unavoidable.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "117808303103208234734", "name": "Gina Gonzalez", "time": 1567553296833, "rating": 1.0, "text": "Dr. Wilson does not have you’re best interests at heart. She is harsh, uncaring and bordering on hateful. Beware.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "116940556063993710978", "name": "Jenniffer Olvera", "time": 1595993650534, "rating": 1.0, "text": "Horrible place, do not go there!!!!!", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "115728954143788968704", "name": "Katie D.", "time": 1488593371476, "rating": 1.0, "text": "Similarly to others, I've been seeing her for 3+ years with no improvement or results. She prescribed a plethora of medications that at times caused suicidal ideation. Wilson responded poorly to my worse times with lack of empathy or care. It has been like walking on eggshells because she is flippant. She guilt-trips you into staying as her patient and told me I would never get off medication. I would NOT recommend this psychiatrist.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "110182095982500745025", "name": "Mariah Faith", "time": 1486663970249, "rating": 1.0, "text": "She has bad bedside manners and gave me the wrong diagnosis for years. Put me on medication that made me suicidal and told me if I stopped taking it she wouldn't see me as a patient any longer.", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "106532845583021204637", "name": "Julie Cronan", "time": 1582954191230, "rating": 4.0, "text": "Great doctors and staff", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "100166886712155267032", "name": "Elizabeth Vance", "time": 1539178656715, "rating": 1.0, "text": "before using this place please check reviews front staff are rude and unprofessional they even over charge my card without permission my child was also being over medicated and was told she was bipolar with out even letting me know please do your homework before you come to this place", "pics": null, "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "117735409421225114101", "name": "Kathy Basham", "time": 1603019153368, "rating": 1.0, "text": "(Translated by Google) Tell me whatsapp is from the Universidad de los Andes and the 134lauerl llane\n\n(Original)\nTell me whatsapp is de la Universidad de los Andes y el 134lauerl llane", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOGlKY833ppMk9QOq6LGj59dbdcqDhrYl7maGij=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626f7c205d861d:0xb07ff2fc1c202a20"}
{"user_id": "101144705737896904787", "name": "Jennifer Hughes", "time": 1612841144180, "rating": 5.0, "text": "I had a really great experience here. Ashley at the front desk was so nice and made me feel welcomed as soon as I walked into the office. I love that they are open until 8pm so that I can easily schedule an appointment after work. Dr. \"Chili\" was great as well. He made me feel like he was really listening to me and I felt like he really put some thought into what medication would be best for me. He thoroughly explained what the medication was and what the possible side effects could be. This was the best experience I have ever had with a doctor before.", "pics": null, "resp": {"time": 1613913618931, "text": "Thank you for your kind review."}, "gmap_id": "0x8889198e5cf8c3c5:0x1e5ca6fcd1b81a6a"}
{"user_id": "106201350163575864670", "name": "Jonas B.", "time": 1610979810081, "rating": 5.0, "text": "I called, and I was treated professionally and I was able to get seen very quickly.  I would recommend.", "pics": null, "resp": null, "gmap_id": "0x8889198e5cf8c3c5:0x1e5ca6fcd1b81a6a"}
{"user_id": "111503701243813437628", "name": "XwingSports", "time": 1627586060055, "rating": 1.0, "text": "Never answer the phone", "pics": null, "resp": {"time": 1627590025282, "text": "Would you like us to call you?"}, "gmap_id": "0x888bb3e606612683:0x610c799c99fe3f08"}
{"user_id": "106201350163575864670", "name": "Jonas B.", "time": 1609193542385, "rating": 5.0, "text": "I really appreciate the time Dr. Falola spent with me.  I will be back.", "pics": null, "resp": null, "gmap_id": "0x888bb3e606612683:0x610c799c99fe3f08"}
{"user_id": "102023825203178679551", "name": "Parker Allen", "time": 1628275333167, "rating": 1.0, "text": "I have been with them for over a year, almost every time I have to refill my meds it's a literal nightmare. They mess up the meds order in every way you can think of, it's always the same too. The med is incorrect, not the right amount and takes at least a weak to even fix the issue. I'm finding a different one, because this is just nothing but a big inconvenience.", "pics": null, "resp": {"time": 1628515986906, "text": "I am sorry to hear about your experience, if you would provide me with your contact information I would be happy to discuss this situation with you to find a reasonable resolution. you can email me at psychalabama@gmail.com"}, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "108267612549273913536", "name": "Chalis Love", "time": 1620328255150, "rating": 1.0, "text": "Unfortunately I did not have a great experience with my \"therapist\". Wish I could say better , I was meeting with Pamela Callaghan for therapy, I had missed a scheduled visit and received a NOT SO HAPPY call from Pamela, she stated she wish I would have called the office to cancel instead of missing the virtual appointment I told her I wanted to pay for my previous bill first to which she replied \" Are you still working?\" I answered yes. She asked if I was still taking medication i replied yes for anxiety and she said \" SOUNDS LIKE YOU NEED ANTIDEPRESSANTS\" . Its nice to know if your at work and miss a virtual visit with your therapist you will be judged and labeled depressed with no Apology. Would not recommend.", "pics": null, "resp": {"time": 1620329231497, "text": "I am very sorry to hear about your experience, would you like a call from the manager?"}, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "112119368772042764634", "name": "Lisa Hallmon", "time": 1626644794787, "rating": 1.0, "text": "I wouldn’t even give one star. My mom was admitted to Shelby Hospital for psychological reasons. She could walk and talk before entering. After being put on extreme medication from Alabama Psychiatry facility, my mother couldn’t talk nor walk. She has been in the hospital now for over a month. She is finally talking and her mind is coming back slowly. She still can not walk. She has been to 3 hospitals where they said my mother was highly over medicated and she has Parkinsonism from way to much antipsychotic medication. Alabama Psychiatry Doctors put her on all them. This has been so hard. I am now dealing with depression and stress as well over all of this. Do not let your loved ones go to this place! They will way over medicate. I also had spoke to the doctor about feeling that my mom was way over medicated and she just Dropped her down one dose but then added an antidepressant.  It’s been a complete change in my moms life. A horrible change!!! Another hospital is trying to get her medication corrected where hopefully she will be able to get back to normal and walk again", "pics": null, "resp": null, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "111165048329135516570", "name": "Bree B", "time": 1623436038521, "rating": 5.0, "text": "Dr. Chowhurdy is an angel. I have been seeing psychiatrist for ten years, and she is the first I’ve felt truly comfortable being open with. She saved my life, and in turn I will now be well wnough to be a wonderful mom", "pics": null, "resp": {"time": 1625169923105, "text": "Thank you for your kind review"}, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "116519008785449100443", "name": "Lana Farley", "time": 1623125778332, "rating": 5.0, "text": "I have had a awesome experience with Dr M he's listens n cares I couldn't ask for more", "pics": null, "resp": null, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "117028216936383477191", "name": "Taylor Simmons", "time": 1622551245999, "rating": 1.0, "text": "Dr. Dumas refuses to listen. She would not give me the time of day to explain my daughter's behavior. Therefore, I will no longer be taking my daughter to her.", "pics": null, "resp": {"time": 1622552146669, "text": "We apologize if we were unable to satisfactorily meet your needs,  I will notify the office manager."}, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "113573752700226286356", "name": "Kylee Pickle", "time": 1615330436104, "rating": 1.0, "text": "If it were not for the doctor I see I would certainly go somewhere else!  The front desk “girls” do not know what they are doing nor do they know how to treat people with respect and dignity.  If you have opportunity to actually get them on the phone!!  The “girls” in the billing department are not any better if not worse! They never call back when messages are left and again if you ever get them on the phone! We work just as hard as they do for pay and when insurance is filled wrong and a bill is received saying you owe a certain amount for a visit when the last two years my insurance covers 100%?  I’m going to call and question what the problem is and expect a professional to handle themselves the way they should when they work in a doctor’s office!", "pics": null, "resp": {"time": 1615339540663, "text": "I will refer this to the office manager."}, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "110856553054024789481", "name": "Nicole Kennel", "time": 1614046441604, "rating": 1.0, "text": "The providers are great when you can get in to see them. However, the entire place is useless if you need anything outside the appointment. They don't answer phone calls. Take weeks to respond to messages, and if you need paperwork filled out for any reason, they are super unhelpful. Been with them for years, but this has become there norm. I will be looking for another practice as soon as I can.", "pics": null, "resp": {"time": 1614085708041, "text": "I'm sorry that you haven't received the care that you expected, if you would like to discuss it please email me at psychalabama@gmail.com"}, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "104427518331040357811", "name": "Kenneth Larkin", "time": 1601912740254, "rating": 5.0, "text": "Dr. Chowdhury and her staff are the most caring compassionate medical professionals I have EVER had the pleasure of working with. While all the others were concerned about me having insurance and \"unable to schedule without\" this practice immediately recognized my needs and were able to see me the same day. Dr. Chowdhury took the time to listen carefully and understand what was happening and offered very effective treatment options. If you need this type of care, do NOT hesitate to reach out to these professionals. The exemplify the standards of care. I am thankful for being able to connect with them and certainly have a new \"perspective\" on my life. Thank you so very much Dr. Chowdhury", "pics": null, "resp": {"time": 1601913586418, "text": "Thank you for your kind review!"}, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "116390002289027990496", "name": "Lori chapman", "time": 1604697332992, "rating": 1.0, "text": "I have been trying to get my meds  correct for 2 months now. They are not good about sending p.a.s in. I have told them since September I have no more visits left so I can’t schedule a visit until January after speaking to aHolly several times she said I should hear back from her by Tuesday. It is Friday, and when I called the said Holly was busy they were transferring me to the nurse where nothing is done correct I go over again what has been happening she put me on hold and came back and said the dr would come back to talk to me. He did call. And at 2:50 I was send an email saying I confirmed my appointment this morning at 9:20. I never requested an appointment cause I am out of visits and they new that. Now they want money. Well they won’t get it I only receive 221.00  a month they get nothing and they have lost a patient. I would never recommend this office", "pics": null, "resp": {"time": 1604820945758, "text": "I'm sorry we've been unable to help you. Best of luck you."}, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "102075681202273935209", "name": "Brooklyn Hallman", "time": 1599229132756, "rating": 5.0, "text": "Dr. Chowdhury is great! She is always very polite and it’s clear she cares about her patients.", "pics": null, "resp": {"time": 1599241693246, "text": "Thank you for your kind review."}, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "103654819508565373448", "name": "Christina Hill", "time": 1597158326375, "rating": 5.0, "text": "I have met with Dr. Chowdhury twice virtually and she is warm and caring and listens to my concerns. You can tell that she cares about her patients. Everyone I have talked to at the office has been very helpful as well. Definitely recommend Dr. Jaria Chowdhury and this office.", "pics": null, "resp": {"time": 1597162272112, "text": "Thank you for your kind words, we appreciate the review."}, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "103075507960203686294", "name": "Bama Fan2019", "time": 1573838503444, "rating": 1.0, "text": "The Dr’s are very helpful and nice but your front office staff other than the 1 lady that I believe is new is horrific. The dark hair young lady that checked me in when I got there was just as nice and pleasant as she could be. The heavy set blond lady was VERY rude about my account talking to me in front of everyone about my balance. This is something that should be kept private. When I was leaving and trying to reschedule my next appointment I had to wait because the only person in the office was the nice young lady that checked me in. She had phones ringing and other customers checking in and no help. Finally the second lady came in with a attitude. The owner of this business needs to come in and do some house cleaning in the front office except for the dark hair young lady, she was the only bright spot of your business. Hope I never deal with the rude blond lady I think her name was Valerie or something like that. Very sad service!", "pics": null, "resp": null, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "101548094901811952622", "name": "Chris Johnston", "time": 1577762732964, "rating": 1.0, "text": "Worst place ever. The young lady at the window was very kind however, she is the only bright spot. Other were standing around talking while everyone in the lobby was standing in line. The last 3 times I have been in there your billing has been screwed up saying I owe money. I’ve learned to just bring my credit card statement with me. Service is the worst I have ever seen.", "pics": null, "resp": null, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "107492964305562385131", "name": "Jean-Paul Bootier", "time": 1584318311590, "rating": 5.0, "text": "Great staff and wonderful doctors. Never had a bad experience", "pics": null, "resp": null, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "109141121801623814479", "name": "Rhiannon Perkins", "time": 1548361478411, "rating": 1.0, "text": "This was the most disappointing experience I have ever experienced EVER! I’ve been to some sh*t doctors before but I’ve never had to deal with such idiocracy before in my life. My husband was a patient with them and has had great success so I made an appointment after hearing good reviews from him and also another family member. I made an appointment a week before and two days before they called to tell me that they had to change my doctor due to a “conflict of interest”. Meaning it was my husband’s therapist and they wanted me to see the other therapist available. I agreed and set the appointment for later in the day. The day came for my appointment and I receive a call from the therapist saying that she wouldn’t be able to see me either for the same reason even though my other family member had STOPPED seeing her. She said she would call me back after I told her to go ahead and cancel my appointment. Never received a call. I showed up at the office 30 minutes early and she asked to see me in her office where she tried to further explain the “conflict of interest” that they kept referring to. I told her I could find a place closer to home that wouldn’t turn someone away who was looking for help. If you’re thinking about going here, make sure no one you know is a patient as well. Otherwise, you might become another “conflict of interest” like me and not be told until you show up because even though they say they called you and got your voicemail. I guess actually LEAVING a voicemail is too complex. I’m not doubting their ability to help, but being turned away at the door when you want help feels like an emotional slap to the face.", "pics": null, "resp": null, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "100749994927379014478", "name": "T Farris", "time": 1563467473563, "rating": 1.0, "text": "The initial physician was great but after that downhill.  I was never told that I would have to have numerous appointments in order to get the testing completed. My appointment with the intake physician was changed 3 times and the last time was due to their issue with getting a THEIR new physician set up.  Still not sure how that is the patient's problem. All I was told was I could go elsewhere but the wait was going to be long. Not really because I was able to get into their office.  Unreal canceled everything and WILL NOT RETURN OR RECOMMEND.  If I could leave 0 stars I would.", "pics": null, "resp": null, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "116376701582373312480", "name": "Devin “Gearhog” Payne", "time": 1550264029207, "rating": 5.0, "text": "I left an extremely emotional, long, desperate email on my appointment request, and got a call back only a couple days later. The woman I spoke to was kind and genuinely concerned about my well being. She was a little absent minded but that's what I loved about her! Softly humming tunes while trying to track down information, \"talking to herself\" when she found something (\"oh! There it is!\" etc)  It made me feel at ease.\nI don't know why the reviews are so bad for this place... I've had an amazing experience so far.\nAs someone who suffers from varying mental disorders, as well as being victim to multiple emotional & sexual traumas, I find it exceptionally difficult to trust; yet I already trust Dr. LaRussa. It's such a relief to finally meet a mental health professional who can see me for who I truly am, and that I'm comfortable enough around to be myself.\nEven though he's a psychiatrist, he listened to my rambles and my talking in circles. He offered practical theories, and gave solid advice.... And he seemed to really understand me, suggesting we find a therapist to treat my PTSD. He spoke to me like I'm a human being.\n\nI've only had one appointment so far but Dr. LaRussa is sooo fantastic! He and the rest of the staff seem to genuinely care about the patients. I look forward to my next appointment with him.\nIf you're someone who's easily threatened, this man is the doctor for you! I've met so many, and none even half as compassionate as Paul LaRussa. His gentle smile alone would make anyone feel at ease.", "pics": null, "resp": null, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "108870074828168879057", "name": "ben guthrie", "time": 1547485451097, "rating": 5.0, "text": "Jennie is great! She's helped me tremendously.", "pics": null, "resp": null, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "111530196541392449591", "name": "Janice Mutchler", "time": 1545326003467, "rating": 1.0, "text": "Inefficient, no regard for customer's time. Waited over an hour to see Dr for a scheduled appointment. Another patient in the waiting room with us signed in and waited an hour and a half, asked what the problem was and only then they figured out her appointment was scheduled for the following day.", "pics": null, "resp": null, "gmap_id": "0x88892510d3a7786d:0x15ee073c7b99ccdb"}
{"user_id": "104765099707917092328", "name": "Haley Davis", "time": 1621956872037, "rating": 1.0, "text": "I went to see Dr. Bodiford for help with my ADHD and instead I was told I'm \"too smart\" to have ADHD via an IQ test, and I must only have dyscalculia instead. After going to another psychiatrist for a second opinion, I was told I absolutely have ADHD and that IQ tests are not at all a way to determine if a patient has ADHD. I went three years before seeking this second opinion, and in those three years I have struggled with my ADHD more than ever. I am so thankful for the ADHD Clinic in Hoover because Alabama Psychiatry failed me.", "pics": null, "resp": {"time": 1622214124760, "text": "We apologise if your expectations were not met.  Would you like to speak with the office manager?"}, "gmap_id": "0x888c2c064e2e7ae7:0xfc7dff3d8b1ec26a"}
{"user_id": "101612539941246506046", "name": "Lea Roberts", "time": 1608153227726, "rating": 5.0, "text": "Jacob Scott was very kind to me at a time when I needed help.   Covid caused a change in how they delivered care, but it was seemless.   Leigh Ann has been so helpful.   It is a humbling experience to need help...but they never look down on you and truly care about their patients.", "pics": null, "resp": {"time": 1608154340230, "text": "Thank you for your kind review."}, "gmap_id": "0x888c2c064e2e7ae7:0xfc7dff3d8b1ec26a"}
{"user_id": "103612768040710189985", "name": "Chason Burdick", "time": 1609790812706, "rating": 5.0, "text": "Great doctors i really have come a long way with their help they are very caring and careful  love my dr Jacob Scott hes helped me more than he knows I did leave a review that was i thought confidential listing only one issue I had then I got a termination of care letter  I love Dr Scott hes helped me through alot and I pray in his heart that he will see that I really need him and his care more than he ever would know", "pics": null, "resp": {"time": 1609789164425, "text": "Thank you for your kind review."}, "gmap_id": "0x888c2c064e2e7ae7:0xfc7dff3d8b1ec26a"}
{"user_id": "108180825179102515859", "name": "Nvision Xchange", "time": 1621761953710, "rating": 5.0, "text": "Dr. Scott saved my life. Lou East", "pics": null, "resp": null, "gmap_id": "0x888c2c064e2e7ae7:0xfc7dff3d8b1ec26a"}
{"user_id": "116342858482718585934", "name": "mandy reiter", "time": 1555333912039, "rating": 4.0, "text": "I have used this practice for awhile and absolutely love my doctor, she is fantastic! The staff has had some turn overs and sometimes it is a pain to get refills but the quality of patient care is what is important and I am completely satisfied.", "pics": null, "resp": null, "gmap_id": "0x888c2c064e2e7ae7:0xfc7dff3d8b1ec26a"}
{"user_id": "117567010809665631824", "name": "Dorothy Montgomery", "time": 1509890904802, "rating": 5.0, "text": "This place is wonderful. They are very professional and friendly. I had addiction issues. Dr.Ram was very nice and non judgmental. He was very understanding about my addiction and worked with me. I can proudly say that I am sober for 3 years and I am a totally different person. Me and my family will always be very thankful to Dr.Ram and River Region Psychiatry.Thank you Dr.Ram......", "pics": null, "resp": null, "gmap_id": "0x888c2c064e2e7ae7:0xfc7dff3d8b1ec26a"}
{"user_id": "114328910482246989385", "name": "Paul Brehm", "time": 1557268070884, "rating": 1.0, "text": "They came highly recommended by a good friend, but I can’t speak to their services or staff because they quite literally never answer their phones or return your messages. Don’t waste your time here.", "pics": null, "resp": null, "gmap_id": "0x888c2c064e2e7ae7:0xfc7dff3d8b1ec26a"}
{"user_id": "113956246453151718114", "name": "jennifer pilgrim", "time": 1570641146980, "rating": 1.0, "text": "Horrible place. If you have anxiety don't go here they will make it worse. Especially the lady who handles the prescriptions.", "pics": null, "resp": null, "gmap_id": "0x888c2c064e2e7ae7:0xfc7dff3d8b1ec26a"}
{"user_id": "110706164336508912655", "name": "Amber Worthington", "time": 1540840803749, "rating": 5.0, "text": "Only people who have helped me. Very polite and professional... Just wish they were available to answer the phones during the day.", "pics": null, "resp": null, "gmap_id": "0x888c2c064e2e7ae7:0xfc7dff3d8b1ec26a"}
{"user_id": "108503158850925705021", "name": "sarah taylor", "time": 1510548051650, "rating": 1.0, "text": "My experience there was not good. The woman upfront has an attitude, if you need a medication refill the nurse will tell you the doctor is out of the office for a week, they will bill you for a charge your not responsible for, and once you see the doctor he doesn't communicate. He was actually yawning while I was talking and showed no interest in what I had to say. He would give me more medication than needed so I wouldn't have to come back so I just stopped going. Although I had insurance and didn't do anything to anyone I guess I wasn't interesting enough to receive treatment.", "pics": null, "resp": null, "gmap_id": "0x888c2c064e2e7ae7:0xfc7dff3d8b1ec26a"}
{"user_id": "110419197665107318079", "name": "Shaneeda Staples", "time": 1524112243350, "rating": 1.0, "text": "I had to edit my review because after dealing with them for a few years, this is what my experience is.(This review is for the main office on Sydney Curve.) They don't let you know when your doctor/therapist leaves your insurance network causing you to rack up a large bill. They've forgotten me more than once, letting others go back to see the doctor before I do. Back before the old office manager left, I asked them for over a year what's going on with my daughter's copays. I couldn't get a straight answer. Their billing department has been a hot mess. Saying one thing, doing another. They let a large bill rack up and now she can't see the doctor for her meds. The doctors/therapists are great but billing and the receptionists (except Quintella) are a disgrace to anyone in customer service. I'll be so glad when they're paid off. I don't recommend them to anyone. You've been warned...", "pics": null, "resp": null, "gmap_id": "0x888c2c064e2e7ae7:0xfc7dff3d8b1ec26a"}
{"user_id": "105953377998808435580", "name": "Andrew Rolfsen", "time": 1505137661003, "rating": 1.0, "text": "This place never answers their phones, doesn't call when they cancel or reschedule your appointments, doesn't fill prescriptions on time and over bills all their clients. To say that their office manager is incompetent is to say the least.\n\nAnd lol at all the employees leaving positive reviews on google. It's a shame when your staff has to boost your review levels", "pics": null, "resp": null, "gmap_id": "0x888c2c064e2e7ae7:0xfc7dff3d8b1ec26a"}
{"user_id": "111253279839258488279", "name": "Brooke Davis", "time": 1493237316046, "rating": 5.0, "text": "Only been seeing the Dr's here for a short time, but so far everything has been great!", "pics": null, "resp": null, "gmap_id": "0x888c2c064e2e7ae7:0xfc7dff3d8b1ec26a"}
{"user_id": "113234210426172183659", "name": "Kelly Parvin", "time": 1536601699246, "rating": 1.0, "text": "The front desk is strangely unwelcoming. We attempted to receive care from our therapist when they relocated to this office. The atmosphere is toxic and our sessions were unproductive. I’ve never experienced anything like it in a therapy setting.", "pics": null, "resp": null, "gmap_id": "0x888c2c064e2e7ae7:0xfc7dff3d8b1ec26a"}
{"user_id": "114861373108840874311", "name": "tameka williams", "time": 1510517948604, "rating": 1.0, "text": "Your sessions will be discussed throughout the office instead of being kept confidential.", "pics": null, "resp": null, "gmap_id": "0x888c2c064e2e7ae7:0xfc7dff3d8b1ec26a"}
{"user_id": "108891541941383541902", "name": "Tahsin Siddique", "time": 1445776878081, "rating": 4.0, "text": "They r friendly but expensive. ..", "pics": null, "resp": null, "gmap_id": "0x888c2c064e2e7ae7:0xfc7dff3d8b1ec26a"}
{"user_id": "111877161100698890844", "name": "Yeyette Laster", "time": 1501081448997, "rating": 2.0, "text": "Megan Lealy, you are so right about the front desk clerk and there are also a couple of other people on her level which is sad.", "pics": null, "resp": null, "gmap_id": "0x888c2c064e2e7ae7:0xfc7dff3d8b1ec26a"}
{"user_id": "105226070815112038521", "name": "Sanjay Kapoor", "time": 1624303904341, "rating": 4.0, "text": "Dr. Alrefai is a nice guy, in my opinion the best psychiatrist in town. He is religiously devoted, always says things the softest and most pleasing way possible, and though the meetings are generally just him listening for 5-10 minutes and then giving you the same prescription and not truly helpful, he is very human which is a tall order for many psychiatrists lol\n\nI will say though, probably 10-20 times we called to set an appointment because I was out of medicine, not once did we get a callback. My mom was very distressed for a day or two until we could drive there each time -- a very jarring experience for her", "pics": null, "resp": null, "gmap_id": "0x88626570fb465d93:0xda42003bd5724716"}
{"user_id": "102030174663637935853", "name": "Sandy Norwood", "time": 1605146714527, "rating": 5.0, "text": "I have been going to Valley Behavioral for just over a year, it has been a life saver.  The staff are always polite and are willing to work with me scheduling appointments.  I have been seeing Keith Watts and regardless of any problems I have, he is more than willing to help me get a better perspective and I always leave laughing and feeling better.  My phone calls have always been returned.  I'm so very happy I found this office.", "pics": null, "resp": null, "gmap_id": "0x88626570fb465d93:0xda42003bd5724716"}
{"user_id": "116953285074767725594", "name": "Stephanie Nissan", "time": 1610318752885, "rating": 5.0, "text": "I'm grateful for everyone at Valley Behavior.. From the busy staff that cares, The encouragement from Phoebe Horton & the best guidance for addiction from Keith Watts.", "pics": null, "resp": null, "gmap_id": "0x88626570fb465d93:0xda42003bd5724716"}
{"user_id": "118049628119555159700", "name": "Andi Brown", "time": 1600893124265, "rating": 5.0, "text": "I am so grateful for Dr. Al and his office. Crystal checks me in each visit. She is so kind. I can see her smile even behind her mask. Dr. Al has been a God-send. He treats me as if I’m his only patient. I’m feeling so much better since coming to him. The most helpful person is Shannon. She talks to me and helps me feel better each time I visit the office. She treats me like a friend!!  I thank them all!!", "pics": null, "resp": null, "gmap_id": "0x88626570fb465d93:0xda42003bd5724716"}
{"user_id": "106362575894756769661", "name": "anonymous smith", "time": 1614699251476, "rating": 1.0, "text": "This place is the worst and deserves no stars. Very unprofessional", "pics": null, "resp": null, "gmap_id": "0x88626570fb465d93:0xda42003bd5724716"}
{"user_id": "112653080769808270384", "name": "Sean", "time": 1600889113339, "rating": 5.0, "text": "Dr. Ammar Alrefai (Dr. Al) is helpful and a pleasure to work with.  He stays current on new innovative treatment options and has a wonderful staff.  He's been taking care of me for years.", "pics": null, "resp": null, "gmap_id": "0x88626570fb465d93:0xda42003bd5724716"}
{"user_id": "104067369568084738626", "name": "Kimberly Craig", "time": 1602629302795, "rating": 5.0, "text": "I got there 30 min prior to my appt time for paperwork.   I was called back right on time to see Michelle Pratt.  She was very nice and explained her questions if I didn't quite understand.  I was in a really bad place and she talked to me, asked questions and prescribed me different meds since the ones id been taken for over a year just wasnt helping me anymore.  She expressed her concern for me and asked to see me back in 2 weeks and also set me up with a therapist.", "pics": null, "resp": null, "gmap_id": "0x88626570fb465d93:0xda42003bd5724716"}
{"user_id": "117438020897244514261", "name": "QD.", "time": 1604075109596, "rating": 1.0, "text": "Absolutely terrible. The office never calls back when scheduled and will not pick up the phone at all. Multiple messages left. No proper response. If you have any medical needs. This is not the place.", "pics": null, "resp": null, "gmap_id": "0x88626570fb465d93:0xda42003bd5724716"}
{"user_id": "109079028910914701402", "name": "Heather Addison", "time": 1573605223078, "rating": 1.0, "text": "I was getting ready to make an appointment with this doctor with all the good reviews. Then I read the one about the woman who experienced Michelle Pratt. I had to deal with her at Valley Behavioral Services. She is a horrible person! I felt traumatized by my encounter with her. She refused to approve the refills I needed to keep me from going through withdrawals and was just so hateful I left and never went back So, if she is at this doctor's office, I guess I'll have to keep looking.", "pics": null, "resp": null, "gmap_id": "0x88626570fb465d93:0xda42003bd5724716"}
{"user_id": "104901056408832244245", "name": "Sharon Fortenberry", "time": 1563470005416, "rating": 5.0, "text": "I think the person who gave a number one as a rating  was not speaking of our Dr, A.  Our Dr. A is a “he” not a “she.”  One should be very careful when giving someone a bad rating and review.  One should make sure you are evaluating the right person.  Our family is extremely happy with this physician.  He definitely has the right characteristics one needs to be a physician and especially a psychiatrist.  We have used this office and physician since 2012.  Nothing but the highest professionalism in the office and Dr. A definitely deserves a 5 star rating.  I am a retired healthcare professional and highly critical of less than standard care.  This office and physician meets the highest standards for excellence.  I hope my rating will be seen to off-set the bad rating.", "pics": null, "resp": null, "gmap_id": "0x88626570fb465d93:0xda42003bd5724716"}
{"user_id": "105310242668444260251", "name": "Haley *", "time": 1578123760112, "rating": 5.0, "text": "Dr. Alrefai is an amazing doctor! He has kept me stable for a while now and I’m feeling great! I’ve had no issues with his office staff and his office is very comforting to be in. I highly recommend Dr. Alrefai and his staff!!!", "pics": null, "resp": null, "gmap_id": "0x88626570fb465d93:0xda42003bd5724716"}
{"user_id": "117749417285041179708", "name": "garrett fairley", "time": 1569274726125, "rating": 5.0, "text": "Dr. Alrefai cares about his patients and isn’t one of those revolving door doctors who just writes a prescription and runs you out the door. He listens to you and provides treatment options to you and makes sure you understand why he suggests it and what the medicine does to help you. I recommend him highly.", "pics": null, "resp": null, "gmap_id": "0x88626570fb465d93:0xda42003bd5724716"}
{"user_id": "109151411396036241624", "name": "Bonnie Bahney", "time": 1565439448748, "rating": 5.0, "text": "There are numerous Dr. In this office, my son  saw a different dr . He has been going there almost two yrs\nThe price went from a $100.00 , last year $125. 00 now  this month to $150.00 plus pee test plus counseling, about 350 00  they are good drs.  They don't take Medicaid, so unless you make good money,( but please pay your rent first) it a very good place. My son was so much better under their care, but I can't afford it.  It is cheaper to by drugs off the street.  Good luck people, hope you can get the help you need.", "pics": null, "resp": null, "gmap_id": "0x88626570fb465d93:0xda42003bd5724716"}
{"user_id": "111372434085704169521", "name": "stacie hughes", "time": 1544108325714, "rating": 5.0, "text": "I love Dr Al! He's patient and understanding. He has not only helped me mentally but physically. I believe he has saved my life! I lost over 25 pounds, no appetite, two different doctors couldn't figure out what was wrong but Dr Al helped me and I am eating well and slowly gaining weight again! Excellent doctor! #awesome doctor!😄", "pics": null, "resp": null, "gmap_id": "0x88626570fb465d93:0xda42003bd5724716"}
{"user_id": "107719751846662137068", "name": "Jenn Sidman", "time": 1557364047789, "rating": 1.0, "text": "If I could give this place 0 stars I would. Not only is the office staff terrible but Michelle Pratt is a terrible provider. She literally treated me like I'm some white trash women off the street. Her bedside manner is atrocious, shes in the wrong line of work. We are a military family so my husband isn't usually around to watch our child for doctor appointments nor do I have any family or friends in the area to help. Well I have never been treated so poorly for bringing my baby to an appointment. How about praising Moms for seeking help when they have no support network in the area. Way to be an advocate for Moms, great job!! Oh this was all while waiting 50 minutes over my appointment time. Which is a regular occurrence when going to see her. I've gone three times now and every time I've had to wait well over an hour. I've never left a provider feeling as disrespected and upset as I did today. She doesn't know me from a hole in the wall and for her to treat me the way she did was disgusting. Do you self a favor and find a different doctors office!!!", "pics": null, "resp": null, "gmap_id": "0x88626570fb465d93:0xda42003bd5724716"}
{"user_id": "116581112385452830839", "name": "Sarah Beth", "time": 1575312832579, "rating": 4.0, "text": "I love how nice Dr Alrefai and Huda are. They really do help me with my anxiety and depression. However, with their recent change of their customer service regarding the phones, I am not so pleased on this. I can no longer talk with a person about rescheduling an appointment nor talk to anyone unless I leave a voicemail. This is super inconvienent as they have returned my calls either super late or not at all.", "pics": null, "resp": null, "gmap_id": "0x88626570fb465d93:0xda42003bd5724716"}
{"user_id": "113912443249201640486", "name": "Nicol Prochnow", "time": 1401221495090, "rating": 5.0, "text": "Dr. Alrefai was an amazing fit for me.  He was patient and thorough which is tough to find in his field.  I've had to move out of state and can't find anyone as wonderful!", "pics": null, "resp": null, "gmap_id": "0x88626570fb465d93:0xda42003bd5724716"}
{"user_id": "105248672568727724142", "name": "Jeska Lewis", "time": 1468531940237, "rating": 5.0, "text": "Great doctor, takes great care of his patients. Also no long wait times. .love him! 5 stars, hands down!", "pics": null, "resp": null, "gmap_id": "0x88626570fb465d93:0xda42003bd5724716"}
{"user_id": "113850064192271570422", "name": "KimmyBS", "time": 1374882803236, "rating": 5.0, "text": "Dr Alrefai is the BEST in his field! He is very smart and very learned. He listens and hears what you say. He is not your typical 'NUT' Psychiatrist!", "pics": null, "resp": null, "gmap_id": "0x88626570fb465d93:0xda42003bd5724716"}
{"user_id": "110803851192044044095", "name": "Rachel S", "time": 1550781810545, "rating": 1.0, "text": "The girl that called me back about an appointment was so incredibly rude that I had to tell her I didn’t want to be seen by the doctor because of her attitude. Dr Alrefai if these are the people answering your phones I don’t know how you keep patients.", "pics": null, "resp": null, "gmap_id": "0x88626570fb465d93:0xda42003bd5724716"}
{"user_id": "111538295303884310499", "name": "Jennifer McClure", "time": 1503957930550, "rating": 5.0, "text": "Very polite, caring ppl", "pics": null, "resp": null, "gmap_id": "0x88626570fb465d93:0xda42003bd5724716"}
{"user_id": "110778038728641081385", "name": "Deborah Cazalas", "time": 1538666612718, "rating": 5.0, "text": "Been seeing Dr. Al for awhile, I never want to change doctors.", "pics": null, "resp": null, "gmap_id": "0x88626570fb465d93:0xda42003bd5724716"}
{"user_id": "116634549778355755725", "name": "Melissa Dean", "time": 1533034926009, "rating": 5.0, "text": "He listens, does his job and makes me laugh.", "pics": null, "resp": null, "gmap_id": "0x88626570fb465d93:0xda42003bd5724716"}
{"user_id": "100328921840068729934", "name": "Nita Jones", "time": 1517856440916, "rating": 5.0, "text": "Best Doc ever", "pics": null, "resp": null, "gmap_id": "0x88626570fb465d93:0xda42003bd5724716"}
{"user_id": "116637580970983700389", "name": "Patrick Bezotte (P.M Bezy)", "time": 1620654219226, "rating": 5.0, "text": "I was reading the negative reviewes on here and they are completely frivolous and ignorant if I do say so my self the staff are awesome very helpful and genuinely care as well as the doctor.  She is a very good doctor going out of her way ,above and beyond ,helping every person matters to her  and the staff as well. They do take insurance as you should well know not all insurance is accepted in any doctor's office and for the first negative review I read I am completely appalled at the ignorance of her review sickening really. I hope you give them a chance I have no doubt you will be anything but cared for with the utmost respect and compassion. As long as you are honest and have a genuine problem they will do everything they can to help you on your way to recovery if possible.", "pics": null, "resp": null, "gmap_id": "0x888a02b88099ac33:0x7536c11acb9ab3"}
{"user_id": "104672589967968176698", "name": "Douglas George", "time": 1620737526103, "rating": 5.0, "text": "Dr. Lachlan truly cares about the well being of her patients and puts there priorities above her own. She goes above and beyond when talking with her to make sure you feel comfortable and at ease. Amazing doctor! The only downside is the waiting period. Sometimes the office gets backed up and the waiting process can be a bit frustrating. Other than that I have no issues with this doctor.", "pics": null, "resp": null, "gmap_id": "0x888a02b88099ac33:0x7536c11acb9ab3"}
{"user_id": "113459377935440167089", "name": "Rita Tuck", "time": 1595778255288, "rating": 5.0, "text": "Dr. Lachman is an excellent doctor. She really cares about her patients. She has helped me so much over the years. I really appreciate her. She enjoys what she does. I would not be where I am today without her. I have had many doctors over the years and she is by far the best.", "pics": null, "resp": null, "gmap_id": "0x888a02b88099ac33:0x7536c11acb9ab3"}
{"user_id": "105702790237309368823", "name": "Will Taylor", "time": 1603402521928, "rating": 5.0, "text": "Dr Lachman is one of the best psychologist I have had, she listens extremely well and she goes out of her way to help you with your problems.", "pics": null, "resp": null, "gmap_id": "0x888a02b88099ac33:0x7536c11acb9ab3"}
{"user_id": "106413314868397562644", "name": "Tina Hairel", "time": 1576236960536, "rating": 4.0, "text": "I love love Dr Elizabeth Lachman herself and I love how she listens and cares but my beef with them is you can wait for hours and hours to be seen! Plan an all day trip to her office mark everything off your day but sitting in her office! I believe their are just too many people wanting to see her than she can handle she does the best she can and is always apologetic!  For all she has done for me over the years I would give her 5 stars but that waiting time and then not answering the phone is the bad things!", "pics": null, "resp": null, "gmap_id": "0x888a02b88099ac33:0x7536c11acb9ab3"}
{"user_id": "111076284860619976247", "name": "Rebecca Garner", "time": 1596825562309, "rating": 5.0, "text": "HIGHLY RECOMMENDED!!\n\nSometimes you may sit just a lil past your scheduled appt time & other times you may sit a couple hours past your appt, BUT it is WELL WORTH the wait.. I have been going to Dr. Lauchman for several years now. She treats me like family. Not only does she ask abt my physical and mental health, she will ask abt each individual family member that I have ever talked abt. That goes to show how well she pays attention to her patients.. I wldnt feel no where near as comfortable with someone else...", "pics": null, "resp": null, "gmap_id": "0x888a02b88099ac33:0x7536c11acb9ab3"}
{"user_id": "116043656868571034420", "name": "Sally Atchley", "time": 1574892127862, "rating": 1.0, "text": "I am not a patient but I have to drive a patient of hers to and from the office. The wait time is any were from 4 hours up to 8 and 9 hours. Not enough chairs for the patients to sit in.  One bathroom. There was at least 20 people in small waiting area, not enough seats for them, and still more outside. The appointment was at 2pm and she is still waiting at 8:10 pm. They do not have a water cooler so the people who do not take anything have nothing to drink for this long and people with diabetes have no food unless they take some for 6 hours. Not professional at all to book all these appointments for one day!!!!!!!!! Nothing professional about this office at all!!!!! She may be a good Doctor but I find it cruel to make these people wait in such sorry conditions for so long!! A lot of these people have physical health problems and it is very hard on them to wait this long!! This office needs improvements or if the building can't be improved then it needs to be somewhere else.  And someone needs to learn how to schedule appointments appropriately! Thank God I am not a patient and I pray for those patients trapped there for hours and hours and hours!!!!", "pics": null, "resp": null, "gmap_id": "0x888a02b88099ac33:0x7536c11acb9ab3"}
{"user_id": "110558388599895570353", "name": "Michael Wood", "time": 1538331003287, "rating": 5.0, "text": "Dr. Lachman is a one of a kind psychiatrist. She is a great listener, she is very compassionate, and is very thorough. She never rushes her patients. You may experience a long wait time, but IT IS WELL WORTH IT. She is a wonderful psychiatrist, and a lovely person, and I revere her with my utmost respect. She has thorough clinical experience with not just common psychiatric medicines for common courses of illnesses, but also with uncommon psychiatric medicines and psychiatric medical combinations for treatment-resistant conditions. Definitely recommend her.", "pics": null, "resp": null, "gmap_id": "0x888a02b88099ac33:0x7536c11acb9ab3"}
{"user_id": "111990684885929737166", "name": "Melissa Rae Harvell", "time": 1567164385885, "rating": 5.0, "text": "I would actually give Dr. LACHMAN MORE Stars if at all possible. I can honestly say she was the absolute best I've ever been too. I haven't had not one even halfway decent one since. She's one of almost non-existent Dr. 's that does listen and she does Care. She doesn't let her ego treat her patients, she does and she does it to the best of her ability and I can attest to this. She has literally saved my life in the past more than once. And she helped my children more than she will ever know because despite their young aged they still remember her. As for myself I am and will remain beyond GREATFUL my life's Long.", "pics": null, "resp": null, "gmap_id": "0x888a02b88099ac33:0x7536c11acb9ab3"}
{"user_id": "115852388376468050915", "name": "Angie Lang", "time": 1572028834159, "rating": 5.0, "text": "New contract with Medicaid not worked out yet. Go by her office she may have samples she will give you.", "pics": null, "resp": null, "gmap_id": "0x888a02b88099ac33:0x7536c11acb9ab3"}
{"user_id": "111212062316904638406", "name": "aubrey harris", "time": 1530268348219, "rating": 5.0, "text": "She is the best Dr. I found in years besides her husband Dr, Mcintire, which I just recently found out that he was her Husband and has passed. She is an excellent listener. She goes above and beyond for her patients even The waiting is Hard But it sure is worth it. She has waited till almost 9 oclock at night to make sure a patient was seen. She gives you really great feed back and she knows her job. I am blessed to have found her.", "pics": null, "resp": null, "gmap_id": "0x888a02b88099ac33:0x7536c11acb9ab3"}
{"user_id": "110516661778541024201", "name": "Thesia Smith", "time": 1522359877285, "rating": 1.0, "text": "The worst office staff in history.. they are not  knowledgeable or perceptive about appointments..  and they do not care about the patients at all they would rather look like big bad ass as they're in control and actually help people.. the family and I will not be back ever!", "pics": null, "resp": null, "gmap_id": "0x888a02b88099ac33:0x7536c11acb9ab3"}
{"user_id": "111796796390039071381", "name": "Addie Grace", "time": 1517996364920, "rating": 5.0, "text": "My wife was seeing Doctors in Birmingham and Boaz before getting to see Dr. Lachman. Ever since that 1st visit, she has won my wife’s heart over and mine as well for being able to listen to my wife through all of the hard times(passing of friends & family members & hard times as a child) she’s going through and stuff that we’re going through as a marriage. She is truly a Doctor who cares for her patients and is willing to take however long you need to talk and get things off of your chest. I’m so glad my wife found a Doctor she can open up too and trust fully 100%. Dr. Lachman has been a miracle for my wife and our little family. Without her, we would be driving to Birmingham 2-3 times a month and seeing Doctors in Boaz who really don’t care for their patients(sees them as a paycheck). She has help change our life around for the best. Altogether, my wife and I are very appreciative for Doctors like Dr. Lachman who has a caring heart, open ears, & a shoulder to lean on. My opinion has never changed for Dr. Lachman and my wife has been with her for about 8 years. Also, it’s really sad about the passing of her husband that happened just about 2-3 years ago. He was a very great man who showed respect to everyone he met. He was a retired Doctor as well but would come to work with Mrs. Lachman 🌹 to help out around the office. The few times I  got to talk to him, he was very nice and caring as well. They were a Power couple on Earth and still will be when the Good Lord calls for Dr. Lachman to reunite with her husband.\n(I can see them taking care of the Angels who had a bad day and just needs someone to vent too.)\n\nThank you Dr. Lachman for everything you have done for my wife and our little family. You have been a blessing for us and we are very appreciative of all the help you have given us throughout these many years and We hope you will always be around for years and years to come because you are definitely a 1 out of a million type of person/Doctor.\n\nThanks 🙏🏼 from the Grace Family!", "pics": null, "resp": null, "gmap_id": "0x888a02b88099ac33:0x7536c11acb9ab3"}
{"user_id": "106312672798580918804", "name": "Amanda Ferguson", "time": 1609265134492, "rating": 5.0, "text": "It's been a while since I have posted a review, so it's time for a new one. I posted several years ago, and my opinion has not changed. Dr. Lachlan goes above and beyond for all of her patients. She doesn't forget me, and what I am dealing with. She does whatever is necessary to make me be my best self. I was a mess when I first started seeing her, and I have a ways to go, but I trust she is the only one who can help me. I couldn't deal without her. She has guided me through so much trauma. I can never repay the debt of gratitude I owe her.\nDr. Lachmans staff is another reason I like seeing her. They treat me like a person. Anita and forgive me for forgetting the other lady's name, make sure that I am taken care of while I'm there, by being nice and understanding. They put up with alot from patient's, and continue to smile, treat me with respect, and give me my follow up appointment.\nThings have been crazy with covid-19 going around, but they seem to handle it when things get hectic. They are part of the well oiled machine that makes Dr. Lachmans office run. I appreciate the level of professionalism coming from them. Just like raising a child, running an office takes a village.\nThey have made it priority to make sure that no one leaves the office with covid, by being very careful.\nI hope that I am able to see Dr. Lachmans for many years to come. She is helping me through complicated grief. There are very few doctors around here capable of that, Andi have only met one. That is Dr. Lachman. Complicated grief is no joke, and there is no easy fix. It takes time, and lots of effort on behalf of the doctor to show progress. Dr. Lachman has made sure to handle me with care. She knows how to give advice without being offensive, because she knows how to treat people. She gives the level of care that you want for those most important to you. She was the change I needed in my life. Again there is no fix, only coping skills. During my time spent going to her, my quality of life has gotten much better. She listens, she helps, and she makes a difference. How many doctors are really that good? None up next to her. This is the place I get to unload my issues, and she carefully organizes my mind for me.", "pics": null, "resp": null, "gmap_id": "0x888a02b88099ac33:0x7536c11acb9ab3"}
{"user_id": "105495436391865966796", "name": "Edwin Sherman", "time": 1540825894925, "rating": 5.0, "text": "She's a great loving doc she really cares about her people she sees", "pics": null, "resp": null, "gmap_id": "0x888a02b88099ac33:0x7536c11acb9ab3"}
{"user_id": "116881410258151325286", "name": "Michelle Skelton", "time": 1477835739514, "rating": 5.0, "text": "Dr Lachman has been treating me for years. She is a great doctor who puts her patients needs above her own. Works late hours and makes sure that every patient gets the time and treatment they need. She does everything to accomidate you anyway she can", "pics": null, "resp": null, "gmap_id": "0x888a02b88099ac33:0x7536c11acb9ab3"}
{"user_id": "117561313904382194510", "name": "Janine Stone", "time": 1568469781833, "rating": 5.0, "text": "The best Dr. I ever had she loves her patients she allways remembers our names and problems.other Dr.Your a number.I love Dr.Lockman and staff", "pics": null, "resp": null, "gmap_id": "0x888a02b88099ac33:0x7536c11acb9ab3"}
{"user_id": "112418444984917782577", "name": "mjm", "time": 1529943139437, "rating": 5.0, "text": "Mrs. Lachman is a wonderful Dr. Compared to the several Drs. I have seen over the years. She seems to genualy listen to me about my struggle with my ongoing illness and is very patient, understanding and informative. The wait is lengthy sometimes but In a world full of division, discrimination and stigma,  the help and kindness that Mrs. Lachman offers is a breath of fresh air that makes it worth it.", "pics": null, "resp": null, "gmap_id": "0x888a02b88099ac33:0x7536c11acb9ab3"}
{"user_id": "102672804832676525942", "name": "Keri Williams", "time": 1556989490897, "rating": 5.0, "text": "Best psychiatrist I've EVER been to. Just be prepared to wait 5 hours", "pics": null, "resp": null, "gmap_id": "0x888a02b88099ac33:0x7536c11acb9ab3"}
{"user_id": "102659820085127115267", "name": "Steve Falks", "time": 1488489146577, "rating": 5.0, "text": "If you need help this is the best place.... I have been under doctors care since 1986 ....I've been coming here for over a year....she is the best....the office staff is great Anita is wonderful ......people complain that she is rude.......if you act a fool and drug seeking and acting like a fool she will not tolerate a bunch of bullshit. ......I've love the people here......Steve Falks", "pics": null, "resp": null, "gmap_id": "0x888a02b88099ac33:0x7536c11acb9ab3"}
{"user_id": "105504550969956654459", "name": "Gaytha Morgan", "time": 1453316370302, "rating": 1.0, "text": "WELL THIS IS NOT A DOCTOR THAT CARES ABOUT HER PATIENTS. I WENT IN WITH MY HUSBAND AND WAS IN TOTAL SHOCK THE WAY THIS OFFICE WAS MANAGED. WHILE MY HUSBAND WAS IN SEEING THE DOCTOR HER SISTER WOULD COME IN AND OUT. SO DID HER HUSBAND. BUT WHAT REALLY GOT ME WAS WHEN HER SISTER BROUGHT A FOLDER IN AND PUT IT ON TOP AND SAID QUICK 200.00 SHE IS JUST HERE FOR MEDICINE.(LAST OFFICE VISIT 2ND VISIT) MY HUSBAND LOST HIS INSURANCE AND WHEN WE GOT THERE WE WAS TOLD THAT IT WILL BE 75.00 MORE DOLLARS. I TOLD HER I DIDN'T HAVE 75.00 MORE ITS ONLY SUPPOSED TO BE 100.00 I WAS TOLD IF MY HUSBAND WANTED HIS MEDICINE THAT HE WOULD COME UP WITH THE EXTRA MONEY. NOW MY HUSBAND IS DISABLED AND THIS OFFICE IS REFUSING HIM HIS RECORDS. WHEN YOU CALL THIS OFFICE THEY ARE VERY RUDE, THEY CHANGE YOUR APPOINTS THEN EXPECT YOU TO PAY 25.00 CAUSE THEY CHANGED YOUR APPOINTMENT.", "pics": null, "resp": null, "gmap_id": "0x888a02b88099ac33:0x7536c11acb9ab3"}
{"user_id": "107730872103069576902", "name": "BARBARA STOKLEY", "time": 1569510330714, "rating": 5.0, "text": "Love her but is a wait and worth it", "pics": null, "resp": null, "gmap_id": "0x888a02b88099ac33:0x7536c11acb9ab3"}
{"user_id": "114969430884107318961", "name": "Teresa Morgan", "time": 1527109552440, "rating": 5.0, "text": "Dr. Lachman truly cares about me and listens to me.  She is very compassionate and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x888a02b88099ac33:0x7536c11acb9ab3"}
{"user_id": "108964291004999811046", "name": "Billy and Kerri Ford", "time": 1508865567974, "rating": 5.0, "text": "I've been Dr.lachman patient going on 9 years. The wait sometimes per appointment is lengthy but well worth it.\nShe's always been carrying,concerned,diligent,and professional in every way you'd expect a doctor to be. Many times I've had severe melt downs. My most personal heartbroken experiences, Dr.lachman has been there and walked me through every step possible to take. She ensures my well being,health,and mindset. Always have i been pleased with the services she had rendered to me.\nThe staff are family, and very helpful in aiding patients and Dr.lachman. when you are there you feel welcomed, at home, and like family. I love each and everyone there. Thank you for being here for me. Kerri Ford", "pics": null, "resp": null, "gmap_id": "0x888a02b88099ac33:0x7536c11acb9ab3"}
{"user_id": "108919029945652237185", "name": "Faye Ahzburjn", "time": 1519141833477, "rating": 1.0, "text": "Dr. Lachman may mean well but she does more talking than listening, tells stories that has nothing to do with me and allows her family to work in the office. They lose my paperwork. They don't handle appoint times the way they should and want you to pay $25 for an appointment that was cancelled over a month ahead of time. The bathroom is disgusting but they want you to go in to give a urine sample.  Her sister and her newer lady in the front office tried to push some MLM junk pills on me to make a quick buck. So did Dr Lachman when I went in for my appointment. I feel like she is only interested in supplying pills, and I hear so many patients talking about how they react on the stuff she gives them. Some people only go for pills. I have real issues and I have problems taking meds. I'm through!", "pics": null, "resp": null, "gmap_id": "0x888a02b88099ac33:0x7536c11acb9ab3"}
{"user_id": "117634323468298976760", "name": "Gregory Melcher", "time": 1489851861421, "rating": 5.0, "text": "I've had over 20 surgeries and suffer from PTSD.  This experience qualifies me a a subject matter expert on doctor/patient relationships, medical professionalism, and continuity of care most doctors only swear an oath without belief. Dr. Lachman is the best medical practitioner (bar none) in any field.  She has no peer in her field of Psychiatry and patient care. You will find no better care than Dr. Lachman and her amazing staff provides to her patients. Wait? Yes, you will wait. However; my wait reminds me of when I was a child and Santa was coming tomorrow - I didn't mind at all.", "pics": null, "resp": null, "gmap_id": "0x888a02b88099ac33:0x7536c11acb9ab3"}
{"user_id": "108605242572529746471", "name": "Heather Smith", "time": 1491222013196, "rating": 5.0, "text": "Dr Lachlan is the most wonder person I have ever come to trust. Like someone else said \"she put everyone elses needs be her own\". I have been seeing her for years and she's the best phych doctor I have ever had.", "pics": null, "resp": null, "gmap_id": "0x888a02b88099ac33:0x7536c11acb9ab3"}
{"user_id": "109732714594483860770", "name": "Karen Lawless", "time": 1487966964853, "rating": 1.0, "text": "OFFICE PERSONAL IS RUDE!!!!!!!!! I CALLED AND ASKED WHAT TYPE OF THERAPY SHE SPECIALIZED IN? THE LADY, LAUGHED AND RUDELY SAID WHAT DO YOU MEAN SHE\"S A PSYCHIATRIST SHE CAN DO ANYTHING.....  I've called several other places and they simply told me, children's therapy, couples counseling, drug and addiction therapy..... THIS PLACE IS SO RUDE < I HUNG UP,  NOT A PLACE I WOULD EVEN CONSIDER GOING TO AFTER THAT!!!!", "pics": null, "resp": null, "gmap_id": "0x888a02b88099ac33:0x7536c11acb9ab3"}
{"user_id": "101627771721430522608", "name": "Alpha and Omega The Creator", "time": 1566595908766, "rating": 5.0, "text": "She trys to take as much time with you as she can. Just try to have patients with her it will be worth it.", "pics": null, "resp": null, "gmap_id": "0x888a02b88099ac33:0x7536c11acb9ab3"}
{"user_id": "106933044973179628108", "name": "Brandi Cowart", "time": 1550093128511, "rating": 1.0, "text": "how do you get in touch with this dr? I've called for a month at random times-- no answer!", "pics": null, "resp": null, "gmap_id": "0x888a02b88099ac33:0x7536c11acb9ab3"}
{"user_id": "106258864249824263955", "name": "Natalie", "time": 1526385765497, "rating": 5.0, "text": "She is the best. She take the time to listen.", "pics": null, "resp": null, "gmap_id": "0x888a02b88099ac33:0x7536c11acb9ab3"}
{"user_id": "101020015755165540554", "name": "Hannah Lowe", "time": 1525113237143, "rating": 3.0, "text": "Dr Lachman is such a sweetheart but some of her office staff can be rude at times.", "pics": null, "resp": null, "gmap_id": "0x888a02b88099ac33:0x7536c11acb9ab3"}
{"user_id": "112869476031859708804", "name": "sara jones", "time": 1591815965649, "rating": 2.0, "text": "I was seeing Dr Roza for 7 years. She helped me get stable on the medications that helped me so much. I was having a hard time and went to a different Doctor that specialized in a specific issue that needed medical attention. I HAD to get this issue addressed.  When I told her about what and why this was going on her personality changed and she became so judmental. It was hard enough admitting what I was going going through, but to then be judged by my trusted doctor. And I was judged!  After a 7 year relationship I was shocked and heartbroken. She not only judged me she labled me with her words. She then me  cut me off medications that needed weaning. I was fine with her wanting me off of them, but the way she did it was odd. She didn't wean me, so I eneded up seeing another Psychiatrist to to just that. She is a good doctor until you have issues arise that seem to make her uncomfortable or she does not have much knowledge in that specific area. I was sad this happened and I was heartbroken she treated me this way.", "pics": null, "resp": null, "gmap_id": "0x88626f7f1dd0bf89:0xe43bc29db960cd28"}
{"user_id": "103092872468873879272", "name": "Christi Parker", "time": 1510597748397, "rating": 5.0, "text": "Dr. Roza is an excellent doctor and she is very kind. Love her!", "pics": null, "resp": null, "gmap_id": "0x88626f7f1dd0bf89:0xe43bc29db960cd28"}
{"user_id": "108268643435049531044", "name": "Amber Roy", "time": 1478177912130, "rating": 5.0, "text": "Trusting very sincere understanding. I would recommend her to everyone.", "pics": null, "resp": null, "gmap_id": "0x88626f7f1dd0bf89:0xe43bc29db960cd28"}
{"user_id": "106130660871090047852", "name": "Rene Jamison", "time": 1620093783788, "rating": 1.0, "text": "Poor if I could give a zero I would. I went into their office for the first time.  I was told that I was not a good fit for there care at their office by the receptionist at the desk. Apparently they don’t treat people with mental illness.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPYQt-Jz56kSRUukDaDjxv8u9iCy5zVAFr5zs1e=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "114346522559974842004", "name": "Jessica Saxon", "time": 1618527443827, "rating": 5.0, "text": "This review goes to Nathan at Southern Psychiatry. I've never been to therapy before in my life and was utterly nervous about going my first time. Nathan was not only reassuring but he was compassionate, understanding, and attentive to my needs and helped me in ways I honestly never thought possible. Hes extremely cool and just overall easy to talk to and he feels like your best friend. He works out plans that are best for you and YOUR needs. There is laughing and so much healing within this one hour its unbelievable. I'm so happy I found the best therapist EVER. Please go see Nathan guys. Hes so awesome!", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "109088153570462072545", "name": "Shannon Lundgren", "time": 1618600977324, "rating": 1.0, "text": "I have seen several providers at Southern Psychiatry for about 18 months.  In that time, the initial concerns which drove me to seek help from them were not addressed, nor did any of the staff adequately explain to me why they gave me the diagnosises they did.  I also had to remind the healthcare providers why I was there on followup visits.  Their front office - when you can get them to answer the phone - are in capable of telling you when your appointment is or which of your medical records you are legally entitled to.  Try literally any other place first.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "117938297475328973899", "name": "Ki Freeman", "time": 1611621508499, "rating": 3.0, "text": "The ONLY reason I give them 3 stars is because of Dr. Sadler.  It took weeks for me to get an appointment, well I guess I should say a call back for an appointment.   Dr. Sadler was extremely thorough and answered all my questions during my video call.  It took them MONTHS to bill me after my insurance company processed the claim.  The website did not seem very secure to make payment so I attempted to call and make payment over the phone.  Almost 2 weeks later and 2 voice mails and I finally gave up and mailed my payment.  No call back to this day.  I hope my payment that I sent over a week ago is applied to my balance and that I am not put in collections.  Very disappointing and tough on my mental health.....", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "102400481339556782188", "name": "Meep Meeperson", "time": 1622587979060, "rating": 5.0, "text": "Dr. Sadler and Mr. Nathan are wonderful", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "113676194992147083367", "name": "Kimberly Rossler", "time": 1611992297041, "rating": 1.0, "text": "I really want to like this practice bc I see the PA Valerie who is beyond amazing! But not once has Dr.Sadler been involved with my treatment. Valerie is amazing but not a psychiatrist so it’s hard for me to believe I am getting the help that’s needed bc a actual DR should be the one diagnosing me . The office is pure horrible! Don’t even try calling ! I only will email instead of calling so I have a record to prove communication with the office staff. If you leave a voicemail you’ll be called back days later. I am trying to get help with my mental illness but it’s really hard at this place when the office staff will test your patience . It’s not a professional place at all and it’s sad!", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "118322600557296692236", "name": "Joe Pitts", "time": 1605816653939, "rating": 5.0, "text": "Dr. Sadler is amazing, Miranda is phenomenal, I love when we chat, and Nicole is phenomenal! Thank You guys so much!", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "101106945144220773112", "name": "Emily Horn", "time": 1603824450008, "rating": 5.0, "text": "The most thorough and friendly staff Ive ever been to. Ive been seeing mental health professionals for over 10 years and have never been as impressed as I am with this place.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "111092595288603289457", "name": "RKN RBN", "time": 1576721994962, "rating": 5.0, "text": "Valerie is FANTASTIC. My previous Dr closed her practice, what a blessing in disguise that ended up being! Valerie is so personable.\nMy experience at SP has been top notch. I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "102808662761612941757", "name": "Steven", "time": 1600096823667, "rating": 4.0, "text": "The doctors are fine, well at least the one I've seen. They are also quick to fix any issues brought to their attention.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "110260344436654724359", "name": "Tammie Walter", "time": 1600010360463, "rating": 5.0, "text": "Dr Sadler is the best.. Let him help you!", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "104466009919265080886", "name": "Michelle Jackson", "time": 1571415744467, "rating": 5.0, "text": "I am so comfortable with Ms. C. Threadgill, I can truly just be me,  she listens very attentively, makes sure that you understand any and all instructions that are given and will make sure that you are getting the most out of your visits. If I must say she is a phenomenal woman, excellent in her craft.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "101138774311146614400", "name": "Courtney Lang", "time": 1562548674676, "rating": 5.0, "text": "I give Dr Threadgill along with the office staff 5 stars for their kindness and their ability to make my experiences extremely pleasant. I’ve never had an issue with scheduling my appointments, in fact I’ve found that her flexibility regarding accommodating my busy schedule to be unmatched to any other provider. I feel completely confident and comfortable in her skills and her ability to address any and all of my concerns.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "101130197147328546389", "name": "Dana C", "time": 1565572923310, "rating": 4.0, "text": "I feel comfortable with Dr. Cristal. I have seen her a couple of times. She is professional and explains my medicines and reason for lab test. I did have a problem with a medicine at the drugstore but she got my message and worked it out. I like that she offers late evening appointments. She saw me on my lunch one time. Thank u", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "103728025748468098166", "name": "Charlotte Plunkett", "time": 1560428256325, "rating": 5.0, "text": "The doctors and staff at Southern Psychiatry are amazing.  They are kind, caring and want to help figure out the best treatment for you.  I had the best experience.  Thank You Southern Psychiatry.  Also love the therapy dog.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "109027071624489394856", "name": "LeAnn Miller", "time": 1580413565377, "rating": 1.0, "text": "Very unprofessional. Doctor Crystal was extremely forgetful, phone staff was rude and almost never returned my calls. Doctor Crystal made excuses for rude staff, they're hard to get ahold of because they won't answer the phone, had issues trying to refill prescriptions. They couldn't find my consent form to release medical records so they said they'd fax a new form for me to sign and they never did. Waited 45 minutes for an appointment with Dr. Bennett before they told me someone should have told me I was supposed to be in a different waiting room. Had testing set up with Dr. Bennet's office and they cancelled the day before. Found out they lied about why it was cancelled. Told me they accepted Medicaid and had no copay but after two appointments they called and told me I needed a referral from my primary care Doctor in order for Medicaid to pay which they NEVER mentioned before and said I owe over $200. Felt like doctor Crystal didn't listen and overall felt like they didn't care whatsoever. This place added to my anxiety and was probably the worst mental health clinic I've been to.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "109769632826451956607", "name": "Jamie", "time": 1561226178401, "rating": 1.0, "text": "The staff are nice enough and the lady I saw was polite, reasonable, and down-to-earth.  However, two huge issues. 1.) she seemed to be working on an almost assembly line sort of protocol and took a very short time to listen to my concerns and prescribed medications that gave me multiple concerns due to potential side effects I wanted to avoid 2.) the lady with whom they scheduled my appointment also did not have her insurance credentials in order so I ended up paying 155.00 out of pocket. I have excellent insurance and I would have had zero copay if she could’ve accepted my insurance. I paid because they assured me that by the time my follow up appointment was scheduled they would have the situation remedied. I called before I went to the next appointment and was advised she still didn’t have credentials for united healthcare so the visit would cost 90.0. I canceled the appointment and will have to find another doctor. This has also left me dealing with the side effects of those medications without any support in handling that. All around, I do not advise going here. The building is not handicap accessible which makes it more difficult for me as I don’t do that well with stairs sometimes, they don’t seem to have their business in order, they don’t seem to take the time to truly understand your issue and act appropriately, and I was left with a strong impression that they simply didn’t care much. If anything they should have said come into your appointment and we will not charge you and will handle the insurance after the fact. I do not understand why they think it is acceptable to force a patient to pay their outrageous prices for twenty minutes of their time when it’s their fault they’re not getting paid through insurance. Perhaps they have resolved the issue, perhaps not, but definitely call and question absolutely everything they tell you because they seemed to have no problem surprising me not only once with a bill I shoudn’t have had to pay, but they didn’t even call me before the follow up to advise me I would again be required to pay out of pocket.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "115628829108645125700", "name": "Bobbi Coburn", "time": 1561241149641, "rating": 5.0, "text": "Dr. Sadler and the other providers in this office strive for the best and try to help in every way possible. Mental health is a sensitive subject and the providers make it 10x  easier, and more comfortable to talk to and open up with!!! Thank you Dr. Sadler and all other providers for helping our community and raising awareness about Mental Health!!", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "102267228044728818470", "name": "Steve Avery", "time": 1566153470776, "rating": 5.0, "text": "I had been going to Delta Behavioral and they were always running a least an hr behind. I made the trip to Southern Psychiatry and to my surprise, they were on time and my session was GREAT!", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "115628829108645125700", "name": "Bobbi Coburn", "time": 1561241149641, "rating": 5.0, "text": "Dr. Sadler and the other providers in this office strive for the best and try to help in every way possible. Mental health is a sensitive subject and the providers make it 10x  easier, and more comfortable to talk to and open up with!!! Thank you Dr. Sadler and all other providers for helping our community and raising awareness about Mental Health!!", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "114666162214941126133", "name": "Don Davis", "time": 1565629252421, "rating": 5.0, "text": "After what seemed like months of trying to find an appointment, I reached out to Southern Psychiatry and was happy to hear they could get me in. I met Dr Sadler, so easy to talk to. I walked away from this first appointment feeling like this place can help.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "108591494283928291594", "name": "Jeremy Carpenter", "time": 1564584930970, "rating": 1.0, "text": "They never pick up the phone when I call and they never call back.  I had to figure out how to come off the 2 meds i was taking by myself! THESE PEOPLE ARE CROOKS! IF YOU VALUE YOUR HEALTH AND YOUR LIFE DO NOT VISIT THESE PEOPLE.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "112781490773650675454", "name": "summer moore", "time": 1578339275581, "rating": 1.0, "text": "Never able to confirm regarding they received other doctors records they are requesting. Charged me 1st visit 100$ with not even seeing the doctor. Felt as though it was a constant run around.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "114857328870029634019", "name": "Judy Woodard", "time": 1542253792881, "rating": 5.0, "text": "By far the best place around here in mobile. Great Dr's and staff. I am very thankful for them.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "100394927731833752285", "name": "Kristin McDaniels", "time": 1559733294944, "rating": 5.0, "text": "I was treated with kindness and respect the moment I walked in the door: felt very positive about my experience.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "104330011588323111560", "name": "J Watkins", "time": 1538584544128, "rating": 1.0, "text": "Most horrible experience I have ever had. The Psychiatrist is unprofessional. The office is the dirtiest office I’ve ever encountered in a Health Care setting. He brings a dog to work with him that uses the restroom on the floor. The receptionist that obtains urine for drug screens just leaves the urine laying around in open areas. The management team is unprofessional as well. Unethical behavior on charging patients for no show visits even after the patients call to reschedule appointments.  Worst service ever.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "112502801180270912807", "name": "Bart Roberts", "time": 1566422528620, "rating": 5.0, "text": "First time there and it was a great experience. Hats off to Dr Sadler", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "110430734103151623916", "name": "Bobbie Craft", "time": 1579557692306, "rating": 5.0, "text": "Friendly staff. Good Dr. And counselor.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "110430734103151623916", "name": "Bobbie Craft", "time": 1579557692306, "rating": 5.0, "text": "Friendly staff. Good Dr. And counselor.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "116437231372248503389", "name": "Kimberly", "time": 1562111747132, "rating": 1.0, "text": "I do NOT recommend this doctor’s office.  I agree with every negative review posted about them: The office is unappealing, but that can be overlooked.  People have complained about the receptionists, but they were nice to me.  People were charged no-show fees and co-pays when while on their insurance they have never owed a co-pay: the latter happened to me.  Someone said they treat you like a drug addict and I can see that as well.  You are drug screened before you see a doctor on your first visit.  Oh, and you have to use a public restroom in the main hallway of the building and carry your urine sample to them in plain view for anyone to see.  Other complaints have been about the apathy of the doctors, and I can relate to that as well.  I requested a refill for my medication 10 days before I was to run out and the doctor said she wrote me enough pills to get me to my next appointment plus 1 refill when in actuality my prescription bottle and the copy of the electronic prescription I got directly from the pharmacy shows otherwise, and in fact a lot less.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "104201822116940133834", "name": "John Sullivan", "time": 1536614336932, "rating": 1.0, "text": "My Wife preparing for a surgery in a few months and one of the requirements of her surgery is a Psych Eval.  Appointment was made with this physicians office.  Upon arriving, she's told that she has not met her deductible and that the visit would be $152.00, which doesn't make sense as she has already had surgery this year and multiple test done.  She had her debit card but had paid bills the day prior (of course) and only had $94.00.  The physician said he would see her for $100.00 but she only had $94.00 so she was not seen.   Now even though she was thoroughly embarrassed over the entire situation, she had rescheduled for another day.    Two weeks later, we get a bill in the mail charging a $100.00 NO SHOW fee.  Now I understand that they want their money in advance but ...she wasn't a NO SHOW.  The physician's office refused to see her.  I'm sorry this seems very tacky.  Now they've lost out on both ends as they lost a potential patient and she's refused to pay their NO SHOW fee.   Maybe it should be a Not Seen Fee...........", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "112372866275320936576", "name": "Amber Turrentine", "time": 1550237975906, "rating": 2.0, "text": "While I have never attended a session, I did reach out to schedule an appointment. I left a message and received a call back the next day. The receptionist said that there wouldn't be any new patient appointments until mid March. This is pretty common for first visits. My concern came when she asked for my credit or debit card number. When I asked why she seemed somewhat offended. The reason given was in case a don't show for an appointment. I have been to three different practices and not once have I been asked to give out my debit card number over the phone. I said that I didn't feel comfortable doing that and thanked her for her time.\n\nIf you dont feel comfortable giving out your debit or credit card number over the phone, I wouldn't suggest this place.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "107482146888215935076", "name": "Leigh Watt", "time": 1548273892690, "rating": 5.0, "text": "i give Mrs. Threadgill a 5 star rating but the office staff gets a 0-1 , in the past i have left several messages and not been called back and now here again i have left messages and not been called back.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "104864975723526236331", "name": "Mark Haygood", "time": 1558207059022, "rating": 5.0, "text": "Dr. Brad Sadler is an outstanding psychiatrist and I am happy to have him as a colleague in the area. I refer to his clinic as he practices with similar dignity, respect, compassion, precision, and safety. Thank you Dr. Sadler for all you do for our city!", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "115168358122505151967", "name": "Liz Ridgdell", "time": 1522298468442, "rating": 5.0, "text": "Dr Sadler has helped me so much in a very short time. I am so grateful. Also Donna Marie at the front desk is amazing.", "pics": null, "resp": {"time": 1523004004189, "text": "Thanks for 5 star rating... you are always welcome."}, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "102233911812401405352", "name": "Donna Dubose", "time": 1566153380781, "rating": 5.0, "text": "Can't say enough good things about Dr Sadler and staff. Finally found a place where i feel like they care", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "107627878756140138694", "name": "Pamela H", "time": 1505066151216, "rating": 5.0, "text": "Fabulous doctor. Holistic approaches instead of meds, if possible. He listens and understands to treat. Super happy to have found him.", "pics": null, "resp": {"time": 1523004076490, "text": "Thanks for 5 star rating... you are always welcome."}, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "100168979441490999286", "name": "Breland KO4QYX (Cobra6460)", "time": 1496708721006, "rating": 5.0, "text": "The first psychiatrist I can honestly say I like and feel comfortable and relaxed with and I have been seeing several on and off for 8 years now. Dr. Sadler has a fantastic medical background and it truly shows in his patient care.", "pics": null, "resp": {"time": 1523004093954, "text": "Thanks for 5 star rating... you are always welcome."}, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "110693541535811424551", "name": "Breanna Myrick", "time": 1542840786903, "rating": 3.0, "text": "Love Dr. Sadler but his staff is not very nice. Dr. Sadler helped diagnose me with the correct mental disorder and now I’m on the right track and the happiest I’ve ever been... I just have to deal with his office staff now.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "100168979441490999286", "name": "Breland KO4QYX (Cobra6460)", "time": 1496708721006, "rating": 5.0, "text": "The first psychiatrist I can honestly say I like and feel comfortable and relaxed with and I have been seeing several on and off for 8 years now. Dr. Sadler has a fantastic medical background and it truly shows in his patient care.", "pics": null, "resp": {"time": 1523004093954, "text": "Thanks for 5 star rating... you are always welcome."}, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "110506238947777421079", "name": "Raquel Henning", "time": 1554231494648, "rating": 1.0, "text": "It is NOT a safe place.  The one time I went in 2017, my husband would not drive through to the back because there was a drug deal going on. He was an MP.\nHaving had 6 concussions in the last 9 months, I accidentally called his office and made an appointment.  My husband finally remembered the place, and I called right away to cancel the afternoon appointment, but had to leave a message. My husband found an immediate 165$ charge on our card.  I explained to bobby, the manager, what had happened, that I got the wrong dr.  She rudely refused to make any adjustments saying that 21/2 years ago I signed an agreement.  Beware!!", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "114873456344231562970", "name": "Tammie Walter", "time": 1531051981345, "rating": 5.0, "text": "Genuine and highly knowledgeable. To say that I was at my wit's end, of a more than decade long battle to find real help, is a huge understatement. His expertise not only changed my life, I 100% know in my heart he helped me save it too. If you have lost all faith in doctor's, given up on meds, are disgusted and fed up with the lack of real mental health care, OR you've just lost all hope and given up... Please go see Dr. Sadler. I count him as one of my true blessings. If you listen to & allow him to, he will help you. :):", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "116420922191565982668", "name": "Sarah Stafford", "time": 1528644827024, "rating": 5.0, "text": "He is caring and concerned once you're established as a patient he will work with you on your co-pays and if you have any problems he will get you right in to take care of you.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "118216130242454778396", "name": "Paul Steuben", "time": 1482956743200, "rating": 5.0, "text": "I had an excellent experience at Southern Psychiatry.  Dr. Sadler took the time to get to know me and my situation and I really felt like he cared and wanted me to do better.", "pics": null, "resp": {"time": 1484212340477, "text": "Thanks for 5 star rating... you are always welcome."}, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "110631672427168001080", "name": "Alice Grayson", "time": 1554557707054, "rating": 5.0, "text": "Dr Sadler is awesome", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "116280990585945088013", "name": "John Singley", "time": 1560287653849, "rating": 1.0, "text": "Very unprofessional and the doctors act like you’re a drug addict", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "106896899835348198962", "name": "Louis Primos", "time": 1573500520161, "rating": 5.0, "text": "great place", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "106093609589524967246", "name": "Aaron VanHauter", "time": 1490109000937, "rating": 5.0, "text": "Great practice that really seems to care.", "pics": null, "resp": null, "gmap_id": "0x889a4c55c7ed58f3:0x2409d699885e9955"}
{"user_id": "111238829050357327585", "name": "Kim Bartley", "time": 1622295333170, "rating": 5.0, "text": "My son had been a patient for several years and I whole heartedly recommend Dr. Handal!  Their counselors are also very good!  I especially recommend Davud Cleveland among the counselors!  He us excellent with teen boys!!!", "pics": null, "resp": {"time": 1622562344833, "text": "Thank you so much for great feedback!"}, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "114752979797974957004", "name": "Mommer Tribe", "time": 1622573686044, "rating": 2.0, "text": "Don't bother being earlyto your appointment. You will NEVER BE SEEN ON TIME. Waiting 30-45 minutes after arrival should be considered standard.", "pics": null, "resp": {"time": 1622574576420, "text": "Hi, please contact our office manager Tami at 3347027222 ext 239 so we can discuss your concerns. Thank you"}, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "112391647938566861331", "name": "Sandy", "time": 1601598174418, "rating": 1.0, "text": "I have been a patient here for about 4 years. Just recently my 5 year old son had to get put on ADHD medicine. School has been in for less than a month, and we are still trying to figure out what medicine works good for him. Just recently he was put on one that he is making him worse than he was without it. Lots of side effects. I have been trying to get in touch with the doctor since Monday. The phone nurse Linda was rude to me stating she got both of my messages and can't help me. I have also left a message for the nurse Allison and faxed her my son's questionare with a note to call me. All of this happened Monday and Tuesday.  Tomorrow is Friday and  I still have not received any help on my child's medicine. I'm now considering going to his pediatrician for his medicine. He doesn't have an appointment for 2 weeks and can't wait that long.", "pics": null, "resp": {"time": 1601599268406, "text": "Hi Sandy, please feel free to contact our office manager at 3347027222 ext 209 and we are sorry for any inconvenience this has caused you."}, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "109466972525814718867", "name": "Scott Hall", "time": 1600704415280, "rating": 5.0, "text": "What a blessing to finally find Dothan Behavioral! From the front door to the Psychiatrist, each person is kind and respectful!  It’s hard to admit when we have a problem; thankfully DBMC doesn’t make me feel like I’m “not normal”.\nThanks to each of you for being here for so many!", "pics": null, "resp": {"time": 1600748597060, "text": "Thank you!, we're committed to helping you smile again!, it's an honor to be at your service."}, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "117238952845303497182", "name": "Morgan Arneson", "time": 1606234365529, "rating": 1.0, "text": "If I could leave zero starts I would. I am in healthcare and I have never been treated so poorly", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "118303270809221757600", "name": "cathy blythers", "time": 1590682666010, "rating": 5.0, "text": "Well now that you talk to the doctor over the phone great, I love dr McDowell she takes her time to really understand you.", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "118152924165604122977", "name": "Alexandra Stegall", "time": 1590468711056, "rating": 1.0, "text": "I am a retired veteran that was admitted to this hospital twice during my Service as an active duty soldier at Fort Rucker, AL. I was experiencing PTSD and extreme distress during my service and was admitted to this hospital’s behavioral health unit twice within a year. Here’s my story:\n\nThe first time I was admitted, it was voluntary...\nI was going through a lot on base, where I lived. My chain of command in the military allowed me to admit myself for a short period of time. They wanted me to get myself together and have me go back to continuing my service.\n\nThe neglect for patients here was disgusting to say the least. The staff allowed my chain of command to enter the unit without my password. They were the last people I wanted to see. I was sure that this was illegal and requested to speak to a supervisor, who told me it was my mistake for not turning them away. Being a soldier, I knew she did not understand that I could not do that and she clearly did not care about the law that her staff was breaking. This was not the only kind of neglect I witnessed/experienced. The geriatrics room was so sad. The older patients are sat down in chairs all day and night, in front of a tv. One of the older men was taken into a private room with a female tech. When they came out, he had a bloody mark on his forehead. Some of us patients noticed but felt that nobody would do anything about it. Another older gentleman in the geriatrics room died while I was there. Nobody knew the cause but he was wrapped up in a sheet and placed into a giant gray bin and wheeled away in front of all of the other patients!\n\nDuring this first stay at this hospital, there was a day where a group of student nurses were visiting to observe the staff and patients. They were observing a therapy group where the therapist was breaking HIPAA laws and verbally exposing each patient’s diagnosis in front of all of the other patients, as well as the student nurses.\n\nThe second time I was admitted, I was court ordered. My command knew I was in distress and did not know what to do with me. I was sent to this hospital a second time and knew that it would not be a long stay. I was met by two giant men, telling me I have been court ordered to the psychiatric unit. I knew that something wasn’t right and that the court order was not justified. This time, they admitted me to the third-floor. There were beds available on the second floor but had decided that I would be better off on the third floor. Anyone who has been to this unit, knows that the third floor is for patients with severe mental health issues... this time, there was a poster on the wall with all of the patient rights (that wasn’t there before)... I read all of my rates and noticed that it said that I could request a patient advocate and a lawyer. When I approached the glass window at the desk, I requested Mary Anne, A wonderful recreational therapist that I remembered from my first stay- as well as a lawyer!... I was met with a nasty attitude and told to sit down because I was court ordered. At this point, I was panicking and angry so I threw a fit in order to get the attention of whoever was above this woman telling me to take a seat. When I got the supervisors attention, I requested that lawyer and therapist. The lawyer asked me if I had been “Baker Acted” but I had no idea what that meant. He pulled up my information on a computer and informed me that I had not been “baker acted” and could leave anytime I wanted. I was out of there within a few hours!\n\nWhat a horrifying experience this was. The neglect and abuse here is disgusting and I would never EVER recommend anyone admit themselves to this hospital!", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "106886399477216019030", "name": "Kitty Niccole", "time": 1594133908504, "rating": 4.0, "text": "Nice Doctors...Sometimes Running Behind Alittle!", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "100709881162422408912", "name": "Logan Keel", "time": 1543510207619, "rating": 3.0, "text": "I would give 5 stars, but they really should have a better way of scheduling an appointment. I have been trying to make my son an appointment for 2 weeks. This is ridiculous. Some of us have to work & can't just take off anytime.", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "112254523253127740260", "name": "Gigi Harper (GiGi)", "time": 1563711836832, "rating": 5.0, "text": "Dr. Handal and his staff are amazing! Also, Dr Lori, on the therapy side is also awesome patient and so patient!", "pics": null, "resp": {"time": 1583974886613, "text": "Thank you!"}, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "111701260111313365931", "name": "Gene and Marilyn McFalls", "time": 1536245107234, "rating": 5.0, "text": "Dothan Behavioral is a Five Star facility that employs the Best intake and psychiatric services available in the Dothan Alabama area. Dr. Mcleod is a outstanding leader, physician, facilitator of stabilization of mental health illness in our community. This is a trusted provider of services in the community of Dothan.", "pics": null, "resp": {"time": 1536250432234, "text": "Thank you!"}, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "113986665196559314073", "name": "Tanya Chandler", "time": 1584586692746, "rating": 5.0, "text": "Worth the time if you actually tell them all that you struggle with or need questions answered.", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "114205026961523028516", "name": "Heather Farris", "time": 1521751606599, "rating": 5.0, "text": "They are a busy clinic so call in plenty of time for an appointment. You can also ask to be put on the cancellation list. All of the staff at Dothan Behavioral are always helpful, patient, and kind. They have made a tremendous difference for our family.", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "113352591200729382378", "name": "Justin Givens", "time": 1534363426839, "rating": 5.0, "text": "Dr. Pfeiffer and his staff have been amazing. Everyone has always been polite and listened to all of our concerns.", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "107096003685086202506", "name": "J Brown", "time": 1532447835561, "rating": 1.0, "text": "A glorified children's pill mill. Dr. Handel is only interested in writing prescriptions (so he can make more money) than curing  the child. Sad.", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "105121483514686232740", "name": "AC Harris", "time": 1519066942546, "rating": 5.0, "text": "I am a patient of Angela Dawkins at Dothan Behavorial. She is great. Easy to talk too and listens to everything. Always professional and patient. I can not say enough great things about her. Would recommend her to anyone!", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "117687193848511875855", "name": "Aleana Culpepper", "time": 1591448901382, "rating": 5.0, "text": "Great people serving here", "pics": null, "resp": {"time": 1591630140077, "text": "Thank you!"}, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "103647665207109900824", "name": "Elizabeth Neering", "time": 1502243741095, "rating": 1.0, "text": "in the last week\nI went to McDowell with anxiety and depression that escalated into a passive death wish. McDowell actually laughed when I explained my thoughts and feelings. After a ten minute appointment in which she never made eye contact with me she dismissed me with no change in meds. (I shouldn't have expected more. My appointments with her were consistently 10 minutes each after 2+ hours of waiting.) Now, a year later, her office continues to harass me for a fee I refuse to pay because of her negligence and the totally unacceptable lack of care I received. I've never met a psychiatrist so utterly unconcerned with their patients' well being.", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "104428244546306971870", "name": "Sue Nickels", "time": 1584231189104, "rating": 2.0, "text": "Dr was bad and staff was mean won't go there again", "pics": null, "resp": {"time": 1584237145285, "text": "Please call our office manager 3347027222 ext209, we would like to know more about this experience, so we can take appropriate measures."}, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "115252771124730504800", "name": "Big Papa", "time": 1523888422739, "rating": 5.0, "text": "Dr Handal and staff are amazing.  Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "100109196607444707421", "name": "Tracy Fender", "time": 1418138501558, "rating": 5.0, "text": "Dr Handal and his Staff are very kind and show great compassion to their young clients", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "103299074953498426039", "name": "Alisca Simpler", "time": 1594682544806, "rating": 5.0, "text": "Great Customer Service", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "114030239585820493110", "name": "Justin West", "time": 1535047133478, "rating": 1.0, "text": "Had high hopes unfortunately my doctor was very misinformed stuck on my past you could say.... waste of time", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "109585023841182872468", "name": "medical professional", "time": 1513267340097, "rating": 1.0, "text": "this office is very hard to get an appointment with. the new patient coordinator Tiffany has yet to return any of my phone calls. very unprofessional in my opinion when you are dealing with mental health issues.", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "103210262951853797985", "name": "Sphereinomical 336", "time": 1480627098378, "rating": 1.0, "text": "I called for 3 weeks and they never called back. The answering machine said you would get a call back the next day, i'm still waiting.", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "115594328265923089452", "name": "Thomas Thompson", "time": 1562484910436, "rating": 5.0, "text": "Such a nice group.", "pics": null, "resp": {"time": 1583974894889, "text": "Thank you!"}, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "102069964189918561929", "name": "Thomas Coutu", "time": 1511188274114, "rating": 1.0, "text": "Called several times , they did not return calls. Referred to them by family doctor.", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "102601513339001885522", "name": "Reed York", "time": 1489778763732, "rating": 1.0, "text": "After waiting for 2 hours there was nothing they could do for me.", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "102671065276749920021", "name": "Donna Bennett", "time": 1489326608541, "rating": 1.0, "text": "All Dr Handel did was drug my son now he has been out in out of the hospital with sezuires I will NEVER TAKE HIM BACK TO HIM !!!!!!!", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "110293699383187569101", "name": "Joseph “Trent” Vines", "time": 1617455562623, "rating": 5.0, "text": "Dr. Islam is a very well respected psychiatrist in the Birmingham area whose always treated me with the upmost respect and if you work for a living, he sees patients 6 or 7 days per week and that's why I started using him, but I've grown to like him a lot. he cares about his patients and does a great job running his clinic.  kudos Doc. I wish we would've known each other a long time ago. great guy highly recommended!!!🙏🏻🙏🏻👍🏼👍🏼👍🏼", "pics": null, "resp": null, "gmap_id": "0x888923d657d7a777:0xd29d293725d9d7a7"}
{"user_id": "113503497213186980961", "name": "lauren armes", "time": 1614468570215, "rating": 5.0, "text": "I had my first appointment with Dr. Islam today and he was so caring and compassionate. I look forward to continuing to see him as my trusted psychiatrist. I would recommend him to everyone. He is phenomenal at communicating as well.", "pics": null, "resp": null, "gmap_id": "0x888923d657d7a777:0xd29d293725d9d7a7"}
{"user_id": "116515616760204026953", "name": "Erin Broome", "time": 1617842514761, "rating": 5.0, "text": "Dr Nasima is so caring and genuine. I have struggled for years to find someone who seems to actually listen to what I am saying about how I am feeling. Highly recommend. Also I had an appointment the morning after I called and left a message . They put mental health first, which is so hard to find.", "pics": null, "resp": null, "gmap_id": "0x888923d657d7a777:0xd29d293725d9d7a7"}
{"user_id": "115137845676812248660", "name": "Meghan Clements", "time": 1594337677176, "rating": 5.0, "text": "My Psychiatry Clinic is THE BEST! With other mental health offices we have used, we either found a doctor that doesn't seem to really care, rude receptionists, and/or it's almost impossible to get an emergency appointment. You won't find any of that at My Psychiatry! They are nothing but friendly, caring, and compassionate. I will never be able to express my gratitude for what Dr. Islam has done for my family, and to Roman for always working with us and getting us in for an appointment. Absolutely recommended!!", "pics": null, "resp": null, "gmap_id": "0x888923d657d7a777:0xd29d293725d9d7a7"}
{"user_id": "100034845845809786230", "name": "Matthew 123456", "time": 1602092510058, "rating": 5.0, "text": "I moved Back home to Birmingham after struggling for years in Florida with my issues compounded by a lack of available Doctors in Pensacola that could treat me without Insurance currently and with the new Covid guidelines it was nearly impossible to get the help needed there.\n\nBy Chance I called Dr. Islam from googling for psychiatrists here and was stunned that he actually answered the phone, then set up an appointment for initial visit the next Day!\n\nI didn't know what to expect and just took a shot at this new video conference method and it went flawless.\n\nOn top of the great service, Dr. Islam's true talent showed in the visit and outcome so far.\n\nSomehow he deciphered me trying to explain almost 25 years of taking medication for Depression at first, then anxiety in college,  and a variety of issues ever since.\n\nI knew the best method was not to sugar coat the severity of how bad I have been feeling and that I was basically unable to function normally, except for bare minumum to survive.\nI just told him the truth that I was basically staying home and not able to see a way out but that I never gave up hope but that I was in serious need of help.\n\nI told him what I thought I needed based on what had helped in the past; but also that I trust him over my opinion bc obviously my past regiment had not really helped me bc I had stagnated overall even when had all the help I thought I needed over the last 5 years..\n\nAmazingly he was able to understand my root problem better than I did honesly and prescribed a medication that has litterally changed my Life.\n\nFor the 1st time in 8 years or so, I feel free from the over whelming anxiety and sadness and fear that had ruled me for a decade and he did it with a novel approach that I didnt even know existed and had never heard of as a medication for my underlying issue of anxiety/depression/and an inablity to take needed action.\n\nHow I had never been diagnosed this way or offered this class of medication is just an example of the stigma and problems still around mental health..  Perhaps my previous doctors were influenced by the labels and words used to describe some of my symptoms which caused them to think I didnt need this form of treatment.. I dont know but there are medicines that will help you that you may never have heard of like me.\n\nIt actually makes my brain WORK the right way Versus just numbing it, and covering over the problem .\n\nI am now in a position that I am safely tapering off the medication that I dont truly need to be on(faster than I thought I could) and put that \"mistake\" in the past and I am focused on my life and my future for the first time in years.\n\nNever give up hope! Dont settle for bad help or mediocre treatment that just helps you \"get by\" each day as long as you have your \"meds\"\n\nIf you not thriving or on a path too it dont settle like I did for way too long.\n\nDont assume you know the only things that will work for you and be TOTALLY honest with the Dr so he can help you .\n\nIm even getting back into old hobbies and my next new career goals and even back into My Faith in God.\n\nIf you or someone you know is struggling please take this as a message of hope that its never too late and never hopeless.\n\nGod Bless and Thank you to Dr. Islam and Thanks to President Trump or whoever in the Government made this Tele-Medicine / new video conferencing option available. Without it I may never have found Dr. Islam.\n\nThank You Dr. Islam\n\nSincerely,\n\nMatt", "pics": null, "resp": null, "gmap_id": "0x888923d657d7a777:0xd29d293725d9d7a7"}
{"user_id": "102359253690504623154", "name": "Hannah Yates", "time": 1612819963831, "rating": 1.0, "text": "They only take Blue Cross insurance.", "pics": null, "resp": null, "gmap_id": "0x888923d657d7a777:0xd29d293725d9d7a7"}
{"user_id": "102713433949230005870", "name": "fazle matin", "time": 1580060679657, "rating": 5.0, "text": "Wonderful clinic and physicians. Caring and kind.", "pics": null, "resp": null, "gmap_id": "0x888923d657d7a777:0xd29d293725d9d7a7"}
{"user_id": "102309511909508219363", "name": "Rxseirixlle Geabov", "time": 1581656140971, "rating": 5.0, "text": "Amazing !!! Amazing !!!!! Amazing!!!!! Love that place😊", "pics": null, "resp": null, "gmap_id": "0x888923d657d7a777:0xd29d293725d9d7a7"}
