{"user_id": "108795342503901438523", "name": "Anna Gleason", "time": 1602610411828, "rating": 1.0, "text": "Super rude receptionist. Talked over me and talked down to me. Definitely not a good look for a mental health facility.", "pics": null, "resp": null, "gmap_id": "0x88891985eff32417:0x55c8b9c7319865a"}
{"user_id": "112520203106825222014", "name": "Christina Oates", "time": 1629238081457, "rating": 5.0, "text": "Thrive is making such an impact in my life. I love how easy and open the conversations are and how the counselors personalize the “growth” assignments to their clients. They honestly meet you were you are and are honest and helpful about where the next steps are and how to take them on your journey to a better and healthier you.", "pics": null, "resp": null, "gmap_id": "0x88891f327aae01cb:0x24745e15285e49f0"}
{"user_id": "102577419814964078798", "name": "Carly Steed", "time": 1627049974478, "rating": 2.0, "text": "Please do not book a psychiatry appointment here. I was diagnosed with a panic disorder (after being asked vague questions and made to feel uncomfortable) and prescribed a VERY outdated medicine that isn’t prescribed anymore. After speaking to my therapist about not feeling anything, and even feeling worse from the medicine prescribed, I called the office and was immediately told that I could only talk to the psychiatrist in person and would have to pay for another session rather than quickly speak to the psychiatrist about this weird medicine or ask any questions. The psychiatrist would not take questions over the phone. I went to another psychiatrist, and was told that the medicine I was prescribed was one that she had never heard of. Please take the plunge and join the waiting list to see another psychiatrist.", "pics": null, "resp": {"time": 1627051234265, "text": "While we do stand behind the knowledge and expertise of our psychiatrist, your experience following up was not acceptable. It will be addressed and we apologize for your experience. If you would like to discuss it directly you can reach me on my cell at (205) 743-9251."}, "gmap_id": "0x88891f327aae01cb:0x24745e15285e49f0"}
{"user_id": "111315312618344298253", "name": "Sarah Arnold", "time": 1628615130974, "rating": 5.0, "text": "Wonderful counselors who will really listen and do their best to help you.", "pics": null, "resp": null, "gmap_id": "0x88891f327aae01cb:0x24745e15285e49f0"}
{"user_id": "107241517556331570228", "name": "Sam Mayhew", "time": 1628615409042, "rating": 5.0, "text": "Great counciling for all of your mental health needs.", "pics": null, "resp": null, "gmap_id": "0x88891f327aae01cb:0x24745e15285e49f0"}
{"user_id": "115954176930852337511", "name": "Burgandy M", "time": 1623255212555, "rating": 2.0, "text": "Did not want to retain me as a patient. Counselor cancelled appointments. Phone sessions were cut short (counselor disinterested).", "pics": null, "resp": {"time": 1623262325084, "text": "We never want one of our clients to feel this way. You can contact me directly on my cell at (205) 743-9251 and we will do whatever we need to to make this right."}, "gmap_id": "0x88891f327aae01cb:0x24745e15285e49f0"}
{"user_id": "103083350347864768484", "name": "kyle fortenberry", "time": 1628616161003, "rating": 5.0, "text": "The best counsellors work here!", "pics": null, "resp": null, "gmap_id": "0x88891f327aae01cb:0x24745e15285e49f0"}
{"user_id": "115546509333291626148", "name": "Scott Hodnett", "time": 1628615286190, "rating": 5.0, "text": "Wonderful place with great counselors!!", "pics": null, "resp": null, "gmap_id": "0x88891f327aae01cb:0x24745e15285e49f0"}
{"user_id": "116532065080543243075", "name": "Payton H. Stantis", "time": 1583248867248, "rating": 5.0, "text": "When I say that Thrive Counseling & Trauma Therapy has saved my life, I mean THEY HAVE SAVED MY LIFE. The methods that Jeff and his team use to help their clients are different than any type of therapy I have experienced. I spent much of my life seeing talk therapists who would make me feel heard, but that never gave me the tools to handle life's difficult situations. Thrive will hear you and help you figure out concrete ways to handle life's hurdles while providing you with the tools necessary to regulate yourself in any situation. I have been going here for years and have made significant progress on managing emotions, conflict resolution, self esteem, and have processed through multiple traumas. Many of my friends and family go here as well and we are all constantly singing their praises!  If you are ready for some healing contact these wonderful humans because they are the best in the biz! Good luck!<3", "pics": null, "resp": null, "gmap_id": "0x88891f327aae01cb:0x24745e15285e49f0"}
{"user_id": "106511653386093639018", "name": "JustBeingDrè _", "time": 1494977232919, "rating": 5.0, "text": "I have known Jeff professionally for years. We worked side by side, practically sharing an office for about 2 years. He is truly passionate about his work and the healing of his clients. I know for a fact that he will go the extra mile to help clients achieve therapeutic goals, if you are willing to do your part. He is experienced and certified in substance abuse treatment and trauma therapy.", "pics": null, "resp": null, "gmap_id": "0x88891f327aae01cb:0x24745e15285e49f0"}
{"user_id": "110376672012477654972", "name": "Regina Turner", "time": 1551743775879, "rating": 5.0, "text": "Jeff has been helpful as I work through adjustments and anxiety.", "pics": null, "resp": null, "gmap_id": "0x88891f327aae01cb:0x24745e15285e49f0"}
{"user_id": "107999966181547050169", "name": "Theresa Rose", "time": 1616621123220, "rating": 5.0, "text": "I never thought I could get better and not be depressed, until I started seeing Jeff at Thrive a few years ago. The day he was getting married, I had a pretty terrible panic attack and called him, and he spoke with me for 45 minutes and was able to calm me down. Right before they walked down the aisle!!! EMDR helped even though I was skeptical of it. I’m not perfect now, but I’m far from the sad, depressed girl who walked into Thrive suicidal all those years ago. They are wonderful and I couldn’t sing their praises enough!!!", "pics": null, "resp": null, "gmap_id": "0x8889232604792c65:0x5211fff7c37f08d7"}
{"user_id": "100981674450619719385", "name": "Mellissa Goetz", "time": 1609891065023, "rating": 5.0, "text": "Great counseling! Not just someone that will just listen and give metaphors. Actually getting better with each visit. Would highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8889232604792c65:0x5211fff7c37f08d7"}
{"user_id": "110686894710486879266", "name": "Holly Walker", "time": 1602635578401, "rating": 5.0, "text": "This counselor is amazing. She was very helpful!! Really appreciate all of her help!", "pics": null, "resp": null, "gmap_id": "0x888a3eaff1aa5223:0x4ad10ecb2542b819"}
{"user_id": "107542633975982889553", "name": "Kadie Oquain", "time": 1597091640070, "rating": 5.0, "text": "A very friendly place nice people too", "pics": null, "resp": null, "gmap_id": "0x888a3eaff1aa5223:0x4ad10ecb2542b819"}
{"user_id": "101401463091488365266", "name": "Caitlin Shostak Lotz", "time": 1604449000814, "rating": 5.0, "text": "If you feel frustrated and misunderstood by \"most\" therapists, I would highly recommend Joel. He has a sixth sense for understanding people and the ability to tap into the best thing about them. I have the privilege of knowing Joel personally. I can attest that he is truly a brilliant, imaginative and original thinker.", "pics": null, "resp": null, "gmap_id": "0x888923adc678bfab:0xdad6ae4991d7f84"}
{"user_id": "110551372072775998996", "name": "Caleb Young", "time": 1604274844925, "rating": 5.0, "text": "Joel is such a warm, witty and compassionate human being. Anyone seeking a therapist that will truly see you as a person can stop searching cause you’ve find him. 5/5 and I actively recommend to friends and family.", "pics": null, "resp": null, "gmap_id": "0x888923adc678bfab:0xdad6ae4991d7f84"}
{"user_id": "111754692598250517577", "name": "Andy Philpo", "time": 1604447688129, "rating": 5.0, "text": "Joel is an insightful and intelligent human being who you can trust to help you process and understand the complexities of your inner self. Come away deeper self knowledge and self mastery, which in turn leads you to a more peaceful life and more fulfilling personal or professional relationships.", "pics": null, "resp": null, "gmap_id": "0x888923adc678bfab:0xdad6ae4991d7f84"}
{"user_id": "116095332748781822715", "name": "Andrew Lotz", "time": 1604340442403, "rating": 5.0, "text": "Joel is the most empathetic and intelligent person I know. He has an uncanny ability to understand people. If you need someone to really \"get you,\" this is the place.", "pics": null, "resp": null, "gmap_id": "0x888923adc678bfab:0xdad6ae4991d7f84"}
{"user_id": "110752602716911747089", "name": "Wil Heflin", "time": 1605014339406, "rating": 5.0, "text": "Joel Blackstock is a talented, kind, and empathetic therapist. He is clearly passionate about helping others and wants the best for his clients’ outcomes. He is trained in EMDR to help with ptsd and incorporates it along with his years of experience into the process.", "pics": null, "resp": null, "gmap_id": "0x888923adc678bfab:0xdad6ae4991d7f84"}
{"user_id": "100081884310488998451", "name": "Jonathan Chesney", "time": 1604336292032, "rating": 5.0, "text": "Joel is thoughtful, curious, insightful, well-trained, and cares deeply about people in general and his patients health and well-being  in specific.  If you’ve been considering therapy and counseling, or just need to talk to someone about how those things might help, I recommend giving him a try!", "pics": null, "resp": null, "gmap_id": "0x888923adc678bfab:0xdad6ae4991d7f84"}
{"user_id": "114591756848061077487", "name": "Thomas Kozak", "time": 1605224610552, "rating": 5.0, "text": "No pre-formed assumptions here.  Joel Blackstock meets you where you're at, and he responds to the unique nuances of every individual.", "pics": null, "resp": null, "gmap_id": "0x888923adc678bfab:0xdad6ae4991d7f84"}
{"user_id": "107229534905348654712", "name": "Teria Fuller", "time": 1604442469901, "rating": 5.0, "text": "Joel is extremely trustworthy.   I feel free to talk with him about anything and not be judged.", "pics": null, "resp": null, "gmap_id": "0x888923adc678bfab:0xdad6ae4991d7f84"}
{"user_id": "106752096360701607824", "name": "Davin Bostic", "time": 1536231380670, "rating": 5.0, "text": "Chad Smith is very good. I highly recommend  his services.", "pics": null, "resp": null, "gmap_id": "0x888cf2a9efc90ed9:0x6b18016f762ca60d"}
{"user_id": "111238829050357327585", "name": "Kim Bartley", "time": 1622295333170, "rating": 5.0, "text": "My son had been a patient for several years and I whole heartedly recommend Dr. Handal!  Their counselors are also very good!  I especially recommend Davud Cleveland among the counselors!  He us excellent with teen boys!!!", "pics": null, "resp": {"time": 1622562344833, "text": "Thank you so much for great feedback!"}, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "114752979797974957004", "name": "Mommer Tribe", "time": 1622573686044, "rating": 2.0, "text": "Don't bother being earlyto your appointment. You will NEVER BE SEEN ON TIME. Waiting 30-45 minutes after arrival should be considered standard.", "pics": null, "resp": {"time": 1622574576420, "text": "Hi, please contact our office manager Tami at 3347027222 ext 239 so we can discuss your concerns. Thank you"}, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "112391647938566861331", "name": "Sandy", "time": 1601598174418, "rating": 1.0, "text": "I have been a patient here for about 4 years. Just recently my 5 year old son had to get put on ADHD medicine. School has been in for less than a month, and we are still trying to figure out what medicine works good for him. Just recently he was put on one that he is making him worse than he was without it. Lots of side effects. I have been trying to get in touch with the doctor since Monday. The phone nurse Linda was rude to me stating she got both of my messages and can't help me. I have also left a message for the nurse Allison and faxed her my son's questionare with a note to call me. All of this happened Monday and Tuesday.  Tomorrow is Friday and  I still have not received any help on my child's medicine. I'm now considering going to his pediatrician for his medicine. He doesn't have an appointment for 2 weeks and can't wait that long.", "pics": null, "resp": {"time": 1601599268406, "text": "Hi Sandy, please feel free to contact our office manager at 3347027222 ext 209 and we are sorry for any inconvenience this has caused you."}, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "109466972525814718867", "name": "Scott Hall", "time": 1600704415280, "rating": 5.0, "text": "What a blessing to finally find Dothan Behavioral! From the front door to the Psychiatrist, each person is kind and respectful!  It’s hard to admit when we have a problem; thankfully DBMC doesn’t make me feel like I’m “not normal”.\nThanks to each of you for being here for so many!", "pics": null, "resp": {"time": 1600748597060, "text": "Thank you!, we're committed to helping you smile again!, it's an honor to be at your service."}, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "117238952845303497182", "name": "Morgan Arneson", "time": 1606234365529, "rating": 1.0, "text": "If I could leave zero starts I would. I am in healthcare and I have never been treated so poorly", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "118303270809221757600", "name": "cathy blythers", "time": 1590682666010, "rating": 5.0, "text": "Well now that you talk to the doctor over the phone great, I love dr McDowell she takes her time to really understand you.", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "118152924165604122977", "name": "Alexandra Stegall", "time": 1590468711056, "rating": 1.0, "text": "I am a retired veteran that was admitted to this hospital twice during my Service as an active duty soldier at Fort Rucker, AL. I was experiencing PTSD and extreme distress during my service and was admitted to this hospital’s behavioral health unit twice within a year. Here’s my story:\n\nThe first time I was admitted, it was voluntary...\nI was going through a lot on base, where I lived. My chain of command in the military allowed me to admit myself for a short period of time. They wanted me to get myself together and have me go back to continuing my service.\n\nThe neglect for patients here was disgusting to say the least. The staff allowed my chain of command to enter the unit without my password. They were the last people I wanted to see. I was sure that this was illegal and requested to speak to a supervisor, who told me it was my mistake for not turning them away. Being a soldier, I knew she did not understand that I could not do that and she clearly did not care about the law that her staff was breaking. This was not the only kind of neglect I witnessed/experienced. The geriatrics room was so sad. The older patients are sat down in chairs all day and night, in front of a tv. One of the older men was taken into a private room with a female tech. When they came out, he had a bloody mark on his forehead. Some of us patients noticed but felt that nobody would do anything about it. Another older gentleman in the geriatrics room died while I was there. Nobody knew the cause but he was wrapped up in a sheet and placed into a giant gray bin and wheeled away in front of all of the other patients!\n\nDuring this first stay at this hospital, there was a day where a group of student nurses were visiting to observe the staff and patients. They were observing a therapy group where the therapist was breaking HIPAA laws and verbally exposing each patient’s diagnosis in front of all of the other patients, as well as the student nurses.\n\nThe second time I was admitted, I was court ordered. My command knew I was in distress and did not know what to do with me. I was sent to this hospital a second time and knew that it would not be a long stay. I was met by two giant men, telling me I have been court ordered to the psychiatric unit. I knew that something wasn’t right and that the court order was not justified. This time, they admitted me to the third-floor. There were beds available on the second floor but had decided that I would be better off on the third floor. Anyone who has been to this unit, knows that the third floor is for patients with severe mental health issues... this time, there was a poster on the wall with all of the patient rights (that wasn’t there before)... I read all of my rates and noticed that it said that I could request a patient advocate and a lawyer. When I approached the glass window at the desk, I requested Mary Anne, A wonderful recreational therapist that I remembered from my first stay- as well as a lawyer!... I was met with a nasty attitude and told to sit down because I was court ordered. At this point, I was panicking and angry so I threw a fit in order to get the attention of whoever was above this woman telling me to take a seat. When I got the supervisors attention, I requested that lawyer and therapist. The lawyer asked me if I had been “Baker Acted” but I had no idea what that meant. He pulled up my information on a computer and informed me that I had not been “baker acted” and could leave anytime I wanted. I was out of there within a few hours!\n\nWhat a horrifying experience this was. The neglect and abuse here is disgusting and I would never EVER recommend anyone admit themselves to this hospital!", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "106886399477216019030", "name": "Kitty Niccole", "time": 1594133908504, "rating": 4.0, "text": "Nice Doctors...Sometimes Running Behind Alittle!", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "100709881162422408912", "name": "Logan Keel", "time": 1543510207619, "rating": 3.0, "text": "I would give 5 stars, but they really should have a better way of scheduling an appointment. I have been trying to make my son an appointment for 2 weeks. This is ridiculous. Some of us have to work & can't just take off anytime.", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "112254523253127740260", "name": "Gigi Harper (GiGi)", "time": 1563711836832, "rating": 5.0, "text": "Dr. Handal and his staff are amazing! Also, Dr Lori, on the therapy side is also awesome patient and so patient!", "pics": null, "resp": {"time": 1583974886613, "text": "Thank you!"}, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "111701260111313365931", "name": "Gene and Marilyn McFalls", "time": 1536245107234, "rating": 5.0, "text": "Dothan Behavioral is a Five Star facility that employs the Best intake and psychiatric services available in the Dothan Alabama area. Dr. Mcleod is a outstanding leader, physician, facilitator of stabilization of mental health illness in our community. This is a trusted provider of services in the community of Dothan.", "pics": null, "resp": {"time": 1536250432234, "text": "Thank you!"}, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "113986665196559314073", "name": "Tanya Chandler", "time": 1584586692746, "rating": 5.0, "text": "Worth the time if you actually tell them all that you struggle with or need questions answered.", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "114205026961523028516", "name": "Heather Farris", "time": 1521751606599, "rating": 5.0, "text": "They are a busy clinic so call in plenty of time for an appointment. You can also ask to be put on the cancellation list. All of the staff at Dothan Behavioral are always helpful, patient, and kind. They have made a tremendous difference for our family.", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "113352591200729382378", "name": "Justin Givens", "time": 1534363426839, "rating": 5.0, "text": "Dr. Pfeiffer and his staff have been amazing. Everyone has always been polite and listened to all of our concerns.", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "107096003685086202506", "name": "J Brown", "time": 1532447835561, "rating": 1.0, "text": "A glorified children's pill mill. Dr. Handel is only interested in writing prescriptions (so he can make more money) than curing  the child. Sad.", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "105121483514686232740", "name": "AC Harris", "time": 1519066942546, "rating": 5.0, "text": "I am a patient of Angela Dawkins at Dothan Behavorial. She is great. Easy to talk too and listens to everything. Always professional and patient. I can not say enough great things about her. Would recommend her to anyone!", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "117687193848511875855", "name": "Aleana Culpepper", "time": 1591448901382, "rating": 5.0, "text": "Great people serving here", "pics": null, "resp": {"time": 1591630140077, "text": "Thank you!"}, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "103647665207109900824", "name": "Elizabeth Neering", "time": 1502243741095, "rating": 1.0, "text": "in the last week\nI went to McDowell with anxiety and depression that escalated into a passive death wish. McDowell actually laughed when I explained my thoughts and feelings. After a ten minute appointment in which she never made eye contact with me she dismissed me with no change in meds. (I shouldn't have expected more. My appointments with her were consistently 10 minutes each after 2+ hours of waiting.) Now, a year later, her office continues to harass me for a fee I refuse to pay because of her negligence and the totally unacceptable lack of care I received. I've never met a psychiatrist so utterly unconcerned with their patients' well being.", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "104428244546306971870", "name": "Sue Nickels", "time": 1584231189104, "rating": 2.0, "text": "Dr was bad and staff was mean won't go there again", "pics": null, "resp": {"time": 1584237145285, "text": "Please call our office manager 3347027222 ext209, we would like to know more about this experience, so we can take appropriate measures."}, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "115252771124730504800", "name": "Big Papa", "time": 1523888422739, "rating": 5.0, "text": "Dr Handal and staff are amazing.  Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "100109196607444707421", "name": "Tracy Fender", "time": 1418138501558, "rating": 5.0, "text": "Dr Handal and his Staff are very kind and show great compassion to their young clients", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "103299074953498426039", "name": "Alisca Simpler", "time": 1594682544806, "rating": 5.0, "text": "Great Customer Service", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "114030239585820493110", "name": "Justin West", "time": 1535047133478, "rating": 1.0, "text": "Had high hopes unfortunately my doctor was very misinformed stuck on my past you could say.... waste of time", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "109585023841182872468", "name": "medical professional", "time": 1513267340097, "rating": 1.0, "text": "this office is very hard to get an appointment with. the new patient coordinator Tiffany has yet to return any of my phone calls. very unprofessional in my opinion when you are dealing with mental health issues.", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "103210262951853797985", "name": "Sphereinomical 336", "time": 1480627098378, "rating": 1.0, "text": "I called for 3 weeks and they never called back. The answering machine said you would get a call back the next day, i'm still waiting.", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "115594328265923089452", "name": "Thomas Thompson", "time": 1562484910436, "rating": 5.0, "text": "Such a nice group.", "pics": null, "resp": {"time": 1583974894889, "text": "Thank you!"}, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "102069964189918561929", "name": "Thomas Coutu", "time": 1511188274114, "rating": 1.0, "text": "Called several times , they did not return calls. Referred to them by family doctor.", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "102601513339001885522", "name": "Reed York", "time": 1489778763732, "rating": 1.0, "text": "After waiting for 2 hours there was nothing they could do for me.", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "102671065276749920021", "name": "Donna Bennett", "time": 1489326608541, "rating": 1.0, "text": "All Dr Handel did was drug my son now he has been out in out of the hospital with sezuires I will NEVER TAKE HIM BACK TO HIM !!!!!!!", "pics": null, "resp": null, "gmap_id": "0x88928d9733f9a99d:0xdd43af3d45a5a602"}
{"user_id": "110293699383187569101", "name": "Joseph “Trent” Vines", "time": 1617455562623, "rating": 5.0, "text": "Dr. Islam is a very well respected psychiatrist in the Birmingham area whose always treated me with the upmost respect and if you work for a living, he sees patients 6 or 7 days per week and that's why I started using him, but I've grown to like him a lot. he cares about his patients and does a great job running his clinic.  kudos Doc. I wish we would've known each other a long time ago. great guy highly recommended!!!🙏🏻🙏🏻👍🏼👍🏼👍🏼", "pics": null, "resp": null, "gmap_id": "0x888923d657d7a777:0xd29d293725d9d7a7"}
{"user_id": "113503497213186980961", "name": "lauren armes", "time": 1614468570215, "rating": 5.0, "text": "I had my first appointment with Dr. Islam today and he was so caring and compassionate. I look forward to continuing to see him as my trusted psychiatrist. I would recommend him to everyone. He is phenomenal at communicating as well.", "pics": null, "resp": null, "gmap_id": "0x888923d657d7a777:0xd29d293725d9d7a7"}
{"user_id": "116515616760204026953", "name": "Erin Broome", "time": 1617842514761, "rating": 5.0, "text": "Dr Nasima is so caring and genuine. I have struggled for years to find someone who seems to actually listen to what I am saying about how I am feeling. Highly recommend. Also I had an appointment the morning after I called and left a message . They put mental health first, which is so hard to find.", "pics": null, "resp": null, "gmap_id": "0x888923d657d7a777:0xd29d293725d9d7a7"}
{"user_id": "115137845676812248660", "name": "Meghan Clements", "time": 1594337677176, "rating": 5.0, "text": "My Psychiatry Clinic is THE BEST! With other mental health offices we have used, we either found a doctor that doesn't seem to really care, rude receptionists, and/or it's almost impossible to get an emergency appointment. You won't find any of that at My Psychiatry! They are nothing but friendly, caring, and compassionate. I will never be able to express my gratitude for what Dr. Islam has done for my family, and to Roman for always working with us and getting us in for an appointment. Absolutely recommended!!", "pics": null, "resp": null, "gmap_id": "0x888923d657d7a777:0xd29d293725d9d7a7"}
{"user_id": "100034845845809786230", "name": "Matthew 123456", "time": 1602092510058, "rating": 5.0, "text": "I moved Back home to Birmingham after struggling for years in Florida with my issues compounded by a lack of available Doctors in Pensacola that could treat me without Insurance currently and with the new Covid guidelines it was nearly impossible to get the help needed there.\n\nBy Chance I called Dr. Islam from googling for psychiatrists here and was stunned that he actually answered the phone, then set up an appointment for initial visit the next Day!\n\nI didn't know what to expect and just took a shot at this new video conference method and it went flawless.\n\nOn top of the great service, Dr. Islam's true talent showed in the visit and outcome so far.\n\nSomehow he deciphered me trying to explain almost 25 years of taking medication for Depression at first, then anxiety in college,  and a variety of issues ever since.\n\nI knew the best method was not to sugar coat the severity of how bad I have been feeling and that I was basically unable to function normally, except for bare minumum to survive.\nI just told him the truth that I was basically staying home and not able to see a way out but that I never gave up hope but that I was in serious need of help.\n\nI told him what I thought I needed based on what had helped in the past; but also that I trust him over my opinion bc obviously my past regiment had not really helped me bc I had stagnated overall even when had all the help I thought I needed over the last 5 years..\n\nAmazingly he was able to understand my root problem better than I did honesly and prescribed a medication that has litterally changed my Life.\n\nFor the 1st time in 8 years or so, I feel free from the over whelming anxiety and sadness and fear that had ruled me for a decade and he did it with a novel approach that I didnt even know existed and had never heard of as a medication for my underlying issue of anxiety/depression/and an inablity to take needed action.\n\nHow I had never been diagnosed this way or offered this class of medication is just an example of the stigma and problems still around mental health..  Perhaps my previous doctors were influenced by the labels and words used to describe some of my symptoms which caused them to think I didnt need this form of treatment.. I dont know but there are medicines that will help you that you may never have heard of like me.\n\nIt actually makes my brain WORK the right way Versus just numbing it, and covering over the problem .\n\nI am now in a position that I am safely tapering off the medication that I dont truly need to be on(faster than I thought I could) and put that \"mistake\" in the past and I am focused on my life and my future for the first time in years.\n\nNever give up hope! Dont settle for bad help or mediocre treatment that just helps you \"get by\" each day as long as you have your \"meds\"\n\nIf you not thriving or on a path too it dont settle like I did for way too long.\n\nDont assume you know the only things that will work for you and be TOTALLY honest with the Dr so he can help you .\n\nIm even getting back into old hobbies and my next new career goals and even back into My Faith in God.\n\nIf you or someone you know is struggling please take this as a message of hope that its never too late and never hopeless.\n\nGod Bless and Thank you to Dr. Islam and Thanks to President Trump or whoever in the Government made this Tele-Medicine / new video conferencing option available. Without it I may never have found Dr. Islam.\n\nThank You Dr. Islam\n\nSincerely,\n\nMatt", "pics": null, "resp": null, "gmap_id": "0x888923d657d7a777:0xd29d293725d9d7a7"}
{"user_id": "102359253690504623154", "name": "Hannah Yates", "time": 1612819963831, "rating": 1.0, "text": "They only take Blue Cross insurance.", "pics": null, "resp": null, "gmap_id": "0x888923d657d7a777:0xd29d293725d9d7a7"}
{"user_id": "102713433949230005870", "name": "fazle matin", "time": 1580060679657, "rating": 5.0, "text": "Wonderful clinic and physicians. Caring and kind.", "pics": null, "resp": null, "gmap_id": "0x888923d657d7a777:0xd29d293725d9d7a7"}
{"user_id": "102309511909508219363", "name": "Rxseirixlle Geabov", "time": 1581656140971, "rating": 5.0, "text": "Amazing !!! Amazing !!!!! Amazing!!!!! Love that place😊", "pics": null, "resp": null, "gmap_id": "0x888923d657d7a777:0xd29d293725d9d7a7"}
