{"user_id": "115416900230140802130", "name": "Keith Turner", "time": 1597859516778, "rating": 1.0, "text": "I called to make an appointment around June 1,2020. After I made the appointment, another lady called me back. She said since I canceled my last 2 appointments, and I hadn’t been there in 13 months, they were not taking new patients. Now, they made me an appointment at first, and I canceled my last 2 appointments because I was feeling much better, no need to go back in my opinion. I found this to be such a lack in empathy.", "pics": null, "resp": null, "gmap_id": "0x888ced42be3d76b3:0xefe03d81510ea513"}
{"user_id": "105077682064802758615", "name": "Jillian Harmon", "time": 1600695727955, "rating": 5.0, "text": "They are caring a teslly care about each patient. The entire team there makes you feel judge free and honestly these peoplle have touched my heart and has made me look at life in a positive way. I'll never be able to sat thank you to Dr. Estep and the nurse's.", "pics": null, "resp": null, "gmap_id": "0x888ced42be3d76b3:0xefe03d81510ea513"}
{"user_id": "108025956151114532978", "name": "Lillian Dauby", "time": 1594243800288, "rating": 1.0, "text": "I do not know about the other doctors at EAPS, but I went there for ten years and was very happy with my doctor.  Then he semi-retired and I was handed over to the young and inexperienced Dr. Hadley.  She was pleasant at the first visit, but it wasn't too long before she showed her true colors .  She betrayed me in a multitude of ways including  the worst a medical doctor can do; she lied to me.  Repeatedly.  New doctors are coming to the office soon, so if you really need help l would recommend you hold on to August.  DO NOT see Dr. Hadley.", "pics": null, "resp": null, "gmap_id": "0x888ced42be3d76b3:0xefe03d81510ea513"}
{"user_id": "105079403779093320405", "name": "Streetninja 0909", "time": 1538451355036, "rating": 3.0, "text": "Very nice people and a very welcoming atmosphere. Update: it has come to my attention that a letter sent from my previous doctor has not arrived even though I have proof that it was sent twice. It was sent by fax and by USPS mail 11 days before my appointment. However, they could not find it when I was there. I am definitely taking off points for that because I can prove that it was sent. Sorry.", "pics": null, "resp": null, "gmap_id": "0x888ced42be3d76b3:0xefe03d81510ea513"}
{"user_id": "111701260111313365931", "name": "Gene and Marilyn McFalls", "time": 1579034168388, "rating": 5.0, "text": "East Alabama Hospital was amazing. They are well staffed with a excellent model of continous care and patient wellness modality. The emergency room was clean, efficient with physicians such as Dr. Leach that offer a platform of over 20 years worth of  experience in treating many er types of situations. My family and I were  impressed and rate this facilty Five Top Stars. Every single face that we saw working there had smiles, they were energetic, professional, courteous and OUTSTANDING. if I could give them a a standing ovation...I would.  Kudos to East Hospital.", "pics": null, "resp": null, "gmap_id": "0x888ced42be3d76b3:0xefe03d81510ea513"}
{"user_id": "107475795469482922762", "name": "CF Warr", "time": 1538410664455, "rating": 5.0, "text": "Friendly staff, exceptional physicians. Welcoming environment. So thankful for my physician and his staff", "pics": null, "resp": null, "gmap_id": "0x888ced42be3d76b3:0xefe03d81510ea513"}
