{"user_id": "111738476475497119495", "name": "Max Toohey", "time": 1619434369978, "rating": 5.0, "text": "Amazing experience. I was blown away with the details that she knew about my life that not many people know. Answered all my questions I had, I will definitely be going back. Highly recommend !", "pics": null, "resp": {"time": 1619490346621, "text": "Hi Max !\nThanks so much for the review I look forward to meeting with you again soon ..feel free to connect with me anytime"}, "gmap_id": "0x888a3a4d157d3d7b:0xee4d3a7696b5480c"}
{"user_id": "103049189906478524257", "name": "Simply Amaria", "time": 1626559941786, "rating": 5.0, "text": "It was amazing! She told me everything I needed to know and even things I wasn’t aware of and things that are to come in the future. Will most definitely go back.", "pics": null, "resp": null, "gmap_id": "0x888a3a4d157d3d7b:0xee4d3a7696b5480c"}
{"user_id": "107763223765425616812", "name": "Stacey Smith Kimbrell", "time": 1622523537126, "rating": 5.0, "text": "Gave me & my fiance such a good reading. Very on point. She knew so much that she couldn't have known. Will be back for sure. Thank you so much for seeing us.", "pics": null, "resp": null, "gmap_id": "0x888a3a4d157d3d7b:0xee4d3a7696b5480c"}
{"user_id": "117555377051285525050", "name": "Julie Willingham", "time": 1617824700194, "rating": 5.0, "text": "I think Anna is great! Going into this, I just wanted to have my palm read for the experience to say that I have done it. I was mind blown and went back for the tarot card reading where she dove deep into my past, present, and future. This has gone from a bucket list experience to type of counseling and guidance. Anna helps you see not only what’s going on around you, but within yourself. I highly recommend her and giving it a shot.", "pics": null, "resp": null, "gmap_id": "0x888a3a4d157d3d7b:0xee4d3a7696b5480c"}
{"user_id": "103736800467609655867", "name": "Amanda Daniel", "time": 1605339532142, "rating": 5.0, "text": "I’ve had several tarot reading done by different people and I can easily say that, hands down, this was the best, most accurate and detailed reading I have ever had! First of all, Anna was kind enough to stay and read for me even though I was fairly late arriving. She was very attentive to my question and concern and gave me a lot of insight about the issue at hand but also was able to pick up on numerous other energies and transits currently taking place in my life. I was absolutely astonished at how many specific details she was able to point out and offer insight about. For example, several details that i had not even included in my questions were addressed. I can’t wait to go back!", "pics": null, "resp": null, "gmap_id": "0x888a3a4d157d3d7b:0xee4d3a7696b5480c"}
{"user_id": "100279527478742727139", "name": "Alyssa Lauren", "time": 1603247737507, "rating": 5.0, "text": "Anna is absolutely amazing! Her readings are spot on and she is so caring! I have been seeing her for 8 months now and she has been phenomenal and helped me through so much. You will not go wrong by allowing Anna to lead you in the right direction. She is a Godly woman who will always put God first. Thank you Anna for all you do.", "pics": null, "resp": null, "gmap_id": "0x888a3a4d157d3d7b:0xee4d3a7696b5480c"}
{"user_id": "105058422910614901996", "name": "Summer Guyton", "time": 1619739682705, "rating": 5.0, "text": "It was very accurate to the point it was almost scary she is AMAZING!!!! Highly recommended", "pics": null, "resp": {"time": 1619743499209, "text": "Hi summer .. it was a a pleasure meeting with u .. Thank u so much for taking time to leave review I looking forward to meeting with u again with any questions or concerns u may have .. I’ve hoped to have shed light and love and that u left my office feeling encouraged :)"}, "gmap_id": "0x888a3a4d157d3d7b:0xee4d3a7696b5480c"}
{"user_id": "104761987305623334183", "name": "lauren justice", "time": 1591648609908, "rating": 5.0, "text": "Mrs Ann is the absolute greatest and is SO spot on! She’s got an amazing personality and is the sweetest. I feel so much more at peace after my session. I will be coming back to Alabama for this", "pics": null, "resp": null, "gmap_id": "0x888a3a4d157d3d7b:0xee4d3a7696b5480c"}
{"user_id": "100550326041198740598", "name": "Patricia McMinn", "time": 1592236019690, "rating": 5.0, "text": "Absolutely right on. If you want the TRUTH and help, Anna is your answer. Don't go anywhere else, you'll be wasting your money & time. God Bless you Anna 🙏💕", "pics": null, "resp": null, "gmap_id": "0x888a3a4d157d3d7b:0xee4d3a7696b5480c"}
{"user_id": "115145690644038237854", "name": "Jennifer Morgan", "time": 1576898053328, "rating": 5.0, "text": "Anna gave me something I never thought was possible she gave me closure that I had to have to help me get better!! She had no idea I gave no clues and she changed my life I can honestly say she is a godly woman who encourages me to seek God as well to help me to continue to get peace in my life!! Anna won’t only change  your life but she will give you the peace your seeking!!❤️❤️❤️❤️", "pics": null, "resp": {"time": 1576902524644, "text": "Thank you !!!!\nI don know where to begin .. I’m truly\ntouched by your kind words\nThank you so much for such a positive heartfelt review .. it’s  been a pleasure\nReading for you .. don’t hesitate reaching out if you need anything\nI’m here anytime .. thanks again .. god bless 🙏🏻"}, "gmap_id": "0x888a3a4d157d3d7b:0xee4d3a7696b5480c"}
{"user_id": "107086938905132930781", "name": "Amanda Robertson", "time": 1580793547355, "rating": 5.0, "text": "Miss Ann was so nice! She told me so many details in my tarot reading, things I didnt know she would even be able to tell me! She gave me closure on the past, and eased my mind about my present situation and future! I will recommend her to everyone I know! I would give her 100 stars if I could! Thank you so much!", "pics": null, "resp": {"time": 1580859366870, "text": "It was an absolute pleasure reading for you .. thank you so much for such positive feed back .. god bless you and and your business .. keep me posted We will talk again soon 🙏🏻🙏🏻"}, "gmap_id": "0x888a3a4d157d3d7b:0xee4d3a7696b5480c"}
{"user_id": "107795753629946987867", "name": "Natalie Torres", "time": 1593973320460, "rating": 5.0, "text": "I loved how spot on she was about my life without knowing anything about me. She's amazing!", "pics": null, "resp": {"time": 1593977135722, "text": "Thank you  for positive feed back\nI appreciate you taking time to leave a good review .. I’m looking forward to speaking with you again :)"}, "gmap_id": "0x888a3a4d157d3d7b:0xee4d3a7696b5480c"}
{"user_id": "101896530326497988585", "name": "Melanie Zinn", "time": 1580591714111, "rating": 2.0, "text": "Nothing I didn't already know. Didn't really tell me my future at all and the one REALLY important question I needed answered more than anything, she couldn't answer. I believe she got my children and past relationships mixed up in the reading and it was just all jumbled around.\n\nI was so excited to go because of all her great reviews, but I got absolutely no closure and honestly no \"future reading\" basically a reading telling me what's going on currently (which I'm aware of and living, so no help there). Drove over an hour. Just very disappointed. Really hoped to get some clear answers. She was very sweet, so I will give her that, but as far as getting anything from the reading....I pulled over in tears because nothing was answered and just disappointed. I got no closure.", "pics": null, "resp": null, "gmap_id": "0x888a3a4d157d3d7b:0xee4d3a7696b5480c"}
{"user_id": "101312445013109615444", "name": "Ratchanee Mitchell", "time": 1585613173659, "rating": 4.0, "text": "I had 2 readings done by Ann. The first one was about 6 months ago, and it was pretty accurate. The second one was about a month, and that one was pretty accurat as well. Everything she has told me from the 1st reading, and 2nd reading has happened.  It gave me clarity.  Very happy with my readings.  Thank You!", "pics": null, "resp": null, "gmap_id": "0x888a3a4d157d3d7b:0xee4d3a7696b5480c"}
{"user_id": "116177256386508156322", "name": "alex angal walker", "time": 1575422449159, "rating": 5.0, "text": "Had the most amazing experience with Anna. Everything was spot on! She really opened my eyes ! Can't wait to go back for another tarot card reading! Highly recommend!\n\nI recently  went back to see her again and I must say I am very satisfied with my reading from her. I have been dealing with a lot and the stuff she told me put me at ease. I highly recommend Anna she is absolutely amazing!!!!", "pics": null, "resp": {"time": 1576902684185, "text": "Hi angal ,\nI’m just now reading your review and your follow up review as well\nYour have a wonderful spirit\nI’m glad i was able to help you with some peace of mind .. feel free to reach out when you can ... god bless"}, "gmap_id": "0x888a3a4d157d3d7b:0xee4d3a7696b5480c"}
{"user_id": "113988726975643938104", "name": "C Brown", "time": 1561766423456, "rating": 5.0, "text": "Ann was amazing! I traveled an hour away just to see her, and it was so worth it. She went into so much detail about my life and told me the truth. Going into the reading, I was very confused in some areas of my life, but after the reading, I was out at ease. I now have a clear understanding of where my life is going and what I need to let go of. I highly recommend Ann!", "pics": null, "resp": {"time": 1561767132402, "text": "Truly a pleasure to speak with you today... god bless you on your journey .. keep me posted !!"}, "gmap_id": "0x888a3a4d157d3d7b:0xee4d3a7696b5480c"}
{"user_id": "114079172532144989455", "name": "Rachel Nhi Lam", "time": 1536992000975, "rating": 5.0, "text": "Mrs. Anna is one of the sweetest people I've ever met! Not gonna lie, she's nothing like I expected her to be. I just met her once but I can already tell she's an honest and caring woman. She keeps talking about her kids and I think it was adorable. I went to her place a few days ago for the tarot cards reading and I'm so amazed about it the whole time. Everything she said that happened to me was true. Like i was so surprised. I really hope the thing she predicted is really gonna happen. It was such a great experience, 10/10 recommended.", "pics": null, "resp": null, "gmap_id": "0x888a3a4d157d3d7b:0xee4d3a7696b5480c"}
{"user_id": "103710320902372465287", "name": "Kimberly Gillespie", "time": 1580773164917, "rating": 5.0, "text": "My best friend went and seen her and it changed her life for the good. I dont think she would have ever healed if it wasn't for Ana.", "pics": null, "resp": {"time": 1580776999898, "text": "I’m so touched by your kind words ...\nPeople like y’all really make me love what I do .. I pray to continue to be there for others in their time of need .. god bless you both !\nReach out any time your ready and we can set up an appt."}, "gmap_id": "0x888a3a4d157d3d7b:0xee4d3a7696b5480c"}
{"user_id": "115908343995118815126", "name": "Eliza George", "time": 1573351684691, "rating": 5.0, "text": "Really enjoyed my experience! She was very kind and gave me an unbiased reading. I will be back!", "pics": null, "resp": null, "gmap_id": "0x888a3a4d157d3d7b:0xee4d3a7696b5480c"}
{"user_id": "115076848826681555192", "name": "james warren", "time": 1545430127139, "rating": 5.0, "text": "Everything she told me was so true, even knew I went through a rough watch from 2016 till 2017. I recommend her to  everyone who wants a good reading. Such a nice person.", "pics": null, "resp": null, "gmap_id": "0x888a3a4d157d3d7b:0xee4d3a7696b5480c"}
{"user_id": "105905191839086087561", "name": "Kaylin Shuck", "time": 1573340641619, "rating": 5.0, "text": "Absolutely fantastic , super on point with everything . Knowing no back ground history she hit the head on the nail .", "pics": null, "resp": null, "gmap_id": "0x888a3a4d157d3d7b:0xee4d3a7696b5480c"}
{"user_id": "104735620868290482336", "name": "Miranda Hughes", "time": 1564585434761, "rating": 5.0, "text": "She was right on point!  She knew about everything!  I will continue to use her and would recommend her to anyone!  I LOVE HER!!!!!!", "pics": null, "resp": null, "gmap_id": "0x888a3a4d157d3d7b:0xee4d3a7696b5480c"}
{"user_id": "100701950243534378041", "name": "Austin Bell", "time": 1436730871272, "rating": 5.0, "text": "Miss. Ann was amazing. I had a tarot card reading from her a few months ago and everything was spot on! And somethings things I had no idea what she was talking about just came to pass. I highly recommend going to see her!\n\nThe one thing I would say is call before and make a appointment to cut down on the waiting time!", "pics": null, "resp": null, "gmap_id": "0x888a3a4d157d3d7b:0xee4d3a7696b5480c"}
{"user_id": "109827438828168705256", "name": "caroline dunsmore", "time": 1547854816139, "rating": 5.0, "text": "Very honest and caring individual. Keeps it real and has your best interest at heart.", "pics": null, "resp": null, "gmap_id": "0x888a3a4d157d3d7b:0xee4d3a7696b5480c"}
{"user_id": "117543911694940569228", "name": "Jamecia George", "time": 1541625891204, "rating": 5.0, "text": "I loved her! She helped me out a lot!! Will definitely be going back she’s so accurate & sweet!", "pics": null, "resp": null, "gmap_id": "0x888a3a4d157d3d7b:0xee4d3a7696b5480c"}
{"user_id": "112617004676481739669", "name": "Torica James", "time": 1537408728446, "rating": 5.0, "text": "I really don’t kno where to begin..\nI’m not the one to ever leave reviews but Mrs Ann deserves credit where it due !\nOf course I walked In Skeptical just because of everything I ever heard about psychics in general .. now don’t get me wrong I’ve always been intrigued .. but also iffy at same time ...with all that being said .. mrs Ann blew my mind I only told her my name and date of birth and she was spot on with her detailed info .. she gave me great insight and also advised me against a a move I was currently wondering about ..\nI can go on and on .. but some things I choose remain private between me and her ..\nI will def be seeing her again ...", "pics": null, "resp": null, "gmap_id": "0x888a3a4d157d3d7b:0xee4d3a7696b5480c"}
{"user_id": "107845059115455151452", "name": "Laquita Kirksey", "time": 1537820260577, "rating": 5.0, "text": "She is a amazing person everything that she tells you she be right about it and a very sweet person and is willing to help you out and very understanding she is just everything and more", "pics": null, "resp": null, "gmap_id": "0x888a3a4d157d3d7b:0xee4d3a7696b5480c"}
{"user_id": "111154637073518285573", "name": "Staci Fleener", "time": 1622152309926, "rating": 5.0, "text": "It was the first time having a reading for me and one of my friends, another friend has had a lot of readings but not my Nancy. We all LOVED her and got great relavent information.", "pics": null, "resp": {"time": 1622163304026, "text": "Thank you 😊"}, "gmap_id": "0x889a0d9a5c7f1453:0x322b0fd391d3c8e0"}
{"user_id": "104140906636911258577", "name": "Monster Babe", "time": 1590703634211, "rating": 5.0, "text": "Nancy was so sweet! We had to do a reading over the phone because of covid 19 so I was skeptical. But she answered things that I was thinking. She is very gifted. I will definitely be keeping touch with her for future readings.", "pics": null, "resp": null, "gmap_id": "0x889a0d9a5c7f1453:0x322b0fd391d3c8e0"}
{"user_id": "116088877286258726273", "name": "Michael Zoladz (Mysteriez77)", "time": 1590691392789, "rating": 5.0, "text": "She is extremely gifted! She answered all my questions and brought up things I hadn't even thought of. I highly recommend her and she is the real deal, she was spot on with everything.", "pics": null, "resp": {"time": 1622163459744, "text": "Thank you 🙂"}, "gmap_id": "0x889a0d9a5c7f1453:0x322b0fd391d3c8e0"}
{"user_id": "103865909479594572077", "name": "Kim FitzGerald", "time": 1517691166652, "rating": 5.0, "text": "Really want want to thank Nancy for her spiritual guidance. Nancy is a dedicated and gifted person!. I am very grateful I contacted her. She made a huge postive impact in my life. Would highly recommend!!!", "pics": null, "resp": null, "gmap_id": "0x889a0d9a5c7f1453:0x322b0fd391d3c8e0"}
{"user_id": "103465032274917423847", "name": "Khrystal Washington", "time": 1619605356808, "rating": 5.0, "text": "The staff and doctors are very welcoming, pleasant and professional. My dog has no fear of them at all. The doctors are very thorough in explaining resolutions to any issues your fur baby may be having. We've been going here since my pup was 8 weeks old, almost a year now. Appointments are also accommodating on short notice.", "pics": null, "resp": null, "gmap_id": "0x88891bda8e0f8e5f:0xd3742d17e60fd6fe"}
{"user_id": "110425628025033159951", "name": "Joshua Davis", "time": 1621709171560, "rating": 4.0, "text": "Great place to get coffee and sit for a spell.", "pics": null, "resp": null, "gmap_id": "0x88891bda8e0f8e5f:0xd3742d17e60fd6fe"}
{"user_id": "105367058772411023788", "name": "Ghost Tracker Jenny", "time": 1592060213254, "rating": 5.0, "text": "It was actually Books Beans and Candles that I visited. But I think Rune is their psychic reading area. Right now, the readings and upstairs area is closed until the viral crisis ends. But the rest of the store is open. Love going here. I don't get to go as often as I would like due to distance from home. But with my quarterly visits, they never disappoint. Very friendly staff and can answer almost any question you may have.", "pics": null, "resp": null, "gmap_id": "0x88891bda8e0f8e5f:0xd3742d17e60fd6fe"}
{"user_id": "110122495376028956983", "name": "rb S", "time": 1621102449008, "rating": 5.0, "text": "Great reads!", "pics": null, "resp": null, "gmap_id": "0x88891bda8e0f8e5f:0xd3742d17e60fd6fe"}
{"user_id": "115259341791525040702", "name": "Pat Kelly", "time": 1622076936117, "rating": 5.0, "text": "See for yourself", "pics": null, "resp": null, "gmap_id": "0x88891bda8e0f8e5f:0xd3742d17e60fd6fe"}
{"user_id": "103109476263785727619", "name": "Frank Watkins", "time": 1617008339348, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x88891bda8e0f8e5f:0xd3742d17e60fd6fe"}
