{"user_id": "111857240828670827381", "name": "Lindsey Taylor", "time": 1606316193019, "rating": 2.0, "text": "The food is OK. The ladies that took my order seemed nice. The little girl that was at the cash register was very rude. She sat there looking at her watch checking her message before she rang me up. I had to wait for her to get finished reading her message! Two simple words after paying \" Thank you\" goes a long ways. But I guess for some people it's too hard for them. People like that little girl shouldn't be working with the public. I will be going across the road from now on.", "pics": null, "resp": {"time": 1606834999408, "text": "We truly apologize for the unpleasant experience you had at our location. Can you please tell us the day and time this happened, so we can take necessary actions.You can email me directly   clevelandshellal@gmail.com\nThank you"}, "gmap_id": "0x8889bd8f60ee3901:0x450df744368f1b4a"}
{"user_id": "108990877564006761341", "name": "Karla contreras", "time": 1587547763620, "rating": 5.0, "text": "i live in north carolina and but EVERY SINGLE i come back down to bama i HAVE to stop here because the chicken tenders, potato wedges , corn dogs, and pizza rolls bring me so much nostalgia from when i was younger... the chicken tenders are always so crispy and perfect and the potato wedges never fail to amaze my taste buds with honey mustard dude 10/10 recommend.. like #willworkforchickentendersandpotatowedges", "pics": null, "resp": null, "gmap_id": "0x8889bd8f60ee3901:0x450df744368f1b4a"}
{"user_id": "109566574445535391137", "name": "Christian Evered", "time": 1528289470397, "rating": 1.0, "text": "I work third shift at the Tyson plant just down the road. This is a quick stop on my way home in the morning for a bite to eat, but I will not be back. The help is rude and after a long night at work and as a semi-regular paying customer I do not deserve to be treated as an inconvenience or ignored completely as I'm trying to explain my order. Logan's is about 12-15 minutes out of my way and a bit more expensive but for the bit higher quality of food and much higher quality of help it is worth it to have a decent meal and positive experience than this dealing with this unpleasantness.", "pics": null, "resp": null, "gmap_id": "0x8889bd8f60ee3901:0x450df744368f1b4a"}
{"user_id": "108394566908172488795", "name": "Eddy Sanchez", "time": 1596151584358, "rating": 1.0, "text": "The food isn’t that good and two of the breakfast staff got my order wrong then told me it’s what I asked for then decided to rude after instead of saying I’m sorry let me fix it for you.", "pics": null, "resp": null, "gmap_id": "0x8889bd8f60ee3901:0x450df744368f1b4a"}
{"user_id": "109379083299769021946", "name": "Matt Hawkins", "time": 1591147852770, "rating": 1.0, "text": "Asked for wheat toast and would not do it for me", "pics": null, "resp": null, "gmap_id": "0x8889bd8f60ee3901:0x450df744368f1b4a"}
{"user_id": "110327010706193019346", "name": "Justin Fountain", "time": 1492140948026, "rating": 1.0, "text": "Only shell gas station around. They have a hot bar for food and even though they have great breakfast, there lunch meals are very bad. I got a chicken tender dinner with mac and cheese and turnip greens. They charged me 0.30 cents a cup for honey mustard. I understand it costs them, but at the same time no other place charges for theirs unless you get a few. Not one or two. My friend has complained about the dumplings he received three times since and not a single worker cared.", "pics": null, "resp": null, "gmap_id": "0x8889bd8f60ee3901:0x450df744368f1b4a"}
{"user_id": "108258752501769055174", "name": "Jenny Ellison", "time": 1559843684058, "rating": 1.0, "text": "I will not be back.  There were 4 female employees at the counter.  Two of them were using profanity talking about another employee who was late and talking about the boss.  They knew I was there and never stopped talking.", "pics": null, "resp": {"time": 1559846340598, "text": "We truly apologize for the unpleasant experience you had at our location. Can you please tell us the day and time this happened, so we can take necessary actions.Thank you."}, "gmap_id": "0x8889bd8f60ee3901:0x450df744368f1b4a"}
{"user_id": "100338536039176256912", "name": "Brandy Thornell", "time": 1584151010381, "rating": 5.0, "text": "The food is always amazing !!!!", "pics": null, "resp": null, "gmap_id": "0x8889bd8f60ee3901:0x450df744368f1b4a"}
{"user_id": "116462422850898082509", "name": "Emma Marie", "time": 1527808891712, "rating": 5.0, "text": "Amazing egg rolls", "pics": null, "resp": null, "gmap_id": "0x8889bd8f60ee3901:0x450df744368f1b4a"}
{"user_id": "117307257828156264224", "name": "Eleashya Bowser", "time": 1627701055740, "rating": 1.0, "text": "Just don’t! Looks promising…..🤮", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPY6ZEDN1zAiY7OEzuzmNKDR2ma3S-yZcFaFow=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMZgxcmjuxB--6_A72UayZMDEaBJ3AKOgcaixU=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipODIep1gn52SKWvWsNjQOwpx6y7iPmWyAlPCKs=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888ebf1f2c75ac91:0x218a4d94cfea338d"}
{"user_id": "112101657598963762651", "name": "WU Doc", "time": 1628879236155, "rating": 1.0, "text": "One star too many, I guess because no waiting to pump.  Don't expect to clean windshield, check oil,use a clean restroom; considered yourself lucky to get a cold drink. Sad state of affairs at this Sunoco.", "pics": null, "resp": null, "gmap_id": "0x888ebf1f2c75ac91:0x218a4d94cfea338d"}
{"user_id": "103974185985820297581", "name": "Amy Tennant", "time": 1599518564085, "rating": 1.0, "text": "The owner of this gas station has signs posted encouraging customers to buy an item to maintain clean restrooms. We went in to poop covered toilets, no toilet paper in either bathroom, and no hand soap in either bathroom. I had to go ask for toilet paper. I asked if he would restock and he just stared at me. I would have happily bought snacks and drinks for my four children and spent money but didn’t because of how rude he was and the fact that he purposefully hoards toilet paper.", "pics": null, "resp": null, "gmap_id": "0x888ebf1f2c75ac91:0x218a4d94cfea338d"}
{"user_id": "112311886062762733798", "name": "Darrell Holt", "time": 1534091207292, "rating": 5.0, "text": "The outside of the building doesn’t do it justice. Walk inside and it’s by far one of the cleanest gas stations I’ve been inside and the rest rooms are the cleanest as well. The man that was working was extremely nice as well. 5*", "pics": null, "resp": null, "gmap_id": "0x888ebf1f2c75ac91:0x218a4d94cfea338d"}
{"user_id": "111605003650223802510", "name": "raheel rangoonwala", "time": 1463484351195, "rating": 5.0, "text": "Clean restrooms good food nice items", "pics": null, "resp": null, "gmap_id": "0x888ebf1f2c75ac91:0x218a4d94cfea338d"}
{"user_id": "106563693832427922322", "name": "Mark Williams", "time": 1495238782769, "rating": 1.0, "text": "Seriously the clerk asked if I was buying anything after using the restroom, I went from getting something to not.", "pics": null, "resp": null, "gmap_id": "0x888ebf1f2c75ac91:0x218a4d94cfea338d"}
{"user_id": "101933270584461944749", "name": "Mahbub Ferdous", "time": 1505335451514, "rating": 5.0, "text": "Clean restroom & nice employee", "pics": null, "resp": null, "gmap_id": "0x888ebf1f2c75ac91:0x218a4d94cfea338d"}
{"user_id": "115975145582787663267", "name": "Tracey Wright", "time": 1465850053367, "rating": 4.0, "text": "Blond Bell at Sunoco. Text us, wm4w", "pics": null, "resp": null, "gmap_id": "0x888ebf1f2c75ac91:0x218a4d94cfea338d"}
{"user_id": "111375370551631259973", "name": "Ben H", "time": 1617796211277, "rating": 1.0, "text": "This used to be a pretty decent fuel station with a pretty good deli. But since it has changed owners and turned into some kind of hybrid circle k, BP, whatever it is, this place has just gotten rundown and just plain gross. The deli, the actual store, the restrooms, everything. At 6:30 A.M., the coffee bar was out of everything but decaf, the creamer machines are out of service, and the whole thing looked like kindergartners had played in it! If this is in fact a Circle K, it is one of the sorriest ones I have ever been in. If you can just hold it for one more exit, I would highly recommend passing this place on by.", "pics": null, "resp": null, "gmap_id": "0x888b035a615df819:0x86f717c202ff02da"}
{"user_id": "107893189561298809367", "name": "Thomas Earp", "time": 1593803657589, "rating": 1.0, "text": "Prepaid for $20 on diesel in an F250 while helping our daughter move and they held $300 for about a week. The bank shut off our card because of suspected fraudulent activity immediately. Called to find out what happened, everyone was very rude and less than helpful. We had to wait for new cards to be mailed out. We haven't been back since, there are plenty of much better choices in the area, and we have told all of our friends to be very cautious. Terrible, terrible  choice to do business here. It was much better prior to changing from BP. I just feel sorry for people traveling that don't know better.", "pics": null, "resp": {"time": 1594736626148, "text": "Hi Thomas, we are sorry about your recent experience. We have passed on your message to our local management team. Please feel free to contact us via email https:// www.circlek.com/contact-form for further assistance."}, "gmap_id": "0x888b035a615df819:0x86f717c202ff02da"}
{"user_id": "100099850690582019914", "name": "Amber Works", "time": 1589854527199, "rating": 1.0, "text": "We just stopped here to get a full tank of gas and drinks for the rd, we have been on the Rd for hours so of course my littles needed a bathroom so we went to use it but they are closed only for truckers showers instead they had Porter potties , when asking about the bathroom the girl at the register snaps at me and says I should not have my kids out in the first place. First of all that's none of your business second of all I'm a paying customer. Horrible attitude from the cashier and the other one was just outside smoking right in front of the door some folks like myself can't stand the smell so shouldn't be doing that. Both cashier's cashiers need to learn better communication because yelling isn't what you do to a paying customer.", "pics": null, "resp": {"time": 1591697431598, "text": "Hi Amber, thank you for letting us know and we are sorry about your experience. We have passed on your message to our local management team."}, "gmap_id": "0x888b035a615df819:0x86f717c202ff02da"}
{"user_id": "104534806619099275934", "name": "Jacob Knighton", "time": 1591191926274, "rating": 1.0, "text": "Don't shop here\nMy debit number was stolen and used here twice each for $150 the store is probably in on it as I still have the card. Who charges $150 to a card without the card being present", "pics": null, "resp": {"time": 1591895008863, "text": "Hi Jacob, sorry to hear about someone using your card without your permission. We advise you to\ncontact your bank, and cancel your card. Please feel free to contact us at https://\nwww.circlek.com/contact-form for further assistance."}, "gmap_id": "0x888b035a615df819:0x86f717c202ff02da"}
{"user_id": "100125167742944669507", "name": "Pryor Logistics", "time": 1588782238765, "rating": 1.0, "text": "This is the worst gas station ever for truckers. They keep your card for diesel purchases. Never heard of that!!!!!", "pics": null, "resp": {"time": 1591694619728, "text": "Hi Pryor, thank you for letting us know and we are sorry about your experience. We have passed on your message to our local management team."}, "gmap_id": "0x888b035a615df819:0x86f717c202ff02da"}
{"user_id": "113665236942624656837", "name": "Matthew Brown", "time": 1611896803248, "rating": 1.0, "text": "Lady is incredibly rude and the large craft beer selection sign is a joke dont waste your time here", "pics": null, "resp": null, "gmap_id": "0x886286a520069c23:0x6545ff664656c5a8"}
{"user_id": "103272727603730106033", "name": "Kayla Hitt", "time": 1516729102215, "rating": 1.0, "text": "So I've dropped my car off at Mr. Shine to get my car detailed. I'm waiting on my mom to pick me up so I went inside the Chevron on 6th ave to buy some water & just kind of like stand by the door (I'm assuming since Mr. Shine is in their parking lot, they are on good terms). The lady asked me if she could help after I had purchased items from her business & I explained the situation.\nshe proceeded to kick me out ! I stood there dumbfounded & muttered something like \"but I even bought something..\" She said that it was her business & I had to leave. So yeah, it really hurt my feelings & pissed me off so I will NEVER spend a dollar ever & I beg you guys not to also.", "pics": null, "resp": null, "gmap_id": "0x886286a520069c23:0x6545ff664656c5a8"}
{"user_id": "104138028254528109968", "name": "vkutz", "time": 1535549739051, "rating": 1.0, "text": "Quite possibly the rudest business in town. The woman running the station is nasty in her treatment of paying customers and even worse if someone stops for assistance or directions. Don't get me started in the restrooms... disgusting filth. No one should ever patronize this hateful establishment.", "pics": null, "resp": null, "gmap_id": "0x886286a520069c23:0x6545ff664656c5a8"}
{"user_id": "101525422127273219471", "name": "R B", "time": 1445355575397, "rating": 1.0, "text": "NO STARS! if that were an option. NASTY bathrooms. Clogged toilet. No paper towels. Good thing it was too nasty for me to use.", "pics": null, "resp": null, "gmap_id": "0x886286a520069c23:0x6545ff664656c5a8"}
{"user_id": "101149276656488635779", "name": "Austin", "time": 1521131141804, "rating": 1.0, "text": "The  large Indian lady working the register is very rude.", "pics": null, "resp": null, "gmap_id": "0x886286a520069c23:0x6545ff664656c5a8"}
{"user_id": "103679833871402204927", "name": "Justin Long", "time": 1517520744826, "rating": 1.0, "text": "The owner kicked my mom out because the only thing she was going to buy was a pack of gum.", "pics": null, "resp": null, "gmap_id": "0x886286a520069c23:0x6545ff664656c5a8"}
{"user_id": "116682733458789824776", "name": "Jeff Cook", "time": 1516729508695, "rating": 1.0, "text": "Rude owner", "pics": null, "resp": null, "gmap_id": "0x886286a520069c23:0x6545ff664656c5a8"}
{"user_id": "106850035606751145506", "name": "Kristin Howell", "time": 1361504094133, "rating": 2.0, "text": "Bathrooms are nasty. Paint peeling off the toilet seat.", "pics": null, "resp": null, "gmap_id": "0x886286a520069c23:0x6545ff664656c5a8"}
{"user_id": "103396691251813083004", "name": "Margaret Chambers", "time": 1609810663630, "rating": 4.0, "text": "Screen on pump I used was almost entirely opaque. I needed to be able to read it for instructions and to see how much gas I was pumping. Fortunately, the nice guy inside was able to give me a receipt, but I shouldn't have had to don  a mask and go inside.", "pics": null, "resp": null, "gmap_id": "0x888c9456428da7dd:0x5d1c550f3e4cd77d"}
{"user_id": "107034906726761785913", "name": "Trey Davis", "time": 1621392161191, "rating": 1.0, "text": "Idk if it's their fault but google maps says open til 11pm and i pulled up at 9:30 and they were closed luckily Exxon was right next to them or I'd been in trouble", "pics": null, "resp": null, "gmap_id": "0x888c9456428da7dd:0x5d1c550f3e4cd77d"}
{"user_id": "105960941325782935773", "name": "Daniel Frederick", "time": 1592164391978, "rating": 5.0, "text": "I have only stopped here just a few times, but every time I have, I have received nothing less than the best customer service. Friendly, polite, and always wanting to b.s., but polite b.s. and fun. This day and age that is hard to find being this upcoming generation gets so offensive lately.  They also went out of their way and did me solid when the mistake was not on them nor mine but a vendors’. “But, we are all human, we hope.”\n\nI will definitely be back again, and again.", "pics": null, "resp": null, "gmap_id": "0x888c9456428da7dd:0x5d1c550f3e4cd77d"}
{"user_id": "115313335388578275198", "name": "Leah Rollins", "time": 1596586503288, "rating": 1.0, "text": "This is worst gas station imagininable you could stop by. The short guy came out of the store and physically tried to fight me and my husband in front my children. And scared my 3 year old so bad he wet himself.", "pics": null, "resp": null, "gmap_id": "0x888c9456428da7dd:0x5d1c550f3e4cd77d"}
{"user_id": "109158630743680182023", "name": "Stephanie Greene", "time": 1563573675021, "rating": 1.0, "text": "On the evening of July 10th I received bad gas from the Sunoco at 2400 West Point Parkway. I was informed by the manager (Joe) that I did get bad gas. He stated that on the morning of July 11th he arrived at the store and reviewed the pump reports, noticed something was wrong and shut the pumps down. Now they are having active construction to fix the issue. I do NOT believe this was intentional.\nHowever, now I have to have repairs to my car that will cost  several thousands of dollars. The manager or owner of the gas station won’t call me back and in person they said there is nothing they can do for me, even though they admitted that I received bad gas.", "pics": null, "resp": null, "gmap_id": "0x888c9456428da7dd:0x5d1c550f3e4cd77d"}
{"user_id": "110165583480615365468", "name": "Jesse Daniels", "time": 1591133306064, "rating": 1.0, "text": "Short guy denied us service and tried to physically fight us, not ideal", "pics": null, "resp": null, "gmap_id": "0x888c9456428da7dd:0x5d1c550f3e4cd77d"}
{"user_id": "116208681608665823206", "name": "Jenn O'Quinn", "time": 1547048137566, "rating": 1.0, "text": "I was waiting patiently to order a baked chicken thigh and roll. The clerk rolled her eyes at me, skipped me, took the driver's order, then proceeded to not serve me. I was quiet, polite, waited patiently for my turn in line, and you're clerk's are apparently racist against whites. I wasn't the only one refused service. Management should done something about this. It's 2019, not 1819, and ALL RACES ARE EQUAL. I'm no better than u bc I'm white and you're no better than me bc you're black. 5 ppl told u I was waiting patiently for u to take my order, said nothing about the wait, I understand y'all were busy. However, for you to ignore me, call me out of my name, and REFUSE to serve me shows what kind of person you are. I'm a Christian, I treat ppl with respect. I treated u with respect even as you so rudely skip me to take the ppl behind me's order.", "pics": null, "resp": null, "gmap_id": "0x888c9456428da7dd:0x5d1c550f3e4cd77d"}
{"user_id": "108223576634657389077", "name": "Laura Culpepper", "time": 1547060780624, "rating": 5.0, "text": "The people that run it are nice.", "pics": null, "resp": null, "gmap_id": "0x888c9456428da7dd:0x5d1c550f3e4cd77d"}
