{"user_id": "106182956764463581523", "name": "Tracy Johnson", "time": 1629303428567, "rating": 4.0, "text": "He was efficient. Came in and listened to my lungs. Quick and easy. He was pushy on getting the Vaccine. I understand why with my condition but My body My choice.", "pics": null, "resp": {"time": 1629304932286, "text": "We love hearing about these experiences! Thank you for your feedback."}, "gmap_id": "0x889a0de4267364d7:0x9162000125f1bd29"}
{"user_id": "102614541854340707899", "name": "Michael Petersen", "time": 1624298429321, "rating": 5.0, "text": "I am a new patient of Dr Proctor... Actually not new, but haven't seen him since covid restrictions kept me at home. He is a well respected doctor in the community, and has been practicing for quite some time. It was very easy to make an appointment to see him, in the reception staff was very friendly. He went step by step over what I needed to do as far as my diagnosis and was very informative. To me that means a lot, easy to understand directions to take medications. I would recommend this doctor any day of the week.", "pics": null, "resp": {"time": 1624649914193, "text": "We sincerely thank you for the positive review! Thank you, and have a fantastic day!"}, "gmap_id": "0x889a0de4267364d7:0x9162000125f1bd29"}
{"user_id": "101133077464226232618", "name": "John Loomis", "time": 1629489362910, "rating": 5.0, "text": "Dr. Proctor was very polite.  He went over my chart my meds.  Went over my background on had happen physically or mental the reasons why I was taking those medications thank.  He was very professional. He answered all my questions.", "pics": null, "resp": {"time": 1629769775016, "text": "We love hearing about these experiences! Thank you, and have a fantastic day!"}, "gmap_id": "0x889a0de4267364d7:0x9162000125f1bd29"}
{"user_id": "113856260014869455920", "name": "Larry Luker", "time": 1621974086327, "rating": 5.0, "text": "Dr. Proctor is a awesome doctor. Hes the best lung doctor around in my book. He really wants to help people.He has helped me so very much.Also his nurses and office workers do a outstanding job.....\n\nI also want Thank them all for helping me. God bless you all..   Larry Luker", "pics": null, "resp": {"time": 1624841158532, "text": "We love hearing about these experiences with our team! Thank you for your feedback."}, "gmap_id": "0x889a0de4267364d7:0x9162000125f1bd29"}
{"user_id": "106196494090333660314", "name": "Retired OBA", "time": 1626544681816, "rating": 5.0, "text": "Doctor Proctor is very thorough. I feel much better with the initial treatment he prescribed. Looking for to test results and Dr Proctor to determine the regiment I need to fully recover and resume all activities I enjoy.", "pics": null, "resp": {"time": 1626661896150, "text": "We are so happy to read such a great review! We love hearing about these experiences with our team! Thank you for your feedback."}, "gmap_id": "0x889a0de4267364d7:0x9162000125f1bd29"}
{"user_id": "109516783150452708574", "name": "Paula Thronesbery", "time": 1626461300259, "rating": 5.0, "text": "Everyone was very friendly and helpful.  Dr. Pictor answered all my questions and was very helpful and friendly.  Also made me not feel like he was side stepping my questions.  I really trust him as my Dr.", "pics": null, "resp": {"time": 1626463624562, "text": "We strive to provide great experiences. Thank you for your feedback and have a fantastic day!"}, "gmap_id": "0x889a0de4267364d7:0x9162000125f1bd29"}
{"user_id": "100662527766523510788", "name": "Tonya Brown", "time": 1629751521949, "rating": 5.0, "text": "Very good Dr, he listens and explains any questions you have", "pics": null, "resp": {"time": 1629931220443, "text": "Thank you for your kind words and this wonderful review!"}, "gmap_id": "0x889a0de4267364d7:0x9162000125f1bd29"}
{"user_id": "105077692755303722318", "name": "Tina Bo", "time": 1625523442685, "rating": 5.0, "text": "Dr. Proctor has been a wonderful doctor to me. He's very good at explaining things in a way I can understand. He is also very blunt regarding my bad habits, and I appreciate that.", "pics": null, "resp": {"time": 1625591604070, "text": "We are always more than happy to assist in the future."}, "gmap_id": "0x889a0de4267364d7:0x9162000125f1bd29"}
{"user_id": "106789356260837785306", "name": "Glen Hoffman", "time": 1619466957964, "rating": 5.0, "text": "I had a very good experience with Dr. Proctor. He always makes me feel important. He is very interested in things I have to say and he is a great listener. He is great at answering my questions very thoroughly. I always look forward to my annual visit.", "pics": null, "resp": {"time": 1619476219462, "text": "Thank you for your comments! We love to hear about these experiences and are always more than happy to assist in the future."}, "gmap_id": "0x889a0de4267364d7:0x9162000125f1bd29"}
{"user_id": "108606494044962329887", "name": "Constance Rawlins", "time": 1628264503107, "rating": 5.0, "text": "Dr. Proctor is a professional pulmonologist and shows genuine concern for his patients. Dr. Proctor takes whatever time is needed to listen to all of your health concerns and never appears to rush out to get to his next patient.", "pics": null, "resp": {"time": 1628355037779, "text": "We strive to provide great experiences. Thank you for your feedback! If you have any further questions, please give us a call. We're always happy to help!"}, "gmap_id": "0x889a0de4267364d7:0x9162000125f1bd29"}
{"user_id": "102665955577173454071", "name": "Jeanette Dill", "time": 1616682410988, "rating": 5.0, "text": "Dr. Proctor  is  a very good doctor.  He takes time to explain  things you don't  understand.  Or question  you may ask. Dr. Proctor staff is courteous  and will take time to talk with you. I recommend  this office for all you needs that Dr. Proctor  provides.", "pics": null, "resp": {"time": 1616701575471, "text": "We are so happy to read such a great review. Feel free to reach out to us if you need anything. Have a wonderful day."}, "gmap_id": "0x889a0de4267364d7:0x9162000125f1bd29"}
{"user_id": "107969777198788358128", "name": "Barbara Hough", "time": 1619124313413, "rating": 5.0, "text": "Dr. Proctor is always very thorough and very responsive to my needs.   The office staff is very courteous.   I highly recommend and appreciate all he's done for my condition.", "pics": null, "resp": {"time": 1619400689524, "text": "We really appreciate your kind feedback and recommendation."}, "gmap_id": "0x889a0de4267364d7:0x9162000125f1bd29"}
{"user_id": "105465592677757797682", "name": "Diane Nowling", "time": 1621273970484, "rating": 5.0, "text": "Dr proctor is a wonderful doctor, he spends a lot of time with his patients an explains everything where you can understand it, I am very pleased to have him as my Pulmanry doctor", "pics": null, "resp": {"time": 1624842054453, "text": "We love hearing about these experiences! Thank you for your feedback."}, "gmap_id": "0x889a0de4267364d7:0x9162000125f1bd29"}
{"user_id": "108266776301678367967", "name": "Stephen Jones", "time": 1620164267699, "rating": 5.0, "text": "Dr Proctors staff has always been professional and courteous. The Doctor himself is thorough and never rushes a visit.", "pics": null, "resp": {"time": 1624843649926, "text": "We love hearing about these experiences! Thank you for your feedback."}, "gmap_id": "0x889a0de4267364d7:0x9162000125f1bd29"}
{"user_id": "118016968581405365374", "name": "Mary Carroll", "time": 1615845139557, "rating": 5.0, "text": "I’ve been seeing Dr. Proctor since 2014 and he’s always been very polite and helpful when it has come to my health. I have sleep apnea and  other sleeping issues that he’s always been able to work with me to get it to where I’m able to sleep and wake up feeling rested. I would recommend him to anyone having issues with sleep or lung problems.", "pics": null, "resp": {"time": 1615990369213, "text": "Thank you so much for sharing this feedback; we really do appreciate it."}, "gmap_id": "0x889a0de4267364d7:0x9162000125f1bd29"}
{"user_id": "114454518769585169166", "name": "Michael Donoghue", "time": 1620863599873, "rating": 5.0, "text": "Good bedside manners, good listener and thorough. Seems to be very knowledgeable.", "pics": null, "resp": {"time": 1624843213444, "text": "Thank you, and have a fantastic day!"}, "gmap_id": "0x889a0de4267364d7:0x9162000125f1bd29"}
{"user_id": "104015475606480934532", "name": "Lore Ballow", "time": 1615229489588, "rating": 5.0, "text": "Great service; polite staff and Dr Proctor is most  helpful, attentive, and knowledgeable. Top notch experience.", "pics": null, "resp": {"time": 1615317601591, "text": "We strive to provide great experiences. Thank you for your feedback!"}, "gmap_id": "0x889a0de4267364d7:0x9162000125f1bd29"}
{"user_id": "110326040638423214535", "name": "Mai-Lek Nicely", "time": 1618533927248, "rating": 5.0, "text": "Friendly staff and nurses. Dr. Proctor is absolutely awesome.", "pics": null, "resp": {"time": 1618606911857, "text": "We sincerely thank you for the positive review!"}, "gmap_id": "0x889a0de4267364d7:0x9162000125f1bd29"}
{"user_id": "110135696564577826463", "name": "Donna Riley-Lein", "time": 1621273146071, "rating": 5.0, "text": "He cares and is a good doctor", "pics": null, "resp": {"time": 1624842131973, "text": "If you have any further questions, please give us a call. We're always happy to help!"}, "gmap_id": "0x889a0de4267364d7:0x9162000125f1bd29"}
{"user_id": "108038763161216462754", "name": "Misty Loffer", "time": 1563931801844, "rating": 5.0, "text": "The office is super clean and the staff are very friendly. Dr Lozano is great with my son and it shows he genuinely cares.", "pics": null, "resp": null, "gmap_id": "0x88891be9aaaaaaab:0x4776893fc32d4125"}
{"user_id": "105427164443612556633", "name": "Elizabeth Anna Arriaga4", "time": 1557877081939, "rating": 5.0, "text": "Dr.Lozano truly is the best, he always takes the time to listen to my concerns about my son, and has always explained everything to me in a way that I understand, i would have no problems in highly recommending him.", "pics": null, "resp": null, "gmap_id": "0x88891be9aaaaaaab:0x4776893fc32d4125"}
{"user_id": "112189320001362835579", "name": "L C", "time": 1568092554365, "rating": 5.0, "text": "Absolutely the best doctor and best staff🙌🏻❤️", "pics": null, "resp": null, "gmap_id": "0x88891be9aaaaaaab:0x4776893fc32d4125"}
{"user_id": "115422622842518265624", "name": "Nichole kennedy", "time": 1553146241743, "rating": 5.0, "text": "Oh my goodness how exciting to know Dr Lozono is closer to where I live. Seriously he is the best . I’ll never forget sitting at Chikdrens Hospital with my mother and being told that my baby girl was gonna need to have a feeding tube. I was in choke and disbelief, this was most definitely not what I was expecting to hear .i’ll never forget his exact words once he helped us to cope with such shocking news. He said oh your gonna love it and he made a little poo noise and said you can give her all her meds through it, it’s the best thing ever. At the time I’m sure my looks at him were like really are you serious, lol. He was exactly right we loved it That is now the first thing I say as well when I find out a new mommy or anyoneelse for that matter is facing a feeding tube. He’s just a god sent seriously . He’s so very compassionate, kind and oh his heart  is just really genuine . You just don’t find many drs with these characteristics. He came up with the best concoction to help treat my daughter and to this day we are still using his method of treatment . Do not even second guess him, he is one of our best . I am so very thankful to this day god placed him on our lives .", "pics": null, "resp": null, "gmap_id": "0x88891be9aaaaaaab:0x4776893fc32d4125"}
{"user_id": "103360233059885321460", "name": "Carrie Leonard", "time": 1539882917548, "rating": 5.0, "text": "He is the best pediatric pulmonary doctor in Alabama.  My daughter has been his patient for 15 years now.", "pics": null, "resp": null, "gmap_id": "0x88891be9aaaaaaab:0x4776893fc32d4125"}
{"user_id": "116182040326165229338", "name": "Summer Smith", "time": 1528226486296, "rating": 5.0, "text": "We love Dr. Lozano", "pics": null, "resp": null, "gmap_id": "0x88891be9aaaaaaab:0x4776893fc32d4125"}
{"user_id": "104046440606287510654", "name": "J R", "time": 1629926252986, "rating": 1.0, "text": "I think this Doctor🙄 Divittorio, is one of the most arrogant and incompetent Docs in Mobile Infirmary which is saying a lot. This guy is the least successful medical professional on the planet with a survival rate of 0% of patients with COVID, unvaccinated, and on ventilator. His words, not mine. He seems to think that's something to brag about to his patients families. Essentially he isn't a doctor but just a caretaker to the afterlife. He is so arrogant that he will NOT pursue all avenues to improve the health of your love one. Then if you try to ask him legitimate questions he gets offended and is too busy to entertain such peasantry concerns. Everyone is entitled to their own opinion but i would not recommend this self described \"loser\" to handle your loved one.", "pics": null, "resp": null, "gmap_id": "0x889a4e1ca74c89e3:0x187d12feda71c7f4"}
{"user_id": "106243903976218184349", "name": "Jean Helms", "time": 1597682655298, "rating": 5.0, "text": "Dr DiVittorio was very knowledgeable and truthful with me about my condition. He treated me well and did not hesitate to refer me to a surgeon when it was called for. I would recommend him to anyone.", "pics": null, "resp": null, "gmap_id": "0x889a4e1ca74c89e3:0x187d12feda71c7f4"}
{"user_id": "111312760298242441199", "name": "Jennifer Weil", "time": 1578091865244, "rating": 1.0, "text": "I wonder if the illustrious Dr. Adrian Divittorio has ever considered using his medical degree in a way that doesn't involve working with patients.  Probably should.  Adrian, if you are reading this, would you consider it?   You would save people the trouble and insult of coming in contact with your caustic temper.  You know, that boiling pot of anger that comes from who knows where, but bubbles over onto elderly cancer patients and their families when they ask about why the patient needs a certain diagnostic test.  That scalds people in hospital waiting rooms when a new growth is discovered and the patient's husband is trembling and being held by his daughter and almost crying, and you wait impatiently for a signature of consent with a look of disgust on your face, before insulting the elderly man when he doesn't consent fast enough to please you.\nThere are other pulmonologists in Mobile who actually like working with patients.  They care enough to ask questions, look you in the eye, smile, laugh, apologize when you have to wait, and look at your whole picture to ensure your best eventual health  (Here's looking at you, Dr. Virginia Radcliffe).  Save yourself the trouble folks - if you are referred to this questionable human, ask to be referred to someone - anyone - else.", "pics": null, "resp": null, "gmap_id": "0x889a4e1ca74c89e3:0x187d12feda71c7f4"}
{"user_id": "107930371905727297492", "name": "Josh Cocoris", "time": 1570568449332, "rating": 1.0, "text": "Everything Kayla Corkan said is exactly on point.\n\nI've never seen Dr's office be so horrible at communication.. just another example of how health care is going in a very bad direction, they act like the patient is offending them by calling and asking for some information.. they don't seem to understand every patient is a PAYING CUSTOMER (outrageous amounts too..) and should be treated as such. I'm sorry you chose to be a nurse for a doctor's office and have to deal with people all day, if you can't handle that maybe find a different profession.\n\nYou aren't the only horse in the race, maybe don't act like it? Your reputation is supposed to be more important than anything else.", "pics": null, "resp": null, "gmap_id": "0x889a4e1ca74c89e3:0x187d12feda71c7f4"}
{"user_id": "104380517606083877620", "name": "Kayla Corkan", "time": 1567532723012, "rating": 1.0, "text": "I wouldn’t recommend anyone to this doctor, his staff is a joke! (I have never met the doctor to give him a review but his staff is lazy and hard to communicate with)\n\nSo here is my experience! My grandmothers home burned down to the ground Thursday (August 29th, 2019) I called the doctors office that day and wasn’t able to get a hold of anyone. I had a lot going on that day since her home burned down that morning around 4am. This includes me driving from Atlanta to Citronelle,Al! After a few hours of trying to figure out what to do I drove my grandmother back with me to Atlanta. Since they did not answer Thursday my plan was to call Friday! I called Friday and spoke to a nurse and informed her about my grandmothers home and her losing EVERYTHING! I wasn’t sure what medications she was taking and my grandmothers memory isn’t well! So I told her to prescribe her everything because it needed to be replaced. I also had questions about putting my grandmother on the patch and some other things. She said she would ask the doctor and call me back. The main item we needed was her BREATHING MACHINE!!! Well surprisingly nothing was done Friday! I called again Saturday and spoke to a young lady named Jennifer (on call nurse) explained everything again and what I needed. Jennifer did get a few medicines prescribed but the breathing machine issue was never resolved! I ALSO HAD TO CORRECT THE NUMBER the nurse before her added CVS number as the contact number.\n\nSo I had to call back Monday which was a holiday. I spoke to Sheena who was very helpful and called me back with every update! Nothing could be done since it was a holiday!\n\nSo today is Tuesday and I call the doctors office again to get a BREATHING MACHINE for my grandmother, Leslie answered the phone and basically told me it was my fault because they have been trying to call and there was no answer (no one called my phone) she also told me they don’t send prescriptions for breathing machines out of state! She laughed at me when I asked to speak to the doctor himself or to be sent to his voicemail. She advised me he wasn’t in the office 9-3-2019 and didn’t have a voicemail.\n\nHis staff doesn’t know how to communicate, they are lazy, and there is no way of leaving a message for him!", "pics": null, "resp": null, "gmap_id": "0x889a4e1ca74c89e3:0x187d12feda71c7f4"}
{"user_id": "117702952692173197634", "name": "Cheyanne Dickens", "time": 1528810106556, "rating": 5.0, "text": "He was the first Dr. out of five to find my narcolepsy.", "pics": null, "resp": null, "gmap_id": "0x889a4e1ca74c89e3:0x187d12feda71c7f4"}
{"user_id": "118225560221636401527", "name": "Shavon's World", "time": 1623827416964, "rating": 1.0, "text": "I hated/hate going here!!! The staff isn’t friendly! The place is so outdated and makes you feel like you’re about to die. My doctor phone called me about my appointment and he told me they would set me up another appointment but that’s been literally 3 weeks ago at this point. They are unprofessional so PLEASE if you can help it, DO NOT GO HERE! Also, it’s not a place for a young person with health issues. They scheduled me for a pet scan 3 weeks after my doctor told me they would schedule me one and when I finally got an appointment my insurance was held up. NEVER had a problem with my insurance before going here. They just do everything so tacky and slothful. Oh yeah and they never answer the phone.", "pics": null, "resp": null, "gmap_id": "0x888e8045cdf16e29:0x3bb7a0b338049f16"}
{"user_id": "117604433378731252796", "name": "Jennifer holton", "time": 1623784373784, "rating": 3.0, "text": "My initial post was a 1 star but I have edited because although the initial contact with the staff was rude the doctor appeared to be knowledgeable once he finally listened to my mom. I am outside of my element with this type of doctor so I am going to have to continue to edit as the interaction progresses.", "pics": null, "resp": null, "gmap_id": "0x888e8045cdf16e29:0x3bb7a0b338049f16"}
{"user_id": "100629650018846153514", "name": "Keith Johnson", "time": 1607594764839, "rating": 1.0, "text": "My wife tried for almost two weeks to get an appointment. Our insurance company notified us that the necessary referral paperwork had been faxed. When my wife called to make the appointment the office staff claimed they never received it. The insurance company called the office, verified the fax number, and resent the referral but the office staff claimed they didn't receive it. On the third try the office staff acknowledged that they received the fax! However, the one person who could schedule the appointment had already left for day. This was a Friday and when my wife called the following Monday to make an appointment, guess what? The office staff claimed they had never received the fax. At this point we got the hint and found another doctor. I recommend using another practice if at all possible.", "pics": null, "resp": null, "gmap_id": "0x888e8045cdf16e29:0x3bb7a0b338049f16"}
{"user_id": "118357270606647409548", "name": "Jason Brown", "time": 1619286950574, "rating": 1.0, "text": "Saw Dr Vyas twice. She couldn't find out what was wrong with me but only told me I had a tumor that kept growing. It was pressing on my spine and was wrapped around my ribs. I was in tremendous pain. Thanks to UAB, I later found out it was stage 3 lung cancer. I was open and honest with her about my past and let her know that I was in pain management and taking suboxone. She agreed I was in pain, but the minute I asked for pain meds, she treated me like a crack head. She even made my wife sign a paper saying we would not ask her for pained again. She only gave me meds once. I spent 2 months in bed b4 deciding her clinic and Montgomery was not capable of treating me. I couldn't hold my newborn, or even walk without crying. So honesty is not the best policy with her. Shame on you lady", "pics": null, "resp": null, "gmap_id": "0x888e8045cdf16e29:0x3bb7a0b338049f16"}
{"user_id": "106791764097957509913", "name": "Ashley Blackmon", "time": 1617035503735, "rating": 1.0, "text": "I brought my mother here for an appointment today. Her appointment was @10am I got her here @ 9:45am. It's now 11:26am and they are just now seeing her. My mother has COPD is on oxygen 24-7, and patients shouldn't have to wait that obscenely long time. Also, one of the nurses Katherine Murphy was very rude and unprofessional I would  NOT recommend this place to anyone!", "pics": null, "resp": null, "gmap_id": "0x888e8045cdf16e29:0x3bb7a0b338049f16"}
{"user_id": "107149275497015246577", "name": "Beth Keith", "time": 1596479638642, "rating": 5.0, "text": "Dr. Lisa Williams has always been courteous, caring and concerned when taking care of my mother. She is soft spoken, so I attend the appointments due to Mom's hearing loss. Dr. Williams talks to Mom, but makes sure I am aware of any new medicines or instructions. She doesn't ignore my mother or talk only to me like many doctors do when an elderly patient has a daughter or son at the appointment. My mother and I really like and trust  her.", "pics": null, "resp": null, "gmap_id": "0x888e8045cdf16e29:0x3bb7a0b338049f16"}
{"user_id": "109658918978735700093", "name": "Kim Simmons", "time": 1598882189359, "rating": 1.0, "text": "My doctor office sent a referral on August 25. They did not receive a call from this office as of Saturday August 29. The medical assistant gave me the number so that I can call and get an appointment. I have asthma  issues they seem to have gotten worse where the current inhaler is not working.  My issues are not Covid-19 related. I understand their office has become extremely busy due to covid. Its very difficult to get them on the phone. I finally got someone this morning.  She told me I need a referral from doctor office like I didn't know that already....I said, my doctor already sent the referral and fax over my records. She said they have to be reviewed before I can get an appointment. I asked her how long out are the appointments she said 6 months my reply was probably will be dead by then...", "pics": null, "resp": null, "gmap_id": "0x888e8045cdf16e29:0x3bb7a0b338049f16"}
{"user_id": "103137268374732032075", "name": "Reagan Steele", "time": 1566251409689, "rating": 2.0, "text": "I stopped by the Narrow Lane Road office to fill out a medical records release form. They were perplexed. I was told they do not do that. I called my provider. They certainly can mail medical records upon request.\nI never got to see Dr. Thrasher, which is unfortunate. I arrived for the appointment on time, took the breathing test (the tech was amazingly nice) and did the x-ray, but it took longer than expected so I went to the discharge nurse to reschedule. The discharge nurse (not sure of her name or title) got very smart with me about rescheduling. She also said my authorization was expired and that I would have to handle it as if it was not her job. I called the appropriate number about the authorization and it is valid for a long while. I think she is unhappy somehow. That is ashamed. I would hate for her to become unnecessarily aggravated by an elderly person's needs as they may be confused and not vouch for themselves, thereby making the patients care go unattended to. I think most of their clientele is elderly. As with most employees these days, the office in general and this particular lady in general need some customer service/etiquette lessons.\nI was rescheduled with a different doctor. I am pulling for him.", "pics": null, "resp": null, "gmap_id": "0x888e8045cdf16e29:0x3bb7a0b338049f16"}
{"user_id": "113392264273281434276", "name": "Just 1 Man", "time": 1538002211258, "rating": 1.0, "text": "Beware !!!!!  Dont waste your time coming here if you're having sleep problems that can't be solved by cpap or bipap.  I spent $1000 plus on the bipap and it's no more effective than my 15 year old CPAP was. My dr was emsmingger.  He didnt listen to me at all.  I told him about my sleeping when I'm not in bed equals much more than when i am in bed.  He said ok, we'll see you in a year.   What a massive waste of time and money.....", "pics": null, "resp": null, "gmap_id": "0x888e8045cdf16e29:0x3bb7a0b338049f16"}
{"user_id": "110409450700827301360", "name": "Latasha Rivers", "time": 1534369566959, "rating": 1.0, "text": "Worst “professional” experience I’ve ever had. The staff are very rude,  including Dr. Vyas.", "pics": null, "resp": null, "gmap_id": "0x888e8045cdf16e29:0x3bb7a0b338049f16"}
{"user_id": "104219666607790456879", "name": "Stacey Phelps", "time": 1506544122325, "rating": 1.0, "text": "Wait time is horrible.  Been waiting for over and hour and got to appointment early.", "pics": null, "resp": null, "gmap_id": "0x888e8045cdf16e29:0x3bb7a0b338049f16"}
{"user_id": "105795575585270963306", "name": "EDWARD MYLEK", "time": 1611851579582, "rating": 1.0, "text": "In my opinion, the rating should be at 0 stars. I was a patient at this clinic for about 18 months. They had me in for day and night  sleep studies every 6 months $$$$. After each study, I would have to come in for results. Typically, I would wait 1 1/2 to 2 hours past my appointment time before being seen. If a PA was doing the followup, they could never answer a question I had. The answer was always, \"You'll have to ask the doctor\". OK, where's the doctor????? Then there was the ultrasound performed every six months on the carotid artery. $$$$ There was no blockage to be concerned about, but they want to do the ultrasound every 6 months $$$$. If after almost 60 years my results were negative, I don't think it's going to change in six months. After to speaking with friends with sleep apnea about their treatment plans, I decided, in my opinion, that this clinic is about making money. Is this insurance fraud? You decide.", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "107970128657865441054", "name": "La'Tasha Hutto", "time": 1595089920164, "rating": 3.0, "text": "I think that over the past 2 yrs they have went way way behind their own motto and morals. They play around the whole time you are at your appointment. And they don't explain in details anything about your condition or test results to even know what is going on with you. If you question their diagnosis and ask for a second opinion they actually get fighting mad and more or less tell you you're wrong but they will send you a referral anyway. And the new Nurse Practitioner they have working now never smiles or grins or even talks without trying to rush you out of there. She can't be older than 21 maybe 22 and she is not the kind of person you Wanna be seeing when you are already ill from not being able to breathe.", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "105519902765838262943", "name": "J D", "time": 1597281661388, "rating": 5.0, "text": "The staff is very caring & go out of their way to help you", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "114140598129252451704", "name": "Kathleen Guilliam", "time": 1522693618070, "rating": 4.0, "text": "Dr &NP are both knowledge, & helpful in you getting good care. The facility; however is very out dated & needs improvement. Otherwise I would rate it higher. Day or night sleep studies are done at his office, which is very convenient. Breathing test, echo are also performed here. Again very convenient.", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "105786276026795752001", "name": "chris church", "time": 1577837396897, "rating": 1.0, "text": "When you first walk in you feel like someone lives there and decided last week to open a sleep clinic. Very unprofessional. I should have walked away but I gave it a shot. They ran a test for lung function. Ten minutes later the nurse practitioner walked in and said I had stage 3 COPD with 34% lung function. She gave me a few inhaler prescriptions and left. I took the meds. Researched all I could online and returned a week later with same symptoms, no improvements. I asked about what else we could do and she told me nothing and advised me to go back to the emergency room. I asked to see the actual Dr and was told he would say the same thing so there was no point. I went for a second opinion in Huntsville and was told my lungs looked ok, no signs of COPD. Discovered it was blood clots in lungs which I asked about from the beginning since its happened 3 times before.", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "106321689612690682611", "name": "Lacey Letson", "time": 1533244952087, "rating": 4.0, "text": "Love my CPAP, feel so much better. Love the technicians there mine made the experience not be as dreadful as I thought. Took one star off because furniture/ decor needs updated. They did put in new beautiful wood floors since my first visit so it seems like they are working on the decor. I would recommend.", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "103421940878617925174", "name": "Andrea Ashex", "time": 1556751742908, "rating": 1.0, "text": "FILTHY facility run by men with big egos but small everything else. The new medical administrator Ash worked there awhile back and we were happy to see him go. He flirted with all the staff and cheated on his wife with one of the office staff, who ended up making boss moves and was able to take his job. This creeps decided to come back when she quit though. Every patient who comes here is falsely diagnosed for profit. I would recommend taking the drive Huntsville hospital.", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "104736798970799489346", "name": "Vickie Clopton", "time": 1599227750152, "rating": 1.0, "text": "Rude awful staff..lowdown af...i was yelled at bc i wasnt  moving fast enough ..and when she  removed the probes from the machine and my hair..she was yanking the probe's  out the machine so hard she broke every last one...she yanked one out of my head so hard she pulled all  my edges out on one side..did not even apologize", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "112344815086529091850", "name": "Nathanial King", "time": 1559347655893, "rating": 1.0, "text": "There is only ONE staff member there at night to monitor a house full of patients. If you have a heart attack or a medical issue while there consider yourself dead.", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "105833787652759846801", "name": "Amelia Rose", "time": 1559349782953, "rating": 1.0, "text": "Now Normally I don’t like to write negative reviews but my stay here was displeasing. I was put in a room with a HUGE roach in it. I kept my mouth shut about it I didn’t want to cause any trouble or nothing. Later I noticed on the headboard a whole bunch of tiny bugs. I was able to switch to another room but when I woke up I was covered in BED BUG BITES!!!!! I later was told I needed to come back for a mask for my sleep apnea problems  I declined an went to Huntsville hospital who told me I don’t have sleep apnea.", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "104845703672244835663", "name": "Ashraf Gaylord", "time": 1559149698600, "rating": 1.0, "text": "-When the doctor pays off patients families to keep quiet about a wrongful death that occurred...\n- Diagnoses EVERY patient even two year olds with sleep apnea even if they don’t have it\n- Schedules day tests which are not medically necessary\n- Filthy office\n- Unregistered techs, supposed to have at least one ... lies about it to get reaccredited\n- Been in trouble with Medicare multiple times\n-legally is not supposed to run cpap studies without registered techs plus his history of Medicare fraud", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "105457965543619972644", "name": "Dr Fraud", "time": 1556937311194, "rating": 1.0, "text": "-The doctor tells everyone they have sleep apnea so he can get more money. He will change the technicians studies to make it look like they have sleep apnea if audited\n- Dirty, blood on the sheets\n-Bed bugs\n- Purposely orders tests that aren’t needed to make money\n- An MSLT (your day study) is to test for Narcolepsy only. They do not tell you this because they know this test 99.9% of the time is not needed.\n- Someone has died in the building, doctor paid the family hush money\n- one of the people he has running the studies has no schooling they were a secretary in the office... it’s illegal for them to be running the tests\n- they have gotten in trouble with Medicare in the past\n-They legally can not be running studies they have no registered Techs", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "118395583080536872494", "name": "CM20 HK", "time": 1559439045211, "rating": 1.0, "text": "Do NOT go here. A kind warning. Im not going to go into more detail, but I had bed bugs crawling all over me within the first hour!\n\nThe bed bugs infested my backpack, and now, two weeks later, I have a bed bug infestation in my own flat back home", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "113214677773160434478", "name": "Lakiesha Renee", "time": 1559272592399, "rating": 1.0, "text": "A clip on my mask broke shortly after I received it and I was told I had to come back and get another test done just for them to replace my mask this office ratchet and don’t care about they patients. I decided to make the trip to Birmingham instead of giving them my money. Birmingham laughed at my results saying dr najar is a liar and I don’t have sleep apnea. Don’t send ur loved ones here.", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "118271344967161622109", "name": "Esa “Esakitten” J", "time": 1558379972709, "rating": 1.0, "text": "These people are idiots. This is supposed to be a PULMONARY doctor and there's a glade plug in the moment you walk in the door. It must be new as I have been here before and not had my asthma triggered by it before. It is a known fact those things cause breathing problems and can trigger migraines in sensitive people. The service isn't all that great either. I haven't even seen the doctor just the NP.", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "117662115480552180576", "name": "Joel Charles", "time": 1559349337637, "rating": 1.0, "text": "Room by basement where office manager ashhad sexual relations with the other office manager who quit. She be left her emails open sometimes on lunch break with sexual conversations betwen the 2. He cheated on first wife with her then engaged another woman while he was still banging her. He take his job back after she quit she had less experience than he did when she took his job man that’s embarrassing. He a good fit for this job since he a cheater and a fraud", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "115189416609617545136", "name": "Asha Trasha", "time": 1557168045672, "rating": 1.0, "text": "If you want to be misdiagnosed come to this facility. Not one person who comes in is not diagnosed with sleep apnea. You will be asked to come for a morning study but not told what it’s for- it’s for narcolepsy.... has a secretary who has never gone to school doing the cpap studies which is illegal. Whole place is crooked just a matter of time before they are shut down... he pays people off though", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "116130845900361227562", "name": "Paula Augustine", "time": 1559273188423, "rating": 1.0, "text": "We was on our way for a sleep study last night and I got a call from a close friend who was asking which facility we was going to— we told her Dr. Najjar office and she told me girl stay clear of taht office her 12 year old son was told he had COPD and he really didn’t have it— she said if I don’t believe her read the reviews.... we turned around ASAP! That is terrible shame on you doctor!", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "101413024510729791233", "name": "Whatta Joke", "time": 1556940951536, "rating": 1.0, "text": "You WILL be told you have sleep apnea even if you don’t. You occasionally may be told you need to wear oxygen when you really don’t. He misdiagnoses to get money... building is gross id rather sleep on the street it’s cleaner... office manager ASHRAF is a snake so is the crook dr", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "101719550878769435424", "name": "Tommy Tommy", "time": 1521717617260, "rating": 3.0, "text": "Been going since 2011; and had good experience, but last couple years only seen Dr. Najjar  a very few times. Not that the practioners aren’t qualified, but they’re not my doctor. Have asked for Najjar, but then he no shows. Thinking about changing doctors. Must have faith in your doctor, not his helpers.", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "113817452057979955556", "name": "Ryan Kennedy", "time": 1559237910616, "rating": 1.0, "text": "Told my mother in law she had COPD long story short she was misdiagnosed. I’m horrified after meeting another patient at my current office  who shared similar stories. I hope they would not go this far to make a buck but unfortunately this seems to be an unethical practice.", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "112236064407577041145", "name": "Cheyenne Woods", "time": 1544834736666, "rating": 1.0, "text": "There are REASONS why no one wants to work there!!! If one provides two weeks notice they do not get paid for the time worked in those two weeks. Overtime is removed from all checks hours before the check is cut. Hours shaved off and management acts confused when confronted. Many unnecessary medical procedures scheduled, FRAUD. ALOT of fraud. Horrible people run this place. Many individuals misdiagnosed intentionally to gain additional profit!!! I quit this job months ago in fear I would lose my lisence!!!!", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "115702794862873656268", "name": "Phillip Mathis", "time": 1546521697018, "rating": 1.0, "text": "Dont do business with this place, they prescribed the wrong machine and would not make it up. They almost cost me my job. I had to go buy another machine out of my pocket just so I could go back to work. Worst place I have ever used and will never go back!!!", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "102936099545582301201", "name": "Bobby Ray", "time": 1559272036069, "rating": 1.0, "text": "Astonished this place hasn’t been shut down yet, complete frauds!!!!! If you want to be misdiagnosed this is the place to go. Had the displeasure of speaking to the office manager who needs an attitude adjustment", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "112969792686609658019", "name": "Samuel Jackson", "time": 1559148848816, "rating": 1.0, "text": "Office manager Ash is too concerned with trying to cheat on his wife again with another staff member and trying to talk down to others than to do anything else. This facility is ran by frauds that will intentionally misdiagnose you so you can buy a cpap etc. if you want to waste your time and money come on in", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "100987371008560452633", "name": "Paul Oddick", "time": 1536128848103, "rating": 5.0, "text": "Went to Dr. Najar for my third opinion. Originally went to Crestwood and was told I had sleep apnea, wasted thousands of dollars on equipment and did not feel a difference. Next stop was Huntsville Hospital, they told me not the slightest bit of sleep apnea and that Cpap supplies was not needed. Just to make certain I went and got a third opinion at Najars and he said to save my money I do not have sleep apnea. It was great to finally find someone who didn’t want my money and was honest with me. Highly recommend, now I don’t need to sleep with an unnecessary mask for life", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "110035773661848690971", "name": "Ray Klues", "time": 1534129661063, "rating": 5.0, "text": "I had a study at his Madison location and my son had his day study at the Decatur office. Shayla was great.", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "107915059276774029568", "name": "Sara Ensign", "time": 1545168358958, "rating": 1.0, "text": "Every single person in management is heartless, evil and greedy. These crooks schedule unnecessary tests and will diagnose you with everything under the sun that you DONT actually have so that they can profit more from machines, additional visits etc.", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "104502711968040453392", "name": "Melanie Porte", "time": 1534035385859, "rating": 4.0, "text": "Very sweet staff. Overall no complaints", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "104973442810165992709", "name": "Emily Kassar", "time": 1533311393157, "rating": 5.0, "text": "Had a terrible experience with the sleep lab at Crestwood. Glad I found someone who could get me on the right pressure and a caring staff", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "106052069527130819577", "name": "Tamara Hornsby (Nana)", "time": 1480428967470, "rating": 5.0, "text": "I am toatlly impressed with Dr Najjar and his staff. Thank you to all of you for caring for others!", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "109037563852239268809", "name": "Doug Randall", "time": 1502131739093, "rating": 5.0, "text": "Great office. Dr Najjar was very thorough and answered all my questions", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "104594485749657341504", "name": "sandra balderrama", "time": 1473705981523, "rating": 5.0, "text": "Dr Najjar is a really good doctor. The staff is very nice also.", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "101079730185248812631", "name": "SUSAN NAVA", "time": 1471555747782, "rating": 1.0, "text": "The worst experience with a doctor, o I mean a nurse practitioner, I've ever had despit having asked several times I never saw a dr. The made mayos take after mistake and didn't call me back when I had serious side effects. Go anywhere but here for your sleep problems", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "111721845884255758032", "name": "Joleen Brooks", "time": 1371482591479, "rating": 5.0, "text": "The doctor and staff was very professional. Appointments was easy to make, wait time was less than 30 min.", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "105423042720774859870", "name": "Jacqueline Costes", "time": 1483654783354, "rating": 1.0, "text": "I've been going here over a year I was misdiagnosed. Every time I went in I was there over an hour a I got to see whoever they sent for 5 minutes. I only saw the doctor once every other time I was in I saw the nurse practitioner. Never in my life have I hated a place more. I can't stand when I have a 330 appointment and don't see anyone till after 5 almost 6. DO NOT GO THERE", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "112498382798538369337", "name": "Stephanie Braswell", "time": 1445612144662, "rating": 5.0, "text": "Super nice staff who are very knowledgeable in their profession.", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "114849850135838520199", "name": "Brandon Garner", "time": 1505768794628, "rating": 1.0, "text": "They did not have negative star. This man is a quack,if you care about your health run!!!", "pics": null, "resp": null, "gmap_id": "0x8862869a0753cf3f:0x870e3d41bcfe117e"}
{"user_id": "117503423283556979808", "name": "tony Helms", "time": 1626552680305, "rating": 5.0, "text": "My visit went very well. Everyone treated me nice. Everything went fast .I was well pleased with my visit. I would recommend your practice to anyone. Thank you.    Tony Helms", "pics": null, "resp": {"time": 1627314177382, "text": "We strive to provide great experiences. Thank you for your feedback!"}, "gmap_id": "0x888a3f28a970830f:0x6dde2aa3ab2f27e6"}
{"user_id": "105388256359396536639", "name": "Delores Abney", "time": 1623864324751, "rating": 5.0, "text": "Dr. Masood was fantastic even though I only saw her a few times. I will miss having her for my doctor after she has left. She was very professional and patient with all my questions.  Excellent doctor!", "pics": null, "resp": {"time": 1623870961798, "text": "We strive for 100% satisfaction, and we love to hear about these positive experiences!"}, "gmap_id": "0x888a3f28a970830f:0x6dde2aa3ab2f27e6"}
{"user_id": "108814863953371893757", "name": "john black", "time": 1626283619928, "rating": 5.0, "text": "Was very helpful. Diagnosed me and got me exactly what I needed.", "pics": null, "resp": {"time": 1626289746862, "text": "We strive for 100% satisfaction, and we love to hear about these positive experiences!"}, "gmap_id": "0x888a3f28a970830f:0x6dde2aa3ab2f27e6"}
{"user_id": "116673036730903203380", "name": "Susan Wallace", "time": 1625160346217, "rating": 5.0, "text": "Excellent, very professional.  A wonderful experience!", "pics": null, "resp": {"time": 1625253306016, "text": "Hello, thank you for your comment! We love to hear about these experiences!"}, "gmap_id": "0x888a3f28a970830f:0x6dde2aa3ab2f27e6"}
{"user_id": "117266603626722926977", "name": "Debbie Swann", "time": 1616693821729, "rating": 5.0, "text": "The Dr. Appeared very knowledgeable about what we discussed. I feel comfortable with what she prescribes. Thank you.", "pics": null, "resp": {"time": 1616703881025, "text": "We are so happy to read such a great review!"}, "gmap_id": "0x888a3f28a970830f:0x6dde2aa3ab2f27e6"}
{"user_id": "105197833435559954545", "name": "Kathy Murphree", "time": 1619030695385, "rating": 5.0, "text": "Dr Masood is seeing my aunt . She is the best. She is patient and compassionate with herr patients . She goes well beyond her means to take care of her patients.  With being so overwhelmed the past month with the Covid in the hospital.  She still makes sure her patients are seen and took care of in the clinic.", "pics": null, "resp": {"time": 1619057476137, "text": "We strive to provide great experiences. Thank you for your feedback!"}, "gmap_id": "0x888a3f28a970830f:0x6dde2aa3ab2f27e6"}
{"user_id": "114398256438926340772", "name": "Lori Vaughn", "time": 1619226675874, "rating": 5.0, "text": "Dr. Masood is very caring, knowledgeable and personable. Office staff is very professional and office is clean and comfortable.", "pics": null, "resp": {"time": 1619550577512, "text": "We're so glad that we were able to go above and beyond your expectations!"}, "gmap_id": "0x888a3f28a970830f:0x6dde2aa3ab2f27e6"}
{"user_id": "111672206949020382848", "name": "oldmick714", "time": 1618681983979, "rating": 1.0, "text": "I chose to meet with this dr because I was having problems breathing. She never checked my breathing only acted as tho she was mad because I came in rather than teleconference to see her. Prescribed Breo and left the room. I had to follow up with my family dr who gave me an antibiotic for my congestion. I have since contacted another doctor to use for any further problems. I had been fully satisfied when seeing Dr Kalem but he was doing teleconference only.", "pics": null, "resp": {"time": 1618859146091, "text": "We are always looking for ways to improve; we appreciate your input. If you would be willing, we would like to have you contact our manager at 256-494-4646 to discuss ways we can better serve you in the future."}, "gmap_id": "0x888a3f28a970830f:0x6dde2aa3ab2f27e6"}
{"user_id": "113307581161185846630", "name": "Chasity Mullins", "time": 1623090098171, "rating": 5.0, "text": "Saved my life in August of 2020 when I had a pulmonary embolism. Very grateful!", "pics": null, "resp": {"time": 1623092073744, "text": "Thank you for your kind words and this wonderful review!"}, "gmap_id": "0x888a3f28a970830f:0x6dde2aa3ab2f27e6"}
{"user_id": "100949127182486954115", "name": "James Lankford", "time": 1613537289116, "rating": 5.0, "text": "Dr Masood took care of my mother during her admission at GRMC. Very good doctor and very nice person.  Very happy with the care she provided.", "pics": null, "resp": {"time": 1613576679862, "text": "Mr. Lankford, thank you for your feedback! We are always happy to help if you need us in the future. Take care!"}, "gmap_id": "0x888a3f28a970830f:0x6dde2aa3ab2f27e6"}
{"user_id": "118292282740612134263", "name": "David Reynolds", "time": 1612119929727, "rating": 1.0, "text": "Denied Necessary Refill.\nUncaring and narcissistic.\nPlease do not bother with Masood!", "pics": null, "resp": {"time": 1612828036322, "text": "Mr. Reynolds, our practice manager has reached out to discuss your review. We look forward to hearing from you!"}, "gmap_id": "0x888a3f28a970830f:0x6dde2aa3ab2f27e6"}
{"user_id": "113110960894236414285", "name": "Kd Dorsett", "time": 1622221890728, "rating": 5.0, "text": "I found it very revealing to me about my meds", "pics": null, "resp": {"time": 1622234556572, "text": "Thank you for taking the time to leave a review for us. It is our goal to provide our patients with the best possible experience."}, "gmap_id": "0x888a3f28a970830f:0x6dde2aa3ab2f27e6"}
{"user_id": "116539353949852296123", "name": "Chris Vice", "time": 1600835668242, "rating": 5.0, "text": "Very nice. Very informative. Seems to care about patients.", "pics": null, "resp": null, "gmap_id": "0x888a3f28a970830f:0x6dde2aa3ab2f27e6"}
{"user_id": "105067469372029090712", "name": "JSU Fan 80", "time": 1562624157133, "rating": 1.0, "text": "Very rude.. Basically told my mother in law she could just die & that no one dies of insomnia after she told my mother in law that she stops breathing 33 times in a hour. All my mother in law needs is a CPAP but she told her she would have to do another sleep study which takes about 6 weeks to get into one. I would not send my anyone to her.. She is very rude and does not care about her patience.. Awful..", "pics": null, "resp": {"time": 1562683590238, "text": "We are sorry that we did not meet your expectations and appreciate your feedback. If you would like to speak to us further, please contact us at 256-494-4300."}, "gmap_id": "0x888a3f28a970830f:0x6dde2aa3ab2f27e6"}
{"user_id": "109356972334016342724", "name": "Michael Blackmon", "time": 1499265498413, "rating": 5.0, "text": "From the Receptionist to the Office Manager to the RN's to Dr. Masood herself, totally friendly. competent and concerned about me. The office is easily accessible, clean and comfortable. All personal are helpful and responsive to all needs of the patients. I'm totally satisfied with the quality of care. Dr. Masood is intelligent, compassionate and up to date on all disease processes and their treatments. I'm a disabled Critical Care Cardiopulmonary/IV Nurse Clinician, with 30+ years experience. I'm very critical and expect nothing but the best. I was not disappointed in any way....Michael Blackmon....", "pics": null, "resp": null, "gmap_id": "0x888a3f28a970830f:0x6dde2aa3ab2f27e6"}
{"user_id": "112024404093509722998", "name": "Melinda Boggs", "time": 1578671632871, "rating": 5.0, "text": "I was referred to Dr. Crowder-Hicks after open heart surgery in 2018. This lady is a fantastic doctor! Bedside manner is awesome. Personality like none other. Just a genuine, good person. I would highly recommend her.", "pics": null, "resp": null, "gmap_id": "0x889a4e1c84fe6ebd:0xb0a337c9ff499167"}
{"user_id": "101608011335271665309", "name": "Lesia Feagin", "time": 1550169073694, "rating": 5.0, "text": "Dr. Crowder Hick, is my sleep apnea doctor, thanks to her treatment plan I can actually sleep at nights without feeling drained and a pounding headache every morning.  Very best at patient care.", "pics": null, "resp": null, "gmap_id": "0x889a4e1c84fe6ebd:0xb0a337c9ff499167"}
{"user_id": "105016768690061776514", "name": "Brenda Sheppard", "time": 1557757990920, "rating": 5.0, "text": "The best Doctor ever", "pics": null, "resp": null, "gmap_id": "0x889a4e1c84fe6ebd:0xb0a337c9ff499167"}
{"user_id": "109903370887922201950", "name": "Houston Huggins II", "time": 1602008970403, "rating": 1.0, "text": "New to the area. This is, without question- the WORST patient care experience I have ever had! The doctor is completely detached from the patient care process. She is a condescending narcissistic clock watcher. There was no information about my supplies prescription given to me. I am ashamed to say that I waited 6 weeks to reach out to the sleep center to find out where my supplies were-but then I was told who the supplier was and that I had to make contact with them and go get the supplies. DON'T MAKE THE SAME MISTAKE I MADE....DON'T WASTE YOUR VALUABLE TIME.....DON'T GO HERE!", "pics": null, "resp": {"time": 1611249443120, "text": "Hello, Mr. Huggins. We're so sorry to hear that you had a negative experience with one of our physicians. Please consider calling the Patient Advocate so we can learn more about your concerns and work to address them. The advocate can be reached at (256) 265-9449."}, "gmap_id": "0x886266229824aec1:0x1ff17cfb8c48325e"}
{"user_id": "102404628161888105457", "name": "Simeon", "time": 1448007697817, "rating": 5.0, "text": "Staff is very nice and answered all of my questions.", "pics": null, "resp": null, "gmap_id": "0x886266229824aec1:0x1ff17cfb8c48325e"}
{"user_id": "104612065561055152172", "name": "Charles Boatwright", "time": 1582856137977, "rating": 5.0, "text": "A friend recommended me to go see him. That was the best advice I ever got. Been going to him over 10 years. He is now retired and doing part time but I’m still with him   He takes the time that is needed to see someone. He listens and if necessary will send you to a specialist  who have been qualified and good like him.   His staff is also top notched  if you need to talk with them they do return the call in a short time. Bot like some that might take two days", "pics": null, "resp": null, "gmap_id": "0x889a4e1c8e41591d:0x21bfcc25c0f26ed"}
{"user_id": "105474642213778455400", "name": "Wendy Short", "time": 1491251084698, "rating": 5.0, "text": "Dr. Gewin is friendly and helpful.  You never feel rushed or uncomfortable asking questions. He is the best doctor I have ever been to.", "pics": null, "resp": null, "gmap_id": "0x889a4e1c8e41591d:0x21bfcc25c0f26ed"}
{"user_id": "104547269617929172569", "name": "BRANDY mATA", "time": 1624632567857, "rating": 5.0, "text": "UPDATE THIS DR HAS CHANGED MY LIFE BEFORE GOING TO HIM I WAS TO THE POINT OF NOT BEING SURE IF I WOULD BE ALIVE TO RAISE MY DAUGHTERS NOW I AM ACTUALLY ABLE TO SHOP SOMETHING I HAD STOPPED DOING BEFORE FINDING DR SHUBAIR. I have just recently started to Dr Shubair and I am very pleased he ask me questions about my asthma I have never been ask I am impressed so far he ordered test to try to find out why my asthma is getting worse and told me I should not have to be living on prednisone that they were to many new medicines on the market. He also did not push me saying I have sleep apnea when I passed the sleep study. He is a great doctor", "pics": null, "resp": null, "gmap_id": "0x888bb3c0c786e0bb:0x216f741ebb1d95b8"}
{"user_id": "107078193636884309942", "name": "Paula Gonzales", "time": 1609937148700, "rating": 1.0, "text": "I'd like to give zero stars. He is heartless, cold and sorry excuse for a doctor.  If I had to choose between seeing him and dying,  I'd choose death.", "pics": null, "resp": null, "gmap_id": "0x888bb3c0c786e0bb:0x216f741ebb1d95b8"}
{"user_id": "102407453475349264432", "name": "Jan Harris", "time": 1602106499391, "rating": 5.0, "text": "Dr Shubair is very kind and and excellent pulmonologist.", "pics": null, "resp": null, "gmap_id": "0x888bb3c0c786e0bb:0x216f741ebb1d95b8"}
{"user_id": "111151747202470731164", "name": "Dank Dubious", "time": 1570826300868, "rating": 3.0, "text": "Cant speak of the doctor since I have yet to get to see him, but I can say they do not do calls that remind you of the appointment and verify if you are coming, a feature i for one need since part of my disability effects my memory and a lot of things get overlooked or forgotten as a result. I have recently undergone a heart procedure with some complications so I just realized I missed a much needed appointment that was set earlier in the week, and the answering service today *they close at noon on fri it seems* was not only the most rude answering service I have ever dealt with, they blatantly refused to take a message as is their job, because they didnt consider my issue to be an \"emergency\". I'd like to see the old hags degree that allows her to determine what an \"emergency\" is. In my experience, \"emergency\" calls tell you to hang up and call 911 or go to the nearest E.R. I plan to make a formal complaint on this matter. Hopefully they will take the matter seriously and deal with the issue before it effects others.", "pics": null, "resp": null, "gmap_id": "0x888bb3c0c786e0bb:0x216f741ebb1d95b8"}
{"user_id": "116877178501921866418", "name": "alicia primm", "time": 1566488776873, "rating": 5.0, "text": "Dr. Shubair has moved his location to 901 Leighton Ave Suite 301  Anniston, AL.  36207", "pics": null, "resp": null, "gmap_id": "0x888bb3c0c786e0bb:0x216f741ebb1d95b8"}
{"user_id": "103629218486334923927", "name": "Polly Oneal", "time": 1551282951240, "rating": 5.0, "text": "Efficient Dr. & Staff", "pics": null, "resp": null, "gmap_id": "0x8888a800a8c52b09:0x80355a923e588a14"}
{"user_id": "106338299200930368397", "name": "Jason Westerling", "time": 1611376810413, "rating": 5.0, "text": "Keesha Tyler was wonderful during my two sleep studies. She explained any question I asked and had wonderful bed side manners. If this is quality of care this is going to be a great experience.", "pics": null, "resp": {"time": 1611377880078, "text": "Thank you so much for your feedback. I will pass this on to Mrs. Keesha."}, "gmap_id": "0x8892934178e7e66d:0xb995d735e6f6d9ad"}
{"user_id": "110721907789160168132", "name": "Tracy Harris", "time": 1614032053517, "rating": 1.0, "text": "Came hear seeking help for my husband because he has alpha-1 and  needed help. We were helped  alright  after his 4th visit they informed us that they had to collect 20% on the spot for the bill  and proceeded to tell us on the 4th visit for the first time that they do not accept Florida medicaid? That should have been brought up on his first visit  not 3 later.. so now we're being referred to collections  for the bill meanwhile my husband still needs help..oh yeah the doctor there did say he was just a lil ole country doctor from dothan alabama and then  referred him to uab for help .. we're speechless now... thanks for helping us..", "pics": null, "resp": {"time": 1613606323865, "text": "Mrs. Harris I apologize for your experience please. Our office doesn't take legal action on any accounts by way of lawyer. Please contact our office manager to speak with her in detail about your complaint so she can help."}, "gmap_id": "0x8892934178e7e66d:0xb995d735e6f6d9ad"}
{"user_id": "117283530794235207758", "name": "Jim Byrum", "time": 1616487526994, "rating": 4.0, "text": "Very helpful staff.  Good staff patient relationships.", "pics": null, "resp": {"time": 1623199955493, "text": "Thank you for your compliment."}, "gmap_id": "0x8892934178e7e66d:0xb995d735e6f6d9ad"}
{"user_id": "102124097385496407914", "name": "Bobby Hadden", "time": 1613843048996, "rating": 5.0, "text": "So grateful for the care from these doctors during my hospital stay with covid", "pics": null, "resp": {"time": 1613844349172, "text": "Mr. Hadden thank you for your kind words. We are glad your better."}, "gmap_id": "0x8892934178e7e66d:0xb995d735e6f6d9ad"}
{"user_id": "112901100648112310352", "name": "A. L. McDonough", "time": 1613070581690, "rating": 5.0, "text": "Doctor Purvis went the extra mile to explain everything about my health. Staff was friendly and professional.\n\n11 February I have been trying to get the COVID 19 shot with no luck. Doctor Purvis staff notified me that they had it and I should come in.  From the time I entered the door until I went home the total time was no more than 20 minutes and that included the mandatory 15 minute wait after getting the shot.  What more could I ask for?", "pics": null, "resp": {"time": 1611377921746, "text": "Thank you for your feedback.  I will pass this on to Dr. Purvis"}, "gmap_id": "0x8892934178e7e66d:0xb995d735e6f6d9ad"}
{"user_id": "100566446115266519957", "name": "Legacy Immune", "time": 1602373982615, "rating": 5.0, "text": "The staff is amazing, always friendly and has helped my Dad. He had just been in the ICU because of his asthma and COPD. I am thankful that he has the Doctor's and Nurses and staff at this clinic. Thankful for what they do.", "pics": null, "resp": {"time": 1611377976506, "text": "Thank you so much.  We appreciate your feedback and will relay it to our physicians and staff."}, "gmap_id": "0x8892934178e7e66d:0xb995d735e6f6d9ad"}
{"user_id": "113143450453727839465", "name": "Leeann Rogers", "time": 1596049885858, "rating": 5.0, "text": "I am so grateful to this office. My 79 year old Dad developed serious health issues with his outdated CPAP machine. I usually accompany him to his doctor appointments but this time I couldn’t be there due to my Mother needing me while recovering from spinal cord surgery. Samantha in billing communicated with his primary to obtain all his insurance information and made notes in their system so the front desk would be aware of his needs when he arrived. Nurse Heather completed the necessary paperwork for him being a new patient on his behalf. Amy at the front desk facilitated communication between me, Dad and the office assuring me through the entire process. These are difficult times for everyone and I’m eternally grateful for our health care professionals at Pulmonary Associates.", "pics": null, "resp": {"time": 1598403712506, "text": "Thank you so much for your feedback. We appreciate your positive comments."}, "gmap_id": "0x8892934178e7e66d:0xb995d735e6f6d9ad"}
{"user_id": "107482311454769073379", "name": "N M", "time": 1598463349386, "rating": 1.0, "text": "Dr Purvis is one of the nicest men I have ever met. However his office is not organized at all and I have needed a new provider for some time. I think the time has come.", "pics": null, "resp": {"time": 1598525058929, "text": "We appreciate your feedback and would love to talk to you in more detail. Please contact our office administrator to discuss."}, "gmap_id": "0x8892934178e7e66d:0xb995d735e6f6d9ad"}
{"user_id": "108701162384192795072", "name": "Teresa L Greathouse", "time": 1592244079045, "rating": 1.0, "text": "I called Dr. Sextons office today because my CPAP group told me I was due for a new water tank for my CPAP with all my other equipment. I called and was told I was now considered a new patient since I had not been seen since 2016. Well considering the Dr. Or CPRN did not tell me I needed to be seen why would I call for an appt.? They were faxing back and forth for my equipment.\nNow I love Dr.Sexton and think he is  a fabulous Dr.! And I am sure if he saw this after being his patient for 6 years he would not be happy.\nIt is not right that a patient has to jump through all these hoops just to see her Dr.\nJUST NOT RIGHT!", "pics": null, "resp": {"time": 1598403607833, "text": "Mrs. Greathouse thank you for your feedback. If you will please contact our office administrator so we can help get you taken care of."}, "gmap_id": "0x8892934178e7e66d:0xb995d735e6f6d9ad"}
{"user_id": "103360468136754554847", "name": "Joretta Parker", "time": 1560283259013, "rating": 5.0, "text": "I have always been treated good. All the people from check in to check out have been excellent. Amber has been great with all the paper work I had to deal with to get my medicine. Love my doctor also. Very patient and understanding. I highly reccomend this group.", "pics": null, "resp": {"time": 1567304265995, "text": "Thank you so much for your sweet comments.  I will surely pass this on to our staff."}, "gmap_id": "0x8892934178e7e66d:0xb995d735e6f6d9ad"}
{"user_id": "103085122003297882993", "name": "Brandy Lisenby", "time": 1599606485503, "rating": 5.0, "text": "I love this place the staff is wonderful!", "pics": null, "resp": {"time": 1611377992877, "text": "Thank you so much for your feedback."}, "gmap_id": "0x8892934178e7e66d:0xb995d735e6f6d9ad"}
{"user_id": "105009296971024755974", "name": "Tanya Riley", "time": 1582590819967, "rating": 5.0, "text": "Dr. Sinclair was thorough..gave me hope when no one else did..the as staff was courteous. The np was very kind and the wait was under an hour. Dr took time too look back years and found things no one else had seen. I have many health issues and fear going to yet another physician with my health precarious. I felt dr..singulair was straight to the point and honest. Finally a dr who you can trust. Its half the battle with any illness! Trust", "pics": null, "resp": {"time": 1598403745741, "text": "Thank you so your feedback. We appreciate your positive comments."}, "gmap_id": "0x8892934178e7e66d:0xb995d735e6f6d9ad"}
{"user_id": "112837772364894703627", "name": "Diane E", "time": 1556827272035, "rating": 5.0, "text": "I saw Melissa Watkins CRNP today, & she was wonderful!  She took time to talk to me & explain things in a warm & friendly way!  She put me at ease & was very caring!", "pics": null, "resp": {"time": 1567304384584, "text": "Mrs. Diane thank you very much for your sweet comments. I will definitely let Melissa know."}, "gmap_id": "0x8892934178e7e66d:0xb995d735e6f6d9ad"}
{"user_id": "110358786544107621225", "name": "Tank Holland", "time": 1581625096783, "rating": 5.0, "text": "The staff was excellent the service was great we were in and out in no time", "pics": null, "resp": {"time": 1598403769011, "text": "Thank you so much for your feedback"}, "gmap_id": "0x8892934178e7e66d:0xb995d735e6f6d9ad"}
{"user_id": "101172442872738862053", "name": "Pamela Delahunt", "time": 1550464346051, "rating": 5.0, "text": "Dr. Doty IV is an Awesome Doctor.\nHe is extremely professional and caring. I have and have had a lot of doctors and I can say that he is definitely rated as #1.", "pics": null, "resp": {"time": 1567304622229, "text": "Mrs. Delahunt thank you so much for your sweet comments. I will certainly pass this on to Dr. Doty."}, "gmap_id": "0x8892934178e7e66d:0xb995d735e6f6d9ad"}
{"user_id": "109574162617030090617", "name": "nick mcmillian", "time": 1563387974253, "rating": 1.0, "text": "I have been a patient here for about a year now.\nI have only 20% Lung Function.\nEvery time I had an appointment I went and only seen the nurse , never seen a Dr and I was promised that they would help me get treatments and do weekly test to see if any changes .\nEvery single time I go they send me to the nurse like I’m back at middle school, I’m 39 years old and dying quickly.\nPlease let me see the Doctor", "pics": null, "resp": {"time": 1567303955308, "text": "Mr. McMillan we take the care of our patients very seriously.  Our nurse practitioners are very well trained and take pride in seeing our patients. If you would like to see a physician instead of one of our nurse practitioners please contact our office manager and she will be glad to talk with you further and get you in with one of our physicians."}, "gmap_id": "0x8892934178e7e66d:0xb995d735e6f6d9ad"}
{"user_id": "102222089994944115084", "name": "laura kinney", "time": 1560518221794, "rating": 1.0, "text": "My loved one has stage 4 lung cancer & has been diagnosed with breast cancer.  Any time she has been in to be seen they have blown her off.  She was having some pain in her back and they told her it was pleurisy.  Because her case unique,  it was recommended by dr Sinclair she go to UAB.   She did go to UAB.  She had an arterial embolization done.  UAB sent her home with Gabapentin to control pain,  and told her to stay away from ibuprofen.  It worked when she left the hospital but the pain has increased and the Gabapentin is no longer working.  On our last visit Dr Sinclair told us he would help in anyway he could and not to hesitate to call.   My mom did call bc (she can’t get a call back from UAB) she is in pain & having to take ibuprofen, against recommendations.  She asked for more Gabapentin or a safer anti inflammatory or something.  The nurse who called back said nastily we didn’t refer you (mom used the wrong word they “recommended”) and we don’t do pain pills in this office and when my mom said wow,  the nurse snickered.  I’m horrified and disgusted.   The lack of care,  the negligence and the lack of accountability for doctors groups like these is inexcusable.", "pics": null, "resp": {"time": 1567304052415, "text": "Mrs. Kinney thank you for your feedback. I am sorry for your experience and would like to talk further with you about this issue. Please contact our office manager to speak in further detail."}, "gmap_id": "0x8892934178e7e66d:0xb995d735e6f6d9ad"}
{"user_id": "116038595236752235870", "name": "Karen Garner", "time": 1523290877925, "rating": 5.0, "text": "I have been a patient of Dr. Sexton for over 8 years.  I can proudly say he is my Dr.   He found  a rare fungus and a rare rare fungus and has saved me from many years of coughing and living.  Dr. Sexton is a  one of the most compassionate doctor\"s,  and I can't say enough about his nurse, Jennifer.  It's great to find a friend in the office.   Of course,  all the staff has been  professional but also very kind.  Thank you Dr. Sexton.", "pics": null, "resp": {"time": 1574035123991, "text": "Thank you Mrs. Garner. We appreciate your review. Looking forward to seeing you at your next visit."}, "gmap_id": "0x8892934178e7e66d:0xb995d735e6f6d9ad"}
{"user_id": "109516753458251265833", "name": "John Taylor", "time": 1558061209955, "rating": 5.0, "text": "From check in to Allison then to Amanda,  great first time experience.  Thanks", "pics": null, "resp": {"time": 1567304324195, "text": "Mr. Taylor thank you so much for your sweet comments. I will definitely pass this on to our staff."}, "gmap_id": "0x8892934178e7e66d:0xb995d735e6f6d9ad"}
{"user_id": "108196346347779110857", "name": "Brian S", "time": 1533614209097, "rating": 3.0, "text": "Once I received an appointment the staff was courteous and kind. It did take greater than 20 phone calls, multiple messages on answering machine, hours on hold as the next caller and nothing happened. I drove down from Enterprise to see how to make an appointment. H re I learned that the tricker referral was no good as 2 of the 4 did not take new patients. If someone would have returned my call it would not have taken me 52 days to get an appointment. Love socialized health care and lazy staffs.", "pics": null, "resp": {"time": 1574035071594, "text": "We apologize for any issues you had with your experience at our office. Please contact our new Office Administrator with any further issues. Thanks for your time and review."}, "gmap_id": "0x8892934178e7e66d:0xb995d735e6f6d9ad"}
{"user_id": "117885090367359957238", "name": "Cynthia Newman", "time": 1548337026922, "rating": 5.0, "text": "I was sent by my Doctor, and I was very pleased with the way I was taken care of. You can tell they care about the people who come to see them.", "pics": null, "resp": {"time": 1567304577155, "text": "Mrs. Newman thank you so much for your sweet comments."}, "gmap_id": "0x8892934178e7e66d:0xb995d735e6f6d9ad"}
{"user_id": "107144276825433598712", "name": "miriam mularz", "time": 1516909453236, "rating": 1.0, "text": "Your NEW way of registering is gonna take some getting use to. So many people needing help. Only 2 machines and so many people needing Help. One person helping?\nIf everyone is in network why is it necessary to fill out more paperwork?", "pics": null, "resp": {"time": 1574035231951, "text": "Thank you for your review. We have some wonderful front desk now that will be glad to help you check in. We also have a new mobile checkin so you can bypass the kiosk. Please let is know if we can assist at your next visit."}, "gmap_id": "0x8892934178e7e66d:0xb995d735e6f6d9ad"}
{"user_id": "109286338220573980387", "name": "Harold Powell", "time": 1524768523575, "rating": 1.0, "text": "My sister is from AL and is in TX visiting me. She must be on oxygen 24/7 and her portable machine broke 3 days ago while visiting me.  Her Dr. At the clinic is to fax a pres. to the local Lincare office who will authorize the Lincare in TX to send out tanks while she is in TX, as well as a supply to get her back to AL, which is a 10 hr. Drive.  My sister spends the night half way on her return home and makes it home the second day rather than driving 10 straight hours. We have contacted the Dr.’s office 2 days and still do not have oxygen tanks. The receptionist said she would give the message to the nurse yesterday. No call from the nurse. I called again today and receptionist said she gave message to the nurse yesterday and will remind her.  This has been 3 days and the office has done nothing.  It’s time to get rid of them and find another doctor and office with more efficient  and caring employees.   My name is Margie Powell and I love my sister and do not like to se her suffer like this due to her Dr and the staff not looking out for her.", "pics": null, "resp": {"time": 1524771533907, "text": "Ms. Powell, according to the people at Lincare, this has been taken care of.  Please call me directly if you still don't have any resolution.  Jody"}, "gmap_id": "0x8892934178e7e66d:0xb995d735e6f6d9ad"}
{"user_id": "105558299546080627978", "name": "Cathy Watson", "time": 1508250736191, "rating": 1.0, "text": "Apparently they have some issues in getting things done in a timely manner.  The CRNP who saw me when I was finally given an appointment about my sleep study (after my cardiologist contacted them) was very nice and told me I had severe sleep apnea.  She would send a prescription to the place I chose and they would contact me.  After a week of not hearing from the medical supply place I called and they had received the prescription but not a copy of other required paperwork which was a copy of the sleep study and where the doctors had referred me.  I had to call the doctor and also Pulmonary Associates to get them to fax it to the medical supply place.  It just seems if it was my responsibility in the first place I should have been informed a little better.  Sorry but I can't give them a good rating but perhaps it will improve when I go back for a followup appointment.", "pics": null, "resp": null, "gmap_id": "0x8892934178e7e66d:0xb995d735e6f6d9ad"}
{"user_id": "109332142884127389713", "name": "Scott Cooper", "time": 1504287864129, "rating": 2.0, "text": "Saw Dr he gave me a sample of medicine and supposedly called in script to my pharmacy. No script, call back talk to nurse she saw his notes gonna call it in. Now it's Friday and still no script 😕 must be a communication problem", "pics": null, "resp": null, "gmap_id": "0x8892934178e7e66d:0xb995d735e6f6d9ad"}
{"user_id": "101111960825688869233", "name": "Gary John", "time": 1506095224375, "rating": 5.0, "text": "Dr's are great never had any problems  with them", "pics": null, "resp": null, "gmap_id": "0x8892934178e7e66d:0xb995d735e6f6d9ad"}
{"user_id": "103466865010144555629", "name": "Janet Campbell", "time": 1540926845607, "rating": 5.0, "text": "They sure have helped me", "pics": null, "resp": {"time": 1567304517753, "text": "Mrs. Campbell thank you so much for your comments. We appreciate it very much and are grateful we are able to help you."}, "gmap_id": "0x8892934178e7e66d:0xb995d735e6f6d9ad"}
{"user_id": "109959597093107760483", "name": "David Clark", "time": 1503509393339, "rating": 1.0, "text": "Had a 10:00 appointment.  Still hadn't been seen at 10:30.", "pics": null, "resp": null, "gmap_id": "0x8892934178e7e66d:0xb995d735e6f6d9ad"}
{"user_id": "116238820200796561427", "name": "Life in Camo Media, LLC", "time": 1619720614851, "rating": 5.0, "text": "We have used Jackson Surgery Center three times in the last two years and every visit was a positive experience. The staff is friendly, the nurses are kind and knowledgeable about every procedure we were there for. The staff kept the family/driver informed the entire time the patient was there. The billing department was very easy to work with. I was able to get someone on the phone every time I called to get an insurance issue resolved. I would highly recommend Jackson Surgery Center to anyone that needs the type service they offer. I would give them 10 stars if it were possible.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPQmD3NONX5lxnTqqGpPpccmzty7UBXatECy-lz=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "114488075300264503910", "name": "Janice Howell", "time": 1623257740459, "rating": 4.0, "text": "I had a great experience with my kind and caring nurses at my pre-surgery and recovery room time. I'd like to thank Cherri, Philanda and Cheryl personally for their great work. They made sure I was comfortable. As for as the surgery, the anesthesiologist and surgeon made sure I was knocked out for the 7 stitches although I didn't choose to be. Doctor was very late so he didn't want to waste any time. Maybe it was for the best but it was definitely not my choice.", "pics": null, "resp": null, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "117375952924911138946", "name": "Russell Marks", "time": 1614872568983, "rating": 1.0, "text": "I was schedule for a colonoscopy on Mar 4th.  I was notified that I had to report to Surgery Center for Covid 19 test prior to having the procedure.  I called the doctor's office to see if I could have it done in Prattville area as I lived North of Prattville and was told to call Jackson Surgery Center, I did and they said that would be fine.  So I got the test and a letter saying  I had a negative result.  Then next day I get a call from JSC saying what I had was not good enough.  I was asked why I didn't get tested at JSC and explained that it was more convient to have it locally.  She stated that she lived south of Montgomery and came to work every day.  This really upset me!  Long story short I had already spent a whole afternoon getting tested and by the time she called had already begun the prep and had to cancel the procedure.  They need to get better people friendly personal    to contact patients and get there act together as far as what is acceptable covid testing.  I had this procedure at the JSC (prior to Covid) and it was a great experience just glad I didn't have contact with this person back then.", "pics": null, "resp": {"time": 1614949554575, "text": "Mr. Marks, thank you for bringing this issue to our attention. We apologize for any confusion.  We will address this issue with our staff, the response you received certainly isn't our expectation. For future reference we have Important Covid Information on our website. You can find it here to review our policies.\n\nhttps://www.jscal.com/blog/covid-19-information/\nIf you have further issues or questions please contact our director Missy Sallas 334-293-8484"}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "100150209495080402340", "name": "Lisa Hudspeth", "time": 1601996170033, "rating": 1.0, "text": "Better check to see what you owe or they will not do the operation.  They never told me the countless times I’ve spoken with them.  They were extremely hateful.  I asked what I needed and they said insurance card and license.  I drove 4.5 hours and they were going to cancel on me!", "pics": null, "resp": null, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "106860308004527833404", "name": "Vernon Hunter", "time": 1550070817024, "rating": 5.0, "text": "We had a wonderful experience here. Very welcoming and professional. The ladies at the front desk were very nice and helpful.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMEA6SuVnqtgNXXnNkzREdg32B0zgufuc5cv_E=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO4uB51fxyaeDpO2yDu2wNTSxPqh2O8yHqB2fs=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMKelv6hT0qb05rGgjtyF822D8UYa0I-uSI8Co=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMzww9DxQJkCwnUedUgw9PJeezxKmFfHtLDnDk=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipObPWGFUVK4hTVE8lS2E-RgkyerbdsOR4Hh2tw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNXQS8EPgYZFbDmxHO9f_bBDZmc1UFM-44zLdY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMJqrimS9z6XE50WzCh_gGS9Fn5EyK0YrWWMCI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNjU73BEntArb0ed9LGb1NqqNaIqXlaFJzlV5g=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNpw9Gg51OKBGQDnwp4D3vjqdxV92b8CKCXQvY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPZwGldC5pb6lfTxx5riGecXESwGA5LbK89DLY=w150-h150-k-no-p"]}], "resp": {"time": 1550078887420, "text": "Thank you so much for the positive feedback.  Our team will be really happy to hear you noticed.   Thank you!"}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "113385512553342126004", "name": "Rosilind Maxwell", "time": 1571770585377, "rating": 5.0, "text": "I just wanted to tell everyone how much I appreciated you all for being so gracious and concerned about the experience that I had with you all on October 21st. You made an unnerving and uncomfortable situation pleasant and endearing.  Thank you from the bottom of my heart. God bless each and everyone that works in that entire building.", "pics": null, "resp": {"time": 1571774286418, "text": "We thank you and are very happy to have had a positive impact on your experience.  Thank you for your kind words we will share this with our team.  With sincere appreciation. Take Care!"}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "103227802844892782214", "name": "Jason York", "time": 1574466873995, "rating": 1.0, "text": "We were surprised by having to pay a second co-pay, one for the facility for the doctor. It was explained that this is because the doctor is not affiliated and it is an out patient surgery. However, the doctor's name is listed as part owner, not to mention the fact that we have had out patient surgeries in the past and not had separate co-pays. We will not be using this facility again, as it appears to be using any way possible to take money. We could have refused, but we already had the time scheduled off work, and it's hard to rearrange a surgery. At the very least, they could have let us know this in advance, instead of at the time of the surgery. We will be using the Baptist hospital system from now on.\n\nUpdate: No, it wasn't really addressed, we were just told that we would have to pay again or reschedule. It's not about the money, it's about letting us know in advance that there are two separate co-pays, which was not done.", "pics": null, "resp": {"time": 1574442580320, "text": "Hi Jason, we apologize for any miscommunication. Our administrative team is aware of the concern and has addressed this with the patient.  If you need future assistance or have further questions about our billing policies, please contact our Administrator Mr. John Gray 334-293-8484"}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "103860438254680297210", "name": "Barbara Sowell", "time": 1580652862613, "rating": 5.0, "text": "Great experience! Wonderful staff. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "101193850016028689346", "name": "leo zemke", "time": 1539124545151, "rating": 1.0, "text": "I am glad everyone else had such a fantastic experience at this place but they almost let my step son DIE!  He came in and was scheduled for exploratory surgery to fix SHODDY WORK DONE BY DR CHANDLER during a sinus polyp surgery and my step son began to pour blood from his Sphenopalatine Artery and the office was more worried about getting another three hundred dollar copay out of us than helping my son.  My wife had to scream for help in the office to get nurses and a doctor to get my son and help him.  We were treated shabbily during the whole ordeal.  My step son was bleeding to death and they did not even have the ability to  give him blood at this facility.  They almost killed him!  IT WAS HORRIBLE!  A HORRIBLE ORDEAL!!!!  I should post photos of all the blood.  The clinic manager was not friendly, everyone acted as if they did not know what was going on or what to do.  They had to take my son by ambulance over the the hospital and then the nightmare continued.  The ER doctor threw my son out of the hospital room that he was scheduled to be in.  It was like they tried to kill my son and then they were trying to sweep us under the carpet or out the door.  TO HIDE US AND THE HORRIBLE THINGS THEY DID AND THE WAY THEY ALMOST KILLED MY SON!!!   It was a nightmare!  They were going to give my son a blood transfusion in the ER and sweep us out the door.  MY WIFE HAD TO ENLIST THE HELP OF THE AMBULANCE DRIVERS Who could see that our son was in agony and practically DEAD AT THEIR HANDS!  The ambulance drivers GOD BLESS THEM talked the angry, crazy doctor into keeping our son and putting us in a room for the night.  This was the worst thing that has ever happened to our family.  I would not allow this clinic to operate on a PET COCKROACH if I had one!  PLEASE BEWARE!!!", "pics": null, "resp": {"time": 1539276470948, "text": "Dear Leo, we sincerely apologize for your experience with the Jackson Surgery Center.  We strive to provide the highest level of care equally to all of our patients.  We appreciate your feedback and are addressing the issues mentioned with our administrative team.  We promise to also forward your concerns to the Jackson Hospital Administration.  Our commitment to protecting patient privacy disallows us to discuss this in an open forum.  Please do not hesitate to contact our administrator John Gray at 334-293-8484"}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "112297912146866970493", "name": "Whitney Boutwell", "time": 1555592531295, "rating": 4.0, "text": "Very organized...very clean", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOXOLIBacBgsHxJG5iQ1wSlUfQoJG7vzmpR9JTM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOlpBS1BQZG6WSGqYqPA5y9JvzmNyonq_4GAx8J=w150-h150-k-no-p"]}], "resp": {"time": 1555676575347, "text": "Thank you Whitney!  We appreciate your observations and are happy to provide healthcare services to you and your loved ones.  I’ll share your comments with our team. Happy Friday!"}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "106585088584921164573", "name": "Carol Roberts", "time": 1533780088492, "rating": 5.0, "text": "My husband and I have both been here for minor outpatient procedures. We could not be more impressed with this facility and can enthusiastically recommend it to anyone needing surgery. We both had excellent care while we were there. The nurse even gave me novacaine before placing an IV in my hand (totally unnecessary, but I appreciate the thoughtfulness). I had some questions about anesthesia, and they actually brought the anesthesiologist to me to answer my concerns. After care and instructions were good.", "pics": null, "resp": {"time": 1533781108127, "text": "Carol we so appreciate your observations.   Thank you for noticing the “little” things we do to make your outpatient experience favorable.  Speedy recovery!  We will check on you soon!"}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "108378131542001498396", "name": "Michelle Swofford", "time": 1515160287657, "rating": 5.0, "text": "They took excellent care of my daughter and staff was super friendly.   She had an excellent nurse in recovery.   Everything is very organized from registration to discharge.", "pics": null, "resp": null, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "116107001445522782197", "name": "Keri Chaney", "time": 1536781345836, "rating": 5.0, "text": "This was my first procedure done here. Wonderful staff, very professional. Pleasant experience.", "pics": null, "resp": {"time": 1536783535671, "text": "Thank you!  We appreciate your kind words and will share with our staff.  Have a super recovery!"}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "113375147722597424669", "name": "Vincent Seabrook", "time": 1523394870461, "rating": 5.0, "text": "First class service.  5 star rating.", "pics": null, "resp": null, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "118051830061796961119", "name": "William Wheat", "time": 1533699862201, "rating": 5.0, "text": "Very nice service and friendly staff", "pics": null, "resp": {"time": 1533728675636, "text": "Thank you William.  I will share your kind remarks with our team."}, "gmap_id": "0x888e81bd7bfae851:0x5a6466265192d840"}
{"user_id": "110665223942811513404", "name": "2B Beautiful", "time": 1617742678265, "rating": 5.0, "text": "Exceptional, all the way around! Dr. McCrory was literally a God send. I had searched for several years to uncover what was wreaking havoc on my health. No one I had seen previously came even close to a proper diagnosis. That was until I met Dr. McCrory. From my first visit to Pulmonary Associates I knew God had lead me to that practice. He listened to get a good understanding of all I had been addressing and trying to resolve. My collective problems involved more than just the pulmonary issue I had come in for. He was meticulous and knowledgeable about all we discussed. His judgement was sound as was his execution of his expertise. In his endeavor to get to the bottom of how all the other issues including the pulmonary one might tie into something not previously considered by others; he performed test not taken before thereby uncovering what my true diagnosis was. I am so grateful for all his efforts in helping me resolve what had been a pain staking journey to peace of mind! He is truly a great doctor!", "pics": null, "resp": null, "gmap_id": "0x88621354cd5e06ad:0x5df1494541bb0ade"}
{"user_id": "105724775135043932717", "name": "Joe Boxer", "time": 1611256107463, "rating": 1.0, "text": "This office is very unprofessional and the office manager is rude and unhelpful. I called this morning to find out why I have not received a return phone call from their office. I learned that Dr Vupaula‘s nurse had to leave unexpectedly and he has a new assistant. I told the girl it wouldn’t my fault that she had to leave and then when I call and leave a message most people want to return call back. I ask was the new employee not trained to follow up on telephone calls. It could potentially mean life or death for some She told me I was hateful and hung up on me. So I’m hateful because their employees fail to do their jobs and follow up. If you can’t handle your office managers job; then maybe you should change careers. I would avoid this place at all cost. I see why the ratings are not good. FYI. Medicare said the doctors office where she’s been FOREVER should have known that my mom was due a new Cpap machine. Guess what....with one phone call a prescription was written and a new machine has been ordered. Thanks for nothing. These people could care less. Please learn to follow up with your long term patients.", "pics": null, "resp": null, "gmap_id": "0x88621354cd5e06ad:0x5df1494541bb0ade"}
{"user_id": "111100524810670529958", "name": "Dan Staples", "time": 1603979907018, "rating": 1.0, "text": "Was having sleep issues. They correctly diagnosed sleep apnea. But instead of looking for the problem, they just prescribed a CPAP (which is a horrible solution BTW). I scheduled an ENT myself. He took one look at my nose and said \"your septum is so deviated I am not surprised\". Quick surgery and all FIXED. Completely changed my life. PSA is negligent in not even looking for the problem. DO NOT USE these people.", "pics": null, "resp": null, "gmap_id": "0x88621354cd5e06ad:0x5df1494541bb0ade"}
{"user_id": "109299896672128749921", "name": "Jeffrey Rich", "time": 1602592641706, "rating": 1.0, "text": "Shoddy practice. Avoid these people at all costs. They are rude, inattentive, and dismissive.\n\nThey have lost a KEY part of my chart. Either that, or they are so incompetent that they can't figure out how to transmit it to my new doc in my new state after multiple tries.\n\nThis medical practice has somehow managed to lose my diagnostic sleep study, the ONE required piece of information I need in order to order a new CPAP and more supplies. Without this vital piece of my medical documentation, I must start from scratch here and do ANOTHER sleep study, complete with $750+ copay plus specialist office visit copays, in order to make sure I have a working CPAP and all the paraphernalia that goes with it. This pivotal piece of my MEDICAL CHART is gone. Completely unacceptable.\n\nI had my sleep study completed in 2017. I moved to another state at the end of that year. Repeated attempts to get the records of the diagnostic in-home study have come to no avail. This means that I have to undergo ANOTHER sleep study here, which is now dangerous, what with COVID-19, not to mention expensive and incredibly inconvenient from where I live now.\n\nOn my first visit to this practice, I received a letter informing me to be at their office at least 30 minutes before my scheduled appointment time. Myself and one elderly lady were at the door at the appointed time. Locked, and no one answered. After waiting in the chill morning on the stoop for about 25 minutes, we were let in and given forms. The receptionist, and older lady, stepped away from the desk. Other lady and I finished our forms and then waited for her to come back. And waited. And waited. After about 20 minutes of this, she laughingly came back to the desk with no apology and said she'd been having a cup of coffee and chatting with someone in the break room. The other patient and I exchanged incredulous words when we sat down to wait more.\n\nThe nurse was curt and huffy each time I went. On one occasion, she forgot to mention to the doc that I was in an exam room - I waited for about 50 minutes before I started roaming the halls, looking for her. I saw her in her office on the phone, and her eyebrows rose when she saw me and she apologized profusely when she did enter the room. The doc was great - the staff was just awful.\n\nI'd go elsewhere for my care if I still lived in Huntsville. My sense from day one was that since they were the only game in town, they could treat you however they liked, which, frankly wasn't good.", "pics": null, "resp": null, "gmap_id": "0x88621354cd5e06ad:0x5df1494541bb0ade"}
{"user_id": "102034176188314211549", "name": "Shosta MacAndrew-Kelly", "time": 1596047693798, "rating": 1.0, "text": "Dr. Allan McCrory, upon our first encounter I was please he seemed to be very informative, efficient, caring & had good bed side manors, witch I think Doctor's should display. However as time continued to go on witch was a mistake on my part, I should have paid attention to the red flags and dissolved the doctor~ patient relationship. He is Not attentive, He spent no time in any of our appointments 2-5 minutes at the most, literally! He did not listen to my concerns seemed to brush them off as nothing, He was more concerned about getting to the next patient & his nurse was just as rude. I had already made up in my mind that when I went in to discuss my chest/lung scan on 7/28/20 this would be my last visit with him. His nurse asked how I had been doing. I explain horrible since my last appointment with him witch was in March. I have lupus and we all know this horrible disease can attack your organs. I was in his office in March complaining of the very same things I always have since day one of being referred to him. Well in April at the beginning my symptoms had began to get worse, come to find out I had bacterial pneumonia, bc this doctor doesn’t take the time a patient deserves he did not discover this bc he doesn’t do anything than the bare minimum. Took me two months to recover from. As time goes on I simply can not breathe doing any kind of task. Showering, brushing my teeth, going up and down my stairs in our home, cleaning, sleeping, laying flat or sitting up. My breathing is very difficult & labored and my other doctors have noticed & tried yo address accordingly. Being that he is my pulmonologist I’m advised to contact his office. I do and it takes an unacceptable amount of time to get anything addressed, however his nurse told me on my last visit before she went to get him, she hushed me with a finger ad if I was a child & told me stop talking and save my breath so I could tell him my complaints. I explained to her that my ability to breathe was becoming more difficult even in simply conversation so I’m assuming this sarcastic gesture & remark was stemmed from me expressing that. I told her that he never takes the time to listen and address my concerns and spends no time with me so I can, obviously she told him that like she said she would and when he came into the room it was obvious by his demeanor he may have been bothered by what I expressed. This man has continued to speak with me about acid reflux continuously, he is my pulmonary doctor not my GI doctor so let’s discuss my pulmonary issues not my GI issues that you say is the cause of everything witch I politely disagree. I’m 41 not 4, I know my body I know what going on and he would to if he took the time to listen. He was very rude as I sat there crying simply trying to express my concerns my fears of what I’ve been complaining about since day one. He was intimidating, rude, starting loud talking me after I asked him not to, dismissed my report from my ct scan dismissed the ongoing issues of my breathing getting worse, ask did I trust him and after receiving my answer is when the very inappropriate behaviors as a doctor began. This is not acceptable to me and if it was the patient acting in these ways 911 probably would have been called, he “ fired “ me as a patient he got up left the room as if he was coming back. I sat there crying, frustrated, humiliated, saddened after sitting in my car for over an hour bc he was late to receive this kind of treatment and was in the physical office all of 3-5 minutes for this? I got up to walk out he seen me looked at me in discuss and was walking into the room of another patient but, gave me the impression he’d be back in my patient room. I walked out... I pay way to much money is my co-pays my husband works way to hard to provide so we can have access to good insurance and benefits especially in my condition with lupus that has been a roller coaster ride of everything. We pay to much for him to do so little and still get paid. Absolutely a horrible doctor no bed side manor or compassion. No stars", "pics": null, "resp": null, "gmap_id": "0x88621354cd5e06ad:0x5df1494541bb0ade"}
{"user_id": "107463344148122113981", "name": "Abigail Cunningham", "time": 1544558535148, "rating": 5.0, "text": "Dr. Siddiqui is excellent, and I would highly recommend him!  I saw him for the first time as an inpatient at Huntsville Hospital recently, and I followed up with him at his Madison office today.  He is kind, compassionate, and highly competent, and he takes time to listen and to thoroughly offer explanations and answer questions.  His staff was also very friendly and efficient.  I was in and out of his office in 30 minutes, which I greatly appreciate!", "pics": null, "resp": null, "gmap_id": "0x88621354cd5e06ad:0x5df1494541bb0ade"}
{"user_id": "115752931542369566768", "name": "Marchell Matjazic", "time": 1536261926111, "rating": 2.0, "text": "Longest wait for a scheduled apt ever, and the reason was never explained. Our apt was for 12:15 and we have been there before.  Waited 1 1/2 hours in waiting room and inquired several times and kept getting told, he is checked in.", "pics": null, "resp": null, "gmap_id": "0x88621354cd5e06ad:0x5df1494541bb0ade"}
{"user_id": "103026927169268668533", "name": "FJ B", "time": 1540472229432, "rating": 5.0, "text": "Dr Alan McCrory is a good Dr! Takes his time  with you.", "pics": null, "resp": null, "gmap_id": "0x88621354cd5e06ad:0x5df1494541bb0ade"}
{"user_id": "106507029098203786735", "name": "Jim Brannon", "time": 1534478967062, "rating": 1.0, "text": "As long as he is affiliated with Crestwood I would not recommend. Ask to do your study at Huntsville hospital or elsewhere.", "pics": null, "resp": null, "gmap_id": "0x88621354cd5e06ad:0x5df1494541bb0ade"}
{"user_id": "109273473811995087688", "name": "Angie Quick", "time": 1537821879972, "rating": 5.0, "text": "Dr. McCrory", "pics": null, "resp": null, "gmap_id": "0x88621354cd5e06ad:0x5df1494541bb0ade"}
{"user_id": "109526165872697963072", "name": "JOYCE BRADFORD", "time": 1472689053245, "rating": 4.0, "text": "Dr Boyd Huntsville al area", "pics": null, "resp": null, "gmap_id": "0x88621354cd5e06ad:0x5df1494541bb0ade"}
{"user_id": "106200041615075797947", "name": "Monica Deason", "time": 1603638941650, "rating": 5.0, "text": "Dr. Beaty is kind, compassionate, and very knowledgeable. Of all my specialists, he is by far my favorite so, I made him my primary.  I feel safe with him in every aspect of my health. He always spends enough time with me to make sure I am comfortable with my plan of care.  I have a horrible chronic cough that he never gives up on. I feel certain that one day he will beat it!", "pics": null, "resp": null, "gmap_id": "0x88891a70cc9d00a5:0xf0ca83a38ba732c1"}
{"user_id": "103295393861510163913", "name": "vicki Prichard", "time": 1600410257966, "rating": 5.0, "text": "12 days at Grandview with covid was a frightening experience.  Dr. Beaty’s warm bedside manner and encouragement helped get me through.  I felt he was thorough and took time to explain covid pneumonia knowing I was there alone and scared.  He was a 5 star doctor!", "pics": null, "resp": null, "gmap_id": "0x88891a70cc9d00a5:0xf0ca83a38ba732c1"}
{"user_id": "100746959369167047493", "name": "Sheila P", "time": 1578606391152, "rating": 5.0, "text": "He is so compassionate with his patients... He has been our doctor for many years...", "pics": null, "resp": null, "gmap_id": "0x88891a70cc9d00a5:0xf0ca83a38ba732c1"}
{"user_id": "111405017442550658662", "name": "cola bama", "time": 1537209208008, "rating": 5.0, "text": "Dr.Beaty is the best.I used to be a float nurse at Montclair Hospital(later called Trinity and now called Grandview)I met and interacted with many of the physicians there.Dr.Beaty is the one I chose to be my personal physician.He is intelligent,wise,and above all,very kind.", "pics": null, "resp": null, "gmap_id": "0x88891a70cc9d00a5:0xf0ca83a38ba732c1"}
{"user_id": "112849953231811271186", "name": "LaTonya Stearnes", "time": 1516172091219, "rating": 5.0, "text": "I have been a patient of his for many years he is very compassionate and very thorough i would trust him with my life", "pics": null, "resp": null, "gmap_id": "0x88891a70cc9d00a5:0xf0ca83a38ba732c1"}
{"user_id": "102770951814480280992", "name": "Robyn Simmons", "time": 1520866399051, "rating": 5.0, "text": "Very caring and compassionate doctor. Wish I had found him sooner!!", "pics": null, "resp": null, "gmap_id": "0x88891a70cc9d00a5:0xf0ca83a38ba732c1"}
