{"user_id": "106588361019286746476", "name": "Robert Amaro", "time": 1597707739033, "rating": 5.0, "text": "I've used these folks twice now.  Two years ago, directly after purchasing a house that had sat dormant for 3+ years, the septic system decided to act up.  The Tice's came out late at night and found out that my tank was 100% overgrown with tree roots (reminded me of the scene in the Creep Show episode with the meteor).  They pumped down the tank immediately so that we could shower, and within a week they had come out and completely cleaned out the root system (chainsaw work INSIDE my tanks).  They did an amazing amount of work for a great price.  Yesterday, the old system started acting up again.  They came out first thing this morning so we could shower for work.  As we had suspected 2 years ago, the roots had gotten into the drain system as well. Absolutely amazing folks! Will always use them.", "pics": null, "resp": {"time": 1597804364349, "text": "Thank you Mr Amaro. See you soon."}, "gmap_id": "0x88896512f3750d81:0x1bb51a0a83c5bbf4"}
{"user_id": "109458967490625523050", "name": "James McElroy", "time": 1584845266392, "rating": 1.0, "text": "Charged to much and did not finish pumping tank showed up nearly full tank complained about how much it cost him to empty truck ,left yard trashy with gloves and cardboard paper, said they would come back and finish pumping.      All they did was just pump water 1/3 of tank out in tank never came back would not recommend con artist. Tank was still 2/3 full call (Newell tank service they pumped out rest for a lot less than these would and was very professional)", "pics": null, "resp": {"time": 1590309323585, "text": "As I recall and I remember this night very well. We came out to your house and you had only dug up one side of your tank (1 lid) and you had another lid broken. We pumped all we could out bc we couldnt get to the other side that was not uncovered. We flushed out your field lines going back 125 ft bc they were stopped up and we were trying to save the lines for you bc you didnt have the $$ to upgrade your tank. He stayed out there with his HEAD down in your tank trying to help you out. Again, bc you didnt have the $ to upgrade he was going to go as far as bring you a concrete lid of ours to put on your tank in place of your broken lid. You talked to him the next day and he told you that he would come back out there and finish pumping the tank if you got it all uncovered and bring you another concrete lid with no charge. So that is why your tank did not get fully pumped out that night at 11pm."}, "gmap_id": "0x88896512f3750d81:0x1bb51a0a83c5bbf4"}
{"user_id": "105267892426680180346", "name": "wanda mccombs", "time": 1595352585426, "rating": 1.0, "text": "I definitely would not recommended Jim Rice or his daughter they have no jefferson County license will take your money and leave with out finishing they charged 1248.00 to just cleaned out septic tank and then started telling me I need to upgrade said I had no field lines which was grap said he needed 4000.00 up front total price 6800.00 well came 2 times at night digging my yard in meantime messing my yard up with bobcat well 23 of January got a code violation from Leeds had no permit well he took the bobcat and left leaving my holes a mess . legal aid Merkei Wright has done nothing they did a invoice stated what they have done which was out right lie charged 2 times stated cleaned and pumped tank . there price is so jacked up too people do not use them", "pics": null, "resp": {"time": 1595354285961, "text": "Lets be clear Ms McCombs. Jim worked under your house for 6.5 hours to unstop the pipes under your house and he laid in YOUR raw sewage to unstop your pipes. We have an Alabama State license and County License. We sent you a check back to refund your money bc of all the problems you have caused us. There was nothing we could do at the time bc the WHOLE COUNTRY was shut down during COVID-19 pandemic. You were not patient with us and would not give the country time to get back to normal. BUT Jim was all great and wonderful when he came out to YOUR HOUSE in the middle of the night to unstop your house so you could go to the bathroom.. HE WAS ALL GREAT AND WONDERFUL THEN."}, "gmap_id": "0x88896512f3750d81:0x1bb51a0a83c5bbf4"}
{"user_id": "104998209264057543495", "name": "Emery Piper", "time": 1573459559402, "rating": 1.0, "text": "This company is very untruthful. Please make sure you have an understanding about the price before they come. They seem to twist prices around where you think your getting one price but you get another. They may tell you no service fee or no disposal fee. Then charge you.  There work is good. But be careful you may paydouble what you expect.", "pics": null, "resp": null, "gmap_id": "0x88896512f3750d81:0x1bb51a0a83c5bbf4"}
{"user_id": "112547734298455193435", "name": "Wendi Phillips Lawley", "time": 1568443071354, "rating": 5.0, "text": "Called them on Tuesday and he came out that evening so I could expedite my closing on my house. Professional and efficient, did a wonderful job. I would definitely recommend!", "pics": null, "resp": {"time": 1568601880655, "text": "Thank you Wendi. We greatly appreciate you."}, "gmap_id": "0x88896512f3750d81:0x1bb51a0a83c5bbf4"}
{"user_id": "110481825621269420285", "name": "Wallace Ragsdale", "time": 1579703635281, "rating": 5.0, "text": "They didn't leave until my system was working and fixed.  Showed up same day,  on time.  Thank y'all for great service!  Will choose again!", "pics": null, "resp": {"time": 1579709532490, "text": "Thank you so much. We greatly appreciate your business."}, "gmap_id": "0x88896512f3750d81:0x1bb51a0a83c5bbf4"}
{"user_id": "112767189803217868600", "name": "Wanda Mcombs", "time": 1594139353955, "rating": 1.0, "text": "This company  is a RIP off, charge me 1248.00 to clean septic tank  then starting  claiming  I need an upgrade  and that I had no field lines  well I have live here 24 years , gave me a price of over 6,000.00 said he needed 4,000.00 up front well game over 2 times at night  digging  up yard  on 23 of January  got  a code violation  he didn't  have a permit  that night he pulled out  left my yard  a mess both front and back  with major holes,  can't  get him back come to find out  no Jefferson county license  either should  not even started  it , biggest  problem  and crook", "pics": null, "resp": null, "gmap_id": "0x88896512f3750d81:0x1bb51a0a83c5bbf4"}
{"user_id": "114793636630744703417", "name": "Brandy Stalls", "time": 1544147825707, "rating": 5.0, "text": "These guys where at our house within 3 hours of calling, they even beat me there from work! They made sure the job was complete and all was in working order before leaving. (They were personal and entertaining as well) AMAZING service, GREAT people!", "pics": null, "resp": {"time": 1546161609006, "text": "Thank you Brandy for the kind words. We strive for 100% customer satisfaction, and we are very happy when we achieve it.\nThanks again, Phaydra"}, "gmap_id": "0x88896512f3750d81:0x1bb51a0a83c5bbf4"}
{"user_id": "106125309197059623967", "name": "clayton west", "time": 1613256300950, "rating": 5.0, "text": "Professional and knowledgeable service from a man that's been  drilling wells for over 40 years.   We couldn't be happier with the results.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN_WAs0brjZOzDP8L8NNWrRGDDM9uX1V8bxyan1=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888bbda0bb000b0f:0x8338b57669c223a3"}
{"user_id": "103360178755037772563", "name": "Alaina Samuels", "time": 1597170576991, "rating": 5.0, "text": "Pat Hurst was excellent.  He returned my phone call the same day and answered all of my questions.  He was able to work us into his schedule in a very reasonable time and was very professional throughout the whole process.  Pat is very experienced in his field, and he was extremely patient and made sure we had everything we needed.  We had a wonderful experience with Hurst Well Drilling and would highly recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x888bbda0bb000b0f:0x8338b57669c223a3"}
{"user_id": "103508122623494599658", "name": "Mary Knoechel", "time": 1616024370329, "rating": 1.0, "text": "We hired Pat Hurst to dig a well for us back in 2013.\nWe blindly trusted him to do the right thing.\nHe did not wire our pump properly causing our pump to fry-up. We were without water for an entire year.\nBe aware! Look elsewhere.", "pics": null, "resp": null, "gmap_id": "0x888bbda0bb000b0f:0x8338b57669c223a3"}
{"user_id": "109290663982171961483", "name": "Carl Katterson", "time": 1620130989941, "rating": 5.0, "text": "Always been fair and good for me", "pics": null, "resp": null, "gmap_id": "0x888bbda0bb000b0f:0x8338b57669c223a3"}
{"user_id": "101044525086887643057", "name": "Jeremy Alexander", "time": 1589316702123, "rating": 5.0, "text": "Absolutely Top Notch!! Flexible, accommodating, friendly and efficient.", "pics": null, "resp": null, "gmap_id": "0x888bbda0bb000b0f:0x8338b57669c223a3"}
{"user_id": "105517745393849096956", "name": "Steve Pierce", "time": 1608242705011, "rating": 5.0, "text": "I’ve used this company on a few repairs (the most recent was one I created) and every exchange has been professional, quick, and priced fairly. I’ve dealt with Rick each time and he’s a great guy to work with.\nFive stars for me-\n\nSteve Pierce\nCoast Equipment Services", "pics": null, "resp": null, "gmap_id": "0x889a526416483555:0xfa933d06d509ebed"}
{"user_id": "114549923175477789635", "name": "Dwight Keener", "time": 1558263235355, "rating": 5.0, "text": "Great price on a fuel injector pump rebuild. Saved me from buying a new one. Great job.", "pics": null, "resp": null, "gmap_id": "0x889a526416483555:0xfa933d06d509ebed"}
{"user_id": "103945743370275520911", "name": "Larry Miller", "time": 1592127830442, "rating": 5.0, "text": "Best turbo repair shop", "pics": null, "resp": null, "gmap_id": "0x889a526416483555:0xfa933d06d509ebed"}
{"user_id": "113004782316400347088", "name": "Victoria Edwards", "time": 1570130406856, "rating": 1.0, "text": "BEWARE!!!!!! Do not buy a turbo from this place!!! We bought a turbo for $1600 dollars and 3 weeks later it went out and now they don't want to cover it with the warranty. This is the worst service I have ever received and a WASTE of money. I got children to feed.", "pics": null, "resp": null, "gmap_id": "0x889a526416483555:0xfa933d06d509ebed"}
{"user_id": "100869027137899215669", "name": "Chloe Barr", "time": 1560412073470, "rating": 4.0, "text": "Really enjoy the customer service :)", "pics": null, "resp": null, "gmap_id": "0x889a526416483555:0xfa933d06d509ebed"}
{"user_id": "112283004879325645899", "name": "Capt Tom Adams", "time": 1467050154012, "rating": 5.0, "text": "Test CalibrationGreat place for turbos and injector pump rebuilds!!! Nice folks too ! Tom Adams Mexico Beach Charters", "pics": null, "resp": null, "gmap_id": "0x889a526416483555:0xfa933d06d509ebed"}
{"user_id": "110933377730012459235", "name": "Jackie Neese", "time": 1502726785374, "rating": 1.0, "text": "I have been dealing with this company for a year and they refuse to stand by their parts- if you can get coverage for the part your lucky but you will never see a dime for labor compensation. DO NOT use them ever!!! Deal with someone who will stand beside their parts and back them with labor coverage. They are horrible to deal with!!!!!", "pics": null, "resp": null, "gmap_id": "0x889a526416483555:0xfa933d06d509ebed"}
