{"user_id": "102763242243969799804", "name": "Nancy Emig", "time": 1628797793999, "rating": 5.0, "text": "Customer service was great. Jenny was very knowledgeable and courteous.  Service person was extremely courteous and knew exactly what to did and my air was back on in immediately. I would refer this company to my family and friends.  Thank you so much!!", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "110866412856322057901", "name": "Regina Wilson", "time": 1621799194845, "rating": 1.0, "text": "This used to be a good company before they start offering the repairmen commission when they sold an AC unit.  My family and I used this company for years. The last time someone came out, they put freon in my unit and said I needed a new unit because the leak was coming from within.  I called another guy who looked at the unit and said you have a leak in a hose outside.  He could tell because leaves and dirt had settled in the spot where the hole was. He fixed in about 10 minutes and havent had a problem since.  The time before that, someone came out, and didnt bother to look at anything, and said they could get me a new unit and they would have it built on a concrete block to make it nice.  I called someone else and it was the fan motor. Offering your employees commission has really prompted your employees to become scam artist, thus making your company look bad.", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "113766145320004189099", "name": "Carl B", "time": 1623845499024, "rating": 5.0, "text": "Smart and accurate to diagnose my problem, would use them again", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "116850070833444408122", "name": "Jessica Miller", "time": 1596284070839, "rating": 5.0, "text": "First time home owner here who should have listened to her father the first time he suggested Head's. Actually called a different HVAV company initially. That tech said a clogged drain line was the issue. It wasn't. Head's came out and actually listened to my husband and I about the problem, then proceeded to run his own diagnostics and handle the repair needed.\n\nNot a clogged drain but a bad module.\n\nThe tech was friendly, very knowledgeable, and I thoroughly appreciated him explaining to me what the issue was.\n\nThank you Head's for your time and professionalism. My family will only use your service in the future.", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "106281753751948710745", "name": "Machelle Thompson", "time": 1589463613355, "rating": 5.0, "text": "Head's installed the Heating/AC Unit in our new home in Foley. They are always fast to respond to any questions that I have. They keep you informed of their latest offers so I can keep our unit running at top efficiency.", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "102985102298550776790", "name": "kim reed", "time": 1596290722744, "rating": 1.0, "text": "When your serviceman calls to say he is on his way and my husband ask a time frame I don’t expect I will get there when I get there as his response ! Now to show up on a Friday tell us he doesn’t have the part in his truck it’s to expensive to carry all these parts around so will be back Monday charges 79$ service call leaves us with no air for the weekend in 90 degree weather with covid and my husband doing 8 hours dialysis daily at our home where all his equipment is we can not go to hotel ! I was not here at the time but you can bet I will be in phone Monday morning requesting a different service man if we hadn’t already paid 79$ and Dsld requested we use you id call someone else very dissatisfied and haven’t even had service done yet !", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "113445344028488429543", "name": "Peggy Duplan", "time": 1581171803301, "rating": 5.0, "text": "I had a problem with my grinder and the previous company never returned my calls. After about 4 messages left and no call I called Hanson’s and they came out same day and was very professional and great price. I will now use them for my plumbing. Thanks Hanson for a great job.", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "114497924266804833471", "name": "Max Reed", "time": 1573863584001, "rating": 5.0, "text": "Very friendly, professional and reasonably priced. I've never had a supplier react so quickly with such great service! I highly recommend Head's Heating and Air Conditioning.", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "102510875670280476574", "name": "William Blake", "time": 1574465569976, "rating": 1.0, "text": "Terrible company to do business with. They installed my heat pump two years ago. I’ve had to have them out half a dozen times in the last two years for repairs.  Now I had a warranty repair to the condenser unit outside. They said that the manufacturer would cover the parts and such but that I had to pay for four hours labor for the repair. ($200).\nTech arrived and 30 minutes later said that he had his equipment pulling a vacuum and was going to lunch. After he was finished it was 2.5 hours total (including his lunch break). Still charged me the $200!!!\nI would advise anyone and everyone to stay away from this company! Poor service, poor workmanship and even worse service!", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "118170354621171532318", "name": "JBEECH", "time": 1514614556749, "rating": 5.0, "text": "I highly recommend Heads heating and Air for any of your Heating and Air needs. They installed a new unit in my attic and done a first class job. They where very helpful answering any questions I had to ask them about the equipment and duct work they installed the service tech was fully trained and very knowledgeable about his job. Thank you Keith and Ronnie Head for the well trained crew y’all have at Heads heating and air.  I am well pleased. Thank you  Heads Heating and Air\n\nWell pleased.\nJBEECH.", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "105667653455301096443", "name": "Renee Fransen", "time": 1586971705950, "rating": 5.0, "text": "I've been a customer for well over 40 years ... Always professional, responsive and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "104435705706603197409", "name": "Rick Deason", "time": 1552963732435, "rating": 5.0, "text": "A+ rating from me over last several years. Most recent service/maintenance call was performed by Mark who, in my opinion, has a very high level of technical competence and communication skills. Far exceeded my expectations even with your excellent past experience. You are doing something right here with your customer service!", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "115545704603209643887", "name": "Lynne Cary", "time": 1554299231829, "rating": 5.0, "text": "Been using this company for years. They just put in an ac unit and did a fantastic service. Honest and they went the extra mile to make sure i was satisfied. You will not be unhappy if you use this company.", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "101646919585087404225", "name": "James Zirkle", "time": 1575807930127, "rating": 5.0, "text": "Head’s has an amazing staff that really treats you like family. Our most recent repair technician was Devo. Awesome tech, punctual and very professional.", "pics": null, "resp": {"time": 1576172569565, "text": "Thank you, for the review on Deveais we strive to give EXCELLENT customer service!"}, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "115581672754729684890", "name": "Gene Youngblood", "time": 1551952551906, "rating": 5.0, "text": "A great experience on this double installation. We hardly knew Chris, Gary and crew were here. In and out same day with no complications or mess left behind. Scott explained all the details and answered every question both before and after installation.", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "104968268801803856692", "name": "Amanda Forbes", "time": 1542213751368, "rating": 1.0, "text": "Will not use this company ever again! I was told I needed a whole new unit in 2015 so I did just that. Now since I have had my new unit installed we have had nothing but problems with it.\nHad to call them out here for multiple different reason with my air not cooling, my unit not coming on and parts apparently going bad. Note that was only in the first 2 yrs a total of 6 different times. Now this year at the start of summer my unit again was not working got them out here and it was a bad part again, got it to work. So now here it is the starting of winter and my unit again is not working, my heat will not come on! Note this was a brand new unit they put in. No reason i should be having the issue im having. My maintenance on my unit has been kept up 100%\nWould not recommend this company to anyone.", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "108266249882688280393", "name": "Wayne Vancleave Wayne Vancleave (Mrac!)", "time": 1503461736682, "rating": 5.0, "text": "Several years ago I had the truly great blessing of becoming employed by Heads! I learned a lot, about Air Conditioning, R 410A refrigerant and equipment. Thanks to Mr. Head the owner, and also to Mike Roy Service Manager. Truly the best I've seen around in a long time. Thanks again for all the blessings and knowledge. I know we haven't seen each other in several years, but would you please give me the most honest review that you can. Guaranteed Service Heating & Cooling. Thanks again. Check us out to if your in or around Madison Ms.", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "103510310020032652951", "name": "Robert Wendling", "time": 1571019821565, "rating": 4.0, "text": "Got a good estimate, they installed a new unit in my house in about 4 hours, very friendly crew, great work, I would recommend.", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "102107994376444305437", "name": "Frank Sloan", "time": 1586399076196, "rating": 5.0, "text": "Explained the issue clearly ; repaired in very timely manner.", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "107258411885631738895", "name": "Page Pulliam", "time": 1553685056849, "rating": 5.0, "text": "Terrific installation team!  Fast, efficient, friendly, and did a beautiful job cleaning up before leaving.  Wonderful experience!", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "117752504125220141083", "name": "Marvin Mohler", "time": 1568278416051, "rating": 1.0, "text": "Worst service I have ever received. The technician obviously didn’t want to be bothered with the job. Told me it was a bad unit and send it back. I called Earley Air Control, they actually researched the problem and had everything up and running in a day. No defects, no bad unit no returns just a simple problem that was fixed.", "pics": null, "resp": {"time": 1568384943917, "text": "Mr. Mohler,\nAt Head's Heating & Air we take our customers comments very serious and appreciate your feedback.  However, I do find it amusing that Head’s Heating & Air has NEVER been to your home.  Everything that you have posted is incorrect and false and frankly it’s sad that you would post something like this on our company ratings to boost the ratings of another company!\n\n****Pasted is a review you made for Early Air Control on the same day you posted this on ours. ******\n\nEarley Air Control Inc.\nHVAC contractor\nMooncrest\nPlace details\nMarvin Mohler\na day ago\nWe have used Earley for 18 years, they are always thorough, make sure the job is done right the first time and make sure they clean up behind themselves so it’s like they were never here, except your problem is fixed."}, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "116313068489500383247", "name": "Jayson Marrero", "time": 1564160558699, "rating": 1.0, "text": "Never utilize this company ever!!! Installed a way small HVAC system in my new house and keeps master bedroom 5 degrees warmer than the rest of the house. Had a blower module go bad and charged me $180 in labor and $80 call out fee for a 5 minute job.  An absolute rip off.", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "101322117485791180474", "name": "LaToya B.", "time": 1568811502920, "rating": 1.0, "text": "This company has the worst customer service (and equipment) that I have ever experienced in my entire life!!! They will lie directly to your face and try to blame you for everything that goes wrong with you unit. I had a service appointment yesterday from 1 to 5 guy was late called and told me he would be there about 6:35 to 6:40 and I told him I would be there at 6:40 so if he got there a few min before me he could start outside. I pulled up at my house at exactly 6:40 waited a few min and went and got a package from my front door and boom there was a sorry I missed you tag!!! I could t believe how I was treated and lied to, I arrived home to the min what time I said I would which according to him would not have been more than 5 min after him...so they could t wait 5 min for me when they where at least an hour and 35 min late after having someone sit at my house waiting for them to never come!!!! I can’t express how upset I was that this boy would lie to me and treat me the way he has.  It to mention my unit is a lemon that they refuse to replace that went out 2 to 3 times the very first year where they had to weld and replace parts so they could t blame those on me like they try to do now since it continues to go out a min of twice of year which they blame now on the type of air filter I have which is a load of ****!!!!", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "114696711938935118783", "name": "felicia owen", "time": 1542048211822, "rating": 5.0, "text": "great service! the guy was very patient with all the craziness with my kids and dog and the price was great.  I will definitely be sending everyone I know there way. thank yall!!!", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "100721140175028386882", "name": "Kim Lane", "time": 1568383591626, "rating": 5.0, "text": "Always friendly and quick to respond.  I would recommend them to everyone!", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "114407832354507111288", "name": "Deborah Cooper", "time": 1529357007671, "rating": 5.0, "text": "Called this morning and they were out to my house by 3:00. Great service, friendly technician. I would recommend Heads Heating and Air, as well as Mark Graham who was awesome at his job", "pics": null, "resp": {"time": 1539264350788, "text": "Glad we could be of service to you!"}, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "104369637901878847079", "name": "John Riordin", "time": 1408391227955, "rating": 5.0, "text": "After shopping around, I had Head's come and replace my damaged coil. Scott, the technician, was nice and thoroughly explained everything in layman's terms so I felt confident in his work. He even made sure to wipe his feet before coming inside everytime! I really appreciated that. The service was exceptional and that in my book is what gets return customers! very pleased.", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "105693206288915622255", "name": "Donald Ferguson", "time": 1588700290749, "rating": 5.0, "text": "Tech arrive when he said he would. Called to tell me he was headed my way and would be here in about 20 minutes. Very professional.", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "102587786600664704438", "name": "Trina Nicholas", "time": 1553734265773, "rating": 5.0, "text": "Jennie and Kyler were both very professional in setting up my appointment (Jennie) and Kyler was an excellent service provider for your company. He explained every aspect of servicing our unit and was very knowledgeable with our unit, many thanks to them both!", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "117358391366643135434", "name": "Salt Life", "time": 1497387466515, "rating": 1.0, "text": "The worse inefficient duct system Ive seen installed. It looks like a spiderweb of flex duct run everywhere. Should be a duct line with pipe takeoffs and short pueces of flex. They installed the cheapest, fastest system they could. Many leaks also. To get warranty work is when they feel like showing up. Stay away", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "109625874914374859790", "name": "deb c", "time": 1527020274617, "rating": 4.0, "text": "I realize some people had an experience quite different from mine, but my recent experience with Head's was quite good. I would give them 4 3/4 stars if that were an option. I recently bought a house in Mobile, and was given paper work showing the AC coils having been replaced in January 2018 by Head's, with a 10 year guarantee. On some of the 1st hot days this year, the AC did not seem to be cooling efficiently, and there was quite a lot of condensation and then ice on the lines. I called Head's with some reluctance due to the negative reviews, but they were extremely responsive, came out to the house in less than 2 hours, and were extremely thorough, professional, courteous, and pleasant. They diagnosed the problem, handled it, and then checked everything else, and explained exactly what was going on.  They even gave me a call the next day to make certain everything went well. The only reason I'd take of 1/4 star would be because there was some initial record keeping confusion, and the problem with the AC function was traced back to a cap which should not have been added/placed at the previous service due to the slightly unusual configuration of my particular AC and furnace. Luckily, the tech (Scott) was very knowledgeable and diagnosed it easily.", "pics": null, "resp": {"time": 1539264958188, "text": "We are very grateful of your review and are glad that we were able to properly diagnose and fix your problem!!"}, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "103524455633620996891", "name": "Britney Denny", "time": 1551843415990, "rating": 5.0, "text": "Very professional and all around great company!! You won’t regret choosing them.", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "106308904321261518309", "name": "Lindsey Pearce", "time": 1526354116225, "rating": 1.0, "text": "This is the absolute worst business ever experienced. So many issues... I will never recommend to anyone. I have lost over $500 to this place they refer to as a business. So unprofessional, lazy, unorganized, and incredibly rude. I have never experienced anything like this before.", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "117372000896313469659", "name": "Michael Escott", "time": 1599153822319, "rating": 5.0, "text": "Excellent services!!! Thanks", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "107188794662065465076", "name": "BJ Saxon", "time": 1551422444493, "rating": 5.0, "text": "Great workers and great work. Nice ppl", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "113866618934584926298", "name": "Patsy Lombardi", "time": 1556157894483, "rating": 5.0, "text": "Always great service...been using many years.", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "106400375618744494811", "name": "sam wilson", "time": 1401643886144, "rating": 4.0, "text": "Head's came out to fix our rental unit. They showed up shortly after calling and fixed our air conditioner quickly. We were worried we would have a ruined vacation, but it turned out great after all. Friendly and quick. We will call them again if we need anything!", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "117331279110845760592", "name": "mitch tanner", "time": 1556539264293, "rating": 5.0, "text": "Mark was very thorough checking out the ac system.", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "105715167711482382043", "name": "B B", "time": 1511195819739, "rating": 1.0, "text": "Zero stars if that was an option. Homeowners beware. After completing a major overhaul on our HVAC unit, the technician left unsecured, exposed wiring to short. After calling for a service call, I was expected to pay for their error. Even the repair technician admitted fault for the inferior wiring job. Please, please do not utilize this company. It will be my pleasure to reach out to the BBB, filing a complaint with the county for the unsatisfactory wiring repair, and reporting to all military members in the Mobile County area to not utilize this company.", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "117752334578167809463", "name": "Greeny Welch", "time": 1588696920868, "rating": 5.0, "text": "Considerate skilled technicians & good office staff!", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "113027406915142915231", "name": "Thaddeus Murphy", "time": 1577611764265, "rating": 3.0, "text": "They are slow about coming out the dispatch will not call you if they are running behind so if you don't call them you will be sitting and waiting I had an 8AM appointment they showed up around 4 that evening only because I call fussing but they are nice on the phone out of the four tech I have dealt with two knew what they was doing one told me my problem should've been fix four months ago after my 1st complaint said they knew about it from other complaints but they waited until my warranty was up to charge me", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "106203559741884366659", "name": "Wendy Harrison", "time": 1405433983648, "rating": 1.0, "text": "I had a horrible experience with this company!!!!  The tech that came to my house with no uniform on and left no paperwork with me, looked at my unit and after about 3 min. said I needed a new air conditioner and the compressor and circuit board was no good.  After I complained he spent about 5-10 min. outside and said he ran a test on the unit and it was not the circuit board but the compressor and it was not under warranty.  The next day they called and said the compressor is under warranty but the labor was $750.00.  I had another company come and give me a second opinion and without even touching the unit immediately saw the problem which was a $10.00 part and had it fixed in about 30 minutes!!!!!  I will NEVER use this company again and I hate it for people who are scammed by this company.  The techs make a profit for every unit they sell/replace and its sad that people are taken advantage of like this!", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "101435097164082592718", "name": "Jerry D.", "time": 1433369184567, "rating": 1.0, "text": "DON'T USE HEADS AC SERVICE THEY WILL NOT STAND BEHIND THEIR WORK!! THEY CAME OUT AND SAID THEY REPAIRED A LEAK ON MY CENTRAL UNIT. TWO MONTHS LATER THE COOLANT LEAKED OUT AND THEY WOULD NOT STAND BEHIND THE WORK THEY DONE. VERY  DISHONOST COMPANY. I AM DISABLED AND THE TECH TOOK ADVANTAGE OF THE SITUATION.", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "109035548483819017348", "name": "Meli Harrison", "time": 1465584734002, "rating": 4.0, "text": "We had another HVAC. Man look at the problem, and ge wanted $800-$1000 to repair or replace the unit. The Head's guy came out and fixed the problem for $156. They also previously installed our new furnace, so we have two positive experiences with them.", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "105207583388306877408", "name": "John Dawson", "time": 1573316637823, "rating": 5.0, "text": "Prompt, thorough, and professional in all respects.", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "115274276570846924296", "name": "Gary McFall", "time": 1522447659193, "rating": 5.0, "text": "Great service with knowledgeable answers to all my questions. Friendly employees.", "pics": null, "resp": {"time": 1539268821244, "text": "We are glad to be of assistance!"}, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "107803824541017491745", "name": "Matt Wilson", "time": 1529862122939, "rating": 5.0, "text": "Great service! Family business that cares.", "pics": null, "resp": {"time": 1539264288739, "text": "Thank you very much!!"}, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "110399829066083287084", "name": "Cheryl West", "time": 1564955927877, "rating": 5.0, "text": "Excellent service affordable priced", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "115780774782638389775", "name": "Seth Sill", "time": 1450620112645, "rating": 1.0, "text": "I would never use them based on my transaction experience & lack of communication when emailing them", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "114160458284670907764", "name": "Ricky Stechmann", "time": 1581270443606, "rating": 5.0, "text": "Good folks.", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "103630912268248394037", "name": "Mary Dovie", "time": 1564242045374, "rating": 5.0, "text": "Kyler is great!!", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "104691911236319946296", "name": "Henryk Sobierajski", "time": 1537220401839, "rating": 1.0, "text": "This Companion is not responsive and do not care much about the client.", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "116277646496173213251", "name": "Barbara O'Hara", "time": 1577844378991, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x889bb516345af031:0x227a2380101cd7b1"}
{"user_id": "106588361019286746476", "name": "Robert Amaro", "time": 1597707739033, "rating": 5.0, "text": "I've used these folks twice now.  Two years ago, directly after purchasing a house that had sat dormant for 3+ years, the septic system decided to act up.  The Tice's came out late at night and found out that my tank was 100% overgrown with tree roots (reminded me of the scene in the Creep Show episode with the meteor).  They pumped down the tank immediately so that we could shower, and within a week they had come out and completely cleaned out the root system (chainsaw work INSIDE my tanks).  They did an amazing amount of work for a great price.  Yesterday, the old system started acting up again.  They came out first thing this morning so we could shower for work.  As we had suspected 2 years ago, the roots had gotten into the drain system as well. Absolutely amazing folks! Will always use them.", "pics": null, "resp": {"time": 1597804364349, "text": "Thank you Mr Amaro. See you soon."}, "gmap_id": "0x88896512f3750d81:0x1bb51a0a83c5bbf4"}
{"user_id": "109458967490625523050", "name": "James McElroy", "time": 1584845266392, "rating": 1.0, "text": "Charged to much and did not finish pumping tank showed up nearly full tank complained about how much it cost him to empty truck ,left yard trashy with gloves and cardboard paper, said they would come back and finish pumping.      All they did was just pump water 1/3 of tank out in tank never came back would not recommend con artist. Tank was still 2/3 full call (Newell tank service they pumped out rest for a lot less than these would and was very professional)", "pics": null, "resp": {"time": 1590309323585, "text": "As I recall and I remember this night very well. We came out to your house and you had only dug up one side of your tank (1 lid) and you had another lid broken. We pumped all we could out bc we couldnt get to the other side that was not uncovered. We flushed out your field lines going back 125 ft bc they were stopped up and we were trying to save the lines for you bc you didnt have the $$ to upgrade your tank. He stayed out there with his HEAD down in your tank trying to help you out. Again, bc you didnt have the $ to upgrade he was going to go as far as bring you a concrete lid of ours to put on your tank in place of your broken lid. You talked to him the next day and he told you that he would come back out there and finish pumping the tank if you got it all uncovered and bring you another concrete lid with no charge. So that is why your tank did not get fully pumped out that night at 11pm."}, "gmap_id": "0x88896512f3750d81:0x1bb51a0a83c5bbf4"}
{"user_id": "105267892426680180346", "name": "wanda mccombs", "time": 1595352585426, "rating": 1.0, "text": "I definitely would not recommended Jim Rice or his daughter they have no jefferson County license will take your money and leave with out finishing they charged 1248.00 to just cleaned out septic tank and then started telling me I need to upgrade said I had no field lines which was grap said he needed 4000.00 up front total price 6800.00 well came 2 times at night digging my yard in meantime messing my yard up with bobcat well 23 of January got a code violation from Leeds had no permit well he took the bobcat and left leaving my holes a mess . legal aid Merkei Wright has done nothing they did a invoice stated what they have done which was out right lie charged 2 times stated cleaned and pumped tank . there price is so jacked up too people do not use them", "pics": null, "resp": {"time": 1595354285961, "text": "Lets be clear Ms McCombs. Jim worked under your house for 6.5 hours to unstop the pipes under your house and he laid in YOUR raw sewage to unstop your pipes. We have an Alabama State license and County License. We sent you a check back to refund your money bc of all the problems you have caused us. There was nothing we could do at the time bc the WHOLE COUNTRY was shut down during COVID-19 pandemic. You were not patient with us and would not give the country time to get back to normal. BUT Jim was all great and wonderful when he came out to YOUR HOUSE in the middle of the night to unstop your house so you could go to the bathroom.. HE WAS ALL GREAT AND WONDERFUL THEN."}, "gmap_id": "0x88896512f3750d81:0x1bb51a0a83c5bbf4"}
{"user_id": "104998209264057543495", "name": "Emery Piper", "time": 1573459559402, "rating": 1.0, "text": "This company is very untruthful. Please make sure you have an understanding about the price before they come. They seem to twist prices around where you think your getting one price but you get another. They may tell you no service fee or no disposal fee. Then charge you.  There work is good. But be careful you may paydouble what you expect.", "pics": null, "resp": null, "gmap_id": "0x88896512f3750d81:0x1bb51a0a83c5bbf4"}
{"user_id": "112547734298455193435", "name": "Wendi Phillips Lawley", "time": 1568443071354, "rating": 5.0, "text": "Called them on Tuesday and he came out that evening so I could expedite my closing on my house. Professional and efficient, did a wonderful job. I would definitely recommend!", "pics": null, "resp": {"time": 1568601880655, "text": "Thank you Wendi. We greatly appreciate you."}, "gmap_id": "0x88896512f3750d81:0x1bb51a0a83c5bbf4"}
{"user_id": "110481825621269420285", "name": "Wallace Ragsdale", "time": 1579703635281, "rating": 5.0, "text": "They didn't leave until my system was working and fixed.  Showed up same day,  on time.  Thank y'all for great service!  Will choose again!", "pics": null, "resp": {"time": 1579709532490, "text": "Thank you so much. We greatly appreciate your business."}, "gmap_id": "0x88896512f3750d81:0x1bb51a0a83c5bbf4"}
{"user_id": "112767189803217868600", "name": "Wanda Mcombs", "time": 1594139353955, "rating": 1.0, "text": "This company  is a RIP off, charge me 1248.00 to clean septic tank  then starting  claiming  I need an upgrade  and that I had no field lines  well I have live here 24 years , gave me a price of over 6,000.00 said he needed 4,000.00 up front well game over 2 times at night  digging  up yard  on 23 of January  got  a code violation  he didn't  have a permit  that night he pulled out  left my yard  a mess both front and back  with major holes,  can't  get him back come to find out  no Jefferson county license  either should  not even started  it , biggest  problem  and crook", "pics": null, "resp": null, "gmap_id": "0x88896512f3750d81:0x1bb51a0a83c5bbf4"}
{"user_id": "114793636630744703417", "name": "Brandy Stalls", "time": 1544147825707, "rating": 5.0, "text": "These guys where at our house within 3 hours of calling, they even beat me there from work! They made sure the job was complete and all was in working order before leaving. (They were personal and entertaining as well) AMAZING service, GREAT people!", "pics": null, "resp": {"time": 1546161609006, "text": "Thank you Brandy for the kind words. We strive for 100% customer satisfaction, and we are very happy when we achieve it.\nThanks again, Phaydra"}, "gmap_id": "0x88896512f3750d81:0x1bb51a0a83c5bbf4"}
{"user_id": "100079592823055014419", "name": "Clive Armstrong", "time": 1615909553636, "rating": 5.0, "text": "Friendly and polite good business attitude", "pics": null, "resp": null, "gmap_id": "0x88892a5157743e2b:0x99e10c80efc2d540"}
{"user_id": "102397905746300512204", "name": "Tony Bright (robohiker42)", "time": 1573200444921, "rating": 5.0, "text": "Always have what I need. Prices are compatible.", "pics": null, "resp": null, "gmap_id": "0x88892a5157743e2b:0x99e10c80efc2d540"}
{"user_id": "103266833998957671556", "name": "Eddie O", "time": 1549567904566, "rating": 5.0, "text": "Excellent service and people", "pics": null, "resp": null, "gmap_id": "0x888972767605e81f:0x539ec552cd39c2df"}
