{"user_id": "107594182313251458655", "name": "Capt Nugs", "time": 1621966432379, "rating": 1.0, "text": "The receptionist is horrible, my first appointment she told me the wrong day, second appointment she lost my sign in sticker and after I waited 45 minutes I asked how much longer I had to wait and then she looked and found my sign in sticker. I left after waiting 2 hours. Would use anyone but this place!", "pics": null, "resp": null, "gmap_id": "0x888c2c0c572c4735:0x27cb5f09f548007a"}
{"user_id": "102522202329451004279", "name": "barbara brown", "time": 1597484568936, "rating": 1.0, "text": "This facility is incapable and lacks knowledge of imagining patients who have pacemakers compatible with MRI. They were all over the place in giving the reasons they could not see these type of patients which were inaccurate, eg., \"Pacemaker has to be shut off \"which is the wrong terminology on how patients with this compatible device are managed. This place is behind the times in comprehensive imaging.", "pics": null, "resp": {"time": 1597863533001, "text": "MRI centers accepting patients with MR-conditional implantable cardiac rhythm devices should refer to the SureScan Patient Scanning Process to find instructions for determining whether a patient with a Medtronic SureScan System meets the criteria to receive an MRI, as well as instructions to follow before, during, and after an MRI scan.\n\nAs indicated from the Medtronic web site, pacemakers and defibrillators are MRI CONDITIONAL, meaning all conditions must be met to perform the scan.  To safely scan a patient with one of these devices, proper monitoring must be performed during the exam, i.e. pulse oximetry or electrocardiography.  Please see below taken directly from their web site.  As you may notice, it is also required to have a defibrillator nearby when scanning patients with these devices.\n\nPacemaker and CRT-P Requirements: Proper patient monitoring*must be provided during the MRI scan.  An external defibrillator must be available nearby during the MRI procedure.\nICD and CRT-C Requirements: Proper patient monitoring*must be provided the entire time SureScan is programmed to On.  An external defibrillator must be immediately available the entire time MRI SureScan is programmed to On.\n*This includes visual and verbal contact with the patient and monitoring heart rate using instrumentation such as pulse oximetry or electrocardiography.\n\nAs an out-patient facility, we are not equipped to provide the level of monitoring required to perform MRI on patients with these devices.  This should give added comfort to prospective patients that we are considering all safety aspects of the exam rather than seeking to do all exams no matter the risk, just for financial gain."}, "gmap_id": "0x888c2c0c572c4735:0x27cb5f09f548007a"}
{"user_id": "117771020172809635711", "name": "Chance Cristwell", "time": 1576526941422, "rating": 1.0, "text": "Guy who bought the place actually ripped off the original owner, Suzanne Cristwell, who built the company, and paid her one installment of what was supposed to a multiple year contract. She's still trying to get it into court. Great quality equipment, especially considering the guy got it for next to nothing.", "pics": null, "resp": null, "gmap_id": "0x888c2c0c572c4735:0x27cb5f09f548007a"}
{"user_id": "108699333513666355151", "name": "Del Chick", "time": 1534280138963, "rating": 4.0, "text": "Closed MRI went great ! Had MRI on my lower back, only took 15 min. I went in feet first (thank goodness!) They gave me earplugs plus headphones to soften that horrific noise (it helped a lot). I also had Xanax. Put some pillows under me so I was comfy.  Had to keep eyes closed but at least my head was partially out. My arms were over my head on pillow holding my panic button, never used it.  Late in day seemed like better timeframe.  (At another place, they did this all wrong and I had instant panic attack, so I walked out!). This place is MUCH better.", "pics": null, "resp": null, "gmap_id": "0x888c2c0c572c4735:0x27cb5f09f548007a"}
{"user_id": "103190703707517351670", "name": "Peggy Chestnut", "time": 1508977991352, "rating": 5.0, "text": "Staff was very kind, punctual, and professional. I had a stress test performed within 24 hours of my physician's order. During the procedure every aspect was thoughly explained and monitored by the technician, and overseen by the doctor. I would definitely return for future services if needed, and will certainly recommend I M I.", "pics": null, "resp": null, "gmap_id": "0x888c2c0c572c4735:0x27cb5f09f548007a"}
{"user_id": "100783238213640100259", "name": "andrew moreland", "time": 1554359821070, "rating": 1.0, "text": "My brother had an appointment this past Tuesday at 2pm.  He was scheduled for a MRI.  When it was his turn we entered the room and she mentioned that his neck back and brain were being tested. I assisted the tech in getting my brother positioned on the table.  She put some type of head gear on him and she was having alot of trouble getting it on.  She kept trying to close it but it wouldn't close I thought it was too small but I wasn't sure she did finally get it closed (sidenote the headgear caused brusing under his chin).    Neither one of us had any idea on what was going to happen with this procedure.  She started the machine my brother nor I was told how long this procedure would take.   About an hour and a half went by we heard a banging in the room.  My brother was banging on the inside of the machine and yelling.  She pulls him out he is sweating profusely and he is shaking uncontrollably.  My brother is now refusing to finish the procedure.  We got him put back in his wheelchair he was crying uncontrollably as we left the clinic.  I'm not sure what happened in the MRI machine  to my brother but I would suggest that patients be told a little about the procedure and definitely how long the procedure will take.", "pics": null, "resp": null, "gmap_id": "0x888c2c0c572c4735:0x27cb5f09f548007a"}
{"user_id": "108835282275858384993", "name": "Solange Maury", "time": 1460065549887, "rating": 1.0, "text": "we were in  to get an MRI  waited for 2 hrs, when we asked how much time we had till our turn , they couldn't say... they said they werr running behind schedule. ... we ended up canceling our appointment. Don't schedule here waste of time! !!!", "pics": null, "resp": null, "gmap_id": "0x888c2c0c572c4735:0x27cb5f09f548007a"}
{"user_id": "107943412158637480608", "name": "SDavis Jones", "time": 1468599017702, "rating": 4.0, "text": "I went to IMI in Jan this year (2016) and again in July.  January, I had an echocardiogram; and in July, I had an MRI.  I had short wait times for both.  I was treated professionally for both, and have no real complaints for either.  Staff was courteous and professional.  I was referred both times by the same doctor.  I would not have any problems being referred again.  I gave them 4 out of 5 stars, because there is always room for improvement.", "pics": null, "resp": null, "gmap_id": "0x888c2c0c572c4735:0x27cb5f09f548007a"}
{"user_id": "118342154891853798175", "name": "Jill Smiley", "time": 1624052137675, "rating": 1.0, "text": "When the 1st bill was received I called and gave them both of my insurances to file. They never attempted to file on my insurance and next thing I know I'm getting a notice they sent it to collections. So I call collections and they tell me call this group. I've been calling and calling and staying on hold for more than 30 mins at a time and I'm not getting anyone go answer.", "pics": null, "resp": null, "gmap_id": "0x88891bd7b8112b9f:0xf62413311007eb01"}
{"user_id": "101470761223315794310", "name": "Moo Neigh", "time": 1591202521580, "rating": 1.0, "text": "Insurance paid my bill. I paid copay at office.\nBut I  kept getting bill even though people at office said they showed it as paid. Took me months and then after I  got written  confirmation that bill was paid, they turned it over to collection agency so I had to provide proof to them that the bill was paid. This is not acceptable.", "pics": null, "resp": null, "gmap_id": "0x88891bd7b8112b9f:0xf62413311007eb01"}
{"user_id": "108455199762604348218", "name": "Alyssa White", "time": 1616123073875, "rating": 1.0, "text": "These people sent a $18 bill to collections. After I had already made a payment and the bill was from the month before, never received a bill for the balance.  What a bunch of inconsiderate psychos.", "pics": null, "resp": null, "gmap_id": "0x88891bd7b8112b9f:0xf62413311007eb01"}
{"user_id": "116254826012210902622", "name": "Angelo Roma", "time": 1565121450380, "rating": 5.0, "text": "Believe the lower ratings seen elsewhere here reflects the out-of-state billing company; speak w/the BR Group and they are extremely accommodating in allevating billing concerns and handling payment ... hence the 5 stars", "pics": null, "resp": null, "gmap_id": "0x88891bd7b8112b9f:0xf62413311007eb01"}
{"user_id": "108622801590857810817", "name": "Tracey Barton", "time": 1551324371119, "rating": 1.0, "text": "Do not use Birmingham Radiological Group.  They sent out a bill to me with the wrong return address on it, which caused it to be late.  Cost me a 50 cent stamp. Then they changed me an extra $ 7.92 late charge.   Pretty sad I’d say and pathetic on their part.", "pics": null, "resp": null, "gmap_id": "0x88891bd7b8112b9f:0xf62413311007eb01"}
{"user_id": "102047817297546165243", "name": "Taylor Pappas", "time": 1541428957248, "rating": 2.0, "text": "*This review is for the billing department only* TERRIBLE. The bills they sent me did not correctly reflect my balance, and when I called the billing department, she was extremely rude about it. I never leave google reviews, but this lady’s behavior was unacceptable.", "pics": null, "resp": null, "gmap_id": "0x88891bd7b8112b9f:0xf62413311007eb01"}
{"user_id": "107609359098103305837", "name": "Kristy Clark (Robinson)", "time": 1584173200941, "rating": 4.0, "text": "I went in to have a mammogram and a bone density scan and I was in and out of that place in about 45 mins and that was including filling out the paperwork. The women who work there are friendly, they weren't smiling nor did they greet me as I walked in the door. I'm not complaining about it as I'm sure it seems I am. It's just unusual to walk in somwhere like that and see 3 women behind the front counter and not be greeted by at least one of them but, they were in no way rude to me and I will recommend them in the future.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPRTYtshglHfy0NLiT05QNfzHz8fejCc6GQhAEp=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNdGpNN18RF26YDvHDfewa6hF1qppDLWLRwDeEJ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNgl1UNP2SGJmGbkehjiHAMdxT9KIbjVS_R_6H8=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOePY-fGeLFrqEngOoeEBrC1Pe827STLopdZMv0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMjFSdUvqVZ0Y2RXi7WGipsajMGrugCKxx1cmXk=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMmgK0hBblxt8jart-48RJ_hrBlbGzFM0SXAp-A=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888bb1f2a13d6cb3:0x69444459bbe4060e"}
{"user_id": "113079655758977663172", "name": "Shannon Gauldin", "time": 1613414101931, "rating": 5.0, "text": "It's a very nice building inside and out. The staff was very kind and helpful too! The Radiologist was able to find the problem with my spine that some had missed in previous years. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888bb1f2a13d6cb3:0x69444459bbe4060e"}
{"user_id": "100342318910300394049", "name": "Lajuna Reid", "time": 1610147518924, "rating": 5.0, "text": "I would like to praise the girl that did sonogram of my leg, she was absolutely the sweetest and compassionate person.  She helped calm my nerves immediately.", "pics": null, "resp": null, "gmap_id": "0x888bb1f2a13d6cb3:0x69444459bbe4060e"}
{"user_id": "106878261312411244085", "name": "zeravela1", "time": 1622129239715, "rating": 1.0, "text": "Very rude customer service.", "pics": null, "resp": null, "gmap_id": "0x888bb1f2a13d6cb3:0x69444459bbe4060e"}
{"user_id": "110276973623499826595", "name": "Susan Watson", "time": 1605546095558, "rating": 5.0, "text": "Short wait time and very courteous staff. Allison did my ultrasound and couldn't have been any sweeter!", "pics": null, "resp": null, "gmap_id": "0x888bb1f2a13d6cb3:0x69444459bbe4060e"}
{"user_id": "114472514454873045492", "name": "Karen Buck", "time": 1578524129296, "rating": 5.0, "text": "Had to have 3 tests done. Everyone was great and friendly. Was in and out in under an hour and a half. Love this place and will definitely Use them again", "pics": null, "resp": null, "gmap_id": "0x888bb1f2a13d6cb3:0x69444459bbe4060e"}
{"user_id": "100239681464813045800", "name": "Josey Wolfblood", "time": 1579561841422, "rating": 1.0, "text": "In short . I was treated awful. Basicly. Called a liar by one the ladies behind the counter.  Was told if I didn't fill papers out really fast then I couldn't be seen. In not giving her name out. Also I wasn't at fault for nothing. It was advance imaging. I should say more of way I was done an in front of other people.  Its been awhile since been to the Anniston office. But I wonder. Where the nice people go. That worked behind the counter.", "pics": null, "resp": null, "gmap_id": "0x888bb1f2a13d6cb3:0x69444459bbe4060e"}
{"user_id": "112793139206442120335", "name": "Lawrence Marksberry", "time": 1575567385517, "rating": 1.0, "text": "If I could I wouldnt give even one star! It was an awful experience. The mri tech was cold, rude and without ability, I guess, to even give a half-smile. But the worst part is that I was stuck SIX TIMES before my contrast IV was started. The first, rudest, tech stuck me twice then called in someone else who finally got it on the FOURTH try. Yes that makes SIX attempts. But she tried to get me to just stop and call it finished without the contrast on her second (4th total) attempt. I told her no, that I wanted to get the complete test that my doctor ordered. She said she could probably put the iv in the underside of my wrist but that it would “hurt real bad”. I asked her to please try my thumb first, which she did and finally got it. Not one apology from either tech about having to stick me so many times. They did not care at all that they were hurting me, just that it was taking so long. This was unacceptable to say the least. When they finally finished the test, I had been in that one position so long that I couldnt get up. The tech gave me a disapproving look and just stood there frowning till I finally got up. I had trouble walking for some time after this debacle. Horrible place! I will do anything I  can to avoid ever going there again.", "pics": null, "resp": null, "gmap_id": "0x888bb1f2a13d6cb3:0x69444459bbe4060e"}
{"user_id": "114665401759897159364", "name": "Whitney", "time": 1543537748017, "rating": 5.0, "text": "Have been several times for an MRI, and the staff is always great!", "pics": null, "resp": null, "gmap_id": "0x888bb1f2a13d6cb3:0x69444459bbe4060e"}
{"user_id": "104547102503378989192", "name": "Christina Johnson", "time": 1464787872564, "rating": 5.0, "text": "The girls at front desk were very nice and patient with me!", "pics": null, "resp": null, "gmap_id": "0x888bb1f2a13d6cb3:0x69444459bbe4060e"}
{"user_id": "111469848629939490090", "name": "Blake Burgess", "time": 1562092261016, "rating": 1.0, "text": "The \"greeter\" was very rude, some of the others were nice, the greeter appeared to be the boss, uh, wrong choice", "pics": null, "resp": null, "gmap_id": "0x888bb1f2a13d6cb3:0x69444459bbe4060e"}
{"user_id": "115934086254684630629", "name": "Latangela Gaston", "time": 1459455559047, "rating": 2.0, "text": "2016- Advance Imagining front desk staff, presented rude & disrespectful to very diverse clienital ! Sly giggles & jokes that appeared to a be familiar inside trade  of the all Caucasian staff!  This made them appear very unprofessional!  Staff members poked fun of clients names for laughs from her friends,  instead of asking client how do you prenounce your name! If your familur with the MRI,  the technician  usually tells you a little about contraption & the noisy happenings, provides u with a choice of earplugs  or headset of music; Not here! Only offered after I ask, After I was in for 20 minutes & halfway deaf! I suggest that the owner, if not a member of the staff,  hold an insevice on professionalism in the work place & cover all  things mentioned,  talk to the office manager about  diversifing her staff &  teaching the Lil High School  acting girls & boys what to do & what nonsense will  not be tolerated within the office! Oh yea there was one good aspect, the service was quick!😊 Hopefully I'll get professional results & not  have to return!  Now to the staff You Can't judge a book by its cover, you have to read it in its entirety!  Now Happy Imaging !", "pics": null, "resp": null, "gmap_id": "0x888bb1f2a13d6cb3:0x69444459bbe4060e"}
{"user_id": "108684484724957934471", "name": "DOGTV", "time": 1595443696359, "rating": 4.0, "text": "Nice people", "pics": null, "resp": null, "gmap_id": "0x888bb1f2a13d6cb3:0x69444459bbe4060e"}
{"user_id": "101575948064222543375", "name": "Kellie Terry", "time": 1517867151967, "rating": 5.0, "text": "This facility is amazing, super clean with large changing rooms. There are windows in the MRI room so you can see daylight.  The machine isn't too tight.  Even larger people can fit comfortably.  The staff is super sweet and easy to work with.  They do everything they can to schedule your MRI for a day and time that is convenient for you.", "pics": null, "resp": {"time": 1532627217957, "text": "Thank you, Kellie!"}, "gmap_id": "0x886286909a0c2b1d:0x4eb6c3fa4619dbcf"}
{"user_id": "107532281106470587621", "name": "Alyssa H", "time": 1572659801113, "rating": 5.0, "text": "I had a great experience with my first MRI.  The staff were all friendly and glad to answer all my questions.", "pics": null, "resp": {"time": 1572726903601, "text": "Thank you for the kind review, Alyssa!  We appreciate you and your support."}, "gmap_id": "0x886286909a0c2b1d:0x4eb6c3fa4619dbcf"}
{"user_id": "104855703330462193098", "name": "Rebekka Sharpe", "time": 1511961537226, "rating": 1.0, "text": "Friendly staff, comfortable environment, but SCAMMY! I paid a large copay about three weeks ago to get an MRI and still know nothing. They \"sent it off to Birmingham\" to be read where the results would then be sent to my doctor, but my doctor has heard nothing. First of all if you have a state of the art MRI facility in Decatur Alabama why can you not have someone in Decatur Alabama read the results? Secondly if the results cannot be read at the facility then why Birmingham? There are plenty of places in the area that have someone in house to read your MRI, or at least get the results back to you in a day or three.", "pics": null, "resp": {"time": 1514388261931, "text": "Good Morning, Rebekka Sharpe.  The results of your MRI were sent to your referring physician on 11/15/17 in under 24 hours. We have the fax confirmation on file of when and where it was sent.  Your referring physician is whom you need to speak with about those results. If you are having trouble still, please call us at 256-350-7779.  Just let us know! We will be happy to send the results again to your referring physician if they need us to. We partner with a group of Radiologists to read our scans out of Birmingham. This helps to provide accurate reads in a timely manner (24 hour results). I hope this information helps.  Have a great day and we wish you a Happy New Year."}, "gmap_id": "0x886286909a0c2b1d:0x4eb6c3fa4619dbcf"}
{"user_id": "103087262805385508069", "name": "Phillip Hand", "time": 1494967313238, "rating": 5.0, "text": "Best staff around! Easy to work with and always make sure to give you the best experience possible. Definitely a 5 star organization!!!", "pics": null, "resp": null, "gmap_id": "0x886286909a0c2b1d:0x4eb6c3fa4619dbcf"}
{"user_id": "103032759725416942896", "name": "Renee Knight", "time": 1517686146039, "rating": 5.0, "text": "Friendly staff with same day scheduling. Very comfortable place to have an MRI. Especially if you are claustrophobic.  It is open on all 4 sides which made it much easier for me to relax and complete the MRI.", "pics": null, "resp": null, "gmap_id": "0x886286909a0c2b1d:0x4eb6c3fa4619dbcf"}
{"user_id": "112644535797295232634", "name": "Susan Williams", "time": 1517757190830, "rating": 5.0, "text": "Absolutely wonderful experience the staff is very friendly and willing to work with you in any way. I suffered from back pain for years and the last alternative was an MRI but I was claustrophobic but they were patient with me and worked with me to help me be able to get one, the openness of the machine was soo much better the problem was found I had back surgery 2 months ago and now NO PAIN! Thank you to Heath Alford and his stafff I would recommend them to anyone in my situation 😊", "pics": null, "resp": null, "gmap_id": "0x886286909a0c2b1d:0x4eb6c3fa4619dbcf"}
{"user_id": "107886256715711815064", "name": "Bobby Holladay", "time": 1513016923831, "rating": 5.0, "text": "Open MRI's staff was unbelievably nice and courteous. I was in and out with a very short wait time.  Facility was immaculate.", "pics": null, "resp": null, "gmap_id": "0x886286909a0c2b1d:0x4eb6c3fa4619dbcf"}
{"user_id": "116521165396725705161", "name": "Whitley Alford", "time": 1512709142820, "rating": 5.0, "text": "Friendly staff with a clean facility and welcoming atmosphere.  Great place to go if you are claustrophobic. Results back within 24 hours.", "pics": null, "resp": {"time": 1514388293781, "text": "Thank you for the review, Whitley."}, "gmap_id": "0x886286909a0c2b1d:0x4eb6c3fa4619dbcf"}
{"user_id": "105606727293312010457", "name": "Michael Johnson", "time": 1629303919274, "rating": 5.0, "text": "I needed to have two recent exams from this office and the staff and techs could not have been more courteous or helpful.  I was seen in a timely manner for both exams and was treated with care and respect by both techs I came in contact with.", "pics": null, "resp": {"time": 1629380944328, "text": "Everyone’s time is important so we strive to help our patients get back to their day quickly while still providing exceptional care."}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "108392362009937469151", "name": "Bradley Moss", "time": 1629489825911, "rating": 5.0, "text": "I interact with this staff on a daily basis and always find each staff member going above and beyond the call of duty to exceed the customer service expectations of those served. Feedback from patients served regarding the care and services delivered by this Team is amazing.", "pics": null, "resp": null, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "117339453867694611996", "name": "Meagan Hirt", "time": 1629123467515, "rating": 5.0, "text": "I had a chance to interact with their operations manager and administrator and they are beyond delightful! Their welcoming and willing personalities certainly permeate throughout their center because everyone is awesome!", "pics": null, "resp": {"time": 1629380840370, "text": "Our team puts patients first and we’re glad our team’s dedication to providing an elevated experience is showing!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "106562259216624605234", "name": "Chelsea Pickett", "time": 1621340371129, "rating": 5.0, "text": "A+ experience. Deborah called to let me know the cost a day ahead of time and was quick with the paperwork day of. Didn't wait too long before going back to prep for the CT scan. John went above and beyond to make sure I was prepared and comfortable (even offered a warm blanket!). Overall the process took about an hour, faster than my original estimate at Huntsville Hospital.", "pics": null, "resp": {"time": 1621626022184, "text": "We know everyone likes to save and every patient deserves to know, in advance, how much their healthcare will cost. We believe in price transparency and show our affordable imaging costs on our website at  https://odcalabama.com/value-finance/"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "117812405147533893989", "name": "Tammy Mendoza", "time": 1614375722728, "rating": 5.0, "text": "My mom, 78 years old, doesn't always get around well and doesn't hear well.  She came home and asked that I do a review and let everyone know how great Jerry was with her.. Patient and kind.  Thank you for being nice to the elderly and not just getting frustrated with them.  This daughter greatly appreciates it.", "pics": null, "resp": {"time": 1614714876852, "text": "It is our privilege to provide imaging services and our team works hard to make it a good experience. When we hear we’ve done it well, it makes our day!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "114106712849861228396", "name": "Beth Allen", "time": 1620353844038, "rating": 1.0, "text": "I went to my physician the morning of my mri of my brain to get a Valium and went to my appointment at 1:00 and there were at least 7 people in the waiting room!!!! Never have seen that before!!! I accidentally took my old Blue Cross card and the girl at the front was figuring my cost without Insurance(over $500.00)!!!! This has happened before and if there is a problem the offices call B/C B/S and should be handled within a couple of minutes!!! I guess her fingers were hurting because she never offered any help!!!! Even if I had the current card the Valium would would have worn off by the time I would have the MRI!!!!! Horrible experience especially driving 30 minutes to get there!!!!!!!!", "pics": null, "resp": {"time": 1620412441187, "text": "There’s nothing we value more than feedback – even if it tells us we didn’t meet expectations. That’s how we know where to focus our efforts. Our Administrator, Brad, can be reached at 256-534-5600 to discuss any patients’ specific concerns."}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "104093130989591707527", "name": "Robert Dixon", "time": 1616625643691, "rating": 5.0, "text": "The Administrative Staff and Amber, my\nX RAY Technician were highly professional and provided me outstanding customer service during my visit. They were very courteous and my visit was very pleasant.", "pics": null, "resp": {"time": 1617199285007, "text": "Our team puts patients first and we’re glad our team’s dedication to providing an elevated experience is showing!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "117685975875496988496", "name": "Benjamin Schwartz", "time": 1604689199707, "rating": 5.0, "text": "Scheduling was very easy, they let me know prior to my appointment how much it would cost, the wait time was short, and the staff was very friendly. My tech, John, kept my informed the entire time and made sure I was comfortable.", "pics": null, "resp": {"time": 1614714944726, "text": "We always love to hear positive feedback. Providing an elevated experience for every patient who chooses us is the goal of each of our team members."}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "109551950413791403300", "name": "Joe Suede", "time": 1556201367691, "rating": 5.0, "text": "Ms. Laura was fast and fantastic. I did not wait long at all and Ms. Laura ensured that we got the proper picture that she knew my specific doctor wanted to see. Highly recommend and will be back next time I need a x-ray.", "pics": null, "resp": {"time": 1557418756119, "text": "Thank you, Joe!! We really appreciate your positive feedback! Have an awesome day!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "114986822846832037109", "name": "Dianne Holder", "time": 1559009470941, "rating": 5.0, "text": "I had a CT Scan on 5-24-19 John was my Technologist he did a amazing job. The patient Care Coordinator was Cawanna , Excellent! You have a wonderful staff.", "pics": null, "resp": {"time": 1559073459340, "text": "Dianne, thank you for your kind words! We appreciate you!!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "110624729509294808672", "name": "N B", "time": 1541713226542, "rating": 1.0, "text": "Went for an ultrasound to diagnose a time sensitive condition.  Was told that the results would immediately be sent in for review and I would get a call from the doctor.  The next day, still no call.  After talking with three people, it was discovered that they never bothered to send the results in for review.  Staff friendly enough but that amounts to nothing when you cannot be bothered to do your job.", "pics": null, "resp": null, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "100513396439572917461", "name": "Janet Jones", "time": 1576885675590, "rating": 5.0, "text": "My daughter went in for a test and everyone was very friendly and professional and the appointment went quickly!", "pics": null, "resp": {"time": 1577379200250, "text": "Thanks so much for the kind review!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "113255707023435743415", "name": "Jaime 0212", "time": 1570558834508, "rating": 5.0, "text": "Amazing experience having my mammogram done by Amanda at the Hughes location.  I will never go back to the Breast Center.", "pics": null, "resp": {"time": 1571956602186, "text": "Thank you, Jamie!!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "114025028233521867557", "name": "Neil Young", "time": 1536782368783, "rating": 4.0, "text": "Went for an ultrasound and the staff was very nice and helpful.  The lady at the desk was nice and the lady that did the ultrasound was extremely nice as well. They got me in and out fast.", "pics": null, "resp": {"time": 1537369066718, "text": "Neil, thank you for taking time to give us your feedback. We appreciate you!!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "111527781428769942211", "name": "NoK Wolf", "time": 1544140823651, "rating": 4.0, "text": "They are good to call you and let you know stuff  but I'm tying confirm an appt based on their last call by calling them and I've been on 'hold' for 28 minutes,and been on hold 35 minutes earlier this morning before I gave up. They need more admin staff.\nEdit. After I arrived it was a very quick process, less than 1hr from start to finish.", "pics": null, "resp": {"time": 1544213473261, "text": "We appreciate your honest feedback. Thank you for taking the time to let us know how we can serve you better. Have a great weekend!"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "108152041962050645342", "name": "Jayla Carter", "time": 1549904734704, "rating": 1.0, "text": "I called in and asked for about an appointment since I never received a call to get scheduled. I was told I didn’t need an appointment and to just walk in. I get there and watch 3 ppl go in before me. Got the excuse that ppl with appointments go before me. This is ridiculous and unfair. Others were called and scheduled, I have to wait and I’m having to suffer because I was apparently given the wrong information. My time isn’t valuable at all to them and I will be letting my doctor know that I never want to use them again.", "pics": null, "resp": null, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "103935452150546892825", "name": "Justice Writer", "time": 1493431949057, "rating": 1.0, "text": "Terrible service.  We will never, ever go back.  The front desk of any office is the most important part of an office as far as clients are concerned.  Unfortunately, however, Brook, the front desk employee was hostile, rude, nasty and just plain a  bad liar. Laura too was unhelpful initially; but not to the full extent of Brook who is a poser, a fraudster and unprofessional. Brook’s sour attitude will likely be the reason why many clients, like us, will go elsewhere. What a shame.", "pics": null, "resp": null, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "112316758943218986325", "name": "cloud s", "time": 1562621250472, "rating": 1.0, "text": "2 weeks and they still haven't sent the lab work. Terrible place.", "pics": null, "resp": {"time": 1562697705528, "text": "We appreciate the opportunity to resolve concerns and learn about ways we can improve our services and communication. We are sending your feedback to our Center Administrator. If you would like to speak to him as well, please call: 256-534-5600. Thank you"}, "gmap_id": "0x886265f5723aa417:0xeda7f79750d229ac"}
{"user_id": "101468183209791880247", "name": "Linda Williams", "time": 1626450130526, "rating": 5.0, "text": "Wonderful experience.  No wait, friendly and professional service.  A refreshing experience after a few years with another center that ran me through like a cow.", "pics": null, "resp": {"time": 1626455252333, "text": "We always love to hear positive feedback. Providing an elevated experience for every patient who chooses us is the goal of each of our team members."}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "114922454331811465456", "name": "casey smith", "time": 1624998178826, "rating": 5.0, "text": "I have small veins so it is hard for anyone to get a line on me. I had actually just left a doctors office who had blown a vein before this appointment so it was harder on the tech. Christine and Chelsie did a wonderful job of getting a vein when there was limited options. She definitely took the time and care to make sure it was correct before proceeding with the Ct Scan", "pics": null, "resp": {"time": 1625176953131, "text": "It is our privilege to provide imaging services and our team works hard to make it a good experience. When we hear we’ve done it well, it makes our day!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "103179057775456857755", "name": "Kimberly Daniels", "time": 1618072685390, "rating": 5.0, "text": "this has got to be one of the most pleasant experiences I’ve ever had in a clinic where nobody knew me yet I was treated with respect and care as though they had known me for years! It was very refreshing to see the steps that were being taken for the Covid pandemic time. They made sure to make sure that I felt safe and that I was comfortable. That was the best part!", "pics": null, "resp": {"time": 1618331314949, "text": "The safety of our team and our patients is our highest priority. We have implemented processes to ensure enhanced sanitation and proper distancing while still maintaining exceptional compassionate care. https://odcalabama.com/about/images-and-results/"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "116114845123591766119", "name": "Kasper Sen", "time": 1615255964574, "rating": 1.0, "text": "I was billed an extra fee 3 months after paying up front in cash for the X-ray I needed. They are predatory and greedy trying to scam people and lying that they owe them money months after fully paying for their services. I won't ever be back.", "pics": null, "resp": {"time": 1615403572575, "text": "There’s nothing we value more than feedback – even if it tells us we didn’t meet expectations. That’s how we know where to focus our efforts. Our Administrator, Brad, can be reached at 256-534-5600 to discuss any patients’ specific concerns."}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "100089177153976223334", "name": "Maeve O'brian", "time": 1592764723307, "rating": 5.0, "text": "Last Friday was my second visit.  Elizabeth was the first person I interacted with and that was very pleasant.  I filled out all the forms and waited for my tech Lauren. It all was a good testing experience.  I didn't have to endure all that stretching and smashing anymore.  Also had the bone density test and that was painless too.  Will go back.", "pics": null, "resp": {"time": 1594845460770, "text": "Thank you for the review!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "116174305860905928218", "name": "Eula Evans", "time": 1610821545618, "rating": 5.0, "text": "Thank you for the service,it was great Deana and LaDanya were great.\n\nThank you, ms.evans", "pics": null, "resp": {"time": 1611063813664, "text": "Our team puts patients first and we’re glad our team’s dedication to providing an elevated experience is showing!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "111689151111505715764", "name": "Kelly Firestine", "time": 1579809437145, "rating": 5.0, "text": "I needed to have a mammogram and screening breast ultrasound because I have been told I have dense breasts.  They scheduled me right away.  I spent hardly any time at check in.  I was taken back for my exam so quickly I barely had time to sip the nice cup of coffee I got in the lobby.  The women's are is so private and cozy.  It is nice to have a separate, private area from the rest of the center.  I felt so relaxed for they entire visit.  Stacy did such a great job on the mammogram and Jordan did an excellent job on my US.  I got a letter with the results with 2 days!  Wow!  I will always return here for not only my mammograms but also if I ever need an MRI, x-ray, CT, etc for me or my whole family.  Nice change of pace in the medical world to have such great professional service!", "pics": null, "resp": {"time": 1579902368555, "text": "Kelly, Thank you so much for your kind words! We appreciate you taking time to give us your valuable feedback. Have a great weekend!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "101077220794400645130", "name": "D.Ann's Designs", "time": 1592685425403, "rating": 5.0, "text": "Newly remodeled center with care taken understanding Covid-19.  Fantastic staff, easy check in and Ladonya, my technologist is one of the best. It is a great place I would highly suggest to anyone. Brad Moss, the Administrator obviously cares about this center. Thank you", "pics": null, "resp": {"time": 1594845381166, "text": "We always love to hear positive feedback. Providing an elevated experience for every patient who chooses us is the goal of each of our team members."}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "103630314480407628730", "name": "Drew Rochelle", "time": 1574369426168, "rating": 5.0, "text": "The staff was professional as well as warm and friendly. I was very impressed with the staff and facility. They made an anxiety filled test a pleasant experience. If there was a six star rating I would have given that.", "pics": null, "resp": {"time": 1575310665766, "text": "We just wanted to thank you for the excellent review. Your kind words go a long way and will be shared with our staff. Have a fantastic week!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "115313267090571187858", "name": "Carol Drake", "time": 1617302058079, "rating": 5.0, "text": "Excellent tech, Anita!!", "pics": null, "resp": {"time": 1617386360822, "text": "Our team puts patients first and we’re glad our team’s dedication to providing an elevated experience is showing!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "100526156631664704104", "name": "Gene Welborn", "time": 1566328130599, "rating": 2.0, "text": "The technician was awesome!  She was polite and professional.  But I never got a report.  I called two weeks after my test and was told that reports \"typically\" go out within 4-5 business days.  I was told the only way I could get my report would be to drive 40-45 minutes one way back to the facility to pick it up.  After negotiating a bit, I got them to just mail me another one. I still have not received it.  A bit frustrating to go through the procedure and not be able to get my own results.", "pics": null, "resp": {"time": 1566423257124, "text": "We appreciate your feedback and the opportunity to improve our services. To ensure the privacy of our patients, our policy prevents us from responding to this matter in a public forum. Your comments are important to us and have been sent to our Center Administrator. We welcome further dialog. Please call 256-534-5600 to speak with someone in person. Thank you!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "117134850288144384472", "name": "Angie Alonso", "time": 1591196712093, "rating": 5.0, "text": "Very friendly and quick. Liked the atmosphere", "pics": null, "resp": null, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "107079917667617868336", "name": "Ron Burgundy", "time": 1530287463292, "rating": 5.0, "text": "As I was walking in a little early, they called my cell to confirm everything is ready and they're ready for me.  The MRI took just a couple days to setup and the results were almost instant. Easy, quick, painless imaging. Staff is super friendly and proficient.\n\nI can now walk without a cane or pain before 30!", "pics": null, "resp": {"time": 1530902820605, "text": "Thank you for your kind words and valuable feedback!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "112339104436206121690", "name": "Brian Bradley", "time": 1550800407353, "rating": 5.0, "text": "Had a Thursday apptmt at 12:45 and showed up on time. The Patient Care Coordinator at the desk was very pleasant and efficient taking my ID and insurance card, gave me a form to complete and withing five minutes of arriving was sent upstairs to wait for my diagnostic test. Filled out another one page form and again within 5 minutes the Technologist came and led me back to the room for the bone density test. She explained the procedure, answered my questions and was just super. Test was over in 10-15 minutes and she even walked with me back downstairs, said thanks for coming and wished me well. Excellent experience from my standpoint!", "pics": null, "resp": {"time": 1550853918824, "text": "Brian, Thank you so much for your positive feedback and 5-star review!  We appreciate you!!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "110190701805871028267", "name": "Michael Kelsey", "time": 1579029836644, "rating": 2.0, "text": "The check in staff was great, very friendly, professional and courteous. The technician(s) I had dealings with in back could use a refresher on how to deal with patients", "pics": null, "resp": {"time": 1579902811388, "text": "Michael,  We appreciate your feedback and the opportunity to improve our services. Your comments are important to us and have been sent to our center Administrator. If you would like to dialog further, please call 256-534-5600 to speak with someone in person. Have a great weekend!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "112741849417273987076", "name": "wanda Rhodes", "time": 1537821067043, "rating": 4.0, "text": "This was my first visit and i truly enjoyed the experience .Tia and Anita very friendly and very profoundly proficient at their job. The facility very clean and the atmosphete comfortable. Thanks Anita for making my bone scan comfortable for me.", "pics": null, "resp": {"time": 1537992530917, "text": "Thank you for your great review! We appreciate the time you took to give us your valuable feedback!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "101995665309129062728", "name": "Michelle Dixon", "time": 1465970089978, "rating": 5.0, "text": "Got there early and even though my appointment was awhile away, they still called me back fairly quickly. My x-ray tech was nice and respectful of my concerns and helped the process go by smoothly. Great people and great place!", "pics": null, "resp": null, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "101631688475996423872", "name": "Patty Bradford", "time": 1563235604118, "rating": 5.0, "text": "I have my mammograms done yearly at Outpatient Diagnostic Center. I am very pleased with my experience at ODC. Deana and Anita are very professional and courteous. I recommend my friends to ODC.", "pics": null, "resp": {"time": 1563296973658, "text": "Patty, Thank you for your kind words! We appreciate you!!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "104922496992841994262", "name": "Cathy Stevens", "time": 1575044274971, "rating": 5.0, "text": "This facility has been remodeled, and all testings are on one floor downstairs. Easy check in and all of the staff associates were friendly and professional.", "pics": null, "resp": {"time": 1575310229148, "text": "Cathy, Thank you for taking time to give us your feedback. We appreciate it! Have a great week."}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "111052244386056933598", "name": "Cheri Harr", "time": 1507748777724, "rating": 5.0, "text": "Wait time was good. My total visit was 45 minutes to get checked in, take images on 3 different locations of my body, then get images burned to a disc. Great customer service!", "pics": null, "resp": null, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "111921218530541996712", "name": "Adam Ray", "time": 1578335022779, "rating": 5.0, "text": "Friendly staff in a clean and newly remodeled facility.", "pics": null, "resp": null, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "117271675261091389136", "name": "Briana Wright", "time": 1541010737021, "rating": 1.0, "text": "Forget ever getting anyone on the phone or getting your results in a timely fashion. Frequently you'll be on hold for 10 minutes or more before the line just hangs up, and you basically have to come physically retrieve your results because they won't answer for your doctor's office either.", "pics": null, "resp": {"time": 1541084886830, "text": "Briana,  We appreciate the opportunity to resolve concerns and learn about ways we can improve our services and communication. We are sending your feedback to our Center Administrator. If you would like to speak with him as well, please call 256-532--2418. Thank you"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "117092143927874055192", "name": "Kristie Wetzel", "time": 1537825255603, "rating": 5.0, "text": "I've used Outpatient Diagnostics 4 times this year and just scheduled an appointment for an MRI (already had 2 xrays, a 3D mammogram, and 2 ultrasounds.  I HIGHLY recommend them.  From the office staff, imaging personal, wait time, swift results, and billing practices.  I have been incredibly pleased and will recommend them and continue to request them.", "pics": null, "resp": {"time": 1537992444999, "text": "Kristie, Thank you for your kind words! Your recommendation is our highest compliment. We appreciate you!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "115092293434191897005", "name": "NPC J", "time": 1498857825840, "rating": 1.0, "text": "Didn't have a wait that day payed my copay.  Turned around said I didn't pay and sent it to a collection agency.  All my other doctors have worked with me as I am fully disabled Vet and fighting for benefits with SSI.  What complete lack of care.  $32 dollars for collections. 1 phone call from them but already 3 or 4 from collections out of Texas. Still haven't gotten the results on my scans.", "pics": null, "resp": null, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "113444811636064714487", "name": "Beth Wood", "time": 1474313021973, "rating": 2.0, "text": "Although the staff here is phenomenal, the wait time is ridiculous.  My family doctor sent me here for x-rays .... I asked several times if I needed to make an appointment, but was assured x-ray need no appointment and I would be in and out fast.  This was Friday.  I came by and the person in front of me had extensive tests and it would be at least 2 hours before they got to me.  Understandable - said I would be back on my lunch break on Monday.  Again, was assured - this time by the check-in desk clerk - that daytimes were typically not busy and I probably would be in and out fast.  I have been here an hour and a half, after being told as I came in the wait would be about 15 minutes.  They do great work here, but I am very frustrated and unhappy with the wait time ...", "pics": null, "resp": null, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "101636786177103320956", "name": "asha lamy", "time": 1528722704369, "rating": 1.0, "text": "They left me standing in waiting room ( can't sit due to possible hip fracture) for 45 mins past scheduled appointment.  Tears streaming down my face from excruiating pain... I inquire: their tech no called no showed. Instead of telling me from onset so I could make a knowledgable decision they hid the fact as intensity of pain increased by the second. They had no care nor concern for patient trying ro stay upright in tears with extreme pain except to make a buck!  Now I lay here in my car in parking lot for the last 20 minutes waiting for pain to decrease so I can get home.  This place should be shut down by the state.", "pics": null, "resp": {"time": 1528737414050, "text": "We appreciate the opportunity to resolve concerns and learn about ways we can improve our services and communication. We are sending your comments to our Center Administrator. If you would like to speak with him as well, please call 256-534-5600. Thank you."}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "114349373647520835479", "name": "John Lary", "time": 1430175559811, "rating": 3.0, "text": "ODC Huntsville web page used to work perfectly and I could easily get my reports online. It appears that ODC has changed its web provider because their web page now works only sporadically. It is now a common occurrence that I cannot get my reports online while I am at the hospital. Quality of their reports is excellent, as usual, but I often CAN'T GET MY REPORTS ONLINE which creates a real problem for me.", "pics": null, "resp": null, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "100894051940458160874", "name": "Grace Taylor", "time": 1465853153191, "rating": 1.0, "text": "Yeah i was severely dussapointed in the treatment of the patients here. My mom has severe claustrophobia and they refused to et her have any antianxiety medication priory to MRI, nor would they letme sit with her while she had it done. In fact they forgot we were here and we had to wait an hour to even begin. Quite frankly I much prefer the BioImaging center as I waited a quarter of the time and was allowed company while i had the MRI done. Not to mention how much more polite the technicians were.", "pics": null, "resp": null, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "118157532268644402662", "name": "Stella Mitchell", "time": 1546267095073, "rating": 4.0, "text": "Staff are friendly and helpful.", "pics": null, "resp": {"time": 1546268052800, "text": "Hi Stella,\nThank you for your kind words and valuable feedback! Happy New Year!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "117036832357933335258", "name": "Jason S", "time": 1518797900163, "rating": 1.0, "text": "Got lost in the shuffle after I checked in so wasn’t given contrast on time for my scheduled scan.  Then they delayed the actual scan due to “insurance authorization” for a scan that was scheduled 3 days in advance.  They asked that I plan 2 hrs for the scan and I’m approaching 3 without being scanned.  (The actual scan takes less than 5 minutes)", "pics": null, "resp": {"time": 1519056885304, "text": "Jason, We appreciate the opportunity to resolve concerns and learn about ways to improve our services and communication. We are are sending your comments to our center Administrator, Chuck Miles. If you would like to speak with him as well, please call 256-534-5600. Thank you!"}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "109386384938170732485", "name": "Jerod Whisenant", "time": 1488898988986, "rating": 2.0, "text": "People are friendly but the wait time is outragous. I am sitting in the wait room now and have been here for 1hr and 15minutes and still haven't been called back.", "pics": null, "resp": {"time": 1488909613492, "text": "We know your time is valuable so we are so sorry that you waited longer than you should have in our center. We’ve identified the issue that led to your wait and we’ve resolved it so we appreciate you alerting us to the situation. We hope you’ll accept our apology for getting your day off to a slow start."}, "gmap_id": "0x88626cab340eccb5:0x71c598bab418719a"}
{"user_id": "102841137785292148580", "name": "Leah Kirkemier", "time": 1614282802078, "rating": 5.0, "text": "I only send my patients to see Rob at this location.  Brandi and all staff have always been wonderful and very thorough.  The radiologist, Dr. Wagoner, is very personable and always right on target.  I sincerely trust everyone in this office.", "pics": null, "resp": null, "gmap_id": "0x888925dc70c820c1:0xe000a263f14330af"}
{"user_id": "104395015629272514781", "name": "Dana Molan", "time": 1501100469981, "rating": 5.0, "text": "FRIENDLY PERSONAL.GOOD TECHNICIAN WITH CHILDREN.  WORKED US IN DUE TO SPECIAL ISSUES.", "pics": null, "resp": null, "gmap_id": "0x888925dc70c820c1:0xe000a263f14330af"}
{"user_id": "108075626366346896864", "name": "Kat Morgan", "time": 1622811304173, "rating": 1.0, "text": "Worst office employees I've ever been unfortunate enough to deal with. The actual radiologists are great - but I've never seen more incompetent \"secretaries\". They keep a huge box of referrals and faxes just thrown everywhere and lost my referral repeatedly. My family had to call the doctor's office over and over to fax because every time they got it, the idiots in front would lose it with us standing right there. The only thing those morons could find were their snacks.", "pics": null, "resp": {"time": 1623074265612, "text": "We are sorry to hear this and truly value your feedback. The patient experience is important to us at American Health Imaging and we take your feedback seriously. I've shared your feedback with our team and they will investigate this matter."}, "gmap_id": "0x88891985d954e509:0xeb940f7ae2ba20ee"}
{"user_id": "117462299721082732029", "name": "JoAnn Ulmer", "time": 1615647472160, "rating": 5.0, "text": "Very professional, understanding and will use American Health Imaging for future MRI's. Having several issues on my back is hard to lay flat for any amount of time. It was just on one part, there are 4. The Dr will order more than 1 section but it takes a long time. So he decided I needed one section at a time. Worse first. I had ask to get 2 sections but I'm so glad he didn't.  Great place if you want professional, understanding and sympathetic\ntreatment.", "pics": null, "resp": {"time": 1615821989221, "text": "Hi JoAnn- Thank you so much for taking the time to share these thoughts. Our staff will pass along the kind words!"}, "gmap_id": "0x88891985d954e509:0xeb940f7ae2ba20ee"}
{"user_id": "103017059977426964356", "name": "Randy W. Harris", "time": 1615388488264, "rating": 5.0, "text": "I don’t know anyone who likes getting an MRI. The coffin-like experience can be overwhelming for many people including my wife. But the staff was wonderfully warm and kind. They obviously enjoy their work and it shows. This was a pleasant experience and I highly recommend AHI. Thanks to everyone!", "pics": null, "resp": {"time": 1615406933101, "text": "Hi Randy- Thank you so much for taking the time to share these thoughts. Our staff will pass along the kind words!"}, "gmap_id": "0x88891985d954e509:0xeb940f7ae2ba20ee"}
{"user_id": "113963710819926574105", "name": "Mandy Muffley", "time": 1608325824637, "rating": 5.0, "text": "Friendly, clean, and a wonderful place to get an MRI. I have panic attacks with MRI'S and the staff was so nice and friendly and really made me feel relaxed. I couldn't of made it without them. Highly recommend!!!", "pics": null, "resp": {"time": 1608750272645, "text": "Hi Mandy- Thank you so much for taking the time to share these thoughts. Our staff will pass along the kind words!"}, "gmap_id": "0x88891985d954e509:0xeb940f7ae2ba20ee"}
{"user_id": "116283861134517064066", "name": "Gwendolyn Gilmore", "time": 1611078795191, "rating": 5.0, "text": "It was great. Everyone was very nice. I think they are fantastic.", "pics": null, "resp": {"time": 1611256722598, "text": "Hi Gwendolyn- Thank you for the positive feedback.  We appreciate the kind words."}, "gmap_id": "0x88891985d954e509:0xeb940f7ae2ba20ee"}
{"user_id": "111637401145316566576", "name": "Trinton Warren", "time": 1612296893799, "rating": 5.0, "text": "It was a great place to have any exam done . From the front to the back,everyone was friendly, and curteous.Will certainly b back as my Dr.deams necessary. P.S.give everyone a Raise. B safe", "pics": null, "resp": {"time": 1612464905031, "text": "Hi Trinton- Thank you so much for taking the time to share these thoughts. Our staff will pass along the kind words!"}, "gmap_id": "0x88891985d954e509:0xeb940f7ae2ba20ee"}
{"user_id": "102350273590077509165", "name": "Brooke Bruner", "time": 1602526248259, "rating": 5.0, "text": "Wonderful service.  Very clean, staff is very nice and professional.  Great location!  Will definitely use again!", "pics": null, "resp": {"time": 1602527765638, "text": "Hi Brooke, Thanks for taking time to tell us about your experience!"}, "gmap_id": "0x88891985d954e509:0xeb940f7ae2ba20ee"}
{"user_id": "107131093427703688769", "name": "Shae Thomas", "time": 1615305395191, "rating": 5.0, "text": "I had a great experience! Very friendly staff and clean office!", "pics": null, "resp": {"time": 1615408866041, "text": "Hi Shae- Thank you for the positive feedback.  We appreciate the kind words."}, "gmap_id": "0x88891985d954e509:0xeb940f7ae2ba20ee"}
{"user_id": "116885323505901518215", "name": "Jacquetta Miller", "time": 1582922965596, "rating": 5.0, "text": "Very friendly staff, smells good and pleasing environment. Great waiting areas and very clean.", "pics": null, "resp": null, "gmap_id": "0x88891985d954e509:0xeb940f7ae2ba20ee"}
{"user_id": "104716428991406095634", "name": "clarence tentman", "time": 1592498400790, "rating": 5.0, "text": "Great staff very courteous and also very clean..", "pics": null, "resp": {"time": 1592502536961, "text": "Hi Clarence, we’re so glad you had a positive experience with ImageSouth. Thank you for taking time to let us know how you feel!"}, "gmap_id": "0x88891985d954e509:0xeb940f7ae2ba20ee"}
{"user_id": "101001026547348355109", "name": "Jillian Jordan", "time": 1611159955172, "rating": 5.0, "text": "Overall just wonderful", "pics": null, "resp": {"time": 1611256441227, "text": "Hi Jillian- Thank you for the positive feedback.  We appreciate the kind words."}, "gmap_id": "0x88891985d954e509:0xeb940f7ae2ba20ee"}
{"user_id": "115427943313760544820", "name": "Mary Martin McGill", "time": 1521309203633, "rating": 1.0, "text": "Waited an hour for my MRI. Couldn’t even speak to a receptionist to ask what was taking so long or how much longer it would be as she disappeared after I got there. Waited at least 20 min for her to return to tell someone I was leaving before I left. Never came back. Tried to call after leaving to tell someone I left but of course no answer. Absolutely unacceptable. Surely there’s a more professional/efficient place to get an MRI in Birmingham. Update: tech called back saying he called my name and I wasn’t there (duh) and asked if I wanted to get my scan done.... yes I did an hour and forty-five minutes ago but not anymore. Thanks.", "pics": null, "resp": null, "gmap_id": "0x88891985d954e509:0xeb940f7ae2ba20ee"}
{"user_id": "106824879739340215089", "name": "reginald.jackson.rj@gmail.com cortez2000", "time": 1550484933768, "rating": 5.0, "text": "The MRI machine was able to take my imaging foot first.", "pics": null, "resp": null, "gmap_id": "0x88891985d954e509:0xeb940f7ae2ba20ee"}
{"user_id": "101883158023861864827", "name": "joe bennett", "time": 1562966939417, "rating": 1.0, "text": "called and ask if I could move my appointment up they said ok and gave me a date drove 90 miles when I got their for appointment they never new me told them I drove 90 miles pretty much told me tuff luck will never use again", "pics": null, "resp": null, "gmap_id": "0x88891985d954e509:0xeb940f7ae2ba20ee"}
{"user_id": "111470211293321608657", "name": "Nicole Cook", "time": 1462205334099, "rating": 4.0, "text": "Nice clean atmosphere an friendly receptionist.", "pics": null, "resp": null, "gmap_id": "0x88891985d954e509:0xeb940f7ae2ba20ee"}
{"user_id": "104947071482703367264", "name": "emily", "time": 1616865225959, "rating": 1.0, "text": "Be careful a nurse named Jessica Rodgers was looking for fake covid 19 vaccination cards in order to not get her vaccine. She is putting you and your loved ones at risk so just be careful!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4e1c0b6c4917:0x6800f2a10486cfca"}
{"user_id": "106631866521501921835", "name": "Daniel Anderson", "time": 1603301036511, "rating": 5.0, "text": "They are a very nice place to have your treatment done and they have the best doctor's they are very friendly there and they care about your health I highly recommend this place to everyone that is fighting cancer", "pics": null, "resp": null, "gmap_id": "0x889a4e1c0b6c4917:0x6800f2a10486cfca"}
{"user_id": "112462804369022258333", "name": "tierren blakely", "time": 1569348926256, "rating": 5.0, "text": "I had the very best experience when taking chemotherapy here. From the time you pull up at the door someone is there to greet you. Dr. Butler was my oncologist he’s so awesome. They made my experience as pleasant as possible and unforgettable in the best way! Everyone was amazing! Thank you all!", "pics": null, "resp": null, "gmap_id": "0x889a4e1c0b6c4917:0x6800f2a10486cfca"}
{"user_id": "109117123554610823628", "name": "Judy Lynn", "time": 1583183901602, "rating": 5.0, "text": "David Clarkson was the best dr my late husband could of had in my opinion", "pics": null, "resp": null, "gmap_id": "0x889a4e1c0b6c4917:0x6800f2a10486cfca"}
{"user_id": "117534353771126700443", "name": "Lillian Jones", "time": 1568821268898, "rating": 5.0, "text": "I have been going to Mitchell Cancer since 2014, they have been wonderful to me and my husband    you are in good hands when you go to Mitchell Cancer Center.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNX5ZTI6e3YXfYBqBtkJ_m0fAg5h0BJM8_tJBBC=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4e1c0b6c4917:0x6800f2a10486cfca"}
{"user_id": "107678325979178734546", "name": "Seth Novak", "time": 1575343679290, "rating": 1.0, "text": "This is the most horrible place to go doctor buttler is a lier they talk the talk but all in all they don't care about you I been suffering with pain for the past 6 years the hospitals lost my medical records and they pretty much called me a l liar sating because my medical records were lost they can't help me with my pain like I went and got all treatment for the hell of it because of this I rather die than get medical treated ever again", "pics": null, "resp": null, "gmap_id": "0x889a4e1c0b6c4917:0x6800f2a10486cfca"}
{"user_id": "109880617768767953153", "name": "Clifford Kautz", "time": 1445892141845, "rating": 5.0, "text": "The Mitchell Cancer Institute  made us feel at ease the lady vallet  gave us hugs   and even  gave me a warm blanket when we got there. They seemed like we were truly important and cared about all of our concerns. Children and Women's hospital were top notch as well. We were given hugs  and made my family feel at ease during my surgery and my 4 day stay. 100% satisfaction guaranteed!! May God bless everyone.", "pics": null, "resp": null, "gmap_id": "0x889a4e1c0b6c4917:0x6800f2a10486cfca"}
{"user_id": "108161772622788950929", "name": "Mary Boyer Bellipanni", "time": 1515287141226, "rating": 5.0, "text": "Dr. Finan no longer sees patients but he saved my life after I was diagnosed with ovarian cancer! He also was the doctor of my young friend and she was lucky enough to be able to have a baby. I came from 5 hours away and she 7 hours away just to see him! I trust him explicitely as does she! I highly recommend the doctors at Mitchell! Everyone I have ever met there has been very cordial and helpful! Please give them a call even if you suspect you have cancer! I wish I had called them FIRST and not had to have two operations!", "pics": null, "resp": null, "gmap_id": "0x889a4e1c0b6c4917:0x6800f2a10486cfca"}
{"user_id": "117175845132712646827", "name": "Eric Voivedich", "time": 1502397163091, "rating": 5.0, "text": "Just the best possible experience", "pics": null, "resp": null, "gmap_id": "0x889a4e1c0b6c4917:0x6800f2a10486cfca"}
{"user_id": "101584021615459211318", "name": "Jeremy Kervin", "time": 1489082591377, "rating": 5.0, "text": "Beautiful place and all oncologist are angels", "pics": null, "resp": null, "gmap_id": "0x889a4e1c0b6c4917:0x6800f2a10486cfca"}
{"user_id": "110647761342157897038", "name": "Linda Jaynes", "time": 1509473327257, "rating": 5.0, "text": "(Translated by Google) I couldn't ask how to better cancer issue you do care Of me. Thank you Dr. Ove and yor nurse Michelle\n\n(Original)\nI couldnt hace ask forma a better cáncer tema ti hace talen Care Of me.  Thank you Dr.  Ove and yor nurse Michelle", "pics": null, "resp": null, "gmap_id": "0x889a4e1c0b6c4917:0x6800f2a10486cfca"}
{"user_id": "114478153646561152764", "name": "Logan Risner", "time": 1621598554173, "rating": 5.0, "text": "This was my very first MRI. The nice lady let me jam out to my choice of alternative music as I faded away to the subtle, alarming sounds of the magnetic field forcing my protons to align with it. Beautiful experience. Even got a peaceful slumber in. 10/10. Would definitely recommend. Hopefully, I’ll get another one for Christmas. Fingers crossed. 🤞🏿", "pics": null, "resp": {"time": 1621881428094, "text": "Thank you so much for taking the time to share these thoughts. Our staff will pass along the kind words!"}, "gmap_id": "0x8889191d0083e33f:0x1eba302c620bfea7"}
{"user_id": "110931015512568930621", "name": "Robby Teer (Rob)", "time": 1615644904657, "rating": 5.0, "text": "New owners, wonderful appointment scheduling & communication, extremely accomodating, and just NICE! Best MRI I've had outta the 452 times PREVIOUSLY!!", "pics": null, "resp": {"time": 1615822055787, "text": "Hi Robby -Thank you so much for taking the time to share these thoughts. Our staff will pass along the kind words!"}, "gmap_id": "0x8889191d0083e33f:0x1eba302c620bfea7"}
{"user_id": "103759659982935631402", "name": "Lori Dold", "time": 1617983349195, "rating": 5.0, "text": "Very kind and helpful- very clean- in and out in a flash!", "pics": null, "resp": {"time": 1619119124567, "text": "Thank you for the positive feedback.  We appreciate the kind words."}, "gmap_id": "0x8889191d0083e33f:0x1eba302c620bfea7"}
{"user_id": "110075922311451999121", "name": "Niconico nii", "time": 1622602774973, "rating": 1.0, "text": "Tried calling to set up a payment plan for a bill. Told employee I don’t have good service and asked if I could set it up over the phone.\n\nPerson proceeded to tell me to go online AFTER I told her that. 😤\nShe didn’t want to help me AT ALL.\n\nAll she wanted was a payment but didn’t want to do the extra leg work to actually help me.\nShe told me it would be $25.00 today and I could call back to pay again.\n\nWhen I tried to get her to do said payment plan, she really wasn’t trying to do anything with me. It seemed like she was confused and wanted the full balance to stay how it was.\n\nNever ever calling to set up another payment plan with them EVER again.", "pics": null, "resp": null, "gmap_id": "0x8888a80083156345:0x7f45affaafeb864f"}
{"user_id": "106699249189914046930", "name": "Cassie Thompson", "time": 1605715788926, "rating": 5.0, "text": "Several months ago I had to go for my yearly mammogram and the receptionist Hannah was a true divine. She was so kind and so caring. Her personality was amazing. Today 11/18/20 I had to go to get an ultrasound for DVT and my technician was Kylie and she was just amazing. She was very caring and encouraging. Thank you Radiology Clinic for two amazing employees.", "pics": null, "resp": null, "gmap_id": "0x8888a80083156345:0x7f45affaafeb864f"}
{"user_id": "114631145049184938732", "name": "eleanor blackburn", "time": 1617138955863, "rating": 1.0, "text": "I had an MRI appointment on Wed, March 24th at 9:30. When I came to check in, the receptionist was very rude saying, \"you're late\" and that the appt was at 9:00. I told her that I'm not late & that my appt was for 9:30. She had a very nasty attitude & kept telling me that it was at 9:00 & that I should reschedule for another day. I decided to wait because I wasn't going to reschedule when I wasn't late in the first place. An hour or so goes by, patients AFTER me  are being seen. Finally, someone comes and brings me to the back, I sat in a hallway a little while, the lady (I don't remember her name) was very nice to me and told me as soon as there was an available room, that I would be seen. She was told that I was late and that's why I was waiting for so long. I showed her my appointment paper, and in fact it said 9:30. She apologized. That rude receptionist never apologized.", "pics": null, "resp": null, "gmap_id": "0x8888a80083156345:0x7f45affaafeb864f"}
{"user_id": "103276109737115274230", "name": "PATRICIA BARR", "time": 1599765677318, "rating": 5.0, "text": "Everyone was very friendly and professional. The doctor performing my test was really nice and I felt safe in his hands. I had a gall bladder test which required an IV for a radioactive fluid. It took an hour and a half (it could take a much as 4 hours) and I slept through it. Didn't have to wait long got my appointment either. I've had other appointments there and had the same courteous treatment.", "pics": null, "resp": null, "gmap_id": "0x8888a80083156345:0x7f45affaafeb864f"}
{"user_id": "115364027387770278413", "name": "Shelley Wood", "time": 1603133824554, "rating": 5.0, "text": "Crystal in Medical Records is very polite and has the best customer service skills.   She went above and beyond to help.  I highly recommend The Radiology Clinic!", "pics": null, "resp": null, "gmap_id": "0x8888a80083156345:0x7f45affaafeb864f"}
{"user_id": "102929488959397966439", "name": "Lisa Savage", "time": 1598016096842, "rating": 5.0, "text": "I came for my first mammogram and was very anxious. Heather was awesome! She explained exactly how everything was going to go, and helped calm my nerves. It was not bad at all. We need more people like Heather in the world!! 😊", "pics": null, "resp": null, "gmap_id": "0x8888a80083156345:0x7f45affaafeb864f"}
{"user_id": "105857631309264071207", "name": "Theresa Johnson (Terri)", "time": 1618190946812, "rating": 5.0, "text": "Great people..", "pics": null, "resp": null, "gmap_id": "0x8888a80083156345:0x7f45affaafeb864f"}
{"user_id": "101224051979977044157", "name": "Natalie Strother", "time": 1594298883669, "rating": 1.0, "text": "Husband waited over a hour to get a X-RAY and when was asked what took so long the receptionists was very sarcastic. Never had this problem before!!!!", "pics": null, "resp": null, "gmap_id": "0x8888a80083156345:0x7f45affaafeb864f"}
{"user_id": "104115210583405993515", "name": "Jeff Colvin", "time": 1568243509046, "rating": 5.0, "text": "I was in and out in no time at all. Staff was friendly and welcoming.", "pics": null, "resp": null, "gmap_id": "0x8888a80083156345:0x7f45affaafeb864f"}
{"user_id": "104359177568285779829", "name": "Bridget Riley", "time": 1506525889160, "rating": 5.0, "text": "\"Everyone was very friendly, polite and professional. Everything was clearly explained and I felt reassured. The environment was very clean and presentable as well. I would recommend The Radiology Clinic.\"", "pics": null, "resp": null, "gmap_id": "0x8888a80083156345:0x7f45affaafeb864f"}
{"user_id": "110627446785398837441", "name": "Dan Birnstein", "time": 1603207633256, "rating": 5.0, "text": "They got me in, late afternoon with no appointment.\n(I was half an hour before closing time).\nWhen my X-ray were completed, they called my physician right away, again, around closing time!\nI wish everybody would be as courteous and professional!", "pics": null, "resp": null, "gmap_id": "0x8888a80083156345:0x7f45affaafeb864f"}
{"user_id": "114044683374805369374", "name": "Kat A", "time": 1562069310322, "rating": 5.0, "text": "I rarely give 5 but the staff was frkendly, clean, aost no wait.", "pics": null, "resp": null, "gmap_id": "0x8888a80083156345:0x7f45affaafeb864f"}
{"user_id": "108231960463446119234", "name": "Jeff Singer", "time": 1495639388507, "rating": 5.0, "text": "Excellent.  Friendly and efficient staff.  In and out very quickly.", "pics": null, "resp": null, "gmap_id": "0x8888a80083156345:0x7f45affaafeb864f"}
{"user_id": "102366114226571860283", "name": "Voodoo Actual", "time": 1498513515136, "rating": 5.0, "text": "Great staff! They are both caring and efficient.", "pics": null, "resp": null, "gmap_id": "0x8888a80083156345:0x7f45affaafeb864f"}
{"user_id": "117472264846449790586", "name": "Ella Hood", "time": 1493585869781, "rating": 5.0, "text": "It runs like a machine. Perfect in every way", "pics": null, "resp": null, "gmap_id": "0x8888a80083156345:0x7f45affaafeb864f"}
{"user_id": "116385531531207291766", "name": "Michael Clark", "time": 1524246261212, "rating": 5.0, "text": "Very nice and professional.", "pics": null, "resp": null, "gmap_id": "0x8888a80083156345:0x7f45affaafeb864f"}
{"user_id": "102824137340199403539", "name": "brett davis", "time": 1620140301862, "rating": 5.0, "text": "Quick, very knowledgeable and helpful ... especially when your days not so good...5 stars ...I've used these nice folks for many many years.... Nothing but the best service that can be provided...thank you AHI ✌️", "pics": null, "resp": {"time": 1620934583853, "text": "Thank you for the positive feedback.  We appreciate the kind words."}, "gmap_id": "0x88891674b37b8dc9:0xe880f3bf1ccf1271"}
{"user_id": "111453376240621237638", "name": "Cheryl Braz", "time": 1614979417482, "rating": 5.0, "text": "Awesome folks here. Get right  to the point and get the picture abd wi ll help you vack if need be.  Cheryl braz", "pics": null, "resp": {"time": 1615221282537, "text": "Hi Cheryl- Thank you for the positive feedback.  We appreciate the kind words."}, "gmap_id": "0x88891674b37b8dc9:0xe880f3bf1ccf1271"}
{"user_id": "116090659640137550571", "name": "Wes Wyres", "time": 1622210186755, "rating": 5.0, "text": "Fast and friendly. 10/10", "pics": null, "resp": {"time": 1622648007436, "text": "Thank you for the positive feedback.  We appreciate the kind words."}, "gmap_id": "0x88891674b37b8dc9:0xe880f3bf1ccf1271"}
{"user_id": "105884615374151248387", "name": "MP Lane", "time": 1619356361351, "rating": 5.0, "text": "Always good experience-highly recommend!", "pics": null, "resp": {"time": 1619449009768, "text": "Thank you for the positive feedback.  We appreciate the kind words."}, "gmap_id": "0x88891674b37b8dc9:0xe880f3bf1ccf1271"}
{"user_id": "111779754660409929960", "name": "Alpha Finnie", "time": 1580500939098, "rating": 5.0, "text": "Staff was very friendly.  My appointment was at 9 am - I arrived about 10 minutes early - wait time was very short.  The technicians made sure to keep me informed throughout testing and made my first imaging experience of this type very pleasant.  I was referred to the facility but at any point if I need other imaging services I will request it to be done at this facility for my\nfamily.", "pics": null, "resp": null, "gmap_id": "0x88891674b37b8dc9:0xe880f3bf1ccf1271"}
{"user_id": "114713536744361315305", "name": "Reed Hull", "time": 1616866951155, "rating": 5.0, "text": "Excellent facility and service!", "pics": null, "resp": {"time": 1617220297505, "text": "Hi Reed- Thank you for the positive feedback.  We appreciate the kind words."}, "gmap_id": "0x88891674b37b8dc9:0xe880f3bf1ccf1271"}
{"user_id": "107526837514799302485", "name": "Jennifer Anderson", "time": 1564511956944, "rating": 1.0, "text": "Will sit forever and do not come out to get you. They told us it would be 15-20 minutes for them to get me for a simple X-ray and it has taken over an hour. I do not recommend coming here. There was absolutely no movement.", "pics": null, "resp": null, "gmap_id": "0x88891674b37b8dc9:0xe880f3bf1ccf1271"}
{"user_id": "103300538641512596142", "name": "M S", "time": 1456261136820, "rating": 5.0, "text": "Definitely one of the best imaging centers in the area. Nice and courteous staff; excellent service; spotless and clean facility. I would recommend it to anyone.", "pics": null, "resp": null, "gmap_id": "0x88891674b37b8dc9:0xe880f3bf1ccf1271"}
{"user_id": "110965092206016374030", "name": "Kaila Morales", "time": 1563392146257, "rating": 1.0, "text": "Sat here for 2 hours. They forgot about us.", "pics": null, "resp": null, "gmap_id": "0x88891674b37b8dc9:0xe880f3bf1ccf1271"}
{"user_id": "107934391421854615185", "name": "Jodi", "time": 1385386177509, "rating": 5.0, "text": "Very pleasant from the time they called me to make my appointment to when I walked in.  I was taken back on time, technician was friendly and explained all that was happening.  I would go back there again if needed.", "pics": null, "resp": null, "gmap_id": "0x88891674b37b8dc9:0xe880f3bf1ccf1271"}
{"user_id": "114998534423829013407", "name": "Eddie Self", "time": 1493137244664, "rating": 5.0, "text": "Great folks I'm changing doctors called them for my records they checked saw I had never asked before told me to pick them up the next day no /charge  awsome", "pics": null, "resp": null, "gmap_id": "0x88891674b37b8dc9:0xe880f3bf1ccf1271"}
{"user_id": "102976362621219067300", "name": "Kristin Sims", "time": 1620149688510, "rating": 5.0, "text": "Today we had an appointment for an Ultrasound. Our ultrasound technician (Ashlynn) was amazing! She was kind, patient, friendly, professional, and efficient! We appreciated her hard work and kindness in getting the scan completed in a timely manner. She told us without asking what the next steps were and we will be glad to use this facility in the future! We also appreciated the sign on the door which read “Masks are welcome”. With this option people can make choices to wear them if they’d like but aren’t forced to mask. This is true freedom. I appreciate that!", "pics": null, "resp": {"time": 1620151120770, "text": "Kristin, thank you for the kind words. I will be sure that Ashlynn is told of your review. It is our pleasure to care for your needs and appreciate the opportunity to be of service to  you. We are happy that you chose us for your imaging procedure and hope that you are feeling better soon.\n\nRegards,\nBart Medlen\nOwner"}, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "109525164890678591853", "name": "Deborah Baker", "time": 1617841178058, "rating": 1.0, "text": "Terrible experience. Was referred here by UAB Oncologist. Had 5:30 appointment. At 7:25 still have not been seen!!!!", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "100825605495560702517", "name": "Tim Suttles", "time": 1614711030087, "rating": 1.0, "text": "Only 3 people in the office when I showed up for my xray....got out over 1.5 hours later! The xray f was fast. No one seems to care they make you wait with no update or reason.", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "114835485831896966460", "name": "Danny McMullins", "time": 1619816462853, "rating": 2.0, "text": "Had 330 mri appointment. It's 4 and I'm still sitting here. Not that busy but went to desk and was told they are running behind", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "105524263138121725149", "name": "M&M", "time": 1599844777551, "rating": 5.0, "text": "I came straight from my doctors office. The staff was amazing! They got me & out quickly. The tech was very nice. Would recommend.", "pics": null, "resp": {"time": 1599867458553, "text": "Thank you for the positive review. It is our pleasure to serve you and our community."}, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "109692486717096043649", "name": "Wendy McLellan", "time": 1600217397221, "rating": 1.0, "text": "This place is a hot mess. Didn’t tell me I needed to be fasting for my test until I called and asked because someoneI know told me I needed to fast for this test.  Then were over an hour behind schedule for my 7 o’clock test time.  Lied and told me that my appointment was really at 7:30.   Never called to let me know they were so far behind which would have been the professional thing to do.  I have to take meds for anxiety to get into the MRI tube and now they are wearing off because I had to wait so long.  This place sucks.  Will never come back.", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "109904392190103038153", "name": "Russell Pierce", "time": 1592230085655, "rating": 5.0, "text": "The lobby was open when I arrived at 6:48am.  I was able to fill out the relatively short patient information form and then waited about 10 min. to be seen.  I did not have an appointment.  The staff was courteous and fast.", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "100252732228887378951", "name": "Kimberly Nation Morton", "time": 1581098056685, "rating": 5.0, "text": "Me and my husband have both used them and very happy !\nBest MRI experience .. fast too !\nTheir staff is so friendly and very very caring !\nThey go out of their way for you in every way !!!\nAnd their radiologist are very good as well as their technicians , and the equipment is great to.\nSo nice to be greeted by smiling faces at the front desk and on the phone they were very accommodating even got us in a day earlier because of a cancellation!", "pics": null, "resp": {"time": 1581352869105, "text": "Kimberly,\n\nThank you for the kind words. We appreciate the opportunity to serve you. We realize that you have multiple facilities available to choose from and are very happy that you chose us. We want everyone that walks through our doors to feel comfortable in a sometimes uncomfortable situation. It is our pleasure to serve you and if you need imaging services in the future please consider us again.\n\nBart Medlen\n\nOwner"}, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "112979435535379308690", "name": "Tara Landrom", "time": 1579558123234, "rating": 1.0, "text": "Don't go here to get a mammogram. Incompetent fill-ins. Had an abnormal reading for the first time when they had a lady who clearly didn't know what she was doing. I've had 10 mammograms here and one person can ruin your day. I had to go to another facility to another one. Praise God it was negative. I will never go to this place again. Go somewhere else with updated equipment.", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "107736939214652522845", "name": "Shonna Davis", "time": 1579108585202, "rating": 1.0, "text": "We went to get a copy of an MRI yesterday to find they had closed at least 45 minutes early. I called a few hours before we left and was assured that I could come in person, before 7PM (the alleged closing time Monday through Friday). We drove for almost an hour and a half after work to get there before the next scheduled doctors appointment (in Birmingham). Will not use them again.", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "112896880909963403678", "name": "Leigh Cooper", "time": 1550686678588, "rating": 5.0, "text": "Awesome staff, thoroughly enjoyed our visit to this office. My daughter had to have ultrasound, wish I could remember our technicians name, she was great, very friendly and enjoyable! We had to come back the next day for a CT scan and Greg Nance was our technician and he was a pure joy. Daughter loved their conversation. Girls at front desk were great too, all around great experience!", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "117337554654179213796", "name": "Robert Kemper", "time": 1547847920281, "rating": 3.0, "text": "The quickest in-and-out for any CT scan I've had in a long time. Good place but be careful where you park. It's hard to back up on to a busy street.", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "115497417656439885628", "name": "Fidgets Sailing", "time": 1569284823847, "rating": 1.0, "text": "I'd give them negative stars if I could do so.  I have an incredible amount of pain - and live 40 min out from where this center is in Huntsville.  So my appt was made on a Thurs for a Monday at 6:30 pm.  I get there and get told their machine overheated that morning (first thing after a weekend???) then the receptionist tells me they tried to call me several times - no they didn't - they didn't even call one time.  So I waited 4 days, drive 40 min each way and deal with someone lying to me. I'll go to the imagine place on Franklin - they were professional (not rude nor lie) and their equipment works.", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "104535180196853562683", "name": "ni ki", "time": 1554544171696, "rating": 1.0, "text": "Was scheduled here for a MRI. The moment I walked in the front lobby was blown away how rude the receptionist by the name of Brooke was rude to the elderly woman that came in for questions. I refused to be serviced by any company who has staff that goes out of there way to be malice and unkind to their customers. Remember people kindness and love goes a long way. If you are in the position to serve people then do it to the best of your abilities. When you are easily frustrated and find yourself speaking rudely and rolling your eyes at the very people who help your business grow,  then do ALL of us a favor and FIND a NEW job! Unacceptable to treat people any kind of way!", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "110835021089551842111", "name": "Jana Terry", "time": 1572564575389, "rating": 1.0, "text": "My first experience with them was great.  I was in and out in a short amount of time--- no waiting at all.  The x-ray tech and the young lady who did the Doppler were very nice and both seemed very knowledgeable.  However my experience this week was horrible.  I notified them on Monday that I had just been told I needed an MRI. I  specifically requested they perform it because they were close to my office and I had a good experience the week earlier. I said I must get the MRI by midnight October 31 as my insurance changes.  I was told \"no problem\"  -lots of openings.  My physician faxed over the order and my physician had a confirmation that it was received.  I asked the imagine center if they would get a pre-certification for it and they said they would and that they would contact me to schedule. I heard nothing else on Monday. Nothing Tuesday.  Wednesday I called again.  They said they did not get the orders.  I called my physician again and they were re-sent.  My physicians office even the centered and verbally verified that they were received.  Still I heard nothing for the remainder of the day.  I found out later that they left a message on my home machine for me to call (never tried my cell --or my work number) .   I called again today and was told my orders were not specific enough and that a pre-certification was needed.   I attempted to tell them that I had asked that do it.  The office manager immediately came on the phone, was very rude and unprofessional. She preceded to tell me how I needed to call my physicians office and get them to call the center and get the specifics.  I re-enforced  kept saying that I really need to get this today.  Bottom line I did not get my MRI before my insurance changed.  A total lack of communication as one employee is leaving a message on my home phone to schedule and it will not be anything out of pocket while another employee is on the phone with me telling me it will be $1600 total.  They can't do the MRI today but would be happy to schedule me for another day at  $1600 out of pocket.   What would have been zero out of pocket for me will now be $1600.  Am I aggravated and disappointed? YES!  I called and asked that my orders be sent to me so \"maybe\" I could find an open all night MRI facility somewhere and get the MRI taken care of.  The office manager refused to fax the documents to me.  I was told that they could only fax them to another physician.\nThey were my records, a fax is HIPAA compliant but they still refused even after I offered to sign a release.  The office manager is incredibly rude and there does not seem to be communication from one employee to another.  I am very disappointed in them and will most likely never visit their facility again.", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "114405728520103274852", "name": "Karen Griffith", "time": 1493766009663, "rating": 5.0, "text": "I am so grateful to have found this place for an MRI of my knee.  I was treated with the utmost professionalism, respect, care and courtesy today by EVERY ONE I came in contact with from the front desk to the person who made my appointment yesterday (Christie). To the technician, Ben.  Unlike the first place (Bio Imaging) I was referred to yesterday by my doctor. It was like night and day in the treatment and professional care with Center for Imaging Excellence.  I will and would recommend them to ANYONE who wants to be treated with professionalism and excellent care!", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "101132674161576729932", "name": "Greg Hulgan", "time": 1560432017360, "rating": 1.0, "text": "don't use this place rude receptionist ,I was there 2 hours for a knee and hip mri old slow equipment,they only have 1 MRI machine so be prepared to wait,  TELL YOUR DR. to send you somewhere else", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "117530439054375282520", "name": "Kelly Haynes", "time": 1510677892895, "rating": 5.0, "text": "I went for two MRI's with contrast last night. They were open late enough so I didn't have to miss any work. The ladies at the front desk were very kind, prompt, and thorough. The tech assigned to me was very sweet and made me feel very comfortable during the procedure. She explained everything she was doing, each step of the way. They provided headphones during the test, since they're so loud. They had a private room for changing and leaving my valuables, which my tech locked once we went for testing. Will definitely go here for any future testing.", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "101132674161576729932", "name": "Greg Hulgan", "time": 1560432017360, "rating": 1.0, "text": "don't use this place rude receptionist ,I was there 2 hours for a knee and hip mri old slow equipment,they only have 1 MRI machine so be prepared to wait,  TELL YOUR DR. to send you somewhere else", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "102203118100619435738", "name": "Cindy Langford", "time": 1568732779993, "rating": 5.0, "text": "Was in there in May of 2019 for an MRI of my brain and eye orbits-had a very good experience with staff, the technician and scheduling", "pics": null, "resp": {"time": 1568734902302, "text": "Cindy, Thank you very much for your kind words and for trusting The Center of Imaging Excellence with your imaging needs. We value your business and are thankful that you had a good experience with us.\n\nRegards,\n\nBart Medlen\nOwner"}, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "106165999009303249338", "name": "Tiffany Jordan", "time": 1503429656613, "rating": 5.0, "text": "The manager is amazing! I was in extreme pain and she was able to fit me in the schedule earlier than my 5pm appointment. The staff was very friendly.", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "104598723464860896211", "name": "Jenny Geddie", "time": 1554919064980, "rating": 5.0, "text": "Very polite staff and competent .", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "109584108774783318435", "name": "Jon Bloomingburg", "time": 1488837344799, "rating": 5.0, "text": "i have had several scans done there and found them to be great. I am currently scheduling a MRI there now.", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "106077625132621386150", "name": "Barbara Moskow", "time": 1512677578592, "rating": 2.0, "text": "I have been here since 1pm for a 115 appt\nStill at 2:15 not seen for a 15 min scan\nStating I had another appt at 230. This is wrong.", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "112489658255163924384", "name": "Margaret H", "time": 1529693215668, "rating": 2.0, "text": "Don't switch appointment time if offered.", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "115764634037316605659", "name": "Dark Exotic", "time": 1522416782322, "rating": 1.0, "text": "The women who work there have a real bad attitude and are very rude", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "116071774745251546750", "name": "Heather Hanson", "time": 1553801945636, "rating": 1.0, "text": "rude and condescending staff!", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "115543939368999754503", "name": "charisa àt Hopewell Homestead", "time": 1522274891191, "rating": 1.0, "text": "Had to make a second unnecessary trip because the staff didn't do their job right the first time", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "102793879381636661444", "name": "Jacob", "time": 1472051894280, "rating": 1.0, "text": "Rude manager. Expensive.", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "107209862768406522478", "name": "Ann Myers", "time": 1623885754703, "rating": 5.0, "text": "Greg and Brittany were great!", "pics": null, "resp": null, "gmap_id": "0x8862135369467bad:0x1c361c22c3e1dc44"}
{"user_id": "100442287964556677510", "name": "Savannah McCormick", "time": 1581544467735, "rating": 5.0, "text": "The team was very courteous and professional. Austin Bourgeois was very informative of our situation and procedure.", "pics": null, "resp": null, "gmap_id": "0x88626ca5d8c79997:0x7d408e68e4b608e4"}
{"user_id": "102751931633215504979", "name": "Missy Powell", "time": 1597857418120, "rating": 5.0, "text": "Nice place with very fast, professional services. Hope they get enough referrals to stay in business in Prattville. Recommend you getting your Imaging services, including same day MRI, at this facility as you can usually choose where you want to go yourself! Utilize this place as we want to keep a place this nice in our \"Preferred Community\"!", "pics": null, "resp": null, "gmap_id": "0x888e8514b370d2ed:0x94881d76ccfb841c"}
{"user_id": "109864408456190779614", "name": "Jonathan Eric Headley", "time": 1560432909415, "rating": 5.0, "text": "Very nice facility. Easy to get to very nice and professional staff. Always easy to talk to and help in anyway possible. They try everyway to make you comfortable. I went in January 2018 for an MRI and I am about to have another one. I am requesting Sonos Imaging. They even have snacks and drinks for their patients. If I could give more stars I would.", "pics": null, "resp": null, "gmap_id": "0x888e8514b370d2ed:0x94881d76ccfb841c"}
{"user_id": "100539018064535778948", "name": "Leslie Pettway", "time": 1555542968592, "rating": 5.0, "text": "Really nice staff and the office and customer changing room was beautiful.", "pics": null, "resp": null, "gmap_id": "0x888e8514b370d2ed:0x94881d76ccfb841c"}
