{"user_id": "107493024994756636306", "name": "JL McCrary", "time": 1612317238120, "rating": 3.0, "text": "Got a price for radiator out the door.  325.00.  I said ok.  Got the radiator and was handed a ticket for 352.   Scratching my head.  Friendly people anyway. Gave 3 stars only because I expected 325 out the door. Thanks\n\nI don't deny everyone should pay taxes.  I totally agree.  Ive been having work done through jacks since I was 16.  Approximately 40 years. Since you were located in the beautiful brick building across from east elementary school.   My question was: can you price it out the door for 325.00.  I was told yes. I figured the meant pricing the Radiator where it equal a number that allows price to be 325 after taxes.  If you had said I'm sorry you couldn't do it I would have understood.  The young man who helped me was an asset for jacks.\n\nExample,  300 x .09 = 27.   300 + 27 = 327.\n\nEither way.  Thank you.  I'm sure the radiator is high quality.\n\nNot arguing.   Thanks again.", "pics": null, "resp": {"time": 1612314938402, "text": "$325 plus sales tax = $352.63. Sorry for the confusion but everyone pays sales tax. That's the state and county taxing you on your purchase. You pay this everywhere, not just at our place.\n\nI spoke with the guy who helped you. He said he discounted the part from $355 to $325. He did not realize until now you meant you wanted it for $325 out the door. I apologize for the confusion. If you've done business with us that long you have worked with my grandfather, my father and myself and you also know we appreciate your business and our goal is to make customers happy. I apologize that we did not live up to your expectations. Please come by the office and ask for me (Kevin) so that I can make this up to you."}, "gmap_id": "0x8889c957231a2b51:0x34f1797ed970606"}
{"user_id": "104634402209611673187", "name": "John Farr", "time": 1611866687526, "rating": 1.0, "text": "Wouldn't take five minutes to check my radiator for a leak. One star for being polite.", "pics": null, "resp": {"time": 1611871078106, "text": "John, I'm sorry you felt the need to post a 1-star review. Out of respect to other customers with vehicles and equipment down, we can't always stop what we are doing. Your demand seems unreasonable given the fact we offer this as a free service and is very much akin to trying to cut in line at Walmart. If you have a change of heart, feel free to bring it back and leave it with us for a couple of hours & we will perform a pressure check for you."}, "gmap_id": "0x8889c957231a2b51:0x34f1797ed970606"}
{"user_id": "105570017043470792524", "name": "Renee Hulme", "time": 1619119095090, "rating": 4.0, "text": "To get you radiator good prices", "pics": null, "resp": null, "gmap_id": "0x8889c957231a2b51:0x34f1797ed970606"}
{"user_id": "116856803104792048568", "name": "Cj Peterson", "time": 1585752997318, "rating": 5.0, "text": "I highly recommend Jacks Radiator.\nI had a radiator leaking on a Sunday and needed truck on road Monday I called Seth for a Rescue call and he came to shop and made the repair! Seth is the man when it comes to being there for his customers and Quality work and fair prices", "pics": null, "resp": null, "gmap_id": "0x8889c957231a2b51:0x34f1797ed970606"}
{"user_id": "100538815079771885084", "name": "Kesha Speake", "time": 1584488731277, "rating": 5.0, "text": "I highly recommend Jack’s Radiator Shop in Vinemont, Alabama for any type of radiator work! Car problems can be very stressful and expensive but not this time around. My Jeep was leaking coolant in two places when I called. Seth answered and he told me exactly what I needed to do to get there safely. They had my radiator replaced and back in my vehicle in less than 24 hours! He was very nice and answered all my questions! I got a very affordable price, amazing customer service and top of the life mechanic work! I left with full confidence in the work he done! They will get all my business. I don’t know how anyone could not be impressed with their service! 100% Give them a call!", "pics": null, "resp": null, "gmap_id": "0x8889c957231a2b51:0x34f1797ed970606"}
{"user_id": "118260804072168298654", "name": "Tony Ford", "time": 1568036135734, "rating": 5.0, "text": "I have used these guys for almost 30 years and have never been disappointed. They do everything from heavy equipment to small radiators. Great people to do business with!", "pics": null, "resp": null, "gmap_id": "0x8889c957231a2b51:0x34f1797ed970606"}
{"user_id": "113789663226047857854", "name": "skyler shepherd", "time": 1571245785243, "rating": 5.0, "text": "Great Guys Would Recommend To everyone.\nFair Prices on Parts And Good Service", "pics": null, "resp": null, "gmap_id": "0x8889c957231a2b51:0x34f1797ed970606"}
{"user_id": "111748791581459687827", "name": "Thomas Taylor", "time": 1568915905720, "rating": 5.0, "text": "Great shop. All Aluminum custom radiator with stripped transmission cooling line threads. (Note: Don't use JB Weld unless you want to be dead on the side of the road!)\nTook it in (since my truck was dead on the side of the road) they got to it ASAP. They cleared the deck moved it to the front of the line and got it done right. Welded new aluminum threaded fitting AND then added the correct brass flare fitting for the trans cooling lines. Super nice, knowledgeable and good guys. Some shops just say \"Uh huh, yeah well just leave it with us\"\nSend your business their way. You won't be sorry.\nSending my buddy by there to get a new OEM style replacement radiator. Price quoted was just about as cheap 'RockAuto' with shipping and without the delay.", "pics": null, "resp": null, "gmap_id": "0x8889c957231a2b51:0x34f1797ed970606"}
{"user_id": "114557978850892635785", "name": "Kia Peterson", "time": 1585505465178, "rating": 5.0, "text": "They are the best at what they do very honest and trustworthy people", "pics": null, "resp": null, "gmap_id": "0x8889c957231a2b51:0x34f1797ed970606"}
{"user_id": "112648708579910074575", "name": "ty ward", "time": 1521360138399, "rating": 5.0, "text": "Good guy very helpful and affordable, I highly recommend them for all your radiator repair or replacements.", "pics": null, "resp": null, "gmap_id": "0x8889c957231a2b51:0x34f1797ed970606"}
{"user_id": "109343389986226076604", "name": "Michael Best", "time": 1510579432168, "rating": 5.0, "text": "I have had several radiators repaired at Jacks, top notch service.", "pics": null, "resp": null, "gmap_id": "0x8889c957231a2b51:0x34f1797ed970606"}
{"user_id": "107568667620027468977", "name": "Wallace Williams", "time": 1597180202833, "rating": 5.0, "text": "Friendly great prices", "pics": null, "resp": null, "gmap_id": "0x8889c957231a2b51:0x34f1797ed970606"}
{"user_id": "108894636380705831027", "name": "Robby Culver", "time": 1595936338248, "rating": 5.0, "text": "All your radiator repair needs", "pics": null, "resp": null, "gmap_id": "0x8889c957231a2b51:0x34f1797ed970606"}
{"user_id": "104687966505148863337", "name": "Anthony Hildreth", "time": 1499327112166, "rating": 5.0, "text": "Good service, awesome employees!!!", "pics": null, "resp": null, "gmap_id": "0x8889c957231a2b51:0x34f1797ed970606"}
{"user_id": "100696154111562507830", "name": "Doug T", "time": 1628117544861, "rating": 5.0, "text": "Took a while, but got diagnosis and repair estimate.  Great waiting area, with WiFi!  Very courteous staff!  I really appreciate their professionals.  The waiting area has coffee, cold water, fresh popped popcorn, and snacks.", "pics": null, "resp": null, "gmap_id": "0x888603fcc798a8c3:0xb2ba2fcbd21e3c47"}
{"user_id": "106816181291965651382", "name": "Shirley Garner", "time": 1626884889119, "rating": 5.0, "text": "Always get the best friendly service. I know I can trust them with complete and accurate care of my car.", "pics": null, "resp": null, "gmap_id": "0x888603fcc798a8c3:0xb2ba2fcbd21e3c47"}
{"user_id": "112516376229596266119", "name": "Kevin Anderson", "time": 1625155207496, "rating": 5.0, "text": "The staff is very helpful The service department is great they go above and beyond to make sure your satisfied.", "pics": null, "resp": null, "gmap_id": "0x888603fcc798a8c3:0xb2ba2fcbd21e3c47"}
{"user_id": "113825845609303234418", "name": "emma adams", "time": 1626395463729, "rating": 4.0, "text": "Awesome service. However, they surely didn't give me that free car wash that he said I would get.", "pics": null, "resp": null, "gmap_id": "0x888603fcc798a8c3:0xb2ba2fcbd21e3c47"}
{"user_id": "103660858476735977228", "name": "Bobby Hamilton", "time": 1627763923218, "rating": 5.0, "text": "Just had my car service, great job.", "pics": null, "resp": null, "gmap_id": "0x888603fcc798a8c3:0xb2ba2fcbd21e3c47"}
{"user_id": "103146415245682506824", "name": "Arthur Johnson", "time": 1626216465288, "rating": 5.0, "text": "Great service drove off the lot with a great car", "pics": null, "resp": null, "gmap_id": "0x888603fcc798a8c3:0xb2ba2fcbd21e3c47"}
{"user_id": "112481426812842863886", "name": "Hunter Scales", "time": 1627398114506, "rating": 5.0, "text": "Fast service as well as friendly help\nThanks for everything", "pics": null, "resp": null, "gmap_id": "0x888603fcc798a8c3:0xb2ba2fcbd21e3c47"}
{"user_id": "114991699993049136770", "name": "thomas anderson", "time": 1626397477513, "rating": 4.0, "text": "Oil change tire rotation  in about an hour great job", "pics": null, "resp": null, "gmap_id": "0x888603fcc798a8c3:0xb2ba2fcbd21e3c47"}
{"user_id": "107082455920836317416", "name": "Rachael Davis", "time": 1626373152512, "rating": 5.0, "text": "Fast service", "pics": null, "resp": null, "gmap_id": "0x888603fcc798a8c3:0xb2ba2fcbd21e3c47"}
{"user_id": "103519942593693470693", "name": "Corinne Anderson", "time": 1625149797835, "rating": 5.0, "text": "Love it 🦋", "pics": null, "resp": null, "gmap_id": "0x888603fcc798a8c3:0xb2ba2fcbd21e3c47"}
{"user_id": "100647500907047907041", "name": "Tiffany Dedrick", "time": 1628288070740, "rating": 1.0, "text": "We called before driving 2 hours to get a part they said they closed at 5 we made it at 4:30 they had already closed 😡 very bad for business", "pics": null, "resp": null, "gmap_id": "0x888c297aa346fe09:0xd8de15a6db15ca12"}
{"user_id": "110769560075435389002", "name": "tony clay", "time": 1596729233083, "rating": 4.0, "text": "Since the new owners of taking over the prices have gone up. they used to be cheaper than your average parts store now they're more expensive and less knowledgeable", "pics": null, "resp": null, "gmap_id": "0x888c297aa346fe09:0xd8de15a6db15ca12"}
{"user_id": "113787413947124482214", "name": "David Ware", "time": 1536403240502, "rating": 5.0, "text": "Excellent customer service and follow up  on parts that were ordered. Great prices with unbelievable warranty. I'll be getting all my automotive parts that they carry from them.", "pics": null, "resp": null, "gmap_id": "0x888c297aa346fe09:0xd8de15a6db15ca12"}
{"user_id": "105496651111478550336", "name": "James Allen", "time": 1619562383965, "rating": 5.0, "text": "Good", "pics": null, "resp": null, "gmap_id": "0x888c297aa346fe09:0xd8de15a6db15ca12"}
{"user_id": "105901362315696951285", "name": "John Ryals", "time": 1498145003056, "rating": 5.0, "text": "Great place to do business!!! Great customer service Will will find what you need.", "pics": null, "resp": null, "gmap_id": "0x888c297aa346fe09:0xd8de15a6db15ca12"}
{"user_id": "116090470793726710709", "name": "vincent mcmillion", "time": 1547149948877, "rating": 5.0, "text": "Excellant customer service.", "pics": null, "resp": null, "gmap_id": "0x888c297aa346fe09:0xd8de15a6db15ca12"}
{"user_id": "101590158550256781522", "name": "Jose Ulloa", "time": 1516930914587, "rating": 5.0, "text": "Great parts and excellent service", "pics": null, "resp": null, "gmap_id": "0x888c297aa346fe09:0xd8de15a6db15ca12"}
{"user_id": "100222651968718224665", "name": "Willie Bassett", "time": 1543967013258, "rating": 5.0, "text": "Outstanding service", "pics": null, "resp": null, "gmap_id": "0x888c297aa346fe09:0xd8de15a6db15ca12"}
{"user_id": "103056240285698373877", "name": "Allen Wilson", "time": 1625949235471, "rating": 5.0, "text": "Very friendly folks, super knowledgeable about what they do. Half the price of others in the town cause I like to call around an get best price. I'll be back here for sure.", "pics": null, "resp": {"time": 1627077837322, "text": "Allen,\nWe sure appreciate your positive feedback and your business."}, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "106179991036202719436", "name": "Cameryn Bond", "time": 1627602470662, "rating": 5.0, "text": "They have great service and very friendly and patient staff and Gary is the best go see them yall!Get all your needs met😀 thanx D&D Automotive and Tire", "pics": null, "resp": null, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "106800362162328571814", "name": "David M Scott", "time": 1621214769324, "rating": 5.0, "text": "So we we're on our first family vacation and we get stranded on the highway because our car broke down... The belt broke.. well d&d automotive is the place that we chose and I'm glad we did because he went out of his way to fix our car he found us a hotel he got us a discount at the hotel he got his son to drive us to the hotel and he went into work whenever the shop was closed just so we could get our car back running beautifully and we got to go on our vacation. He asked me if we were still going on vacation and I said I really don't know now and he said don't let that happen we will work with you he did not charge me any crazy price or nothing like that. Whenever we go back to Gulf shores we will definitely stop by just to say hey and thank you again amazing people everybody at the shop was very polite.", "pics": null, "resp": {"time": 1622234934287, "text": "Mr. Scott, thank you so much for the positive comment. We are so glad we could give you guys a \"helping hand\". Please do stop in and speak when you are passing through."}, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "108271216407513578725", "name": "Brenli Ashton Lloyd", "time": 1626379065634, "rating": 5.0, "text": "Nicest people ever!  Helped us out in a pinch. If you need anything, couldn’t recommend them more. Outstanding service!!!!", "pics": null, "resp": {"time": 1627077887767, "text": "We are so glad we could assist you. Thank you so much for the kind words!"}, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "108864211413194322058", "name": "Maria Star", "time": 1621098047788, "rating": 5.0, "text": "My family of 3 were on our way to Gulf Shores and our belt broke on the car creating a whole other problem on top of that. Thank goodness we found D&D Automotive and Towing! The owner is the kindest man ever, especially in our predicament. He had his son drive us to a hotel for the night because we had to wait on parts but the next morning the car was running like a CHARM. Thank you Thank you THANK YOU! Great service for a great price!", "pics": null, "resp": {"time": 1622237916163, "text": "Thank you so much for the positive feedback. We are glad we were able to help you out."}, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "112904958804615498072", "name": "Tara Swanson", "time": 1620567017903, "rating": 5.0, "text": "Kindest person ever.  He opened on a Sunday to repair our tire and was quick and efficient.  We were on the road in less than 15 minutes. If we come back through,  we will definitely stop by!!!!", "pics": null, "resp": {"time": 1622238009850, "text": "Mrs. Swanson, I am so glad we could help you guys get back on the road. We are here to help in any way possible.  Thank you again!"}, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "117890164778857524887", "name": "Jeffrey Stottler", "time": 1626905258884, "rating": 5.0, "text": "While traveling, we had a bad alternator. The shop did a great job with the repair and made a bad situation, much better.  Gary was super friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "104453313919536731466", "name": "Michelle Kuznicki", "time": 1620180262632, "rating": 5.0, "text": "I was heading to Gulf Shores, AL from Hazel Green, AL when my 2014 Jeep took a nosedive in Prattville, AL. After taking it to a Jeep dealership up there, and getting the call that nothing was wrong diagnostically and to come get my vehicle, I started my journey to Gulf Shores once again the next day.\n\nHowever, about an hour into my drive my Jeep failed again. I chose D and D Automotive at random because I was in the middle of nowhere and had zero clue about my surroundings. I am so glad I did.\n\nAfter my insurance company got me safely to their shop via tow truck, both Mr. Gary and Joe helped diagnose the issue (it was in fact the alternator), explained the repair to me, checked on me several times (mind you, I was in their shop for close to 6 hours with no where to go), and were incredibly knowledgeable about their trade.\n\nI grew up around cars and can tell pretty quickly when people are in this business to rip off those in need and I can say, without-a-doubt, this shop genuinely cares about their patrons and those they serve. They could have *easily* waited to work on my car the next day but they were immediate in their desire to help and get me back on the road.\n\nI could not be more thankful for their help and cannot recommend them enough. Hearts of gold and quality work, D and D Automotive is the place to go.", "pics": null, "resp": {"time": 1620249804231, "text": "Michelle, thank you so much for the positive feedback. We appreciate the 5 STARS!  We are so glad we would get you back on the road.   We appreciate your business and let us know if we can ever assist you again. Safe travels!"}, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "106592572686133692404", "name": "Wallace Stamey", "time": 1596298943911, "rating": 5.0, "text": "Gary towed my Dodge sprinter back to new Orleans when I broke down near Evergreen. He was courteous, professional, knowledge and prompt. Gary did what he said he would do when he said he would do it. His price was fair and he treated us with great compassion. Thank you Gary! You are a man amongst men!", "pics": null, "resp": {"time": 1597184109167, "text": "Thank you so much, Wallace! We are so glad Gary could assist you. We greatly appreciate your business."}, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "114934238051598072465", "name": "Anita Griffin", "time": 1603582487770, "rating": 5.0, "text": "Family owned.. Great service. Great price.", "pics": null, "resp": {"time": 1607988150071, "text": "Mrs. Griffin, we thank you! We  love Evergreen, Alabama! We also appreciate our loyal customers. Please let us know if we can assist you in any way."}, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "102003348785141017735", "name": "Bethany Tice", "time": 1599858520538, "rating": 5.0, "text": "Great place, was in and out. Very friendly place. I would definitely be back the next time I come thru❤", "pics": null, "resp": {"time": 1600471174117, "text": "WE APPRECIATE YOUR BUSINESS!"}, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "106683605759618617232", "name": "Micah Holt", "time": 1613587197137, "rating": 1.0, "text": "Yes. I came through there in passing at Christmas and had to get my vehicle worked on. Got it back and it was in worse shape then it was when I brought it there.", "pics": null, "resp": {"time": 1613586497565, "text": "Have you ever been to our shop?"}, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "117588783526448540887", "name": "Lori Geldmacher", "time": 1595367847992, "rating": 5.0, "text": "This place is amazing. The guys  are the most professional and Knowledgeable  my AC went out on the way to South Carolina So I Google play shop close by and And I called them and they said bring it on and they take care of me   I can not  thank Them enough.", "pics": null, "resp": {"time": 1595630887491, "text": "We are glad we could help! Thanks for the positive feedback!"}, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "110775954377709247430", "name": "Sarina Lewis", "time": 1618198905006, "rating": 5.0, "text": "Very friendly & worked hard to get my truck on the road.", "pics": null, "resp": {"time": 1618525032049, "text": "Thank you so much! We appreciate your business!"}, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "106454553964876389548", "name": "Ben S", "time": 1562183114062, "rating": 5.0, "text": "I have been trying to think of what exactly to write for the past week or so. I just can't find the words to accurately describe their level of service, excellence or generousness. Mr. Gary and his family are amazing people, he put a lot of hard work into our RV to get everything in working order. Without him we never would've made it out of Alabama. We made it successfully up to Pennsylvania for work, and then headed to Oregon (We made it with no real issues). Outstanding work and service. D & D is a quality place with humble and caring people. They're busy but so worth the wait if you need your car fixed and fixed right with no gimmicks then this is the place for you. Thank you Mr. Gary!", "pics": null, "resp": {"time": 1590790511038, "text": "WOW! We appreciate the comment so much!"}, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "113767972188403320696", "name": "C. Wms", "time": 1595636530094, "rating": 5.0, "text": "I'm new to Evergreen by way of California and needed a mechanic. After a horrible experience with a local automotive shop, I came across D&D. They are amazing, honest, and reasonable. Gary is my mechanic for life. I highly recommend D&D.", "pics": null, "resp": {"time": 1590703420350, "text": "Awww, we thank you so much!"}, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "108139370895861561981", "name": "Greg Pressley", "time": 1620911773799, "rating": 5.0, "text": "Good place", "pics": null, "resp": {"time": 1590788292041, "text": "Thank you so much!"}, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "108332186724628625969", "name": "Maury M", "time": 1591387180590, "rating": 5.0, "text": "Very friendly people with alot of knowledge about vehicles etc.", "pics": null, "resp": {"time": 1591658784301, "text": "thank you"}, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "102355973125273697902", "name": "Carlisa Cheatham", "time": 1564534712683, "rating": 5.0, "text": "I love this place. The people are helpful and will go above and beyond to assist. I will forever be grateful for them.", "pics": null, "resp": {"time": 1590703599284, "text": "We love our customers and appreciate the positive comment"}, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "108937096552139756503", "name": "Pam Richardson", "time": 1563901048852, "rating": 5.0, "text": "Excellent, respectively, reasonable prices, just great family business and they really care about your car needs. And you also get great entertainment while you wait, Gary should be making his on recording music in stores everywhere.", "pics": null, "resp": {"time": 1590788320004, "text": "Awww.. thank you, Mrs. Pam"}, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "106027406037214958854", "name": "Timothy Thompson", "time": 1588286255779, "rating": 5.0, "text": "Excellent 👍 job reasonable price quality work", "pics": null, "resp": {"time": 1590703396700, "text": "we sure appreciate the positive comment"}, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "102896896116436972100", "name": "Tahisi Henry (Tye)", "time": 1593661672507, "rating": 2.0, "text": "Terrible place to take your car and the rates are outrageous! My oil hadn't even been included in the complete tune-up l asked for! My bill just for a radiator that l didn't need and a patch up job because the car still wasn't fixed cost me almost a thousand dollars!😡 I don't recommend this place at all to anyone. It's a total rip off!", "pics": null, "resp": {"time": 1595944748454, "text": "You asked for a tune up and asked us to find  a water leak on your Radiator and to also see if we could replace your gas tank not an oil change You knew your car needed the radiator you are the one that asked me to check it and replace it if necessary. Your car has been completed for several weeks and you still have yet to pick your vehicle up and you don't answer or return my calls ."}, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "115831748864277134283", "name": "Justin Cantrell", "time": 1531350954168, "rating": 4.0, "text": "Great service for the amount of hands to spare. All workers are super nice even if they are slammed. Exellemt tire service and they seem to always have whatever size of used tire you may be needing. Even a soda machine for you to drink while you wait for your needs to be met. If they can't help you they will point you in the right directions to someone who can", "pics": null, "resp": {"time": 1618525063622, "text": "thank and we appreciate your business!"}, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "115436624453125939542", "name": "Tracy Shehan", "time": 1579822979693, "rating": 5.0, "text": "Professional, friendly and affordable prices.  You can't beat D&D automotive!!", "pics": null, "resp": {"time": 1590703445614, "text": "we sure appreciate your positive comment! We love our customers"}, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "109055098985975043611", "name": "Teriika Wallace", "time": 1507039179652, "rating": 2.0, "text": "I give the service 5 stars. Very friendly and laid back. But I was not satisfied with the way my breaks turned out. They still feel like I need to get them done.", "pics": null, "resp": null, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "104828225627262369564", "name": "Shandra Graham", "time": 1568051431558, "rating": 5.0, "text": "Super nice people and very fast. Got a patch on my tire and was in and out in about 15 minutes.", "pics": null, "resp": {"time": 1590703568034, "text": "yeah! We thank you for your business!"}, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "103587690918807732774", "name": "Levar Portis", "time": 1619732415641, "rating": 5.0, "text": "D&D is the number one mechanic shop in Evergreen Alabama", "pics": null, "resp": {"time": 1619736835534, "text": "We truly appreciate your confidence in our shop. We thank you so much for your positive feedback!"}, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "118440966253155917093", "name": "Rick Jr Hendrickson", "time": 1528262724990, "rating": 5.0, "text": "I was traveling thru Alabama via I65 and needed the ujoints changed on my Ford Excursion. These guys hustled their butts off to get me back on the highway. They were very fair, honest and affordable!", "pics": null, "resp": null, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "100551891821164486327", "name": "Robert Fratcher", "time": 1575987864372, "rating": 5.0, "text": "Good pace to have work done", "pics": null, "resp": {"time": 1590703477825, "text": "we appreciate your business and positive comment"}, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "110983078630966963706", "name": "John Porter", "time": 1549926493940, "rating": 5.0, "text": "Phenomenal, honest, inexpensive care, they go the extra mile...actually it was closer to ten miles, I was halfway to Greenvile when my idler bearing seized on my Mercedes Benz 350 SLK, shredding my serpentine belt and leaving me properly stranded at Grace Garland exit. Stuck like chuck and the nearest taxi? Montgomery.  Ouch. Gary got the parts to me and got me back up in running in no time, and to say they were fair, well my friend, that is an understatement. Knowledgeable, fast, friendly and trustworthy is what I know about D&D. Hands down they are the absolute best, and in my case saved the day, and what would have been a long cold night on the side of I65. Thank you Gary and D&D, I owe you guys breakfast next time I'm up that way. AAA doesn't hold a candle to D&D 10/10 would not hesitate to use them again or recommend them to anyone, anytime.\nJohn  B Porter\nSysAdmin\nAirbus Americas Inc\nMobile Engineering  Center", "pics": null, "resp": {"time": 1607988253337, "text": "Thank you so much! We are glad we could assist! Please stop in to visit while you are in the area!"}, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "111502421348623742791", "name": "robert jackson", "time": 1557271462312, "rating": 5.0, "text": "Very humble people, need your car worked on D & D is the place", "pics": null, "resp": {"time": 1594939760589, "text": "We want to say thank you for the positive comment!"}, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "103980485563861444623", "name": "augustus stanton", "time": 1563294301877, "rating": 5.0, "text": "Very professional staff and they have been my mechanic since I've been back in Evergreen I would recommend them to anyone", "pics": null, "resp": {"time": 1590788346753, "text": "We appreciate the positive comment!"}, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "109253580769513809824", "name": "Brenda Stallworth", "time": 1600786698711, "rating": 4.0, "text": "Good services", "pics": null, "resp": {"time": 1601590563992, "text": "Thank you, Mrs. Stallworth"}, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "106073409108252520719", "name": "M. Moore", "time": 1507451461494, "rating": 5.0, "text": "I appreciate the urgency exercised with the issue my car was having. The owner, Gary was the only mechanic to test drive it the way it was needed to get to the root of the problem.", "pics": null, "resp": null, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "110640829953491606862", "name": "Jay Bird", "time": 1516027361129, "rating": 5.0, "text": "Great service ....real nice people.", "pics": null, "resp": null, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "117113988329093807314", "name": "Mark Rudolph", "time": 1605570178296, "rating": 5.0, "text": "Awesome", "pics": null, "resp": {"time": 1607988065505, "text": "Mark Rudolph, we appreciate the positive review!"}, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "105713464323430103343", "name": "Lisa Parrish", "time": 1529495941986, "rating": 4.0, "text": "The people are friendly and efficient", "pics": null, "resp": null, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "106412616885301245348", "name": "Joshua Williams", "time": 1570213982674, "rating": 5.0, "text": "Amazing shop", "pics": null, "resp": {"time": 1590703516089, "text": "thank you for your positive comment"}, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "109808539445303677932", "name": "jeffrey lee", "time": 1497185365984, "rating": 3.0, "text": "Still trying to get on their feet under staffed and alittle slow", "pics": null, "resp": null, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "103691899258142244542", "name": "Alfred Stallworth", "time": 1568619613223, "rating": 2.0, "text": "Keeping my opinion to myself", "pics": null, "resp": {"time": 1590703552160, "text": "we strive to please and hope you do return to our shop"}, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "111302154821074206337", "name": "Johnny Henderson", "time": 1562121342227, "rating": 5.0, "text": "Hard  worker", "pics": null, "resp": {"time": 1607988202349, "text": "Thank you! We do work hard and appreciate the trust of our customers!"}, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "103445775627072204869", "name": "Amy Schweizer", "time": 1605726745577, "rating": 2.0, "text": "4 rd,", "pics": null, "resp": {"time": 1605792633369, "text": "I'm sorry you didn't enjoy your experience. Just let me know what we could do to improve our service"}, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "101190894432914962840", "name": "Deborah Merritt", "time": 1559591739643, "rating": 5.0, "text": "Excellent", "pics": null, "resp": {"time": 1594939697213, "text": "WE APPRECIATE YOUR BUSINESS!"}, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "112274931350902972439", "name": "Vanessa Kyser", "time": 1500344109459, "rating": 5.0, "text": "Great  shopping", "pics": null, "resp": null, "gmap_id": "0x88902d94357b058b:0x658c0095f8ca6892"}
{"user_id": "113767320263797887628", "name": "Tom Kozar", "time": 1610899605169, "rating": 5.0, "text": "An honest owner and hard-working, skilled mechanics. Mike, the owner, is friendly and professional. He takes the time to explain the issue and the repair needed to correct it. I have had other shops like 10-minute oil change chains tell me I needed work done on my car, taken it to Hampton Cove Auto and had Mike tell me \"You are good, there is nothing wrong with your car.\"  I have been a customer of Hampton Cove Auto for 17 years, highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8862119122d4f2a1:0xc6563078f82c4697"}
{"user_id": "109112178506262257439", "name": "Timothy Wyant", "time": 1590157179916, "rating": 5.0, "text": "Timothy Wyant Google's #1 Review Guide!  Very friendly and fast service. Took the time to discuss all work being done before starting. Thank you I'll sure return again.", "pics": null, "resp": null, "gmap_id": "0x8862119122d4f2a1:0xc6563078f82c4697"}
{"user_id": "113291607820237627568", "name": "Adam Henson", "time": 1558180419349, "rating": 5.0, "text": "I had an urgent repair last minute before a long trip to the beach and they did a great job at a good price. They also fixed my wife’s air conditioner and it works perfectly. This is a family owned shop and the lead mechanic is the owner. He doesn’t pay someone to do the work for him so you know the work is done right. I recommend this shop", "pics": null, "resp": {"time": 1560782762340, "text": "HOPE YOU HAD A GREAT TRIP. THANK YOU FOR LETTING US SERVE YOU!!"}, "gmap_id": "0x8862119122d4f2a1:0xc6563078f82c4697"}
{"user_id": "102946949274322279848", "name": "Marianne Manley", "time": 1569951235477, "rating": 5.0, "text": "The most amazing HONEST mechanic I’ve ever dealt with. Very reasonable price and very accommodating to my crazy schedule. I truly appreciate everything he did.", "pics": null, "resp": null, "gmap_id": "0x8862119122d4f2a1:0xc6563078f82c4697"}
{"user_id": "107181431576349696517", "name": "Rich Pflederer", "time": 1571969621948, "rating": 5.0, "text": "Traveling on way to vacation and about five miles before their shop I lost both belts on my car.  No power steering, A/C, water pump, alternator, this at 2:30 in the afternoon.  They pulled it in, ordered the parts, installed and back on the road at 4:30.  Great shop, outstanding service!!", "pics": null, "resp": null, "gmap_id": "0x8862119122d4f2a1:0xc6563078f82c4697"}
{"user_id": "100476837348100379183", "name": "Dylan Hicks", "time": 1598037605871, "rating": 1.0, "text": "This is a scam run by Greg Talley. Look up his criminal record and all the lawsuits he's lost.\nI'm a former employee. If you'd like info on all the illegal business practices taking place email me at dylanchicks97@gmail.com", "pics": null, "resp": {"time": 1605039431535, "text": "As i replied to your complaint months ago, you are posting your complaint on the site for Hampton Cove Auto Service. Greg Talley is the operator of Cove Auto, Let me be PERFECTLY clear, Greg Talley has NO association with MY business, Hampton Cove Auto Service. We who work in this  business know how Greg operates.  My name is Michael Cox & i have owned & operated Hampton Cove Auto Service since 1998. And as for you Mr. Hicks you have never been an employee of Hampton Cove Auto Service."}, "gmap_id": "0x8862119122d4f2a1:0xc6563078f82c4697"}
{"user_id": "113862108449082692283", "name": "Zeke H", "time": 1548300657010, "rating": 5.0, "text": "This is a great mom and pop auto service center and the staff could not have been more friendly or accommodating. I had an emergency repair and they fixed my suv on the spot without delay. I was so happy with the service and the price I even tipped my service technician. I will get all my future vehicle repairs or maintenance at this shop.", "pics": null, "resp": {"time": 1555527833804, "text": "we appreciate us the opportunity to help you out. Please, let us know if we can help you with anything again. Thank you"}, "gmap_id": "0x8862119122d4f2a1:0xc6563078f82c4697"}
{"user_id": "115129749753101993678", "name": "John Muhlhauser", "time": 1546543903717, "rating": 5.0, "text": "December 2017: Amazing customer service! Highly recommend\nJanuary 2019: Mike and Jaquata were again fantastic. Not only through their customer service but demonstrated through their technical skills.  I never feel like just \"another customer\". This family run business is best in town. Excellent service, again highly recommended. I would rate Hampton Cove Auto Service 10 out of 5 Stars if I could.", "pics": null, "resp": {"time": 1547490244919, "text": "We appreciate the opportunity to service you and your family."}, "gmap_id": "0x8862119122d4f2a1:0xc6563078f82c4697"}
{"user_id": "101023895620532946342", "name": "Toby Keef", "time": 1517240862110, "rating": 1.0, "text": "I can not be seen to even get service. I have been by three times to get my vehicle serviced to get told to call on this day or that day. I understand that you are busy but how's about offering a time slot or an appointment.  Often people have to change there life and there families life around to free up a vehicle. Just doesn't seem professional or considerate as a business looking to supply there community and there clients with service.", "pics": null, "resp": {"time": 1547054011727, "text": "Once again mistaken Hampton Cove Auto for Cove Auto. We set appointments for our customers."}, "gmap_id": "0x8862119122d4f2a1:0xc6563078f82c4697"}
{"user_id": "104370299120588766975", "name": "Shaun Osborne", "time": 1436078688186, "rating": 1.0, "text": "New management. Used prior to change, always fair. Went by because air quit blowing cold. Asked how much to hook up gauges to test pressure and was told \"shouldn't be any charge\". The compressor was engaging and disengaging so i figured it might be plugged. The technician hooked it up and saw the high side was too high and low side very low. It was plugged. They tried to say they had to pull codes and all this junk and i told them it runs fine except for the a/c. I shut off the a/c and it ran fine, it would bog down when the compressor engaged. They tried to make more out of it, then charged me $45. Avoid if possible.", "pics": null, "resp": {"time": 1548179270860, "text": "Not us!! WE have been here since 1998, no new management."}, "gmap_id": "0x8862119122d4f2a1:0xc6563078f82c4697"}
{"user_id": "111395873695052236621", "name": "Kirk Ward", "time": 1542157448595, "rating": 5.0, "text": "Great Service and always a fair price.", "pics": null, "resp": {"time": 1547490287265, "text": "Thank you for putting your trust in us."}, "gmap_id": "0x8862119122d4f2a1:0xc6563078f82c4697"}
{"user_id": "115869502342715707990", "name": "Andrew Raymond Crawford", "time": 1499860831747, "rating": 5.0, "text": "I am looking to purchase a 2002-2006 Cadillac Escalade and I used Hampton Cove Auto Services for the pre-purchase inspection of an example I was considering.  The car seemed ok to me, although I knew there were some issues with the shock absorbers and brakes.  The PPI was the best $55 I ever spent and saved me from getting mired in a long list of reliability problems and expensive repairs that would have equaled the purchase price of the car!  I haven't found the right car yet, but will try to bring a few more examples to Hampton Cove Auto Services until we identify the right one.  As well as having a diligent technical team, I have found Jaquata on the customer service side to be both accommodating and very personable.  My neighbor says she has been happily using Hampton Cove Auto Services for many years and it's very easy to see why.  I will use them again as my first preference auto mechanic.", "pics": null, "resp": null, "gmap_id": "0x8862119122d4f2a1:0xc6563078f82c4697"}
{"user_id": "107086719425349286823", "name": "HC Kwok", "time": 1460469532362, "rating": 5.0, "text": "Been going there on and off for 10 years.  Convenient location if you live in Hampton Cove.  Good work with fair price.", "pics": null, "resp": null, "gmap_id": "0x8862119122d4f2a1:0xc6563078f82c4697"}
{"user_id": "115117210192604122961", "name": "Dave Garvey", "time": 1560532307993, "rating": 5.0, "text": "(Translated by Google) The shi\n\n(Original)\nThe shi", "pics": null, "resp": {"time": 1560782695911, "text": "WHAT IS THE SHI?"}, "gmap_id": "0x8862119122d4f2a1:0xc6563078f82c4697"}
{"user_id": "118247857508717902260", "name": "albert burkhalter", "time": 1622117114418, "rating": 4.0, "text": "They were able to fix my radiator on my 78 ford f150. Took about 5 days. Not bad turn time. The people were very friendly and knowledgeable.  Would use them again.", "pics": null, "resp": null, "gmap_id": "0x8892930554d5d093:0x90262132f78d1a83"}
{"user_id": "110037206281837451041", "name": "Nate Trav", "time": 1618499621973, "rating": 5.0, "text": "Patched a hole in my tractor radiator.  Looks good as new. They were refered to me by Bay Springs Auto Repair.", "pics": null, "resp": null, "gmap_id": "0x8892930554d5d093:0x90262132f78d1a83"}
{"user_id": "112308999780429618368", "name": "Brandon Pearce", "time": 1616788312395, "rating": 5.0, "text": "This company saved us money and was able to fix our radiator in less than a week. Excellent service and courteous.", "pics": null, "resp": null, "gmap_id": "0x8892930554d5d093:0x90262132f78d1a83"}
{"user_id": "106091183702026200094", "name": "Andrew Neel", "time": 1615535331542, "rating": 3.0, "text": "Quick and easy to get my radiator in and tested within hours. I appreciate that level of professional attention.", "pics": null, "resp": null, "gmap_id": "0x8892930554d5d093:0x90262132f78d1a83"}
{"user_id": "103893578034168874082", "name": "Timothy Gilley", "time": 1622501154201, "rating": 5.0, "text": "When no one else had a radiator they came thru, will definitely  recommend them", "pics": null, "resp": null, "gmap_id": "0x8892930554d5d093:0x90262132f78d1a83"}
{"user_id": "104877285725134175179", "name": "Ferrets Anonymous", "time": 1618955736022, "rating": 5.0, "text": "Fixed my water pump quick and cheap. Friendly people.", "pics": null, "resp": null, "gmap_id": "0x8892930554d5d093:0x90262132f78d1a83"}
{"user_id": "118055172129593888779", "name": "Ron McMonagle", "time": 1597357704447, "rating": 5.0, "text": "I took my tractor radiator in because it was leaking.  They fixed it and it looks like new and works great.  Reasonable prices.", "pics": null, "resp": null, "gmap_id": "0x8892930554d5d093:0x90262132f78d1a83"}
{"user_id": "117021226167533575327", "name": "Helms Farms", "time": 1598995115727, "rating": 4.0, "text": "Good fast service reasonable price. All radiator sizes", "pics": null, "resp": null, "gmap_id": "0x8892930554d5d093:0x90262132f78d1a83"}
{"user_id": "101779255182046744393", "name": "Bruce Jones", "time": 1592104855742, "rating": 5.0, "text": "Great work on tractor radiator! Fair price.", "pics": null, "resp": null, "gmap_id": "0x8892930554d5d093:0x90262132f78d1a83"}
{"user_id": "112728548656631387999", "name": "TheInferno1914 TN", "time": 1587058220242, "rating": 5.0, "text": "Nice small shop with some honest folks. Quality work!", "pics": null, "resp": null, "gmap_id": "0x8892930554d5d093:0x90262132f78d1a83"}
{"user_id": "100255022385544773030", "name": "Ellen Shazel", "time": 1579727930566, "rating": 5.0, "text": "I simply love my service there. She always lets me know upfront, and never tries to overcharge me or get me to receive services that I don't really need.", "pics": null, "resp": null, "gmap_id": "0x8892930554d5d093:0x90262132f78d1a83"}
{"user_id": "102356637953334555014", "name": "Jeff Worthy", "time": 1583356571618, "rating": 1.0, "text": "They git your number and say they will call you back and never did so I went somewhere else won't never waist my time with them again", "pics": null, "resp": null, "gmap_id": "0x8892930554d5d093:0x90262132f78d1a83"}
{"user_id": "117308348120927248150", "name": "Pug Britt", "time": 1597407442028, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x8892930554d5d093:0x90262132f78d1a83"}
{"user_id": "101978389291841995938", "name": "Darlene Talton", "time": 1623460974105, "rating": 5.0, "text": "Took car to look at dent on hood. Take back next tue for repair man to look at. Very nice and helpful", "pics": null, "resp": null, "gmap_id": "0x888ec8f80e33bbeb:0x7b89d8b0b6b6af83"}
{"user_id": "113683215807163772996", "name": "Robert Brown", "time": 1623465512978, "rating": 5.0, "text": "They have a friendly staff,  good price and great service", "pics": null, "resp": null, "gmap_id": "0x888ec8f80e33bbeb:0x7b89d8b0b6b6af83"}
{"user_id": "115103536564202439302", "name": "White Wolf", "time": 1615566437396, "rating": 5.0, "text": "Friendly people and good prices on the service", "pics": null, "resp": {"time": 1615568554323, "text": "Thank you so much for the FIVE STAR Review! Have a fantastic day!"}, "gmap_id": "0x888ec8f80e33bbeb:0x7b89d8b0b6b6af83"}
{"user_id": "117475247553700731569", "name": "shadow", "time": 1590717124334, "rating": 5.0, "text": "Cody Smith was amazing! He worked until he found the right car and deal for us. He made sure we left happy and 100% satisfied. Will recommend him and this dealership to anyone I know. Thank you!", "pics": null, "resp": {"time": 1601743569625, "text": "Thank you Amber for the WONDERFUL REVIEW!"}, "gmap_id": "0x888ec8f80e33bbeb:0x7b89d8b0b6b6af83"}
{"user_id": "109688946699390681695", "name": "Cody Smith", "time": 1602270414304, "rating": 5.0, "text": "Easy going. Laid back. Darla and Jason are the best!", "pics": null, "resp": {"time": 1602280883815, "text": "Thank you Cody for the GREAT Review!"}, "gmap_id": "0x888ec8f80e33bbeb:0x7b89d8b0b6b6af83"}
{"user_id": "107625066002336911381", "name": "David Sneed", "time": 1541961345163, "rating": 5.0, "text": "Picked up a new Titan XD and could not be happier. Fabulous salespeople and excellent management working with the customers.  The selection of Nissan and Toyota vehicles basically at one location is outstanding.", "pics": null, "resp": {"time": 1601743786840, "text": "Thank you David for the Wonderful Review! Congratulations on your Titan XD Purchase!!"}, "gmap_id": "0x888ec8f80e33bbeb:0x7b89d8b0b6b6af83"}
{"user_id": "117213656577976460922", "name": "Janice Cleckler", "time": 1564420331266, "rating": 5.0, "text": "Very nice salesman and staff that we encountered .we love our new car.", "pics": null, "resp": {"time": 1601743586067, "text": "Thank you Janice for the Five Star Review!"}, "gmap_id": "0x888ec8f80e33bbeb:0x7b89d8b0b6b6af83"}
{"user_id": "100827980336443509071", "name": "Ron Rothenstine", "time": 1557960015681, "rating": 1.0, "text": "Had my 2008 Titan serviced ,they left the air breather cover off and didn't put a new air filter in, my add washer fluid warning light came on, they did not rotate my tires, I can only hope they changed my oil and filter", "pics": null, "resp": {"time": 1601743721216, "text": "Hello Ron. We are so sorry to hear about this visit. We'd love the opportunity to make it right."}, "gmap_id": "0x888ec8f80e33bbeb:0x7b89d8b0b6b6af83"}
{"user_id": "102077402159438345375", "name": "John Ogden", "time": 1560544663999, "rating": 3.0, "text": "Salesman acted like he didn''t know us", "pics": null, "resp": {"time": 1601743671891, "text": "Hello John. We are sorry to hear about this. Unfortunately sometimes we do not remember every customer. If you have any further concerns please call our Owner Loyalty Manager at 205-312-0830."}, "gmap_id": "0x888ec8f80e33bbeb:0x7b89d8b0b6b6af83"}
