{"user_id": "100348926076167310762", "name": "HD Ryder", "time": 1619196413239, "rating": 1.0, "text": "I did business with New Market Iron Works several times in years past and the product and service was always excellent. Sadly, this is no longer the case.\n\nMy last order was in July of 2020 for small job at which time I paid a substantial deposit.As of mid April 2021 I had not  received the order or a final drawing showing what they designed in response to my comments.  This in spite of numerous requests for it.\n\nQuestions I had about my order status received responses of \"It's a small job\" so it is not at the top of their priorities, or \"We've had problems because of COVID-19\", or \"Your job is probably in powder coat\".\n\nLast year they said the order would probably be delivered in mid December 2020. That would have made delivery 5 1/2 months after the order was placed. Promised responses on status & drawing did not happened.\n\nI expressed my displeasure with my experience with them after waiting for nine and one half months to get what I ordered.  Their response was to cancel the job and refund my deposit.  I received the refund check - taped to the inside of the mailing envelope. Apparently they can't handle constructive criticism.\n\nOverall a terrible experience and I don't recommend this company.", "pics": null, "resp": null, "gmap_id": "0x886215db7a41bf5b:0x4b1dbbd94a7b06fc"}
{"user_id": "107468331730404067159", "name": "Christian Phillips", "time": 1597684866547, "rating": 1.0, "text": "The quality of their work is good, but it doesn't matter if they don't answer the phone or respond to emails.\n\nEdit:  I originally contacted you via phone July 8th.  I would have been in touch sooner, but nobody answered the phone until the third day I called.  The woman that answered the phone told me to Email photos of the mailbox needing replacement.  I did.  I was given a quote of $335 for a mailbox post.  I am not going to send a check for $335 without any form of receipt or order form.  That price information was passed to insurance for reimbursement for the damaged mailbox (a much more pleasant experience than dealing with whoever answers your phones).  The email that was sent on the 23rd was sent by me.  It was requesting that someone from your company call me, since over the course of 15 days I couldn't get through once.  They called back the next week while I was at a job site and unable to place an order.  I asked them to call me back later or the next day and was told \"No.  You'll have to call us back.  We're busy.\". I gave them one more chance when I left a voicemail on the 7th of August.  This was one of two times my call went through.  That was the end of any interaction I had with New Market Iron Works.  They didn't call back over the course of the next week, so I bought a mailbox and post from Lowes instead.", "pics": null, "resp": {"time": 1597675566211, "text": "We replied to your email on 7-23-20 with all the information you requested.  I have forwarded it to you again."}, "gmap_id": "0x886215db7a41bf5b:0x4b1dbbd94a7b06fc"}
{"user_id": "114040256198245066603", "name": "Joshua Irwin", "time": 1598558162558, "rating": 5.0, "text": "Purchased two mailboxes with posts, very helpful and great looking mailboxes.", "pics": null, "resp": null, "gmap_id": "0x886215db7a41bf5b:0x4b1dbbd94a7b06fc"}
{"user_id": "106733693970043113856", "name": "Keepn It reall", "time": 1526669207589, "rating": 5.0, "text": "Nice people. Great quality work.", "pics": null, "resp": null, "gmap_id": "0x886215db7a41bf5b:0x4b1dbbd94a7b06fc"}
{"user_id": "106962197234597285862", "name": "Whitney Bell", "time": 1627335070176, "rating": 5.0, "text": "Jackson and his team were great to work with. Everyone is slammed these days in the construction/remodeling business, so I did not hear back immediately, but I was not surprised as I assumed they were very busy. Once I did hear back, Caitlin was super responsive and answered all of my questions. I knew nothing about iron railings, so I had a lot of questions.\nJackson and Isaac handled the measurements, created the skeleton railing, and completed the install.  They are both very attentive to detail and personable. They made sure we understood the process and were happy with the final results.\nI did receive 2 other estimates, and Allen Iron Works offered the best pricing and best timing. I am very pleased with our railing and would highly recommend them.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN28nC1CCINFMcPDe7iJERNaK_nKkkJlgkL4llp=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889052a94105933:0x84f8a3315897fffe"}
{"user_id": "116570765014476343592", "name": "Donna Orrison", "time": 1617808777033, "rating": 5.0, "text": "I wanted to update my house by taking off the wooden porch columns and railing.  I added new columns and Allen Iron Works created a custom railing and stair railing for me. It turned out absolutely gorgeous!  Jackson worked with me on the design and Isaac and Jacob were fantastic with the installation.  They truly do fantastic work.  I couldn't be more pleased with how it turned out", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPRjo3xyTS2rlh3bfLWx6apeaX_FpPTMN2A7Pqd=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP3JZW1bGvzJgr7BkazZODTCqHxrHf8Zo2ZqGdy=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889052a94105933:0x84f8a3315897fffe"}
{"user_id": "104083717212329833161", "name": "Frances Mayhall", "time": 1618930148735, "rating": 5.0, "text": "The new owner of Allen Ironworks, Jackson Langston, helped us with a repair to our iron railing on our front porch. He and his employees were responsive, super professional, and gave us a fair price. They also did a great job. I highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8889052a94105933:0x84f8a3315897fffe"}
{"user_id": "118081020871359579098", "name": "stephanie stone", "time": 1596413990506, "rating": 5.0, "text": "I ordered an iron trellis and it was beautiful!  The staff were helpful, responsive to questions, and timely on delivery. I love it!  Would definitely recommend!", "pics": null, "resp": null, "gmap_id": "0x8889052a94105933:0x84f8a3315897fffe"}
{"user_id": "106559254276616683387", "name": "Michelle Ford", "time": 1612312692477, "rating": 5.0, "text": "Friendly people and very reasonable", "pics": null, "resp": null, "gmap_id": "0x8889052a94105933:0x84f8a3315897fffe"}
{"user_id": "115563040197908999532", "name": "Paris Lady", "time": 1541384788859, "rating": 5.0, "text": "Our cast iron mailbox pole broke from the yard guy backing his car into it. The pole was 70 years old. My Mother mainly wanted to keep the ornate work that the mailbox rested on. Little Hardware quoted a price of 287.00 to weld a new pole to the scroll work and the wait would up to 3 weeks. My Mother said \"Call Allen Iron Works. They have been around for years and will give a fair price for repairs\". They welded a new pole and while I waited for only 20 minutes. They charged us 40.00 which I felt was very reasonable. That was a year ago. Tomorrow I will go again for a custom flagpole that has to be made and I have complete confidence the price will be reasonable. The entire staff treated me with kindness and respect. My Mother was so excited and happy to see the mailbox iron work back in place like it hadn't changed at all since the 1940's. A businessman once told me \"It's repeat business that you always want to strive for. That's the secret of success\". He's right because Allen Iron Works has a customer for life with me.", "pics": null, "resp": null, "gmap_id": "0x8889052a94105933:0x84f8a3315897fffe"}
{"user_id": "111419282386881666393", "name": "Vivian F", "time": 1595859942681, "rating": 1.0, "text": "I signed a contract on June 30th with a deposit of 50% of the cost. In mid July I called them for an installation date. They said \"about two weeks out.\" On July 27th I called them and they said \"a few weeks out.\" I pushed for a delivery date. They said August 17th. I canceled my order as previous promises were not upheld.", "pics": null, "resp": null, "gmap_id": "0x8889052a94105933:0x84f8a3315897fffe"}
{"user_id": "103881629705066137010", "name": "Liz Harding", "time": 1458169347892, "rating": 5.0, "text": "I looked all over for a replacement number for my mailbox. The msilbox's manufacturer recommended this company and they were right!! Fast and wonderful customer service and the store is fascinating!!", "pics": null, "resp": null, "gmap_id": "0x8889052a94105933:0x84f8a3315897fffe"}
