{"user_id": "118184678449026004654", "name": "Joe pietruszewski", "time": 1617377751027, "rating": 5.0, "text": "We decided to buy a home in Foley. Viewed one house with a realtor off Zillow and we were unimpressed with her. Ended up contacting Toni Stanton at EXIT She talked with us and listened to what we were looking for next thing you know we made an offer and bought a new home . Toni was always there for us through the whole process. Not only is she a Great realtor I feel like I have made a friend.", "pics": null, "resp": null, "gmap_id": "0x889a0546b1066981:0xc327fec7a2544bfa"}
{"user_id": "105541017846343873500", "name": "Wayne Anders", "time": 1623207383518, "rating": 5.0, "text": "Great place with excellent agents.", "pics": null, "resp": null, "gmap_id": "0x889a0546b1066981:0xc327fec7a2544bfa"}
{"user_id": "105855183282029018137", "name": "M B", "time": 1599512646941, "rating": 1.0, "text": "Myself and wife spent two days with an agent from EXIT reality of Foley to try and find our forever home.\nI sent and asked their agent to arrange the 10 houses I wanted to view over two days, he took it upon himself to book all 10 over a 6 hour period all in just one day, he followed us around in every home, in one we really liked he found the owners in the house next door and interrogated them on their home, so much so they came home and I tried to ask them a question which the owner was willing to answer only the agent kept interrupting and we both felt embarrased by hes behaviour and he's unprofessionalism, I would suggest not using EXIT or this particular agent.", "pics": null, "resp": null, "gmap_id": "0x889a0546b1066981:0xc327fec7a2544bfa"}
{"user_id": "102477741381099626431", "name": "Toni Stanton (EXIT Realty Gulf Shores)", "time": 1595958853861, "rating": 5.0, "text": "The people at EXIT Realty Gulf Shores are so great to work with! They work hard and have a good time doing helping others.", "pics": null, "resp": null, "gmap_id": "0x889a0546b1066981:0xc327fec7a2544bfa"}
{"user_id": "103394432809513802887", "name": "shioban conley", "time": 1523707195379, "rating": 5.0, "text": "This Company is Absolutely Amazing. They were dedicated to finding me my perfect home. I was a first time home buyer and knew nothing about buying a house. They took they time to explain everything and answer all my questions, and extremely patient with me. I have made life long friends. It was the best decision I had made choosing EXIT Realty Gulf Shores.I love my home, Thank You Tom Stanton and EXIT Realty staff!", "pics": null, "resp": null, "gmap_id": "0x889a0546b1066981:0xc327fec7a2544bfa"}
{"user_id": "111832814136772599181", "name": "Deeanna Lonsdale", "time": 1521668708338, "rating": 5.0, "text": "Tommy Stanton has had the rental property across the street from my house for about a year now.... I have been so pleased with him managing the house. I have had ZERO problems from his renters.Prior to Tommy managing the home we had constant issue with renters.  Tommy runs a a great long term rental company!!! SO if you are a owner looking for a long term rental manger his is your guy.", "pics": null, "resp": null, "gmap_id": "0x889a0546b1066981:0xc327fec7a2544bfa"}
{"user_id": "115645278194692590500", "name": "Christa Goodwin", "time": 1548517225340, "rating": 5.0, "text": "Greg Wood has handled multiple transactions for our family. He is reliable, honest and good at what he does!", "pics": null, "resp": null, "gmap_id": "0x889a0546b1066981:0xc327fec7a2544bfa"}
{"user_id": "113873816865766773712", "name": "Jess", "time": 1500489525999, "rating": 5.0, "text": "Exit, was very helpful and professional.  I would use them again. Highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x889a0546b1066981:0xc327fec7a2544bfa"}
{"user_id": "111930261457433727455", "name": "Cathy Moncrief", "time": 1500490153397, "rating": 5.0, "text": "Greg is awesome, goes above and beyond to make his clients happy.  Highly recommend Exit.", "pics": null, "resp": null, "gmap_id": "0x889a0546b1066981:0xc327fec7a2544bfa"}
{"user_id": "106781969408411388893", "name": "Jennifer Piatt", "time": 1469141505695, "rating": 1.0, "text": "I'd give a negative star rating if the option was available! Customers beware!  EXIT realty in Gulf Shores is a JOKE!!! My husband and I rented a home for 1 year from them and the entire process was a nightmare.  The day we arrived our house was a disaster,  even though they were expecting us. There were paint cans every where,outlet covers were missing AND there were containers of rat poison sitting around. Needless to say we had to get a hotel the first night...fast forward to plumbing and HVAC issues that took a week each to get fixed until we moved out, no one showed up to do a walk through with us and then, a month after moving out, we were told they were keeping our deposit of $950 because of a couple crayon marks on the wall and 2 new toilet seats that had come unhinged...the moral of my story is they have poor customer service, they're dishonest and not dependable.  You have to follow up numerous times to get an issue resolved.  Judy who works there is rude and unprofessional. I was charged  $950 for literally a couple crayon marks, we don't live in poor conditions, it was normal marks from living in our home. I will never rent or purchase a home through EXIT realty again.", "pics": null, "resp": null, "gmap_id": "0x889a0546b1066981:0xc327fec7a2544bfa"}
{"user_id": "104868488180742522372", "name": "Kim Messersmith", "time": 1500411232788, "rating": 5.0, "text": "Love my home! This company was very helpful and never waisted my time.", "pics": null, "resp": null, "gmap_id": "0x889a0546b1066981:0xc327fec7a2544bfa"}
{"user_id": "110709015928964175834", "name": "Kathryn Emerson, REALTOR", "time": 1500342534696, "rating": 5.0, "text": "This is a wonderful company to work with! They care about their clients and their agent.", "pics": null, "resp": null, "gmap_id": "0x889a0546b1066981:0xc327fec7a2544bfa"}
{"user_id": "109147102187331731102", "name": "Bryan Long", "time": 1500425799483, "rating": 5.0, "text": "Highly reccomend! Friendly staff with knowledgeable, timely service.", "pics": null, "resp": null, "gmap_id": "0x889a0546b1066981:0xc327fec7a2544bfa"}
{"user_id": "115092764838751836311", "name": "Jeff Lean", "time": 1514493918123, "rating": 1.0, "text": "We were extremely disappointed in our experience with Exit Realty and agent Tommy Stanton.  Being a former Realtor myself in Tennessee, I'm aware of the responsibility an agent has to their client.  When we hired Mr. Stanton, we were pleased with his feedback and demeanor.  As time passed the feedback, both from his weekly calls stopping and the review emails from the property viewings, slowed down significantly, however we would still consider it satisfactory.  Throughout listing our property with Mr. Stanton, we provided him with all of the information he requested.  However, 36 hours from closing, we were told that we would have to pay our property pool assessment to the tune of $4700.  It was our understanding this would be assumed by the new buyers.  At first he said that he didn't want to go around and around if we told him or not (which we did upon hiring him), but he was aware of our other assessment, so the logic of knowing one but not the other makes no sense.  As I stated in an email to him, even if we pretend that we didn't pass along the information, he's presented himself as one of the most knowledgable and successful agents in the area with lot of experience at the Gulf Shores Plantation.  How would an expert agent who does business there all the time, not be aware to ask about an assessment that began a year and a half ago, which all units there had.  He then proceeded to tell us that he checked on it and the assessment was non-transferrable and could not be assumed by the buyer, which we double checked with our HOA and that was untrue.  We had to pay it because our agent didn't negotiate that on our behalf in the contract.  We gave him a grace period to do something to make it right and were basically told that it just was what it was.  Instead, Mr. Stanton tried to force the situation/closing like everything was common practice.  Had any effort been shown to correct this or any financial responsibility whatsoever been taken, we absolutely wouldn't have posted reviews on every website we could.  As we indicated to the company before closing, with this not happening, we felt like we needed to let our HOA, others rental services and the general public know our experience with Mr. Stanton and Exit Realty.\n\nOne of their brokers/owners stepped in to call us to see what could be done and apologized repeatedly, saying he believed it was an honest mistake and that it has changed how they will do things in the future.  He said on all future transactions, they will have a disclosure form for things like assessments.  First, I am shocked that's not already common practice as I know in Tennessee everything has a disclosure.  Second, I am glad that this error may have changed how Exit Realty does business, but it was at $4700 of my expense.  We hope this helps anyone who is looking to list or buy in the future and will assist you in assuring the same thing doesn't happen to anyone else", "pics": null, "resp": null, "gmap_id": "0x889a0546b1066981:0xc327fec7a2544bfa"}
{"user_id": "102390546497138677344", "name": "Warren Helmer", "time": 1501683295035, "rating": 5.0, "text": "I live 5 1/2 hours from Gulf Shores. A Realtor that I work with in Mobile referred Janise Brocks. I called her on a Wednesday night, and she said that she could show me condos on Saturday. I drove down early Saturday morning, and she spent that day driving me around Gulf Shores.  I was able to find an investment property that day, and bought it.  Needing a property manager, she introduced me to Cindy Burns who is also a member of Exit Realty, and our relationship has been stellar. I ask a lot of  Cindy, and she is incredible. Tenants love the condo, but rave over Cindy's customer service. I could write a book about how happy I am with Janise Brocks and Cindy Burns and the remarkable customer Service they provide. All of my future real estate dealings in Gulf Shores will be with them.", "pics": null, "resp": null, "gmap_id": "0x889a0546b1066981:0xc327fec7a2544bfa"}
{"user_id": "103226912165626229837", "name": "Andrea Machnacki", "time": 1609705914074, "rating": 5.0, "text": "When choosing which school to take the course through it can be confusing and overwhelming,  I however know I made the right choice. When I took the state exam I passed on the first try. Just wanted to say thank you to Marlene for the great instructions, encouragement and helpfulness along the way. No other teacher will give you their personal cell phone number that you can text or call at any time when you have questions. I appreciate all of your help!", "pics": null, "resp": {"time": 1611064952921, "text": "Thank Andrea!  Do not wait too long to get the Post Licensing completed.  :-)  Good luck and keep in touch."}, "gmap_id": "0x889a0fd034cfc9a1:0x118490049ae778b5"}
{"user_id": "109126122590549463569", "name": "Patrick Callahan", "time": 1599151662351, "rating": 5.0, "text": "Choosing which course to sign up for was a bit overwhelming but I have no doubt that I made the right choice. I took the state exam yesterday and passed on the first try. Thank you Marlene for the great teaching, encouragement along the way and helping me prepare for the exam!", "pics": null, "resp": {"time": 1599156253960, "text": "You are so welcome.  Taking a Virtual Live Interactive Course isn't so bad.  :-)  Thank you for the review.  I knew you would pass with flying colors.  Thank you for another 1 and Done for CRES.  :-)"}, "gmap_id": "0x889a0fd034cfc9a1:0x118490049ae778b5"}
{"user_id": "115832338302380863472", "name": "Patsy Parker", "time": 1590260786652, "rating": 5.0, "text": "This Streamlined program was most informative and  helpful.  The narrator was very careful to explain any subject not easily understood. I am very  grateful to Mrs. McKinnely for her time and help.  Patsy Parker", "pics": null, "resp": {"time": 1590327060786, "text": "Please text me your email address- 407 791-5604"}, "gmap_id": "0x889a0fd034cfc9a1:0x118490049ae778b5"}
{"user_id": "105192768623282835757", "name": "Miranda McGregor", "time": 1576870575220, "rating": 5.0, "text": "Marlene is fabulous!!  She's very knowledgeable and truly wants her students to succeed!  I just completed her broker pre-license course and was very pleased with my experience. She was thorough in her instruction, answered all questions, provided great study materials. I'm horrible with math and she was able to give me some tips and explain the math portions so it was easy to follow and understand for me.  I highly recommend Marlene and Classic Real Estate School for all your real estate licensing needs.\n\nI'm also proud to report, I passed my broker exam first try this morning!  I owe it to Marlene's instruction!  Thank you Marlene!!", "pics": null, "resp": {"time": 1576879002773, "text": "Miranda, YOU deserve credit; you listened to what I purported were the most cojent points and studied in the manner recommended. I want to let you know that I am always here should you have a question or need in your professional real estate career.  I am available anytime!!! MarLene"}, "gmap_id": "0x889a0fd034cfc9a1:0x118490049ae778b5"}
{"user_id": "110294571792060781319", "name": "Gliset Nieves", "time": 1561911565274, "rating": 5.0, "text": "Marlene is one of the best real estate teachers in the industry. Not only she has the experience of being a broker but has the experience to get you to where you need to get to... I had not seen not one student fail to achieve their goal in becoming a license realtor in taking her courses. The way she teaches it will give you the confidence to reach your goal... Her school is a A+. I highly recommend Classic Real Estate School.", "pics": null, "resp": {"time": 1561913154941, "text": "Thank you so much.  That is such a sweet review.  As you know once you are my student (child), I am always here for you no matter whether it is for education, advice, or motivation!  :-)  Keep in touch!  MarLene"}, "gmap_id": "0x889a0fd034cfc9a1:0x118490049ae778b5"}
{"user_id": "100725537722119149472", "name": "Richard Frank", "time": 1587842879710, "rating": 5.0, "text": "Thank you so much for the streamlined review for the state exam. It was awesome!", "pics": null, "resp": {"time": 1590006313184, "text": "We have them once a month.  Please pass the word so more folks can take advantage... :-)  MarLene McKinley"}, "gmap_id": "0x889a0fd034cfc9a1:0x118490049ae778b5"}
{"user_id": "112770061040555414004", "name": "Real Watkins", "time": 1586739778878, "rating": 5.0, "text": "I would have to say this was one of the best and i mean BEST cram classes i have taken i love everything about it thank you again!!!", "pics": null, "resp": {"time": 1590007145455, "text": "Thanks!  MarLene McKinley"}, "gmap_id": "0x889a0fd034cfc9a1:0x118490049ae778b5"}
{"user_id": "101401401722859744463", "name": "Jennifer Gremmels", "time": 1568486388245, "rating": 5.0, "text": "Great teacher ! She explains everything in easy to understand formats. I highly recommend Classic Real Estate School to anyone wanting to have a career in real estate. .", "pics": null, "resp": {"time": 1568490206449, "text": "Thank you Jennifer!  You got this!!!!"}, "gmap_id": "0x889a0fd034cfc9a1:0x118490049ae778b5"}
{"user_id": "105031565452817416885", "name": "Shelby Galloway", "time": 1569516862756, "rating": 5.0, "text": "Such a great class! Great info with a fun instructor!", "pics": null, "resp": {"time": 1569529122878, "text": "YOU were a pleasure to have in class.... Please keep in touch!!!"}, "gmap_id": "0x889a0fd034cfc9a1:0x118490049ae778b5"}
{"user_id": "116426551707082300798", "name": "Amber lawson", "time": 1563546187837, "rating": 5.0, "text": "Very thorough! Highly recommend.", "pics": null, "resp": {"time": 1563574739986, "text": "Thank you Amber.  It was truly a pleasure to have you in the class.  Remember to reach out and contact me if you need anything!  I will have the FL Post Licensing Course in Foley most likely in February of 2020."}, "gmap_id": "0x889a0fd034cfc9a1:0x118490049ae778b5"}
{"user_id": "115334306541484517343", "name": "David Rosenthal", "time": 1559846022853, "rating": 5.0, "text": "Outstanding Real Estate Training. Marlene is amazing.", "pics": null, "resp": {"time": 1559909749918, "text": "Thank you David!  That grandbaby is BEAUTIFUL!!! Please keep in touch."}, "gmap_id": "0x889a0fd034cfc9a1:0x118490049ae778b5"}
{"user_id": "100345132785428874702", "name": "Latoria Smith", "time": 1568673444293, "rating": 5.0, "text": "I highly recommend!!", "pics": null, "resp": {"time": 1568717301992, "text": "Thank you Latoria. 💕. Good luck, keep in touch and don’t forget your post licensing course. 😊"}, "gmap_id": "0x889a0fd034cfc9a1:0x118490049ae778b5"}
{"user_id": "115114016565298036278", "name": "Barker Ashley", "time": 1568486078402, "rating": 5.0, "text": "Excellent", "pics": null, "resp": {"time": 1568490264316, "text": "Thank you so very much.  You will do fine on your state exam.  :-)"}, "gmap_id": "0x889a0fd034cfc9a1:0x118490049ae778b5"}
{"user_id": "101400753333575955052", "name": "A. H.", "time": 1622653200843, "rating": 5.0, "text": "We live out of state in NY and was looking into buying a home in Huntsville where we grew up and Missy was fantastic! She was absolutely willing to meet our family in any home we asked and put together a list of potential places for us. Very sweet, very helpful and I would recommend her to anyone.", "pics": null, "resp": {"time": 1622658428163, "text": "Thank you for your kind review! We agree that Missy is fabulous, and we are so glad you had a positive experience with our company."}, "gmap_id": "0x8862657ca1fa4f13:0x25aabdd1b55c1ab9"}
{"user_id": "108881924804042036614", "name": "leslie huber", "time": 1609197767026, "rating": 1.0, "text": "Highly suggest finding someone else to do business with. MY MISTAKE was focusing on square footage and layout, I didn't look at lack of cleanliness (I did note the carpet appeared to be dated). They apparently aired out the house before walk-through, at my return (it had been closed up a few days) cigarette smoke permeated the air. Ironically, they had ME pay a cleaning deposit.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP5GjOCIlSf_nY0ft5bhVnECkDzYXUUs7DUeEU=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOMuB6501vFZKETy59FoKNtwqnjfI5o2EWXeYo=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNulegzQJw1t_HIbbBIlalgM_bsX__SWDPGWU8=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNmnFoTlOdXaToXowISlfLczWdqWq7qtKiAXJI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMZA1ANakaXN1XMVxi_uRkKQiMkiY5ZvOMLz08=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOXcNH9Im3IwEIZDQuorOlMuvfg7tiBIivJ-Wc=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPj11jYlT2d07sFxrp1Tw0eLIOAQUd9FFJD0Vc=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPLm0ULag8vbSe-8rIaPniMJ7b1C5r3mq70IvA=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNsUMiOb44BZvMURSNYgrJTB2GbDXhhhcjduCI=w150-h150-k-no-p"]}], "resp": {"time": 1614478948706, "text": "This was the result of a miscommunication between the cleaning crew and new owners and has been rectified."}, "gmap_id": "0x8862657ca1fa4f13:0x25aabdd1b55c1ab9"}
{"user_id": "103280060789317042670", "name": "FLhogs n dogs", "time": 1614380067220, "rating": 1.0, "text": "False advertising on listings.  Unethical.  Posting houses active that are under contract, etc.  Entire matter filed with Alabama Association of Realtors.\n\nStandard of Practice 12-8\nThe obligation to present a true picture in representations to the public includes information presented, provided, or displayed on REALTORS®’ websites. REALTORS® shall use reasonable efforts to ensure that information on their websites is current. When it becomes apparent that information on a REALTOR®’s website is no longer current or accurate, REALTORS® shall promptly take corrective action. (Adopted 1/07)", "pics": null, "resp": {"time": 1614466679274, "text": "ValleyMLS, of which this company is a member, requires that all listings that go under contact reflect that status change within 24 hours of ratification of such contract. This company adheres to the policy of the ValleyMLS."}, "gmap_id": "0x8862657ca1fa4f13:0x25aabdd1b55c1ab9"}
{"user_id": "110501122505773323489", "name": "matt hache", "time": 1610640452658, "rating": 5.0, "text": "Dena Puliatti has been fantastic to work with, she has answered her phone every time I have called for questions, or concerns about properties. Highly recommend her, she is professional, responsive and courteous.\nBN", "pics": null, "resp": {"time": 1614467069877, "text": "We are so pleased to hear of your positive experience with Dena!"}, "gmap_id": "0x8862657ca1fa4f13:0x25aabdd1b55c1ab9"}
{"user_id": "113237293976050570599", "name": "Wiley Bailey", "time": 1601915848509, "rating": 5.0, "text": "Richard doesn't only open a door for you. He takes time to study the situation to help his customers in ways they didn't know existed. He is an advocate and a problem solver. I highly recommend!!!!", "pics": null, "resp": {"time": 1601917995585, "text": "Thank you for your kind words!  Thank you for allowing us to help you in your home buying process!"}, "gmap_id": "0x8862657ca1fa4f13:0x25aabdd1b55c1ab9"}
{"user_id": "111510556486461762387", "name": "Harry Lewis", "time": 1592238382338, "rating": 5.0, "text": "Outstanding company for your real estate needs.  They were very responsive and did a great job in all aspects of selling my place.", "pics": null, "resp": {"time": 1592251384774, "text": "We are so proud that your home sale went smoothly for you and that you trusted us to help you.  We would be honored to help you, again, in the future!"}, "gmap_id": "0x8862657ca1fa4f13:0x25aabdd1b55c1ab9"}
{"user_id": "117158161609686944051", "name": "Kyrie Laré", "time": 1588758517411, "rating": 1.0, "text": "I did not choose to work with anyone from this inconsistent office but had no choice after one of their realtors bought the property I live in from rocket city property management. My rent was always due by the 6th well they changed that and did not tell me then tried to charge me 50$ extra for Jan Feb and March claiming I was late but they just took too long to deposit my checks. NOT AT ANY POINT IN TIME WAS I CONTACTED AND MADE AWARE OF ANY LATE CHARGES. I HAD TO FIND THE INFORMATION ON MY ONLINE PORTAL MYSELF 3 months later and I never got a formal letter stating that I owe anything. If you owe a business, arent they supposed to send you a letter or written notice? They are so unprofessional because not only did I get ZERO letters, in the lease it stated I was to pay 45$ for late fee not 50$ so someone is not able to ensure things are consistent in this office anymore. I would not recommend dealing with this office whatsoever. They raised my rent and took three weeks to stop a huge rain water leak I had coming through my ceiling, and let me go without a working fridge for nearly a week while leaving two fridges in the tiny apartment for two weeks for storage not able to use either one. It has just been a ridiculous experience I am hoping there is a still a decent place to rent from in this area but so far this place has done me wrong totally I got two babies under 2.  Can’t afford unnecessary extra charges, rent going up, and not having a fridge. Just ridiculous and sad. I cannot wait to move.", "pics": null, "resp": {"time": 1589572580769, "text": "Kyrie,  we are so sorry this has been your experience and we would like to be able to look into your complaint.  We don't have anyone by your name registered as a tenant in our Property Management Division.  Would you please contact us at missioncontrol@weichert.space and give us your address so that we may investigate this further for you?"}, "gmap_id": "0x8862657ca1fa4f13:0x25aabdd1b55c1ab9"}
{"user_id": "117613463476435498903", "name": "Britt Searcy", "time": 1591805015834, "rating": 5.0, "text": "I just wanted to take a minute to tell you how much we appreciate Michelle Brewer.  We started the process of moving from Pensacola, FL to Huntsville, AL about 9 months ago.  It has been a long, tedious process, but Michelle helped us tremendously every step of the way.  I think she took us to look at about 50 houses!  We closed June 5th on a new construction home and we are now living in our new home.  Michelle has become not only our \"go to\" realtor for life, she has become a great friend.  Thank you so much Michelle, and thank you Weirchert Realtors.\nSincerely,\nW. B. and Cara Searcy\n102 Somer Oaks Dr, Huntsville, AL  35811", "pics": null, "resp": {"time": 1605585607680, "text": "Thank you so much! We agree that Michelle is just wonderful!"}, "gmap_id": "0x8862657ca1fa4f13:0x25aabdd1b55c1ab9"}
{"user_id": "105063001885180953039", "name": "Inspire Women For Christ", "time": 1486484772924, "rating": 5.0, "text": "I absolutely love working for Weichert!  I couldn't have asked for a better broker or colleagues.  If your looking for a company with true professionalism and passion, look no further!!!", "pics": null, "resp": null, "gmap_id": "0x8862657ca1fa4f13:0x25aabdd1b55c1ab9"}
{"user_id": "107798392416588480635", "name": "Deby Boss", "time": 1464108799835, "rating": 5.0, "text": "Awesome company. Great agents!  Great place to work!", "pics": null, "resp": {"time": 1486422352552, "text": "Thank you, Deby! :)"}, "gmap_id": "0x8862657ca1fa4f13:0x25aabdd1b55c1ab9"}
{"user_id": "102699525581625159876", "name": "Salt Edroots", "time": 1506002940464, "rating": 5.0, "text": "Highly recommend Jay I'Konn at Weichert Realtors.", "pics": null, "resp": null, "gmap_id": "0x8862657ca1fa4f13:0x25aabdd1b55c1ab9"}
{"user_id": "114824691799847259286", "name": "A D", "time": 1550729087125, "rating": 5.0, "text": "Very professional. Ask for Amanda DelPonte!", "pics": null, "resp": null, "gmap_id": "0x8862657ca1fa4f13:0x25aabdd1b55c1ab9"}
{"user_id": "107675225283387005646", "name": "John Carroll", "time": 1510235479958, "rating": 5.0, "text": "Lovely people", "pics": null, "resp": null, "gmap_id": "0x8862657ca1fa4f13:0x25aabdd1b55c1ab9"}
{"user_id": "112010346505033565563", "name": "Alston Walker", "time": 1503500183691, "rating": 5.0, "text": "I was great working with Weichert!", "pics": null, "resp": null, "gmap_id": "0x8862657ca1fa4f13:0x25aabdd1b55c1ab9"}
{"user_id": "101368521060319931838", "name": "Lori Dubois-Coy", "time": 1486485350168, "rating": 5.0, "text": "Most professional real estate team around!!", "pics": null, "resp": null, "gmap_id": "0x8862657ca1fa4f13:0x25aabdd1b55c1ab9"}
{"user_id": "104120648908769262604", "name": "Kelly Holder", "time": 1486509380045, "rating": 5.0, "text": "Professional, hardworking, and dedicated agents that take care of all of your real estate needs.  I wouldn't work with anyone else!!", "pics": null, "resp": null, "gmap_id": "0x8862657ca1fa4f13:0x25aabdd1b55c1ab9"}
{"user_id": "116057943034965826351", "name": "Brenda Elliott", "time": 1486484600950, "rating": 5.0, "text": "The most caring and professional agents in the business!", "pics": null, "resp": null, "gmap_id": "0x8862657ca1fa4f13:0x25aabdd1b55c1ab9"}
{"user_id": "103421271424829130849", "name": "Vicky B Cerniglia", "time": 1486496419995, "rating": 5.0, "text": "High degree of professionalism, excellent training and support.", "pics": null, "resp": null, "gmap_id": "0x8862657ca1fa4f13:0x25aabdd1b55c1ab9"}
