{"user_id": "108236530995421965328", "name": "Mike Frohlich", "time": 1627741441660, "rating": 1.0, "text": "This company has major problems. I have twice a week service in walker chapel and we’re lucky to get one and lately it’s been the wrong day! What’s going on! Hope my association gets a new company. You’ve proved your not capable of getting the job done! When missed no effort to pick up missed  day ! You are wasted management!", "pics": null, "resp": null, "gmap_id": "0x8889053d434c4f77:0xa647212207f07dff"}
{"user_id": "112020812777186750533", "name": "Emmett Haislip", "time": 1625520209807, "rating": 1.0, "text": "Absolutely the worse refuse company there is. They give us green cans and come and dump them into a rear loader and when they drag all the loose garbage out of the hopper they just leave it on the ground. They claim they are great for the environment but all they do is pollute. Wish I had another alternative but I don't.", "pics": null, "resp": {"time": 1625589429879, "text": "Emmett Haislip, we are disappointed to see your low star rating.  If you could provide more information to us, we would be more than happy to try and make this situation better.  Please email your complete service address along with a copy of your post to wmcares@wm.com subject line GOOGLE REVIEWS.  We look forward to hearing from you."}, "gmap_id": "0x8889053d434c4f77:0xa647212207f07dff"}
{"user_id": "116478189294094608698", "name": "mcsupersoldier1", "time": 1625943395925, "rating": 1.0, "text": "I called two weeks ago to start service. After being on hold for over 30 minutes I was able to finally accomplish getting set up. I was told a container would be delivered in five to seven days. After seven days with no container, I was told it was scheduled to be delivered Monday 7/5. It's three days later and still no container. I call to inquire about it today and was told the wait time was greater than thirty minutes. I didn't have time to wait so I sent an email. This has not been a pleasent experience.", "pics": null, "resp": {"time": 1625942315157, "text": "We realize that this situation is difficult, but let’s try and find a solution.  Please email your complete service address along with a copy of your post to wmcares@wm.com subject line GOOGLE REVIEWS and we will get to work immediately on your request."}, "gmap_id": "0x8889053d434c4f77:0xa647212207f07dff"}
{"user_id": "113587434147357317727", "name": "Shequetta Hillman- Adkins", "time": 1619034646541, "rating": 1.0, "text": "I have been waiting on a trash bin for two weeks now. I called numerous times and have emailed numerous times also. I have yet to receive any feedback!!! So frustrating!", "pics": null, "resp": {"time": 1619543605419, "text": "Shequetta Hillman, I’m sorry you’ve had to deal with this.  We work hard to provide a fantastic experience to everyone.  It's discouraging to see that you had a negative experience.  Please email your complete service address along with a copy of your post to wmcares@wm.com subject line GOOGLE REVIEWS and we will reach out immediately."}, "gmap_id": "0x8889053d434c4f77:0xa647212207f07dff"}
{"user_id": "105650701674394434089", "name": "Montre Randall", "time": 1579988248733, "rating": 1.0, "text": "Waste management make it so hard for you to get a job there they dont care about the struggling man.", "pics": null, "resp": null, "gmap_id": "0x8889053d434c4f77:0xa647212207f07dff"}
{"user_id": "115513531780052339677", "name": "JCO Lake", "time": 1488396999050, "rating": 1.0, "text": "Waste Managment in Birmingham is terrible.  If you are  able to get to a human you will find that Customer Service is rude.   They have monthly price increases in which they cant explain and then say \" TOO BAD \" you are under contract, even though you haven't signed  a contract in years.", "pics": null, "resp": null, "gmap_id": "0x8889053d434c4f77:0xa647212207f07dff"}
{"user_id": "105606779388914342125", "name": "The1&OnlyKiaFOH Plus Kate", "time": 1508359032425, "rating": 1.0, "text": "Does ANYONE know what good customer service is Anymore!?", "pics": null, "resp": null, "gmap_id": "0x8889053d434c4f77:0xa647212207f07dff"}
{"user_id": "112686737024657764315", "name": "Charles Anderson", "time": 1593362544916, "rating": 1.0, "text": "Have not picked in  two weeks", "pics": null, "resp": {"time": 1593457217691, "text": "We are sorry to hear about this Charles. We understand the importance of having reliable service. We would like to investigate this immediately. Please email your complete service address along with a copy of your post to wmcares@wm.com subject line GOOGLE REVIEWS,  and we will start working on this right away."}, "gmap_id": "0x8889053d434c4f77:0xa647212207f07dff"}
{"user_id": "118230143127785935900", "name": "kenneth Malone", "time": 1502470453837, "rating": 1.0, "text": "I called to get a dumpster a 30 yard can took 10 min to talk to someone and after that he told me 750$ for the dumpster i have called 4 other companies and they were all around the 400 $ range the guy told me he was paid on commission and that there price and have a good day i would pass them by and use someone else who cares about there business", "pics": null, "resp": null, "gmap_id": "0x8889053d434c4f77:0xa647212207f07dff"}
{"user_id": "115378232697695077768", "name": "Fred D", "time": 1603724280571, "rating": 1.0, "text": "poor service", "pics": null, "resp": {"time": 1603724862237, "text": "Fred D, we are disappointed to see your low star rating.  If you could provide more information to us, we would be more than happy to try and make this situation better.  Please email your complete service address along with a copy of your post to wmcares@wm.com subject line GOOGLE REVIEWS.  We look forward to hearing from you."}, "gmap_id": "0x8889053d434c4f77:0xa647212207f07dff"}
{"user_id": "111155477084951860103", "name": "Nakia Seals", "time": 1364439322611, "rating": 3.0, "text": "It's not like it used to be", "pics": null, "resp": null, "gmap_id": "0x8889053d434c4f77:0xa647212207f07dff"}
{"user_id": "115895397706659505846", "name": "S B", "time": 1620839934062, "rating": 1.0, "text": "Normally a great experience here but lately and today 5/12/21 it seems like wait times have gotten longer and ALL employees take lunch at the same time for a COMPLETE HOUR.  The lunch “hour” turned into a 90 Minute wait to enter the gate.\n\nA better business practice would be to alternate lunch breaks to accommodate inbound shipments to avoid the situation of truck drivers running out of hours to work then FORCED to leave and driving in violation of federal law leaving Waste Management liable being we as drivers cannot over park anywhere on site. Us truck drivers can only work a certain amount of hours per day unlike the site workers.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNk_QGN9jQVDbWHsPltrfDIYvraA5xQwI4vjEE9=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOQRVO_JR4bbhOK1GlZ9rR_3DlFGYhNu0k4uojO=w150-h150-k-no-p"]}], "resp": {"time": 1621465738425, "text": "We are sorry to hear about your experience and would like to investigate this further. Please email your complete service address along with a copy of your post to wmcares@wm.com subject line GOOGLE REVIEWS, and we will reach out immediately."}, "gmap_id": "0x888437927a4649e9:0xf2d0d9095dd49f31"}
{"user_id": "106796499295190055409", "name": "John Clark", "time": 1616599989241, "rating": 1.0, "text": "Long wait time to be unloaded.\nPrepare to spend several  hours.\nHopefully  I will not have to ever come back.", "pics": null, "resp": {"time": 1616602449097, "text": "We are sorry to hear about your experience and would like investigate this further. Please email your complete service address along with a copy of your post to wmcares@wm.com subject line GOOGLE REVIEWS, and we will reach out immediately."}, "gmap_id": "0x888437927a4649e9:0xf2d0d9095dd49f31"}
{"user_id": "118267581486331381567", "name": "White Guy", "time": 1617214449936, "rating": 5.0, "text": "I come here almost daily. They take pretty good care of you if you dump in the landfill.", "pics": null, "resp": {"time": 1617396561526, "text": "Jeremy Baldwin, we are so happy to read such a great review about Waste Management - Emelle Hazardous Waste Facility!"}, "gmap_id": "0x888437927a4649e9:0xf2d0d9095dd49f31"}
{"user_id": "105206100671886062910", "name": "Preacher Paul", "time": 1609857275343, "rating": 5.0, "text": "Nice people, easy to work with nice delivery.", "pics": null, "resp": {"time": 1610035899187, "text": "Preacher Paul, your wonderful feedback and rating mean a lot to us."}, "gmap_id": "0x888437927a4649e9:0xf2d0d9095dd49f31"}
{"user_id": "109387634021960199084", "name": "Greg McCoy", "time": 1611671482523, "rating": 4.0, "text": "Trucker friendly staff and lots of room.", "pics": null, "resp": {"time": 1613492683143, "text": "Greg Mccoy, thanks for the kind comments about our team. We strive to deliver an excellent experience!"}, "gmap_id": "0x888437927a4649e9:0xf2d0d9095dd49f31"}
{"user_id": "111469574802041181675", "name": "Mark Dolinar", "time": 1600963357180, "rating": 3.0, "text": "There delivery hours a terrible small window 2 make delivers only 4 hours from 7am 2 11am..they do except delivers on fridays and its a long wait 2 get umloaded.", "pics": null, "resp": null, "gmap_id": "0x888437927a4649e9:0xf2d0d9095dd49f31"}
{"user_id": "100916670633477791765", "name": "John Cutler", "time": 1600782703736, "rating": 4.0, "text": "A little slow on the startup. They do what is required and are professional.", "pics": null, "resp": {"time": 1601316602053, "text": "Thank you, John , for taking the time to let us know how we did. We hope you have a great day!"}, "gmap_id": "0x888437927a4649e9:0xf2d0d9095dd49f31"}
{"user_id": "110180908508974068801", "name": "Brian Finke", "time": 1597341287360, "rating": 1.0, "text": "Unprofessional unacceptable wait times drivers spend several hours waiting to dump drivers end up losing drive time they could othwise be using to pickup their next load strongly recommend using another facility", "pics": null, "resp": null, "gmap_id": "0x888437927a4649e9:0xf2d0d9095dd49f31"}
