{"user_id": "101941563088560272969", "name": "Butch Gantt", "time": 1614724643815, "rating": 5.0, "text": "Great enclosed gated storage for RV and will order any part you need.", "pics": null, "resp": null, "gmap_id": "0x888c29ac20e56215:0xe363c1ecf1170126"}
{"user_id": "108597598615165480300", "name": "Florence Papa", "time": 1602017771003, "rating": 5.0, "text": "We stopped here while traveling on the road. Our vent cover needed to be replaced. They were very courteous and professional when they assisted us.", "pics": null, "resp": null, "gmap_id": "0x888c29ac20e56215:0xe363c1ecf1170126"}
{"user_id": "104989598527176653105", "name": "Bevil Johnston", "time": 1600794616027, "rating": 5.0, "text": "Brandon does good work if you need repairs, and its a great place to store your RV.", "pics": null, "resp": null, "gmap_id": "0x888c29ac20e56215:0xe363c1ecf1170126"}
{"user_id": "108185791679712308012", "name": "Michael Jernigan", "time": 1595302913038, "rating": 1.0, "text": "The way this establishment treated my brother and his family because he was an African American, I wouldn’t recommend this place to anyone!!! The service was awful, they kept his RV over 8 months and didn’t fix anything on the RV.\n\nMy Caucasian friends recommended this place to me because of all the things they had them fix on their RV. My brother bought his RV here to have the same small issues fixed and he was told after 8 months that they don’t fix any of those things on RV’s anymore! Unbelievable...", "pics": null, "resp": null, "gmap_id": "0x888c29ac20e56215:0xe363c1ecf1170126"}
{"user_id": "102956831577507094439", "name": "Nicholas Milner", "time": 1578607111239, "rating": 1.0, "text": "To put it as professionally and simple as I can the customer service is really bad! We weren’t reinventing the wheel nor were we solving the problems in Washington.We were simply installing a new awning and the parts never arrived over a period of six weeks.\nAfter an extended period I called and inquired with no return call, I went by and expressed my desire to know a date to expect my repair to be completed and Brandon vowed to have me answers on the following Monday. This day come and went with no communication as well. I waited until today (Thursday) to call and there were still no answers to my question.Brandon called me 3 hours later and informed me the supplier wasn’t sure if it was shipped, going to ship or might ship!\nAt this time I expressed my irritation and asked Brandon if this was a job he really wanted to do or did I need to find another repair shop..His words were “ I can’t seem to satisfy you so just come get it”.. so I did and I hope whom ever reads this thinks twice before letting your unit sit and sit and sit.", "pics": null, "resp": null, "gmap_id": "0x888c29ac20e56215:0xe363c1ecf1170126"}
{"user_id": "107199858075071402086", "name": "Carol P", "time": 1545250744158, "rating": 4.0, "text": "Excellent deal for $40 a month. I would give this a five star rating when the rest of the gravel is put in. Ask about their separately priced setup options, too. How wonderful it is to have someone bring your camper to where you want it, and then have it set up for you when you arrive.", "pics": null, "resp": null, "gmap_id": "0x888c29ac20e56215:0xe363c1ecf1170126"}
{"user_id": "117815287911549898183", "name": "Josh King", "time": 1574593488722, "rating": 5.0, "text": "Excellent and friendly service, and these are good honest business people.  Even though they aren't the closest RV place to me, I will always take my business to them since they are such a good business.", "pics": null, "resp": null, "gmap_id": "0x888c29ac20e56215:0xe363c1ecf1170126"}
{"user_id": "116180756710905031693", "name": "Jon Marshall", "time": 1495658845380, "rating": 5.0, "text": "Rarely do you find exceptional customer service like you do here.  I stored my camper and 5 X 9 trailer here for a year and cannot be happier with the friendly, professional service I've received.  With a simple phone call they've gladly handled every request from packing my bearings to filling my propane tanks.  Brandon, Mark, and the rest of the team are terrific.", "pics": null, "resp": null, "gmap_id": "0x888c29ac20e56215:0xe363c1ecf1170126"}
{"user_id": "112842191975270626092", "name": "Dean Beery", "time": 1515940378636, "rating": 5.0, "text": "Took the trailer in for warranty work on a refrigerator that had quit working.  They were the quickest to take us in, in the area.  Great service, went the extra mile with us.  The Norcold refrigerator had a part that was new to their line and hadn't put out a bulletin for it.  The service department helped with contact with Norcold and helped set up the delivery of the part to the next area we are traveling to and also got the refrigerator working on propane.  Spent all morning with us.  No charge to us.", "pics": null, "resp": null, "gmap_id": "0x888c29ac20e56215:0xe363c1ecf1170126"}
{"user_id": "117197048297162614451", "name": "Kevin Long", "time": 1564664922517, "rating": 5.0, "text": "Very Knowledgeable staff and they do great work!!!", "pics": null, "resp": null, "gmap_id": "0x888c29ac20e56215:0xe363c1ecf1170126"}
{"user_id": "117066828976105425228", "name": "Bill Idle", "time": 1487094953809, "rating": 5.0, "text": "Best service I have encountered. We were traveling and had electrical problems. They got us in imediately and on the road.  Very professional and cost effective.", "pics": null, "resp": null, "gmap_id": "0x888c29ac20e56215:0xe363c1ecf1170126"}
{"user_id": "106604351923182128423", "name": "Karen Winchell", "time": 1549583662700, "rating": 4.0, "text": "Gray water drainage pipe broke...Analized the situation 2day...We stayed overnight in our motorhome...Will B fixed 2morrow...Employees very knowledgeable...professional...friendly people...Very pleased with our visit...", "pics": null, "resp": null, "gmap_id": "0x888c29ac20e56215:0xe363c1ecf1170126"}
{"user_id": "102063929219007680819", "name": "Dudley Christian", "time": 1546502716394, "rating": 5.0, "text": "Best place in area for RV service and professional staff.", "pics": null, "resp": null, "gmap_id": "0x888c29ac20e56215:0xe363c1ecf1170126"}
{"user_id": "109045707312596471166", "name": "C Ray Marilu S Beasley", "time": 1545020561479, "rating": 5.0, "text": "Well run family business. They will order any part needed.", "pics": null, "resp": null, "gmap_id": "0x888c29ac20e56215:0xe363c1ecf1170126"}
{"user_id": "102335212836245123801", "name": "Tammy Barganier", "time": 1530458842877, "rating": 3.0, "text": "Nice employee, very helpful to my friend.", "pics": null, "resp": null, "gmap_id": "0x888c29ac20e56215:0xe363c1ecf1170126"}
{"user_id": "115335962737876170418", "name": "Elcm 1008", "time": 1508596961807, "rating": 3.0, "text": "helpful staff very friendly", "pics": null, "resp": null, "gmap_id": "0x888c29ac20e56215:0xe363c1ecf1170126"}
{"user_id": "102990892359726759863", "name": "Minwoo Kim", "time": 1478702608810, "rating": 5.0, "text": "Nice people to work with", "pics": null, "resp": null, "gmap_id": "0x888c29ac20e56215:0xe363c1ecf1170126"}
{"user_id": "105299479245361599386", "name": "Angie Carter", "time": 1394724506710, "rating": 5.0, "text": "Excellent RV repair.", "pics": null, "resp": null, "gmap_id": "0x888c29ac20e56215:0xe363c1ecf1170126"}
{"user_id": "107895722365898943684", "name": "Rolland Lessard", "time": 1523970229329, "rating": 5.0, "text": "(Translated by Google) Reliable and understanding staff, very well located, I got myself towed here for repair on RV, problem solved. Storage available here inexpensive, large location, several RVs on site. Thanks to Billy and Bradom who took care of us. RECOMMENDED\n\n(Original)\nPersonnel fiable et compréhensif ,très bien situé ,je me suis fait remorque ici pour réparation sur VR ,problème résolu.Storage disponible ici pas dispendieux,endroit vaste,plusieurs VR sur place .Merci à Billy et Bradom qui s est occupé de nous.Je RECOMMANDE", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP47lCGF8yToLxHNHKaLgHy9lbztxNr7HuA7fkj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOg07Qh8-LoWNlC2oUmcTVLbtfkr3-kSk9mxjJb=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888c29ac20e56215:0xe363c1ecf1170126"}
{"user_id": "114110604841039033351", "name": "Suzanne Carr", "time": 1626898571129, "rating": 5.0, "text": "We purchased our first fifth wheel from recently. Joe was very helpful and kind during this entire process. Even though they are currently remodeling, the entire team was positive, friendly and welcoming!", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "111518278343583772342", "name": "velma spradlin", "time": 1623866022679, "rating": 5.0, "text": "we recently purchased a new RV from warrior with the help of the Florence dealership . we would like to thank kevin from Florence and Darrel and Jennifer also johnny  from warrior dealership .  These guys worked very hard to help us find the right one for us.\nwe are grateful to everyone for their help,we are looking forward to many years of fun and travel . They made sure we have everything we need and how to use it . Great Bankston team .   Many Thanks\nVelma and Randy", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "111738601786735661344", "name": "Edward Mulder", "time": 1624236350899, "rating": 1.0, "text": "Poor customer service. Treated me like I was a nuisance. Ended up going to Huntsville to get a camper. Worth the drive to not deal with them again.", "pics": null, "resp": {"time": 1624307048766, "text": "Hi Edward, At Bankston Motor Homes we want every customer who walks on our lot to feel like family. We are always looking for ways to improve and would love the opportunity to speak with you and hear about your experience. The direct line to call the customer satisfaction manager is 256-346-0309 or text 256-533-3100. We look forward to speaking with you soon."}, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "107018776443612479301", "name": "Donielle Wicker", "time": 1617504153165, "rating": 5.0, "text": "We are repeat customers of Bankston’s, we can’t say enough good about our experience with this company as a whole! From sales to service A+ !!! Big thanks to Joe G. and Kevin at their Florence location for making our 2021 Sport Trek purchase as excellent as our 2018 Bighorn purchase was! We are Loyal to businesses who treat their customers as they should be and Bankston fits the bill! Thank you again! Gone Camping! The Wicker’s", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "116561233982681601615", "name": "Garry Hayden", "time": 1605623659878, "rating": 5.0, "text": "Had a great experience buying our first camper from Kevin at Bankston Motor Homes Florence AL. The whole buying process was done over the phone, including getting the financing. We drove over from Atlanta to pick up our new camper and got a thorough walk-through. We appreciate the great customer service and highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "103734659569758381144", "name": "Devon Cox", "time": 1613006676409, "rating": 5.0, "text": "Wonderful experience from start to finish..\nThank you to Kevin,Joe and everyone involved in our purchase...top notch...", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "105848957130235429176", "name": "Tyron Duncan", "time": 1617183049049, "rating": 2.0, "text": "Florence.. not helpful..  Not inviting. Run down facilities. Huntsville  somewhat better", "pics": null, "resp": {"time": 1617296014495, "text": "Tyron, Thank you so much for the feedback  and we wanted to let you know we are actively working on improvements at that location."}, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "104729875919230391599", "name": "SandraWeav", "time": 1605373216743, "rating": 5.0, "text": "My husband and I had the best experience purchasing our camper with our salesman, Kevin!! He was able to answer all of our questions and take the time to show us what we needed to know as first time owners. I highly recommend Bankston!", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "115264409139998687359", "name": "Tammy Gregory", "time": 1581524586688, "rating": 5.0, "text": "Kevin was so easy to get along with and helpful. We never once felt pressured into buying. We purchased our Fifth Wheel from a large RV show in Nashville, and was able to do the final walkthrough in Florence, Alabama. There was no problem with Bankston delivering the camper to Texas, where we are working.  As well as, with bringing the trade in back from Texas. We recommend anyone to Bankston Motor Homes, they know how to treat their customers, even if there are some special request that are asked of them.", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "110857708005107205369", "name": "Brian Reeves", "time": 1577114511234, "rating": 5.0, "text": "While I was there, my experience with Mr.  Jeffrey's was great.  He answered all my questions that I had.   He was very friendly and knowledgeable.  I highly recommend him any time.  I'll be back there when I get ready to trade or purchase another camper or motor home. Thanks for the great service!!!", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "100563958159363707877", "name": "Lori Windsor", "time": 1573095934389, "rating": 5.0, "text": "Excellent customer service.  Kevin and Vivian were so helpful.  The RV was spotless when we picked it up.  Everyone at Bankston treated us like family.  This was our first RV buying experience after researching RVs for a year and they are our go to company for any future needs.\nHighly recommend.", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "112625074391408664948", "name": "Dan Shafer", "time": 1593275580366, "rating": 5.0, "text": "I recently purchased a new Winnebago motor home from Bankston in Huntsville   Several problems were not discovered in the pre delivery inspection. When I discovered these issues I took the unit to the Florence location which is closer to my home. The staff there quickly resolved the issues. Thanks guys for helping us out.", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "101729343645100036427", "name": "Dennis Sorrell", "time": 1584067427954, "rating": 5.0, "text": "We had a couple of problems with our slide that needed attention before we felt the camper was ready for its next trip.  Joe, the mechanic, was very accommodating though his schedule was full enough already.  He worked patiently to try to diagnose and make the corrections to the slide's operation.  He also answered questions concerning other possible problems with our new camper.  He was polite, knowledgeable, and experienced.  He is a great asset to the company.", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "115086010136612219158", "name": "Bryson Jeffreys", "time": 1627065519851, "rating": 5.0, "text": "Kevin took time to answer any questions or concerns we might have had. Had a excellent experience in purchasing our first travel trailer and now looking forward to use our new home away from home.", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "104097696622001315237", "name": "Greg Pigg", "time": 1560519710156, "rating": 5.0, "text": "We really enjoyed our experience with Bankston of Florence.  This is the second camper I have bought from them.  I have purchased both campers from Joe.  He has been great to work with us on all things and has answered lots of questions. I feel at home when I am there.  Thank you for a great buying experience. We will be back!", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "117597079702290774615", "name": "James Nipper", "time": 1563284061145, "rating": 5.0, "text": "We just purchased a new camper from Kevin and the experience was amazing. Everyone was so helpful and kind. Kevin was very knowledgeable and was not the normal pushy salesman. He help us when we needed help but also let us take are time to look at different options on our own. The whole process from the time we step foot on the lot till we picked up our new camper was great. I highly recommend using Bankstons of Florence.", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "105471522022765344281", "name": "K S", "time": 1565465502234, "rating": 5.0, "text": "We drove from Oklahoma to buy our new trailer.  Kevin gave us a good price and had excellent communication throughout the buying process.  When we arrived our camper was ready as promised. Well worth the drive.  I would recommend  Kevin and the Florence location.", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "105810499159034392547", "name": "Zach'ery Antennas", "time": 1593883998358, "rating": 5.0, "text": "THANK YOU SO VERY MUCH!!!!! Joe Gervias at Bankston Motorhomes of Florence, Alabama took his time to come service my RV off the clock. After 45 minutes he had it fixed like the brand new unit it is.\nHe was very professional and super talented at his craft. After dealing with the lacking customer service at Bankston in Huntsville, Alabama, I was hesitant to stop by the Florence location. I'm sure glad that I did.\nJoe was more helpful and kind to me in the 6 hours that I knew him than the last 7 months dealing with the Huntsville location. Joe should be recognized for his loyalty to Bankston Motorhomes. It's people like Joe who makes customers want to come back. Joe went out of his way to come to my brother's house and fix an issue that had nothing to do with him other than looking out for a customer of Bankston Motorhome. THANK YOU SO MUCH MR. JOE. Bankston needs several more employees like him. 10 stars for Joe Gervais!!! Joe alone changed the way I view Bsnkston Motorhome as a complete company. HIRE MORE JOE GERVAIS !!! He is one of a kind!!", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "104736316257870087734", "name": "Bradley Mansell", "time": 1566260164199, "rating": 5.0, "text": "Kevin was wonderful to deal with. Bankston of Florence is not like all the big dealerships. They treated us like they care about our business, and made sure we were familiar with our unit and satisfied with it before we took it off the lot. Thanks!", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "101767144717732799484", "name": "Harvel Scales", "time": 1587180525888, "rating": 5.0, "text": "4/17/20\nMy name is Harvel Scales and this message is about my visit to Bankston RV this morning at the Florence location. I've never done business with Bankston but what happened today was more than just business, it was extraordinary service!\nJoe Gervais, Parts & Service Dept , had never met me until this visit. I thought I needed to buy, for the second time a new thermal couple. I was totally frustrated because I couldn't get the 6 gallon water heater working for my vintage Airstream restoration project. This was after tinkering with the thing for two days and watching about four hours of YouTube video.\nWith out my asking, Joe volunteered to put my 47 year old water heater on his work bench for a complete check out and test. It only took a few minutes for him to discover what I had completely overlooked; a faulty propane regulator!\nSelling a thermocouple would have been the quick and simple thing to do for a customer who was interrupting the work flow for an item selling for no more than a few bucks.\nAt Bankston today I received a courtesy that I think is rare and over the top, all for \"no charge\".\nYou can bet that my friends in the camping world will hear this story.\nThanks Joe!\nHarvel Scales", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "103747505000180960250", "name": "Regena Clark", "time": 1554425265034, "rating": 5.0, "text": "Kevin was extremely knowledgeable and very helpful with the purchase of our new RV. He made the whole process so easy and enjoyable. We highly recommend Bankston of Florence to anyone looking to buy a motor home. We will definitely be back!", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "114769052294041360402", "name": "Paul Boyer", "time": 1565476140627, "rating": 5.0, "text": "Kevin Jeffreys and Bankston are the best...no pressure but always willing to provide or get you the information to make an informed decision. Kevin wants you to be happy with your choice and we are. Cindy and I could not be happier!", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "108396827740567274584", "name": "Joshua Jackson", "time": 1560549658605, "rating": 5.0, "text": "Joe did excellent work on our airstream and got it covered under the warranty 100%. The airstream dealer charged us $300 and said we had a deductible and didn’t even fix the problem. Joe not only fixed it right but got the warranty people to cover 100%.  10/10 would come back and recommend to anyone.", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "101940187860197745044", "name": "Koby Littrell", "time": 1573574592228, "rating": 5.0, "text": "Kevin Jeffreys Is an amazing fella and we are so thankful to have him take care of us!! When we decide to upgrade to a larger camper, we will definitely come see Kevin Jeffreys in Florence, AL location.", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "117113783392567553129", "name": "Clay Glover", "time": 1491158216662, "rating": 5.0, "text": "Bought our travel trailer here fall of 2016. Great, friendly service. Good experience with the sale. Great help after the sale.  Found a minor issue with the RV that came from the manufacturer that way and Bankston corrected the issue without any problems. I would recommend.", "pics": null, "resp": {"time": 1491238841108, "text": "We appreciate your feedback and your business!"}, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "110630024709179693355", "name": "June Abe", "time": 1494011723075, "rating": 5.0, "text": "I just recently purchased a mobile home from this company. I was communicating via email since I am located in CA.  MR. Will Boenker who helped me a lot.  He was so attentive, patient. I was so pleased to buy from him.  He was so cordial and his service was a perfect. I strongly recommend buy from him.  \"Thank you Will again\"", "pics": null, "resp": {"time": 1494020287858, "text": "We are glad to hear that Will took good care of you and, we appreciate your business."}, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "116780789484073517150", "name": "AMANDA WEST", "time": 1518923111444, "rating": 5.0, "text": "I recently purchased a travel trailer from this company. Kevin Jeffreys was our salesperson and i could not have asked for a better experience. He went above and beyond to help us get exactly what we wanted.Highly recommend Kevin and Bankston motor homes.  Thank you so much for everything.    God Bless\n\nTim & Amanda West", "pics": null, "resp": {"time": 1520266696326, "text": "Amanda, thank you for taking time to share your experience working with Kevin at our Florence location. Kevin works very hard to make sure he helps each customer find the best unit for them- we hope your enjoy your RV!"}, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "118319754845258488107", "name": "Laken Wilbanks", "time": 1531363197041, "rating": 5.0, "text": "Kevin and the staff stayed late and made sure we got our camper today. He also went out of his way to show us the best way to get out of Florence without having to go over the tight bridges by being our personal escort. My husband and I highly recommend Kevin and the staff at Bankston RV in Florence. Thank you Bankston.", "pics": null, "resp": {"time": 1533911597450, "text": "Thank you- so glad we were able to help!!"}, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "110852420366369452358", "name": "Rosie Anderson", "time": 1531775784203, "rating": 5.0, "text": "We purchased a 2003 camper from Kevin Jeffreys, and it was fixed up and serviced by Joe. They made us feel very welcome, and treated us extremely professionally. They are kind and pleasant people. They are knowledgeable and passionate. Highly recommended.", "pics": null, "resp": {"time": 1533911540415, "text": "Thank you for taking time to leave a positive review, Kevin & Joe work very hard to keep their customers happy!"}, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "103633268639568037902", "name": "Keith Crosslin", "time": 1528383773962, "rating": 5.0, "text": "Previous review was submitted by mistake. I don't know how to remove it. Definitely give Bankston motor homes of Florence a 5 star rating. Had a minor issue with my microwave, it was under warranty and Joe got it resolved promptly.", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "105846955643946514145", "name": "Joey Mashburn", "time": 1563810975436, "rating": 5.0, "text": "I've been to a lot of camper sites. This is not only the best customer service you'll receive, but also some of the best prices. Joe Gervais was not only an awesome guy to deal with, but very honest up front, stayed with me on the phone during the buying process by checking in with me, and if I had a problem with camper, would get in touch with me day or night. I dont do a lot of reviews, but these guys take the cake and deserve all the credit. Kevin was also very helpful and considerate getting stuff done for me when Joe was off. Will not get this anywhere else! 5 stars plus more to you guys all the way.", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "100078894333387282017", "name": "troy wilbanks", "time": 1531362449773, "rating": 5.0, "text": "Awesome place. Awesome people. Great experience. The staff at Bankston RV in Florence AL made our day, thank you Kevin and everyone that made today possible.", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "101206471144767782187", "name": "Larry Mabe", "time": 1574442226450, "rating": 5.0, "text": "Kevin , joe and Sarah very good  people did a  good job traded with  them 4 times in 2 years bankston  florence  .very good  people to  deal with I rated them 4 stars.", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "112118856725410931434", "name": "Chris Burton", "time": 1535804841219, "rating": 5.0, "text": "If you are looking for a camper, we highly recommend you visit Bankston in Florence and work with Kevin Jeffreys. We just bought our new 2018 travel trailer from him and the experience was great! Kevin was very knowledgable, professional, and SO easy to work with. He took so much time to help us find exactly the right camper. Thanks so much Kevin! You and the Bankston family have launched us into many years to come of good times and good memories with our new camper.", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "118003281744256530945", "name": "Barbara Skipper", "time": 1517232307759, "rating": 3.0, "text": "Prices are too high!!!! Especially on used motor homes. The new ones, not so bad. But they do have excellent payments on them if you can get financed", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "117758141409336919242", "name": "Rose Allison", "time": 1519447475387, "rating": 5.0, "text": "For Great service and repairs on RV's and Campers, you need to check them out. Just ask for Joe. Large selection of inventory and parts. If he doesn't have what you need he sure can get it for you. Pleasant atmosphere with a very helpful staff !", "pics": null, "resp": {"time": 1520374935680, "text": "So glad that Joe was able to take care of you - we are lucky to have him on our team!"}, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "110649325684509428404", "name": "Angie Haddock", "time": 1538881207004, "rating": 5.0, "text": "Kevin was great to work with at Bankston in Florence. We looked at everything he had on the lot and kept him late more than once. He was so patient through the whole process and never made us feel pressured or rushed. He found us what we wanted at another location and had it brought to Florence. We appreciate all his help and will definitely return if we need another upgrade! He went all out to get us exactly what we wanted. Thanks Kevin!", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "110944196313281766028", "name": "DONNA Smith", "time": 1559676709048, "rating": 5.0, "text": "Best place to buy campers in the shoals area,we had great customer service, and Kevin treats you like a friend", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "111108863443641303107", "name": "Don McNease", "time": 1556923955231, "rating": 5.0, "text": "Kevin, in florence was great. Got almost what I was asking for.\nI had went to camping World and they tried to steal my motor home. Bankston did me right. Tks\nDon Mcnease", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "109692188779746592426", "name": "Ryan Cowley", "time": 1538709451173, "rating": 5.0, "text": "We bought our travel trailer almost 10 months ago from the Florence location and we love our trailer. They have been extremely helpful and really make sure that we are happy each time we stop in for service.", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "115910916864401511455", "name": "Rickee Butterworth", "time": 1565019898014, "rating": 5.0, "text": "This is the place to go if you are interested in RVs. Joe Gervais is hands down the best RV Guru, crisis support person and service support expert for new RV owners. If I could buy all of my automobiles from this place I would.", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "111658522881151158873", "name": "Paul Sobel", "time": 1554314934723, "rating": 5.0, "text": "We broke down on vacation and Joe did everything he could to deal with our insurance to get out trailer fixed. He was able to squeeze us in and get us back on our way.", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "118126808349041126975", "name": "Dr. Genie Mardis", "time": 1564669834372, "rating": 5.0, "text": "Bankston gave me a fabulous price and they did a great job getting my camper ready!   Kevin goes above and beyond to help his customers!!", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "113099748705674266583", "name": "Sam Williams", "time": 1521649502210, "rating": 5.0, "text": "Kevin is the best! He is so helpful! They have a great selection and great customer service!", "pics": null, "resp": {"time": 1522421318937, "text": "Thank you for taking time to mention Kevin's helpfulness & leave us a 5 star review- we sincerely appreciate it Samantha!"}, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "104248475548397185470", "name": "Stacy Franks", "time": 1521755714636, "rating": 5.0, "text": "I give them a 5-star rating simply due to their professionalism that was exhibited. Thank-You Joe and Ms Smilly face. I am sorry for my misunderstanding.", "pics": null, "resp": {"time": 1522421220899, "text": "Stacy thank you for making time to leave a positive review about Joe's professionalism, that was very kind of you."}, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "103765858586263639704", "name": "Angel Cuevas", "time": 1545258406432, "rating": 5.0, "text": "This Place went above and beyong to help me and my family with our first RV purchase, Kevin went above and beyond to make this a super easy purchase. I am active duty military and Bankston RV of Florence, AL really takes care of us service members. I drove 2 1/2 hours to go see the RV and after the deal was complete Since I couldn’t bring it home the same day they had it transported to a Bankston dealer closer to me. Our salesman was Kevin and he always kept us updated on what was going on and the status of the paperwork, he is super respectful and knowledgeable and walked me and my family around the RV as many times as we wanted until we felt familiar with the use of the RV. Thank you Bankston Rv of Florence and a special Thank You to Kevin Jeffreys It was a pleasure doing business with you!", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "100036179889032845238", "name": "Last Chance", "time": 1538009823696, "rating": 1.0, "text": "A 2nd chance for this company was purely a waste. I brought my travel trailer to them for a possible trade. The sales man looked at it, then sent paperwork to the Nashville office to be appraised; new rules he said. Not sure how someone 2 hours away can properly appraise a trailer, but I went with it.\n\nMy trailer is listed on the internet in a thousand places, but because the \"sales mgr\" couldn't find it in his little book, he refused to give me a price for it. It's made by Forrest River, you know those folks... The biggest RV manufacturer in the world! The sales person said he would call me in a few minutes, because he would get it worked out. 24 hours later... Not a peep.\n\nAside from the blaring heavy metal music coming from the shop, the sales staff is clueless. This is my 2nd attempt to work with these folks. They lost my business the first time based on stock and pricing. There will not be a 3rd attempt. I didn't understand how they stayed in business, until I saw their $110 labor rate posted on the door....", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "105026534760751416506", "name": "JD Woodard", "time": 1462048014374, "rating": 1.0, "text": "Awful. Told Joe Gervais I was interested in looking at two different campers. Waited while he text on his phone. Told him again I would like to look at the two campers, both were locked. Asked about pamphlets for the two. He went inside and came back with a pamphlet. Never offered to open either. Didn't seem interested in selling anything or doing much. Much different experience at the Huntsville store yesterday. Mr. Bankston was extremely helpful.", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "110283657976221183329", "name": "Alex Brakeman", "time": 1491198827569, "rating": 5.0, "text": "Great place if youre in the market for a camper! The salesman is top notch and will make sure you leave happy!", "pics": null, "resp": {"time": 1491238856357, "text": "Thank you for your kind words and five star rating!"}, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "111517222751142125294", "name": "Adam Abernathy", "time": 1535489500231, "rating": 5.0, "text": "Very friendly and helpful in my search of a RV that I unfortunately was not able to purchase due to my personal financial situation. Definately the best place in florence for your rv service and accessories.", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "107102821409755736947", "name": "Howard Phillips", "time": 1535603207673, "rating": 2.0, "text": "Very frustrated!,  Went into Florence store last Sat, 1 employee, No time to help, Went to Hunts store, No help, went back to Hunts store today to get no help, Left and thought well what about the Ardmore store, Older guy eager to help, Nobody had info to give him for the 5er I was looking at. Needless to say, I went elsewhere and will not waste my time here again.", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "111692470721255927679", "name": "Derrick Kelley", "time": 1562817320409, "rating": 5.0, "text": "Great place to buy a new or used RV", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "115992245805702804572", "name": "Eleanor", "time": 1498584410477, "rating": 4.0, "text": "Not a lot of variety mostly travel trailer. Didn't see even a fifth wheel as alternative. Parts and services was great.", "pics": null, "resp": {"time": 1522421535078, "text": "Eleanor we appreciate your taking time to leave a review- we have the largest selection of new RVs in the Southeast region (over 500 new in stock right now)...but we don't keep them all in Florence.  Kevin in Florence is always glad to help with that process if you see something at another location that might interest you.  Either way, thank you for stopping by the Florence store."}, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "111937308011564863991", "name": "Debbie Bennett", "time": 1573841251825, "rating": 1.0, "text": "Couldnt help us sent us on our way to another place", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "116925752362484409302", "name": "Anthony Sparks", "time": 1562364303051, "rating": 3.0, "text": "Not the friendliest people but they're close to home and know their stuff.", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "105666233058245569503", "name": "anthony givens", "time": 1551839090559, "rating": 3.0, "text": "They made me feel unnecessary.", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "114677443435493944111", "name": "Susan Arlene Moore", "time": 1551679352058, "rating": 3.0, "text": "Nice place to shop for a noble home", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "116252008228949183771", "name": "Frank Smith", "time": 1384456931221, "rating": 1.0, "text": "I made a phone call to Bankston Motor Homes on Florence Blvd last week to inquire a quote to fill my propane tank. I was told 89 cents a lbs and that I should have a 20 or 30 lbs tank on my RV. I should have known better than to choose Bankston at this time since the manager on the phone acted like it was such a hassle to give me the total price for both tanks. (After all the trouble he went through for the total.) I was told it was 19.28 for a 20lbs tank and 28.32 for a 30lbs tank. Which sounds reasonable, so I didn't bother to check anywhere else in town. When I arrived today, I was greeted by a professionally dressed man asking if I needed any help. I responded I need to get my propane tank filled and to get my brakes checked. I then pulled around to get my tank filled and was told it would be next week before they could get to my brakes. No big deal I thought. so I go inside to pay and the total came to 53 and some change. I confronted him about the quote I was gave over the phone and he immediately got defensive and started to explain why I was being charged more. Since I was interested in doing more business with them with my brake problem, you would assume that he would do what was necessary to make things right. He might have took a small loss on the propane but would have simply made it up in the outstanding labor charges. When you quote someone a price you stick with that price to make your customer feel valued. I really felt like I was nothing but in the way and a hassle to them as soon as I pulled onto the lot. Bankston Motor homes is less than a mile from my house. However I will make the drive to Coldwater RV center in Muscle shoals for any future service or maintenance I need for my RV. Last time I was there before I made my RV purchase they were very helpful and took the time that was needed to explain to me the different types of water systems I Inquired about and what would better suit my needs. I would not advise ANYONE to go with Bankston Motor Homes unless you enjoy being treated like a dog.", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "113329676645449468789", "name": "Debbie Page", "time": 1525494715015, "rating": 5.0, "text": "Informative, helpful. Good experience.", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "103546011751460163970", "name": "R Dayton", "time": 1564575225918, "rating": 3.0, "text": "Expensive parts", "pics": null, "resp": null, "gmap_id": "0x887d35897810c525:0xc1d38f9676c91474"}
{"user_id": "105666233058245569503", "name": "anthony givens", "time": 1572788778359, "rating": 5.0, "text": "Very helpful and knowledgeable about anything concerning campers and RVs.", "pics": null, "resp": null, "gmap_id": "0x8862c9bf2348648b:0xd1887431845c007c"}
{"user_id": "104368305933573954415", "name": "ricky gargis", "time": 1523718118023, "rating": 5.0, "text": "I purchase my rv from Roger Hensley. He has always treated me right. When i run into any problem big or small he has always been there to help. I got my rv 3 years ago and he still treats me as I'm new customer. Great prices also without the big mark up.", "pics": null, "resp": null, "gmap_id": "0x8862c9bf2348648b:0xd1887431845c007c"}
{"user_id": "106461584983673619550", "name": "Rhonda Neal", "time": 1507313067480, "rating": 5.0, "text": "Very helpful and friendly service", "pics": null, "resp": null, "gmap_id": "0x8862c9bf2348648b:0xd1887431845c007c"}
{"user_id": "102114045737440943597", "name": "Bill Willis", "time": 1466687725865, "rating": 5.0, "text": "Helpful and affordable service.", "pics": null, "resp": null, "gmap_id": "0x8862c9bf2348648b:0xd1887431845c007c"}
{"user_id": "118362954695043675825", "name": "Gabe", "time": 1616988638328, "rating": 5.0, "text": "My grandparents and I have stayed here two time. Mr. Joe and Mrs. Angie are very kind! Very quiet place. If you plan on coming to this area, stay here. You wont regret it!", "pics": null, "resp": null, "gmap_id": "0x889ae89d791cc1ad:0xe9beaba5beb38464"}
{"user_id": "105592559114859472275", "name": "Carolyn Holt", "time": 1522285349509, "rating": 5.0, "text": "Bates Creek Rv Park is a wonderful place to stay if you are in the area. It has several rv spots which include wifi. This quaint spot is in the country but close enough to stores that it wont take you 5 min to get to town. This rv park also has cabins for rent for very affordable prices. Cabins include wifi and satelight tv. They can include 1 or 2 beds. The 1 bed cabins include a couch and coffee table. The standard micro wave and dorm fridge are also included. There is enough space to really make it a roomy place. Each cabin also has added boot brush to help clean your boots from a hard days work. I love this place and will stay here every time we are this way. Mr Joe, the manager, is friendly and ensures everyone is safe and made welcome here. Ms Angie is one of the sweetest people ive ever had the pleasure of meeting. She will make sure your stay is pleasant and comfortable. For me, this is my new home away from home.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOKFcnFgrj4EVZ2Mlt1Wk_fZxsXjq2W1ZphhdnO=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889ae89d791cc1ad:0xe9beaba5beb38464"}
{"user_id": "106142914236596045433", "name": "Heather Church", "time": 1587860359511, "rating": 5.0, "text": "Great place! My husband, 3 yr old son and i stayed here a year ago and are back again now. Here for about a month each time and as of right now still have had no problems. People running the place are great, very friendly and helpful, genuinely just good people. The cabins are affordable, clean, well taken care of, there is a trailer set up with 2 washers & dryers so laundry is easy... The only drawback id say is that there's no bathtub, only a shower. Not an issue for me but makes life just a little bit more difficult with my toddler.", "pics": null, "resp": null, "gmap_id": "0x889ae89d791cc1ad:0xe9beaba5beb38464"}
{"user_id": "102850357150554017366", "name": "Paula Campbell", "time": 1574132403537, "rating": 5.0, "text": "Angie answered all our questions . She was very pleasant and helpful. We would definitely stay at Bates Creek RV park.", "pics": null, "resp": null, "gmap_id": "0x889ae89d791cc1ad:0xe9beaba5beb38464"}
{"user_id": "106900786808451333217", "name": "Rude Less", "time": 1523816896141, "rating": 5.0, "text": "Wonderful place to be. Great service.\nVery clean and well maintained.\nThe management is delightful.\nIt is a home away from home.\nI would definitely come back here.", "pics": null, "resp": null, "gmap_id": "0x889ae89d791cc1ad:0xe9beaba5beb38464"}
{"user_id": "107806800006463608457", "name": "Tiffany Martinez", "time": 1477756997816, "rating": 5.0, "text": "They are very friendly good place if you have children. Very trustworthy owners. If we should ever be back in Alabama..they have our business.", "pics": null, "resp": null, "gmap_id": "0x889ae89d791cc1ad:0xe9beaba5beb38464"}
{"user_id": "118063549486185073036", "name": "Chris Masters", "time": 1464269704284, "rating": 5.0, "text": "Nice, clean, park. Doug and Lisa are great hosts. Women can feel safe when husband's are working. No riff-raff trash walking around at night.No dogs running around barking either.Great place for construction workers.", "pics": null, "resp": null, "gmap_id": "0x889ae89d791cc1ad:0xe9beaba5beb38464"}
{"user_id": "113623496902160029513", "name": "Betsy Bryan", "time": 1524349763370, "rating": 3.0, "text": "Clean and pretty quiet. Small cabins but definitely functional. I would stay there again for sure.", "pics": null, "resp": null, "gmap_id": "0x889ae89d791cc1ad:0xe9beaba5beb38464"}
{"user_id": "108100537246684975844", "name": "Reginald Eatmon", "time": 1478007044438, "rating": 5.0, "text": "Nice and affordable when your on the road working. Great environment and greatly on propert.", "pics": null, "resp": null, "gmap_id": "0x889ae89d791cc1ad:0xe9beaba5beb38464"}
{"user_id": "100270735097907309207", "name": "doug mckinney", "time": 1462717290575, "rating": 4.0, "text": "After 4 months of managing the Bates Creek RV park we have added 15 cabins and RVs for rental along with the RV lots. Several lots are drive thru for our overnight and weekend guest and they all have the 20,30 and 50 amp electrical plugins. Water and ez connect waste. TV WIFI. Being located on highway 43 makes us ez to find and our 2 entrances for North or South travel makes your everyday travel more pleasurable. You can see us Facebook or overhead satellite views on goggle, my Red cabin also is being featured at the lucky duck RV park site and we welcome our friends and guest from our time managing the former Bates Lake park as well. We have good clean shady lots and our oceanless beach front property for parties,sunbathing and just walking around the 63 acres or by the creek.\nThanks and come on down.", "pics": null, "resp": null, "gmap_id": "0x889ae89d791cc1ad:0xe9beaba5beb38464"}
{"user_id": "106300355402292957082", "name": "Sylvie Horgan", "time": 1533229551463, "rating": 5.0, "text": "Love this place and Joe the manager is so kind", "pics": null, "resp": null, "gmap_id": "0x889ae89d791cc1ad:0xe9beaba5beb38464"}
{"user_id": "100204569599121118852", "name": "captainkitty133 poop", "time": 1475274384573, "rating": 4.0, "text": "It clean safe quite,and very friendy owners.", "pics": null, "resp": null, "gmap_id": "0x889ae89d791cc1ad:0xe9beaba5beb38464"}
{"user_id": "113222187731086354499", "name": "Leonicio Castaneda", "time": 1522127811065, "rating": 5.0, "text": "Very clean cabins, very very clean campgrounds and very affordable.", "pics": null, "resp": null, "gmap_id": "0x889ae89d791cc1ad:0xe9beaba5beb38464"}
{"user_id": "117737066248196983634", "name": "Bobby", "time": 1538969740533, "rating": 2.0, "text": "Just visited it's ok for work!", "pics": null, "resp": null, "gmap_id": "0x889ae89d791cc1ad:0xe9beaba5beb38464"}
{"user_id": "104186857667142205186", "name": "Abu Anas", "time": 1570831151073, "rating": 3.0, "text": "Really scary place", "pics": null, "resp": null, "gmap_id": "0x889ae89d791cc1ad:0xe9beaba5beb38464"}
{"user_id": "104851571964677440363", "name": "Cade Bunch", "time": 1511191449510, "rating": 5.0, "text": "It a great place", "pics": null, "resp": null, "gmap_id": "0x889ae89d791cc1ad:0xe9beaba5beb38464"}
