{"user_id": "104218030615327480441", "name": "Don Petry", "time": 1597544398730, "rating": 4.0, "text": "Two large WastePro containers are provided. They are labeled as if they accept accept paper, plastic, cardboard, and aluminum cans in the same container. I am not aware of a single-stream recycling center in the area so I wonder what happens to these items...?", "pics": null, "resp": null, "gmap_id": "0x88893da36c202259:0xba68d6987a94959d"}
{"user_id": "113116081161686819192", "name": "Jamie Goodwin", "time": 1621518822255, "rating": 1.0, "text": "I paid for a dumpster to be delivered and was told it would be delivered the next day and it wasn’t. I had to call them to see why it wasn’t delivered and was told it would be deliver by 6:30am today and it’s 8:53 am and I still haven’t gotten what I’ve paid for. The dispatch lady was very rude. Poor service all together!!", "pics": null, "resp": null, "gmap_id": "0x8886021150484d91:0x6b3c233cff935b4a"}
{"user_id": "108022237833842978191", "name": "PATTY BANKS", "time": 1602269673442, "rating": 5.0, "text": "I'm with the Glass Doctor of Tuscaloosa and use Rumsey for our dumpster service. It is so nice to call and actually speak to someone whom by the way is always so friendly and helpful. If they say they are going to do something... they do! We have had to ask for extra pick-ups on occasion and they have always sent a truck promptly. Great service", "pics": null, "resp": null, "gmap_id": "0x8886021150484d91:0x6b3c233cff935b4a"}
{"user_id": "111744055354696513963", "name": "Harley Ryland", "time": 1617825839765, "rating": 5.0, "text": "Good place. Nice guys.", "pics": null, "resp": null, "gmap_id": "0x8886021150484d91:0x6b3c233cff935b4a"}
{"user_id": "111137083430500415622", "name": "Jen Miles", "time": 1584995324906, "rating": 1.0, "text": "This company violates all city ordinances and are the most unprofessional people, company and services I have ever experienced. I am not a person that posts on reviews at all, this however, is warranted.\n\nThis company is supposed to pick up our complex’s garbage after 6 am in the morning. To not ramble, the management team has called and emailed this company over the past year about correcting this. My husband and I work and their trucks continuously come between 2:15 - 4:15 am. They are in violating many ordinances and their contract is going to keep going for a bit more. Nothing more to do but post this in essence to warn people of their continuing incompetence and no regard for residents, bylaws and contractual agreements.", "pics": null, "resp": null, "gmap_id": "0x8886021150484d91:0x6b3c233cff935b4a"}
{"user_id": "110473114467141862337", "name": "Eve Engle", "time": 1576530620630, "rating": 2.0, "text": "I have rented from Rumsey twice. The first time they did not give me a specific day/time of when they would retrieve my rental. They did show up, but several days later. I finally called because I was worried they would charge me extra. This time they came before 8am and I had not been notified to be there to unlock my gates. I live an hour away. I was told they would have to charge me $125 extra to come back. I waited around all day, finally to be told I would have to return the next day to let them in. I am disgusted. I do not recommend this company.", "pics": null, "resp": null, "gmap_id": "0x8886021150484d91:0x6b3c233cff935b4a"}
{"user_id": "116629408975718600223", "name": "Samantha Dorough", "time": 1580326883310, "rating": 5.0, "text": "Been working together with their staff for over a decade. The staff is always professional and helpful in any way.", "pics": null, "resp": null, "gmap_id": "0x8886021150484d91:0x6b3c233cff935b4a"}
{"user_id": "115462574443259211535", "name": "Lela Collum", "time": 1599248312841, "rating": 1.0, "text": "Followed one of their trucks down highway 72 west for over 15 miles to Barton Al where they went towards the tissue plant. This truck had a large dumpster on the back and paper flew out  the entire time down the road. Some “environmental service “", "pics": null, "resp": null, "gmap_id": "0x8886021150484d91:0x6b3c233cff935b4a"}
{"user_id": "103011183537943966705", "name": "Chintan Patel", "time": 1564073501731, "rating": 1.0, "text": "Bad customer service. Dumpster was not delivered even after 3 days of told delivery date. Then they don't update you the status and then if you call them and tell them about it, they start crying and they are asking their customers to apologise for it.\n\nIt was your fault , you don't deliver the dumpster and you don't even call the customer and give update about the delivery date. And then you ask the customer for apologizing if they get angry\n\nMy friend I think customer service is an important word you are missing out .", "pics": null, "resp": null, "gmap_id": "0x8886021150484d91:0x6b3c233cff935b4a"}
{"user_id": "105151854562162134436", "name": "Debbie Long", "time": 1523467128963, "rating": 1.0, "text": "Very rude employees, very overpriced.  Quoted 700.00 charged almost 1000.00. Delivered with a male private part on the side and did not even care to clean it off. When we complained about the problems was told to shut up and was hang up on.  This is after we paid of course.", "pics": null, "resp": null, "gmap_id": "0x8886021150484d91:0x6b3c233cff935b4a"}
{"user_id": "101954745255819291770", "name": "Tamer Eltibi", "time": 1558884381099, "rating": 1.0, "text": "3 weeks no show up to empty the garage\nEvery time i call they are rude and they will say we will send someone and again no one show up !!!!!", "pics": null, "resp": null, "gmap_id": "0x8886021150484d91:0x6b3c233cff935b4a"}
{"user_id": "108518191114799084147", "name": "Trena Wise", "time": 1402325652444, "rating": 1.0, "text": "Just a warning to anyone needing a residential dumpster. Rumsey will deliver the dumpster to your house. You pay for 10 days and they will mention that you can keep it longer if needed but they will fail to tell you that they may pick up at 7 am on the 10th day regardless of the time it was dropped off. You MUST call them in advance if you want to keep it longer. They will not call you or tell you the time frame that they pickup so if your pickup date is a Monday,  better call them the prior week to schedule a longer drop off time if you need more time.\n\nI received zero use out of my dumpster and thought I could call first thing Monday morning to have it scheduled longer but was told that it had been picked up at 7 am, didn't even get a full 10 day use out of it and spent almost $400.00. I would have been better off burning my $400.00. If you want to use their service, better make sure you ask the date of pickup and the time frame so you can make a decision if you want to keep it longer as they have very poor communication.", "pics": null, "resp": null, "gmap_id": "0x8886021150484d91:0x6b3c233cff935b4a"}
{"user_id": "103508138928906041353", "name": "El Chechito", "time": 1575386344720, "rating": 1.0, "text": "Late pulls , bad service.", "pics": null, "resp": null, "gmap_id": "0x8886021150484d91:0x6b3c233cff935b4a"}
{"user_id": "105439697613718313343", "name": "Shawn Williams", "time": 1562374679029, "rating": 1.0, "text": "Terrible place to work!", "pics": null, "resp": null, "gmap_id": "0x8886021150484d91:0x6b3c233cff935b4a"}
{"user_id": "102832384538701300793", "name": "Regional Homes of Northport", "time": 1560539242403, "rating": 5.0, "text": "Fast service on dumping containers!", "pics": null, "resp": null, "gmap_id": "0x8886021150484d91:0x6b3c233cff935b4a"}
