{"user_id": "105473616126193358360", "name": "Erica Thomas", "time": 1627785006948, "rating": 5.0, "text": "Superior service. True to its name. Sand’s services are truly a blessing! My health as been restored. Thanks to her wholistic services my future is bright. My physical confidence is regained", "pics": null, "resp": {"time": 1628606998870, "text": "It is so wonderful to see your kind words. Please make sure to call me whenever you need that extra little oomph to your day so we can keep you at your best. Serving you was a blessing in and of itself!"}, "gmap_id": "0x888c93124a2470d1:0x1fde73139a3a9402"}
{"user_id": "111425541713215388814", "name": "Jeanne Estrada", "time": 1628281795797, "rating": 5.0, "text": "Sand is an amazing massage therapist!!! She is extremely professional, and always leaves me feeling so much better than when I arrive.\n\nShe is the best!!", "pics": null, "resp": {"time": 1628609787160, "text": "Your kind words give me strength. I was taught to treat others the way one wants to be treated. To have you leave in better shape than you arrived is one goal I am elated to see has been attained. Thank you, Jeanne, for choosing me for you are the best!"}, "gmap_id": "0x888c93124a2470d1:0x1fde73139a3a9402"}
{"user_id": "108425447098475828196", "name": "S TOLBERT", "time": 1622293643339, "rating": 5.0, "text": "Sand is a true professional. I am amazed my pain was alleviated after my first visit. I will definitely be going back.", "pics": null, "resp": null, "gmap_id": "0x888c93124a2470d1:0x1fde73139a3a9402"}
{"user_id": "103172525201973491945", "name": "Miranda Erwin", "time": 1611166323130, "rating": 5.0, "text": "Hello Sand,\nI would like to come back to see you soon. Start coming weekly...\n\nI'm so sorry if my mouth 👄 nerves couldn't stop talking last time. I know everyone isn't like me just blurt everything out... Geesh!\n\nPlease forgive me if I offended you or upset you with my feelings...\n\nI do know I need someone to work on myself my legs, feet horrible shape n pain.\n\nSand- you are not only smart wise and talented. You have infinitely more experience in massage nursing nutrition than most \"\nDoctors \" and certainly beyond more knowledge than just a massage therapist.\n\nPlus you're a Beautiful Mom I adore 🥰", "pics": null, "resp": null, "gmap_id": "0x888c93124a2470d1:0x1fde73139a3a9402"}
{"user_id": "116225922303165693814", "name": "Julaine Fowlin", "time": 1612571452189, "rating": 5.0, "text": "Sand was amazing, the best massage I have ever received she is knowledgeable and her expertise is excellent.  I love that she is also a RN.", "pics": null, "resp": null, "gmap_id": "0x888c93124a2470d1:0x1fde73139a3a9402"}
{"user_id": "112402841415198551114", "name": "Tywanna Lewis", "time": 1592002385354, "rating": 5.0, "text": "Extraordinary Service! I would highly recommend Restoration Mind Body and Sole! Sand is highly certified and she does an Excellent job of restoring the body! Great customer service all the way around, you will not be disappointed!", "pics": null, "resp": {"time": 1592167431959, "text": "Thank you for your kind words. We always strive to do our best for our clients. We are ecstatic you chose us to help you jump start your journey to a better, healthier you!"}, "gmap_id": "0x888c93124a2470d1:0x1fde73139a3a9402"}
{"user_id": "117236693414629268786", "name": "Marty Moore", "time": 1590846682828, "rating": 5.0, "text": "Sand has been my massage therapist for 10 yrs and I could not be happier.  Not only is Sand a great masseuse, but she is an RN who has taken her medical knowledge, and healing qualities to another level.  Opening Restoration Mind Body and Sole was the best decision she ever made, allowing her to completely immerse her mind and soul into treating and creating life changing treatment options for the patients that walk through  her doors.\n\nYesterday she did a lymphatic massage followed by a foot detox to rid my body of all the toxins hat have accumulated for years .  She did this same detox last week and I was overwhelmed and amazed at the results of that initial treatment and the toxins that were extracted from my body.  I simply couldn’t believe what I saw.  That prompted me booking the massage and another foot detox yesterday.\n\nOne thing I immediately noticed when the detox was through was less pain in my joints, hands, and feet.   I especially noticed less tightness in my hands.  One thing she explained to me is that detox draws out all the toxins and inflammations from throughout the body - especially liver and joints .  Inflammation is the culprit of swelling and pain in arthritis.  I felt so much better all week.\n\nYesterday’s appointment   left me more relaxed and destressed than I’ve been in months.  No tension , aches or stress.  Totally peaceful. These two visits have shown me enough about my body and the things we absorb to make me more conscious of taking care of it and treating it better.   I’m certainly not getting any younger .  I am so impressed with these results, that Ive decided to have the colonic cleanse to completely clean out my system and take better control of my health.\n\nThis is a wonderful place, owned by a wonderful person who clearly loves her patients and what she does to help them stay healthy.   The fact that she is an RN is an extra bonus bc she knows the body so well.\n\nPlease give them a call and book your appointment now!", "pics": null, "resp": null, "gmap_id": "0x888c93124a2470d1:0x1fde73139a3a9402"}
{"user_id": "100287098702146280793", "name": "Cat T", "time": 1579213493811, "rating": 5.0, "text": "I never thought I would get my body back Into alignment until I met Sand.  She has done amazing things to my body.  I have had two major knee surgeries and have extensive back and hip issues.  Sand has given me so much relief.   I have added her and her magical h.g.h and as part of my life.", "pics": null, "resp": null, "gmap_id": "0x888c93124a2470d1:0x1fde73139a3a9402"}
{"user_id": "117987967426491407008", "name": "Kishina J", "time": 1578170425547, "rating": 5.0, "text": "I enjoy every visit.  She's very professional and educated on the mind and body. I will recommend to anyone", "pics": null, "resp": null, "gmap_id": "0x888c93124a2470d1:0x1fde73139a3a9402"}
{"user_id": "108367358353215775864", "name": "Sandy Baxley", "time": 1578946715824, "rating": 5.0, "text": "Sand is the most knowledgeable and proficient masseuse I've ever been to. She knows where your body needs the most attention and the fact that she's a RN makes me feel very confident in her skill", "pics": null, "resp": null, "gmap_id": "0x888c93124a2470d1:0x1fde73139a3a9402"}
{"user_id": "110948702267303812061", "name": "Bob Mann", "time": 1578597861993, "rating": 5.0, "text": "Casandra is very professional and knowledgeable. I would recommend her to anyone seeking alternative medical practices.", "pics": null, "resp": null, "gmap_id": "0x888c93124a2470d1:0x1fde73139a3a9402"}
{"user_id": "100639009066804396603", "name": "Purcy Asinga", "time": 1580887678870, "rating": 5.0, "text": "Sand is awesome great therapist very knowledgable great service n she gives you great advice on how to improve your health\nGreat job Sand", "pics": null, "resp": null, "gmap_id": "0x888c93124a2470d1:0x1fde73139a3a9402"}
{"user_id": "106700519211498313805", "name": "lance ingold", "time": 1578948030367, "rating": 5.0, "text": "the best massage ever tks will be back soon", "pics": null, "resp": null, "gmap_id": "0x888c93124a2470d1:0x1fde73139a3a9402"}
{"user_id": "118325674715462989507", "name": "Carrie Perry", "time": 1596756285500, "rating": 5.0, "text": "Excellent massage by a skilled professional in a safe, clean, and relaxing environment. I will go back again and again.", "pics": null, "resp": null, "gmap_id": "0x889a6de068f23bab:0xbf0f5876b1f93c73"}
{"user_id": "118088490754250322645", "name": "Kenny Cowart", "time": 1500758451434, "rating": 5.0, "text": "The best  in the business\n\nI have had many massages in the past but when I receive a massage from Pimnara she  is very professional and went straight to the problem using all of her techniques and relieved all my pain l feel much better now than ever before, I recommend Pimnara to all of my family and friends", "pics": null, "resp": null, "gmap_id": "0x889a6de068f23bab:0xbf0f5876b1f93c73"}
{"user_id": "106596664635213711037", "name": "kris boddicker", "time": 1627180423844, "rating": 5.0, "text": "Nice people. Relaxing atmosphere. Will come back.", "pics": null, "resp": null, "gmap_id": "0x88623937871fdd07:0xe48164013d1b2db7"}
{"user_id": "100036053899466521185", "name": "Kathleen Jackson", "time": 1618569414348, "rating": 5.0, "text": "Amazing amazing and AMAZING I can't wait to go back awesome for people who suffer from neck and back pain", "pics": null, "resp": {"time": 1618845199598, "text": "We really appreciate that feedback."}, "gmap_id": "0x88623937871fdd07:0xe48164013d1b2db7"}
{"user_id": "115783828497122527480", "name": "Kenny Duckett", "time": 1605986011614, "rating": 5.0, "text": "Best massage I ever been to and the only one I will ever go", "pics": null, "resp": {"time": 1618845193016, "text": "We really appreciate those kind words! Thank you!"}, "gmap_id": "0x88623937871fdd07:0xe48164013d1b2db7"}
{"user_id": "113665206978458341318", "name": "Ruth Lu", "time": 1573959478933, "rating": 5.0, "text": "I did the massage today for my shoulder pain and lower back pain. They provided a very good service. After an hour massage, I felt sooooo relaxed. My daughter also did the message and she loves the hot stones. HIghly recommend this place.", "pics": null, "resp": null, "gmap_id": "0x88623937871fdd07:0xe48164013d1b2db7"}
{"user_id": "117440519863517943659", "name": "Alley", "time": 1548362602729, "rating": 5.0, "text": "It was great!  The hot stones were awesome.  Nice,  quite and clean place. She gave an excellent massage. Recommended! Thank you!", "pics": null, "resp": null, "gmap_id": "0x88623937871fdd07:0xe48164013d1b2db7"}
{"user_id": "104100124821954683820", "name": "Tami Newcomb", "time": 1567533211170, "rating": 5.0, "text": "I'm thrilled with the massage I NEEDED today for lower back pain. Although they were somewhat busy, they were able to take me as a walk-in right away for an hour massage!  Woo hoo!  The hot stones were an amazing surprise as was the complimentary bottle of water as I was leaving.  I love this place!  They offer soooo many services, too.", "pics": null, "resp": null, "gmap_id": "0x88623937871fdd07:0xe48164013d1b2db7"}
{"user_id": "110718414573292198249", "name": "Elizabeth Bowles", "time": 1571940768477, "rating": 1.0, "text": "Did not get a good massage the other day from the Male that works there so I called today to make an appointment with a female. They said okay, no problem. I get there a few minutes before my appointment time and they confirmed \"you want a female, right?\" I told them yes and then they said they couldnt do my appointment time. Very dissatisfied with this. Will not be going back.", "pics": null, "resp": null, "gmap_id": "0x88623937871fdd07:0xe48164013d1b2db7"}
{"user_id": "106786700266167435693", "name": "Mike Morris", "time": 1561325629970, "rating": 5.0, "text": "Great massage. Was great at working on problem areas. Very warm and friendly.", "pics": null, "resp": null, "gmap_id": "0x88623937871fdd07:0xe48164013d1b2db7"}
{"user_id": "110602284738003656933", "name": "steven chamberlain", "time": 1563135556769, "rating": 5.0, "text": "They do a good job and you actually get a 60 minute massage when you pay for an hour.", "pics": null, "resp": null, "gmap_id": "0x88623937871fdd07:0xe48164013d1b2db7"}
{"user_id": "111621995931802610067", "name": "jess mathis", "time": 1562699816745, "rating": 5.0, "text": "I always received nice customer service and they do a good job.", "pics": null, "resp": null, "gmap_id": "0x88623937871fdd07:0xe48164013d1b2db7"}
{"user_id": "111538996479621250639", "name": "Kim Steakley", "time": 1556379595147, "rating": 5.0, "text": "Clean,quite and get full attention to address your needs!", "pics": null, "resp": null, "gmap_id": "0x88623937871fdd07:0xe48164013d1b2db7"}
{"user_id": "102313763455952326307", "name": "Cin Drake", "time": 1550590484361, "rating": 1.0, "text": "you all need to call me I am in pain due to your male person who gave me a massage", "pics": null, "resp": null, "gmap_id": "0x88623937871fdd07:0xe48164013d1b2db7"}
{"user_id": "101105021500796897381", "name": "Jennifer Hunt", "time": 1545709640615, "rating": 5.0, "text": "Most amazing couple's massage that my husband and I have ever had!!!!! Highly recommend!!!!", "pics": null, "resp": null, "gmap_id": "0x88623937871fdd07:0xe48164013d1b2db7"}
{"user_id": "109999657419468238239", "name": "J C", "time": 1574448946382, "rating": 1.0, "text": "This business has been recently closed.", "pics": null, "resp": null, "gmap_id": "0x88623937871fdd07:0xe48164013d1b2db7"}
{"user_id": "110226696337055268857", "name": "Sabas Ck", "time": 1550671148536, "rating": 5.0, "text": "Clean and nice stuff", "pics": null, "resp": null, "gmap_id": "0x88623937871fdd07:0xe48164013d1b2db7"}
{"user_id": "116285228200825429462", "name": "Sabasi Kimaro", "time": 1550361324615, "rating": 4.0, "text": "Liked it", "pics": null, "resp": null, "gmap_id": "0x88623937871fdd07:0xe48164013d1b2db7"}
{"user_id": "111116938895707818024", "name": "Jarrod Smallwood", "time": 1628089505463, "rating": 4.0, "text": "Very nice massage, scheduling is a problem as I have consistently arrived at scheduled appointment and told they are very busy that it will be a later appointment time.. But, when you get in the massage is great!!", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "113661817999428310214", "name": "Shakeria", "time": 1613362949716, "rating": 4.0, "text": "I'm from Birmingham, al and every time I come to Huntsville I go here to get a massage. They're professional, kind, and I LOVE that they don't beg for a tip which makes customers feel more comfortable to give one.\n\nPro: is that you free hot stone included. Get techniques from the therapist. Will work longer on areas that you specify.\n\nCon: sometimes they get the stones when the session is almost over so you don't really get to enjoy it as much. I would work on that consistency if I had to provide any feedback.", "pics": null, "resp": {"time": 1613689031860, "text": "Dear Shakeria, thank you very much for your comments and suggestions. Next time if you come here, you can ask the masseurs first if you have any requirements, including the hot stones that stay longer. They will do it the way you like.  , Try to achieve your satisfaction and look forward to your next visit!"}, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "108838294777568529591", "name": "CJ Donovan", "time": 1623455913887, "rating": 5.0, "text": "This was my first massage and I wish I caught the lady’s name she was wonderful. I will be going again soon.", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "100169918371893816447", "name": "Veronica Villa", "time": 1602125335634, "rating": 5.0, "text": "I have experienced the best message in town. Your knowledge of the oils as well as the ability to respond to my personal tensions and strains is exceptional! Will definitely come back. Thank you!", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "103066076422698975422", "name": "Abigail Morey", "time": 1602127441892, "rating": 5.0, "text": "One of the best massages I have ever had! Remarkable and very enjoyable. Came in feeling stressed and left feeling relaxed and happy! Thank you thank you!", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "117705950553304109049", "name": "Michael Lee", "time": 1602124733679, "rating": 5.0, "text": "I had a wonderful massage here in Rose Massage. It was very relaxing, really helped my back pain. Have booked a full session and looking forward to it. :)", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "110890066684195266828", "name": "Terrell Nixon", "time": 1580482509817, "rating": 4.0, "text": "My neck and back hurt so was looking to get it worked out.  Was a little skeptical after reading some of the reviews but thought would give it a try.\n\nI was pleasantly surprised.  I called.to make a appt for a other day as it was late.  They said they had a table open so I went on in.  The place is in a small strip mall but most of them here in Huntsville are.  Once you get inside looks like most small massage places.  I have included a few pictures from their website as they are accurate of what you actually see.\n\nThe lady was very nice and very professional.  She gave me a very relaxing massage.  I would have like a little more work on my neck but I did say anything as I wanted to just see what was their normal.  Only other improvement I can think of is she did not do the front of my legs at all.  Since I do alot of lifting and crawling around that is always a sore spot.  But over all I left feeling very relaxed.\n\nI did opt for the shower table as some recommended to get the oil off.  Again very professional and make sure \"everything\" that needed to be covered stayed covered.  Thought it might be awkward but the way she did it made it feel very professional so really did not even think about it.\n\nThe only real negative I can say is the same as of other peoples reviews.  They leave the door slightly open so anyone walking by can see in.  I understand from a security view but the walls are paper thin (like most every other place you get a massage) so you can hear everything so I do not really see that the pros outway the cons for doing this.  I could not really relax and although I really like this place it was the reason for 4 stars vs 5 stars.  It also would be the one thing that made me look somewhere else ☹.\n\nAlso one note since it came up in some of the other reviews.  No one pressured or even asked me for a tip.  I did give her one as she did a good job but she never asked.  The only thing they asked was if I would like a 4 hand massage (I only booked a 60 min) and when I said not tonight that was that.\n\nOver all a great place and so far I recommend it for a great relaxing massage if you dont mind everyone that walks by your door seeing in 🧐.\n\nWill update if I go back.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOA1FbHtCamDoFPPdQMGkYztFVFx2ThZNK83lYB=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPzJSml9LE8V6WWeNTZyOMMsnBursNL_BGv5fqt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMNHV4HZpfhPDmPBQ9S1sMAcpQGLrFHWfO65-f7=w150-h150-k-no-p"]}], "resp": {"time": 1590289416354, "text": "Hello, Terrell. Thank you for giving us the opportunity and we are glad you like our services. We keep improving our management and services base on our customers' feedbacks. Thank you for your business and hope to see you soon."}, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "113848142815553842767", "name": "andrew ausin", "time": 1600109087914, "rating": 5.0, "text": "Always very nice and courteous, I always call ahead and can get in same day. I’ve gotten the standard massage every time and they always help my back feel a lot better!", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "114489989722112835516", "name": "Jack Smith", "time": 1570119675842, "rating": 1.0, "text": "This was not a good experience at all. I thought I would give them a try. Opted for the 4 hand massage as it was supposed to be their best. The whole time door left open so one of the masseuse could go and deal with people coming in dealing with them at my door, and answer the phone. The 2 ladies talked the whole time to each other like gossiping, but couldn't understand them. The lady answering phone and stuff wasn't even in room half of the time. She finally just brought the phone in with us and just started answering it there. As I was leaving the girl giving the massage ask for tip. I thought well she did give pretty good massage herself and tipped her. Then she fussed saying it was 2 of them I needed to tip the other lady to! And kept insisting! I just left, $120 massage and $20 tip. Save your money and go elsewhere.", "pics": null, "resp": {"time": 1590272689788, "text": "Hello, Jack. Thank you for your feedback. We appreciate our customers' feedbacks because that’s how we can improve our management and services. We do have rules like no talking during massage sessions, no asking tip after services etc. We now have highly trained therapists and and we will prevent these happening again. Thank you. We try to create a relaxing and comfortable atmosphere for our customers. That’s how we gain so many loyal customers. Thank you."}, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "118105687681576768947", "name": "Prodigal Son", "time": 1596740360131, "rating": 1.0, "text": "Real bad experience I had with these people first I called 20 mins before coming in I was told to do so once I get to both locations they told me they made a mistake and that they were closed. BAD BUSINESS", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "114878690611147766973", "name": "Gary Counts", "time": 1547070213555, "rating": 5.0, "text": "This location bis conveniently located behind Whole Foods off Memorial Parkway.  They have a useful online web page for making appointments.  There wasn't any wait.  The quality of the service was quite high and they very generous with the time.  The price is reasonable and they off a hot towel after the massage.", "pics": null, "resp": {"time": 1556402224709, "text": "Dear customers, thank you very much for your feedback. We hope every customer will be satisfied with the service, hope to see you again"}, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "107588215146063683385", "name": "Cole Joe", "time": 1524527623238, "rating": 5.0, "text": "Great location! Love the new system with the iPad. Tranquility room is nice and I had the best massage of my life with Jesse! I needed to focus on my neck and shoulders and that's exactly what we did. Thoroughly enjoyed my visit and can't wait to come back", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "100688449388526103103", "name": "Rell Global", "time": 1598476760598, "rating": 1.0, "text": "I called to schedule an appointment over the phone a couple of times and got hung up on. I just asked if they take walk-ins..", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "117394848795114473365", "name": "Daniel Ramos", "time": 1567111630259, "rating": 5.0, "text": "Anna was amazing! I’ve already let her know I’ll be back shortly! Very professional and made me smile and relax!", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "101280566979106369866", "name": "Michael McCorvey", "time": 1544589469651, "rating": 5.0, "text": "Tonight was my first time going and it was great! My masseuse took care of my problem areas and made sure the experience was enjoyable the entire time. Definitely going back!", "pics": null, "resp": {"time": 1556402238182, "text": "Dear customers, thank you very much for your feedback. We hope every customer will be satisfied with the service, hope to see you again"}, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "116045986498584128866", "name": "Jersey Mara", "time": 1524526835635, "rating": 5.0, "text": "Just went today and the massage was great. They ask you if you have any areas that need to be focused on instead of giving you a basic massage. I highly recommend.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM1r1wfYbQgfQ0ogCML9SiNr21laOqiqfcofcrH=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "109460631276443145530", "name": "Een angle", "time": 1525836987111, "rating": 5.0, "text": "This place is a gem! I started going here after my spin instructor told me about this place.  I can get in almost immediately when I call.\n\nThey don't speak english very well but it doesn't matter.  They have a 60 min $60 special and you can't beat that.  The massage therapists always ask how much pressure you want, and if you want deep- some of them go DEEP... so make sure to let them know.\n\nI don't want to tell you who I request because you will steal them from me.... Okay... Hidy and Sheliy are who I really like.  I have used others and they are great too but these two really know how to get into my target areas.\n\nSide note: when they leave you alone for a few min don't get scared (I did the first time) but they are getting hot towel to remove the oil.  Just wait it out...\n\nEnjoy!!", "pics": null, "resp": {"time": 1527364835788, "text": "Thank you for your evaluation of rose massage. We will always provide the best Asian service for every customer."}, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "109393312889510791773", "name": "Gene Peppers", "time": 1568629813366, "rating": 5.0, "text": "Very nice people, Great Massage, Reasonable Prices", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "106360557388026069862", "name": "Mongo Slade", "time": 1580434494663, "rating": 4.0, "text": "Would give a 5 but begged for a higher tip", "pics": null, "resp": {"time": 1590291128348, "text": "Hello, Mongo. Thank you for your feedback. I am the manager of Rose Massage. We never allow therapists to ask for more tips and we will dismiss the therapists who get three warnings. We apologize for what happened. Thank you for your business. We now have well trained professional therapists will offer the best customer service!"}, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "108100791045573897721", "name": "Bill Collins", "time": 1536199981877, "rating": 1.0, "text": "Don't waste your time.", "pics": null, "resp": {"time": 1590289027977, "text": "Hello,Bill. Thank you for your feedback. We appreciate our customers' feedbacks because that’s how we can improve our management and services. Please let us know specific what was the wrong with your service. Feel Free to contact us anytime. Thank you."}, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "118059502858276407216", "name": "Joseph Kalsic", "time": 1565141352118, "rating": 5.0, "text": "Excellent and very professional.", "pics": null, "resp": null, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "113438411969094385186", "name": "T", "time": 1544560123938, "rating": 1.0, "text": "Rushed service....not going back", "pics": null, "resp": {"time": 1590289248106, "text": "Hello, dear customer. Thank you for your feedback. We keep improving our management and services base on the customers' feedback. In order to prevent rushed services, we time every customer's services to make sure there is no short for time. Thank you."}, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "104046406647023113419", "name": "Jeremy Alexander", "time": 1538413335790, "rating": 5.0, "text": "It was great!", "pics": null, "resp": {"time": 1556402248760, "text": "Dear customers, thank you very much for your feedback. We hope every customer will be satisfied with the service, hope to see you again"}, "gmap_id": "0x88626cb070f00001:0x576ef929a38e930d"}
{"user_id": "116305724751935170967", "name": "Marina Kubishta", "time": 1598731690501, "rating": 4.0, "text": "Located in Madison, Nature's Way Massage and Spa is tucked away in a quiet business complex.  The place smells wonderful, like relaxing aroma therapy oils.  The music was quiet, the room was dark, and the massage table heated (which was a new one for me....but welcomed).  Carolyn was very thorough in her massage, from my toes to my fingertips.  I got a wonderful deal on my massage, as well.", "pics": null, "resp": {"time": 1616755786435, "text": "Thank you for your kind words."}, "gmap_id": "0x88625c69ee264807:0x9f40c9cb7997e8c3"}
{"user_id": "118117909822491149582", "name": "Kesha Jones", "time": 1594411601460, "rating": 5.0, "text": "As I entered into the spa Mrs. Carolyn greeted  me at the door with her mask on and a smile and that made me feel very welcoming, she asked me the questions about Covid-19 before heading to the massage room. I received a deep tissue massage which was absolutely amazing!!!!! Mrs. Carolyn is not only professional (very good at what she does) she also has a great personality.\nTo be honest when we converse it definitely didn't seem like it was my first time meeting her.\n\nVery clean\nVery professional\nVery friendly\nI felt so relaxed and comfortable around her\nEnjoyed our converse\nI already have a second massage scheduled 😁", "pics": null, "resp": {"time": 1595699353110, "text": "HI Kesha, thank you for your wonderful testimonial. I am always 100% committed to providing excellent services in a safe comfortable environment. Please tell your friends and come see me again soon!"}, "gmap_id": "0x88625c69ee264807:0x9f40c9cb7997e8c3"}
{"user_id": "118375999718026182004", "name": "Sarah Willis", "time": 1594348603158, "rating": 5.0, "text": "Everything was clean and professional. She is following the recommendations regarding sanitation very strictly. I had a deep tissue, and she worked very hard to work through the areas that I have the most issues. Highly recommend. Also very reasonably priced.", "pics": null, "resp": {"time": 1595699280577, "text": "HI Sarah thanks so much for your kind words and review. I am committed to providing the best services in a safe comfortable environment. Glad it helped you. Come back again soon!"}, "gmap_id": "0x88625c69ee264807:0x9f40c9cb7997e8c3"}
{"user_id": "105997070190460222195", "name": "Marie Wynn", "time": 1575985140205, "rating": 4.0, "text": "First off I received an awesome massage! It helped my aches and pains and gave me great relief.  However at this moment, the directions on Google maps is wrong and the prices on the website are wrong. Be sure to ask if this makes a difference.  Actual address is 250 Sun Temple Dr., Madison", "pics": null, "resp": {"time": 1594340374079, "text": "Hi Marie, glad you enjoyed the massage. I have now fixed the address and issues you mentioned. You can see my new website at natureswaymassageandspa.com Thanks again!"}, "gmap_id": "0x88625c69ee264807:0x9f40c9cb7997e8c3"}
{"user_id": "109341592859399171031", "name": "Carolyn Bryant", "time": 1612076148653, "rating": 5.0, "text": "Good place to have a massage.", "pics": null, "resp": null, "gmap_id": "0x88625c69ee264807:0x9f40c9cb7997e8c3"}
{"user_id": "115020993354992810504", "name": "joey patterson", "time": 1598236133491, "rating": 4.0, "text": "Nice visit very friendly.", "pics": null, "resp": {"time": 1626268229474, "text": "Joey, thank you for your kind words."}, "gmap_id": "0x88625c69ee264807:0x9f40c9cb7997e8c3"}
{"user_id": "116146255006978117496", "name": "Lora R. Frazier", "time": 1584016812475, "rating": 5.0, "text": "Thanks a lot!", "pics": null, "resp": {"time": 1594340405432, "text": "Hi Lora thanks for your 5 star review! Come see me again soon ok?"}, "gmap_id": "0x88625c69ee264807:0x9f40c9cb7997e8c3"}
{"user_id": "101820371426198430460", "name": "Michael Dugglas", "time": 1582809385392, "rating": 5.0, "text": "Thanks!", "pics": null, "resp": {"time": 1594340387340, "text": "You are very welcome Michael! Come back again soon!"}, "gmap_id": "0x88625c69ee264807:0x9f40c9cb7997e8c3"}
{"user_id": "100515781262037873935", "name": "Rachael Mello", "time": 1565728568885, "rating": 5.0, "text": "My husband and I just had a couples massage and we loved it. They were sweet, professional, and did a wonderful job working on our problem areas. We were pleasantly greeted and the facility is clean and relaxing. I frequently get massages and this is one of the best that I've had. Highly recommend!!", "pics": null, "resp": null, "gmap_id": "0x889bb3cbd56a8bdf:0x5c3b3ee4b867945"}
{"user_id": "111883732281690694853", "name": "WILL K", "time": 1560714610319, "rating": 5.0, "text": "Very professional staff and clean atmosphere . If you have pain they know how to take it away. Very reasonably priced. I highly recommend this place. The owner is wonderful she personally assisted me on father's day.", "pics": null, "resp": null, "gmap_id": "0x889bb3cbd56a8bdf:0x5c3b3ee4b867945"}
{"user_id": "118346533737615289040", "name": "Katie Prine", "time": 1577738777700, "rating": 1.0, "text": "This has been an awful experience.  We booked a couples massage at a designated time. We received a call 20 minutes before our booked appointment that they needed to reschedule for the next hour. We agreed. Once we arrived we were told that they were too busy. There was only one other customer in the building. They sent us to another massage location. The second location they sent us to was located by other businesses with bars covering all of the windows and doors.  We chose to not enter this establishment based upon the location. The individuals running this business do not have any positive customer service.", "pics": null, "resp": null, "gmap_id": "0x889bb3cbd56a8bdf:0x5c3b3ee4b867945"}
{"user_id": "108377858363720165744", "name": "Jon Florschutz", "time": 1568513357379, "rating": 3.0, "text": "Too large of a language barrier. If you have prior conditions (athletic injuries, strains, etc) they will not understand you and your recovery may be delayed or injury worsened. The lady giving the massage was also pretty demanding of a tip. She at least understands how to say that.", "pics": null, "resp": null, "gmap_id": "0x889bb3cbd56a8bdf:0x5c3b3ee4b867945"}
{"user_id": "117178532102599503057", "name": "brett garrick", "time": 1567858245667, "rating": 5.0, "text": "This was my first experience getting a massage and I could not be more pleased. Professional comfortable polite and serene. I'll be returning.", "pics": null, "resp": null, "gmap_id": "0x889bb3cbd56a8bdf:0x5c3b3ee4b867945"}
{"user_id": "114165332557765935723", "name": "Sherry Andress", "time": 1563077266547, "rating": 1.0, "text": "This establishment was very unprofessional. I bought a package for a combo massage, hot stones, lavender facial wrap & detox tea, through Groupon. When I arrived, they did not take any medical information from me such as injuries, allergies, etc... The woman who gave me my massage did not speak English much. I noticed the bed only had a folded up sheet for me to cover myself with & there was only oil in the room. About 30 mins in, she was still on my back & not in a professional manner, it hurt. I asked her about the hot stones & she kept saying you have 1 hour. I mentioned the stones again & she left the room (with the door open) came back & rubbed the hot stones up & down my back 3 times. She asked me to turn over, then she began on my right foot. When there was 15 minutes  left & I asked her about the lavender eye wrap & if she will be getting to my hands because I have arthritis. She left the room again (with the door open) & brought in a man that spoke English. They spoke in their language & he took a bean bag looking eye mask & put it over my eyes & left the room. No lavender scent what so ever. She started on my left foot very rapidly & painfully to say the least, twisting & snapping on my toes. This morning when I woke up, I couldn’t put pressure on my left foot & it is still sore to walk. Not to mention my neck & shoulders are still hurting, in which that’s why I wanted to get the massage & my back is worse now. Worst experience ever!", "pics": null, "resp": null, "gmap_id": "0x889bb3cbd56a8bdf:0x5c3b3ee4b867945"}
{"user_id": "100472423933323292868", "name": "Kasey Parker", "time": 1564192171480, "rating": 5.0, "text": "Absolutely Awesome! Today was my first time. Definitely gonna be back.", "pics": null, "resp": null, "gmap_id": "0x889bb3cbd56a8bdf:0x5c3b3ee4b867945"}
{"user_id": "104901562843191196646", "name": "tony chaney", "time": 1555100424218, "rating": 5.0, "text": "Had a great massage today. The ladies were really professional. I will be returning!!", "pics": null, "resp": null, "gmap_id": "0x889bb3cbd56a8bdf:0x5c3b3ee4b867945"}
{"user_id": "104747187158475363117", "name": "Yolanda W.", "time": 1621770919600, "rating": 5.0, "text": "Very nice and clean place. Employees were friendly and I had a good massage", "pics": null, "resp": null, "gmap_id": "0x888e81ac4b204ea3:0xbb26ab9947d3d67"}
{"user_id": "103768705765147610184", "name": "Renee BOSWELL", "time": 1625434202599, "rating": 5.0, "text": "It was very peaceful.I had an excellent massage therapist.", "pics": null, "resp": null, "gmap_id": "0x888e81ac4b204ea3:0xbb26ab9947d3d67"}
{"user_id": "114931777657805041029", "name": "Kelly Suero", "time": 1610829916797, "rating": 5.0, "text": "I had a deep tissue massage with Joseph and he was great! I felt very comfortable, relaxed, and he worked out my areas of concern. Thank you, Joseph! I'll definitely be back!", "pics": null, "resp": null, "gmap_id": "0x888e81ac4b204ea3:0xbb26ab9947d3d67"}
{"user_id": "109649276804067757353", "name": "Chelsei Martin", "time": 1598989315975, "rating": 5.0, "text": "I can’t say enough positive things about Nikki and Peaceful Kneads. This was my first massage experience, and was only a last resort turn for spinal therapy prior to surgical intervention. I had the 1hr cupping massage and after a single visit my dexterity in my hands improved, my pain and pressure in my neck and spine went from a solid 7 to a zero, and my overall attitude improved.\n\nHer professionalism, ability to make you feel comfortable, and address your unique needs is out of this world. Massages can some time hold an intimidating cost, for the price and quality of this experience you can feel confident knowing you are getting more than you pay for! Thank you guys!", "pics": null, "resp": null, "gmap_id": "0x888e81ac4b204ea3:0xbb26ab9947d3d67"}
{"user_id": "108127998597440612011", "name": "Elizabeth", "time": 1613157451463, "rating": 1.0, "text": "Very bad experience. Beforehand I took the time to read the requirements for COVID, and they said you needed to wait in your car to be called in, someone would meet you at your car to take your temp and that you needed to wear a mask while entering the facility. Well none of that happened except I wore my mask in the facility. After I entered the room and started to prepare for my massage I was told I would need to wear a mask while I was on my back! I was shocked at this info, because it was not stated anywhere that I took the time to read beforehand! So I simply told the lady I will just remain on my stomach for the whole massage. There is no way I would of taken the time off, paid a sitter and drove the 2 hours round trip for a massage if I had known I had to wear a mask! Well it just got worse! As I laid down on the table and put my face in the face holder, I felt like I could't breath and was being smothered in the sheet it was wrapped in...well I was! There was a small \"bag\" made out of the sheet wrapped around the head rest that you had to breath into! At this point I was very upset. I got dressed quickly and left. I had just waisted 3 hours, which includes driving 2 hours and paid a sitter for this!.....gets better. I was so upset that I forgot my initial diamond and white gold chain! I called immediately, and OF course....Nope, it was so where to be found! The lady said she looked everywhere, and I appreciate that. But what was supposed to be a relaxing afternoon turned out costing me over $1000. Very upset.", "pics": null, "resp": null, "gmap_id": "0x888e81ac4b204ea3:0xbb26ab9947d3d67"}
{"user_id": "116707001347549720997", "name": "Deidra Clarke", "time": 1602527723339, "rating": 5.0, "text": "Y’all I went in limping, came out skipping! I will most definitely be back! If you are second guessing please don’t, these are professionals who knows where to hit, what to hit, and how to hit it! Book Anne Folkes!!!! No lie! It is so worth it. It was even my one year anniversary and they had flowers and cider set up for us!!! 5 stars from cleanliness to professionalism to quality!!!!!", "pics": null, "resp": null, "gmap_id": "0x888e81ac4b204ea3:0xbb26ab9947d3d67"}
{"user_id": "111513946065721323215", "name": "tony wratchford", "time": 1602091587235, "rating": 5.0, "text": "Stephanie did a awesome job. I have never had a massage before,  I absolutely will be going back", "pics": null, "resp": {"time": 1603293399327, "text": "Thank you Tony! We look forward to seeing you again soon!"}, "gmap_id": "0x888e81ac4b204ea3:0xbb26ab9947d3d67"}
{"user_id": "111546144589603616386", "name": "Natalie Unger", "time": 1601502855133, "rating": 5.0, "text": "I got a massage today with Joseph. It was the best massage I've had in my entire life. Totally worth the money & really helped with the severe neck pain I've been experiencing the past couple of weeks.", "pics": null, "resp": {"time": 1603293502357, "text": "Thanks Natalie!"}, "gmap_id": "0x888e81ac4b204ea3:0xbb26ab9947d3d67"}
{"user_id": "101316370751103208344", "name": "Scott Horror", "time": 1547307389806, "rating": 5.0, "text": "Nikki is fabulous. I’m a dancer, so my legs always need attention, and when I leave after an appointment I feel soooo much better! I recommend her to everyone I know that needs a massage therapist. The interior design is very atmospheric, and the location is pretty easy to get to if you’ve been around Montgomery before. I’d rate 6/5 stars if it was possible.", "pics": null, "resp": null, "gmap_id": "0x888e81ac4b204ea3:0xbb26ab9947d3d67"}
{"user_id": "116056573530612803601", "name": "Jenn Jones", "time": 1595139738055, "rating": 5.0, "text": "Amazing staff, very clean, and professional.", "pics": null, "resp": {"time": 1603293794626, "text": "Thank you Jenn, we love what we do and we do our best every day. :)"}, "gmap_id": "0x888e81ac4b204ea3:0xbb26ab9947d3d67"}
{"user_id": "109680313241859688817", "name": "Stephen Siler", "time": 1565501115336, "rating": 5.0, "text": "I have seen multiple therapists in Montgomery over the years, but Nikki Roberts at Peaceful Kneads gives the best deep tissue sports massage I've ever had.  I also like that she'll work with you on appointment times and has online scheduling.  Her studio is super convenient just off of Vaughn & Taylor and exactly reflects its name: Peaceful.  You're simply not going to find a better studio or therapist in Montgomery.  This is the easiest 5 star review ever.", "pics": null, "resp": {"time": 1442763590485, "text": "Thank you, Steve! I'm glad you're enjoying the new space and thank you for allowing me to be your therapist for the past 9+ years!"}, "gmap_id": "0x888e81ac4b204ea3:0xbb26ab9947d3d67"}
{"user_id": "101132750045606344793", "name": "Trinity Dicks", "time": 1564686849045, "rating": 5.0, "text": "Amazing! Everyone is so kind! Great prices and wonderful services! You won’t go wrong!", "pics": null, "resp": {"time": 1603294015753, "text": "Thanks Trinity, we look forward to seeing you again!"}, "gmap_id": "0x888e81ac4b204ea3:0xbb26ab9947d3d67"}
{"user_id": "111798426930123025115", "name": "Kristen Brown", "time": 1468507694367, "rating": 5.0, "text": "I went in for a pre-natal massage with Nikki and it was absolutely AMAZING. Not just the massage, but the entire experience. From the moment I walked in the door, I was set at ease and that didn't change the entire time I was there. Nikki was very thorough and discussed everything I needed, along with what she would do before hand. I am very pregnant right now and she made sure my comfort level was perfect, checking with me occasionally. The massage room was wonderful. So calming, so soothing, and so peaceful. The sheets and pillows are probably some of the softest I have ever touched! Just a wonderfully peaceful environment altogether. I will definitely return!!", "pics": null, "resp": null, "gmap_id": "0x888e81ac4b204ea3:0xbb26ab9947d3d67"}
{"user_id": "104249947638291114157", "name": "Ken Furman", "time": 1435945260817, "rating": 5.0, "text": "As an almost 62 year old retiree (but very active one at that), the highlight (by far) of my wonderfully blissful life is my monthly appointment with Nikki!  I have moved 18 times in my life and traveled extensively in corporate America for 35 years; and I was blessed to be able to prioritize a monthly massage wherever I might live at the time. Needless to say, I have been cared for by a plethora of massage therapists but NEVER have I been as richly blessed by the quality of massage I receive monthly at Peaceful Kneads!!!  As noted above ... that 1 1/2 hours is consistently the best time segment of my month ... (and the twice annual gift to self of a 3 hour massage is the ultimate experience).   In summation:  Blessed...Blessed...Blessed by Nikki and Peaceful Kneads.", "pics": null, "resp": {"time": 1436319732575, "text": "Ken, you are such a Blessing to those around you..I feel so grateful to be able to work on you each month and to hear all the great things you do for the community. Thank you for the humbling review."}, "gmap_id": "0x888e81ac4b204ea3:0xbb26ab9947d3d67"}
{"user_id": "113827052715749956957", "name": "Mary Evelyn Baxter", "time": 1436311756830, "rating": 5.0, "text": "I love Nikki and am extremely grateful for her talent. I am constantly on the go and running around. Cycling, running, swimming, lifting weights, scuba diving, and anything else I can get into. I put my body through the ringer and Nikki always makes it better. It doesn't matter how many knots I have Nikki works them out and I walk out feeling better than I did walking in.", "pics": null, "resp": {"time": 1436680418387, "text": "Super Woman needs therapy too! Thank you and I hope I can keep you moving through every new adventure you take."}, "gmap_id": "0x888e81ac4b204ea3:0xbb26ab9947d3d67"}
{"user_id": "114465910825122442279", "name": "Lifetime Bama Fan", "time": 1537334813059, "rating": 5.0, "text": "Stephanie is very good at her job. She has helped me with issues that have been long-standing and difficult. I highly recommend her.", "pics": null, "resp": {"time": 1603294228716, "text": "Roll Tide!"}, "gmap_id": "0x888e81ac4b204ea3:0xbb26ab9947d3d67"}
{"user_id": "101594649450161254877", "name": "T Mat", "time": 1546471207449, "rating": 5.0, "text": "Loved it! I'm always a better person by the time I leave. Nikki is wonderful!", "pics": null, "resp": {"time": 1603294119435, "text": "It's our please T Mat"}, "gmap_id": "0x888e81ac4b204ea3:0xbb26ab9947d3d67"}
{"user_id": "107786781447432624008", "name": "Leah Shuford", "time": 1459352141275, "rating": 5.0, "text": "Excellent service! Lisa is a wonderful masseuse! I have been going to her for years because she's just that good. I always leave feeling less sore and more relaxed. Knowing I have an appointment with Lisa is the highlight of my week!", "pics": null, "resp": {"time": 1459363888803, "text": "Thanks Leah! I'm so glad I can help & look forward to seeing you soon!!!"}, "gmap_id": "0x888e81ac4b204ea3:0xbb26ab9947d3d67"}
{"user_id": "101295600876446703560", "name": "Sue K", "time": 1435678991389, "rating": 5.0, "text": "I have been going to Nikki and Peaceful Kneads for years.  The new studio is BEAUTIFUL and so peaceful.  She helps me with fibromyalgia and headache management.  I love that you are able to make an appointment online so that we don't have to play phone tag with each other.  I highly recommend going to see her to help with any chronic or acute pain you may have or just to take time for yourself to relax!", "pics": null, "resp": {"time": 1435784767732, "text": "Thank you for the kind words..I'm glad you like the new space and I hope to see you again soon."}, "gmap_id": "0x888e81ac4b204ea3:0xbb26ab9947d3d67"}
{"user_id": "103964443380723334905", "name": "Dakota Jo Keevan", "time": 1528999165143, "rating": 5.0, "text": "Peaceful Kneads is the best in town! I saw Fred this week and his technique was different but as good as a Chiropractor adjustment in my opinion.", "pics": null, "resp": null, "gmap_id": "0x888e81ac4b204ea3:0xbb26ab9947d3d67"}
{"user_id": "108199318988534951220", "name": "Jessica Lee", "time": 1526338400477, "rating": 5.0, "text": "Hands down, BEST massage I’ve EVER HAD!! You gotta add ‘cupping’!! Nikki is amazing! And she has a wonderful staff!!", "pics": null, "resp": null, "gmap_id": "0x888e81ac4b204ea3:0xbb26ab9947d3d67"}
{"user_id": "106855113540790628021", "name": "Michael Ashworth", "time": 1544743332161, "rating": 5.0, "text": "Excellent results as always! ! Feel 100% better!! No foofoo massage here it's all about fixing the problem!", "pics": null, "resp": {"time": 1603294198676, "text": "Thanks Michael! We always try to give you what your body kneads!"}, "gmap_id": "0x888e81ac4b204ea3:0xbb26ab9947d3d67"}
{"user_id": "116143224021313482921", "name": "Kirk Simpson", "time": 1549509770512, "rating": 5.0, "text": "My experience with Hilda was superb; thoroughly enjoyed it.", "pics": null, "resp": {"time": 1550582260395, "text": "We are so glad you enjoyed your session! Thank you and we hope to see you again soon!"}, "gmap_id": "0x888e81ac4b204ea3:0xbb26ab9947d3d67"}
{"user_id": "103521332031849579427", "name": "betz sinep", "time": 1453083756970, "rating": 5.0, "text": "I moved to AL two years ago from WA and had been looking for massage therapist who actually knew what they were doing. I've had multiple neck and back injuries. Last week I found my person. My boyfriend had bought me a gift certificate for Peaceful Kneads and I promptly made an appointment with Tabi. That girl has some magical healing hands!! She knows how to release muscles without causing pain or leaving bruises. She's one of those professionals who continues her education not because she has to, but to learn as much as she can to further help her patients. I will definitely be going back!!", "pics": null, "resp": {"time": 1454258832604, "text": "We are so lucky to have Tabitha at Peaceful Kneads now! She is the most passionate therapist I've met In a long time and she truly cares about her client's health. Thank you for your kind review and we look forward to seeing you soon! -Nikki"}, "gmap_id": "0x888e81ac4b204ea3:0xbb26ab9947d3d67"}
{"user_id": "118284434741720142284", "name": "Marihaj Mitchell", "time": 1512497718712, "rating": 5.0, "text": "Great atmosphere,very professional, and great service!!!! I had recently developed upper back pain due to improper sleeping and this pain went on for a few days. I finally decided to browse the internet and find a place to get a massage. I found many different places but I found that Peaceful Kneads Massage was the easiest to book online. OMG!!! Booking with Lisa was the best decision I made, she know exactly what she's doing. My back was hurting to the point where it hurt when I breathe. After she was done with my massage I instantly felt better then I did before I came. But the next morning, that next morning, I was back!!!! I don't have any back pain!!! So to Lisa at Peaceful Kneads Massage, Thankyou! Thank you! Thank you! ❤️", "pics": null, "resp": {"time": 1603294692360, "text": "Thank you Marihaj, as you've noted the benefits of massage are usually most notable on the following day or days afterward!"}, "gmap_id": "0x888e81ac4b204ea3:0xbb26ab9947d3d67"}
{"user_id": "101107502261266497229", "name": "Isaac", "time": 1510365635619, "rating": 3.0, "text": "Good massage, but not up to par for what it takes to really give a deep tissue massage for a person that weight lifts often.", "pics": null, "resp": {"time": 1511103951718, "text": "Issac, I'm sorry to hear the pressure wasn't sufficient for your needs! We strive to carefully listen to our clients during the scheduling process in order to match them with the therapist best suited to help them achieve their goals for their session and during the intake process to make sure we go over expectations right before the session begins. The therapist we scheduled you with is used to working with athletes and has sports massage and myofascial release technique training which both use Deep Tissue work, but sometimes this doesn't necessarily translate into what a client would call or expect as Deep Pressure. I would love to talk with you and set you up with myself or a different therapist to make things right and to see if we can meet your expectations. I'll contact you this week to see if we can do this. Thank you for your feedback! Peace, Nikki Roberts."}, "gmap_id": "0x888e81ac4b204ea3:0xbb26ab9947d3d67"}
{"user_id": "115043440384823116493", "name": "ckernel", "time": 1490152076300, "rating": 2.0, "text": "While the facility was nice, I did not enjoy the massage.", "pics": null, "resp": null, "gmap_id": "0x888e81ac4b204ea3:0xbb26ab9947d3d67"}
{"user_id": "110400922752111551103", "name": "Demarcus Sharpe", "time": 1528740919762, "rating": 5.0, "text": "Love the vibe. Fred is the man", "pics": null, "resp": {"time": 1528895710020, "text": "Thank you Demarcus! We are so glad you enjoyed your session with Fred. We appreciate you!"}, "gmap_id": "0x888e81ac4b204ea3:0xbb26ab9947d3d67"}
{"user_id": "107846471914711376919", "name": "Angela Stallworth", "time": 1503951685188, "rating": 5.0, "text": "BEST MASSAGE I have had in a LONG time!!! Thank you Stephanie!!", "pics": null, "resp": {"time": 1511104013777, "text": "Stephanie is awesome! Thank you Angela! We hope to see you again soon!"}, "gmap_id": "0x888e81ac4b204ea3:0xbb26ab9947d3d67"}
{"user_id": "107578970147785405891", "name": "Wes Tallon", "time": 1533320644599, "rating": 2.0, "text": "Massage was OK but mechanical.  Therapist was watching the clock.", "pics": null, "resp": {"time": 1603294281991, "text": "Thank you for bringing this to our attention Wes."}, "gmap_id": "0x888e81ac4b204ea3:0xbb26ab9947d3d67"}
{"user_id": "105110504300735450872", "name": "amy Kim", "time": 1564590153433, "rating": 1.0, "text": "Facial massage ???\nNever again.", "pics": null, "resp": {"time": 1564686624680, "text": "Amy,  I’m sorry you didn’t enjoy your session! We try to make each session relaxing and enjoyable. Let us know what we can do to make it a more enjoyable experience for you. I have emailed you about this matter and hope to make it right."}, "gmap_id": "0x888e81ac4b204ea3:0xbb26ab9947d3d67"}
{"user_id": "118401305881658348084", "name": "Alisa McLeod", "time": 1527527955036, "rating": 5.0, "text": "Nikki is wonderful with cupping and massage.", "pics": null, "resp": {"time": 1603294519593, "text": "Thank you Alisa, cupping is one of our specialties! It is great for  pain, inflammation, blood flow, relaxation and well-being, and as a type of deep-tissue massage."}, "gmap_id": "0x888e81ac4b204ea3:0xbb26ab9947d3d67"}
{"user_id": "116479874196072829499", "name": "Michael Roberts", "time": 1603245374373, "rating": 5.0, "text": "The new place at 8101 B Seaton Place is awesome...check it out.", "pics": null, "resp": {"time": 1421283328186, "text": "Thank you!"}, "gmap_id": "0x888e81ac4b204ea3:0xbb26ab9947d3d67"}
{"user_id": "110928714009317143859", "name": "Reginia Knight", "time": 1511080339395, "rating": 4.0, "text": "Will be going back again", "pics": null, "resp": {"time": 1603294744722, "text": "Thank you Regina, we hope that we can earn that fifth star when you come back, talk to us!"}, "gmap_id": "0x888e81ac4b204ea3:0xbb26ab9947d3d67"}
{"user_id": "102452429661748120110", "name": "Judith Keegan", "time": 1503460125362, "rating": 5.0, "text": "Stephanie,  iron woman and my massage therapist for years, has moved here!", "pics": null, "resp": {"time": 1503495013365, "text": "Stephanie is amazing! We are so happy to have her and her awesome, healing bodywork here at Peaceful Kneads. And, we are happy to have YOU here! Thank you Judith!"}, "gmap_id": "0x888e81ac4b204ea3:0xbb26ab9947d3d67"}
{"user_id": "102606041247160515139", "name": "Jill Esterly", "time": 1621772213206, "rating": 5.0, "text": "I have gotten many massages over the years but this was absolutely the best massage I've ever gotten. Hailey listened to all my concerns and applied the amount of pressure I asked for. She focused on the areas I had mentioned were giving me issues. The ambiance was extremely calming, soothing, and relaxing. It was a great experience all around. I will definitely be coming back here.", "pics": null, "resp": {"time": 1621807386104, "text": "We're so happy to hear you had a great experience! We hope to see you back again soon :)"}, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "103899886446719253667", "name": "Brad G", "time": 1610900956078, "rating": 5.0, "text": "Michelle is a caring massage therapist. She's been helping me with my usual aches/pains resulting from a desk job for years.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOpo5LlkHuQMQf7XVT_2mhc062RFtXnz_yO5pE-=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "108246603695600383170", "name": "Leigh Cella", "time": 1617453404484, "rating": 5.0, "text": "I have had many massages over the years. My massage was unlike any massage I have ever received. IT WAS AMAZING! And that does not even come close to how I would describe my massage.\n\nIf you want to feel better contact Abiding Hands Therapy now. Even a day after I still feel the tranquility.\n\nThank you Abiding Hands, thank you\n-Leigh", "pics": null, "resp": {"time": 1617455377749, "text": "Thank you so much for you review! It was such a pleasure to have you in, we are so glad you enjoyed your experience with us!"}, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "110402219248399583429", "name": "Ladonna Allen", "time": 1617232549563, "rating": 5.0, "text": "WOW, what an amazing session I had with Hailee! I have had many, many massages but never one that addressed and relieved so many of my issues. Not only did I leave completely relaxed, but I no longer had a headache and could move my neck and hips without cringing. If you are in need of a therapist that knows how to listen to you and provide the best deep tissue massage ever, then Hailee is your person. I live an hour away but it is certainly worth the trip and can’t wait to return.", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "117535741098653029422", "name": "April Jossey", "time": 1613951062420, "rating": 5.0, "text": "I had the most wonderful massage with Hailee today. I went in with back pain & came out feeling so much better. She was a great listener when I told about my problem areas and she was able to easily find them and successfully work them out. I was so pleased with the experience that I’ve already scheduled my next appointment!", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "107826719736896943525", "name": "Kami Pearson", "time": 1618762295765, "rating": 5.0, "text": "Hailee did a wonderful job! Very convenient location and very relaxing room! Best massage I’ve EVER had! I will definitely be back and I highly recommend it!", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "101691136625489273509", "name": "Tristan Graham", "time": 1615402833718, "rating": 5.0, "text": "I had been driving to Birmingham to receive Myofascial Release Therapy once a week until I was referred to Hailee, and let me tell you that she is INCREDIBLE! I can walk in and just tell her to “fix me” and I leave feeling so much better. She is very knowledgeable, kind and calming. I highly recommend her.", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "110229326915270507552", "name": "Vanita Turner", "time": 1611766514452, "rating": 5.0, "text": "Michelle, thank you for an amazing and perfect massage. It was my first Ashiatsu but will not be the last, you have definitely mastered this technique. The ambience in your therapy room is beautiful and relaxing. I will definitely look forward to my next sessions on future visits to Huntsville.", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "109286593362832872090", "name": "Beth Heflin", "time": 1610895836653, "rating": 5.0, "text": "Michelle is amazing! Best massage I've ever had in my life. She listens and follows through. I don't feel like I've been beaten up. I feel fresh and new and energized! I recommend you make an appointment right away!", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "106993304328660580616", "name": "Jennifer Morgan", "time": 1611098366106, "rating": 5.0, "text": "Michelle gives the best massages! I never had a massage I enjoyed before going to her and now I am a regular customer. She will work just the spots I ask her to so I can get the exact relief and relaxation I need!", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "109699734426907570849", "name": "Fern Brazda", "time": 1611754752393, "rating": 5.0, "text": "I had one of the best massages. I have back problems and my back felt great, I was relaxed in this most comfortable relaxing atmosphere. Feeling relaxed without pain was my main objective and I came home pain free and relaxed! I can’t wait to get another ashiatsu  massage!", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "110666493731955852754", "name": "Travis Nixon", "time": 1614202469767, "rating": 5.0, "text": "I've been seeing Michelle at Abiding Hands for a while now.  When I was playing soccer and dancing regularly my muscles would get really tight and sore.  Michelle worked with me and after a couple of sessions the pain stopped.\n\nI've had massages at other places that hurt and I just figured \"pain = tight muscles leaving the body.\"  But with Michelle, I was surprised at how much release I got with almost no discomfort at all.  I would definitely recommend you give them a visit.", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "115905137686699917055", "name": "james elliott", "time": 1614395638497, "rating": 5.0, "text": "Michelle is absolutely amazing.  I went for a 75 minute ashiatsu and I wish it wouldn’t have ended.  I felt the best I have ever felt and it was an experience I wish everyone would experience.  I highly recommend it.  If you are on the fence then make the appointment and you will not regret it.", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "106781933072110247483", "name": "Rebecca Stephens", "time": 1612957926218, "rating": 5.0, "text": "Michelle is an amazing massage therapist! She's very professional and knowledgeable and cares about her clients. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "108209003081092586187", "name": "Misty Ortiz", "time": 1611628992928, "rating": 5.0, "text": "I have tried several types of massage from many different places over the years and this was one of the best! I saw Michelle for an Ashiatsu massage. The pressure was deep and it was very relaxing and therapeutic!!", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "111880978277115464851", "name": "Jalesia Semien", "time": 1624717118046, "rating": 5.0, "text": "This was an amazing experience and Michelle has wonderful spirit!", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "111445770893624500187", "name": "Lauren Honeycutt", "time": 1610903457823, "rating": 5.0, "text": "Michelle did an amazing job. I was so relaxed during and after the massage. I will be going to her from now on-highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "114609175870959966223", "name": "Mollie Garland", "time": 1610928212820, "rating": 5.0, "text": "Michelle is a wonderful massage therapist!  She has always provided an overall relaxing experience. I highly recommend her!", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "101466948488707156602", "name": "Stacy Pierce", "time": 1611087454120, "rating": 5.0, "text": "Michelle worked with me while I was pregnant. She gives great prenatal massages and is obviously committed to helping all her clients. I would highly recommend her!", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "110926369634597154356", "name": "Rachel Rushing", "time": 1611022415046, "rating": 5.0, "text": "Hailee’s intuitive ability to locate and work areas to release tension is amazing! Hailee combines her knowledge of the body with a flow that relaxes you while healing.", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "110367135919144393842", "name": "Amy Goddard", "time": 1610897725100, "rating": 5.0, "text": "Michelle is a true professional. She knows her field, she cares about her clients, and she provides a warm, enjoyable atmosphere for relaxation. Refreshing is the word best used to describe Michelle and a session with her.", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "105130606888953760622", "name": "Tanya McCune", "time": 1611116353842, "rating": 5.0, "text": "I received a phenomenal massage with Michelle.   Very professional and a superbly relaxing experience", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "118408391425675438986", "name": "Sandy Tebben", "time": 1615763426069, "rating": 5.0, "text": "Hailee is awesome! Very professional, friendly and caring", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "115115159794725074597", "name": "Stacey Hinson", "time": 1610919826848, "rating": 5.0, "text": "Michelle is an amazing Reiki practioner. In all my sessions she has taken great care to guide me through my healing process. She is intuitive and takes time to help me understand everything that comes through. If you are seeking am awesome Reiki practioner look no further...book now you won't regret it!", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "102559054457771174542", "name": "Shelly Carr", "time": 1618084659864, "rating": 5.0, "text": "I was very skeptical about going because of a bad experience a couple of years ago but in desperate need, so glad I went . Hailee was very professional and tended to my needs. I will be a repeat customer!!", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "108848238735565002308", "name": "Ashley Freeman", "time": 1610915475854, "rating": 5.0, "text": "Everyone needs to go see Michele at Abiding Hands Therapy! She is a miracle worker! Wouldn’t go to any other massage therapist!", "pics": null, "resp": null, "gmap_id": "0x8862132d46164251:0x940b9accebdd68a4"}
{"user_id": "115377652676231590635", "name": "Abdulrahman alharthi", "time": 1596316112003, "rating": 1.0, "text": "Soooo bad and I ask for 30 minutes and I gut 20 minutes of bad massage", "pics": null, "resp": null, "gmap_id": "0x88626b4142894dc1:0xbc586ddbc1db8a63"}
{"user_id": "100909624323140306578", "name": "Kareem Tv", "time": 1575952710533, "rating": 1.0, "text": "Very nice clean place\nStaff not friendly and they  always rush you\nI pay for 30 minutes and they only gave .e.10 minutes\nNot recommended", "pics": null, "resp": null, "gmap_id": "0x88626b4142894dc1:0xbc586ddbc1db8a63"}
{"user_id": "108932274264842293540", "name": "Dennis Moran", "time": 1557094815643, "rating": 3.0, "text": "Gina has excellent massage skills.", "pics": null, "resp": null, "gmap_id": "0x88626b4142894dc1:0xbc586ddbc1db8a63"}
{"user_id": "112259039824423773609", "name": "Leema Lutfi", "time": 1618157437214, "rating": 5.0, "text": "My friend and I got facial. TiAmber was our esthetician. She did amazing job and explained the process and product.  She seemed knowledgeable and welcoming.  Overall great experience.  Thank you", "pics": null, "resp": null, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "111297263273986084137", "name": "Des", "time": 1615845644839, "rating": 1.0, "text": "I am highly disappointed with this location’s front-office service, specifically Debra. I had an appointment this evening at 5pm, but woke up experiencing illness so wanted to reschedule my appointment, especially in light of the Covid-19 climate we are still in. I called their office first thing (8am) and explained my illness to Debra and informed her I would like to reschedule. She gave me several run-arounds concerning why even though I was sick I could not reschedule. Even so much as stating the owners are the reason why if a patron feels ill they still have to be serviced. She then said half of my Massage Envy points banked for today’s service would be expensed because of the same day reschedule. I asked what concessions are made for feverish patrons. She said they are still required to show up and Massage Envy would take their temperature. I told her I would be going to the doctor’s office today and could provide an excuse. She said a manager would get back with me today, but no one ever contacted me. After having my suspicions proven that I had been lied to and no one would contact me, I called back to ask about what was the current status of my appointment/points. I was then informed the appointment was taken off the records and all of my points for today’s session had been expensed. I am extremely frustrated with their “customer care”. I feel lied to and with their “Covid protocols” that were exhibited today first-hand to me, I will NEVER feel comfortable patronizing them again. There is no telling how many patrons who have been ill (with or without fevers) have received service and unintentionally spread it to others with the help of this location’s policies. So much for this place being a standard of wellness services. I feel more stressed now after dealing with this than I did before. I wish I had NEVER booked anything with this location or had my home membership at this location.", "pics": null, "resp": null, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "112377127318389523884", "name": "Stephanie Hazen", "time": 1581975676302, "rating": 5.0, "text": "I absolutely love coming here. As a single mom, I don’t have lots of money to spend on spa services. Because of massage envy I am able to spend a little time pampering myself. Whitney has done an absolute miracle on my face with products and chemical peels. I am so happy! With only one very light peel, about 75% of the dark spots I had from sun exposure are gone. The receptionist is absolutely wonderful. She works really hard to apply coupons and discounts whenever she can. The place has always been clean and welcoming. The staff is great. I did so a massage as well and it was very very relaxing. I got the membership and plan to make monthly visits.", "pics": null, "resp": {"time": 1582338433226, "text": "Thank you Stephanie, for your positive review of Massage Envy - Hoover. All Massage Envy locations are owned and operated by local franchisees who work hard to ensure guests and members are happy with the services they receive. We are so happy to hear you have had such a great experience."}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "105073477243156051610", "name": "Evyan Gallegos", "time": 1605223754547, "rating": 5.0, "text": "Great communication with staff, felt really safe going in with all the covid-procedures.", "pics": null, "resp": {"time": 1607884441851, "text": "Reviews like this are important and it is greatly appreciated that you took the time to leave your positive feedback for Massage Envy - Hoover. Thank you, Evyan!"}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "117114079148371697552", "name": "Maria", "time": 1578516145863, "rating": 3.0, "text": "Just had a massage. My experience was a 3/5 stars for the following:\n\n1. There was a fan on me the entire time... For one hour, I was covered in oil (and naked with only a sheet covering me) with a fan on me in the middle of winter! I was almost shivering. The bed warmer was either not on or not working.... Bummer. Also, the light in the room was on the whole time... I like it dark and relaxing. Rooms need to be vacuumed.😞\n\n2. My MT was clearly sick with something respiratory going on. Being that close and breathing over me sick was a major deterrent on a return visit. Not sure if he kept stopping the massage to wipe his nose or what but I've never had so many pauses in a massage. 😷I'm used to smooth continuous pressure/ touch during a massage except for when its time to turn. Also, no hot towels this time!!!😩\n\n3. I feel like this particular chain is on the downhill... The past few times I've gone, you can never get the same therapist twice. It appears there is a lot of turnover here. It is noisy in the hallway out side of the room. I made sure to use all of my gift card so my friends and family can start giving me new gift cards to use somewhere new.😐\n\n4. The receptionist stated she was going to look up my gift card towards the balance. I had two cards to use. She couldn't get them at first. Luckily, I had them on me.\n\n*Overall, not a terrible experience but in Hoover, I have many other options to choose from for a good massage and I'll start seeking out those places next. For someone that splurges to have a massage 3 times/ year at most, my expectations were not met for the cost of services rendered.  Staff was friendly. MT gave a decent massage with good pressure (minus all the pauses).", "pics": null, "resp": {"time": 1579180896826, "text": "Hello Maria, thank you for letting us know about your experience at Massage Envy - Hoover franchised location. We encourage you to reach out to the franchised location through the online portal at http://bit.ly/2mQKBpW to express your concerns and allow them to help address these issues."}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "108023328537514090098", "name": "Tracy Durrett", "time": 1591983736841, "rating": 3.0, "text": "Quintette was great and I had a great massage. Debra was very nice and helpful. I also had a facial with Selena. She was late and I was suppose to have an hour and it was only 45 min at best. That included me changing and all. She never discussed products with me other than not to use an abrasive exfoliater on my checks.\nShe left the headband on and the bed raised up and I slipped getting down since it was still up. I would go back for the massage but would request someone different for a facial.", "pics": null, "resp": {"time": 1592306397690, "text": "Hello Tracy, on behalf of Massage Envy Franchising thank you for expressing your concerns and bringing this to our attention. Please reach out through the online portal at http://bit.ly/2mQKBpW so this can be addressed."}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "102421168286775704907", "name": "Empty the Tanks", "time": 1604532311308, "rating": 5.0, "text": "MJ was fantastic ! Great front desk staff!", "pics": null, "resp": {"time": 1607641992510, "text": "Thanks for your high star rating for Massage Envy - Hoover!"}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "105451017972347526023", "name": "Angie Russell", "time": 1606680618232, "rating": 5.0, "text": "Love it, I go for severe back and body pain. It helps tremendously", "pics": null, "resp": {"time": 1608849045040, "text": "Thanks for your high star rating for Massage Envy - Hoover, Angie!"}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "115238632328785783357", "name": "Kameron Bell", "time": 1597502823629, "rating": 1.0, "text": "Do not book an appointment here, I had a session set for my fiancées birthday, they called me the day of and told me that the person who was supposed to be doing the massage had quit and that they are gonna cancel my fiancées appointment, I DO NOT RECOMMEND THIS LOCATION AT ALL, they are horrible!", "pics": null, "resp": {"time": 1597891743135, "text": "Hello Kameron, it’s regrettable to hear that you had a negative experience at your local franchised Massage Envy. We encourage you to reach out to the franchised location through the online portal at http://bit.ly/2mQKBpW to express your concerns and allow them to assist further."}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "112954657644688195301", "name": "J J", "time": 1564871959289, "rating": 4.0, "text": "I got a massage for my husband as a gift for his birthday. The environment was comfortable and serene. As far as his his experience, he said his MT did an excellent job. There was one thing I didn't like and it was the young lady who asked about the membership.  No one wants to be asked that after a relaxing experience.  Maybe let the customer inquire about it first.", "pics": null, "resp": {"time": 1565113784439, "text": "Thanks for taking the time to leave us a positive rating! We're delighted to hear that your husband had a great experience with our team! We appreciate your providing this information so we can improve upon our services."}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "115322677856151189693", "name": "Angeles Vo", "time": 1572889196497, "rating": 1.0, "text": "I got a mysterious rash on my arms after a massage. I notified the receptionist who put a note in the system. I thought maybe I had a one time bad experience, since the rash seemed to go away, so I went back the following month. I got another rash but this time it spread up and down my arms. My doctor told me it looked like a fungal infection but to be safe she would refer me to a dermatologist. I got a doctors note stating I needed to refrain from massages until the dermatologist could determine what the rash was and if it was safe to go back. I took my doctors note and filled out a membership cancellation form. I noticed my monthly fee was withdrawn after I had submitted the form so I called. I was told my cancellation was denied because I needed a note from the dermatologist. I can’t get a dermatologist note for another month when I have my appointment but even so, why is my doctors note not enough? According to their cancellation policy a note from a doctor stating one cannot be massaged for medical reasons should suffice. The manager didn’t even have the decency to call me! I only found out because I called them. I am out $130 and still have one more month before my contract is up. Not to mention the doctor bills. Do not go here! Find a better place to get a massage.", "pics": null, "resp": {"time": 1573237473836, "text": "Massage Envy is committed to a safe and therapeutic environment. If you feel you have not experienced this at this franchised location, please reach out to the corporate Guest Relations team at guestrelations@massageenvy.com with the details of your experience for further assistance."}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "113539655889723105879", "name": "Cheryl Brewer", "time": 1571850141224, "rating": 1.0, "text": "Not enough space for all the issues. Charter member. Joined 10 years ago. Decided in May 2019 it was in decline and too difficult to book due to incredible staff turnover. Also, the experience had become totally inconsistent. Still fighting them for my legitimate cancellation. When I requested cancellation in May I had TEN unused sessions (because they are so understaffed). Had to burn through those first. Sent in my paperwork and have the email in my SENT emails to prove it. They deny having any knowledge and are still billing me! Totally unprofessional. Avoid at all costs.", "pics": null, "resp": {"time": 1572015190724, "text": "Hello Cheryl, on behalf of Massage Envy Franchising thank you for expressing your concerns and bringing this to our attention. Please reach out through the online portal at http://bit.ly/2mQKBpW so this can be addressed."}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "117211486311548953856", "name": "xledllTroy Roberts", "time": 1580694955143, "rating": 5.0, "text": "Great place and great service . Whitney was great . She makes you feel very comfortable .did a great job on my face I will be back .", "pics": null, "resp": {"time": 1581026957922, "text": "Thank you, we are happy to hear that you had a great facial with Whitney at Massage Envy - Hoover!"}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "104249167056930126505", "name": "Stephanie Dameron", "time": 1576255738724, "rating": 5.0, "text": "I read the reviews before coming in and was scared, but I had a gift card so I had nothing to lose. But the therapist, Quinette (not sure if that’s the name), was extremely nice as well as the woman at the front desk. So I had no complaints! She wasn’t pushy about buying a membership either. So I guess I was lucky and avoided those that everyone was complaining about. But I’d come back for Quinette!!", "pics": null, "resp": {"time": 1576605913699, "text": "Thanks for taking the time to leave Massage Envy - Hoover a positive review! We’re happy to hear that you enjoyed your gift card, Stephanie!"}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "104935889840748031763", "name": "Mary Kathryn Weithoner", "time": 1613286649168, "rating": 2.0, "text": "Receptionist was very rude.", "pics": null, "resp": {"time": 1613675557201, "text": "Hi Mary Kathryn - thank you for letting us know your experience. Please contact your local Massage Envy at (205) 988-6400 so they can address your concerns."}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "106297731007362331634", "name": "Linda Williams", "time": 1536164153862, "rating": 5.0, "text": "Very good experience for me. Friendly and helpful ladies at the front counter and my therapist was courteous and knowledgeable. She took the time to explain what she was doing and why. Great!", "pics": null, "resp": {"time": 1536711240681, "text": "Hi Linda, thank you for the kind words and wonderful review! It brings us great joy to see our members and guests happy. We look forward to seeing you again soon!"}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "111582615485747626926", "name": "ovetta morgan", "time": 1575686487066, "rating": 4.0, "text": "I wish I could go every week so relaxing", "pics": null, "resp": {"time": 1529004745125, "text": "Hi, please do not hesitate to reach out if you have any questions for us! Thanks for rating us so highly!"}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "112035044459577097959", "name": "Jennifer R James", "time": 1549582843403, "rating": 5.0, "text": "Love this place. So glad to have found it. Have had a few different therapists & not disappointed with any of them.", "pics": null, "resp": {"time": 1550181207071, "text": "Thanks for your five star review, Jennifer! We're excited to hear that we earned it!"}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "101147330593536597984", "name": "ByDezire", "time": 1563895771575, "rating": 1.0, "text": "This place is ridiculous! My girlfriend scheduled a day out for my birthday! She didn’t get the reminder phone call that they supposedly do. When she scheduled the appt. the woman told her to arrive A FEW MINUTES before to fill out paper work. We literally pulled up 10 mins late because of traffic. The girl at the desk told us since we were late the paperwork would cut into the massage by 30 mins and said it wouldn’t be worth it! Also they would only charge 50% of the initial price for cancellation! We rescheduled and they charged the FULL price! My girlfriend literally wasted all this money on a massage and no one laid a hand on me! They’re very horrible with communication and policy between they’re employees! So much for having my first massage on my birthday!", "pics": null, "resp": {"time": 1564071463984, "text": "We're disappointed to hear that this was the experience you two had with us. Please message us through our online portal at http://bit.ly/2mQKBpW so that we can address this further and try to restore your confidence into our business."}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "107506144630678670735", "name": "Sandy Kimble", "time": 1533320773135, "rating": 1.0, "text": "Scheduled my appointment a few days in advance but when I arrived iwas told my therapist was changed to a female. I prefer male therapist. So I canceled the appointment.  It would have been nice to receive a phone call letting me know the other therapist was sick and had been sick for a few days which means he was sick when I scheduled the appointment.  Total waste of my time.  I won't be returning.", "pics": null, "resp": {"time": 1533580312743, "text": "Hi Sandy, we regret falling short of meeting your expectations, and we humbly ask for the opportunity to make this up to you. Please message us directly through our online portal at http://bit.ly/2mQKBpW. Thank you providing this information so we can improve upon our services. We hope to hear from you soon."}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "100171523994019175481", "name": "Brian Lavett", "time": 1468602404525, "rating": 5.0, "text": "I've read these reviews and frankly I was shocked. I had a great experience! My therapist was not only cordial and professional, she also gave me the best massage I've ever had. I've had no issues with billing, and find the staff curtious and hospitable. My therapist's name was Leigh. I would definitely ask for her. She is great and seems to really know what she's doing. I would and have recommended this place to my friends. My guess is that the other complaints on here, are just unhappy people that find fault in everything.", "pics": null, "resp": {"time": 1468861055235, "text": "Thank you for taking the time to let us and others know about your positive view of our business. We are glad that you have found a therapist to your liking and find that our staff, as a whole, is living up the Massage Envy values. Thank you again for being a valuable guest and we look forward to seeing you again."}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "116342119161993678108", "name": "Christopher Michael", "time": 1495549917299, "rating": 5.0, "text": "I'm surprised to read the negative reviews on here.  I've had great massages with Chance and the customer service staff have always been nice to me.  Due to personal circumstances I had to cancel my membership with Massage Envy which was not an issue after my initial 12 months had ended.  Highly recommend!", "pics": null, "resp": {"time": 1495556917440, "text": "Christopher Michael, thank you for the kind words and wonderful review! It brings us great joy to see our members and guests happy. We look forward to seeing you again!"}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "114211389125518569156", "name": "S", "time": 1563491920185, "rating": 1.0, "text": "Wish zero was an option. Had a giftcard and made a 6:00 massage appointment, arrived at 5:45, got checked in by 6:00, waited 20 minutes and met therapist as I was getting ready to leave. She immediately made excuses for being late and blamed it on a computer system and iPad not showing me as being checked in. What she didnt realize was the fact she had been observed coming in at 6:00 with drinks and food, and eating, which was the real reason she was late, and unconcerned. Tried to take the high road, but she was agitated, ranting, cursing about how the rest of the schedule was all of a sudden thrown off. Also said she was sleepy and frustrated. Canceled my appointment because there was no way I could enjoy my massage with that type of unprofessional behavior. I'm still waiting on a call from the manager which I don't expect to receive. On a positive note, the 2 young receptionists were very cordial. I do not recommend this location at all! Sorry my family wasted $$ on a giftcard.", "pics": null, "resp": {"time": 1563821775458, "text": "Thanks for your honest feedback. We're deeply disappointed to hear that this was the experience you had with us. At your earliest convenience, please message us through our online portal at http://bit.ly/2mQKBpW so that we can address the details of your review further."}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "107996180787530505362", "name": "Mckinney Chattman", "time": 1551734092968, "rating": 4.0, "text": "Still feel great weeks later and one of the best massages I've had", "pics": null, "resp": {"time": 1552498285211, "text": "We're excited to hear this! Thank you, Mckinney! We hope to see you again soon!"}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "114372524364278994634", "name": "Stephanie Clayton", "time": 1466450405114, "rating": 1.0, "text": "I have been having an issue for 2 months now with this location.   After the desk staff not being trained well enough to handle the request, or just not wanting to, I have asked repeatedly to speak with the manager to no avail and have been transferred to his voicemail, again to no avail.  He will not call me back and he is never in or so they say.  Massage Envy advertises transferring a credit to another member's account (for a fee).  They have charged the fee and have yet to transfer the credit to my sister's membership at another location out of town. Twice now they have set up a guest account for her in Hoover, even after a detailed phone call on May 9, 2016 with a front desk staff to try and rectify this situation because when my sister asked her location if it had transferred and they let her know they had set up a guest account for a half hour in Hoover.  After no help from the Hoover location I called my sister's location out of town and they walked me through how simple the process is to transfer and they themselves cannot understand why I am having issues.  At that point I decided to ask for the manager and I still cannot get any help.  At what point does this surpass bad customer service and become deceptive business practices or fraud because I have paid for a service that they offer but am not getting it?", "pics": null, "resp": {"time": 1468338485623, "text": "Thank you for taking the time to inform us about this situation. We have provided the transfer of your service, as requested. Again, thank you for bringing this matter to our attention."}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "107419793233341466072", "name": "Lena Smile", "time": 1366743948404, "rating": 4.0, "text": "My experience was very good. I enjoyed every moment. My therapist was attentive to my needs and very professional. I've had massages all over the US by licenced therapists from the phenomenal to the absolute worst. Massage envy is not only a good experience but it's a great value!", "pics": null, "resp": null, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "104984216797636833085", "name": "Jeannie Dickerson", "time": 1460558544351, "rating": 1.0, "text": "Bad management. Don't do business here!!  I cancelled my membership back in November 2015 and started getting bank drafts again this month. I didn't freeze my account...I cancelled it!!  I've called twice in the past two weeks with no return phone calls. I went down in person and no manager was there and apparently comes and goes with no set schedule according to the staff. I simply want my account completely cancelled and my money refunded. I don't know if the manager is a coward or a thief. I will NEVER be doing business here again and will never refer anyone here for business. The massages were wonderful but the management stinks.", "pics": null, "resp": null, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "107821262878473901572", "name": "Latoya Cunningham", "time": 1539730777090, "rating": 5.0, "text": "Chris the masseuse was amazing!! This was the best experience I have ever had hands down....I frequent massage parlors often! Sandy the esthetician provided me wi th a 5 star facial!! I didn't want to leave! Great atmosphere!", "pics": null, "resp": {"time": 1541025228524, "text": "Latoya, we are so happy to read such a great review about Massage Envy - Hoover! You really made our day today."}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "107821262878473901572", "name": "Latoya Cunningham", "time": 1539730777090, "rating": 5.0, "text": "Chris the masseuse was amazing!! This was the best experience I have ever had hands down....I frequent massage parlors often! Sandy the esthetician provided me wi th a 5 star facial!! I didn't want to leave! Great atmosphere!", "pics": null, "resp": {"time": 1541025228524, "text": "Latoya, we are so happy to read such a great review about Massage Envy - Hoover! You really made our day today."}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "115188127869582109643", "name": "Jenn", "time": 1471137759840, "rating": 2.0, "text": "Almost impossible to get an appointment here. You must make multiple calls to get someone to answer the phone. There is a voicemail. I have left messages but no one returns the call. When I do get a person to answer they are obviously bothered or confused by my request to make an appointment.\nThe massage therapists are decent  but I absolutely dread calling to make an appointment. So much so that I don't use my massages like I should or could.\nI let them charge my debit card once then found out at my next visit that they automatically added it to my file, without my permission, and can charge it whenever they want to now as evidenced by the receptionist telling me she didn't need my signature she can just charge me whenever I come in. Wow.", "pics": null, "resp": {"time": 1471370019017, "text": "Jenn, first thank you for taking the time to reach out to us with your review and for your praises about our massage therapists! We take great pride in making sure our therapist are well-trained and customer-service oriented. We are sad to hear that this experience did not carry over with our appointment setting process. We do try to accommodate every member and guest, and at times there can be issues when scheduling appointments. Please know that is not how we like to conduct business and that we are working on making changes to solve these issues. Again, we do apologize for this inconvenience to you and if you would like, please call Caleb at (205) 988-6400."}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "116156408425250106834", "name": "LaDonna Tedder", "time": 1461257932645, "rating": 1.0, "text": "This place is terrible!  The main selling point for purchasing a membership was the extended hours they offer for appointments.  Who knew it is completely impossible to get an appointment during the evening and when you are lucky enough to get an appointment, they call a few hours prior to cancel the appointment stating the therapist had resigned.  I would definitely NOT recommend wasting your money here.", "pics": null, "resp": null, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "103887467730084885850", "name": "Brooke Robinson", "time": 1470148816842, "rating": 1.0, "text": "I called in today in reference to a double charge on my bank account for my membership fee. Hannah answered the phone and was very unprofessional and definitely not helpful. Not only was she not able to adequately explain the reason for the double charge, she was refusing to provide any helpful information to help resolve the issue and disconnected our phone call prompting me to call again. I requested the manager and was told he had been out of the office for a week and she had no idea when he would be back. What a joke of an establishment. I requested the Regional Manager name and number, oh but I was advised there was no number for her to provide to file a complaint. Their employees need to be trained or as Hannah explained they do not get paid to offer customer service. I will definitely cancel this membership and tell everyone I know to not patronize this establishment.", "pics": null, "resp": {"time": 1471369798503, "text": "Brooke, We are very sorry that your bank account was charged twice. There can be issues with the system at times and would like to discuss this with you as soon as you can. Please know that is not how we like to conduct business and that we are working on making changes to solve these issues regarding customer service. Again, we do apologize for this inconvenience to you and if you would like, please call Caleb at (205) 988-6400."}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "113680178470651313709", "name": "Noah Shrader", "time": 1471986402391, "rating": 2.0, "text": "My massage therapist was very kind, but she started late and ended early. The pre-massage wait wasn't very relaxing (should have had a much more calming waiting experience). Comparing to other experiences, this was pretty lack luster.", "pics": null, "resp": null, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "117912584369400297045", "name": "Joyce Moore", "time": 1555097415024, "rating": 4.0, "text": "They did a really good job with the message on our body", "pics": null, "resp": {"time": 1555521099497, "text": "We're happy to hear that you had a positive experience with us and we look forward to seeing you again soon!"}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "101369485385982807687", "name": "mary logan", "time": 1529697504371, "rating": 5.0, "text": "I have enjoyed every massage here and have been a happy member for almost a year now!", "pics": null, "resp": null, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "112938250390004037130", "name": "Haley Messer", "time": 1483580334275, "rating": 1.0, "text": "I scheduled an appointment at the Massage Envy in Hoover over a week in advance and received a reminder phone call and voicemail the day before my scheduled massage to confirm the time and date. I arrived at the location at the scheduled time and they claimed that my appointment was on a different day. I told them I had received a voicemail confirming that the appointment time was, in fact, when I thought it was. They \"apologized\" by telling me that they have made the same mistake in the past and there was nothing they can do. They have a policy stating that clients must cancel at least 1 day before the massage to avoid wasting the therapist's time and I find it disrespectful and unprofessional that they don't hold themselves to the same standards. They were unapologetic and appeared unconcerned by the mistake. Don't waste your time on the poor customer service at this Massage Envy.", "pics": null, "resp": {"time": 1483633066288, "text": "Haley, we’re sorry to hear about your recent experience and thank you for sharing your feedback. Please continue letting us know how we can improve so we can better our services."}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "110033384878967812321", "name": "Champion Deivanayagam", "time": 1399827658421, "rating": 4.0, "text": "We were members for more than 2 years.  In the last several months, the staff has been very unhelpful (really rude).  They cancel scheduled appointments in a haphazard way, and don't even apologize.  I would stay away until there is some improvement in the front bench staff.  The massage therapists were really good though. Sorry, we will have cancel our membership.\nUPDATE:\nSpoke with Shelby the Manager.  She is trying to correct the problem, and we are pleased with her initiative at this point.  We continue to be members", "pics": null, "resp": null, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "101285088536894909362", "name": "Callie Cox", "time": 1457761548798, "rating": 1.0, "text": "I spend $54 a month for a membership to this place. It is SO bad that I would rather let them keep the $54 per month. I always consider scheduling, but it's just so bad I would rather not go. I can't wait until the contract I foolishly signed is up. I have not requested to cancel because I understand the terms of the contract.", "pics": null, "resp": {"time": 1457967305104, "text": "Thank you for writing your review of our business. We apologize for not living up to your expectations for our business. We are happy to work with you in regards to finding you a therapist that would be more in tuned to your massage needs and/or your membership. Please call the clinic (205) 988-6400 and the manager will be happy to assist you. Again, we apologize for you experience."}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "110033384878967812321", "name": "Champion Deivanayagam", "time": 1399827658421, "rating": 4.0, "text": "We were members for more than 2 years.  In the last several months, the staff has been very unhelpful (really rude).  They cancel scheduled appointments in a haphazard way, and don't even apologize.  I would stay away until there is some improvement in the front bench staff.  The massage therapists were really good though. Sorry, we will have cancel our membership.\nUPDATE:\nSpoke with Shelby the Manager.  She is trying to correct the problem, and we are pleased with her initiative at this point.  We continue to be members", "pics": null, "resp": null, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "101285088536894909362", "name": "Callie Cox", "time": 1457761548798, "rating": 1.0, "text": "I spend $54 a month for a membership to this place. It is SO bad that I would rather let them keep the $54 per month. I always consider scheduling, but it's just so bad I would rather not go. I can't wait until the contract I foolishly signed is up. I have not requested to cancel because I understand the terms of the contract.", "pics": null, "resp": {"time": 1457967305104, "text": "Thank you for writing your review of our business. We apologize for not living up to your expectations for our business. We are happy to work with you in regards to finding you a therapist that would be more in tuned to your massage needs and/or your membership. Please call the clinic (205) 988-6400 and the manager will be happy to assist you. Again, we apologize for you experience."}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "114196002952749417317", "name": "Raven Crumbley", "time": 1459970603938, "rating": 1.0, "text": "This is the second time I've had to deal with management because of mishaps on their end. I cancelled my membership but am still getting charged and I've tried to call them 14 times today with no answer and no callback from the messages I left. Don't go here, it's not worth the hassle.\n\nUpdate: Finally got someone on the phone but was told management won't be back until Friday. No management there for two days? This place really is garbage and has the worst customer service.", "pics": null, "resp": {"time": 1460126637942, "text": "Raven, we want to thank you for your past business. In regards to your complaint, we have closed your account and fully refunded the last payment to compensate for the confusion. Again, we apologize for an inconvenience we may have caused you."}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "104973614829494649747", "name": "leslie davis", "time": 1403034950554, "rating": 2.0, "text": "I am a member of massage envy.  I travel for my job so I get massages around the USA and tend to be pretty happy with the experiences at Massage Envy.  I was hesitant to call this location because of the negative reviews.  I just called and the lady that answered was just as rude as the reviews said.  Short, flippant and I did not get an appointment.  I find it hard to believe that they are booked solid for the next three days.  Business must be good despite the negative reviews!", "pics": null, "resp": null, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "116822605046651858644", "name": "Stephen Juneau", "time": 1446041390216, "rating": 1.0, "text": "This place is garbage. Management is terrible and wont answer the phone when he is needed. I do not recommend using this location.", "pics": null, "resp": null, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "108951840426588220526", "name": "Kimberly Williams", "time": 1392747040855, "rating": 2.0, "text": "The staff canceled my reservation on a very busy weekend without my knowledge and never apologized for the inconvenience. After speaking with the manager,Lauren, I realized how this business gets by with such terrible customer service. Lauren is the most rude and unprofessional manager that I've ever had the displeasure of dealing with. She didn't try to fix this problem or take responsibility for the mistake made by her and her staff. She verbally harrassed me over the phone and was EXTREMELY confrontational. I WILL NEVER return!", "pics": null, "resp": null, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "110339968343360621059", "name": "Judy Sandoval", "time": 1506196064951, "rating": 5.0, "text": "THANK YOU FOR THE BEST MASSAGE I HAVE EXPERIENCED,, I WLL BE BACK", "pics": null, "resp": {"time": 1506358725594, "text": "Judy Sandoval, thank you for taking the time to leave us a review! We are happy to hear about your positive experience!"}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "102976677382947809638", "name": "Ashley Hendricks", "time": 1501791729694, "rating": 1.0, "text": "This is one of the most unprofessional places I have ever visited. I canceled my membership but not before I had to wait an entire year to do it. I was attempting to schedule the rest of my unused massages/facials and the people at the front desk are so incompetent that they can't even get the times right! I specifically asked for a certain time for my facial and had my massage cancelled the day before and asked to move my facial up to the time that my massage previously was set at and the lady confirmed the time. I came the next day at the time I arranged only to sit for 10mins after the start time and I walked out to inquire what happened and the lady couldn't even find me on the schedule at first and then she said oh no your at another time which was an hour later! I reminded her that I had changed the time of my facial to an earlier time yesterday and she got an attitude and was like no there's only one person that does the facial and she was already booked, well why didn't you tell me that yesterday!! They are a subpar massage place and I will not be recommending them to anyone! Also the massages aren't even good and they make you pay for an hour but only massage you for 45 mins...just a complete rip off!", "pics": null, "resp": {"time": 1501796973917, "text": "Thank you for voicing your concerns, Ashley Hendricks. Please message us directly through our online portal at http://bit.ly/2mQKBpW so we can address this further."}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "107002903271769919729", "name": "Karlstan Wilson", "time": 1503867434310, "rating": 1.0, "text": "I made an appointment for my wife.... the appointment was set for 5pm. I called to cancel around 130pm. After I called they ran my card for the full amount of the services.\nAfter calling back the saff member (Kalie) or somthing like that was rude and hung up on me.", "pics": null, "resp": {"time": 1503953356707, "text": "Hi, Karlstan Wilson, thank you for bringing this matter to our attention. Please message us directly through our online portal at http://bit.ly/2mQKBpW so we can address this further."}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "117412963931577443238", "name": "Ben Victor", "time": 1396569487092, "rating": 1.0, "text": "My massage was ok, but the hard sell at the end, turned me off.  Save your money, and go somewhere else.", "pics": null, "resp": null, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "114008287890365156805", "name": "David Ciaverella", "time": 1495085071060, "rating": 1.0, "text": "Total waste of time and money. Asked to focus on low back and legs for the session as I have a running race coming up. Spent 30 minutes on my shoulders. I am not even sure if these are licensed therapists to ignore the patients primary problems", "pics": null, "resp": {"time": 1495128686995, "text": "Thank you for voicing your concerns, David Ciaverella. Please message us directly through our online portal at http://bit.ly/2mQKBpW so we can address this further."}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "100164018363104460508", "name": "Debra Bryant", "time": 1515207720214, "rating": 5.0, "text": "Great place. Best massage therapists.", "pics": null, "resp": {"time": 1484346908996, "text": "Thank you for taking the time to leave us a positive review, Debra!"}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "103860361156132089099", "name": "T C", "time": 1504148323484, "rating": 1.0, "text": "The level of customer service is poor and after talking to management I was very disappointed at how the situation was handled. I will never do business with this company again and do not recommend their services at all.", "pics": null, "resp": {"time": 1504213243529, "text": "Thank you for voicing your concerns, T C. Please message us directly through our online portal at http://bit.ly/2mQKBpW so we can address this further."}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "114219680754061720457", "name": "Tina Dickens", "time": 1548633217073, "rating": 5.0, "text": "Nice, clean and friendly staff.", "pics": null, "resp": {"time": 1548778809447, "text": "We're so happy to see your high rating! We appreciate it!"}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "107973344835623769609", "name": "DeAngel Enge", "time": 1555218053601, "rating": 5.0, "text": "Maya is awesome", "pics": null, "resp": {"time": 1555709880786, "text": "We're happy to hear that you enjoy your sessions with Maya! See you next time, DeAngel!"}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "113617223430777266584", "name": "Hartley Moon", "time": 1564741491682, "rating": 5.0, "text": "Ask for Nikia", "pics": null, "resp": {"time": 1565048041552, "text": "We're happy to hear that you found the perfect therapist for your specific needs! We always love to receive great feedback!"}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "106089465125159672946", "name": "Heatherly McGraw", "time": 1530744534868, "rating": 3.0, "text": "Ok", "pics": null, "resp": {"time": 1531430314983, "text": "We regret that you didn't have a five star experience with us. Please reach out to us at http://bit.ly/2mQKBpW so that we can learn how to improve your experience."}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "115244516103631550820", "name": "Chris Cochran", "time": 1526687883642, "rating": 5.0, "text": "Great!", "pics": null, "resp": {"time": 1527002370834, "text": "Hi Chris, so many stars! We're happy to have earned it and excited to continue delivering this same exceptional experience! See you next time!"}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "103103865203187160087", "name": "William Whitsett", "time": 1525010088571, "rating": 4.0, "text": "Ok", "pics": null, "resp": {"time": 1525193668771, "text": "Thank you William for taking the time to let us know how we did. We will strive to deliver a five-star experience the next time you come visit us. Have a nice day!"}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "115021408693291861803", "name": "Azadeh Hodjat", "time": 1516038340266, "rating": 5.0, "text": "Professional massage center", "pics": null, "resp": null, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "116101048336931916947", "name": "Jeremy", "time": 1503022347775, "rating": 1.0, "text": "Under management of Caleb Matthews this place was run to the ground.", "pics": null, "resp": null, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "103896677473855093457", "name": "Stephanie Froman", "time": 1469580360183, "rating": 1.0, "text": "Horrible management!  They make it impossible to cancel your membership...don't get one!", "pics": null, "resp": {"time": 1470323135198, "text": "Stephanie, thank you taking the time to inform us of your frustrations. We apologize for any inconvenience that you have had with trying to cancel your membership. We have set procedures that have been put in place by Massage Envy Corporate, if this situation should come up when a client would like to cancel their membership. If you would like to give us a call back, we would be more than happy to discuss these procedures with you. Again, we do apologize and thank you."}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "108339579814667267733", "name": "Marquise Moore", "time": 1461960915495, "rating": 1.0, "text": "Made an appointment a week out and called the day of my appointment tor confirmation. I found out that he  appointment was never made .", "pics": null, "resp": null, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "113826023630335267953", "name": "Toshiba Hampton", "time": 1450047921220, "rating": 1.0, "text": "Please in the name of all that is holy refrain from purchasing a membership from this company!! I have repeatedly asked the staff to cancel my membership and I constantly being put off and lied to with regards to a member of the management team contacting me. Now they have charged my credit card and seem to have every intention of stealing from me. I will be contacting the BBB about this.", "pics": null, "resp": null, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "113394546622681409788", "name": "Joe Cash", "time": 1530138619909, "rating": 5.0, "text": "(Translated by Google) Grest\n\n(Original)\nGrest", "pics": null, "resp": {"time": 1530286029088, "text": "Thanks for letting us know how we did! We hope to be of service to you again soon, Joe!"}, "gmap_id": "0x888921a5a8c5446b:0xf6a2819fb1138c21"}
{"user_id": "100388679881268824286", "name": "Sean Pollitt", "time": 1623281601733, "rating": 5.0, "text": "Very professional. Great massage at an unbeatable price. 100% recommend this establishment if you’re trying to release some built up tension.", "pics": null, "resp": null, "gmap_id": "0x888ccfe66814ec15:0xa780206999dd36f8"}
{"user_id": "108571985296209352124", "name": "Lance Spann", "time": 1619285672082, "rating": 5.0, "text": "I enjoyed my experience at this establishment. Communication is a little bit of a challenge as both women speak a different language, but they understand you. The massage was PERFECT!!! Hit really deep and the hot stone was hot and soothing. I will definitely be returning.", "pics": null, "resp": null, "gmap_id": "0x888ccfe66814ec15:0xa780206999dd36f8"}
{"user_id": "113277281536257075135", "name": "Natasha Nelor", "time": 1610994595221, "rating": 1.0, "text": "We went in for a Couple's massage. I should have known when we had to pay up front that the service would not be that great.  No visible sanitizer. I had to ask the masseuse to sanitize her hands upon  returning to the room.  Massage was not firm even after I asked for firm. The two ladies kept talking to each other which made the massage not relaxing. Stopped to take phone calls...just know that I would not return, even for a free massage, and definitely would not recommend.", "pics": null, "resp": null, "gmap_id": "0x888ccfe66814ec15:0xa780206999dd36f8"}
{"user_id": "113214663076484487859", "name": "Kristin Redd", "time": 1598504296242, "rating": 5.0, "text": "I went to this massage parlor yesterday, and I had an awesome experience. The customer service and professionalism were excellent. The masseuse made sure to take care of my needs, make me feel comfortable, and conversated with me during my visit. She repeatedly asked if the pressure she was using was satisfactory. If I don't go back again this week, I'll be there next week!!!", "pics": null, "resp": null, "gmap_id": "0x888ccfe66814ec15:0xa780206999dd36f8"}
{"user_id": "117359823618177656618", "name": "James Foster", "time": 1617591702111, "rating": 3.0, "text": "Good massage, but not enough draping.", "pics": null, "resp": null, "gmap_id": "0x888ccfe66814ec15:0xa780206999dd36f8"}
{"user_id": "104748089768267856566", "name": "johnygreen81", "time": 1605482545022, "rating": 5.0, "text": "Wonderful masseuse, very relaxing massage, both my wife and I will be returning", "pics": null, "resp": null, "gmap_id": "0x888ccfe66814ec15:0xa780206999dd36f8"}
{"user_id": "103512524441921932222", "name": "pfchutchison 23", "time": 1605059482330, "rating": 5.0, "text": "This is a good place to go for husbands to get away from there money hungry nagging wives", "pics": null, "resp": null, "gmap_id": "0x888ccfe66814ec15:0xa780206999dd36f8"}
{"user_id": "107057909687936188880", "name": "Caramell Kisses", "time": 1575401598348, "rating": 2.0, "text": "Wasn't spectacular.  I won't be returning. The massage lady was nice. There was spa music playing but there was a lot of background noise. Doors slamming and such which took away from what could have been a relaxing experience.", "pics": null, "resp": null, "gmap_id": "0x888ccfe66814ec15:0xa780206999dd36f8"}
{"user_id": "114814171246469996131", "name": "James Forestal", "time": 1612042142555, "rating": 5.0, "text": "Great massage", "pics": null, "resp": null, "gmap_id": "0x888ccfe66814ec15:0xa780206999dd36f8"}
{"user_id": "115699124073271655797", "name": "Kalie Kory", "time": 1565491512255, "rating": 5.0, "text": "Love!!! Been coming to Ping for years! Best ever and will never ever go anywhere else!", "pics": null, "resp": null, "gmap_id": "0x888ccfe66814ec15:0xa780206999dd36f8"}
{"user_id": "100869474854682343990", "name": "Grace Canarios", "time": 1567790908203, "rating": 5.0, "text": "Perfect for deep massage. 110%  satisfied.", "pics": null, "resp": null, "gmap_id": "0x888ccfe66814ec15:0xa780206999dd36f8"}
{"user_id": "109291473891762461049", "name": "Cynthia Allen", "time": 1538151479607, "rating": 5.0, "text": "Clean fresh relaxing atmosphere. Strong blessed hands that left me feeling stress free and relaxed.", "pics": null, "resp": null, "gmap_id": "0x888ccfe66814ec15:0xa780206999dd36f8"}
{"user_id": "111524250486045838526", "name": "Nicole Scott", "time": 1535912730855, "rating": 5.0, "text": "Nice Clean atmosphere Laura really was appreciated it great stress relief...", "pics": null, "resp": null, "gmap_id": "0x888ccfe66814ec15:0xa780206999dd36f8"}
{"user_id": "101535228225600627368", "name": "Timothy James", "time": 1557438026501, "rating": 4.0, "text": "Great massage!", "pics": null, "resp": null, "gmap_id": "0x888ccfe66814ec15:0xa780206999dd36f8"}
{"user_id": "103638919364017095231", "name": "Greg Hardy", "time": 1566341755416, "rating": 3.0, "text": "Ok", "pics": null, "resp": null, "gmap_id": "0x888ccfe66814ec15:0xa780206999dd36f8"}
{"user_id": "110884304083708483984", "name": "Enrique Harris", "time": 1624035707907, "rating": 3.0, "text": "Good massage.", "pics": null, "resp": null, "gmap_id": "0x888ccfe66814ec15:0xa780206999dd36f8"}
{"user_id": "118425434651048056822", "name": "Amin Tarver", "time": 1623957978375, "rating": 5.0, "text": "(Translated by Google) Camera\n\n(Original)\nYees", "pics": null, "resp": null, "gmap_id": "0x888ccfe66814ec15:0xa780206999dd36f8"}
{"user_id": "104061775127843909388", "name": "Tina kong", "time": 1596347943839, "rating": 5.0, "text": "My husband and I have a 1-hour deep massage. The massage technique is very good, very busy, with a good attitude, and very enthusiastic. I especially like the hot stone massage!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOZI0-pnyc5eMPQupr21W-JMFw6E7jsNkf4Zk2R=w150-h150-k-no-p"]}], "resp": {"time": 1597270632638, "text": "Thank you and good review"}, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
{"user_id": "106618947085141945702", "name": "L John", "time": 1544308645696, "rating": 5.0, "text": "Asked for a 60 minute deep tissue and it was awesome! Niko did an awesome job. I will definitely come back before I leave the state.  I also came in as a walk-in on a Saturday so that was a huge plus", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMbt9oBVFmT6bdENtQmy0PZuLPp9w0EcSNK0G-o=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMxl0qJzJu5PtnVcuG4O7WZKiMAOYrf840wY1_g=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOMGwxVz07wVddHQP0W98YWAYpxU4KUjM-LvWsW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPDHdUqi9mgIzK5so7sh3OQ-dP4kZSktd3jFlu9=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
{"user_id": "105117884764150315043", "name": "TouchdownEnt1", "time": 1603577115209, "rating": 5.0, "text": "Had an Awesome experience!! Definitely on the top of my list!!! Nicky was amazing! Firm and very professional!! Definitely will return!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMMh2mPbHG4X9PQrc3IbO-deBGkcm1aByOD6LNI=w150-h150-k-no-p"]}], "resp": {"time": 1603589713249, "text": "thank you review！"}, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
{"user_id": "116857143498100354820", "name": "Richard Lindsey", "time": 1616884477822, "rating": 4.0, "text": "I will be going to get my professional massage I do need. I'm sure that I will be pleased.", "pics": null, "resp": null, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
{"user_id": "102717775199042867679", "name": "Jessika Roulette", "time": 1605642281120, "rating": 5.0, "text": "Best place in Mobile for a massage.  Hands down the best, professional,  massage I've ever had. Highly recommend.", "pics": null, "resp": {"time": 1602531996219, "text": "Thank you very much for your support, thank you for your review"}, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
{"user_id": "106743995664657933684", "name": "lily Fleury", "time": 1599677327607, "rating": 5.0, "text": "I called to make an appointment, and the masseur did his best to give me a sore body massage and a scalp massage. I especially like the hot stone massage OMG. [强][强][强]She is so professional and does a great job!  I will definitely go again!  !  !", "pics": null, "resp": {"time": 1602532070487, "text": "Thank you very much for your support, thank you for your review"}, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
{"user_id": "116733170623613156423", "name": "Jordan Curuso", "time": 1598927479953, "rating": 2.0, "text": "I’m from Orlando. Massage was decent but A lot of noise in the building couldn’t relax. She didn’t make me feel relaxed.  Will probably try somewhere else or ask for different girl next time. I like a little more enthusiasm from masseuse. She didn’t seem happy", "pics": null, "resp": {"time": 1599091038792, "text": "Hello!Jordan Curuso！Thank you for your comment, We appreciate customer feedback because this is how we can improve management and service!"}, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
{"user_id": "115484311998952635418", "name": "Bridgette L", "time": 1606775468485, "rating": 5.0, "text": "What an amazing experience we had! We will definitely be back every month for our hour long massages!", "pics": null, "resp": {"time": 1607930063165, "text": "Thank you very much for your support, thank you for your review"}, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
{"user_id": "110474321550064273441", "name": "Timmy", "time": 1601088733575, "rating": 5.0, "text": "nice and comfortable massage, staffs are friendly and professional. Would recommend to anyone who goes there, you will not regret this decision.", "pics": null, "resp": {"time": 1602532061400, "text": "Thank you very much for your support, thank you for your review"}, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
{"user_id": "112377147817050179248", "name": "Brad Hinton", "time": 1615061324914, "rating": 5.0, "text": "Great experience and super convenient!", "pics": null, "resp": null, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
{"user_id": "111743556497664151644", "name": "Ron Gardner", "time": 1603197158169, "rating": 3.0, "text": "First of all when I arrived for my appointment the therapist wanted payment before I went to treatment room, second the therapist left the room several times so I did not receive a full hour and finally at the end of service the therapist stood in front of door with hand extended stated \" my tip\"!  On that alone I will not go back, I don't mind leaving a tip however it should not be expected or demanded..., I work in the service industry and I would never ask for a tip!", "pics": null, "resp": null, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
{"user_id": "105276570708884480258", "name": "Luke Bill", "time": 1602716434563, "rating": 5.0, "text": "Magic, magic. Chinese massage shop, excellent, I think I will come back.", "pics": null, "resp": null, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
{"user_id": "111044720607562193930", "name": "Chris Elon", "time": 1597168237707, "rating": 5.0, "text": "great massage, nice staff and the environment is very clean, comfortable and car parked in front of Shop.", "pics": null, "resp": {"time": 1597270619795, "text": "Thank you and good review"}, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
{"user_id": "114154327284787347773", "name": "Angela Hayes", "time": 1581976725865, "rating": 4.0, "text": "First,  let me say I've been here multiple times and I'll continue to go. The services are great, the environment peaceful and clean, the therapist thorough. This place is busy,  so they will leave the room to answer the phone etc, but will usually compensate the service time.\nSecondly,  you should be very clear about the services you want because I think I just got hustled.\nI asked for the \"60 minute herbal...\", and  couldn't finish my sentence because she said \"yes\". There's only 1 service with Herbal in the title. She led me to a massage room instead of reflxology, so I asked again for the herbal. I couldn't finish my sentence because she said yes.\nWent to pay at the end, she charged me for the massage (more $). She was able to fluently negotiate the price, although it's not what I intended on spending.\nI also asked for Nicole and was again told \"yes\", but that didn't happen.  I still would have went if she wasn't available,  whatever.\nI didn't get this chic's name but great massage and hell of a hustle! 😄 I will definitely be back, but will be clearer about the service I want.", "pics": null, "resp": null, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
{"user_id": "109001275074552258615", "name": "western Misch", "time": 1565728776107, "rating": 5.0, "text": "This place is amazing! I just had my first massage here and I feel so relaxed. The body massage is definitely worth it and the staff is so kind. I will definitely be coming back!", "pics": null, "resp": {"time": 1602532080074, "text": "Thank you very much for your support, thank you for your review"}, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
{"user_id": "110113944282084380063", "name": "Lindsey Morgan", "time": 1583683956785, "rating": 1.0, "text": "Went to have a massage and was asked 3 times about payment before I even made it to the massage room. The massage was ok but they defiantly give you what they want to.I asked for my upper back neck and arms only and she spent most of the time on my lower back and legs. They most defiantly ask for a tip!on The lady made a face at my husband and I and asked for more when my husband gave her five dollars. He gave her $5 more. I will not go back! Plus they were offering to give the male clients baths!!!!", "pics": null, "resp": {"time": 1583886618589, "text": "Hello!Lindsey Morgan , Thank you for your comment, We appreciate customer feedback because this is how we can improve management and service！"}, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
{"user_id": "111245878910928731910", "name": "Will Seymour", "time": 1593721363350, "rating": 5.0, "text": "Very professional.  Nice people too! Niko is the best!", "pics": null, "resp": {"time": 1597270660075, "text": "Thank you and good review"}, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
{"user_id": "118034100790972661832", "name": "Jiank San", "time": 1554235367900, "rating": 5.0, "text": "This place is amazing! I just had my first massage here and I feel so relaxed. The body massage is definitely worth it and the staff is so kind. I will definitely be coming back! 😜", "pics": null, "resp": {"time": 1602532098265, "text": "Thank you very much for your support, thank you for your review"}, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
{"user_id": "106761356842855116696", "name": "Adeline Letendre", "time": 1564771693693, "rating": 5.0, "text": "I had a massage with Amanda, best massage I've had in years! My sciatic nerve is quite inflamed and she was able to soothe things with strenght and precision! Wonderful massage! Marvelous!", "pics": null, "resp": {"time": 1602532089938, "text": "Thank you very much for your support, thank you for your review"}, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
{"user_id": "111425991992861313716", "name": "Gretchen Lerche", "time": 1571333759142, "rating": 1.0, "text": "Rude!!! Ask for tip before service. Have called for foot massage more than once, they say come. Get there and say “no can’t do foot only full massage.” What, why?! Both are 60 minutes?! They argue and I leave. My thought is it’s because a foot massages is less than full body for 60 min. Not acceptable. Why advertise you offer it and NOT🤬🤯😡", "pics": null, "resp": {"time": 1571765537688, "text": "Hello, Gretchen\nThank you for you feedback. There are a few misunderstandings we would like to clear. We do offer foot massage services. Each therapist has his own different job, and we only accept phone calls for foot massage.at the moment you walked in, We called the monitoring system of the day,I talked to the therapist  who talked to you when you walked in and we never ask for tips to any customers. We apologize for all the misunderstandings.Thank you for your continued Support and advice，We will improve your suggestions."}, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
{"user_id": "117909881321049257673", "name": "Toni Edlund", "time": 1548018976994, "rating": 5.0, "text": "Amy is wonderful!!!! So sweet and gave me a fabulous massage I will be back soon and I will let everyone I know of this amazing place. It is also very affordable.", "pics": null, "resp": null, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
{"user_id": "105140998986075587340", "name": "haiping sun", "time": 1528524710740, "rating": 5.0, "text": "Such a great massage!!!\nI called a few hours before coming and they were able accommodate us for a couples massage same day. I have been going to another place for a few years however it’s a bit too far from home so I was searching for a place closer to home and I’m so happy I came to massage wellness.  They said they just open .so happy :D I found my new spot. For sure coming back!!!", "pics": null, "resp": null, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
{"user_id": "109571632669327986389", "name": "Sharon “Sam” McBride", "time": 1544727271931, "rating": 5.0, "text": "Awesome experience. The reflexology session is basically a full body massage except being fully clothed. The most relaxing 50 minutes I have ever had.", "pics": null, "resp": null, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
{"user_id": "105939333900661715848", "name": "Emily Green", "time": 1526189856288, "rating": 5.0, "text": "Today I had a 60 minute deep tissue massage by tony .he was AMAZING!  I came to Mobile to relax for a week and desperately needed a massage after working 12 to 14 hours a day.  I too am a massage therapist who appreciates an excellent massage from a person who is passionate about what she or he does.  tony  is that person.  Between the depth of he massage foot ，the hot stones and the stretching,  I came out of that room feeling blood moving and energy rising once again.  Before I left the establishment,  I booked again and am bringing a friend.  Thank you tony so much.", "pics": null, "resp": null, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
{"user_id": "111883732281690694853", "name": "WILL K", "time": 1537413375514, "rating": 5.0, "text": "Great place. Very good massage. And affordable. Must see Tina", "pics": null, "resp": null, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
{"user_id": "101988056117881044521", "name": "Donna Barnes", "time": 1549591474346, "rating": 5.0, "text": "Best Deep Tissue Massage EVER! Therapist very sweet, barely spoke English though.", "pics": null, "resp": {"time": 1602532108854, "text": "Thank you very much for your support, thank you for your review"}, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
{"user_id": "117106535615367122176", "name": "Rebecca S", "time": 1551752945887, "rating": 5.0, "text": "Same day appointment and the foot soak and massage was amazing!", "pics": null, "resp": {"time": 1602532115039, "text": "Thank you very much for your support, thank you for your review"}, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
{"user_id": "112874740185096460078", "name": "Tyler Thomas", "time": 1540058882731, "rating": 5.0, "text": "Niko gave me the best deep tissue massage I've ever had.", "pics": null, "resp": null, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
{"user_id": "107039384964578839329", "name": "Shaoyi Lu", "time": 1526104148889, "rating": 5.0, "text": "Very peaceful, relaxing environment. Very professional. Highly recommended", "pics": null, "resp": null, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
{"user_id": "108258032546552020244", "name": "brandon berry-shoots", "time": 1528856819145, "rating": 5.0, "text": "Nicole did a amazing job I will be back to see her only!", "pics": null, "resp": null, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
{"user_id": "107097928830506881152", "name": "William Terry", "time": 1528659737496, "rating": 5.0, "text": "Niko was great!  Very polite and professional.", "pics": null, "resp": null, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
{"user_id": "102343343450991939191", "name": "Ash P", "time": 1540147505003, "rating": 5.0, "text": "Clean and efficient service thank you !!", "pics": null, "resp": null, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
{"user_id": "101378710712520215017", "name": "Rafik Elkadi", "time": 1553360339029, "rating": 5.0, "text": "clean and quiet place , efficient masseur", "pics": null, "resp": null, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
{"user_id": "105079110569592326794", "name": "Tracy Wilson", "time": 1583102241869, "rating": 5.0, "text": "Excellent and reasonable", "pics": null, "resp": {"time": 1599091114224, "text": "Thank you and good review"}, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
{"user_id": "115435163671700963817", "name": "Barry Murrill", "time": 1541997453456, "rating": 5.0, "text": "OMG! That was AMAZING!!", "pics": null, "resp": null, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
{"user_id": "110334781045234229121", "name": "Jericho Lopez", "time": 1525914974495, "rating": 5.0, "text": "Niko was great!", "pics": null, "resp": null, "gmap_id": "0x889a4d8378741073:0xfd037bdf17979e3d"}
