{"user_id": "108911322545359931984", "name": "Randy Hughes", "time": 1546446044890, "rating": 5.0, "text": "The candle light service was great  a special place to worship", "pics": null, "resp": null, "gmap_id": "0x8889754489a6ce89:0xbbf7335694f61064"}
{"user_id": "108911322545359931984", "name": "Randy Hughes", "time": 1546446044890, "rating": 5.0, "text": "The candle light service was great  a special place to worship", "pics": null, "resp": null, "gmap_id": "0x8889754489a6ce89:0xbbf7335694f61064"}
{"user_id": "108911322545359931984", "name": "Randy Hughes", "time": 1546446044890, "rating": 5.0, "text": "The candle light service was great  a special place to worship", "pics": null, "resp": null, "gmap_id": "0x8889754489a6ce89:0xbbf7335694f61064"}
{"user_id": "108911322545359931984", "name": "Randy Hughes", "time": 1546446044890, "rating": 5.0, "text": "The candle light service was great  a special place to worship", "pics": null, "resp": null, "gmap_id": "0x8889754489a6ce89:0xbbf7335694f61064"}
{"user_id": "109864698982264060464", "name": "Michael Donahue", "time": 1542039747255, "rating": 5.0, "text": "There are lots of friendly faces here. This is a gospel centered church that’s committed to the Lord and the community. It’s a smaller congregation but there are a lot of opportunities to get involved. The kids ministry is fantastic. The music is wonderful and the preaching is focused on applying God’s word to everyday life.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPdwOplESlsN3ElcesTRr3dAOZeDsyv3CHMBPI-=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888e8552da2897a1:0x9a619d989faa2ce1"}
{"user_id": "108161840318526811594", "name": "Shanika Ogburn", "time": 1564418858689, "rating": 4.0, "text": "This is a beautiful church with beautiful people. They were so very welcoming and sincere in their love. The preacher gave plenty of scripture during the sermon, which is a must for me. I enjoyed it. I only gave it 4 out of 5 stars because they do not have a true children's church. They have a daycare area though. Also, there was no choir or praise and worship team. They sing from hymnals. It's just not my personal preference. With that said, I would go back for just the people. They were truly awesome.\nNote: This church pops under African American churches but it is predominantly white.", "pics": null, "resp": null, "gmap_id": "0x8862680dc5e00603:0x25cd5095f9645d5c"}
{"user_id": "106071309994492755786", "name": "Rachael Metcalf", "time": 1549814825129, "rating": 5.0, "text": "Okay so the 5 stars are on friendliness. And bring Bible centered. But, if you are a conservative Baptist who uses the KJV, this is not it......which I am. But I was just visiting from out of town so I am glad I got to worship God which is the whole purpose. The church is beautiful!", "pics": null, "resp": null, "gmap_id": "0x8862680dc5e00603:0x25cd5095f9645d5c"}
{"user_id": "105954194714394798356", "name": "Jonathan McLaury", "time": 1529633684986, "rating": 5.0, "text": "Providence's worship is very Christ centered, the teaching is very much biblical and expository. The body is very focused on loving one another and loving newcomers.\n\nK-groups have been one of the best ways I've grown closer to the Lord and cultivated fellowship with other believers in the church.\n\nI wouldn't be the Christian I am today if it wasn't for the deep, rich faith found in the body of Christ at Providence Baptist.", "pics": null, "resp": null, "gmap_id": "0x8862680dc5e00603:0x25cd5095f9645d5c"}
{"user_id": "106054550814693818335", "name": "Niki Ivey", "time": 1529699167931, "rating": 5.0, "text": "This has been a great church for my growing family. The preaching is expository and Christ-centered. Small groups on Wednesday nights have allowed us to form relationships with others and have really blessed us!", "pics": null, "resp": null, "gmap_id": "0x8862680dc5e00603:0x25cd5095f9645d5c"}
{"user_id": "105416385051335856446", "name": "Phil King", "time": 1601641072702, "rating": 4.0, "text": "People are nice and the building is fantastic.", "pics": null, "resp": null, "gmap_id": "0x8862680dc5e00603:0x25cd5095f9645d5c"}
{"user_id": "117288382700570306350", "name": "Melissa Green", "time": 1544938466423, "rating": 5.0, "text": "Very inspiring services and very dedicated ministers. Beautiful Church, gracious and kind people, they make all visitors welcome. A church should be proud to be a member of. The music is well Organized , well played and when the choir sings well sung.", "pics": null, "resp": null, "gmap_id": "0x8862680dc5e00603:0x25cd5095f9645d5c"}
{"user_id": "104042006670373446855", "name": "bogster76", "time": 1555250698577, "rating": 5.0, "text": "Our family moved to Huntsville in the summer of 2017 and we visited this church while looking for a home church.\nWhile this church is not where we settled, I can honestly say it was the BEST sermon I heard in this area. I still listen to Pastor Blair’s expository preaching online and I love his commitment to the truth of God’s word and how he explains difficult passages with so much clarity. I find his teaching very thorough, challenging and humble.\nThe fact that he doesn’t use the KJV was a huge plus for me ( someone mentioned it as a negative) because I truly believe there are more accurate translations out there than the KJV.\n\n( disclosure about why we settled on another church: our family is a family of 5 and we simply have different needs and personalities so another church in the area came in first place when we all voted. That being said, our impression was that Providence Baptist is also a wonderful, God-honoring church.)", "pics": null, "resp": null, "gmap_id": "0x8862680dc5e00603:0x25cd5095f9645d5c"}
{"user_id": "102189634623163134860", "name": "Ric Crooks", "time": 1564145600005, "rating": 5.0, "text": "Providence Baptist Church (PBC) is a traditional, God-centered Reformed Baptist church.  PBC aligns itself with the 1689 LBCF; and centers on making and training disciples in God's word, stirring one another up to love and good works, and actively supporting missions.  I equate their adult Sunday School classes to seminary-style classes, with different levels based upon your current understanding of various Biblical truths.  The children's and youth classes are focused on teaching Scripture in a God-centered way.  The Worship Service follows the regulative principle of worship (prayer, singing [from hymnals], reading Scripture, expository preaching, and administering the ordinances).  It is a wonderful place to worship God alongside His people!", "pics": null, "resp": null, "gmap_id": "0x8862680dc5e00603:0x25cd5095f9645d5c"}
{"user_id": "112193802701949272085", "name": "Beau Sams", "time": 1526952615749, "rating": 5.0, "text": "Warm and friendly congregation has been welcoming to my family of five small children.  The church features strong, biblical teaching for both adults and children, expository Christ-centered preaching, and a focus on genuine Christian fellowship that has been refreshing.", "pics": null, "resp": null, "gmap_id": "0x8862680dc5e00603:0x25cd5095f9645d5c"}
{"user_id": "111185773979491432673", "name": "Michele Lofgren", "time": 1572522108100, "rating": 5.0, "text": "People who love the Lord.", "pics": null, "resp": null, "gmap_id": "0x8862680dc5e00603:0x25cd5095f9645d5c"}
{"user_id": "117196479761588259864", "name": "Brian Milby", "time": 1420568177720, "rating": 5.0, "text": "God centered worship, Christ exalting preaching, warm and friendly people!", "pics": null, "resp": null, "gmap_id": "0x8862680dc5e00603:0x25cd5095f9645d5c"}
{"user_id": "110126022623217044740", "name": "CS Brown", "time": 1549231510479, "rating": 5.0, "text": "People were friendly and Pastor brought it!", "pics": null, "resp": null, "gmap_id": "0x8862680dc5e00603:0x25cd5095f9645d5c"}
{"user_id": "112685436452969792352", "name": "B. Principled", "time": 1555799664874, "rating": 5.0, "text": "Friendly and genuine.", "pics": null, "resp": null, "gmap_id": "0x8862680dc5e00603:0x25cd5095f9645d5c"}
