{"user_id": "116742862075001519620", "name": "Angie Boatwright", "time": 1622272875403, "rating": 5.0, "text": "Loved my experience here.😍 Ms. Lisa was the best! She noticed I was very nervous and did a great job easing my jitters. She talked to me through the whole process & it made the time go by so much quicker. I left with a little pep in my step.😊 Fast, friendly, & professional service 10/10 would recommend this place to anyone! Thank you Ms. Lisa.❤️", "pics": null, "resp": null, "gmap_id": "0x888c2c86225d74ff:0xab331d69175538df"}
{"user_id": "110610751769971628070", "name": "anna rose mabile", "time": 1612803625152, "rating": 5.0, "text": "lauren is so professional and made me feel comfortable. 11/10 highly recommend! best sugaring i have ever had :)", "pics": null, "resp": {"time": 1612878481976, "text": "Thank you so much Anna for taking the time to leave such a great review!!"}, "gmap_id": "0x888c2c86225d74ff:0xab331d69175538df"}
{"user_id": "114910706560528224594", "name": "Sydney Smallwood", "time": 1612949694572, "rating": 5.0, "text": "Amazing service. Lauren is the best. Been going to her for years.", "pics": null, "resp": null, "gmap_id": "0x888c2c86225d74ff:0xab331d69175538df"}
{"user_id": "113375956944671141566", "name": "Adrienne Barringer", "time": 1614463945136, "rating": 5.0, "text": "Amazing experience and very friendly!", "pics": null, "resp": null, "gmap_id": "0x888c2c86225d74ff:0xab331d69175538df"}
{"user_id": "103108940460344598774", "name": "Natajah Amos", "time": 1573608940084, "rating": 3.0, "text": "Used to go here all of the time but Lauren stopped being reliable. Whenever I tried to set appointments she would take over a week (or just stopped responding) to get back to me. For the years I went here, I thought it was crazy to just stop servicing me. But I plan on going to a new place and hopefully everything goes well. As for personality, Lauren was very sweet and made sure things went smoothly.", "pics": null, "resp": null, "gmap_id": "0x888c2c86225d74ff:0xab331d69175538df"}
{"user_id": "111716864692803369523", "name": "Jenn Anderson", "time": 1567727994822, "rating": 5.0, "text": "Lauren was so personable, amazing, and accommodating! I had been looking for a new waxing place since we moved here a year ago and I'm so sad it took me this long to find this place! It was my first time sugar waxing and I loved it! For sure I will be a forever customer!", "pics": null, "resp": null, "gmap_id": "0x888c2c86225d74ff:0xab331d69175538df"}
{"user_id": "103387452594531680134", "name": "Jess Ask", "time": 1574391498623, "rating": 5.0, "text": "Today was my first brizillian wax and I couldn’t have picked a better place. I booked Lauren and she could tell how nervous I was. She was so patient with me and encouraged me through the entire process. I was so insecure when we first started, but her kindness made me comfortable by the minute! I HIGHLY recommend this facility and I WILL be seeing Lauren in 4-6 weeks!", "pics": null, "resp": null, "gmap_id": "0x888c2c86225d74ff:0xab331d69175538df"}
{"user_id": "105523274421721502034", "name": "Tairian Nelson", "time": 1567944448187, "rating": 5.0, "text": "Ellen is phenomenal! I started sugaring six (6) years ago only with Ellen. Never waxed before only sugared. I love it! Unfortunately, I moved to Michigan four (4) years ago and I only want to sugar. I found esthetician’s in Columbus OH, Birmingham MI, and Ann Arbor MI. No one is as amazing as Ellen. When I return home throughout the year to Montgomery AL, I book an appointment with Ellen. Ellen is the best ever!", "pics": null, "resp": null, "gmap_id": "0x888c2c86225d74ff:0xab331d69175538df"}
{"user_id": "112970030942152292806", "name": "Katie Jo Gossett", "time": 1602379302666, "rating": 5.0, "text": "Very nice and well priced products", "pics": null, "resp": null, "gmap_id": "0x888c2c86225d74ff:0xab331d69175538df"}
{"user_id": "116659811357305517635", "name": "Crescent Licci", "time": 1550001314009, "rating": 5.0, "text": "IF YOU'RE LOOKING FOR A PLACE TO GET A WAX, LOOK NO FURTHER!!\nI been going to Ellen for 2 years now, She is a wonderful person and does an amazing job. I would definitely recommend her.  She also has a number to text and a website if you want to make an appointment and responds quickly!", "pics": null, "resp": null, "gmap_id": "0x888c2c86225d74ff:0xab331d69175538df"}
{"user_id": "103063308887015842402", "name": "Shay", "time": 1496505840468, "rating": 5.0, "text": "I was nervous at first, being that I am a Black woman and a plus size woman. However, when I walked in, Ms. Ellen made me feel so comfortable! She so kind and professional. Lauren is great, too! These are my go-to girls for all my sugaring needs. Lauren saved my life with a last minute service. They're great people and I wouldn't go anywhere else.", "pics": null, "resp": null, "gmap_id": "0x888c2c86225d74ff:0xab331d69175538df"}
{"user_id": "101757457319973091164", "name": "Cindy Howard", "time": 1465787075208, "rating": 5.0, "text": "Jennifer Lambert is amazing! She was very helpful, professional, and did a fabulous job! I love the way my eyelashes look now, they went from barely there to luscious, I never want to be without extensions again. I would give her more than five stars if that was an option. LOVED HER!", "pics": null, "resp": null, "gmap_id": "0x888c2c86225d74ff:0xab331d69175538df"}
{"user_id": "103712559608485320857", "name": "Vernon Blake", "time": 1374650070684, "rating": 5.0, "text": "Love your new office!\n\nEasy to find and access, plenty of free parking, nice waiting room, and very clean bathroom. Treatment room is clean, uncluttered, organized, private, and comfortable.\n\nFor anyone feeling a bit uncomfortable about any of the procedures or her facility, Ellen is very professional, has an excellent bedside manner, and will put your mind at ease.\n\nHer expertise, experience, and passion for what she does is second-to-none!", "pics": null, "resp": {"time": 1377653717520, "text": "Thanks Vernon!! Everyone Loves my new location! Thanks you for your referral too!"}, "gmap_id": "0x888c2c86225d74ff:0xab331d69175538df"}
{"user_id": "116894094856529757653", "name": "Shelley Belly", "time": 1377390155478, "rating": 5.0, "text": "Thanks for the great Body Sugaring job you did, Ellen. I was a little nervous getting it ALL done but you really made me feel comfortable & I didn't feel nervous or embarrassed!  You are SO easy to talk to. Thanks for answering my million questions about hair removal. ;-).\n\nPS:  your rooms are magnificent!  I felt like I was in a luxury spa (& I've been to a few!). I'll see you again soon. I have already recommended you to all my friends.\n\nThanks again - so much!", "pics": null, "resp": {"time": 1377653460174, "text": "Hello Shelley!\n\nThank you for taking the time to visit my Google+ page and to leave this wonderful review.\n\nI really enjoyed chatting with you - you were a lot of fun - and I appreciated all the questions you asked.\n\nIntimate hair removal can be daunting for some, I know, so I'm glad that I put you at ease and that you felt comfortable, and are returning to continue with the process of hair removal.\n\nI decorated my rooms myself, so thank you for the compliment!  I, like you, place hygiene and sanitation and cleanliness at the top of my list in my business.\n\nI look forward to seeing you again soon.\n\nRegards\nEllen"}, "gmap_id": "0x888c2c86225d74ff:0xab331d69175538df"}
{"user_id": "100265935271884226756", "name": "Lana Grier", "time": 1386612400446, "rating": 5.0, "text": "I was c onfused regarding the various types of professional hair removal techniques. Ellen explained the differences between Electrolysis and Laser hair removal, as well as the advantages of Sugaring over traditional waxing. She was knowledgeable, friendly and patient, answering all of my questions so I could make an informed decision. Very much appreciated!", "pics": null, "resp": {"time": 1386615464965, "text": "Hi Lana, thank you for the kind review! I never get tired of discussing hair removal techniques. An educated client makes the best customer... it's a win-win! You're not alone regarding your confusion about electrolysis and laser hair removal treatments. I think most people are unaware they are two entirely different technologies, and one is MUCH better than the other... and yes... ELECTROLYSIS is the winner!!!"}, "gmap_id": "0x888c2c86225d74ff:0xab331d69175538df"}
{"user_id": "104412480827112258709", "name": "Taneshia Phomsavanh", "time": 1544256612063, "rating": 3.0, "text": "Went here before and recieved amazing service.  Recently tried to book appt. And no one answered or called me back.  Maybe she went out of business.  Idk.", "pics": null, "resp": null, "gmap_id": "0x888c2c86225d74ff:0xab331d69175538df"}
{"user_id": "106812886813967101321", "name": "Taylor Reece", "time": 1401856004272, "rating": 5.0, "text": "Thanks Ellen for the electrolysis you did on my neck and face. I highly recommend you to anyone. Love not having to shave my 5 o'clock shading constantly and no more razor burn.", "pics": null, "resp": {"time": 1403231430660, "text": "Thank you, Taylor, for giving us the opportunity to assist you.  As you know, Electrolysis is the only FDA approved method of Permanent Hair Removal, and we thrilled that you're so pleased with the results.  Thank you, also, for taking the time to share your experience with others so that they too may benefit from professional hair removal.\n\nHide that razor!  :-)"}, "gmap_id": "0x888c2c86225d74ff:0xab331d69175538df"}
{"user_id": "115486227624089077004", "name": "Kimberly Holley", "time": 1496429283521, "rating": 5.0, "text": "I can't rave enough about Lauren!  Super friendly...and super attentive!  I called last minute and she was able to work with my schedule -  although I am not a fan of the \"pay by time\"...because some people legs are longer than others...whenever I am in town I WILL ALWAYS run to Lauren!  BTW: Ellen is amazing too for electrolysis and sugaring for WOC! Dont say I didn't tell you...", "pics": null, "resp": null, "gmap_id": "0x888c2c86225d74ff:0xab331d69175538df"}
{"user_id": "104184604519049640173", "name": "Ginger Gams", "time": 1528820676929, "rating": 5.0, "text": "This is the sugarwaxing Queen. I love Ellen. My husband calls her my Sugarmomma.", "pics": null, "resp": null, "gmap_id": "0x888c2c86225d74ff:0xab331d69175538df"}
{"user_id": "116312612895417711995", "name": "Lynn Daley", "time": 1377558421270, "rating": 5.0, "text": "\"\"I thoroughly enjoy your hair removal articles about body sugaring and electrolysis. Also, I am now able to make an informed decision when choosing a permanent hair removal method. I look forward to visiting your new salon in Montgomery!\"", "pics": null, "resp": {"time": 1377653600424, "text": "Hi Lynn\n\nI appreciate that you are visiting my Google+ page and reading my articles.  It's important to understand the types of hair removal methods offered and what they entail.\n\nI look forward to hearing from you soon!\n\nEllen Dutton"}, "gmap_id": "0x888c2c86225d74ff:0xab331d69175538df"}
{"user_id": "114798988453050027233", "name": "Ellen D", "time": 1600167836783, "rating": 5.0, "text": "Thanks Vernon!!  Everyone Loves my new location!\nThanks you for your referral too!", "pics": null, "resp": {"time": 1386615028895, "text": "Hi Vernon, Thanks again for sending business our way... we're always happy to receive new clients and make new friends. I've been providing hair removal services in Montgomery for over 10 years now and it never gets old... :-)"}, "gmap_id": "0x888c2c86225d74ff:0xab331d69175538df"}
{"user_id": "111979785535929145488", "name": "Tricia Curry", "time": 1475092293122, "rating": 5.0, "text": "Jessica is awesome. She made me feel so toally comfortable in what could have been a awkward situation.", "pics": null, "resp": null, "gmap_id": "0x888c2c86225d74ff:0xab331d69175538df"}
{"user_id": "110862696799701285149", "name": "Ayana Bell", "time": 1513974838173, "rating": 1.0, "text": "No one answers the phone, I couldn’t even set up an appointment, went to their location and no one answered the door.", "pics": null, "resp": null, "gmap_id": "0x888c2c86225d74ff:0xab331d69175538df"}
{"user_id": "118445182371967459922", "name": "Destiny Caldwell", "time": 1535802774135, "rating": 5.0, "text": "Great service.", "pics": null, "resp": null, "gmap_id": "0x888c2c86225d74ff:0xab331d69175538df"}
{"user_id": "114375692430948165533", "name": "Rebecca Brown", "time": 1535231550320, "rating": 1.0, "text": "Called 4 times and left a message once. No one answered and no one called back. Gave them over a week to return my voice mail and nothing.", "pics": null, "resp": null, "gmap_id": "0x888c2c86225d74ff:0xab331d69175538df"}
{"user_id": "104756135058047425548", "name": "Sara Beasley", "time": 1529353292136, "rating": 5.0, "text": "Lauren was awesome!!", "pics": null, "resp": null, "gmap_id": "0x888c2c86225d74ff:0xab331d69175538df"}
