{"user_id": "106053051640200016524", "name": "Allison Merrell", "time": 1625679211537, "rating": 5.0, "text": "Would highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888e9b0fd3317975:0xf778c37972961140"}
{"user_id": "111579823567459407418", "name": "Beth Huckabee", "time": 1562603857641, "rating": 2.0, "text": "Would not recommend if you or your child is LGBTQ. The student atmosphere thrives off of gossip around the sexual orientation of other students. Not an accepting environment and most students are not open-minded at all. School discipline policy is strict if you like that. School faculty (teachers) are very dedicated to their jobs and want you to succeed. Mrs. Snow is one of the best teachers I've ever had and will make sure that your child succeeds at New Life.", "pics": null, "resp": null, "gmap_id": "0x888e9b0fd3317975:0xf778c37972961140"}
{"user_id": "114444792259979609238", "name": "Steve Thornton", "time": 1527430692381, "rating": 5.0, "text": "Great education, great staff and kids. So glad to be a part of NLCA. Editing post to say my son Graduated a couple days ago and my daughter still has 2 years remaining. This school has the staff, character and sports that are top notch. Christian athletics is somewhat better than public in that it tries to leverage competition while maintaining a Christian attitude which is the burden of the league to enforce and direct in my opinion. The fans, kids and coaches may not always get it right but you do have accountability. I see one negative post below and find those accusations unbelievable. Pastor Cova takes exceptional care of the grounds and facility. I have never seen anything but care, love and compassion from him and all the staff. I assume most can read the resentment and poor taste with hate posts on Google  reviews that are often very distorted or fake.", "pics": null, "resp": null, "gmap_id": "0x888e9b0fd3317975:0xf778c37972961140"}
{"user_id": "118360510075196652586", "name": "April Love", "time": 1481391394083, "rating": 1.0, "text": "This place sucked. The principal at that time Alan Cova was a true hypocrite, pretending to be a Christian while swinging out back to smoke cigarettes and cuss kids out. Once he threw a chip bag on the ground outside the classroom building. I can remember looking at him puzzled, then laughing and throwing down an orange peel. He gave me detention for an hour to pick up trash. Another time, I was sent to his office for talking in class. He decided 2 paddles licks was in order and one hit me across my lower back. I had a bruise for almost two weeks. Coach Thompson was told me to shut my \"goddamn mouth\" during a softball practice. I still remember him being right up in my face and his spittle flying everywhere.  Micki Jackson was another hypocritical nightmare of a \"teacher\" who egged kids on to pick on one another and chose favorites. She was loud and fat and thought herself a goddess. Lots of sexual misconduct and harassment was experienced. I know times and faculty have likely changed, but I still wouldnt recommend this school or church to anyone that has any integrity. Worst two year school experience of my life.", "pics": null, "resp": null, "gmap_id": "0x888e9b0fd3317975:0xf778c37972961140"}
{"user_id": "118264947672003681055", "name": "Nise 2You", "time": 1470500303669, "rating": 1.0, "text": "Statements made by the receptionist who facilitated the tour, we're insulting and personally hurtful. Her visual observations should be kept to herself and shared with the staff as need to knows for the betterment of my child versus choosing to use an open forum of the admitting office in front of others. Not to mention her observation is not valued or wanted, seeing that she does not hold not one certification in childcare development.", "pics": null, "resp": null, "gmap_id": "0x8888de288808b555:0x19b0a0b6063e9048"}
{"user_id": "107797963116797806453", "name": "Rayuna", "time": 1497584187880, "rating": 5.0, "text": "Great place to take kids as an after school care.", "pics": null, "resp": null, "gmap_id": "0x8888de288808b555:0x19b0a0b6063e9048"}
{"user_id": "105864404315959750611", "name": "Mr. John Howard", "time": 1536891092699, "rating": 5.0, "text": "Kids were all homeschool here.  Excellent staff.", "pics": null, "resp": null, "gmap_id": "0x88629e9267f7e265:0x7686a7881a5580d3"}
{"user_id": "112554992326868700494", "name": "Jobs Bham", "time": 1580837030791, "rating": 5.0, "text": "We have been here almost a year and LOVE it. My son started when he was just over a year old in the Starfish class. Hannah, Haley, Olivia, Stephanie, Brittany,Nate, Kelsey, Melissa, are all so responsive. Everyone is very nice, they have a great curriculum and my son has learned SO much since he has been here. He just transitioned to the next class, and has done great. Miranda is so sweet and loving to all her children in the class. Can't say enough good things about this place.  Only downfall is that tight parking lot.", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "115711114034754827075", "name": "Shyesa Granger", "time": 1531835316904, "rating": 5.0, "text": "Where do I begin to express the level of love, passion, and appreciation not only as parents I have for this school but our has daughter too! They are hands down the best place for your babies. From infant to school age care, they are well equipped for the academic, cognitive,emotional, and world adventures ahead of them. My daughter has been here since 1.5 yrs old and she’s well prepared for Kindergarten, as she asks to be quizzed in the car daily on math, science, spelling, and most importantly her facts on the Lord!! Thanks to all the staff and their love for our precious little ones, we as parents never had to worry a day she’s there. Thank you!!", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "111525890168679962999", "name": "Catherine", "time": 1551399125597, "rating": 5.0, "text": "My son has been going to this school since he was 11 months old, he’s been in 3 classrooms and all the teachers have been incredible. The staff is so kind and sweet, they always let us know when something happens to him. He’s so well taken care of, I wouldn’t want him to be anywhere else!", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "112147048019439728339", "name": "Adam Owens", "time": 1551380197758, "rating": 5.0, "text": "My son has been going to this daycare for over 2 and a half years and we love it. I have always enjoyed spending time with my son so it is not uncommon for me to him off in the morning and stay for 20 minutes or longer to hang out with him and his friends in his class.  The teachers have always been appreciative of me spending time with him and when he was younger, I would stop by at random times without warning just to check on him, to see him and was always greeted and got a chance to know his teachers. I have appreciated the curriculum because my son always comes home having learned new words, colors, shapes or just singing a new song. He loves to go to school and loves to be with his friends. All the kids I see usually are really happy and smiling. He moved up into classes with older kids at times which I appreciated because in order for him to learn to crawl or even walk, it was helpful for him to see other kids who were already doing those thing so he could mimic what they did. We love the staff and the hours and I feel confident that he is taken care and truthfully the teachers as a whole are not appreciated as much as they should be because it's a hard job and not everyone can handle that stress. We have recommended this school to numerous friends who have their kids now and it is nice for us to watch them grow up together.", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "110056607960264182440", "name": "Latraunda Smith", "time": 1500390052723, "rating": 4.0, "text": "My Daughter has been here since she was 8 months old.  She likes it and enjoys her little friends. I can tell she is learning so many different things. I really appreciate the meals they provide they are well balanced and fresh!", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "103454785843009009204", "name": "Rachel Samuel", "time": 1465785111671, "rating": 5.0, "text": "Wonderful people, excellent school. Both our kids went there for 3 months and loved it. We had to change only because it was way too far for us and if they open a branch in Hoover, it would be amazing.\nMr. Chris is very supportive and really good with kids. They personally know each kid and how their day was. A special mention and a big thanks to both teachers, Miss Kendrika and Miss Taylor. Our babies still miss you guys. God bless you people for all the good work you do. Thanks", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "108549760505356603610", "name": "Joshua Perry", "time": 1570222968254, "rating": 1.0, "text": "This daycare is below standards in the personnel running this daycare and its staff. Unprofessional and unclean. This is more like a place to drop off your children to be babysat than to learn and grow. The rooms are small and the building is old and the staff is very young and unprofessional.", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "110769963648522258386", "name": "Stacey McIntyre", "time": 1464285953813, "rating": 5.0, "text": "Great school for many reasons:  they teach children in a loving way to read,, write, exhibit good character traits, have a love for learning Biblical lessons along with wonderful teachers, staff and owners.  And the cherry on top....at a reasonable price for what all you get!!", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "118248202318085508053", "name": "Autumn Hiett", "time": 1551286822188, "rating": 1.0, "text": "My son is 10 months old now and started at Grace in the guppy class at the Ridge location. We loved the teachers and that class so much. One morning when he was in the guppy class I was dropping off my son and the lead teacher of sea turtles was opening that class. My son had a blow out so the teacher was changing him and I was standing there helping her. As I’m talking to her she is taking his clothes off and then begins to use his outfit to wipe his stool off his entire body. His outfit ended up having to be thrown away because after three washes it was stained. I mentioned it to the admin and the director and nothing was done. Everything was great until he moved up to the sea turtle class. We did not want him moving up to that class because he was only about 7.5 months old. He wasn’t even crawling, but was attempting to crawl. They kept pushing me to move him up even though I expressed my feelings towards it several times. They stated he was “too big” for the guppy class and he couldn’t fit in the swings anymore. He was a 7.5 month old who couldn’t even crawl, in a class full of 1 year olds who are walking. After he moved up to the sea turtle class we started having issues instantly. The lead teacher would tell me what to do and not to do with my son. He came home with three knots on his head over the period of time from when he moved up until this week. Nobody called me to inform me that he had hit his head either. When I picked him up the teachers or admin staff would state they didn’t know how he got the knots and bruises on his head. Also, every day when I pick up my sons nose is crusted with snot. It clearly hadn’t been whipped off all day. His clothes would be covered in the foods they had eaten that day too. Several times I would have to change his clothes and clean him up before leaving because he looked so bad. On many occasions he came home with 3 out of 4 bottles still filled with formula that I had pre made that morning. The teachers would state he refused to eat. Let me mention that my now 10 month old is 27 lbs, he doesn’t miss a meal. When I would pack his bottles up to leave he would get so excited like he wanted one, so I would give him one and he would drink it so fast like he hadn’t eaten all day because he hadn’t. They only gave him one bottle for an entire 10 hours. When my son was close to 9 months old he came home for a week straight throwing up randomly and having bad stools. I finally took him to the doctor thinking he was sick. I came back to the daycare the following week and told his teacher that his doctor said he was fine. That is when I find out that his lead teacher had been giving him whole milk with his formula without asking me or even telling me for an entire week. What if my kid was allergic or I didn’t want him to have milk? The doctor even recommends children not have whole milk till they are a year old. I expressed my feelings towards her stating all my concerns about it and she states in that class they train the children on whole milk. I told her not to give it to him anymore but I would find out from the other teachers that she continued to give it to him. One day I had to pick my son up during nap time for a doctors appt and she told me to shhh that I would wake the children up. Let me mention I was whispering asking how my son was that day. The same teacher has gotten a stern tone with two of the other kids in his class while I was in there talking to her during drop off, so it makes me wonder how she is talking to my son without me there. These are only a few things that have happened. The director was aware but never did anything about it.", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "114329012990978862549", "name": "Jenifer Phelps", "time": 1472481050331, "rating": 5.0, "text": "Wonderful place! Our daughter loves it here. She is always talking about her school now. She's learned so much since she started. She talks about all her friends, water day, her teachers, and about the songs and lessons she's learned at school.", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "103030316341926541305", "name": "Melissa Jackson", "time": 1551402400626, "rating": 5.0, "text": "Great place to work!!!! Great place for your child/children!!!!", "pics": null, "resp": null, "gmap_id": "0x888923c63d1e68f1:0x3f6222559ce30c38"}
{"user_id": "117550390449760843597", "name": "Cheryl Ingram", "time": 1556197477528, "rating": 5.0, "text": "My daughter is so happy at this school. She is making real friends and succeeding in a supperior education. The best part of her experience is the genuine Christian Brothers and Sisters in Christ. Do you want the same values taught at Home and Church to continue at School? This is the School for your Children. Check them out on May 6th at 6:30pm for an Open House to learn about every aspect of this amazing school. Academics, Sports, Invested Parents, but most importantly; Christian Education.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPj2dH2C23kLUd4VrHf1v2BN429ip9dzhjRi437=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPR6kVtwdrQbmsZli82USvPNR8kmMT-6G6QbCqq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPGdeeWdTT2wli_e6_u4uxf5ZPJrOJQVey4Q8nu=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMmXIdwXWlQ91Q7Q5DGMrMYhoOWT4PAs9a23CBr=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOxm-fkWwicifg1Y9NWtZ8UFaugEdaR9tvjfIR6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNVwixK-nlC-3WxcewCVsEk94r7aSvjOYTZwxQ4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP5Tx5LGNUVGsrKgvX1OhSsHUdkqu7oi_iCozzJ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPRTWz-i4hoDQndYShSVlvsqNnebvyno6gurlTx=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
{"user_id": "105665355440873872790", "name": "Angela Bevelle", "time": 1578439707588, "rating": 5.0, "text": "I have two children at Heritage and the love that the teachers display and pleasant peaceful atmosphere that the director Larkin gives is awesome. It really puts me at ease with leaving them with loving compassionate people. May God continue to Bless all the employees at Heritage.", "pics": null, "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
{"user_id": "109757775629335565337", "name": "Monica Rayford", "time": 1554562582122, "rating": 5.0, "text": "Great Christian based school with loving and caring teachers and staff. My son loves attending and we are overall happy with the education he is receiving. I love the fact that the school is conveniently located near our jobs which makes it very convenient for us.", "pics": null, "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
{"user_id": "114574832366244275823", "name": "Brad King", "time": 1554144397483, "rating": 5.0, "text": "I have 3 kids that attend Heritage Christian Academy.  My family and I love the fact that we feel like the school and the teachers are partnering with us in both educating our kids and nourishing them spiritually.  We love the fact that they are seeing the Gospel lived out through their education and are being prepared to enter adulthood with a Christian worldview.", "pics": null, "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
{"user_id": "110781816636208325133", "name": "Mick Vigneulle", "time": 1554338452119, "rating": 5.0, "text": "Our family has had 5 children graduate from HCA over the last 2 decades. The headmaster is providing outstanding leadership and there is an excellent sports opportunity to compete at a very competitive level. The class sizes are perfect for more personal attention from teachers. Students are taught in a safe environment and the quality of education, along with technology, has improved greatly over the years and continue to advance. The teachers are very caring and not only teach academics, but also teach from a Christian Worldview. Our children have excelled with honors and leadership at the University level as a result of their undergraduate foundation. We are thankful to have had Heritage partner with us in training our children to live out their faith in a growing secular society. Thank you HCA!", "pics": null, "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
{"user_id": "105767410147643925364", "name": "Hendrick CDJR Hoover, AL", "time": 1568080690630, "rating": 5.0, "text": "It has been such a blessing to our company to be involved with a school who looks to provide a quality product to our area.", "pics": null, "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
{"user_id": "115740278520844390821", "name": "Corbin Smith", "time": 1552963517086, "rating": 5.0, "text": "I am an alumni from HCA and it has shaped me who I am today. The teachers truly invest their time into the students and care for their education, but also their spiritual lives. I still have teachers email me saying that I am on their minds. I have two younger siblings who attend HCA and I know that they might not realize what they are gaining from this school at this moment, but I know they will be impacted in greater ways than they can imagine. I am prepared both in my education and my spiritual life and I owe it all to the teachers and staff at this school.", "pics": null, "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
{"user_id": "100883706902267156007", "name": "Bill Vandiver", "time": 1458936113693, "rating": 5.0, "text": "I have been engaged and involved with Shades Mountain Christian School in one way or another since 1975.  I'm a graduate and have two girls who currently attend.  It's been so amazing to see how God has used this school over the years to impact kids and families for His kingdom.\nSmall class sizes, godly teachers who really care, excellence in academics and the arts and athletics, and everything taught from a biblical worldview perspective are just a few of the things that makes SMCS great.", "pics": null, "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
{"user_id": "108168543468685485882", "name": "Jon Stevens", "time": 1556196259614, "rating": 5.0, "text": "We love our Heritage Christian Academy school! Our son started when he was beginning Kindergarten and he is now in 5th grade. The teachers are amazing and the leadership is full of integrity. They are all very good at communicating everything all the time to the parents so we always know what is going on. We have every intention of letting our son attend HCA until he graduates 12th grade. We ask him every year if he wants to go back and every year he says definitely YES!!\nWe are praying for you and your family to find this school family like we have. It will change your lives forever!! God bless you all who are looking into Christian education. It is life changing.", "pics": null, "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
{"user_id": "101298697750569988427", "name": "Diane Rigdon", "time": 1554251568724, "rating": 5.0, "text": "We have been at HCA since kindergarten and our oldest is now in 7th grade (youngest is in 5th). We have loved being a part of such a wonderful Christian family atmosphere. We are so fortunate that a couple of friends attending shared with us about the school 8 years ago. The staff loves the Lord and our kids. They are excellent educators as well. We are blessed!", "pics": null, "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
{"user_id": "107544060775041669580", "name": "Debbi Moses", "time": 1554480449704, "rating": 5.0, "text": "As grandparents of three children that attend HCA, we couldn’t ask for a better school, teachers, or atmosphere for them. We are so thankful that they have teachers that pray FOR them and WITH them. HCA is also very supportive of grandparents, having a special day set aside for them to celebrate their grandchildren. We absolutely love HCA!", "pics": null, "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
{"user_id": "100660880957399160385", "name": "Kristen Majors", "time": 1470198740687, "rating": 5.0, "text": "This school not only impacts its students but its teachers as well. Going on my 5th year teaching, this school has become more than a workplace but  my family. It is truly a family-oriented school with loving and caring staff members.", "pics": null, "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
{"user_id": "110909139663330839619", "name": "Jeff Brown", "time": 1554730289763, "rating": 5.0, "text": "My family’s first interaction with Heritage Christian Academy (HCA) was a little over two years ago. Prior to enrollment, my pre-school son was being cared for by family members instead of a daycare. The decision to enter him into a regular kindergarten program was a big one for us, and after considering several options we chose HCA. Some positives for us as outsiders to the school were the smaller class sizes, education from a Christian worldview, AdvancedEd (formerly SACS) accreditation, location and opportunities to continue his education through high school if desired. The end of my child’s second year is approaching, and all of us (including him) are pleased with our decision to select this school. My son has progressed so much over the last two years, and he is still excited about going to school every day. It is great to experience his teachers’ dedication and love for him and his love for them. He regularly talks about school even after finishing for the day. As my son grows older, I look forward to him being able to take advantage of the sports programs, and increasing his participation in the fine arts offerings he is experiencing now. I feel confident he will continue to get an exceptional education at Heritage Christian Academy that will help him develop into a well-rounded individual.", "pics": null, "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
{"user_id": "105500754007228460486", "name": "Gwynne Mountz", "time": 1458263632860, "rating": 5.0, "text": "Our daughter has attended SMCS for two years and she LOVES it here. She has grown so much in these two years academically, emotionally and spiritually. The teachers here truly love their students. We love the small class sizes! They make the learning environment that much nicer. If you're considering a private Christian school, check out SMCS!", "pics": null, "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
{"user_id": "101056136645478624126", "name": "Sissy Spence", "time": 1458230477244, "rating": 5.0, "text": "It has been an honor to work with the faculty, staff and school families at SMCS! I can't wait to see what the future holds as the school prepares for the move to their new facility in Riverchase.", "pics": null, "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
{"user_id": "106557998851713963775", "name": "Josh Cooley", "time": 1441294520071, "rating": 1.0, "text": "I went to this school from kindergarten through high school and it was hell. When I once asked what the difference was between our version of Christianity and others, like Catholicism for example, I was regarded with great suspicion and asked why I would want to know. That is a sure sign of a cult. During my senior year one of our worst teachers took over as principal and redirected the institution from any educational focus to almost purely one long religious pep rally. Time was shaved off of every class time to make room for a brainwashing session in the gym every day. Nearly every one I knew who went to this school was tremendously damaged by the whole experience. Some completely turned away from religion, others fled, and a few actually succumbed to the brainwashing and ended up sending their own children back into the fire. Take it from someone who escaped by the skin of their teeth; do NOT subject your children to this torturous environment.", "pics": null, "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
{"user_id": "100079996005630150015", "name": "Karen Gray", "time": 1548021041976, "rating": 5.0, "text": "Awesome School and Day Care", "pics": null, "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
{"user_id": "103425922334039278433", "name": "Coach Jimmy", "time": 1462893608023, "rating": 5.0, "text": "All my children go here!!! the BEST!!!", "pics": null, "resp": null, "gmap_id": "0x88891f45ef61c76f:0xad7a04f43c9d9983"}
