{"user_id": "102634393960616258438", "name": "Dee Bailey", "time": 1628153186194, "rating": 5.0, "text": "A really nice store that has a lot of different materials.The salespeople are really helpful as well.", "pics": null, "resp": null, "gmap_id": "0x888918a08e0f8543:0x2975a270a56fc294"}
{"user_id": "115521341068998063558", "name": "stormi boddie", "time": 1586998084425, "rating": 5.0, "text": "Great resource for parents that are involved in there kids learning and development. I found games that helped my son read instantly at the age of 4. It taught me that I put in the work but just needed to find a way to reach him.", "pics": null, "resp": null, "gmap_id": "0x888918a08e0f8543:0x2975a270a56fc294"}
{"user_id": "110238666452564671247", "name": "Terri Lane Robertson", "time": 1576021838411, "rating": 5.0, "text": "A teacher's heaven.  I could lose hours in here.  Everything you could think of wanting,  and a few you haven't thought of. Friendly staff.  Clean and organized.", "pics": null, "resp": null, "gmap_id": "0x888918a08e0f8543:0x2975a270a56fc294"}
{"user_id": "109101670205620310995", "name": "Angie Dunham", "time": 1503755806108, "rating": 5.0, "text": "I love visiting this store! They are consistently friendly and helpful. Not only do they immediately know where to find what you're looking for, they will lead the way. If they don't have what you're looking for they will let you know what store to find it.", "pics": null, "resp": null, "gmap_id": "0x888918a08e0f8543:0x2975a270a56fc294"}
{"user_id": "116839664171612912988", "name": "Tamara Williams", "time": 1533178012090, "rating": 5.0, "text": "The staff is knowledgeable and friendly. A great group of women eager to assist teachers in any way. Thank you ladies for all your support.", "pics": null, "resp": null, "gmap_id": "0x888918a08e0f8543:0x2975a270a56fc294"}
{"user_id": "115092117261056426150", "name": "Elizabeth Hanna", "time": 1551297143223, "rating": 5.0, "text": "Great resource not just for teachers, but parents looking for developmental activities or materials to do at home!", "pics": null, "resp": null, "gmap_id": "0x888918a08e0f8543:0x2975a270a56fc294"}
{"user_id": "110449888907222589199", "name": "Live Laugh Love", "time": 1546720183821, "rating": 5.0, "text": "It had everything a child could use to get to the next grade level. I bought comprehensive books, alphabet & number posters.", "pics": null, "resp": null, "gmap_id": "0x888918a08e0f8543:0x2975a270a56fc294"}
{"user_id": "111330681554899131886", "name": "Fee Johnson", "time": 1495834264928, "rating": 4.0, "text": "Received some lamination down for a poster board. Good job. It looks good.", "pics": null, "resp": null, "gmap_id": "0x888918a08e0f8543:0x2975a270a56fc294"}
{"user_id": "108496818278999082603", "name": "Mac Mac", "time": 1536955079677, "rating": 5.0, "text": "(Translated by Google) Good place\n\n(Original)\nBuen lugar", "pics": null, "resp": null, "gmap_id": "0x888918a08e0f8543:0x2975a270a56fc294"}
{"user_id": "110173361245205159836", "name": "Lynn Jett", "time": 1490966869747, "rating": 5.0, "text": "Very helpful, loved the T-shirt size!", "pics": null, "resp": null, "gmap_id": "0x88890493cc5f1407:0x37a3ac11a0e0809a"}
{"user_id": "111667807028957468136", "name": "Keith Sharp", "time": 1472267076812, "rating": 5.0, "text": "Excellent store, friendly, helpful employees and good selection.", "pics": null, "resp": null, "gmap_id": "0x88890493cc5f1407:0x37a3ac11a0e0809a"}
{"user_id": "103185623407251838868", "name": "Joshua East", "time": 1465898676227, "rating": 5.0, "text": "Very good customer service and friendly.", "pics": null, "resp": null, "gmap_id": "0x88890493cc5f1407:0x37a3ac11a0e0809a"}
{"user_id": "113979251955269591005", "name": "Renee P", "time": 1487530350728, "rating": 5.0, "text": "Awesome place to shop! :D", "pics": null, "resp": null, "gmap_id": "0x88890493cc5f1407:0x37a3ac11a0e0809a"}
{"user_id": "115406204910169491812", "name": "amber Yager", "time": 1456449406806, "rating": 5.0, "text": "Awesome atmosphere!!! Instantly felt welcomed", "pics": null, "resp": null, "gmap_id": "0x88890493cc5f1407:0x37a3ac11a0e0809a"}
{"user_id": "116446641179055309806", "name": "Kit Brown", "time": 1479602986497, "rating": 3.0, "text": "Worst experience I have ever had at a so called Christian store. The lady with frizzy hair  was rude think she was suspose to be manager. Need to hire someone that wants a job and send her home.", "pics": null, "resp": null, "gmap_id": "0x88890493cc5f1407:0x37a3ac11a0e0809a"}
{"user_id": "108507464713166747622", "name": "Marlin Eddy", "time": 1489677896246, "rating": 3.0, "text": "Some one else has bought them out and it's not really a discount", "pics": null, "resp": null, "gmap_id": "0x88890493cc5f1407:0x37a3ac11a0e0809a"}
{"user_id": "111375540941136094702", "name": "jonah thompson", "time": 1485111368426, "rating": 5.0, "text": "It's a good place", "pics": null, "resp": null, "gmap_id": "0x88890493cc5f1407:0x37a3ac11a0e0809a"}
{"user_id": "108357301492563093873", "name": "Troop scout", "time": 1489499766701, "rating": 5.0, "text": "Hate Thurs store is closing", "pics": null, "resp": null, "gmap_id": "0x88890493cc5f1407:0x37a3ac11a0e0809a"}
{"user_id": "106364979654213016726", "name": "Christopher Colvin", "time": 1497965006673, "rating": 1.0, "text": "It shut down", "pics": null, "resp": null, "gmap_id": "0x88890493cc5f1407:0x37a3ac11a0e0809a"}
{"user_id": "104919038598558035052", "name": "Courtney Grimes", "time": 1628990462879, "rating": 5.0, "text": "For my daughters sweet 16 we spent a few days in Gulf Shores. The only thing she really wanted to make sure she got to do was go in this store. We spent maybe 2.5 hours searchig for our treasures and we just had an amazing experience.  When we walked in the store you could feel the energy. The owner was so kind. He recommended a few items to us . Selenite and black tourmaline. I really appreciated that he took his time to talk to us and educate us. I hope to visit again before the shop goes to online.", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "116154995279004995480", "name": "Kinsley Keeton", "time": 1627231081087, "rating": 5.0, "text": "I went here while I was staying in the area on vacation and was looking for a tigers eye bracelet. I easily found just what I was looking for and even bought another crystal. It had almost every crystal I was interested in I will definitely be visiting again next time I'm in town!", "pics": null, "resp": {"time": 1627235105203, "text": "Thank you for the review and your support! Be sure to subscribe to our email for the new location announcement. Our last day in our current location will be Aug 29th. 🙏💜 we will also have a new online website launch in October. Thank you again and we hope you enjoy the rest of your time here in Coastal Alabama."}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "110733453251905385992", "name": "Stormy Rainbows", "time": 1620442898043, "rating": 5.0, "text": "Amazing customer service- My twin two year old toddlers were acting 🤪🤪..The amazing gentlemen came over and let them pick some small black tourmaline for them to keep to help calm them! Then we had forgot our debit card and the nice woman at the desk wasn’t bothered at all in my son still acting a mess. Prices were FANTASTIC! They even have a small mining sluice. Will definitely be making this one of my go to crystal shops! Thank y’all so much for your patience and guidance.", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "113554856234577824078", "name": "Kennedy Grace", "time": 1617818744528, "rating": 5.0, "text": "I loved it so much I was only in orange beach for a week and went to coastal zen 3 TIMES. I'm addicted. The staff was really friendly. and the prices are the best I've ever seen. And with them being online now too! they are the only place I'll ever get my spiritual needs.", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "109644323027919237260", "name": "Mariam Smith", "time": 1625258382531, "rating": 5.0, "text": "My sister and I did a sand bucket panning, it was very amusing and we got a nice selection of rocks and shark teeth! Everything was really cute too, I ended up with some cool mushroom stickers myself ☺️", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO8bGYgt8pNn8NH4Fgq8M_UWorgVDYYNRr4oBIB=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPCQ1Z4lKZg_wjbG3qTfxWZTHHUCatpKlOD3LsS=w150-h150-k-no-p"]}], "resp": {"time": 1625336407833, "text": "Yeah! Thank you for the review, we appreciate you! So glad you two enjoyed the mining ⛏ have a wonderful weekend!"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "115598439405820901004", "name": "Allison Chapman", "time": 1614098858325, "rating": 5.0, "text": "I will visit here every time we go to Gulf Shores or Orange beach!! I will have to shop in their online store until then! It was such a peaceful store. The owner was very courteous and helped us but he didn't hover over us like many shops will. We spent almost an hour shopping and everything was well worth its price! So glad we found this gem on our day trip I will be enjoying my goodies for a long time!", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "101273241703564572255", "name": "Shawn Mitchell", "time": 1617840710373, "rating": 5.0, "text": "This was by far our favorite shop at The Wharf. We got lucky and were there when the owners were in the store. We were looking at the petrified wood and they ended up showing us so many more interesting pieces! They have this store because they love the stones and other items. Everything was reasonably priced and beautiful!", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "118431549054480056261", "name": "Sierota Beth Brackett", "time": 1545067453993, "rating": 5.0, "text": "My experience at A Coastal Zen was fabulous! The owners are warm and welcoming. I felt very much at home as I browsed through their collection of healing crystals, ritual candles & incense, inspirational/motivational art, spiritual & meditation tools, and all sorts of unique trinkets and decorations. The store is filled with interesting products from across the world. There is something here for everyone! The owners even showed me a few of their prized personal possessions which were kept in the back room, making me feel like V.I.P.  The store itself was well kept...which I can only imagine to be a constant struggle considering how many shelves and items must be dusted frequently to maintain the clean environment. Everything sparkles! If you have the chance, ask the owner about the musical vibrations produced by the bronze gong hanging behind the register -- it makes beautiful sounds which fill the space entirely, engulfing it's visitors in a sense of peace and tranquility. This store is just the kind of retail attraction our community needs in this area - Definitely recommend visiting A Coastal Zen as soon as possible!!! Bring more money than you think you will need because you will be surprised how many items will strike your fancy! The owners are well educated in product knowledge and price the pieces very, very reasonably. It's a treasure trove of goodies!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM6tYhpY_pMuZpJO8S_typrW-ZMwGWMcZoT_6-M=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM2hVRgi4jSugsZNl_wWH5F6VEsuvuoII7AFCkY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPkK_x-caP5-0GhCKa7vuRO-zR9iOdUfJlqGvqc=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPRgnVpymKcLYk0TqJBglyJycKLrevPqLIrm3Nl=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNeh4dCZxY8xpGux4bZ6NeguJyDhyH5mMXjdOZ_=w150-h150-k-no-p"]}], "resp": {"time": 1573675648474, "text": "Thank you so very much for such a glowing review. We love our customers and so look forward to you visiting us again."}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "108285055030902494329", "name": "Ken", "time": 1625697423221, "rating": 5.0, "text": "absolutely amazing the store keepers where very helpful and i got exactly what i needed 5 stares", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "111887870042968438633", "name": "Pansexual doom", "time": 1625105409897, "rating": 5.0, "text": "I went to the warf on a vacation and stumbled apon this place, it is so cute and welcoming, the prices are super reasonable and the family that owns the place is so kind and helpful, if you are LGBTQ+ or wiccan/pagan/spiritual this place is a safe space and offers you things to show your pride or help your spiritual journey!!! I can't stress how much serotonin A Coastal Zen gives me!!!", "pics": null, "resp": {"time": 1625118393227, "text": "Awe… you made my night 💕🌈♥️ we appreciate the love and You!"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "105941527717159744501", "name": "Free Me", "time": 1584473806085, "rating": 5.0, "text": "My birthday just got better!\n\nThe kids and I came in for a little Crystal mining ⛏ and had a blast learning about different stones and their meanings. I definitely recommend Coastal Zen ! They have great prices and welcoming customer service 🤩🤩🤩🤩🤩 don’t let no hater tell you different 👏🏽👏🏽👏🏽 That’s on period 🙃", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMwNmIDwzcb5MeoXNTmesdNXbn-gZntZ4Umt-Oz=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "115188196653563439665", "name": "Antoinette Hardy", "time": 1608208837981, "rating": 3.0, "text": "I bought my custom made ring from here and I'm totally happy with it. Katherine helped me and she was very patient with me, as I am a very picky. She is very knowledgeable about diamond and will find you a diamond at a reasonable price.", "pics": null, "resp": {"time": 1608219544580, "text": "Hi Antoinette\n\nThank you for a review but I think you may have us mistaken with another company. We do not sell diamond rings nor do we have anyone who works for us named Katherine.\n\nWe are a rock/crystal shop\nIn a orange Beach ❤️\n\nHope you have a great Holiday Season!"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "110767971739173120893", "name": "Michelle Murr", "time": 1601868902031, "rating": 5.0, "text": "If you are looking for something and you're not sure what, this is THE PLACE FOR YOU!  Went with a friend in search of specific stones and spent a ridiculous amount of time in the store.  Amazing people and amazing products.  I left with bracelets for myself and friends, rocks for same, prayer candles and a great gift for a friend who is a healer.  A beautiful blessing awaits you, don't miss a chance to check this place out!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "107724408712202242719", "name": "Alexandra Co", "time": 1615577340375, "rating": 5.0, "text": "Love this store! Nice ambiance, great selection and the staff is always so helpful, patient and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "101911035290047174789", "name": "Melodye Harleen", "time": 1606730909803, "rating": 4.0, "text": "This place is a non-negotiable part of every trip up north for my brother and I. I generally love bookstores, especially intimate and down to earth bookstores with interesting selections. Loved this place even before I knew all the history it held.", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "103423060263731217105", "name": "kxlciii", "time": 1627412527544, "rating": 5.0, "text": "best crystal shop <3", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "116719870754323782638", "name": "Don Cheek", "time": 1599139084316, "rating": 5.0, "text": "Glad that we took the time to visit this store. Me and the wife found stones for us both. It was mind blowing how much information Stan gave us and in the decision that we made in our purchases. Will definitely return.", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "102986450079815730631", "name": "Suerianne Davis", "time": 1590440305578, "rating": 5.0, "text": "The selection and quality in this store are amazing! The personal attention and the knowledge that Stan and his staff provide makes choosing the stones and jewelry and clusters really gratifying.  Moreover, Stan was willing to work with me to sell and mail an order when I could not travel to Alabama.  I look forward to returning when traveling is safe.  Such a wonderful experience to be at A Coastal Zen!", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "115759241595641884334", "name": "Lisa Hannah", "time": 1591895445895, "rating": 5.0, "text": "I love this place!! I found it 3yrs ago on our annual trip to Gulf Shores from Missouri my trip is not complete without shopping here for my yearly supplies. They are so friendly and helpful!! Also they have descriptions and uses with each stone its so amazing!! Thank You!! Will see you again in March!!", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "117978009444163928080", "name": "Peyton Cole", "time": 1584324349393, "rating": 5.0, "text": "Hey I told y’all I was coming back today but I didn’t keep my word I went on home but I really appreciate all the knowledge Stan blessed me and my family with. I also appreciate the sweet deal he gave me! Hopefully me and my family luck and energy will begin to turn around and be positive", "pics": null, "resp": {"time": 1584367872216, "text": "Thank you, Peyton!  So glad you enjoyed your visit with Stan and hope you come back to see us soon!"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "117418893460506038166", "name": "Kathy Humphres", "time": 1579051086951, "rating": 5.0, "text": "Awesome place with so many cool things and very reasonable prices. I love to go there the owners are so friendly and helpful I could spend hours just checking everything out. If you’re ever in the area you should check them out.", "pics": null, "resp": {"time": 1579218957302, "text": "Thank you, Kathy!  So glad you enjoyed your visit and hope you come back soon!"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "106989566317636622074", "name": "Debbie Busby", "time": 1562794546606, "rating": 5.0, "text": "Very neat little shop! Beautiful crystals, stones salt lamps. Bracelets, earrings etc...\nI was able to find all of my  souvenirs to take back home with me. While I was there they have this mining  thing for children to kinda of mine for their own shells or crystals‼️ Super Cute. Great Customer Service❤️", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "100531477350519372235", "name": "Glenda Zollicoffer-Harrel", "time": 1564343270460, "rating": 5.0, "text": "I had such a wonderful experience there yesterday. The owner was so nice. I bought so many pieces, but not everything I wanted, she told they had an online store for using later. gave. She also have me some useful information on traveling back this way next time. I will definitely be shopping online with her.", "pics": null, "resp": {"time": 1579219130908, "text": "Thank you, Glenda!  We so appreciate you taking the time to write us such a glowing review!  Come back soon!"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "109410246963741394529", "name": "Tina Cozart", "time": 1603655063085, "rating": 5.0, "text": "Beautiful store, friendly staff and great prices! 💯🥰✨", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "105879156417845088894", "name": "Susanna Forbes", "time": 1582992340490, "rating": 5.0, "text": "Coastal Zen is wonderful, the staff is always very helpful, everything is crazy affordable and they have everything you need. Stan is very helpful and really knows what he's taking about. I always spend way more than I would want to there, but it's totally worth it ❤️", "pics": null, "resp": {"time": 1583410190075, "text": "Thank you, Susanna!  We have the best customers and love that you enjoy shopping with us as much as we appreciate you!"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "115817234154721227843", "name": "Brandy McGee", "time": 1569379582555, "rating": 5.0, "text": "I’m a huge crystal hound and I was so excited to find this shop on my vacation here. The girl working was super sweet and very knowledgeable. I overheard her helping some ladies to pick out stones and she really knew her stuff. I found a lot a crystals that I didn’t have in my collection. Most expensive one was $3. I love this place!!!", "pics": null, "resp": {"time": 1573675707870, "text": "Thank you, Brandy!  We are so glad you found us and hope you make a repeat visit to our area soon!"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "118410199404825866695", "name": "PαԵԵí Aղժҽɾsօղ", "time": 1583534648758, "rating": 5.0, "text": "Just from the reviews and photos of the shop I want to go visit! I'm a local and will certainly drop some dough on some crystals, tapestries, tarot?, and more😊 I CAN'T WAIT!! Thank you for opening a metaphysical shop in our area! ❤️", "pics": null, "resp": {"time": 1584029592689, "text": "Hi Patti 🙏 I finally figured out how to access these reviews and respond 😇 thank you so very much for the love and support❣️ let us know if we may assist you with any of your spiritual tool needs or if you just want a little pick me 😘 also send a text to the shop phone 251-752-3489 and let us know who you are and we will text you back a discount code to use in the shop or online 😍 Many blessings and much gratitude always 🙏💙😇 MK"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "107585261266153304423", "name": "Princess MeMe", "time": 1535217287922, "rating": 5.0, "text": "We had a very welcoming experience. Staff/Owners were very friendly and helpful, not pushy, they were happy to help and answer questions. They made us feel like friends instead of customers. They had a great selection, I had a hard time choosing so I got a few items, We definitely recommend this awesome place. Thank you so much for all you've done for us. Be Blessed!", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "108688241742096002504", "name": "Denise Davies", "time": 1584008057130, "rating": 5.0, "text": "Found this place during my yearly October orange beach visit with my husband. I wanted to find a real metaphysical shop, and this is a hidden little gem at the wharf. Whimsical, clean, and the staff was incredibly sweet. 10/10 will visit and give my business every time I visit.", "pics": null, "resp": {"time": 1584029392534, "text": "Hi Denise ❤️ thank you for your kind words and wonderful feedback! We truly appreciate all of our customers and we love hearing feedback! In a world full of rocks you are one of our favorite Gems 💎 😘✌️😍 many blessings to you and your loved ones always! MK"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "102583738884171537878", "name": "Sarah Wyckoff", "time": 1537889341847, "rating": 5.0, "text": "This shop is wonderful, and there is nothing quite like it in our area! The selection is great, and the prices are very reasonable. The staff were so friendly and helpful. I will definitely make this a regular stop!", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "104018556506574443253", "name": "Brandy Knodel", "time": 1577908146001, "rating": 5.0, "text": "My absolute favorite store ever. Love you all and thank you for walking with me down my crystal journey.", "pics": null, "resp": {"time": 1578078515213, "text": "Thank you, Brandy. We do enjoy our customers and love making their experience a fun one when they visit us. We hope you visit us often!"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "116561567481842370655", "name": "Cara Prentice", "time": 1534638274181, "rating": 5.0, "text": "Loved this place! It was so nice to find a store that is so peaceful and inviting in a busy tourist area. Great selection of crystals, stones, jewlery & more. Owners are great and very knowledgeable. Make sure to ask them to show you what they know!", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "111067639276278611653", "name": "Lauralea Lasher", "time": 1533939949251, "rating": 5.0, "text": "A wide variety of crystals and stones. Extremely reasonable pricing. Great selection on natural quartz crystals. As well as knowledgeable and friendly staff. I had to come back twice in a week for more!", "pics": null, "resp": {"time": 1533959835385, "text": "Thank you! We are so excited to be open and sharing our love of Crystals and things Love! We truly appreciate you taking the time to leave us a review! May you always be showered with Blessings!"}, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "107458850428980040331", "name": "Rachel Lavergne", "time": 1534546676072, "rating": 5.0, "text": "Absolutely love this place, I found a beautiful Mermaid light for a reasonable price and they were even nice enough to offer me a discount since I was from out of state. They have so much to offer, glad I stopped by!!!!\n\n-Rachel", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "113309432870010260344", "name": "Lindsay Hoebing", "time": 1534460765463, "rating": 5.0, "text": "What a wonderful establishment! There’s such a wide array of items available. The owner is very knowledgeable about everything in the store as well. I wish there were more stores like this!", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "100276064635021776205", "name": "patricia forrest", "time": 1535233043231, "rating": 5.0, "text": "So grateful this shop is here now! Beautiful store with a great selection and incredible customer service. There's something for everyone here and the owners are extremely knowledgeable and so, so kind!! 💙🙏💚", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "104523760068173848331", "name": "dolly wallace", "time": 1537997882878, "rating": 5.0, "text": "Outstanding customer service and were very knowledgeable about their inventory. Liked them so much I will buy from their online store until my next visit to Orange Beach.", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "100544967325688369505", "name": "Jeremy Thomas", "time": 1534002650470, "rating": 5.0, "text": "Really cool stones, very nice!", "pics": null, "resp": null, "gmap_id": "0x889a0568d6bed149:0xac1e16632b86c3e"}
{"user_id": "100097486356799550680", "name": "Ryan Patrick", "time": 1398088554958, "rating": 3.0, "text": "I was not pleased with the actions of a clerk in the store. He did not display Godly wisdom or even common sense in general worked with a customer. I rated my experience as 1 star. I'm rating it higher now due to the response I received from customer service. They quickly responded to my email and did a very good job. Thank you.", "pics": null, "resp": null, "gmap_id": "0x88626938a8339ba7:0x548f69dc28a6e2c2"}
{"user_id": "105974778982593039316", "name": "Kimberly Christmas", "time": 1463081843228, "rating": 2.0, "text": "Used to be a great place to get books. Selection is limited and more space is given to gifts, trinkets, and nicknames. Very disappointed. Never really go there since Life way is just a few doors down.", "pics": null, "resp": null, "gmap_id": "0x88626938a8339ba7:0x548f69dc28a6e2c2"}
{"user_id": "117947041488282781845", "name": "Bubba", "time": 1467753148044, "rating": 4.0, "text": "Great place to get bibles and Christian themed gifts.", "pics": null, "resp": null, "gmap_id": "0x88626938a8339ba7:0x548f69dc28a6e2c2"}
{"user_id": "105807671804565530997", "name": "Oree Tanking", "time": 1483290403486, "rating": 4.0, "text": "They have a lot of random things like small pillows and trinkets.", "pics": null, "resp": null, "gmap_id": "0x88626938a8339ba7:0x548f69dc28a6e2c2"}
{"user_id": "111158370222628337609", "name": "Bob Day", "time": 1477075905613, "rating": 5.0, "text": "Very friendly. Although I was a bit disappointed that they didn't have a box to place my gift, that I purchased I'm. Not a show stopper though, great selection of merchandise. We will shop there in the future.", "pics": null, "resp": null, "gmap_id": "0x88626938a8339ba7:0x548f69dc28a6e2c2"}
{"user_id": "114854002886271416664", "name": "DR Jeffery Lehman", "time": 1479139157370, "rating": 5.0, "text": "Bibles and more", "pics": null, "resp": null, "gmap_id": "0x88626938a8339ba7:0x548f69dc28a6e2c2"}
{"user_id": "104644249792199895203", "name": "Mary Beth Dillingham", "time": 1614371551328, "rating": 5.0, "text": "Wonderful friendly service!  Wide variety of religious items.", "pics": null, "resp": {"time": 1615302610805, "text": "Thank you for coming in. please let us know if there is anything we can ever do to assist you\nin your spiritual needs God bless"}, "gmap_id": "0x14e3c2335ac8833f:0x1ccd237e753a2c85"}
{"user_id": "111986414513714657485", "name": "J T", "time": 1594209976042, "rating": 4.0, "text": "Needed help selling my home, they helped me with Saint Joseph and a prayer card and also some trinkets for my girls. Nice folks.", "pics": null, "resp": null, "gmap_id": "0x14e3c2335ac8833f:0x1ccd237e753a2c85"}
{"user_id": "114283309330920714450", "name": "Emily Jacobs", "time": 1543871750425, "rating": 5.0, "text": "I order from Alpha Church Supply regularly and have always received great customer service. Items ship usually the same day, and I've received communication any time there is a question or something is not as we discussed. Great vendor for churches and local to AL!", "pics": null, "resp": null, "gmap_id": "0x14e3c2335ac8833f:0x1ccd237e753a2c85"}
{"user_id": "104226416230533474679", "name": "Sue Dobrinski", "time": 1559932640412, "rating": 5.0, "text": "Friendly and helpful staff. Wide variety of religious articles. Have always found what I came in for plus more when I browse.", "pics": null, "resp": null, "gmap_id": "0x14e3c2335ac8833f:0x1ccd237e753a2c85"}
{"user_id": "101243119637220728609", "name": "DALE BLANCHARD", "time": 1583106807209, "rating": 4.0, "text": "A little pricey. EWTN gift shop has more selection.", "pics": null, "resp": {"time": 1615303942984, "text": "I am sorry you thought our prices were high we do match prices when we are asked.  We also purchase from the same suppliers as EWTN so if there is ever anything you would like to order we would love the opportunity to assist you.\nWe thank you for buying small and local. The money we make stays in this community and supports the local churches and schools in our area.\nUnfortunately the cost of running a small business sometimes cost more because we do not have the advantage that the big box stores enjoy.\nGod bless"}, "gmap_id": "0x14e3c2335ac8833f:0x1ccd237e753a2c85"}
{"user_id": "117137296952378121796", "name": "Jenny Stephens", "time": 1580391343104, "rating": 5.0, "text": "Great catholic gift shop.  Danny always takes good care of his customers.", "pics": null, "resp": {"time": 1615303999279, "text": "Thanks Jenny for your many years of Loyal Patronage. God Bless"}, "gmap_id": "0x14e3c2335ac8833f:0x1ccd237e753a2c85"}
{"user_id": "116728010185444164387", "name": "Veronica Boykin", "time": 1613855138065, "rating": 5.0, "text": "Excellent", "pics": null, "resp": {"time": 1615302659020, "text": "It is our pleasure to serve this community. Please never hesitate to let us know how we can improve\n\nGod bless"}, "gmap_id": "0x14e3c2335ac8833f:0x1ccd237e753a2c85"}
{"user_id": "111573389922165015077", "name": "Cheryl Coletta", "time": 1437079974927, "rating": 5.0, "text": "Always helpful, friendly, goes the extra mile to provide helpful information and be of assistance. Good supply on hand including gifts. Makes me willing to drive a little further.", "pics": null, "resp": null, "gmap_id": "0x14e3c2335ac8833f:0x1ccd237e753a2c85"}
{"user_id": "112541157975925280751", "name": "Eva Teresa Virciglio Holmes", "time": 1526947406367, "rating": 5.0, "text": "Nice assortment of gifts with knowledgeable  staff.", "pics": null, "resp": null, "gmap_id": "0x14e3c2335ac8833f:0x1ccd237e753a2c85"}
{"user_id": "111233522109727303625", "name": "Albert Fann", "time": 1568077787056, "rating": 4.0, "text": "Just looking around.", "pics": null, "resp": {"time": 1615304027847, "text": "Thanks please let us know if we can help in anyway\nGod Bless"}, "gmap_id": "0x14e3c2335ac8833f:0x1ccd237e753a2c85"}
{"user_id": "108284384941781208050", "name": "Walter Blanchard", "time": 1522257102220, "rating": 5.0, "text": "Very friendly and helpful staff.", "pics": null, "resp": null, "gmap_id": "0x14e3c2335ac8833f:0x1ccd237e753a2c85"}
{"user_id": "103136168224154012801", "name": "Destiny Fitch", "time": 1474309076289, "rating": 5.0, "text": "Love it :)  great people", "pics": null, "resp": null, "gmap_id": "0x14e3c2335ac8833f:0x1ccd237e753a2c85"}
{"user_id": "108487521626934380183", "name": "Janice Bivens", "time": 1537553874192, "rating": 5.0, "text": "I've been to the Florence, AL location of Lifeway many, many times and each and every time, the staff greets you as you enter the door.  They have a great inventory of everything and the staff is always standing by to help if you need them.  I would recommend Lifeway to anyone who asks.", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "113932154832393073471", "name": "Pamela Liner", "time": 1556619531134, "rating": 5.0, "text": "Why r you leaving? It was nice having a Christian  book store to go to, to walk around  and  look. Nice people  worked there.", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "105230395384294355600", "name": "Patricia Grenier", "time": 1536858149049, "rating": 5.0, "text": "My first chance to get into a LifeWay store,  and I loved it. They were very helpful. I am looking forward to when I can go again (I live in another region of the country)", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "110379816397306281025", "name": "L johnson", "time": 1546496314732, "rating": 5.0, "text": "I saved almost as much money as I spent. They had accidently scared original price not clearance price. There was no hassle with getting rescaned and money back. They lady did with a smile and while looking another employee helped with what I was looking for. This is one of my favorite stores I could spend half a day browsing. Can't wait to go back. I highly recommend they have everything from Bibles, music , journals to jewelry and everything in between", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "107652382514081159928", "name": "Alicia Brewer", "time": 1489886936351, "rating": 1.0, "text": "I'm very disappointed with my experience. We came from out of town for our friend's baptism and birthday. We wanted to get him his first bible (he's 25) and wanted to get it engraved. We got there about 1.5 hours before they closed. We had found the perfect bible and were very excited! We wanted to get it engraved but the lady at the front said she had turned the machine off for the night. We explained the situation as this we're a special time for our friend but since the machine \"takes a long time to heat up\" we couldn't get it. We even told her we would wait but she didn't want to help us. I planned to get more things while there, but we just paid for the Bible and left disappointed. Thank you for the experience- usually Lifeway stores are better than this. You've definitely lost a customer.", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "114491376401383660616", "name": "London Kimbrough", "time": 1513310223531, "rating": 5.0, "text": "As always, they have everything in stock I go in to buy and the staff is very knowledgeable on just about all of their products! I'm in this store at least four times a month. Highly recommended!!", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "114859542876064016013", "name": "NANCY HOLLAND SMITH", "time": 1559278228840, "rating": 5.0, "text": "Love this store. Very nice people works there.", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "103085649725489891657", "name": "Windy Rippie (GaiaBella Amadahy)", "time": 1546912911179, "rating": 5.0, "text": "She even searched for one in brown leather for me...even tho there was only one available. It was no where close to those similar but she found it for me! Such a big thanks to the assiciates tonight!", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "118180404238305907769", "name": "James Hargett", "time": 1550052087755, "rating": 5.0, "text": "Very helpful and helped me find the books I needed to get a closer walk with Jesus", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "105796755434327732006", "name": "Glenda Bradford", "time": 1543868612522, "rating": 5.0, "text": "Great place for your Christmas card needs. If you need a Bible they are on sale.", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "112989151981189650456", "name": "Penny Lindsey", "time": 1560040367502, "rating": 5.0, "text": "Have always loved looking at Lifeway", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "113699955910839515010", "name": "Danny Berry", "time": 1551978630759, "rating": 5.0, "text": "Great experience and customer service through the roof!", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "115148049247146750811", "name": "Mary Ellen Wells", "time": 1544378336041, "rating": 5.0, "text": "Very good place to get a Bible or anything for a Christian friend.", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "109602379005830722688", "name": "Arnold Brown", "time": 1557788924613, "rating": 4.0, "text": "Enjoy this place & shame they are Closing All their Stores. Will survive Online", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "106457342556133525132", "name": "Daniel Betancourt", "time": 1547316129272, "rating": 5.0, "text": "Great Service! They Have What You Need.", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "102810530345606228155", "name": "Daniel Ray", "time": 1559682101325, "rating": 3.0, "text": "Going out of business.  They have a significant liquidation sale.", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "100075741322141871013", "name": "Susan Cole", "time": 1546831238646, "rating": 5.0, "text": "Love this store and staff so much.", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "117330769795138339826", "name": "fat cat clark", "time": 1552332160657, "rating": 2.0, "text": "Too many policy changes. Hard to get some my vbs materials. Disappointed", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "112709667361384797695", "name": "Ashley Butler", "time": 1558921391492, "rating": 5.0, "text": "I'm gonna miss going here", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "116606424415530367998", "name": "James Kilburn", "time": 1459691541837, "rating": 5.0, "text": "We have been here several times. Their shelves are always stocked and the employees are alas friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "113632518454390544154", "name": "LaTonia James", "time": 1560684094991, "rating": 5.0, "text": "I'm so sad that in 4 days this location will be closing. I got some gifts and a book I had been looking for. Items were marked down 80% & 90% off with an add'l 20% off the entire basket.", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "115218273376883135264", "name": "connie diggs", "time": 1522275584734, "rating": 5.0, "text": "Very helpful with some ideas and good deals!", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "116381673924190327209", "name": "Marcus James", "time": 1547471724330, "rating": 5.0, "text": "A great experience as always.", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "114275751548305851140", "name": "Mark Parker", "time": 1544287153981, "rating": 4.0, "text": "Nice store friendly staff.", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "113000878513372973990", "name": "Calie White", "time": 1534902919582, "rating": 5.0, "text": "I love this place!!! They are like just family!!", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "108922136449722554989", "name": "Melissa Ricks", "time": 1562478194615, "rating": 5.0, "text": "Sure gonna miss this place!!", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "111439794424224954175", "name": "Donna Cooper", "time": 1559671771572, "rating": 4.0, "text": "Love this store and it is going out of business.", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "105666233058245569503", "name": "anthony givens", "time": 1551839213429, "rating": 5.0, "text": "Very helpful people.", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "103612352663219045780", "name": "Barbara Thomas", "time": 1558445195007, "rating": 2.0, "text": "Closing!!!! Bad news for churches and a lot of people who went there for Christian literature.", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "116099053320714489760", "name": "Case Daly", "time": 1548530452611, "rating": 5.0, "text": "Employees are very helpful.", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "101740766534215422685", "name": "KEITH GOINS", "time": 1555959210773, "rating": 5.0, "text": "Sad they are closing", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "115833420259092629632", "name": "Johnny Keeton", "time": 1567204886111, "rating": 5.0, "text": "Sorry it had to close", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "104973046088761575568", "name": "Cindy Carden", "time": 1556504747765, "rating": 5.0, "text": "Best customer service", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "117462027620201161950", "name": "Eli Sims", "time": 1556655894750, "rating": 2.0, "text": "SO pricey", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "108861349251852087095", "name": "Kristy OLIVE", "time": 1544381459160, "rating": 5.0, "text": "Friendly service!", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "109621032266035909817", "name": "Meadow Gold", "time": 1567116964699, "rating": 1.0, "text": "No longer open", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "111001767993243664986", "name": "Linda Gregory", "time": 1557076567211, "rating": 5.0, "text": "Nice", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "105001829310611970915", "name": "Warren Massey", "time": 1561825044890, "rating": 1.0, "text": "Closing up", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "102397342134933288684", "name": "Janie Watson", "time": 1560951463509, "rating": 5.0, "text": "They move", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "115063870215689338061", "name": "Heather Nash", "time": 1549418241736, "rating": 5.0, "text": "Love this place", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "114418470066376410630", "name": "YT Family Gaming and Vlog", "time": 1545309109297, "rating": 5.0, "text": "There are a lot of things to get", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "113411723324375117193", "name": "Eric Malone", "time": 1545431955228, "rating": 5.0, "text": "Nice atmosphere", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "110741131168760309491", "name": "Darlene Tays", "time": 1553834312822, "rating": 5.0, "text": "Sad!😥😥", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "107792159127104176459", "name": "IcyTOXIC KAM", "time": 1547350936770, "rating": 5.0, "text": "Great to buy Christian memabillua", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
{"user_id": "103253878765190130277", "name": "Steven Frederick", "time": 1527210951830, "rating": 5.0, "text": "Very organized and clean.", "pics": null, "resp": null, "gmap_id": "0x887d361fe9798e9b:0xc3ee5c857754991b"}
