{"user_id": "108748577435930321264", "name": "Bo Roberson", "time": 1630437154892, "rating": 5.0, "text": "These guys were very polite and professional!!!!! Would def. RECCOMEND using there service . on site with in hours and did a fantastic job !!!!", "pics": null, "resp": null, "gmap_id": "0x889c1736801947bb:0xdfb874e5dfa7fe5b"}
{"user_id": "108884678789311118921", "name": "Raymond Cooper", "time": 1620247305049, "rating": 5.0, "text": "I am very happy with the customer service, friendliness and professionalism of Restoration 1. My condo unit needed mold cleanup and the Restoration 1 Team with Charlie Mitchell were extremely responsive and helpful. They explained the mold situation thoroughly and took the time to help me understand the steps needed to clean it up and ensure my health and safety. Charlie was extremely responsive and patient with my calls and texts. I recommend this company and team for your cleanup needs. Thanks Charlie; you rock!", "pics": null, "resp": null, "gmap_id": "0x889c1736801947bb:0xdfb874e5dfa7fe5b"}
{"user_id": "110001494529809039735", "name": "Jon Curtis", "time": 1629304171048, "rating": 5.0, "text": "Very professional! I highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889c1736801947bb:0xdfb874e5dfa7fe5b"}
{"user_id": "104208341630642167934", "name": "Stephanie McWilliams", "time": 1618104356909, "rating": 5.0, "text": "Thank you so much, Restoration One! I got in touch with Lisa and she had David come out immediately! David was very professional, thorough, knowledgeable, polite, compassionate, and kind! I will definitely recommend this business to anyone experiencing water damage! You have an awesome team of people and my family and I are beyond pleased with outcome. Thank you so very much!", "pics": null, "resp": null, "gmap_id": "0x889c1736801947bb:0xdfb874e5dfa7fe5b"}
{"user_id": "108502372809985681629", "name": "Virginia Holzer", "time": 1621260286162, "rating": 5.0, "text": "I recommend this company!!! Awesome...professional, kind, and very helpful!!! Thank goodness the issue at hand was caught in time and Charlie gave helpful information to take care of the very low end problem....Thank You", "pics": null, "resp": null, "gmap_id": "0x889c1736801947bb:0xdfb874e5dfa7fe5b"}
{"user_id": "112285302124194229408", "name": "Cb", "time": 1617042807126, "rating": 5.0, "text": "Hi, I wanted to thank you for sending Dave A & Tal L to our home. They have been so kind, knowledgeable and understanding. They check in on us daily.\nIt was so stressful when our hot water heater broke and had water everywhere. It's so nice to work with people who care about their customers,  the people they work for and take pride in a job well done!\nI'm so glad we chose Restoration1 to help us and I will recommend Restoration 1 to everyone!!\nThank you!! 🙏🙏", "pics": null, "resp": null, "gmap_id": "0x889c1736801947bb:0xdfb874e5dfa7fe5b"}
{"user_id": "114464937476495904435", "name": "Gloria Valley", "time": 1623265089507, "rating": 5.0, "text": "Restoration 1 highly recommended Joshua was a very respectable young man very polite and professional would recommend to anyone", "pics": null, "resp": null, "gmap_id": "0x889c1736801947bb:0xdfb874e5dfa7fe5b"}
{"user_id": "118005665731713085479", "name": "Debra Dupuis", "time": 1626184730695, "rating": 5.0, "text": "Great company! Unfortunately, I had to use them twice in the last 6 months. They were fantastic to work with. Called Charlie and he came immediately. He surveyed situation and immediately David was on the job quickly. Then to Perry…. He reconstructed a wall and did painting. Great employees. Highly recommend this company. Employees very kind and respectful.", "pics": null, "resp": null, "gmap_id": "0x889c1736801947bb:0xdfb874e5dfa7fe5b"}
{"user_id": "112541411775633349919", "name": "A AR", "time": 1610418696905, "rating": 5.0, "text": "Mother-in-laws immaculate home suffered a calamity. The upper floors boiler had burst. She returned to see a rainstorm above her and deluge beneath foot. The work crew arrived shortly after contact. Despite being a great distance, Semmes, Alabama, Restoration 1 of Gulf Coast accepted the challenge.\n\nHomeowner as twice survivor of World Trade Center attacks took sight of the mayhem deeply. The entire crew went above and beyond in both reassuring that all would be as new, and in respect of homeowners clear distress.\n\nI heard thoughtful praise from her regarding both professionalism and good manners with every days interactions. My wife felt reassured for her mother's dilemma and I in turn felt compelled to give highest praise! God bless.", "pics": null, "resp": null, "gmap_id": "0x889c1736801947bb:0xdfb874e5dfa7fe5b"}
{"user_id": "115045185818804559103", "name": "Scott C. Allen", "time": 1611187167453, "rating": 5.0, "text": "After Hurricane Zeta came through Charlie Mitchell came out to inspect and within a day and they had my roof properly tarped and covered. They worked with me fairly and I really appreciate that.", "pics": null, "resp": null, "gmap_id": "0x889c1736801947bb:0xdfb874e5dfa7fe5b"}
{"user_id": "106995550698876592098", "name": "John Sones", "time": 1609978634765, "rating": 5.0, "text": "If you are looking for honest, hardworking, helping, and dependable work... this is the place. I was so impressed at the work and help that was performed.", "pics": null, "resp": null, "gmap_id": "0x889c1736801947bb:0xdfb874e5dfa7fe5b"}
{"user_id": "109186913057624824878", "name": "Elysia Ashley", "time": 1607033865694, "rating": 5.0, "text": "They responded quickly and did an amazing job and were able to save our floor.  They definitely care about their customers and making sure they are satisfied with the service they receive!", "pics": null, "resp": null, "gmap_id": "0x889c1736801947bb:0xdfb874e5dfa7fe5b"}
{"user_id": "113505794756140987187", "name": "Lynda Crystal", "time": 1620331146704, "rating": 5.0, "text": "Charlie and Josh were great to work with!", "pics": null, "resp": null, "gmap_id": "0x889c1736801947bb:0xdfb874e5dfa7fe5b"}
{"user_id": "109105262551397450666", "name": "Burrell Gee", "time": 1596823875582, "rating": 5.0, "text": "Excellent response time! Our vacation house had a minor mold problem and Charlie from Restoration1 came to inspect and advise us on remediation. Excellent service and clear and professional communication. Strongly recommend them!", "pics": null, "resp": {"time": 1602859119505, "text": "Thank you so much for leaving us a review.  We value our customers and their feedback.   It was a pleasure doing business with you.  Pay us the highest compliment and send us referrals.   Thank you again!!!"}, "gmap_id": "0x889c1736801947bb:0xdfb874e5dfa7fe5b"}
{"user_id": "111810579341541388431", "name": "Sarah Romero", "time": 1590693841140, "rating": 5.0, "text": "We unfortunately had water damage from a leak from a hot water pipe under our house. Restoration 1 was on our list of water mitigation companies from our home owners insurance. I requested service, and Briana set us up with the project manger to come out the very next day. Charlie and his team have been phenomenal through this process. Kept us informed every step of the way. Offered solid advice. Always on time. Extremely friendly. Charlie also worked closely with our insurance adjuster to ensure everyone was on the same page. We will ALWAYS recommend Restoration 1!", "pics": null, "resp": {"time": 1602859237807, "text": "Thank you so much for leaving us a review.  We value our customers and their feedback.   It was a pleasure doing business with you.  Pay us the highest compliment and send us referrals.   Thank you again!!!"}, "gmap_id": "0x889c1736801947bb:0xdfb874e5dfa7fe5b"}
{"user_id": "117806545960281060075", "name": "samantha shaw", "time": 1591634006148, "rating": 5.0, "text": "I just moved to the state, and didn’t have any idea where to start looking for someone to fix a new leak that just sprouted up from the storm. I had asked my home insurance agent and he give me a couple of numbers to chose from. I called him Sunday evening, and Monday morning he was here bright and early to fix the issue. Very professional and efficient. He was also very friendly and discussed/explained the issue with me right there and then. All in all very pleased with how quickly he was able to come assess the leak, fix the leak, and how friendly he was. I will for sure be using him again!", "pics": null, "resp": {"time": 1602859218647, "text": "Thank you so much for leaving us a review.  We value our customers and their feedback.   It was a pleasure doing business with you.  Pay us the highest compliment and send us referrals.   Thank you again!!!"}, "gmap_id": "0x889c1736801947bb:0xdfb874e5dfa7fe5b"}
{"user_id": "111634080206365810447", "name": "Pat Piazza", "time": 1598191418842, "rating": 5.0, "text": "Our A/C system had mold. Phillip responded quickly. He had the team lined up and job was completed within days.  Professionally handled!", "pics": null, "resp": {"time": 1602859184293, "text": "Thank you so much for leaving us a review.  We value our customers and their feedback.   It was a pleasure doing business with you.  Pay us the highest compliment and send us referrals.   Thank you again!!!"}, "gmap_id": "0x889c1736801947bb:0xdfb874e5dfa7fe5b"}
{"user_id": "107603513969437922665", "name": "Jami Birchfield", "time": 1579868740041, "rating": 5.0, "text": "Fantastic company to work with. Would not hesitate to hire if disaster were to strike again. Super fast response time. The work in my house was started within 48 hours of contacting them and finished very quickly. Friendly and knowledgeable staff!", "pics": null, "resp": {"time": 1602859293603, "text": "Thank you so much for leaving us a review.  We value our customers and their feedback.   It was a pleasure doing business with you.  Pay us the highest compliment and send us referrals.   Thank you again!!!"}, "gmap_id": "0x889c1736801947bb:0xdfb874e5dfa7fe5b"}
{"user_id": "105399934922571692664", "name": "Jamie May", "time": 1591812312884, "rating": 5.0, "text": "Charlie was wonderful in fitting my estimate in same day! He came out and took a look at my attic and leveled with me on whether I needed a professional to help versus a simple job I could do myself. He even set up the simple fix for me and didn’t charge me! I offered to pay for the time and travel but in true, southern fashion he wouldn’t hear of it! I highly recommend working with this company for honest work! If I ever have any other water damage issue I will 100% give Charlie a call - and make him take my money next time! ;)", "pics": null, "resp": {"time": 1602859211422, "text": "Thank you so much for leaving us a review.  We value our customers and their feedback.   It was a pleasure doing business with you.  Pay us the highest compliment and send us referrals.   Thank you again!!!"}, "gmap_id": "0x889c1736801947bb:0xdfb874e5dfa7fe5b"}
{"user_id": "103247746958313770652", "name": "George Covington", "time": 1623449429252, "rating": 5.0, "text": "I will call them next time 👍🏻", "pics": null, "resp": null, "gmap_id": "0x889c1736801947bb:0xdfb874e5dfa7fe5b"}
{"user_id": "105395219289082471287", "name": "Kim W.", "time": 1591815314717, "rating": 5.0, "text": "Great company and great employees! Phillip is a huge help! Had an emergency after the tropical storm and they were here within minutes! Will definitely recommend them!", "pics": null, "resp": {"time": 1602859200327, "text": "Thank you so much for leaving us a review.  We value our customers and their feedback.   It was a pleasure doing business with you.  Pay us the highest compliment and send us referrals.   Thank you again!!!"}, "gmap_id": "0x889c1736801947bb:0xdfb874e5dfa7fe5b"}
{"user_id": "117115612378648426698", "name": "Jessica Blackwell", "time": 1557423074159, "rating": 5.0, "text": "I rarely leave reviews, but I couldn't let this one go by without being recognized.  The Restoration1 team had an enormous undertaking when my 3,000+ Sq. Ft. house caught fire.  They gutted the entire house, except for a couple of rooms in the back of the house.  None of them (even those in charge) were afraid to jump in and get their hands dirty!  They cleaned what was left and kept us updated of our home's status the entire way.  They were such a pleasure to be around and deal with.  They understood that losing your home of many decades was emotional and handled us and our items with care.  They answered all of our questions (and we had tons) along the way.  They even helped us transition into working with our contractor.  Each and every one of them were so knowledgeable, paired with being personable and so kind-you just can't beat that!   I would definitely recommend them for any Water, Fire, Mold, and/or Smoke damage.  You certainly won't be disappointed!", "pics": null, "resp": {"time": 1602859387768, "text": "Thank you so much for leaving us a review.  We value our customers and their feedback.   It was a pleasure doing business with you.  Pay us the highest compliment and send us referrals.   Thank you again!!!"}, "gmap_id": "0x889c1736801947bb:0xdfb874e5dfa7fe5b"}
{"user_id": "117621257430312666548", "name": "Sam Owen", "time": 1580944525502, "rating": 5.0, "text": "When something occurs to your home requiring restoration, it can be a stressful time.  Restoration 1 and Charlie made this situation as smooth and painless as possible.  We were kept informed of the process and progress throughout the restoration period.  Charlie worked to make the cleanup as convenient as possible.  I would highly recommend Restoration 1!", "pics": null, "resp": {"time": 1602859245797, "text": "Thank you so much for leaving us a review.  We value our customers and their feedback.   It was a pleasure doing business with you.  Pay us the highest compliment and send us referrals.   Thank you again!!!"}, "gmap_id": "0x889c1736801947bb:0xdfb874e5dfa7fe5b"}
{"user_id": "112674513111667437249", "name": "Stephen Carlson", "time": 1580663588615, "rating": 5.0, "text": "As a local contractor I’ve had two experiences where I needed Restoration1’s expertise on my job site. I will say from the initial conversation with the local manager, Charlie, the experience was fantastic. From pricing, responsiveness and overall quality of work.\n\nGreat job to Restoration1.", "pics": null, "resp": {"time": 1602859255554, "text": "Thank you so much for leaving us a review.  We value our customers and their feedback.   It was a pleasure doing business with you.  Pay us the highest compliment and send us referrals.   Thank you again!!!"}, "gmap_id": "0x889c1736801947bb:0xdfb874e5dfa7fe5b"}
{"user_id": "106792903434221859662", "name": "Johnathon Christen", "time": 1556237289128, "rating": 5.0, "text": "Charlie and his crew came in on short notice at night and did an outstanding job with a flooding issue we had in our new home. Everyone was quick, professional, and knowledgeable. If you have any sort of remediation that is needed at your home give these guys a call.", "pics": null, "resp": {"time": 1602859401964, "text": "Thank you so much for leaving us a review.  We value our customers and their feedback.   It was a pleasure doing business with you.  Pay us the highest compliment and send us referrals.   Thank you again!!!"}, "gmap_id": "0x889c1736801947bb:0xdfb874e5dfa7fe5b"}
{"user_id": "112297683653470234821", "name": "Kristine Sandoz", "time": 1562713883030, "rating": 5.0, "text": "Our home was flooded during the May storms and we had over 3' of water from the Wolf River in our first floor.  The best thing we did was to contact Restoration 1.  Charlie, Pete, and their team were at our home the first day it was accessible to begin the mitigation process.  They handled everything that needed to be done with professionalism and care.  We were in the best hands possible during a very trying time.  THANK YOU, not only for the great work, but also for your guidance and compassion.", "pics": null, "resp": {"time": 1602859378407, "text": "Thank you so much for leaving us a review.  We value our customers and their feedback.   It was a pleasure doing business with you.  Pay us the highest compliment and send us referrals.   Thank you again!!!"}, "gmap_id": "0x889c1736801947bb:0xdfb874e5dfa7fe5b"}
{"user_id": "106271909680319952225", "name": "Shayne Baca", "time": 1579721076650, "rating": 5.0, "text": "I had the pleasure of meeting the owner today and I had to share publicly how impressed I was with his professionalism and his demeanor.  I highly recommend his company’s services and his team of service experts.", "pics": null, "resp": {"time": 1579302180450, "text": "Hello, we regret that this incident occurred and we will speak with our drivers about parking immediately. At times our drivers are required to carry heavy equipment into work locations and often seek out the nearest parking available; and after a job they check in on their cellphones to see what or where they need to go next. This is not an excuse, but an explanation of why this unfortunate event may have happened. If you could tell us where your business is located we will make sure to convey to our drives to look for the provided parking in your and other areas. Thank you for providing this opportunity to make us better."}, "gmap_id": "0x889c1736801947bb:0xdfb874e5dfa7fe5b"}
{"user_id": "116117007790455815111", "name": "Matt Reed", "time": 1580236640416, "rating": 5.0, "text": "Saved me a lot of money by sharing his expertise with me. Will definitely do business with them in the future when the next time arises.", "pics": null, "resp": {"time": 1602859262005, "text": "Thank you so much for leaving us a review.  We value our customers and their feedback.   It was a pleasure doing business with you.  Pay us the highest compliment and send us referrals.   Thank you again!!!"}, "gmap_id": "0x889c1736801947bb:0xdfb874e5dfa7fe5b"}
{"user_id": "110211744958719580297", "name": "Kenneth Wilson", "time": 1580132148768, "rating": 5.0, "text": "Excellent service. Excellent management. From single homes, to multi family, high volume projects, these guys are sure to deliver!", "pics": null, "resp": null, "gmap_id": "0x889c1736801947bb:0xdfb874e5dfa7fe5b"}
{"user_id": "111762755654635886948", "name": "Diana Wilson", "time": 1576182122810, "rating": 5.0, "text": "We have utilized the services of Restoration 1 many times here on the Gulf Coast and are overwhelmed with their turnaround time and workmanship.  These guys are very good at what they do and are very pleasant, punctual, persistent and professional.  They are very knowledgeable in all aspects of microbial activity and what steps to take to eradicate the problem.  I highly recommend this company if you should find yourself in a position to warrant their services.  These guys will walk you through the process step by step and explain everything to you in a way that you can understand it, they talk to you not over you.  Restoration 1 does an excellent job of quarantine throughout your home so that if there is any microbial activity in certain areas it does not get to the rest of the house during the work being performed on your home.   These guys do it all, they handle Fire and Smoke Restoration, Water Damage Restoration, and Applied Microbial Remediation.  Again, I highly recommend Pete, Charlie and their crew to everyone needing restoration or remediation services.", "pics": null, "resp": {"time": 1602859310405, "text": "Thank you so much for leaving us a review.  We value our customers and their feedback.   It was a pleasure doing business with you.  Pay us the highest compliment and send us referrals.   Thank you again!!!"}, "gmap_id": "0x889c1736801947bb:0xdfb874e5dfa7fe5b"}
{"user_id": "102830798964047136272", "name": "Cale Merrill", "time": 1580147792571, "rating": 5.0, "text": "Have had some customers use them in the past and they are quick and professional!", "pics": null, "resp": null, "gmap_id": "0x889c1736801947bb:0xdfb874e5dfa7fe5b"}
{"user_id": "113914259828537533043", "name": "Joseph Celona", "time": 1568080500201, "rating": 5.0, "text": "Speaking from experience with another Biloxi company, these guys are ABOVE AND BEYOND the standard mold remediation experts in the south! Hire now and Literally breathe easy.", "pics": null, "resp": null, "gmap_id": "0x889c1736801947bb:0xdfb874e5dfa7fe5b"}
{"user_id": "110797107772920198593", "name": "Micah Jefferson", "time": 1556911901109, "rating": 5.0, "text": "Charlie and his crew run a top notch operation, we had water damage in our home and they were out quickly and addressed all of our concerns.  High Recommend Restoration 1 of Gulf Coast!!", "pics": null, "resp": {"time": 1602859394655, "text": "Thank you so much for leaving us a review.  We value our customers and their feedback.   It was a pleasure doing business with you.  Pay us the highest compliment and send us referrals.   Thank you again!!!"}, "gmap_id": "0x889c1736801947bb:0xdfb874e5dfa7fe5b"}
{"user_id": "114755104140518861013", "name": "Kimberly Pyron", "time": 1564759361049, "rating": 5.0, "text": "The staff was very professional and addressed our needs in a very timely manner. Our firm would highly recommend them.", "pics": null, "resp": {"time": 1602859370106, "text": "Thank you so much for leaving us a review.  We value our customers and their feedback.   It was a pleasure doing business with you.  Pay us the highest compliment and send us referrals.   Thank you again!!!"}, "gmap_id": "0x889c1736801947bb:0xdfb874e5dfa7fe5b"}
{"user_id": "114879645003012139046", "name": "Stacy Dennis", "time": 1574208752657, "rating": 5.0, "text": "Exceptional professionalism and customer service.  Very courteous staff.", "pics": null, "resp": null, "gmap_id": "0x889c1736801947bb:0xdfb874e5dfa7fe5b"}
{"user_id": "111203207146155114515", "name": "Morgan Ogilvie", "time": 1629749933335, "rating": 5.0, "text": "David, Blake and their team are absolutely fantastic. They did a great job installing our new roof in a very timely manner. They were very easy to work with and provided top notch service throughout the entire process. Could not more highly recommend.", "pics": null, "resp": {"time": 1629823581543, "text": "Morgan,\nThank you for the nice review. It was a pleasure getting to know you and your wife, and helping you with your roofing needs. Congratulations on that new and beautiful house.\nDG."}, "gmap_id": "0x88892f9905010e91:0x33ff206e3ed0f22"}
{"user_id": "101459326813416613061", "name": "Gloria McGee", "time": 1621042060239, "rating": 5.0, "text": "I contacted David at DynoDry Roofing and Construction for an estimate on a full roof replacement. He came to my home and assessed my roof and provided an estimate with an affordable and reasonable price.  He provided the date and time the crew would come out to begin the work and had the materials delivered to my home the day before the start date. The crew arrived promptly at the time he advised and the roof work was completed on the same day. The new roof and the clean up performed after completion of the job were immaculate.  David is friendly, straightforward, extremely knowledgeable, and very professional. I would highly recommend that anyone in need of roof work contact David at DynoDry Roofing and Construction to have the work needed assessed and completed in a timely, efficient, and professional manner at a fair and reasonable cost.", "pics": null, "resp": {"time": 1621054264787, "text": "Ms. McGee,\nThank you for the feedback and review.\nIt was a pleasure working with you to replace your roof. The style and color you chose look great on your house.\nWe at DynoDry Roofing & Construction Services look forward to working with you on your future home improvement projects."}, "gmap_id": "0x88892f9905010e91:0x33ff206e3ed0f22"}
{"user_id": "112765767346266541599", "name": "Julia Bruce", "time": 1619015472049, "rating": 5.0, "text": "David and crew did a great job and the roof looks great.  Very easy to work with.  Would definitely work with them again!", "pics": null, "resp": {"time": 1621054504922, "text": "Julia,\nThank you for the kind review.\nWe look forward to working with you in the future on your next home improvement project.\nCongratulations on your new home."}, "gmap_id": "0x88892f9905010e91:0x33ff206e3ed0f22"}
{"user_id": "102678160942890726906", "name": "Lynn Crawford", "time": 1614280516066, "rating": 5.0, "text": "I had an unexpected leak during a rainstorm.  David was very responsive and was able to get to my house the next day and make sure that everything was covered and waterproof.  After the work was completed, he came back several times to make sure everything was done perfectly and to ease my anxiety about water.  I highly recommend them for any of their services.", "pics": null, "resp": {"time": 1614439172881, "text": "Dr. Crawford,\nThank you for the kind words and the 5 star review. It was nice meeting and working with you on your house to resolve your water intrusion issues.\nThe new roof, gutters and soffit renovations look great on your home. Nice job on your color choices!"}, "gmap_id": "0x88892f9905010e91:0x33ff206e3ed0f22"}
{"user_id": "105487344407702988559", "name": "Savanna Marion", "time": 1614374848107, "rating": 5.0, "text": "Wonderful team! We love our new roof and the value it brings to our home. Very professional and easy to work with!", "pics": null, "resp": {"time": 1614439359067, "text": "Savanna,\nThank you for the kind words, the 5 star review and trusting DynoDry Roofing & Construction Services to replace your roof."}, "gmap_id": "0x88892f9905010e91:0x33ff206e3ed0f22"}
{"user_id": "101203638397346823902", "name": "Judith Carter", "time": 1618847324497, "rating": 5.0, "text": "Outstanding service and workmanship.  Accurate estimate, on time delivery, maintained a clean and safe work place.  Professional roofing at its best.", "pics": null, "resp": {"time": 1618848486847, "text": "Ms. Carter,\nThank you for the kind review. We at DynoDry Roofing & Construction Services appreciate your business. It was a pleasure working with and getting to know you and Mr. Carter.\nGod Bless you both!"}, "gmap_id": "0x88892f9905010e91:0x33ff206e3ed0f22"}
{"user_id": "100820728693537578181", "name": "Allan Casteel", "time": 1618573050500, "rating": 5.0, "text": "The workers at Dynodry were very professional. They were excellent at keeping the site clean while they performed the work. I would use them again for sure.", "pics": null, "resp": {"time": 1618848908200, "text": "Mr. Casteel,\nThank you for the nice review. Your project was certainly unique in that we had to get it done despite COVID restrictions and the delays it caused in getting some of the non-stocked materials. Our goal at DynoDry Roofing & Construction Services is always 100% customer satisfaction, regardless of the project challenges.\nThanks again and congratulations on selling your house."}, "gmap_id": "0x88892f9905010e91:0x33ff206e3ed0f22"}
{"user_id": "108016606291609766924", "name": "Courtney Waldron", "time": 1571174608288, "rating": 5.0, "text": "Happy to recommend David and his crew. They did a major project on our home and it turned out beautifully. He communicated with us throughout the project and his guys were always on time...every day! We so appreciate that. They also made sure our pool and lawn were protected throughout the project. Very happy with their work!", "pics": null, "resp": null, "gmap_id": "0x88892f9905010e91:0x33ff206e3ed0f22"}
{"user_id": "115185044521017802077", "name": "Lee Moradi", "time": 1502374485537, "rating": 5.0, "text": "I highly recommend DynoDry for roofing and gutter work!  David Grill is very honest and takes time to answer questions.  He was very helpful to us and had several roofing samples for us to pick from.  His workers were kind and professional and put up our roof quickly with no mess.  There has been a lot of rain since the new roof was put on the house and we have seen no problems.  Our roof looks great and we couldn't be happier!", "pics": null, "resp": null, "gmap_id": "0x88892f9905010e91:0x33ff206e3ed0f22"}
{"user_id": "108438710144211837325", "name": "Janat Sapp", "time": 1501042623882, "rating": 5.0, "text": "We highly recommend DynoDry for roofing!  David Grill is very thorough and answered all of our questions.  He was very helpful to us and had several samples attached to our roof so that we could pick out the color that looks the best.  His workers were kind and professional and put up our roof quickly with no mess.  Our roof looks great and we couldn't be happier!", "pics": null, "resp": {"time": 1501046946695, "text": "Thank you for the kind words Ms. Sapp.\nThat GAF Timberline HD shingle, in the Weathered Wood color you chose, looks great on your house.\nYou guys were a pleasure to work with on this project."}, "gmap_id": "0x88892f9905010e91:0x33ff206e3ed0f22"}
{"user_id": "112901905839749275560", "name": "Janet Fred", "time": 1527961032243, "rating": 5.0, "text": "It is really hard to explain how more than pleased we were to meet and use the services of DynoDry. David, the owner, came and met my 90 year old Mother and discussed the process of reroofing her house after storm damage. There was damage from leaks and he had his subcontractors come out and explain the process and give us a price. They were so kind and hard working and totally trustworthy. We have owned many homes over the years and have never had such a good feeling when a project was complete, truly thankful to have had such an honorable man and a wonderful company to do the work we needed at a very fair price. We would recommend them highly, and have already done so.", "pics": null, "resp": {"time": 1527962424646, "text": "Thank you for the kind words Ms. Fred. It was a pleasure meeting your family and working with all of you to make all the necessary roof and interior water damage repairs at your home."}, "gmap_id": "0x88892f9905010e91:0x33ff206e3ed0f22"}
{"user_id": "102862305781840654161", "name": "Brian Screws", "time": 1525270958885, "rating": 5.0, "text": "Very happy with the work by the guys at DynoDry. I worked 1-on-1 with David (the owner) through the entire process of replacing my roof and repairing some water damage inside and outside of my home. David is extremely knowledgeable about his trade and answered any possible question that I could throw at him. Highly recommended.", "pics": null, "resp": {"time": 1525912344082, "text": "Brian,\nThank you for the kind words and compliments. It is always our goal to do excellent work and communication with our customers is key throughout the project."}, "gmap_id": "0x88892f9905010e91:0x33ff206e3ed0f22"}
{"user_id": "104846460321858755899", "name": "Karen Reeves", "time": 1465940580013, "rating": 5.0, "text": "DynoDry provided mold removal in our master bath. We had black mold and could not complete our remodel until the mold and drying was completed. DynoDry did a great job in meeting our needs. They were prompt and extremely professional. I would recommend DynoDry to anyone needing their services.", "pics": null, "resp": null, "gmap_id": "0x88892f9905010e91:0x33ff206e3ed0f22"}
{"user_id": "112599101664430823832", "name": "Sarah Howard", "time": 1525970716343, "rating": 5.0, "text": "David was very helpful as we navigated the insurance claim process and his team was fast and efficient with replacing our roof. We are very happy with the end result.", "pics": null, "resp": {"time": 1525973039439, "text": "Sarah,\nThank you for the compliments.\nIt was great working with you and your lovely family.\nAlso, it's always a pleasure to help with active military families. Again, thank you and your husband for his service to our country."}, "gmap_id": "0x88892f9905010e91:0x33ff206e3ed0f22"}
{"user_id": "103059593739506948156", "name": "David Harcourt", "time": 1466992870522, "rating": 5.0, "text": "Not quiet finished as yet , but if last 5% is as good as the first, I will be well satisfied.\nOn time, quality work ,and on budget.\nThe owner , David, suggested an upgraded shingle that we like very well. Worth the extra cost.", "pics": null, "resp": null, "gmap_id": "0x88892f9905010e91:0x33ff206e3ed0f22"}
{"user_id": "102847366506453585995", "name": "David Whitehurst", "time": 1471025559726, "rating": 5.0, "text": "David and DynoDry responded immediately when we had a high pressure water line break at my office. They jumped right on getting the water out and then dried everything over just a few days. This helped avoid the moisture turning to mold inside the walls and ceiling. They also handled the repairs very professionally after getting us dried out. I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x88892f9905010e91:0x33ff206e3ed0f22"}
{"user_id": "107607598466372451173", "name": "Mike Whitaker", "time": 1465960990093, "rating": 5.0, "text": "We were very pleased with the competitive pricing and professional work. We have received many compliments on our new roof. The new ridge vents should also result in lower energy cost.", "pics": null, "resp": null, "gmap_id": "0x88892f9905010e91:0x33ff206e3ed0f22"}
{"user_id": "114801159438379923600", "name": "Henry Raymond", "time": 1527844236315, "rating": 5.0, "text": "They did a great job. Keep the site clean and keep us informed as progress was made.", "pics": null, "resp": {"time": 1527867632270, "text": "Henry,\nThank you for feedback on the re-roof project we did at The First Presbyterian Church of Alabaster.  It was a pleasure working with everyone there on the building committee to get this project completed.  Also, we were grateful to be chosen to do the work on such an iconic, landmark Alabaster church."}, "gmap_id": "0x88892f9905010e91:0x33ff206e3ed0f22"}
{"user_id": "108575607063031718667", "name": "Jason Morris", "time": 1598940048729, "rating": 5.0, "text": "Good customer service very helpful", "pics": null, "resp": null, "gmap_id": "0x8862838bb27bccfb:0xac40869fc3dc3bb7"}
{"user_id": "105475501484615624258", "name": "GARY Busby", "time": 1530542580523, "rating": 5.0, "text": "Great place", "pics": null, "resp": null, "gmap_id": "0x8862838bb27bccfb:0xac40869fc3dc3bb7"}
{"user_id": "108051337680668230077", "name": "Elysia Bailey", "time": 1528823385632, "rating": 5.0, "text": "Great place. Friendly people. Love hopping here.", "pics": null, "resp": null, "gmap_id": "0x888957a51a0140d9:0x861284b2950a06f0"}
{"user_id": "115529957321885282850", "name": "Michael Bullock", "time": 1544142252236, "rating": 4.0, "text": "Found everything I needed", "pics": null, "resp": null, "gmap_id": "0x888957a51a0140d9:0x861284b2950a06f0"}
{"user_id": "102476520551396229379", "name": "Lynn Pottratz", "time": 1628698411208, "rating": 5.0, "text": "He did a good job for me. He was easy to contact and let me know when he would do the job and stuck to his word.", "pics": null, "resp": {"time": 1628699626654, "text": "Thanks ! Glad we was the business you chosen! We as a business try to meet requirements and request from our customers to make sure the job is done the right way and low prices to make customer happy! Hope to do business again soon!\nThanks! Small Time Repairs…."}, "gmap_id": "0x886285407746b809:0x92577001dc9ebaaf"}
{"user_id": "115326355108151220251", "name": "Amanda Hardy", "time": 1623561637790, "rating": 5.0, "text": "Did a great job got it done quickly and even did extra with no charge thanks I’ll always be sure to call this small business..", "pics": null, "resp": null, "gmap_id": "0x886285407746b809:0x92577001dc9ebaaf"}
{"user_id": "111463541139459886703", "name": "Megan", "time": 1625409880959, "rating": 5.0, "text": "They did a great job & my yard looks great", "pics": null, "resp": {"time": 1625671064403, "text": "Thanks glad we could make another customer happy! If you need anything else feel free to call!"}, "gmap_id": "0x886285407746b809:0x92577001dc9ebaaf"}
{"user_id": "109390758289792747383", "name": "Darriusj Joseph", "time": 1624982315825, "rating": 5.0, "text": "Very responsive and good at what they do if you want a good hire this business is the one for the job!!!!!", "pics": null, "resp": null, "gmap_id": "0x456608893ea6fe0f:0x88a25ff25631529f"}
{"user_id": "106738842902275680728", "name": "Rhonda Rossman", "time": 1624981479384, "rating": 5.0, "text": "Rossman construction is very consciousness, affordable and work quality is excellent. I have hired them for several projects. Tin roof, replace and install new window, replace subfloor and put in new floor, ran all new water lines, and installed kitchen cabinets. I am very pleased with the work.", "pics": null, "resp": null, "gmap_id": "0x456608893ea6fe0f:0x88a25ff25631529f"}
{"user_id": "106496021995310062817", "name": "Lisa H", "time": 1625753841064, "rating": 5.0, "text": "Highly recommend.\nGreat customer service\nEveryone we worked with was friendly and helpful.\nWonderful team came out to install countertops.", "pics": null, "resp": null, "gmap_id": "0x888861598b0b3051:0x70025f43157f0727"}
{"user_id": "104619934248219199175", "name": "Morgan Posey", "time": 1621259577686, "rating": 5.0, "text": "Hannah was great from the beginning helping us pick out everything and Becky came and measured and installation went great! Then our new house flooded 😩 the whole team was amazing through that experience. They came out that same day and uninstalled all the counter tops in the rooms that were affected so that the cabinets and flooring could be removed and were so quick to get us back on the schedule for reinstall once everything was fixed. Becky is the best and has been SUPER helpful the entire time! You can’t beat the quality or service with them. Hands down will use them again with any granite needs we have in the future! We LOVE all of our countertops and sinks!", "pics": null, "resp": null, "gmap_id": "0x888861598b0b3051:0x70025f43157f0727"}
{"user_id": "104210911505116057995", "name": "Deborah Knotts", "time": 1616109864722, "rating": 5.0, "text": "The owner and employees at Sherer Granite go out of their way to make you happy!  First, we  had a personal visit to our home to help us make all the right decisions and to measure everything and were given assistance with color schemes. They had a great selection of granite and the prices are great! In the end the owner personally called to make sure we were satisfied I especially liked that.  For us, in the future there is no other granite store other than Granite South!", "pics": null, "resp": null, "gmap_id": "0x888861598b0b3051:0x70025f43157f0727"}
{"user_id": "117407136624951576912", "name": "Chris Meacham", "time": 1616933989711, "rating": 5.0, "text": "Great selection of stone and awesome staff! Already have the granite picked out for our new build and couldn't be happier!", "pics": null, "resp": null, "gmap_id": "0x888861598b0b3051:0x70025f43157f0727"}
{"user_id": "117635107332841209912", "name": "Emily Thompson", "time": 1584477873997, "rating": 5.0, "text": "I spoke with Brad and he was very personable and friendly. I had several questions about how to care for\nmy granite countertops and he listened to each one attentively and answered them with great detail. I felt like he and his company truly cared about me and helping educate me. When I asked about using a sealer, he even sent me a free sample in the mail! Great customer service.", "pics": null, "resp": null, "gmap_id": "0x888861598b0b3051:0x70025f43157f0727"}
{"user_id": "106277927258984931456", "name": "Shelly Russell", "time": 1602725962385, "rating": 5.0, "text": "Granite South did an amazing job on my granite countertops. The staff was very friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x888861598b0b3051:0x70025f43157f0727"}
{"user_id": "115718803934419541052", "name": "Amanda Darty", "time": 1542821633006, "rating": 5.0, "text": "Love my new kitchen!  The icing on the cake are my gorgeous calacatta gold marble tops!  The granite south team met all of my expectations and made the process of selecting and designing easy and did a great job with their craftsmanship.  I did my homework and they were the best and beat pricing by their competitors.  I highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x888861598b0b3051:0x70025f43157f0727"}
{"user_id": "111795115396542028424", "name": "Linda Clark", "time": 1584750036634, "rating": 5.0, "text": "Thank you Becki for making my dream kitchen a reality !!!! Your team at Granite South did an awesome job from decision making to installation !!!! I love everything 🤩🤩", "pics": null, "resp": null, "gmap_id": "0x888861598b0b3051:0x70025f43157f0727"}
{"user_id": "113523378218355801251", "name": "Sabrina Rabl Tidwell (Bree)", "time": 1525960931391, "rating": 5.0, "text": "Great workers, excellent quality!", "pics": null, "resp": {"time": 1534079373121, "text": "Thank you, Sabrina!! Would love to see pictures of the completed project!!!"}, "gmap_id": "0x888861598b0b3051:0x70025f43157f0727"}
{"user_id": "105128889275139554445", "name": "Bobby Leib", "time": 1559584711265, "rating": 5.0, "text": "Nice place !!!", "pics": null, "resp": null, "gmap_id": "0x888861598b0b3051:0x70025f43157f0727"}
{"user_id": "106611584232540896936", "name": "Johnnie Simpson", "time": 1510888374234, "rating": 5.0, "text": "I needed an estimate for my insurance and it just took a few minutes.", "pics": null, "resp": null, "gmap_id": "0x888860d0b7fa61bf:0xec07fa03bb7ff572"}
{"user_id": "106389149950110123301", "name": "Abigail Hipps", "time": 1552245964307, "rating": 5.0, "text": "Genesis renovations did our master bathroom (new tile shower, new flooring) and we are so happy we chose them. Brandon was our point of contact, and he communicated well throughout the whole process. Because of an unforeseen electrical issue, our project took longer than expected, but we were contacted and updated every step of the way. I recommend them to everyone, and I will give them a call for my next project!", "pics": null, "resp": null, "gmap_id": "0x888c29ff75e16a71:0x1c30fc13decb1e64"}
{"user_id": "118397916783655134335", "name": "Ann Titus", "time": 1552316131036, "rating": 5.0, "text": "I want to give a big Shout Out! And Thank You! To Brandon Granger and John with Genesis Renovations for my beautiful bathroom!  They have been very easy to work with, show up when they say, communicate well and often and were spot on with their estimate!  Brandon and John are meticulous with their work as are their sub-contractors: Charlie the plumber and the tile guy.  From start to finish it only took a week!  Also want to thank Charlene Rumsey with Henry Tile for her patience and help in choosing the perfect tile. So if you need anything done at your house I would definitely recommend Genesis Renovations!", "pics": null, "resp": null, "gmap_id": "0x888c29ff75e16a71:0x1c30fc13decb1e64"}
{"user_id": "117003323893104845233", "name": "Waylazy", "time": 1504374345132, "rating": 5.0, "text": "An Excellent and professional group of people to work with. Great quality of workmanship. GENESIS RENOVATIONS are now our go to people.", "pics": null, "resp": null, "gmap_id": "0x888c29ff75e16a71:0x1c30fc13decb1e64"}
{"user_id": "106053853041180689939", "name": "Carlos Puig-Garcia", "time": 1518023232175, "rating": 1.0, "text": "Brandon came out to my house on Feb 2nd to give me a quote to repair a leaky window. He quoted me $50 which I thought was a great price. We agreed for the work to be done the following Tuesday on the 6th. Tuesday comes and no one shows up and no phone calls. I called repeatedly and never received an answer or return call.  I will be happy to change this review upon a suitable explanation but the lack of professionalism is disappointing as he did not come across that way at all.", "pics": null, "resp": {"time": 1547140267469, "text": "Mr. Puig-Garcia, we do apologize for this. We just became aware of this review recently and wanted to respond. This is certainly and unacceptable occurance and not normal for our business. While we aren't sure what was happening at that time, we do apologize. If you would, please give us a call and let us know what we can do to make this right. Thank you."}, "gmap_id": "0x888c29ff75e16a71:0x1c30fc13decb1e64"}
{"user_id": "117692154588342055570", "name": "Patricia Woodson", "time": 1517595487843, "rating": 5.0, "text": "Blown Away! These guys came in totally professional, set up my sound system, optimized it, and explained far more about it than I could read in any manual. They looked at other equipment in my home as a courtesy and explained proper use for them. They were friendly and courteous and did not rush through the process", "pics": null, "resp": {"time": 1525465012333, "text": "Thank you so much Ms. Woodson.  I hope you are enjoying you audio setup."}, "gmap_id": "0x888928f3d8d785dd:0x294b6de75eb20cc6"}
{"user_id": "106629754635906571197", "name": "Kim Patton", "time": 1505433189986, "rating": 5.0, "text": "Twisted installed 3 TVs plus sound bars in our latest home and multiple in our last home.  They go for perfection so it's hard for us to go anywhere else!!!  They will be installing our security camera system next!  Highly recommend them to any and everyone!", "pics": null, "resp": null, "gmap_id": "0x888928f3d8d785dd:0x294b6de75eb20cc6"}
{"user_id": "112950088088265238377", "name": "John McRae", "time": 1513222819545, "rating": 5.0, "text": "Service was a class act. We had a home theater installation. Friendly, knowledgable and reasonable. Very easy to work with. Prompt service. I highly recommend.", "pics": null, "resp": {"time": 1525465246524, "text": "Thank you Mr. John. I hope you are enjoying your awesome system."}, "gmap_id": "0x888928f3d8d785dd:0x294b6de75eb20cc6"}
{"user_id": "108770984922258139206", "name": "Todd Sellers", "time": 1512070344515, "rating": 5.0, "text": "Twisted did an outstanding job hanging the TV and soundbar in our living room. They were very professional and they made sure to clean up before they left. I will definitely be bringing them back to help me hang my other TVs! Great job guys!!", "pics": null, "resp": null, "gmap_id": "0x888928f3d8d785dd:0x294b6de75eb20cc6"}
{"user_id": "104779891600785130401", "name": "Wanda Spillers", "time": 1513905861892, "rating": 5.0, "text": "Very prompt! I was prepared for a long wait and they got it right the very first time. Professional, these are the subject matter experts! I highly recommend them.\n\nDr. Wanda Spillers", "pics": null, "resp": null, "gmap_id": "0x888928f3d8d785dd:0x294b6de75eb20cc6"}
{"user_id": "101171593808885680625", "name": "jean-pierre don juan", "time": 1513647292533, "rating": 5.0, "text": "Outstanding customer service, with impeccable know how.Offering ideas and suggestions that I hadn't even thought of that were time and money saving. Great all around experience.", "pics": null, "resp": null, "gmap_id": "0x888928f3d8d785dd:0x294b6de75eb20cc6"}
{"user_id": "105922210816087403534", "name": "Derrick M", "time": 1513660325482, "rating": 5.0, "text": "Chad is very reliable and always makes sure his work is perfection.", "pics": null, "resp": null, "gmap_id": "0x888928f3d8d785dd:0x294b6de75eb20cc6"}
{"user_id": "108528994475731326245", "name": "MaryAnna Raburn", "time": 1511564803675, "rating": 5.0, "text": "Professional, very responsive, courteous, service oriented, communicative and a job well done.", "pics": null, "resp": null, "gmap_id": "0x888928f3d8d785dd:0x294b6de75eb20cc6"}
{"user_id": "105446915836074230889", "name": "johnny appleseed", "time": 1513646807226, "rating": 5.0, "text": "These folks who came out and did a very good job did not charge an excessive amount would use again", "pics": null, "resp": {"time": 1525465320262, "text": "Thank you for the great review."}, "gmap_id": "0x888928f3d8d785dd:0x294b6de75eb20cc6"}
{"user_id": "111273382746271711257", "name": "LONGS ENTERTAINMENT", "time": 1614469430928, "rating": 5.0, "text": "The Company came and did a amazing job.!!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x888928f3d8d785dd:0x294b6de75eb20cc6"}
{"user_id": "108607535358463526434", "name": "Damon Hall", "time": 1518636544651, "rating": 5.0, "text": "Great service", "pics": null, "resp": {"time": 1525464854489, "text": "Thank You Mr. Hall"}, "gmap_id": "0x888928f3d8d785dd:0x294b6de75eb20cc6"}
{"user_id": "106020493017435723477", "name": "Gary Gentile", "time": 1600217500957, "rating": 5.0, "text": "Excellent contractor. Honest and reasonable. Thorough and reliable. No job too small or too big. They live up to their name.", "pics": null, "resp": null, "gmap_id": "0x88891c6155555555:0xd4e7e30f837a0f86"}
{"user_id": "112868414536552222067", "name": "Sharon Camp", "time": 1550507994412, "rating": 1.0, "text": "The Business KNOWINGLY employs sex offender. Man employed who was convicted of 1st Degree Sexual Assault of a 13 yr old girl. I wouldn't want them near my house or property.", "pics": null, "resp": {"time": 1624287271123, "text": "This is a false statement. In reference to this man he was never an employee of Pro Construction, LLC and was actually a subcontractor and once Pro found out about the status of this subcontractor our relationship with this man was terminated. We do our best to screen our in house workers but don't do background checks on Subcontractors. Pro Construction, LLC values our 19 yr Accredited A+ Rating with the Better Business Bureau and our wonderful customers that we always strive to serve and protect to the best of our ability."}, "gmap_id": "0x88891c6155555555:0xd4e7e30f837a0f86"}
{"user_id": "105847880918958343776", "name": "Freeda Moore", "time": 1621510880720, "rating": 5.0, "text": "I truly had an amazing experience with my remodeling project! Mr Chris went above and beyond what was expected and brought me top notch service. From the moment I began the search for granite countertop installation I felt valued as a customer. My phone calls and texts were responded to promptly and installation was sooner than expected. Mr Chris even worked around an unforseen appt that I had to help my parents with. My son spilled sweet tea on the kitchen floor during the remodel and one of Mr Chris's men cleaned it up so they wouldn't track it through the house whilst working in my home! There were many small situations that cropped up during the remodel, such as old plumbing and two mirrors that had to be removed and then replaced which were done with no complaints. My new granite is truly a work of art in my eyes and I thank Mr Chris, Jon and all the crew for their professionalism and kindness. I have already referred them to friends and family.", "pics": null, "resp": null, "gmap_id": "0x889a0de5d33af533:0x4dafe1e9a78481a6"}
{"user_id": "107953202622173558515", "name": "Kirsten Warren", "time": 1622941661557, "rating": 1.0, "text": "Completed a service at least a year ago and invoiced for payment, still have not been paid. Bill was at least $4K.", "pics": null, "resp": {"time": 1623090206115, "text": "Kristen,  this is not the correct company.  This Kitchen Bath Floors and More, LLC started operations in Sept. of 2020.  I am sorry that this happened to you, but we would appreciate it if you would kindly take down your negative review, as we do not opperate in this manner.  You are more than welcome to check out our website at www.kbfmllc.com to verify. We wish you luck in your payment request."}, "gmap_id": "0x889a0de5d33af533:0x4dafe1e9a78481a6"}
{"user_id": "104764490327229596046", "name": "Dean Clinton", "time": 1582757550834, "rating": 5.0, "text": "These people are awesome!  They have come through for me and many of my referred friends repeatedly over the years. Owners Chuck & DeLayne Garrett truly care about the individuals and will work with you to create your dream remodel/update/repair. In my case my home was destroyed (twice), once by hurricane and once by flood. Chuck fixed us up, better than previous AND worked with our insurance company to come in ahead of schedule and under budget.", "pics": null, "resp": null, "gmap_id": "0x889a0de5d33af533:0x4dafe1e9a78481a6"}
{"user_id": "104186150279990562576", "name": "Jeff YEAGER", "time": 1619978401844, "rating": 1.0, "text": "They installed granite . 2 weeks after the date . They left my house trashed you could write in the dust on everything . They took my need shop vac . When I asked about it . They said I found it and we will return it . 1 month later still no shop vac . They sub there work to anybody . Beware !!!", "pics": null, "resp": {"time": 1620055981121, "text": "We are sorry you feel this way.  It took 2 weeks after the original date as we were waiting for  customer to choose new granite. Once chosen, we fabricated and installed immediately.  We did not use any sub contractors on your job.  We also offered a cleaning service which was declined.  We did however,  credit you $150.00 on your final invoice.  It has not yet been 1 month, our last communication  which was dated 4/20/21. We realized we had your shop vac which was identical to ours. We are 100 % willing to return to you, when you are back in town."}, "gmap_id": "0x889a0de5d33af533:0x4dafe1e9a78481a6"}
{"user_id": "103559231817698071485", "name": "Jan Van Westerop", "time": 1582228243612, "rating": 1.0, "text": "Don't waste your time walking through the door. This is a showroom not a flooring store. Apparently only operated by 1 person which doesn't have any installers to install her products. Her constant excuse was that the carpet has not arrived yet. I finally got her to admit that she had put the carpet on hold because she didn't have anybody to put it in. Honesty should always be the best policy. What a waste of time and energy.", "pics": null, "resp": null, "gmap_id": "0x889a0de5d33af533:0x4dafe1e9a78481a6"}
{"user_id": "102809644601796297946", "name": "Randall Mitchell", "time": 1585439753410, "rating": 5.0, "text": "Really professional and they’re your go to place for any of your remodeling needs they’re friendly and do a really good job", "pics": null, "resp": null, "gmap_id": "0x889a0de5d33af533:0x4dafe1e9a78481a6"}
{"user_id": "108522157918945648915", "name": "Sinda Reed", "time": 1552012833394, "rating": 5.0, "text": "This would be a great place to look for cabinet tops and more", "pics": null, "resp": null, "gmap_id": "0x889a0de5d33af533:0x4dafe1e9a78481a6"}
{"user_id": "105568490170226719519", "name": "Aunt Mimi", "time": 1524759617183, "rating": 5.0, "text": "Awesome deal on siding and windows!  Hap & Pete were great, and their crew did a wonerful job!  They also insulated my grandmothers house years ago!  I would recommend.", "pics": null, "resp": null, "gmap_id": "0x889a4e3448aa6c81:0xcc22dc6f0806813"}
{"user_id": "105471174307983097823", "name": "Rebecca Rolling", "time": 1559516862835, "rating": 5.0, "text": "(Translated by Google) Gr8 company y'all!\n\n(Original)\nGr8 company y'all!", "pics": null, "resp": null, "gmap_id": "0x888e9b6622c473b5:0x65c0a2dec6241c6f"}
{"user_id": "115424563232563492774", "name": "Tommie Hardy", "time": 1533570008429, "rating": 2.0, "text": "My experience with this company is good and bad. The crewmen are polite and helpful and they did very nice work on repairs, painting and carpentry work on my house. The owner of the company sometimes doesn’t take the time to call me as his customer and discuss the repairs and my concerns of how I want my house remodeled. The owners will not at times call or email back days or weeks sometimes. I had to wait almost two years before my house was completed. The roofers stole my circular saw and it wasn’t returned to me and I think the owners need to practice in better professional behavior towards future customers. I can’t at this time recommend this company to my colleagues, friends and family.", "pics": null, "resp": null, "gmap_id": "0x88890ed0eb88a5a7:0x41dd0a4d7eb0d05b"}
{"user_id": "101271052667406217488", "name": "Michele Cooper", "time": 1579796039304, "rating": 5.0, "text": "Great company! Got the job done fast and efficiently!", "pics": null, "resp": null, "gmap_id": "0x88890ed0eb88a5a7:0x41dd0a4d7eb0d05b"}
{"user_id": "108538939964592148062", "name": "Shawn Jones", "time": 1504103566051, "rating": 5.0, "text": "Great company!", "pics": null, "resp": null, "gmap_id": "0x88890ed0eb88a5a7:0x41dd0a4d7eb0d05b"}
{"user_id": "117285624028157126738", "name": "Evelyn Bates", "time": 1553695384753, "rating": 3.0, "text": "Everything I needed cheaper than a smaller chain and some really great deals", "pics": null, "resp": null, "gmap_id": "0x88626b69a7a7710b:0xe6af4a353bbf8246"}
{"user_id": "112822865322716350390", "name": "Bobbie King", "time": 1560358846413, "rating": 5.0, "text": "Always have what I need and always a pleasure!", "pics": null, "resp": null, "gmap_id": "0x88626b69a7a7710b:0xe6af4a353bbf8246"}
{"user_id": "105341569983816638981", "name": "Debra Vickers", "time": 1551350810997, "rating": 3.0, "text": "good service", "pics": null, "resp": null, "gmap_id": "0x88626b69a7a7710b:0xe6af4a353bbf8246"}
{"user_id": "105256378627230408426", "name": "Benny Manzanilla", "time": 1619792174955, "rating": 2.0, "text": "The service is terrible at the one on schillinger road can't find nothing can't find someone to assist you what you looking for", "pics": null, "resp": null, "gmap_id": "0x889bb241bc208893:0x4f57c7a95e8797a7"}
{"user_id": "111353726117834583616", "name": "Sonia S", "time": 1442415271222, "rating": 1.0, "text": "After spending thousands of dollars for countertops, carpet, backsplash, vinyl siding............they sold me a cracked kitchen sink........I had to return it............they gave me credit for the returned sink...........but forgot to charge me for the new sink that the crew had to bring from another store.  The manager Gail hounded me about coming in to have the $199 sink charged to my Home Depot account.  She even threatened to cancel the installation of my backsplash that was scheduled for the next day.  Needless to say........I did go in and pay for the sink.  Very unprofessional.............considering I have been a loyal customer for years.", "pics": null, "resp": null, "gmap_id": "0x889bb241bc208893:0x4f57c7a95e8797a7"}
{"user_id": "114277536852777010523", "name": "Wade Parnell", "time": 1572278587275, "rating": 4.0, "text": "Most helpful.", "pics": null, "resp": null, "gmap_id": "0x889bb241bc208893:0x4f57c7a95e8797a7"}
{"user_id": "106407380444858417754", "name": "mike piliponis", "time": 1538478500676, "rating": 5.0, "text": "Quick service", "pics": null, "resp": null, "gmap_id": "0x889bb241bc208893:0x4f57c7a95e8797a7"}
{"user_id": "115416932802029139977", "name": "Jordan Gregory", "time": 1617751316418, "rating": 5.0, "text": "This company is who I am recommending to anyone that's needs restoration work done. Not only was their work top notch, but the person who helped me, Mr. Miles was extremely friendly, very informative in explaining what all the work was going to entail, did not waste his or my time, and made the whole process an absolute ease from start to finish. If anyone is looking for any restoration work done, I urge them to choose this team first!", "pics": null, "resp": null, "gmap_id": "0x888cf34f1959d7ef:0x827d6f6a01ae9eaa"}
{"user_id": "106489104500357263682", "name": "Caroline MacCaughelty", "time": 1617749103275, "rating": 5.0, "text": "Restoration 1 was so wonderful! They helped with all of my water damage and molding issues caused by the terrible maintenance and property care at the Magnolia at Auburn apartments. They were so kind and professional and assured me they would take care of everything. I will absolutely call them again wherever I go in the future. They are amazing!!!", "pics": null, "resp": null, "gmap_id": "0x888cf34f1959d7ef:0x827d6f6a01ae9eaa"}
{"user_id": "111609127581068483005", "name": "Terry Manning", "time": 1624560031349, "rating": 5.0, "text": "We had a major pipe leak that led to significant damage to our walls and flooring.  Mike and his team were great. Mike is easy to work with and very responsive- I mean responsive with great customer service. His staff are great and even one morning asked if I wanted breakfast while he was at McDonald's.  Quality work as well.  Terry from GA", "pics": null, "resp": {"time": 1624568942361, "text": "Thanks so much Terry.  We are glad we were able to help."}, "gmap_id": "0x888cf34f1959d7ef:0x827d6f6a01ae9eaa"}
{"user_id": "104488414515488886307", "name": "Gene Miles", "time": 1617751757023, "rating": 5.0, "text": "Great group of people that do what they tell you will be done. Dependable and trustworthy.", "pics": null, "resp": null, "gmap_id": "0x888cf34f1959d7ef:0x827d6f6a01ae9eaa"}
{"user_id": "116419627504410180007", "name": "Chip Winslett", "time": 1617670796503, "rating": 1.0, "text": "I called this company on Saturday 4-3-21 for a water heater that I had flood my home. They not only did not answer the phone, They also did not call me back and I had to hire someone else to come and correct the problem. You should always have someone to answer the phone if you are a company that provides 24/7 emergency services. I waited over 2 hours for a return call and finally gave up!", "pics": null, "resp": {"time": 1617677183457, "text": "Mr. Winslett - All our calls are recorded.  We have no record of you calling our company.   We answer all our calls. I personally answer all our calls.   So I believe you have the wrong company.  I will be glad to discuss.  Please call me at 334-203-2987."}, "gmap_id": "0x888cf34f1959d7ef:0x827d6f6a01ae9eaa"}
{"user_id": "100332110310633009229", "name": "Bron Rogers", "time": 1597717590843, "rating": 5.0, "text": "Jeremy and Chris did a great job. Jerry Waller made sure I was informed every step of the way. They were mindful of the quality of work to be done as well as the cost. Jeremy was patient with me answering all my questions. Integrity, patience, and a good work ethic. I recommend this team for restoration work. My water damage and mold were taken care of with minimal inconvenience to me.", "pics": null, "resp": {"time": 1598453599630, "text": "Thanks for the review Mrs. Rodgers.  Appreciate the comments about the crew that did the work.   We strive to 100% satisfy our customers and it all starts with the guys  doing the work."}, "gmap_id": "0x888cf34f1959d7ef:0x827d6f6a01ae9eaa"}
{"user_id": "117840271378074394263", "name": "Benjamin Miles", "time": 1607984093563, "rating": 5.0, "text": "Fantastic customer service. The team had great information, and showed up exactly when they said they would. I will use Restoration 1 again.", "pics": null, "resp": null, "gmap_id": "0x888cf34f1959d7ef:0x827d6f6a01ae9eaa"}
{"user_id": "114550776511393173545", "name": "Kim Niedzwiecki", "time": 1605127712146, "rating": 5.0, "text": "Mike and Jeremy were excellent to work with.  They were quick to respond, arrived on time and exceeded my expectations.  They were patient with me as my damage was due to another insured's water leak.  I wish I would have called their  1-800 number first/right away as they are truly a local Auburn/Opelika business and it would have saved me hours of waiting for other businesses to return my call.", "pics": null, "resp": null, "gmap_id": "0x888cf34f1959d7ef:0x827d6f6a01ae9eaa"}
{"user_id": "118404008254954022353", "name": "Corey Grant", "time": 1596166605622, "rating": 5.0, "text": "Great Company! Very Professional and did a great job. Give them a call for all your restoration needs.", "pics": null, "resp": {"time": 1596197539057, "text": "Thanks Cory.  Appreciate the review.  Looking forward to working with you in the future."}, "gmap_id": "0x888cf34f1959d7ef:0x827d6f6a01ae9eaa"}
{"user_id": "115152856454630414024", "name": "Daniel Negron", "time": 1590104408103, "rating": 5.0, "text": "These guys were great! Very knowledgeable and available when we needed them! Friendly staff, would definitely recommend.", "pics": null, "resp": null, "gmap_id": "0x888cf34f1959d7ef:0x827d6f6a01ae9eaa"}
{"user_id": "115881229044671919821", "name": "Jason Elrod", "time": 1575313760339, "rating": 5.0, "text": "Restoration 1 of East Alabama did a great job. They had a fast response and did everything they said they would do. Mike and his guys work hard and quick. I would highly recommend them should you need their services.", "pics": null, "resp": null, "gmap_id": "0x888cf34f1959d7ef:0x827d6f6a01ae9eaa"}
{"user_id": "115556325893772875142", "name": "Faith Spratling", "time": 1567701297263, "rating": 5.0, "text": "Mike and his crew were very professional and communicated daily about the services and work we needed to get the house back in order. I recommend him to anyone who has trust issues with contractors. He was honest and made us feel comfortable in what he was hired to do.", "pics": null, "resp": {"time": 1567726159257, "text": "Thank Faith.  It was great to work with you guys."}, "gmap_id": "0x888cf34f1959d7ef:0x827d6f6a01ae9eaa"}
{"user_id": "116708638526333104745", "name": "angie morton", "time": 1583527212132, "rating": 5.0, "text": "Great Guys to work with! Wouldn’t hesitate to call them again! Went above and beyond!!", "pics": null, "resp": {"time": 1583553583822, "text": "Thanks for the review."}, "gmap_id": "0x888cf34f1959d7ef:0x827d6f6a01ae9eaa"}
{"user_id": "114854350416080155611", "name": "Pam Coburn", "time": 1585334430404, "rating": 5.0, "text": "Restoration 1 and Mike are awesome! The day I called Mike he scheduled and has been here through the process. Can’t say enough about the service and care received. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888cf34f1959d7ef:0x827d6f6a01ae9eaa"}
{"user_id": "107397307853565754542", "name": "Mayra Rivera", "time": 1570485261470, "rating": 5.0, "text": "Thanks for mike and his great team for saving my home. As a first time homeowner he walked me through the claims process. He ensured that I was a taken care of and that my home is saved from mold and mildew Very trustworthy.", "pics": null, "resp": {"time": 1573580558015, "text": "Thanks Mayra.   It was a pleasure to be able to work with you."}, "gmap_id": "0x888cf34f1959d7ef:0x827d6f6a01ae9eaa"}
{"user_id": "109325326880070035320", "name": "Dana Esposito", "time": 1573574020535, "rating": 5.0, "text": "Amazing response time Amazing efforts to assist with our water damage. Mike made it so easy to deal with our insurance company. It was comforting to know that my mitigation was handled by such a professional. I fully recommend Mike and his team. If you have unfortunate situation to have to deal with water damage, you want Mike on your team!", "pics": null, "resp": {"time": 1573580477754, "text": "Thanks Dana.  Appreciate you choosing us to help get your home back in order."}, "gmap_id": "0x888cf34f1959d7ef:0x827d6f6a01ae9eaa"}
{"user_id": "104029366724889551776", "name": "T TIDWELL", "time": 1575060469402, "rating": 5.0, "text": "I had a disaster and needed help quickly. I notified them and they were here fast and very efficient. Highly recommend this company.", "pics": null, "resp": null, "gmap_id": "0x888cf34f1959d7ef:0x827d6f6a01ae9eaa"}
{"user_id": "112149728538240370245", "name": "Susie Robinson", "time": 1568564010062, "rating": 5.0, "text": "Very efficient and thorough! Really made us feel like our situation was top priority. We couldn’t have asked for better service or a better group of guys. We will be spreading the word about them.", "pics": null, "resp": null, "gmap_id": "0x888cf34f1959d7ef:0x827d6f6a01ae9eaa"}
{"user_id": "112030086955117432829", "name": "n10sity", "time": 1593724623458, "rating": 5.0, "text": "Quick, helpful and friendly these guys know what doing.", "pics": null, "resp": null, "gmap_id": "0x888cf34f1959d7ef:0x827d6f6a01ae9eaa"}
{"user_id": "108086346304588575108", "name": "Tom Harper", "time": 1564353325040, "rating": 5.0, "text": "I called Restoration 1of East Alabama to resolve a mold problem in the crawl space under my home.\nI was happy I did. They responded very timely and proved to be both professional and proficient.Nice knowledgeable guys who take on challenging jobs. Mine had to have been one of them. I was impressed how quickly they managed to take care of my problem and also amazed at the results. I will not only call them again if I should need their assistance I would also recommend them to anyone who does.", "pics": null, "resp": {"time": 1564354096432, "text": "Thanks to much Tom.  For the kind words.  Enjoyed working with you at your home."}, "gmap_id": "0x888cf34f1959d7ef:0x827d6f6a01ae9eaa"}
{"user_id": "107925668079237587951", "name": "Elizabeth Estes", "time": 1561081532365, "rating": 5.0, "text": "My son is a student at Auburn University and called at 4:50pm on a Friday saying the upstairs toilet had busted and the garage roof had fallen in. Taking a deep calming breath I literally googled and called Restoration sent the number to my kid and he was there before 6pm. He started cleaning we meet him there the next day and by Monday it was dried out. I would recommend this group for water damage anytime. Very professional very good service and very nice. They listened.", "pics": null, "resp": null, "gmap_id": "0x888cf34f1959d7ef:0x827d6f6a01ae9eaa"}
{"user_id": "111299947641546155182", "name": "John Willingham", "time": 1567955817958, "rating": 5.0, "text": "Restoration1 did an excellent job cleaning up for an upstairs kitchen leak into my downstairs condo. Thanks for such a prompt response", "pics": null, "resp": null, "gmap_id": "0x888cf34f1959d7ef:0x827d6f6a01ae9eaa"}
{"user_id": "113038689979159695823", "name": "Samantha White", "time": 1553029011116, "rating": 5.0, "text": "We had water damage due to our hot water heater. Mike and Jeremy quickly got to it on Saturday morning. I remember Mike saying wished they were here sooner. But they did a great job. With in a week and few days it was dry. The floors are still good. Now just to get it all back together.  Thanks again Mike and Jeremy.         Samantha.", "pics": null, "resp": {"time": 1553035749060, "text": "Thanks Mrs. White.  It was a pleasure working with you guys."}, "gmap_id": "0x888cf34f1959d7ef:0x827d6f6a01ae9eaa"}
{"user_id": "104067625677004800477", "name": "dungeon master", "time": 1617392138876, "rating": 1.0, "text": "Very poor company", "pics": null, "resp": {"time": 1617388043849, "text": "***BOGUS REVIEW ALERT **** This review was posted by a part time non W2 worker who we no longer use. Mr. Kidder is the live in cousin of Jeremy Waller who also posted a bogus review."}, "gmap_id": "0x888cf34f1959d7ef:0x827d6f6a01ae9eaa"}
{"user_id": "105226524570501027889", "name": "marcus sims", "time": 1538156019674, "rating": 5.0, "text": "I recently received service from Restoration 1 and was very pleased with the end results. Repair details and information was given to me in a professional and timely manner. I have no complaints and highly recommend services from them if needed! Great work!!", "pics": null, "resp": null, "gmap_id": "0x888cf34f1959d7ef:0x827d6f6a01ae9eaa"}
{"user_id": "113368326569404076764", "name": "John Tures", "time": 1536597524036, "rating": 5.0, "text": "I can't say enough good things about Restoration 1 of East Alabama.  The owner and his handyman were great to work with.  They didn't break our bank, and they did not provide cut-rate service.  Our house is much better now, whereas it was collapsing due to the mold damage.  The fact that the house floor is now secure, and the new kitchen floor tile (a little more, but very much worth it) makes the place better than it was 2 months ago, earning that top review.", "pics": null, "resp": null, "gmap_id": "0x888cf34f1959d7ef:0x827d6f6a01ae9eaa"}
{"user_id": "100366849160967561572", "name": "George Johnson", "time": 1560454434936, "rating": 5.0, "text": "Restoration 1 was amazing at getting the job done they came out late and immediately took care of the problem call them for all you restoration needs.\nGreat guy!", "pics": null, "resp": null, "gmap_id": "0x888cf34f1959d7ef:0x827d6f6a01ae9eaa"}
{"user_id": "113199865178271934832", "name": "John Tongret", "time": 1548373076210, "rating": 5.0, "text": "We had a moisture problem and all the mold that would go with it. Mike at Restoration 1 immediately visited with us and came up with a plan to remove the mold  and effected areas. I am happy to call this a 5-Star experience. You should have NO reservations working with Mike. You wont be disappointed.", "pics": null, "resp": null, "gmap_id": "0x888cf34f1959d7ef:0x827d6f6a01ae9eaa"}
{"user_id": "108321887085127189205", "name": "Joseph Alexander", "time": 1541087280383, "rating": 5.0, "text": "We had a water damage issue due to a leaky drain pan on our AC unit in the attic.  Mike and his team were able to come right away late on a Saturday night and get us set up to get everything dried up.\n\nVery happy with the service and the team was very professional and knowledgeable.\n\nHopefully I won't have to, but will definitely give them a call if something like this happens again.", "pics": null, "resp": null, "gmap_id": "0x888cf34f1959d7ef:0x827d6f6a01ae9eaa"}
{"user_id": "111676180440657571144", "name": "Mary Ann Ortiz", "time": 1551379154497, "rating": 5.0, "text": "Extremely pleased with the work Mike and Jeremy have done. They responded and were at my home in less than an hour, started the necessary work and got it all done in a timely manner. My home is back to normal thanks to Restoration 1 of East Alabama.", "pics": null, "resp": null, "gmap_id": "0x888cf34f1959d7ef:0x827d6f6a01ae9eaa"}
{"user_id": "107725160373187055260", "name": "J's ammo", "time": 1617392250105, "rating": 1.0, "text": "Poor company", "pics": null, "resp": {"time": 1617387590358, "text": "***BOGUS REVIEW ALERT **** This review was posted by an  W2 employee who was terminated. This post is a small example of why Mr. Jeremy Waller(aka Wayne Sanchez) is no longer with our company and will not be going to our customers’ homes."}, "gmap_id": "0x888cf34f1959d7ef:0x827d6f6a01ae9eaa"}
{"user_id": "103421830126983577765", "name": "Ariana Butler", "time": 1555175936046, "rating": 5.0, "text": "Mike was very responsive in giving us an estimate and completing the job within a time constraint. His pricing was competitive and our crawl space is completely free of mold or odors.", "pics": null, "resp": {"time": 1555178051883, "text": "Thanks for choosing Restoration 1 ofEast Alabama.   Good luck on your closing  and you new home in South Carolina."}, "gmap_id": "0x888cf34f1959d7ef:0x827d6f6a01ae9eaa"}
{"user_id": "101374912185895240708", "name": "brett rupert", "time": 1564159385887, "rating": 5.0, "text": "Outstanding service will use them again if I have anymore problems.", "pics": null, "resp": null, "gmap_id": "0x888cf34f1959d7ef:0x827d6f6a01ae9eaa"}
{"user_id": "101017338598883415376", "name": "Gina Terry", "time": 1550705451030, "rating": 5.0, "text": "Darryl and his team are true professionals! Darryl has the vision and communication skills needed to fully understand what you are looking for as a finished product. He has a great deal of experience and knowledge to bring to the project. He communicates well and is on the job when he says he will be there. The project he completed for us was beautifully crafted with great attention to detail. He is trust worthy, honest, reliable and a true gentleman.", "pics": null, "resp": null, "gmap_id": "0x886213462e53a2b7:0xfd4d464040e6ba67"}
{"user_id": "115340335697606744399", "name": "L Terry", "time": 1550628939286, "rating": 5.0, "text": "I have worked with them on two construction projects: an addtion to our home and a new house build. We were very pleased with both projects.  The owner, Darryl, was very easy to work with and the projects were completed as agreed upon.  Darryl is an honest and experienced professional. I have also seen other jobs that he has done and they were all excellent.", "pics": null, "resp": null, "gmap_id": "0x886213462e53a2b7:0xfd4d464040e6ba67"}
{"user_id": "106152146475897106094", "name": "William Walski", "time": 1623882116185, "rating": 5.0, "text": "Excellent experience with Lisenby Construction.  Great work at a reasonable price.  Kept us informed throughout the entire process of remodeling a bathroom and painting 3 additional rooms.  Would definitely recommend this company.", "pics": null, "resp": {"time": 1623883202636, "text": "Thank you sir! We hope to be of service in the future."}, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "118074576770209133235", "name": "Rick Harris", "time": 1611436058364, "rating": 5.0, "text": "Lisenby Construction just finished a three-week remodel of our kitchen and living room, and we could not be more pleased.  The project involved demo of some existing kitchen cabinets, replacement of a cook top and stove with a range, replacement of a vent hood, installing new kitchen lighting, laying tile, painting cabinets and bookshelves, painting trim, and painting walls.  All of this was handled by David's crew without having to sub out any work. The quality of the work done was really top-tier.  We used David's decorating consultant, Lindy, to help pick out colors, and the result has significantly brightened and beautified the two rooms where we spend most of our waking hours.\n\nWhen you undertake a project that takes this much time, you quickly realize that you have invited some strangers into your home for a lengthy stay.   Well, the guys David sent did not stay strangers for very long.  They were cheerful, friendly, and helpful to us.  They added, without cost, some features to the project at our request, even though these features were not in the original contract-- for example, installing a dimmer switch in the kitchen, replacing flood lights in our dinette area so they would match the color put out by our new kitchen lighting, cutting out the trim along one wall of our living room so our bookcase could lay flat against the wall, and installing wall outlets in our bookcase.  They cleaned up after themselves every day and hauled away their own trash.  When they moved furniture around to do some painting, they always put it back where it had been.  It got to where we enjoyed having the company at our house.  At the end of the job, we were glad it was completed, but we were sorry to see the guys leave.\n\nAll the work was done with great attention to detail.  They found and installed tile to match our existing kitchen backsplash tile.  They worked on our project every weekday for three weeks.  On some days, they worked on our cabinet doors and bookcase at their shop, but on the days when they did not come, David always called us to let us know they would not be there and what they would be doing that day.\n\nWe will certainly call on Lisenby Construction if we undertake new remodeling projects.  Highly recommended!", "pics": null, "resp": {"time": 1611446113000, "text": "Thank you Rick for your kind words and for trusting us with your home remodeling needs!"}, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "110433211010891134289", "name": "Susan Schneider", "time": 1576534959189, "rating": 5.0, "text": "The end product exceeded our expectations. The quality of the craftsmanship was excellent. The Lisenby team was courteous, professional and provided excellent quality work. I would recommend them to anyone anticipating a home upgrading.", "pics": null, "resp": {"time": 1576590824814, "text": "Thank you Susan! We enjoyed working with you guys! Your new Kitchen is beautiful!"}, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "106901412222143011814", "name": "Caitlin Singletary", "time": 1547866693291, "rating": 5.0, "text": "This was our first remodel, and it could not have gone smoother! The team was easy to talk to, and they were easy to reach when we had questions. They kept us up-to-date on expectations and the timing of everything. The remodel took 4 days (from demo to completion). The team arrived early each day, and they even worked holidays. They cleaned up daily (vacuumed and cleaned stainless steel appliances). We were also impressed when working with a company they contracted with. While the other company was doing their part, the Lisenby team was present, and they made sure the job was done right/well. In fact, at one point, the Lisenby team told the other team to fix something before leaving. Overall, we were highly impressed, and we intend to work with Lisenby again in the near future when we do additional remodeling!", "pics": null, "resp": {"time": 1547912032578, "text": "Thank you for letting us work on your kitchen Caitlin, we will look forward to working with you again! And thank you referring to us as a team, we work hard on developing a team culture here."}, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "108460659560847510072", "name": "Julie Freeman", "time": 1607009607857, "rating": 5.0, "text": "We have used Lisenby construction on numerous projects over the years. Each has been designed and completed with care and pride. We love our home and the renovation they provided. In fact, we are planning to work with David and his crew again on another project we hope will begin soon. It is so nice to have someone so dependable, competent, and professional.", "pics": null, "resp": {"time": 1611446438115, "text": "Thank you for allowing us to be of service over the years. We look forward to your next project! Having repeat customers like you, has been the key to our success!"}, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "104221357618915476706", "name": "Patricia Griffin", "time": 1597965337502, "rating": 3.0, "text": "I called to have the glass replaced in my back door and found out that they do not do this type of work.", "pics": null, "resp": {"time": 1597976733334, "text": "Sorry we don't offer the type of service that you needed."}, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "109767279964229292034", "name": "Mitch Robinson", "time": 1523928664508, "rating": 5.0, "text": "We are very pleased with Lisenby Construction. They were very knowledgeable, detail oriented, and responsive to feedback. Our kitchen, and master bath was transformed into pure beauty. All we can say is thank you very much!!", "pics": null, "resp": {"time": 1523968378934, "text": "Thank you Mitch! It was certainly our pleasure!"}, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "105244001319415628811", "name": "Janie Marsh", "time": 1445368428576, "rating": 5.0, "text": "I was very impressed with the quality of the work Lisenby Construction did. Our porch extension matches perfectly with the original structure. The workers were all very nice and they constantly maintained a clean work area. We are extremely pleased with how our project turned out.", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "101751032293932920764", "name": "Brett Kenny", "time": 1417025014974, "rating": 5.0, "text": "Lisenby Construction build our house, they did such a good job completely exceeding our expectations. We would recommend them to anyone looking for a home improvement or a new home. They are great!", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "114685191949913046461", "name": "Clayton Clark", "time": 1413991311594, "rating": 5.0, "text": "I recently got my kitchen done by Lisenby construction and was very satisfied with the work they did. I found them online by chance and was pleased that they did a good job. Thumbs up!", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "103331390083931195091", "name": "Denise Ortiz", "time": 1410976178340, "rating": 5.0, "text": "I really appreciate the way the team helped us set up subcontractors such as hvac, electric, and plumbing. We also had to change the design of our house and they were able to provide us with different options to be able to address the issue. It was nice to have choices.", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "117351359317494909099", "name": "Gwen Allen-Smith", "time": 1553969395494, "rating": 5.0, "text": "Really good people and high quality work.", "pics": null, "resp": {"time": 1611446605639, "text": "It was such a pleasure to work with you on your kitchen remodeling project! It was a joy and pleasure being around your positive and high energy personality!"}, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "109455369958148239127", "name": "Luke Mayben", "time": 1524075502032, "rating": 5.0, "text": "Mr. Lisenby did what he said he was going to do... at the price he quoted...in the time frame he said it would take. He was one of the most professional people I found while trying to get our kitchen remodeled.", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "103972756467998183116", "name": "Jessyca Henderson", "time": 1458675615885, "rating": 5.0, "text": "I cannot say enough good things about Lisenby. I would rate them 10/10 for every category that there is. They have have completed three different projects for me!", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "115490137556493774754", "name": "Mike J", "time": 1428024308886, "rating": 5.0, "text": "They did such a great job in all areas that they helped us in our house. Everything was completed in a timely manner and we loved the end results.", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "107258695112207669916", "name": "Harry Vaughn", "time": 1395949441247, "rating": 5.0, "text": "Working with Lisenby Construction was great. They did an excellent job. The employees that completed the project were efficient and friendly.", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "102522546700711773422", "name": "Chelsea Harris", "time": 1407942733597, "rating": 5.0, "text": "Lisenby Construction built our house. They worked with us one on one to discuss the design of the house and how many bedrooms we were going to add. Originally we wanted only 2 but they talked us into 3 for resale value.", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "104982619671247673526", "name": "Glenn Cole", "time": 1403202273275, "rating": 5.0, "text": "Lisenby Constructoin worked diligently to get the project done. We were very impressed by the finishing look and we would definitely hire them again.", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "108948886232224973779", "name": "Keith Raby", "time": 1425906919139, "rating": 5.0, "text": "We found Lisenby Construction from searching around online. We were so pleased with the work they did and would use them again if we decide to do another project.", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "109669312587129241675", "name": "Parker Bryars", "time": 1435328057399, "rating": 5.0, "text": "Lisenby updated our kitchen and did excellent work. We were more than pleased with their professional service.", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "110050521955619089407", "name": "McMullen HOA", "time": 1394304009721, "rating": 5.0, "text": "David Lisenby Delivers. Honesty and quality in every aspect of his work and relationships.", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "109360253925259825435", "name": "David Brownstein", "time": 1417456440188, "rating": 5.0, "text": "Lisenby did work for us on our kitchen, it was more than we could have asked for. It included everything we wanted and we were beyond happy with the result.", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "112591465024524214591", "name": "Rudy Sparks", "time": 1438093451185, "rating": 5.0, "text": "David was great about responding to any issues. If I called saying there might have been one, he was always there to check on it.", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "100088273833441436015", "name": "Seth Hansen", "time": 1400782151385, "rating": 5.0, "text": "Lisenby Construction always does a great job for us. They always exceed our expectations.", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "110977646911590374298", "name": "Byron Machen", "time": 1443189713532, "rating": 5.0, "text": "I was very impressed with the quality of the work.  Our porch extension matches perfectly with the original structure.  The workers were all very nice and they constantly maintained a clean work area.  We are extremely pleased with how our project turned out.", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "106110588058575609080", "name": "Al Yates", "time": 1434996305276, "rating": 5.0, "text": "Excellent, professional, and courteous service with attention to detail!", "pics": null, "resp": null, "gmap_id": "0x888e81c2edc4702f:0xce610313175df7bd"}
{"user_id": "112022007991916633597", "name": "Michelle Jones", "time": 1622594978257, "rating": 5.0, "text": "Schmidt Home Services was awesome to work with. Very responsive and great communication! We will definitely call them again in the future.", "pics": null, "resp": {"time": 1622597008058, "text": "Thank you.. we try our best to stay in touch with all out clients as much as possible.  I'm happy we where able to help you out. We look forward to working with you in the future."}, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "113373559091292995801", "name": "Annette Hardin", "time": 1614471657726, "rating": 5.0, "text": "Polite, on-time. Excellent work. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "110242958326644666701", "name": "Yingying Li", "time": 1614048480930, "rating": 5.0, "text": "very professional and helpful!", "pics": null, "resp": {"time": 1614051654942, "text": "Thank you 😊.. I'm glad we where able to figure out that headboard for you even though we where missing items for the assembly, Gotta love IKEA!😄"}, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "104119765343787468314", "name": "The Diva Mrs. Ash", "time": 1619216946665, "rating": 5.0, "text": "The gentlemen at Schmidt's were very professional, prompt, & informative. They installed a lock on my shed which was a complicated process. They were very diligent and kept me informed along the way.  I will definitely recommended their services to everyone & I will be using their services again!!", "pics": null, "resp": {"time": 1619217276326, "text": "Thank you very much. We are happy to help and are glad we where able to get your lock figure out."}, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "103209938140064926820", "name": "Peter M. Babnis", "time": 1622342120705, "rating": 5.0, "text": "Josh and Zack were awesome to work with. Easy to get in touch with, quick scheduling, and work was done to complete satisfaction. We’re new to Birmingham and are happy to have found Schmidt’s home services. I’d 100% recommend giving them a call and letting earn your business. We’ll definitely be working with them again on some larger projects.\n\nThanks guys!", "pics": null, "resp": {"time": 1622383806643, "text": "I'm glad we where able to be of assistance.  We pride ourselves on our customer satisfaction.  We look forward to working with you again in the future.  Welcome to birmingham We hope you like it here."}, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "114209927779929763129", "name": "Tennille Carter", "time": 1600910557720, "rating": 5.0, "text": "Joshua did an excellent job.  Very professional and reliable.  I live in another state so it was great to find a company I could trust to work on my rental property.", "pics": null, "resp": {"time": 1600906856722, "text": "Thank you for choosing Schmidt's Home Services.  The deck turned out great and look brand new. I look forward to any future projects you may have.  Call anytime and have a great day!\nJoshua Schmidt"}, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "113226486399779629131", "name": "E F", "time": 1615404106941, "rating": 5.0, "text": "Josh and everyone at Schmidts Home Services are really fast and professional. I called same day needing a door frame repaired and blinds hung and Zach came out got the job done that very day. This was very last minute and everyone was professional and thorough.\nThank you again, great service to use I highly recommend them!!!", "pics": null, "resp": {"time": 1616029727301, "text": "Thank you..I'm glad we where able to help you out with this project. Spread the word to family and friends that schmidt's Home Services can help with all your household needs."}, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "115378204361100570200", "name": "J Lewellyn", "time": 1625072028645, "rating": 5.0, "text": "Schmidt’s has been very easy to work with. They worked my job into their schedule quickly. As they would complete one job, I would ask if they could do another, and they got those done, too! I highly recommend!", "pics": null, "resp": {"time": 1625073276532, "text": "We were very happy to help. I'm glad everything turned out great.  If you need any help with any future projects feel free to contact us anytime. Thank you for your business."}, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "113595141646851026830", "name": "james walker", "time": 1488741580385, "rating": 5.0, "text": "My wife and I hired JWW to build a deck on our house. He gave us several options and recommended the one that would be most cost effective . It really looks nice and we'll built.  Definitely recommending JWW", "pics": null, "resp": null, "gmap_id": "0x888990ecc3d26ecf:0x927f4e408b87c3ca"}
{"user_id": "103948703976907653575", "name": "Angelina Rainwater", "time": 1617141175260, "rating": 5.0, "text": "Very knowledgeable, nice, patient. Been in business for many years. Honest as well.", "pics": null, "resp": null, "gmap_id": "0x88890748e1922989:0x12ae5f0110c8573c"}
{"user_id": "101684836222605112158", "name": "Valorita Salaam", "time": 1612811440381, "rating": 5.0, "text": "Initially i was concerned re: when my work would start and remarkably, the installers showed up on a Monday and completed the work on a Friday!!! The guys could not have been more professional and courteous:-) They were kept us in the loop every step of the way and we could not be happier. I will recommend MA Jackson to any and everyone.\n\nThank you so much!", "pics": null, "resp": null, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "110864049055723485562", "name": "Joseph Marshall", "time": 1603642286902, "rating": 5.0, "text": "Last year,  M.A Jackson rebuilt my Deck. The crew was knowledgeable,  professional,  and courteous. This year, they sealed and stained that deck. There were initial problems getting the right people out to do the job because of prior job commitments, but eventually things worked out.  Everyone from office personnel, to the boss, to the stain crew, went out of their way to get the job do and make me happy. I strongly recommend.\nJoseph Marshall\nOwens Cross Roads,  Al", "pics": null, "resp": null, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "109273763668612700949", "name": "James Brasfield", "time": 1603201473284, "rating": 5.0, "text": "M. A. Jackson built me a screened pool enclosure and did an excellent job. The enclosure will provide insect protection (mosquitos/West Nile Virus, wasp, flies, etc.) and allow night swimming (keep bugs from flying into the lighted pool). The enclosure will also reduce pool maintenance/cleaning by eliminating falling and windblown debris, insects, frogs, etc. from entering the pool. Mr. Jackson and his entire team are friendly/courteous folks and are devoted to providing you with a quality product that you are completely satisfied with.", "pics": null, "resp": null, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "101762008964598927721", "name": "Pamela Fortier", "time": 1606785912319, "rating": 5.0, "text": "I love my new sunroom! From Start to Finish ALL M. A. Jackson employees have made every aspect of this building project a pleasant experience. Because of Covid-19 there have been a few unexpected setbacks. However, I was always informed about what was going on. The office personnel and construction workers were always very kind, friendly and professional. I can't stress enough how beautiful and well constructed my sunroom is. I wholeheartedly recommend M. A. Jackson for whatever your needs maybe. You won't be disappointed!", "pics": null, "resp": null, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "114799105984217025968", "name": "Doug Thompson", "time": 1586199038893, "rating": 5.0, "text": "M.A. Jackson took our concrete slab and turned it into a screened in room.....  After having to work around the weather ( All the rain ) they made us a fantastic area to sit in and not have to worry about the bugs.... It looks great... After it was done they had to come back to adjust a spot or two which only took 5 minutes and now it's perfect.... We found them very easy to work with and after the build they did a great job with the clean up..... They also called to make sure we were happy with our new room.... Yes... 100 %.... We will used them in the future and will Highly recommend to our family and friends....  Thank you M.A Jackson....", "pics": null, "resp": {"time": 1600301638479, "text": "Thank you for the 5-star review and kind words!"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "102208728343896665081", "name": "Google User", "time": 1573583958453, "rating": 5.0, "text": "M. A. Jackson Co. recently installed a walk-in shower for us in our master bath. The installer did an excellent job with the installation. It exceeded our expectation. They were extremely courteous and proficient in their completion of the project. The work area was cleaned and all materials removed when the job was completed. Thanks for such a good job.", "pics": null, "resp": {"time": 1600301590416, "text": "Thank you for the 5-star review and kind words!"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "115304278249640712525", "name": "Google User", "time": 1572365187415, "rating": 5.0, "text": "I did research on patio covers before deciding to go with MA Jackson, Co. The price was right and the design complimented our home better than the competition. We are so happy with the results. We sat under the patio cover the same day the job was finished. I would definitely recommend MA Jackson, Co. We are totally satisfied.", "pics": null, "resp": {"time": 1600301541365, "text": "Thank you for the 5-star review and kind words!"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "107592303904915315005", "name": "teresa cobbs", "time": 1567426532477, "rating": 5.0, "text": "Absolutely the best guys around. They added a screen room to my carport. The crews that came out, were respectful neat and eager to please the customer.  I love my new space. Nathan Nicholaus is one of many that worked and the whole crew seemed to really put forth a team effort. Would recommend M.A Jackson Co.", "pics": null, "resp": {"time": 1600301609158, "text": "Thank you for the 5-star review and kind words!"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "115955243844226744303", "name": "Diane Cooper", "time": 1574274685681, "rating": 4.0, "text": "I have had MA Jackson Co do a few projects for me over this past year and have been happy with the results.  Because of my disability due to cancer and amputation surgery, I had to have my master bathroom remodeled to install a walk-in handicap-accessible bathtub as well as open up a wall so that I can get into the toilet with my wheelchair.  Also had cement ramps built up at the front and back doors.  Aside from the medically necessary remodel, I also had a screened-in back porch put up and it's so perfect for us and the cats love it!!!  Just be patient as their crew is sometimes backed up with projects.  His guys are very respectful and friendly.", "pics": null, "resp": {"time": 1600301451080, "text": "Thank you for the 5-star review and your kind words about our company! If there is anything else we can do just give us a call. Thank you once more."}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "107216536958217320162", "name": "Cindy C", "time": 1582517883923, "rating": 5.0, "text": "They built a nice sun room for us, we love it. Quick, hard workers, great craftsmanship, couldn't be happier", "pics": null, "resp": {"time": 1600301494872, "text": "Thank you for the 5-star review and kind words!"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "104968894491755492809", "name": "Linda Sell", "time": 1578358313534, "rating": 5.0, "text": "M.A Jackson Co installed us a screen in porch....we were very pleased with the work and professionalism of the men that installed our screen porch....I would highly recommend them and if I need anymore remodeling I will call M.A Jackson Co.", "pics": null, "resp": {"time": 1600301284053, "text": "Thank you for the 5-star review and kind words!"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "107619999855236609786", "name": "Google User", "time": 1572967513196, "rating": 5.0, "text": "We went to a local home and garden show in Huntsville, AL where they had a display. We used them to build a cover on our outdoor patio with a fence and railing, etc. Outstanding!", "pics": null, "resp": {"time": 1600301088125, "text": "Thank You For The 5-Star Review!"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "106249274123875795877", "name": "Lisa Sheffield", "time": 1508074721819, "rating": 5.0, "text": "Andy and his crew were great.  I love my sunroom and new deck!  Would definitely recommend to anyone looking to have a big project done.", "pics": null, "resp": {"time": 1564090788852, "text": "Thank you for the nice review and  \"5\" stars!"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "109858007450538613604", "name": "Shana Romano", "time": 1530317921658, "rating": 5.0, "text": "Love my patio cover!! Andy was courteous and made sure that I was pleased with the work when finished.", "pics": null, "resp": null, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "114196298873055635658", "name": "John Drake", "time": 1500341916837, "rating": 5.0, "text": "M. A. Jackson company did a great job for me! They were very professional. There workmanship was top notch. I would definitely use them in the future!", "pics": null, "resp": {"time": 1500344325299, "text": "Thank you Mr. Drake!\nIt was our pleasure working closely with you and your wife, to get you the results you were wanting to achieve. We truly look forward in the near future to serving you both again, in all your home improvement needs."}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "106114360154908385574", "name": "Denise Cooper", "time": 1596555835994, "rating": 5.0, "text": "This is a great company!!!!  They stand behind their products and their work !!!  High quality products and great workmen ship!  Thanks Andy and Pam !!!!!", "pics": null, "resp": {"time": 1600294220721, "text": "Thank you for the 5 star review and wonderful comment!"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "117642623293589202957", "name": "A Google User", "time": 1503412523215, "rating": 5.0, "text": "Great people to work with! Best contractor in North Alabama! A reputable company that diversifies in many different products.", "pics": null, "resp": {"time": 1503611368405, "text": "Thank you!"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "102939315835045237027", "name": "Mr. Burnz", "time": 1547616585385, "rating": 3.0, "text": "I had a Four Seasons Sunroom window that had an inside water leak. The sunroom was out of warranty, so I had to purchase the glass directly from Four Seasons in New York. The problem is, I had no clue how to install it. I’m glad that Andy and Jim were able to do this,  but I think $1200 for four hours labor was a little steep. (Includes two hour drive back and forth from Cullman)", "pics": null, "resp": null, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "112559819295600015600", "name": "Google User", "time": 1577816816860, "rating": 5.0, "text": "Exceptional work!", "pics": null, "resp": {"time": 1600294139004, "text": "Thank you for the 5 star review!"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "113550473204076566708", "name": "Susan Goodson", "time": 1491248012950, "rating": 1.0, "text": "We met this company at a home show in Huntsville.  At that time, we were in the process of selling our home and from the feedback we received, folks were wanting lighter cabinets which is why we spoke to them.   Fast forward a few months.  I rec'd a call from the company following up from our contact.  I scheduled an appt. but told the caller we have since moved but the home we own now was in need of a kitchen re-model.  The appt. came and went and no one showed.  Come to find out, rep went to our old address ( I gave new address during the phone call)  I called them to reschedule.  Rep showed up at our home and that was the end of the beginning.  He did not listen to us.  We did no want re-facing but he continued to measure existing cabinets which we did no intend to keep.  I asked to look at the books he brought in.  He asked rather snarkily, have you checked out our website???  Yes, but since you have books can I look?  At the  end of a very awkward meeting, he said they have a designer that could help with what we want.  We have not heard anything from this company 4 months later.  The end.  Would not recommend this company.", "pics": null, "resp": null, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "109364140630479289749", "name": "Google User", "time": 1501683472326, "rating": 5.0, "text": "Exceptional work!", "pics": null, "resp": {"time": 1501708260862, "text": "Thank you"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "103763369473849546741", "name": "A Google User", "time": 1501865133252, "rating": 5.0, "text": "Great Company", "pics": null, "resp": {"time": 1503611333234, "text": "Thank You"}, "gmap_id": "0x8889cd9e2e74f8b1:0x90e1ce673d96709a"}
{"user_id": "104544610863901080207", "name": "Davis.jo.davis Davis", "time": 1606521544473, "rating": 5.0, "text": "Trick performed a full home remodel which included moving walls and bathrooms and bathroom addition. Once we were all grounded on my expectations for quality the project moved along well and we are very happy with the results.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO2oz2zS6-QGfOa6TlX-1jnJlGZ2iTtHKiT6L9C=w150-h150-k-no-p"]}], "resp": {"time": 1606665552660, "text": "Thanks so much! Great to work with you on your project."}, "gmap_id": "0x88861d5dfb64b027:0x9605d22fe9a03654"}
{"user_id": "115645576267686949321", "name": "Terrance Jones", "time": 1616634160774, "rating": 5.0, "text": "Just lock one of Trick home! Quality is second to none!", "pics": null, "resp": null, "gmap_id": "0x88861d5dfb64b027:0x9605d22fe9a03654"}
{"user_id": "116290203162603331869", "name": "Johnnie Campbell", "time": 1554223101051, "rating": 5.0, "text": "Everyone is very friendly, knowledgeable, and professional. I highly recommend Trick Construction to anyone looking to build a new home.", "pics": null, "resp": null, "gmap_id": "0x88861d5dfb64b027:0x9605d22fe9a03654"}
{"user_id": "109889322698012743292", "name": "David McMillan", "time": 1596137756334, "rating": 5.0, "text": "So far so good", "pics": null, "resp": null, "gmap_id": "0x88861d5dfb64b027:0x9605d22fe9a03654"}
{"user_id": "111508130676674400375", "name": "Luis Duran", "time": 1509109551396, "rating": 5.0, "text": "(Translated by Google) Very good work. fast and excellent designs.\n\n(Original)\nMuy buen Trabajo. rapido y exelentes diseños.", "pics": null, "resp": null, "gmap_id": "0x88861d5dfb64b027:0x9605d22fe9a03654"}
{"user_id": "103315866228837292055", "name": "Priscilla Young", "time": 1617136179417, "rating": 4.0, "text": "Inquiry not what I needed. Thanks", "pics": null, "resp": null, "gmap_id": "0x889a354fb1866f5d:0xbfbf03bd8f0e6ae0"}
{"user_id": "114764646444902431027", "name": "Kasia Gabbard", "time": 1508770935429, "rating": 5.0, "text": "We used Estes to replace our windows a couple of weeks ago. Fast and professional crew. We will definitely use them again.", "pics": null, "resp": {"time": 1508876168095, "text": "Thanks for taking the time to write such a great comment!"}, "gmap_id": "0x889a354fb1866f5d:0xbfbf03bd8f0e6ae0"}
{"user_id": "118299164966391417775", "name": "Erica Williams", "time": 1570744692457, "rating": 1.0, "text": "Very racist and rude!", "pics": null, "resp": null, "gmap_id": "0x889a354fb1866f5d:0xbfbf03bd8f0e6ae0"}
{"user_id": "115437957546930619699", "name": "Darnel Williams", "time": 1570750376971, "rating": 1.0, "text": "They do such horrible work I don’t advice you choose this company for any work", "pics": null, "resp": null, "gmap_id": "0x889a354fb1866f5d:0xbfbf03bd8f0e6ae0"}
{"user_id": "101093585274475691814", "name": "Millie J", "time": 1570742282215, "rating": 1.0, "text": "Racist, rude, and unprofessional.", "pics": null, "resp": null, "gmap_id": "0x889a354fb1866f5d:0xbfbf03bd8f0e6ae0"}
{"user_id": "103233750565246896475", "name": "Gene Montecchie", "time": 1534905323396, "rating": 5.0, "text": "Phillips scraped, patched and retextured a kitchen ceiling for us in Gulf Shores.  They showed up when they said would. They protected the floors and cabinets. They finished on time and within budget. What else could you ask for?", "pics": null, "resp": {"time": 1541128347046, "text": "Thanks for the review! Happy to help with your Sheetrock repair project in Gulf Shores!"}, "gmap_id": "0x889a0f57da1efc93:0x4cbe1e4def3cfab3"}
{"user_id": "103085355522535107637", "name": "Gregory Butler", "time": 1526160612187, "rating": 5.0, "text": "Goodness gracious...", "pics": null, "resp": null, "gmap_id": "0x88c2b204a8ccb179:0x4c4dcf5c50cedf59"}
{"user_id": "103196653036186660030", "name": "Alan Thacker", "time": 1610055362353, "rating": 5.0, "text": "Installed a walk-in shower for my elderly mother this Summer. They were reasonable & honest regarding how soon they could complete it, were fairly priced when we compared to other vendors, and their workers / installers were friendly, competent, & cleaned up after themselves. Dewayne & Melissa were courteous & helpful in every communication. When we did run into a small glitch with our shower, through no fault of theirs, they sent someone out & helped us with a quick-correction at no charge. We would use them again & we would recommend them to others.", "pics": null, "resp": {"time": 1613140200176, "text": "Thanks so much Mr. Thacker! Loved working with you!"}, "gmap_id": "0x888a184db5f54973:0x46aeaf8e5c23b73"}
{"user_id": "116107811452990228120", "name": "Belle Davis", "time": 1609879089987, "rating": 5.0, "text": "Great showroom, good opportunity to see all different styles and colors.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPt_r_QlykzLmid6e6PP93gkZi-mlHoI0QpXJcS=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPA4JAty_GF8EXsu1KdrB9Tj0P0WdWf3m0IB_P8=w150-h150-k-no-p"]}], "resp": {"time": 1613140256546, "text": "Thanks so much for coming in!"}, "gmap_id": "0x888a184db5f54973:0x46aeaf8e5c23b73"}
{"user_id": "102975297958629938445", "name": "Jimmy McCormick", "time": 1617999677532, "rating": 4.0, "text": "Getting some work done really like the way they handle things.", "pics": null, "resp": null, "gmap_id": "0x888a184db5f54973:0x46aeaf8e5c23b73"}
{"user_id": "102734960105033928820", "name": "Tabatha Hopper", "time": 1614015581850, "rating": 5.0, "text": "This company is great to work with! The workers that installed my tub were very friendly.", "pics": null, "resp": null, "gmap_id": "0x888a184db5f54973:0x46aeaf8e5c23b73"}
{"user_id": "106993840810845091815", "name": "johnny harden", "time": 1570500795343, "rating": 5.0, "text": "I highly recommend these folks!!!\nExactly what my wife wanted, she couldn't be more pleased with her bathroom.\nThese pics says it all....", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMR86stmnukiYrxsA68TW9PvoOj2_aW8_XbWGLS=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP3DyTIxaKKKOCdrnjIGDsIu77VpEh6fAa7cVTS=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP_pHgHpfj0S6kVMOUR1kaEydggqTYZE4zg0aPw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP52BBkBUv1f75IiE4PhI7C84vuOaEJNIRaA4xt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMoAyNbAYdOnC8YTtNNmaXzbhITkj5jAGy8TT9f=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMkRu30vYUSFp_HnAW-G2yOKtw4hQqVlVQ7PDXs=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPkTICX_4-vg-LnUxSUs6KibdwWA28iZhgdzzRB=w150-h150-k-no-p"]}], "resp": {"time": 1570542147088, "text": "Thanks! Great working with you both!"}, "gmap_id": "0x888a184db5f54973:0x46aeaf8e5c23b73"}
{"user_id": "106678801593542207559", "name": "Caren Brown", "time": 1599932453226, "rating": 1.0, "text": "Came in to the showroom and the lady there in the office never acknowledged we were there, other than looking up from her phone when we came in and when we were leaving. We walked around and looked and would have asked some questions, but she was too busy looking at her phone. I would never come back and would not recommend. Very unprofessional.", "pics": null, "resp": {"time": 1600185437946, "text": "I'm repeating here my response that I sent you on Saturday when you came in to the showroom. I appreciate your review, and I hope that you are as diligent to leave good reviews for businesses where you have a good experience.\n\nI’m so sorry you had a bad experience. That’s a lady we hire to come in and clean on Saturday and be there to have the showroom open for people to look and take their info if they want us to come out and give them an estimate. She’s not really able to answer many questions but she is usually very friendly and helpful. I would be glad to answer any questions you have.\n\nI just spoke with her. She said she spoke when y’all came in. She’s a little COVID paranoid because she takes care of her elderly mother and she forgot her mask today. She also said she didn’t want y’all to feel like she was following you around.  She should have told you that and that she would be glad to try to answer any questions. Again I apologize and would be glad to answer any questions you might have about a remodel or new construction job."}, "gmap_id": "0x888a184db5f54973:0x46aeaf8e5c23b73"}
{"user_id": "101854827976636090019", "name": "G Eason", "time": 1600185811241, "rating": 5.0, "text": "Thank you! Thank you! Thank you!!!!! Love my bath. You guys were the best!!!!! Will tell everyone I know how great you all are!", "pics": null, "resp": null, "gmap_id": "0x888a184db5f54973:0x46aeaf8e5c23b73"}
{"user_id": "115705100294884897589", "name": "Kathy Holcomb", "time": 1573601859426, "rating": 5.0, "text": "Creative Baths and Kitchens has remodeled 2 baths for me and recently, completely remodeled my kitchen! They do a fantastic job and are so easy to work with! I highly recommend them for any bath or kitchen remodel job you may have. From small to major they are the best in my opinion!", "pics": null, "resp": null, "gmap_id": "0x888a184db5f54973:0x46aeaf8e5c23b73"}
{"user_id": "111731778471269139954", "name": "Crystal Paige Trussell", "time": 1570500381390, "rating": 5.0, "text": "Went above and beyond on my Master Bath Reno! Very happy with outcome on my very outdated bathroom! ❤️❤️❤️ Highly recommend", "pics": null, "resp": {"time": 1570542095299, "text": "Thank you! The change is really amazing!"}, "gmap_id": "0x888a184db5f54973:0x46aeaf8e5c23b73"}
{"user_id": "105716953863308759311", "name": "Debra Bentley", "time": 1582229144190, "rating": 5.0, "text": "Great experience! Very knowledgeable, courteous, and professional.", "pics": null, "resp": null, "gmap_id": "0x888a184db5f54973:0x46aeaf8e5c23b73"}
{"user_id": "109978830594092593855", "name": "Max Bruce", "time": 1512400604486, "rating": 5.0, "text": "Attention to detail. That is how to describe this company. We are very pleased with the product, people and delivery time. Would do business with them again.", "pics": null, "resp": {"time": 1569011206134, "text": "Thanks so much! Good working with you!"}, "gmap_id": "0x888a184db5f54973:0x46aeaf8e5c23b73"}
{"user_id": "107106995113331762154", "name": "Cynthia Seay", "time": 1545959867225, "rating": 3.0, "text": "Checked on  prices of their tubs but you have to schedule a home visit for them to give prices. Wasn't interested in going that route. However I did find what I wanted in my price range at Dixie Salvage in Ft. Payne.", "pics": null, "resp": {"time": 1569011168564, "text": "Sorry we couldn't help you. We are not a retail store. We have to come out to look at the jobsite to know the amount of work involved in installation of the tub. That's the only way possible to give someone an exact price. Glad you were able to find what you were looking for at the salvage store."}, "gmap_id": "0x888a184db5f54973:0x46aeaf8e5c23b73"}
{"user_id": "114368436675962895056", "name": "Cathy Sanders", "time": 1504923645317, "rating": 5.0, "text": "They did the cultured marble on my bathroom\nRemodel a couple of years ago -  fantastic job & great prices, very pleased", "pics": null, "resp": {"time": 1569011232010, "text": "Thank you Mrs. Sanders!"}, "gmap_id": "0x888a184db5f54973:0x46aeaf8e5c23b73"}
{"user_id": "116998154612716268606", "name": "Jessica Martin", "time": 1565457382411, "rating": 1.0, "text": "Terrible customer service. Not willing to supply counter tops for bathrooms if they could not do the entire home. Weekend help knew nothing about the products that were offered or how to get me information of options that were available. Very rude and unprofessional.", "pics": null, "resp": {"time": 1569010128786, "text": "We are not a retail store. We are contractors. We will absolutely do just countertops, but we have to install them. Pam explained to me that you were upset because she couldn't look up the color of some work we had done for you in the past. We don't keep records on site from 10 years ago, and if we did they would be on my computer, which is only accessible by me or management."}, "gmap_id": "0x888a184db5f54973:0x46aeaf8e5c23b73"}
{"user_id": "100789839999198561945", "name": "Tina , tucker (BabyGirl)", "time": 1504833420633, "rating": 4.0, "text": "Very friendly and helpful service there", "pics": null, "resp": {"time": 1569011245562, "text": "Thank you!"}, "gmap_id": "0x888a184db5f54973:0x46aeaf8e5c23b73"}
{"user_id": "109839120767505765687", "name": "Michael Nance", "time": 1544837013574, "rating": 4.0, "text": "Nice place", "pics": null, "resp": {"time": 1569011256344, "text": "Thanks for coming in!"}, "gmap_id": "0x888a184db5f54973:0x46aeaf8e5c23b73"}
{"user_id": "101335907931877003579", "name": "Candace Hawkins", "time": 1617134894232, "rating": 5.0, "text": "ICS Roofing is a GREAT Company!!! Jamie was very professional and compassionate. He sat down with my mother and I and explained the cost and what to expect. We were told it would be 3 weeks but they started the next week ( a few days later). The crew were very nice and respectful. I recommend this company if you want a professional and trustworthy company. New roof for a GREAT price.", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "115348570757770813166", "name": "Victoria Gann", "time": 1622246744754, "rating": 5.0, "text": "They are great to work with. They installed one roof for me. Repaired a different one and found the source of the leak, vent cap damaged. They have fixed flashing for me and fixed several worn boots at different properties. They have also inspected a roof for a new purchase and was able to give me a detailed report. They are the most responsive and thorough business I have ever dealt with.", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "109349124809197120413", "name": "April Orr", "time": 1605562536079, "rating": 5.0, "text": "From the initial contact with ICS, I was impressed with their professionalism and attention to detail. Scott was such a pleasure to work with and gave me all of the details and options I needed to make the best decision for my home. He did such a great job keeping me updated that I never had to wonder what was going on with my project and in fact, when he gave me a timeline, things were completed ahead of that. Scott clearly enjoys his job and I value his expertise and passion to perform at the highest of his abilities. The roofers themselves were polite, clean and on-time. They were respectful of my property and ensured none of my plants were damaged and my yard was completely spotless before they left. I received several quotes for my job and Scott and his boss worked diligently to not only earn our business, but to make our insurance claim payment stretch as far as possible. I would recommend ICS without hesitation.", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "108473078846696249414", "name": "Carol Ann Simonds", "time": 1610245838405, "rating": 5.0, "text": "I had a leak and they came within a few hrs of calling to tarp it.  I had a whole roof + decking put on a few weeks later and they were professional, worked well w our Insurance company. Crew was much quicker than the previous roofing company from 15 years ago. Start to finish,  good experience.", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "107136359253065877745", "name": "Sherry Oldham-Coffee", "time": 1600870908420, "rating": 5.0, "text": "Recently had ICS do a roof on an older home. Jonathan was very professional and pleasant when giving the bid and all throughout the process. Communication was fantastic. Had 3 bids and I usually go with the middle bid but I was so impressed with the thorough inspection and bid that I chose ICS even though theirs was the lowest of the three. Had to wait about a month or so for roof to actually go on. Roof looks great and they didn't leave any mess behind so that was also a plus. I would highly recommend ICS Roofing.", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "101535723936444944051", "name": "Beth Kristensen", "time": 1596061572701, "rating": 5.0, "text": "If you need work done to your roof, this is the BEST company to use.  Jonathan came to our home, explained what was needed (a whole new roof) and why.  We had noticed some shingles had fallen from our roof but he showed us pictures of many other shingles (that we were unaware of) that had also blown off.  ICS dealt with our homeowners insurance through the whole process.  The entire company is honest and courteous.  Jonathan kept us informed from start to finish, and everything was done exactly as he promised.  The roof was replaced, the job was done quickly and more importantly, perfectly.  Our new roof is beautiful and the crew that installed it left the exterior of our home and yard cleaner than they found it.  Do not hesitate to use ICS!  Thank you ICS!!", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "114556172691915555020", "name": "Mark Wells", "time": 1604415432104, "rating": 5.0, "text": "From start to finish, this company was highly professional. Project manager, David, was exceptional through the entire process and the work done high quality. Good prices with excellent results.", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "100357496584784781980", "name": "Karen Bishop", "time": 1603242939981, "rating": 5.0, "text": "I have never had a company work as hard as this one did to get my roof replaced with a days notice.  I cannot stress how great this company was and especially Jonathan Weston who stayed in touch with me from the time the adjuster came until the day it was completed.\nHe went above and beyond for me.\nThank you ICS for having personnel that cares!", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "102791446078699793440", "name": "gary White", "time": 1599608430194, "rating": 5.0, "text": "Very prompt response,  professional service, HONEST(VERY IMPORTANT,  TO ME). QUALITY WORK AT A COMPETITIVE PRICE. THANKS FOR TAKING CARE OF MY MOMS HOME. WE WILL CALL YOU AGAIN.", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "106999837697504093431", "name": "Katie Loughrist", "time": 1593283505446, "rating": 5.0, "text": "We really appreciated the great customer service we received from this company! They were even generous enough to donate a bit of extra gutters for my garden and for my friend who needed some. They were quick and respectful. When we told them of the few issues we found with the installation, they made it right immediately. Support this local business. They will do right by you!", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "118138108986943610215", "name": "Beverly McCainey", "time": 1597367406456, "rating": 5.0, "text": "Johnathan was very professional and kept me abreast of everything going on with my home... I was texted of pictures and text messages..... I would recommend this company to my friends and family.\nThank You again,\nBeverly A. McCainey", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "115015793223979790018", "name": "Patrick James", "time": 1596799128094, "rating": 5.0, "text": "I had active leaks from storm damage that went unnoticed until water began running into my home. I needed help taking the right steps to quickly stop the damage that was occurring and I did not know who to ask.  I happened to mention my plight to an ICS employee who had dropped by the business where I work, and the ICS team literally did the rest. My project manager, David Prejeant, contacted me,  took the time, and made every effort to baby step me through the proceedures with little worry on my part.  Once the day was set, their install team efficiently and professionally installed our new roof. Once the job was complete, the install team left very little evidence that anyone had been on my roof and my property other than the roof was obviously new and the leaks had stopped.  Then,  the thing that was the ultimate reward for having done business with them, ICS sent an inspector back out after completion to insure the work met their high standards of quality.  On this inspection trip,  the gentleman took extra time to run a magnet around to check again that no troublesome tacks were left behind.  I am thankful I shared my plight with the right person that day!", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "104239462254102503835", "name": "Steveandpamela Valdez", "time": 1565986401549, "rating": 5.0, "text": "They did the work fast and were very thorough. The workers were extremely well disciplined and made sure everything was covered, including our pool, to insure a clean job. When they were through, you couldn’t tell the workers were ever here except for the wonderful roof.  Special thanks to Scott for working so efficiently with us to get everything taken care of in a timely manner.", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "117181008217335704259", "name": "Chip Lazenby", "time": 1571773363323, "rating": 5.0, "text": "Just had roof replaced by Jamie Harris with ICS roofing in Sheffield. Excellent work, start to finish. Jamie was very patient, professional and helpful from start to finish. He made the process easy and non-stressful. The work crew did an excellent job and were friendly and professional. Check these guys out if you need a new roof.", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "114639152691554993315", "name": "Jane Chasan", "time": 1567799440552, "rating": 5.0, "text": "ICS said it might be 2-4 weeks before my roofing, but were able to schedule sooner. The roofing crew worked 14 hours to replace my roof in one day. The only break they took was for lunch. The cleanup was great.\nI would recommend ICS for your roofing needs. Jamie Harris was very nice to work with.\nI have several neighbors who have used this business and all were pleased with their work.", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "112858131125984092474", "name": "Caleb Danley", "time": 1565106744517, "rating": 5.0, "text": "Friendly, on-time service.  Replaced the roof, start to finish, in one day.  Very professional from start to cleanup.  Jonathan was great to deal with.  From the beginning he was upfront and honest in regards to the work that was to be completed and the time frame it was going to take.   10/10 would use them again.", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "115212428485106941205", "name": "Patricia Roemer", "time": 1563898568139, "rating": 5.0, "text": "Highly recommend ICS roofing. From the professional estimator Scott Breakfield who was on time, so courteous, answered all my questions, explained the contract, warranties, and  returned calls promptly,  to the super hard working and courteous crew  who did a top notch job on my new roof.  Great job on clean up too, with no damage to shrubs and lawn. Just had Scott out again to have ICS do my gutters. Highly recommend you give him a call.", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "117760403500681528832", "name": "Randy Holm", "time": 1567728444059, "rating": 5.0, "text": "ICS does fantastic work. They have done a couple roofing jobs for us. They are always very professional and do exactly what they say they will do. It is such a pleasure doing business with everyone at ICS. For something as important as a roof, I would recommend ICS to do the job and do it right.", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "115080127439080894589", "name": "P Hathorn", "time": 1570568055677, "rating": 5.0, "text": "The work was done very professional. We have no problems with the work done. All the workers very nice. David took care of everything. We would recommend this company to anyone needing a new roof.", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "117760403500681528832", "name": "Randy Holm", "time": 1567728444059, "rating": 5.0, "text": "ICS does fantastic work. They have done a couple roofing jobs for us. They are always very professional and do exactly what they say they will do. It is such a pleasure doing business with everyone at ICS. For something as important as a roof, I would recommend ICS to do the job and do it right.", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "109492972705421248476", "name": "Scott Point", "time": 1590774332274, "rating": 5.0, "text": "I dealt with David Prejeant and he is is very knowledgeable at what he does. Would recommend using ICS for your roof.", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "113716987671104799430", "name": "Tina", "time": 1558542267854, "rating": 5.0, "text": "I was very pleased with all the work and cleanup. The crew was very polite and courteous. Jamie and the other supervisors came by several times to make sure everything was going smoothly. I highly recommend them to anyone who needs a new roof.", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "107074249835722884541", "name": "Debbie Mitchell", "time": 1565392030960, "rating": 5.0, "text": "Was very pleased with our roof. Workers did a good job, were very friendly and finished and cleaned up in one day. This is the second roof they did for us. Would highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "118175322606792775547", "name": "Michelle Coburn", "time": 1575560137065, "rating": 5.0, "text": "The crew doing the work were very professional did a great job cleaning after the job was finished very friendly done work fast and very good. Jonathan  Weston was very good to work with and very professional and knowledgeable good personality.", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "115095919018307072463", "name": "Tim Loughrist", "time": 1593283410028, "rating": 5.0, "text": "ICS installed gutters on my house and garage. I was very happy with their work and any issues I had, they gladly made right.", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "109845721243160518775", "name": "Neva Leigh", "time": 1555269759744, "rating": 5.0, "text": "They do an amazing work.  This is the second roof we had done we them.  If we have to have another one, they we be doing it.  Great people, great service and great dob.  Thank you for being top notch!", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "117757778096083467481", "name": "Tyler Taylor", "time": 1573052605767, "rating": 5.0, "text": "Very helpful through entire process, got the job done in a timely manner. Jamie went above and beyond to make sure everything went along smoothly.", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "113015498459234452508", "name": "Cindy Luncford", "time": 1526089437795, "rating": 5.0, "text": "They did a beautiful job on my roof.  They were quick, my roof was completed in just a day!  They did a great job with clean up, too. Plus, they took care of some interior work for me, and it looks wonderful. Good quality work, and they wanted to make sure that I was happy with everything they did.  Scott Breakfield and all of the crew took good care of us.  Great service!", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "104360758066501458202", "name": "pixie watkins", "time": 1550162755627, "rating": 5.0, "text": "Great job - quick service- roofers dedicated to getting their job done in a timely manner. We appreciate all the staff at ICS Roofing & Construction. Thanks Everyone!", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "108872871660084705663", "name": "Matthew Bonds", "time": 1561386985460, "rating": 5.0, "text": "Great professional company with good pricing when compared to other quotes we received. Gutters were made and. It on site and were up in just a few hours.", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "116000158014708023062", "name": "Lee Cosbie", "time": 1581350616333, "rating": 5.0, "text": "ICS is great!!!! They did great work. Jamie was a great guy to work with.", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "103629724687103843153", "name": "Don W", "time": 1554264779792, "rating": 5.0, "text": "I have been well pleased with the work that ICS has done for me. Jamie Harris has shown exceptional knowledge of each job and has been very helpful from the beginning to the end of each of the jobs  that ICS has done for me.", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "118067314211875716663", "name": "Alyssa Pilkinton", "time": 1523043325523, "rating": 5.0, "text": "Called back with in the day to set a time that was good for me. Got to me quick to check out my roof. Had no damage but happy it was do quick.", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "110635162177662547818", "name": "Drew Aldridge", "time": 1559692280640, "rating": 5.0, "text": "Outstanding work on my new roof,  cleaned up afterwards,  very efficient . I would recommend them . They removed my old roof, put on the new roof, cleaned up and handled all of my insurance  claims, completely hassle free", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "109136512931882480560", "name": "Shannon Gibson", "time": 1523675146912, "rating": 5.0, "text": "Scott Breakfield and his Crew at ICS ROOFING\ncame out and done one awesome job! Scott came out and was prompt, professional and done what he said he would do. I was so impressed with the work they done! ICS ROOFING made sure they cleaned up all the mess and nails. Nowadays its hard to find people who will take care of you and make sure the job is done right! Call no other company other than ICS ROOFING!!!", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "112868868253083709124", "name": "Emanuel Couto", "time": 1550957874308, "rating": 5.0, "text": "Called on a Saturday afternoon.. for a possible roof leak under warranty.. two crews were here within 15 minutes in bad weather.. it's nice to see  customer service at that level.  Thanks ICS", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "104333707312732558969", "name": "Charles Alexander", "time": 1549389814058, "rating": 5.0, "text": "I appreciate their courtesy and professionalism in the way they worked. I highly recommend their service. 😃😃😃", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "114524091151593549351", "name": "Lise Stanford", "time": 1556635936879, "rating": 5.0, "text": "Jonathan  has been great on follow up and we highly recommend this company!", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "110831859631920498543", "name": "Jody Stutts", "time": 1530930435911, "rating": 5.0, "text": "Great job !!!!!! The best roofers I’ve ever hired. The work area was always neat and in order and there was not any damage to the schrub beds, side walks or driveway. That crew is the best!!!!!", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "102806771469489543658", "name": "Virginia Lamy", "time": 1554415995672, "rating": 5.0, "text": "Great work.  Easy to deal with.", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "104296346700605164147", "name": "Dylan Peggy", "time": 1491166526912, "rating": 5.0, "text": "Great local contractor, really stand behind their work!", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "108430265144010081856", "name": "J. Michael Campbell", "time": 1502233715198, "rating": 5.0, "text": "excellent roofing company, and great for interior remodeling as well", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "108647034523119319093", "name": "Andre Soler", "time": 1508503540749, "rating": 1.0, "text": "Worst contractor I've ever had work for me. Poor workmanship, cheap materials.", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "105437039826652622209", "name": "irina thornton", "time": 1515602199238, "rating": 1.0, "text": "Picky! Never gave me any price option and suggestion, just told NO about our roof repair, highly disappointed.", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
{"user_id": "111341254843328950452", "name": "D Parker", "time": 1623981665113, "rating": 5.0, "text": "Thank you David P., he came to my mother's house, thought we had a leak. He inspected it, and found leaves had plugged the air vent. He removed the leaves, no leak. Jonathan W, was out of town when this occurred, he does a great job as well.", "pics": null, "resp": null, "gmap_id": "0x887d4eb552a6bdbf:0xbdd68da85f9c3807"}
