{"user_id": "112038552120833765994", "name": "Cathy Riley", "time": 1598664464441, "rating": 5.0, "text": "Has raised several iPads for my grandchildren!  Always did a good job.  Recently need a fix for my iPad and she fixed it for free!   Thanks so much.", "pics": null, "resp": null, "gmap_id": "0x8892921311c230fd:0x8fe1017aa648b72e"}
{"user_id": "100522243904593750426", "name": "Sade Johnson", "time": 1602615442713, "rating": 5.0, "text": "Cody and Caysey are super amazing and so professional and great customer service!!!", "pics": null, "resp": null, "gmap_id": "0x8892921311c230fd:0x8fe1017aa648b72e"}
{"user_id": "111643069083028248663", "name": "Gigi", "time": 1534292786060, "rating": 4.0, "text": "The guy I spoke with was friendly and professional. I greatly appreciated his honesty when he was unable to repair our ancient phone and offered helpful suggestions.", "pics": null, "resp": null, "gmap_id": "0x8892921311c230fd:0x8fe1017aa648b72e"}
{"user_id": "115282943052504265642", "name": "Casey riley", "time": 1495980884821, "rating": 1.0, "text": "I went into this store with a broken phone screen, everything still worked I just needed a new screen! Only reason I wanted to replace the screen is because it was cracked will glass falling out (yeah I broke it good). Breaking the phone is beside the point because at some point we all do and that is why this place is even in business!\nAfter being in the store an hour I was going to leave with my phone in working condition and noticed that the home button was super sensitive and was going crazy (I knew a risk with the home button was possible but it was pushing itself and the phone was going nuts) Carly the girl I was working with was absolutely wonderful (customer service wise and was super sweet). She was concerned so she opened the phone back up (big mistake) because the touch and the home button went completely out! She was great a working to try and fix the problem and then partnered with her boss who said she wasn't sure what could have happened but they could send the phone off but they thought the phone had touch HiC which is a disease on the phone that means the motherboard of the phone came unmicrosauded to the phone itself (I was told this could have happened when I dropped the phone which is crazy cause the phone worked up until they worked on it). Carly's Boss made sure that Carly relayed to me that they would send it off but the repair was on me and my wallet which I still don't understand. After and update and a factory restore on the phone I left it over night so that the manager could look at it herself.\nThe next morning I got a call from the Manager and she stated she didn't know what was wrong with the phone but the could send it off but again I had already been told I would have to pay for the repair. She said I will put all the original pieces on the phone and you can come pick your phone up (because I wasn't going to send it off and have to pay for a repair to he done to a phone that just needed a simple screen replacement when I went into the store).\nWhat this boils down to is that I Fix and Repair tore my phone up and wasn't willing to pay for the repair and wanted to send my phone off and it would never be the same again. People we take our phones into these places to intrust the individuals will do the repair and the phone will work (keep in mind I mentioned earlier I knew there were risk but no reason as to why my phone doesn't work now when it was working fine when I went into the store) This company in no way shape or form ever admitted to me that they screwed my phone up and took no responsibility in it. After being told I would be responsible for the repair I realized these people do not need to have a contract with IPhone if they aren't going to replace the phone after they basically demolished a phone and wouldn't fess up and take the responsibility. I have looked into this company and know that they can have their apple contract pulled if enough people have issues with them. I urge you to write a review if they have messed your phone up and didn't want to take the responsibility! Do it so people won't go through what I have been through! The don't deserve your business and I will never grace their door again!", "pics": null, "resp": null, "gmap_id": "0x8892921311c230fd:0x8fe1017aa648b72e"}
{"user_id": "107032213101993861437", "name": "Lycina Jones", "time": 1536247430361, "rating": 5.0, "text": "Looks like a nice store.", "pics": null, "resp": null, "gmap_id": "0x8892921311c230fd:0x8fe1017aa648b72e"}
{"user_id": "114172915670630715373", "name": "Dennis Broome", "time": 1531478612632, "rating": 4.0, "text": "Nice  and  knowledge able", "pics": null, "resp": null, "gmap_id": "0x8892921311c230fd:0x8fe1017aa648b72e"}
{"user_id": "115930286067653997408", "name": "john sellers", "time": 1532273676654, "rating": 1.0, "text": "Over priced.", "pics": null, "resp": null, "gmap_id": "0x8892921311c230fd:0x8fe1017aa648b72e"}
{"user_id": "113675839062393152128", "name": "Beth Scott", "time": 1538928494044, "rating": 3.0, "text": "Kinda pricey!!", "pics": null, "resp": null, "gmap_id": "0x8892921311c230fd:0x8fe1017aa648b72e"}
