{"user_id": "108699333513666355151", "name": "Del Chick", "time": 1548007173729, "rating": 1.0, "text": "At first I would’ve thought this was the perfect place, the marketing director is wonderful. But then she had us sit down to sign the contract with the administrator. I told her my mother was able to get around OK but she was confined to oxygen 24/7. All I wanted was someone to bring her her meals in her room and we would pay more for that privilege. The administrator said ,and I quote, “we’re not going to baby her!”   I looked in my husband and said that’s it we’re done with this place! I was not going to have someone tell me you’re not going to baby my mother, because I babied my mother! And I expected it if I was going to pay for it!\nTherefore, I have no clue what it’s like for a resident to live there so I can’t comment on that.", "pics": null, "resp": null, "gmap_id": "0x888c2be0d219b069:0x9a1cbc0607b3bbf4"}
{"user_id": "107681740401300629704", "name": "Coretha Slayton", "time": 1531427365321, "rating": 5.0, "text": "I highly recommend Country Cottage for those that want Senior Living with a home like feel for their loved one. Michelle Kelley is a great a person to work with and has a heart of gold. She also has a lot of wisdom and experience with Administrative.", "pics": null, "resp": null, "gmap_id": "0x888c2be0d219b069:0x9a1cbc0607b3bbf4"}
{"user_id": "103789845991846699828", "name": "Heather Thornton", "time": 1486555234353, "rating": 5.0, "text": "My grandmother has been at Country Cottage for almost a year. We love the staff and the care she receives. I would highly recommend this facility to anyone looking for an assisted living.", "pics": null, "resp": null, "gmap_id": "0x888c2be0d219b069:0x9a1cbc0607b3bbf4"}
{"user_id": "107398066188856773459", "name": "Brooke Fisher", "time": 1520909323106, "rating": 1.0, "text": "What you see here is not what it is like behind closed doors. Poor management, most employee's do not care one bit about the resadent. I have personally witnessed someone refuse water to someone just so they wouldnt have to change there bed. One of many things trust me.", "pics": null, "resp": {"time": 1526049252544, "text": "Brooke, our top priority is quality care that exceeds our residents' expectations. We are truly sorry this is not what you experienced and would love the opportunity to speak with you to learn more. Please call us at 256-536-5992 or email us at info@cottageassistedliving.com."}, "gmap_id": "0x888c2be0d219b069:0x9a1cbc0607b3bbf4"}
{"user_id": "104245868676692103712", "name": "Elizabeth Guthrie", "time": 1364922757185, "rating": 2.0, "text": "This facility provides the worst care possible.  My mother was there almost 2 months and was never provided help with shower.  So the only way she could be clean was to wash up in the sink in the bathroom on her own.  The food served was cold more than not and did not taste good.  The aides told me and my Mother on many occasions they did not know how to help with the oxygen - they were new.  One aide tried to give her someone else's medicine.  Thanks goodness my Mother was alert and knew that the meds were not hers.  After multiple meetings with the administrator we made a decision to move my Mother to another facility because the care was so terrible.", "pics": null, "resp": null, "gmap_id": "0x888c2be0d219b069:0x9a1cbc0607b3bbf4"}
{"user_id": "106564334720078778873", "name": "Lynn Johnson", "time": 1545352820986, "rating": 1.0, "text": "When a employee has to rate their work place to increase the ratings- SHAME ON YOU! It screams there is issues, covering up.Never been there and will not because of that alone.", "pics": null, "resp": null, "gmap_id": "0x888c2be0d219b069:0x9a1cbc0607b3bbf4"}
{"user_id": "109354399363946888778", "name": "Michelle Kelley", "time": 1486507921840, "rating": 5.0, "text": "Beautiful property with loving and caring staff!!", "pics": null, "resp": null, "gmap_id": "0x888c2be0d219b069:0x9a1cbc0607b3bbf4"}
{"user_id": "108605570671092178949", "name": "Susan Crain", "time": 1558221560923, "rating": 5.0, "text": "Beautiful well built homes", "pics": null, "resp": null, "gmap_id": "0x888c8bee8e50dbb7:0xc231319a1d0d1377"}
{"user_id": "117400087238440628558", "name": "RenatraB Female", "time": 1595203535584, "rating": 1.0, "text": "I thought it was a great place to work but for it to be a work place it is extremely messy and and not clean at all. The workers that has been their longer try to haze the new comers and they hide out in the lookout spot and talk on their phone and don't work at all. Needs a whole new outlook on elderly care because its not their.", "pics": null, "resp": {"time": 1595280925451, "text": "Thank you for your feedback. We would like to speak with you as soon as possible to discuss the details of this situation. Please contact Vice President of Operations Marcus Covar at mcovar@atlasseniorliving.com at your earliest convenience. Thank you."}, "gmap_id": "0x888c2a191859116b:0x4ba25dc3d9993582"}
{"user_id": "108400488776637427052", "name": "J C", "time": 1577770217677, "rating": 5.0, "text": "My family is lucky enough to have my mother in the care of these true angels... the facility is extremely well maintained and the staff and doctors are just wonderful. Our stress levels have decreased greatly knowing that my mother with Alzheimer's is able to be monitored 24/7 with top notch care just outside her bedroom. We love you, you really are truly angels for the elderly!", "pics": null, "resp": {"time": 1577811455946, "text": "Thank you for the review!"}, "gmap_id": "0x888c2a191859116b:0x4ba25dc3d9993582"}
{"user_id": "113282249556822425934", "name": "Mandy Beeson", "time": 1606912425180, "rating": 1.0, "text": "My mother lived here for about 5 years and it used to be wonderful, but Atlas Senior Living took over and it has gone way down hill. Please consider not moving your loved one here. They do not have anyone to answer the phone, so the phone rings forever or goes to an answering machine that is set up for people who don’t even work there any more. Unless you know someone’s cell phone number, you won’t get an answer. And this is happening during Covid 19, when you can’t go in at any time and see your family member. I called weekly to check on my mother when I couldn’t see her because of the pandemic and was told she was fine every time. Then randomly I get a call that she has 30 days to leave the facility because they can’t care for her anymore. At that point, I had to direct her care and ask the staff to do things like check for a UTI because they didn’t care to take the initiative. I couldn’t even get them to answer the phone so I would have to call the dr office directly. She had a massive change in condition and never once was I notified. When it was time for me to move her, almost none of her clothing fit because she had lost so much weight. However the times I called to speak to the nurse, I was told she was fine and didn’t lose weight. Keep in mind this happened during the pandemic when I could not visit her. They also told me she struggled with running into things, but come to find out she didn’t have her glasses, they couldn’t find them, and again - I was never notified. When I called Atlas Senior Living to complain, they said they would handle these situations but never did. When I did move my mother out, they did not let the pharmacy know, and continued to order medications for her, which charged me extra money, because insurance would not pay for these meds as they were filled at another location. The facility never sent her meds back either. Once again I called Atlas to complain about this but had to leave a message and was never called back. Anyone who is in the situation of having to move their parent into a facility does not need the added stress that Atlas Senior Living and this facility will give you. The company has replied below for me to reach out to Marcus, but I have already spoken to Marcus and he was also no help. They admit that they have a communication problem but do absolutely nothing to solve it. They act like your family member is a burden and don’t want to do the things you are paying them for. Don’t waste your time here.", "pics": null, "resp": {"time": 1606864346958, "text": "Thank you for reaching out, Mandy. Resident care is our number one priority, so we would like to speak with you to discuss your experience with Angels for the Elderly in more detail. Please contact Vice President of Operations Marcus Covar at 706-726-9336 as soon as possible. Thank you again for your feedback."}, "gmap_id": "0x888c2a191859116b:0x4ba25dc3d9993582"}
{"user_id": "101858086576513690528", "name": "Katrinda Jackson", "time": 1582083171702, "rating": 5.0, "text": "Been working here for 11 years. Loving and Caring Place For Residents with a Great Staff To Take Care Of Your Love Ones.", "pics": null, "resp": {"time": 1580145366345, "text": "Thank you, Katrinda!"}, "gmap_id": "0x888c2a191859116b:0x4ba25dc3d9993582"}
{"user_id": "106754542852829668867", "name": "Betty Sue Moore", "time": 1541477819951, "rating": 4.0, "text": "The caregivers, nurses, entire staff have been so good to my mother, taking good care of her, being kind and loving, in spite of her disease.  I do not worry about her because I know she is being well taken care of.  My thanks goes out to all of them.", "pics": null, "resp": null, "gmap_id": "0x888c2a191859116b:0x4ba25dc3d9993582"}
{"user_id": "117374448816091877434", "name": "Chip Gray", "time": 1327542854713, "rating": 5.0, "text": "Words can not describe the level of care and love they give to their residents. The owner is one of the most compassionate and professional women. This staff is truly an amazing group of angels.", "pics": null, "resp": null, "gmap_id": "0x888c2a191859116b:0x4ba25dc3d9993582"}
{"user_id": "110590554967041942977", "name": "Steve Nee", "time": 1539709023311, "rating": 5.0, "text": "This is a wonderful facility with great care. Cannot recommend enough !", "pics": null, "resp": null, "gmap_id": "0x888c2a191859116b:0x4ba25dc3d9993582"}
{"user_id": "106408089518527283801", "name": "Trina Vines", "time": 1629923754573, "rating": 5.0, "text": "What an incredible place to live and work !!", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "104575751116350075512", "name": "Holly Hendon", "time": 1594654504069, "rating": 5.0, "text": "The staff at Saint Martins are some of the kindest most compassionate people I’ve ever met. My father was very well taken care of the three days he was there. Thanks to Saint Martins I was able to sit with my dad while he passed even through the Covid Pandemic. I am very thankful these women helped me through my fathers last days.", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "108399484139241757534", "name": "Joe Watts", "time": 1577482084583, "rating": 2.0, "text": "Rating the Independent Living facility from 3 years ago, I would give it 5 stars. My mother-in-law was in the independent living for 2 months and it was everything we had hoped it would be.\n\nAfter falling and breaking a hip, she went to the rehab side. It was like night and day. They were very understaffed. They would take 30 minutes to answer the call button when we were there. They would place the call button on the opposite side of the room in an unreachable location when we weren't there. They were told of this and we would leave notes explaining that she couldn't reach it. They continued to do it until we had her transferred to another location. I would give them 0 stars if possible. Locations like this seem to change regularly, so note that this is a review of the situation from 3 years ago. Everyone agreed that the food was always good, though....but the care itself left a lot to be desired.", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "104286523305506329040", "name": "Al Rhoney", "time": 1550437645619, "rating": 5.0, "text": "This morning, I brought my wife and 3 other very close friends of a man whose been admitted here for end-of-life care. My immediate impression was very favorable. It was clean and quiet, with no \"sanitary cleaning\" odor. Upon entering one of the staff saw me and asked if she could help. She told me where we had to sign in and what Suite our friend was in. As we walked to his room,  his  nurse introduced himself and told us a bit the kind of care he was receiving and told us he  was available for any questions. Our friends room was very clean and neat. The lighting  was very comfortable and welcoming. We spoke with 4 staff members besides our friends nurse. Every one of them were very pleasant and offered their help, for anything we needed. I noticed a number of \"little things\" that had been done to help keep our friend comfortable. Things that I'm positive are helping him remain as comfortable as possible in his condition and demonstrate a deep level of genuine caring attitude from the nurses and staff. If I ever have a need to place a family member in an end-of-life Hospice Care facility, I would not hesitate to use St. Martin's in the Pines.", "pics": null, "resp": {"time": 1550454215021, "text": "Such kind words. Thank you for sharing."}, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "103844497160510448675", "name": "Mike Baswell", "time": 1584457219355, "rating": 4.0, "text": "We were very pleased with our experience at St. Martin’s in the Pines. Our family member entered via the Skilled Nursing unit and then graduated to Assisted Living.  Their services were critical to helping her to recover and return to Independent Living.", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "102778511206249646058", "name": "Jeff Williams", "time": 1533069114368, "rating": 1.0, "text": "My Grandmother was a resident there several years ago. She received so-so care. Some of the employees were very nice and helpful, but a lot were just lazy. The woman in charge (I'll update if I can remember her name) is a liar. She would tell us what we wanted to hear, not the truth. The doctor that sees the residents is just a puppet for the the administrators. He does not look out for his patients. They sent my grandmother to the hospital for an evaluation and and once she was away, they used a loop-hole to evict her. Even though she passed the evaluation, was still independent and could function with minimal care. If you choose St Martin's, be sure to check on your loved ones often. I'm sure there are worse places out there, but there are better ones also. Note: This was several years ago so hopefully some of the same employees don't work there anymore.", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "109774300742549159109", "name": "Naomi Goodwin", "time": 1510162286398, "rating": 5.0, "text": "I am the Assistant Director of Nursing at St. Martin's in the Pines. Working at St. Martins in the Pines has been a outstanding experience. This is a faith based campus with a very positive environment. There are so many great people working here and we all are like family here. The customer service and patient care is outstanding. We have some really great elder's and families that reside at our campus here at St. Martin's in the Pines. This campus has so much to offer such as rehab, long term care in our cottages, many levels of assisted living, and several levels of apartments The food here is outstanding.", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "112404592040666698699", "name": "Kywanniee Stuckey", "time": 1510319490767, "rating": 5.0, "text": "St. Martin's is a great faith based and tight knit community. There is such a friendly atmosphere around the entire campus. The elders and their families are the greatest joy and blessing to be able to care for. Our pastoral team is remarkable; they keep the community grounded in faith and positivity! Not to forget, the food is amazing!", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "111174111817726366316", "name": "Tina Hawkins", "time": 1565199650270, "rating": 2.0, "text": "Im so disgusted with management and how i was treated in the end. You should feel safe coming to work and free from harassment, but no one did anything to deal with an issue that happened my last day. It was a nice place to work until that point!", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "102955683232783403051", "name": "Foleca Swain", "time": 1510322642078, "rating": 5.0, "text": "I first want to thank God for blessing me with this career @ St. Martin's in the Pines as MDS Coordinator. I could have been many places closer to home, but was chosen to drive a few minutes further. This was the best decision in my life, I have great administration, co-workers & most of all great Elders & sponsors. Thank you God for blessing me with the best last.", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "111878665003457205700", "name": "Anica McDonald", "time": 1510148828604, "rating": 5.0, "text": "There is a reason why St. Martin's in the Pines has been around for over 60 years. Their commitment to excellent patient care along with genuine love towards the elders on the campus is why I am excited to come to work everyday. Faith is the foundation of who we are and that in itself speaks volumes. Come take a tour and see for yourself!", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "110466141906933223821", "name": "Lee Nocella", "time": 1465229956762, "rating": 1.0, "text": "The quality of care at St. Martin's is inconsistent.  Most people there are very nice and helpful.  The food is also very good.  However, my elderly sister approached a group of employees at the nursing station for help with her husband who was in the rehab facility recovering from surgery.    They didn't answer the call light earlier and he needed to use the restroom. They were unwilling to help and told her they weren't \"trained\" for that.  They had been helping him prior to that as it was part of his rehabilitation not to mention his dignity.  My sister was offered absolutely no assistance and had to help him herself.   I called the nurses desk to get her some help and the person who answered didn't even bother saying hello but held the phone up in the air for a moment before hanging up on me.  They must not be trained to use the phone either.  Then, as we were leaving after an afternoon visit, the director of nursing came out to the parking lot and had a very non-hipaa compliant conference with us about my family member's care outside in the open in front of whoever happened to be walking by.  She tried to rationalize why the employees there would not offer to help my family member.  I was embarrassed for her and walked off.  My sister needed help.  Not one employee offered to assist her.  Any prudent compassionate person in a similar situation would have helped.", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "108732677659692263957", "name": "Sherryll White", "time": 1538700992484, "rating": 2.0, "text": "Sounds like workers like to be there, the families of loved ones not so impressed. My MIL was there for rehab and the experience was not pleasant. Dirty, run down rooms, so so staff. They lost her pj's and eventually started to ignore her. Sept 2017.", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "108128273737139520720", "name": "nicole boomhover", "time": 1502147730384, "rating": 5.0, "text": "St. Martin's is a great place to work! There is a friendly atmosphere on campus and the staff truly cares about the loved ones and residents. Come take a tour and see for yourself!", "pics": null, "resp": {"time": 1503090018223, "text": "Thank you for your dedication to St. Martin's. We are so glad you enjoy working here!"}, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "114498263291322427617", "name": "Cassandra Clark", "time": 1510357180609, "rating": 5.0, "text": "St.Martins in the Pines is a great place to work. I am the Director of Social Services. Everyone is so friendly. Our elders and patients Rule!", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "107813472089184034477", "name": "Susan Melvin", "time": 1539713552055, "rating": 5.0, "text": "A great place to work. Everyone is treated like family and they care deeply for their employees.", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "114805324909529605960", "name": "Steven S", "time": 1548946427955, "rating": 5.0, "text": "A very good retirement community. Clean, nice and good location.", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "117974373250762583432", "name": "micki082", "time": 1560031230994, "rating": 1.0, "text": "EDITED!! Since posting this review, I've had a few lengthy conversations with a couple of the \"head\" personnel  at St Martin's. We have come to a mutual agreement and I am satisfied with the outcome. I am NOT removing or changing anything in my initial review, so one must proceed with care and make sure EVERYTHING is explained to you in its entirety.   ORIGINAL REVIEW: This is a LONG read, if I could rate with less than 1 star, I would, but this NEEDS to be shared!!! NEVER USE ST MARTIN'S FOR IN HOME CARE!!!!!!! I recently had to have major back surgery, and as I have no local family, I opted to use St Martin's \"in home care\".  I have NEVER used this type of service EVER, and I must say I was COMPLETELY taken advantage of and the service was HORRENDOUS . Because, I had never used this service,  I had hoped that they would understand my needs and assist me in setting this up. Oh they SET ME UP all right.  TWENTY FOUR HOUR SERVICE, even while I was in the hospital for TWO weeks.  The hospital did not let them do ANYTHING. (Hospital policy), so ALL they could do was SIT there, maybe assist in putting on those \"stupid hospital socks\" , cover me when I got chilled and uncover me when I warmed up. I had NO idea that I could PICK AND CHOOSE when I needed them. I was left with the impression that once I started their service, that I was STUCK with them until I was released by the surgeon.\nI KNEW that I would need help once I returned home, but NOT 3- 8 hour shifts. I was in the hospital almost 2 weeks and during that time the program manager was to set up my in home care. I informed her that I did NOT want a parade of different faces coming into my home. TWO WEEKS, she had to get a \"team\" put together. THIS DID NOT HAPPEN!!! When I returned home; A DIFFERENT person almost every day AND some shifts not even covered. How could I heal, if I had to STRESS every day about my care?? This is MY home, I was not capable of moving around, so I couldn't very well see what was happening around my home. The 11pm till 7 am shift was the WORST! I did NOT require anyone to WATCH me while I slept, so I PAID A LOT OF MONEY for these sitters to SLEEP, WATCH TV, AND TALK/PLAY ON THEIR CELL PHONES while I slept.\nI know that the sitters were supposed to be bonded/insured, BUT how did I know things weren't moving out of my house. YES, I have trust issues with strangers, but that is NOT the point. The POINT IS... The \"Care At Home\" program is NOT SET UP CORRECTLY, THE PROGRAM MANAGER IS OBVIOUSLY NOT WELL TRAINED IN HER DUTIES,( I heard that she hasn't been doing this long)  AND I, THE CLIENT,  feel TOTALLY abused and \"taken for a MONEY ride\".\nI could rant on & on, but I AM DONE!! I truly hope that this review opens up some eyes at St Martin's AND future clients.  <1 star!! HORRIBLE! NO EXCUSE!!", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "114569656138292968634", "name": "Vontricia Prewitt", "time": 1516556918992, "rating": 1.0, "text": "I hate this place for my granny. They need to be fired. Every last one of them on 2nd and 3rd shift.", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "114805324909529605960", "name": "Steven S", "time": 1548946427955, "rating": 5.0, "text": "A very good retirement community. Clean, nice and good location.", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "102786413455361026301", "name": "cara vaughan", "time": 1504976741189, "rating": 1.0, "text": "If I could give less than 1 star I would. This was 6 months of HELL!!", "pics": null, "resp": null, "gmap_id": "0x888910f661fbbe1b:0x44d09ccda56ec317"}
{"user_id": "106708398228364264803", "name": "Greg Melvin", "time": 1581027646996, "rating": 5.0, "text": "What a wonderful place. My job takes me into the kitchens of a lot of retirement homes throughout Alabama and I have to say this one stands out. Stephanie does a great job and is a pleasure to work with. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x8888e3e1cffb8fb1:0xc04cacc1726c60a9"}
{"user_id": "116734314576628581419", "name": "Tuesday Shaw", "time": 1563985694850, "rating": 5.0, "text": "Great people and so friendly.", "pics": null, "resp": {"time": 1564000944986, "text": "Thank you."}, "gmap_id": "0x8888e3e1cffb8fb1:0xc04cacc1726c60a9"}
{"user_id": "104903856250404847468", "name": "Loretta Vaughn", "time": 1516367797741, "rating": 4.0, "text": "Clean. Welcoming. Friendly.", "pics": null, "resp": null, "gmap_id": "0x8888e3e1cffb8fb1:0xc04cacc1726c60a9"}
{"user_id": "112793771675368950502", "name": "Allan Lewis", "time": 1515490008984, "rating": 5.0, "text": "Clean nice freindly", "pics": null, "resp": null, "gmap_id": "0x8888e3e1cffb8fb1:0xc04cacc1726c60a9"}
{"user_id": "105659582033830544073", "name": "Dawn Murray", "time": 1496793443419, "rating": 5.0, "text": "Great place to stay and work", "pics": null, "resp": null, "gmap_id": "0x8888e3e1cffb8fb1:0xc04cacc1726c60a9"}
{"user_id": "109588396530461957051", "name": "Will Melton", "time": 1622493759393, "rating": 5.0, "text": "Wonderful staff there highly recommend", "pics": null, "resp": {"time": 1622557729106, "text": "Hello Will, thank you for taking the time to leave Madison Heights a 5-star review. We appreciate it!"}, "gmap_id": "0x88926c2d9801e197:0x225b52a7c4dcb7fc"}
{"user_id": "107807661023494042927", "name": "FL Rowe", "time": 1521744373267, "rating": 5.0, "text": "A nice assisted living facility for loved ones with dementia and Alzheimer's.", "pics": null, "resp": null, "gmap_id": "0x88926c2d9801e197:0x225b52a7c4dcb7fc"}
{"user_id": "105964386521290575523", "name": "careyholman", "time": 1577980174985, "rating": 5.0, "text": "Lakeview was our first experience with long term care.  We didn't know any better and based on our sample of one, we thought they were average.  Boy, were we wrong!!  Since then we've had experience with a couple of other facilities, and by comparison, they highlight just how wonderful Lakeview is.  Their staff is experience and kind.  They genuinely cared for my mother.  The facility isn't the most beautiful from the outside, but inside -- the parts that actually matter to the residents -- it's nicely decorated, beautifully clean, and the view of the lake is soothing.  Camaraderie among the residents is heartwarming.  They genuinely care for one another.  You don't find that just everywhere.  I highly recommend Lakeview Estates.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "108403104071762033789", "name": "Moose Doyle", "time": 1531839564142, "rating": 5.0, "text": "My mother is treated with kindness and patience. I'm so glad that the staff has tried to get to know mom and her special ways. They speak sweetly to her and act as though they understand the conversation. They answer mom's questions even when the question doesn't make sense.\nThe facilities are always clean and pleasant. This is especially important to me and my  mom. And, the dining experience is lovely. The residents are treated with respect and very good sit down meals, three times a day. And the residents are also served snacks from a snack cart wherever the residents may be in the facility. My mom usually stays in the front living room, but she also participates in the activities, which is nice. It was fun watching them play noodle ball (which is where you hit a balloon with a pool noodle). It was amazing to see how this sparked the residents natural ability to bat at the balloon. So cute.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "100926343447324958997", "name": "sunny moore", "time": 1567127555039, "rating": 5.0, "text": "This is such an awesome place. My Mother has been there only two weeks and she tells me how nice everyone is to her. I know that is true because I have met so many wonderful and caring staff members. I know my Mother is getting the best possible care.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "106761631696723258794", "name": "Tammy Walker", "time": 1531855472018, "rating": 5.0, "text": "I am pleased to share a review for Lakeview Estates! I have visited the community on multiple occasions and am always impressed with the operations of the community. The residents appear active and engaged in meaningful activities. The staff is cheerful and always helpful when needed. Most importantly, the care provided to the residents of the community is top notch. It is definitely evident that the management and administrative staff are involved in the day-to-day operations and are dedicated to ensuring the community is ran professionally and in accordance with the regulations governing the facility. I would recommend Lakeview Estates to anyone in need of Assisted Living or Memory Care services for themselves or their loved one(s).", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "108537835107890377961", "name": "Fiona Cook", "time": 1553741754788, "rating": 5.0, "text": "I highly recommend Lakeview. It is a wonderful homelike specially memory care facility! They also provide a memory care unit for those with Alzheimer’s and other cognitive impairments. All the staff provide warmth and happiness to the residents and treat them like family. They also provide a wonderful array of activity programs for the different cognitive levels of the residents, which keeps them active, engaged, and entertained! ❤️", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "105998948053245434761", "name": "Stephanie McGough", "time": 1532016950774, "rating": 5.0, "text": "I loved visiting this community on several different occasions. The administrative staff worked hard to ensure that they were providing outstanding care to their residents and treat each resident with total respect. The environment was positive, upbeat, and the staff was very helpful. They would also assist with entertaining and engaging their minds in meaningful activities daily. I would recommend this community to anyone looking for Memory Care/Assisted Living arrangements for their loved one in this area. They go above and beyond to ensure they are a 5 star community at Lakeview Estates!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "110717312195962656851", "name": "Susan Thomas Brandon", "time": 1531274699045, "rating": 5.0, "text": "Both of my parents have been at Lakeview.  My father is still there.  I love Lakeview.  They always have activities going on that give my dad a sense of purpose.  All of the staff and even the visitors for other residents are so friendly - it is dad's home away from home.  I never worry about dad, because I know that he is being cared for and looked after.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "116481706877713378459", "name": "Malinda Adams", "time": 1553548228048, "rating": 5.0, "text": "My mother is at lakeview and it is a fantastic place. She has improved so much since being there.  They celebrate every holiday with a party. There is an activity or 2 everyday. Best of all, there is an in house beauty shop. Lakeview rocks!!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "108176028309053918966", "name": "Linda Champion", "time": 1532450021396, "rating": 5.0, "text": "Lakeview Estates is a wonderful, caring assisted living facility.   Under the expert leadership of Callie Simmons along with nursing director Lynn Rogers, Lakeview is the very best that Birmingham has to offer.\nMy mother was well taken care of and enjoyed living at Lakeview.  She has now passed away, but I still feel part of the Lakeview family.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "107210779197000575143", "name": "Russell McMillan", "time": 1531864882122, "rating": 5.0, "text": "FIRST, I would like to explain that my wife and I have a pretty good working knowledge of Assisted Living Facilities (ASL) in that my wife at one time was a director of an ASL. SECOND, I nor anyone in my family has a vested (personal or business) interest in Lakeview Estates. Now for the review:\nOur mother was at Lakeview Estates on (2) different occasions. The first time was for approximately 6 months while completing rehab following (successful) cancer treatments. The facility, management and staff were excellent and it was an pleasant experience. Our mother's second \"stay\" at Lakeview was a couple of years later and this \"stay\" was for approximately 2 years. Initially, we were \"less than impressed\" with Lakeview and stated our opinions in the \"end of the year\" survey...I am sure that I was not the only one that was not happy with the facility! Approximately 6-8 weeks after the survey, a new manager was hired (Callie Simmons) and IMMEDIATELY things begin to change. First, it was the facility became cleaner, painting, new carpeting, new furniture in the lobby, etc...However, the most significant improvements were that the residents and the staff were NOTICEABLE happier (my wife told me that when the residents and the staff are smiling that this is the sign of a well managed ASL). Eventually our mother passed away; however, the staff and management at Lakeview were nothing short of WONDERFUL (in every since of the word). The staff CONSISTENTLY went \"above & beyond\" What they were required to do in the daily care of our mother. The director (Callie) was frequently in communication with us...consultations, discussions regarding the future \"care\" plans, and phone calls when problems (potential or otherwise) arose. A couple of months after our mother passed away, I went to see Callie and told her that we would like to purchase a gift for the staff and told Callie \"if it helps the residents; that is wonderful; however, we want to let the staff know of our appreciation for the manner in which they (the staff) cared for our mother.\" After thinking over this for several weeks, Callie back to let me know what the staff needed and we immediately purchased the item(s) and had these shipped to Lakeview Estates. Several times over the past couple of years, I have been asked (by my peers) \"what was our opinion of Lakeview Estates\" and I tell them (what is in this review) and then add \"as long as Callie Simmons is the director of Lakeview Estates; it will continue to be a well ran ASL that cares for its. patients.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "105867362621089276594", "name": "Betty Coleman", "time": 1533064535638, "rating": 5.0, "text": "Our family views Lakeview as more than just a clean and attractive living facility. For approximately four years, it was HOME for my mom. While living there, she was respectfully cared for by staff who were loving, kind, knowledgeable and professional. Even though my mom is no longer with us, we continue to enjoy dropping by occasionally for a visit!!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "116461413842038928994", "name": "Debbie Zobel", "time": 1532451658277, "rating": 5.0, "text": "My Mother was well taken care of at Lakeview Estates and while she has passed away, I will always be grateful for the caring leadership Callie Simmons brought.  I appreciated the loving staff - whatever their particular area of responsibility - they carried it out with diligence and compassion.  As a family member of a resident I was not only impressed with how well they cared for my mother, but their responsiveness to my questions or needs as well.  I would not hesitate to recommend Lakeview Estates.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "114233193519686125315", "name": "Jeri Bishop", "time": 1550277283022, "rating": 5.0, "text": "All of the staff here are amazing! The residents are happy and so full of life due to the amazing care and encouragement they receive each day! They are always involved in some of the most amazing activities and fun times!! I highly recommend Lakeview Estates!!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "112044960659702967701", "name": "Kathy Watson", "time": 1531416194471, "rating": 5.0, "text": "Everyone at Lakeview Estates has been kind and caring to both my mom and our family. They have helped all of us in the transition over the almost two months my mom has been a resident there. They are supportive, responsive and willing to answer questions. They understand dementia and try to meet Mom's needs by adapting their care as needed. The setting is lovely, the food is good, and they are welcoming whenever we visit.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "109574869273084003021", "name": "Michelle Mckinley", "time": 1549494645587, "rating": 5.0, "text": "Having been in the health care industry for 19 years and working along side many memory care facilities and assisted living facilities,  I must say that Lakeview ranks one of the highest quality facilities that I have the pleasure to servicing.  The staff is responsive and caring to the many residents that live at Lakeview.  From the front desk girl Pamela  to the clinical staff and everyone in between, this place is a wonderful!!!  if you are considering memory care for your loved one,   I would highly recommend this beautiful facility.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "110486186921522526018", "name": "Jonna Wallace", "time": 1531325820133, "rating": 5.0, "text": "Lakeview is a wonderful home-like facility. My aunt has received outstanding care for 2.5 years now. As it often is with dementia patients, she had a difficult time transitioning to a facility from home. The staff was very helpful with the change.  She settled into a daily routine in about three months. My aunt isn't very social and the staff encourages her and reminds her to join in the activities. She very much enjoys the meals and has gained some security weight. The director and staff quickly respond to any inquiries and keep us informed about her health. We toured four other facilities and none of them were as nice or clean as Lakeview!  Highly recommend this facility!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "113199248128941112518", "name": "david norris", "time": 1553646934992, "rating": 5.0, "text": "I have visited this facility numerous times and I am always so impressed with the professionalism of the staff and management. Everyone is so friendly and residents are very happy! Highly recommend Lakeview Estates!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "103214236220662751016", "name": "Deb Davis", "time": 1531263575104, "rating": 4.0, "text": "My mom has been living at Lakeview Estates for nearly 2-1/2 years and we have been very happy with her care. Management has been responsive and helpful.  Everyone works to ensure the residents receive the best of care. The building is lovely, the food is good, and there is a wide variety of activities throughout the day.  Lakeview Estates also hosts special functions for residents and their families throughout the year.  The reason for 4 stars instead of 5 is due to the high turnover in direct-care staff.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "116298459511127031316", "name": "Christy Jean", "time": 1550195995697, "rating": 5.0, "text": "Lakeview Estates is an exceptional facility! It’s kind and caring staff go above and beyond with their duties!! The residents are well taken care of, happy, healthy and active! The beautiful facility makes it a home to so many!!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "118105267140781034861", "name": "Janie Henry", "time": 1531428038466, "rating": 5.0, "text": "Lakeview Estates is a very caring place for those wth memory disabilities.  It is a secure environment which gives family members peace of mind.  My mother-in-law moved in almost one year ago and is very happy living at Lakeview Estates.  The staff are always friendly and the ladies at the desk in the lobby are some of the sweetest.  They offer plenty of group activities as well as some local day trips.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "103498000329024473195", "name": "Telesa Hearn", "time": 1531330828827, "rating": 5.0, "text": "I am a dispatcher with a local plumbing company that services Lakeview\nEstates. It has been a pleasure to work with Horace Kelly in Maintenance,\nHe is always concerned with repairs having as little as possible disruption for the residents at Lakeview, for example, he is aware of their bath schedules and has any work required scheduled with us to not disrupt their normal routine. Horace responds quickly to emails from us\nrequesting information and is always available when we reach out to him\nby phone. Having a dedicated employee like Horace to communicate with\nenables us to better serve the needs of Lakeview Estates.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "109789782669262893747", "name": "Michelle Givan", "time": 1546394676339, "rating": 5.0, "text": "Both of my parents have dementia, and I had done all I could to care for them from my home. Two of my doctors told me that some of their clients were also in my situation, and had really good things to say about Lakeview Estates. During my tour the residents and staff warmly greeted me.  The staff are professional, the facility is spotless, and ambiance is warm, cozy and family oriented. When my parents moved there,  their nurses and caregivers embraced them and helped them adjust to this change in their lives. My parents are active, happy, growing spiritually and socially, and they are treated with respect and dignity. I couldn’t ask for anything more.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "104238647273973491618", "name": "Lynda Myer", "time": 1520886573468, "rating": 5.0, "text": "Very caring people.  I have been very pleased with the care they have provided to my mother.  So patient with her.  There are plenty of activities to keep her busy and the food is good.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "104435458245245283230", "name": "N Pritts", "time": 1531853963671, "rating": 5.0, "text": "My family member has been staying at Lakeview for nine years and has received nothing but the best of care.  I've compared other facilities and there really is no comparison to the quality of the work the nurses do, the choices of daily activities, the consistent cleanliness, and the above and beyond attentiveness!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "114189013643141520742", "name": "Stephanie Palmer", "time": 1553027950778, "rating": 5.0, "text": "Great leaders and staff. Always compassionate and ready to help in any way they can. Highly recommend. The best dementia care around.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "107577998366563622542", "name": "Candy Campbell", "time": 1532638834538, "rating": 5.0, "text": "My family LOVES this facility. Long term staff and caring staff are all over this place! The food is varied and so good, mom loves it and I have shared several meals there myself. The nursing staff is very hands on and attentive to changes they see in mom, as well. We have had mom in a terrible place before this and now oh my gosh, she's happy and were happy, such a win-win. The on staff Dr. is very through and friendly. I couldn't think of a better place for someone who has memory issues and needs assistance in their living needs. Lots of options for care and a wide variety of activities for each person living there. A++", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "108448932059474325865", "name": "Karen Bailey", "time": 1531830600879, "rating": 5.0, "text": "For 10 years Lakeview has cared for my family. I have never felt the need to ask for more than they give on a daily basis.\nThis is the most emotional job anyone with a heart could have. The escort services Lakeview gives to the final days of my parents lives is very kind, thoughtful, and loving.\nMy family has been,blessed by their compassion.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "109283303059370990721", "name": "hhl lavallet", "time": 1549637958997, "rating": 5.0, "text": "I visit many facilities across the state and Lakeview is consistently one of the finest facilities that I cover.  The staff is always professional and caring.  I highly recommend Lakeview.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "115680487657734466828", "name": "Alicia Jones", "time": 1550948469856, "rating": 5.0, "text": "I am a realtor and have visited Lakeview Estates often.  The residents are very happy!  I have referred several of my clients to Lakeview and will continue to do so!   Very friendly and caring staff!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "103345123292726233857", "name": "Connie Gleason", "time": 1532544589123, "rating": 5.0, "text": "Everyone has been fantastic! They have made my father in-laws transition smoother than we ever imagined. It makes a tremendous difference when people care as much as they do about all of their residents.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "107975587969564018842", "name": "Cheryl Scheu", "time": 1458407715720, "rating": 5.0, "text": "Moving a loved one into memory care is a hard decision but we feel confident having my mother-in-law at Lakeview Estates.  We visited several facilities in the Birmingham area and found Lakeview to be the best choice because it felt more like \"home\" plus it was cleaner and more attractive than some of the more expensive facilities.  The staff is friendly, attentive and helpful.  I highly recommend Lakeview Estates.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "104740364951021438558", "name": "Cynthia Looney", "time": 1532486980099, "rating": 5.0, "text": "Lakesview Estates has a kind caring staff that takes care of people and is always actively involved with activities to help the people that live there. Each resident’s individual needs are met by a professional staff. I visit the facility often as an outside vendor and have the opportunity to compare places and Lakeview is definitely a place I would place my mother if the time ever comes for that.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "107376660492241403167", "name": "Beau Green", "time": 1531424054749, "rating": 5.0, "text": "We have worked alongside Lakeview Estates for the last six and a half years. Their staff is compassionate, caring, knowledgeable and ready to help! I encourage you to consider Lakeview Estates if the opportunity arises for you or your loved one.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "107587455854082679198", "name": "Glynda Howard", "time": 1532648999185, "rating": 5.0, "text": "This lakeview estates is a very nice facility. It is always neat and clean. All the workers are so friendly and helpful. The residents are always clean and being cared for.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "111793814873961146797", "name": "Steve Rice", "time": 1551726914142, "rating": 5.0, "text": "The folks at Lakeview have been so welcoming to mom.  We are so thankful that she in a positive and active environment.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "110275377936275272330", "name": "Daniel Boyd", "time": 1532537500111, "rating": 5.0, "text": "Staff is extremely responsible and reactive.  It is a pleasure working with them.\n\nFacility is always clean and comfortable.  Lake view Estates is highly recommended.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "106697656007483068606", "name": "Kim Bailey", "time": 1532526466435, "rating": 5.0, "text": "The staff at Lakeview Estates are wonderful. They take care of Mother in a friendly and loving way. I know she is in good hands with them, which helps to relieve my worries about her safety.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "109163853894801824762", "name": "Paul Norton", "time": 1532568938983, "rating": 5.0, "text": "Exclusive of the physical plant providing a safe, clean appealing environment every member shows a genuine carting understanding to the residents.  I was fortunate to find the right facility.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "116875003501329691000", "name": "Michael McGuire", "time": 1552364710625, "rating": 5.0, "text": "The staff are very active with residents here.  They have lots of activities to get them moving and thinking.  I have a sister in a similar facility in another state and there is just no comparison to the facilities and the staff.  We also pay more for a lot more for much less.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "112980588391609638763", "name": "Lance Lee", "time": 1532711059103, "rating": 5.0, "text": "The staff at Lakeview Estates demonstrate compassion and care to those who are affected by Alzheimer's Disease.  They understand how to treat their residents with a gentle approach as well as promote their upmost dignity.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "117648145427457184753", "name": "Taneshia Nelson", "time": 1532619990976, "rating": 5.0, "text": "Excellent facility. They really take good care of their residents. I would recommend them to any family in need of care.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "103363236258746868886", "name": "Chris Harlow", "time": 1531318969069, "rating": 5.0, "text": "Care for the elderly can be challenging. Not so for the staff at Lakeview. They are true pro caretakers, caring and know just what to do", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "113807918219422050948", "name": "Jennifer Hess", "time": 1532679531758, "rating": 5.0, "text": "I have been a hairstylist there for the last 4 years. I've gotten to know and love the residents, the staff is very friendly and helpful, and everything is always neat and clean. It's more of a home environment than most places I have been to. By far my favorite facility.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "114613247565186658741", "name": "Laura Boyd", "time": 1553032959721, "rating": 5.0, "text": "Wonderful experience, exceeded our expectations. Professional and knowledgeable staff!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "109361338790499049543", "name": "Allen Keeth", "time": 1550197514019, "rating": 5.0, "text": "This facility is a stunning facility filled with happy, active and well taken care of residents! The staff is top notch in care and compassion!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "107548883577917115568", "name": "Dave Urech", "time": 1549590011910, "rating": 5.0, "text": "My father lived there for 14 months & received exceptional care, very thankful!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "111092679065871056077", "name": "Rusty", "time": 1531843344252, "rating": 5.0, "text": "Very clean and well maintained facility, and it is clear that each and every member of the staff cares for every resident.  This facility also offers memory care services; as such, all of the entry/exit points are secured via either keypad or keycard entry.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "115412145039129151687", "name": "Helen Cook", "time": 1532624248995, "rating": 5.0, "text": "Very friendly and professional staff! Always so nice and courteous. Residents are always happy and active.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "107572306654878216159", "name": "Karmen Payne", "time": 1553025482004, "rating": 5.0, "text": "Lakeview's leadership offers experience,  reassurance and the personal touch needed to comfort families during transitions in care.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "109156792632836878576", "name": "Leah Ludwig", "time": 1531692269118, "rating": 5.0, "text": "Lakeview is truly a home setting and my mother receives stellar, personalized and loving care.  I am exceptionally grateful for the care she receives.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "112397540577689807905", "name": "Brittany Gillespie", "time": 1532728374275, "rating": 5.0, "text": "What a great facility! Extremely friendly staff & would absolutely recommend this place to anyone needing their services!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "112253873483156395597", "name": "Steve Bottchen", "time": 1531400835366, "rating": 5.0, "text": "I am really pleased with the level of care my Mom is getting from Lakeview. The staff is caring and courteous.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "108861088541679864211", "name": "Greg Binder", "time": 1550163961725, "rating": 5.0, "text": "Friendly staff, beautiful lake surrounding the facility, and conveniently located just off 280.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "106503843524135368705", "name": "Tom Donald", "time": 1434643540406, "rating": 5.0, "text": "This is a great place to live!  Beautiful surroundings, well constructed, nicely finished, and caring people.  I can't imagine anything better.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "115835642462030248843", "name": "Maria Cunningham", "time": 1532454844414, "rating": 5.0, "text": "Lakeview Estates would be a great place to call \"Home\".  Friendly & caring staff at Lakeview Estates!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "108974372110044666872", "name": "Linda Luecke", "time": 1531264710143, "rating": 5.0, "text": "We are so blessed to have my mom in such a caring community.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "103824947243229910416", "name": "Linda Grinnell", "time": 1531333619006, "rating": 5.0, "text": "My mother-in-law has been a resident at Lakeview Estates over a year now.  I am very pleased with the level of care and concern the staff has for her and thankful it's her 'home'!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "103892493978292201900", "name": "Beverly Fox", "time": 1450921049407, "rating": 5.0, "text": "LakeView's interior has been updated from these pictures. When my Mother saw it for the first time she said this is like \"home away from home\".  She loves the staff and tells everyone she would recommend LakeView to anyone! She will tell you it is the cleanest place she has seen. And I agree with everything she says!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "104356509118817355108", "name": "Elizabeth Hudson", "time": 1351221690947, "rating": 2.0, "text": "I presented a deposit for my mother.  They took it. She died in the interim.  It has now been over 5 months of attempting to obtain this deposit back. Despite my repeated requests for reimbursment of said deposit, I have yet to get a response. Not to mention a note of care regarding my mother's death.  I like Cheryl Thrasher, but I will never recommend this facility.  I do hope that an attorney need not get involved.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "113511186616948480948", "name": "cdun91 91", "time": 1553025605469, "rating": 4.0, "text": "Nice, clean facility with friendly caring staff!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "117654173266768526649", "name": "Alan Ryals", "time": 1531406831793, "rating": 5.0, "text": "Debbie, Callie, and entire staff at Lakeview Estates have done an excellent job and we could not be more pleased!  Thank you for what you do for my parents every day...", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "118217477268650622246", "name": "Cathy Cousins", "time": 1531405216525, "rating": 5.0, "text": "Callie and the entire staff are wonderful with my aunt. My aunt  can be very stubborn and sometimes difficult but they handle handle the situation with love and encouragement.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "113473464984167352950", "name": "North “Chief” Shelby", "time": 1553030995944, "rating": 5.0, "text": "The fire district works with the residents, staff, management and maintenance at Lakeview Estates on a regular basis.  Whether responding to medical incidents on residents or working on fire/safety issues, the staff, management and maintenance department are always friendly and cooperative.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "114160422473681971473", "name": "C Wilbanks", "time": 1553031904694, "rating": 5.0, "text": "Beauty shop is a wonderful amenity!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "114308607039508604334", "name": "Douglas Burnette", "time": 1531677276851, "rating": 5.0, "text": "When we drove up with my Mother, she said, \"This place looks homey.\" That was enough for me.", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "106695500779836762794", "name": "Greg Johnston", "time": 1533088592946, "rating": 5.0, "text": "We had elderly family members at Lakeview for almost 5 years.   Highly recommend the caring staff!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "106798857168253896275", "name": "Lori Stanfield", "time": 1532532267600, "rating": 5.0, "text": "Beautiful facility and great staff!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "104835812296506714296", "name": "James Williams", "time": 1531852566408, "rating": 5.0, "text": "Wonderful facility and great staff!!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "116352274830195710607", "name": "Andrew Bellard", "time": 1549919915843, "rating": 5.0, "text": "These guys are really great!!!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "118028190129541158880", "name": "Stephen Adkins", "time": 1553959428777, "rating": 5.0, "text": "Great staff!", "pics": null, "resp": null, "gmap_id": "0x888922b2f2f96b31:0x5179ee53183df8e9"}
{"user_id": "109396910537942618601", "name": "vanessa brown", "time": 1542262126393, "rating": 3.0, "text": "My Dad considered this facility. We chose a different one. He needed more care than this one provided. This facility is more for seniors who are able to prepare their own meals and don't need as much support. The facility doesn't provide 3 meals per day and does not have an RN for every shift. IMO, if the senior is in reasonably good health and just needs an occasional \"look in\", then it could be fine. I felt as the seniors needed more help with daily living activities then that's when the facility really makes their money. I will be honest and say these are my opinions and everyone knows what that means. The 2 bedroom apartment was nice esthetically,  the staff seemed nice. It just wasn't a fit for my parent. My objective in this post was the photos of the apartment. Hopefully it helps someone.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPmN4GyAdHKnj1ZdMzAvbrvxNotws0ICVoAuD4s=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMMQuu16wJsnqYWVfb0rOT4J1aZTXrBAJwt3lcx=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM-YIhdP4mdxOrL5D_faigvKHR2upfkHib40qvS=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO6VbMZ-Qv2z92wLacs3XBzgm2tkeK3-c9ck8Q3=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOPEvoB0RorVysmA7VzhspeaBrQahgweZlzVTVn=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOdcIAo5fkZkuevUa67fJa4q5eQBDfAWx-sZfpt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO79tzSS_-vKEcCBq4D4nwc0RM0-yGSM4CcHwES=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMAASjgqwBDWddbhiZC2i2RRBObex9wST-wwzYj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN90S9rVfS6lKUtcbyz-ohwS-vAoZXF3pRyHXAc=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPncoewE0lSYfLSsE0FR7kfEby28l_kO_9uKmFM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPDabNfkj1awVkG0jSfAJ9oo2i5EpDc-aSmnhyW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMVbu1E-6S0hHSugbA-mIykxp5HC36Wsk2lZJao=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8862840b3bedfb69:0x13fe54cb4f6791ae"}
{"user_id": "111030873461850762635", "name": "Anthony Bowen Sr.", "time": 1590526970541, "rating": 5.0, "text": "I have been living here since August 16, 2019 and I find this is like my best place to reside and it’s a great place to live. I plan to be here for a long time.", "pics": null, "resp": null, "gmap_id": "0x8862840b3bedfb69:0x13fe54cb4f6791ae"}
{"user_id": "103973485537537315420", "name": "Cynthia Lee", "time": 1541785818819, "rating": 1.0, "text": "BEWARE OF THIS PLACE!! My father lived here and do to health reasons needed to be transferred to a nursing home. We gave the notice to Brookdale and moved him out. Two months later they drafted 1640.00 from his bank account!!!! AFTER he was no longer a resident for two solid months!! Now they are refusing to give his money back and we can't afford to pay his nursing home for the month. They are shady and all about money. They are not honest and will take advantage once they have your bank account information. I recommend going somewhere else to a place that has integrity. BEWARE OF THIS PLACE!!!!", "pics": null, "resp": {"time": 1542231781083, "text": "Cynthia,\n\nWe are aware you have spoken to the executive director regarding this matter. Our district director of operations also left a message for you, and we encourage you to call her back if you wish to further discuss."}, "gmap_id": "0x8862840b3bedfb69:0x13fe54cb4f6791ae"}
{"user_id": "106889816728629286135", "name": "Laron Hardy", "time": 1574281326361, "rating": 5.0, "text": "My mother has been at Brookdale Cedar Springs for almost a year, and we couldn't be happier.  I would highly recommend Cedar Springs.", "pics": null, "resp": null, "gmap_id": "0x8862840b3bedfb69:0x13fe54cb4f6791ae"}
{"user_id": "116233651757463573141", "name": "Doug Tucker", "time": 1544677761719, "rating": 5.0, "text": "My mother in-law was a resident here. I visited many times. Nice place.", "pics": null, "resp": null, "gmap_id": "0x8862840b3bedfb69:0x13fe54cb4f6791ae"}
{"user_id": "103127158279849920946", "name": "donna hughes", "time": 1602000525821, "rating": 5.0, "text": "The staff at The Gardens of Waterford are so helpful and knowledgeable in helping with placement of senior adults. I highly recommend The Gardens of Waterford for anyone seeking placement for their loved one with dementia needing assisted living. It is An open and airy facility. Happy and bright.", "pics": null, "resp": null, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "107526455078030400929", "name": "Felicia Lamar", "time": 1620703580194, "rating": 5.0, "text": "A great place missing everyone", "pics": null, "resp": {"time": 1620740733536, "text": "Thank you for your kind review, Felicia. We appreciate your supportive feedback!"}, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "101637907039780893659", "name": "Elizabeth Haupt-Johnson", "time": 1601299297295, "rating": 5.0, "text": "Staff and residents’ families communicate well with each other which has created trusting relationships and a pleasant home for residents!❤️", "pics": null, "resp": null, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "106146766934541385744", "name": "Monica A.", "time": 1559764868637, "rating": 5.0, "text": "The resident's at The Gardens of Waterford are well taken care of each and every single day. All residents are visually healthy and beautifully groomed. The management team upholds a very professional and responsible duty to each resident and employee. When working at The Gardens of Waterford you must have  purpose. All residents at The Gardens of Waterford have a special Dx: that takes love, patience,  and kindness. Each second, each minute,  and each hour takes time. If you're seeking employment  at The Gardens of Waterford make note you must have #Purpose and you must have patience every single day. I am grateful for my time spent at The Gardens of Waterford.  I've  learned so much about memory care.  My future plans as a Holistic Nurse Practitioner is to work closely with Doctors and Nurse Practitioners around the world that are trying to eradicate #Alzheimer's", "pics": null, "resp": null, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "105412873507415205641", "name": "Robin Rudder", "time": 1574377870080, "rating": 5.0, "text": "Such a wonderful staff who provides a caring environment for our loved one.", "pics": null, "resp": {"time": 1575303715644, "text": "Robin, Thank you for the five star review."}, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "117178716642420612617", "name": "Tina Whitaker", "time": 1574378041516, "rating": 5.0, "text": "Loving community\nClean\nManagement team is very responsive", "pics": null, "resp": {"time": 1575303727760, "text": "Thank you Tina for the 5-star review."}, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "101712454670074570933", "name": "Lori J", "time": 1517777328838, "rating": 1.0, "text": "One year ago this was the best of the best in Montgomery.  Today, it's a disaster.  Management change months ago and Manor House has gone so far down hill that we now, for our family member's safety, have to leave.  The head nurse has no compassion.  The director is unfit to run a community.  She asked us to give her a chance and we did, what choice did we have.  She has no regional support.  The corporate office makes a lot of unfulfilled promises.", "pics": null, "resp": {"time": 1523388728059, "text": "Lori, we take our reviews seriously and would like to discuss this further. Please call our toll-free Human Resources Hotline at 1-855-273-4397 for staff-related issues, or the Resident Relations Hotline at 1-855-881-2576. Thank you."}, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "104904098754123772050", "name": "Tisha Dickson", "time": 1558457115102, "rating": 5.0, "text": "Wonderful place for families to bring their love ones here...", "pics": null, "resp": null, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "107681740401300629704", "name": "Coretha Slayton", "time": 1559832959355, "rating": 5.0, "text": "The Gardens of Waterford wonderful \"at home\" atmosphere let's the residents maintain their independence in a safe, friendly environment!", "pics": null, "resp": null, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "111141508604997910893", "name": "Christina Wyatt", "time": 1498323058330, "rating": 5.0, "text": "Wonderful place! They take great care of their seniors. 😍", "pics": null, "resp": null, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "110977198448655448123", "name": "Diann Smith", "time": 1497020308311, "rating": 1.0, "text": "Poor old people this place is hll on earth.", "pics": null, "resp": null, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "106483366370668904230", "name": "Georgia Patterson", "time": 1529617643218, "rating": 5.0, "text": "Patients bedridden live here", "pics": null, "resp": {"time": 1533311492963, "text": "Georgia, thank you for the five star review!"}, "gmap_id": "0x888e803853ddeaa9:0x535e53814c307f9c"}
{"user_id": "106422826987950630204", "name": "Verdell Jackson", "time": 1619477322374, "rating": 5.0, "text": "Nice clean place", "pics": null, "resp": null, "gmap_id": "0x889a53d2829a22a5:0xca3a66a64e1985fe"}
{"user_id": "103909286944736802726", "name": "Brenda Bethea", "time": 1548188430800, "rating": 5.0, "text": "Is convenient right around the corner from my house", "pics": null, "resp": null, "gmap_id": "0x889a53d2829a22a5:0xca3a66a64e1985fe"}
{"user_id": "115727302336720591147", "name": "Kaquandria Johnson", "time": 1536900376954, "rating": 1.0, "text": "All I can do is SMH....PITIFUL", "pics": null, "resp": null, "gmap_id": "0x889a53d2829a22a5:0xca3a66a64e1985fe"}
{"user_id": "100386682264588540925", "name": "Glaysjah Gray", "time": 1494894157615, "rating": 3.0, "text": "Its okay because when i first moved here the floor was fifthly nasty and dirty i mean like when you walked around u would have dirt on feet.", "pics": null, "resp": null, "gmap_id": "0x889a53d2829a22a5:0xca3a66a64e1985fe"}
{"user_id": "110282375516351628183", "name": "Junya Winston", "time": 1570602725480, "rating": 5.0, "text": "quick", "pics": null, "resp": null, "gmap_id": "0x889a53d2829a22a5:0xca3a66a64e1985fe"}
{"user_id": "101469770352171395140", "name": "Yetta Boo", "time": 1523715298211, "rating": 4.0, "text": "One of my fav", "pics": null, "resp": null, "gmap_id": "0x889a53d2829a22a5:0xca3a66a64e1985fe"}
{"user_id": "101792900332934580367", "name": "Goddbod. Junya “iceberg” Winston", "time": 1547897315189, "rating": 5.0, "text": "black", "pics": null, "resp": null, "gmap_id": "0x889a53d2829a22a5:0xca3a66a64e1985fe"}
{"user_id": "115614127661339952588", "name": "Van Kell", "time": 1516906849419, "rating": 4.0, "text": "👍👍", "pics": null, "resp": null, "gmap_id": "0x889a53d2829a22a5:0xca3a66a64e1985fe"}
{"user_id": "103998598632687229791", "name": "Lori Murphy", "time": 1627606742768, "rating": 5.0, "text": "Worked for Kirkwood for many years. I would recommend your love one to live there. Caregivers are great.", "pics": null, "resp": null, "gmap_id": "0x88891245b586a637:0x10c3c7ab9bc644e"}
{"user_id": "100155159507578683786", "name": "Tameka Gregg", "time": 1627173010521, "rating": 5.0, "text": "Awesome Place very friendly and clean. I will recommend families here.💙❤", "pics": null, "resp": null, "gmap_id": "0x88891245b586a637:0x10c3c7ab9bc644e"}
{"user_id": "112035631976808230138", "name": "Leann Barrett", "time": 1608583839185, "rating": 5.0, "text": "My mother lived at Kirkwood Independent Living for at least 4 years. We have loved it so much that, when she was moved to Assisted Living this past October, there was no question she would stay at Kirkwood. The people there are so attentive to mom. You can tell they love the elderly. They have activities to keep the residents healthy and active. They even have Chair Yoga in Assisted Living!  I could go on and on. One cannot go wrong choosing Kirkwood for any level of care. The rooms and apartments are nice with balconies. Mom sits out there a lot during Covid quarantine. The area and scenery is so nice.", "pics": null, "resp": {"time": 1608585801565, "text": "Thank you so much for the wonderful review! We love your mom so much and are thankful that she and your family are apart of the Kirkwood family!"}, "gmap_id": "0x88891245b586a637:0x10c3c7ab9bc644e"}
{"user_id": "112497072553325065842", "name": "laura alexander", "time": 1608580677019, "rating": 5.0, "text": "I have had the privilege of working closely with the staff and residents at Kirkwood and all i can say is WOW!!! What a wonderful place.  They take so much pride in all they do - from their facilities to the wonderful activities they plan for the residents, everything is handled with so much thought and care.  I cannot say enough good things about Kirkwood - and i know so many wonderful and exciting things are up ahead!!!!", "pics": null, "resp": {"time": 1608582435368, "text": "We so appreciate your taking the time to give us such kind feedback! We are blessed with such a wonderful community and pray that the Lord continues to bless our people for years to come!"}, "gmap_id": "0x88891245b586a637:0x10c3c7ab9bc644e"}
{"user_id": "116893044499098167406", "name": "Katherine Wates", "time": 1608566852975, "rating": 4.0, "text": "Kirkwood by the River has been great to work with! They took the time to deliver my grandmother lunch after she visited previously for their outreach events. She felt so special after their visit and kept talking about the sweet staff that she was meeting with.", "pics": null, "resp": {"time": 1608569185131, "text": "Thank you so much for the feedback - we love connecting with people in the community and making sure they know what Kirkwood has to offer and how we serve our residents! Your grandmother is the sweetest!"}, "gmap_id": "0x88891245b586a637:0x10c3c7ab9bc644e"}
{"user_id": "108164868337621842831", "name": "Hunter Brown", "time": 1608568966879, "rating": 5.0, "text": "Grandparents lived in the community for years. I know they enjoyed the community it provided. They always talked about the top notch employees and services! Thanks", "pics": null, "resp": {"time": 1608582250330, "text": "We so appreciate your review! Thank you!"}, "gmap_id": "0x88891245b586a637:0x10c3c7ab9bc644e"}
{"user_id": "108939413621389644311", "name": "Alexandra Sasser", "time": 1607569567811, "rating": 5.0, "text": "My grandmother has been at Kirkwood for almost 3 years. She has life long friends there and enjoys the community. The staff are always kind and helpful, and we are grateful to Kirkwood for keeping her safe.", "pics": null, "resp": {"time": 1607967390207, "text": "We so appreciate your kind feedback! We are grateful to have such wonderful residents and family members as apart of our Kirkwood family."}, "gmap_id": "0x88891245b586a637:0x10c3c7ab9bc644e"}
{"user_id": "112506118922313386859", "name": "Randee Isbell", "time": 1608567400443, "rating": 5.0, "text": "I absolutely love Kirkwood! The facility, employees, and family atmosphere is wonderful! It is a fantastic facility. Highly recommend!", "pics": null, "resp": {"time": 1608569227617, "text": "Thank you so much for the positive review! We appreciate your recommendation of our community!"}, "gmap_id": "0x88891245b586a637:0x10c3c7ab9bc644e"}
{"user_id": "112395794394145531077", "name": "Lily holliday", "time": 1608572356066, "rating": 5.0, "text": "My nana works at kirkwood and I love going there. Its a very pretty place.", "pics": null, "resp": {"time": 1608582359748, "text": "Thank you for the review!"}, "gmap_id": "0x88891245b586a637:0x10c3c7ab9bc644e"}
{"user_id": "113688339824716391735", "name": "Monica Holliday", "time": 1608567701912, "rating": 5.0, "text": "My mother has worked for kirkwood for many many years and it is a wonderful place to be employed and the residents are all so sweet. Every year kirkwood has special events for the residents and employees to bring family and friends to. Of course the pandemic kept them from being able to do it this year but our family has always been a part of the festivities and events each year at kirkwood.  Its a Beautiful establishment inside and out. Very clean and the employees make sure the residents are very well taken care of. I highly recommend kirkwood!", "pics": null, "resp": {"time": 1608569388426, "text": "Thank you for the wonderful review! We love that so many of our staff and families choose to be with us as apart of our community for many years. We appreciate you and hope to see you soon as we navigate bringing back in person events and festivities, as the health guidelines allow!"}, "gmap_id": "0x88891245b586a637:0x10c3c7ab9bc644e"}
{"user_id": "109614394870187937512", "name": "Jaclyn Lolley", "time": 1599674014755, "rating": 5.0, "text": "Great facility to work with. They take great care of their residents. The staff is always courteous and smiling.", "pics": null, "resp": {"time": 1599764868503, "text": "Thank you so much for your kind comments! We are thankful for your support of Kirkwood by the River!"}, "gmap_id": "0x88891245b586a637:0x10c3c7ab9bc644e"}
{"user_id": "109003688714803470808", "name": "Tim Sanderlin", "time": 1607378090038, "rating": 5.0, "text": "Had a great experience working with Kirkwood as a vendor. Easy communication and good people.", "pics": null, "resp": {"time": 1607967070207, "text": "We loved working with you on the Kirkwood virtual tour videos! Thanks for the kind review!"}, "gmap_id": "0x88891245b586a637:0x10c3c7ab9bc644e"}
{"user_id": "106238081250260683343", "name": "Jason Holliday", "time": 1608572020194, "rating": 5.0, "text": "Highly recommend beautiful establishment friendly staff 👌 👍 😍 😀 👏 ❤ 👌 👍 😍 😀 👏", "pics": null, "resp": {"time": 1608582333314, "text": "Thank you so much! We appreciate your recommendation!"}, "gmap_id": "0x88891245b586a637:0x10c3c7ab9bc644e"}
{"user_id": "106491232969041798633", "name": "Leslie McDuffie", "time": 1608568502547, "rating": 5.0, "text": "My mother has been here for several years and we have been extremely pleased. Everyone is so friendly and helpful with all of my mothers need!", "pics": null, "resp": {"time": 1608582209548, "text": "We love your sweet mother! Thanks for the kind review!"}, "gmap_id": "0x88891245b586a637:0x10c3c7ab9bc644e"}
{"user_id": "114604483674504068156", "name": "Shelli Sexton", "time": 1583514641364, "rating": 5.0, "text": "My father lives at Kirkwood and our experience has been fantastic. The residents and staff are family.The staff keeps in very close contact with me. Dad enjoys the daily activities and relaxing around the table with friends at meal time. His spiritual needs are met with ongoing bible studies and worship services led by staff member, Rev. Richard.  Our family is very thankful knowing our dad is in great hands and enjoying a great life.", "pics": null, "resp": {"time": 1599770347908, "text": "Grateful to have your family as apart of our Kirkwood Family! Thank you, Shelli, for the wonderful review!"}, "gmap_id": "0x88891245b586a637:0x10c3c7ab9bc644e"}
{"user_id": "106197023411894491773", "name": "Roderick Smith", "time": 1625010027316, "rating": 4.0, "text": "Nice place for retirement", "pics": null, "resp": null, "gmap_id": "0x88891245b586a637:0x10c3c7ab9bc644e"}
{"user_id": "115136802867956898012", "name": "John Higgins", "time": 1584023399570, "rating": 5.0, "text": "My mother is at Kirkwood and loves everything about it. She has a beautiful view of the river and woods. The food has been very good and the activities available are numerous and fun. My mother calls it a \"docked cruise ship\"", "pics": null, "resp": {"time": 1599769845033, "text": "We love your sweet mother! Thank you for the wonderful feedback!"}, "gmap_id": "0x88891245b586a637:0x10c3c7ab9bc644e"}
{"user_id": "113781957855354278742", "name": "Tim Partin", "time": 1583885729814, "rating": 5.0, "text": "My Mother has been a resident of Kirkwood for over ten years. During those years, neither I, nor my brother, have ever been disappointed with her care.They maintain a loving atmosphere and all the staff seems to genuinely be interested her well being. I would recommend Kirkwood to anyone who is seeking long term care for an elder parent or loved one.", "pics": null, "resp": {"time": 1599770237490, "text": "Grateful for wonderful residents and their families! Thank you, Tim, for such kind feedback."}, "gmap_id": "0x88891245b586a637:0x10c3c7ab9bc644e"}
{"user_id": "107020292467830229933", "name": "Josh Kilgore", "time": 1608571635593, "rating": 5.0, "text": "Kirkwood is a wonderful community for residents as well as employees.", "pics": null, "resp": {"time": 1608582305192, "text": "We strive to keep everyone in the Kirkwood family feeling cared for and content! Thanks for the great review!"}, "gmap_id": "0x88891245b586a637:0x10c3c7ab9bc644e"}
{"user_id": "115272298971501836560", "name": "Fred Iffland", "time": 1584311657991, "rating": 5.0, "text": "My wife and I started searching for a Senior Living facility for her parents, both in their 90’s, a little over 3 years ago.  After a good amount of research and visiting several locations in town, we visited Kirkwood By The River.  The difference was immediately obvious.  It just felt different than the other facilities we had visited.  There were lots of residents and employees visible throughout the facility, and they seemed happy!  Each one spoke to us and to each other and smiled.  The setting in the woods by the Cahaba River is gorgeous and serene.  The building and grounds are well kept and very clean.  We toured the facility with Mom and Dad multiple times over several months, and in early December they moved into Independent Living.\n\nThere are several things that make Kirkwood a superior choice over other facilities in town:  1) It is a not-for-profit facility and that makes a world of difference in how it’s run.  2) The executive staff, including the CEO, is right there in the building and frequently visible, always working and/or engaging with residents.  This allows for rapid decision-making and problem resolution.  3) The entire staff at Kirkwood is kind and helpful.  As we’ve gotten to know many of them, the overwhelming majority has worked at Kirkwood for 20+ years.  That’s rare in today’s world and speaks volumes about the work environment.  Happy employees = better care and attention to detail.  4) Kirkwood houses all levels of care under one roof; Independent Living, Assisted Living, Memory Care, Rehab and Skilled Nursing.  This was critical for us because if necessary in the future, Mom and Dad can remain in the same building and see each other daily, but reside in and receive different levels of care.\n\nWe have peace of mind now knowing that Mom and Dad have help when they need it and yet are able to live mostly on their own with the cat they adore.  They both have settled in nicely after 3+ months and are happy and comfortable.  Kirkwood By The River was definitely the best choice for our family.", "pics": null, "resp": {"time": 1599769758567, "text": "Thank you so much for sharing your experience. We so appreciate hearing such kind words and positive feedback from our families!"}, "gmap_id": "0x88891245b586a637:0x10c3c7ab9bc644e"}
{"user_id": "113239681637989076258", "name": "Margaret Shepherd", "time": 1583955446849, "rating": 5.0, "text": "Both of my parents reside at Kirkwood by the River.  The staff is top-notch, the environment always warm and friendly and my brother and I can rest knowing that our parents are receiving plenty of attention and excellent care.  Thank you Kirkwood.", "pics": null, "resp": {"time": 1599769934273, "text": "We appreciate you, Margaret, and love your wonderful parents! Thank you for your kind words!"}, "gmap_id": "0x88891245b586a637:0x10c3c7ab9bc644e"}
{"user_id": "114079844830129525018", "name": "tiffany watkins", "time": 1627909601100, "rating": 1.0, "text": "They are unprofessional", "pics": null, "resp": null, "gmap_id": "0x88891245b586a637:0x10c3c7ab9bc644e"}
{"user_id": "113578652006504728210", "name": "Christal Thompson", "time": 1590958011650, "rating": 5.0, "text": "Slightly biased as I am a nurse here, but I love my residents and fellow staff! Neat and clean, good food, nice people, fun activities, and a family atmosphere.", "pics": null, "resp": {"time": 1599766498827, "text": "Thank you, Christal for sharing your kind words!"}, "gmap_id": "0x88891245b586a637:0x10c3c7ab9bc644e"}
{"user_id": "111207810648256293044", "name": "Terry Widman", "time": 1583886781599, "rating": 5.0, "text": "I feel that my father received excellent care as a resident of the skilled nursing unit at Kirkwood.", "pics": null, "resp": {"time": 1599770001038, "text": "Thanks so much for sharing! We appreciate your review."}, "gmap_id": "0x88891245b586a637:0x10c3c7ab9bc644e"}
{"user_id": "117488108436963660193", "name": "Cindy Layfield", "time": 1585317123460, "rating": 1.0, "text": "My Mom entered this torture chamber for rehab following surgery for a broken hip. Upon entering this \"facility\" you're impressed with what you see. It's a good \"show\". Go down to the rehab unit. Patients sitting in wheelchairs in the hallways begging to go to bed. The smell of urine makes you nauseous. Staff ignores and neglects the residents. I stayed with my Mom day and night and still , the neglect was appalling !  They did not tend to an impactment she had and never bothered to bring her water. Rude , loud people storming into the room slamming things in the room around. Huge roaches ! Mom's BP dropped to 89/26 and I alerted them several times. They told me it was okay, that's not bad. I had to call 911 and have her readmitted to the hospital where she stayed 2 more weeks due to the lack of treatment. I have pictures and videos to back up my complaints. Do not put your loved one(s) here.", "pics": null, "resp": {"time": 1600107071983, "text": "We are very sorry that your experience did not match our expectation. Thank you for taking the time to bring this to our attention. We will discuss your experience with our team as our goal is to always provide the best service possible to our residents."}, "gmap_id": "0x88891245b586a637:0x10c3c7ab9bc644e"}
{"user_id": "108557202620650349045", "name": "Julie White", "time": 1344458327458, "rating": 5.0, "text": "My company had the pleasure of working with Kirkwood by the River on the redevelopment of their web site.  What a wonderful community by the river!  We met and talked to so many of the interesting residents and enjoyed the fabulous food.  Kirkwood is such a special place; I hope we captured what makes it unique. I encourage you to go and visit if you are looking for a place to retire.", "pics": null, "resp": {"time": 1600108977430, "text": "Thank you so much, Julie, for your kind review! We appreciate your hard work on our community."}, "gmap_id": "0x88891245b586a637:0x10c3c7ab9bc644e"}
{"user_id": "103561687856153455774", "name": "Suzanne Long", "time": 1532531387752, "rating": 5.0, "text": "Staff and residents are very friendly and caring. My mother in law is happier @ Kirkwood than I've seen her in over 20 years!", "pics": null, "resp": {"time": 1599770750692, "text": "Thank you so much for the kind words! We strive to provide our residents with the best care possible."}, "gmap_id": "0x88891245b586a637:0x10c3c7ab9bc644e"}
{"user_id": "116923171238589909710", "name": "Kathy Nolan", "time": 1597797237194, "rating": 5.0, "text": "Very helpful staff", "pics": null, "resp": {"time": 1598371827962, "text": "Thanks Kathy for the wonderful review of Kirkwood By The River. We appreciate you taking time to leave your feedback and we look forward to seeing you again soon!"}, "gmap_id": "0x88891245b586a637:0x10c3c7ab9bc644e"}
{"user_id": "108485270385375409698", "name": "Victoria Lee", "time": 1593385813629, "rating": 1.0, "text": "A horrible place to work!!!", "pics": null, "resp": null, "gmap_id": "0x88891245b586a637:0x10c3c7ab9bc644e"}
{"user_id": "108107992001763973410", "name": "Vanda Hansard", "time": 1625343113123, "rating": 5.0, "text": "Everyone we met was genuine and seemed to care about us, even the residents! It was so wonderful that my mother signed that night.", "pics": null, "resp": {"time": 1625571885530, "text": "Hi Vanda! Thank you for leaving a 5-star review for Rocky Ridge senior apartments. Holiday Retirement strives to be a leader in independent living and we appreciate your positive feedback about our retirement community. So excited to have your mom move in!"}, "gmap_id": "0x8889226e2c9a17d9:0x598c3e4b30ac6b0f"}
{"user_id": "117492854609703721173", "name": "Beth cardon", "time": 1607655288311, "rating": 5.0, "text": "Hunter was a great help in providing me information about the facility. He was so polite and helpful. He sent me the email he promised quickly and responded to my texts. I couldn’t have asked for better help!", "pics": null, "resp": null, "gmap_id": "0x8889226e2c9a17d9:0x598c3e4b30ac6b0f"}
{"user_id": "116362716312092561259", "name": "Martha Stark", "time": 1561956733460, "rating": 3.0, "text": "Don't put your parents here if they aren't still active.  The word I heard from most from the elderly people who lived there was LONELY.\nThese were the ones who went back to their apartments and were alone there.\nI was promised that my parents would be taken care of there medically and otherwise for the rest of their lives.\nThe nurses who came in to treat patients like my mom .. dropped the proverbial ball and didn't continue to care for my mom adequately and left my dad who had vertigo to care for my mom's pressure wounds on the lower back side of her leg.\nMy dad couldn't get on the floor to tend to her wounds and the infection went to her bone in her leg\nAfter 2 months in the hospital...my mom was to be released back to Rocky Ridge.   That never happened due to social workers intervening at the hospital.\nMy folks had to go to a nursing home which they weren't qualified by MEDICAID to be in...they ended up in a boarding home with a WONDERFUL caregiver before they both passed away.\nBefore trying Rocky Ridge for parents who can't look after themselves properly....TRY a boarding home.\n\nI do NOT fault Rocky Ridge for any of the circumstances my parents faced in their last few years.\nThat was on the visiting nurses.\nIf your folks are active and drive and can take care of themselves..  Rocky Ridge is Awesome for them as a senior living facility...\nIf not.  Try other resources .\nAnd.    If your folks are elderly and need care...hire an elder care lawyer before you make the next move on where to place your folks or anything else concerning them.\nWord to the wise...", "pics": null, "resp": {"time": 1580851563583, "text": "Hi Martha, thank you for taking the time to provide feedback. We are very sorry to hear about your parents, and that your experience at our community was not completely satisfactory. You are correct that we are an independent senior living community, however our residents have the option of hiring third party caregivers should they need them. We will take this feedback and look for ways to better our community for residents and team members. Thank you"}, "gmap_id": "0x8889226e2c9a17d9:0x598c3e4b30ac6b0f"}
{"user_id": "117104862580955672085", "name": "Tessa Maston", "time": 1567349234119, "rating": 5.0, "text": "Very nice and the staff that I met are very kind and professional.", "pics": null, "resp": null, "gmap_id": "0x8889226e2c9a17d9:0x598c3e4b30ac6b0f"}
{"user_id": "117821784246606968365", "name": "c vance", "time": 1562388678844, "rating": 5.0, "text": "Nice looking place. Staff is nice.", "pics": null, "resp": null, "gmap_id": "0x8889226e2c9a17d9:0x598c3e4b30ac6b0f"}
{"user_id": "112189687733889017300", "name": "Carol Walker", "time": 1498242549559, "rating": 5.0, "text": "Clean comfortable.  Very friendly and courteous staff.  Very happy to have a loved one living here.", "pics": null, "resp": null, "gmap_id": "0x8889226e2c9a17d9:0x598c3e4b30ac6b0f"}
{"user_id": "113228644912327427641", "name": "Kevin Woods", "time": 1530742565503, "rating": 4.0, "text": "They are nice and friendly. My mom lives here and enjoys the amenities.", "pics": null, "resp": {"time": 1530894792065, "text": "Hi Kevin, thank you so much for your positive comments about Rocky Ridge! We are glad your mom enjoys life with us and are proud to call her a resident. If either of you need anything from us, please do not hesitate to let us know!"}, "gmap_id": "0x8889226e2c9a17d9:0x598c3e4b30ac6b0f"}
{"user_id": "102578966094214512502", "name": "Tim Ott", "time": 1545604003335, "rating": 4.0, "text": "What can I say, my mom is there. God Bless", "pics": null, "resp": null, "gmap_id": "0x8889226e2c9a17d9:0x598c3e4b30ac6b0f"}
{"user_id": "100727763762314313055", "name": "Cynthia Timmerman", "time": 1540915428295, "rating": 4.0, "text": "Homey, nice Senior Retirement apartments.", "pics": null, "resp": null, "gmap_id": "0x8889226e2c9a17d9:0x598c3e4b30ac6b0f"}
{"user_id": "112893472184238809382", "name": "Debra Shows", "time": 1506693432274, "rating": 5.0, "text": "They have my best friend there he loves it", "pics": null, "resp": null, "gmap_id": "0x8889226e2c9a17d9:0x598c3e4b30ac6b0f"}
{"user_id": "109871951158378941671", "name": "jbk takedown", "time": 1513756866115, "rating": 5.0, "text": "I absolutely love the people that live here", "pics": null, "resp": null, "gmap_id": "0x8889226e2c9a17d9:0x598c3e4b30ac6b0f"}
{"user_id": "102907297093179059591", "name": "Angela Woodruff", "time": 1548748987102, "rating": 5.0, "text": "My sister and brother-in-law is moving in my brother-in-law had a stroke", "pics": null, "resp": null, "gmap_id": "0x8889226e2c9a17d9:0x598c3e4b30ac6b0f"}
{"user_id": "104417249187836129801", "name": "Robby", "time": 1563641904038, "rating": 3.0, "text": "Lots of older people", "pics": null, "resp": {"time": 1579534356702, "text": "Hi Rob, thank you for taking the time to rate our community.  Could you please share anything specific that you are dissatisfied with so that we may better understand areas we can improve on? Thank you for your feedback."}, "gmap_id": "0x8889226e2c9a17d9:0x598c3e4b30ac6b0f"}
{"user_id": "108501327947908478987", "name": "Risque Tiez", "time": 1526040957042, "rating": 5.0, "text": "love this place", "pics": null, "resp": null, "gmap_id": "0x8889226e2c9a17d9:0x598c3e4b30ac6b0f"}
{"user_id": "116995405173961869720", "name": "Greg Marler", "time": 1599825329951, "rating": 4.0, "text": "Very well maintained retirement tower. My Aunt has been their for many years and raves about the place and the people who work and live there.", "pics": null, "resp": null, "gmap_id": "0x88928da2995fe101:0x1cbaa4bd69f30cf7"}
{"user_id": "105752178827636546426", "name": "Matt Beer", "time": 1564531458624, "rating": 4.0, "text": "Nice apartment complex for 55 + community.  Clean facilities and nice to have laundry room.", "pics": null, "resp": null, "gmap_id": "0x88928da2995fe101:0x1cbaa4bd69f30cf7"}
{"user_id": "109040381693448421405", "name": "Sue Sue", "time": 1542636569218, "rating": 5.0, "text": "My mom loves her new home here!! We have been 100% satisfied!", "pics": null, "resp": null, "gmap_id": "0x88928da2995fe101:0x1cbaa4bd69f30cf7"}
{"user_id": "100226681454235200870", "name": "Wllie Crittendon", "time": 1511153641375, "rating": 3.0, "text": "The manager or the secretary don't care about the tenants. It a money racket, it some are not found dead they sent to flowers hospital.", "pics": null, "resp": null, "gmap_id": "0x88928da2995fe101:0x1cbaa4bd69f30cf7"}
{"user_id": "108614393673397163525", "name": "M Stevens", "time": 1573136355781, "rating": 4.0, "text": "Very nice facility, friendly staff. Secure environment. Grounds are well kept Inside the building there's a warm clean environment. Several activities are planned per month.", "pics": null, "resp": null, "gmap_id": "0x888cf2b27024a525:0x82510b6b793cedb3"}
{"user_id": "102840441856407980164", "name": "sherrie bankston", "time": 1559830665201, "rating": 1.0, "text": "If your loved one causes the staff to have to disrupt their normal routine at all they’ll be sent to the ER and not be allowed back until they have completed sometime at a behavioral facility such as Sylacauga, AL. When that time is completed your loved one will quite possibly have an accident (break a hip,etc.) that assures she probably won’t be going back at all. But in reality it’s much better to go to heaven than back at Magnolia Place.", "pics": null, "resp": null, "gmap_id": "0x888cf2b27024a525:0x82510b6b793cedb3"}
{"user_id": "107182667189362233282", "name": "Lorraine Anderson", "time": 1555625448337, "rating": 5.0, "text": "It's a great place for retirement or if your love one is suffering from alzheimers or dementia. They have 3 locations depending on their needs. They are friendly and have a beauty shop located within their facilities plus a lot more to offer.", "pics": null, "resp": null, "gmap_id": "0x888cf2b27024a525:0x82510b6b793cedb3"}
{"user_id": "114216612259046564164", "name": "Bonnie Riley", "time": 1534117063877, "rating": 5.0, "text": "My Mother is enjoying living here. She is in a safe, caring, and social environment for people who need Memory Care.", "pics": null, "resp": null, "gmap_id": "0x888cf2b27024a525:0x82510b6b793cedb3"}
{"user_id": "105674566553969628934", "name": "Deirdre Gunn", "time": 1535596290517, "rating": 4.0, "text": "Very bright and cheerful, and the staff there is fantastic with my father.", "pics": null, "resp": null, "gmap_id": "0x888cf2b27024a525:0x82510b6b793cedb3"}
{"user_id": "100540410308972843046", "name": "Tammy .Parks Sims", "time": 1579373618394, "rating": 5.0, "text": "I love my patients", "pics": null, "resp": null, "gmap_id": "0x888cf2b27024a525:0x82510b6b793cedb3"}
{"user_id": "108167933093498813459", "name": "Dorothy Wilborn", "time": 1570941447955, "rating": 5.0, "text": "I had to visit I work there", "pics": null, "resp": null, "gmap_id": "0x888cf2b27024a525:0x82510b6b793cedb3"}
{"user_id": "117971708413924607247", "name": "Oscar Fernandez", "time": 1580583922170, "rating": 3.0, "text": "Went there for work.", "pics": null, "resp": null, "gmap_id": "0x888cf2b27024a525:0x82510b6b793cedb3"}
{"user_id": "101633478228917762843", "name": "Linda Barnett", "time": 1577484463273, "rating": 5.0, "text": "My sister is a resident here and absolutely loves it! It’s a beautiful facility that overlooks the city of Birmingham. It is a close community where the residents are like family. The staff works tirelessly to make sure the facility is clean and to make sure the residents are happy and taken care of. Very reasonably priced with great amenities! Skyline Village was a God-send for us!", "pics": null, "resp": null, "gmap_id": "0x88891eb0efdf9451:0x80bde2ef224eb349"}
{"user_id": "112447979081441354858", "name": "Judy Jones", "time": 1552107163927, "rating": 4.0, "text": "I just moved in February. To me it’s heaven compared to other places in B’ham. They’re so helpful and don’t mind at all. Only thing I see wrong i think they need more maintenance help.\nIt’s more than 1 man can do. Otherwise it’s wonderful‼️Bham,Al  out of my window at night. Found my Happy place!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOMyUi7Ims9F8vgiwDIPlz5G39X331-HvXzOMAE=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891eb0efdf9451:0x80bde2ef224eb349"}
{"user_id": "101414585053369036998", "name": "beth goodwin", "time": 1541601388716, "rating": 5.0, "text": "Skyline Village is a beautiful facility!! And has a wonderful-outgoing-caring staff!! The residents are so happy and you can tell how much they love living there.. The building is decorated so nicely and super clean.. I have visiting twice now and I feel like I have made long lasting friendships with the employees and specially the residents.. If your looking for a place for your love ones, I highly recommend Skyline Village to be one of your choices to check in to..", "pics": null, "resp": null, "gmap_id": "0x88891eb0efdf9451:0x80bde2ef224eb349"}
{"user_id": "101848784680937307831", "name": "Kim hammonds", "time": 1560653077129, "rating": 5.0, "text": "I have experienced nothing but joyous, structured, comradory here. I would even categorize,  living at Skyline as excitingly smooth. I always feel  safe, not belittled, and   loved . I would, do recommend, making this a new, permanent choice of residence, for you or a loved one .\nKim H.", "pics": null, "resp": null, "gmap_id": "0x88891eb0efdf9451:0x80bde2ef224eb349"}
{"user_id": "107984674827292416494", "name": "Ana Cristina Reaves", "time": 1553269206420, "rating": 5.0, "text": "I walked in (unannounced) to tour this senior living community in Homewood and I was pleasantly surprised at how nice everything was when I walked in! Great lighting, atmosphere, clean, and it was nice to see some of the people who lived there mingling and welcoming me in when I got there.", "pics": null, "resp": null, "gmap_id": "0x88891eb0efdf9451:0x80bde2ef224eb349"}
{"user_id": "113373769725349142471", "name": "James “Jay” Casey", "time": 1520558318266, "rating": 5.0, "text": "Hey if your retired, elderly, or somewhat  unable to live safely by yourself. This could be the place for you.", "pics": null, "resp": null, "gmap_id": "0x88891eb0efdf9451:0x80bde2ef224eb349"}
{"user_id": "115396436519536424790", "name": "Super Sammy", "time": 1514508818512, "rating": 5.0, "text": "Its an ok place", "pics": null, "resp": null, "gmap_id": "0x88891eb0efdf9451:0x80bde2ef224eb349"}
{"user_id": "109053772081505907477", "name": "Carole Sickman", "time": 1613434389243, "rating": 5.0, "text": "I have been very happy at University Oaks. For some time, another resident and I were a couple. I do not regret this, although he needed a professional caregiver,  and I am a friend but not a caregiver. Now that he has moved and is receiving the care he needs, I have resumed some of the activities I enjoy and am enjoying my life here. Of course, we are all self-isolated due to another outbreak of  Covid.", "pics": null, "resp": null, "gmap_id": "0x889a4d29e0551677:0x2fcfc279d0d1aaca"}
{"user_id": "102951740252109278260", "name": "Kerry Bates", "time": 1618247419060, "rating": 4.0, "text": "Trying to fine a apartment", "pics": null, "resp": null, "gmap_id": "0x889a4d29e0551677:0x2fcfc279d0d1aaca"}
{"user_id": "105970180903940619541", "name": "Annetta Fortin", "time": 1583896806007, "rating": 5.0, "text": "Great staff Jennifer Kathryn Tiara Chef Doris all were warm and wonderful.", "pics": null, "resp": {"time": 1591161458025, "text": "Hello! Thank you for sharing your great experience at University Oaks. We pride ourselves in having friendly and helpful staff, so your positive feedback is appreciated."}, "gmap_id": "0x889a4d29e0551677:0x2fcfc279d0d1aaca"}
{"user_id": "104783576483738851637", "name": "Teddee Jordan", "time": 1495910584696, "rating": 4.0, "text": "My mom lives here. The place has a great staff and really makes the effort for activities and events on site. For an affordable rate she has her apartment, utilities covered, dining included with wait staff (not like a cafeteria), room cleaned weekly including her linens, plus more. It's a great retirement community at a great price.", "pics": null, "resp": null, "gmap_id": "0x889a4d29e0551677:0x2fcfc279d0d1aaca"}
{"user_id": "109491285764936775541", "name": "Dale Heppe", "time": 1582574254276, "rating": 5.0, "text": "Nice staff and all the residents seemed happy.", "pics": null, "resp": null, "gmap_id": "0x889a4d29e0551677:0x2fcfc279d0d1aaca"}
{"user_id": "106860738882323157820", "name": "Jay Carter", "time": 1584633630232, "rating": 5.0, "text": "My grandma lives there and she loves it", "pics": null, "resp": {"time": 1589991611121, "text": "Hi Jay, thank you for the 5-star review! Our goal is to have happy residents and family members, so your feedback is very important to us."}, "gmap_id": "0x889a4d29e0551677:0x2fcfc279d0d1aaca"}
{"user_id": "101109584038009505936", "name": "Jacqueline E", "time": 1583026907337, "rating": 5.0, "text": "I Love the friendly people.", "pics": null, "resp": {"time": 1595008706006, "text": "Hi Jacqueline, thank you for leaving a 5-star review for our community. Holiday Retirement strives to be a leader in independent living in the Mobile, AL area and we appreciate your positive feedback about our retirement community."}, "gmap_id": "0x889a4d29e0551677:0x2fcfc279d0d1aaca"}
{"user_id": "100587960177704174746", "name": "Amanda Slater", "time": 1550501712814, "rating": 5.0, "text": "Very nice place the staff is very friendly and helpful", "pics": null, "resp": null, "gmap_id": "0x889a4d29e0551677:0x2fcfc279d0d1aaca"}
{"user_id": "113949459585972791531", "name": "Suzanne Shaddix", "time": 1511487399377, "rating": 5.0, "text": "Very nice facility and friendly, helpful staff!", "pics": null, "resp": null, "gmap_id": "0x889a4d29e0551677:0x2fcfc279d0d1aaca"}
{"user_id": "102064417401595191878", "name": "Brandy Hicks", "time": 1503139889209, "rating": 5.0, "text": "Good place to live and work", "pics": null, "resp": null, "gmap_id": "0x889a4d29e0551677:0x2fcfc279d0d1aaca"}
{"user_id": "102806665749781507066", "name": "Derek Tucker", "time": 1540003676196, "rating": 5.0, "text": "Great Facility and staff", "pics": null, "resp": null, "gmap_id": "0x889a4d29e0551677:0x2fcfc279d0d1aaca"}
{"user_id": "112780936634002886837", "name": "Carl Nichols", "time": 1563244813825, "rating": 5.0, "text": "Nice people", "pics": null, "resp": null, "gmap_id": "0x889a4d29e0551677:0x2fcfc279d0d1aaca"}
{"user_id": "106201547384270947485", "name": "Stephanie Kennedy", "time": 1580352987445, "rating": 4.0, "text": "Clean and friendly", "pics": null, "resp": null, "gmap_id": "0x889a4d29e0551677:0x2fcfc279d0d1aaca"}
{"user_id": "102243688199585538714", "name": "Ramonalesa Fifth", "time": 1616178508374, "rating": 5.0, "text": "I love this place I use to live here and I should have stayed here looking for a good place to go and camp with a view check it out one of the best owners you will ever meet a beautiful caring soul", "pics": null, "resp": null, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "109168962694955633266", "name": "lydia lee", "time": 1551207256102, "rating": 3.0, "text": "Very nice place. It has a nice family feel to it.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPTRd0kFivJSt2uzS8A1R38vI5Yg9klaeNvrP0P=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOMQBvcp1TRAimWhYSWR4JKyCvtI_NdpgsAhoBg=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOKtrzoxyvuulnZOmqA0CdIK7e0le3VYTKYRGfL=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "104072022121275447786", "name": "Crystal Madru", "time": 1623751193791, "rating": 5.0, "text": "Great place to relax and unwind!", "pics": null, "resp": null, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "111506625377798742913", "name": "KJ Aubrey", "time": 1596340623251, "rating": 1.0, "text": "The owner was friendly over the phone at first, but I feel that she could have been more up front about the nature of her place. That would have saved us a wasted 23 mile trip both ways. Waterloo is a beautiful place, but I would rather stay on the free TVA land than at this so-called campground. The campground is actually a trailer park with some spots for camping. We stay in many campgrounds, some better than others, but this is the first time we have driven through a campground and left. I could not even find the camp office to begin with and everybody at the trailer park was staring us down when we drove through.\n\nWhen I couldn't find the office, I called the owner back to tell her we had changed our minds. She did not answer her phone. I got a phone call later on from a different number and it was the owner. I let her know that her park was not what we expected and that we had changed our minds. She got an attitude with me and said, \"Thanks for letting me know. I waited for you for over an hour.\" I then informed her that I had tried to call and she didn't answer. I did not bother to mention that she wasted an hour of my time and the gas that I used to drive to her disappointment of a trailer park that she is trying to pass off as a campground. If you do decide to camp in Waterloo, I would suggest that you turn right on the road before you cross the bridge into town and stay on the TVA land. It is well maintained, peaceful and it is free.", "pics": null, "resp": {"time": 1596388937393, "text": "I am sorry that our campground was not what you expected. Our property is 2 businesses, a small campground on the water with bathhouse, boat launch, fishing dock. The main portion are Lake lots that we lease yearly for vacation sites. It's not unusual for people to turn in the wrong drive; I keep meaning to get new signs but since my husband died in March I've been trying to juggle the whole thing alone. After we spoke, I did see that you had called the office number, which is supposed to be transferred to my cell phone. So I called you at 6:10 and we both missed each other. I apologize for my shortness, I have no excuse for that except that 14 hour days, 7 days a week sometimes gets me overwhelmed.   I'm usually pretty nice.  Our campground is usually not full in the fall, and the weather is perfect for camping. If you ever decide to reconsider camping with electric, water , and hot showers, I would be glad to make up to you your \"wasted 23 mile round trip\". Thank you for your review."}, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "111580044071031207746", "name": "Michelle McFall", "time": 1548566200904, "rating": 4.0, "text": "Great place for sunsets and sunrise over the TN river. And eagle watching !", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM4XQU-RnNk40g-ish4FgdnH4V6gbfKhZDe3KuT=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "107009208558358647785", "name": "Mary Morrison", "time": 1596397929775, "rating": 5.0, "text": "Been going to this campground for 13 years....it is like family and going home. We camp at many different campgrounds from private to state parks and they all offer different amenities.  At Hart it is shaded, beautiful views of the water, hot showers and friendly people...the owner treats everyone like family...we love Harts", "pics": null, "resp": {"time": 1596406455767, "text": "You are family! Thank you!"}, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "116395176407479116374", "name": "RV Mobile Repair, LLC", "time": 1572718148990, "rating": 5.0, "text": "A beautiful place to camp along the Tennessee River. Everyone seems really friendly there.  If you're there and you need some RV work call662 me306 at0937", "pics": null, "resp": {"time": 1583441164687, "text": "Thank You!"}, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "116497042075129356365", "name": "Lee Hemming", "time": 1552742282552, "rating": 2.0, "text": "We were greeted by the very helpful and friendly owner. The views are beautiful, however with the description and great reviews, we expected a little more. This is more like a rustic fishing camp. It was recommended that we not use the coffee maker and the microwave at the same time. Yikes! 30 amp service is old. Picnic tables need help. Grass sites. Also there was a dog roaming in the park that was unfriendly, so we didn't feel comfortable having ours out and about. Paid $17 for the night, a fair price, probably. With a few upgrades, this could really be a hidden gem. Grocery and dining not close, so bring what you need.", "pics": null, "resp": {"time": 1552757632542, "text": "Thank you for staying with us, Mr. Hemming. Your review is pretty accurate, upgrading our electric and some cosmetic work on the tables etc have been in our plans. We actually met with the Utility Company last year , and are still waiting on their approval of the plans . The campground sites were built in the 1970's, and RV requirements have definitely changed since then. We do have some 50amp service, I'm sorry I did not show you those sites. I hope we will be able to get to work on that soon, and that when we do, you will come see us if you ever swing south again!"}, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "106657943049957080985", "name": "Fred Pearson", "time": 1547833590304, "rating": 5.0, "text": "The most beautiful location,  and the owners and the friendliest people you would ever meet anywhere.", "pics": null, "resp": {"time": 1583441218845, "text": "Thanks Fred and Darlene!"}, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "101108458958246713864", "name": "Rich Singh", "time": 1505543727621, "rating": 5.0, "text": "Hart Park is the most wonderful place on Earth. I want to live there, the Hart's are the nicest people and it's a wonderful place to stay visit at once .", "pics": null, "resp": {"time": 1505603420575, "text": "Thank you, Richard!! Come Back Soon - we miss you!"}, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "112044836098910936961", "name": "Sheila Gilbert", "time": 1527211783386, "rating": 5.0, "text": "Considering a purchase of a place here, it's looking like it's going to happen! I love the idea of having a waterfront summer place again.", "pics": null, "resp": {"time": 1527213688005, "text": "Thank you Sheila! We hope you and Rick decide to have your vacation home with us!"}, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "103276936838777509212", "name": "Ricky Franks", "time": 1537204044561, "rating": 3.0, "text": "Great place for a family fishing and camping trip.", "pics": null, "resp": {"time": 1537288563048, "text": "Thank You! Hope to see you again soon!"}, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "100929038730606830551", "name": "Cricket Hanback", "time": 1552663635354, "rating": 3.0, "text": "Great camping on lake in WATERLOO", "pics": null, "resp": {"time": 1552757066958, "text": "Thank you!"}, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "104470303809770742935", "name": "Ramona Fifth", "time": 1517187524722, "rating": 5.0, "text": "I use to live here love being near the water I miss it.", "pics": null, "resp": null, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "106853335721575062153", "name": "Carol Diane Poole", "time": 1534906501273, "rating": 3.0, "text": "Its a pretty place", "pics": null, "resp": null, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "109867373327648303697", "name": "Donna Robbins", "time": 1541541111726, "rating": 5.0, "text": "Peaceful on river", "pics": null, "resp": null, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "115309460698403558002", "name": "Kirt Daniel", "time": 1561778651390, "rating": 4.0, "text": "Beautiful", "pics": null, "resp": null, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "115787910258258649224", "name": "Tammy Woods", "time": 1478556078765, "rating": 2.0, "text": "Not taken care of.", "pics": null, "resp": {"time": 1478563869440, "text": "I'm so sorry you found us lacking, Ms. Woods. When did you camp with us? We try to maintain our Campground  to please all of our campers.  I hope you will let us know when you camp with us again and perhaps we can go over your concerns and make your stay more enjoyable! Thank you for your input."}, "gmap_id": "0x887d0c2fa98a57d3:0x48d360444c803bb7"}
{"user_id": "113188465781455096354", "name": "Shirley Vickery", "time": 1492103229643, "rating": 5.0, "text": "My Mom will be moving in to Regency Pointe in a few weeks and our entire family has been so happy with the experience.  We have been on the waiting list for several months so Stephanie has shown the facility multiple times to different groups of family members always with a smile.\n\nWe visited every available establishment for senior living in the Birmingham area and were about to give up when Mom found her new home.  We look forward to a new beginning for her.", "pics": null, "resp": null, "gmap_id": "0x888a3a36119a8c91:0x5f0e5217e6cdfef1"}
{"user_id": "110136585397199108676", "name": "Derriel Anderson", "time": 1521868085142, "rating": 5.0, "text": "Have been moving tenants in and out since Regency Pointe since it first opened! Gr8 Staff and cleaning crew, and maintenance, Always really cheerfull employees!  ***** star rating!!!", "pics": null, "resp": null, "gmap_id": "0x888a3a36119a8c91:0x5f0e5217e6cdfef1"}
{"user_id": "103689486983816871863", "name": "Jason Morgan", "time": 1483845061538, "rating": 5.0, "text": "This is a real nice place. If you can pay it this is where you want to be in your golden years.", "pics": null, "resp": null, "gmap_id": "0x888a3a36119a8c91:0x5f0e5217e6cdfef1"}
{"user_id": "108195479041483732598", "name": "Millard Norman", "time": 1618086358602, "rating": 5.0, "text": "Love it here at Eastdale Estates.  The people who live here are wonderful and the staff is very friendly and helpful.  I definitely recommend Eastdale as a excellent place to live.", "pics": null, "resp": null, "gmap_id": "0x888c2bdf29dac9d3:0x88d812a340576de8"}
{"user_id": "102606440145855295601", "name": "Allison Sansom", "time": 1595648940854, "rating": 5.0, "text": "A wonderful place! Excellent experience from my first phone call! My dad was treated like family from the moment we walked in. Very professional. Very clean. The best in Montgomery!", "pics": null, "resp": null, "gmap_id": "0x888c2bdf29dac9d3:0x88d812a340576de8"}
{"user_id": "115796005278008801005", "name": "Jurita Hunter", "time": 1563834988608, "rating": 5.0, "text": "The only place I would put my mom to live. The facility is very nice and well maintained. I absolutely love the new managers at Eastdale Estates they are awesome!!", "pics": null, "resp": null, "gmap_id": "0x888c2bdf29dac9d3:0x88d812a340576de8"}
{"user_id": "101122099862591740962", "name": "Maxine Rhodes", "time": 1565721878764, "rating": 5.0, "text": "Nice place to place your love ones.", "pics": null, "resp": null, "gmap_id": "0x888c2bdf29dac9d3:0x88d812a340576de8"}
{"user_id": "117400087238440628558", "name": "RenatraB Female", "time": 1555816572485, "rating": 1.0, "text": "Managers have the nastiest attitudes and not frienly at all. And are very racists to people of color. And will lie and take clients from workers that will not go alone with their lies. And will treat ur loved one like a dog", "pics": null, "resp": {"time": 1556829849729, "text": "Hello Renatra, we are sorry for any unpleasant interaction you may have experienced at Eastdale Estates. We pride ourselves on having a professional and helpful team. Your feedback has been shared with local and regional management teams. We hope you are willing to give us another chance. Please reach out to us at (334) 260-8911 so we can work towards a resolution."}, "gmap_id": "0x888c2bdf29dac9d3:0x88d812a340576de8"}
{"user_id": "103258875278071261725", "name": "Kim Bailey", "time": 1519836137732, "rating": 5.0, "text": "My mom has moved here. She's been here about 6 months. She loves her apt. as it is very spacious (her particular apt. unit. Apt. sizes vary according to needs) as well as a great floor plan. Residents use their own furniture, ect. The facility will provide sheets, towels and toilet tissue. The facility is very nice as are the grounds. It is 3 stories. The dining area is on the 2nd and is very nice and they have a pool table on the 3rd floor. The residents are provided with menus and their orders are taken and served like in a restaurant. I am extremely pleased with MANAGEMENT, HOUSEKEEPING,💪🏊 ACTIVITY DIRECTOR and the🍌🍌🍞🍅🍗DIETARY STAFF & SERVERS. I guess the only thing slightly negative would be the meals and quantity of food you receive. However, if eating in the dining room, you can ask for seconds or to go box if enough food is left after everyone has been served. 2 👍👍 up! Also, they have a beauty shop💇and pets are allowed 🐩🐕🐱.  I hope this information is helpful!!", "pics": null, "resp": {"time": 1519921460364, "text": "Hi Kim! Thank you for leaving us such a great review of Eastdale Estates. We are glad to hear your mom is living with us and absolutely loving it! We think all of our residents and staff are amazing too. Please let us know if there is anything we can help you with. We hope to see you again soon!"}, "gmap_id": "0x888c2bdf29dac9d3:0x88d812a340576de8"}
{"user_id": "104582136229363800327", "name": "B. Morgan", "time": 1562858094183, "rating": 4.0, "text": "Very nice place to live.", "pics": null, "resp": null, "gmap_id": "0x888c2bdf29dac9d3:0x88d812a340576de8"}
{"user_id": "112818613472862074400", "name": "Keisha Graves", "time": 1563847144199, "rating": 5.0, "text": "Very kind workers...thanks to new management.", "pics": null, "resp": null, "gmap_id": "0x888c2bdf29dac9d3:0x88d812a340576de8"}
{"user_id": "115335962737876170418", "name": "Lynne Christopher", "time": 1495616797092, "rating": 4.0, "text": "Beautifully decorated, staff very friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x888c2bdf29dac9d3:0x88d812a340576de8"}
{"user_id": "101571253640948230491", "name": "Suzanne Rhodes", "time": 1565863034694, "rating": 1.0, "text": "The food is not very good", "pics": null, "resp": {"time": 1578685932604, "text": "Hi Suzanne, thank you for taking the time to rate our community. We regret to see that you were not satisfied with your dining experience at Eastdale Estates. Our community takes great pride in preparing nutritious and delicious offerings for all of our residents. Our menu does change daily and you are always welcome to come back and see if you can find something better on the menu to suit your taste. Thank you"}, "gmap_id": "0x888c2bdf29dac9d3:0x88d812a340576de8"}
{"user_id": "117447780986102570549", "name": "Nita Pearson", "time": 1528280990068, "rating": 1.0, "text": "👎", "pics": null, "resp": {"time": 1528382204873, "text": "Hi Nita, thank you for leaving us feedback. We are disappointed to hear that your experience was not a positive one. Please reach out to us at (334) 260-8911 when you can so we can address this situation directly. Thank you and have a great day."}, "gmap_id": "0x888c2bdf29dac9d3:0x88d812a340576de8"}
{"user_id": "101663472107742715507", "name": "Elizabeth Marshall", "time": 1508979092032, "rating": 1.0, "text": "Very disrespectful staff unprofessional", "pics": null, "resp": null, "gmap_id": "0x888c2bdf29dac9d3:0x88d812a340576de8"}
{"user_id": "113531309991903119726", "name": "Ellen Roberts", "time": 1619028028044, "rating": 5.0, "text": "Very beautiful and clean on the inside and a very delicious lunch", "pics": null, "resp": {"time": 1619105386633, "text": "Dear Ellen, thanks for your kind words and the 5 star rating of Westminster Village! It means the world to us! Have a great day!"}, "gmap_id": "0x889a431445d0e76d:0x39eb1c05dbdc6168"}
{"user_id": "106450562798783199490", "name": "Valerie Williams", "time": 1596002849348, "rating": 2.0, "text": "My family member, who is deaf and has dementia, has been in the nursing home for almost two years.  Until the \"virus isolation\", I visited every day.  The facility appears to meet basic regulatory standards.  However, marketing materials promise \"excellent\" care in a \"home like\" environment.  A full time administrator was hired only when the recent \"virus isolation\" started.  And that administrator is temporary.  Excellence cannot exist in a leadership vacuum.  I have had to work very, very hard to advocate for my family member.  During \"virus isolation\", I have had to work even harder to be provided communication that should have been forthcoming.  Visits through the window, which were available in other facilities since April, were not available here until June.  Time and space do not permit me to enumerate the numerous struggles I have had.  Two stars  are not given because I think  the place is substandard.  The two-star rating is because  I was led to expect home-like excellence, but I have been forced to accept that those are just words in ads.  It seems the actual goal is to be \"good 'nuff\", and to expect more is considered unreasonable.  Dealing with this place is exhausting and depressing. I spent the time to write this review at the specific request of \"the owner\". (see below)", "pics": null, "resp": {"time": 1595956122071, "text": "Valerie, we are disappointed to see your low star rating. If you could provide more information to us, we would be more than happy to try and make your experience a more positive one."}, "gmap_id": "0x889a431445d0e76d:0x39eb1c05dbdc6168"}
{"user_id": "117629648828950695367", "name": "Mari Emanuel", "time": 1605145216157, "rating": 5.0, "text": "Excellent extravagant seniors retirement home for a lifetime.  Please make an appointment to visit.", "pics": null, "resp": {"time": 1605537994775, "text": "Mari, thank you for your comments and 5 star rating of Westminster Village! We truly appreciate it you taking the time to leave this review. Have a great day!"}, "gmap_id": "0x889a431445d0e76d:0x39eb1c05dbdc6168"}
{"user_id": "112873086008729381704", "name": "William McLean", "time": 1603126082098, "rating": 5.0, "text": "We live here among longtime and many newer friends... ACTS continues to guide and contribute to our life and surroundings!!!", "pics": null, "resp": {"time": 1603201229974, "text": "William, thanks for taking the time to leave such a wonderful review of Westminster Village. It is our pleasure to serve you!"}, "gmap_id": "0x889a431445d0e76d:0x39eb1c05dbdc6168"}
{"user_id": "103726790404175695828", "name": "Marguerite Soper", "time": 1567261816603, "rating": 5.0, "text": "My husband and I moved to Westminster a little over a year ago.  We absolutely love living here.  If I had to pick one benefit of living here, it would be that we have peace of mind that our living arrangements will always be in the same building, no matter our needs.  And the best part is that our monthly fee will always be affordable.  We are so happy that we made this decision before we \"needed\" to.  We are enjoying our newfound freedom to do the things we have always wanted to do but didn't have the time.  In addition, when Westminster is threatened by hurricanes or potential disasters the larger Acts community kicks in for added security.\nThe following is an example of just one of the communication we received during Hurricane Dorian:\n\nUPDATE (Aug. 31, 10 a.m.): We continue monitoring and preparing for Hurricane Dorian and diligently following our comprehensive preparation plans. Acts corporate staff remains intimately involved with these preparations and corporate representatives have been strategically distributed to each community to provide any additional assistance needed. In addition, rapid response teams are on standby in other Acts regions, ready to respond and assist if needed. Communication is an integral part of our overall preparedness plans and we are committed to keeping everyone fully informed of our efforts to maintain a safe environment. Our next update will be at approximately 2 p.m.", "pics": null, "resp": {"time": 1567611902083, "text": "Marguerite Soper, thank you for your kind words and this wonderful review of Westminster Village!"}, "gmap_id": "0x889a431445d0e76d:0x39eb1c05dbdc6168"}
{"user_id": "102689606282059165145", "name": "Brandon Ford", "time": 1573792603983, "rating": 5.0, "text": "Very nice retirement and assisted living community all in one. I have family here and every trip I have visited the people that live there and the staff are so friendly and accommodating. They treat visitors like they live there.", "pics": null, "resp": {"time": 1574089137578, "text": "Brandon, we appreciate your positive review about Westminster Village."}, "gmap_id": "0x889a431445d0e76d:0x39eb1c05dbdc6168"}
{"user_id": "106815021251086202453", "name": "juju pell", "time": 1609986203627, "rating": 5.0, "text": "Great atmosphere to  work", "pics": null, "resp": {"time": 1610568279818, "text": "JuJu, thanks for your 5 star review of Westminster Village! Have a wonderful day!"}, "gmap_id": "0x889a431445d0e76d:0x39eb1c05dbdc6168"}
{"user_id": "105695341009417580673", "name": "David Copeland", "time": 1543977400014, "rating": 5.0, "text": "Both of my parents moved here and the place is extremely wonderful.  The staff is helpful.  They were purchased by ACTS this past year which has several other locations across the country.\n\nThe food is very good as well. Is a gated community with a security person on staff 24 hours a day.", "pics": null, "resp": {"time": 1552334617193, "text": "Hi David Copeland, we are very happy to have provided you with such a positive experience! Your recommendation means so much to us and we're so happy to have earned it. Thank you again for taking the time to write this review."}, "gmap_id": "0x889a431445d0e76d:0x39eb1c05dbdc6168"}
{"user_id": "104681767291948094155", "name": "Eleene Raley", "time": 1502161436838, "rating": 5.0, "text": "Westminster Village is a wonderful place to live and work . The beauty of the place is outstanding. The residents who live here  realize when they come here they  have found their home.  I cannot say enough about how outstanding this Retirement Community and Nursing facality is. No I don't  live here I worked here for 18 years. Retired. My dream is to come back to work here one day.   I miss each and every Resident.", "pics": null, "resp": null, "gmap_id": "0x889a431445d0e76d:0x39eb1c05dbdc6168"}
{"user_id": "105971053005222382437", "name": "Linda Loftin", "time": 1563677291267, "rating": 3.0, "text": "Beautiful place but SUPER EXPENSIVE.", "pics": null, "resp": null, "gmap_id": "0x889a431445d0e76d:0x39eb1c05dbdc6168"}
{"user_id": "118162148206786564250", "name": "Vanessa", "time": 1486527708473, "rating": 5.0, "text": "This is a beautiful place to live and everyone is friendly. The dining facilities are always clean, bright and full of delicious food! The waiting list is long, but anyone I talked to told me it was worth the wait. Plenty of activities to do with family and friends, plus a putting green, gardens all around and healthcare on site!", "pics": null, "resp": {"time": 1490193857504, "text": "Thank you for the great review, Vanessa!  The Westminster Village lifestyle gives you the opportunity to meet new people and establish lifelong friendships all while enjoying social engagements and opportunities to exercise and explore your interests at your own pace."}, "gmap_id": "0x889a431445d0e76d:0x39eb1c05dbdc6168"}
{"user_id": "108161873511149103000", "name": "Thaddeus Lee", "time": 1551452478100, "rating": 5.0, "text": "Visited Westminster for a work outing and I have to say it always is clean and the staff is always friendly and the residents seem to always have something to do.", "pics": null, "resp": {"time": 1552333670086, "text": "We appreciate your positive review about your recent experience with us!"}, "gmap_id": "0x889a431445d0e76d:0x39eb1c05dbdc6168"}
{"user_id": "104749444039761990123", "name": "chuck farris", "time": 1561303577232, "rating": 5.0, "text": "Best residents in the world!", "pics": null, "resp": null, "gmap_id": "0x889a431445d0e76d:0x39eb1c05dbdc6168"}
{"user_id": "109513251297393219833", "name": "Michael Jackson", "time": 1530799401037, "rating": 5.0, "text": "Now this is living, when I become a senior I want to live like that. Excellent service.", "pics": null, "resp": null, "gmap_id": "0x889a431445d0e76d:0x39eb1c05dbdc6168"}
{"user_id": "101923950447645655511", "name": "Aladdin Demps", "time": 1572399593579, "rating": 5.0, "text": "Great place", "pics": null, "resp": null, "gmap_id": "0x889a431445d0e76d:0x39eb1c05dbdc6168"}
{"user_id": "103246143089647318058", "name": "Susan Fonger", "time": 1549603845312, "rating": 5.0, "text": "I hope I can afford this place when I need it.", "pics": null, "resp": {"time": 1552333834436, "text": "If you have any questions about pricing, please give us a call. We're always happy to help!"}, "gmap_id": "0x889a431445d0e76d:0x39eb1c05dbdc6168"}
{"user_id": "100554886162703408306", "name": "Jacob Haase", "time": 1543180661310, "rating": 4.0, "text": "Great retirement", "pics": null, "resp": {"time": 1552334694411, "text": "We appreciate your positive review about your recent experience with us!"}, "gmap_id": "0x889a431445d0e76d:0x39eb1c05dbdc6168"}
{"user_id": "115926104777923312048", "name": "Pam Sloan", "time": 1534472176328, "rating": 5.0, "text": "Mom was there 6 years and loved it! It is great for those who are independent and want a safe but active community.", "pics": null, "resp": null, "gmap_id": "0x8888a7f89cfd6d4b:0xff64383763bec1c7"}
{"user_id": "114227220471893669600", "name": "Carrie Brighton", "time": 1557769989192, "rating": 5.0, "text": "They help take great care of dad", "pics": null, "resp": null, "gmap_id": "0x8888a7f89cfd6d4b:0xff64383763bec1c7"}
{"user_id": "111785872727961500910", "name": "Briley’s World", "time": 1505754329866, "rating": 4.0, "text": "Not enough actives.", "pics": null, "resp": null, "gmap_id": "0x8888a7f89cfd6d4b:0xff64383763bec1c7"}
{"user_id": "116327062689188864275", "name": "Michael Schmidt", "time": 1599773722306, "rating": 5.0, "text": "My Mom was a resident of memory care at The Blake for several years before her passing  in July 2020. Though initially it was tough transitioning her from her home to a care facility (she was a strong-willed even WITH  dementia!), she adjusted thanks to the love and care she received. I never regretted my decision. Kudos the Director John Michael, the management team and the entire group of caregivers. I never worried about Mom's safety or well-being while she lived at The Blake. Thank you for making her part of the family and for my peace-of-mind!", "pics": null, "resp": {"time": 1600102521159, "text": "Michael, thank you so much for leaving this wonderful review and sharing your experience with our community. It was such an honor and privilege to have your mother as one of our residents and as part of the family here. We will pass along your kind words to our team, and always feel free to reach out if you need anything in the future. Take care!"}, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
{"user_id": "112982996826709383060", "name": "Claudia Daniel", "time": 1599875148108, "rating": 5.0, "text": "Our mom arrived at the Blake at Malbis pretty much kicking and screaming. Much different story now, she is happy,  calm,  and grateful that she doesn’t have to worry about her house upkeep anymore.\nHer major adjustment took about 3 to 4 weeks.\nJohn Micheal, the executive director is almost always able to talk when I have a question, so is the rest of the staff, they have all been so helpful and kind.\nBonnie and the other ladies who answer the phone are knowledgeable, helpful and friendly.\nThe nursing staff are the best by far, I consider them like friends and so does my wonderful mom.\nMom loves the food and keeps saying her pants are to tight now!\nThe activities director, Petra, always has something going on, right now she is putting together a grandparents day treat for the residents.\nJohn Michael has kept the family current with all updates about the COVID-19. The Blake is very cautious about opening up to soon, for this I’m extremely grateful. It’s a horrible way for any loved one to pass. They have in my opinion gone out of there way to try ways for us to see our mom.\nI chose The Blake for our mom 1 year ago because it felt like a home when I went on my first tour. My opinion has not changed.\nWe dreaded putting mom in a home, but we have been so happy, and so has she, because she is in a place that is like a home.", "pics": null, "resp": {"time": 1600103346861, "text": "Thank you so much for sharing your experience with our community, Claudia! Your mother is a joy to have as our resident and we most certainly appreciate your involvement as well. We're always striving to provide the best care possible for our residents and reviews like this are so great to see. We will definitely be passing along your kind words to our team."}, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
{"user_id": "105070145967308205286", "name": "Jason Smith", "time": 1623080173053, "rating": 1.0, "text": "Our family had a terrible experience. I find the facility unfit to care for the elderly.", "pics": null, "resp": {"time": 1623170896413, "text": "Hi Jason,\nWe want to take the chance to apologize for the negative experience you've had with our community. We'd really like to know more about your situation in order for us to improve. Please reach out to  Executive Director, Tammy Robinson, at tammy.robinson@blakeliving.com to discuss matters further."}, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
{"user_id": "104722835199709268956", "name": "Janet Norman", "time": 1602096283857, "rating": 5.0, "text": "My mom suffered from dementia and short term memory loss and I tried having her live with me.  It was clear I could not provide her the care she needed.  The staff at The Blake - Malbis (memory care) loved and cared for my mother like I never expected.  Mom went on outings, participated in activities.  I visited her all times of the day throughout the week and found her well cared for and engaged in activities.  Turning over your parent to others for care is a very difficult decision but at The Blake - Malbis she was under the best care you could ask for.  The staff made a very difficult situation much easier for me and my brother.  Mom was better looked after than I was capable of doing.  Thank you everybody, especially John, Petra, and Rachel.", "pics": null, "resp": {"time": 1602164653137, "text": "Janet, we really appreciate you leaving this thoughtful review on our community. It truly means a lot to us, and we'll make sure to pass your review on for our staff to see. Taking the best possible care of our residents and offering support to family members are our top priorities, and reviews like yours reassure us we're on the correct path."}, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
{"user_id": "102410317476924001484", "name": "Rhonda Winder", "time": 1606874516652, "rating": 1.0, "text": "While our family has an overall great impression with The Blake at Malbis, we do have an experience with them that isn’t so great. They can very easily rectify matters, but so far they refuse to do so. It has to do with the beauty salon.\nIf you’re loved one wishes to get their hair done they may make use of the in-house salon. There is a form that the person responsible to pay the salon charges fills out. You may leave a credit card on file and you may opt to just have your card used whenever the resident wishes or be asked if you’re in agreement with your family member having their hair done before being charged. This is so that a family member who is losing their mental acuity doesn’t decide to go get their hair done too often, which was our situation, and we stipulated on the form that we’d like to be contacted first.\nHowever, our card was charged several times with no permission request beforehand. To the tune of approximately $500.00. With our busy life we didn’t catch these charges as they were incurred. Once we did see them, we called and got them stopped.  To their credit, The Blake admitted they were in the wrong. However, it has been over a year of requesting the fraudulent charges be reversed or having a check sent to us. We’ve been in touch with the beauty salon, patient representatives, the facility manager and a regional manager. We’ve allowed each person along the way ample time to make it right, sometimes two months before we call again, but no resolution is ever forthcoming. Now, they’ve stopped taking our calls.\nWe will now pursue this with our credit card company.\nOur family member passed away in May of 2020, so they are no longer a resident. I would hate to think that is the reason we now are not even getting our phone calls answered.\nIf you’re wondering why our family member passed away, it was due to the virus. We were told she was the only one in the whole facility to contract it. A subsequent email from The Blake that was emailed to families of the residents claimed to have zero cases of the virus at The Blake.\nI suppose no place can be 100% above board at all times, but these things concern us.\nPlease don’t misunderstand us. We realize the virus is strange and can effect some and not others. We have no ill feelings in that regard. These things happen. But we would love to be treated as well as we were when she was accepted there.\nWe have no other complaints. The facility was a beautiful and very nice place for seniors.", "pics": null, "resp": {"time": 1607627659872, "text": "Hi Rhonda,\nFirst and foremost, we want to apologize that you've had this unpleasant experience. During this unprecedented time, we have made, and continue to make, it a priority to keep our residents and families as up-to-date as possible with the most accurate and timely information available to us. Additionally, we strive to partner with the best service providers in order to give our residents the highest quality services and amenities possible. We understand you have had a frustrating experience working with our previous stylist provider and we are currently working hard to reach a solution for you. We are grateful to have had the opportunity to care for your mother and we want to thank you for your trust and kind words regarding the care she received as a resident here at The Blake."}, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
{"user_id": "102541788083236430707", "name": "D Joiner", "time": 1601219044267, "rating": 1.0, "text": "I have never written an online review, but the experience we had with this facility warrants my remarks. My mother was a Memory Care resident for 2 months 25 days before removing her from this facility.  Once home she was examined by our physician along with labs received from the Blake.  She had lost approximately 20 lbs, was poorly nourished (per lab work), had a large pressure ulcer on hip (never reported by staff), cellulitis in lower extremity (never reported by staff or wasn’t being treated).  She walked in on admission and was wheelchair bound upon leaving. As I said that is the SHORT LIST of issues we had with this facility.  Don’t be fooled by the\n“nice facility or friendly staff”.  My mother was neglected physically and medically.  I am not just a disgruntled daughter. I worked in critical care for years, served as nurse manager of a critical care unit and a cardiology outpatient clinic.  I know poor care when I see it!!!", "pics": null, "resp": {"time": 1601312298132, "text": "Hi D,\nWe apologize that you’ve had a negative experience with our community. At The Blake, we're committed to offering the best care possible for residents, as well as support for family members. Although it’s never easy to receive reviews like these, we take them very seriously and we'd like to resolve any issues you've had with our level of care. If you'd like to discuss these matters further, please contact our Executive Director, John Michael, at john.michael@blakeliving.com."}, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
{"user_id": "100806825528281228885", "name": "Sam Adams", "time": 1595970680052, "rating": 4.0, "text": "Our only problem with The Blake, is information, few of the staff will give out info. In particular our Dad,(93 yrs.) was admitted during covid 19 and quarantined until negative test result, we were told 2 days to get result, after 5 days we questioned why no result, after a full fay and multiple calls we were then told 3 days in quarantine before test is even performed. Not veryhvery", "pics": null, "resp": {"time": 1599084003454, "text": "Hello Sam,\nWe sincerely apologize for your frustrating experience; we know how stressful a delay in receiving information can be, especially in times like these. Also we want to thank you for your support and patience as we navigate through these unprecedented challenges.  We would like to reach out to see how can better improve this process, so this isn't repeated in the future. Please contact us at (251) 625-6400, so we can discuss this matter further."}, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
{"user_id": "103983899574838410635", "name": "Brad Hinman", "time": 1580843704061, "rating": 5.0, "text": "My Mom has been in several assisted living facilities over the years and this is the best! Highly recommend...", "pics": null, "resp": null, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
{"user_id": "111806280179011817404", "name": "Susan Holmes", "time": 1555170187913, "rating": 1.0, "text": "My Dad lasted a total of 45 hours in their Memory Care facility. During that time he fell 3 times. They said he was physically aggressive and called an ambulance to take him to the hospital. They only way we knew this was - the hospital called for information.  If he became angry, and he might have, it was because he was scared!  However, 2 hours later when the ambulance did arrive, he was asleep in his chair.  He is now in the hospital with pneumonia.  These residents are not safe! Oh! ...and I had left him a gift bag with a variety of items the first day.  We never found it!", "pics": null, "resp": {"time": 1556119173510, "text": "Hello Susan-\nWe would like to sincerely apologize for your experience at our beloved community. As resident care and employee support are our top priorities at the Blake, we take these comments very seriously. John Michael, our Executive Director, would love to speak with you further about your experience. Please call (251) 625-6400 to reach him. Again we appreciate your comments and apologize for the negative experience."}, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
{"user_id": "104444656726440711552", "name": "Natalie Davis", "time": 1501201684152, "rating": 5.0, "text": "Prior to working at The Blake, I worked WITH The Blake. They truly care about the residents and their families. It is a beautiful community, the food is great, and it is a fun place to be. I would most definitely place my family here when the time comes.", "pics": null, "resp": null, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
{"user_id": "108986922367231436901", "name": "Jerre Brisky", "time": 1495836065540, "rating": 5.0, "text": "Wonderful and gorgeous facility.", "pics": null, "resp": null, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
{"user_id": "100097772095906838392", "name": "Crooked Smile", "time": 1462549050499, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x889a69ad42ccf9b1:0xf311f98be7175920"}
