{"user_id": "108725336252994794978", "name": "Adam Harper, Realtor EXP Realty LLC", "time": 1626992432824, "rating": 5.0, "text": "My children went to camp here and they loved the zip line into the lake, among other things. Camp Lee is such a beautiful place.", "pics": null, "resp": null, "gmap_id": "0x888bade956324fcf:0x2db0db9d0d402da2"}
{"user_id": "114026127338128073403", "name": "haley_ig", "time": 1589209063084, "rating": 5.0, "text": "I had an awesome experience coming here with my church. It was literally the best week of my life. Incredible Camp!", "pics": null, "resp": null, "gmap_id": "0x888bade956324fcf:0x2db0db9d0d402da2"}
{"user_id": "112410165597965436394", "name": "Mikey Da youngin", "time": 1589385832180, "rating": 5.0, "text": "best memory ever here when I pulled up a 12 lb bass when I was 10", "pics": null, "resp": {"time": 1589756238022, "text": "That is wonderful!!"}, "gmap_id": "0x888bade956324fcf:0x2db0db9d0d402da2"}
{"user_id": "106366514186525548334", "name": "Ranger Joy Snow", "time": 1547217659464, "rating": 5.0, "text": "My church youth group came here on a retreat when I was a teen-ager. We swam, hiked and  sang songs around a campfire (you know the song I mean) complete with roasted hot dogs and flaming marshmallows. A great weekend and happy memories.", "pics": null, "resp": {"time": 1555086056865, "text": "Joy, Thank you for the comments and we hope to see you and your group back at Camp Lee soon!"}, "gmap_id": "0x888bade956324fcf:0x2db0db9d0d402da2"}
{"user_id": "113787595791665550040", "name": "Merman Gang", "time": 1568572962524, "rating": 4.0, "text": "This us a great place to go with your church especially over the summer around the middle of June, however i did hear some campers say the bunks had head lice in them.", "pics": null, "resp": {"time": 1568571378199, "text": "Please let us know of the situation that you are unhappy about. We will do our best to correct the situation in our mission to serve you."}, "gmap_id": "0x888bade956324fcf:0x2db0db9d0d402da2"}
{"user_id": "112634149558397224878", "name": "Panda Squad gaming", "time": 1522669267345, "rating": 5.0, "text": "Hey this is the best place I ever went to and it just led me farther to the lord and can't what to go again.", "pics": null, "resp": {"time": 1540236074439, "text": "Thank you!  We look forward to serving you and your family in the future."}, "gmap_id": "0x888bade956324fcf:0x2db0db9d0d402da2"}
{"user_id": "116672685640392230156", "name": "Paul H", "time": 1492197087253, "rating": 5.0, "text": "This camp ground is absolutely beautiful. There are Multiple lakes, frisbee golf, volleyball courts and basketball courts.", "pics": null, "resp": null, "gmap_id": "0x888bade956324fcf:0x2db0db9d0d402da2"}
{"user_id": "116290515528805810092", "name": "ricardo hernandez", "time": 1512515802866, "rating": 5.0, "text": "So good place to take your church", "pics": null, "resp": null, "gmap_id": "0x888bade956324fcf:0x2db0db9d0d402da2"}
{"user_id": "104240832598199831752", "name": "Barber UAV", "time": 1619542806878, "rating": 5.0, "text": "Very clean, everything was perfect. It’s a beautiful place and very peaceful. I definitely recommend it!", "pics": null, "resp": {"time": 1619588960685, "text": "Thank you for your nice comments!  We enjoyed having you here and Loved your veggies!! Please come back!"}, "gmap_id": "0x888c8f6b54039bad:0x7d22da12f457b148"}
{"user_id": "111354559022264797838", "name": "Allison Pullen", "time": 1559148933481, "rating": 5.0, "text": "What a beautiful, peaceful, and FUN location!  Being close to Auburn is convenient, but what’s important is that clearly a lot of heart and a lot of money went into the construction of this place! I love the small details like the muffin basket in the morning, and the high quality of everything throughout the farm is fabulous. Louise and her staff are the best!! They take care of your every need and keep you laughing too!  I can’t wait to return and stay in the big house!!", "pics": null, "resp": null, "gmap_id": "0x888c8f6b54039bad:0x7d22da12f457b148"}
{"user_id": "108442244523581804158", "name": "Nancy Meadows", "time": 1569200037493, "rating": 5.0, "text": "I was invited they're by my daughter and son-in-law Saturday night I had a great time beautiful place so peaceful", "pics": null, "resp": null, "gmap_id": "0x8889e1b34f5356cd:0x5ae39c2bdacff3c1"}
{"user_id": "102169523866414342617", "name": "Jody Berryhill", "time": 1622763960699, "rating": 5.0, "text": "Stopped by on return trip from Chattanooga TN with my daughter for zip line tour after discovering on google. Well worth the drive! David and Garrett were awesome, and property was well kept and clean. Will be back soon!", "pics": null, "resp": null, "gmap_id": "0x88620daeb00a1a71:0x883bf936e46cc109"}
{"user_id": "115777609220487297315", "name": "Emily Coker", "time": 1532366276192, "rating": 5.0, "text": "We had our family reunion here this past weekend and it was excellent!  Gorgeous facilities, plenty of space.  The pool was beautiful and spacious.  There is a game room and a theater room.  We stayed in frontier inn, which was nice but I also saw the room in the lodge and they are beautiful as well as spacious.  The scenery is gorgeous and they are building several more activities.  Great place! Highly recommend!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMCZJmL4XTJ_012rJfGCQmxaqjyEYhPntsn5S-O=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88620daeb00a1a71:0x883bf936e46cc109"}
{"user_id": "112268341084030446827", "name": "Richard reinle", "time": 1600798869604, "rating": 5.0, "text": "What an amazing place, there is so much to do and the staff are all so nice, it’s a great place to reconnect with God,\nI would recommend the zip line course so much fun.\n\nThank you Vision Ministries and staff for an rememberable  time!", "pics": null, "resp": null, "gmap_id": "0x88620daeb00a1a71:0x883bf936e46cc109"}
{"user_id": "104942148557753758592", "name": "Joshua Cates", "time": 1590444545532, "rating": 5.0, "text": "This place is BEAUTIFUL! Lots of fun activities and hiking trails.", "pics": null, "resp": null, "gmap_id": "0x88620daeb00a1a71:0x883bf936e46cc109"}
{"user_id": "104309757136876152030", "name": "Joshua Meadows", "time": 1556808216262, "rating": 5.0, "text": "We did our women's retreat here and the response of the ladies was overwhelming. The Lodge was so nice and the staff were amazing! Great facilities! We will be back again for sure.", "pics": null, "resp": null, "gmap_id": "0x88620daeb00a1a71:0x883bf936e46cc109"}
{"user_id": "112038005514475983624", "name": "Cheryl Loehr", "time": 1552361773387, "rating": 5.0, "text": "Beautiful grounds. Great playground for kids. Our church had a wonderful outdoor service here and used the kitchen and dining room for lunch. It was fantastic!", "pics": null, "resp": null, "gmap_id": "0x88620daeb00a1a71:0x883bf936e46cc109"}
{"user_id": "115777566812229617382", "name": "Adam Dyess", "time": 1581210673593, "rating": 4.0, "text": "It's really cool how you're sharing God's blessings", "pics": null, "resp": null, "gmap_id": "0x88620daeb00a1a71:0x883bf936e46cc109"}
{"user_id": "112851647754432521581", "name": "Amanda Francis", "time": 1468814480105, "rating": 5.0, "text": "Beautiful location!  Great for church outings, boy scouts, weddings, or corporate parties!!", "pics": null, "resp": null, "gmap_id": "0x88620daeb00a1a71:0x883bf936e46cc109"}
{"user_id": "117134014240809097710", "name": "Claire Rhinehart", "time": 1622767692655, "rating": 5.0, "text": "My husband and I are thankful we found The Lake House at Camellia Palms for our wedding. From the moment we arrived, we knew this was the perfect place for our dream wedding. Taylor and her staff were so helpful as we planned our wedding from another state during a pandemic. She recommended the best vendors to help us create our dream wedding. The bride's and groom's suites were roomy and the perfect places to get ready. Marrying my best friend beside the lake was the most amazing moment of my life. I highly recommend booking your wedding at The Lake House at Camellia Palms!", "pics": null, "resp": null, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "113077998580008176516", "name": "Studio Sisters", "time": 1603193180245, "rating": 5.0, "text": "We have held several artist retreats and events here. The owners and staff were wonderful to work with and everything was clear. Not only was our hospitality experience flawless, this business and the owner are highly engaged with their downtown's historic downtown revitalization and has a really cool internship program where they are creating jobs for young people in their community. You can expect nothing but a great experience working with Camellia Palms.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNuTNBL_KtLLlaOaimNovEC6sSTK2n5QZak3GE=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNOdtPaoV18lYUPZGkIU8E1RRcRM_RPA77zwTQ=w150-h150-k-no-p"]}], "resp": {"time": 1603283707413, "text": "We appreciate your positive review, it means so much to us! Our team is dedicated to creating positive guest experiences and we are always happy to that our hand-in-hand approach led to a great stay with your artist retreats. We feel that our venue is the perfect place for a quiet, creative, and calm getaway!"}, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "113401839902806160517", "name": "Mark Burch", "time": 1605473298284, "rating": 5.0, "text": "The Lake House team was excellent. They were very efficient in setting up and cleaning up the event. Taylor, the director and coordinator, was extremely helpful and full of advice. She also made it easy for the vendors we hired to do their job well by offering them information they needed concerning the house.  She was a terrific host, and really helped make our experience a memorable one. The house is beautiful, as is the scenery around the house. Hopefully we can go back some day.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNoxaBQy6cYFq5oP1SHCd8XRWKSM4jgSMUfnrez=w150-h150-k-no-p"]}], "resp": {"time": 1605659430334, "text": "Thank you so much for your kind words! We truly enjoyed working with you & Gabbi on every detail of your GORGEOUS wedding! There were so many special details and the vendors you chose were so amazing to work with. We can't get over those fabulous custom honey jars you gave away as party favors! Thank you again for choosing Camellia Palms for your wedding venue."}, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "100168261599667867936", "name": "Katie Smith", "time": 1603205089551, "rating": 5.0, "text": "Kind Staff & Amazing lakeside views!\n\nThe owner, Taylor, & her staff were extremely kind and professional, which made check in super easy and stress-free. Thank you so much for the wonderful stay!\n\nThe house and deck was very clean, I wanted to spend all of my time out on that beautiful back deck, I especially  loved the rocking chairs overlooking the lake.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNSD3LfRegrCTqqzhkZoGBeQ3HsJq0cmWd4glTL=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMtOLQPNIrgf2rzY3srAmIBq6dflsTlwpj1xkPS=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "114919582272686414662", "name": "Lauren Hooper", "time": 1572256358165, "rating": 5.0, "text": "Spending the week here, overlooking the water, creating with friends was one of the best weeks of my life! The house is so beautiful and has so much historic charm. We enjoyed our meals flooded with light from the huge bay windows and had plenty of space for 12 of us to eat together each meal and play games at night in the living room. The event room was perfect for us as we painted each day and had plenty of space to create. Then we were quickly and easily able to walk down to the lake and into downtown to explore the charming local shops. Taylor was so thoughtful and helpful and made sure we had everything we needed to have the best time possible! We even got to meet her pet pig, Chip, who was a huge hit! We cant wait to come back to Camellia Palms and make more memories!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM5EgHvjNlhy20QphW00oVuSh6p_PRoPTk8FgEL=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipONUmrADKPmGxRU7gu1XbaLThTOv52rwq1MtC41=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMJHQUX-k8IanfFNMAnrsYRiZJw7Q1B14v8XlNM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN4zqCc96cByBPRIOsYa9pVp63p-w-2p3DYbpAj=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "113740554382256612870", "name": "Lynn Kluczynski", "time": 1616163833428, "rating": 5.0, "text": "We had a delightful quilt retreat with 8 women. The house is filled with charming decor. The bedrooms were are unique. There were fresh flowers on every mantel. The towels were big and fluffy, the claw foot tubs were awesome. Our work space was preset for us. They provided tables, lights, extension cords, cutting stations with mats, ironing stations with irons, it was perfect. The view of the lake while sewing all day was perfect. We explored local shops and places to eat. A real perk was our breakfast bar prepared for us each morning, spoiling us . The house is large enough that we all had privacy when needed. It was a wonderful experience. A true gem off the beaten path.", "pics": null, "resp": null, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "106732241751836706099", "name": "Theresa Collins-Hill", "time": 1622770502887, "rating": 5.0, "text": "What a beautiful venue!  Looking for your dream wedding experience?   Look no further!   A warm welcome awaits you with truly professional and caring owners.", "pics": null, "resp": null, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "108752709051219571861", "name": "Matthew Leu", "time": 1626992422873, "rating": 1.0, "text": "We found this place on Airbnb about 2 years ago. We were watched by cameras and called on a daily basis about things they didn’t like that we did. It was weird. When we left, we had several additional “cleaning” charges added to our bill. Stay away from Airbnb rentals. They hide behind the women owned and vet owned labels. Neither of which is really true. You’ve been warned.", "pics": null, "resp": {"time": 1626996153293, "text": "Matthew, your review is so far from the truth and misogynistic that it is barely worth responding to but I will try.\nThe truth is that\n1. You have never been a registered guest on our airbnb.  Perhaps you were the spouse of one.\n2. yes we do have cameras pointed ONLY to the outside of the property and that is clearly stated in our listing.\n3. We never once called you during your stay.\n4. The extra cleaning charges were due to the fact that your party treated our historic home like a frat house , leaving food in every room, on the floor, under the beds , and having more people than you were allowed. We have the photos to prove how disgusting this group was while at our home.\n5. We are ,as owners,  both women and one of us has the dd214 to prove veteran status. You met me, and I'm clearly female.\n6. Of the hundreds of guests we've hosted , I'm sure that they could all attest that we are indeed WOMEN !!\n7. My business partner is extremely insulted that you would dare accuse a veteran of lying about their service.  YOU obviously never served  or you would understand how offensive you sound when lying about this.\n8. We are proud to offer our military guests and fellow veterans  a 10% discount."}, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "114979517900278596909", "name": "Brandie McGinnis", "time": 1622766713769, "rating": 5.0, "text": "Cutest place ever. I just love their pink door. Super friendly", "pics": null, "resp": null, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "111354121446419418012", "name": "tye shirley", "time": 1622774082269, "rating": 5.0, "text": "Such a cute place. I love their overall aesthetic. It’s so charming and cozy. You’ll love it!", "pics": null, "resp": null, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "108223801972585559613", "name": "Lillian Jones", "time": 1622771716736, "rating": 5.0, "text": "I love the gorgeous house, incredible ceremony site views, and the landscape is SO unique. There’s so many beautiful things about this wedding venue.", "pics": null, "resp": null, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "116395420265238548117", "name": "McKenzie Newman", "time": 1622826132600, "rating": 5.0, "text": "Such a cute and quaint venue. The owner, Taylor, is so passionate about ensuring an event goes smoothly and incredibly professional.", "pics": null, "resp": null, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "115577224346113151617", "name": "Tracy Englund", "time": 1622773194841, "rating": 5.0, "text": "It's so nice when the owners care as much about their clients as they do their home! Beautiful, five star!", "pics": null, "resp": null, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "108869356018865884711", "name": "Kathy Schrock", "time": 1622772928229, "rating": 5.0, "text": "The Lake House at Camellia Palms is a beautiful place to host your wedding or retreat. Taylor and her staff are top notch professionals.", "pics": null, "resp": null, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "100731520448252572064", "name": "Sandi Scroggins", "time": 1603202652015, "rating": 5.0, "text": "I love this venue and appreciate how accommodating the staff are.  I have attended several events there and have always had a positive experience.  This Lake House is a historic building that is absolutely gorgeous and sits on several acres that overlook Lake Jackson.  Lounging on the back deck looking out on the lake is very relaxing and peaceful.  They also have a hammock which is perfect for a late afternoon snooze.  I highly recommend the Lake House and encourage folks who are looking for a destination get-away, special event or holiday to consider booking here.", "pics": null, "resp": {"time": 1603283620187, "text": "Thank you so much, Sandi, for this kind review. We genuinely appreciate the time you took to write this review about your positive guest experience. Our staff LOVES working with guests and we are always happy to welcome you to Camellia Palms."}, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "103841000011541057014", "name": "Mandmtodd", "time": 1622769669781, "rating": 5.0, "text": "Camellia Palms is a dream come true!  From the lakeside views, to the personalized service, I felt like I was in paradise! Highly Recommend!!!", "pics": null, "resp": null, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "100620178236329259711", "name": "Tabatha Smith", "time": 1603203105541, "rating": 5.0, "text": "I have attended several events at the Lake House, including quilt retreats, family get togethers, yoga, and even a craft fair. I have had wonderful experiences every time and would give Taylor, her staff and the venue 10 stars if I could. They are courteous and attend to your needs. The venue is historic, charming and clean.  The grounds are expansive and overlook the lake. Relax on the large deck out back, Stroll along the lake, walk the downtown area too!\nI love that the venue is non- smoking too and pet free too for those guest that have allergies.\nI can highly recommend this venue and Taylor every time!!!!", "pics": null, "resp": {"time": 1603283487864, "text": "Thank you so much for your kind words. We work very hard to make our guests happy with their stay! We find that when guests understand our venue's unique offerings and the value of  a smoke-free venue, they have a great experience that is peaceful and calming. Thank you and please come again!"}, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "101223140048288391697", "name": "Debbie Ladnier", "time": 1614014733790, "rating": 5.0, "text": "I do not have very good writing skills.  Wonderful and great and fun are not stong enough words. how to say what i experienced. I can't even begin to tell you how much I learned to improve my quilting quilting skills. it was beautiful ,serene, challenging and a word have I haven't used in a long time fun. So thankful to have such a great place to go. It was like my Disney World of quilting.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPY5k5e24gX7umXyDJxDjbyFA0PQHEifVQfSaMm=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "118028862094763541337", "name": "Sarah Hopkins", "time": 1622769799125, "rating": 5.0, "text": "Simply gorgeous venue for a wedding. The staff are lovely and easy to work with.", "pics": null, "resp": null, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "114859355620644814823", "name": "Kelley Penn", "time": 1603206708526, "rating": 5.0, "text": "I love this place! Not only is it gorgeous architecture and decor, I always enjoy my trips.  I've been to several yoga retreats and markets at the Lake House. The Staff works so hard to get as many local products and services involved in her packages.  All the events have been well organized, well planned, very thought out.  I'm more than impressed with Taylor, the director.  She goes above and beyond that any guest has great memories of this historic house.", "pics": null, "resp": null, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "110098583959464554933", "name": "Ricky Lively", "time": 1603153743210, "rating": 1.0, "text": "The wedding being mentioned was my wife and mine. The venue was very beautiful as stated. House has a lot of charm as Taylor her self did. That quickly became different. She is a saleswoman for sure. This venue was not cheap. We were given a contract and was told verbally that a lot things we could do then told I was not telling the truth. Even though I had witnesses. We did have an amazing wedding even though all of this was going on. I do have video and pics of the stalking staff at almost every angle of the wedding. That made it so uncomfortable. Amd being threatened with fines every 30 minutes. That got old real quick. Hope this venue gets new owners soon. They will go under fast at this rate. If looking to get married here please don’t let her charm get you as well from the rip.", "pics": null, "resp": {"time": 1603192821003, "text": "We are so thankful that out of more than 50 events in 2020, all but one wedding event was successful and the couples were wonderful to work with. We appreciate that the majority of our wedding couples and their guests have all been polite and respectful of our historic venue, especially in a stressful year such as 2020 due to Covid-19. At all but one of our weddings and events, guests have been willing to follow the safety rules and have been willing to work with our staff to modify their wedding plans to follow Alabama’s Covid-19 requirements. Our staff has worked very hard to still create safe and beautiful weddings even in a time that is not ideal. Only one wedding this year failed to communicate these requirements to their guests and, as a result, their guests and wedding party failed to follow our social distancing requirements and also broke our venue rules in regards to smoking and safe alcohol consumption. When our team has communicated these rules at all of our weddings and events this year, only one wedding party reacted poorly and refused to be reasonable and berated our staff.\n\nAll of our weddings receptions promptly end at 10:00 pm and all guests are asked to leave the property at this time. It is unfortunate when intoxicated guests react poorly to these rules but we are grateful that all but one of our wedding couples this year has communicated the contract and wedding end times successfully to their invited guests. It is also unfortunate that this particular couple did not bring any concerns to us during the event but rather their guests have chosen to spam us with dishonest reviews on various social media platforms. We love working with couples and brides and are confident in our reviews and ratings which are 100% 5 stars with the exception of this particular wedding event which broke our venue rules and has given an untruthful statement about our venue and our team. We look forward to the lifting of all Covid-19 restrictions in the future and our team continues to be focused on wonderful customer service."}, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "113148619180397748882", "name": "Shelby Hartman", "time": 1622772369650, "rating": 5.0, "text": "Beautiful spot for a wedding! Love the charm of this place.", "pics": null, "resp": null, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "111356681777778385722", "name": "Stephanie Huffman", "time": 1622772546881, "rating": 5.0, "text": "This venue is GORGEOUS! The views, the accommodations, owners, AND the pink doors 👌 😍.", "pics": null, "resp": null, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "103008859578749875575", "name": "Gracie Simmons", "time": 1603227152642, "rating": 5.0, "text": "I hosted a yoga retreat here last September and I’m dreaming of being able to return as soon as this Covid-crisis slows! Taylor was a most gracious host, opening her serene historic home to us and entrusting us to make memories responsibly. Her requirements of no red wine or smoking on the premises made perfect sense to keep the house pristine and welcoming for the next occupants. Our guests had no issues with this. They brought white wine instead and walked far away from the house if they needed to smoke. Taylor communicated well with me from the very beginning and allowed me to tour the house before making my decision. The house is conveniently located to the beautiful lake Jackson with the most beautiful sunrises and sunsets you can imagine! I will most definitely be returning here as soon as possible with my yoga tribe!", "pics": null, "resp": {"time": 1603286024851, "text": "Gracie, thank you so much for your kind words! It was such a pleasure to host your yoga retreat and we hope for many more to come. We are grateful that your group had such a positive experience with us and that our team did an excellent job conveying the requirements of our historic home and no-smoking policy. Lake Jackson is  such a beautiful place and we're so happy that it was a great fit for a peaceful yoga retreat!"}, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "114660947268193324887", "name": "Adler Ranch", "time": 1622777820218, "rating": 5.0, "text": "Beautiful setting and venue owners that care about their clients!", "pics": null, "resp": null, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "111686251314335351675", "name": "kelly king", "time": 1622771565919, "rating": 5.0, "text": "Beautiful venue! Highly recommend it!", "pics": null, "resp": null, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "104410168959305550754", "name": "Aleah Chilleen", "time": 1622765445581, "rating": 5.0, "text": "The pink door though!! This venue is amazing!", "pics": null, "resp": null, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "100268131125036760153", "name": "Karl Snider", "time": 1622773600878, "rating": 5.0, "text": "A beautiful venue and lovely owners!", "pics": null, "resp": null, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "104920747837502087534", "name": "Jeanne Lively", "time": 1603151965888, "rating": 1.0, "text": "I was going to be quiet here but they keep removing reviews and they were very disrespectful to my mother who they knew had been with me all day and was disabled. They weren’t going to let her upstairs (which was not handicap accessible anyway) to change in to something more comfortable that she had upstairs in my room, threatened to fine us, and kick her out besides the many other rude and disrespectful things that happen during the day. Definitely see my public post on FB. Oh I’m just in shock at how things turned out at this beautiful place. Looks like someone else needs to buy it so it won’t be wasted with staff that are currently in everyone of my venue pictures. But the devil himself couldn’t have ruined our day. The wedding was amazing and beautiful because we are so in love and was surrounded by so many friends that love and support us. I just think the business should have been ran more professionally and there will most likely be a lawsuit against the owner in the future.", "pics": null, "resp": {"time": 1603192837255, "text": "We are so thankful that out of more than 50 events in 2020, all but one wedding event was successful and the couples were wonderful to work with. We appreciate that the majority of our wedding couples and their guests have all been polite and respectful of our historic venue, especially in a stressful year such as 2020 due to Covid-19. At all but one of our weddings and events, guests have been willing to follow the safety rules and have been willing to work with our staff to modify their wedding plans to follow Alabama’s Covid-19 requirements. Our staff has worked very hard to still create safe and beautiful weddings even in a time that is not ideal. Only one wedding this year failed to communicate these requirements to their guests and, as a result, their guests and wedding party failed to follow our social distancing requirements and also broke our venue rules in regards to smoking and safe alcohol consumption. When our team has communicated these rules at all of our weddings and events this year, only one wedding party reacted poorly and refused to be reasonable and berated our staff.\n\nAll of our weddings receptions promptly end at 10:00 pm and all guests are asked to leave the property at this time. It is unfortunate when intoxicated guests react poorly to these rules but we are grateful that all but one of our wedding couples this year has communicated the contract and wedding end times successfully to their invited guests. It is also unfortunate that this particular couple did not bring any concerns to us during the event but rather their guests have chosen to spam us with dishonest reviews on various social media platforms. We love working with couples and brides and are confident in our reviews and ratings which are 100% 5 stars with the exception of this particular wedding event which broke our venue rules and has given an untruthful statement about our venue and our team. We look forward to the lifting of all Covid-19 restrictions in the future and our team continues to be focused on wonderful customer service."}, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "111524845527434921151", "name": "Ashley Payne", "time": 1603294585082, "rating": 1.0, "text": "If you plan on using this venue as your wedding or for a special event then you MUST read this honest and fair review. It may be a bit long of a read but if you want a current and an honest review on our experience here then please read this.\n\nThe property is absolutely beautiful and has a lot of historic charm. The house is spacious and can probably accommodate any event. It's an older house so the layout is different but still functioned what the event needed. Thats pretty much the only positive thing I can say about our recent experience here. My friends recently, as in yesterday, got married at this property and the staff, one in particular, were rude, inappropriate at times, unprofessional, condescending and over bearing all while smothering the bride, groom and wedding party along with all the guest that were staying and attended the wedding. The staff never left at any point and hovered over the guest making it feel uncomfortable and uninviting as possible which is not the proper tone for a wedding. They gave conflicting rules on the fly such as no smoking on the property and to go to a spot about a 100 yards away which was actually public property and could lead to you getting arrested for public intox if you want to be technical not to mention extremely inconvenient. Another example: one of the guest that was staying in the house was told to leave the inside of the house as its only for those who are staying here. She was reminded more than once that said person is indeed staying and has his own room in the house. Later that night another guest who was also staying was standing in the kitchen and was told it was more of a prep kitchen and not a hang out and get drunk kitchen and to remove himself from the kitchen area. The staff constantly complained about every little thing we did and without being biased at all and being completely honest, we were extremely respectful of the property as we were there to have a wedding and were there to celebrate two of our close friends getting married and wanted it to go as perfectly as possible. The staff made that a challenge but luckily we're a resilient optimistic group and continued to have a good time even though the staff never left and are even in the majority of the pictures that were taken through out the evening. So if you want to be bombarded with random rules and a cramping and hovering staff that will provide you with zero privacy and add stress to your visit then this place is absolutely perfect for just that.\n\nUPDATE: All they keep saying is the same exact response in each review which is very poor management and not EVER reaching out to the customer! If this was my business and had MULTIPLE people saying the same thing then I would at least find out what is wrong and fix it. NOT GIVE THE EXACT SAME RESPONSE! And just an FYI.......there were more than 1 group that has complained about this and wish I would’ve taken a screen shot of the reviews BEFORE they took it down!", "pics": null, "resp": {"time": 1603285437994, "text": "We are so thankful that out of more than 50 events in 2020, all but one wedding event was successful and the couples were wonderful to work with. This review is from this particular event. We appreciate that the majority of our wedding couples and their guests have all been polite and respectful of our historic venue, especially in a stressful year such as 2020 due to Covid-19. At all but one of our weddings and events, guests have been willing to follow the safety rules and have been willing to work with our staff to modify their wedding plans to follow Alabama’s Covid-19 requirements. Our staff has worked very hard to still create safe and beautiful weddings even in a time that is not ideal. Only one wedding this year failed to communicate these requirements to their guests and, as a result, their guests and wedding party failed to follow our social distancing requirements and also broke our venue rules in regards to smoking and safe alcohol consumption. When our team has communicated these rules at all of our weddings and events this year, only one wedding party reacted poorly and refused to be reasonable and berated our staff.\n\nAll of our weddings receptions promptly end at 10:00 pm and all guests are asked to leave the property at this time. It is unfortunate when intoxicated guests react poorly to these rules but we are grateful that all but one of our wedding couples this year has communicated the contract and wedding end times successfully to their invited guests. It is also unfortunate that this particular couple did not bring any concerns to us during the event but rather their guests have chosen to spam us with dishonest reviews on various social media platforms. We love working with couples and brides and are confident in our reviews and ratings which are 100% 5 stars with the exception of this particular wedding event which broke our venue rules and has given an untruthful statement about our venue and our team. We look forward to the lifting of all Covid-19 restrictions in the future and our team continues to be focused on wonderful customer service."}, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "112821745588555815137", "name": "Erin Brigman", "time": 1603401636077, "rating": 5.0, "text": "This venue is perfect! The view is beautiful and Taylor, the owner, is wonderful to work with. Highly recommend this area for an intimate wedding!", "pics": null, "resp": {"time": 1605659452752, "text": "Thank you so much Erin! We really appreciate your review! It was wonderful to work with you!"}, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "118138782539445659711", "name": "Nikki Stark", "time": 1622765295829, "rating": 5.0, "text": "Phenomenal attention to detail, gorgeous property", "pics": null, "resp": null, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "100611513479531655351", "name": "Patrick Lovegrove", "time": 1622770671088, "rating": 5.0, "text": "Beautiful place, totally recommended.", "pics": null, "resp": null, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "108568583411618906874", "name": "Barb Linares", "time": 1611584296285, "rating": 1.0, "text": "Our guild booked a retreat for March 26th - 29th 2020.  Due to Covid,-19 and the ages of our quilters, we have not been able to re-book our retreat.  The Lake House refuses to refund our money.", "pics": null, "resp": {"time": 1617972948981, "text": "Actually, this is a 100% false review. Your guild from Tallahassee is rescheduled for 9/23-26/21. We not only offered and tried to rebook you multiple times over the past year, but we also added on an extra day to your group at no cost to you. Covid-19 negatively affected everyone from our business to our retreat and wedding guests and we have done everything we could to rebook and accommodate everyone during such an unprecedented event. We would really appreciate if you'd remove this untrue review as it unfairly impacts our business but also reflects poorly on your guild."}, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "110396791143649724614", "name": "Jeni Garcia", "time": 1603150534063, "rating": 1.0, "text": "Absolutely the rudest place ever. Do not waste your money. If you want to be treated horrible, this is your place to go.", "pics": null, "resp": {"time": 1603192852912, "text": "We are so thankful that out of more than 50 events in 2020, all but one wedding event was successful and the couples were wonderful to work with. We appreciate that the majority of our wedding couples and their guests have all been polite and respectful of our historic venue, especially in a stressful year such as 2020 due to Covid-19. At all but one of our weddings and events, guests have been willing to follow the safety rules and have been willing to work with our staff to modify their wedding plans to follow Alabama’s Covid-19 requirements. Our staff has worked very hard to still create safe and beautiful weddings even in a time that is not ideal. Only one wedding this year failed to communicate these requirements to their guests and, as a result, their guests and wedding party failed to follow our social distancing requirements and also broke our venue rules in regards to smoking and safe alcohol consumption. When our team has communicated these rules at all of our weddings and events this year, only one wedding party reacted poorly and refused to be reasonable and berated our staff.\n\nAll of our weddings receptions promptly end at 10:00 pm and all guests are asked to leave the property at this time. It is unfortunate when intoxicated guests react poorly to these rules but we are grateful that all but one of our wedding couples this year has communicated the contract and wedding end times successfully to their invited guests. It is also unfortunate that this particular couple did not bring any concerns to us during the event but rather their guests have chosen to spam us with dishonest reviews on various social media platforms. We love working with couples and brides and are confident in our reviews and ratings which are 100% 5 stars with the exception of this particular wedding event which broke our venue rules and has given an untruthful statement about our venue and our team. We look forward to the lifting of all Covid-19 restrictions in the future and our team continues to be focused on wonderful customer service."}, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "115450503194597767413", "name": "Nathan Warner", "time": 1603142399037, "rating": 1.0, "text": "As guests of a wedding we had a horrible experience with the staff.  They were rude and treated you like a child.  Only allowed one bathroom for more than 80 guests and even kicked people out of the house where the food was.  Very strange and unusual experience.  Do not recommend.", "pics": null, "resp": {"time": 1603192878240, "text": "We are so thankful that out of more than 50 events in 2020, all but one wedding event was successful and the couples were wonderful to work with. We appreciate that the majority of our wedding couples and their guests have all been polite and respectful of our historic venue, especially in a stressful year such as 2020 due to Covid-19. At all but one of our weddings and events, guests have been willing to follow the safety rules and have been willing to work with our staff to modify their wedding plans to follow Alabama’s Covid-19 requirements. Our staff has worked very hard to still create safe and beautiful weddings even in a time that is not ideal. Only one wedding this year failed to communicate these requirements to their guests and, as a result, their guests and wedding party failed to follow our social distancing requirements and also broke our venue rules in regards to smoking and safe alcohol consumption. When our team has communicated these rules at all of our weddings and events this year, only one wedding party reacted poorly and refused to be reasonable and berated our staff.\n\nAll of our weddings receptions promptly end at 10:00 pm and all guests are asked to leave the property at this time. It is unfortunate when intoxicated guests react poorly to these rules but we are grateful that all but one of our wedding couples this year has communicated the contract and wedding end times successfully to their invited guests. It is also unfortunate that this particular couple did not bring any concerns to us during the event but rather their guests have chosen to spam us with dishonest reviews on various social media platforms. We love working with couples and brides and are confident in our reviews and ratings which are 100% 5 stars with the exception of this particular wedding event which broke our venue rules and has given an untruthful statement about our venue and our team. We look forward to the lifting of all Covid-19 restrictions in the future and our team continues to be focused on wonderful customer service."}, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "114896561217480632691", "name": "tom kandler", "time": 1603469517627, "rating": 1.0, "text": "I attended a wedding recently and was absolutely appalled by the behavior of the staff and owner. The customer is always wrong at this venue. All of us are willing to go the extra mile to make sacrifices for safety but the owner uses this as an excuse to be abusive and rude. DO NOT LET THIS VENUE RUIN YOUR DAY!", "pics": null, "resp": null, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "105792745244169195024", "name": "Tyler Childress", "time": 1622772104730, "rating": 5.0, "text": "Weddings are beautiful here!", "pics": null, "resp": null, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "114378294767700432000", "name": "Joe Gajdosik", "time": 1622781938762, "rating": 5.0, "text": "Such a beautiful place!", "pics": null, "resp": null, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "102082104991187063526", "name": "Rachel Raine", "time": 1622767525990, "rating": 5.0, "text": "Such a beautiful place!", "pics": null, "resp": null, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "116725160164088714441", "name": "Richard P", "time": 1603146768693, "rating": 1.0, "text": "This place is nice, but the staff is not.  My friend's evening was sort of ruined by the rude staff. Try somewhere else.", "pics": null, "resp": null, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "107077860903231701872", "name": "Michelle Welch", "time": 1622916275017, "rating": 5.0, "text": "Beautiful location!", "pics": null, "resp": null, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "108717111406884195774", "name": "Kyla Jennings", "time": 1622776409486, "rating": 5.0, "text": "Beautiful venue!", "pics": null, "resp": null, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "100135571917754187571", "name": "Nina Ivey", "time": 1622770644510, "rating": 5.0, "text": "Beautiful place!", "pics": null, "resp": null, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "117414989943476459554", "name": "Shannon Smith", "time": 1622765955443, "rating": 5.0, "text": "Great venue!", "pics": null, "resp": null, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "109128452170277028826", "name": "Tina Perkins", "time": 1603220939556, "rating": 1.0, "text": "People beware. The outside of this venue is beautiful and will suck you in. However the Owners will or will try to ruin it for you.", "pics": null, "resp": {"time": 1603285912839, "text": "We are so thankful that out of more than 50 events in 2020, all but one wedding event was successful and the couples were wonderful to work with. This review is from that particular wedding. We appreciate that the majority of our wedding couples and their guests have all been polite and respectful of our historic venue, especially in a stressful year such as 2020 due to Covid-19. At all but one of our weddings and events, guests have been willing to follow the safety rules and have been willing to work with our staff to modify their wedding plans to follow Alabama’s Covid-19 requirements. Our staff has worked very hard to still create safe and beautiful weddings even in a time that is not ideal. Only one wedding this year failed to communicate these requirements to their guests and, as a result, their guests and wedding party failed to follow our social distancing requirements and also broke our venue rules in regards to smoking and safe alcohol consumption. When our team has communicated these rules at all of our weddings and events this year, only one wedding party reacted poorly and refused to be reasonable and berated our staff.\n\nAll of our weddings receptions promptly end at 10:00 pm and all guests are asked to leave the property at this time. It is unfortunate when intoxicated guests react poorly to these rules but we are grateful that all but one of our wedding couples this year has communicated the contract and wedding end times successfully to their invited guests. It is also unfortunate that this particular couple did not bring any concerns to us during the event but rather their guests have chosen to spam us with dishonest reviews on various social media platforms. We love working with couples and brides and are confident in our reviews and ratings which are 100% 5 stars with the exception of this particular wedding event which broke our venue rules and has given an untruthful statement about our venue and our team. We look forward to the lifting of all Covid-19 restrictions in the future and our team continues to be focused on wonderful customer service."}, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "111163106647843752775", "name": "Brian Boylston", "time": 1603161484260, "rating": 1.0, "text": "Horrible staff that like to stalk your party around every corner and threaten you with fines every 30 minutes rather than let the wedding party relax and enjoy themselves!", "pics": null, "resp": {"time": 1603192783100, "text": "We are so thankful that out of more than 50 events in 2020, all but one wedding event was successful and the couples were wonderful to work with. We appreciate that the majority of our wedding couples and their guests have all been polite and respectful of our historic venue, especially in a stressful year such as 2020 due to Covid-19. At all but one of our weddings and events, guests have been willing to follow the safety rules and have been willing to work with our staff to modify their wedding plans to follow Alabama’s Covid-19 requirements. Our staff has worked very hard to still create safe and beautiful weddings even in a time that is not ideal. Only one wedding this year failed to communicate these requirements to their guests and, as a result, their guests and wedding party failed to follow our social distancing requirements and also broke our venue rules in regards to smoking and safe alcohol consumption. When our team has communicated these rules at all of our weddings and events this year, only one wedding party reacted poorly and refused to be reasonable and berated our staff.\n\nAll of our weddings receptions promptly end at 10:00 pm and all guests are asked to leave the property at this time. It is unfortunate when intoxicated guests react poorly to these rules but we are grateful that all but one of our wedding couples this year has communicated the contract and wedding end times successfully to their invited guests. It is also unfortunate that this particular couple did not bring any concerns to us during the event but rather their guests have chosen to spam us with dishonest reviews on various social media platforms. We love working with couples and brides and are confident in our reviews and ratings which are 100% 5 stars with the exception of this particular wedding event which broke our venue rules and has given an untruthful statement about our venue and our team. We look forward to the lifting of all Covid-19 restrictions in the future and our team continues to be focused on wonderful customer service."}, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "113021900493089257492", "name": "Katie smith", "time": 1556019372522, "rating": 5.0, "text": "This is the house of my dreams! It’s a beautiful historic home, and the lake is only a short walk (across a small street) away!\n\nI especially loved the little details like the fresh flowers & the locally handmade soaps!", "pics": null, "resp": {"time": 1556019571960, "text": "Thank you so much Katie! We're so glad you enjoyed our stay with us, especially the small details that are so important to us, like our artisan goat soaps from a local soapmaker. We hope to see you again soon!"}, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "106744926648619926963", "name": "Samantha K. McDaniel", "time": 1595440364647, "rating": 5.0, "text": "Hosted overnight guests - great accommodations!", "pics": null, "resp": null, "gmap_id": "0x8891873df25d5183:0x60cc36eecce470b6"}
{"user_id": "110393458195474536309", "name": "Michael Bass", "time": 1626409294911, "rating": 5.0, "text": "YELLOW SWARM!! Kids camp was amazing. It was our first year and it didn’t disappoint! We won the spirit stick 2 times in 4 days. The kids enjoyed every second of the day! The sermons were awesome and bible study was perfect. Great facilities!! Great people!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNsUTpICsWUh0Ox01JUYRXbOtauK4kfgGDnoPk3=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP8Re5l0_bHJZ-LAwnNIJR2hFLQbdMgk_a5iGNX=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipODZH2mNlYm5ttmNsQ_oKIvDPT8yvESerhSpiGA=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMDrcZ5x6RwRPhux9V2XrlvjTR4_pBmqUKheBvN=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMQ1VhKX5DzlKnfqSlkODpHBeOcWpVD5hSdH1zx=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPiV1krjDgsKnfrz69Ufl8gsU-mPZqHjvvkYUEa=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOfCS0Rrk5Y6Jf91_ClDk3d4NLgXqT_5uoFPg6O=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMmfFiaLgWavnNCzHaRYblGgQkwx7N_5kxEZAWA=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMJoLQ3aAObbjerLVlmHjjweFE6VDJ8XUcNeLQW=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMYzoYaeNxA661ncY0ErgdWnDdxkih9RwwZQ534=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMBir2vM81VgB6FoD9Z3Psqj0PSih1stp5WiMBK=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNb_9mqqlC6bmzQzWyL6Mkr8xi7NCQ_Dg_MWw7n=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPf5RHcL2j8jTmJOCuop5zL0xE_kwfSPkjB95Si=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMfG1TXJUyVEQ0L15rBISLOpBdvbsj08tVoEGNv=w150-h150-k-no-p"]}], "resp": {"time": 1627497882589, "text": "We are so happy you had a great experience at camp! Come back and visit with us soon."}, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "104453756543763173177", "name": "Kia Chatman", "time": 1627781078505, "rating": 5.0, "text": "If you want to take a quick enjoyable trip that isn't far, and great for the family, this is the place to stop, or stay. They have a zip line, basketball court, mini golf, pool, volley ball, fishing, paddle boats, & more, I guarantee you will not be disappointed.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOOqPiqya1WE7rRoPEoUYAd5qfLbJ1DvsReeZnw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMw7nrAPtaxeckVsUv6LDIKmfGL6GZYVMtkXqt0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP8m_vWwsoCC7EhF8TGnffkVdLPS7t9Oy67sPNG=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipODglJ1kCblw0kZfxHSG-S3LQP8SGGs4nKLag1N=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNpoT_aSze73jHTlZp5En-DOKLmtIJ9YzGFc79R=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM_ivMG_h_SkQAU9KJnYZTGLHxRuDUdFtCHpA0m=w150-h150-k-no-p"]}], "resp": {"time": 1628526541607, "text": "Thank you, Kia, for your recommendation! We are open for churches, schools, civic organizations, and non-profit groups."}, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "115574638986032817056", "name": "Debbie McCall", "time": 1627685404524, "rating": 5.0, "text": "Love this place! Amazing staff and fun amenities. We look forward to every trip made here.", "pics": null, "resp": {"time": 1628526592199, "text": "Thank you, Debbie! We love to hear from our loyal, returning guests!"}, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "103054888170886711823", "name": "Takeila T", "time": 1628074554848, "rating": 5.0, "text": "The staff were friendly and helpful, also the food was delicious. I have to mention the cold brew because it looked so good and my coworker said that it tasted phenomenal!!", "pics": null, "resp": {"time": 1628526465891, "text": "Thank you, Takeila! We are so happy you enjoyed your visit!"}, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "108208089639091489947", "name": "Roberta Green", "time": 1624216757268, "rating": 5.0, "text": "Love every  moment  powerful move of God", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP25dD1nKPOSy-ksibkKYLOzu6ZWiI11uI6bcTL=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOcWmpLDbZjNVaxSBJ95yumOGBTU6_TglmPXyyp=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPOV33SNGBoLE28uEp6NO1S55tyzub2B_Ovv-y9=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNIyR09vJpApg9qe_RbpH1U2DUAxhLBqy7JvDVe=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO-3EJwZ0P7TvTPUt0Qu4c2bukgqmwLeHls_mg3=w150-h150-k-no-p"]}], "resp": {"time": 1625167736201, "text": "We are so happy you had a wonderful experience! Come back and visit us again soon!"}, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "108749131088886755390", "name": "Cindy Shariat", "time": 1627175788272, "rating": 4.0, "text": "I always enjoy coming here for conferences.  Beautiful area, comfortable rooms,  students do a great job of keeping things clean and food ready.", "pics": null, "resp": {"time": 1627497827197, "text": "Thank you, Cindy!"}, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "105115263170965092916", "name": "Randi Lynn McNeill", "time": 1628113489643, "rating": 5.0, "text": "Beautiful property, great place for a conference and very friendly staff. 😀", "pics": null, "resp": {"time": 1628526424536, "text": "Thank you so much, Randi! We hope you will come back soon for another visit!"}, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "110711763669236078682", "name": "Judy Colley", "time": 1615415707332, "rating": 5.0, "text": "We were at Shocco for Honor Choir last weekend.  We were amazed at the pristine care of the grounds and facilities.  The staff was amazing.  Wonderful customer service.  Southern Baptists have a real jewel in Shocco.  We will definitely be back!", "pics": null, "resp": {"time": 1625168096368, "text": "Thank you! We love Honor Choir and are so happy you had a wonderful experience!"}, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "112064989452045165584", "name": "Patrick Gibson", "time": 1623542782286, "rating": 5.0, "text": "The kids had a great time at camp. Wonderful", "pics": null, "resp": {"time": 1625167756019, "text": "That's wonderful! Come back soon!"}, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "116489496487255800669", "name": "Mike McQuary", "time": 1627354203185, "rating": 5.0, "text": "Lol back in the 80s we stayed in army tents never forgot our guide and teacher Big John", "pics": null, "resp": {"time": 1628526681315, "text": "Mike, you should come back and see all the beautiful renovations and additions we have made to campus since then! You will love them!"}, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "100596335734968648928", "name": "Tanya Faponmile", "time": 1628038310882, "rating": 4.0, "text": "I love 💕 this place.", "pics": null, "resp": {"time": 1628526392079, "text": "Thank you, Tanya!"}, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "113675076542396589093", "name": "Maygan Bowman", "time": 1599946607334, "rating": 5.0, "text": "So impressed with this facility! We went for a day of fun with our Pell City soccer team and had a blast!! Had no idea there was so much to do. Thank you for providing us with such a clean, family friendly place!!", "pics": null, "resp": {"time": 1604521505013, "text": "Thank you, Maygan! So happy your enjoyed your visit. Come back again!"}, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "112604864960064362628", "name": "L S", "time": 1520823905938, "rating": 5.0, "text": "Wonderful facility! Very well kept! Great food and friendly staff!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPlhriwjGcvIYD3_XH5fTzST0R0whDwb4t5ZjG4=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "110341824035551849480", "name": "Billy Hughes", "time": 1610823256935, "rating": 5.0, "text": "Beautiful, tranquil surroundings make for a great youth retreat!!", "pics": null, "resp": {"time": 1613420729749, "text": "Thank you, Billy! We are so happy you enjoyed our beautiful campus."}, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "107495483101824389489", "name": "riley Sims", "time": 1594842374269, "rating": 5.0, "text": "It's was great and very fun,the service was great and the food was exceptional. This camp is a great place to get closer to god I highly recommend it", "pics": null, "resp": {"time": 1599746793604, "text": "Riley, we are so happy your visit helped you draw closer to God! Thank you for the great review. Please visit us again soon."}, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "112065346408974970739", "name": "GJDPK Kinslow", "time": 1594214720473, "rating": 5.0, "text": "Beautiful place! Plenty of housing. Lot of activities. Great staff. Good food.", "pics": null, "resp": {"time": 1599746820331, "text": "Thank you so much for the great review! Hope to see you again soon."}, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "107602391481145967810", "name": "Todd Sutherland", "time": 1579456593775, "rating": 5.0, "text": "We are at the Behold 2020 retreat. Moved the retreat from Camp Sumatonga this year due to necessity. What a beautiful facility here at Shocco Springs. And loving people to top it off.", "pics": null, "resp": {"time": 1599746940152, "text": "Todd, we were thrilled that BEHOLD held your retreat here this year and we look forward to seeing you again in the future!"}, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "106374129669318602503", "name": "Dong Hyun Choi", "time": 1579736003321, "rating": 5.0, "text": "Staff members were professional and kind.  Rooms and facility were sparkling clean and well maintained.  Sound system in the Bagley center conference room was great.  The lake view is beautiful.", "pics": null, "resp": {"time": 1599746895157, "text": "Thank you so much! We are happy you enjoyed our beautiful campus, and look forward to having you back in the future."}, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "114883039414179709559", "name": "amy atkins", "time": 1623074533598, "rating": 5.0, "text": "Beautiful place", "pics": null, "resp": {"time": 1625167692956, "text": "Thank you! We hope you come back and visit us again soon!"}, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "115520861503448470657", "name": "Craig Roden", "time": 1597621250429, "rating": 5.0, "text": "Very clean and secure especially for children.loved the lake and the hospitality.", "pics": null, "resp": {"time": 1599746726907, "text": "Thank you, Craig! We are so happy you enjoyed your visit, and we hope you return soon."}, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "110652250412174721409", "name": "Molly Harrison", "time": 1518574656661, "rating": 5.0, "text": "Love this place so much! The housing options are amazing, everything they offer is incredible. The workers a kind and go out of their way to make your visit exceptional.", "pics": null, "resp": null, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "117800210813686050286", "name": "Kevin Thompson", "time": 1532839664839, "rating": 5.0, "text": "There are a lot of things to do here.  If you get the opportunity to visit, definitely go.  Paint ball, lake, pool, frisbee golf, mini golf, horseshoes, fishing, and a gym.  Nice retreat.  This place is local to me, my kids have worked here and I have been here many times over the years.  Diamond in the rough.", "pics": null, "resp": null, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "110469483831140552839", "name": "Matthew Moreno", "time": 1505699244579, "rating": 3.0, "text": "Was a pretty nice place. Only used it as a hotel. Beds were comfy. Only bad thing I have is small bathrooms and the place kinda looks like camp crystal lake from halloween. Would definitely stay here again.", "pics": null, "resp": null, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "111453803540279518699", "name": "Lilly The Cinnamon", "time": 1593005782131, "rating": 5.0, "text": "This place is amazing!", "pics": null, "resp": {"time": 1599746838317, "text": "Thank you! So glad you enjoyed your visit."}, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "107285137372100137029", "name": "Sharon Willeford", "time": 1473695549174, "rating": 5.0, "text": "Our group is coming this weekend.  Will give ratings next week.  Expecting 5 Stars Awesome!", "pics": null, "resp": null, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "106700649820051896306", "name": "omar alkabra", "time": 1477064613721, "rating": 3.0, "text": "Good place for connecting /Networking. Ideal for national and international conference", "pics": null, "resp": null, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "107568994939290825384", "name": "land seller", "time": 1528554420726, "rating": 5.0, "text": "came here for student Life camp and I loved it!", "pics": null, "resp": {"time": 1627497938552, "text": "We are very happy you had a wonderful experience at camp!"}, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "104151793304916977425", "name": "Jason McClain", "time": 1600004469458, "rating": 4.0, "text": "Awesome place", "pics": null, "resp": {"time": 1604521448010, "text": "Thanks, Jason!"}, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "116054494787526576185", "name": "danielle floyd", "time": 1566580023031, "rating": 5.0, "text": "it was fun at centrikid camps.", "pics": null, "resp": {"time": 1627497917177, "text": "We are so happy you had a great visit!"}, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "111859218958853538278", "name": "Charles Chang", "time": 1490011225381, "rating": 5.0, "text": "I visited this place once a year for the past 10 years, each time they have some improvement to surprise me. An awesome place for Christian to have a meeting, rest, good time, and worship together.", "pics": null, "resp": null, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "109633601509162135079", "name": "Matthew Jungling", "time": 1465142010588, "rating": 4.0, "text": "Shocco Springs is an amazing camp center. I had the ability to go when our youth camp decided to come for summer camp. The camp is run through Student Life Camps and has an amazing group of staff and individuals that help the camp run. The guys in our group including me stayed in Mount Moriah, which is one of the many lodging buildings available to stay in. The rooms were clean and fresh bedding was provided, although we brought our own. I opted to use the provided bedding. The rooms had two bunk beds for a maximum capacity of 4 people. The lower level of Mount Moriah (we stayed in the top level--a two story building) has a nice little lobby area with some chairs and a couch. Some guys in our group thought it would be funny to take the couch upstairs and place it in front of our leader's room. We returned the couch afterwards.\n\nThe rest of the camp was very beautiful and well kept. There were some lawn care professionals maintaining the grounds while we stayed.\n\nThe recreation area, known as the \"Adventure Camp\" was very nice. The pool was large enough for our group to comfortably play in, as well as others. A diving board added to the fun. The Tennis courts and Basketball courts were very nice and well kept, but you will need to bring your own tennis supplies, as they are not provided. There was a small \"lake\" on camp grounds, with paddle boarding, and some water inflatables. We did not decide to go on these as they cost an extortionate amount of $8 for 30 mins of play. Not worth it.\n\nIt would we worth nothing that everything is fairly spread apart and there are some very intense hills throughout, which took a toll on our legs and knees. Golf Cart rentals were available for $35/day, but we had too many in our group that it would cost too much, so we didn't do it.\n\nThe food service was very nice, the food tasted adequate and there was always a variety to choose from. It is a self serve food line, so you are free to eat what you choose. A nice addition is the unlimited complimentary Soft Serve Ice Cream available at each and every meal.\n\nOverall I have to say Shocco Springs is one of my favourite camps that I've been to. Sure it's a little hot here in Alabama, but that's fine. Just bring some water, and going swimming can help tremendously.\n\n-Matthew J., age 15 at time of writing. Visited From June 1-5, 2016. Home town: Abilene, TX.", "pics": null, "resp": null, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "107862141804832674905", "name": "Roy Windham", "time": 1403529500374, "rating": 5.0, "text": "Great camp experience. Students had plenty of recreation options to choose from.", "pics": null, "resp": null, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "111695117385242601391", "name": "Parker McClure", "time": 1434584145908, "rating": 5.0, "text": "It was a great experience for me.", "pics": null, "resp": null, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "115168238157132559920", "name": "Kelly Waters", "time": 1434144254325, "rating": 5.0, "text": "i had amazing time i wish i didn't leave", "pics": null, "resp": null, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "114211269394185874721", "name": "Amy Pitts", "time": 1497229166195, "rating": 5.0, "text": "I love working here!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOWi_ISoG58X72zeKdq0BDT7Ezyv05fveoELY5z=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "117113947791014320595", "name": "Fishingthe 256", "time": 1553310227963, "rating": 5.0, "text": "It was fun", "pics": null, "resp": null, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "117695136674361089576", "name": "Michelle Forte", "time": 1552509410656, "rating": 5.0, "text": "nice place", "pics": null, "resp": null, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "112843836704393345225", "name": "My Phone", "time": 1465242279151, "rating": 4.0, "text": "It ok", "pics": null, "resp": null, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "104120181709155418461", "name": "Pamela Ferrera", "time": 1536687106626, "rating": 5.0, "text": "(Translated by Google) An excellent place to connect with nature but above all the spiritual connection with the Lord\n\n(Original)\nUn excelente lugar para conectarse con la naturaleza pero sobre todo la conexión espiritual con el Señor", "pics": null, "resp": null, "gmap_id": "0x888bdc6249b171c3:0x1c4b4e819261408e"}
{"user_id": "104706561613152327890", "name": "Leslie Cheatham", "time": 1619379405282, "rating": 5.0, "text": "Beautiful and serene spot! I spent the weekend at the Honeywood Valley lodge with a group of friends from college and it could not have been more perfect for us! We hope to make this a yearly get together. We had plenty of space to relax and catch up outside and inside, when it rained. I highly recommend it for your next event!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipORvnu3fj71lPZbSTsn4X2xoNrkExkNXo5_QUyV=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOm16bKNfAnUZpeJtvJcvPX5DntzHcBPQCeHbAU=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOjgbHWwG5ORfmDmID60TbDL6COXrPDIdt0ZVa4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPS_qLa23jkEktbpi0iAQJDvJgxzEjYndkZHIFR=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNS2IoVshmBSY5Sqs_4-jm0_M9i6CMrXaCgFfRR=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNOzOcYzJ0CySkTYnDGiQUVrs3T09C_y386Np-B=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPqJ5nj2pFJ8HpuzqBv3PJX_YHWf3egWHNsN6Ij=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPkxq2WjmQVSDOV2wvJN9z5tkEHGj3_cvndKJAc=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM_qgxvrIVW7Bp8M9sj5o9ABm22uOU0PQy0oESi=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipONGB2S1HQNcucuunEWU__u-TGFLpZOPcbixW3y=w150-h150-k-no-p"]}], "resp": {"time": 1620392098015, "text": "We are so happy you choose to spend your girls getaway at Honeywood Valley. We loved having you and look forward to being an annual retreat you and your friends!"}, "gmap_id": "0x8889696d405b1e71:0x9f931a0dbc13b483"}
{"user_id": "106056450622474481581", "name": "Megan LaRussa Chenoweth", "time": 1620353792551, "rating": 5.0, "text": "We had a wonderful weekend at Honeywood! It was such an easy, quick drive from Birmingham but when you get to the property you feel so much farther away as it's so peaceful! We loved just relaxing & enjoying the beautiful scenery.  And we couldn't resist getting some spa treatments from the ladies of Fancy Face. It was amazing, they came to the property for the spa treatments so we didn't have to go anywhere! All in all it was a truly relaxing & rejuvenating weekend & we can't wait to go back!", "pics": null, "resp": {"time": 1620391875403, "text": "Thank you for choosing to spend your time at Honeywood Valley. We are so happy to hear you had a wonderful time and look forward to having you back anytime."}, "gmap_id": "0x8889696d405b1e71:0x9f931a0dbc13b483"}
{"user_id": "101819737338111966143", "name": "True40 Downtown Birmingham", "time": 1598967174780, "rating": 5.0, "text": "We took a staff wellness retreat at Honeywood, and it was beyond incredible. The property and house are so beautiful, that you can be completely happy just sitting and relaxing for the duration of the stay, but Honeywood provides so many activities and amenities. We took a barre class in the barn, yoga on the deck, and enjoyed water activities like paddle boarding, canoeing, and kayaking. We spent sunset with wine watching the sunset on the expansive deck. There was plenty of space to sleep comfortably and privately. Honeywood would be an ideal venue for a number of different trips: a girls weekend, family getaway, corporate retreat, wedding, and more. You can make Honeywood your own while you're there, and we were so impressed.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPwNnvJ2csuq31UYJbn_kukBVzEvY5Wk40etjGv=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMZOk4E7w9uxcBjrAswPsjV6LyNi2D0S579Zp5T=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNK2ED-ggQh_Z_Dom2Byere8RmATUy5-h_mZFul=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO36HeW-lM66ayANbtejRWUAujFG4D-JwuOy8dY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMhXYT-xby9ptWjL3MqQGc4dR5kdjHv0FEZ22xk=w150-h150-k-no-p"]}], "resp": {"time": 1598972336305, "text": "We are so happy to share this slice of heaven with you! It gives us such joy that you all were able to relax, retreat and spend time with your team growing, sweating and being in fellowship together. We are extremely thankful and grateful that you all enjoyed your stay with us at Honeywood!"}, "gmap_id": "0x8889696d405b1e71:0x9f931a0dbc13b483"}
{"user_id": "114180661826456859038", "name": "Lynda Ratliff", "time": 1600451988148, "rating": 5.0, "text": "Honeywood Valley is such a serene and peaceful place to go, unwind and truly rejuvenate. The accommodations are very well appointed with gorgeous rooms, plenty of space and everything you need for a true retreat.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMJtZPDA2FEpvVRx9z4ckgh_fpuY9VgCDtl-4GB=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNzljTlWbJx3FHzdNyPcdgfHsFEBvMY4ucZ5l4p=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNqbQz9OvTSX5XDqfBU7u1FoYZZT0OYG8DvPSQg=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP00LJnoBunxdj5IdhmpJC71SJpwm_22cTqqUoK=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMCvPRkqtSrxkFvmEDuB4Yf6JmwuIf5bqM_VBLQ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOOntIUZr7llWnn20LSTGM5ymY2fA2kv3azruGZ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPM5_iWkGI9PJXmsqXB8-2PpA_qu7zDLxfGgcB3=w150-h150-k-no-p"]}], "resp": {"time": 1600458497579, "text": "Lynda, thank you so much for your feedback. We are so glad to hear you enjoyed your stay."}, "gmap_id": "0x8889696d405b1e71:0x9f931a0dbc13b483"}
{"user_id": "109392814448135985213", "name": "Zach Plunket", "time": 1601923895009, "rating": 5.0, "text": "Amazing venue and great people. The entire property is well kept, managed and beautiful. Didn’t account for how far away it would be from any gas stations and I ran out of gas. One of the owners brought out a personal gas can and put 5 gallons in my vehicle.", "pics": null, "resp": {"time": 1608215207637, "text": "We were glad to have you! Hate to hear you ran out of gas, but we are happy to hear our team was there to assist when needed. Come back and see us again soon!"}, "gmap_id": "0x8889696d405b1e71:0x9f931a0dbc13b483"}
{"user_id": "102623183930380239516", "name": "Allie Tittle", "time": 1603405892679, "rating": 5.0, "text": "Hands down the most beautiful wedding venue I’ve ever been to! The views were incredible, the management and staff were extremely friendly, and the property was immaculate. 10/10!", "pics": null, "resp": {"time": 1608215158772, "text": "Thank you for your amazing review! We hope you come back to see us again soon!"}, "gmap_id": "0x8889696d405b1e71:0x9f931a0dbc13b483"}
{"user_id": "105494427620819183553", "name": "Gaynell Tate", "time": 1607907395253, "rating": 5.0, "text": "It was one of the most peaceful places I ever experienced", "pics": null, "resp": {"time": 1608215137759, "text": "We are so glad to hear that! We hope you come back to see us again soon!"}, "gmap_id": "0x8889696d405b1e71:0x9f931a0dbc13b483"}
{"user_id": "100825222033184851846", "name": "Brandon Broach", "time": 1563307958510, "rating": 5.0, "text": "Yellow Branch is an amazing place. We’ve visited before for weddings and also come corporate events and every time it takes my breath away.  The owners are so gracious in sharing this little piece of heaven with others.\n\nWatching the sunset from the deck or balcony over the lake just feeds my soul.\n\nThe hilltop barn is a refuge within a refuge. It’s a great place for reflection and quiet.\n\nIt truly is a gem in the Alabama hills.", "pics": null, "resp": null, "gmap_id": "0x8889696d405b1e71:0x9f931a0dbc13b483"}
{"user_id": "111136285513864788736", "name": "Stephanie Brumbeloe", "time": 1526594010761, "rating": 5.0, "text": "If you are looking for a unique wedding venue at a place that everyone will be excited about getting an invitation to, then Yellow Branch is the place for you. Just one wedding per weekend and you have the place all to yourself. An experience you and your guests will never forget! It's worth every penny!", "pics": null, "resp": null, "gmap_id": "0x8889696d405b1e71:0x9f931a0dbc13b483"}
{"user_id": "105031472702734377745", "name": "Gina McGiboney", "time": 1542653997154, "rating": 5.0, "text": "Gorgeous scenery and hospitable owners!  Wonderful location for weddings, family reunions,  or business retreats!", "pics": null, "resp": null, "gmap_id": "0x8889696d405b1e71:0x9f931a0dbc13b483"}
{"user_id": "102213042604857239370", "name": "Thomas Nails", "time": 1540743751372, "rating": 5.0, "text": "Beautiful place, wonderful staff. Very vendor friendly.", "pics": null, "resp": null, "gmap_id": "0x8889696d405b1e71:0x9f931a0dbc13b483"}
{"user_id": "105018332772346377045", "name": "Suanne Nutter", "time": 1541530955832, "rating": 5.0, "text": "Beautiful venue and nice people.", "pics": null, "resp": null, "gmap_id": "0x8889696d405b1e71:0x9f931a0dbc13b483"}
{"user_id": "102105448298503622278", "name": "Michael Sides", "time": 1529587502434, "rating": 5.0, "text": "Beautiful property, gorgeous house, better views.", "pics": null, "resp": null, "gmap_id": "0x8889696d405b1e71:0x9f931a0dbc13b483"}
{"user_id": "105653575210137830779", "name": "Robert Frazier", "time": 1560324168307, "rating": 4.0, "text": "Beautiful location", "pics": null, "resp": null, "gmap_id": "0x8889696d405b1e71:0x9f931a0dbc13b483"}
{"user_id": "106136103509647957573", "name": "Brian Habig", "time": 1624392312969, "rating": 5.0, "text": "A one-of-a-kind camp and staff culture.", "pics": null, "resp": null, "gmap_id": "0x8861d4b05b773225:0x7ca83ff3de941afe"}
{"user_id": "111541164694907009458", "name": "David McCaughtry", "time": 1621939874921, "rating": 5.0, "text": "Beautiful camp and facilities", "pics": null, "resp": null, "gmap_id": "0x8861d4b05b773225:0x7ca83ff3de941afe"}
{"user_id": "105432640100788387643", "name": "Archibald Hill", "time": 1604667066414, "rating": 5.0, "text": "I will never forget my time at Alpine as a camper", "pics": null, "resp": null, "gmap_id": "0x8861d4b05b773225:0x7ca83ff3de941afe"}
{"user_id": "117237698837896139984", "name": "Hailey Holloway", "time": 1596755200025, "rating": 5.0, "text": "Beautiful place .Great out doors flying squirels and paddle boats  kayaks", "pics": null, "resp": null, "gmap_id": "0x8861d4b05b773225:0x7ca83ff3de941afe"}
{"user_id": "106918988765207529515", "name": "Taylor Citrin", "time": 1573783560859, "rating": 5.0, "text": "I was a camper at Alpine for 8 years. If you want to learn more about Christ and have a great time doing it, this is where you want to spend your summer. You will build friendships with guys who will affect your life in the best way possible. Mohawk forever!", "pics": null, "resp": null, "gmap_id": "0x8861d4b05b773225:0x7ca83ff3de941afe"}
{"user_id": "109066540463352627452", "name": "anonymous inc.", "time": 1609448199427, "rating": 5.0, "text": "Alpine is on of those places, that when you leave you can't wait until you come back. It's november right now, and I feel like camp was yesterday.\nAlso the negative review on Alpine is completely inaccurate.", "pics": null, "resp": null, "gmap_id": "0x8861d4b05b773225:0x7ca83ff3de941afe"}
{"user_id": "106607367248569875803", "name": "Grouchy Corpse", "time": 1518237394841, "rating": 5.0, "text": "I have gone to this camp for 7 years now. This year will be my 8th year in a row to go. It has a very Christian atmosphere. If you are not religious. You can just ignore the prayers,  and not pay attention in church. I am a believer of Christ though. I would send my child here if i had one. 1. Great food 2. Lots of activities 3. Bonding relationships with one another 4. A Pattie at the end of the experience. 5. You go on a trip depending on your age to Chattanooga or white water rafting, or roller coasters. Will post pictures later.", "pics": null, "resp": null, "gmap_id": "0x8861d4b05b773225:0x7ca83ff3de941afe"}
{"user_id": "108572699697201906115", "name": "Samuel Rice", "time": 1562096231198, "rating": 5.0, "text": "Alpine is the most wonderful place in tje world. Though I left it today I have 11 months to dream about next year. Thank you lord for Alpine.", "pics": null, "resp": null, "gmap_id": "0x8861d4b05b773225:0x7ca83ff3de941afe"}
{"user_id": "104223902771296785164", "name": "Kearl Hat", "time": 1250083742238, "rating": 1.0, "text": "I went to this camp as a kid. It offers the usual canoeing, archery, crafts activities. The main theme of this camp, however, is indoctrination into the Christian faith. We had to pray about 12 times daily and sing religious songs. Activities suspected of conflicting with Christianity where forbidden - my age saw the outlawing of Dungeons & Dragons, I'm not sure what is being forbidden these days. This is a good camp for Jesus Freak parents (you know who you are) who want to continue the ole indoctrination routine. If you are even the least bit secular, believe in religious tolerance, or don't want your son frothed up in a religious fervor, you should look elsewhere in your quest to get rid of junior for the summer. Good Luck", "pics": null, "resp": null, "gmap_id": "0x8861d4b05b773225:0x7ca83ff3de941afe"}
{"user_id": "111162089623712968797", "name": "Will Miller", "time": 1519754602610, "rating": 5.0, "text": "Alpine Camp changed my life - Thank you Lord for Alpine.", "pics": null, "resp": null, "gmap_id": "0x8861d4b05b773225:0x7ca83ff3de941afe"}
{"user_id": "103717305702874388787", "name": "Robert Pettit", "time": 1398519814782, "rating": 5.0, "text": "Thank you Lord for Alpine", "pics": null, "resp": null, "gmap_id": "0x8861d4b05b773225:0x7ca83ff3de941afe"}
{"user_id": "109366070313886460212", "name": "Matthew Delmain", "time": 1623694878893, "rating": 5.0, "text": "Excellent place for a church or family retreat. There is a lot to do and a super staff there.", "pics": null, "resp": null, "gmap_id": "0x88927625bcfddbf9:0xbc8ae982433f1459"}
{"user_id": "117271877957027803785", "name": "Mia Foster", "time": 1619782372635, "rating": 5.0, "text": "It is a very beautiful place where you can meet with the Lord!", "pics": null, "resp": null, "gmap_id": "0x88927625bcfddbf9:0xbc8ae982433f1459"}
{"user_id": "110781123586405104121", "name": "Shannon Feaggins", "time": 1591283784188, "rating": 5.0, "text": "Wonderful place to collect your thoughts. This is our home away from home. The cabins are incredible. We love to fish and I sit by the pond pray.💕 Mr. Steve and his family are great people.", "pics": null, "resp": null, "gmap_id": "0x88927625bcfddbf9:0xbc8ae982433f1459"}
{"user_id": "104307966562699338400", "name": "Michele Wood", "time": 1562260200287, "rating": 5.0, "text": "This was the best camp I have ever been too. I absolutely love it and can't wait till we go again.❤️❤️❤️", "pics": null, "resp": null, "gmap_id": "0x88927625bcfddbf9:0xbc8ae982433f1459"}
{"user_id": "118055172129593888779", "name": "Ron McMonagle", "time": 1618100147287, "rating": 5.0, "text": "Great Christian Retreat.", "pics": null, "resp": null, "gmap_id": "0x88927625bcfddbf9:0xbc8ae982433f1459"}
{"user_id": "114573961500957508583", "name": "Mariea Powell", "time": 1407529474099, "rating": 5.0, "text": "I recently took my children's group to the Vineyard. We had one of the best camp experiences that we have had in several summers. the kids enjoyed all of the activities that are available and the staff was very accomodating to our schedule. The meals were fantastic!!!! A big thank you to the kitchen staff. we had four decisions for Christ while we were at camp. A great place for kids to have independence and experience God's creation.", "pics": null, "resp": null, "gmap_id": "0x88927625bcfddbf9:0xbc8ae982433f1459"}
{"user_id": "117815788720806999233", "name": "Anjelisa Howard", "time": 1412459241079, "rating": 5.0, "text": "Wonderful, beautiful place.  The staff there is so friendly and will go so out of their way to help you have a great camp or retreat.  I highly recommend this place for your next church outing.", "pics": null, "resp": null, "gmap_id": "0x88927625bcfddbf9:0xbc8ae982433f1459"}
{"user_id": "102051956340508598082", "name": "David Trawick (DT)", "time": 1426957531770, "rating": 4.0, "text": "Thoroughly enjoyed being with my brothers and listening to God speak through Bro Cliff. Beautiful place....love the Cross and the reglection it makes upon the water. May I too reflect His Cross and sacrifice.", "pics": null, "resp": null, "gmap_id": "0x88927625bcfddbf9:0xbc8ae982433f1459"}
{"user_id": "110528981220440592979", "name": "Lisa McDonald", "time": 1623866338657, "rating": 5.0, "text": "I just attended a 3-day, 2-night girls' camp with 12 girls from 11 to 18 years, in addition to 5 other adult leaders.  Susan and Ron were absolutely wonderful to work with from the time we booked our adventure until we drove away.  Susan was very accommodating when we needed to change our schedule and quickly responded to all questions.  The girls loved the zipline, pool and lake activities as well as all of the team-building games and competitions we did, and Ron was kind enough to open the water slide which was not scheduled. The accommodations and food were great and Susan even sent us home with extra muffins!  We would definitely go again!", "pics": null, "resp": {"time": 1623869916061, "text": "Lisa, thanks for the great review.  We really enjoyed having your group here and hope to see you again."}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "115754082846404759860", "name": "David Norris", "time": 1622805151509, "rating": 5.0, "text": "This was just what we were looking for! They accommodated our zip lining group ages 5 to 86 and everyone was safe and it was fun! Ron, Susan and entire staff are great. Hidden gem.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPZzuMnLkyMax6C9ebOtbYve1wn3vjua3NORX1e=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPj7XeDZ567AszSRbfx5d5AgPGmtG2vyyK9oKpC=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPF1pQC2H9B_dJmoD9VfXk5ht0w3DVrGrRy_LvF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMRGz0sDemTjx5xE4YHxHmHwxb6bt6j2BhxU4Wm=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPcAZlBArHtaqFNhawskKn1XuPF6TC9L8bgeMjG=w150-h150-k-no-p"]}], "resp": {"time": 1622808602147, "text": "Thanks David.  We really enjoyed your group yesterday.   Hope to see you again."}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "117798315304560947780", "name": "Sara Thompson", "time": 1621620886028, "rating": 5.0, "text": "These was such a great adventure to do as a family. We stop on are way done to Florida and we are so glad we did. We did the tree adventure and zipline but we wish we could have spent more time there. Diffently take the time to stop.", "pics": null, "resp": {"time": 1621679432683, "text": "Thanks for visiting Butter and Egg Adventures.  We hope that your visit was just one of many great times your family will have while on this trip.  We thank you for stopping by and having some fun with us."}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "111255533946984683007", "name": "Charles uh60m", "time": 1609878047774, "rating": 5.0, "text": "What a great place this is! My kids and I just left there and had a blast! There is so many fun things to do but I have to say zip lining was the best!", "pics": null, "resp": {"time": 1609934098201, "text": "Charles, thanks for bringing your family here yesterday.  We could tell they were having a great time.  Look forward to seeing everyone again."}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "103988428412878848042", "name": "Erin Shae", "time": 1558045141337, "rating": 5.0, "text": "SO MUCH FUN! Can't wait to go back and try even more...we were there with a school group and were able to zipline, rockclimb, canoe and paddle boat, shoot eachother with lazer guns on the Battlefield (totally beat my own kid's team 😁), and eat our lunches under a covered pavillion...it was great. The staff interacts well with the kids and everybody was helpful and informative. Considering it for this year's birthday!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPlqEqShmSU2FgNioP-uH3m36jPI2-ERNZGi_tY=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPUfyZKl0lTZs6UeUJgqjGo2rGNG-OJBx2tUSAj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOmZizrIrDBnuVYZduPymRlbTojLL4EPUoz39tf=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPfaZdxPMgWY_KKX9RyizJX6zFSPBf787nFcgEj=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNyULJ2H6LJXOmZ_AMi1fcu1eoZ4x3B7dHrqhUB=w150-h150-k-no-p"]}], "resp": {"time": 1558049452851, "text": "Thanks for the great comments and we look forward to seeing you again!"}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "106360953977410975958", "name": "Xhilyn", "time": 1623377223403, "rating": 5.0, "text": "My friend saw your billboard on the highway and the name itself warrants such a good review. Cheers, - Bethany Rae Jackson", "pics": null, "resp": {"time": 1623407273159, "text": "Thanks, if you liked the billboard...you would love the facility.  Come out sometime and enjoy our adventures."}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "110789612782110688549", "name": "zion michelle", "time": 1623006118252, "rating": 5.0, "text": "so fun!! i went eith my cousins", "pics": null, "resp": {"time": 1623006781896, "text": "Zion, thanks for coming to Butter and Egg Adventures!"}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "108784952081529799480", "name": "Randy Nix", "time": 1616530206759, "rating": 5.0, "text": "My grandchildren had a blast and the employees are were  great with the kids", "pics": null, "resp": {"time": 1616539021165, "text": "Randy, thanks for the 5 Star review.  We really enjoyed having your family here today.  Thanks for coming to Butter and Egg Adventures!"}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "109784203562850570354", "name": "DandK", "time": 1500296528559, "rating": 5.0, "text": "It was one of those thing on my bucket list  we was down there for a state tournament  baseball game  . So we 2 grandmother's we wanted to do something fun and we did it was the best we laughed we was scared caused we never done it laughed at each other we loved it I will stop every  time I come threw and thank y'all for letting 2 grandmother's have a great experience   . Darlene Zills.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMwow8BfPtqltP-jqbpaYAzWYDIBFNGnj7Q2eEr=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "115284742395775627731", "name": "Marty Parson", "time": 1604340936417, "rating": 5.0, "text": "Awesome time, they are well organized and want you to have good time", "pics": null, "resp": {"time": 1621857112605, "text": "Thanks Marty.  Hope to see you again."}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "116684870333098641600", "name": "Ashley Creekmore", "time": 1581908859646, "rating": 5.0, "text": "Took my Girl Scout Troop here for a 3-day weekend. They loved it!  The food was great and the staff was amazing. They were extremely knowledgeable and friendly. They went above and beyond for us. We definitely got more than our money’s worth with this camp and will likely come again. The zip lines and tree adventures with high ropes course were the girl’s favorite. But the human foosball was equally fun. So many good memories made that weekend.", "pics": null, "resp": {"time": 1581937032109, "text": "Thank you Ashley, we really enjoyed having your group here!"}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "114196094782823885429", "name": "Kristen Piazza", "time": 1592248704003, "rating": 5.0, "text": "Went here for my birthday and had an awesome time! 😍 Went ziplining and axe throwing. 🪓Natalie and her husband were super awesome guides! They wear masks the whole time so if you're worried about Covid, don't be. Definitely go here you will not regret it!", "pics": null, "resp": null, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "107056063201402933137", "name": "sherita newby", "time": 1592683729962, "rating": 5.0, "text": "GREAT place, with a GREAT staff. I hurt myself and they took very good care of me!! I will definitely be back!!", "pics": null, "resp": null, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "112444999828813503842", "name": "Dawn Burley", "time": 1603731375791, "rating": 5.0, "text": "Awesome place great staff love the property!", "pics": null, "resp": null, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "110966049569140539727", "name": "k9krate", "time": 1622153788581, "rating": 5.0, "text": "Great experience", "pics": null, "resp": {"time": 1622199251779, "text": "Thanks for coming to Butter and Egg Adventures.  Hope to see you again!"}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "117596790244509604385", "name": "Mollie Waters", "time": 1622230800458, "rating": 5.0, "text": "Loved it!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNKGsCUabfCtwLNBPisyV9SwivBs88E2262McMm=w150-h150-k-no-p"]}], "resp": {"time": 1622808651957, "text": "Molly, thanks for visiting Butter and Egg Adventures.   Glad that you had a great time!"}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "113138037756686914042", "name": "Kayla F", "time": 1565830999578, "rating": 5.0, "text": "We had such a fun group ! The guides were friendly and explained everything well. Natalie was a great guide and they were so accommodating of all skill sets. Can't wait to go again", "pics": null, "resp": null, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "109005137324549888984", "name": "Mary-Aileen McLemore/ Anti-Cook Girl", "time": 1493591168819, "rating": 5.0, "text": "My boys (12 and 14) and I had a fantastic time! This is by far the most creative tree course we've done. The zips were the best too- lots of them for long distances unlike other places that only give you one or two of those in your package. You also can't find a better price out there for this type of adventure. We will go back!", "pics": null, "resp": {"time": 1493768357137, "text": "Thanks for taking on our three tree courses!"}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "109005137324549888984", "name": "Mary-Aileen McLemore/ Anti-Cook Girl", "time": 1493591168819, "rating": 5.0, "text": "My boys (12 and 14) and I had a fantastic time! This is by far the most creative tree course we've done. The zips were the best too- lots of them for long distances unlike other places that only give you one or two of those in your package. You also can't find a better price out there for this type of adventure. We will go back!", "pics": null, "resp": {"time": 1493768357137, "text": "Thanks for taking on our three tree courses!"}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "110535425167356785607", "name": "Amanda Kelley", "time": 1563087039661, "rating": 2.0, "text": "My daughters came to camp there July 11th through the 13th for kids camp with Crossroads Baptist Church. They came with $20.00 a piece to purchase anything of their choosing. The Adults that we’re in charge of both of my daughters money made them share $20.00. With that being said neither of my daughters were able to purchase a shirt from your camp. Not happy because we live over 2 hours away. It would be nice if y’all were able to make it to where your shirts can be purchased from your website.A staff member was very rude to my oldest daughter had I been there it wouldn’t have happened. If your staff can’t be nice to children then they don’t need to work for the camp period. I’ve heard great things about your camp. But after what happened with my daughters makes me see different.", "pics": null, "resp": {"time": 1563113506236, "text": "Amanda, we are sorry that your daughter had a bad experience at Butter and Egg Adventures.  We work hard to make sure all of our guests are treated with dignity and respect.  With that in mind, to find out more about the situation of a staff member being rude to your eldest daughter, please call 334.670.9954 or 334.670.9953 to discuss with us.  We need to find out more information, so that we can act accordingly.  On your other matter about buying a t-shirt, we had no control of your daughter's money and on how to spend it.  We certainly want to sell t-shirts to all our guests.  Our primary purpose for our website, is to provide information about our services and recreational opportunities at Butter and Egg Adventures. If you would like to buy a t-shirt at this time, please let us know and we can make arrangements to sell you one via our payment gateway.  We look forward to hearing from you."}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "101400206115844213769", "name": "Ana A", "time": 1451880042866, "rating": 5.0, "text": "My daughter, her boyfriend and I went to Butter and Egg Adventure the day after New Year's Day. It was the first sunny day in weeks and we really enjoyed getting out and being active. The owners, Ron and Susan, were gracious enough to take us through the course themselves, which we thoroughly enjoyed. The grounds, structures and property are well maintained and good safety procedures are in place. We hope to return in the Spring with a bigger group of family and friends. Perfect for a family outing or activity for a big group of friends or venture groups.", "pics": null, "resp": null, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "113813310906588010348", "name": "Mrs. Rose", "time": 1450604235415, "rating": 5.0, "text": "My family and I visited Camp Butter and Egg this past summer and we had a blast! I would definitely recommend this place to anyone who's interested and having a ton of fun. There were various activities available for both adults and children. In addition, the staff was very welcoming and showcased excellent customer service.", "pics": null, "resp": null, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "107829419020097399729", "name": "Joe Sherwin", "time": 1482338528873, "rating": 5.0, "text": "I took 17 members of our leadership team here for a staff ride where we focused on teambuilding, communication, and critical thinking skills.  Susan and Ron provided an excellent environment and program to engage our staff.  From the Escape Room to the confidence courses to the zip-lining, it was a top-notch experience.  We look forward to coming back in the near future.  Great investment!", "pics": null, "resp": {"time": 1493768434345, "text": "We enjoyed having you experience our facilities and look forward to seeing you again."}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "117975922625527879049", "name": "Anthony Roberts", "time": 1497187683972, "rating": 4.0, "text": "This place has so many fun things to do. We took a group of almost 300 people and they accommodated us well. Everyone was very helpful as far as explaining the climbing gear, how to work the ziplines and laser tag. Our lunch was hamburgers and they tasted very good and the kitchen staff did a great job of moving everyone along.\n\nThe only reason this is not a five star review is that we had several from our group complain that some of the staff were rude and not friendly, almost like they really didn't want to be there. The majority of the staff went above and beyond to help us out and for that we are very thankful.\n\nI don't remember the young lady that helped us at the climbing wall in the beginning, but she was probably the best there that day. She was very nice and understanding to our group, and the majority of them had never climbed before so that was great.\n\nAlso, Ron took a group picture with his drone for us and all the kids loved it.\n\nOverall I would definitely recommend this to anyone for an event or just a fun weekend with the family.", "pics": null, "resp": null, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "100701285662622367427", "name": "halee dix", "time": 1479668188699, "rating": 5.0, "text": "Dix Family Thanksgiving has been at Camp butter &a Egg Adventures for the last 4 years. Some of us zip line and we all play laser tag on the battlefield.  The owners are so sweet. Family owned and operated. Great place for family reuinions or just a small family day of fun.", "pics": null, "resp": null, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "117315525441706091891", "name": "Brandon Stephens", "time": 1479073887178, "rating": 5.0, "text": "We have been bringing our preteens here for a 3-day 2-night retreat for the last 6 years. This year we decided to do two trips and bring two different groups. Butter & Egg is A+. The friendly staff and top notch facilities make it a prime destination for budget conscious families and groups looking for fun and adventure in a safe exciting environment. Can't wait until our next trip.", "pics": null, "resp": null, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "104990727996224262700", "name": "Christie Brantley", "time": 1535126595381, "rating": 1.0, "text": "Idk who is in charge of this place but there is a girl by the name of Bethany (I think) who was so extremely rude to my children the last time I came in... she was SO unprofessional and I can’t believe she would ever be allowed to work with children................ I used to come here all the time... never again. I would not recommend this place to anyone especially someone with children. Please take my advice... she was grouchy, rude, and disrespectful. Never again.", "pics": null, "resp": {"time": 1535128405705, "text": "I am sorry that your children had a bad experience here.  Please provide some information, as to the date and event they were here for.  My email address is ron@butterandeggadventures.com.  This will allow me to further research this matter."}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "103887855849146659311", "name": "Meagon Underwood", "time": 1528761313507, "rating": 5.0, "text": "Loved it! This is definitely a place to be entertained for hours! Ron and the B&E staff are on point!", "pics": null, "resp": {"time": 1528797282682, "text": "Meagan, we enjoyed sharing our “Fun Place” with you guys!  Thanks for coming."}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "110631167564604860534", "name": "MaryAnna Lushbough", "time": 1475354523794, "rating": 4.0, "text": "It was really fun. Had a high ropes corse and a  HUGE zip line over a pond. I went on a trip with my jrotc group with 30 other cadets and we all had a blast. The only complaint was the bunk beds are extremely squeaky. Other than that was a great place and a wonderful surroundings.", "pics": null, "resp": null, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "112567271262182788926", "name": "Elysse McKenna", "time": 1453325864211, "rating": 5.0, "text": "The zip lining course was amazing! My youth group also participated in some laser tag at Butter and Egg Adventures and had a great experience!", "pics": null, "resp": null, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "111573824719475291678", "name": "Nathan Harrelson", "time": 1496871083584, "rating": 1.0, "text": "Had a great time with everyone from our group, and a lot of cool stuff to do however, the staff could've been more friendly and happy that we were there. The majority of their staff was very rude, beginning with the main guy in charge.", "pics": null, "resp": {"time": 1496925408486, "text": "Wow, we don't get too many 1 Star Reviews at Butter and Egg Adventures.  I am sorry that your experience here yesterday, was not good.  We take all of our reviews seriously and we will address your concerns.  Here is my cell phone number, if you would like to discuss your concerns (334-670-9953)"}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "115800097350184732643", "name": "drake rollins", "time": 1497040946488, "rating": 5.0, "text": "By far the most fun place in Troy !\nShoutout to Mr. Ron and Mrs. Susan for being awesome. Great Place !", "pics": null, "resp": null, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "114665631689455224262", "name": "Charles Nelson", "time": 1480460678697, "rating": 5.0, "text": "Went with a group of friends to do the new Escape Room. Kept me on my toes and brought out the detective in me. Wonderful experience and helped me connect closer with my friends.", "pics": null, "resp": {"time": 1493768504759, "text": "Charles, we are glad you and your friends tried out our Escape Room."}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "113466733654446676074", "name": "Jared Bonebrake", "time": 1457373872380, "rating": 5.0, "text": "Cub Scout Pack 156 from Prattville AL took us to Butter and Egg Adventures and we had a blast.  At the end they asked the kids what they liked best about the day and they all started yelling out Ziplining, Laser Tag, The Giant Swing...  Then they started getting confused, wait, I liked it all.  We'll definitely be back next year!", "pics": null, "resp": null, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "108784436175378990700", "name": "Yvonne Cary", "time": 1540328997229, "rating": 5.0, "text": "Had a great time with the kids of Morningveiw elementary", "pics": null, "resp": {"time": 1540375871603, "text": "Thanks for coming to Butter and Egg Adventures and having some fun!"}, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "109426412390635878766", "name": "Scott Martin and Jill Moore", "time": 1502332444161, "rating": 5.0, "text": "It is so much fun!  Excellent facilities, lots of options, and the staff is awesome.", "pics": null, "resp": null, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "111255431384891633335", "name": "Khadija Neely", "time": 1452484316541, "rating": 5.0, "text": "Troy University softball visited today and it was an success !! Can't wait to go back !", "pics": null, "resp": null, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "111501225910420460831", "name": "Lilly Bright", "time": 1480802479304, "rating": 5.0, "text": "we used it as a team bonding weekend and it worked. we stepped out of our comfort zone and trusted each other.", "pics": null, "resp": null, "gmap_id": "0x888d934f1bf3acbd:0x909723d7919e88fb"}
{"user_id": "103850644451580329166", "name": "Kaylee Powell", "time": 1582486643682, "rating": 5.0, "text": "Great getaway for our youth group winter camp! So much to enjoy and plenty of space to roam and enjoy the outdoors!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMSLrCNwHNeeZrU_iKc6xS9qrS-rXzgXWsZpQSy=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88603267ec5813df:0xf4051f0f88273a91"}
{"user_id": "118413456303686421601", "name": "taylor ford", "time": 1531499421423, "rating": 5.0, "text": "It is a great bible summer camp! If you want something to do during the summer the go to Ponderosa Bible Camp.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOq0nIMFN3TlcQ1IFNd1SOCwerN1PGk7mp1n2tl=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88603267ec5813df:0xf4051f0f88273a91"}
{"user_id": "102155984530345203247", "name": "Zachary Hill", "time": 1543336381472, "rating": 5.0, "text": "I was a camper here and boy was it fun. It is the experience of a lifetime mixed in with learning about God's word. There are many fun activities here and the food is amazing.", "pics": null, "resp": null, "gmap_id": "0x88603267ec5813df:0xf4051f0f88273a91"}
{"user_id": "113811812813773807149", "name": "Shaddix", "time": 1600136010058, "rating": 1.0, "text": "Garbage. More like a cult than a retreat.", "pics": null, "resp": null, "gmap_id": "0x88603267ec5813df:0xf4051f0f88273a91"}
{"user_id": "108825987346811826286", "name": "cameron mcelrath", "time": 1572981110946, "rating": 5.0, "text": "A place for kids to camp and have fun with others a bible camp", "pics": null, "resp": null, "gmap_id": "0x88603267ec5813df:0xf4051f0f88273a91"}
{"user_id": "108782993988311473415", "name": "Syd & Tay's Adventures", "time": 1498789767418, "rating": 5.0, "text": "The best camp for kids of all ages. They have my complete trust. My girls are finishing up their third time here this week. All camps in this area are in the $$$$ thousands. Here it is minimal in comparison and they truly care about each child.", "pics": null, "resp": null, "gmap_id": "0x88603267ec5813df:0xf4051f0f88273a91"}
{"user_id": "110889485029572313151", "name": "Jacob Taylor", "time": 1571882323780, "rating": 5.0, "text": "Awesome  bible camp, staff is on fire for the Lord, and they love kids", "pics": null, "resp": null, "gmap_id": "0x88603267ec5813df:0xf4051f0f88273a91"}
{"user_id": "117498085182597807560", "name": "jasmine.danielle", "time": 1541728619046, "rating": 5.0, "text": "Ponderosa bible camp is somewhere good and fun for kids to go. All kids of all ages can go and they have teenagers that are very helpful the camp is really fun", "pics": null, "resp": null, "gmap_id": "0x88603267ec5813df:0xf4051f0f88273a91"}
{"user_id": "107939182868544922018", "name": "Page Johnson", "time": 1414547039749, "rating": 5.0, "text": "I have been here twice.  The people are friendly and joyful!  God's Word is taught here with love and individual attention to all who come.  Relax and feel at home here.", "pics": null, "resp": null, "gmap_id": "0x88603267ec5813df:0xf4051f0f88273a91"}
{"user_id": "113003611106882210605", "name": "Tina Harper", "time": 1532136550994, "rating": 5.0, "text": "Beautiful camp and Miss Sherry and L WM always host an amazing experience for the children to be in the presence of the Lord!", "pics": null, "resp": null, "gmap_id": "0x88603267ec5813df:0xf4051f0f88273a91"}
{"user_id": "106947722922347872892", "name": "joe defranco", "time": 1552585625522, "rating": 5.0, "text": "The kids had a great time. They'll be back.", "pics": null, "resp": null, "gmap_id": "0x88603267ec5813df:0xf4051f0f88273a91"}
{"user_id": "118282260539526301920", "name": "Arden Shanklin", "time": 1552586684884, "rating": 5.0, "text": "Spent many of my summers here. The staff invest into everything that they do for the glory of God.", "pics": null, "resp": null, "gmap_id": "0x88603267ec5813df:0xf4051f0f88273a91"}
{"user_id": "102793453255271205577", "name": "Bill Martin", "time": 1498741304559, "rating": 5.0, "text": "It's a great experience.  The camp is organized and well run.", "pics": null, "resp": null, "gmap_id": "0x88603267ec5813df:0xf4051f0f88273a91"}
{"user_id": "105231885594996485413", "name": "Jason Jackson", "time": 1524681091205, "rating": 5.0, "text": "Love this place", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOnorldGKwQ0G8U7NmnZt0x4_z1CXJFnnIS621q=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88603267ec5813df:0xf4051f0f88273a91"}
{"user_id": "109823177905844142228", "name": "David Tucker", "time": 1442164346649, "rating": 5.0, "text": "Wonderful ministry.  My son worked there and we have supported it for many years.", "pics": null, "resp": null, "gmap_id": "0x88603267ec5813df:0xf4051f0f88273a91"}
{"user_id": "101563058570137104258", "name": "cyndi marie", "time": 1529875381834, "rating": 5.0, "text": "The kids love the camp. Friendly Christian camp.", "pics": null, "resp": null, "gmap_id": "0x88603267ec5813df:0xf4051f0f88273a91"}
{"user_id": "106686214107140356848", "name": "Summer Cunningham", "time": 1529894320178, "rating": 5.0, "text": "We love the camp and ours children did also", "pics": null, "resp": null, "gmap_id": "0x88603267ec5813df:0xf4051f0f88273a91"}
{"user_id": "100858285246409240315", "name": "Dee Hinkle", "time": 1530919108771, "rating": 5.0, "text": "Great ministry with exciting activities for the campers.", "pics": null, "resp": null, "gmap_id": "0x88603267ec5813df:0xf4051f0f88273a91"}
{"user_id": "115669457797881889293", "name": "marsha robertson", "time": 1434135476847, "rating": 5.0, "text": "my grand daughter went thier she loved it", "pics": null, "resp": null, "gmap_id": "0x88603267ec5813df:0xf4051f0f88273a91"}
{"user_id": "107501195225210727727", "name": "Ray Harris", "time": 1563625237080, "rating": 5.0, "text": "Awesome place! Staff is WONDERFUL!!!!", "pics": null, "resp": null, "gmap_id": "0x88603267ec5813df:0xf4051f0f88273a91"}
{"user_id": "115292880979839302100", "name": "Patrick Cunningham", "time": 1484657037535, "rating": 5.0, "text": "A truly blessed place to be..", "pics": null, "resp": null, "gmap_id": "0x88603267ec5813df:0xf4051f0f88273a91"}
{"user_id": "118418240660502761368", "name": "Herb Wright", "time": 1566533275180, "rating": 1.0, "text": "(Translated by Google) ehhh\n\n(Original)\nEhhh", "pics": null, "resp": null, "gmap_id": "0x88603267ec5813df:0xf4051f0f88273a91"}
{"user_id": "109334692358812401505", "name": "Jon Box", "time": 1527662686702, "rating": 4.0, "text": "Outstanding staff, A-1 activities, excellent cooking fare, and the Word of God; you can't beat that!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPlqSjMuD8VvKjFH-lunQLLwiPxjbxDI0CAFIvi=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN32uQ26R50n54OfSRLbgfuKUY1BgrYecGIzmuI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOXwO5RwU2WIa2m5egtv4VvM2iPwm9uF8Cvq88M=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88620c422fd84bc3:0x416d14458e82a1e7"}
{"user_id": "107921949422617482039", "name": "Garrett Totcky", "time": 1520800355180, "rating": 5.0, "text": "An amazing retreat. Incredibly beautiful!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipONcuAMJMuNa4UUs7NE-7pVAPPvwe6vkccObPBK=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN_pbPks6nEhJGWSa3LESl3H1NXWof6ktwWeIX-=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMFwyfIMpz2Cja38VTtSZ16G-z8AxTdrWOgcjLX=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPmrSbkz0FHxe5Z4m-nzQpP3F6mNRzGO1xkMW4-=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOUUFEehluNC_bh2Gg-v-ubp8wDgtOkBssdYmKa=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88620c422fd84bc3:0x416d14458e82a1e7"}
{"user_id": "102626080836533746878", "name": "Blake Hargrove", "time": 1564103682440, "rating": 5.0, "text": "This place is absolutely wonderful. The newer Lodge is HUGE, and full with amenities. It is a great place to get away and relax, recreate, and slow down. Highly recommend going here!", "pics": null, "resp": null, "gmap_id": "0x88620c422fd84bc3:0x416d14458e82a1e7"}
{"user_id": "110490299352676577850", "name": "Timothy Francis", "time": 1574208090407, "rating": 5.0, "text": "Wonderful place to retreat! Great for youth groups.", "pics": null, "resp": null, "gmap_id": "0x88620c422fd84bc3:0x416d14458e82a1e7"}
{"user_id": "107639440518346226534", "name": "Phyllis Harris", "time": 1571145822299, "rating": 5.0, "text": "Beautiful and peaceful setting and no detail was overlooked when it comes to comfort!", "pics": null, "resp": null, "gmap_id": "0x88620c422fd84bc3:0x416d14458e82a1e7"}
{"user_id": "111046932353189512448", "name": "Stan Gunselman", "time": 1533377627042, "rating": 5.0, "text": "Beautiful facility and extremely friendly staff. Wonderful place for group gatherings. The dinner was like a delicious home-cooked meal. I highly recommend this event venue.", "pics": null, "resp": null, "gmap_id": "0x88620c422fd84bc3:0x416d14458e82a1e7"}
{"user_id": "115464751968377668890", "name": "Andrew Walker", "time": 1548743491234, "rating": 5.0, "text": "Really great activities and a really great location. Clean amd well kept bunk houses and dining areas made for a easy and relaxing experience.", "pics": null, "resp": null, "gmap_id": "0x88620c422fd84bc3:0x416d14458e82a1e7"}
{"user_id": "105112551906698278679", "name": "Ashley Elmore", "time": 1521060976199, "rating": 5.0, "text": "The owners, managers, and staff are so friendly and helpful. The new addition is absolutely beautiful, homey, and comfortable. Great place for a church retreat, family reunion, or other weekend gathering.", "pics": null, "resp": null, "gmap_id": "0x88620c422fd84bc3:0x416d14458e82a1e7"}
{"user_id": "107866173494292969420", "name": "Andres Martinez", "time": 1553823672669, "rating": 4.0, "text": "(Translated by Google) Nice place to visit\n\n(Original)\nBonito lugar para visitar", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNbaKDE3f3yH_FMVBUDXnLCGipdDBaSoNX4_fYx=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88620c422fd84bc3:0x416d14458e82a1e7"}
