{"user_id": "105827321006404486043", "name": "Belita Faki", "time": 1628028858579, "rating": 5.0, "text": "Dr. Goli is extremely detailed and very caring. She always listens to me and answer any questions I might have. I have a not so well known illness and she kept treating me and testing until she knew exactly what my illness was. I was also relieved that her first recommended treatment is the best treatment known for my illness. She also diagnosed my bone density deficiency correctly before any other doctor. I highly recommend her.", "pics": null, "resp": {"time": 1628083151949, "text": "Thank you for taking the time to leave a review for us. It is our goal to provide our patients with the best possible experience. Your recommendation means so much to us.  Thank you again for taking the time to share your comment. Have a great day!"}, "gmap_id": "0x888917a230879e41:0x9c0e710e70d56ae2"}
{"user_id": "111264842034269143719", "name": "charles kukal", "time": 1626461455005, "rating": 5.0, "text": "Greeted nicely  Dr Goli was kind and courteous as usual. She listened to me and my history.  Was concerned for my well being", "pics": null, "resp": {"time": 1626465079801, "text": "We really appreciate your feedback!"}, "gmap_id": "0x888917a230879e41:0x9c0e710e70d56ae2"}
{"user_id": "103080083665839285460", "name": "Amy Stricklin (Amy Bibb Stricklin)", "time": 1620430370519, "rating": 5.0, "text": "Very straight and to the point.  The patient portal makes it easy to always stay in touch with your doctor.  They always address your needs promptly.", "pics": null, "resp": {"time": 1620613257513, "text": "Hello there, we appreciate you taking the time to leave us this feedback."}, "gmap_id": "0x888917a230879e41:0x9c0e710e70d56ae2"}
{"user_id": "113394305373153312590", "name": "Cynthia Crawford", "time": 1623872500654, "rating": 5.0, "text": "Dr Goli has been my dr for a short time but she has gotten  more done in my case. She is persistent and very concerned on finding the cause. I really appreciate her.", "pics": null, "resp": {"time": 1623877310274, "text": "Hello, thank you for your comment! We love to hear about these experiences!"}, "gmap_id": "0x888917a230879e41:0x9c0e710e70d56ae2"}
{"user_id": "105919418667271079389", "name": "Savannah Cook", "time": 1624007210769, "rating": 2.0, "text": "I felt a little disrespected in my visit. Not by the office staff, but sadly by Dr. Goli. I would ask valid questions, she made me feel a bit dumb and bothersome for asking.", "pics": null, "resp": {"time": 1624022050415, "text": "We would like the opportunity to address your concerns. Please reach out to us directly at 205-971-3342 when you have a chance. Thank you, and we look forward to hearing from you."}, "gmap_id": "0x888917a230879e41:0x9c0e710e70d56ae2"}
{"user_id": "115790964405024345557", "name": "Yoruba Harris", "time": 1623955874925, "rating": 5.0, "text": "Dr. Goli is a very good doctor; concerned and easy to talk to. This is coming from someone who has had absolutely horrible experiences with rheumatologists. She has been a very steady pair of tires on this very slippery road of pain and uncertainty.", "pics": null, "resp": {"time": 1624022402250, "text": "Thank you for your kind words and this wonderful review!"}, "gmap_id": "0x888917a230879e41:0x9c0e710e70d56ae2"}
{"user_id": "106849418624812342411", "name": "Pam Barnett", "time": 1622784165799, "rating": 5.0, "text": "I love Dr. Goli! She takes time to listen and see what needs to be done.", "pics": null, "resp": {"time": 1622810852396, "text": "We strive to provide great experiences. Thank you for your feedback!"}, "gmap_id": "0x888917a230879e41:0x9c0e710e70d56ae2"}
{"user_id": "106288224652561710024", "name": "Nikita Smith", "time": 1605312552275, "rating": 5.0, "text": "I love Dr Goli. She listens and then gives you feedback. Answered your questions in a way you can understand. Great doctor.", "pics": null, "resp": {"time": 1605536675467, "text": "Patient satisfaction is our top priority! Thank you for the star rating."}, "gmap_id": "0x888917a230879e41:0x9c0e710e70d56ae2"}
{"user_id": "101425971455118038050", "name": "Jeff Spahn", "time": 1607367674963, "rating": 5.0, "text": "Professional Services provided, Good Staff, Dr. Goli is very nice and listens to your issues and has the no how to get you threw your needed care.", "pics": null, "resp": {"time": 1607370713668, "text": "Our staff strive to provide the best care and experiences. Thank you for your comment!"}, "gmap_id": "0x888917a230879e41:0x9c0e710e70d56ae2"}
{"user_id": "113533340431768275849", "name": "Kathy and Hannon Russell", "time": 1618250107990, "rating": 5.0, "text": "Very professional and caring of her patients", "pics": null, "resp": {"time": 1618264171548, "text": "Thank you; we appreciate your feedback!"}, "gmap_id": "0x888917a230879e41:0x9c0e710e70d56ae2"}
{"user_id": "108382032847332502925", "name": "Lori Brown", "time": 1618103703826, "rating": 5.0, "text": "Dr. Goli is very kind. She listens and isn’t in a hurry to get out. She has helped me so much.", "pics": null, "resp": {"time": 1618233196338, "text": "Thank you; we appreciate your feedback!"}, "gmap_id": "0x888917a230879e41:0x9c0e710e70d56ae2"}
{"user_id": "101932974878077694480", "name": "Brenda Hunter", "time": 1608058253814, "rating": 5.0, "text": "My visit was safe and I  love the ease of parking.", "pics": null, "resp": {"time": 1608129050399, "text": "Thank you so much again for your feedback! We hope you have a great day!"}, "gmap_id": "0x888917a230879e41:0x9c0e710e70d56ae2"}
{"user_id": "111136096483247220374", "name": "L M Russell", "time": 1605554854223, "rating": 5.0, "text": "Great tele-health experience with Dr. P. Goli !!\nGreat experience, all together !", "pics": null, "resp": {"time": 1605556247329, "text": "We strive for 100% satisfaction, and we love to hear about these positive experiences!"}, "gmap_id": "0x888917a230879e41:0x9c0e710e70d56ae2"}
{"user_id": "103381837541656412226", "name": "Calvin Osborne", "time": 1601530735276, "rating": 1.0, "text": "The office staff is horrible, I can’t believe that dr Goli knows how bad her staff is and does nothing about it! From her nurse, the front office staff and office manager totally incompetent", "pics": null, "resp": {"time": 1601558180982, "text": "It is disappointing to learn of negative experiences. Feedback helps us improve and we would like to learn more about how we can make this better. We would like the opportunity to address your concerns. Please reach out to us directly at 205-971-3021 when you have a chance. Thank you, and we look forward to hearing from you."}, "gmap_id": "0x888917a230879e41:0x9c0e710e70d56ae2"}
{"user_id": "102631299539217937313", "name": "Brianne MC", "time": 1619805305279, "rating": 5.0, "text": "Love Dr. Goli", "pics": null, "resp": {"time": 1619808355093, "text": "Thank you; we appreciate your feedback!"}, "gmap_id": "0x888917a230879e41:0x9c0e710e70d56ae2"}
{"user_id": "112032370551923493685", "name": "Marcus Perkins Sr", "time": 1614363452562, "rating": 5.0, "text": "Was told to come to back and get out of the lab chair in so I left and will not return . The staff is horrible and think you are stupid.", "pics": null, "resp": {"time": 1614553130058, "text": "We would like the opportunity to address your concerns. Please reach out to us directly at 205-971-3021 when you have a chance. Thank you, and we look forward to hearing from you."}, "gmap_id": "0x888917a230879e41:0x9c0e710e70d56ae2"}
{"user_id": "111730692863465566594", "name": "Paul Michalik", "time": 1594931521261, "rating": 5.0, "text": "The visit went very well.  Doctor Goli is a caring, sincere and understanding person.", "pics": null, "resp": {"time": 1594938466361, "text": "Thank you for your kind words and this wonderful review!"}, "gmap_id": "0x888917a230879e41:0x9c0e710e70d56ae2"}
{"user_id": "114378041986162379007", "name": "Catherine Shaw", "time": 1568062299600, "rating": 5.0, "text": "I have been with Dr. Goli over twenty years. She have seen me through cancer treatment. Which it was her that find out that one of me chemo medicine was the cause of my severally joint pain. She is great and take time to listen and evaluate my symptoms. She make you feel that you are her only patient and she will be there for you.", "pics": null, "resp": {"time": 1568073738143, "text": "Catherine Shaw, thank you for your kind words and this wonderful review! We appreciate you taking the time to let us know how we did. We hope you have a great day!"}, "gmap_id": "0x888917a230879e41:0x9c0e710e70d56ae2"}
{"user_id": "114624396619395173895", "name": "Dedra Cagle", "time": 1568837701808, "rating": 5.0, "text": "Dr. Goli doesn't rush through a diagnosis or take a diagnosis that another Dr told you as fact. This is a good thing. She gets all of the previous medical records and blood work and makes a plan. For this, I am grateful.", "pics": null, "resp": {"time": 1568931814782, "text": "Dedra Cagle, thank you for your kind words and this wonderful review!"}, "gmap_id": "0x888917a230879e41:0x9c0e710e70d56ae2"}
{"user_id": "115623820861968927683", "name": "Elizabeth Johnson", "time": 1581106796466, "rating": 5.0, "text": "Love Dr Goli. She is so compassionate and really listens!", "pics": null, "resp": {"time": 1581115938059, "text": "Elizabeth Johnson, thank you for your kind words and this wonderful review!"}, "gmap_id": "0x888917a230879e41:0x9c0e710e70d56ae2"}
{"user_id": "107777102195178750630", "name": "Barbara Smith", "time": 1606160607612, "rating": 5.0, "text": "I love Dr. Goli!!  She's always taken the time to listen to me and is a very compassionate doctor which let's me know she truly cares for me not just as a patient but also on a personal level as well.  Her wait time is very, very short which is a huge plus when most doctor visits (general or speciality) take hours.  I drive over an hour and 20 minutes to see her (sometimes two hours if traffic is bad) and will continue to do so.  She has gotten 5 stars in my book since the first visit I made to her over two years ago.", "pics": null, "resp": {"time": 1606227650443, "text": "We strive for 100% satisfaction, and we love to hear about these positive experiences! Thank you for your kind words and this wonderful review!"}, "gmap_id": "0x888917a230879e41:0x9c0e710e70d56ae2"}
{"user_id": "115301692027863517591", "name": "Milton Frank Duke Jr.", "time": 1581547870734, "rating": 5.0, "text": "It was a good Dr visit", "pics": null, "resp": {"time": 1581603181203, "text": "Hello Milton Frank Duke Jr., thank you; we appreciate your feedback!"}, "gmap_id": "0x888917a230879e41:0x9c0e710e70d56ae2"}
{"user_id": "102027349470493346880", "name": "Bejai Phillips", "time": 1572561500706, "rating": 5.0, "text": "Ww", "pics": null, "resp": {"time": 1572625133833, "text": "Bejai Phillips, thank you for the star rating!"}, "gmap_id": "0x888917a230879e41:0x9c0e710e70d56ae2"}
{"user_id": "106072784982422878188", "name": "Dewey Green", "time": 1520257610036, "rating": 5.0, "text": "Awesome Dr", "pics": null, "resp": null, "gmap_id": "0x888917a230879e41:0x9c0e710e70d56ae2"}
{"user_id": "100199861040353856532", "name": "DeAndre Scott", "time": 1612558413394, "rating": 5.0, "text": "You cannot find a more compassionate professional than Dr. Gadea! He absolutely knows his work and his bedside manner is impeccable. As  a patient of his of over 3 years, not once has my service not been excellent. His staff is amazing and by the grace of God the results have been as well. I cannot recommend a finer multi specialist provider. To get to see him as a first time patient may take you a little but it will be well worth the wait.", "pics": null, "resp": {"time": 1613777724274, "text": "Thank you for sharing! We are honored to provide compassionate care to the people of Central Alabama."}, "gmap_id": "0x888e803f6c3e914f:0xbe209d1e504b78e6"}
{"user_id": "114860773726140915655", "name": "Betty Gilbert", "time": 1603484472096, "rating": 5.0, "text": "Friendly staff and Dr. Gadea always listens to what I have to say and shows great concern. He ask questions to ensure that you have covered everything that is bothering you. He's knowledgeable about my issues and up to date on my file and care. He takes time with his patients and addresses every area of concern.", "pics": null, "resp": {"time": 1603856322970, "text": "Compassionate care is the goal of all that we do, Betty. Thank you for sharing this kind review with us."}, "gmap_id": "0x888e803f6c3e914f:0xbe209d1e504b78e6"}
{"user_id": "110449918626469479530", "name": "RONNIE WATKINS", "time": 1613070893493, "rating": 5.0, "text": "My appointment started on time.  The assistant was friendly and knowledgeable.   Dr. Gadea was prompt, through, and friendly.", "pics": null, "resp": {"time": 1548086979669, "text": "Mr. Watkins - thank you so much for your review. It is our honor to be your healthcare provider. If there is anything further we can do for you, please don't hesitate to call us at (334) 613-7070."}, "gmap_id": "0x888e803f6c3e914f:0xbe209d1e504b78e6"}
{"user_id": "114664941668996482941", "name": "Lisa Mcduffie", "time": 1608663524844, "rating": 5.0, "text": "Dr Gadea is an awesome Doctor.  He  truly cares for his patience.  I would not go anywhere else", "pics": null, "resp": {"time": 1608753566354, "text": "We are honored to provide compassionate care for the people of the River Region and truly appreciate this glowing review. Thank you, Lisa."}, "gmap_id": "0x888e803f6c3e914f:0xbe209d1e504b78e6"}
{"user_id": "103295608124226574156", "name": "Deb Schultz", "time": 1608867383760, "rating": 5.0, "text": "The office was clean and all covid compliance measures were met..  The appointment went well and Dr. Gadea was a good listener.  I hope this office will help me manage my RA pain and treatment.  Lab work was ordered and the lab is in the same building.  He also scheduled an appt for some physical therapy.  I was impressed and look forward to more guidance.  I", "pics": null, "resp": {"time": 1611006243871, "text": "We are honored to provide excellence in care for the people of Central Alabama. Thank you for taking time to share this excellent feedback."}, "gmap_id": "0x888e803f6c3e914f:0xbe209d1e504b78e6"}
{"user_id": "105210053142372990208", "name": "Angie Hicks", "time": 1624050884896, "rating": 1.0, "text": "If I could give lower I would....I really thought he was gonna be the one that helped me...instead I almost died from the drug he had me on...I stopped it!!  He never checked up on me...never returned phone calls...I left messages for 3 months...no call back.  He is an absolute joke!!!!  I ran as fast as I could and didn't look back!!!!", "pics": null, "resp": {"time": 1602771803830, "text": "Angie, thank you for the glowing review. We are honored to care for the people of Central Alabama."}, "gmap_id": "0x888e803f6c3e914f:0xbe209d1e504b78e6"}
{"user_id": "106751309161599102703", "name": "Angela Riddle", "time": 1574801380183, "rating": 5.0, "text": "Very respectful and helpful. He's a good listener and he asked me questions. He is genuine. Better doctor than most i seen in the past. Made me feel comfortable to explain whats going on with my problems i am having.", "pics": null, "resp": {"time": 1599859635326, "text": "Arturo, thank you for this glowing review! It is our honor to serve the people of Central Alabama."}, "gmap_id": "0x888e803f6c3e914f:0xbe209d1e504b78e6"}
{"user_id": "106429020889942828258", "name": "Linda Evans", "time": 1597934104937, "rating": 5.0, "text": "He knows had bad my pain is. Very  good doctor.", "pics": null, "resp": {"time": 1599859584925, "text": "Linda, thank you for this kind review. We value your insight and are honored to serve our patients in the River Region."}, "gmap_id": "0x888e803f6c3e914f:0xbe209d1e504b78e6"}
{"user_id": "113065899577559558263", "name": "Erica Butler", "time": 1601266403989, "rating": 5.0, "text": "I was very pleased with my visit on May 8, 2019.  Dr. Gadea was very thorough and listened to my concerns.", "pics": null, "resp": {"time": 1557763565569, "text": "Ms. Butler - thank you so much for your review. It is our honor to be your healthcare provider. If there is anything further we can do for you, please don't hesitate to call us at (334) 613-7070."}, "gmap_id": "0x888e803f6c3e914f:0xbe209d1e504b78e6"}
{"user_id": "113445638484202547919", "name": "Donna Ennis", "time": 1544213079601, "rating": 5.0, "text": "Dr Gadea listens and understands your concerns. He takes time with his patients and addresses every area of concern.", "pics": null, "resp": {"time": 1544459740358, "text": "Ms. Kufleitner - thank you so much for your review. It is our honor to be your healthcare provider. If there is anything further we can do for you, please don't hesitate to call us at (334) 613-7070."}, "gmap_id": "0x888e803f6c3e914f:0xbe209d1e504b78e6"}
{"user_id": "113570428767917366418", "name": "Vanessa Reed", "time": 1541638878044, "rating": 5.0, "text": "Dr Gadea and other staff members are great !", "pics": null, "resp": {"time": 1541704168423, "text": "Ms. Reed - thank you so much for your review. It is our honor to be your healthcare provider. If there is anything further we can do for you, please don't hesitate to call us at (334) 613-7070."}, "gmap_id": "0x888e803f6c3e914f:0xbe209d1e504b78e6"}
{"user_id": "104145186126798265915", "name": "Miguel Moreno", "time": 1538417828861, "rating": 5.0, "text": "Great Doctor, I would recommend...", "pics": null, "resp": {"time": 1538410116968, "text": "Mr. Moreno - thank you so much for your review. It is our honor to be your healthcare provider. If there is anything further we can do for you, please don't hesitate to call us at (334) 613-7070."}, "gmap_id": "0x888e803f6c3e914f:0xbe209d1e504b78e6"}
{"user_id": "100188475556070003347", "name": "David Sweet", "time": 1625257916749, "rating": 1.0, "text": "These are some of the rudest people l have ever encountered. You cannot get anywhere with anyone in person, or on the phone. They like to hide behind the phone so they can continue to be rude and then put you on hold for so long in hopes that you will hang up.\n\nI understand there is construction going on, but why would you allow them to park their machinery or put their supplies in the handicap spots. Handicap parking is already limited, especially van accessible spots.", "pics": null, "resp": {"time": 1625674720666, "text": "Hi Mr. Sweet, we would like to discuss this matter further. Will you please call our office at 414-5900 and ask to speak with the operations manager so that we can help resolve any issues that may be. All the best, and we look forward to hearing from you soon."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "114122180049592975248", "name": "Abigail Laird", "time": 1628755521857, "rating": 1.0, "text": "I've had constant pain for years now and because I'm young the doctors feel \"uncomfortable\" trying more serious treatments even though I'm losing my whole life to this pain. For over 2 years I have had to wait 1 to 2 months for my doctors appointments and every appointment they tell me the same thing and go in circles with me, refusing to progress treatment. On top of that when they reply to reviews they copy and paste the same message over and over again. They are not listening to me and they won't listen to you. They don't care.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "100072144027300149007", "name": "V White", "time": 1623944197402, "rating": 1.0, "text": "At first doctor was nice the first few visits. Then the doctor started to act like he did want to be bothered. Came in leaned against the cabinet acting like I was a waste of his time. Yesterday stated he didn’t keep track of my health that I saw specialist for that let them keep track of my seizures and heart. He was only there for general things. But yet he is required by law and my insurance to keep track of who I see and my medical records. To which he demanded I find another doctor all because my disability lawyer asked if he could give his opinion on a form since he was to be talking with all doctors he referred me to. The billing and customer service department of the group believe that I got what I deserve and the doctor is correct. I am a person that has seizures and has AFib and has not been driving since a wreck to where this is the second general practitioner has refused to listen as a doctor should. And force me to find another doctor and the cost of losing everything because of they don’t care.", "pics": null, "resp": {"time": 1624291869282, "text": "We would like to discuss this matter further, so we encourage you to call our office at 414-5900 and ask to speak with the operations manager so that we can help resolve any issues that may be. All the best, and we look forward to hearing from you soon."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "110408389021647933884", "name": "The Sullivans", "time": 1616935158158, "rating": 5.0, "text": "The doctors are very thorough! The nurses, lab techs, and the entire staff are very professional, helpful, friendly.\nThe Follow my Health app that the doctor office use is very helpful to me. I can keep up with all of my lab results and be made aware of any changes in minutes.\nI would highly recommend A.M.G.", "pics": null, "resp": {"time": 1621282650025, "text": "Thank you for the kind words and the 5-star review. Our healthcare team takes great pride in creating an environment where patients receive quality, individualized and compassionate medical care. Thanks again for the feedback!"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "108259019381558190450", "name": "Miss Shauntay", "time": 1618478030563, "rating": 1.0, "text": "If you have a bill you can’t even make an appointment. They are going to constantly push that bill in your face. Not only that Dr. Carlos doesn’t care about his patients. More than once he’s come in seen me for 2 minutes and dumped me out. I didn’t feel that I had answers or anything. He just gets his money and doesn’t care. He doesn’t take your symptoms serious. Over a year ago I saw him about symptoms he told me I just needed to lose weight. Long story short I nearly died because of a appendicitis. He doesn’t investigate anything. He writes prescriptions and referrals wrong also. They will get your money for sure! But care is below average. Nurses are nice and fast though", "pics": null, "resp": {"time": 1621282602343, "text": "We would like to discuss this matter further, so we encourage you to call our office at 414-5900 so that we can help resolve any issues that may be. All the best, and we look forward to hearing from you soon."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "105839049446841841103", "name": "Trevor Bell", "time": 1598745913158, "rating": 1.0, "text": "I am appalled how my mother has been treated and even myself as I was trying to get some answers related to her overall well being. Dr Burch was not concerned about patient care and did not give me the time a day to discuss some concerns I had. After trying to speak with the Practice Administrator, I was given to HR.  If you go here, Do not except phones calls back timely nor compassion regarding your loved ones well being. They should really evaluate their “core values” and conduct some S E R V I C E training within their office and staff.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "106658978299455795244", "name": "Janelle Presnall Barbato", "time": 1597967399917, "rating": 5.0, "text": "Well you might have a little wait time but the doctors are outstanding! I love it! These doctors still come visit you in the hospital!", "pics": null, "resp": {"time": 1598281426049, "text": "Thank you for the kind words and the 5-star review, Janelle. Our healthcare team takes great pride in creating an environment where patients receive quality, individualized and compassionate medical care. Thanks again for the feedback!"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "113802026061945133288", "name": "Terri Gaal", "time": 1596136311687, "rating": 5.0, "text": "My family and myself have seen numerous Dr.'s in this group.  They are caring and help address your health issues.  The entire staff is friendly and helpful.", "pics": null, "resp": {"time": 1597683570940, "text": "Hi Terri, thank you for the kind words and the 5-star review. Our healthcare team takes great pride in creating an environment where patients receive quality, individualized and compassionate medical care. We're glad that we can serve and meet the healthcare needs for you and your family."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "114547424449841324436", "name": "RJ Clark", "time": 1594938400854, "rating": 1.0, "text": "This place is ridiculous. Every time I go I have to wait over an hour for an appointment at 2 that will last maybe 10 minutes. After seeing the doctor finally at around 4:45, I was sent to get lab tests and then an x-ray. Lucky for me after I was able to get my lab done it was 5:15. Which is when the x-ray closes. Waste of time", "pics": null, "resp": {"time": 1596136494822, "text": "We value our patients greatly and ask you and all of our patients to feel free to provide feedback about our services. We really would like to discuss this matter further so that we can help resolve any issues that may be. Would you mind speaking with our operations manager about your experience?"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "114049596922624930484", "name": "Butch Ladner", "time": 1592501351332, "rating": 3.0, "text": "I like all the doctors that I have seen over the years but I quit going there after I scheduled the 1st blood work appointment of the day. After about 15 minutes past my appointment while sitting in the waiting room, I called and knocked on the door... no response. I had to be at work so I left. Later I filled out forms to have my records sent to another facility but they were apparently never transferred.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "117411607479349393115", "name": "Deanna Davis", "time": 1597868154706, "rating": 5.0, "text": "I love the docs n staff and the fact that they are right at my hospital", "pics": null, "resp": {"time": 1606849123022, "text": "Thank you for the kind words and the 5-star review, Deanna. Our healthcare team takes great pride in creating an environment where patients receive quality, individualized and compassionate medical care. Thanks again for the feedback!"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "103597519588746451759", "name": "Kent Busby", "time": 1599001793278, "rating": 5.0, "text": "Fast and efficient!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMDuQ9I70L6wSoG2c4a3s9XRbW8YcHKdw-TiBlb=w150-h150-k-no-p"]}], "resp": {"time": 1606848995468, "text": "Thank you for the kind words and the 5-star review, Mr.Busby. Our healthcare team takes great pride in creating an environment where patients receive quality, individualized and compassionate medical care. Thanks again for the feedback!"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "108999883754558901602", "name": "Sarah S", "time": 1596091461530, "rating": 1.0, "text": "If you want to waste your time using this Dr's office then this is the place for you! I have NEVER in my life dealt with a medical office with such poor service. Whenever you call this office to leave very important information concerning your health, asking for a NURSE to call you, be prepared to wait days (thats even if you get a return phone call) The Dr seemed like a very concerned physician however his nurses like to treat patients like their the Doctor! I had one nurse who called me back after 4 days and she tried to tell me she knew exactly what the Doctor had ordered me to do with a certain medication and when i ask her how she knew, she tried to tell me she was in the room with the Dr. which I called her out on because she wasnt in the room with the dr and I. A lady by the name of Jordan was, this ladies name was Gloria! When I confronted her and told her NO MA'AM you were not in the room Jordan the dr and myself were the only 3 people in there that day, she put le on hold and later came back to the phone with a different attitude, but informed me that my Dr was out of town and guess what HE HAD NO FILL INS.. I have worked in the medical field and bo that Drs cant just leave their patients without ANYONE to help them with their medical needs!! Long story short I went without my medication from Thursday until the following Thursday! 7 FULL DAYS!! It was no big deal to this lady at all!! I have gladly found another physician and I honestly wouldn't take my animals to this office!! So again if you want to deal with getting the run around THIS IS YOUR PLACE, IF NOT DONT BOTHER EVEN MAKING AN APPOINTMENT!! I will be reporting this medical office!! Thanks for wasting my time Alabama Medical Group!! Maybe dr Rubenstein needs to stick with being the mayor and retire at being a physician!!!", "pics": null, "resp": {"time": 1596136407942, "text": "Hi Sarah,we value our patients greatly and ask you and all of our patients to feel free to provide feedback about our services. We really would like to discuss this matter further so that we can help resolve any issues that may be. Would you mind speaking with our operations manager about your experience?"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "109278907505601771623", "name": "Janet Newburn", "time": 1580262751417, "rating": 2.0, "text": "I don’t normally write online reviews, but this group is terrible.  The Doctor’s and staff are nice, but lack professionalism. I see Rubinstein at the Saraland location and Siegel at the Springhill location.\nThe wait times are off the charts. When you ask why you are waiting so long, they either just look at you or push you to another waiting area. My time is just as important as theirs. I was at the Saraland location today for over 2 hours. I saw Rubinstein for approx. 4 minutes. Routine checkup.\nThe staff has not the first clue about what’s going on medically with patients.  I have been called with incorrect information regarding my results, I have had to tell them what they were supposed to be doing per visit with Doctors.  I have been scheduled for a procedure that was ill prepared then I was forgotten.\nOffice Managers, are you reading these reviews?\nPatient care should come first and far most at all times.  The staff in these offices should be more concerned with this than what they are having for lunch.\nI walked out after seeing Rubinstein today after I was left sitting to have blood drawn. (I know how long it takes to draw blood)\nI’m sure they couldn’t care less! Sooner or later this junk is going to catch up with y’all.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "100877325519879114300", "name": "Howard Rhodes", "time": 1594666879937, "rating": 1.0, "text": "They wouldn't call in my blood pressure medication while I was out of town, And had much attitude about it !  So I had to find a new doctor.", "pics": null, "resp": {"time": 1596136522089, "text": "Hi Mr. Rhodes, value our patients greatly and ask you and all of our patients to feel free to provide feedback about our services. We really would like to discuss this matter further so that we can help resolve any issues that may be. Would you mind speaking with our operations manager about your experience?"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "103772813478267092741", "name": "Becky Kidd", "time": 1566764803412, "rating": 5.0, "text": "I am so very thankful to Dr. Jonathan Siegel and his wonderful staff. Each person was extremely helpful, professional, and caring to me, from the initial consultation with Dr. Siegel, to follow up after my procedure.", "pics": null, "resp": {"time": 1566930659186, "text": "Thank you for the kind words, Ms. Kidd. We're glad to have Dr. Siegel as a member of our team and are so glad you shared your feedback with us."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "115645794739993181607", "name": "SHANTA EDWARDS", "time": 1568308488496, "rating": 1.0, "text": "This is the worst group in the Bay Area PERIOD!! I was turned away because I couldn't pay $110 on a previous bill that didn't even belong to the Dr I was seeing! I made arrangements on this bill and have been paying monthly but this DR refused to see me still!! All the money that I've paid and my insurance have paid and this is how I'm treated!!! I'm not asking for special treatment, just trying to be treated!\n\nI am in severe pain and I am ashamed for this group that they would care more about money than they would helping care for their patient! What kind of medical practice does this!!!!! Only money hungry ones. I will NEVER come back to this establishment nor will I recommend them to anyone. I am going to share this story on social media as well, to let people see how these practices are letting patients suffer because of the almighty green dollar. It is not right nor is it fair. I could see if I had NEVER paid them anything, but to pay every month even with me not even working, makes this situation not only sad but despicable and down right disheartening.  Thanks so much Alabama Medical Group and your doctor's for always putting money first over patients!!!!!!!!!!!", "pics": null, "resp": {"time": 1568318194483, "text": "Hi Ms. Edwards, on behalf of Alabama Medical Group I apologize that you feel this way. I've spoken with the customer service rep who assisted you today and I have reviewed your file and there seems to be some inaccuracy's with your statement that I'm hoping we can clarify. If you will please call our office at 414-5900, our operations manager would like to discuss your visit in further detail. Thank you and we look forward to hearing from you soon."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "111948156850650712197", "name": "Kaitlyn Franklin", "time": 1566523939687, "rating": 1.0, "text": "These doctors are the most neglecting, ill mannered doctors I have ever come across and not to mention horrible communication and listening skills. And then they’ll continue to pass you around to many other doctors because they don’t have the means to help. My family and I decided to pull from this doctors office today. Never again.", "pics": null, "resp": {"time": 1566930495208, "text": "Hi Ms. Franklin, we value our patients greatly and ask you and all of our patients to feel free to provide feedback about our services. With that being said, you left no details about your experience that resulted with you leaving us with a 1-star review. We really would like to discuss this matter further, so I would like to encourage you to call our office at 414-5900 so that we can help resolve any issues that may be. All the best, and we look forward to hearing from you soon."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "102470176151313839239", "name": "Karen Bozant", "time": 1516898167158, "rating": 5.0, "text": "The doctors are great and the lab techs work quickly. I'm amazed that I don't have long waits like other places. They get to know you and not just push you through their office.", "pics": null, "resp": {"time": 1517335519319, "text": "Thank you for the feedback Ms. Bozant!"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "102065393161772879398", "name": "Deanna Davis", "time": 1557694251896, "rating": 5.0, "text": "The docs are wonderful caring kind people. The staff are precious. A blessing!", "pics": null, "resp": {"time": 1557752797132, "text": "Thank you for the 5-star review and the positive feedback. We are so pleased to hear such kind words about our staff."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "101834874133775682304", "name": "Cliff Wright, Sr.", "time": 1487116906874, "rating": 5.0, "text": "One stop shop for all things internal. Have seen many of the doctors for various conditions and treatments and all are knowledgeable and professional. My personal favorite is Dr. Don Sanders; you won't find a more caring and compassionate doctor anywhere, especially one that actually listens to (not just hears) his patients. Front desk staff does leave a lot to be desired as they are young and tend to be rude and impatient, but you're not there to see the 'staff' so just blow it off.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "108583936746234276700", "name": "Betty White", "time": 1527424613482, "rating": 5.0, "text": "Hands down the best group I have been with! I would definitely recommend this place as not only the best on the coast, but probably the best in the country!", "pics": null, "resp": {"time": 1531946217349, "text": "Thank you for the kind words, Mrs. White. Our healthcare team at Alabama Medical Group takes great pride in creating an environment where patients receive quality, individualized and compassionate medical care."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "100660206795587994091", "name": "Caitlin Brown", "time": 1565360593343, "rating": 1.0, "text": "The WORST doctors office I’ve ever dealt with. These people are ignorant and incompetent. Horrible horrible staff, do NOT recommend .", "pics": null, "resp": {"time": 1565629726845, "text": "Hi Ms. Brown, we value our patients greatly and ask you and all of our patients to feel free to provide feedback about our services. With that being said, you left no details about your experience that resulted with you leaving us with a 1-star review. We really would like to discuss this matter further, so I would like to encourage you to call our office at 414-5900 so that we can help resolve any issues that may be. All the best, and we look forward to hearing from you soon."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "104845393980734080516", "name": "Lacey McElderry", "time": 1462815853800, "rating": 5.0, "text": "This is a great doctor's office. The staff and the care that you will receive is top notch. I highly recommend the delicious dietitian program.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "112527433897831320353", "name": "Kacey Young", "time": 1559852828371, "rating": 1.0, "text": "Waited two hours for my mother to see a doctor for a scheduled appointment. Then the front desk was very rude. Never apologized for the two hour wait. They are overbooked. Shouldn’t have to wait all day for appointment.", "pics": null, "resp": {"time": 1560178187698, "text": "Hi Ms. Young, we're sorry to hear that your mother's appointment ran late, but unfortunately due to the nature of our business sometimes this happens. With that being said, we never want our patients to be unhappy and we apologize for the unpleasant experience. If you would like to discuss this matter further or if we can reschedule your mothers appointment, please call 414-5900 and ask to speak with our operations manager and she will get her scheduled."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "108876214357831787440", "name": "R.Allen Crowe", "time": 1550779389888, "rating": 1.0, "text": "So I just retired from the United States Navy after 28 years of service.  My family and I moved to Mobile, Alabama for our last move as we intend to live here for the rest of our lives.  Well as in any place you live there are many good things and there are not so good things that you experience.  We just came across a not so good thing and that is the Alabama Medical Group, P.C.  We were only with this PCM and the medical group for 3 or 4 months when we received in the mail a letter from them dismissing one of my family members.  The letter did not state any reason why only that they “need to do this from time to time.”  When asked why our family member was dismissed their representative would not provide a reason and on top of that they were rude during our phone conversation.  As a Navy Captain (retired) who has been to many places in this world along with my family who have been with me through all of that,  this has been the most disappointing experience of my career and was upsetting for my family members.  As a result of this,  my entire family has now changed PCMs.  I hope this feedback will help the management of Alabama Medical Group to self reflect and make some changes for the better. In the meantime,  I would not recommend this facility if you are a veteran as I assume they do not hold the veteran status as important.  That is strictly my impression.", "pics": null, "resp": {"time": 1551286970550, "text": "Capt. Crowe, I've looked into the situation involving your wife's experience at our practice and due to HIPAA compliance regulations there is very little I can comment about her visit and post publicly on the internet. It's unfortunate to hear that she had a negative experience, and I would like to encourage her to call our office at 414-5900 and ask to speak to the operations manager or the marketing director so we can discuss the allegations in your comments above. One comment that I can, and would like to address, is your statement saying that we do not support veterans. That simply is not true. In fact, several of our physicians currently serve in the military, along with members of our staff, as well as their spouses. We appreciate their service to our country along with yours and the other men and women who chose to make that sacrifice to protect and serve our great nation."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "105074773294626981722", "name": "Trevor Clifton", "time": 1521137650713, "rating": 5.0, "text": "I may be partial, but Alabama Medical Group is the best practice in Mobile! I will definitely continue to use my physician and the organization for any needs that they are able to assist with.", "pics": null, "resp": {"time": 1521138312641, "text": "Trevor, we don't think you are being partial at all. We appreciate your 5-star review and positive comments!"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "106422606782648998008", "name": "June Reddix-Stennis", "time": 1538776500624, "rating": 1.0, "text": "Just left the Alabama Medical Clinic Walk In Clinic, I was refused service first because it was 4:15pm but the Facebook page says the close at 5pm and the website says they close at 4:30pm, either way I got there at 4:15pm so she said they couldn’t see me because they cut off at 4:15! Then she asked if my primary doctor was in the group, my response was no but I have two specialist in the group, so she then informed me that they couldn’t see me because I didn’t have a primary doctor there. The website says nothing about having to already have a primary there! Either she was lying or the website is giving out bad information! I just drove all the way from west Mobile to go to the walk in clinic and couldn’t even walk in! Wow! I’m sooo disappointed, someone really needs to correct this problem, it’s so unprofessional and so was she! My visits with my specialists there have been great but the Walk in Clinic needs work!", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "104937206293796425931", "name": "Laurie Watson McKay", "time": 1496175842762, "rating": 5.0, "text": "My surgeon was Dr. Scott. He was fantastic and very down to earth. I would trust him to cut me open anytime! :-)", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "117914164218167977798", "name": "Jennifer Schuller", "time": 1492451124413, "rating": 5.0, "text": "Internal Medicine Center is made up of a group of kind, caring and compassionate physicians who are highly skilled and trained to take care of all of your healthcare needs.", "pics": null, "resp": {"time": 1560264058735, "text": "Thank you for the 5-star review and the positive feedback. We are so pleased to hear such kind words about our staff."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "108754969109803500157", "name": "Robert Johnson", "time": 1470864349303, "rating": 4.0, "text": "i like Dr Carlos and think he's a good dr but I wish the waiting time wasn't always so long to see him.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "105907220982380648113", "name": "Frances Moore", "time": 1433257481641, "rating": 1.0, "text": "I found that the Doctors at the center are helpful but the staff are horrible.  They are not concerned with the patients health.  They are not helpful and when you are sick you want to be able to see the doctor.  I was told that I could go to their urgent care facility the next morning if I was having a problem.  Horrible staff I would not recommend this facility to a dog.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "109606875225452259763", "name": "Bo Lambert", "time": 1486094853163, "rating": 5.0, "text": "Best doctor...Dr Arnold....nice to know some one cares when you go in...and oh by the way..WDE..DOC!!!", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "108449377063460987318", "name": "Neal Hattenstein", "time": 1490366132515, "rating": 5.0, "text": "Dr Alan Shaine is my Doctor and he is a womdeeful doctor sits with you and exam .just great bed side mannnee", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "112636333242840920295", "name": "tammy beard", "time": 1467068304662, "rating": 1.0, "text": "The facility itself may be ok. Idk. But , in my opinion, Dr. Amy Strasburg is rude, vapid, unprofessional and would be better suited for a career behind a cosmetics counter. If you go there, ask for a different doctor. And be prepared for each and every visit to take two or three hours. Apparently, their system completely collapses on a regular basis.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "109773861361038995364", "name": "Rebekah Graham", "time": 1542482155457, "rating": 5.0, "text": "Everyone is friendly and Dr. Hayden Long is the best.", "pics": null, "resp": {"time": 1547573568593, "text": "Thanks Rebekah, we are so glad to have Dr. Long as a member of the AMG team!"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "100414115519850203702", "name": "Daniel Crocetti", "time": 1417005648420, "rating": 5.0, "text": "Great team of professionals, providing excellent care.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "114181223864192186992", "name": "Mohamad Sahyouni", "time": 1555080582287, "rating": 1.0, "text": "Horrible.", "pics": null, "resp": {"time": 1560178315712, "text": "Hi Mr. Sahyouni, we're sorry to hear that you had an unpleasant experience at our practice and would like to discuss the details of your experience. Would you mind if our operations manager contacted you to discuss?"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "101511126369054386646", "name": "Heather Rothe", "time": 1627579546177, "rating": 5.0, "text": "Dr. Watterson is a great doctor. Very thorough and detailed. I especially appreciate the fact the he takes the time to pray for you & your health. He is careful to explain his concerns and course of testing to determine your diagnosis & care treatment! I highly recommend him!", "pics": null, "resp": null, "gmap_id": "0x88890e0cb639f50f:0x58e18daa643164d9"}
{"user_id": "116951118326286521338", "name": "Sonia C", "time": 1622221105081, "rating": 5.0, "text": "Dr. Watterson is so very kind a personable. He actually sits and listens to you and isn't rushed when he walks into the room. He takes his time to get to know you. Together you sit with him to come up with a game plan for treatment. I love that. I'm so very glad I found him. The staff at Alabama Spine and Sport is also very kind and attentive. Overall a great place!", "pics": null, "resp": null, "gmap_id": "0x88890e0cb639f50f:0x58e18daa643164d9"}
{"user_id": "106641888869593728277", "name": "Diane H", "time": 1619539756216, "rating": 5.0, "text": "Each Staff member you encounter is friendly from the moment you walk through the door till the time you leave. Dr Watterson takes the time to listen to your concerns and answer any questions you may have. He has no problem finding the care you need whether it be with him or someone else within the office. Great group of Doctors and staff.", "pics": null, "resp": null, "gmap_id": "0x88890e0cb639f50f:0x58e18daa643164d9"}
{"user_id": "108636617490325257847", "name": "DeLina Hanson Carroll", "time": 1624233051414, "rating": 5.0, "text": "Dr. Watterson and his staff are so caring. We had a very pleasant experience. They took the time to explain things to us and they answered all our questions.", "pics": null, "resp": null, "gmap_id": "0x88890e0cb639f50f:0x58e18daa643164d9"}
{"user_id": "100694116147203076060", "name": "Helen Turner", "time": 1619610663335, "rating": 5.0, "text": "Dr. Watterson is so loved by many. I heard about him before I became his patient. He listens to you & take the time to explain everything you may need to know about your condition.\nThe humble spirit he has been blessed with allows him to be a very special & unique physician.\nThank God for Dr. Watterson walking & working in his calling.", "pics": null, "resp": null, "gmap_id": "0x88890e0cb639f50f:0x58e18daa643164d9"}
{"user_id": "102610215398448295113", "name": "Cathy Wales", "time": 1621960088978, "rating": 5.0, "text": "I have been a patient of Dr. Watterson for years. He has treated my rheumatoid arthritis and has helped to keep the pain down.\nIt is with a heavy heart that I will be leaving his practice to find someone closer to my home. Thank you Dr Watterson and Lynette for your kindness and caring. ❤️", "pics": null, "resp": null, "gmap_id": "0x88890e0cb639f50f:0x58e18daa643164d9"}
{"user_id": "117748291593831996532", "name": "lqgipson10", "time": 1625165493198, "rating": 5.0, "text": "The staff and Dr. Watterson were very professional and friendly. I would definitely recommend.", "pics": null, "resp": null, "gmap_id": "0x88890e0cb639f50f:0x58e18daa643164d9"}
{"user_id": "101654817101603946054", "name": "Bonnie Marie Hosey", "time": 1614897413876, "rating": 5.0, "text": "My experience went above and beyond what I expected. Dr. Watterson  Is not only kind and considerate of what I have been going through; He is one of those rare doctors that is compassionate and empathetic!  He is extremely thorough and actually listened to what I was telling him ...  I highly recommend him especially to those that have several underlying illnesses.", "pics": null, "resp": null, "gmap_id": "0x88890e0cb639f50f:0x58e18daa643164d9"}
{"user_id": "115675067885476780969", "name": "Kyndal Herring", "time": 1615993885908, "rating": 5.0, "text": "I had such a wonderful experience with Dr. Watterson and his nurse, Lanetta, this morning. They were both so kind. Dr. Watterson was very patient and thorough with his questioning and examination. I appreciate so much actually being listened to and not rushed. He asked to pray for me and also asked had I accepted Christ. He is truly the hands and feet of Jesus to his patients. I am so thankful to him for his expertise & kindness.", "pics": null, "resp": null, "gmap_id": "0x88890e0cb639f50f:0x58e18daa643164d9"}
{"user_id": "100419132435604533171", "name": "Becky Spradlin", "time": 1625018088560, "rating": 5.0, "text": "Awesome staff and very thorough exam.", "pics": null, "resp": null, "gmap_id": "0x88890e0cb639f50f:0x58e18daa643164d9"}
{"user_id": "112070745261528577458", "name": "Sandy Custer", "time": 1614110038226, "rating": 5.0, "text": "I really like Dr Watterson. He cares about his patients. And his nurse Lanetta is awesome. I also like the fact that he is a Christian.", "pics": null, "resp": null, "gmap_id": "0x88890e0cb639f50f:0x58e18daa643164d9"}
{"user_id": "109924902905496892248", "name": "Beth Dugas", "time": 1599231286941, "rating": 5.0, "text": "Dr. Watterson is extremely thorough.  He listens to me and I appreciate his excellent care.  I recommend him to anyone who needs a rheumatologist.  He is the best!", "pics": null, "resp": null, "gmap_id": "0x88890e0cb639f50f:0x58e18daa643164d9"}
{"user_id": "117666763348632997051", "name": "Felisha Hemminger", "time": 1600224223532, "rating": 5.0, "text": "I have had the best experience with this office. My dad has used them for years. I trust Dr. Watterson and thank the Lord for bringing me here. I can't imagine why anyone was displeased unless they themselves are hard to please and get along with.", "pics": null, "resp": null, "gmap_id": "0x88890e0cb639f50f:0x58e18daa643164d9"}
{"user_id": "111462186935998510638", "name": "Angela McClain", "time": 1603161526880, "rating": 5.0, "text": "Dr.Watterson is the ultimate example of what every Dr. should be with their patients ~ it would literally take pages to list the sincere care and concern he shows, so I will just tell you that he is WONDERFUL ❣️\nDr. Watterson is also the ultimate example of character that every human being should aspire to have!   If we had more people like him, our world would be a much better place to live ❤️🙏🏼🇺🇸", "pics": null, "resp": null, "gmap_id": "0x88890e0cb639f50f:0x58e18daa643164d9"}
{"user_id": "105673086777417462951", "name": "Mary Conner", "time": 1609869020236, "rating": 4.0, "text": "Love Dr Rodger's. Very theoral,, nice personality, courteous, orthopedic doctor..", "pics": null, "resp": null, "gmap_id": "0x88890e0cb639f50f:0x58e18daa643164d9"}
{"user_id": "102330316780547969963", "name": "Ken Reaves", "time": 1601122016049, "rating": 5.0, "text": "I came to Dr. Waterson desperately searching for answers.\nI left my  initial visit with a peace in ways than I can not explain knowing that what ever?\n\nEverything is going to be alright!", "pics": null, "resp": null, "gmap_id": "0x88890e0cb639f50f:0x58e18daa643164d9"}
{"user_id": "108934382640060342843", "name": "Debra West", "time": 1599045335813, "rating": 5.0, "text": "Dr Watterson always takes time and great care with his patients. He see his patients as the whole person that they are not just the condition they are being treated for.", "pics": null, "resp": null, "gmap_id": "0x88890e0cb639f50f:0x58e18daa643164d9"}
{"user_id": "100654398887056491431", "name": "Laura Sweet_Home_Alabama", "time": 1601431844084, "rating": 5.0, "text": "I truly think that being seen by a Godly man, such as Dr. Waterson is key to being reassured that my care is in good hands. Dr. Waterson always prays over his patients & their families., as a Christian , this shows me that seeks guidance from the Lord.", "pics": null, "resp": null, "gmap_id": "0x88890e0cb639f50f:0x58e18daa643164d9"}
{"user_id": "101848099624504719450", "name": "Brian Lyman", "time": 1615655781613, "rating": 5.0, "text": "Nothing but the very best care from this group of doctors!", "pics": null, "resp": null, "gmap_id": "0x88890e0cb639f50f:0x58e18daa643164d9"}
{"user_id": "109607227376754737337", "name": "Patti Brasher", "time": 1556078516892, "rating": 5.0, "text": "I highly recommend Dr. Watterson! He was very attentive and listened to me. I can't believe anyone would give him anything less than 5 stars because he and his staff are amazing! I read a few reviews that others had given. It is your responsibility to know whether you need a referral not the staff.", "pics": null, "resp": null, "gmap_id": "0x88890e0cb639f50f:0x58e18daa643164d9"}
{"user_id": "117154316840192401881", "name": "Toni Liebe", "time": 1595515275445, "rating": 1.0, "text": "I called to make an appointment, and the lady I talked to was RUDE!! I ended up telling her that I would just find another Dr.", "pics": null, "resp": null, "gmap_id": "0x88890e0cb639f50f:0x58e18daa643164d9"}
{"user_id": "106736391576185638093", "name": "Charlotte Wahl Cassenta", "time": 1540242556957, "rating": 5.0, "text": "Found an amazing RA doctor today that offered to pray for me after we sat and talked about my arthritis. Then we sat and continued talking about how amazing the Lord is. What an awesome visit. Dr Gene Watterson is so precious.", "pics": null, "resp": null, "gmap_id": "0x88890e0cb639f50f:0x58e18daa643164d9"}
{"user_id": "105277878686369039380", "name": "Nina Williams", "time": 1541029882130, "rating": 5.0, "text": "Lord,  I thank you for sending me to this place where you have an amazing doctor working for your will...Dr. Gene Watterson  is amazing he listened to me and took his time with me to try and understand what's going on... I'm excited for what's next!", "pics": null, "resp": null, "gmap_id": "0x88890e0cb639f50f:0x58e18daa643164d9"}
{"user_id": "116681218303984246360", "name": "Don Adams", "time": 1530036612236, "rating": 5.0, "text": "I will wait if he is busy. Dr Watterson is  awesome , his staff is excellent and I trust this man of God with anything that I may incur that he specializes in!", "pics": null, "resp": null, "gmap_id": "0x88890e0cb639f50f:0x58e18daa643164d9"}
{"user_id": "116285914853735827109", "name": "Mitzi Lowe", "time": 1464990894371, "rating": 5.0, "text": "Only meet Dr Watterson & staff one time and that's all I needed to know that God placed me right where I needed to be today with a doctor who listens to concerns and genuinely cares about the well being of his patients. Wonderful to meet a doctor who is strong in his faith and doesn't mind sharing the word.", "pics": null, "resp": null, "gmap_id": "0x88890e0cb639f50f:0x58e18daa643164d9"}
{"user_id": "105711955147847036046", "name": "mama22munchkins", "time": 1445429567447, "rating": 5.0, "text": "I'm shocked at the poor reviews! The staff was very friendly to me. I had to wait longer than normal because they got behind, but everyone apologized and Dr. Watterson stayed past closing time just to finish talking to me and answer all my questions. I've never had a doctor who seemed to care so much. He listened to every symptom I have and worked with me to come up with a plan to start treating me. I was very pleased!", "pics": null, "resp": null, "gmap_id": "0x88890e0cb639f50f:0x58e18daa643164d9"}
{"user_id": "114029318513961914653", "name": "Anita Weaver", "time": 1415123430369, "rating": 1.0, "text": "To sum it up in one word - \"horrible.\" This is the most unprofessional, rude, and unorganized medical office in which I have ever been. If there was a way to rate a doctor and his staff with a negative number, I definitely would! Takes quite a while to get an appt. (usually the norm), then you have a one hour drive to get there, (that's ok), but then a nurse calls you to try and talk you out of your appt. one hour before the appt., (I'm still going), get another call when I'm nearly there that my appt. has been canceled, and still don't have a reasonable answer as to why! The nurse even started going over my symptoms via the phone???? I felt like she was trying to practice medicine via phone! I asked how she can make a determination via phone without my seeing the doctor? No reasonable answer! When I got there, they wouldn't see me! Told me I needed a doctor referral. They did not tell me this when I made the appt. a month ago, and I mailed all my records at least two weeks prior to my appt. Now I am without a doctor, medications, etc. I have been doing very poorly the past two months and was looking forward to seeing Dr. Watterson! Does anyone know of a good rheumatologist in Birmingham who treats osteoarthritis and fibromyalgia?????", "pics": null, "resp": null, "gmap_id": "0x88890e0cb639f50f:0x58e18daa643164d9"}
{"user_id": "118092799638248530710", "name": "M A", "time": 1549299143969, "rating": 5.0, "text": "Super fast 👍🏻☺️", "pics": null, "resp": null, "gmap_id": "0x88890e0cb639f50f:0x58e18daa643164d9"}
{"user_id": "106506008189482969051", "name": "Samuel Steele", "time": 1627353711923, "rating": 1.0, "text": "I had the worst experience with Dr. Habermacher, I had went to ER with a kidney stone and was told it measured 7mm, was told to follow up with Urologist from your clinic,I saw NP on day of appointment which was very nice,I ask for a scan to be done before so we would know if stone was still there. The morning of surgery, Dr. Habermacher came into room I ask if he was going to do scan to make sure stone was gone, he replied no, it will be gone today one way or another. I had passed very small pieces of stone but definitely not a 7mm in prior week.When I awoke from procedure I was told there was no stone, after getting home I was very sick from procedure and very sore. I went for my follow-up, I told the girl that checked me in that I was upset that he did not do KUB to make sure the stone was gone also, that I am a nurse and have had enough of kidney stone patients to know how to check for kidney stones and I definitely had not passed a 7mm. She said I will tell him, she immediately came back in room and said this is a nurse visit, he wants you to do 24 hr urine and come back in 2 months. I have no intentions of ever using him again, why would you not do a KUB or scan to make sure it's gone before putting someone through this, it sounds like it's all about money to me. WILL NEVER use this Dr again.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "107560826844517747305", "name": "Nathan Herrick", "time": 1611344210315, "rating": 1.0, "text": "Received a referral from my insurance company to this clinic to see a Gastroenterologist and I cannot even schedule an appointment. For the last two months, I have called the only available phone number to make an appointment only to be transferred to the gastroenterology clinic appointment line where I have left several messages with the scheduler because that person was not there. No return calls and the office is closed on Friday.", "pics": null, "resp": {"time": 1614290855284, "text": "Nathan, we would value the opportunity to connect with you further. Our patient care team can be reached at (334) 613-7070 at your convenience. If you would prefer to speak with our Patient Advocate, please call (334) 568-4866."}, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "118035772244836917308", "name": "Renae Pemberton", "time": 1604533118108, "rating": 1.0, "text": "I would not recommend anyone to Dr. Habermacher. My husband and I received some news that was scary and the doctor was not empathetic towards us. He does not like for his patients to do any scholarly research to help the patient or families to be knowledgeable on their diagnosis. He will get offended if you ask questions in which he feels a patient is second guessing his medical knowledge. He talked down to us and no doctor should ever talk to people in that way. Listen to your gut or in my case the Holy Spirit if something does not sit right with you about someone taking care of your loved one. I pray Dr. Habermacher is a Christian and if not that he will come to know the love of Jesus.", "pics": null, "resp": {"time": 1606179290463, "text": "Renae, we would value the opportunity to connect with you further. Our patient care team can be reached at (334) 613-7070 at your convenience."}, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "106276702774166680149", "name": "Abby McNeil", "time": 1601472617242, "rating": 5.0, "text": "I’ve been a patient of dr garg for a little over a year and she’s great . Yesterday I came in and I just wanted to call out one of the endocrinology nurses , Jennifer , and tell her how kind and wonderful I thought she was at her job. Jennifer went out of her way to make sure I was comfortable during a really long glucose test I had . Dr garg also takes a whole body approach to your treatment , and it is truly worth my drive from Dothan where all our endos are retiring/booked to come to this clinic .", "pics": null, "resp": {"time": 1601482922083, "text": "Abby, thank you for the kind review. It is our honor to provide excellence in care to the people of Alabama!"}, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "111188159416355907851", "name": "Jaime Denise", "time": 1608335886715, "rating": 3.0, "text": "They schedule way too many people at the same time, so the waiting time is HOURS.", "pics": null, "resp": {"time": 1614290484766, "text": "We understand your concerns and know that your time is valuable. Your feedback has been shared with our team and we thank you for your patience in this intricate season of care."}, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "113464080315346843401", "name": "Tony Boyer", "time": 1545582087126, "rating": 5.0, "text": "At times finding proper care that gives you the feeling your best interest has been top priority can be a challenge in the Montgomery area.  We typically go to Birmingham for peace of mind.  My first visit to UAB Urology clinic was one of the best experiences I've had anywhere.  Professional, engaging, reflective, and not reluctant to challenge the knowledge and awareness of their patients.  Dr. Habermacher understood my level of comprehension to quickly lend understanding to my concerns & how to handle my own personal health going forward.  Without being too long winded, I have to express gratitude for the opening and benefits of this clinic for Montgomery residents & anyone within reasonable distance.  Checks all the boxes both physically and psychologically to assure patients care is their top priority.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "109149654432663969534", "name": "Jeff chappell", "time": 1580739399408, "rating": 1.0, "text": "Apparently negative reviews get taken down quickly?  Dr. Thudi, an endo, has the worst communication skills.  Does not listen, assumes, and is too proud to admit mistakes.  They return calls, but only if you're waiting by the phone.  No voicemails except \"please call us back\" and you never get a live person, so it's voicemail tag over and over and over.  Add that to their \"never on Friday\" rules and you've got a setup for making money with zero customer service, much less patient service.\nAnd DON'T even think of adding a response to this about \"We'd like to talk with you about your experience\".  We spoke, we emailed, and THIS IS my response to your customer care.  Don't act like this is the first you have heard of the problem.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "110810778778295902588", "name": "Evelyn Young", "time": 1529426965919, "rating": 2.0, "text": "I have had zero problems until today. You have one number for the entire clinic. They have several specialists. So it is hard to reach the person you need. I called asking for a specific person and extension. I was asked the person last name .They did not leave a last name. I gave the extension#. I was asked what is the nature of the call. I still did not get the person that left the message. Guess if it's important they will call me back..", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "111193115751902347353", "name": "Tamra Oswalt", "time": 1570210263130, "rating": 1.0, "text": "I'm very disappointed I have been to four doctors in the past month about my foot and my toe I am in excruciating pain mobic is helping and your office closed at noon today because it's Friday well I don't consider an emergency other than I'm excruciating pain and can't walk. So what am I supposed to do?\n\nVery disappointed how the doctor he's never seen me going to know what to do for me", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "114165500896750655586", "name": "Scott Thompson", "time": 1538578909414, "rating": 2.0, "text": "Originally given 1-star: Waited for 6 weeks for an appointment just to have a consult. The Friday before the Monday afternoon appointment I get a call saying Doctor Hablemacker would be out of the office and they had rescheduled me for two weeks later in the morning instead of the original afternoon. They required me to call and confirm to keep the new appointment. No further explanation. No options given for the inconvenience. Attempted to call at 2:30 pm when I got the message, but the office was already closed. Apparently they also don’t work on Friday afternoons...\n\nUPDATE TO POST (10/18): Upgraded to 2-star.The office was able to accomidate a different appointment time since I was going to be out of the country during their first rescheduled time. Initially, they didn't have availability, but were willing to squeeze me in for the short consult given the previous circumstances. I will reconsider again after the appointment/service.", "pics": null, "resp": {"time": 1536593512763, "text": "Mr. Thompson,\nWe are very sorry we did not meet your expectations.  Please do call our office today between 8 AM and 5 PM to find a more convenient time for your appointment."}, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "105513552415487179721", "name": "Grover Wedgeworth", "time": 1555512481353, "rating": 1.0, "text": "Service sucks, no follow up on lab between visits, .Failed to provide consultation notes and labwork to my wife's primary doc.  Dtaff are curt cna rude", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "100199861040353856532", "name": "DeAndre Scott", "time": 1542033819723, "rating": 5.0, "text": "I have been coming to the UAB Specialty clinic to see Rheumatology. Dr. Gadea and his staff are some of the best medical professionals I have ever come across. Having worked in the medical field for 16 years (21year USAF Vet), I have worked with countless professionals. I can only highly recommend Dr Gadea and his team as their patient care exceeds the standard every visit!", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "109337083997686348338", "name": "Wendy Adams", "time": 1545164083529, "rating": 1.0, "text": "This is a poor excuse for a gastroenterology center. My husband is having issues with abdominal pain and other stomach issues and we were told by Dr. Kahn that if my husband continued to have issues that he should go back to the ER and let them call him and see if he could get in for an emergency colonoscopy. Well he went back to the ER and they ran all kinds of test and just because his blood work came back fine, the ER staff and Dr. Kahn refused to admit him and said that he would have to wait until Feb to have a colonoscopy scheduled.  So the doctor lied to both of us. Needless to say my husband is still in very bad pain. So nothing bad better happen to my husband because of their negligence.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "109629967256740502457", "name": "Andrea Curtis", "time": 1536710565402, "rating": 5.0, "text": "The doctors here are excellent.  I especially like Dr. Nina Jo Hibbard, Endocrinologist,  and Dr. Carlos Gadea, Rheumatologist.  They are knowledgable, patient, and very concerned about the pateient's well-being.    I wouldn't trust my healthcare needs to be handleded anywhere else.   😀", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "105124454187813409107", "name": "Jennifer van Arcken", "time": 1504830525964, "rating": 5.0, "text": "My husband had surgery by Dr. Habermacher and we are very pleased that UAB opened this state of the art clinic in Montgomery and brought such great healthcare professionals to our area. The surgery was a success and the follow up visits at the clinic were accomplished very professionally.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "114492014717223503219", "name": "Bill Flick", "time": 1514917554556, "rating": 5.0, "text": "I have seen Dr. Pazona in Urology and found him to be very competent, professional and pleasant.  The staff were also very efficient and pleasant.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "115584060232493438080", "name": "Tamara Dozier", "time": 1568788922908, "rating": 2.0, "text": "Dr. Mullins was wonderI!!\nI need a new Rheumatologist ...", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "118096554832493583892", "name": "EDDIE SMITH", "time": 1536835072856, "rating": 5.0, "text": "Great doctor took good care of my mother", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "113979901561511451813", "name": "Cece Rough", "time": 1618663530258, "rating": 5.0, "text": "The office staff were friendly and helpful. Dr Mcgee was very nice. He listened to me and explained what my problem was. He was very helpful . this was a good experience. Thank you Dr Mcgee.", "pics": null, "resp": null, "gmap_id": "0x889a4e1c8e41591d:0x1dc734e49bba2403"}
{"user_id": "106422606782648998008", "name": "June Reddix-Stennis", "time": 1611207220050, "rating": 1.0, "text": "First visit, spent 5 minutes with me, checked nothing, had me go to the lab to get blood drawn, had to come in for a second visit checked nothing, just  to told me the test said negative.  Told me the diagnosis I’ve had for years is wrong, I asked did he look at my records and old labs with positive tests from my old doctor, he said no but there was nothing wrong with me and my old doctor was wrong, my joints were so inflamed that day I could barely walk and I had a fever.  No further instructions, no treatment plan, told me he didn’t need to see me anymoore. Wasted $100 in copays. Just horrible.", "pics": null, "resp": null, "gmap_id": "0x889a4e1c8e41591d:0x1dc734e49bba2403"}
{"user_id": "112284091712616011340", "name": "Tristy Eckhoff", "time": 1576117741046, "rating": 5.0, "text": "He and his nurses are such a great team. He cares about you as a patient.He is very thorough.", "pics": null, "resp": null, "gmap_id": "0x889a4e1c8e41591d:0x1dc734e49bba2403"}
{"user_id": "117122548382228255779", "name": "Lexy Mooney", "time": 1575595736351, "rating": 5.0, "text": "Dr. McGee has been my rheumatologist for almost 5 years. He is very thorough, and has a good bedside manner.", "pics": null, "resp": null, "gmap_id": "0x889a4e1c8e41591d:0x1dc734e49bba2403"}
{"user_id": "107418317650742585583", "name": "Wooh Yawn", "time": 1603401932332, "rating": 1.0, "text": "No.  First visit, spent 15 minutes with me, and told me the diagnosis I’ve had for years is wrong.  No further instructions, no treatment plan.  Just no.", "pics": null, "resp": null, "gmap_id": "0x889a4e1c8e41591d:0x1dc734e49bba2403"}
{"user_id": "109900281233549565912", "name": "Gene Everette", "time": 1536851987763, "rating": 5.0, "text": "Dr. McGee is the best doctor that I've ever used. I started seeing him in 1992 when I was diagnosed with psoriatic arthritis at only 31 years old. He takes time with his patients, not just for medical diagnosis but to also have a better understanding of the lifestyle and how he treatments will allow you to maintain that lifestyle.", "pics": null, "resp": null, "gmap_id": "0x889a4e1c8e41591d:0x1dc734e49bba2403"}
{"user_id": "109567941999544909509", "name": "tristy e", "time": 1554832537455, "rating": 5.0, "text": "Dr. Mcgee is a very caring compasionate doctor. He takes the time to listen to you and any problems or questions you have. Through his help my RA has been in remission for over 7 years. I am pleased with his whole staff. They are excellent. I would recommend him to anyone who needs a rheumatologist.", "pics": null, "resp": null, "gmap_id": "0x889a4e1c8e41591d:0x1dc734e49bba2403"}
{"user_id": "104712438291178280495", "name": "Luke Hildreth", "time": 1556194887157, "rating": 3.0, "text": "Went see him about pkssible fibromyalgia he said im sorry but im unable to tell you that you have that.just not up to\nDate.", "pics": null, "resp": null, "gmap_id": "0x889a4e1c8e41591d:0x1dc734e49bba2403"}
{"user_id": "110686522332203255563", "name": "Lisa Love", "time": 1624495814926, "rating": 5.0, "text": "Dr. LaCour is amazing! He listens to your concerns about your health and gives advice for the best treatment. I tell people he has given me my life back! ❤️", "pics": null, "resp": null, "gmap_id": "0x8892937b3efb1f17:0xc436c6fdfc2d309f"}
{"user_id": "115405087528760774636", "name": "Christy Snell", "time": 1622596524128, "rating": 5.0, "text": "I highly recommend Dr. LaCour. He takes his time to listen to all of your concerns.  He is very nice and run a lot of test to figure out what is going on with me. The staff was very friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x8892937b3efb1f17:0xc436c6fdfc2d309f"}
{"user_id": "107072819931043948870", "name": "Gina Archibald", "time": 1624313489074, "rating": 5.0, "text": "I was very pleased with Dr. Lacour and his staff. He was informative and patient and I didn’t feel like I was being rushed out the door. I’m looking forward to working with him on my treatment!", "pics": null, "resp": null, "gmap_id": "0x8892937b3efb1f17:0xc436c6fdfc2d309f"}
{"user_id": "101911110530144095796", "name": "Joseph Fincher", "time": 1623848271713, "rating": 5.0, "text": "Great experience! I've never had a doctor listen and explain the gout better than Dr Lacour. I highly recommend!!", "pics": null, "resp": null, "gmap_id": "0x8892937b3efb1f17:0xc436c6fdfc2d309f"}
{"user_id": "107416488649640696597", "name": "Cynthia Caudill", "time": 1619132532821, "rating": 5.0, "text": "The staff is just wonderful, so very polite and patient in explaining anything I have questions about. Dr Lacour is such a great Dr. He takes his time to really listen to you and find the best treatment for your needs. All around wonderful experience and amazing people.", "pics": null, "resp": null, "gmap_id": "0x8892937b3efb1f17:0xc436c6fdfc2d309f"}
{"user_id": "105076016565782579544", "name": "Teresa Norris", "time": 1616705961908, "rating": 5.0, "text": "He is one of the nicest doctors around! Always listens to your problems and does everything he can to get you well. Very knowledgeable in his field. He is very kind and understanding!!", "pics": null, "resp": null, "gmap_id": "0x8892937b3efb1f17:0xc436c6fdfc2d309f"}
{"user_id": "103466856378563640983", "name": "Rodney Daffin", "time": 1624315616220, "rating": 5.0, "text": "Great doctor intelligence is through the roof, nice sweet people there. Been my doctor for over a year now.", "pics": null, "resp": null, "gmap_id": "0x8892937b3efb1f17:0xc436c6fdfc2d309f"}
{"user_id": "104561165833170463238", "name": "Aaron Mallory", "time": 1623368502656, "rating": 5.0, "text": "Everyone was very nice and professional. Front desk, nurse and doctor all were great.", "pics": null, "resp": null, "gmap_id": "0x8892937b3efb1f17:0xc436c6fdfc2d309f"}
{"user_id": "112525064361685204912", "name": "Nita Kyser", "time": 1617032308215, "rating": 5.0, "text": "Initial visit for me, very professional. Dr. LaCour explained all test results in an understandable manner. I was allowed to ask questions and they were readily answered. I did not feel rushed. Office staff was very friendly. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8892937b3efb1f17:0xc436c6fdfc2d309f"}
{"user_id": "108916389921589393651", "name": "Dale Lowery", "time": 1618343021157, "rating": 5.0, "text": "Very short wait time. All courteous and friendly.\nDr. LaCour was professional and friendly.\nI have been seeing him and Sandra in the Infusion dept. for about five years and highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x8892937b3efb1f17:0xc436c6fdfc2d309f"}
{"user_id": "114592050128797269583", "name": "Joshua Meyers", "time": 1623252147453, "rating": 5.0, "text": "Always willing to listen to the patient and explain where we’ve been and what the next step will be!", "pics": null, "resp": null, "gmap_id": "0x8892937b3efb1f17:0xc436c6fdfc2d309f"}
{"user_id": "108453417107182135555", "name": "Joell King", "time": 1619649485502, "rating": 5.0, "text": "I was very satisfied with my visit and how everyone was so nice in this office. Dr.  LaCour took his time and went over all my symptoms and will be doing follow up with him. I really do not like dr's, but I have high praise for Dr LaCour, and would recommended him to anyone. If you want to get to the bottom of your symptoms, this is defiantly the dr. to see.", "pics": null, "resp": null, "gmap_id": "0x8892937b3efb1f17:0xc436c6fdfc2d309f"}
{"user_id": "111844202285612808452", "name": "Shelly White", "time": 1616543789413, "rating": 5.0, "text": "I absolutely love this entire office!! From beginning to end the entire staff is so caring they listen and get a game plan to help me get out of pain. I know I have a Dr who can help me!", "pics": null, "resp": null, "gmap_id": "0x8892937b3efb1f17:0xc436c6fdfc2d309f"}
{"user_id": "105689172923143132489", "name": "Michael Zimmerman", "time": 1616506229357, "rating": 5.0, "text": "Dr LaCour was very knowledgeable and concerned about my physical challenges and he gave me best  reatmen optios There is never a long wait to see him. I highly recommend him as a physician.", "pics": null, "resp": null, "gmap_id": "0x8892937b3efb1f17:0xc436c6fdfc2d309f"}
{"user_id": "111134731240078866221", "name": "William vierkandt", "time": 1616255053921, "rating": 5.0, "text": "Very concerned about my condition as his patient.  I thought I needed to go out of town for good care for RA.  Not the case - very happy with Dr LaCour’s analysis and recommendations.", "pics": null, "resp": null, "gmap_id": "0x8892937b3efb1f17:0xc436c6fdfc2d309f"}
{"user_id": "110393207612917122772", "name": "Brenda Batyski", "time": 1597164552657, "rating": 5.0, "text": "I have seen Dr La Cour for 13 years and I think he is the best! His office is a well run machine. They are on time with appointments and I've had to call the phone nurse multiple times, she is always prompt to respond. Thank you to Dr La Cour and his staff!", "pics": null, "resp": null, "gmap_id": "0x8892937b3efb1f17:0xc436c6fdfc2d309f"}
{"user_id": "110616671367226506577", "name": "Carolyn Lossing", "time": 1590064247805, "rating": 5.0, "text": "Dr. La Cour and his staff are so friendly. It was very comforting to me how nice and gentle he was. I have bad anxiety,  and it gets really bad especially  with doctors,  but Dr. La Cour took his time and listened to everything I said. It calmed me.", "pics": null, "resp": null, "gmap_id": "0x8892937b3efb1f17:0xc436c6fdfc2d309f"}
{"user_id": "105670228744566090129", "name": "Yvonne Burgamy", "time": 1595334325472, "rating": 5.0, "text": "Caring doctor. Very happy with his care.", "pics": null, "resp": null, "gmap_id": "0x8892937b3efb1f17:0xc436c6fdfc2d309f"}
{"user_id": "103946648313836642642", "name": "Dave Rakes", "time": 1583844502571, "rating": 3.0, "text": "I was referred to his office by my surgeon. Can't speak for him but his staff is is rude! After many many attempts from both myself and the staff at southern bone, I asked to see another doctor. Even though I was told that he accepted me as a new patient and was the best. His staff would hang up the phone every time when I was to be transferred and would not return my voice mails.\n\nUPDATE: I received a call for an appt. It was sooner than the other doctor so I took it. Then I received another because someone canceled and I got that spot. Staff was friendly, loved doctor la cour! He listened, I felt like he really paid attention and we are now make progress towards my issues.", "pics": null, "resp": null, "gmap_id": "0x8892937b3efb1f17:0xc436c6fdfc2d309f"}
{"user_id": "105298539888987154576", "name": "Stephanie Stubbs", "time": 1514929586474, "rating": 5.0, "text": "Great Dr, explains everything in great details  & will answer any & all questions without rushing you !! He knew exactly what was wrong with me on my very first visit after being sick for 7 years & no other Dr had even gotten close !!! The staff is half & half ....some are very nice & helpful but others not so much! The front desk staff is always very nice. I think the nurse practitioner needs more hands on training with the Dr. I'll be sure not to see her again. If you want a Dr you can trust, one that's very educated & not in a hurry then this is a great choice !!!", "pics": null, "resp": null, "gmap_id": "0x8892937b3efb1f17:0xc436c6fdfc2d309f"}
{"user_id": "110713793977524392312", "name": "Kim Sturdivant", "time": 1574797475511, "rating": 2.0, "text": "Dr. LaCour wasn't so horrible when I first saw him he did listen to my corncerns and as to why I was there. I was referred by my oncologist which is not in Dothan, AL. They ran basic test and blood work on me and I got a call saying nothing wrong with me, and they pretty much dismissed me. I was left with no answers at all, yet my oncologist still felt I had an autoimmune disorder of some sorts that kept getting looked over. I pretty much gave up . Then an issue came up and I had to go see an ENT Dr. In Enterprise. He tried hard to help me but it wasn't something he speicalized in, my issue was with my salvia glands.So the ENT Dr. Did the next best thing because he knew there was an issue but out of his scope of what he specializes in, so he sent a referral to UAB in Birmingham,  AL. So I went and within the first 20 minutes they pretty much told me what they thought was the issue, an autoimmune disorder . So he sent me to their lab for blood test and he didnt stop at the basic test which all did come out negative as he figured they would he kept running more and more and just that easy he found the issue and a special blood test that most do not ever run came back showing my issue. I was seeing a good neurologist here in Dothan after a horrible auto accident and he looked at my labs from UAB from my patient portal and he DX me on the spot and sent a referral back to Dr. LaCours office for them to tell my neurologist that they had seen me and I tested not having anything and unless there was labwork saying different they had no reason to see me. Before they are willing to see me they want to see the lab work from UAB.  I am sorry but no thankyou, I don't wanna see a doctor that I have to try to prove over and over to whats wrong with me, not my fault you couldnt find it when another did. So after 2 different doctors refrring me to Dr. LaCour they still need me to prove them different.  Nope no thank you whatsoever I am still under the care of the ENT specialist at UAB and I will just let them refer me to one of the rheumatologist there at UAB and I  will keep driving to get good healthcare from doctors who seem to care. I only rated this Dr here Dr. LaCour with 2 stars because the Dr. himself was kind and did listen but his staff are the ones who has said I needed to prove it. I will not beg for them to accept me as a patient when I finially am getting answers that they obviously couldnt provide themselves earlier this year. Good luck Dr. LaCour because I have heard amazing things about you yourself from years and years ago,  but your staff needs to be conpletely replaced. So that you can become the Dr. you once were.\n. Thanks for Nothing..and BTW  yes I do have an autoimmune disorder that has been proven now with UAB and my neurologist,  its called Sjogrens syndrome,  and I am unsure yet if I have Lupus  which Sjogren's most the time comes with either or Lupus or RA. I am awaiting UAB to do a biopsy and get those results as well to inform me about the possibility of Lupus, since a test did come back showing possible Lupus and I have had Dr.s thinking for the better half of 20 years that I had Lupus!!! So AGAIN as a Dr. that specializes in autoimmune disorders your office failed me BIG TIME!!!!", "pics": null, "resp": null, "gmap_id": "0x8892937b3efb1f17:0xc436c6fdfc2d309f"}
{"user_id": "111644614553397451314", "name": "Bart Ankrom", "time": 1546008503037, "rating": 5.0, "text": "He's been the best Rheumatologist (out of 3) for me.  Spends time with you and listens to your pains and concerns.  The nurses could use better training in finding the vein in your arm.  Every time I go in I get stuck more than 2 times for a blood draw.  Makes the arm a bit sore.", "pics": null, "resp": null, "gmap_id": "0x8892937b3efb1f17:0xc436c6fdfc2d309f"}
{"user_id": "113539912041312648201", "name": "Tammy Bruce Wilson", "time": 1550750365164, "rating": 1.0, "text": "Dr was  La Cour was good.   But that means nothing when the rest of the office isnt the same.    Wouldnt recommend this office for anything.", "pics": null, "resp": null, "gmap_id": "0x8892937b3efb1f17:0xc436c6fdfc2d309f"}
{"user_id": "100235776892369288401", "name": "Telesa Anderson", "time": 1511289303374, "rating": 5.0, "text": "He's been my rheumatologist since I've been diagnosed and him as well as his office staff is wonderful. I recommend him to everyone. Love love love", "pics": null, "resp": null, "gmap_id": "0x8892937b3efb1f17:0xc436c6fdfc2d309f"}
{"user_id": "109585023841182872468", "name": "medical professional", "time": 1488901115659, "rating": 2.0, "text": "I love the providers here however he office staff are very rude , uncaring and feel like they are to busy to provide real quality patient care. I was also over charged for my copay.", "pics": null, "resp": null, "gmap_id": "0x8892937b3efb1f17:0xc436c6fdfc2d309f"}
{"user_id": "104218334580885440964", "name": "Danielle Brunson", "time": 1523386346092, "rating": 1.0, "text": "Do not waste your time at this place.", "pics": null, "resp": null, "gmap_id": "0x8892937b3efb1f17:0xc436c6fdfc2d309f"}
{"user_id": "103270058399463381718", "name": "Lauren Videla", "time": 1622085040969, "rating": 1.0, "text": "My experience with Dr. Christie Thomas has been horrible. They have changed my appointment multiple times by sending me a letter instead of calling and asking which day can we change it to. I work and I have to ask for the days off in advance, so by them changing it without asking first is not professional or considerate. The waiting time is an hour or so and then when she comes to the room she just spent not even 5 minutes with me. I’ve asked her about the side effects of a medication she prescribed me and she told me to do the research myself. Next appointment I went, she didn’t even remember that she changed my medication. The only thing she does is look at my knuckles and that’s it. Last time I went, I had questions and she was standing up, like she was telling me hurry up and let her go. This was after I’d waited more than an hour to see her and she only spent with me was 4 minutes with me. She only thinks about $$$. She’s not a Doctor that cares about her patients. Also, she is pressuring me to get the COVID vaccine and asked me why I haven’t gotten it yet. With all due respect that’s my decision. No one can make me do something I don’t feel comfortable with yet.", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "107791861391176238226", "name": "Ferletia Sheppard", "time": 1622074873057, "rating": 4.0, "text": "Dr.Chen,MD,PhD is a Very understanding Doctor, takes time with you and listens very well thank you Dr.Chen, thanks to Dana and Shirley for going the Extra mile with me and being nice.Now the Mask thing needs to be looked into for ppl that are Allergy to the ones you Guys are given out.I can only wear Cloth 😊👋🙏👍", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "105163093454474047002", "name": "Michael Baum", "time": 1619798527727, "rating": 1.0, "text": "My wife and I continue to have a horrible experience with Dr. Thomas.  After waiting forever, her consults are normally a rushed five minutes with her being unwilling to help or listen or explain anything and saying she'll do blood work.  She is all about numbers and $$, not the patient at all.\n\nI'm sure there are better doctors in the practice, but they won't let you switch doctors either so we are stuck with her in Huntsville.  Cannot recommend against her enough.\n\nFingers crossed that Vanderbilt has rheumatologists that actually care about their patients.", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "114297801158182026465", "name": "Casey E", "time": 1608231256213, "rating": 5.0, "text": "I had a good experience at RANA. I did not wait long in the waiting room (was actually taken back to a room before the scheduled apportionment time) and Dr. Thomas was efficient, friendly, and knowledgeable. I left with labs and x-rays done and had a follow up two weeks later to go over the results. I was also referred to a different specialist within those two week. The COVID procedures in the waiting room could be improved (some waiting had taken off their masks and were unfortunately coughing), but with so many patients waiting, this is a difficult challenge for this type of practice.", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "105181501844025097765", "name": "Soralla Torres", "time": 1613743138082, "rating": 4.0, "text": "Overall my experience with Dr. Phillips has been good, when I visit my waiting time is minutes and when I see him, he is very pleasant, he gives me a throughly exam and explain with details about medications and my condition.", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "100180024714978564237", "name": "Coralie Richardson", "time": 1619123438104, "rating": 1.0, "text": "My husband was alerted that his appointment rescheduled by letter. He was not consulted or alerted by phone. That’s just shady.", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "109715102691566022737", "name": "Caitlin Brooks", "time": 1610128426902, "rating": 5.0, "text": "I have many medical issues and we were referred to him by my primary and we saw all these negative comments but still gave him a try. We got there and it was one of the best experiences I’ve had with doctors he carefully listened, he cared about my problems, listened to my opinion, he did everything he could in his power to find out what is going on with me", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "100188645157954593319", "name": "Ann Hardy", "time": 1605732041694, "rating": 1.0, "text": "The office staff at this practice is GARBAGE! All the receptionist were extremely rude and looked like they would rather die than be where they currently were. I was overcharged for my visit and when I questioned the excessive payment request I was rudely told that was my only option if I wanted to be seen by the doctor. When my insurance claim was filed and like I knew would happen- I had over payed...I called and requested a refund which required many hoops to jump through. It is a good thing I even called and requested because I was told without a call their would have been no refund and this practice would have just made an extra $80.   To make things even more frustrating I never received a call back about my bloodwork and I had to call them to receive my results. If there was any other option I would chose another practice over this one.", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "100585938111970448152", "name": "Amy Mitchell", "time": 1594318702405, "rating": 5.0, "text": "I've been seeing Dr. Shergy for 13 years now, and would never see anyone else. All of his nurses and staff are wonderful too. I'm so thankful for all of them.", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "110925637670841489183", "name": "Marissa Byrd", "time": 1582583138409, "rating": 1.0, "text": "I waited 7 months for my first appointment, and on the day of my appointment, I waited another 3 hours to see Dr. Chen. I used those months to compile a health diary, included with pictures, dates, and symptoms. During my examination, he did not take the time to look at my pictures or even allow me to finish telling him what I had been experiencing. I waited all that time to have 10-15 minutes. He interrupted me, harshly and quickly examined me physically, said I didn’t look “that tired” and then left the room. He ordered blood work and based on the results- prescribed a vitamin. He never addressed my symptoms or tried to investigate the cause of my issues. I left feeling very defeated and somewhat discarded. I will not be back.", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "110452593070359390112", "name": "Andrea Gray", "time": 1583857430601, "rating": 5.0, "text": "I've been a patient of Dr Phillips since 1987. I wouldn't want to go anywhere else. I have always received a high quality of care by the doctors, nursing staff and administration.  Extremely nice facility and convenient parking.  Office includes laboratory services.", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "103547430776858313775", "name": "Denise Murphy", "time": 1607618184064, "rating": 1.0, "text": "Process to establish as a patient is terrible and \"new patient scheduler\" is rude and unprofessional.", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "108135778864849451572", "name": "Josephine Sullivan", "time": 1594650196910, "rating": 1.0, "text": "Poor service... HIPPA violations where staff will ask questions in front of other patients, they still will not address the issues that brought me in. The CRNP is the only one who has attempted to assist", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "111344597022065193504", "name": "Deborah Wilbanks", "time": 1614995303875, "rating": 1.0, "text": "Had a Dr appointment with Dr Thomas her staff called to cancel that appointment and make another. They called and canceled that appointment. Then I requested to change Doctors and was sent a letter saying I didn't have a reason to want to change.Call and make another appointment with her. NO. I'm going somewhere else.", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "113514383241503355987", "name": "Canatha Plaskett", "time": 1590771743750, "rating": 1.0, "text": "Waited over an hour for 2nd appointment just to be told by Dr. Chen that I needed to exercise more and gave me the same medication that I’ve been on for 2 years. Still in pain. Should have paid attention to the reviews before going to these quacks. Guess I will just have to live in pain. This doctor is one reason why I hate doctors", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "107746603495201881210", "name": "Brenda Stephens", "time": 1570587383297, "rating": 5.0, "text": "I have been a patient at RANA since 2008. I first saw Dr Jesus Hernandez and continued on after he left the practice, with his replacement, Dr  K. Chen.\n\nThe staff is very friendly.\n\nThe lab collection is onsite and your samples are sent out for analysis by a facility your insurance will accept.\n\nI would recommend this office to everyone who wants to be respected and treated professionally.", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "110061644747987164438", "name": "Jacquelyn Welborn", "time": 1574081282415, "rating": 5.0, "text": "I have been to quite a few Rheumatologists, and doctors period, and I have to give RANA 5 stars because the people I met are super nice and thoughtful too. Dr. Shergy’s nurse was caring and asked me appropriate questions and got me straight with the doctor...without wasting a bunch of time. Ha, can u believe that I didn’t have to wait for 2 hours to see him?? Dr. Shergy is really great and so smart. He told me that my Hashimotos (Thyroiditis) was probably the cause of my Rheumatoid numbers being high because it’s an autoimmune disorder. I actually learned new information and got referred for bloodwork, water therapy (PT), a bone scan, X-Rays, sleep study, and the Fibro clinic!!! This is a great office to go to if you’re wanting a doctor that knows what to do and can interpret results accurately. He asked questions, did an exam, and interpreted everything to refer me for more testing. Just awesome!!!", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "113899703544765119296", "name": "Janet Patrick", "time": 1568899629755, "rating": 5.0, "text": "I was referred to dr.shergy by dr. And have been with him for 12+ yrs now! His nurses and staff are so polite and dr. Shergy is a God send!!!", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "102078905267656506297", "name": "Peggy powell", "time": 1474637965310, "rating": 2.0, "text": "Waiting time is crazy you sit and sit. The ladies that handle the insurance is SO RUDE and really don't care what they say to you   The ladies that check you in and out are super sweet. The NURSES ARE THE BEST PART THEY ARE FANTASTIC. As for my doctor she hasn't told me nothing about my case yet and I'm still in a lot of pain.", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "113899703544765119296", "name": "Janet Patrick", "time": 1568899629755, "rating": 5.0, "text": "I was referred to dr.shergy by dr. And have been with him for 12+ yrs now! His nurses and staff are so polite and dr. Shergy is a God send!!!", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "105534065579366865744", "name": "Natalie Baker", "time": 1577396020044, "rating": 2.0, "text": "Waited three months for an appointment, in pain the entire time, only a few days before suddenly the doctor will be out of town and now I have to wait another two months to see him. Still in pain!", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "114379225325475078523", "name": "Ariel DeBardelaben", "time": 1443297781883, "rating": 5.0, "text": "Dr. Christie Thomas and staff are amazing. She is very thorough and has been very helpful in my diagnostic process. Autoimmunity and immune related diseases can be very hard to diagnose and it can be incredibly difficult to navigate who to see, for what, and what testing needs to be done, etc. I feel that Dr. Thomas is incredibly knowledgable and has been phenomenal in helping me to reach my diagnosis. I would definitely recommend her to anyone who is needing help with getting an accurate diagnosis.", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "117108519271242202028", "name": "Courtney Bowen", "time": 1574293910775, "rating": 1.0, "text": "The \"office manager\" is incredibly rude! They overall have a terrible staff and are unprofessional. They don't follow privacy laws either! I will never go there again! I advise you not to either!", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "104685965012623259814", "name": "Cheryl Johnson", "time": 1571441435759, "rating": 1.0, "text": "The doctor is in and out of your appointment in 5 minutes and does not even listen to symptoms. Terrible service!", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "105651630870130924502", "name": "Joy Faust", "time": 1435685787945, "rating": 5.0, "text": "They are so well organized and everything moved along in a timely fashion. Dr.Sree is wonderful and truly seemed to care. Tests were ordered and the lab was right there in the office. i was able to go online to my private portal and see all my results. I am completely satisfied with the total experience!", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "115788255775772098030", "name": "Sydney H", "time": 1482204053872, "rating": 5.0, "text": "Very well organized with short wait times. I love Dr Christie Thomas and the nurses. Dr. Thomas had me diagnosed and treatments were started quickly.", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "101992272022936034143", "name": "Cameron Kelly-Johnson", "time": 1546095788222, "rating": 1.0, "text": "Dr. Sree had nothing to offer and didn't even get minor details in his notes about me correct. I had to send the notes to another doctor. My medical records are still incorrect. Run, run far away.", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "103336876467612543952", "name": "Judy Jackson", "time": 1577051995621, "rating": 4.0, "text": "Dr. Chen is very responsive and helpful.", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "102587783905036912879", "name": "CCR CDR", "time": 1516361775084, "rating": 2.0, "text": "Tim Byram is the only reason I continue to go. Kun Chen is a joke he does not listen to your problems and has misdiagnosed almost everything I have had trouble with. He has not ordered any tests in years other than vitamin D. Trying to find a way to get another rheumologist soon.", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "113222096446798788300", "name": "Erin Leslie Z.", "time": 1447257712999, "rating": 4.0, "text": "Tim Bynum, NP is the best! He is by far my favorite person in the office. He's helped me so much with my Fibromyalgia and genuinely cares.\nNot 5 stars because overall haven't had a great  experience with the office staff.", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "117989050837754686934", "name": "laurie south", "time": 1529439528430, "rating": 1.0, "text": "Dr Thomas was so rude. She made me feel like I was only there for pain meds. She was no help and didn't explain anything. I will never go back to her!", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "101854328263908865433", "name": "Jimmy Long", "time": 1437681833514, "rating": 5.0, "text": "Dr. Shergy is an awesome physician. He takes the time to listen to the patient. All of the nurses are awesome. I had to stop seeing him a few years ago but i am working on getting a referral sent in where I can start back seeing him again.\nHeliste", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "100985532588435905852", "name": "sherri deis", "time": 1522344888092, "rating": 1.0, "text": "Don't ever ever use doctor phillip Macon at the rhematory arthritis of huntsville.he is the meanest doctor.i came in with extreme foot pain in both feet had a MRI report he literally looked at my MRI three it at me said there is nothing wrong with my feet while I'm crying in pain he walks out slams the door well now that he never did anything to help me months later still in pain I see a podatrist after test find out I have a bunch of fractures in my feet and have cast on both feet.if he would have done his job and believed me and ran test I wouldn't be in this bad of shape.and yes I was told it started with having rather in both feet and no one helping me to correct the pain is how I ended up like this.please don't use this doctor he don't care about his patients at all", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "115653764217491541737", "name": "Rachel Walton", "time": 1529447806248, "rating": 2.0, "text": "Doctor Shergy and some of his staff are just very rude and we don't recommend this place! Do yourself a favor and go to Vanderbilt or UAB!", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "114003043244423761612", "name": "diane harris", "time": 1604083548265, "rating": 4.0, "text": "It is a doctor office", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "104064375591025959776", "name": "Christopher Lawson", "time": 1560351094736, "rating": 1.0, "text": "Terrible quality of service. Rude employees.", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "109890788987127585033", "name": "karen boone", "time": 1474033925362, "rating": 1.0, "text": "Once you get to a point the dr there give up on you and don't even bother trying except for that money there saving up for their Notice I said their vacationbtime", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "105745585786439237341", "name": "Robin Rozar", "time": 1469462042354, "rating": 3.0, "text": "Wait time is horrendously long. New patient paperwork sent by mail but yet told to be here 30 min early get her at 9:15 appointment at 10:00 called back at 10:30 now almost 11. Drives up blood pressure and make same people crazy. See you patients with in 30 min. Not asking to much!", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "117267968315777482754", "name": "Jeremy Terry", "time": 1504112065711, "rating": 2.0, "text": "Appointment was at 1100 am. I waited until 1230 to be seen. I was told to get here at 1030 for paperwork so I could get in at 1100. They are either too slow, or accept too many patients", "pics": null, "resp": null, "gmap_id": "0x88626cab5c37fea9:0xe9b722dfecfe265c"}
{"user_id": "100804407097119882923", "name": "Mike Curtis", "time": 1578969775329, "rating": 4.0, "text": "Ok .", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xb95ab631b1b761c3"}
