{"user_id": "117632226321439755827", "name": "Neecee Michelle", "time": 1619564664884, "rating": 1.0, "text": "Parents! Please! Listen to me! I'm a parent of a student that chose to move into these apartments! Do not let your child or anyone you know move in here! Terrible, dangerous place to live! Management are very unprofessional and are so rude and disrespectful! People who are writing good reviews are flat out lying! Close this place down! If I could give a negative 10 I would! Please trust me as a parent!", "pics": null, "resp": {"time": 1620058360958, "text": "Neecee, we strive for 100% satisfaction, and we regret to find out that this was not the case. We would like the opportunity to address your concerns. Please fee . We are here for you and would be more than willing to speak with you further about your concerns when you are able. Thank you, and we look forward to speaking with you."}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "106336359464471188549", "name": "Ron Colwart", "time": 1564687439725, "rating": 1.0, "text": "PARENTS DO NOT LET YOUR CHILDREN RENT HERE! It gives the illusion of being safe with the gate, but it hardly ever works.  There was a shooting here and the management didn’t think it was appropriate to contact residents about it.  We found out about it on the news the next day. Stairwells and walkways are dirty, trashy, bandaids, broken glass and poor lighting! Definitely needs a good cleaning! Charged my daughter $50 to clean the carpet at the entrance to her room.  We asked for a picture, they sent us the pictures of before she moved out.  The picture looked like it’s a shadow or the way the carpet fibers are move after vacuuming.  Wish I could upload the picture they sent me on this review! Totally ridiculous, they rip you off!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPO8i7a0nP-bJSk-UTZ1Nd8hL4xqoXx1dXHLeT0=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "104042089206914593216", "name": "D KNIGHT", "time": 1599774803446, "rating": 5.0, "text": "I normally don’t leave google reviews. But since I had a decent living experience at Campus Quarters I decided to leave one. I chose Campus Quarter because they were affordable and offer competitive rates compared to the other student housing properties. Also, compared to the other properties CQ looks nice inside and out. The property manager Mike is very helpful at fulfilling residents requests.  Any problem I had I went to Mike (property manager) and he insured me that he will take care of it. And he did. CQ is a very quiet property no complaints of noise or my neighbors. Parking also was convenient for me which was definitely a plus. In all CQ offers good customer service, good rates, and a good living experience.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "100899029521045149096", "name": "Kelsey King", "time": 1607833660339, "rating": 5.0, "text": "I love living here! Staff is very nice and helpful. Never had a problem that wasn’t fixed immediately. One of the nicer student apartments in the area and it’s fairly quiet most of the time. 10/10 recommend", "pics": null, "resp": {"time": 1608147529659, "text": "Hi Kelsey! Thank you for taking time to review us! We're so happy that you are enjoying living at Campus Quarters and that your needs are being met quickly and efficiently. Residents like you are what make us love what we do!"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "107486982713221819999", "name": "James Robertson", "time": 1604273464103, "rating": 5.0, "text": "Very welcoming and  professional staff, they always go above and beyond to help out with anything from paperwork to finding the right roommate.  I went through a tough situation in life and they made everything easy for me to get settled in my place.  10 stars for the office staff!  The amenities are impressive, I love the fitness center.  I would recommend campus quarters to anyone.", "pics": null, "resp": {"time": 1604326291243, "text": "Hi James! Thank you for taking time to review us.  We are so happy that you are enjoying living at Campus Quarters and we are so glad to have you as a resident!"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "112750935704048493089", "name": "Nathan Schroeder", "time": 1599769174938, "rating": 5.0, "text": "Great staff! nice affordable living space and super close to campus.\nDefinitely recommending campus quarters to my friends.\nAlso the maintenance team is badass :D", "pics": null, "resp": {"time": 1600461492086, "text": "Thank you, Nathan!"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "107410493726706468167", "name": "Cole Zane", "time": 1598979500075, "rating": 1.0, "text": "For anyone looking for an apartment to rent do not go to Campus Quarters. This is one of the worst places I’ve ever lived at. They will find everything to charge you for even if it has nothing to do with you. We had bugs in our apartment almost the entire time we live there and all my roommates were very clean. I said something to the managers about it and they said everybody has bugs there’s nothing we can do about it. We also experienced random power outages on a weekly basis. STAY AWAY FROM THIS PLACE!! I lived there for a year and half. Later I moved back thinking it had gotten better “they had a promo” is the only reason I moved back. They will hound you the entire time you live there about renewing your lease even after you tell them you don’t want to. Just a horrible place to live! Hope nobody has to go through all of this.", "pics": null, "resp": {"time": 1599052759468, "text": "Hi, Cole. We are sorry to see that you feel this way about our staff and that you feel that your experience has declined. We want to assure you that our staff values you as a resident and wants to see that your experience can get back to where it was. We are here for you and would be more than willing to speak with you further when you are able. Thank you. - Campus Quarters"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "108103926039152781702", "name": "Aeriell Lapsley", "time": 1602612638242, "rating": 5.0, "text": "My sister lives at this community and she absolutely loves it. The community is extremely clean and the office staff is friendly too. 5 stars for me!!!", "pics": null, "resp": {"time": 1602781004062, "text": "Hi Aeriell! Thank you for taking time to review us! We're so happy that your sister is enjoying living with us at Campus Quarters!"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "103535058319274793036", "name": "Callie S", "time": 1598742217476, "rating": 1.0, "text": "Awful place to live DO NOT move into Campus Quarters. They will randomly charge you for unknown fees, not very accurate data as far as charges, balance and account statements, most of the time the gate remains open which is a safety hazard for anyone living there. The pool is closed most of the time because of lack of maintenance. The common areas are not always clean and you more likely will step on dog feces...\nCustomer service will put you on a loop in regards of giving you a concise answer to your concerns or questions on random charges on your account so that never gets resolved or it could take up to 3 months for your problem to be unsatisfactory solved. I would highly recommend to look around for a better place. Also Campus Quarters monthly rent is higher than any other student housing around the area. If I could give a ZERO on this feedback I would. Please do your research.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "113431824924471889660", "name": "asia brackett", "time": 1598114093214, "rating": 5.0, "text": "Best Living Experience as a young adult. I highly recommend ALL COLLEGE STUDENTS YOUNG Adult and really anyone to move in", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "117342872511416839035", "name": "Chantal Whatley", "time": 1618579385914, "rating": 5.0, "text": "Friendly and professional staff! Felt very welcome", "pics": null, "resp": {"time": 1618849120830, "text": "Hi Chantal and thank you for taking time to review us! We're so happy to hear about your wonderful experience with us at Campus Quarters!"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "101233681570476538290", "name": "Brandon Dorsett", "time": 1599080661023, "rating": 5.0, "text": "From the friendly staff and the maintenance team who were so proactive and helpful, my overall experience living here was great. Highly recommend!", "pics": null, "resp": {"time": 1600461487286, "text": "Thank you for your feedback, Brandon!"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "113109074032161929495", "name": "Duane Clark", "time": 1598884093419, "rating": 1.0, "text": "As a parent of a student I would suggest any parent thinking of putting their student here to rethink that decision.   Bug infestations are common at this place and additional fees are common place.  Be prepared to even pay out the butt at move out.  No matter how good the room is when your student leaves, plan on $150 cleaning fee for a single bedroom and carpet cleaning of $75 even if the carpet and room are better than it was when your student moved in. They rob students and families here and it's a shame", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "101964745397228049766", "name": "Tristan Garcia", "time": 1600638842162, "rating": 1.0, "text": "If your parents pay your rent then I would suggest living here. Otherwise money hungry and will charge you for anything. Most positive reviews on here are fake.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "100099161230939753014", "name": "Zadora Edwards", "time": 1582656479267, "rating": 5.0, "text": "I have lived here twice now, once a couple of years ago and once now. This time I can honestly say that I had an amazing experience. Ms. Carletta and her staff are nice and helpful and they really care. Even when things are not going great financially they do their best to work with you and help you. They do everything in their power to give you a great experience.", "pics": null, "resp": {"time": 1582836337915, "text": "Thanks for the feedback, Zadora! Glad the staff has #1 customer service!!"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "105619897237516184468", "name": "Tyler Jernigan", "time": 1582845541553, "rating": 5.0, "text": "I have really enjoyed living here over the past few months. I really enjoy all the accommodations that they offer and the staff is always helpful. Would definitely recommend this place to anyone looking for an apartment", "pics": null, "resp": {"time": 1583937159873, "text": "Thank you, Tyler! Happy to hear our staff is taking care of you!"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "100913740264938443339", "name": "Christian Long", "time": 1580844647020, "rating": 1.0, "text": "Do not let them scam you. Never pay the amount they say you do. Their system is set up to take as much money from you as they can, while keeping themselves in the clear. Apartments are not cleaned prior to move in. If you are going to spend this type of money, go get a real apartment. This place is not worth it. Not to mention the whole place smells like a marijuana dispensary. I looked at these reviews and gave them a chance, I don’t want you to make the same mistake.", "pics": null, "resp": {"time": 1580850616692, "text": "Hello Christian, I am sorry we did not meet your expectations. I am not seeing you as a resident in our system, could you please reach out to residentconcerns.com so we can assist? Thank you,"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "102123665219790280409", "name": "Em Ivey", "time": 1588615579560, "rating": 1.0, "text": "Okay so long story but just don’t live here. It wasn’t so much the issues with the apartment as much as it was the issues with the staff. The maintenance people are great and some of the staff are too but I will say I went through a lot and no one did anything to help me. I’ve had several apartments and never have I had a management team that cared so little about the people that live there. My mother had cancer. I got a degenerative disk disease. And my little sister had a tumor. And then I decided to go into the military and I started looking for a sublet. I found one and last minute, it fell through, really screwing me on rent. So I asked for a minute to handle it after paying hospital bills and fines and such and I received rude treatment and no time to handle it. Then my hours dropped at work due to covid-19 and I was unable to do it within the time frame. So I just decided to move out and deal with the move out costs. I was treated horribly after doing so and today I received a call from Mr.Rosengarten who cussed on the phone with me and acted like my problems don’t matter. I told him that they were supposed to take off late fees but they never did (I wasn’t sure if that would help take down the balance a little bit) and he was incredibly mean to me about the fact that that wasn’t enough and that I was confused about that. THIS IS A COLLEGE LIVING PLACE. I’m in my 20s. I don’t deserve to be treated that way by anyone. I’d been through a lot and I was confused and he treated me like I was stupid and cussed at me. I DO NOT recommend living here at all. They are rude and treat you horribly.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "106872901094111328559", "name": "Hunter Powell", "time": 1582845991664, "rating": 5.0, "text": "I enjoyed living here when I did. The staff was nice. The game room was a fun and cool place to hang out with your friends. I highly recommend living here.", "pics": null, "resp": {"time": 1583937140427, "text": "Thank you for your review, Hunter!"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "115251322729648663348", "name": "ABASMR", "time": 1582838938746, "rating": 5.0, "text": "I absolutely love living here! The staff is great and it honestly feels like a family. Living here has made my college experience 100x better. I highly recommend living here!", "pics": null, "resp": {"time": 1583937186857, "text": "Thank you, Anna! We love our CQ Fam!"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "105885488814318743352", "name": "Madisyn Jones", "time": 1589733834952, "rating": 1.0, "text": "If I could give ZERO stars I would!!! My friend has had so many problems with this apartment complex since the day she moved in last August... Broken Gates, Terrible Roommates (she requested not to live with any pets, she ended up with roommates that had dogs & cats with FLEAS), recently her apartment was infested with TERMITES!! (yet has done nothing about it) My friend had to check into a hotel because they’re everywhere, even in her bed!! The front desk people are unbelievable!! Completely disgusting! Do not live here!!", "pics": null, "resp": {"time": 1589909511552, "text": "Hi Madisyn, I see that you aren't a resident with us. Could you ask your friend to reach out to residentconcerns.com so we can address any issues she is having? Thank you!"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "104039887827050071034", "name": "Dyah LeDuff", "time": 1576880466723, "rating": 1.0, "text": "Not a good place for college students to live. You will come out better applying for your own apartment. You stuck with whoever they put you with. They hit you with fees for anything. My advice if you gone pay this kind of money. You definitely don’t want an unknown person in your space. Prices are ridiculous. I won’t be resigning. Everyone experiences is different. It all up to you.", "pics": null, "resp": {"time": 1580422861287, "text": "Hello Dyah, we are sorry you feel like that and would like to help in any way we can with any issues you are having. If you reach out to residentconcerns.com we would love to discuss. Thank you!"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "104095087317282683342", "name": "Jordan Mitchell", "time": 1574276383830, "rating": 5.0, "text": "Staff is always great, on point, & always ready to help at all times! All of the amenities are extremely useful and a nice touch to the property. My favorite part is the dog park they have in the complex for me dog to get some energy out :)", "pics": null, "resp": {"time": 1574276711414, "text": "Thank you for your feedback Jordan!"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "102838425947727294900", "name": "jermale daniels", "time": 1596385063915, "rating": 5.0, "text": "I’ve been living at campus Quarters for 1 year. Front desk staff are amazing with friendly service. The turn around time for maintenance is amazing. They love their residents. It literally no place like CQ!", "pics": null, "resp": {"time": 1580422659526, "text": "Thank you for your feedback Jermale! I'm glad our staff has #1 customer service!"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "114645191144707341455", "name": "Kaylee Brown", "time": 1582653979637, "rating": 5.0, "text": "Super friendly staff. The pool is beautiful, and the rates are great! I plan on moving there this Summer!", "pics": null, "resp": {"time": 1582836305887, "text": "Thanks for the feedback Kaylee!"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "102011326010617275686", "name": "Hailey Curtis", "time": 1564588936057, "rating": 1.0, "text": "If i could leave zero stars I would. This place is a joke. Management doesn’t do anything if you have an issue. The woman in the front office rolls her eyes at you if you try to ask a question. The new people they hire are usually more helpful and friendly. Unless they know you’re renewing they couldn’t care less. You get charged a 60 dollar cleaning fee that they pocket because my apartment was absolutely disgusting. There were roaches in my room, bugs in the freezer, and an old donut box meaning clearly the room wasn’t checked. They put random charges on and since they assume college age kids won’t check, and they take advantage of you. They’re unprofessional and my power bill over summer was 20 dollars over. They put in a work order to check the apartment and the check wasn’t complete until 2 days after bills came out. They don’t care about residents just the money that comes with them. I wouldn’t ever suggest this place to a friend.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "102394561759099313431", "name": "Christopher Nelson", "time": 1574272750037, "rating": 5.0, "text": "Hey, I’ve lived here for three years. I’ve enjoyed every minute that I’ve lived at Campus Quarters. There is always a warm face greeting you at the office. All I can say is I recommend Campus Quarters!", "pics": null, "resp": {"time": 1574276703337, "text": "Thank you for your feedback Christopher!"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "106528409583772945552", "name": "Lauren Abbott", "time": 1582653796101, "rating": 5.0, "text": "Super Friendly staff. I love how I always have a safe place to call my new home!", "pics": null, "resp": {"time": 1582836281520, "text": "Thank you for the feedback, Lauren! Glad you #LoveWhereYouLive!"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "110812075853380125720", "name": "Alex Hicks", "time": 1571507777846, "rating": 5.0, "text": "The staff is great. The maintenance crew is super nice and get to me fast. The front desk staff is always nice and helpful. I love living here.", "pics": null, "resp": {"time": 1574169694983, "text": "Thank you, Alex! Glad you are enjoying your stay at CQ!"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "116359697778641136739", "name": "Brenton Weaver", "time": 1582853962903, "rating": 5.0, "text": "Went to meet some friends and had a great time. Nice place that feels secure yet inviting.", "pics": null, "resp": {"time": 1583936942510, "text": "Thank you for your review, Brenton!"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "111176096618801889667", "name": "Zach Francis", "time": 1582841912258, "rating": 5.0, "text": "Very friendly welcoming place. Staff is great and  I enjoy all the amenities", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "104232265234513817956", "name": "Gage Coleman", "time": 1582854751290, "rating": 5.0, "text": "I love living here. Staff is very friendly and the pool is great during the summer.", "pics": null, "resp": {"time": 1583936912335, "text": "Thank you, Gage! Be on the lookout for awesome resident events coming up!"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "105115066802552877786", "name": "hunter jernigan", "time": 1582848695646, "rating": 5.0, "text": "It’s a great place to live. They take care of all the things you need taken care of and the pool is really nice.", "pics": null, "resp": {"time": 1583936975235, "text": "Thank you, Hunter! CQ's pool is definitely #1!"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "115046798368393449304", "name": "Taylor Cooper", "time": 1582239224740, "rating": 5.0, "text": "This place and its staff was a big part of my college experience and I would highly recommend it!", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "107686038705168820461", "name": "Janet Kennedy", "time": 1537812265985, "rating": 5.0, "text": "Campus Quarters offers great management and the satisfaction of its residents are very important to the staff. Kenyatta is a leasing agent for Campus Quarters and she goes above and beyond for her residents. Our living room carpet had been destroyed by the residents before us and she came herself with equipment to clean our carpet. Living here has been a great experience so far especially with the advantages of the pool, weight room, and computer lab which is great if you are a student!", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "112871571441119353982", "name": "Andrew Selph", "time": 1582847939895, "rating": 5.0, "text": "I love living here it's great. The staff is amazing.", "pics": null, "resp": {"time": 1583936987748, "text": "Thank you for your review, Andrew!"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "106773881195965288011", "name": "Jeff Hall", "time": 1565122081799, "rating": 1.0, "text": "In the beginning it was pretty great, but then management changed. I wouldn't reccomend this place to anyone unless it is out of complete necessity. After checking your place, they leave room doors unlocked and lights on. Constantly getting bills wrong. Overcharging. If you don't say anything it won't be corrected. Its supposed to be a hated community, but the gates are usually broken. Maitanence is usually pretty good. Overall the last year and a half was horrible with the management team. Upon move out make sure that you asked them about the specific things you're responsible for. They charge a $65 cleaning feels for each member but that does not include the common areas so you might as well double that price. They're going to get their money one way or the other.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "100643700367592738250", "name": "Jacob Warye", "time": 1561491618306, "rating": 5.0, "text": "This 5 stars is for the maintenance team. All three gentlemen who do all off the maintenance here have always been a class act and are so helpful with the little needs we have had. These guys have truly made living in our apartment and keeping up with the demands of CQ excellent and these guys do an outstanding and exquisite job providing maintenance care to us and our apartment. Maintenance can be overshadowed at times but these guys deserve a ton of credit for CQ’s success. Props to you guys for all of your hard work and help in the past three years. 🤘🤘", "pics": null, "resp": {"time": 1564485383905, "text": "Hi Jacob! Thank you for your review and feedback. We are happy to hear the maintenance team has been so great :) High five to them!"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "100395503271139388588", "name": "A.Marie Murphy", "time": 1538617142395, "rating": 5.0, "text": "Campus Quarters is a great place to have a first experience with living in an apartment. The facilities are nice and modern, they also offer pretty much anything you could think of an apartment complex having. Any problems that may be faced can easily be resolved, as maintenance is very easy to get a hold of and there's always someone at the front desk in the main office. The location is also extremely convenient, besides the fact that it's barely 3 minutes from USA; it is also near many restaurants and fast food places. To top that off, there are several groceries stores all within a 0.7-2.4 mile radius and it's fairly close to all of the entertainment that can be found on the Airport strip.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "110346897026979077140", "name": "Joy McCloud", "time": 1588034861677, "rating": 1.0, "text": "Do NOT rent here! I along with other student residents, lost our jobs when the University closed due to COVID-19, however, campus quarters refused to offer any assistance to those who may be struggling to make payments. Instead they have threatened to evict us and charge us with $100 late fees that they refuse to remove from our accounts. They do not have the well-being of the residents in mind!", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "102531878508861120479", "name": "Emily Huhn", "time": 1548250266371, "rating": 5.0, "text": "Okay, the kitchen in the 2 bedroom is amazing. There's enough counter space for me to cook and make a mess. My roommate and I always have enough room in the cabinets too. We had a couple of things go wrong with our sink, but the office and maintenance guys took care of it super fast and was really responsive. After they did that, I renewed my lease for next year because it's hard to find apartments where the people care.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "109086198601491890799", "name": "Lanace Davis", "time": 1566000214760, "rating": 1.0, "text": "As a parent of a resident, I’d hoped for a clean safe environment. Move in day was a joke. You pay a yearly $75 cleaning fee only to have to do a major cleaning upon moving in. The vents were caked in dust, the floors and carpets were disgusting with stains. Half of the light bulbs were blown, I swept up, what looked like an entire bag of rice from the floor behind the refrigerator, along with a cell phone case and a hairbrush. It was just nasty!  Then come the “overages”. Almost every month it was something else. I paid twice for a window blind to be replaced and when the third charge occurred, I called and complained because it was never fixed, even upon the date my Son moved out. They claim to offer free WiFi, my Son was without WiFi for over 4 months, and reported it weekly. The security gate was broken close to 7 out of the 12 months he lived there and just stayed open 24 hours a day. There was a shooting in the parking lot and when I called to get answers about it the next day, I was told that they didn’t know what I was talking about. It made the news, but nobody in the business office had a clue. Find somewhere else to live!  Don’t waste your hard earned money on this place!", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "106141304739619703357", "name": "jakki amos", "time": 1583453684618, "rating": 5.0, "text": "I normally don't write reviews, good or bad; however, I believe the issue I had with Campus Quaters was handled with professionalism by the management team.  Thank you Michael Quinn and Carletra Cheeseboro for resolving this issue for me!!", "pics": null, "resp": {"time": 1583936828792, "text": "Thank you for your review, Jakki! Happy to hear Mike and Carletta took care of you!"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "117528274975463371328", "name": "Kellie Orewiler", "time": 1547569195339, "rating": 5.0, "text": "Customer service is truly one of a kind. From the moment you walk in the door the staff is ready to assist with ANYTHING you need! As a resident you truly feel cared about! The gym is always open and the pool is the prettiest place to hang out with friends!", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "102760119041583973689", "name": "Brittney Booker", "time": 1567703190094, "rating": 1.0, "text": "Rare is it that I leave a review, and I honestly tried not to, but they have no respect for the students they house. So, I'm going to be completely honest. They legitimately seem like crooks, and no one should stay here. It's September, my lease ended in July, and they're still trying to squeeze money out of me as they have been throughout the year. Whenever I go into the front office, they're either really nice or really dry. There's no in-between. The apartments themselves aren't bad, but they are very overpriced. Before you sign a lease, read it because there's all sorts of things they like to pull out of thin air *seemingly*. If you're smart and you care about your money, you won't stay here. There are other options, so I advise you to check those out.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "109225704577276569821", "name": "CheekyWabbit251", "time": 1565727454441, "rating": 1.0, "text": "THIS PLACE IS A JOKE. DO NOT LIVE HERE. THEY WILL TRY TO PERSUADE YOU TO SIGN AND ONCE YOU DO, ITS OVER. THEY ARE CONSTANTLY CHARGING YOU WITH RIDICULES CHARGES. THE MAINTENANCE WILL TAKE MONTHS JUST TO FIX THE SIMPLEST THINGS. THEY WILL JUST COME BARGE IN IF YOU ARE NOT THERE WITH NO BEFORE HAND NOTICE. I PROMISE YOU THAT YOU DO NOT WANT TO LIVE HERE. THE GATES ARE ALWAYS OPEN AND THE TIMES WHEN THEY ARE CLOSED, THEY DO NOT EVEN OPEN. THIS PLACE DOESN'T EVEN DESERVE A 1 STAR RATING.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "105966969580950206216", "name": "Laury Blake", "time": 1598741018779, "rating": 1.0, "text": "Extremely high rent prices. The place itself isn't well organized and the staff isn't very helpful stay away from this place.", "pics": null, "resp": {"time": 1598974093438, "text": "Hi Laury. I am not seeing any record of you as a resident or signing a lease with Campus Quarters, but do apologize for your negative experience. We are here for you and would be more than willing to speak with you further when you are able. Thank you. – Campus Quarters"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "100698412290557581571", "name": "Mary Fabbrini", "time": 1564497659085, "rating": 1.0, "text": "I subleased an apartment at Campus Quarters this summer from May-July. The general layout was nice, a spacious living room and kitchen. And the front desk staff has always been friendly. However, I have been extremely disappointed with the way the complex is managed. There were only two tenants living in the apartment this summer, and both of us were gone a minimum of 8 hours a day, often more. The lights were kept off, the dishwasher not used, and the A/C set accordingly. Every month we were charged at least $20 extra for power. I went to the front desk and asked to see my bill and requested an inspection to see why our bill was so high. The representative was friendly and submitted my request on July 8th. My request was not completed until July 30th, two days after the power bill had been posted. In the report they filed, there was not a single note for me to read about if they found a reason the bill was high or anything of the subject. Keep in mind the other tenants who are not residing here are also having to pay for these power overages. It has been extremely frustrating dealing with these issues. We are all college students with other bills the pay, and it feels like every day I look I have another charge on my account. On top of rent you have to pay $4 a month for pest control, another $4 a month for utility billing, and if you don't have renters insurance it's $12 a month. I will not be renting here again and would not recommend it to a friend.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "110672188743253933489", "name": "Darryl Williams", "time": 1571358169207, "rating": 1.0, "text": "Worst place ever DO NOT LIVE HERE . I wouldn’t recommend this place to nobody. Maintenance just walks in your apartment without any notice or letter saying maintenance will be stopping by . They charge you with ridiculous fees and enjoy you suffer. It’s only one person that actually helped me in the office but everybody else is not very professional. My lights over my counter top and my laundry room light has been out since I moved in I put in a request for maintenance to come change them 4 times still no one came yet . I hate it here This is only my 2nd month here and I will be moving out ASAP!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "106074172228792859801", "name": "Kenyatta Knight", "time": 1529939478445, "rating": 5.0, "text": "This is a great place to live when you're starting off with your first apartment! Staff was very nice and helpful through the process. I love meeting different people and my roommate match was awesome. I enjoyed the pool area and different event they host for residents. It is walking distance or a bike ride away from the campus!", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "117222675033774519940", "name": "Claudia M Martinez", "time": 1598743663627, "rating": 1.0, "text": "Disgusting Customer service and strange fees on your account for no reason.", "pics": null, "resp": {"time": 1598974001464, "text": "Hi Claudia. I am not seeing any record of you as a resident or signing a lease with Campus Quarters, but do apologize for your negative experience. We are here for you and would be more than willing to speak with you further about your account when you are able. Thank you. – Campus Quarters"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "112808976529612833192", "name": "Madison Metcalf", "time": 1581706572430, "rating": 1.0, "text": "When I first moved in the whole place was dirty the carpets smelled and were stained, there were dried up liquids on the cabinets and counters, the fridge was dirty, the tub was dirty, there were blinds missing out of random rooms, they will change you monthly so be expected to pay more than rent, the gate is always broken, there was 2 giant roaches in my closet when I moved in, the fans are covered with dust, I also vacuumed just my room and the whole vacuum was filled to the top with dirt..so no telling how long anything was actually cleaned. Also behind the washer and drier is caked with dust and there were dirty soccer cleats behind them...just expect to pay more than rent and things to be dirty.. I would never recommend...", "pics": null, "resp": {"time": 1582148409557, "text": "Hi Madison, I am not seeing you as a resident in our system. Could you reach out to residentconcerns.com and we can discuss any issues you are having? Thank you!"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "110451303873636339400", "name": "Erin Masson", "time": 1574125848640, "rating": 1.0, "text": "Awful! If I could give no stars I would! Kenyatta and the rest of the managers will LIE and say things to get you to sign a lease! Money hungry theives is what they are... If you are a student stay FAR AWAY from this so called \"apartment\". Horrible managment... Just stay on campus or rent a HOUSE!!!", "pics": null, "resp": {"time": 1574177949552, "text": "Hello, Erin. We apologize that you have had a negative experience. I am showing that you did not move in to your apartment, but if there is something else we can be of assistance with please reach out to residentconcerns.com"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "103569117311392648120", "name": "Trent Larson", "time": 1433432874284, "rating": 4.0, "text": "All in all, Campus Quarters is by far the most satisfactory student-marketed apartment complex near the USA campus. The rooms are nicely furnished and perfectly sized for a college student. Having a private bath and a walk-in closet is a HUGE plus. The wonderful selection of amenities available in the clubhouse are a nice bonus, as well. The only negative I've found so far is the disparity between resident and visitor parking - I feel like there could be more visitor parking.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "107241121651852863947", "name": "Nay FitzMcGuinness", "time": 1537802082274, "rating": 5.0, "text": "Living here at Campus Quarters has been amazing and I love all the staff they are friendly I’ve been living here for 3mos and I know everyone by name and they are on point with their maintainene. It’s very quiet can get a lot of work done and get any school work done. Close to many shops and restaurants to go to. Kenyatta is the best leasing agent but also a great front desk agent. Ask for her.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "110915897325999973487", "name": "Catherine Stutts", "time": 1564682490340, "rating": 1.0, "text": "Campus Quarters is the reason I will NEVER live in \"student housing\" again. They pick and choose which parts of the lease they want to follow, most of the front desk staff is either extremely rude or doesn't know what they're doing. By the time I turned in my keys we were on the 3rd general manager if that tells you anything about the staff here. Maintenance requests were constantly deleted or cancelled by staff. Was told I could store my stuff in an apartment before move-in day and was also informed that I would not be living there, so imagine my surprise when they stuck my preferred roommate in there. Holes in the walls, infants, and drugs everywhere. When I came back for move-in day I was told that maintenance would help me move my stuff, instead, the manager at the time helped me move trash bags filled with not only my stuff, but with actual trash as well. Absolutely ridiculous. Charged a $65 move-out cleaning fee that they wrote in in the special provisions tab which I was told covered the price of someone coming in to scrub the toilets and bathtub. Really? $65 for something I had already done? Also got stuck with a $50 carpet cleaning fee. When I inquired about this additional $50 fee I was not told what was actually wrong with the carpet and then hung up on by the first person, and then told by the assistant manager that typically if someone lives there for a year the carpets just have to be cleaned. So be prepared for that if you choose to live in this fresh hell. This place is just NOT worth the price! I'd much rather live in my car.\n\nRoommate matching is a TOTAL fraud. Got stuck with the messiest, craziest people. I'm trying to go to school and get out, not listen to a bunch of psychos partying in my place until 3am and bringing drugs in and out 24/7. Was told that my roommates nor I could be in the apartment when we had our one TERRIBLE roommate move out. She had keys for 4 days when only permitted by law to have them for 2, did not have to pay the transfer fee that the rest of us were told we would have to pay if we chose to move, also stole from my roommates and destroyed personal property as well as attempted to destroy appliances. Wasn't in school, burned the couch with her curling iron, which the rest of us got charged for upon move-out, abused her two dogs that she didn't pay for, and was constantly smoking weed with all of her friends. Tried to blame me for her drugs and friends, and only after we called the police did she decide to go to the office and say that she was too scared to live with us, and to top it all off call us all racist while she made racial remarks to us the entire time she lived with us. Got a call from Kenyatta telling us that they had \"proof\" that we were racist. Talked to corporate manager about this disgusting accusation and was told that nobody thought that we were racist and seemed confused as to why I was there. So I suppose if you have friends in the office, you'll have a great time and won't have to worry about rules.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "116664812211597777332", "name": "Katilynn Underwood", "time": 1475524333967, "rating": 5.0, "text": "I have been living at Campus Quarters for a few months now.. so far, everything has been awesome! The place always looks really nice and the amenities are nice as well. Everyone up front is always friendly and happy to help. Any issue I have has been resolved very quickly. Great place for a great price, and plus, it is super close to campus! Definitely would recommend!", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "102666608379373051966", "name": "Madison Espy", "time": 1545068083403, "rating": 5.0, "text": "I am hoping to live here in the summer and I have heard great things about the parties and resident things.  My mom and I were looking for a releaser and a nice group for me to join.  I feel like the office staff really cared and guided us well.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "116005785264934902984", "name": "Callie Estra", "time": 1559396349908, "rating": 1.0, "text": "A friend of mine lives at this awful place. Luxury apartments? I don’t think so. The place smells like mold, there were cracks in the ceiling, and whoever painted the inside of the apartments needs to be fired. Also the security here is a joke. My friend has faced so many issues with this place but unfortunately signed another lease for next year. Hopefully she can get out of it early. There are so many nicer places around here to go live at so if you’re looking at reviews before checking the place out, just don’t, find the nicer apartments in town.", "pics": null, "resp": {"time": 1559597514009, "text": "Hi, Callie - thanks for your note. We hate to hear that your friend lives with us, but you don't. We love when we get friend referrals from our current residents. We would love to chat with you and give you a tour of our facility and meet with your friend who is a resident and address all of her concerns to ensure you both do not feel this way. Please reach out to residentconcerns.com and we will schedule a tour with our GM to walk the property with you and your friend. Thank you again, and we look forwarding to meeting you soon! - Campus Quarters Team"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "103099901455102130111", "name": "Kelly Cockrum", "time": 1582851472923, "rating": 5.0, "text": "Great experience living here so far!", "pics": null, "resp": {"time": 1583936956467, "text": "Thank you, Kelly!"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "113524728082041123465", "name": "Megan Wade", "time": 1558671401840, "rating": 1.0, "text": "If I could leave no stars I would. I’m currently living in the 4 bedroom apartment and this place is awful. FIRST off, my dog was attacked by another dog which resulted in me having to pay $300 in vet bills and having to drive back and forth to the vet for weeks while he recovered. I called and kept showing up at the office asking them if they found the owner of the dog but they of course didn’t do anything about it. Never even called to check on him or to tell me that they couldn’t find the owner. SECOND, they charge you for random things all the time then call you over and over again trying to get the payment. Like what’s the point of having a balcony if you can’t actually use it? THIRD, I only have two roommates, one of which has already moved all of her things out while the other still has her personal items here, she has only been at the apartment physically 3 times this whole month and Im usually only here at night due to working, so why were we charged $30 in overages? Y’all are way too overpriced and clearly don’t care about your tenants. Do NOT sign a lease with these people!!!", "pics": null, "resp": {"time": 1558702236439, "text": "Hi, Megan - thank you for your review and feedback. We apologize that your experience at Campus Quarters has not met your expectations, as our goal as a property is to exceed them. We hope to change your review, and exceed your expectations with us next year, and are delighted that you have renewed with us. Towards this end, we will have maintenance come review your unit to ensure there are no issues with your apartment regarding your overages from usage. In addition, we will also have the front office call you and explain the concerns regarding the fine on your account and review the community rules. While we understand your frustration, we hope to change this into a positive and look forward to you being part of our community this upcoming year again. Sincerely, Campus Quarters"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "117692548085206321600", "name": "Nancy Vu", "time": 1442428873954, "rating": 1.0, "text": "My Campus Quarters experience was to the point where IT IS SO NECESSARY to write a BAD review on it. This is my opinion, I am not trying to defame on the business. I mean, despite the bad, they have good amenities, for instance: the pool, the play lounge, the prices for each room is reasonable (if you have the money), and the apartment is already furnished. BUT, the management is not terrible, it is HORRIBLE. I always ask questions and the people who I have spoken to never seem to understand or know the answer (BAD STAFF). I am not depicting ALL staff, some had common sense and reasonable knowledge to my questions. The higher staff never seem to comply with your disbelief regarding a financial situation. CAMPUS QUARTERS IS JUST A BAD LIVING EXPERIENCE. They are out just to charge you and get your money. They don't care about you. My recommendation, don't go here.\n\nWith regards,\nA resentful ex-tenant", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "116129472140354097324", "name": "Emilia Wilson", "time": 1475515900386, "rating": 5.0, "text": "All my friends and I live in Campus Quarters and love it! Its the perfect distance away from campus. Not so close that you can hear the band practicing, but not a ten minute drive like some other complexes. The community is gated and because of the close proximity to the other buildings, I can easily walk to my friends' apartments quickly and safely. The apartments are spacious and fairly priced. I definitely take advantage of the amenities CQ offers like the pool, gym, and tanning bed. The computers and printers are a lifesaver because I don't personally own a printer and constantly need one for classes. Overall Campus Quarters is a great place to live and I recommend it to all of my friends looking for apartments.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "106786915221229569104", "name": "Daeion Fuller", "time": 1582859705531, "rating": 5.0, "text": "Everyone is very friendly and Miss Carletta helps in any way she can.", "pics": null, "resp": {"time": 1583936842710, "text": "Thank you for your review, Daeion!"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "113836252907895654656", "name": "Kenya Watkins", "time": 1553785955147, "rating": 2.0, "text": "Campus Quarters are definitely an eye catcher and staff is super friendly when you first enter into the office and sign the lease. The apartments are nice to a certain degree and the area is convenient that's for the two stars that was given. However, once that lease is signed then everything changes.\n\nThis was my daughter first experience with college and leaving home and it was unethical. They are overpriced with their made up electric overages and will not repair anything unless the parent actually calls. Ms. Kenyatta seemed to be very helpful from the very beginning but upon moving out apparently she became frustrated and was very mean to my daughter so I begin dealing with her.\n\nThey will overcharge for things that you never even heard of and its ridiculous that they rip off young adults that are becoming the future.  They tell you one thing then do the next. I think they would be better if they were to increase their customer service skills and explain to tenants their procedure upon moving out. They will create charges like never before and will repeatedly tell you that its going on your credit. I think they actually enjoy that part.\n\nAlso there were shooting incidents in the parking lot and the only response they could give was \"everything is fine\" we will have security to patrol the area. It seems to me they should have been more proactive. The shooting was the last straw for me.\n\nIf you move here make sure you take pictures upon moving in and moving out.  Try not be so needy. Make sure you keep clothes on 24/7 because maintenance pops up whenever they please without a knock. I think this place has a lot of potential but definitely needs some changes. Be safe, be careful, and be blessed!", "pics": null, "resp": {"time": 1553797348493, "text": "Kenya, thank you for your review. I am not able to find you in our system as a resident, please give us a call at the office to speak with our General Manager, as we want to ensure we have addressed any issues you have! Please call us today at (251) 202-5204. Thank you, and we look forward to speaking with you. Cheers, Your CQ Team"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "113795812760437592475", "name": "Franchie McMillian", "time": 1557884056610, "rating": 1.0, "text": "ALL PARENTS PLEASE BE AWARE OF THIS PLACE MY DAUGHTER WAS ABLE TO GET MY INFO AND RENT AN APARTMENT IN MY NAME THAT SHE DIDNT KEEP AND LEFT ME. $7000 debt. AND THEY FEEL THIS IS LEGAL. THIS SHOULD NOT EVER HAPPEN TO ANY PARENT. AND THEY SAY IT WAS ALL ELECTRONIC THIS HAS TO BE ILLEGAL FOR HER AND THE APARTMENT ADMINISTRATION. THIS WILL NOT HAPPEN TO ANOTHER PARENT. Children do things and truly don’t understand the effect this could have on their family so young people this is wrong and it can really affect your family in a very negative way. Stay home until you can afford to be a real adult and pay your own bills.", "pics": null, "resp": {"time": 1558022543731, "text": "Hello Franchie, thank you for your review. We take these matters very seriously, please contact use at residentconcerns.com so a member of our senior management team can reach out.\nThank you."}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "102886764991554224924", "name": "Gayle Marks", "time": 1537831554640, "rating": 5.0, "text": "Very kind staff. Move in day was very organized and streamlined. Happy to have my daughter so well taken care of!", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "117501321716954366085", "name": "Takara Jackson", "time": 1570486517699, "rating": 1.0, "text": "This place is AWFUL believe all the negative reviews you see. They are thieves, crooks, liars and con artists. Stealing money from college students...how unethical, and pathetic can you be. Money hungry con artists taking advantage of students who aren’t experienced in living on their own. Seriously ridiculous.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "105076326964221895024", "name": "Sarah C", "time": 1522115361075, "rating": 5.0, "text": "Been having some issues with my roommate since she got a new boyfriend. Office was super helpful in finding a new apartment when it got to the point of needing to move. Caitlin and Hailey were great through the process and always helpful and kind", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "104425702029493846891", "name": "Jesse Coffia", "time": 1433862335591, "rating": 5.0, "text": "Living here is easy and simple. This is a great place for college students. They just need more things for college students. The pool is great, but it would be better if it had a bar.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "116623108262470442072", "name": "William Hardigan", "time": 1490149538025, "rating": 1.0, "text": "Campus quarters is a nice enough place to live. However, their only desire is to rob you of your money: they do so effectively. It is probable one of the most expensive places to live around South. It is absolutely NOT worth it. Unless you excrete money, stay away from this place. Not only is it ridiculously expensive, but also some of the staff delight in your misfortunes. I regret having lived here. It is far cheaper and better to live elsewhere. Also they tried to tempt us with Tempurpedic mattresses; however, these things are as hard as bricks. Completely uncomfortable. I'd rather sleep on the floor.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "109483935038148339476", "name": "Alyssa Taylor", "time": 1540255968139, "rating": 1.0, "text": "One star just does not do the justice. I wrote a nice, long review a few months back telling nothing but the truth and it was taken down, and I was not able to post any more reviews through that account. Currently being in contact with Campus Quarter through my OUTRAGEOUS move out statement that I am working on refuting, I feel the need to keep my personal review up to date.\nI moved out of my apartment a couple months early and left it cleaner than it was when I moved in. Had my rent paid ahead of time. Upon moving in, there was mold all on the baseboards of my bathroom. Upon moving out, I turned the air off; as I was NOT going to be paying overages when I'm not even living there. (My overages were around 20-40 bucks a month) They were high and very inconsistent. I would have an overage of 30 bucks or so in the month of December. (I was home 90% of that month and the air would be off and windows cracked) Then in the middle of July, air on, windows closed, my overage was around 7 dollars. Makes no sense.\nSo I move out, turned the air off, left my apartment clean. I get a text from my ex-roommate saying that there was mold all over the place. Myself being the last one there, I was charged with a $7,000 dollar statement for cleaning that tiny, tiny apartment. That's enough money to clean an entire 2 story house with mold worse than that.\nNot to mention that maintenance barges in whenever they please (email or not), dogs are off-leash everyday. (I love dogs, so this has nothing to do with being anti-pets\" or anything. But some will run up to you and your dog and bark sort of invade privacy with the owner nowhere to be seen), rude, careless management, expensive/rude/very far towing company, loud neighbors, and cheap apartments put out to be \"luxury\".\n0/10, would not recommend.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "100132082946722983112", "name": "Tori Coker", "time": 1475639592042, "rating": 5.0, "text": "The apartments are very nice and updated, and maintenance handles any problems quickly and without a hassle. The people in the office have always been helpful and are so friendly! They have made moving away from home such a breeze and it shows that they work hard to make CQ a welcoming environment.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "106306775720798461058", "name": "AJ Deshazor", "time": 1532358533224, "rating": 5.0, "text": "Campus Quarters is a very beautiful apartment complex. The staff is super helpful and kind. It is overall, a great place to live.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "102678520822899667727", "name": "Dan Allen", "time": 1532360189663, "rating": 5.0, "text": "A lot of my fraternity bothers live here and that is why I picked Campus Quarters. After living here for a year now I LOVE it and just renewed my lease last month. You can't beat all included and the cool events they throw!", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "108284514303616924147", "name": "Kayla Adams", "time": 1449107702114, "rating": 5.0, "text": "This has been one of the best places I've lived! The service is great, whenever I call the front desk they are always able to answer my questions and send someone to help fix anything that I needed to get fix.  Definitely will be resigning my lease for next year. Plus my roommates are some of the coolest people I've met.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "117254265125218852654", "name": "Destinee Penigar", "time": 1420829944440, "rating": 5.0, "text": "I lived here the first two years they were open and I loved it! I moved from my dorm on campus and signed a lease as soon as I could. The furnishings are high-class and you can't beat the amenities. The maintenance crew and office staff have always been helpful and make it a fun and inviting place to live!", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "103632973077169159559", "name": "Ulla Compton", "time": 1539644007929, "rating": 5.0, "text": "Campus Quarters made the leasing process quick and easy. Ms. Kenyatta made sure that we were squared away and our unit was up and running properly for the semester.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "116940727119900926969", "name": "Paul Thompson", "time": 1409318808821, "rating": 1.0, "text": "While i could list the ways you should Never Ever Ever live here.... But Parents or potential residents. I ask you just go up there on any random night and walk around the parking lot and complex. Notice how many lights dont work(a lot especially the back) and its hard to see even where there is light. Just ask yourself do you feel safe having your daughter live here for a whole year?", "pics": null, "resp": {"time": 1415728929848, "text": "Paul - Campus Quarters sincerely apologizes for any concern you may have with the lighting at Campus Quarters and is more than willing to discuss these concerns in our office; however, we are not certain how to reach you as you are not a tenant at Campus Quarters.\n\nWe do want to respond to your comments and let you know that monthly light checks are done at Campus Quarters and burnt out bulbs are replaced at that time.  If you, or anyone notices bulbs that are not working you are more than welcome to come into the office or put in a work order and they will be replaced.  Our tenants wellbeing is a primary concern of ours and we do want to make certain that Campus Quarters is properly illuminated.  Campus Quarters also meets and/or exceeds the minimum lighting requirements as established by the State of Alabama and Mobile County.  Again, please do not hesitate to come in to the office to discuss your concerns.\n\nSincerely,\n\nCampus Quarters"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "111980478643104740263", "name": "Kevin Kellner", "time": 1582824407217, "rating": 5.0, "text": "I would recommend CQ!", "pics": null, "resp": {"time": 1582836357225, "text": "Thanks for the feedback Kevin!"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "102275097863325543301", "name": "Alli Wolfe", "time": 1492648033022, "rating": 1.0, "text": "Management is terrible. Due to a mistake on their end that they admitted was their fault, I am now having to either REPAY the $500 pet deposit or get rid of my cat. I payed this deposit two years ago when I first adopted my cat. This is not the first time they have done this, this is just the first time the mistake has not been fixed. I should not have to pay for their mistakes, literally. This is not the first issue I've had with them this is just the first issue that has prompted me to write a review. Their only redeeming quality is the apartment units themselves. They are very spacious and cozy. Overall I wouldn't recommend this place to anyone. The management is too unorganized.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "112077041627495279118", "name": "Jarrell Robinson", "time": 1547535260823, "rating": 5.0, "text": "Couldn’t have picked a better place to live feels like home away from home.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "104698540580146337681", "name": "Emorie Cote", "time": 1532360295841, "rating": 5.0, "text": "Lived here for 3 years. Every problem I have had has been dealt with quickly. Really sad that I am leaving this great place!", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "112931385580116976302", "name": "Ashley Dutton", "time": 1474397831075, "rating": 5.0, "text": "Campus Quarters is the ideal place for students to live. It's very convenient living so close to Campus, but still not having to live in a dorm. Management has been super helpful, and they're always willing to assist me with any problems.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "114569584862072447129", "name": "Taylor Smith", "time": 1548699200703, "rating": 4.0, "text": "Great place to live, fun environment with a great staff who genuinely cares!", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "104828197570237764893", "name": "Heather Askew", "time": 1537810131384, "rating": 4.0, "text": "Great customer service & friendly staff ! Also very close to South so commute isn’t too bad to class !", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "115529757578117374752", "name": "britney thompson (brat)", "time": 1569440301379, "rating": 1.0, "text": "this is the worst thing i’ve ever gotten myself into. this is the worst place to live. it’s dirty, the washer & dryer doesn’t work, HIDDEN FEES, & lies lies lies!!!! they have us trapped in a lease.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "107595251864338562844", "name": "Alli Bell", "time": 1474317801036, "rating": 5.0, "text": "I love living at Campus Quarters! Everyone in the front office is so nice and helpful with moving in, and answers any questions I have. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "110830717650118224542", "name": "Haley Howell", "time": 1434485093411, "rating": 5.0, "text": "I love my apartment! :) I moved here mainly to get a kitchen (I was tired of dorm life), but I am really loving my apartment for so much more than that. The office started being open on Saturdays again, and that is also helpful!", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "103952162633643300717", "name": "Anil Mangal", "time": 1552681965126, "rating": 1.0, "text": "Worst experience I have ever had of this so called “apartment complex”. Let me tell you that these people will squeeze every single penny out of you with overages. Upon moving in the apartment was filthy covered in mold, pet fur from the previous tenants, and dust. This “luxury style” apartment, in my opinion, should be no comparison to other residential apartments that I have stayed at such as The Grove, The District, and many more. If you are in college to party and do drugs this is the place for you. You will smell Marijuana continuously throughout the day and night everywhere throughout the apartment. Do not stay here if you are planning on sleeping whatsoever. Constantly getting bogus overages for charges that were not my responsibility was a major issue. One instance Was trash leftover in the balcony that was not mine, was fined heftily for this. Being fined for leaving a trash bag for less than 30 seconds while going back inside and getting my car keys was another 50 bucks. This does not come close to the most ridiculous and idiotic scheme i have ever heard. They tried to fine me for having aluminum foil on my window 😂 this has to be one of the most poorly managed, un organized place that i have ever stayed at. Want to talk to a manager about issues? Good luck! You’ll wait over 4 hours on the phone trying to get in contact with even the slightest person of authority. Everyone in the office has a piss poor attitude and the maintenance people take years to arrive and even fix the issue. The staff is nothing but ignorant college kids. If you want to stay in mobile and you are a student, do yourself a favor and get yourself an apartment at literally any other place in mobile. Another huge issue was the roomate situation. After having a terrible roomate leave, another even worse roomate arrives UNNOTICED!! By being assured that they would interview me if another roomate arrived, another roomate arrived surprisingly unnanounced. This has to be the most terrible and unprofessional establishment that is in Mobile. Please do yourself a favor, if you are a parent and you want your son or daughter to thrive and be successful in college, do not let him/her live here. You will be stuck in paying overpriced unreasonable rates to these clowns.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "103002422015025029384", "name": "Marianne Castleberry", "time": 1556548199577, "rating": 1.0, "text": "My daughter talked me into her moving into Campus Quarters....and we have had several problems.  Now, they actually think we (mom) is going to pay for a fine for leaving a garbage bag outside the door (back hallway) until it stopped flooding rain.  Several maintenance items inside the apartment have either not been fixed or took weeks to get completed.  I have called the office only to speak to a staff member that had to take another message.  Finally the \"new\" property manager called me over 24 hours later.  Did  not resolve anything.  Did not remove the charge.  They are gouging the student in this area.  I am contacting Corp as well today.", "pics": null, "resp": {"time": 1556628618440, "text": "Hi Marianna, thank you for your review and feedback. I apologize for your frustration with our community. Could you please reach out to residentconcerns.com and one of our senior management team will be in touch. Thank you,"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "115177441646534982664", "name": "Blaine Cardwell", "time": 1474393036541, "rating": 5.0, "text": "I had a great experience here at Campus Quarters. The management was really good, the people in the front were very helpful!! Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "100146470339621507777", "name": "Haley Johnson", "time": 1544944346365, "rating": 1.0, "text": "Upon move in our apartment was absolutely disgusting with dead bugs in the freezer, trash on the ground in the rooms, a sticky substance seeping up from the carpet in my bedroom, an entire box of old Krispy Kreme doughnuts under my roommate’s bed, and dried food on the kitchen walls despite renters being required to pay a $65 cleaning fee when moving out (where did that money go?) Maintenance takes a very long time (if they help at all), so expect up to 3 weeks to fix your issue. Noise complaints are generally disregarded unless a large party is going on at night. The living room is very spacious and the appliances are nice, but this can be found at other complexes near campus. My roommates and I tried many many times to get the staff to help clean the mess that was left in our rooms (or at least fix the carpet), and each time we ask for an update on our request, we either don’t get a response, or they say our request was cancelled (or nonexistent). To avoid the hassle, I’d just go somewhere more professional.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "107654604365398146345", "name": "Clancy Carlisle", "time": 1474318404108, "rating": 5.0, "text": "Great place to live! I've lived here for over a year and plan to continue living here until i graduate from south! The office staff is very helpful!", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "111773133132971606826", "name": "Stanley Brewer", "time": 1529725151059, "rating": 1.0, "text": "Very unhelpful daughter changed majors and transferred closer to home. They could care less about helping to get someone for the lease. Would advise to look elsewhere", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "105693368019572848485", "name": "Allison Yaron", "time": 1537826237904, "rating": 5.0, "text": "Campus Quarters is a great place to live and in a great location! It's so convenient to campus.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "112168361728907729587", "name": "FreeToFly 16", "time": 1532240246233, "rating": 1.0, "text": "If I could have given this place NO stars, I totally would have. However, I HAD to choose something. This place is a sorry excuse for “Luxury Student Living”. I had so many issues in my time here.\nSo, upon getting my keys and finally getting to go look, I went in and did my little checklist when I noticed that there were very gross yellow and green stains on the base boards behind my toilet. They came and cleaned it, no problem. (still disgusting)\nThen the AC went out in the MIDDLE of the summer. It got up to almost 85 degrees in there if I remember correctly. Took maintence almost 2-3 days to come and assist. (Only for it to happen again a few months later)\n*ATTENTION PET OWNERS* If you have a dog with ANY types of social anxiety, this is NOT the place for you. They have a “leash law” in their lease stating that all dogs must be on leashes at all times. BUT 99% of the people that live there DO NOT follow this rule. Their dogs run away from them and don’t listen when their owner calls. I had my dog ATTACKED right in front of my apartment one day from someone not having their dog on a leash. Management did nothing but send out a small email about it.. and getting your $250 back from your deposit takes up to 4-5 months to come to you.\nNow, I need to get this out there so you guys can see what kind of people they hire. One day, I heard BANGING on my door.  It took me all but about 3 seconds to get there before they were already unlocking my door and coming in. I get to the door, and my dog is doing what he does best and investigating the people coming in his home. He comes up with a toy in his mouth and sniffs their feet, very friendly,wagging his tail. THEN the guy that was with a girl to do the inspection, puts his hand on my dog’s chest and SHOVES him back(20 lbs dog) and tells me to “watch my dog...” From there, this man straight up went in my room, opened all of my drawers to my chest of drawers, all of my cabinets in my bathroom, snooped in my closet, and did the same exact thing to my roommate’s room as well and left EVERY light on and EVERYthing open. NOT TO MENTION they are supposed to email you a notice about inspections. I did NOT get one for that day or hardly any others.\nThem being able to come in if someone doesn’t answer the door is just a huge invasion of privacy in my opinion. Imagine getting out of the shower or being IN the shower and not being able to hear your door being knocked on and someone comes in your apartment.. a stranger at that.\nTowing has a $250 fine PLUS its like a 30-45 minute drive to the super sketchy, very obviously cheap towing company where the staff is insanely rude.\nOVERAGES. Always, always about 20-30 dollars in overages every single month. No matter if you weren’t there for all of a month (like December for example… Christmas time)\nSo, I moved out at the beginning of March in a rush to leave that place for multiple reasons. I get a call (in July) from management saying that there is a HUGE mold issue in my apartment due to “excessive moisture”. I cleaned my apartment from head to toe before I left. Down to vacuuming, sweeping and mopping. And left it just how I found it, except probably better. I received pictures, and the mold is EVERY where… ceiling, baseboards, couch, chair, walls.. you name it. And they are blaming ME for it. It is all due to the AC closet in my bedroom that has an oddly direct flow from outdoor air. I even mentioned that I had turned my air off to someone at the front desk before I left and was told, and I quote, “Oh that’s perfectly fine! No problem!” Now, If I hadn’t had the overage problem the whole time, I would have left it on anyways. But I just do not see the point in paying overages for not living there in the first place.\nPLEASE read these comments, guys. They WILL rob you of your money... DO NOT DO IT. Paying this much (about 1400 for a small two bedroom apartment w/ overages) with this much of a hassle just to be so close to South is NOT worth it. Clock an extra 10-15 minute drive and live somewhere much better and worth your time and money.", "pics": null, "resp": {"time": 1532302173113, "text": "Hi FreetoFly16 - Thank you for your review and feedback. We want to ensure that we address all of your concerns in person with our onsite managemnt team and our corporate management. Please reach out to the main office to schedule a meeting, or please complete a entry at www.residentconcerns.com. We appreciate your feedback and look forward to discussing with you soon. Sincerely, WE Communities"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "101110313042651765582", "name": "Devon Franzel", "time": 1474828282759, "rating": 5.0, "text": "I have lived at Campus Quarters for two years now and every time I have had a problem it has been fixed in a very quick manner. The office staff has always been extremely helpful as well whenever there is a problem. I would recommend Campus Quarters to anyone looking for off-campus housing.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "101635621796049269177", "name": "Susan Sumrall", "time": 1540264965081, "rating": 1.0, "text": "Where do I begin??? It asks us to rate it with a star, and I cannot figure out why there aren't any stars on the negative side of zero.  My daughter moved in there for college 2 years ago this past August and at first all seemed fine, but as time went by my thoughts on that changed.  My daughter was charged overages every single month and there was never an understanding as to why.  Maintenance would pop in whenever they wanted without any kind of a notice and I do mean POP in.  We got something for her door so she couldn't be surprised unannounced again.  She decided to move out towards the beginning of the year.  She was paid up in rent, so as soon as she found her a better place she moved all of her belongings out and cleaned the apartment from top to bottom.  The apartment was 100% clean and ready  for a new tenant.  My daughter turned the air off when she left because that's what one does when no one will be living there.  Fast forward maybe 2-3 months..........She gets a lengthy letter from them demanding $7,000 in damages because of mold!  Her little apartment had mold from ceiling to floor, all on the walls, in the cabinets, in the toilet, all over the furniture, everywhere!   Any and everywhere was covered in mold.  It was unbelievable!  Her ex-roommate sent her pictures and I'm here to tell you it was disgusting,  but it was not my daughter's wrong doing or fault that caused this.  I am not one to bad mouth anyone, but if the shoe fits, you wear it!!  My question is what is wrong with a buildings structure or inner walls to make a room become so overwhelmingly engulfed in mold in such a short period of time?  What has been behind these walls all this time?  Is this why my daughter's nose stayed stopped up?  Is this why she was always sneezing?  Lots of questions are coming to mind.  I could understand if my daughter was being negligent or irresponsible, but that simply is not the case here.  They are now holding us responsible for their problem.  Do NOT let your child live here.  It is NOT what it seems.  The people who consider themselves to be \"in charge\" take advantage of our children because they know that most children straight out of high school are easily mis-lead and easy to screw over.  They figured wrong when speaking about my daughter.  So many kids live here and the bills are paid without question from \"mama and daddy's\" bank account, and most parents don't even think or ask to see a bill probably.  I wonder how much money they make in one month alone in overages??  Imagine how much in a year.  It's ridiculous!  Do yourself and your child a favor and look elsewhere.  Oh!!! and don't be fooled by the good reviews from the tenants.  That's the new ones who were promised a little gift card for writing a good review.\nSusan Sumrall", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "111322709621123682390", "name": "Gabriella Vegliacich", "time": 1474318107161, "rating": 4.0, "text": "My experience at Campus Quarters has been great so far. This is my first year living here as a junior and it's the best apartment complex I've lived in so far since I started at USA. Besides one hiccup with a broken item in my room, they are very patient and ready to get things done.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "116611785681752969689", "name": "William Harris", "time": 1494858354204, "rating": 5.0, "text": "apartments are super nice. love the pool and fire pit. staff is awesome.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "110393324498502062688", "name": "Kyle Ford", "time": 1521238770393, "rating": 5.0, "text": "lived here for all 4 years of school and never had any issues. Would recommend CQ to anyone", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "104413547772928472742", "name": "Shafi Qureshi", "time": 1522975067556, "rating": 1.0, "text": "Extremely inadequate management. The manager has ignored and consistently lied to her tenants about excessive fees that seem to come out of nowhere. She has given false information on leasing and continues to profit off of her tenant’s inability to pay on time, resulting in late fees which always fluctuate. Her (K) position should thoroughly  be reconsidered for the sake of future residents. Saddened by her greed and lack of professionalism. Will not recommend, even As a last resort.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "112479780356745515272", "name": "Heather Mead", "time": 1534822820920, "rating": 1.0, "text": "I am writing a review as a parent. This apartment complex take advantage of the students. My daughter signed a lease and wasn’t allowed to see the room and was charged from begging of month tell the 18th (not prorated) when only allowed to move in on 18th at 11 am , promised a clean room but the apartment was filthy and stained. I am the grantor for her filthy over priced one room and it makes me sad they present as well as still take advantage of he students inexperiance.", "pics": null, "resp": {"time": 1534905597004, "text": "Hi, Heather - thank you for your review. We apologize we did not meet your expectations, but would be happy to walk you through the lease agreement and explain every aspect to you and your daughter. We will have our general manager reach out to you tomorrow, as well as our senior corproate management team. Thank you, and have a wonderful day."}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "108436285998573978544", "name": "Celine Decatrel", "time": 1532392371510, "rating": 1.0, "text": "If you want maintenance to barge into your apartment 5 days before move out and have them take all of your roommates things without her knowing, signing anything about moving out early, or turning in her keys... go ahead and move in. I’ve been here for 3 years and there’s been a lot of little things like random matienece enterance without notification, loud neighbors, people smoking weed, and people having screaming fights. Don’t even bother calling the curtesy officer because they can never get a hold of them. I would never recommend someone to live here. Just get a real apartment instead.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "107618649493546799562", "name": "EJ Turner", "time": 1499198109074, "rating": 1.0, "text": "Would not recommend. Front office is generally unhelpful in almost all cases you call them about. It is hit or miss if you will get someone out to fix things that need to be fixed in a timely manner. My cable and internet was down for about a week and a half before anything was done. The biggest thing though is the fact that they will scam you out of \"overage\" charges. Within the first week I moved in they tacked on an overage charge and I had not even been there long enough to even get one. We did not change anything differently when it came to using power and did not have one for the next couple months then all of a sudden we are hit with overage charges of 30 dollars the next six or seven months in a row. The people giving it good reviews either had not lived there that long yet or work there. Save yourself the hassle and either find another apartment complex, live on campus, or find a cheap house to rent out with friends.", "pics": null, "resp": {"time": 1499271301074, "text": "EJ: Good afternoon, and thank you for your review. We apologize that we did not meet your expectations of being part of our community, and understand your frustrations. We will be reaching out to you today to discuss your billing concerns, your account, and see how we can be of assistance. Thank you again for your review. ~ Your Campus Quarters Team"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "109584993309427777171", "name": "Laquesha White", "time": 1537808580407, "rating": 5.0, "text": "I really love Campus Quarters especially move in day. Everything was so smooth, the process was quick and the staff was very helpful.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "102905649194781794509", "name": "Mason P", "time": 1506539359217, "rating": 5.0, "text": "Great amenities, staff is really helpful. fun place to live", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "114017483826769956797", "name": "Stacy Dukes", "time": 1471968589684, "rating": 1.0, "text": "DO NOT MOVE TO THIS COMPLEX!!! THEY HAVE MAJOR ISSUES AND WILL NOT RESOLVE THEM.. MY DAUGHTERS MOVED IN ALMOST 2 WEEKS AGO STILL NO CABLE,, (WHICH IS INCLUDED IN THE RENT)... THE CEILING FANS DO NOT WORK, AND MANAGEMENT IS NOT IN A RUSH TO DO ANYTHING ABOUT IT.. YOU CAN LEAVE A MESSAGE BUT GOOD LUCK IN GETTING SOMEONE TO RETURN YOUR CALL .. DON'T BE FOOLED. THIS IS NOT AN ELITE PROPERTY...  THE PICTURES MAY LOOK NICE BUT YOUR EXPERIENCE WILL BE HORRIBLE, GARBAGE... A MISTAKE.. --THIS IS THE PLACE IF YOU WANT HEADACHES, AFTER HEADACHES!!!!!", "pics": null, "resp": {"time": 1473182720102, "text": "Stacy, Thank you for expressing your concerns. We strive to provide an excellent experience for all of our residents at Campus Quarters, and your feedback is vital to our focus on achieving these goals.  Please call our offices at (251) 202-5204 to discuss your account. Thank you, and have a wonderful day! ~ Your Campus Quarters Team"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "108121298567264581511", "name": "Carson Davidenko", "time": 1475533664738, "rating": 5.0, "text": "Campus Quarters is a wonderful place to live! Great amenities and very friendly staff always available to meet your needs!", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "102694275254653197651", "name": "Bailey Duos", "time": 1492467848635, "rating": 1.0, "text": "Campus Quarters is nothing but a greedy money pit. Sure, the apartments are okay and the staff are SOMETIMES okay, but they only want your money. That's it. And they will take every penny of it with no problem. I suggest going somewhere else if possible and not getting roped into a place like this. There's plenty of nice apartments that care about their residents and don't drive them out by nickeling and diming everything they do. Also, the employees are the only ones who rate this place 5 starts because they're required to. Don't fall for it.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "102180711350466564551", "name": "Brandy Abbott", "time": 1537807958189, "rating": 4.0, "text": "Great place for students. Lots of give aways", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "105457183094390110278", "name": "Jason Borcz", "time": 1474822806804, "rating": 5.0, "text": "I love living at Campus Quarters, I was a transfer from Trinity University in San Antonio, Texas to South to be closer to my family and I had heard great things about Campus Quarters, it is the best off-campus student housing complex around!", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "115122992184957283120", "name": "Joseph Turek", "time": 1475077264090, "rating": 5.0, "text": "I have lived here for 3 years since I moved off of campus and the office staff is great and I love my roommates", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "108855576263286308605", "name": "wes riley", "time": 1539645866635, "rating": 5.0, "text": "Campus quarters is a great place to live with very friendly people", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "101047466297717370864", "name": "Emma B", "time": 1520696550118, "rating": 3.0, "text": "Sago palms everywhere!!!!!! They poison dogs!!! When I first moved in some girl told me to be careful of my dog around those palm bushes bc she heard they’re harmful. I didn’t really think anything of it and I didn’t know what they were called so I couldn’t google it. I figured it was like chocolate, like don’t feed it to your dog but a little but won’t really hurt them. Wrong. 7 months after living here my dog started having seizures one night and had to go to the ER Vet. She almost died. Had to stay over night. The vet bill was tremendous of course. It was bc she ingested like barely any of the sago palm root. Since then I’ve heard of other ppl who’ve had a similar experience. Someone’s dog died. You’d think they wouldn’t have a plant so toxic to dogs on both sides of every sidewalk at an otherwise very pet friendly apartment complex. Other than that idiocy, it’s a decent place to live.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "108692446483248110947", "name": "Ryan W", "time": 1598741388086, "rating": 1.0, "text": "Terrible place to live", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "115144996161753445296", "name": "Jessica Comeaux", "time": 1466895167788, "rating": 2.0, "text": "Most of the other five star reviews you see are clearly from either people who work at CQ or people who haven't lived at CQ for long. Giving two stars instead of one because the proximity to campus is a HUGE plus. Overall, management changes every couple of months and is generally unhelpful. This place is ultimately a money pit.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "112780750980842698241", "name": "Martin Harden", "time": 1510628399194, "rating": 1.0, "text": "WARNING THEY TOWE VISTORS WITHEN 30 MINS AND THE TOWING COMPANY IS 40 MINUTES AWAY WITH A $250 FINE PLUS GAS OF THE TOW TRUCK", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "111824548673523179545", "name": "Rebekah Johnson", "time": 1474299624916, "rating": 1.0, "text": "If you’re forced to live in the Edge, the Grove or Campus Quarters, Campus Quarters is the ideal one; however I would never choose to live here again. Management doesn’t care about your problems, the free printing is a lie because it never is working, internet is always in and out, apartments are not clean before you move in and its just overall way too expensive for the crap you get. I wish I had chosen to stay elsewhere and I will not recommend it to anyone else. We shouldn’t be paying $2,000+ a month for the service we receive and none of the extras we were promised.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "101831482864363193593", "name": "Colby Dannelley", "time": 1475510905524, "rating": 5.0, "text": "Staff very friendly, and club house and pool is a great place to hang.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "117783642155679234544", "name": "William Cebula", "time": 1474472061893, "rating": 5.0, "text": "We were very pleased. Very clean complex. Management very responsive to our needs.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "117399000367720597274", "name": "Imen Saunders", "time": 1539644569221, "rating": 5.0, "text": "Clean atmosphere & sweet staff ❤️", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "101098472132057978605", "name": "Danuelle T", "time": 1432685181485, "rating": 1.0, "text": "I wouldn't recommend anyone staying here or thinking about moving in. This is no bashing this is HONESTY and real life experiences at Campus Quarters. They don't have a good staff at the front desk and they do not work with you under no circumstances when it comes to roommate issues and problems at your apartment. There has been a time where they lost my money order and told me to re-issue out another money order for their mistake and then didn't apologize or updated me on if they found it or not. They will say they will work with you and then renege on what they have said. I even spoke with the Headquarters that was over the entire complex and she hasn't complied or come to agreements with me on anything and there has been plenty of other students who were not satisfied with this complex and has left or is in the process of trying to leave. They are not elevated student living because anyone thats not a student can live here which going against they title of being a \"elevated student living\". If you dont believe anything I am posting stay there and find out for yourself but i highly suggest you save your kids the trouble and save your money and live anywhere but here. if you would like more information on the things ive been through just send me a message.Also I am currently in the process of leaving, couldn't find anyone that wanted to live in this chaotic and unprofessional place. Another thing they will sweet talk you into living here and then the rudeness and bullshit come along.\n\nSincerely,\nAn upset resident", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "112037121688735829526", "name": "Triston Davis", "time": 1539645031831, "rating": 5.0, "text": "I’ve been staying in Canpus Quarters for the past couple years and by far the best student living apartments in mobile AL", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "109136839246180747413", "name": "Taylor Keel", "time": 1537826536056, "rating": 5.0, "text": "Campus Quarters is very helpful and always fixes any problems i have, big fan of this apartment complex", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "113835648801090904007", "name": "Sam Cochran", "time": 1469630399683, "rating": 1.0, "text": "The only reason I left a positive review a while ago was to get points for this \"Community Rewards\" program that CQ had. Honestly I'm not sure why they got rid of it because it was probably the only good publicity they would get.\nThis review is kind of long, if you don't read the stories, at least read the last two paragraphs.\n\nWithin the first two months of living here, I realized that this place was awful. If I had this semester to do over again, I would definitely have opted for the hour commute each day. Seriously, even on-campus living would be better than here.\n\nIt feels like they could care less about your satisfaction once they have you locked in to a lease. There was a time a few months ago where I went 3-4 days without internet. (Internet outages happen really often here) I was working on a homework assignement when it just quit working. I figured out that it wasn't my router, but a problem with comcast (who were super helpful and friendly when  I called). Comcast told me that they see the problem but were unable to do anything about it unless they had an employee tell them to reboot. So I call CQ get transferred to someone saying they were the manager and explained to her what Comcast said only to be cut off and informed that it was a Friday afternoon and the office was closed. But I still paid for utilities that month, right? Oh well, they don't care.\n\nOver Christmas break, my roommates and I were gone almost the entire month. When we left, we turned the AC and all the lights off and were still charged $20 overages a piece. How does that work?\n\nMost recently, I woke up one Sunday to my air conditioning and fan not working. So I check the thermostat to see if I can fix it, nothing. Luckily my parents were coming over to visit that day so I asked my dad to make sure I wasn't doing something wrong on the thermostat, still wouldn't work. So we call CQ (seriously it's July and it's hotter in my apartment than outside) and ask for someone to come fix the AC. That was around 3:00pm Sunday. They said they'd have someone come out to look at it that day. No one showed up until the next morning when i got back from class around 10am. I had to sleep on my couch with 3 fans blowing on me (I've been on more comfortable camping trips). Got charged a huge overage for this too.\n\nOh and my favorite part is when the maintanance guy mentioned above comes in to fix my fan. He stands on a chair in my room and tells me to flip the switch. Nothing happens. Then he spins the fan with his and a few times and tells me to call if i have any more problems. I don't think he made it to his car before it quit spinning.\n\nSeriously this place is a joke. Students reading this, you can do better. Parents, don't let your kids move somewhere they'll have this many problems with.\n\nP.s. They go in your room whenever they please. Granted, they knock first, but I have heard them knock and go into my empty roommates' rooms before. Honestly, this makes me uncomfortable.  And this part might be too much information, but one day coming home from class I see one of the maintenance workers going door to door and it looks like he had just come out of my apartment. Myself or my roommates haven't been there all day, but when I go in, there was an unbearable smell. He had used my bathroom.\n\nI'm sure not many people will take time to read this, but if I could tell you one thing it would be - when you come to visit try to come in and walk around the complex and ask people you see walking around their honest opinions and if they would recommend living here. I'd be willing to bet that there's more negative than positive answers.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "109951840227618508997", "name": "Kathryn Hicks", "time": 1406590744905, "rating": 1.0, "text": "Campus Quarters Apartments is a joke of an apartment complex. If you've considered living here, choose somewhere else immediately! I am still paying to live there and have my keys. Not only did maintence throw away all of my clothing hangers (not an exspensive belonging but still), they also have thrown away/stolen ALL of my necklaces I had hanging in my LOCKED room. I'm not due to turn in my keys for four days, yet they still claim to have access to throw any \"nonvalubale\" belongings away if the apartment \"looks vacant\". They have offered no refund and have been zero help as I am now without approx. $300 worth of jewelry. Please share this and let others know that is a poor example of a complex. So happy to say I WILL NOT be returning here this fall.", "pics": null, "resp": {"time": 1415734461755, "text": "Kathryn – Campus Quarters sincerely apologizes for the breakdown in communication during the difficult time of move-out/turn/move-in. Upon the unit inspection by our maintenance team, your unit appeared abandoned, and although the official lease expiration had not transpired our staff treated the unit as if it had been abandoned, and followed protocol as listed in your original lease agreement, sections 2.19 and 2.21. We appreciate your feedback and can assure you we have taken the appropriate measures to ensure this does not happen to another tenant in the future.\n\nSincerely,\n\nCampus Quarters"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "106737750721533264686", "name": "Oscar Mcmillian", "time": 1539643707632, "rating": 5.0, "text": "Awesome place to stay with great prices", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "116364411486078529901", "name": "Tyler Smith", "time": 1539645849981, "rating": 5.0, "text": "Great place and great people.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "116705224355882798901", "name": "Deshown Moultrie", "time": 1539646271015, "rating": 5.0, "text": "Campus quarters is by far the best student living available to south students.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "108410071621709264211", "name": "Christin Cole", "time": 1537829064742, "rating": 5.0, "text": "Great place & friendly staff!", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "109460666508290332568", "name": "Kayla Rodgers", "time": 1539645228645, "rating": 5.0, "text": "Great atmosphere and amazing people!!", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "117487123083958005433", "name": "Tonnie Burton", "time": 1545950521370, "rating": 5.0, "text": "Great place to live!", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "102505512961400581607", "name": "J Hink", "time": 1560203170892, "rating": 1.0, "text": "DO NOT RENT HERE!  THEY TELL THE KIDS TO \"JUST SIGN THEIR PARENTS NAMES\"!  This place should be seriously looked into for fraudulent behavior and taking advantage of young college students. BEWARE BEWARE BEWARE", "pics": null, "resp": {"time": 1560740331476, "text": "Hi, J Hink - Thank you for your review. We take your comment very seriously, and would be happy to discuss your daughter's lease with you. Please contact our corporate office by providing your contact information at www.residentconcerns.com . We look forward to discussing your concerns and helping provide further information. Thank you. - Your Campus Quarters Team"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "116163083030899798761", "name": "Tim neal", "time": 1517866315794, "rating": 1.0, "text": "Paid off bill which was around $3500 a year and half ago but recently received a bill for$6.53. Was told if not paid will be sent to collections. Only excuse I got was old management didn't catch it. I wouldn't recommend this place for anyone extremely over priced and people are very incompetent", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "110456805855578446631", "name": "Too Scotty", "time": 1539644716031, "rating": 5.0, "text": "Affordable and awesome!!", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "114862110604371816846", "name": "Robert Bourque", "time": 1537829071472, "rating": 5.0, "text": "Great staff, nice amenities", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "111378105250565487870", "name": "Andrew Bonnett", "time": 1537810594592, "rating": 5.0, "text": "Great place", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "104380390086098907305", "name": "Kiriah Brown", "time": 1473181825015, "rating": 2.0, "text": "My apartment was nice but far as management it's very unorganized, the managers change every couple months, they also don't keep their word, I discussed getting some late fees waived and she said it would be done but now since the manager I spoke with IS NOT THERE anymore they told me I have to call this and that place when I shouldnt have to go through all that....", "pics": null, "resp": {"time": 1473182671978, "text": "Hi Shakiriah, Thank you for expressing your concerns. The account you need assistance with was with the former owner and management company of Campus Quarters - in 2014. We encourage you to reach out to them to assist with this issue.  Thank you, and have a wonderful day! ~ Your Campus Quarters Team"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "113175451451106514585", "name": "Caleb Hoskins", "time": 1533155197654, "rating": 5.0, "text": "Staff very nice", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "107879324443692280701", "name": "Austin Cross", "time": 1471841985745, "rating": 1.0, "text": "I'd rather sleep on the corner of Dauphin street than move back into this place.", "pics": null, "resp": {"time": 1473182818753, "text": "Austin, We don't want you sleeping on the corner of Dauphin street, and we thank you for expressing your concerns. We strive to provide an excellent experience for all of our residents at Campus Quarters, and your feedback is vital to our focus on achieving these goals.  Please call our offices at (251) 202-5204 to discuss your account. Thank you, and have a wonderful day! ~ Your Campus Quarters Team"}, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "118165592204322255538", "name": "jonathan diamond", "time": 1446598671104, "rating": 4.0, "text": "Great place to live!", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
{"user_id": "103487978218727128526", "name": "Justin Raya", "time": 1462551996826, "rating": 4.0, "text": "This apartment complex is one  of, if not the, best place for a college student to get an apartment. It is in close proximity to the University of South Alabama and the staff keep in mind that at least most of the tenants are students.", "pics": null, "resp": null, "gmap_id": "0x889a4fd707dddb79:0x2e7adfd03c4f33a1"}
