{"user_id": "105251517287011965464", "name": "stephanie vines", "time": 1553694158771, "rating": 1.0, "text": "My second visit in two weeks and same rude service. If you are talking with a customer you should never interrupt them to ring up another customer. The items are amazing but I refuse to go to a place where I can’t even finish my order because a “VIP” person walked in. It would be different if it were just a quick hand off and he pre-payed but not the case. I am stopped mid sentence and then have to wait for him to pay and then order something else. As though making items don’t already take 10-15 minutes. That makes my visit even longer as well as ruins my mood for the start of my morning. I’d rather go to a competitor across town. And I used to come few months ago and it was always great, quick service. Definitely not the same.", "pics": null, "resp": {"time": 1554987543926, "text": "Thank you for the compliment. Our items are amazing!! Sorry about your experience. Cheers!"}, "gmap_id": "0x88626897292a5ff9:0xc0e1bd695f63dc9f"}
{"user_id": "113751217716042841720", "name": "Cori Sabir", "time": 1456679977800, "rating": 5.0, "text": "The juice at the Juicery is awesome and fresh. They have such a unique approach to juicing and providing the freshest juice possible with the most nutrients. My husband and I have tasted several of their varieties with Just Beat it, Jalopeno Juice and The green Juice as our favorites. Every time I drink their juice I know that I'm getting an awesome surge of nutrients to my body. I feel great and can't wait to get my next juice fix. Only wish I lived closure and could go every day. Shout out to a great company with knowledgeable and reliable owners.", "pics": null, "resp": null, "gmap_id": "0x88626897292a5ff9:0xc0e1bd695f63dc9f"}
{"user_id": "111718594347750736837", "name": "Preston Taylor", "time": 1482339867341, "rating": 5.0, "text": "This place is amazing. Their juice is so good and authentic without all those bad preservatives. I highly recommend this place! Plus if you save your jars you'll gey 50 cents off your next purchase. Just an amazing place.", "pics": null, "resp": null, "gmap_id": "0x88626897292a5ff9:0xc0e1bd695f63dc9f"}
{"user_id": "114922928958068648729", "name": "Mad Piper", "time": 1567595781638, "rating": 3.0, "text": "The juice really is great, but one trip here runs my family as much as it does to eat at Outback or Sakura Japanese Steakhouse!  I know the value of juicing but the thing getting juiced the most is my wallet.\n\nSeptember 2019:. Banner it front says the store is closing.", "pics": null, "resp": {"time": 1554987758541, "text": "Things are about to get much more affordable for everyone! Stay tuned... Big announcements coming out regarding how we are going to make juice more affordable for all!"}, "gmap_id": "0x88626897292a5ff9:0xc0e1bd695f63dc9f"}
{"user_id": "105555639279395506628", "name": "Ethan Zibas", "time": 1562315399333, "rating": 5.0, "text": "Fresh juice from a family owned company. The juice, and smoothies, are refreshing, nutritious, and taste delicious. What's not to love?", "pics": null, "resp": {"time": 1562333799787, "text": "We love you!!"}, "gmap_id": "0x88626897292a5ff9:0xc0e1bd695f63dc9f"}
{"user_id": "109559093331051390827", "name": "Daniela Ferreira", "time": 1560882278373, "rating": 5.0, "text": "They are serious about making you feel better through food here. Friendly and delicious!", "pics": null, "resp": null, "gmap_id": "0x88626897292a5ff9:0xc0e1bd695f63dc9f"}
{"user_id": "105085031343969219271", "name": "Jacob Birmingham", "time": 1442633995432, "rating": 5.0, "text": "The Juicery is a lifestyle change for me.  I love the location. I love the owners. I love the product. If you know me.  You will know why I love this so much!  The Juicery Press will change lives for the better.  I promise.", "pics": null, "resp": null, "gmap_id": "0x88626897292a5ff9:0xc0e1bd695f63dc9f"}
{"user_id": "116279149871830266578", "name": "Matthew Henry", "time": 1562600165566, "rating": 5.0, "text": "This is the only place I can still find plain, fresh carrot juice.", "pics": null, "resp": null, "gmap_id": "0x88626897292a5ff9:0xc0e1bd695f63dc9f"}
{"user_id": "100110599127498898063", "name": "Theodis Barnes III", "time": 1542292424618, "rating": 5.0, "text": "Nice staff, nice setting space, a bit pricey but you get what you pay for.", "pics": null, "resp": null, "gmap_id": "0x88626897292a5ff9:0xc0e1bd695f63dc9f"}
{"user_id": "110055573676873706607", "name": "Ariel Marie", "time": 1535565199860, "rating": 5.0, "text": "Love it!! The flu fighter is AMAZING! Not for the faint of heart but very wonderful ♥️♥️♥️", "pics": null, "resp": null, "gmap_id": "0x88626897292a5ff9:0xc0e1bd695f63dc9f"}
{"user_id": "110399840140781564209", "name": "Roger Hill", "time": 1568810040216, "rating": 1.0, "text": "Please show that your brick and mortar retail location is closed so u don't waste people's time driving out to your store.", "pics": null, "resp": null, "gmap_id": "0x88626897292a5ff9:0xc0e1bd695f63dc9f"}
{"user_id": "116900145388717902738", "name": "Travis McDermott", "time": 1477533644903, "rating": 5.0, "text": "You have to try these two juices. My professional opinion for digestive health would be \"Daily Greens.\" My favorite juice is \"Pucker Up.\" Great family owned business with a fantastic product!! Yum!!", "pics": null, "resp": null, "gmap_id": "0x88626897292a5ff9:0xc0e1bd695f63dc9f"}
{"user_id": "101840637808182144595", "name": "John Palmer", "time": 1486009082915, "rating": 5.0, "text": "The juice and the smoothies are only part of this amazing place. The owners are incredibly knowledgeable and passionate about  everything will be put out in their Juicery.", "pics": null, "resp": null, "gmap_id": "0x88626897292a5ff9:0xc0e1bd695f63dc9f"}
{"user_id": "111711603103421440583", "name": "Joe JM", "time": 1533769148737, "rating": 5.0, "text": "Great place! Got to try multiple drinks before picking, great staff, and great drink options!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP5MrBTKBYymGR3kG6Eeom_nuYNbCNSg9LKtUnk=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOejXuzAOE5WcmU8UuEspueQZLvkY7C6ZJJdOcr=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626897292a5ff9:0xc0e1bd695f63dc9f"}
{"user_id": "103110926418258867861", "name": "Robert Crouch", "time": 1457739037235, "rating": 5.0, "text": "Amazing juice and friendly service. They will let you try samples so you're not gambling on whether or not you'll like a drink, total added bonus.", "pics": null, "resp": null, "gmap_id": "0x88626897292a5ff9:0xc0e1bd695f63dc9f"}
{"user_id": "117718117152005480868", "name": "Claire D", "time": 1458452692861, "rating": 5.0, "text": "Fantastic place! Love it! I recommend the Hunnicutt juice and the Triple Chocolate smoothie. Soooo good!", "pics": null, "resp": {"time": 1459356629140, "text": "Thank you so much for the review and we are so happy you loved it.  Can't wait to see you again."}, "gmap_id": "0x88626897292a5ff9:0xc0e1bd695f63dc9f"}
{"user_id": "108167685856085185467", "name": "Ashley Terral", "time": 1471277916922, "rating": 5.0, "text": "I just can't say enough positive things about this place, from the extremely helpful staff, to the\ncleaniliness of the establishment, the awesome owners, and don't forget the best juice\nEVER!\n\nI used The Juicery as my main source of nutrition for a 25 day fast. I was desparately needing\nhealing on a cellular level in my gut. I ordered the juice every 3 days and I received my order\nevery time with little to no hiccups. The owners even left for vacation and were communicating\nwith me from paradise when I had questions.\n\nNot to mention, juicing from home 4-5 times a day is so laborious and time consuming...\n\nThis is the fourth time I've done a juice fast for this long, but the first one I've done outside\nof my home. This time was different. There was hardly any hunger, no crankiness or headaches.\nI was able to sleep at night and I had amazing energy. Through this fast, I did lose 20 lbs in 20\ndays but that certainly was not the reason for doing it. The doctor wanted to put me on 20 days\nof antibiotics. So, was this expensive? It wasn't cheap but it was an investment for my health\nand much better for my body than taking so many antibiotics. I did see the doctor halfway through\nand they were very impressed with the outcome and my vitals.\n\nI even called them on the day I started back to solid foods because my  yoga teacher training graduating\nclass was celebrating at the Mexican restaurant. The Juicery made sure I had something raw and vegan and\nhealthy to take with me so I could be included in the celebration.\n\nI've been off the fast for about ten days. I crave the juice like I wouldn't have ever imagined. Since\nI came off, I've decided to be vegan and gluten free for a while and it's working wonderfully for me!\n\nI truly believe that the fresh Almond Milk from The Juicery and the Cold Pressed juice changed my\nlife! I look forward to working with them in the future to help fulfill my juicing needs! Everyone who\nworks there is so helpful. I love the owners, the vision, and the concept. Thank you so much for\nhelping me to change my life, live a healthier lifestyle, and do it with ease!", "pics": null, "resp": null, "gmap_id": "0x88626897292a5ff9:0xc0e1bd695f63dc9f"}
{"user_id": "116609830433420825307", "name": "Amber Clem", "time": 1492268416555, "rating": 5.0, "text": "Love the staff but it can be a little pricey. I really love the wellness shots.", "pics": null, "resp": null, "gmap_id": "0x88626897292a5ff9:0xc0e1bd695f63dc9f"}
{"user_id": "115058479321894522256", "name": "Caleb Knapp", "time": 1451499034219, "rating": 5.0, "text": "I LOVE IT!!!!!  Usually I get a ginger shot, but the pucker up is amazing too!", "pics": null, "resp": null, "gmap_id": "0x88626897292a5ff9:0xc0e1bd695f63dc9f"}
{"user_id": "115006724077338573732", "name": "Alyx Wright", "time": 1563815440679, "rating": 5.0, "text": "Sweet lady up front helped me to try out the Juice. Wish they have one in Birmingham 😇", "pics": null, "resp": null, "gmap_id": "0x88626897292a5ff9:0xc0e1bd695f63dc9f"}
{"user_id": "116609830433420825307", "name": "Amber Clem", "time": 1492268416555, "rating": 5.0, "text": "Love the staff but it can be a little pricey. I really love the wellness shots.", "pics": null, "resp": null, "gmap_id": "0x88626897292a5ff9:0xc0e1bd695f63dc9f"}
{"user_id": "116034362250449934226", "name": "sharpenedge", "time": 1466046900385, "rating": 5.0, "text": "LOVE this stuff. It's pricey, but it's worth it. Quality drinks.", "pics": null, "resp": null, "gmap_id": "0x88626897292a5ff9:0xc0e1bd695f63dc9f"}
{"user_id": "100110599127498898063", "name": "Theodis Barnes III", "time": 1542292424618, "rating": 5.0, "text": "Nice staff, nice setting space, a bit pricey but you get what you pay for.", "pics": null, "resp": null, "gmap_id": "0x88626897292a5ff9:0xc0e1bd695f63dc9f"}
{"user_id": "116279149871830266578", "name": "Matthew Henry", "time": 1562600165566, "rating": 5.0, "text": "This is the only place I can still find plain, fresh carrot juice.", "pics": null, "resp": null, "gmap_id": "0x88626897292a5ff9:0xc0e1bd695f63dc9f"}
{"user_id": "117931367673520192662", "name": "Alicia Tanner", "time": 1489627718508, "rating": 5.0, "text": "Love the green sweetie!!!!", "pics": null, "resp": null, "gmap_id": "0x88626897292a5ff9:0xc0e1bd695f63dc9f"}
{"user_id": "112172557704781369882", "name": "Debra Parker", "time": 1566275618709, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x88626897292a5ff9:0xc0e1bd695f63dc9f"}
{"user_id": "100693457756578565392", "name": "Benjamin Wireman", "time": 1496371962539, "rating": 5.0, "text": "Awesome!!", "pics": null, "resp": null, "gmap_id": "0x88626897292a5ff9:0xc0e1bd695f63dc9f"}
{"user_id": "107049101192308870253", "name": "kathleen dubey Davis", "time": 1548289171566, "rating": 5.0, "text": "I tried there lasagna today and it was amazing! Definite go to place for catering or even family dinners you can pick up and bring home! Excited to try the other casseroles and choices in the future!", "pics": null, "resp": null, "gmap_id": "0x889bb2afbea10877:0xed45de7077e2373c"}
{"user_id": "104176220061925956095", "name": "Jennifer Susman", "time": 1421078855308, "rating": 5.0, "text": "This place is insanely good.  I'm normally not one for \"lunch cafes\" but I truly enjoy coming here.  Try anything off of the Clark's Kitchen menu and you will be glad you did!  The food is delicious, the restaurant is clean, service is fabulous, internet is free- what more can I say?  Love it here.  I'll be back tomorrow...again!", "pics": null, "resp": null, "gmap_id": "0x889bb2afbea10877:0xed45de7077e2373c"}
{"user_id": "108284024313220588399", "name": "Doris Lepoma", "time": 1424462668509, "rating": 5.0, "text": "I had Seafood Gumbo, It was just perfect,,,Almost like the Gumbo my husband and my mother-in law makes. It was a welcome treat foe  both me and my son. Also  perfect day to have our lunch outside/sidewalk. The pansies are beautiful.", "pics": null, "resp": null, "gmap_id": "0x889bb2afbea10877:0xed45de7077e2373c"}
{"user_id": "107290523217874619957", "name": "Tommy Evans", "time": 1477766291251, "rating": 1.0, "text": "Walked in to a decent atmosphere, pleasant enough staff, but we waited for 40 minutes for two small orders. I got half of what was ordered, my girlfriend didn't even get hers. And we wound up getting a refund and leaving. Short staffed or no they could have warned us, we wasted an entire afternoon and got nothing for it. Don't eat here. It was just bad.", "pics": null, "resp": null, "gmap_id": "0x889bb2afbea10877:0xed45de7077e2373c"}
{"user_id": "106683245015354733027", "name": "ImUrUncleDaddy", "time": 1440694750489, "rating": 5.0, "text": "Good food, ok prices, fast service, great deserts, and even have take home meals. Take home meals are great being a college student because it's enough to feed me all week. Stop by at least once a week now.", "pics": null, "resp": null, "gmap_id": "0x889bb2afbea10877:0xed45de7077e2373c"}
{"user_id": "109755387801266009644", "name": "Destiny L", "time": 1447875075621, "rating": 1.0, "text": "I am a long time customer of Camile's, not because of the food, but because it is right next door to campus. I sometimes like to sit and grab a bite between classes. The food is bit bland, but I have never had any problems with my order. One day I did and was treated horribly for the complaint. I ordered the Camile club with no mayo. When I received my sandwich, it had mayo. So, I calmly went back up and explained that I didn't want mayo. I was told it could be fixed.\n\nWhile waiting on my sandwich, I noticed the staff watching me and speaking quietly, but I ignored it. 5 minutes later I was called back and when I went to check my sandwich again, I noticed the residue from mayo. It looked as if someone had wiped the mayo off and changed the bread. Again, calmly, I went back up (once again noticing the staff snickering) and asked to speak to the manager for a refund. Said-manager whose name I couldn't get, claimed she was there the whole time they \"remade\" my sandwich and it was fresh. I told her that couldn't be the case because it was now cold, it took her less time to make it than originally and I showed her a piece of lettuce that had mayo in it.\n\nShe then rudely asked me if I still had my receipt, which I did. I was given a refund, but I don't appreciate the way I was treated. If I'm paying for a meal, I expect it to made the way I requested it. I didn't ask them to make me a sandwich befitting God. I just didn't want mayo.  I am never stepping foot into that cafe again.", "pics": null, "resp": null, "gmap_id": "0x889bb2afbea10877:0xed45de7077e2373c"}
{"user_id": "105957700769990310121", "name": "donrico browne", "time": 1463533997486, "rating": 5.0, "text": "Love it friendly staff and the food was delicious  prices very affordable  definitely  would dine in again!!! Worth sharing", "pics": null, "resp": null, "gmap_id": "0x889bb2afbea10877:0xed45de7077e2373c"}
{"user_id": "112372424751907461464", "name": "C M", "time": 1484345260548, "rating": 5.0, "text": "Food was fast! I got a burger, which had melty cheese, great ground beef, and crisp lettuce and tomatoe. Also got a fruit cup that was fresh! My buddy got a poboy. It looked great, had normal sized shrimp for a restaurant that is not specifically seafood. Will be back. Prices a bit high, but again it's quality food, not fast food.", "pics": null, "resp": null, "gmap_id": "0x889bb2afbea10877:0xed45de7077e2373c"}
{"user_id": "107244655574647047186", "name": "Wes Allday", "time": 1488429615786, "rating": 4.0, "text": "Good food, great people, nice atmosphere for lunch.", "pics": null, "resp": null, "gmap_id": "0x889bb2afbea10877:0xed45de7077e2373c"}
{"user_id": "104542114577760152460", "name": "Captain Redbeard", "time": 1364753098670, "rating": 3.0, "text": "Food was decent but I expected more.  I ordered a turkey habanero sandwich but there was no spicy-ness at all.", "pics": null, "resp": null, "gmap_id": "0x889bb2afbea10877:0xed45de7077e2373c"}
{"user_id": "110302669749244779498", "name": "Devin Brown", "time": 1473966204559, "rating": 5.0, "text": "Awesome Food and great people! You can't beat this place.", "pics": null, "resp": null, "gmap_id": "0x889bb2afbea10877:0xed45de7077e2373c"}
{"user_id": "100372498229471492301", "name": "Phil Forrest", "time": 1482790151120, "rating": 5.0, "text": "Very delicious simple food. Lots of healthy options.", "pics": null, "resp": null, "gmap_id": "0x889bb2afbea10877:0xed45de7077e2373c"}
{"user_id": "102001682953927756321", "name": "Jaye J", "time": 1482889125456, "rating": 5.0, "text": "I had a great experience", "pics": null, "resp": null, "gmap_id": "0x889bb2afbea10877:0xed45de7077e2373c"}
{"user_id": "103701178956908291937", "name": "William Matthew Reichert", "time": 1541206491792, "rating": 5.0, "text": "Great casseroles", "pics": null, "resp": null, "gmap_id": "0x889bb2afbea10877:0xed45de7077e2373c"}
{"user_id": "105927707020492253536", "name": "Carley Pekelder", "time": 1376682621725, "rating": 3.0, "text": "No real silverware. :(", "pics": null, "resp": null, "gmap_id": "0x889bb2afbea10877:0xed45de7077e2373c"}
{"user_id": "109350367134348529292", "name": "Abraham Wilson", "time": 1624643461222, "rating": 1.0, "text": "The owner is a horrible lady! Had issues with my food, ordered a sandwich and she took it upon herself to fix it the way she wanted and when I said I didn’t want those toppings she raked them off and then gave me a nasty attitude. I asked for a refund and she would only refund me for half the cost and kept the sandwich! She has a really nasty attitude. Will not go back!", "pics": null, "resp": null, "gmap_id": "0x88929213968b8e9f:0x74dd735e10f9a6d"}
{"user_id": "105823201278785827595", "name": "Charlotte Poitras", "time": 1608438223295, "rating": 5.0, "text": "Every time I go to Subs n More I ALWAYS get fries with mayonnaise and ketchup. SO good. The employees have always done their best to get the food out as quick as possible. And I if I want a lot of condiments on my burger.... I don’t have to worry about someone getting upset at me for it 😆🙌🏻\n#loverofsubsnmore", "pics": null, "resp": null, "gmap_id": "0x88929213968b8e9f:0x74dd735e10f9a6d"}
{"user_id": "104072985243019568292", "name": "Savanna Sasser", "time": 1617308633189, "rating": 1.0, "text": "owner is a joke. treats employees like trash. food is horrible. haven’t stopped by in years. cant even get a plate of fries without them being burnt and cold. speak to the manager and get treated horribly.", "pics": null, "resp": null, "gmap_id": "0x88929213968b8e9f:0x74dd735e10f9a6d"}
{"user_id": "100256810252745876251", "name": "Tap Russ", "time": 1592157415752, "rating": 1.0, "text": "We went in to get food and after the person I was with paid for her food I noticed that the entire staff, including those fixing the food did NOT have on gloves or masks. I even noticed a female in the kitchen, around the food cleaning out her nails. I’ve been here before and the food was good but right now there’s a virus and there should be better precautions when preparing the food. I begged my sister to get a refund but she wouldn’t and just ordered from another vendor that was wearing protective gear.  Definitely not a good look.", "pics": null, "resp": null, "gmap_id": "0x88929213968b8e9f:0x74dd735e10f9a6d"}
{"user_id": "105696552832276751731", "name": "Robert Grice", "time": 1609099951496, "rating": 5.0, "text": "Very goo service. Great food", "pics": null, "resp": null, "gmap_id": "0x88929213968b8e9f:0x74dd735e10f9a6d"}
{"user_id": "108556648981854528824", "name": "Chaos Gaming741", "time": 1581525505457, "rating": 5.0, "text": "Really Great Food. I lover their Philly's and their cheese fries. I also love their Western Burger. They have great customer service and are very polite.", "pics": null, "resp": null, "gmap_id": "0x88929213968b8e9f:0x74dd735e10f9a6d"}
{"user_id": "109600724578340335055", "name": "Dezmonde Ray Sr.", "time": 1573268458121, "rating": 1.0, "text": "My wife and I stopped in for a bite to eat before our way home. This was our first time trying this establishment as we wanted something different to eat besides the usual. I can tell you this was our first and last time eating here. My wife ordered some wings that were half done. When she took them back to get a refund, she was told they don't do refunds on wings.... 🤔🤔🤔. Wait.... If the only thing u don't do refunds on are wings that must mean that you have a lot of complaints on wings. The only thing good about our visit was the teenager that took our order, he was professional unlike the manager.", "pics": null, "resp": null, "gmap_id": "0x88929213968b8e9f:0x74dd735e10f9a6d"}
{"user_id": "110502899200121201694", "name": "Subs And More", "time": 1572482894026, "rating": 5.0, "text": "I just want to clarify something. If you look at the timing of these reviews you will see that all the bad ones talking about bugs and other things are within a few minutes or hours of each other. This is because an employee who threw a temper tantrum and walked out decided to seek revenge on our business by having all of her little minions post bad reviews. Our health score speaks for itself. None of these people posting in the last day or so have ever even BEEN to our restaurant. Please ignore the childish behavior of these people.", "pics": null, "resp": null, "gmap_id": "0x88929213968b8e9f:0x74dd735e10f9a6d"}
{"user_id": "112639230028800945524", "name": "Joseph Gillespie", "time": 1573423904388, "rating": 1.0, "text": "Worst experience ever\nI've waited around for almost an hour n still didn't get my order. So I've just got my money back. There was another person waiting for fries. He even said how long does it take to cook fris. I won't suggest this place to anyone if asked. The ladies up front weren't bad.  But they were saying they are short handed today", "pics": null, "resp": null, "gmap_id": "0x88929213968b8e9f:0x74dd735e10f9a6d"}
{"user_id": "116166178515616248135", "name": "Stephanie Madavane", "time": 1572508231445, "rating": 1.0, "text": "Worst Cheese steak i ever had. I wish i could uneat it. Low quality meat. Bland. No taste. Didn't even bother to chop the meat up. This place could be better than what it is. Cheese fries are the only thing they have going", "pics": null, "resp": null, "gmap_id": "0x88929213968b8e9f:0x74dd735e10f9a6d"}
{"user_id": "108000023408211027769", "name": "Bill Burch", "time": 1566062456336, "rating": 1.0, "text": "Quite expensive for terrible food. My sub was a no go after one bite. My wife’s burger was undercooked and sloppily tossed together. DONT WASTE YOUR MONEY.", "pics": null, "resp": null, "gmap_id": "0x88929213968b8e9f:0x74dd735e10f9a6d"}
{"user_id": "114382760913663432330", "name": "Elizabeth Thomas", "time": 1593455631442, "rating": 1.0, "text": "No one was wearing a mask and they barely kept their gloves on. Also, very slow service, I wasted my 30 minute lunch waiting in line. Just for my bread and fries to be burnt. I miss the old owner. 😰", "pics": null, "resp": null, "gmap_id": "0x88929213968b8e9f:0x74dd735e10f9a6d"}
{"user_id": "110205493563872620305", "name": "Eugene Gonzales", "time": 1546792477809, "rating": 2.0, "text": "I had ordered a small order of french fries on Saturday 01/05, they were not hot and we're wimpy which maybe means they were under a heat lamp to long also the person asked for a ticket number when I was paying which I could not read I gave to the employee ask  her to figure it out. I know it's under new ownership because I've known Bernardo for a long time and had never any kind of issue.", "pics": null, "resp": null, "gmap_id": "0x88929213968b8e9f:0x74dd735e10f9a6d"}
{"user_id": "111075431615890197976", "name": "mefurd98", "time": 1572480878211, "rating": 1.0, "text": "The worst place ever. Roaches and flies everywhere and the new owners are terrible people", "pics": null, "resp": null, "gmap_id": "0x88929213968b8e9f:0x74dd735e10f9a6d"}
{"user_id": "109576053701672947940", "name": "Chris Baker", "time": 1581698557076, "rating": 3.0, "text": "Decent. Little pricey. Good food. Good location.", "pics": null, "resp": null, "gmap_id": "0x88929213968b8e9f:0x74dd735e10f9a6d"}
{"user_id": "100013859269688170710", "name": "Joseph Spears", "time": 1607293210748, "rating": 1.0, "text": "Over priced for food that is not good at all", "pics": null, "resp": null, "gmap_id": "0x88929213968b8e9f:0x74dd735e10f9a6d"}
{"user_id": "103611059745635425103", "name": "Anna Surlo", "time": 1572488857089, "rating": 1.0, "text": "Since subs and more shows lack of professionalism I will as well. I lived in dothan al all my life I have been to the mall every saturday since i was in seventh grade i ate at that place more times than i can count and I've recieved food poisoning twice I'm not a minion but if youd like I'll place a call to the better business bureau and report you for attacking people who post bad reviews online and I'll call the health department while I'm at it now if you have a problem with it feel free to contact me on facebook but good luck finding me. Hope you get shut down have a nice day🖕", "pics": null, "resp": null, "gmap_id": "0x88929213968b8e9f:0x74dd735e10f9a6d"}
{"user_id": "108987618061726970949", "name": "Coalson Lee", "time": 1572384773738, "rating": 2.0, "text": "We stopped here on our way home. I’ve never tried it until then but I can say I never will again! Atleast not this location!!\nFirst and for most the employees were arguing in front of customers when I first walked in.\nSecond, my food tastes HORRIBLE! Like the refrigeration wasn’t running very well on where they keep the meats. Third, whip I was eating the sandwich I send a FREAKING ROACH CRAWLING ON THE WALL.\nI tried to get the manager but she was “busy”, all the employee would tell me is her name was ranni ? I tried to call her after we left to inform her of our stop and hopefully get these situations explained and fixed! Never got a call back.", "pics": null, "resp": null, "gmap_id": "0x88929213968b8e9f:0x74dd735e10f9a6d"}
{"user_id": "112167453548459828564", "name": "Duncan Mills", "time": 1540673449769, "rating": 1.0, "text": "Honestly it just all around sucked.\n\nThe line/checkout was confusing, I did not know where to pay or wait for my food. My sub wasn’t made right in front of me like literally every other sub sandwich place. They got it served through the window then I got asked “what you want?” And they peel open your sandwich to add ingredients.\n\nThe food, albeit edible for a hungry shift worker, was pretty sad. All I wanted was a normal BLT sub sandwich with mayo, and some chips. Instead, I got served this weird but sad triple-decker pressed Texas toast BLT. I didn’t mind the non traditional approach, but the execution was bad. The Texas toast was smashed so thin I had this dense layer of mayonaise soaked bread to peel off my teeth. The bacon was cooked well but the lack of lettuce, tomato, and a normal sub bun kinda ruined it.\n\nAt least it was cheap, around $7.50, so at least it wasn’t an expensive mistake.", "pics": null, "resp": null, "gmap_id": "0x88929213968b8e9f:0x74dd735e10f9a6d"}
{"user_id": "100425699754378690754", "name": "Jay Myers", "time": 1529160520692, "rating": 5.0, "text": "Had lunch there last week. Very helpful staff, and food was GREAT! Prices were less that I expected too.", "pics": null, "resp": null, "gmap_id": "0x88929213968b8e9f:0x74dd735e10f9a6d"}
{"user_id": "109129584512821326712", "name": "Dawn Marsh", "time": 1572387876131, "rating": 1.0, "text": "If I could give less than one star I would. There's roaches crawling around and gnats swarming the food. 1the food is awful. Don't bother wasting your time.", "pics": null, "resp": null, "gmap_id": "0x88929213968b8e9f:0x74dd735e10f9a6d"}
{"user_id": "104338444511181887858", "name": "Joshua Scott", "time": 1590096694413, "rating": 1.0, "text": "Owners are terrible after complaining about the wrong order the owner come and harassed my wife and I at our table!", "pics": null, "resp": null, "gmap_id": "0x88929213968b8e9f:0x74dd735e10f9a6d"}
{"user_id": "101052510495275029637", "name": "Chase R", "time": 1554586187539, "rating": 1.0, "text": "Dont bother wasting your time or money. Got the philly cheese steak that was 15 dollars with a fry and drink which was pathetic for that type of money. Low quality ingredients, hardly any meat on it and a bland taste and as someone else said, luke warm soggy fries that had been sitting out for who knows how long. You would think for being a \"Sub\" shop a philly cheese steak would be a strong point but I was sadly mistaken. If you want a better meal for a better price I'd advise you taking your money anywhere else but here.", "pics": null, "resp": null, "gmap_id": "0x88929213968b8e9f:0x74dd735e10f9a6d"}
{"user_id": "112193313087732936607", "name": "Abigail Davenport", "time": 1513612630338, "rating": 1.0, "text": "I work in the mall. I go here all of the time. But today was unacceptable. Walked up to order a sweet tea at 9:28. Not until 9:36 did the blonde manager come out and tell me \"they're open, just not serving\". Online hours say they're open at 9am. I told her I only need a sweet tea, and she told me \"we're not serving\". So thank you, for wasting almost 10 minutes of my break just to then not allow me to purchase a simple sweet tea. I'll take my business to chick fil a.", "pics": null, "resp": null, "gmap_id": "0x88929213968b8e9f:0x74dd735e10f9a6d"}
{"user_id": "117657076353668571304", "name": "Matt Pollard", "time": 1516150476758, "rating": 5.0, "text": "Great food and service. Always pleased after I eat here.", "pics": null, "resp": null, "gmap_id": "0x88929213968b8e9f:0x74dd735e10f9a6d"}
{"user_id": "100349804522149474867", "name": "Austin Culp", "time": 1537826379149, "rating": 5.0, "text": "The food was the best I have ever eaten in the World", "pics": null, "resp": null, "gmap_id": "0x88929213968b8e9f:0x74dd735e10f9a6d"}
{"user_id": "111632197972721485121", "name": "Dova Clashes", "time": 1572389513324, "rating": 1.0, "text": "I saw them drop a wing on the ground, okay, BUT THEN THEY REUSED IT.", "pics": null, "resp": null, "gmap_id": "0x88929213968b8e9f:0x74dd735e10f9a6d"}
{"user_id": "105623756032002772378", "name": "Isiah Ham", "time": 1507830708372, "rating": 5.0, "text": "Excellent food couldn't ask for better", "pics": null, "resp": null, "gmap_id": "0x88929213968b8e9f:0x74dd735e10f9a6d"}
{"user_id": "112141291111343386223", "name": "the fingers", "time": 1566003157620, "rating": 3.0, "text": "Wasted about 15 minutes here, wouldn't go if your in a rush.", "pics": null, "resp": null, "gmap_id": "0x88929213968b8e9f:0x74dd735e10f9a6d"}
{"user_id": "107832907893946834844", "name": "Tyler JN", "time": 1563302556962, "rating": 5.0, "text": "Very friendly service", "pics": null, "resp": null, "gmap_id": "0x88929213968b8e9f:0x74dd735e10f9a6d"}
{"user_id": "115355944828479015546", "name": "mahmoud abudiak", "time": 1509913613883, "rating": 1.0, "text": "If there is less than on star I will rate it the worst food ever had awful and I’ve also through the food away food doesn’t fit for human consumption", "pics": null, "resp": null, "gmap_id": "0x88929213968b8e9f:0x74dd735e10f9a6d"}
{"user_id": "103771798689033290886", "name": "Abby McNeil", "time": 1572571369956, "rating": 1.0, "text": "Y’all are gross", "pics": null, "resp": null, "gmap_id": "0x88929213968b8e9f:0x74dd735e10f9a6d"}
{"user_id": "105017381453084945284", "name": "Marven Msk", "time": 1509913865229, "rating": 1.0, "text": "Very  awful food", "pics": null, "resp": null, "gmap_id": "0x88929213968b8e9f:0x74dd735e10f9a6d"}
{"user_id": "107203818827726504559", "name": "Renee McGriff", "time": 1513969472668, "rating": 1.0, "text": "Horrible service!!!", "pics": null, "resp": null, "gmap_id": "0x88929213968b8e9f:0x74dd735e10f9a6d"}
{"user_id": "114684261816161048519", "name": "Dreama Guzman", "time": 1557067258869, "rating": 5.0, "text": "Good food friendly service", "pics": null, "resp": null, "gmap_id": "0x889bad935827f92d:0xcbdaeb1328b4705b"}
{"user_id": "110999184464178404716", "name": "Bud Cook", "time": 1545272231252, "rating": 1.0, "text": "Call before you go.  The website says it’s open at specific hours each day and it is not followed.  Not even close!  We spoke to the store manager", "pics": null, "resp": null, "gmap_id": "0x889bad935827f92d:0xcbdaeb1328b4705b"}
{"user_id": "109413527040660335824", "name": "John Brent", "time": 1552309606355, "rating": 5.0, "text": "Great people good food love it", "pics": null, "resp": null, "gmap_id": "0x889bad935827f92d:0xcbdaeb1328b4705b"}
{"user_id": "105286370803620266774", "name": "Amy Johnson", "time": 1563383140740, "rating": 3.0, "text": "Great pizza", "pics": null, "resp": null, "gmap_id": "0x889bad935827f92d:0xcbdaeb1328b4705b"}
{"user_id": "115483142062213679391", "name": "Angi DVS", "time": 1513694137309, "rating": 5.0, "text": "No problems whatsoever", "pics": null, "resp": null, "gmap_id": "0x889bad935827f92d:0xcbdaeb1328b4705b"}
{"user_id": "100749967708940291766", "name": "WILL TO FLY HIGH", "time": 1510148605943, "rating": 5.0, "text": "Good breakfast foods", "pics": null, "resp": null, "gmap_id": "0x889bad935827f92d:0xcbdaeb1328b4705b"}
{"user_id": "111576995426176152519", "name": "John Brent", "time": 1559572400669, "rating": 5.0, "text": "Love it", "pics": null, "resp": null, "gmap_id": "0x889bad935827f92d:0xcbdaeb1328b4705b"}
{"user_id": "105125668907194407451", "name": "Terri Broadhead", "time": 1521159613948, "rating": 5.0, "text": "Good food", "pics": null, "resp": null, "gmap_id": "0x889bad935827f92d:0xcbdaeb1328b4705b"}
{"user_id": "107095041020780109525", "name": "Ashley Hollinger", "time": 1500917476068, "rating": 5.0, "text": "I ate at Momma's for the first time today and I amazed at how good the sandwich was. I have been looking for a new sandwich place other than Subway or JJ. I think I found my #1 choice if I want a delicious sub! Thank you Momma's!\nP.S. Their chocolate chip cookies are insanely soft and delicious.", "pics": null, "resp": null, "gmap_id": "0x888602e84ecbc0bb:0x79801a552bfce31f"}
{"user_id": "105063901556205118592", "name": "Brian Yanko", "time": 1514997911264, "rating": 5.0, "text": "Really good subs, seen reviews and had to try and was not disappointed. Will be going again once I move down", "pics": null, "resp": null, "gmap_id": "0x888602e84ecbc0bb:0x79801a552bfce31f"}
{"user_id": "105328082722826691030", "name": "Vanessa Brown", "time": 1479014294863, "rating": 5.0, "text": "Their sweet tea and momma's love can't be beat!", "pics": null, "resp": null, "gmap_id": "0x888602e84ecbc0bb:0x79801a552bfce31f"}
{"user_id": "111636673164970068186", "name": "Markus Amano", "time": 1501518987469, "rating": 5.0, "text": "Juicy french dip.", "pics": null, "resp": null, "gmap_id": "0x888602e84ecbc0bb:0x79801a552bfce31f"}
{"user_id": "109630970975707198682", "name": "Melinda Mcbride", "time": 1495676631178, "rating": 1.0, "text": "Seems like every time I try to go they are closed.", "pics": null, "resp": null, "gmap_id": "0x888602e84ecbc0bb:0x79801a552bfce31f"}
{"user_id": "107171805368125688684", "name": "Ron Duckworth", "time": 1496327660724, "rating": 5.0, "text": "Awesome sandwiches.", "pics": null, "resp": null, "gmap_id": "0x888602e84ecbc0bb:0x79801a552bfce31f"}
{"user_id": "109435356627110442232", "name": "John Martin Weed", "time": 1517086040223, "rating": 5.0, "text": "A staple of any college diet", "pics": null, "resp": null, "gmap_id": "0x888602e84ecbc0bb:0x79801a552bfce31f"}
{"user_id": "107242715372323426894", "name": "Aaron Dettling", "time": 1515785962418, "rating": 1.0, "text": "It's closed down and all the signage is gone, so...", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMQf5TMAFu9wi5wey_ZzDC4jFap9QAZGk7zM20u=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88892216e9e46763:0xf3f2b83f9325eb4a"}
{"user_id": "104145994618780669808", "name": "Myron Pinkins", "time": 1507286245589, "rating": 1.0, "text": "Just had the worst experience in a drive through", "pics": null, "resp": null, "gmap_id": "0x88892216e9e46763:0xf3f2b83f9325eb4a"}
{"user_id": "109752404512866375075", "name": "Jamie Rogers", "time": 1523524931561, "rating": 3.0, "text": "Good coffee drinks", "pics": null, "resp": null, "gmap_id": "0x88892216e9e46763:0xf3f2b83f9325eb4a"}
{"user_id": "114417789290825710585", "name": "Russell Pybus", "time": 1503043479807, "rating": 1.0, "text": "One of the worst McDonald's i have ever been to!!!! Don't go!!!", "pics": null, "resp": null, "gmap_id": "0x88892216e9e46763:0xf3f2b83f9325eb4a"}
{"user_id": "104935501981612670513", "name": "Eliana James", "time": 1510688438167, "rating": 1.0, "text": "Just the worst ever.", "pics": null, "resp": null, "gmap_id": "0x88892216e9e46763:0xf3f2b83f9325eb4a"}
{"user_id": "106164141656186991920", "name": "Gary Grimes", "time": 1516474122979, "rating": 5.0, "text": "Quality burgers and fries", "pics": null, "resp": null, "gmap_id": "0x88892216e9e46763:0xf3f2b83f9325eb4a"}
{"user_id": "116934328554843813728", "name": "Ghost_kllr-7", "time": 1480280198918, "rating": 1.0, "text": "Don't like", "pics": null, "resp": null, "gmap_id": "0x88892216e9e46763:0xf3f2b83f9325eb4a"}
{"user_id": "117529014369106363877", "name": "Andre Green", "time": 1530283268501, "rating": 1.0, "text": "Poor service", "pics": null, "resp": null, "gmap_id": "0x88892216e9e46763:0xf3f2b83f9325eb4a"}
{"user_id": "105031093895032229475", "name": "Taylor Fagan", "time": 1622736459281, "rating": 1.0, "text": "This place has such great potential, but needs SO MUCH WORK! I have ordered from Chopt several times since they first opened at the Summit, and have encouraged many friends to do the same. The food is consistently good, but there is no telling when or IF you will get your food! From hour long wait times to my latest experience of never getting food, their management needs to do some work or I don't see it lasting more than a year. This past weekend, I placed an order online on their app for my husband and I for dinner. I knew to order early because the wait time can easily be an hour or longer, and yes, this time was the same. Over and hour, but the food was suppose to be ready by 7:05. When I arrived at the store to pick up my food, there was a sign on the door stating that they had closed early at 5pm due to Memorial Day Weekend. Really? You are in the service industry. Chopt, I believe is a franchise restaurant, but this location seems to be being run like a local Mom and Pop store. And yes, my credit card was charged. I verified that days later after it moved from pending so now I have to deal with getting my money back! I would think that if they had decided to close early, they should have turned off online app ordering. I've seen that several times before with Chopt when they are obviously not able to deal with the amount of their orders because they don't have enough efficiently trained staff. I really want to love Chopt, and I was a fan, but now, it's going to take a lot to get me back as a customer.", "pics": null, "resp": {"time": 1622739137832, "text": "Oh goodness, we hate to read this, Taylor. Mind emailing these details to our Support team so we can pass this along to The Summit Choprs? support (at) choptsalad (dot) com"}, "gmap_id": "0x88891716e872864f:0x721aed345e48cbb0"}
{"user_id": "110290205171811312584", "name": "Angel", "time": 1614203414571, "rating": 5.0, "text": "I placed an online order for pickup on their opening day. I was surprised at how smoothly everything was operating for only having opened their doors 1.5 hrs prior to my arrival. The decor is light and refreshing. The prep line is set up almost in a cafeteria style, and online order pickups in a separate area with a large tv screen to let you know when your order was being made, and when it was ready. I got there a few minutes before they said it would be ready, and was happy when it popped up on the screen at the exact time they told me. Food was delicious and nice sized portion. I look forward to trying more items from the menu!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPaW4K1SAyFVgpjdNiJ_lHuoDair3xYxJRgirjs=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNu6NYoK2y7ajfpDHal04QMfWw3GLMizk5BnSuq=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO-WdZ2qsO8qujr-cj85xYOTicjsQdq1SiQ5xjI=w150-h150-k-no-p"]}], "resp": {"time": 1614969786571, "text": "Thanks for this review! We sincerely appreciate it, and hope we see you back at Chopt soon, Angel."}, "gmap_id": "0x88891716e872864f:0x721aed345e48cbb0"}
{"user_id": "111179405852816760639", "name": "Maddie Abbott", "time": 1614223395266, "rating": 5.0, "text": "Great restaurant!  I was warmly greeted and handed a menu while I waited in line. They have a wonderful selections of options and all are healthy and reasonably priced. The staff were working speedily to get orders filled during the dinner rush hour. The restaurant was packed when I got there and I could see online orders were also piling up. Nevertheless, each team member was courteous and hardworking and did their very best to be as quick as possible and kind. Even with a packed restaurant I got my meal in great time. I will definitely go back! And my salad was amazing!", "pics": null, "resp": {"time": 1614969754332, "text": "Thanks for this review! We sincerely appreciate it, and hope we see you back at Chopt soon, Maddie."}, "gmap_id": "0x88891716e872864f:0x721aed345e48cbb0"}
{"user_id": "106858116695555760050", "name": "Charles Callari", "time": 1622747664968, "rating": 5.0, "text": "This was my first time here. I have a business lunch here with someone. I had the Asian salad and she had the Santa Fe Salad. Both salads were very robust and filled us Up. We will definitely be back and whole heartedly recommend.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMaIIFEDq2jyTUfiTLChgYBzIn2uJJnGxR0-JCi=w150-h150-k-no-p"]}], "resp": {"time": 1623118897773, "text": "Thanks for taking the time to write this 5-star review! We sincerely appreciate it, and hope we see you back at Chopt soon, Charles."}, "gmap_id": "0x88891716e872864f:0x721aed345e48cbb0"}
{"user_id": "108046868865910231777", "name": "Brandon Scordino", "time": 1617320035720, "rating": 4.0, "text": "Really good concept and execution. Plenty of choices for most any salad combinations you'd want. I wish they had more recommended salad options where someone had made various combinations that were a home run.\n\nI ended up getting a Cobb Salad which was good but a boring choice for a salad super spot.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMHk_XOrAd57jHvqKuYkW-kxvAWnwZJcsVq4-J_=w150-h150-k-no-p"]}], "resp": {"time": 1617664166969, "text": "Thanks for taking the time to write this review! We sincerely appreciate it, and hope we see you back at Chopt soon, Brandon."}, "gmap_id": "0x88891716e872864f:0x721aed345e48cbb0"}
{"user_id": "102250163115577729854", "name": "Debra Lorberbaum", "time": 1621728093555, "rating": 4.0, "text": "The food is delicious.  We have eaten inside and everything was perfect\nOrdered tonight for take out and everything was messed up.  I ordered Classic Cobb.  No grill chicken\nMy daughter order the  Santa Fe  and ask for a few extra things in it.  Nothing was added.\nI will be back but will definitely check order before I leave restaurant.", "pics": null, "resp": {"time": 1622150656489, "text": "Thanks for taking the time to post this review, and your candor. We take this very seriously. If you ever want to share your thoughts, we're listening. support (at) choptsalad (dot) com Again, we sincerely appreciate it, and hope you have a lovely day, Debra."}, "gmap_id": "0x88891716e872864f:0x721aed345e48cbb0"}
{"user_id": "116239100778843059914", "name": "Kimberly Frost Barry", "time": 1621428599419, "rating": 4.0, "text": "This is a bit complicated the first visit. The person who helped us was kind and helpful, other associates could learn a little patience. These masks are hard for us all, everyone does not know your practices.\nThe food was delicious 🤤", "pics": null, "resp": {"time": 1621465716663, "text": "Thanks for taking the time to write this review! We sincerely appreciate it, and hope we see you back at Chopt soon, Kimberly."}, "gmap_id": "0x88891716e872864f:0x721aed345e48cbb0"}
{"user_id": "111576138386663203633", "name": "sara smith", "time": 1622820594085, "rating": 1.0, "text": "I placed an online order on 5/30/21 for pickup at 7:30 pm. My card was charged right away. I got to the restaurant at my pickup time, and there was a sign on the door stating that the restaurant was closing at 5pm on the 30th. My online order should not have been able to go through. I emailed support to get a refund, and I haven’t heard back from them.", "pics": null, "resp": {"time": 1623118826702, "text": "Thanks for taking the time to post this review, and your candor. We take this very seriously. If you ever want to share your thoughts, we're listening. support (at) choptsalad (dot) com Again, we sincerely appreciate it, and hope you have a lovely day, Sara."}, "gmap_id": "0x88891716e872864f:0x721aed345e48cbb0"}
{"user_id": "117879964656218653590", "name": "Zachary Dye", "time": 1621734077181, "rating": 1.0, "text": "A beautiful store and great concept, however, as other reviews have stated the staff are beyond rude and ruined my groups first experience with Chopt. I was rushed through my order, and\nno one offered help when we obviously had questions about the menu and ordering process, as this was our first time. I was told there were no cups left at checkout and the only option for me was to buy a drink below the counter. My friend behind me received a cup, however the employee rudely informed him there were no drinks available besides unsweetened tea.  The couple behind us were laughed at by an employee when they did not understand what they were being asked about dressing. This could have been their first time just as it was ours. Extremely disappointed and will not be returning or encouraging others to go.", "pics": null, "resp": {"time": 1621974089318, "text": "Thanks for taking the time to post this review, and your candor. We take this very seriously. If you ever want to share your thoughts, we're listening. support (at) choptsalad (dot) com Again, we sincerely appreciate it, and hope you have a lovely day, Zachary."}, "gmap_id": "0x88891716e872864f:0x721aed345e48cbb0"}
{"user_id": "113593228863347693570", "name": "Shella Sylla", "time": 1618232726553, "rating": 5.0, "text": "Love 💕 this place. This has definitely become one of my regular \"go to\" spots. Great selection of delicious healthy options.", "pics": null, "resp": {"time": 1618319736540, "text": "Thanks for taking the time to write this 5-star review! We sincerely appreciate it, and hope we see you back at Chopt soon, Shella."}, "gmap_id": "0x88891716e872864f:0x721aed345e48cbb0"}
{"user_id": "100325070069092220356", "name": "Courtney Fuller", "time": 1615408558616, "rating": 5.0, "text": "My new favorite salads! I’ve tried many. I think we have eaten there about 10 times since opening!! My only complaint is the kids meal has left off the side twice which didn’t go over well with the kids. This only happened with online order. Otherwise so glad to have Chopt in the neighborhood!", "pics": null, "resp": {"time": 1615516909779, "text": "Thanks for taking the time to write this 5-star review! We sincerely appreciate it, and hope we see you back at Chopt soon, Courtney."}, "gmap_id": "0x88891716e872864f:0x721aed345e48cbb0"}
{"user_id": "104129299086478976014", "name": "Thai in Alabama", "time": 1614355616025, "rating": 3.0, "text": "Edit: my another order has no chicken lol\nI want to cry.\nOrdered online and went to pick up before work.\nTurned out my Orchard salad does not look like picture\nNo apples, no walnut\nBasically romaine, chicken and cheese\nAlso they were super busy this AM so mistakes happen I understand\n\nHopefully this won’t happen again :)", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOJ0Y4nldyDndGhGQso2PYsI--kE2DQhXzYC8_Q=w150-h150-k-no-p"]}], "resp": {"time": 1614220654828, "text": "Thanks for taking the time to post this review, and your candor. We take this very seriously. If you ever want to share your thoughts, we're listening. support (at) choptsalad (dot) com Again, we sincerely appreciate it, and hope you have a lovely day."}, "gmap_id": "0x88891716e872864f:0x721aed345e48cbb0"}
{"user_id": "112434293733426817307", "name": "Yoni Padan", "time": 1615661052141, "rating": 5.0, "text": "Yummy. But more importantly customer service is top notch. They were slammed with a line outside and there was an error in my order due to an online technical glitch I guess and the multi tasking manager took care of it in about five seconds while taking care of the whole operation. It's all about the service, anyone can sell a salad 😁😁", "pics": null, "resp": {"time": 1615859154141, "text": "Thanks for taking the time to write this 5-star review! We sincerely appreciate it, and hope we see you back at Chopt soon, Yoni."}, "gmap_id": "0x88891716e872864f:0x721aed345e48cbb0"}
{"user_id": "104124528392213005191", "name": "RV 359", "time": 1621128942017, "rating": 1.0, "text": "Horrible!!!! The staff doesn’t know the menu so they take forever to make the salads and bowls, and they usually end up getting it wrong. There are little fruit flies all over the place and they usually end up in your salad or bowl. The place is always dirty and the tables  are never cleaned or cleared because they are always so behind on the food prep line so they never get out to the tables or other areas. I strongly recommend you go elsewhere.", "pics": null, "resp": {"time": 1621465967515, "text": "Thanks for taking the time to post this review, and your candor. We take this very seriously. If you ever want to share your thoughts, we're listening. support (at) choptsalad (dot) com Again, we sincerely appreciate it, and hope you have a lovely day."}, "gmap_id": "0x88891716e872864f:0x721aed345e48cbb0"}
{"user_id": "105313693463505922855", "name": "Satya Grandhi", "time": 1617059373383, "rating": 4.0, "text": "Fresh salads and bowls, variety of ingredients to choose from.  Both harvest bowl(meat substituted with falafel) and Southwest bowl are good.  Variety of dressings to choose from.", "pics": null, "resp": null, "gmap_id": "0x88891716e872864f:0x721aed345e48cbb0"}
{"user_id": "106082176348483947142", "name": "Jeremiah Blackmon", "time": 1614224656386, "rating": 2.0, "text": "I was super excited to try Chop’t in Birmingham.  Granted the store has only been open 2 days, but my to go order was disgusting.  I ordered The Orchard and it was drowned in dressing.  Two table spoons was actually a cup of balsamic vinaigrette.  There wasn’t a shred of chicken on it.\n\nHopefully this was a fluke with the new crew.  Get your dressing on the side and inspect before leaving the store.", "pics": null, "resp": {"time": 1614969724666, "text": "Thanks for taking the time to post this review. If you ever want to share your thoughts, we're listening. support (at) choptsalad (dot) com Again, we sincerely appreciate it, and hope you have a lovely day, Jeremiah!"}, "gmap_id": "0x88891716e872864f:0x721aed345e48cbb0"}
{"user_id": "114314561387116065539", "name": "Lala J", "time": 1618914755473, "rating": 5.0, "text": "OMG! I wish they would come to Savannah. This place is so delicious! Service was good, facility is clean. This was my go-to .", "pics": null, "resp": {"time": 1619063044562, "text": "Thanks for taking the time to write this 5-star review! We sincerely appreciate it, and hope we see you back at Chopt soon, Lala."}, "gmap_id": "0x88891716e872864f:0x721aed345e48cbb0"}
{"user_id": "111709763819235070665", "name": "Connor Shannon", "time": 1620695278440, "rating": 2.0, "text": "Great food, but honestly the service is some of the worst I’ve ever encountered. The workers are beyond rude and quite frankly, don’t even know what they’re doing.", "pics": null, "resp": {"time": 1620827325116, "text": "Thanks for taking the time to post this review, and your candor. We take this very seriously. If you ever want to share your thoughts, we're listening. support (at) choptsalad (dot) com Again, we sincerely appreciate it, and hope you have a lovely day, Connor."}, "gmap_id": "0x88891716e872864f:0x721aed345e48cbb0"}
{"user_id": "100763568758815831901", "name": "Luis Delatorre", "time": 1621208715111, "rating": 1.0, "text": "Unorganized\nNot educated on menu, can’t tell the difference between kale and romaine.\nFood bar was a mess and dirty as was the waste of spilled salad greens behind them.\n\nBig flop in bham :(", "pics": null, "resp": {"time": 1621547058566, "text": "Thanks for taking the time to post this review, and your candor. We take this very seriously. If you ever want to share your thoughts, we're listening. support (at) choptsalad (dot) com Again, we sincerely appreciate it, and hope you have a lovely day, Luis."}, "gmap_id": "0x88891716e872864f:0x721aed345e48cbb0"}
{"user_id": "100282404675689292730", "name": "Jason Lowe", "time": 1622766215731, "rating": 1.0, "text": "Not sure if this place will last. Unorganized staff and the protein in the bowls is nonexistent. Hopefully it improves.", "pics": null, "resp": {"time": 1623118856563, "text": "Thanks for taking the time to post this review, and your candor. We take this very seriously. If you ever want to share your thoughts, we're listening. support (at) choptsalad (dot) com Again, we sincerely appreciate it, and hope you have a lovely day, Jason."}, "gmap_id": "0x88891716e872864f:0x721aed345e48cbb0"}
{"user_id": "107681448110249418575", "name": "Katey Lichtenstein", "time": 1619889083013, "rating": 1.0, "text": "I was so excited to finally get a Chopt in Birmingham. Unfortunately, the guy who made my salad could not have been more rude if he tried. Very disappointing.", "pics": null, "resp": {"time": 1620079719679, "text": "Thanks for taking the time to post this review, and your candor. We take this very seriously. If you ever want to share your thoughts, we're listening. support (at) choptsalad (dot) com Again, we sincerely appreciate it, and hope you have a lovely day, Katey."}, "gmap_id": "0x88891716e872864f:0x721aed345e48cbb0"}
{"user_id": "104790895829614096779", "name": "Jessie Bruce", "time": 1617915958273, "rating": 5.0, "text": "food was fresh and healthy...\nstaff was so friendly and nice\nthey went above and beyond", "pics": null, "resp": {"time": 1618009755235, "text": "Thanks for taking the time to write this 5-star review! We sincerely appreciate it, and hope we see you back at Chopt soon, Jessie."}, "gmap_id": "0x88891716e872864f:0x721aed345e48cbb0"}
{"user_id": "117736273825206325041", "name": "Courtney Wooten", "time": 1616433875073, "rating": 3.0, "text": "Looks great but was unable to order what I wanted (custom salad) because the girl doing my order got frustrated when I asked about what kinds of ingredients and types there were as this was my first time and I have several food allergies. What I ordered was good but very disappointing first experience not sure if I’ll go back.", "pics": null, "resp": {"time": 1616630746990, "text": "Thanks for taking the time to post this review, and your candor. We take this very seriously. If you ever want to share your thoughts, we're listening. support (at) choptsalad (dot) com Again, we sincerely appreciate it, and hope you have a lovely day, Courtney."}, "gmap_id": "0x88891716e872864f:0x721aed345e48cbb0"}
{"user_id": "106816129786889980900", "name": "rae sarver", "time": 1614459667959, "rating": 5.0, "text": "Great salads.  Tomato bisque soup delicious.   Very friendly and great customer service.", "pics": null, "resp": {"time": 1614968387249, "text": "Thanks for taking the time to write this review! We sincerely appreciate it, and hope we see you back at Chopt soon,\n\nRae."}, "gmap_id": "0x88891716e872864f:0x721aed345e48cbb0"}
{"user_id": "114444375449679372348", "name": "Dalton Loconto", "time": 1618433800934, "rating": 5.0, "text": "Surprisingly affordable, great options, good experience with kind staff members. 5 sinks", "pics": null, "resp": {"time": 1618532068586, "text": "Thanks for taking the time to write this 5-star review! We sincerely appreciate it, and hope we see you back at Chopt soon, Dalton."}, "gmap_id": "0x88891716e872864f:0x721aed345e48cbb0"}
{"user_id": "100696937179217342601", "name": "Liza Holt", "time": 1621210401593, "rating": 1.0, "text": "Terrible customer service. Very rude.", "pics": null, "resp": {"time": 1621547034338, "text": "Thanks for taking the time to post this review, and your candor. We take this very seriously. If you ever want to share your thoughts, we're listening. support (at) choptsalad (dot) com Again, we sincerely appreciate it, and hope you have a lovely day, Liza."}, "gmap_id": "0x88891716e872864f:0x721aed345e48cbb0"}
{"user_id": "112933101296477068123", "name": "Alex Cardell", "time": 1619829917448, "rating": 5.0, "text": "Delish", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN-KNCQP6ZklYkmrLTvhRubSMFmbfAqCPG1bfPc=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891716e872864f:0x721aed345e48cbb0"}
{"user_id": "109103927701734175036", "name": "Bibby King", "time": 1622231960987, "rating": 5.0, "text": "Excellent", "pics": null, "resp": null, "gmap_id": "0x88891716e872864f:0x721aed345e48cbb0"}
{"user_id": "116960825069074222254", "name": "james scott", "time": 1616107667455, "rating": 5.0, "text": "Healthy, good", "pics": null, "resp": {"time": 1616457625927, "text": "Thanks for taking the time to write this 5-star review! We sincerely appreciate it, and hope we see you back at Chopt soon, James."}, "gmap_id": "0x88891716e872864f:0x721aed345e48cbb0"}
{"user_id": "101992273950815078711", "name": "Katrina Bonds", "time": 1617901530404, "rating": 4.0, "text": "My husband recommended dining here and it was walking distance from the Battle House Hotel where we stayed. The place is small but they offer some tables outdoors for dining. We opted to dine inside. Since it was a bit busy, there were a few tables needing to be bused. Our waitress was friendly and attentive. We order the Le Cadillac pizza, beer and Caesar salad. The food was very good! The playlist was 80’s music which we enjoyed.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "110742464106640396993", "name": "Shalayna Goza", "time": 1609637519699, "rating": 5.0, "text": "Pizza was great, they let us tweak a speciality pizza they had, server was friendly, we recommend the one called Le Cadillac.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOCc4vNdW5Mtz4tA5Pm_HxZIQV41ewpfECL1uk1=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNoPVO8lENAX2R6mgEylGpntpkX-O2VlvyuYBOP=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "112450691688181935071", "name": "Chris Wilson", "time": 1620177431600, "rating": 4.0, "text": "Pizza and pasta dishes are great.  Nice to enjoy dinner out on the sidewalk", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "112934353762303211726", "name": "Jennifer Conroy", "time": 1621622777424, "rating": 1.0, "text": "Got there the place look like it had been shut down for at least a couple of months. Don't know what's going on maybe it's due to the 19 but be aware call before you go", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "116386243028406262543", "name": "Joseph R. Elder", "time": 1618544389159, "rating": 5.0, "text": "The pizza was wonderful and the Chianti was good. Our server was extremely competent and at the same time delightfully entertaining!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "109191597612119913263", "name": "Katie Corley", "time": 1615082788965, "rating": 5.0, "text": "We went around 7pm on a Saturday night. It was pretty busy but they were able to serve us quite quickly. We thoroughly enjoyed the fresh pizza and the calzone! The fresh mozzarella cheese made the calzone perfect. Highly recommend it.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "107666932092756568730", "name": "Priscilla McCants", "time": 1608671593949, "rating": 2.0, "text": "My husband took me here for a date and we both left disappointed and underwhelmed. The place is small but I was actually excited about that because I thought the food would be authentic and tasty. I ordered a calzone. Husband ordered spaghetti and meatballs. I cut into my calzone and noticed that the dough on the inside was raw and undercooked. It was so undercooked in the center that the cheese crumbles inside hadn't melted. The servers were nice but after waiting 10-15 minutes for them to replace my calzone for spaghetti and meatballs, I told my husband to get the check so we could go. I left hungry. My husband said the spaghetti and meatballs weren't that good either.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP-MQIMytwcosXX0JOkdxDDKWh2GqMDH4uB8Txs=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNowVMIbjBym0p19eAFyb32xV-dPrULv2cWWPb1=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "105108888212319854064", "name": "Jenny Mclester", "time": 1605363922945, "rating": 5.0, "text": "My best friend has been talking constantly about this place so she finally took me to try it.  It did not disappoint.   We went on Thursday afternoon.   We ordered a couple of glasses of wine.  We started with the small Greek salad and the bruschetta. I can’t describe how good those 2 items were.  For our entree,   I had the Clam Sauce and linguine and she got the Shrimp Alfredo.    I can’t wait to bring my family back to try it.  This was amazing. The prices were very reasonable also!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "101526753085346938984", "name": "Stephanie Creel", "time": 1619924703854, "rating": 5.0, "text": "So so good! I highly recommend Le Cadillac!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "112636333087015794187", "name": "Alec Bauman", "time": 1615055018213, "rating": 5.0, "text": "A very nice and quaint little place. Great food and a good menu full of easy italian!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "109900100263532382443", "name": "Ophelie Desmet", "time": 1609731855913, "rating": 3.0, "text": "The pizza was fine, not bad and not great. The price was really cheap so I guess you get what you pay for and for the price I cannot complain. The service was lacking. They made several mistakes (wrong order, no cutlery) but that could be because the person was new. The place was cash only and charges for paying with card, however no one said anything until we noticed this charge on our bill.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "103522655238169627681", "name": "Barbara Lambert", "time": 1599934740220, "rating": 5.0, "text": "Best Calzone we've had. Nice, light crust easy to cut.  Very bug we could have shared one.  I got sausage and ham, hemusbamd got meatball. Buth scrumptious. Next time we're in Mibile, AL we will go back. Highly recommend", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "117446006987408752989", "name": "Isabelle Moseley", "time": 1606880232372, "rating": 3.0, "text": "After coming here for the first time a couple of weeks ago we came back because everything had been so fantastic!! This round was pretty disappointing. About ten minutes after ordering the chicken Florentine pizza our server came back to tell us they had run out of spinach. Not a huge deal, but a little frustrating. I ordered an extra side of sauce with my pizza and was brought a bowl of sauce and charged $4. Not a bad price for a bowl of alfredo sauce, but not what I was expecting when asking for a side of sauce. Maybe a 2 ounce ramekin for $1-2, or even just a warning that it would be a larger portion for $4. Whatever, still not a huge deal. Service was slow and by the time we ordered dessert(about 20 minutes til close) they had run out of sweet tea. The cherry on top was tiramisu that was frozen completely solid. I will definitely be back to give this place another chance because the pizza is so so good. This trip was just not good.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "107101720859916381880", "name": "Kristin Byrd", "time": 1547263572417, "rating": 5.0, "text": "The food here was so delicious!!! I’ve been thinking about the pasta primavera since I left. I don’t know how the garlic sauce is cooked but heaven is in it. I had the meatball as an appetizer- delicious. Pizza- delicious. Absolutely NO complaints, at all. If you visit here, you will not be disappointed.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMAyBktPLmxaDdnNk02y0PAnqIKZ_0cu5CdDtNk=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO9Q5P2_Vba-MNKbZWZVW8SBBZ7yk5JpNY5OXVv=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPct1mJYH73bPVKNcOrvrKvpkK8o21VaHQqCesz=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNiF7QXAMa5hd-us26qrO2mAklWr9_YgsyjKA0S=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMLSz1XDqOKjHbKlcuwVYFdg8R5HVBNXEFW7rBn=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "113518961583754705936", "name": "Christina McDaniel", "time": 1614989613674, "rating": 5.0, "text": "Amazing little Italian restaurant in the heart of downtown Mobile. Amazing service and more amazing food!!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "109777792214480997836", "name": "Nikki Gruner", "time": 1515366557978, "rating": 5.0, "text": "This is a cute little Italian place with pizza and pasta. We had the gardenia pizza and it was fantastic! The service was very good and the food was inexpensive.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN0dB5b5kHx3ug8WCr0-UXldEjHh2nF3k5AHOkl=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "109035548483819017348", "name": "Meli Harrison", "time": 1542759318801, "rating": 5.0, "text": "Very good service and the food was great and price was very reasonable also. Huge bowl of soup was $4. That plus a calzone was more than I could. Definitely recommend.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPGEB6vhmu43yVFNkUMcphZbu90TC9Cd0XnGWXu=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOMNrnoz4mvl5VFkkRUm0B9cWi99dtqX2uryIFY=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "109608832835577295219", "name": "Baron Degenhardt", "time": 1610500041813, "rating": 5.0, "text": "Had their Chicken Alfredo to go. Delicious! I would highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "103522655238169627681", "name": "Barbara Lambert", "time": 1599934740220, "rating": 5.0, "text": "Best Calzone we've had. Nice, light crust easy to cut.  Very bug we could have shared one.  I got sausage and ham, hemusbamd got meatball. Buth scrumptious. Next time we're in Mibile, AL we will go back. Highly recommend", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "117446006987408752989", "name": "Isabelle Moseley", "time": 1606880232372, "rating": 3.0, "text": "After coming here for the first time a couple of weeks ago we came back because everything had been so fantastic!! This round was pretty disappointing. About ten minutes after ordering the chicken Florentine pizza our server came back to tell us they had run out of spinach. Not a huge deal, but a little frustrating. I ordered an extra side of sauce with my pizza and was brought a bowl of sauce and charged $4. Not a bad price for a bowl of alfredo sauce, but not what I was expecting when asking for a side of sauce. Maybe a 2 ounce ramekin for $1-2, or even just a warning that it would be a larger portion for $4. Whatever, still not a huge deal. Service was slow and by the time we ordered dessert(about 20 minutes til close) they had run out of sweet tea. The cherry on top was tiramisu that was frozen completely solid. I will definitely be back to give this place another chance because the pizza is so so good. This trip was just not good.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "105241613668094357009", "name": "Scott Edwards", "time": 1499130852921, "rating": 4.0, "text": "Great spot for pizza and pasta in downtown Mobile   fresh mozzarella tomato and basil antipasto and 2 types of pizza.  Small spot where you seat yourself.   No frills but the food is solid", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOSjsx9-K3RjbBpZup-tX_ow0xZApMxgZpqt1PZ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNb77apnfWA474D6oRx_70jsw8avbXbMigYDBZp=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOcG0HxyANmUcpqDDwOtXpJS_gjHCnzCwsUp3Qu=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "110093509911944552249", "name": "Joyce Vaughn", "time": 1546363695335, "rating": 5.0, "text": "You have to stop by when you are in the area. The pizza and pasta was delicious! The service was top notch. Also, the portion sizes were incredibly generous. The place has a homey feel and is simply decorated with pieces from local artists. I'll be back! #favorite #letsguide #mytopten", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMzj-OUlS-BVd6J6YQ1rKyOslS0-VaEbk9z8Dj4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPusdj4yL8RTPvZBuGVB35v5IU45xZKq4-WRJxp=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOJJe14jsjh1__Olh94dRf_CnlMhhCWDNQHpCwD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNkJco_ae15OBSioDqAod4pzqmdKdpgeyj9IzT1=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMHT3HCZLHLr7zQ9UfWoC6iX8Ox1a2f13oVeOF8=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOHUfSW-ibq6sDTyP-jA6mFoHkFceRQgf0Sra8E=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "109744306038980579112", "name": "Sandrina Vaughn", "time": 1546386063707, "rating": 5.0, "text": "The pasta was so yummy, and more now.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOf0qLdTWFink-jz57j2O9b5MgmC6u8bDO3y2ol=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOf5K6WvTpzh9KYRfQgCL7xByzJZf4gap5qrBzw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipON_7x-dVdj2kTUFrZGTYs-GtsgwrU9Ty0fxiGS=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "109608832835577295219", "name": "Baron Degenhardt", "time": 1610500041813, "rating": 5.0, "text": "Had their Chicken Alfredo to go. Delicious! I would highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "108972208682479297190", "name": "Vijay Alagarraj", "time": 1542154850373, "rating": 3.0, "text": "Service was good but food was not: Cesar salad didn’t have enough dressing or croutons.\nWe got Gardenia pizza: it was soggy (May be from too much toppings?).", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNlNjatIfErS0rD5tc-EaDhpcoc9Z2WTNOlkw5n=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP06S34-ZmjENb6FZUJRf-E7pRsIokUHE9AFCwn=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP0roUPsNivJ70Kr4ZKUQiXZYF6gD53CFgrypUF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO60UNTGhEeOHyq9gYlXpvujQKAL3FliEAK6LVq=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "106676195134570492855", "name": "Ovad A Metab", "time": 1605402315278, "rating": 5.0, "text": "Amazing pizza 🍕", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMBPGk9plv7Ha8jGDiU33DOF93vRpWDNbVgHwYl=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNuX-hbCOIG9XI9uL0F6ArHrzib33jHqrE5Alkv=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "107155262789299797252", "name": "Clay Lambert", "time": 1599859548103, "rating": 5.0, "text": "This place was just a short walk from the Hampton Inn and had good reviews.  My wife had a sausage and ham Calzone and I had a meatball Calzone.  They were both delicious.  If you are in the area you should definitely eat here.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "117403482519576391962", "name": "Pennie Ferrazzano", "time": 1521568796852, "rating": 5.0, "text": "Excellent food and great service! Oh so yummy! The pasta Bolognese and Alfredo pasta were soooo good!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPKAzgd9h_qeqR2L4R-wV9uCUkDN76Vrd3HROF6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP_TlIjhHN5B6nkroitcdGTE94HZ8_ZPmLsPmpx=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNwUECa1kwmfBg3c2EJSMly8_HkHev9OBl-KGm8=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "101956554821915357284", "name": "Soul Seasoned", "time": 1554807699394, "rating": 5.0, "text": "Tiny pizzeria with authentic artisan pizza crust, nestled in a beautiful location with plenty of treelined, southern scenes. We got mushroom, onion and green olive on ours.  It came loaded with cheese.  Service was succinct but adequate.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPd8qN59BgPVU3G8dwA9nHNNcjqru1Vr0OXfyQ0=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "115948728205468523561", "name": "Garrett Munguia", "time": 1602178820117, "rating": 4.0, "text": "Pizzas were delicious. But they didn't have bottled water! I was only left with the option of coca cola products or alcoholic beverages. Very tasty!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "108811439979450084512", "name": "Scott S", "time": 1561684408359, "rating": 5.0, "text": "Wow... most excellent food! Home made! Large portions and a great staff!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMc5THJlavSuCe0QQPWe_qjj_uXhrqbh9iqw5pm=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNpuFzQC08h3sD0WM432FzWHKgJma35nD3kp14M=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPW47BX1s3mnZSB7SXk7VsYo2_93Z0gGGIBMy9L=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNjM_kZyNyof-sBq6V5AP7n5DobDU3Vnm2brNAn=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMgjJhPOTMRf0MA2g80qgwCJmXi7rACQyBTpEXB=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "117403482519576391962", "name": "Pennie Ferrazzano", "time": 1521568796852, "rating": 5.0, "text": "Excellent food and great service! Oh so yummy! The pasta Bolognese and Alfredo pasta were soooo good!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPKAzgd9h_qeqR2L4R-wV9uCUkDN76Vrd3HROF6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP_TlIjhHN5B6nkroitcdGTE94HZ8_ZPmLsPmpx=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNwUECa1kwmfBg3c2EJSMly8_HkHev9OBl-KGm8=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "103373686351791926063", "name": "Tarun Mutukuri", "time": 1609731793339, "rating": 4.0, "text": "Good food for the prices they offer it at. Didn't know that the place was a cash only place and was charged a little surcharge when we paid with a card and we weren't informed of it before they charged the surcharge.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114102660393037186711", "name": "Jennifer Carter", "time": 1526581987171, "rating": 5.0, "text": "Even though I just had a salad it was still good. Others had a meatball calzone that I tried and it was beyond good. Definitely worth another visit.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNprKgyIgacVPg1Kf6dkXuFyWiCApeeZeutsodM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPTTVcPMJ9cmTR-XGoXvZBJpeis13h-dMPRDP6P=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "110275447784559122886", "name": "Kristen Cheek", "time": 1550715118708, "rating": 5.0, "text": "Awesome food,  awesome service.  Definitely recommend! Can't wait too come back and visit. Best chicken salad sandwich ever.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPOww_bbH5hXKq-n8OIlf5ZOof0pyS-nQFggQ_B=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "103221514267227633503", "name": "Ashley Johnson", "time": 1591132567535, "rating": 1.0, "text": "The single pizza slices were excellent 👌 but the inside of the establishment had flies disturbing us the entire meal. For 60 we expected to at least be served on regular plates and glasses not plastic. Lastly our pasta was completely disgusting and noodles we're over cooked. Not one person  finished their food. We definitely will not be returning here", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114038865494726784070", "name": "D Workman", "time": 1618793852108, "rating": 5.0, "text": "The Greek salad was amazing!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "108044888866492016868", "name": "TheChowington", "time": 1596758834444, "rating": 5.0, "text": "I had one bad experience with this restaurant- I contacted the owner and he immediately went out of his way to make it right.\nI waited a few months before I took him up on his offer of replacing my meal. I picked up my replacement meal today and it was spot on. I am glad they have a good owner who truly values his customers.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "109047039272602393956", "name": "Shane Singleton Sr.", "time": 1606884438101, "rating": 5.0, "text": "I work there we have good pizza and pasta any kind of pasta you want come on by and check it out", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "101676226777812785178", "name": "Talitha Wilson", "time": 1496802664759, "rating": 5.0, "text": "I went with my family while they were visiting Mobile before heading out on a cruise. So we simply walked in off the street and received great customer service, the chicken Alfredo was the best I had ever tasted. And every dish that my family had eaten that evening was thoroughly enjoyed. I will be going back for sure. Please try this Italian pizzeria out if ever on Dauphin Street or in the area.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN--8Ztddtyouna0h8_L3-nU5_tQT7jZd8PfFw0=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "108972208682479297190", "name": "Vijay Alagarraj", "time": 1542154850373, "rating": 3.0, "text": "Service was good but food was not: Cesar salad didn’t have enough dressing or croutons.\nWe got Gardenia pizza: it was soggy (May be from too much toppings?).", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNlNjatIfErS0rD5tc-EaDhpcoc9Z2WTNOlkw5n=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP06S34-ZmjENb6FZUJRf-E7pRsIokUHE9AFCwn=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP0roUPsNivJ70Kr4ZKUQiXZYF6gD53CFgrypUF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO60UNTGhEeOHyq9gYlXpvujQKAL3FliEAK6LVq=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114498200674536298926", "name": "Mike B", "time": 1610495607088, "rating": 3.0, "text": "Pizza was great but waiter short changed me by $10.00", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "108772478475373984148", "name": "Michael Maree", "time": 1552871060823, "rating": 5.0, "text": "In from out of town, some of the best pizza I've had. Crust is crisp on the outside and chewy inside. Real whole milk mozzarella! Pasta primavera was pretty good, slightly overcooked noodles but great veggies. Recommended.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOQfYQN2bbcw-vzkXFa9vQcHOF73t2rVbkdCusn=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "115319535347310455670", "name": "Tecno-Advanced Concepts", "time": 1603581954636, "rating": 5.0, "text": "Kindred, Arlene and Mellissa makes every visit to this place a memory to cherish... thx for feeding me... and treating me and my collegues so well... specially Kindred whom let us all enjoy her awesome blue and purple hair.   🥰😍😎😉", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "110093509911944552249", "name": "Joyce Vaughn", "time": 1546363695335, "rating": 5.0, "text": "You have to stop by when you are in the area. The pizza and pasta was delicious! The service was top notch. Also, the portion sizes were incredibly generous. The place has a homey feel and is simply decorated with pieces from local artists. I'll be back! #favorite #letsguide #mytopten", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMzj-OUlS-BVd6J6YQ1rKyOslS0-VaEbk9z8Dj4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPusdj4yL8RTPvZBuGVB35v5IU45xZKq4-WRJxp=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOJJe14jsjh1__Olh94dRf_CnlMhhCWDNQHpCwD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNkJco_ae15OBSioDqAod4pzqmdKdpgeyj9IzT1=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMHT3HCZLHLr7zQ9UfWoC6iX8Ox1a2f13oVeOF8=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOHUfSW-ibq6sDTyP-jA6mFoHkFceRQgf0Sra8E=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "117603881241309777454", "name": "Robin Luck", "time": 1590321242939, "rating": 5.0, "text": "Stayed at a nearby hotel they delivered very quick.   Love love their Pizza and the Greek salad was so amazingly fresh and delicious.  I will order again,  great food!! Impressed", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "112381794282979429601", "name": "Michelle L.", "time": 1576284284451, "rating": 5.0, "text": "Absolutely incredible. The whole place is charming and tucked next to the coolest bookstore. The pizza is incredible, and what I would describe as being the best pizza I've ever eaten. The Cadillac pizza tastes like the chef absolutely loves to cook. The staff is so friendly, the ambience delightful. I don't know when I've enjoyed a meal more.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "100685169033017227876", "name": "Abdul Kader Surti", "time": 1602428121769, "rating": 3.0, "text": "The pizza's are good, a bit on the pricey side. Wish the place looked better and has good seating options.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "108204258691036176570", "name": "kraig Kitchens", "time": 1614521088358, "rating": 3.0, "text": "Service and food were good, but the 75 health rating was concerning and they were understaffed for a Saturday night", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "116951629094483432260", "name": "Brian Shillingford", "time": 1572986964442, "rating": 5.0, "text": "If I could rate this place higher than 5 stars I would.  \"Pizzeria Delphina\" is an adorable small local restaurant that serves fabulous pizza and possibly the best \"Fettuccine Alfredo\" I've ever had. If you're passing through downtown Mobile and feeling hungry. You have to stop here.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOEaU0LH6nAqXtorGjgJYdXa0qjxqxlXQFUvGNo=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114703519089359455505", "name": "Chris Williams", "time": 1593379880168, "rating": 4.0, "text": "Food was good, but not the best. Service was great. Prices were comparable to other restaurants around. They have beer and wine. Wish they had liquor.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "118335131926530233881", "name": "John Leverette", "time": 1578707679991, "rating": 5.0, "text": "Because I was a part of literally building the restaurant grand opening it and running it for over a year I have a hard time saying this because I'm no longer a part of it. They are excellent everything is top-notch you will not find better fare anywhere if you want truly good cooked food done properly and from scratch you will go there.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "112037100199401182576", "name": "Aaron Headley", "time": 1596332994963, "rating": 5.0, "text": "Excellent pizza! Tried the greco and a custom and both were excellent.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO031LaCkgaJaYwXvIA_RQ88IKMeU7SlXCU2pqF=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "116207754882917438481", "name": "Mandy Touchstone", "time": 1606656184581, "rating": 5.0, "text": "Always 5 star meal and service...DELICIOUS!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "110911465530252985729", "name": "Bruce Whaleham", "time": 1594253338239, "rating": 5.0, "text": "I’m allergic to gluten and I’m lactose intolerant and I ordered the normal fettuccine alfredo. I paid for the meal and the pain that came from my bodies inability to process those ingredients and I don’t regret my decision at all. 10/10 fantastic food and service, they were understaffed and they were very apologetic about it but still not a long wait.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "105979358989194106508", "name": "ben barnett", "time": 1600480037386, "rating": 5.0, "text": "The food tasted very fresh. It was great.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "105173629415864241468", "name": "Minio Rodriquez", "time": 1596582962328, "rating": 5.0, "text": "Absolutely loved it, was blown away from the flavor and value.  We sat inside, by a window.  Had the brushetta...large pie, a couple of sandwiches 😋 👌 and all was stellar.  Very large portions.  First time in mobile, we will be back.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "108663468766205400296", "name": "JGirl Do", "time": 1545337806493, "rating": 5.0, "text": "Friendly family style Italian food. Had the Puttanesca and it was delicious.  They chopped the olive mixture (Muffuletta style) in the sauce. The restaurant was busy. The prices were good and the service was great.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPLMPvDh2tmyMRUoCWVdc6t8w7HFnQEy98IFgdB=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "113472513544784776590", "name": "Damian Ferguson", "time": 1578973588006, "rating": 5.0, "text": "Cool little spot close to the square. We were passing through on I-10 and was worth the stop. The pizza was great and the service was good - plus I love the name.  Good food for a good price.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "101504184523305570784", "name": "Jessica Watkins", "time": 1615413332902, "rating": 5.0, "text": "Great pizza..", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMz0ylUre4yMupJts2P-aMLPl_9wwwQQxeVbsp8=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "115036811369566963648", "name": "Nicholas Bertagnolli", "time": 1602022656108, "rating": 5.0, "text": "Best food around mobile and baldwin County by far.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "106842723678233193613", "name": "Rocky Oubre", "time": 1590073956087, "rating": 5.0, "text": "I love their pizza dough. 2 for 1 🍕 on Wednesday too🔥", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipObucYqyTMOksDmDhtrYDFcr8orhHMemYOczSqd=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "104839990625285226306", "name": "Caisy CG", "time": 1587333995027, "rating": 5.0, "text": "We ordered 2 Stromboli's and a pizza. Everything was delicious! The marinara sauce has such a fantastic, fresh basil and roasted garlic flavor(make sure to add some as a side if you get stromboli!) This was our first time trying it- I will definitely be getting dinner from here again! Next time, maybe,we will try pasta or a poboy, yummy 🙂", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "106676195134570492855", "name": "Ovad A Metab", "time": 1605402315278, "rating": 5.0, "text": "Amazing pizza 🍕", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMBPGk9plv7Ha8jGDiU33DOF93vRpWDNbVgHwYl=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNuX-hbCOIG9XI9uL0F6ArHrzib33jHqrE5Alkv=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "115996551128269433379", "name": "Tammi Chase", "time": 1590873741899, "rating": 5.0, "text": "Best little whole in the wall Pizzeria you will find. I recommend  the Cadillac pizza or one of their extremely large calzones!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "102839923501329297554", "name": "Judah Sixsmith", "time": 1569586402424, "rating": 5.0, "text": "My mom and I recently sat down for a late lunch and wine on the patio. If it's a beautiful day, sit outside! There's great Sundance Square people-watching. I usually prefer to sit inside at the bar, I love a good bar and Bird Cafe's is up there! But when the weather is great, it's definitely patio time", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "110961542799756164226", "name": "Po La", "time": 1595386438741, "rating": 1.0, "text": "Ordered a large parma pizza (their largest is 14 inch which is medium at other places) and 2 small greek salads which cost me $43.50. Totally tasteless like they forgot spices exist. Dough was wet and soggy from watered down sauce which had zero salt and also no taste. Greek salad was ok, not a big fan of the chopped olive salad on top, surprisingly dressing was very good. Pizza was not good so I'm  giving only 1 star, Italian restaurant should know how to do it right as pizza is a staple.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "117969403427363055911", "name": "Colt Mandy", "time": 1555198463554, "rating": 5.0, "text": "Great hole-in-the-wall Italian join downtown. Very casual, laid back place with a handful of patio tables. I ordered the Greek salad (which came with feta and shredded cheddar cheese?) which was decently sized for a small salad, with a giant scoop of olive salad on top. Good if you love olives!\n\nFor my main I had the pasta primavera which was a huge portion for a small (they also have a large option), and had plenty of fresh slices of zucchini. There was too much olive oil, but it had a nice flavor and will make a nice lunch tomorrow!\n\nPizzas and calzones look solid but the pastas and salads looked the best from what I observed.\n\nService was just ok but pretty efficient. The bar selections are limited to a few beers and wines, but definitely enough to wash down a hearty, carby meal. Will definitely be back for a quick bite.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMduNSwnm3OzuHqWNAvF_McTXeUckLwd41UuXXe=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPRgFr2V4qThG5CaOhVoDPBYB1slTjiaOgUzNaC=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNFV6bJl7ZpYSgbBiTooeWBHPVHk3xS96sOiG08=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114347587819447138015", "name": "caitlin walsh", "time": 1574648212074, "rating": 1.0, "text": "If I could give this place zero stars I still don't think that would be enough. We heard good things about this place and were in town visiting so decided to try it. We sat down and ordered almost right away, and over an hour into waiting still had not received the side salads. After finally getting the salad, not even two minutes later we got ONE of the two entrees. The pasta dish was cold and lacked anything exciting. The breadstick it came with was stale and could break teeth. 35 minutes later the second entree arrived(a sandwich) that was supposed to be salami and but had bologna on it. Before the sandwich arrived we had asked for boxes and a check. We also ordered half of the items, and was charged for a whole. We had to take our food to go, after over 1.5 hours of waiting, and then did not eat it because of the quality. Save your money, squid inks just around the corner is way better. The staff was less than welcoming or apologetic.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "110313231693251375675", "name": "Sean O'Neill", "time": 1577073420604, "rating": 5.0, "text": "Very pleased with our pizza.  Not the best pizza I've ever had but definitely a repeat place to visit when back in Mobile.  The service was very nice and quick.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "103802483496328245750", "name": "Clayton Stanley", "time": 1609246612966, "rating": 1.0, "text": "Terrible customer service. Were basically told we couldn't eat there.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "111785312524343254567", "name": "Jason Whiddon", "time": 1608827627686, "rating": 5.0, "text": "Excellent Italian, just stay away if on diet!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "102148773317675896227", "name": "A Hunter", "time": 1568965952007, "rating": 4.0, "text": "Food is good, more than enough on your platter. Staff could be a bit more welcoming. Pricing, well it is on Dauphin St downtown so I guess that's why they charge so much? Overall good food, great location.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "106730443504403515115", "name": "Katherine Blankenhorn", "time": 1491958543999, "rating": 5.0, "text": "Had an amazing dinner the last night of the 1065 concert series. The food was great and so was our service.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOsIqHB2IzvXOtM-738CkNsiB-sPZSLyHALIOaz=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "100839368464984613535", "name": "Susan Nettles", "time": 1581282631360, "rating": 5.0, "text": "I love the cozy atmosphere, but the food is the star of the show. The calzones are incredible and the pasta is authentic and fresh. I highly recommend.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "117976762511755926393", "name": "QUAWON BATTISTE", "time": 1579647443532, "rating": 5.0, "text": "Best 🍕 in Mobile! I even forget my credit card and they were able to make accommodation for me.  P.S. No, I didn't have to wash the dishes.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "112532971057986104243", "name": "Jasper Brock", "time": 1598150073963, "rating": 5.0, "text": "Great pizza even better staff", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "112990720946900036664", "name": "TJ McMeans", "time": 1610226572745, "rating": 5.0, "text": "Great food as always!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "109599410268167053745", "name": "Doris Windham", "time": 1615140143634, "rating": 5.0, "text": "When you are in Mobile do eat here.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "115373910479034003530", "name": "Jaime Asatsuyu Hammack", "time": 1577459241268, "rating": 5.0, "text": "Get the marinated feta. The bread that comes with it is magical even on its own, and paired with the herby, oiled feta cubes? Incredibly delicious.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "106931255919861402809", "name": "Jessie Quarterman", "time": 1580011474299, "rating": 5.0, "text": "A Great personal and comforting environment! Very Professional staff helps your experience here worth every visit!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOtLYxC3Hs4s3GPDEfRhnsVw8agzgT2L-SwSS5c=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "117355262995106139267", "name": "Thomas Moynihan", "time": 1563002629099, "rating": 5.0, "text": "LOVE this place. Such a quaint hole in the wall that serves some of the best pizza I have found in the Mobile area. I absolutely enjoy the Le Cadillac and the pasta dishes too.\n\nI will say that because it's a small place, it's hard to get a table sometimes, so make sure you get there before 6 or so on busy days!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "112209741379239157020", "name": "Dustin Judice", "time": 1593975203078, "rating": 5.0, "text": "Pizza and pasta is excellent, great service for dine in or take out. My favorite pizza place is Mobile.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "102149662566947898690", "name": "Theodore Veterinary", "time": 1586366532973, "rating": 5.0, "text": "Great Handmade Pizzas!  Our staff loves when we order pizza for everyone.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "117690221614972394251", "name": "Monica Raybon", "time": 1583446057182, "rating": 5.0, "text": "The Le Cadillac pizza with added feta cheese was the bomb..... there is not a bad menu item  in this place", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "113549760866928539881", "name": "Dylan Daughety", "time": 1576212216789, "rating": 5.0, "text": "Pizzeria Delphina is a cozy little restaurant with great food and quality service. I highly recommend  a visit if you are downtown Mobile looking for a bite to eat.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114032821932359154707", "name": "Jim Valente", "time": 1601153377085, "rating": 5.0, "text": "The BEST Pizza and Pasta in downtown Mobile.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "107329579666551685073", "name": "Gage McLain", "time": 1558144792013, "rating": 5.0, "text": "OMG you are missing out if you don't go eat here. The atmosphere is great for dates and family dinners out. They give you so much food that you can't eat it all. The waitress we had was so nice. I highly recommend coming to eat here", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114099446283854661137", "name": "Jennifer Gardner", "time": 1582406166124, "rating": 5.0, "text": "Wonderfully delicious pizza!! Stromboli was delicious as well. Good prices. Large portions!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "104832825906154883037", "name": "Diana Propper de Callejon", "time": 1560538062051, "rating": 5.0, "text": "Excellent pizza, crispy crust! The salads are delicious. Nice casual place with seating outside. Highly recommended", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "103703094792286350020", "name": "Stephanie Young", "time": 1590689350638, "rating": 5.0, "text": "Food is always good.  Today there was a long wait and we had to get out food to go.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "101537079503474505072", "name": "Charlotte", "time": 1594170438471, "rating": 5.0, "text": "I am vegan and the Capellini pasta is phenomenal.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "116075812344791312936", "name": "Lorenzo Winters", "time": 1560399506632, "rating": 5.0, "text": "While recently in Mobile, my wife and I decided to check out Pizzeria Delphina given the good reviews. My wife, being the adventurous one, suggested we try the La Greco. All I can say is Wow. The feta cheese was generously spread over the pizza but the olive salad (a mixture of several olive types) was the big surprise. We love a thin crust and this crust did not disappoint. The pizza was magnificent. We sat in the front window and enjoyed the people watching and pizza. The service was excellent. It was a special lunch.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "115958091951566731326", "name": "Noble Taylor", "time": 1554225638955, "rating": 5.0, "text": "I can't count the number of times I've had a cheese pizza before. This place makes cheese pizza that tastes better than most other stores Gourmet Pizza. Best mozzarella I have ever had at a restaurant", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "116146131006919510987", "name": "Eric Jones", "time": 1575566713628, "rating": 5.0, "text": "The food is superb. Highly recommend if nearby.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNpvZOgJi4dW5cz4TSdFST5kbbYgFSibJg9og2r=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114243571475952843577", "name": "Dillon Allen", "time": 1558992347924, "rating": 5.0, "text": "Great handmade pizza in the heart of Mobile. I never end a night after Pizzeria Delphina with room left in my belly. Great menu, but also offers fully customizable pizzas. The meatballs are wicked good. Just give it a try!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114966830069979360206", "name": "Coty Alexander", "time": 1583335290873, "rating": 5.0, "text": "Delicious pasta and pizza in a little building. Service is always amazing.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114994496280932409210", "name": "David Carpenter", "time": 1551872121063, "rating": 4.0, "text": "Food is delicious.  Atmosphere is quaint.  Every time we have been there the service is good.  If you are in Downtown Mobile, this place is definitely worth a try.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114243571475952843577", "name": "Dillon Allen", "time": 1558992347924, "rating": 5.0, "text": "Great handmade pizza in the heart of Mobile. I never end a night after Pizzeria Delphina with room left in my belly. Great menu, but also offers fully customizable pizzas. The meatballs are wicked good. Just give it a try!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "115958091951566731326", "name": "Noble Taylor", "time": 1554225638955, "rating": 5.0, "text": "I can't count the number of times I've had a cheese pizza before. This place makes cheese pizza that tastes better than most other stores Gourmet Pizza. Best mozzarella I have ever had at a restaurant", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "104183471669571106710", "name": "Stephanie Dwyer", "time": 1529935781572, "rating": 5.0, "text": "The best Caesar salad I’ve had in a long time. Definitely an establishment where you get more bang for the buck and I loved the simplistic atmosphere. The waitstaff works as a team so you interact with several upbeat personalities. The meatballs were perfect and the Alfredo Sauce is worth going back for. I was even happy with the 𝑯𝒐𝒖𝒔𝒆 Pinot. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "117588521422680296195", "name": "Wendy McElroy", "time": 1578108707845, "rating": 5.0, "text": "Had the BEST pizza and service! Such a neat little place!!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114966830069979360206", "name": "Coty Alexander", "time": 1583335290873, "rating": 5.0, "text": "Delicious pasta and pizza in a little building. Service is always amazing.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "110816231417036594846", "name": "Edward Newman", "time": 1557796386453, "rating": 5.0, "text": "The wait staff were all very pleasant small cozy atmosphere but that was all that was small the portions are large. You by far get your money's worth and then some. I had the chicken fettuccine alfredo and it was delicious", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "102736178624319528711", "name": "David Clark", "time": 1530978062272, "rating": 4.0, "text": "I have had their pizzas a few times and they are very good. They also serve a variety of typical Italian dishes which are mostly good. The service is usually good, but sometimes getting your food can be a little slow. The restaurant is fairly small and can get crowded at times, so plan accordingly. Pizzeria Delphina is located in a old storefront in downtown Mobile and the surroundings are pleasant.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "117746777052851646160", "name": "Casey Roberts", "time": 1564328570262, "rating": 5.0, "text": "Great food and wait staff. If I'm downtown I usually eat here for lunch. Never a disappointment. Try the marinated feta", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "106032902506936871738", "name": "Erica Davis", "time": 1559314666953, "rating": 2.0, "text": "The food was good, but the place is tiny with hardly any seating. We sat outside and the table felt like it was about to fall apart. Really an awkward experience", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114994496280932409210", "name": "David Carpenter", "time": 1551872121063, "rating": 4.0, "text": "Food is delicious.  Atmosphere is quaint.  Every time we have been there the service is good.  If you are in Downtown Mobile, this place is definitely worth a try.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "116774938260895946271", "name": "Ina Washington", "time": 1563396869798, "rating": 5.0, "text": "The pizza was GREAT! We come here every year when we go to our conference.  The staff was super nice!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "111653721051984251337", "name": "Valarie Smith", "time": 1547957700072, "rating": 5.0, "text": "Good friendly businesses. The PIZZA was great!   After a visit  to the Monsters Truck. I was happy to see they stayed open to serve us'Thank all and Tia :~)", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114252240417250617643", "name": "Laura W", "time": 1558987188285, "rating": 5.0, "text": "I went here twice. Once with my sister and once with my boyfriend. Both times it was absolutely amazing. I ordered a margherita pizza and it was delicious. My boyfriend actually grew up in Italy and he said the pizza was amazing too.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114800139470038265760", "name": "Lloyd Logue", "time": 1583633174591, "rating": 5.0, "text": "Great service and pizza...Pesto Scampi!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPM0PYNkPsIveIKKCq3mkcX0O2LbC6fvbDLXLbT=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "104183471669571106710", "name": "Stephanie Dwyer", "time": 1529935781572, "rating": 5.0, "text": "The best Caesar salad I’ve had in a long time. Definitely an establishment where you get more bang for the buck and I loved the simplistic atmosphere. The waitstaff works as a team so you interact with several upbeat personalities. The meatballs were perfect and the Alfredo Sauce is worth going back for. I was even happy with the 𝑯𝒐𝒖𝒔𝒆 Pinot. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "102736178624319528711", "name": "David Clark", "time": 1530978062272, "rating": 4.0, "text": "I have had their pizzas a few times and they are very good. They also serve a variety of typical Italian dishes which are mostly good. The service is usually good, but sometimes getting your food can be a little slow. The restaurant is fairly small and can get crowded at times, so plan accordingly. Pizzeria Delphina is located in a old storefront in downtown Mobile and the surroundings are pleasant.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "103710668973100767126", "name": "Chris Davinroy", "time": 1575123370493, "rating": 5.0, "text": "We are on vacation from St Louis and only in Mobile for one night. I had a huge lunch in Memphis so I wasnt very hungry but my wife was. We decided on pizza and splitting a salad. Knowing the portions back home, we ordered a large salad - that was a HUGE mistake. The operative word is huge because that's the size of the portions! We also ordered a small pizza (which was the perfect size for us to split) and the only thing \"wrong\" with it was that I could have used extra cheese on top to help hold on the toppings. Thanks for taking care of us PD!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "106032902506936871738", "name": "Erica Davis", "time": 1559314666953, "rating": 2.0, "text": "The food was good, but the place is tiny with hardly any seating. We sat outside and the table felt like it was about to fall apart. Really an awkward experience", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "112419615292302209974", "name": "Brett Williams", "time": 1549134097331, "rating": 5.0, "text": "Best pasta in the city hands down. They were packed and our service was still prompt and courteous. Dope atmosphere too.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "102631278680671684976", "name": "Shoals Yakkin' with Hatch", "time": 1567216037774, "rating": 4.0, "text": "Awesome little pizza place with an awesome Stromboli and good red wine.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNlMhaDDzhhfS1wKYjlkVrOCnm3uGq4Lt4gXqe7=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "103076163018207332343", "name": "Christopher Goens", "time": 1578273554712, "rating": 5.0, "text": "Cozy atmosphere, great food at a reasonable price for such large portions, and friendly service. Will definitely be going many more times!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "101849918955838183845", "name": "John Martin", "time": 1510706555753, "rating": 4.0, "text": "Best chicken ceasar salad in a long time, her pasta primavera with added shrimp was good as well.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPVQd2lGLsSXWhodvEu5XfBxIID8pVvcIAm0TTD=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114365156367292395645", "name": "Peter Trivanovich", "time": 1607793230750, "rating": 4.0, "text": "Good pizza.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "112819398737056152188", "name": "Connie Caraway", "time": 1578967075628, "rating": 4.0, "text": "Fun little store. Nice restrooms :-)", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "105021170578529876646", "name": "Chase Nelson", "time": 1561596315409, "rating": 1.0, "text": "Flies everywhere, rude staff when we walked in to place an order, and when paying they do not even inform the customer they charge you to pay with a credit card. They simply don’t want to pay the merchant processor the small fee when collecting profit. So they just double up. Last time I checked, we you take money from someone without notice or permission it’s called theft!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "108643580361447374560", "name": "Jason Fountain", "time": 1598472922666, "rating": 5.0, "text": "The servers and food is fabulous", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "102629504856730012749", "name": "Shane “LIL KILLA” Singleton Sr.", "time": 1604466805801, "rating": 5.0, "text": "Thjs is where i work at....", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114138256330492160343", "name": "Yaminou Oyeossi", "time": 1593020756812, "rating": 4.0, "text": "Drove off the highway to get some real food. Came to the closest pizzeria I could find and then walked around downtown Mobile. A lot of history in these buildings.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "113780829032853298341", "name": "Aimee Sherrod", "time": 1563760207531, "rating": 3.0, "text": "**update**\nServer was super nice and the food is amazing. Food is 5 star for sure, but couldn’t get over the first impression. My advice? Order takeout from them.\n\nFirst impression is a one star. I’ll update if anything changes.\n\nJust walked in. There were two other couples in line in front of us. One couple walked out after being ignored and ran over by staff. The next couple consisted of a very pregnant young woman and her date. They also were ignored and ran over. They finally left.\n\nI stopped a staff member to inquire if we were to just seat ourselves or??? I was told there’s a waitlist and then she rushed off. No idea where this list was. Open table. Open seats at the bar. We waited a bit longer and finally got seated.\n\nI’ll update when the food comes out.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "115740311219491927045", "name": "Tosha Thibeau", "time": 1541320201416, "rating": 5.0, "text": "We went in here while on our way to Gulf Shores on vacation and they treated my family and I so great. The waitress we had was amazing - especially with our autistic son. She really made him feel special!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipODszy__V2FxniIt_gH6UDBnieYByOITmtP4gK4=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "105021170578529876646", "name": "Chase Nelson", "time": 1561596315409, "rating": 1.0, "text": "Flies everywhere, rude staff when we walked in to place an order, and when paying they do not even inform the customer they charge you to pay with a credit card. They simply don’t want to pay the merchant processor the small fee when collecting profit. So they just double up. Last time I checked, we you take money from someone without notice or permission it’s called theft!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "104138422220826275516", "name": "Chris Jones", "time": 1553914562111, "rating": 5.0, "text": "Best greek salad my wife has ever had. Friendly and speedy staff. Cozy atmosphere indoors. Outside seating available.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "111067515560727431643", "name": "David Hawkins", "time": 1530306940671, "rating": 5.0, "text": "I'm from NY and am always on the hunt for good pizzeria/Italian places and this was a great find! Not very many places along the gulf coast do pizza and Italian very well, but Delphina is one of the best. Very reasonable prices and very generous portion sizes.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "107864255821064775290", "name": "E Davis", "time": 1579138692894, "rating": 3.0, "text": "Was ok decent prices ok good cozy atmosphere and friendly staff.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "108643580361447374560", "name": "Jason Fountain", "time": 1598472922666, "rating": 5.0, "text": "The servers and food is fabulous", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114138256330492160343", "name": "Yaminou Oyeossi", "time": 1593020756812, "rating": 4.0, "text": "Drove off the highway to get some real food. Came to the closest pizzeria I could find and then walked around downtown Mobile. A lot of history in these buildings.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "101179508983553652812", "name": "Nicolas Bertrand", "time": 1560819061942, "rating": 2.0, "text": "Stayed in Mobile and saw that this pizza place had a lot of good reviews. Sadly, I was disappointed. Ordered a large pepperoni for $17 and it was the size of most mediums. The cheese was the best part. Other than that it lacked flavor, sauce and the crust was burnt and hard in a few spots. I expected a lot more and was let down.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "115625366690056016131", "name": "Jordan Greiner", "time": 1578373220969, "rating": 5.0, "text": "It's a small quiet pizzaria, amazing location, interesting menu options, and the most amazing Feta appetiser that I've ever had!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "101941209954190811823", "name": "phillip zangas", "time": 1579137657885, "rating": 5.0, "text": "Awesome food and even better service!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "100704190960114464913", "name": "James Daigle", "time": 1556612520706, "rating": 4.0, "text": "Meatball app was awesome. Pizza was made with fresh veggies. Overall really good experience.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "100704190960114464913", "name": "James Daigle", "time": 1556612520706, "rating": 4.0, "text": "Meatball app was awesome. Pizza was made with fresh veggies. Overall really good experience.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "104262212017806985194", "name": "Paul Griffin", "time": 1573761675749, "rating": 5.0, "text": "I ordered a Chicken Parm PoBoy. Couldn't eat it all. Largest PoBoy I've ever seen. Ever.  Cheap too. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "113767649358920925537", "name": "Dave Hardin", "time": 1547233336476, "rating": 4.0, "text": "Pizza was tasty with homemade sausage. Maybe a hair on the pricey side but I'll be back for sure. Great service and place was clean.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "101815115986833994897", "name": "Oscar Manuel Castillo Jimenez", "time": 1609984816795, "rating": 5.0, "text": "Best pizza ever!!!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "104184974741653557810", "name": "Esteban Serrano", "time": 1534130084689, "rating": 5.0, "text": "Top 3 pizza I've ever eaten! Great food, great attention and it is located in a good place of town. I easily recommend it to anyone who likes a great thin-crusted pizza or would like a great almond cheesecake. Just yum.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "117419827797010678794", "name": "Alexis Cole", "time": 1577842700918, "rating": 5.0, "text": "Simply delicious & great service!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "104186522443230928568", "name": "Christina Smith", "time": 1590195093832, "rating": 5.0, "text": "Amazing Mexican pizza and chicken alfredo!!!! Definitely recommend!!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "107111329718779263956", "name": "Laura Lee", "time": 1563153878833, "rating": 4.0, "text": "Great local pizza place. It was a little tough to find, but well worth the hunt. We had bruschetta and a couple of pizzas. So delish!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "104523310528190262698", "name": "Patrick Robison", "time": 1467422019714, "rating": 1.0, "text": "Staying in downtown Mobile and hotel suggested this establishment.  Never got the opportunity to try the so called \"amazing\" food!  I'm sure it is good as it came highly recommended.  I would not spend one dime of my $$ in here as the owner is a complete jerk.  Servers were more than happy to help us with a party of 7, but the owner made us move the tables that the servers said to put together.  Now I didn't mind that and completely understood the issue but his attitude was terrible.  Told me there were plenty of other places to eat around there. Lol.\n\nOkay....we did and had an amazing dinner right down the street.  Maybe he was just having a bad day but don't think so...everyone seemed scared of him.  What an idiot!  Still sorry I didn't get to taste the food cause we did hear it was great.  Probably cause he's not cooking it.  Feedback given to hotel as well.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "100262499229704068397", "name": "James A. Mazzaro", "time": 1557269489281, "rating": 5.0, "text": "Tried the caprese salad, a meatball, and the pesto scampi pizza. The caprese was good, the tomato was the only weak spot. The meatball was very tasty, well complemented my the house marinara. The pizza was also top notch. Too bad I don’t live anywhere near here or I would definitely be a regular. Service by Melissa was exemplary.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "113924853721692964937", "name": "Jake Apperson", "time": 1497736473207, "rating": 5.0, "text": "Went on the advice of local hotel employee while we were in Mobile for the weekend. Could not have been happier with the place. The cafe area was a bit small but we were there before a rush started so we had a great table and view. Food was AMAZING!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114475293177187381233", "name": "Garrett C", "time": 1612679138081, "rating": 4.0, "text": "BEWARE: Current Google maps information is misleading. The website and a few of the images displayed are from another restaurant in California.\n\nWe went expecting something different, given the images presented on Google, so when we first arrived we were a bit confused, but decided to go with it anyway. No appetizers are offered, which is disappointing. Our service was friendly and our pizza was served quickly (within 15 minutes or so). We were both pretty impressed and would most likely return.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "101815115986833994897", "name": "Oscar Manuel Castillo Jimenez", "time": 1609984816795, "rating": 5.0, "text": "Best pizza ever!!!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "117419827797010678794", "name": "Alexis Cole", "time": 1577842700918, "rating": 5.0, "text": "Simply delicious & great service!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "110897260511527073601", "name": "Max D", "time": 1604797920907, "rating": 5.0, "text": "Pizza was excellent!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "104186522443230928568", "name": "Christina Smith", "time": 1590195093832, "rating": 5.0, "text": "Amazing Mexican pizza and chicken alfredo!!!! Definitely recommend!!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "111132383951483826460", "name": "Harvey Ozbirn", "time": 1578275425222, "rating": 5.0, "text": "One of the best pizzas I have eaten!  Geaux Cajuns!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "105944269475081334572", "name": "Kellyn Dickerson", "time": 1551507134624, "rating": 5.0, "text": "Every time I go here it's always great customer service, great prices, and amazing food. I highly recommend this for anyone looking for a local pizza place.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "105273728329061656498", "name": "Katherine Sprinkle", "time": 1569983089804, "rating": 4.0, "text": "Their calzones and breadsticks are awesome! I'm picky about my pasta, and didn't quite care for theirs. Quick service, great prices! One order of breadsticks is enough to fill me up (it's the size of a small pizza) and is less than $4 after tax.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "107108571377416496774", "name": "Dottie Byron", "time": 1548553305380, "rating": 5.0, "text": "Great pizza. Great atmosphere. Great place. If there's a wait, sit at the bar. It's worth it.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "100765595074689007818", "name": "John Sipperley", "time": 1507721651749, "rating": 5.0, "text": "So delicious. Friendly staff, but easily overwhelmed. So go when it is slow. I go at lunch and sit at the bar, typically alone with easy access to service.  But I can see this dropping stars, having watched the service to other tables. Fortunately, that has not yet been my experience.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "105221751399430388604", "name": "Matt Cobb", "time": 1566556750977, "rating": 5.0, "text": "The pasta, especially the carbonara, is very good and you get a lot of it. The pizza is very good as well.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "106374315726119971706", "name": "Nik Martin", "time": 1475533506241, "rating": 3.0, "text": "Good pizza, but there's a weird vibe in the restaurant, and previous reviews suggest it's due to the owner's personality. The staff is friendly, but act like they're scared to be too friendly or else they might get in trouble. It's like everyone is under a lot of stress, and it sort of transferred over to my party while we were there. We just couldn't get relaxed while we were there. They have an old school gas deck oven that turns out really good pizza, but it would honestly be 100% better without the stressful vibe we got while dining. Maybe the owner should step away and hire a manger to run the front-of-house, that has better customer service skills.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "103525854265991747455", "name": "Todd Fowler", "time": 1583449247648, "rating": 5.0, "text": "Cadillac Pizza and Carbonara Pasta are fantastic!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "118016917668418243226", "name": "Tabatha White", "time": 1512007764235, "rating": 5.0, "text": "The best pizza & pasta I have ever had every thing is made from scratch and to order. If you ever get a chance I promise you will love it!!!! The staff is very friendly and service was top notch!!! Will be back for sure!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "109940882487114795182", "name": "Mari Flores", "time": 1533553647434, "rating": 4.0, "text": "The food was good, especially the pasta dishes. They have large portions and great friendly service. I would eat there again.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "106720293272178531134", "name": "Jesse Jordan", "time": 1481507263564, "rating": 4.0, "text": "TBH the pizza was average, our large margarita was a little oily but did have good flavor. Crust was also very well done. Staff was quick with our order and had no shortage of great stories to tell. Not gonna find anything better downtown.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "112441212817693469546", "name": "Agent Phrosty", "time": 1506275188156, "rating": 5.0, "text": "Glad I didn't pay much attention to the one star reviews. Came to Mobile overnight to visit with a friend for his birthday. We walked in around 930 and we were promptly greeted and served drinks. Ordered the Cadillac pizza... Ten minutes tops from ordering to the table. Toppings were generous, crust and sauce both were very good. Never had to ask for refills. Would definitely recommend.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "115921304712025134749", "name": "Mike Baucom", "time": 1523679128855, "rating": 5.0, "text": "Went during Art Walk so it was packed as expected. Good food, \"hole in the wall' atmosphere, friendly staff. Will definitely go again.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "100268173890298723988", "name": "Kevin Henry", "time": 1593198295493, "rating": 5.0, "text": "My favorite pizza in Mobile comes from this restaurant.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "105273728329061656498", "name": "Katherine Sprinkle", "time": 1569983089804, "rating": 4.0, "text": "Their calzones and breadsticks are awesome! I'm picky about my pasta, and didn't quite care for theirs. Quick service, great prices! One order of breadsticks is enough to fill me up (it's the size of a small pizza) and is less than $4 after tax.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "102679344576173049621", "name": "Ashley Wiggin", "time": 1523054542932, "rating": 4.0, "text": "Amazing pizza! Some of the best crust I've had. Service was not so great on the other hand. Not very attentive.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "102727700502579894700", "name": "Marcus Tollens", "time": 1594554811859, "rating": 5.0, "text": "Really good pizza.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "118366094253402578020", "name": "Joe Carrizales", "time": 1505267103996, "rating": 4.0, "text": "I ordered take out. The pizza is good. Had a glass of wine while I waited. Ladies were friendly and awesome. I would definitely come back.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "105864784875518255948", "name": "Mike Keown", "time": 1539302568760, "rating": 5.0, "text": "Absolutely the best place we have eaten in a long time. Everything was excellent. Really glad we stopped here.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "101374883353486308976", "name": "Ryan Reiff", "time": 1562672328650, "rating": 1.0, "text": "Dropped our pizza. Only told us about it after the fact.  Pizza was ok, but dripping with grease....like the crust was wet with a slight crunch. So if you have a hour before you want to eat,  this place is for you.  Btw carryout your food  because the restaurant is like 200sqft, plus you'll actually get your pizza in a timely manner.\n\nOther fun fact: charges you a cc fee to pay them.\n\nOh one more thing if you walk there,  bums will ask you for money.\n\nTo sum it all up. If you want to wait to eat wet pizza ,pay extra, and feel like you're a  burden. Eat here.\n\nOh and I thing the manger hate kids.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "109670825457724231608", "name": "Sally Wood McDonald", "time": 1572462716525, "rating": 5.0, "text": "Wonderful service and delicious food;", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "115200175683311962434", "name": "Chris Golden", "time": 1568287005601, "rating": 5.0, "text": "Washed it down with some strawberry cake.  And get this.....with me and my party of 3 teenagers and 3 kids, we were only $7 more than my ChickFilA order.  Whereby my mobile app order crashed and burned for the ChickFilA option.  But that's another story.  And don't get me started on Subway nearby.  Dude!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "108102241231308281127", "name": "Kari Carlson", "time": 1544578927050, "rating": 3.0, "text": "Portion sizes are huge.  Greek salad was great.  Lunch service is a tad slow for getting your order or refilling your drink.   Food is very filling.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "110415316756983815323", "name": "Stephen Diamante", "time": 1577201110954, "rating": 3.0, "text": "Depends on the staff for what sort of expirence you will receive during your visit. Do not call in a pick up order because they will overcharge you for an incorrect order.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "108102241231308281127", "name": "Kari Carlson", "time": 1544578927050, "rating": 3.0, "text": "Portion sizes are huge.  Greek salad was great.  Lunch service is a tad slow for getting your order or refilling your drink.   Food is very filling.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "118366094253402578020", "name": "Joe Carrizales", "time": 1505267103996, "rating": 4.0, "text": "I ordered take out. The pizza is good. Had a glass of wine while I waited. Ladies were friendly and awesome. I would definitely come back.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "110415316756983815323", "name": "Stephen Diamante", "time": 1577201110954, "rating": 3.0, "text": "Depends on the staff for what sort of expirence you will receive during your visit. Do not call in a pick up order because they will overcharge you for an incorrect order.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "110728649179519603721", "name": "Matthew Prouty", "time": 1550358310381, "rating": 5.0, "text": "Incredible pasta, the chef does an incredible job, great service as well!  Best food I’ve had in Mobile and I’ve been here on several business trips.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "117801262450584330062", "name": "James Duke", "time": 1577853048903, "rating": 4.0, "text": "Excellent pizza in an intimate setting.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "113278505061175059254", "name": "Morris Maynard", "time": 1546115515783, "rating": 4.0, "text": "Very small. We spent $50 including tip for the two of us. The marinara sauce is wonderful.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "110126451300845229852", "name": "Samuel Miller", "time": 1593728801663, "rating": 5.0, "text": "Pizza and service was awesome!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "115798602463493408382", "name": "Deana Keefer", "time": 1563629990174, "rating": 3.0, "text": "Way too much food on small spaghetti plates. I assume some people like that.  Then my son got diarrhea right after eating there and my daughter in law got had heart burn.  Neither are usually sensitive to such stomach ailments.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "117447323389601157201", "name": "Jessie Mae", "time": 1564622099577, "rating": 2.0, "text": "Pizza had too much of a spice on it. I'm not sure what. It was a strange taste. Spaghetti lacked flavor. Kind of over priced for the quality you get.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "117767314069203615601", "name": "David Rawson", "time": 1558481646808, "rating": 5.0, "text": "Great pizza, excellent service,  and reasonably priced.   Definitely recommend and will be eating here again!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "104869134351028935961", "name": "Patrick Bone", "time": 1569289644794, "rating": 5.0, "text": "Fantastic pizza but phenomenal pasta.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "113278505061175059254", "name": "Morris Maynard", "time": 1546115515783, "rating": 4.0, "text": "Very small. We spent $50 including tip for the two of us. The marinara sauce is wonderful.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "108947728787066395367", "name": "Thomas Smith", "time": 1571687129080, "rating": 3.0, "text": "Not bad a little pricey considering the food isnt that good", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "116524493203298156790", "name": "Gijs Grob", "time": 1572388030896, "rating": 1.0, "text": "Cute little place with friendly staff, but poor food, hardly flavored. Ridiculously large portions. Hygiene seems issue. Food gave us indigestion afterwards.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "100188760392418547613", "name": "Kyle Davis", "time": 1525825037707, "rating": 5.0, "text": "Really good place. The food was great and the staff was nice. I will return.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "115798602463493408382", "name": "Deana Keefer", "time": 1563629990174, "rating": 3.0, "text": "Way too much food on small spaghetti plates. I assume some people like that.  Then my son got diarrhea right after eating there and my daughter in law got had heart burn.  Neither are usually sensitive to such stomach ailments.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "107033300236078411881", "name": "Aphry Olafsen", "time": 1540849050229, "rating": 5.0, "text": "We loved this place! Melissa was awesome! She chose our meal for us and it was spot on! We will be back!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "101208691379719434256", "name": "Mark Roche", "time": 1520133958189, "rating": 5.0, "text": "Great food and a good atmosphere... pizza was classic and delicious. The pasta was traditional with great flavors.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "112974551800154954989", "name": "Adam L. Davis", "time": 1529252391833, "rating": 4.0, "text": "Great place for kids. Not bad. Brick oven style pizza", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "103218651035287808301", "name": "Brian Wright", "time": 1551530754458, "rating": 5.0, "text": "Everything on the menu I have tried is delicious. Get there early because they are popular.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "107837245401289125673", "name": "alex poston", "time": 1565460837199, "rating": 5.0, "text": "Service wad awesome.  Friendly staff.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "110684132811538579833", "name": "Gail Jackson", "time": 1542413098044, "rating": 4.0, "text": "Tasty Shrimp Alfredo!   Ordered small portion.  Large enough for two to share.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "108704604255503553156", "name": "Jesse Almodovar", "time": 1517970240573, "rating": 4.0, "text": "Pizza and chicken Parm is really delicious and the Marinara sauce is also delicious. Price could be better being that a large is only a 14' pizza..I'm grim NY and over their a large is at least a 16 or 18. So if give them a 4 out of 5 because of that. Would not recommend to take a big family either as they don't have a lot of space to sit.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "101208691379719434256", "name": "Mark Roche", "time": 1520133958189, "rating": 5.0, "text": "Great food and a good atmosphere... pizza was classic and delicious. The pasta was traditional with great flavors.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "107154033526678035199", "name": "Carl Smith", "time": 1558301746950, "rating": 5.0, "text": "Very good pizza. Brusetta was the best", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "109492692692837948483", "name": "Noah Weitkemper", "time": 1562720930283, "rating": 1.0, "text": "Took well over an hour to get a cheese pizza and a bowl of fettuccine Alfredo with chicken.  After 40 minutes I asked the waitress if she forgot to drop my order to which she told me no and began to argue with me only to produce the receipts and show that she had waited almost 9 minutes to drop my order my problem was I paid when I ordered a to go order the owner showed up before my food came out and one of his regular customers that had been sitting at the bar the entire time I was waiting for my pizza told him that there was an issue with me. He comes over to find out what the issue is and I explained to him how it's been forever since I ordered a cheese pizza and a bowl of pasta for my kids that are in the hotel Room starving to which he apologized and went to ask the waitress what was going on. She whispered to him that I was being belligerent and rude even though that is entirely untrue the patron at the bar can attest to that. The owner then turned to me and explain to me how the customer is not always right as if I had been causing a problem to which I explained to him the only issue I've created was when I asked where my order was at no time was I ever belligerent and he should talk to people around to find out the truth before just blindly believing his head waitress. In the end he felt he should give me my money back I got my pizza the fed achenia turned out to be linguine the chicken was so overcooked it was in edible. The pizza was great the service was total  Krapp. The airconditioner in the front of the store is leaking water so much that they had to empty a picture and it was all over the floor entire time. There are plenty of other eateries around I would not waste my time here unless you are in absolutely no hurry at all whatsoever and there's no other customers in the restaurant.", "pics": null, "resp": {"time": 1563411709015, "text": "Yea Noah i did talk to the customer at the bar after you left. He told me a total different version than the one you told. You gotta admit you were acting way over the top about a ten minute dispute. More than one customer came up and said not to reprimand the server that it was you that was being rude and belligerent as soon as you came in. You got your order in a reasonable time. And I did comp it for you. Your reporting a leaking ac unit on a review? Really? It leaked for a couple hours and was repaired. Thanks Noah business is bustling, ac is fine."}, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "111781677382351390640", "name": "Paul Rondem", "time": 1555846785774, "rating": 5.0, "text": "Good pizza, cold beer and friendly folks.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "106760583060307350657", "name": "Jordan Carr", "time": 1559674957710, "rating": 5.0, "text": "Food was great, portions were larger than expected.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "109715157360291387197", "name": "Michael Funkhouser", "time": 1485377308772, "rating": 5.0, "text": "Great pizza and reasonable prices. Server was friendly and fast. They genuinely want you to enjoy your meal and enjoy your visit. Will visit again when in the downtown area.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114959948961256852597", "name": "mr mrs pettway", "time": 1563569541116, "rating": 5.0, "text": "Nothing like a fresh hand made pizza", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "105673293627003396651", "name": "Bart Daniel", "time": 1550100727693, "rating": 5.0, "text": "This is some of the best pizza I have ever enjoyed in my life!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "115248667795596496264", "name": "Dave M", "time": 1559531326609, "rating": 5.0, "text": "Excellent pizza ..nice portion salads and all at a really reasonable price!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "107033300236078411881", "name": "Aphry Olafsen", "time": 1540849050229, "rating": 5.0, "text": "We loved this place! Melissa was awesome! She chose our meal for us and it was spot on! We will be back!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "104353283977930906533", "name": "Autism Mom", "time": 1560978565233, "rating": 5.0, "text": "It is always a \"must go\" while in Mobile or on our way through to the beach. We absolutely love it!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "102728720746413157438", "name": "Casey Hughes", "time": 1563993318500, "rating": 5.0, "text": "Great food!  Service was slow but the food made up for it!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "112974551800154954989", "name": "Adam L. Davis", "time": 1529252391833, "rating": 4.0, "text": "Great place for kids. Not bad. Brick oven style pizza", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "115590341289816929472", "name": "Billy Gulledge", "time": 1564371656388, "rating": 2.0, "text": "Food and service was ok,but neither was worth the price paid for meal,or good enough to make me want to go back", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "113872659016823673584", "name": "Eric Trice", "time": 1562876941902, "rating": 4.0, "text": "Got takeout. Pizza was good with a good selection", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "113075900576243746117", "name": "Roy Austin", "time": 1562809988938, "rating": 5.0, "text": "Nice laid back place to have a drink a good pizza or pasta.  Friendly servers.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "102404306251810602222", "name": "George Leyva", "time": 1505092678803, "rating": 1.0, "text": "RUDE, very very disorganized. Badly run. I don't care how their pizza is because guess what I was unable to eat it. Besides they probably getting the business because they have no competition. I waited 1 hour for my pizza only to learn I got the wrong pizza. No apologies, NOTHING. They get easily overwhelmed. Run by a bunch of amateurs. Sad Mobile Alabama does not have other choices to give these clowns a run do their money. Go somewhere else if you can but whatever you do don't order from them if you see they are busy. They're gonna mess up your order.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "102728720746413157438", "name": "Casey Hughes", "time": 1563993318500, "rating": 5.0, "text": "Great food!  Service was slow but the food made up for it!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "104871473888434759242", "name": "jeremy johnson", "time": 1551319896744, "rating": 3.0, "text": "Food wasn't bad. Only 2 servers in the front of house. One must have been new.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "111643085594524971969", "name": "Justin Jay Wiley", "time": 1528421755499, "rating": 5.0, "text": "Absolute best service I have experienced in a long time. The server knew I just moved to Mobile earlier today and really welcomed me with attentive service, excellent food and overall caring attitude.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "113872659016823673584", "name": "Eric Trice", "time": 1562876941902, "rating": 4.0, "text": "Got takeout. Pizza was good with a good selection", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "113075900576243746117", "name": "Roy Austin", "time": 1562809988938, "rating": 5.0, "text": "Nice laid back place to have a drink a good pizza or pasta.  Friendly servers.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114959948961256852597", "name": "mr mrs pettway", "time": 1563569541116, "rating": 5.0, "text": "Nothing like a fresh hand made pizza", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "117008376623922713093", "name": "David Gray", "time": 1569157687618, "rating": 4.0, "text": "Awesome pizza in an authentic Italian pizzeria", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "118267580463531991346", "name": "Chuck Fuller", "time": 1565739387240, "rating": 4.0, "text": "Great \"little\" pizza place in Downtown Mobile", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "106080969867089273720", "name": "Jamelle Jones", "time": 1561202284541, "rating": 4.0, "text": "Great place when u have time to sit down and eat. Local artist paintings  are sold inside.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "100471948303276536707", "name": "Shannon Bender", "time": 1505093789914, "rating": 1.0, "text": "A note to the owner / manager:\n\nWe had a TERRIBLE experience at your establishment because of the awful service. Would give no stars if I could.\n\nWe came to Pizzeria Delphine on a Sunday evening based on the great reviews of your food, however we were not even able to try the food due to the horrible service we received, on top of the fact you made us the wrong pizza after we waited nearly an hour.\n\nWhen we arrived, it was clear that your restaurant was busy, and the three young girls you had as servers were CLEARLY OVERWHELMED and NOT PROPERLY TRAINED to handle more than a handful of tables.\n\nWe stood in front waiting for someone to acknowledge us, while your servers ran around stressed out, and a woman whom I assume was a manager sat behind the counter and was writing things down on a clipboard, and answering the phone - even though we had called three times prior to stopping by to place our to-go order and NO ONE ANSWERED THE PHONES.\n\nEventually, I stopped one of the servers on her way to a table and told her we want to place an order, she wrote it down in her notepad and then ran out the door to take care of other tables. Didn't ask for our name or number to call when it was ready.\n\nWe stood around for another 10 minutes waiting for her to come back so we could tell her to get our number to call us when it was ready. She told us it would be about 30 minutes and they would call.\n\nAlmost an hour later, we received no phone call and I had to call them to ask if it was ready, which they said it was.\n\nI walked back over from our hotel, paid for our pizza, only to find out when I opened the box (because they clearly didn't check it) that she had put the wrong order in for our pizza.\n\nAt that point we told them we just wanted a refund.\n\nWE RECEIVED NO APOLOGIES FROM YOUR INCOMPETENT AND UNTRAINED STAFF, JUST AN ATTITUDE.\n\nI don't care how good the pizza is, your service was awful.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "100154479353277578011", "name": "Mallorie Halsall", "time": 1580715613404, "rating": 5.0, "text": "Hands down, best pizza in Mobile.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "115545704603209643887", "name": "Lynne Cary", "time": 1518566516776, "rating": 5.0, "text": "Great cozy place. Food is very good.  We will be back.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "104725179912620411198", "name": "Sebastian Santiago", "time": 1515199966023, "rating": 5.0, "text": "Best pizza in town. Great atmosphere and affordable prices. Come in !", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "117008376623922713093", "name": "David Gray", "time": 1569157687618, "rating": 4.0, "text": "Awesome pizza in an authentic Italian pizzeria", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "117360094779820096579", "name": "Doris", "time": 1518645623810, "rating": 5.0, "text": "Their Calzones are delicious! Today my husband ordered a Stromboli. Oh my! So delicious! That's what I will order on our next visit.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "101121878000535473745", "name": "Stefan Stefan", "time": 1540172044208, "rating": 5.0, "text": "Great little Pizza and more place in downtown Mobile. Downtown Mobile is great", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "110563378301979179559", "name": "Burl Ratcliffe", "time": 1555873981835, "rating": 5.0, "text": "Great pizza, wonderful service, really good meatballs", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "104945829206091755131", "name": "Aaron Howard", "time": 1550199618465, "rating": 5.0, "text": "Amazing pizza, great service right in downtown Mobile.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "110384596276209341116", "name": "Clinton Hernandez", "time": 1553709200780, "rating": 5.0, "text": "Found this buzzy pizza place after a parade. Friendly atmosphere and good service. We had Linguine Bolognese and a pizza. The portions are huge so go for the small size. Generous pour of wine too. Recommended. During Mardi Gras we ate here 3 times. Once we got Pizzas to go while staying at the Hilton Garden Inn then dinner the next night and again a late lunch the next weekend before the MOT parade. The service is excellent.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "110280709542607870519", "name": "Clay Ponder", "time": 1524082874382, "rating": 5.0, "text": "Nice cozy place right down town. Good food and good service.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "110434302105376381189", "name": "A C", "time": 1543596539341, "rating": 5.0, "text": "Best pizza and PASTA place in downtown! Very kind and attentive staff also.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "101560897396308146426", "name": "Charles Benjamin Jr.", "time": 1550095242633, "rating": 5.0, "text": "Only one word for this place excellent awesome service awesome food friendly atmosphere excellent menu choices I will definitely be back", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "109727181575566373474", "name": "Courtney Bradford", "time": 1520361837496, "rating": 5.0, "text": "Omg I love there pizza's I can eat there jus about ever day 🍕🍕🍕🍕🍕👍🏾👍🏾👍🏾👍🏾👍🏾", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPOqMg7mrczDMSFshfVAln2kQunAC1ndKk-lj3T=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "101904756462640984486", "name": "Acelon The Myth", "time": 1515611237885, "rating": 5.0, "text": "Come hungry because the portion sizes are huge. Very tasty to boot. Will definitely be returning.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114150196619366918346", "name": "Payton Rogers", "time": 1553884619166, "rating": 4.0, "text": "Had the ham and sausage calzone which was absolutely delicious! Will for sure be coming back again.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "115829175405594112862", "name": "Frank Rubino", "time": 1507748470307, "rating": 4.0, "text": "Great service!  Pizza delicious!  We will return (from Fairhope).", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "110585187140426792859", "name": "James K Ball", "time": 1593905764760, "rating": 5.0, "text": "Best pizza in Mobile.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "112007088116775849620", "name": "Michael Waters", "time": 1532303787063, "rating": 5.0, "text": "Amazing pizza (we had pepperoni and also the Cadillac), Greek salad great, meatball delicious, great service from Kennedy! Definitely recommend it!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "115175108625647825517", "name": "Bob Fox", "time": 1513971690445, "rating": 1.0, "text": "I am staying at a local hotel on business with no transportation as we are transported to our events so I thought I would order something delivered. I called Delfina's and a rude young female answered. I told her I couldn't see her on line menu & she insisted it was there. When I asked her the cost of a small pizza delivered she told me they don't deliver even though the ad says different. When I asked her what the costs would be she said she didn't have a clue. Maybe she's got that right.\nToo many good restaurants in Mobile SO I'll not recommend & will find something else.", "pics": null, "resp": {"time": 1513981194600, "text": "Bob sorry about the confusion.  We do not deliver but we sub it out to people who do. They charge a small percentage and delivery charge. We do not know what your total will be after they include their fee. If you go to the Port City Delivery App or the WAITR App you will see the menus on there with the pricing. It's all gone high tech now days. We are only a couple of blocks from most of the hotels and you can call to p\nick it up and usually ready within twenty minutes. As far as the rudeness I apologize. This restaurant is very small and can get very loud. We have to speak loudly and have a difficult time hearing so it can be confused, HE. Thanks Bob"}, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "116066504305670641561", "name": "Kirsten Schwehm", "time": 1522870642816, "rating": 5.0, "text": "We ran through on the way from Florida to Baton Rouge - holy moley, that is authentic Italian food! We had pizza, pasta, and salads, and everything was fresh and delicious. The service was great and we were in and out quickly, thoigh everything was clearly cooked to order. The bathroom is tiny and ramshackle, but that could not diminish our enthusiasm!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "115333793176620544509", "name": "Tanisha Williams", "time": 1518277054377, "rating": 5.0, "text": "Finally made here and boy was it everything I thought it would be!!! It was packed due to  Mardi Gras and the service was friendly and fast!!! The pizza was delicious I couldn’t believe how good it was being from Pittsburgh were you have real Italians cooking your pizza I am very picky about my pie. But these guys blew me away I felt like I was home again!!! It’s a must try and I will be back more often to try other dishes they all looked amazing while I was there!!! But again the pizza was a hit!!!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "103379916983051590211", "name": "Zack TX", "time": 1553907824138, "rating": 5.0, "text": "Great pizza, good place for lunch, friendly stuff.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "106968121231666266257", "name": "Ben Sandefur", "time": 1539302641726, "rating": 5.0, "text": "Excellent pizza good crust good spaghetti and meatballs good service Medium priced", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "111022330045641941024", "name": "Sean Campbell", "time": 1545432823398, "rating": 5.0, "text": "The pizza was awesome and the beer was cold.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "105640913086161827763", "name": "Dennis Gentry II", "time": 1527022777699, "rating": 5.0, "text": "Amazing food, large portions and very friendly staff. Hidden jewel in downtown.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "100910271609467480038", "name": "Jordan Vallas", "time": 1485030814991, "rating": 4.0, "text": "Good freak from the usual pizza places around mobile. Pizza and calzones are great. Hard to find a place to park-but that's just downtown mobile life.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "117031560577958819098", "name": "Marie", "time": 1555078114234, "rating": 5.0, "text": "The food was really good, get the primavera! Yumm!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114667148851895428971", "name": "Roger Smith", "time": 1525301680548, "rating": 5.0, "text": "Excellent food.  Good service.  Good prices.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "118264274329891168442", "name": "Audrey Birkhimer", "time": 1456620627258, "rating": 5.0, "text": "The menu was more traditional Italian and the pizza was amazing! Staff was friendly and accommodating. Glad to see an independent pizza place downtown.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "109516770240497496667", "name": "Stan Martinez", "time": 1547958843905, "rating": 5.0, "text": "Great cozy type atmosphere with friendly staff, genuine attentiveness and fabulous background music and very well prepared tasty pizza.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "108455130439973005821", "name": "Stan Kline", "time": 1518438965106, "rating": 5.0, "text": "Excellent pizza at reasonable prices.   Would definitely recommend this restaurant", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "106968121231666266257", "name": "Ben Sandefur", "time": 1539302641726, "rating": 5.0, "text": "Excellent pizza good crust good spaghetti and meatballs good service Medium priced", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "103379916983051590211", "name": "Zack TX", "time": 1553907824138, "rating": 5.0, "text": "Great pizza, good place for lunch, friendly stuff.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114667148851895428971", "name": "Roger Smith", "time": 1525301680548, "rating": 5.0, "text": "Excellent food.  Good service.  Good prices.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "110729999062994457088", "name": "Debi Gould (mermaid)", "time": 1506135513970, "rating": 5.0, "text": "Great food truly delishous Italian flavor. One disappointed was no fresh parmigian cheese that could be graded at the table. Service was friendly and knowledgeable about the menu.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "106542339825886217699", "name": "Melanie Alexander", "time": 1532202907796, "rating": 5.0, "text": "Delicious! Everything we ordered was hot and fresh! They also serve large portions of their pasta.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "101052147292791797455", "name": "Becky Cunneen", "time": 1486137009872, "rating": 5.0, "text": "This place has amazing food and a very nice atmosphere. The nice lady who waited on us, was very attentive and knowledgeable about the menu.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "111022330045641941024", "name": "Sean Campbell", "time": 1545432823398, "rating": 5.0, "text": "The pizza was awesome and the beer was cold.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "109516770240497496667", "name": "Stan Martinez", "time": 1547958843905, "rating": 5.0, "text": "Great cozy type atmosphere with friendly staff, genuine attentiveness and fabulous background music and very well prepared tasty pizza.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "105403429688965079144", "name": "John Norris", "time": 1476012796404, "rating": 5.0, "text": "This place is really, really good. The Stromboli is delicious. Did I mention this place is good, and I mean really good?", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "113164688376614568450", "name": "Matt Davis", "time": 1526431573761, "rating": 4.0, "text": "Decent stromboli but great service", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOyobFwYGNGHJ2sjLPJ92Sli21PApevcevWWE9h=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "102364666093625181322", "name": "Emily Pierce", "time": 1535851342365, "rating": 5.0, "text": "My favorite place in downtown Mobile for some delicious pizza and wine!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "108455130439973005821", "name": "Stan Kline", "time": 1518438965106, "rating": 5.0, "text": "Excellent pizza at reasonable prices.   Would definitely recommend this restaurant", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "105613064768520765874", "name": "Justin Congo King NYC", "time": 1518068722132, "rating": 5.0, "text": "I'm a Mobile native and vocalist! I left here in 99' for college! I recently moved back home after 5 years in New Orleans!! Upon coming back home 6 months ago,  I was treated as an outsider in my own hometown ! I'm a street performer who will sing anywhere, and usually scoffed at while performing on daulphin St. ;however there are some Managers and business owners that welcome me to sing near their location!! I've never eaten here,as I'm a poor man who eats at home, but I do know that the Owner,  Management , and Staff are warm, friendly, and hospitable! THANKS GUYS FOR LENDING YOUR EARS AND BEING SUPPORTIVE DURING THIS VERY DIFFICULT TRANSITION!! LET'S SPREAD THIS ETHIC TO NOT ONLY DOWNTOWN MOBILE, BUT ALL OVER THE CITY OF MOBILE, BUT ALL OVER THE WORLD!!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "103972592489045427401", "name": "Mark Minnaert", "time": 1535774192789, "rating": 5.0, "text": "The quality of food and size of portions would be a deal at twice the price.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "106527719078979434388", "name": "Michael Jenkins", "time": 1535218298923, "rating": 4.0, "text": "Excellent food! Easy five stars if there was just more seating.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "112952816988238406538", "name": "Tyson Murray", "time": 1560639259756, "rating": 5.0, "text": "Great pizza and service", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "100900269292401716116", "name": "Ray Brown", "time": 1489969781049, "rating": 4.0, "text": "We enjoyed a pleasant meal.  The pizza was very good and staff were very friendly.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "113464487183882146281", "name": "Kera Barr", "time": 1539433836432, "rating": 5.0, "text": "Pizza was great, atmosphere was like \"hole in the wall\" very individual based.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "111535084427755825095", "name": "Jessica McGarvey", "time": 1522866965124, "rating": 5.0, "text": "Always great and staff very helpful when trying to find something new to read!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "105403429688965079144", "name": "John Norris", "time": 1476012796404, "rating": 5.0, "text": "This place is really, really good. The Stromboli is delicious. Did I mention this place is good, and I mean really good?", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "104393802226100652146", "name": "Larry Richardson", "time": 1534468877732, "rating": 5.0, "text": "Superb service and generous portions of excellently prepared food make this a winner.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "115890029105391679567", "name": "Miguel Davis", "time": 1526985547312, "rating": 5.0, "text": "This place definitely feels gourmet. The best pizza in Mobile.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "105780300257702065169", "name": "Jason Thompson", "time": 1534299264968, "rating": 4.0, "text": "Great pasta and meatballs. Quite cozy restaurant.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "108247117347079531585", "name": "J Michael Morse", "time": 1450317588246, "rating": 4.0, "text": "Excellent pizza!  And Kevin swears by the Fruitti de Mare.  My favorite servers Tia and Jenna always make sure we get real plates instead of paper plates.  No alcohol is served, but you are able to bring your own.  This is a \"must try\" place.  You won't be disappointed.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "110141244973972855186", "name": "Delta Nagy", "time": 1485045629180, "rating": 5.0, "text": "Amazing food and wonderful service!   An enjoyable experience for the whole family!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "101052147292791797455", "name": "Becky Cunneen", "time": 1486137009872, "rating": 5.0, "text": "This place has amazing food and a very nice atmosphere. The nice lady who waited on us, was very attentive and knowledgeable about the menu.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "102361869959131137191", "name": "Jeremy Sievers", "time": 1558927774554, "rating": 5.0, "text": "The best pizza in mobile....", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "102415742088138674369", "name": "Steven Jeter", "time": 1533729962324, "rating": 5.0, "text": "Great Food, Atmosphere and Staff.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "116369763641419013392", "name": "jeannie bowman", "time": 1554495471162, "rating": 5.0, "text": "All I can say is LOVE, LOVE LOVE IT!!! 20 STARS!!! THE BOWMAN'S", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "115858369966488504577", "name": "Floyd Bartholow", "time": 1522545064861, "rating": 5.0, "text": "Always good cold beer pizza is one of the best in town", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "102158058255098861877", "name": "Dick Whiting", "time": 1483898915481, "rating": 5.0, "text": "Great pasta. The Carbonara is the best I've had in years and the puttanesca is the truth. Lunch time salad and pasta will not leave you wanting more, great value.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "104373892059151075262", "name": "D Mab", "time": 1526471613826, "rating": 5.0, "text": "Great food and the owner seems to care about the customers.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "104942919840412208307", "name": "Michael Cooke", "time": 1535541536308, "rating": 5.0, "text": "Great food. Awesome homey atmosphere.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114931072673986531944", "name": "VickiB Pottery", "time": 1512344170732, "rating": 5.0, "text": "Been there several times and have never been disappointed!  I love their gluten free pizza!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "111547455301355096853", "name": "Kimberly Lombardi", "time": 1557269868862, "rating": 5.0, "text": "Delicious", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNe_TP9nSm9e8E74xqWPH09dCkcRlf0r2PW9aGa=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "117950984708898606480", "name": "George Davis", "time": 1517620110239, "rating": 5.0, "text": "My wife and I love this spot, this is now our favorite pizza place we go to for a special date!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "101382740786356474036", "name": "Dan Marlin", "time": 1527665786561, "rating": 5.0, "text": "Best italian in Mobile! Small tables but loved the food!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114845185270644972596", "name": "william myers", "time": 1484388678075, "rating": 5.0, "text": "Good portion and sauce on Pollo Vodka pasta and pizza cooked just right... Definitely one of best pizza places in Mobile.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "113981418460921337210", "name": "Roy White", "time": 1508418447839, "rating": 5.0, "text": "Great food and service for a pretty reasonable price.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "105902370314403270160", "name": "Jeff Furness", "time": 1536885697626, "rating": 5.0, "text": "Simple straight forward pasta and pizza.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "105234535038549468751", "name": "Robert", "time": 1527631930194, "rating": 5.0, "text": "Very friendly staff, fast service, and the pizza is very good.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "113042318575979560476", "name": "tcroshon70", "time": 1539870882366, "rating": 5.0, "text": "Great food at a reasonable price.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "105959746748290408850", "name": "Austin Moseley", "time": 1510412289800, "rating": 4.0, "text": "Classic hole in the wall with well crafted Italian classics. Good wine selection.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "102788253032539255566", "name": "John Nott", "time": 1492254602947, "rating": 4.0, "text": "Ameritalian, tasty generous portions. Adequately priced. Lots of locals.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "101382746117649119815", "name": "Wayde Wilkerson", "time": 1546831070873, "rating": 5.0, "text": "Fantastic Italian food. Wobbly furniture", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "117147943919985184071", "name": "Satyn Morris", "time": 1489592669642, "rating": 4.0, "text": "Great Pizza with tons of options - love being able to custom make my own :) Dining room is small and outside fills up quick, so get here early!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "107571446323285145705", "name": "Chris Wilcox", "time": 1514672795700, "rating": 5.0, "text": "Fabulous food!  Spent weekend in Mobile -ate here both nights for dinner.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "101270799900238531001", "name": "Lori Elkins", "time": 1499555723227, "rating": 5.0, "text": "The best Italian you will ever have this far from Green St. SF.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "101257866662704570913", "name": "Alex Page", "time": 1535504915118, "rating": 5.0, "text": "Very good pizza and pasta!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "116636002083380638278", "name": "Susan H.", "time": 1479513921369, "rating": 5.0, "text": "Had the meatball calzone!  It was delicious!  Service was excellent!Would highly recommend this place!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "103620041650046554296", "name": "Gerald Lewis (Gerry)", "time": 1491423627267, "rating": 5.0, "text": "Came in for lunch and had a great slice of pizza and a tasty salad.  Highly recommend the place to pizza in downtown Mobile.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "102018842829387880156", "name": "Eric Hansen", "time": 1536007510197, "rating": 5.0, "text": "Awesome pizza, best I've had in Mobile.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "101501874264309825616", "name": "David C. Smith", "time": 1535581779026, "rating": 5.0, "text": "Great place you will love it.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "112691803541871734297", "name": "MICHAEL FINK", "time": 1523656000899, "rating": 3.0, "text": "Pizza was really good. Got a small sized Parma and The Sausisa both were crispy and well flavored. Another had the shrimp Alfredo and loved it. The only disappoint was the chicken parm PO Boy, the problem was that they used the pizza dough to make the bread wrap and the grease from the chicken made it soggy. I just ate the chicken parm without much of the bread and I’d still come back for the pizza again.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "101335104631948649107", "name": "Michael Mears", "time": 1500341473975, "rating": 5.0, "text": "Service was excellent and the Carbonara was out of this world!! Definitely recommend!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "102134799527524077983", "name": "H Man", "time": 1502555055425, "rating": 4.0, "text": "Good pizza! Fast when you walk in and order to go.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "101441885134683993572", "name": "Thomas Berdeaux", "time": 1517524474080, "rating": 5.0, "text": "Outstanding my wife and I and a friend of ours had lunch there my wife had (pasta primavera)I had (linguini Bolognese)and our friend had(moofalatta) every thing was great if you like Italian you will love this place great food and friendly atmosphere.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "115120495874965641128", "name": "Jeremy Sievers", "time": 1534214597782, "rating": 5.0, "text": "The best Pizza in mobile Alabama definitely", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "104453241676424672934", "name": "Amanda B", "time": 1563837698920, "rating": 5.0, "text": "So good! So cheap!! Huge pizza with huge slices!!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "108488928719089581328", "name": "Katie Melissa Underwood", "time": 1460328820479, "rating": 5.0, "text": "I ordered the fettuccine Alfredo with shrimp and it is pretty amazing! They make theit pasta in house and it shines when indulging in this dish! This was my first time eating here and I will be back!!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "106570796232028122521", "name": "Munaf Patel", "time": 1488679782674, "rating": 4.0, "text": "Food was pretty good but the restaurant is too small and the layout does not flow. As a result its difficult to enjoy a meal.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "112951819814215192217", "name": "*Top Tier Predator*", "time": 1515049994125, "rating": 5.0, "text": "Ive had just about every pizza available in mobile county especially all the top rated pizza spots according to the online ratings & pizzeria delphina is the best ive had so far! After having my first slice of there pizza i dont see how pizza could get any better.. when i took my first bite it was unexplainable how heavenly it tasted.. i literally felt like i melted in my seat as i chewed on that scrumptious bite of heaven.   I love the fact that the pizza seems to be cooked in either a coal fire or wood fire brick oven as it gives the new york thin like crust a good crispy crust but yet not hard like a brick.. it was perfect & just the way i like it 😁 i never been to new york (home of the supposedly best pizza in the world) but it would be hard for me to believe they can can make a pizza any better than this.. its a little pricey but its well worth it whenever u got the money to spend.. do yourself a favor & stop by.. this is now my favorite pizza place of all time but i will continue to look & taste test other pizza places in near by areas & hopefully get to go to new york one day & test there pizza to see how it measures up ☺", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "104938123720500112652", "name": "Dempsey Parden", "time": 1523838046213, "rating": 5.0, "text": "Excellent pizza.  Great service.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "108991512255089767496", "name": "Rob Wilson", "time": 1501681878524, "rating": 3.0, "text": "Great food, sometimes the service is slow with low crowd.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "107399302883022617113", "name": "Luisa Diaz", "time": 1515120514250, "rating": 1.0, "text": "We ordered here through waitr horrible!! Salads were so old and gross, lettece was brown. I got the alfredo literally tasted like someone dumped pepper shaker in dish couldnt even eat it! So disappointed", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "116481476429082310619", "name": "Sofia Kulakowski", "time": 1517792644961, "rating": 4.0, "text": "Good food but not a true a carbonara.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "108890512484256190881", "name": "Jalexia Collins", "time": 1467589957145, "rating": 2.0, "text": "What is Caesar salad with remoulade sauce? So disappointed!! Pizza is yummy though!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "102086278892614051377", "name": "Melissa Scimeca", "time": 1564368402432, "rating": 5.0, "text": "Fantastic sausage pizza!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "111760293867405976565", "name": "Anne Will", "time": 1503796584440, "rating": 4.0, "text": "The pizza is thin crust and great!  We also love the Linguini con Vongole!!   Our go to order almost everytime!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "116481476429082310619", "name": "Sofia Kulakowski", "time": 1517792644961, "rating": 4.0, "text": "Good food but not a true a carbonara.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "111760293867405976565", "name": "Anne Will", "time": 1503796584440, "rating": 4.0, "text": "The pizza is thin crust and great!  We also love the Linguini con Vongole!!   Our go to order almost everytime!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "100045409794374878756", "name": "Niall Campbell", "time": 1576384584826, "rating": 3.0, "text": "Food was a solid 4 service was a barely  2.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "104938123720500112652", "name": "Dempsey Parden", "time": 1523838046213, "rating": 5.0, "text": "Excellent pizza.  Great service.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "117330513776910338060", "name": "George Heubach", "time": 1553943970925, "rating": 5.0, "text": "Great, authentic Italian, right in Downtown Mobile!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "107399302883022617113", "name": "Luisa Diaz", "time": 1515120514250, "rating": 1.0, "text": "We ordered here through waitr horrible!! Salads were so old and gross, lettece was brown. I got the alfredo literally tasted like someone dumped pepper shaker in dish couldnt even eat it! So disappointed", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114437612511369844938", "name": "Brian Scott", "time": 1531878969774, "rating": 4.0, "text": "Pretty good food, large portions", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "110489487804582499350", "name": "Lee Walker", "time": 1465154990229, "rating": 5.0, "text": "We are so picky about restaurants.   We did not expect much but we had hopes.  Now this is the first place we eat in Mobile.  Fettucini Alfredo was scratch made,  smooth and just right.  Guanciali!  The pizza ws even better.  Crust was magic.  Go nowhere else.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "105570853927587636129", "name": "Michael M", "time": 1513025650150, "rating": 4.0, "text": "Outstanding food with very good service.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "112469518923017643005", "name": "Juniper Harp", "time": 1523983155949, "rating": 5.0, "text": "Great pizza and meatballs, cozy atmosphere. Can get crowded,  but the staff is always nice.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114838915610210363267", "name": "Wendy James", "time": 1504311925778, "rating": 5.0, "text": "Simply delicious. Service excellent too.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "100789836420125177670", "name": "Rachel Barnes", "time": 1567817422935, "rating": 5.0, "text": "The pizza was so good!!!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "113131429627516631289", "name": "J Jones", "time": 1479300939387, "rating": 5.0, "text": "Great service!!! Calzones are delicious!!! Massive portions, all of us needed carry out boxes", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "109767573049540850410", "name": "Damien S C", "time": 1516342796452, "rating": 5.0, "text": "I ordered Spaghett then went to bathroom and came back and somebody touched my spaghett!!!  Who toucha my spaghett!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "108772348460418413297", "name": "P. T.", "time": 1541735590352, "rating": 5.0, "text": "Great pizza and worth the wait.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "116029370038475983431", "name": "Big Deals Inc", "time": 1505093792693, "rating": 1.0, "text": "With the service they provided my and my girlfriend THEY DESERVE TO GO OUT BUSINESS. These amateurs are easily overwhelmed and will waste your time waiting for food that will be wrong when it arrives. STAYYYY FARRRR AWAYYYYYY - DONT EAT HERE.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "100045409794374878756", "name": "Niall Campbell", "time": 1576384584826, "rating": 3.0, "text": "Food was a solid 4 service was a barely  2.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114484933603323863964", "name": "Michelle Middleton", "time": 1570305947104, "rating": 5.0, "text": "Authentic & reasonable.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "113787714331578781707", "name": "Tom Byrne", "time": 1528425272122, "rating": 4.0, "text": "Excellent food and service.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "109592768562925988304", "name": "Candace Smith", "time": 1471215381154, "rating": 5.0, "text": "Best Ceasar Salad ever!  Pizza is amazing too!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "100271443291519475830", "name": "Leigh Wright", "time": 1490802122904, "rating": 5.0, "text": "First, the food is DELICIOUS!!!  Fairly priced, good lunch specials.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "115593735437638100851", "name": "charles kelley", "time": 1509216262993, "rating": 5.0, "text": "Great friendly service and the food is great!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "102140527094795265447", "name": "Wilbur Bourque", "time": 1499693816919, "rating": 2.0, "text": "My Wife, 11 month old son and I went to this pizzeria on July 9, 2017. Our waitress was horrible.  After getting my wife and I drinks (forgot my sons water) we waited 20 minutes for her to come back to take our order. At the point we remind her that we still didn't have our son's drink.  Thhen finally after a 3rd time of reminding her she came back with his water.  Then to wrap up the evening we had to walk up to the to her to pay our bill because trying to flag her down wasn't working. Worest service ive had in a really long time. The only good thing about our experience was the food was really good.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "104299120491824802875", "name": "Taylor D", "time": 1510634721818, "rating": 5.0, "text": "Pizza was fantastic and the service was fast and friendly", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "115456278350109820792", "name": "Rodney Moody", "time": 1484335150382, "rating": 3.0, "text": "Good pizza, little on the pricey side, at least for lunch.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "106850287889733165538", "name": "James Kelley", "time": 1533108448029, "rating": 3.0, "text": "Nice atmosphere. Good salsa, but stingy with the pizza toppings.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "105324794866184346270", "name": "Seb Cube", "time": 1506818984708, "rating": 4.0, "text": "Good food, Good time, small yet nice.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "118286006954535119299", "name": "Homebody Todd", "time": 1505425259433, "rating": 5.0, "text": "Very good , I enjoy pizza that doesn't taste like the frozen or delivery kind ... I seen people give it bad reviews becuase of the staff , I didn't have any problems . If your friendly then they are friendly back .... Pizza was good me and the wife shared a small pepperoni ....", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "101227488057525319676", "name": "Marina Howard", "time": 1487888320371, "rating": 5.0, "text": "Absolutely wonderful food and most courteous staff", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "110017328529270586164", "name": "Doug Bounds", "time": 1531463130230, "rating": 5.0, "text": "The best pizza in Mobile. Go eat there.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "104346204747068276363", "name": "John Goldman", "time": 1528248815274, "rating": 4.0, "text": "Good food, friendly staff, but the service is slow. I would return.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "107639462143264666182", "name": "Paul Roush", "time": 1489796526166, "rating": 4.0, "text": "Good pizza (sauce just slightly too spicy for my taste), and great service!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "103259429559097563424", "name": "Melissa Paterson", "time": 1503801667661, "rating": 4.0, "text": "We ordered the Caprese, the mozzarella so tough not worth the money. The stromboli and ranch however was absolutely delicious.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "116862063985604478122", "name": "Pervin Toksoy", "time": 1554039357527, "rating": 1.0, "text": "its a disgrace in all aspects of customer service...i am surprised they stay in business...don't waste your money!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "113553702080959239553", "name": "Scott Lisman", "time": 1511666517797, "rating": 4.0, "text": "Good food, great service.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "105845616086942748524", "name": "Jennifer Williams-Artis", "time": 1503781409767, "rating": 5.0, "text": "Great Food in abundance very friendly staff cozy comfy welcoming environment....me and my honey enjoyed each other and cool conversation with some  folks nitelife downtown Mobile", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "109212115751579111017", "name": "Bob Weichert", "time": 1500399592119, "rating": 4.0, "text": "Get there early if you want a seat. Excellent marinara sauce", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "101005376221033616237", "name": "Megan Bolton", "time": 1551195291370, "rating": 3.0, "text": "Could've been better", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "102147349781167367764", "name": "Sarah Dixon", "time": 1520702902710, "rating": 5.0, "text": "Blow away the the flavors!!! New favorite place in Mobile for sure.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "106664050763662249167", "name": "Kevin Mayfield", "time": 1455487687362, "rating": 5.0, "text": "Delicious pizza and friendly attentive staff.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "109619675205096985804", "name": "Nghia Huynh", "time": 1511150965701, "rating": 5.0, "text": "The service is so so. But the food is phenomenal and is worth the wait.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "107881383290450368537", "name": "Alex Flores", "time": 1550111944318, "rating": 5.0, "text": "Pretty good pizza.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "112873003229317684832", "name": "Greta Swain", "time": 1563586704274, "rating": 5.0, "text": "Delicious pizza.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "113068850519848421320", "name": "Vickie Knowles", "time": 1546997013664, "rating": 5.0, "text": "This pizza was delicious.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "106047109450065270647", "name": "Tiffany Ingram", "time": 1482261508189, "rating": 4.0, "text": "Waitress was kind, and food is always great!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "103760954697882848529", "name": "DJ SPS", "time": 1494341571277, "rating": 5.0, "text": "Friendly staff , and delicious pizza!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "106790255602711666448", "name": "Shane Box", "time": 1564808250386, "rating": 5.0, "text": "Best Italian restaurant in Mobile", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "112443476852837498495", "name": "Craig Bendlin", "time": 1503796689683, "rating": 5.0, "text": "Pizza and service was outstanding !", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "116012447336406367947", "name": "APO", "time": 1563939713901, "rating": 5.0, "text": "Awesome pizza.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "116206344452823548382", "name": "Omegawylo", "time": 1571244100768, "rating": 5.0, "text": "A place for true paisanos", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "103760954697882848529", "name": "DJ SPS", "time": 1494341571277, "rating": 5.0, "text": "Friendly staff , and delicious pizza!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "112443476852837498495", "name": "Craig Bendlin", "time": 1503796689683, "rating": 5.0, "text": "Pizza and service was outstanding !", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "109665539949181201334", "name": "Ali Zeidan", "time": 1489991922367, "rating": 5.0, "text": "Friendly staff even on a busy night. Food was excellent.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "101132207313390861807", "name": "Parker McGee", "time": 1505699812284, "rating": 5.0, "text": "Great food, excellent server", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "115543446481728662300", "name": "George L.", "time": 1505093541902, "rating": 1.0, "text": "Jezz how do they stay in business? Lack of service and attitudes seems to be the norm here. Don't eat here, take your hard earned money somewhere else.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "112548166136209641570", "name": "George Killingsworth", "time": 1558802890256, "rating": 4.0, "text": "Pizza was great.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "109856537115086544445", "name": "Dan M", "time": 1446246137368, "rating": 5.0, "text": "Friendly staff, great pizza. Open late!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "109777657645672403187", "name": "Robert Kearley", "time": 1487545596819, "rating": 5.0, "text": "Awesome food and service...!!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "100510828604216853854", "name": "Tina Lowery", "time": 1528999463743, "rating": 4.0, "text": "Delicious Pizza, pairs great with wine", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "109785634870851990685", "name": "Dawn Russell", "time": 1464473594936, "rating": 5.0, "text": "Friendly staff awesome food!!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "109891900810294335268", "name": "Strange Rebell", "time": 1467416972259, "rating": 5.0, "text": "Amazing meatballs and pizza was incredible😬", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114397153894983130094", "name": "R Divia", "time": 1551011067822, "rating": 1.0, "text": "I paid 38.45 for two pizzas an wasn't allowed to sit down an wait was ask to stand", "pics": null, "resp": {"time": 1552256667726, "text": "Sorry Boo. It happens every year during Mardi Gras and Convention season. We have a long wait list of families and customers that wait for up to an hour to set. They wander until we call them to an available table. They get very angry at a us and when a togo customer comes up and grab tables that they have been waiting for. Wish we could accomodate everyone but there is a method to the madness."}, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "117656247919350939465", "name": "Joe Hudson", "time": 1448420813961, "rating": 5.0, "text": "The pasta and pizza are both molto bene!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "107025865385062434011", "name": "Michael Shelby", "time": 1495942106719, "rating": 4.0, "text": "Good food and pizza.  Can get loud.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "101328404061164027093", "name": "Edward Lawson", "time": 1583714575693, "rating": 5.0, "text": "Great food", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "117518467517528142474", "name": "kristen m.", "time": 1477408958184, "rating": 4.0, "text": "Love the pizza, music, & service!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "102252070067795064662", "name": "Shannon Brown", "time": 1528214247649, "rating": 1.0, "text": "Service was super slow and there's something funny tasting in the sauce.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "108925809401260461951", "name": "Lloyd Heard", "time": 1532725810000, "rating": 5.0, "text": "The stromboli add anchovies for lunch is out of sight!  Small joint but food is always scratch made and hot.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "108404405049088548882", "name": "Patrick McAteer", "time": 1554119090192, "rating": 4.0, "text": "Tasty pizza", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114870973356180142371", "name": "Melissa Collier", "time": 1557278326592, "rating": 5.0, "text": "Pizza is awesome!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "103793329771609106670", "name": "Peter Kobak", "time": 1486843924659, "rating": 5.0, "text": "Small simple pizza dive that makes quality pizza by hand. Ok selection of beer.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "113976400146835667293", "name": "drdj2011", "time": 1594948726990, "rating": 5.0, "text": "Just amazing!!!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114586937723062175549", "name": "Christine Acomb", "time": 1561166988909, "rating": 5.0, "text": "Great food!!!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "103835511732809696359", "name": "Janet Evett", "time": 1525978321684, "rating": 4.0, "text": "Great pizza and salad", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "115275678136594205380", "name": "Shane Bell", "time": 1550987073972, "rating": 5.0, "text": "Best pizza!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "109380752885707057082", "name": "Alan Breland", "time": 1539910700724, "rating": 4.0, "text": "Very good.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "105004436744939350810", "name": "Lance Bowyer", "time": 1582486644578, "rating": 5.0, "text": "Best pizza in Mobile", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114198356151350801622", "name": "carolyn saviak", "time": 1550978682136, "rating": 5.0, "text": "Delicious food!!!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114836111299113572708", "name": "Denise Hall", "time": 1567892555009, "rating": 5.0, "text": "Love their food!!!!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "102093658423959815872", "name": "Amanda Wigley", "time": 1501431208831, "rating": 5.0, "text": "Yum! Hole in the wall. Drove by it 3 times and , walked by it before we actually found it. This hidden gem is worth the hunt!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "106559222490178782562", "name": "Kristen Roberts", "time": 1563998891763, "rating": 5.0, "text": "Great food!!!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "105734069672345753321", "name": "John Butterworth", "time": 1551748013048, "rating": 5.0, "text": "Awesome pie!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "108848425929892270304", "name": "Dena Amison-Middleton", "time": 1580161350803, "rating": 5.0, "text": "Love it", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "104257379236106887417", "name": "Bryan Jesse", "time": 1544457116597, "rating": 5.0, "text": "Great food!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "115411883368680641064", "name": "Alex Bow", "time": 1533510765457, "rating": 5.0, "text": "Darn good pizza.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "110830083969039473817", "name": "Renee Colby", "time": 1521484083473, "rating": 5.0, "text": "The food is Great!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "105737964169247253119", "name": "William Hamann", "time": 1528073270752, "rating": 5.0, "text": "Cadillac pizza was the best!!!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "106898617061755349280", "name": "Robby Field", "time": 1536287681646, "rating": 5.0, "text": "Pasta, pizza.......it all rocks!!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "113314381489438820169", "name": "Michael Mize", "time": 1544559704140, "rating": 4.0, "text": "A decent slice", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "103945256579787378380", "name": "Gloria Fako", "time": 1537137947698, "rating": 5.0, "text": "Best pizza in town", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "112430052893502807831", "name": "Micaela Weldon", "time": 1540041512567, "rating": 5.0, "text": "Best pizza ever", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "100563539639026289574", "name": "Chris Todd", "time": 1533328189418, "rating": 5.0, "text": "Great food.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "108091965125068945084", "name": "Stewart Hawley", "time": 1520877487734, "rating": 4.0, "text": "Great tasty pizza and services", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "107878457420236925258", "name": "Debra Bell", "time": 1554158287906, "rating": 5.0, "text": "Best pizza in Mobile!!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "102499217932175367131", "name": "Scott Thomas", "time": 1534386530903, "rating": 4.0, "text": "Great meatballs and spaghetti", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "112434801452116673459", "name": "Tammye Clark", "time": 1550485557513, "rating": 5.0, "text": "Good Italian!!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "108031763720940793017", "name": "Cornelius Franklin", "time": 1556911099378, "rating": 4.0, "text": "👌👌👌👌", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "106522919696753850976", "name": "Michael Bass", "time": 1534883468292, "rating": 5.0, "text": "Yip great", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "112541055454757476946", "name": "Kayla Trotter", "time": 1519544085013, "rating": 5.0, "text": "Tasty!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "105404018780444310361", "name": "Matthew Windham", "time": 1519525000727, "rating": 5.0, "text": "I got fat.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "117180151665665005258", "name": "Flavio Dias", "time": 1543544313279, "rating": 5.0, "text": "Delicious Alfredo sauce", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "106055244613571070453", "name": "Erma Mcmichael", "time": 1545451783548, "rating": 5.0, "text": "Excellent food", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "109022925180291793060", "name": "Paul Douglas", "time": 1536797663932, "rating": 5.0, "text": "Local gem. Don't miss it!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "116959879787651941494", "name": "Danette Goss", "time": 1502018129374, "rating": 4.0, "text": "Pretty good pizza.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "115728510914811849585", "name": "Steve Merry", "time": 1510885493000, "rating": 5.0, "text": "Good food", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "101522519529597014238", "name": "Mary Mcd", "time": 1515935958269, "rating": 4.0, "text": "Good pizza; indifferent service", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "103067280062003932732", "name": "Chad kiper", "time": 1511765647000, "rating": 5.0, "text": "One of our favorite places", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "112477904716404056827", "name": "mark gilbertson", "time": 1508356406901, "rating": 5.0, "text": "Spectacular", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "102577818131408914654", "name": "Denise Wallace", "time": 1524160133552, "rating": 5.0, "text": "Delicious pasta!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "115999648575956279669", "name": "kenneth knight", "time": 1506797582953, "rating": 5.0, "text": "Awesome Italian food", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "105764090733948005269", "name": "Merideth Landry", "time": 1517167302931, "rating": 5.0, "text": "Great pizza!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "104109286700198569531", "name": "Michael Looney", "time": 1500379813983, "rating": 5.0, "text": "Best pasta ever!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "107911269810420483884", "name": "Dave Baggott", "time": 1500582058951, "rating": 5.0, "text": "Fast good pizza.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "101039892370318643570", "name": "Yolanda B", "time": 1497761965716, "rating": 4.0, "text": "Great food", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "104030726574986012410", "name": "Chris On the Fly", "time": 1494432327126, "rating": 5.0, "text": "Great food", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114504940162093560239", "name": "Tammy Anderson", "time": 1491924660042, "rating": 5.0, "text": "Excellent food and prices!!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "106435090699370075839", "name": "Wendy James", "time": 1508701519592, "rating": 5.0, "text": "LOVE the pizza!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "107208434294805337074", "name": "Beth Redd", "time": 1486608596362, "rating": 5.0, "text": "My favorite restaurant in town", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "100266213523336242280", "name": "Travis Meeuwsen", "time": 1485869429414, "rating": 5.0, "text": "Good food", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "113287676949448499221", "name": "Diana Moorer", "time": 1502595172727, "rating": 1.0, "text": "Closed early because of \"season\" by a whole hour!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "106370486288121896987", "name": "Granny Clampett", "time": 1502641171499, "rating": 5.0, "text": "AWESOME", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "103879236046290928553", "name": "Edward Flotte", "time": 1479908634215, "rating": 5.0, "text": "Great pizza", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "109729194988160618411", "name": "Jay Jones", "time": 1479657203491, "rating": 4.0, "text": "Excellent pizza!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "102700348666604579959", "name": "Mark Heisel", "time": 1479648594733, "rating": 5.0, "text": "Excellent pizza", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "116407098451524965650", "name": "Anne Herbert", "time": 1478743263196, "rating": 5.0, "text": "Simply wonderful.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "113982321132038329790", "name": "Art For", "time": 1471809050629, "rating": 5.0, "text": "Yummy  yummy !", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "110972851276658221250", "name": "Khris L'Orange", "time": 1486756555643, "rating": 5.0, "text": "Fabulous", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "105156372667306425204", "name": "Candace Stout", "time": 1460938678679, "rating": 5.0, "text": "Great pizza", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "114463170870217857421", "name": "Heather Holland", "time": 1488030260829, "rating": 5.0, "text": "Amazing pizza and pasta!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "100578557417853654914", "name": "Adalberto Gomes Macedo Filho", "time": 1561849540176, "rating": 5.0, "text": "(Translated by Google) Simple, historic and welcoming place. Great prices. Wonderful pizza, European style.\n\n(Original)\nLugar simples, histórico e acolhedor. Ótimos preços. Pizza maravilhosa, ao estilo europeu.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPVKBAtsGIaeIBgTUGlmX7UYHHVIU-BBjuJNICb=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN55TAjP4Qe12-_83tWzhbfUcIl7FlwqdbSjQOq=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "105735835011113721305", "name": "Erwin Blattmann", "time": 1577452605454, "rating": 5.0, "text": "(Translated by Google) Delicious and nice people 👍 would go again.\n\n(Original)\nSehr lecker und nette Leute 👍 würde wieder gehen.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "107905149356726130271", "name": "BigPapa Briggs", "time": 1566869611228, "rating": 4.0, "text": "(Translated by Google) Luv me some Pasta Fruiti del Mar\n\n(Original)\nLuv me some Pasta Fruiti del Mar", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "105360966705223371106", "name": "Randall Mora Naranjo", "time": 1555456251302, "rating": 5.0, "text": "(Translated by Google) Excellent food, very good service, affordable prices. Generous portions\n\n(Original)\nExcelente comida, muy buena atención, precios accesibles. Porciones generosas", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "102491889899178166637", "name": "Mavelyz Colon", "time": 1532902033901, "rating": 5.0, "text": "(Translated by Google) The food is delicious, good prices and the staff is very friendly. I recommend it 100%\n\n(Original)\nLa comida es deliciosa, buenos precios y el personal es muy amable. Lo recomiendo 100%", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "102577468023181599744", "name": "Francesca Nixon", "time": 1498185225655, "rating": 5.0, "text": "(Translated by Google) I'm italian!! The food was delicious! I like it to death! Alora, English :: outstanding Pizza even fresh garlic It was to die for !!\n\n(Original)\nSono Italiana!! Il cibo era delicioso! Mi piace da morire!  Alora, English:: outstanding Pizza even fresh garlic It was to die for!!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "112978780818844172077", "name": "Moreno Damiani", "time": 1571761447335, "rating": 4.0, "text": "(Translated by Google) All top notch\n\n(Original)\nTutto di prima qualità", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "118304209745978425005", "name": "Joe Chudson", "time": 1512351994727, "rating": 5.0, "text": "(Translated by Google) Toilet flushes many well!\n\n(Original)\nToilet flushes molte bene!", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "101846734281649550363", "name": "Nazujo Acevedo", "time": 1542095699030, "rating": 5.0, "text": "(Translated by Google) Very good service and delicious pizas.\n\n(Original)\nMuy bien servicio y las pizas deliciosas.", "pics": null, "resp": null, "gmap_id": "0x889a4fd7562089b5:0x177315578d833c37"}
{"user_id": "107534829695821464947", "name": "Blake Whitt", "time": 1612994010090, "rating": 3.0, "text": "I honestly loved this coffee the first three weeks of them being open. But the last few times I’ve ordered a cold brew(which has been incredible in the past), I have received what I assume is nitro cold brew, but it tasted like club soda mixed with a funky coffee taste. Hopefully they figure out that something has changed and the cold brew does not actually taste like cold brew.", "pics": null, "resp": null, "gmap_id": "0x88628be98c62265f:0x47a7a7331aaa4ea0"}
{"user_id": "105837765261917273767", "name": "Bobby Lovell", "time": 1617408638333, "rating": 1.0, "text": "Talk slow when you order.  Workers don’t seem to be trained or supervised. I discussed with the supervisor. Let’s see if they improve.", "pics": null, "resp": null, "gmap_id": "0x88628be98c62265f:0x47a7a7331aaa4ea0"}
{"user_id": "100831439504943715960", "name": "GARRY BARKSDALE", "time": 1618146716390, "rating": 5.0, "text": "I had a Iced Coffee with a couple of extra shots this morning. It is wonderful..", "pics": null, "resp": null, "gmap_id": "0x88628be98c62265f:0x47a7a7331aaa4ea0"}
{"user_id": "102514169689003086510", "name": "Nicole Cecil", "time": 1613503138280, "rating": 5.0, "text": "For a chain it's not bad coffee I enjoy the people who work there!", "pics": null, "resp": null, "gmap_id": "0x88628be98c62265f:0x47a7a7331aaa4ea0"}
{"user_id": "107038279217923010614", "name": "Rachel G", "time": 1622495424663, "rating": 5.0, "text": "Great coffee and the employees are so nice!", "pics": null, "resp": null, "gmap_id": "0x88628be98c62265f:0x47a7a7331aaa4ea0"}
{"user_id": "113670748896581145755", "name": "Amanda Thomas", "time": 1611586715585, "rating": 5.0, "text": "My new FAVORITE coffee shop!!!!... friendly, time efficient, and most importantly the ☕ is fabulous ☺️", "pics": null, "resp": null, "gmap_id": "0x88628be98c62265f:0x47a7a7331aaa4ea0"}
{"user_id": "104403815684480362158", "name": "Jean", "time": 1610116081707, "rating": 3.0, "text": "This place is convenient being right off 72, but no one working there knows how to do T-Debit and it's very frustrating. The other one in Madison never has issues with it.", "pics": null, "resp": null, "gmap_id": "0x88628be98c62265f:0x47a7a7331aaa4ea0"}
{"user_id": "103174449751555282526", "name": "Sendero7mm", "time": 1611264128452, "rating": 5.0, "text": "Always nice, coffee and sandwich was good as well", "pics": null, "resp": null, "gmap_id": "0x88628be98c62265f:0x47a7a7331aaa4ea0"}
{"user_id": "107616924329134090353", "name": "Kristian Campbell", "time": 1624132838474, "rating": 3.0, "text": "Well I decide to go try this coffee out. Ask over 3 times for regular coffee. Guy proceeds to tell me it take 7 mins. Well isnt that your job?? Anyways i didn't get coffee I had to drink the coffee with caramel in it after telling him 3 times I want regular coffee I won't be back! He needs another job obviously! I told him 5 times i didn't like caramel as well! That might be why your drive thru is empty!", "pics": null, "resp": null, "gmap_id": "0x88628be98c62265f:0x47a7a7331aaa4ea0"}
{"user_id": "100475775784160123580", "name": "Doug Johnson", "time": 1624123450199, "rating": 5.0, "text": "Great coffee and far far better than Starbucks. I just wish there was one closer by instead of driving from Madison to Athens!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMGnCtNV_zGTP08M--mHthwid026t--5TAGZK3r=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMmGi05xjt2sXjhdIk6PMdi7jwn8VLIRIAcWskD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPq29ChXyek2Lzo8Osc0VNo1Ldg3e8BrDvOLadJ=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88628be98c62265f:0x47a7a7331aaa4ea0"}
