{"user_id": "103634446793194902846", "name": "JENNY GOSS DE SOUZA", "time": 1610817673178, "rating": 5.0, "text": "Kenan is trustworthy, reasonable and prompt. Here is what we like:\n1. He has a website - good for us people from out of town during the Pandemic\n2. He does what he says and makes helpful suggestions\n3. He cares\n4. One grave needed the death etched - it was perfect AND he applied a treatment that would self-clean within 5 months\n5. Another grave needed a tombstone uprighted. Unbeknownst to us, someone had done the job but badly. Kenan re-did it by shoring up the foundation and worked on the adjoining one beside it.\n6. He takes pictures and texts his work back to his clients.\nWe have worked with him twice and will do so for a third time (soon). You will not regret it.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP8dU02QFgU0TqsQ7p5H0nVPyGmE1MrObdJoHBO=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNDqRspnKuUmOaxWLa-47LOJt5X1Wyqbo5ZI9ZT=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889e67df8540ae5:0xe0f129a057ef25f"}
{"user_id": "112018369019282045616", "name": "Jessica Mckinney", "time": 1611216739936, "rating": 5.0, "text": "Kenan was so helpful and kind! My dad's stone is perfect and my family couldn't be happier. The price was extremely reasonable & everything was done quickly. Could not recommend more!!", "pics": null, "resp": null, "gmap_id": "0x8889e67df8540ae5:0xe0f129a057ef25f"}
{"user_id": "107875303789374973184", "name": "Rachel Hill", "time": 1594398645766, "rating": 5.0, "text": "Kenan was very responsive and good about keeping me updated on the progress of my mother's stone. He's very personable and tries to ensure you're happy with the final product. The stone looks great and my family is so happy with it. I would definitely recommend his services!!", "pics": null, "resp": null, "gmap_id": "0x8889e67df8540ae5:0xe0f129a057ef25f"}
{"user_id": "110379543420952438884", "name": "Criag Wade", "time": 1593337855336, "rating": 5.0, "text": "He did a great job and I'm very satisfied with the way he work with me and the work he did on my wife's headstone very professional and hometown kind.", "pics": null, "resp": null, "gmap_id": "0x8889e67df8540ae5:0xe0f129a057ef25f"}
{"user_id": "112167386706798747814", "name": "Laura Bond", "time": 1589755932744, "rating": 5.0, "text": "The customer service & craftsmanship that I received was outstanding. I live out of state and Kenan was able to work with me via email . He took my ideas and drafted a design for my momma’s headstone . He kept me updated and arranged it to be set while we were present .The headstone is very beautiful !❤️", "pics": null, "resp": null, "gmap_id": "0x8889e67df8540ae5:0xe0f129a057ef25f"}
{"user_id": "107428901485596351007", "name": "shelly oden", "time": 1594421261773, "rating": 5.0, "text": "Stone looks great.  Kenan went above and beyond.  Very professional.", "pics": null, "resp": null, "gmap_id": "0x8889e67df8540ae5:0xe0f129a057ef25f"}
{"user_id": "117741337179655959831", "name": "Nikos&Danielle Deves", "time": 1554037780162, "rating": 5.0, "text": "They just finished my Grandfathers bench and we couldn’t be more pleased with the turn out. They are very friendly people and always kept us up to date with how the process was going. They also have good prices. Couldn’t have picked a better business.", "pics": null, "resp": null, "gmap_id": "0x8889e67df8540ae5:0xe0f129a057ef25f"}
{"user_id": "107330326223718661320", "name": "Nancy Weycker", "time": 1562880938454, "rating": 5.0, "text": "My sisters & I are delighted we chose Arab Stone Works to make our family headstones.  Kenan was so friendly & personable, & gave us excellent advice.  He helped with every aspect of the stones from creation, design, & sandblasting to delivery.  We are very pleased with the results, & highly recommend Arab Stone Works to anyone who wants excellent, professional results.", "pics": null, "resp": null, "gmap_id": "0x8889e67df8540ae5:0xe0f129a057ef25f"}
{"user_id": "115546001978247127202", "name": "George Mascorro", "time": 1569464683215, "rating": 5.0, "text": "Thank you Keene for my Dads Headstone. You done a great job in a timely manner I'm am beyond pleased and greatful.", "pics": null, "resp": null, "gmap_id": "0x8889e67df8540ae5:0xe0f129a057ef25f"}
{"user_id": "118086773289789410898", "name": "adam glover", "time": 1496248881973, "rating": 5.0, "text": "great company!!  service is outstanding. The headstones i have seen and had done are beautiful . Staff is very professional and understanding of the bereavement their customers are going through.", "pics": null, "resp": null, "gmap_id": "0x8889e67df8540ae5:0xe0f129a057ef25f"}
{"user_id": "111394595871942893459", "name": "Stephen Williams", "time": 1533751865491, "rating": 5.0, "text": "Sometimes in my line of work I have to deal with folks going through tough situations. The only thing that can lighten the load is working with true professionals. I'm glad Kenan and his team at Arab Stone Works take such pride in their work and care so much about serving their clients.", "pics": null, "resp": null, "gmap_id": "0x8889e67df8540ae5:0xe0f129a057ef25f"}
{"user_id": "108749246863730699907", "name": "Gail Gibbs", "time": 1542853891030, "rating": 5.0, "text": "Very professional and easy to work with even under difficult times for our family.  The design and delivery of my Moms headstone was perfect and exactly what we wanted!", "pics": null, "resp": null, "gmap_id": "0x8889e67df8540ae5:0xe0f129a057ef25f"}
{"user_id": "100081269801367890626", "name": "Helena Banks", "time": 1597791333266, "rating": 5.0, "text": "Very old glider & chairs that belonged to my Mother.  Stateline did an awesome job restoring them for me.  I picked a textured finish in rust color and truly love them.  Great company to work with.\nTerri Hooper", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO-lN4AIvgmtX_2vN57mDmVM1d-jvkU1cWooQ5R=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNDh2Yv-_rzgxS9gK4f-KzUbbDQHdcoot0rTMfr=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM-GbNIFnFVftCEMiAnEeWviwFF0o6vNndeiTjT=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM_YVwebNYCSDwaq1yCwCIisQYo9Bq4ZQM7o0Er=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMB92DA6tvp3XwqcsYio1BZhs7gLz0XI8fVnHHP=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO8gzXfxRZ7EZEa7YJD6nXDQfhK14OZMHWUDGEf=w150-h150-k-no-p"]}], "resp": {"time": 1598038057621, "text": "Terri, we love being able to take our customers antique pieces and restoring them with the unique color that you chose.  While these priceless pieces were originally your Mother's, you've added new life to them & will treasure them for years to come.  Thank you for trusting us with this project!"}, "gmap_id": "0x8862457c2888ce9d:0x82673dd217a5652e"}
{"user_id": "109063956324002300964", "name": "J Cowan", "time": 1601429992012, "rating": 5.0, "text": "Stateline Powder Coating did a great job on my swing.  Our swing is over 45+ years old. They did an amazing job on it. So excited to get it hung back up. I am in love and look forward to many more memories shared in this swing. Thank you so much!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMbU8QhyfG1p3ZXjSIhNAstqqMiF2LleleGNK7x=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNEDKRJSTmPLr1wN29622pAPeGBYJPqCtxEcVIt=w150-h150-k-no-p"]}], "resp": {"time": 1597410884567, "text": "Jolie we love being able to take a family heirloom & help our customer restore it to original.  We hope you spend many happy hours swinging and creating lasting memories.  Thank you for trusting us with your project!"}, "gmap_id": "0x8862457c2888ce9d:0x82673dd217a5652e"}
{"user_id": "106702689161907782228", "name": "turbopromodified", "time": 1597786388978, "rating": 5.0, "text": "I have done a lot of business with Stateline Powder Coating, and I have always been thrilled with the results. The quality of work is as good as it gets; they always pay special attention to masking off threaded parts and machined surfaces. The prices are more than fair, and turnaround times are very fast. They have the ability to process parts that vary in size from small fittings all the way up to complete chassis. I plan on continuing to use Stateline in the future on all of my projects.\n\nTravis Q.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOK0Nwu8he3KOJ1UY2gBiaNh6xIrDoF-DnwDm6E=w150-h150-k-no-p"]}], "resp": {"time": 1598038409325, "text": "Travis, we consider it an honor to work on your projects!  Thank you for trusting us with all of your work.  We look forward to seeing what you'll bring next!  BTW that car is absolutely amazing!"}, "gmap_id": "0x8862457c2888ce9d:0x82673dd217a5652e"}
{"user_id": "100361552913579761820", "name": "Aaron Barnes", "time": 1600299189469, "rating": 5.0, "text": "I needed a high-quality result for a 4130 helicopter frame. I traveled to the shop and was sold upon arrival. No additional stops required which was nice. Staff is exceptional, shop is professional with quality equipment.\nDelivery was scheduled with a completion eta of 2 weeks. Within the first week I had an unsolicited update with pictures. That was unexpected and very much appreciated. Again, professional. Ahead of schedule, great start. At day 10 I was informed that the job was complete and ready for pickup at my convenience. The cost was exactly that quoted. Underpromise, overdeliver. I'm very pleased with the performance, service and result and will be back for any coating I need. Pics unavailable but I'll add them if possible when able.", "pics": null, "resp": {"time": 1600722847031, "text": "Aaron, we truly appreciate you trusting us with your unique project!  We will be talking about your Helicopter for years to come & are looking forward to seeing the finished work & you flying it out to visit us.  Thank you again for allowing us the opportunity to work with you on this awesome piece."}, "gmap_id": "0x8862457c2888ce9d:0x82673dd217a5652e"}
{"user_id": "111074996317891519703", "name": "Joe G", "time": 1597369016898, "rating": 5.0, "text": "This is a professional shop that is always willing to take on my unusual projects.\nTheir preparation surpasses the industry standards and their coatings are strong and wear admirably.\nI use them for all my custom table bases but they are willing to  try and push the envelope to coat flame-colored copper and my metal etches and patinas.\nOrdinary paints and lacquers wouldn't do what I needed.\n5 Star Service at reasonable costs!!", "pics": null, "resp": {"time": 1597410044986, "text": "Joe, Thank you for trusting us with your projects.  We are honored to help complete whatever is needed, and we look forward to your future business."}, "gmap_id": "0x8862457c2888ce9d:0x82673dd217a5652e"}
{"user_id": "107622710298574848578", "name": "JJ'S Coffee", "time": 1597346618466, "rating": 5.0, "text": "My sign was coated in a custom red and put up within the week. It's been in direct sun and Tennessee weather it has not faded or scratched in the year it's been up. Very pleased with my sign and thankful to have this business in our community. If you are in Ardmore come on by the shop and see their great work for yourself. Highly recommend", "pics": null, "resp": {"time": 1597410454503, "text": "Jamie, Thank you so much for trusting us with your projects!  That sign is an eye catcher & it sure sparkles & shines.  Give us a call for any future projects that we can help you complete!"}, "gmap_id": "0x8862457c2888ce9d:0x82673dd217a5652e"}
{"user_id": "115886514580990376880", "name": "Brennan Bell", "time": 1597861489434, "rating": 5.0, "text": "Brought a dirt bike frame to have powder coated. Looks amazing and will be bringing more things for them to powder coat. Super friendly and very helpful!! Would definitely recommend using them!!!", "pics": null, "resp": {"time": 1598037670268, "text": "Brennan Thank you for allowing us to help you with restoring your Dirt Bike!  We look forward to working with you on future projects & are glad that you're happy with our work."}, "gmap_id": "0x8862457c2888ce9d:0x82673dd217a5652e"}
{"user_id": "107171913735931149764", "name": "Gwyn Wright", "time": 1597347307544, "rating": 5.0, "text": "They did a wonderful job on the wheels for my 17 year old horse trailer. Look BRAND new, even better than new! Better than paint as this will last forever!", "pics": null, "resp": {"time": 1597410290362, "text": "Gwyn Thank you for trusting us with your trailer wheels!  I agree they look awesome & with proper care will last forever!"}, "gmap_id": "0x8862457c2888ce9d:0x82673dd217a5652e"}
{"user_id": "110823205582737380891", "name": "Joel Ratley", "time": 1621705649077, "rating": 5.0, "text": "Won a door prize", "pics": null, "resp": {"time": 1622035680868, "text": "Joel, Thanks for attending our Open House!"}, "gmap_id": "0x8862457c2888ce9d:0x82673dd217a5652e"}
{"user_id": "113848512581917043774", "name": "Glenn Rumer", "time": 1597857424854, "rating": 5.0, "text": "I have had several car parts done and some were done almost 3 years ago with zero problems, still look new as the day I had them done!!!! Awesome people to deal with. People that are giving them bad reviews must have issues. Trust them with anything!!!", "pics": null, "resp": {"time": 1598037838311, "text": "Glen, Thank you for allowing us to powder coat your parts with those amazing unique colors!  We're thrilled that you're pleased with our work and we look forward to working with you on all of your future projects!"}, "gmap_id": "0x8862457c2888ce9d:0x82673dd217a5652e"}
{"user_id": "112811073454052076548", "name": "MJK M", "time": 1597548695852, "rating": 1.0, "text": "Don’t trust their work looks good until it fades a few days later.", "pics": null, "resp": {"time": 1597693032440, "text": "We're so sorry that you're not pleased with our work.  Please provide us with more information about your items.  Your Invoice will have an Invoice number, date and your name on it, if you'll provide us with this information we'll look into this situation in depth."}, "gmap_id": "0x8862457c2888ce9d:0x82673dd217a5652e"}
{"user_id": "113503669766552665192", "name": "Shannon Hagerman", "time": 1598612755946, "rating": 5.0, "text": "An absolute pleasure to do business with. A family business that is professionally operated with quality work and reasonable prices.", "pics": null, "resp": {"time": 1599054280300, "text": "Shannon, Thank you for the 5 Star Review.  It's been our pleasure to work on your projects and perfect them to your satisfaction.  We look forward to seeing you with all of your future projects!"}, "gmap_id": "0x8862457c2888ce9d:0x82673dd217a5652e"}
{"user_id": "107505844496318131160", "name": "logan mcclain", "time": 1597252399161, "rating": 1.0, "text": "This is the worst business ever by far the powder coating wears of in 3 weeks and then it fades and looks absolutely horrible. They charge tons of money and when you ask to redo the service they did they try to charge you again and won’t refund you. Never EVER go here please.", "pics": null, "resp": {"time": 1597347833904, "text": "Logan, I'm so sorry that you're not pleased with our work.  We searched our records and aren't able to locate you as being one of our customers.  If you could please provide us with a copy of your detailed invoice, the date the work was completed and it will also have your name on it.  Once you provide me with this information I will check into the issue."}, "gmap_id": "0x8862457c2888ce9d:0x82673dd217a5652e"}
{"user_id": "106709054007656324547", "name": "Jamie Jordan", "time": 1555281877710, "rating": 5.0, "text": "These guys have done anything from tumblers, chairs, tables, all the way to creating my custom sign for my shop. They're professional, affordable, and deliver beyond my expectations everytime. Absolutely, recommend this company! Thanks again guys!", "pics": null, "resp": {"time": 1599054533416, "text": "Jamie, Thank you for trusting us with all of your powder coating needs!  We look forward to serving you on your next project!"}, "gmap_id": "0x8862457c2888ce9d:0x82673dd217a5652e"}
{"user_id": "108430477653673952459", "name": "mark roller", "time": 1590095515562, "rating": 5.0, "text": "Great people to work with and they do great work", "pics": null, "resp": {"time": 1597411087753, "text": "Mark,  I hope your wife is enjoying those columns & that arch, they are definitely  unique pieces.  Thank you for allowing us to restore them for you!  We look forward to working with you on any future projects that you have!"}, "gmap_id": "0x8862457c2888ce9d:0x82673dd217a5652e"}
{"user_id": "110174013562611693341", "name": "Mark Jarrell", "time": 1615902132279, "rating": 5.0, "text": "Make sure to call before you go if you are dropping off or having something quoted. Office staff and all the associates I dealt with were professional and courteous. I had two relatively large pieces blasted. A steel after market bumper and a steel core support out of a heavy duty truck. They did a fantastic job on both for a very reasonable price. They even helped me load them when I went to pick the items up. I will use them again for any items I need blasted, big or small.", "pics": null, "resp": null, "gmap_id": "0x88891b8832f863e7:0xb103fe190435298e"}
{"user_id": "102700679102256503662", "name": "Dewayne Coleman", "time": 1599584111527, "rating": 5.0, "text": "Super nice folks to work with", "pics": null, "resp": null, "gmap_id": "0x88891b8832f863e7:0xb103fe190435298e"}
{"user_id": "110485217694617256183", "name": "Don Froelich", "time": 1607799985320, "rating": 5.0, "text": "Very good place to get powder coating done. I'm a welder and have been taking projects to Windsor's for many years.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPDjNB286WYV3iHgTDh7jNpE-3G41twfXAmHbeV=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPbiXgkCk3nhPrI-fLqs5XrOOj-iCqJqWWqLgO6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNc96NHWGTDBPAhEzZ3wYIKd9b9-xSP8tWqHz6T=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNB1MYe2HFnlrp0ty9H8_mh-4IG3tCvU0688H7U=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889cd40eff18759:0x2a038810d60b0307"}
{"user_id": "117818445955111787783", "name": "Moses Brown", "time": 1592591333007, "rating": 5.0, "text": "There aren’t word to describe the impeccable service/great family atmosphere that Mr Windsor and his Staff exhibit that I’ll continue to travel from Huntsville to have my projects done.....period....truly a ⭐️⭐️⭐️⭐️⭐️ Operation................“Keep up the Great works..SFC M. Brown US Army (Retired)", "pics": null, "resp": null, "gmap_id": "0x8889cd40eff18759:0x2a038810d60b0307"}
{"user_id": "117255496115456228356", "name": "David Flanary", "time": 1590160806877, "rating": 5.0, "text": "Great service and product from this family owned and operated business! Always honest and fair in every aspect of their work!", "pics": null, "resp": null, "gmap_id": "0x8889cd40eff18759:0x2a038810d60b0307"}
{"user_id": "106431617364995187152", "name": "Mel Cowan", "time": 1501022412219, "rating": 5.0, "text": "These guys are the greatest! Very professional, and will go out of their way to please any customer. I just love how they give a personal touch to every thing they touch!", "pics": null, "resp": null, "gmap_id": "0x8889cd40eff18759:0x2a038810d60b0307"}
{"user_id": "113830530147287918611", "name": "John RISTINE", "time": 1591630672379, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x8889cd40eff18759:0x2a038810d60b0307"}
{"user_id": "103050038286884583051", "name": "Bradley Young", "time": 1622318674506, "rating": 5.0, "text": "Picked us up on a AAA tow, brought us to the shop, helped us with tools and whatnot.\n\nIf you don't know, these are the right people. They will take care of you!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO317pAOs6pAA8PC8nK8y7qKtmiaGEixc5vyTsg=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNUG0PwbI-Ei8ZknZNDG1-04kne9UF23Ni9otIT=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8888fd3193176597:0x474b83dbecfd947"}
{"user_id": "102082232533381409940", "name": "Lilliya Michelle Finwall", "time": 1612305793149, "rating": 5.0, "text": "I like this business. Owner Mike Rich is a really great guy! Everyone there is very nice and professional. The shop is always buzzing and the tow trucks roll in and out all day and night. This is a hardworking bunch. You can't go wrong calling Mike Rich and \"Rich's Collision and Towing\".", "pics": null, "resp": {"time": 1615590821649, "text": "Hey Lilliya, thank you!!‼️That is a great review on how hard we work on towing and in our auto body work shop. We appreciate you:)"}, "gmap_id": "0x8888fd3193176597:0x474b83dbecfd947"}
{"user_id": "116734314576628581419", "name": "Tuesday Shaw", "time": 1619659074752, "rating": 1.0, "text": "I witnessed a man with a woman in the passenger seat go down our road twice and speeding like crazy. I am very upset about it because I have kids on this road and so do other families.  I was walking out to go check my mailbox and I know they didn't see me so I had to jump back so I didn't get hit. They are so unprofessional.", "pics": null, "resp": null, "gmap_id": "0x8888fd3193176597:0x474b83dbecfd947"}
{"user_id": "115667802077021074633", "name": "Joseph Ham", "time": 1607181571686, "rating": 5.0, "text": "This is a great place to have repairs done you have a very friendly staff I like everyone there they're very nice people", "pics": null, "resp": {"time": 1615590962722, "text": "Joseph. We appreciate you ‼️ the 5 stars to the auto collision repair team .."}, "gmap_id": "0x8888fd3193176597:0x474b83dbecfd947"}
{"user_id": "114845080356027066313", "name": "Randy Simmons", "time": 1616028079475, "rating": 1.0, "text": "Worst tow company they broke my front axel and tried to make it seem like my front axel was already broken", "pics": null, "resp": null, "gmap_id": "0x8888fd3193176597:0x474b83dbecfd947"}
{"user_id": "109272827753204006190", "name": "Chase Holmes", "time": 1583180114549, "rating": 5.0, "text": "Worked here along side many great people! Owner is amazing and hates shortcuts! He preaches about doing this right the first time and if it wasn’t done right the first time (which is not common) he will make sure he fixes it! I guarantee Rich’s is the fastest responders for Adamsville PD and they do an amazing job towing. Rich’s is a very capable body shop too! They do it all and it’s crazy the things they are able to do with their amazing equipment!", "pics": null, "resp": null, "gmap_id": "0x8888fd3193176597:0x474b83dbecfd947"}
{"user_id": "109402495823722189620", "name": "Junion Pintal", "time": 1600975188010, "rating": 5.0, "text": "Friendly, good speed.  Notified me ahead of time off any extras issues and cost.", "pics": null, "resp": null, "gmap_id": "0x8888fd3193176597:0x474b83dbecfd947"}
{"user_id": "115994510434857183776", "name": "Travis Pugh", "time": 1583180477807, "rating": 4.0, "text": "Great service repairs were done fast. The staff is always helpful and seem like they are really experienced.", "pics": null, "resp": {"time": 1584651547238, "text": "Travis, Thank you very much for taking time out of your day to give us the kind review on your Auto Repairs we did for you. I definitely will let our collision center staff know about this rating review as well !"}, "gmap_id": "0x8888fd3193176597:0x474b83dbecfd947"}
{"user_id": "111604028099979747756", "name": "Regina Cowart", "time": 1580871664114, "rating": 5.0, "text": "Had a great experience with Rich's towing they tow my SUV twice in 2 week I I'm very pleased with the way they handled my truck and was on time to show up for the appointment to carry my shop truck to the auto repair place.\nAnd I couldn't beat the price thank you Rich\"s", "pics": null, "resp": {"time": 1584651953946, "text": "We appreciate the 5 Stars and review for the towing job \"S\" we had recently done for you.. ;)\nHopefully your auto repairs are straight, but you know Rich's Towing will be ready to respond !"}, "gmap_id": "0x8888fd3193176597:0x474b83dbecfd947"}
{"user_id": "117337163461631447538", "name": "leanne winslow", "time": 1576618612365, "rating": 5.0, "text": "Greats  people always try help n do good work", "pics": null, "resp": {"time": 1578607263614, "text": "Thank You Leanne. We appreciate the 5 star !"}, "gmap_id": "0x8888fd3193176597:0x474b83dbecfd947"}
{"user_id": "103384740932947296137", "name": "Renee Hartill", "time": 1572107298486, "rating": 5.0, "text": "Great service and experience.The driver was great!!Thanks guys great work", "pics": null, "resp": {"time": 1578607388074, "text": "Hey Renee, Thank you for the great 5 Star Rating and Review. We appreciate your business and we will let your driver know about the compliment:)"}, "gmap_id": "0x8888fd3193176597:0x474b83dbecfd947"}
{"user_id": "113985272169381716904", "name": "Jaime Lewis", "time": 1526506474328, "rating": 5.0, "text": "My son worked here for a minute good people", "pics": null, "resp": {"time": 1578607434924, "text": "Thank you for the 5 Stars Mrs. Lewis !"}, "gmap_id": "0x8888fd3193176597:0x474b83dbecfd947"}
{"user_id": "105655047704063557723", "name": "Amanda Ingram", "time": 1544633498121, "rating": 1.0, "text": "Horrible company with horrible workers with rotten attitudes", "pics": null, "resp": null, "gmap_id": "0x8888fd3193176597:0x474b83dbecfd947"}
{"user_id": "108328615419009093100", "name": "smash bros", "time": 1533929967882, "rating": 2.0, "text": "Great people , great work", "pics": null, "resp": null, "gmap_id": "0x8888fd3193176597:0x474b83dbecfd947"}
{"user_id": "104168829565467012861", "name": "Zach Smith", "time": 1581396438804, "rating": 2.0, "text": "Rude service", "pics": null, "resp": {"time": 1584652509703, "text": "I am sorry to see you had any service other Quality, from any of our many different service departments. We appreciate you Zach, and all customer reviews."}, "gmap_id": "0x8888fd3193176597:0x474b83dbecfd947"}
{"user_id": "104391327731926206475", "name": "Jon Lauterbach", "time": 1523224685575, "rating": 5.0, "text": "Good prices and great work. Highly recommend!!", "pics": null, "resp": null, "gmap_id": "0x888bb19e6dc53279:0x2c8561f9d0d34a95"}
{"user_id": "109761080054486226757", "name": "William Hayward", "time": 1408651352353, "rating": 5.0, "text": "Roll bars and brush guards look perfect!", "pics": null, "resp": null, "gmap_id": "0x888bb19e6dc53279:0x2c8561f9d0d34a95"}
