{"user_id": "113021832451684874731", "name": "Maribeth Thomas", "time": 1622048170512, "rating": 5.0, "text": "Matt, Luke and Trey were great to work with especially during a difficult time.  In the midst of our home disaster, they were so helpful, kind, and hard-working.  They did a great of job explaining what they were doing as they went and were detail oriented.  I hope we never have to use this type of service again, but if we find ourselves in a similar situation we would definitely call them.", "pics": null, "resp": {"time": 1622050155586, "text": "Thanks Maribeth! It was such a pleasure working for you! We hope you never need us again too, but we’re here if you do!"}, "gmap_id": "0x888a3ea425b968a9:0xb906a781b5949ac0"}
{"user_id": "112493561250580142262", "name": "Lee Berry", "time": 1618022038861, "rating": 5.0, "text": "Excellent customer service from the minute I called and spoke with Diana to the day Matt cleaned our carpets. I would highly recommend this company for your carpet cleaning needs.  Polite, professional and prompt.", "pics": null, "resp": {"time": 1618060375936, "text": "Thank you Lee! Nice to have ya’ll back in the Gadsden area."}, "gmap_id": "0x888a3ea425b968a9:0xb906a781b5949ac0"}
{"user_id": "102903110568269534430", "name": "Tatum Henry", "time": 1614187878794, "rating": 5.0, "text": "I would definitely recommend rainbow international they were very professional and so friendly to work with! They always called before they came always showed up when they said they were coming and just a pleasure to work with during a time of chaos in my house! Trey Luke and Matt were awesome And if anything like this ever were to happen again they would be the first people I called to come and help me! Thanks again Rainbow International!!! 🤗🤗🤗", "pics": null, "resp": {"time": 1614187480316, "text": "Thank you for the 5 stars! We really enjoyed working for you!"}, "gmap_id": "0x888a3ea425b968a9:0xb906a781b5949ac0"}
{"user_id": "100944850142645564187", "name": "Debbie Carter", "time": 1598626802584, "rating": 5.0, "text": "Luke and Tre from Rainbow were awesome!  They called to give us options on times that were convenient, called to give us an ETA, were polite, efficient,  understanding, professional and kind. Both had great personalities!  They took extra time to explain every procedure with patience!  These are good folks.  I would recommend Rainbow anytime!  Thanks guys for everything!", "pics": null, "resp": {"time": 1598724677561, "text": "Thank you Debbie for the kind words! We appreciate being able to help you out by drying your wet floors."}, "gmap_id": "0x888a3ea425b968a9:0xb906a781b5949ac0"}
{"user_id": "102456053274050668805", "name": "Colby Duckett", "time": 1607811657308, "rating": 5.0, "text": "I used rainbow international to help with a moisture condensation issue in my crawlspace that caused some water damage to the floor as well as some mold growth in the crawl space. They were very responsive and professional throughout the inspection, estimate, and remediation process.\n\nThey gave me appropriate information to help me determine what option was the best quality and value for my specific situation.\n\nThey performed a mold remediation treatment, installed a dehumidifier in the crawl space, replaced the crawl space door, and sealed the crawl space vents with cover that I provided, and all for a very reasonable price.\n\nI would certainly use Rainbow International again for a situation similar to this one, and I would recommend their serviced to others in this situation as well.", "pics": null, "resp": {"time": 1607814004728, "text": "Thank you so much Mr Duckett! While we hope you don’t Need our services again, we’re Always Here for any Water,Fire, or Mold disasters anyone may have."}, "gmap_id": "0x888a3ea425b968a9:0xb906a781b5949ac0"}
{"user_id": "113703091557375808815", "name": "Heather Thomas", "time": 1608041811307, "rating": 5.0, "text": "This company came to dry up water damage. The young men were kind, respectful, & wonderful at their job! Not only did they pay attention to detail, they were very calming during a very emotional process. I would recommend them to anyone!", "pics": null, "resp": {"time": 1608043751914, "text": "Thank you Heather! We hope the reconstruction will go smoothly for you!"}, "gmap_id": "0x888a3ea425b968a9:0xb906a781b5949ac0"}
{"user_id": "117541241128172516330", "name": "madyson cotton", "time": 1601852467411, "rating": 5.0, "text": "The service was excellent and involved the removal of flooring and set of equipment to dry  wet plywood in three rooms. The men were very professional and polite and answered all my questions about the services being performed. I was told when they would come back and was called about 20-40 minutes before they came. I was very pleased with them and the services performed. Thank you so much to Matt, Tre and Luke.", "pics": null, "resp": {"time": 1601853376264, "text": "Thank you for your review, we really appreciate it! We are glad we got to help you out with the water damage from your fridge. Hope the installation of your new flooring goes well."}, "gmap_id": "0x888a3ea425b968a9:0xb906a781b5949ac0"}
{"user_id": "116483295787800740687", "name": "Wade Farley", "time": 1585445386803, "rating": 5.0, "text": "It was a great experience with Rainbow during a crazy day.  We had a pipe burst and flood our home.  Matt was there as soon as he could be.  He placed fans and dehumidifiers and explained the situation we were in. I couldn't have loaned and borrowed the equipment that he brought with him.  Matt made sure everything was dry to the point of no mold or mildew before he was finished. He was very professional and personable throughout the situation, even though we were a little crazy. Thank you Matt and Rainbow International for helping us through these past few crazy days and helping us get life back to normal.", "pics": null, "resp": null, "gmap_id": "0x888a3ea425b968a9:0xb906a781b5949ac0"}
{"user_id": "114168492169070573351", "name": "Shala", "time": 1582852558683, "rating": 5.0, "text": "I trusted this Business Within 5 minutes on the first phone call. A business led by People who hold themselves to A Higher Standard.\nTruth, Honesty and Integrity", "pics": null, "resp": {"time": 1582856363519, "text": "Thank you Shala! We are glad we could help you out and put your mind at ease during a stressful time."}, "gmap_id": "0x888a3ea425b968a9:0xb906a781b5949ac0"}
{"user_id": "103929844967713255910", "name": "Michelle Hatcher", "time": 1605756334017, "rating": 5.0, "text": "They were very polite", "pics": null, "resp": {"time": 1605791901718, "text": "Thank you Ms Hatcher"}, "gmap_id": "0x888a3ea425b968a9:0xb906a781b5949ac0"}
{"user_id": "103310079682128801526", "name": "Bradford Knight", "time": 1545073596074, "rating": 5.0, "text": "Great job cleaning out our air ducts.  The team explained everything they were doing, were very neat & thorough and the price was reasonable.  After seeing the pictures of how dirty our air ducts were, we are very happy this service was performed.  If you haven’t had your air ducts cleaned in awhile, you should call Rainbow International of Gadsden.", "pics": null, "resp": {"time": 1545076782171, "text": "Thank you so much for your business! We are very happy to know you are satisfied with our services and thanks for the recommendation."}, "gmap_id": "0x888a3ea425b968a9:0xb906a781b5949ac0"}
{"user_id": "108936700955790672294", "name": "PS Snell", "time": 1529333739366, "rating": 5.0, "text": "This company cleaned and deodorized my ducts, did mold remediation under the house and cleaned carpet on stairway and did a wonderful job!  Luke and Steven were very hard workers and very professional an courteous. They also were very prompt and I just cannot say enough good about them.  Don't use anyone else.. .we wont!!  The customer service was VERY good!", "pics": null, "resp": {"time": 1529342505337, "text": "Thank you so much Mrs Snell! We are glad you are happy and that the cleaning has helped!"}, "gmap_id": "0x888a3ea425b968a9:0xb906a781b5949ac0"}
{"user_id": "102826853901196242380", "name": "Sharon Bedwell", "time": 1584050471784, "rating": 5.0, "text": "The ladies that cleaned my carpets were very nice and did a professional job. Thank you", "pics": null, "resp": {"time": 1584054590468, "text": "Thank you Sharon. The girls enjoyed seeing your super gliders."}, "gmap_id": "0x888a3ea425b968a9:0xb906a781b5949ac0"}
{"user_id": "105775435483015542597", "name": "Kitty", "time": 1491943982584, "rating": 5.0, "text": "Rainbow International Restoration was very professional in providing help with our water damage. They were quick to arrive at our home and explained the process every step of the way.\nThey were able to dry our home as quickly as possible and save items of a sentimental value to our family.\nI would highly recommend Matt and his service team. They were a tremendous help to us in our time of need.", "pics": null, "resp": null, "gmap_id": "0x888a3ea425b968a9:0xb906a781b5949ac0"}
{"user_id": "105681640793061143001", "name": "Andrea Beard", "time": 1546652243831, "rating": 5.0, "text": "Rainbow International has been so helpful during our home \"crisis\". They have been very professional, thorough, and very friendly at the same time. I would definitely recommend them to anyone!", "pics": null, "resp": {"time": 1546653139618, "text": "Thank you so much Andrea! It was a pleasure helping you out during your water damage “crisis” - That’s what we are here for! Hope the rest of your repairs go smooth!"}, "gmap_id": "0x888a3ea425b968a9:0xb906a781b5949ac0"}
{"user_id": "104573634283304039815", "name": "Ron", "time": 1566433088328, "rating": 5.0, "text": "Great company! Would definitely recommend! Very trustworthy, helpful, and great workmanship!", "pics": null, "resp": null, "gmap_id": "0x888a3ea425b968a9:0xb906a781b5949ac0"}
{"user_id": "105743899508798044627", "name": "Mzmika x", "time": 1484869882748, "rating": 5.0, "text": "The service that was provided was awesome. Matt and Tammie the entire team was friendly and very professional. These people handled everything professional and was very consistent. Everything was explained thoroughly and properly. I would definitely recommend this company to anyone.\nRainbow International Restoration is the Best!", "pics": null, "resp": null, "gmap_id": "0x888a3ea425b968a9:0xb906a781b5949ac0"}
{"user_id": "105064564474718898717", "name": "sas5451", "time": 1531803837781, "rating": 5.0, "text": "Fantastic cleaning job on 4 area rugs at our home.  Highly recommend them.  Our Svc. Tech., Matt Ellis, was especially courteous, efficient & professional.  Great Job!", "pics": null, "resp": {"time": 1531853266936, "text": "Thank you!!"}, "gmap_id": "0x888a3ea425b968a9:0xb906a781b5949ac0"}
{"user_id": "108659473281980960617", "name": "Lesa LaFond", "time": 1446828431819, "rating": 5.0, "text": "My experience with Rainbow International was A+! I have used their services in my home as well as my business.  They were courteous, professional, punctual and mannerly. I would not hesitate to use them again. The services performed were top notch and affordable. My carpets look new again!\nThank you Rainbow International!", "pics": null, "resp": null, "gmap_id": "0x888a3ea425b968a9:0xb906a781b5949ac0"}
{"user_id": "109853656601122480550", "name": "Janna Parris", "time": 1463175211190, "rating": 2.0, "text": "Initially, I would have given them a higher rating.  However, I had the carpet cleaned for 3 bedrooms and 7 steps for $150. The boy was very polite. They looked really good when he got done. He seemed to be in a hurry. He didn't move any furniture. Now, we are 2 months out and all of the carpet stains are now back. I have someone else coming next week to clean them again. I wouldn't waste my money.", "pics": null, "resp": {"time": 1464024350119, "text": "We regret that you are not fully satisfied. You may be experiencing something known as \"wicking\". We would be happy to clean those spots again if you choose. And we do offer other packages that include moving the furniture in rooms. Just let us know if you would like us to clean these spots again."}, "gmap_id": "0x888a3ea425b968a9:0xb906a781b5949ac0"}
{"user_id": "110139167263780260433", "name": "patricia bolle", "time": 1502504926563, "rating": 5.0, "text": "Great company!  They really care about their customers and helped us every step of the way.  The ladies who worked in our home were considerate, friendly and knowledgeable.  I hope we never go through this kind of thing again but I know exactly who we'll call if we do!", "pics": null, "resp": null, "gmap_id": "0x888a3ea425b968a9:0xb906a781b5949ac0"}
{"user_id": "100784504762630837183", "name": "Tony Russell", "time": 1569428913668, "rating": 5.0, "text": "They were good as gold,  could  not be any better!\n\nTony Russell", "pics": null, "resp": null, "gmap_id": "0x888a3ea425b968a9:0xb906a781b5949ac0"}
{"user_id": "102221434537110784612", "name": "Chris J. Dowdy", "time": 1492926357665, "rating": 5.0, "text": "I was thoroughly impressed with every aspect of this service from initial contact to invoice.\nThey were courteous, communicative, cost-efficient, careful and complete, to say the least.\nI can only give my highest recommendations, and I will certainly call upon them again for any necessary services that they provide.\nThanks, Diana and Matthew!", "pics": null, "resp": null, "gmap_id": "0x888a3ea425b968a9:0xb906a781b5949ac0"}
{"user_id": "102005591244401336692", "name": "Mark", "time": 1529875223844, "rating": 5.0, "text": "Best restoration and carpet cleaning company in town! Honest and friendly people. If you have a disaster or just need carpet or duct cleaning, call the guys at Rainbow!", "pics": null, "resp": {"time": 1530322857925, "text": "Thanks Mark!"}, "gmap_id": "0x888a3ea425b968a9:0xb906a781b5949ac0"}
{"user_id": "115728855274213560373", "name": "The Salvi Chick", "time": 1461857612717, "rating": 5.0, "text": "They did a very good (and fast) job. My carpet no longer has stains. Also, very reasonable price. I will definitely do business with them again!", "pics": null, "resp": null, "gmap_id": "0x888a3ea425b968a9:0xb906a781b5949ac0"}
{"user_id": "100287009962484702491", "name": "Charlotte Sommersby", "time": 1484009086126, "rating": 5.0, "text": "I've used this company twice during plumbing disasters and highly recommend them. Their prompt service and friendly thorough staff helped to eliminate most of the stress that was created. Very professional from the initial call to the closing of the invoice. They treat you as though your family....", "pics": null, "resp": null, "gmap_id": "0x888a3ea425b968a9:0xb906a781b5949ac0"}
{"user_id": "107131227101613878566", "name": "Matthew", "time": 1529087798818, "rating": 5.0, "text": "If you are in need of restoration due to water, fire, or mold damage - you definitely should go with Rainbow. Very professional, courteous, and honest!", "pics": null, "resp": null, "gmap_id": "0x888a3ea425b968a9:0xb906a781b5949ac0"}
{"user_id": "115549206609497516103", "name": "CARRIE MASON", "time": 1506398126951, "rating": 5.0, "text": "The team at Rainbow International is highly professional and care about their clients. They were quick to offer assistance and diligent in making sure I was satisfied.", "pics": null, "resp": null, "gmap_id": "0x888a3ea425b968a9:0xb906a781b5949ac0"}
{"user_id": "112332156169985999024", "name": "Gregory Metzger", "time": 1483389618573, "rating": 5.0, "text": "I had some carpet in a rental apartment that had not been cleaned in years.  They made it look new and fresh again!! Thanks", "pics": null, "resp": null, "gmap_id": "0x888a3ea425b968a9:0xb906a781b5949ac0"}
{"user_id": "105483369889392470562", "name": "Aaron Mason", "time": 1483195110415, "rating": 5.0, "text": "The guys done a fantastic job cleaning the carpet. They removed the stains and cleaned the stairs. I can't believe this is my carpet it really looks new I will recommend them to everyone I know.", "pics": null, "resp": null, "gmap_id": "0x888a3ea425b968a9:0xb906a781b5949ac0"}
{"user_id": "108776573354139047901", "name": "Alan", "time": 1530322434462, "rating": 5.0, "text": "Hard working honest guys that know what they are doing!", "pics": null, "resp": {"time": 1530322883207, "text": "Thanks Alan!"}, "gmap_id": "0x888a3ea425b968a9:0xb906a781b5949ac0"}
{"user_id": "103360054213608306609", "name": "Robert Amberson", "time": 1563596277536, "rating": 5.0, "text": "Great guy's and service", "pics": null, "resp": null, "gmap_id": "0x888a3ea425b968a9:0xb906a781b5949ac0"}
{"user_id": "105791907013929488573", "name": "April Little", "time": 1512427475869, "rating": 5.0, "text": "Very professional! Would definitely use this crew again.", "pics": null, "resp": null, "gmap_id": "0x888a3ea425b968a9:0xb906a781b5949ac0"}
{"user_id": "109252715032444668321", "name": "randy tidmore", "time": 1483194159580, "rating": 5.0, "text": "Very professional, legitimate duct cleaning, will show you the dirt they pull out of your ductwork. HARD TO BELIEVE IT COULD BE THAT DIRTY!", "pics": null, "resp": null, "gmap_id": "0x888a3ea425b968a9:0xb906a781b5949ac0"}
{"user_id": "111999645133554572768", "name": "Diana", "time": 1520959890036, "rating": 5.0, "text": "Really appreciated how helpful everyone was!", "pics": null, "resp": null, "gmap_id": "0x888a3ea425b968a9:0xb906a781b5949ac0"}
