{"user_id": "110688171375616329575", "name": "Drake", "time": 1468983453072, "rating": 5.0, "text": "I called them at 1 pm about installing speakers I bought at bestbuy they were ready too install two hours later. I had to go to work, but they installed everything and then drove my car back to work and it sounds great. They beat best buys prices by almost 200 dollars and if you have to get speakers installed I would go to them as they have the best prices and really good customer service.", "pics": null, "resp": null, "gmap_id": "0x8862159f1a5a04e1:0x42754bb3730a974a"}
{"user_id": "106901702081802817472", "name": "Cindy Hosea", "time": 1460589471652, "rating": 5.0, "text": "As of today I would not recommend them.  Two weeks ago I went in to get a new radio for my car.  They promised the one they put in with all the bells and whistles would be\nperfect.  Well the radio came in with wrong parts as they had reorder that was fine.  Finally they had all they needed although they kept calling saying you need this and that we said ok.  We took my car to them and they had it 4 days.  Finally after a lot of phone calls they said it was done.  It tried to sync my phone and it did but no sound out of the speakers.  They couldn't figure out the problem so the installer promised he'd call the manufacturer Monday morning and call me.  No phone call.  I called him and got his voice mail.  No return call.  I called the shop and was told they would call as soon as he got in .  No call.  I also called Sirus to have that transferred from my other radio but they didn't hook it up.  So here I sit with a very expensive radio and CD player.  At this point the ball is in their court and I'm waiting to see what they do. Until then I would no recommend them to anyone.\nI now will give them 5 stars.  They have fixed my problems and everything works perfect.\n\nI would go to them again.", "pics": null, "resp": null, "gmap_id": "0x8862159f1a5a04e1:0x42754bb3730a974a"}
{"user_id": "113513323082880009789", "name": "Jason Smith", "time": 1468931601921, "rating": 1.0, "text": "I ordered 1500.00 worth of stuff and was told it would take 3 days but it took over 30 days and everyday I called I they got smart with me and gave me excuse after excuse of why it wouldn't come I am now a dealer for scar audio and many other products and when I order something it never takes over three days it is obvious that he spent the money on something else and had to try to get it back before he can order my stuff", "pics": null, "resp": null, "gmap_id": "0x8862159f1a5a04e1:0x42754bb3730a974a"}
{"user_id": "103696025419201686866", "name": "erika smalley", "time": 1474155131543, "rating": 1.0, "text": "Save your time. This place is absolutely ridiculous. My husband went for his appointment at 6pm and didn't get home until 10pm and they still didn't have the rca wires to hook his speakers up. We are now on day two, so far three hours into it and no speakers hooked up.", "pics": null, "resp": null, "gmap_id": "0x8862159f1a5a04e1:0x42754bb3730a974a"}
{"user_id": "102998610696906351731", "name": "Brent Smalley", "time": 1474769300638, "rating": 1.0, "text": "Got speakers set up---took over 7 hours and 2 days. Nothing was bolted down and wires were loosely ran. Now my speakers are completely out. Don't recommend!!!", "pics": null, "resp": null, "gmap_id": "0x8862159f1a5a04e1:0x42754bb3730a974a"}
{"user_id": "117945846625069676819", "name": "Charles Garrett", "time": 1474783531751, "rating": 5.0, "text": "Awesome", "pics": null, "resp": null, "gmap_id": "0x8862159f1a5a04e1:0x42754bb3730a974a"}
{"user_id": "109395548975710201399", "name": "Michael Felton", "time": 1600440095563, "rating": 5.0, "text": "Ed, the man behind the counter, is extremely knowledgeable about everything dish as well as a \"straight shooter\". Let him know what you're looking to do and he'll have the answers. Tim, the guy doing the hard labor, is just as friendly and is just as knowledgeable. Between the two, customer service can't get any better!", "pics": null, "resp": null, "gmap_id": "0x88897d1816ac255f:0x881063bf8fb92013"}
{"user_id": "116947858216516299495", "name": "Chad Dillard", "time": 1602182283707, "rating": 5.0, "text": "Edward is a great guy who knows his business.", "pics": null, "resp": null, "gmap_id": "0x88897d1816ac255f:0x881063bf8fb92013"}
{"user_id": "106064301389556271202", "name": "jjdavis24", "time": 1459278696176, "rating": 5.0, "text": "I love that Cabletown offers the same deals as  1-800 DISH but you can deal with local people and local customer service.  They are much faster on service calls and installation than calling the 1-800 #.   Cabletown takes care of it's customers.", "pics": null, "resp": null, "gmap_id": "0x88897d1816ac255f:0x881063bf8fb92013"}
{"user_id": "100666941456939990445", "name": "Pat Hunt", "time": 1568136415791, "rating": 3.0, "text": "CABLEtown is not CABLE. It’s actually  satellite\nThey should call themselves SATELLITEtown.\n😁", "pics": null, "resp": null, "gmap_id": "0x88897d1816ac255f:0x881063bf8fb92013"}
{"user_id": "116681022785149786727", "name": "George Glenn", "time": 1553452466482, "rating": 5.0, "text": "Ed is very knowledgeable and specializes in customer service.", "pics": null, "resp": null, "gmap_id": "0x88897d1816ac255f:0x881063bf8fb92013"}
{"user_id": "110271775543215226178", "name": "CJ Gann", "time": 1505496500879, "rating": 5.0, "text": "Best in class customer service . Far better than I received from previous cable / Satellite companies. Cable town does what the other guys won't or can't .", "pics": null, "resp": null, "gmap_id": "0x88897d1816ac255f:0x881063bf8fb92013"}
{"user_id": "108749602256521773742", "name": "janice wester", "time": 1534785838238, "rating": 5.0, "text": "Great service!  Ed is wonderful!", "pics": null, "resp": null, "gmap_id": "0x88897d1816ac255f:0x881063bf8fb92013"}
{"user_id": "104482355223968248798", "name": "Andrew Richter", "time": 1518661954460, "rating": 5.0, "text": "Wonderul service and amazing prices.", "pics": null, "resp": null, "gmap_id": "0x88897d1816ac255f:0x881063bf8fb92013"}
{"user_id": "115052914344525354596", "name": "Shannon C", "time": 1568844738515, "rating": 1.0, "text": "Beware...I have been a CenturyLink customer on 3 separate occasions over the past 5 years. I opened a new account in March 2019. Today, I pulled my credit report and noticed that CenturyLink initiated 2 hard inquiries in March. Both were on the same day by two different offices in Omaha and New Orleans. I am very upset. Why would a company make 2 hard inquiries in one day?? It is completely unnecessary and unprofessional. Buyers beware! Also, their chat and Twitter help was non-responsive.", "pics": null, "resp": null, "gmap_id": "0x889a0ded73ab8dad:0x9a4cb139ebfcc551"}
{"user_id": "118228918633751521919", "name": "Sandra Lee", "time": 1574548931264, "rating": 1.0, "text": "HORRIBLE COMPANY. Customer service is the worst service I have ever experienced. On several occasions they lie about coming to set up the internet. I have taken off today on a Saturday as they were supposed to come and set up the internet. I lost a day of work to wait on them all day to come and they WERE NOT EVEN OPEN TODAY. This place is disgusting and I 100% do not recommend", "pics": null, "resp": null, "gmap_id": "0x889a0ded73ab8dad:0x9a4cb139ebfcc551"}
{"user_id": "107660247938408314454", "name": "kayleon boyd", "time": 1575482975253, "rating": 1.0, "text": "without a doubt the WORST customer service i’ve ever experienced, if you have the option to get wifi with a different company i 100% recommend that you don’t go with century link.", "pics": null, "resp": null, "gmap_id": "0x889a0ded73ab8dad:0x9a4cb139ebfcc551"}
{"user_id": "110026920662393911934", "name": "sidney scott", "time": 1574707439647, "rating": 1.0, "text": "Poor internet and customer service. Paying for a 100 mbps package and at best on a good day getting up to 25 mbps. Worst service in Baldwin County by far!! Don’t waste your time or money with this company.", "pics": null, "resp": null, "gmap_id": "0x889a0ded73ab8dad:0x9a4cb139ebfcc551"}
{"user_id": "101804414901327872691", "name": "Quiet Blanck", "time": 1573852922048, "rating": 1.0, "text": "Terrible customer service, outrageous cost, and at the end of it, failure to connect. So said, this company has a thorough and complete vote of no confidence.", "pics": null, "resp": null, "gmap_id": "0x889a0ded73ab8dad:0x9a4cb139ebfcc551"}
{"user_id": "112131765701284981781", "name": "Rick and Karen Linto", "time": 1568647072889, "rating": 1.0, "text": "This is the worst place I have ever had to try and deal with. No customer service and if you are thinking about trying to get service through them make sure you have months and months to get the run around. Standard answer is “it could be up to 10 business days before I can get you an update and yes it could be another month before you get service” this is from a company supervisor!!!!!", "pics": null, "resp": null, "gmap_id": "0x889a0ded73ab8dad:0x9a4cb139ebfcc551"}
{"user_id": "105536268833436099478", "name": "Maliyah O", "time": 1574362064833, "rating": 1.0, "text": "Horrible customer service. I have to wait two weeks to get internet (WiFi) installed.", "pics": null, "resp": null, "gmap_id": "0x889a0ded73ab8dad:0x9a4cb139ebfcc551"}
{"user_id": "113474532869631674446", "name": "JD. Wells", "time": 1576861905993, "rating": 1.0, "text": "Worst Customer service experience ever.", "pics": null, "resp": null, "gmap_id": "0x889a0ded73ab8dad:0x9a4cb139ebfcc551"}
{"user_id": "104052372353433579471", "name": "Karl", "time": 1574392164626, "rating": 1.0, "text": "The slowest internet service ever. Stay away!", "pics": null, "resp": null, "gmap_id": "0x889a0ded73ab8dad:0x9a4cb139ebfcc551"}
{"user_id": "115490914212490367934", "name": "Angel", "time": 1441381723794, "rating": 1.0, "text": "Sideways. They have a monopoly in Foley, AL yet nothing has ever been done about it. When it rains the internet, a little afterwards, stops working most of time. Speed is slow during the day so if you want fast speeds be the night owl and you'll love these guys.", "pics": null, "resp": null, "gmap_id": "0x889a0ded73ab8dad:0x9a4cb139ebfcc551"}
{"user_id": "110428673742566308589", "name": "Peyton Peninger", "time": 1571189808420, "rating": 1.0, "text": "Worst internet that has ever been made.", "pics": null, "resp": null, "gmap_id": "0x889a0ded73ab8dad:0x9a4cb139ebfcc551"}
{"user_id": "112949872943302218809", "name": "Mr. S", "time": 1440454410601, "rating": 1.0, "text": "I wish there was less than 1 star. I absolutely hate this company. Unfortunately there is no provider in my area. They have over a dozen phone numbers to call, there is no centralization whatsoever. Constantly getting bounced around the automated menus, lackluster performance and a completely apathetic management/staff. I overpaid for the first 2 years i was with them and only when I had called after normal business hours and reached a remote call center apparently in India did someone tell me I was paying double the monthly rate I could get if I committed for 2 years. !!!!!! I can only only pray there is a special place in Hell for companies like this.", "pics": null, "resp": null, "gmap_id": "0x889a0ded73ab8dad:0x9a4cb139ebfcc551"}
{"user_id": "105358082828600401001", "name": "Andrew Monaghan", "time": 1436882084807, "rating": 1.0, "text": "Without question the worst internet service and customer service. If you have a problem expect to wait a long time to speak to a human. I just spent twenty minutes on hold only to have the \"customer service representative\" hang up on me. Now waiting another twenty plus minutes. This is not an unusual experience when I have to call them, which is often. If you have an alternative, use it!", "pics": null, "resp": null, "gmap_id": "0x889a0ded73ab8dad:0x9a4cb139ebfcc551"}
{"user_id": "113757084556004216261", "name": "Cole Bullock", "time": 1572491229036, "rating": 1.0, "text": "Terrible I only get about 0.02 mbits per second took me an hour just to reach customer service", "pics": null, "resp": null, "gmap_id": "0x889a0ded73ab8dad:0x9a4cb139ebfcc551"}
{"user_id": "106350944101734621124", "name": "emily ebbert", "time": 1467305002378, "rating": 1.0, "text": "Really wish I could give this zero stars. Service is spotty. In recent weeks we have had at least 3 area wide outages that last for at least 2 days. Very very disappointed. 👎🏼👎🏼", "pics": null, "resp": null, "gmap_id": "0x889a0ded73ab8dad:0x9a4cb139ebfcc551"}
{"user_id": "105497059822588748216", "name": "Corey Noe", "time": 1424471043040, "rating": 1.0, "text": "I have never felt so ripped off by a company. Century link is the only internet provider in our area, and I have to have internet for my at home business or I would drop them in a heartbeat. most of the time our internet is so slow it will not even allow me to stream a movie without stopping at some point in the middle. not to mention we are paying nearly triple the cost of the internet service we had at our last house.", "pics": null, "resp": null, "gmap_id": "0x889a0ded73ab8dad:0x9a4cb139ebfcc551"}
{"user_id": "112866352941433086329", "name": "Blair White", "time": 1441337201237, "rating": 1.0, "text": "Century Link is by far the worst internet service provider in Alabama and maybe in the southeast. If you live in Foley, AL, you have no choice but to go with Century Link for Internet service. You pay top dollar for extremely slow internet that doesn't work half the time especially after 6 pm on week days. It is mind blowing to me that in the year 2015, cable internet is not offered in Foley, AL. People think that I live in the middle of no where when I tell them that cable internet is not an option. But I just say no, I actually live right in the middle of a city. It's just a city that allows only one internet provider which is called a monopoly which is illegal!! Century Link and this monopoly is so ridiculous, my family and I would seriously consider moving just to get away from it! Which is completely unacceptable that we would have to do that!! Ugh I hate Century Link!!!!", "pics": null, "resp": null, "gmap_id": "0x889a0ded73ab8dad:0x9a4cb139ebfcc551"}
{"user_id": "103603180519738909057", "name": "Michael Hunt", "time": 1437098682225, "rating": 1.0, "text": "I have bonded DSL.  2 months no problem, satisfied with the service, but I don't have a contract so I am paying a ridiculous $85.00 a month for 15 down/2 up which has averaged in that area.  I am on a work site and don't need another contract to break so this was the way to go.  I have no phone.  Yesterday I had to create a skype number because of cell phone problems.  Guess what?  My internet is throttled today.  If I go to the \"Century Link\" speed test it shows I am pulling 15.1 down/1.51 up.  Of course I am not every other speed test shows with the closest local in Daphne AL at 2.46 down/ up 1.47.  In fact most of the other non centurylink speed test show a higher upload on about 1 then download.  I've reset the equipment and the desktop is directed wired.  The equipment is up and on par.\nThis is clearly throttling and should be illegal.  I've had no warning that I hit some limit.  Trying to located a real human to take to is impossible slow and hard to locate.  Do not use the worthless chat its a no go and a pawn in modern customer service.  I can't wait to get out of here and back home with Fiber optic.  The rural people better pay attention to the fish they elect that spawn with the corporate cows.  The internet is not a luxury for a mobile advanced society.  Get it regulated and make these suckers deliver what they are selling at high prices.", "pics": null, "resp": null, "gmap_id": "0x889a0ded73ab8dad:0x9a4cb139ebfcc551"}
{"user_id": "112866352941433086329", "name": "Blair White", "time": 1441337201237, "rating": 1.0, "text": "Century Link is by far the worst internet service provider in Alabama and maybe in the southeast. If you live in Foley, AL, you have no choice but to go with Century Link for Internet service. You pay top dollar for extremely slow internet that doesn't work half the time especially after 6 pm on week days. It is mind blowing to me that in the year 2015, cable internet is not offered in Foley, AL. People think that I live in the middle of no where when I tell them that cable internet is not an option. But I just say no, I actually live right in the middle of a city. It's just a city that allows only one internet provider which is called a monopoly which is illegal!! Century Link and this monopoly is so ridiculous, my family and I would seriously consider moving just to get away from it! Which is completely unacceptable that we would have to do that!! Ugh I hate Century Link!!!!", "pics": null, "resp": null, "gmap_id": "0x889a0ded73ab8dad:0x9a4cb139ebfcc551"}
{"user_id": "118427234860853449593", "name": "Itz Audrey And Evelyn", "time": 1466177242658, "rating": 1.0, "text": "The worst customer service. Every time I call they are so rude and not helpful. They always blame something else. Literally cannot deal with this company but unfortunately there one of the only options in our area. Ughhhhhhh", "pics": null, "resp": null, "gmap_id": "0x889a0ded73ab8dad:0x9a4cb139ebfcc551"}
{"user_id": "106204221303853167598", "name": "Tammy Lloyd", "time": 1431789338314, "rating": 1.0, "text": "Just moved too foley alabama. It's an old house but very new too me. I heard something outside and found a guy messing with so.e wites, I said oh, am I getting g internet? He said yup. 15 min. Later he knocks says ur all set. Wth! I said where are my wires into the house,and he said find a phone jack, I have one but nothing is working. Never thought I'd say I miss time Warner cable", "pics": null, "resp": null, "gmap_id": "0x889a0ded73ab8dad:0x9a4cb139ebfcc551"}
{"user_id": "108667159163369376841", "name": "stephen m", "time": 1368470303116, "rating": 2.0, "text": "Absolutely the worst service. If you want something done call at least a week in advance and you might have it done within a weeks time. Called on a thursday to have phone and internet switched to my new house and finally had it on by the following tuesday. Very unacceptable.  Boy do I miss GULFTEL!!!", "pics": null, "resp": null, "gmap_id": "0x889a0ded73ab8dad:0x9a4cb139ebfcc551"}
{"user_id": "104010588147813289822", "name": "Zach Rutledge", "time": 1573698125463, "rating": 1.0, "text": "Not here anymore.", "pics": null, "resp": null, "gmap_id": "0x889a0ded73ab8dad:0x9a4cb139ebfcc551"}
{"user_id": "115520341515718935052", "name": "Matt White", "time": 1441336080271, "rating": 1.0, "text": "Monopoly!!! My only option. Terrible service at top dollar price!", "pics": null, "resp": null, "gmap_id": "0x889a0ded73ab8dad:0x9a4cb139ebfcc551"}
{"user_id": "107840551820913702243", "name": "Kyle kovalchick", "time": 1461381309947, "rating": 1.0, "text": "Sucks that is all they deserve", "pics": null, "resp": null, "gmap_id": "0x889a0ded73ab8dad:0x9a4cb139ebfcc551"}
{"user_id": "118056986628097584894", "name": "Ethan Ebbert", "time": 1467161442612, "rating": 1.0, "text": "The wifi is slow and it goes out every couple of days and is out for 3+ days at a time.", "pics": null, "resp": null, "gmap_id": "0x889a0ded73ab8dad:0x9a4cb139ebfcc551"}
{"user_id": "102716255036645231853", "name": "John P Hopkins O", "time": 1441751159617, "rating": 1.0, "text": "Doors are closed for good", "pics": null, "resp": null, "gmap_id": "0x889a0ded73ab8dad:0x9a4cb139ebfcc551"}
{"user_id": "108128722013998664722", "name": "Stacey Watts", "time": 1441154674272, "rating": 1.0, "text": "Poor service. . If you have home service with them, they'll sell your number to people who harass you about surveys, home security, and much more.", "pics": null, "resp": null, "gmap_id": "0x889a0ded73ab8dad:0x9a4cb139ebfcc551"}
{"user_id": "117452996708450724313", "name": "Tristan Gehman", "time": 1586902495746, "rating": 5.0, "text": "Millennium S&V is great to work with and their guys are very knowledgeable about satellite and CATV distribution. They've helped us with some large projects and we're always happy to partner with them. I highly recommended them.", "pics": null, "resp": null, "gmap_id": "0x8889a31052cde711:0x1de9d186cbed9caa"}
{"user_id": "103485890352765913654", "name": "Preston Holloway", "time": 1395949863003, "rating": 5.0, "text": "Great customer service!!!! Fast and efficient!!! Love these guys.", "pics": null, "resp": null, "gmap_id": "0x8889a31052cde711:0x1de9d186cbed9caa"}
{"user_id": "103852272223984168938", "name": "Mona Owens", "time": 1505210988194, "rating": 2.0, "text": "Not open enough", "pics": null, "resp": null, "gmap_id": "0x8889a31052cde711:0x1de9d186cbed9caa"}
{"user_id": "100307517727971852229", "name": "Larry Harkless", "time": 1623855531167, "rating": 5.0, "text": "Good quality service, answered all my questions.", "pics": null, "resp": null, "gmap_id": "0x889ac9778da93b63:0x9f57b742baa1d4e0"}
{"user_id": "111411582014749984401", "name": "Denise Simpson", "time": 1616613596516, "rating": 1.0, "text": "Very unprofessional and displayed a severe attitude problem to customers.", "pics": null, "resp": null, "gmap_id": "0x889ac9778da93b63:0x9f57b742baa1d4e0"}
{"user_id": "110685914257191342268", "name": "Jacob Blankenship", "time": 1597297682294, "rating": 1.0, "text": "The staff here treated me very poorly... the man helping me was extremely rude and not very helpful. I definitely will not be returning.", "pics": null, "resp": null, "gmap_id": "0x889ac9778da93b63:0x9f57b742baa1d4e0"}
{"user_id": "110135189116188947925", "name": "Charles Britt", "time": 1583532894340, "rating": 5.0, "text": "Very helpful staff. Wish I didn't live so far away. 2 thumbs up!", "pics": null, "resp": null, "gmap_id": "0x889ac9778da93b63:0x9f57b742baa1d4e0"}
{"user_id": "117225576767906883568", "name": "Micki", "time": 1574499083249, "rating": 2.0, "text": "Their goods and services are below standard. And if you are looking for good electronics or Internet that can be Serviced properly,  please check other options.", "pics": null, "resp": null, "gmap_id": "0x889ac9778da93b63:0x9f57b742baa1d4e0"}
{"user_id": "101485411928825066678", "name": "Zachary Young", "time": 1501770683444, "rating": 5.0, "text": "Record & Sound was very helpful to me. The technicians were very friendly and knowledgeable. If you have electronics and need help with them, this is the place to go!!!", "pics": null, "resp": null, "gmap_id": "0x889ac9778da93b63:0x9f57b742baa1d4e0"}
{"user_id": "108426260628286983701", "name": "Jacob Roberts", "time": 1544750463428, "rating": 1.0, "text": "Family owned shop looking to upcharge uneducated small town people while they are uneducated themselves. The owner and I have met a handful of times all at different ages and he has been nothing but rude to my family and I. They claim to care about the people of Jackson, but at the same time they upcharge for horrible satellite internet as well as other electronics.\nExample: When the PlayStation 4 came out, my friend's parents spent a month trying to find one for thier son and stumbled on one here at this shop. $399 was retail for this console, while R&S were charging $499, not including tax!\n\nMost stores you get what you pay for, here you pay for more and get less.", "pics": null, "resp": null, "gmap_id": "0x889ac9778da93b63:0x9f57b742baa1d4e0"}
{"user_id": "110919642172742868887", "name": "JJ Arensberg", "time": 1501781124284, "rating": 5.0, "text": "Great service, nice and helpful staff. I would highly recommend anyone to use this store.", "pics": null, "resp": null, "gmap_id": "0x889ac9778da93b63:0x9f57b742baa1d4e0"}
{"user_id": "103405703481740581996", "name": "Christopher Motes", "time": 1536139365814, "rating": 5.0, "text": "Great place to be", "pics": null, "resp": null, "gmap_id": "0x889ac9778da93b63:0x9f57b742baa1d4e0"}
{"user_id": "115586867044188683905", "name": "Vince Holley", "time": 1444152018604, "rating": 5.0, "text": "Great service!!!", "pics": null, "resp": null, "gmap_id": "0x889ac9778da93b63:0x9f57b742baa1d4e0"}
