{"user_id": "103658166899981708555", "name": "Elizabeth Flowers", "time": 1596805542900, "rating": 1.0, "text": "Bad experience first time. I went in to buy as bottle of tanning lotion and the system not the employee charged me too much.....like $10 too much. Left my number and my information. I've called to get no answer. The manager was supposed to call me but it's been like a month and no call. I've tried calling them but of course no answer. The manager wouldn't even tell the girls that work there what to do about the situation.", "pics": null, "resp": null, "gmap_id": "0x88892e3b3153391d:0x8c25409d4673dc0f"}
{"user_id": "116830914528523451930", "name": "Ann & Danny Millar", "time": 1582925658903, "rating": 4.0, "text": "OVER ALL ITS A GREAT PLACE TO GET YOUR TAN ON!", "pics": null, "resp": null, "gmap_id": "0x88892e3b3153391d:0x8c25409d4673dc0f"}
{"user_id": "111455793275680422914", "name": "Sheley White", "time": 1555441344728, "rating": 5.0, "text": "I have always enjoyed this tanning salon. Very sweet girls and its always very clean inside.", "pics": null, "resp": null, "gmap_id": "0x88892e3b3153391d:0x8c25409d4673dc0f"}
{"user_id": "104417249187836129801", "name": "Robby", "time": 1531326256964, "rating": 4.0, "text": "Good place to tan. Only drawback is  only one level one bed and they close when it storms. Nice staff though", "pics": null, "resp": null, "gmap_id": "0x88892e3b3153391d:0x8c25409d4673dc0f"}
{"user_id": "108719599871890645259", "name": "Snow Wilson", "time": 1585614017527, "rating": 2.0, "text": "Benn trying to reach them, the phone is disconnected. Once I get a response, I will update my review. :)", "pics": null, "resp": null, "gmap_id": "0x88892e3b3153391d:0x8c25409d4673dc0f"}
{"user_id": "115490627617305614247", "name": "Madilyn Wagner", "time": 1516310875208, "rating": 5.0, "text": "Very beautiful interior and very nice employees! Great prices!", "pics": null, "resp": null, "gmap_id": "0x88892e3b3153391d:0x8c25409d4673dc0f"}
{"user_id": "105023602072567095251", "name": "Elizabeth Culp", "time": 1560467089172, "rating": 1.0, "text": "I've called like 4 times today and no answer, i guess I'll try a diffrent salon 🤷", "pics": null, "resp": null, "gmap_id": "0x88892e3b3153391d:0x8c25409d4673dc0f"}
{"user_id": "107238447512907407432", "name": "Shelley Pierce", "time": 1503697410315, "rating": 5.0, "text": "Good tanning deals", "pics": null, "resp": null, "gmap_id": "0x88892e3b3153391d:0x8c25409d4673dc0f"}
{"user_id": "102998447125264630775", "name": "Celese Sanders", "time": 1627914366077, "rating": 5.0, "text": "Christine was absolutely wonderful! She took the time to really understand my pain and what would help. She is very skilled and when I left I felt like I could already tell a huge difference and the next day I felt the best I had felt in such a long time! I am so grateful I found them!", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "111054961697552585248", "name": "Richard B", "time": 1620079500159, "rating": 5.0, "text": "Sarah gave a great massage! It was a good balance of full-body massage, relaxation, and addressed the trouble spots and knots. Table was very comfortable and heated. Sarah did not talk much, which I appreciated. Nice location and facility.", "pics": null, "resp": {"time": 1620082329976, "text": "So glad you enjoyed your experience at Healing Haven. Thank you for the awesome review...we look forward to seeing you again soon;-)"}, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "108076498528514302780", "name": "Hailee Walls", "time": 1613659980583, "rating": 5.0, "text": "Renae is an amazing massage therapist! As a massage therapist myself, it is challenging sometimes to find someone whose work you love. But Renae's myofascial work feels great, and she is very intuitive and can truly feel what is going on in the body with her hands - she's like magic! I'll definitely be back.", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "115764236888935858383", "name": "Lisa Smith", "time": 1611158866209, "rating": 5.0, "text": "Visits to Healing Haven are a relaxing and serene experience. Christine is very knowledgeable in how massage therapy can help her clients and incorporates the modalities you need at each visit. The setting is peaceful and calming, it is a place to treat yourself and help keep your body in its healthiest state!", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "109779573864315218151", "name": "Larry Larry", "time": 1598922195791, "rating": 5.0, "text": "This is definitely a 10/10 location. I can’t say enough about the pleasant and relaxing atmosphere as you walk-in. In the mist of COVID I recognize immediately  the care and precautions.  Mrs.Grass was awesome. Has my highest recommendations.", "pics": null, "resp": {"time": 1599156377752, "text": "Thank you Larry for your 5 star recommendation! We appreciate you and your business and look forward to seeing you again soon!"}, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "105678908262803661626", "name": "Nancy Wesson", "time": 1589566232343, "rating": 5.0, "text": "I got a great massage here yesterday. The place I regularly go to was closed. After reading the reviews I made an appointment at Healing Heaven. I am glad I did. I would highly recommend this place.", "pics": null, "resp": {"time": 1589645779618, "text": "Thanks so much for the 5 star review! We are glad you were pleased with your service. We hope to see you again soon!"}, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "112003168625957004548", "name": "Nick P", "time": 1566008928307, "rating": 5.0, "text": "Great deep tissue massage.  Renae was excellent.  The facility was very clean and welcoming.  The table was solid and one of the better places I have been for a massage.  I felt very comfortable and will definitely be going back in the near future.", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "110344143644723717373", "name": "Raven Babineaux", "time": 1538326164654, "rating": 5.0, "text": "Best massage I've ever had, she actually used pressure that was needed as well as massaged all muscles. She worked on the knots in my back (much needed),  explained the process and discussed my intake form with me with all medical information. Oh and she actually explained the issues she discovered with me which has never occurred anywhere else I've been. Love this place they are very professional and informative.", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "113934976316795121322", "name": "Adrienne Walker", "time": 1545949383146, "rating": 5.0, "text": "10/10 would recommend. Christine was just a great person and really made me feel comfortable. She was solely interested in making you and your body feel ten times better than when you walk in. Thanks!", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "109360915112446349896", "name": "Ken Crowson", "time": 1573182390547, "rating": 5.0, "text": "Kinda Leary at first but once I got there very comfortable and it was great can’t wait till next session very professional and knowledgeable about the body would highly recommend Christine she was great", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "115301917910821813596", "name": "R", "time": 1492120366746, "rating": 5.0, "text": "I have gone to Christine about a half a dozen times now. She has helped me immensely. I have been to other massage therapist, to include some of the massage mills who shall remain nameless, and found Christine is very well versed in her profession. Every time I go there I learn something new. She has helped me with an alignment issue I was having by showing me a number of stretches to correct it. Christine also utilizes essential oils in her therapy and has the ability to find and release all the muscular tension build-up in my body. I sleep like a baby after one of her massage session. And above all, Christine is a lovely and caring person who believes in helping others!", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "103289347542548801669", "name": "Colby Robinson", "time": 1471537436289, "rating": 5.0, "text": "I visited Christine at Healing Haven recently for my first ever massage and I had a fantastic experience. When I stepped into her office it was like I left all my stress at the door. She was excellent at making me feel comfortable and relaxed. Not only was the massage a great experience, but she used essential oils to make it even better. If you are looking to have body work done, I definitely recommend visiting Christine.", "pics": null, "resp": {"time": 1471543158993, "text": "We're so glad you had such a positive experience with us and look forward to seeing you again soon!"}, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "118291058520299251842", "name": "Brandon Patterson", "time": 1523829114885, "rating": 5.0, "text": "Excellent service! I don't know where to start with how much their service made my weekend. Absolutely impressed with the quality and I can't wait to go again!", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "115282147452439720974", "name": "Randy Lee", "time": 1529675482918, "rating": 5.0, "text": "Christine is very knowledgeable and highly skilled. Definitely one if the best massage experiences I have had. I highly recommend Healing Haven and Christine.", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "107033886936537465600", "name": "Rachelle Griffin", "time": 1559253987719, "rating": 5.0, "text": "Our boss hired this place to come and give us 15 minute chair massages and it was great the lady doing the massages was really nice down to earth and generally cared about making you feel better I will be visiting the business for sure", "pics": null, "resp": {"time": 1559910878644, "text": "Hi Rachelle, thank you for the great review. It was our pleasure to come out to your place of work for your employee appreciation week to help make you feel better. We hope to be back again soon!"}, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "101422140446244793483", "name": "Dianne Judson", "time": 1506633767795, "rating": 5.0, "text": "Amazing and serene experience!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMTBY_YVd8ulC2lNlB9hTO6CMvtOsi03sAolRKT=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "103850886278909181626", "name": "Laura Hardin", "time": 1502237622814, "rating": 5.0, "text": "Christine has been my massage therapist for three years now. Every single session has been excellent. She continues to provide fabulous service.", "pics": null, "resp": null, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "102210444935224297537", "name": "Cameron Claire Starnes", "time": 1471450675033, "rating": 5.0, "text": "Christine is amazing!!  I was having a lot of pain and she helped me greatly!  I highly recommend her services.", "pics": null, "resp": {"time": 1471453295258, "text": "We appreciate your positive review Cameron and we're glad our services delivered what you needed. Cya later!"}, "gmap_id": "0x886268e9e7ce1185:0xcce9209e8c6d55e3"}
{"user_id": "114344683272494604735", "name": "Cathy Hodo", "time": 1621176766049, "rating": 1.0, "text": "I bought my hot tub about two years ago and it has really been horrible. We can’t get anyone to come service our hot tub in Hoover, Alabama. I had no idea they they would deliver the hot tub and then not have any service for when we had problems. And man have we had problems. No other companies will service it because we didn’t buy it from them. Take my advice and if you live anywhere near Hoover, Alabama buy your hot tub from another company!!!", "pics": null, "resp": null, "gmap_id": "0x88623ffcbc50a279:0x22c4eea7bc5e4851"}
{"user_id": "109275537076281961199", "name": "Jim Tate", "time": 1623300656925, "rating": 1.0, "text": "If you want a poor experience, call this outlet in Chattanooga for your hot tub experience.    My wife and I were lied to about everything.    The delivery date was a huge lie and the customer service from the sales rep  (initials JH) was extremely poor and unethical.     No follow up phone calls or emails until my responses via email were extreme and rude because of their lack of care and concern for our purchase.     I don't recommend these guys or the sales guy (JH) to anyone.   He needs to find a new career.", "pics": null, "resp": null, "gmap_id": "0x88623ffcbc50a279:0x22c4eea7bc5e4851"}
{"user_id": "104601492673690281172", "name": "Keith Cooper", "time": 1615331844250, "rating": 3.0, "text": "Too pricey better off going online.", "pics": null, "resp": null, "gmap_id": "0x88623ffcbc50a279:0x22c4eea7bc5e4851"}
{"user_id": "103527712196069902797", "name": "Phillip McCracken", "time": 1583340789744, "rating": 5.0, "text": "I was a little disappointed at first because the satellite office here in Huntsville doesn't have a complete showroom. But after speaking with Jason, he convinced me it was worth the drive to Chattanooga to see the full showroom and it was. I saved over $5000.00 on my new Catalina Luxury hot tub.", "pics": null, "resp": null, "gmap_id": "0x88623ffcbc50a279:0x22c4eea7bc5e4851"}
{"user_id": "112248507877021520367", "name": "Stan Quigley", "time": 1509227276560, "rating": 4.0, "text": "My wife and I found a beautiful hot tub at this place. We both had thought about getting one for years after our last one had too many cracks and repairs to it.  We enjoy going out to our back patio and using the tub almost every night and it has been a blessing for our aches and pains.  I think you will find what you're looking for when you check out their showroom.  Friendly and helpful staff too. We are looking for an infrared sauna and not sure they carry those though.", "pics": null, "resp": null, "gmap_id": "0x88623ffcbc50a279:0x22c4eea7bc5e4851"}
{"user_id": "103555489480557445702", "name": "Angela Heard", "time": 1547480043329, "rating": 1.0, "text": "The ABSOLUTELY WORSE CUSTOMER SERVICE and HOT TUB.Ordered from Chattanooga TN . Would never ever ever ever ever ever recommend or buy from again. Had a brand new hot tub delivered end of August 2018. By December 2018 the pump went out. Hadn't used the hotub I kid you not no more than 5 times total. Called two weeks ago talk to a tech and claim he was going to order the new pump. Called this morning to check on it and someone else claimed they didn't have any record on it. We knew it wasnt good because it came with the main pipe not put together and the lights not hooked up.", "pics": null, "resp": null, "gmap_id": "0x88623ffcbc50a279:0x22c4eea7bc5e4851"}
{"user_id": "104860964751428765800", "name": "Nikki Sisk", "time": 1622443825525, "rating": 5.0, "text": "I won 3 jackpots in a 12 hour period so of course I think it is worthy of 5 stars!  But it was very nice and clean with a large variety of machines to play.", "pics": null, "resp": null, "gmap_id": "0x889076e104b7747d:0x7abf81efabd42fd"}
{"user_id": "113258060294117609703", "name": "Ashley Daw", "time": 1595902691260, "rating": 5.0, "text": "I received a 50 minute relief massage from the spa this evening. I’m pretty sure the Tyesha. This was the best massage I have ever received. She was very thorough and professional! She deserves a bonus and a raise! I will definitely be requesting her next time.", "pics": null, "resp": null, "gmap_id": "0x889076e104b7747d:0x7abf81efabd42fd"}
{"user_id": "118229522013373813801", "name": "david mosley", "time": 1606377822095, "rating": 5.0, "text": "Looks like it would be great choicd for the ladies and shawn", "pics": null, "resp": null, "gmap_id": "0x889076e104b7747d:0x7abf81efabd42fd"}
{"user_id": "101856096708292332265", "name": "kimberly brooks byrd", "time": 1564622261355, "rating": 5.0, "text": "My hubby and I went on our Honeymoon a few days ago. It was the best experience. We really enjoyed ourselves. The staff, the massage therapists, the atmosphere, all were over 5 stars! Hand downs a wonderful experience all around. Definitely recommend!", "pics": null, "resp": null, "gmap_id": "0x889076e104b7747d:0x7abf81efabd42fd"}
{"user_id": "117996860729665395932", "name": "Becky Hatch", "time": 1577158813862, "rating": 1.0, "text": "I had the same experience as “Blossom Baby”, my masseur stayed on her phone the whole time and I received a one handed massage...I don’t recommend it, so please make sure Marcy/Marcie is not providing your service before you go.\nHowever, my sister received her facial from Jonathan and he was fantastic! I just cannot rate them higher than one star as long as I know there are unsuspecting clients who may be receiving one handed massages from Marcy. I have received 3 other massages from other masseurs there over the years and they were great, but Marcy was enough to make me not want to try again.", "pics": null, "resp": null, "gmap_id": "0x889076e104b7747d:0x7abf81efabd42fd"}
{"user_id": "100481246216082589612", "name": "Nancy Owen", "time": 1576522013874, "rating": 5.0, "text": "My daughter and I spent an entire day at the spa. We both had renewal facials and relaxation massages. Everyone that worked there was very friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x889076e104b7747d:0x7abf81efabd42fd"}
{"user_id": "103893575299178926610", "name": "Lisa Peacock", "time": 1578842209070, "rating": 4.0, "text": "Nice place to unwind,with a soak in the hot or cold tubs, sauna,steamroom and outside wave pool. Nice showers with sugar scrubs are available and the message staff are awesome too. Everyone is always so nice and helpful", "pics": null, "resp": null, "gmap_id": "0x889076e104b7747d:0x7abf81efabd42fd"}
{"user_id": "106200923904038527704", "name": "April Hamrac", "time": 1568927837142, "rating": 5.0, "text": "Had a facial done today and Jonathon Bethune was great. I would definitely recommend requesting him when booking a facial.", "pics": null, "resp": null, "gmap_id": "0x889076e104b7747d:0x7abf81efabd42fd"}
{"user_id": "109821958178644497914", "name": "Kathy Skipper Buckhault", "time": 1555546293707, "rating": 5.0, "text": "Kaci was absolutely the best massage therapist I have ever had.....bar none!!!!   She was fabulous, I had a pain in my shoulder when I got there she massaged the pain right out.   Thanks Kaci!!!", "pics": null, "resp": {"time": 1558562301698, "text": "Awesome! We're glad you enjoyed the massage! Please come again soon."}, "gmap_id": "0x889076e104b7747d:0x7abf81efabd42fd"}
{"user_id": "113102764564884868830", "name": "Diam0nd Sakura", "time": 1510132523004, "rating": 3.0, "text": "I have been to the Spa a few times and its different every time. I actually had a someone fall asleep while massaging me, I also had one that kept stopping to text on her phone. I should have reported them when I had the chance, but I hope they are gone. I had facial for the first time and it was awesome.", "pics": null, "resp": null, "gmap_id": "0x889076e104b7747d:0x7abf81efabd42fd"}
{"user_id": "105913199434306986695", "name": "Eric Hendrix", "time": 1542301400601, "rating": 1.0, "text": "$25 for a day pass.  The guy who checked me in was useless.  Collected my money and said ok, you can go back.  No tour, no explaining where everything was...nothing.  It’s rather small so I was able to figure out the lockers and get into my robe rather quickly and head straight for the steam room.\n\nSurprise, the steam room is broken down.  That sucks, but I could still do the sauna and whirlpool.  Wrong, sauna is broken too.  So all you get for your $25 is a whirlpool, and a lounge that has cartoons blasting loudly on the TV for some reason.\n\nI am usually one to just write off a bad experience and say lesson learned but I did go back out front and talk to the girl at the desk.  She was very apologetic and said they should have told me about the steam room, and she had no idea that the sauna was broken.  She refunded my money and I left.\n\nIt has potential but this place is terrible right now.", "pics": null, "resp": null, "gmap_id": "0x889076e104b7747d:0x7abf81efabd42fd"}
{"user_id": "117883446842008709425", "name": "Roger Prodacter", "time": 1563727685949, "rating": 4.0, "text": "There needs to be signs posted in the spa that say that swimsuits must be worn at all times in the spa area. It's not sanitary to have naked people using the whirlpool or sauna/steam room.", "pics": null, "resp": null, "gmap_id": "0x889076e104b7747d:0x7abf81efabd42fd"}
{"user_id": "105650596556005825871", "name": "Jo Kincaid", "time": 1560137892435, "rating": 4.0, "text": "Massage so so. Spa water nasty. Naked woman in it too.yuck", "pics": null, "resp": null, "gmap_id": "0x889076e104b7747d:0x7abf81efabd42fd"}
{"user_id": "117131462239202358972", "name": "Ashley Burton", "time": 1557247499690, "rating": 1.0, "text": "they wont take card payments over the phone. How do they expect people to book appointments when traveling out of town?", "pics": null, "resp": null, "gmap_id": "0x889076e104b7747d:0x7abf81efabd42fd"}
{"user_id": "113337761539207950969", "name": "Crystal Stokes", "time": 1519862355822, "rating": 5.0, "text": "Set an early appointment and spend all day in luxury. Worth the drive from Pensacola.", "pics": null, "resp": null, "gmap_id": "0x889076e104b7747d:0x7abf81efabd42fd"}
{"user_id": "104707208672860376014", "name": "pam howard", "time": 1493676200369, "rating": 5.0, "text": "I love the spa everyone is so helpful and friendly I can't stop going", "pics": null, "resp": null, "gmap_id": "0x889076e104b7747d:0x7abf81efabd42fd"}
{"user_id": "115420928838934785548", "name": "Kay Archer", "time": 1500505309196, "rating": 5.0, "text": "What a great experience.  Price is great also.", "pics": null, "resp": null, "gmap_id": "0x889076e104b7747d:0x7abf81efabd42fd"}
{"user_id": "111804157715206111543", "name": "Suzette Wilson", "time": 1523307204229, "rating": 5.0, "text": "It was so much fun & the food was great!", "pics": null, "resp": null, "gmap_id": "0x889076e104b7747d:0x7abf81efabd42fd"}
{"user_id": "106135835653017659128", "name": "Anjanette Moore", "time": 1574088317956, "rating": 5.0, "text": "Sooooo relaxing", "pics": null, "resp": null, "gmap_id": "0x889076e104b7747d:0x7abf81efabd42fd"}
{"user_id": "101775434491302732662", "name": "Carrissa Lee", "time": 1472677167716, "rating": 5.0, "text": "I totally in love with Escape Spa at Windcreek Resort in Atmore AL.", "pics": null, "resp": null, "gmap_id": "0x889076e104b7747d:0x7abf81efabd42fd"}
{"user_id": "111323555245283553337", "name": "Kaylee Padgett", "time": 1497988945358, "rating": 2.0, "text": "If you don't book 2 months in advance you'll never get an appointment. Especially if you want a Friday or Saturday appointment which in my case are my only days off.", "pics": null, "resp": null, "gmap_id": "0x889076e104b7747d:0x7abf81efabd42fd"}
{"user_id": "103723536467522797556", "name": "Becky Boutwell", "time": 1512499995351, "rating": 1.0, "text": "Woke up the next day with bruises everywhere and hurting so badly in my hip. I don’t think this is normal after a  massage. Painful experience for me , don’t think I will be returning.", "pics": null, "resp": null, "gmap_id": "0x889076e104b7747d:0x7abf81efabd42fd"}
{"user_id": "110683103012949345683", "name": "Christy Johnson", "time": 1558821380466, "rating": 5.0, "text": "Great location", "pics": null, "resp": null, "gmap_id": "0x889076e104b7747d:0x7abf81efabd42fd"}
{"user_id": "116990312831240298226", "name": "Albernya Tucker", "time": 1494624846430, "rating": 4.0, "text": "Awesome did nast", "pics": null, "resp": null, "gmap_id": "0x889076e104b7747d:0x7abf81efabd42fd"}
{"user_id": "110652567538825991583", "name": "Joan Chiver", "time": 1427309068273, "rating": 1.0, "text": "I was great but the food was awful but we had so much fun", "pics": null, "resp": null, "gmap_id": "0x889076e104b7747d:0x7abf81efabd42fd"}
{"user_id": "116559367471451282744", "name": "Des2BFit", "time": 1609184730797, "rating": 1.0, "text": "I’m curious the only reason I’m putting a one star currently is because they haven’t left any information of why the gym is currently close. They didn’t let me know in advance so I can stop my membership. I actually like this gym but I am wondering what is going on and why they haven’t open the gym back up ??? Anyone has an answer???", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "110359442575416599268", "name": "Copper Scales", "time": 1597283511484, "rating": 1.0, "text": "Its a decent gym. Havent had any issues with management and its always been decently clean. Fix the temperature/humidity problem and it'd be 5 stars.\n\nYou cannot however use this gym as they refuse to put in proper AC and insist on using sparsely placed floor fans instead. This just doesn't cut it in a climate where I've seen 80° in december, let alone when it hits 100° in the summer with crazy high humidity year round.", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "107146267343704417896", "name": "janay chatmon", "time": 1581116094220, "rating": 5.0, "text": "This is by far my favorite gym in town and I've been to them all. Staff is amazing and the overall environment is very welcoming. I love the sauna and recently they have updated most of their equipment. Happy member of Team Alpha keep up the great work guys.", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "100858329024656482856", "name": "Brian Rosenthal", "time": 1599302355774, "rating": 1.0, "text": "They just shut down ..no notice no nothing..stole all our money...owner is a theif. New owners good luck.", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "101747042276580289806", "name": "Jeff Brunje", "time": 1581128059065, "rating": 5.0, "text": "My daughter is extremely competitive in BJJ,and was not getting what she needed at another gym she was at,so she tried it here and from day 1 knew it offered more than just \"a belt\".\nCoach Kevin has a ton drive,knowledge,and definitely instills that in his students.She is now a full time student,and we are 100% confident in her training.In 5 years and 3 gyms she has found a main.", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "100393648342157946464", "name": "Mindy Joyner", "time": 1581125220195, "rating": 5.0, "text": "Very nice workout equipment  . Staff are very helpful and friendly. They also have a really wonderful daycare.  I would totally recommend this center for Adults and kids .", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "100970478733164781929", "name": "Windy Joyner", "time": 1564178368750, "rating": 5.0, "text": "This gym has come a long way and keeps getting better. Constantly upgrading equipment and lots of great classes and instructors. I love it.", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "109865892688288038665", "name": "Tiffany Garcia", "time": 1580150549105, "rating": 5.0, "text": "I love this gym,everyone is so nice . Coaches /Trainers  are so helpful. I definitely recommend this gym!💪👊", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "105391230010579075673", "name": "Cassie Farr", "time": 1580157396941, "rating": 5.0, "text": "Great personal trainers, phenomenal jiujitsu/Muay Thai/ MMA classes with a great coach. Great atmosphere. There is something for everyone, from Zumba to kids classes.", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "116945315932200629770", "name": "Jacob Katzev", "time": 1579790920374, "rating": 5.0, "text": "Great place to train MMA and Jiu-Jitsu or overall just getting in shape the equipment is great.", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "112706179122574432503", "name": "Adam R", "time": 1580419336148, "rating": 5.0, "text": "My boys and I train Brazilian Jiu Jitsu and Muay Thai here and love it!", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "108014976049942312701", "name": "Darkseid", "time": 1580151213182, "rating": 4.0, "text": "Great place to get in shape with plenty of options. You have Jiu-Jitsu classes, Muay Thai, Boxing, Zumba and a daycare to watch your Rugrats to give you time to get in shape. Those are just a few that I know of off the top of my head. Can't beat the price with all of those options with a nice gym with a wide verity of machines and free weights to choose from. My only complaint is the bathrooms could be cleaner and restocked more other then that I'd put it at 5 stars! Love the place!", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "113422873707397894927", "name": "Ashley Floreno", "time": 1554733522751, "rating": 1.0, "text": "Tried to cancel my membership numerous times and was getting told different information by different employees. Nobody has a clue what’s going on. I got emails daily about failed attempts to pull my membership fee for about 2 weeks. Now got an email of confirmation of payments. Waiting for it to clear my account so I can go in and raise hell. Gym is trashy and childcare is horrible. Every time I went to pick up my kids the workers were on their phones, not paying attention to the kids.", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "103593146501165672492", "name": "aresvp12", "time": 1580170036879, "rating": 5.0, "text": "Best jujitsu gym near Fort Rucker.", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "109531297133644565095", "name": "Angela Murphy", "time": 1581131028323, "rating": 5.0, "text": "Very clean! Friendly, helpful staff and instructors that are very patient and kid friendly!", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "102303369794891890426", "name": "H Buckits", "time": 1524284469736, "rating": 5.0, "text": "Only been a member for a week and my experience has been nothing but positive. Gym is always clean and neat. Nice variety of equipment. Very helpful staff.", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "114824098002534857621", "name": "Arrow", "time": 1540053805752, "rating": 1.0, "text": "The gym itself is a nice place to workout and there is a variety of machines you can use for workouts. The staff and management on the other hand is a joke. They simply do not care about solving a problem they caused and they will also lie to you about fixing it.", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "105176938308316709662", "name": "Russell Shimunek", "time": 1531847987126, "rating": 2.0, "text": "I have been going here for nine years, since it was gold’s. This place has gone downhill under the new management. Not very clean, especially bathrooms. When they do clean the bathroom, it is during the day, so you have to pee and they have it closed. Out of the 8-10 treadmills, 2 no joke, 2 actually work properly. Rates just went up again. They are charging premium rates for a mid-level product.", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "107050428153089775474", "name": "JINJOO BOK", "time": 1580160234447, "rating": 5.0, "text": "If you want to train bjj or mma, this place is for you.", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "100957303082867877277", "name": "Brittany Mullins", "time": 1527303186701, "rating": 1.0, "text": "Worst gym around. I would not recommend this facility to anyone. Save your money and time.Management is a joke and staff is just as bad. Lying to  members about head lice in nursery and threatening employees jobs if they tell the truth. Taking the old employees out slowly and bringing in their \"Pack\". Please go anywhere but there. Planet Fitness is way cheaper and much better.", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "110713584765491102042", "name": "Brian Lee", "time": 1533660320212, "rating": 1.0, "text": "The worst gym in enterprise and surrounding area.  People check your accounts they double charge you and will not refund your money.  They raise the membership and do not inform you.  Since it was gold gym and then enterprise fitness.  The gym has went down hill fast.  The staff has no clue on how a gym should be run.  Terrible place I would not recommend this place to anyone.", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "109049855482520651589", "name": "C J", "time": 1545250626905, "rating": 5.0, "text": "-people that are leaving nasty comments were not the greatest of people to deal with.\nThe gym has come a long way and so much money has been put into bringing this place back to life. No one truly knows the behind the scenes events and how hard we try to accommodate to everyone’s needs. However, the previous management was awful. I will agree with that. Too busy with personal life and not enough focus on the gym. That has changed and it’s only up from here. We have brought back the 7 day FREE trial so come on in and get your own expierence to share with the community! Merry Chrismas y’all! 🎄🍭🖤", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "112750960389083063147", "name": "Sharonica Daniels", "time": 1528307249997, "rating": 1.0, "text": "Worst gym experience ever.  Manager was higher than a kite when checking me in.  Staff had no clue about what classes were being held and when.  Absolutely a waste of your money.  Go to Planet Fitness and save your time and money!", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "105199548889977785426", "name": "Taylor Morris", "time": 1531197412858, "rating": 1.0, "text": "Worst place to work. So unprofessional. Staff is rude and has no idea what they are talking about, doing or even selling. Staff leaves front desk unattended. Managers harass they're  subordinates as well as customers. The managers are spoiled children of the co-owners who are being given a huge freebie in life.", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "107422274288448335996", "name": "RiShawn Foster", "time": 1581115891564, "rating": 5.0, "text": "Great place and friendly staff", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "115235219313479369346", "name": "Faith Dream", "time": 1533343048447, "rating": 5.0, "text": "Team Alpha has an amazing crew, amazing classes, and amazing equipment I couldn't imagine going to a different gym", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "111740439668843700625", "name": "Cam W", "time": 1573832777497, "rating": 5.0, "text": "New equipment and always open, only real gym in the area for lifting.", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "103754309522934241593", "name": "Clemson Voorheis", "time": 1560176504465, "rating": 1.0, "text": "Place is disgusting. Canceled membership within a week", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "110802798257715892483", "name": "Kadeem Thomas", "time": 1517616644972, "rating": 5.0, "text": "its the best gym best boxing coaches best\nzumba classes clean gym", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "109141489926737291471", "name": "Ryan Su", "time": 1581198321070, "rating": 5.0, "text": "Friendly Staff", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "105684527510550823125", "name": "Hailey Johnson", "time": 1581104225206, "rating": 5.0, "text": "Wonderful place!!", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "108586406290824782624", "name": "Lisa Willis", "time": 1581225987349, "rating": 5.0, "text": "Love it here!!!", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "116461604116030590961", "name": "Katina Williams", "time": 1559494993792, "rating": 5.0, "text": "I really enjoy going!!!!!", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "103471594826900047824", "name": "Leonardo Pores", "time": 1575414003193, "rating": 3.0, "text": "(Translated by Google) Good!\n\n(Original)\nBoa!", "pics": null, "resp": null, "gmap_id": "0x88926e8ebb7f93af:0x8e9bb86a22a53626"}
{"user_id": "102518755225529899810", "name": "Sherry Marter", "time": 1619546874215, "rating": 5.0, "text": "Hailey is very friendly, and informative! I'm excited about taking steps to better our families health. I am looking forward to benefitting from all of the wonderful experiences available there.", "pics": null, "resp": null, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "102248682154996532041", "name": "Vicki Webster", "time": 1617815597441, "rating": 5.0, "text": "I have only been in Fairhope for several weeks and I was looking for someplace to help boost my health a bit. I sure found that home in Peak Alkalinity. I have had three foot detoxes, enjoyed the oxygen bar, infared sauna and drank lots of alkaline water! I even filled up bottles of their great alkaline water to drink at home! I feel amazing! I have been doing lots of reading about alkaline water, it is so good for you! Everyone there is so knowledgeable. After talking with Missy, Ingrid and Hailey I found that they have a strong health interest and conviction. I'm very impressed and have learned a lot from each one of them. As long as I am in town, I will continue my quest for improving my health so I will keep going there to use their services and learn all that I can! Hopefully their Salt Therapy room will be finished before I leave! Thank you Peak Alkalinity! You were just what I needed!", "pics": null, "resp": null, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "102380492722108003764", "name": "Lorene “Lo” Kinslow", "time": 1620583585906, "rating": 5.0, "text": "I had a wonderful time there with my sister we sat joyed our feet getting taken care of and had a joyful time just sipping on water and watching the sunshine outside outside", "pics": null, "resp": null, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "113810267466521839955", "name": "Zoey Senn", "time": 1620146348401, "rating": 5.0, "text": "I was recently at the fairhope store for a bachelorette party. I had received the oxygen bar treatment and the foot detox. The treatment was amazing. Thank you", "pics": null, "resp": null, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "111173842036001352696", "name": "DIANA FURLOW", "time": 1616192967549, "rating": 5.0, "text": "I had a foot detox, my first, and it was amazing! Missy is the bomb.com!\nIt’s crazy to see all the stuff that comes out through the detox.", "pics": null, "resp": null, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "114105739222941048862", "name": "Rolanda Dorsey-Sanders", "time": 1611115706579, "rating": 5.0, "text": "Missy was very patient and informative. She made the entire experience relaxing as well as educational. Will definitely be a regular customer!", "pics": null, "resp": {"time": 1611157016787, "text": "So happy to have y’all join the Peak Alkalinity family!!! I enjoyed getting to know you!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "115602605382020625787", "name": "Holley Wade", "time": 1621260396214, "rating": 5.0, "text": "I will be back and try more services. I enjoyed the foot detox it was a relaxing and educational experience.", "pics": null, "resp": null, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "102165327933367620982", "name": "Vincent Sanders", "time": 1611415284119, "rating": 5.0, "text": "The owner was very knowledgeable and personable. Truly enjoyed the experience. Certainly plan on going again.", "pics": null, "resp": {"time": 1610992833980, "text": "Vincent, it was a pleasure to have you and Shea in for a foot detox! Hope you had a great day for your birthday!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "105720926868900153525", "name": "Bruna Matheson", "time": 1600092146457, "rating": 5.0, "text": "We went for a Infra Red sauna and left with so much knowledge! Will be going back for sure!", "pics": null, "resp": {"time": 1600215379271, "text": "Thanks Bruna! Enjoyed meeting you both! Would love to have y’all back in!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "116536234649274030522", "name": "Brittany francis", "time": 1576428114223, "rating": 5.0, "text": "Going Peak Alkalinity was a amazing, very knowledgeable experience! The owner, Missy and her staff are so welcoming and they know there STUFF! I had never been to any place like that this, but a friend of mine gave me a gift card as a Christmas gift and I’m so glad she chose this to give to me! From the time I walked in I felt I knew Ingrid already she was so friendly and pleasant. While  working and setting me up for my services she talked about the meaning of the equipment they have in the spa and what it does  to help we as people be in tune with our body naturally... I was stayed hydrated with the purified water they have available for you. It tasted great. These ladies didn’t miss a beat on the great customer services I received and I can’t wait to get back in the spa!! I recommend this as a birthday gift, Christmas gift  and just simple thinking of you gift for anyone!", "pics": null, "resp": {"time": 1576465932770, "text": "Brittany, so pleased that we exceeded your expectations! We look forward to having you in again soon!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "105751609002761066201", "name": "Dana Maloney", "time": 1576114941240, "rating": 5.0, "text": "I love this water!  Helps me sleep better and feel better.  Want to buy the filter system for home as soon as possible.  Really appreciate Missy's customer service and genuine concern for all.  I highly recommend", "pics": null, "resp": {"time": 1576160693106, "text": "Thanks so much, Dana! We enjoy seeing folks achieve better quality of life! We’d love to get you (and all of your guests at the fabulous Jubilee Suites) set up so it’s convenient for everyone!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "112483296439204698947", "name": "Anthony Jones", "time": 1578952736611, "rating": 5.0, "text": "Peak Alkalinity is an evolutional way to become healthier, more alert, and on track for a better lifestyle.  My wife and I have used all of their products and treatments on the road to detoxing our bodies.  Missy, Ingrid and Bobby ensure that you know the basis of treatments and the benefits you are receiving from each visit and the use of their products.  I see and hear nothing but positive outcomes from all those who are joining us at Peak Alkalinity!", "pics": null, "resp": {"time": 1579300523357, "text": "Anthony, we love hearing this! Thank you so much for the wonderful review!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "115544963268237144841", "name": "Kelly Killingbeck", "time": 1575214888832, "rating": 5.0, "text": "Peak Alkalinity is fabulous! Everyone at this business is so friendly and efficient but more importantly,  they are very knowledgeable about health and wellness, You could not ask for a more dedicated team! I feel so good since I started  drinking the water, and using the other products they offer!  I cant wait to have my very own water system installed at my home!  Kelly", "pics": null, "resp": {"time": 1575331154682, "text": "Kelly, thanks so much for the great review. Easy to help when we’re working with a like-minded gal. 😁"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "115126998949215672283", "name": "Kari Lyke", "time": 1574823064988, "rating": 5.0, "text": "Missy and Bob are awesome! We are so happy with our alkaline water machine and would highly recommend them and their products. You wont be disappointed!", "pics": null, "resp": {"time": 1574911853376, "text": "Thanks Kari! Hope you and Howie are doing great! Let me know if there are any more cougars on the loose in the neighborhood 😂\nCall if y’all need anything!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "112350570166192175734", "name": "Whit Stuckey", "time": 1577766213327, "rating": 5.0, "text": "Missy and her team at Peak Alkalinity do a great job of educating and helping you explore the amazing health benefits of alkaline water and the many applications of acidic water. The customer testimonials, research put into the machines and health benefits of alkaline water culminate into a powerful tool each of us need to use everyday to combat an ever growing array of threats to our body. After much consideration I purchased a water ionizer for my family. I will follow up in coming months with results.\n\nThanks Peak Alkalinity!", "pics": null, "resp": {"time": 1577837635741, "text": "Whit, thank you for the exceptional review! We can’t wait for the follow up to hear about your progress!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "109449103689393256071", "name": "Ginger Poling", "time": 1560198258777, "rating": 5.0, "text": "Not only is the owner invested in what she does, the employees are as well. As soon as you walk in, you feel immediately welcomed. Everyone there is very knowledgeable about the benefits of alkaline water and talk you through them all. They are very educating! I had the foot detox while I was there and that was the most interesting thing I have ever done! They can tell you exactly what toxins are being pulled from your body. I was sitting next to a friend and her results were completely different form mine. I had been eating a lot of sweets and breads and they told me yeast was coming out of my body. My friend had eaten a lot of fish that week and she was having mercury released out of her body. I was in awe of my results from the foot detox! Bottom line is Peak Alkalinity is a MUST to go and get educated on all the benefits of alkaline water and detoxing.", "pics": null, "resp": {"time": 1560272239233, "text": "Thank you Ginger for such a wonderful review!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "103613004845992495808", "name": "Nancy Franklin", "time": 1585168185680, "rating": 5.0, "text": "I had the ionic foot detox. Couldn’t believe what was pulled out. Also had  an oxygen session. Definitely want to come back for another session of each in the near future!!  Thank you Missy!", "pics": null, "resp": {"time": 1591717880019, "text": "We enjoyed having you in Nancy!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "114047407761960503933", "name": "Tracey Goens", "time": 1563244977939, "rating": 5.0, "text": "I love going into peak Alkalinity.  They are so helpful and take time to explain things. Missy really cares about her clients. Love my water ❤️", "pics": null, "resp": {"time": 1569010929102, "text": "Thank you for the kind words, Tracey! We still laugh about the prank that y’all pulled on Bob during the install. Classic! 😂"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "112170498318455204585", "name": "Aaron VanHauter", "time": 1581093980161, "rating": 5.0, "text": "Strong knowledge of the business. I walked away after 20 min understanding so much and still feel like I only scratched the surface of the knowledge of Peak Alkalinity. Strongly recommend.", "pics": null, "resp": {"time": 1581097907692, "text": "Thank you so much, Aaron! We love helping others discover optimal health from the inside out!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "112199736692920479633", "name": "Stefanie Samson", "time": 1580227579754, "rating": 5.0, "text": "I an from California and came with a friend I was visiting. It was amazing.  I can't wait to order my water system. I felt so rejuvenated and had so much energy immediately following... my poor husband on our 3 hour drive lol! I hope I can find a place to do foot detoxs near me.", "pics": null, "resp": {"time": 1580503255350, "text": "Stefanie, we love hearing this! Thank you so much for visiting us! If you are ever this way you will have to come back to see us!!!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "100252692400405620178", "name": "Chad Bartz", "time": 1581195170855, "rating": 5.0, "text": "Missy was extremely knowledgeable. A great listener to truly find out why I am interested in using a product like hers.", "pics": null, "resp": {"time": 1581230204188, "text": "The pleasure was ours, Chad! Happy to help!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "111595298519650779169", "name": "Laura Hall", "time": 1579984841414, "rating": 5.0, "text": "I’m addicted to my Foot Detoxes, Far-Infared Saunas, and the Oxygen Bar!! Missy and Bobby are brilliant in their innovative designs and products! The staff is extremely knowledgeable and so incredibly friendly. If you don’t have a water 💦 ionizer you’re are missing out! Clean ionized water is everything to having Peak Health!", "pics": null, "resp": {"time": 1579989190865, "text": "Laura, we love your enthusiasm and commitment to health! Hope you’re enjoying the ionizer in your St Augustine condo as much as the one in your Malbis home!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "117139071269607790078", "name": "Kelly Hanna (Big Sprout Media)", "time": 1558378462851, "rating": 5.0, "text": "Peak Alkalinity  it’s truly an amazing place. The owners are so invested in what they do and the community that they serve. Missy and Bob always go the extra mile to make sure everyone is so well taken care of. They remember their customers they become family they genuinely care about your health and your well-being.  Their employees are also just as knowledgeable in helping you understand what an amazing difference drinking the right water can make.  I seriously suggest you check this place out number one for the amazing foot detox and sauna room, number two to fill up on some really high-quality water that will truly make a difference in your health, and number three seriously consider getting one of these units for your house.", "pics": null, "resp": {"time": 1558644972810, "text": "Thank you so much, Kelly, for the amazing review!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "109417768278361434115", "name": "Ross Sykes", "time": 1560440343997, "rating": 5.0, "text": "The Peak Alkalinity team is a wealth of knowledge and you can feel their passion behind what they do. As a Peak customer I have enjoyed the journey that this product has made in my own life.  Everything this company represents is a Godsend and those not using this should.  Thank you Peak and I look forward to watching the change you make for many families.", "pics": null, "resp": {"time": 1560807464448, "text": "Thank you so much for your feedback Ross!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "108956492838397783134", "name": "Joshua Hembree", "time": 1575561668140, "rating": 5.0, "text": "Missy and her entire team at Peak Alkalinity are beyond excellent. I've struggled with heart burn my entire life and have bounced from one medication to the next because of it. However, after just a couple of weeks drinking their alkaline water I started to see improvements. I can't recommend them enough!", "pics": null, "resp": {"time": 1575565820763, "text": "Josh, happy to have alleviated some of the pain associated with your acid reflux!\nMy dad had a similar issue, so I know that it can impact your quality of life. We appreciate the feedback!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "102732276713348291226", "name": "Scott Blair (Scott the Wheelman)", "time": 1573580155888, "rating": 5.0, "text": "Missy and her team have created an affordable water system that can help prevent many serious illnesses, including Cancer.  Everyone needs to have their Alkalinity System in their house.  I don't let my dog drink straight city water, much less my family.", "pics": null, "resp": {"time": 1573982707530, "text": "Thanks, Scott! I know that caring for your dog is what brought you to us. That’s a special bond. So happy that we could be of help!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "115132984564748474012", "name": "sopheary huy", "time": 1584212692751, "rating": 5.0, "text": "Missy is amazing, we will be back to get more educational information from her.", "pics": null, "resp": {"time": 1591718106404, "text": "Sopheary, excited to provide more education. Stop by anytime."}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "114792851622733231643", "name": "Deedra Harrison", "time": 1576171714595, "rating": 5.0, "text": "The owner and staff at Peak Alkalinity Fairhope are very friendly and knowledgeable.  I enjoy the other services they provide and have started using the water in my neti pot.", "pics": null, "resp": {"time": 1576182969562, "text": "Thanks for the great review, Deedra! Yes, using the ionized acidic water in the Neti pot helps greatly during cold and flu season!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "111320147244270875911", "name": "Emily Stuckey", "time": 1575735254022, "rating": 5.0, "text": "Peak Alkalinity helped me restore my health! Missy & Staff go above and beyond to explain the benefits of drinking the Ionized/Alkaline water along with a healthy diet. Since drinking the water I have more energy & mental clarity. I was also able to get a foot detox and have a sauna session, which along with the water boosted my energy level even more. So glad I stopped in, met Missy and jumped on the Alkaline water train! Thank you Peak Alkalinty!\n-Emily Stuckey Sellers", "pics": null, "resp": {"time": 1575821163157, "text": "Emily, we have so enjoyed having you and the kids in regularly! We’re thrilled that you’ve noticed improvements. With your schedule, we know that you can use all the “boosting” you can get!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "104424771729032150959", "name": "Heidi Will", "time": 1547949022969, "rating": 5.0, "text": "What a unique business! Missy and her staff possess an impressive knowledge set backed by years of research, and are super nice, too! We enjoyed the detox foot bath and far-infrared sauna today, and of course refilled our reusable water bottles with their ionized alkaline water. Great way to learn about the numerous benefits of ionized water, and invest in your health.", "pics": null, "resp": {"time": 1548368886205, "text": "Thank you so much, Heidi! We really appreciate your kind words and look forward to talking to you soon!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "101044288099792352714", "name": "jkdsdmf", "time": 1575394934172, "rating": 4.0, "text": "Seems like alkaline water would help some people. Not particularly me though.  Knowledgeable and caring staff are two of the things you can expect when visiting this business.", "pics": null, "resp": {"time": 1575475815681, "text": "So sorry that your desired results weren’t experienced. If you’d like to come in and talk it through, we may be able to help alter the specifics of what’s needed to help. Thank you for coming in and for acknowledging our caring staff."}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "104228551516771168364", "name": "Barb Stassen", "time": 1576516504276, "rating": 5.0, "text": "Everyone who works here is very helpful. It's always a pleasure to stop in.", "pics": null, "resp": {"time": 1576533463295, "text": "Barb, appreciate your kind words. We enjoy seeing you as well."}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "101844814231602146976", "name": "Maurice Morrisette", "time": 1574366217875, "rating": 5.0, "text": "This is a company that genuinely cares for you. They're not there just to make a sell.", "pics": null, "resp": {"time": 1574370649026, "text": "Thank you, coach! That’s what we strive for! Good seeing you each week!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "104845316487976267239", "name": "Tami Williams", "time": 1573927629241, "rating": 5.0, "text": "Missy and the entire staff are extremely knowledgeable, helpful, friendly and caring.", "pics": null, "resp": {"time": 1573982472813, "text": "Tami, love having you in regularly. You did an excellent job in the vid! A star is born! 😁"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "110683132212576732135", "name": "carrie devolder-edwards", "time": 1576779185715, "rating": 5.0, "text": "Everyone could benefit from Prak Alk services & different ph levels of water for everything in life. You are treated like family!", "pics": null, "resp": {"time": 1576783345053, "text": "Thanks, Carrie! We’re very blessed to have an “extended family” via our clientele. It’s an honor to help!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "107850941627328347402", "name": "Eric Friese", "time": 1559695102384, "rating": 5.0, "text": "I love Peak Alkalinity! I’ve struggled with acid reflux for so long. Drinking alkaline water from Peak Alkalinity helped that immediately. Missy and her staff are great!", "pics": null, "resp": {"time": 1560272289431, "text": "Thank you for the review and we are happy to have helped!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "107028945166885212747", "name": "Glenda Turnbow", "time": 1531495496042, "rating": 5.0, "text": "Had my first foot detox, last Saturday it was very informative.  I slept so good after my detox,  I haven't slept that good in years.  I wanted to wait a few days before I made a review, and I must say,  I have notice a little more energy this week, scheduling my next one now!", "pics": null, "resp": {"time": 1533153451974, "text": "Glenda, we are thrilled for you! Thank you so much for the great review and are looking forward to seeing you again soon!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "109999653082171284154", "name": "Danielle Mccord", "time": 1537706310681, "rating": 5.0, "text": "One of the nicest places clean neat and friendly service Emma is fantastic. Emma was a huge help in understanding the detox. Will most definitely going back.", "pics": null, "resp": {"time": 1537909262568, "text": "Thank you so much, Danielle for visiting us! We are thrilled that Emma was such a great help! We look forward to seeing you again soon!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "115018915785208052568", "name": "Sean Sullivan", "time": 1557842454767, "rating": 5.0, "text": "Felt amazing after my foot detox and I love the alkaline water!", "pics": null, "resp": {"time": 1558645017571, "text": "Sean, thank you so much for wonderful review! Was happy to meet your Mom! She loved the foot detox that you purchased for her as well."}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "100462622528917477019", "name": "Greg Wall", "time": 1576859615686, "rating": 5.0, "text": "Peak not only has great products that my family relies on daily but Peaks passion for their clients health and well being is why I will only purchase from Peak.", "pics": null, "resp": {"time": 1576871849519, "text": "Thanks for the great review, Greg! We’re stoked about having our products in CO!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "108022263596083176346", "name": "Kameren Bowie", "time": 1560260755856, "rating": 5.0, "text": "If you’re looking to detox and rid indigestion peak alkalinity is your place. Missy will take care you and is so energetic about getting you healthy.", "pics": null, "resp": {"time": 1560272159130, "text": "Thank you so much Kameren for your amazing review!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "100692022562873549492", "name": "Sean McClay", "time": 1574782458710, "rating": 5.0, "text": "Love the idea! Love the way they educate you about alkalinity.  Hoping to try the sauna soon.", "pics": null, "resp": {"time": 1518814454745, "text": "We are thrilled to hear this! Thank you so much, Sean, for the great review! We are looking forward to seeing you soon!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "103747289634684322215", "name": "Ricky Louis", "time": 1560260364425, "rating": 5.0, "text": "The owners  love what they do and love to help.", "pics": null, "resp": {"time": 1560272210358, "text": "Thank you Ricky! I'm glad you found us to be helpful!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "100735156674403404718", "name": "Zachary Wilson", "time": 1542504676960, "rating": 5.0, "text": "An amazing organization that puts people first and business second, helping people realize the importance of clean water and the amazing benefits ionization can have on the body.", "pics": null, "resp": {"time": 1543514725496, "text": "Thank you so much, Zachary. We love helping people in and out of our community as well as educating them on how they can maximize their health!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "106114572683656781241", "name": "Donna Lucas", "time": 1603572346554, "rating": 5.0, "text": "Make your body thrive with Peak Alkalinity!!!", "pics": null, "resp": {"time": 1604582233533, "text": "Thanks Donna! Happy to have had you in! 😊"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "112464777080144149472", "name": "David Rounsaville", "time": 1559670864592, "rating": 5.0, "text": "Missy goes way over the top to explain how and why alkaline water is beneficial to the health! She knows her stuff!", "pics": null, "resp": {"time": 1560272313260, "text": "Thank you David for the great review!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "115628833202727503646", "name": "Amber Granato", "time": 1583245785249, "rating": 5.0, "text": "Customer service is always a priority at Peak! Thank you", "pics": null, "resp": {"time": 1583273921184, "text": "Thanks, Amber! That’s what we strive for!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "115675035670514824078", "name": "Pete Canarela", "time": 1574194564266, "rating": 5.0, "text": "Great products!!  Very helpful Staff!!!!!!", "pics": null, "resp": {"time": 1574202316103, "text": "Thanks Pete!"}, "gmap_id": "0x889a4090727850d3:0x6a8f471b7e1a938c"}
{"user_id": "112460711185049162339", "name": "Terry Hebert", "time": 1619635034938, "rating": 5.0, "text": "The staff are always friendly and helpful. They remember your name and all happily serve to make your visit a wonderful experience. The sauna is my \"happy place\"! I highly recommend this location!!!", "pics": null, "resp": null, "gmap_id": "0x8888a9449f5a96eb:0x357b34ee3c413093"}
{"user_id": "109564984095590372772", "name": "Susan Benton (30A EATS)", "time": 1604578042918, "rating": 5.0, "text": "Great service. Love the infrared sauna.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMuGcXYybOWUY2RsFVAvQRlirM-jn8k--v4LBoH=w150-h150-k-no-p"]}], "resp": {"time": 1604578724008, "text": "Thank you Susan! It’s our pleasure!"}, "gmap_id": "0x8888a9449f5a96eb:0x357b34ee3c413093"}
{"user_id": "109761077326352749620", "name": "Chase Day", "time": 1619619413275, "rating": 5.0, "text": "Purify U has been consistently my favorite way to treat myself before, during, and after the pandemic. The staff here is always friendly and makes you feel welcome. I go for the infrared sauna (clean!), but there are many other options to take care of your body and mind.", "pics": null, "resp": {"time": 1619626281218, "text": "Thank You for your review! We love seeing you Chase!!"}, "gmap_id": "0x8888a9449f5a96eb:0x357b34ee3c413093"}
{"user_id": "100688606757469981141", "name": "Cynitha Chick", "time": 1603158215218, "rating": 5.0, "text": "Love this place. The staff is great. Go if you wanna relax.", "pics": null, "resp": {"time": 1604578774431, "text": "Thank you Cynthia! We appreciate the gold stars for our staff!"}, "gmap_id": "0x8888a9449f5a96eb:0x357b34ee3c413093"}
{"user_id": "115384499657165185906", "name": "Tara Rose-Campbell (Mary Kay by Tara)", "time": 1575659902510, "rating": 5.0, "text": "Purify U is a great place to workout, relax, and enjoy. I have been going for a month and do not know what I would do without it! The people and facility are great. Alkaline and chlorophyll water are a plus.", "pics": null, "resp": {"time": 1575674957983, "text": "Thank you Tara! We love seeing you and we are happy to know you are enjoying PurifyU your self care wellness studio✨"}, "gmap_id": "0x8888a9449f5a96eb:0x357b34ee3c413093"}
{"user_id": "114649048437500421695", "name": "Jill Woods", "time": 1563209809809, "rating": 5.0, "text": "I use Purify U almost every day. Being a 3 time cancer survivor I have found it very beneficial to my overall well being. The staff is unbelievable, so very helpful and full of knowledge to make my time there the best it can be. It’s a great place with great people neither would I ever give up.", "pics": null, "resp": {"time": 1563219780167, "text": "Jill, it is our privelege to partner with you in maintaining your ultimate health. Thank you for being such an integral part of our community. And thank you for taking the time to share your story on google!"}, "gmap_id": "0x8888a9449f5a96eb:0x357b34ee3c413093"}
{"user_id": "108101809088493914306", "name": "Beyond The Altar Ministries", "time": 1562795836306, "rating": 5.0, "text": "You guys have all the answers to my prayers in one building!\nI began to de-Stress the moment I walked in the door! 🙏🏽 No Fluff! Before I knew what you offered or was it for me... but I know now.\n\nI’m so excited about our day! My daughter and her daughter felt so much positive energy in your place\n\nYou already know I will pass out your cards next week but as a travel agent your place and packages will be featured in our THINGS TO DO IN TTOWN\n\nThank you for your hospitality and sincere kindness beyond creating a sale. Your genuineness was a double blessing in our day.\n\nBlessings to you all🙏🏽\n\nP.S. I forgot to mention that I was dealing with junk in my throat and nose. We were heading for coffee when my daughter said let’s try this spa first then get coffee. I noticed a difference big time in the salt therapy room. No coffee needed.!!!!", "pics": null, "resp": {"time": 1562796189401, "text": "Cece, we were honored to spend time with you and your daughter today! Thank you so much for taking the time to leave us such an amazing review. Blessings to you both!"}, "gmap_id": "0x8888a9449f5a96eb:0x357b34ee3c413093"}
{"user_id": "118385665753737512363", "name": "Preston Adair", "time": 1536341629073, "rating": 5.0, "text": "I love this wellness spa! I am always looking for the best ways to manage symptoms of an autoimmune disease and purify U is my best resource. I use the power plates to aid in post workout recovery and feel like the salt booth and sauna are helping with inflammation. I’m so excited to finally have these options in Tuscaloosa...all in one place! Plus the staff takes really good care of the clients. I look forward to every visit!!", "pics": null, "resp": {"time": 1562435599928, "text": "Preston, we are grateful to be a part of your healing and feeling better plan! Thank you for sharing."}, "gmap_id": "0x8888a9449f5a96eb:0x357b34ee3c413093"}
{"user_id": "103393149990089813039", "name": "Connie Grechanik", "time": 1567197173698, "rating": 5.0, "text": "What an incredible experience!  I look forward to spending more time there getting back to perfect wellness!", "pics": null, "resp": {"time": 1571685182402, "text": "We are happy to know you loved your experience!  We look forward to seeing you again!!"}, "gmap_id": "0x8888a9449f5a96eb:0x357b34ee3c413093"}
{"user_id": "114935059081464759689", "name": "Lois Bankston", "time": 1535808502804, "rating": 5.0, "text": "After only three visits, I can already tell that my metabolism is higher. I have a mild case of psoriasis as well as sinus issues, and the salt therapy is improving that, as well. The power plate is amazing! The vibrations from it have completely worked out a muscle issue I’ve had in my shoulder for some time. The infrared sauna is fabulous - the light and heat feel so good, and you burn calories and detoxify, among other things, as you relax. The entire experience is extremely enjoyable, and Brenda is well-qualified to work with you to address any wellness concerns. I will definitely continue to be a regular participant and recommend Purify U to anyone who wants to optimize his or her well-being.", "pics": null, "resp": {"time": 1562693124416, "text": "Lois, thank you for sharing about your experience at Purify U! We are so happy to hear about how Purify U has changed your life for the better. We look forward to seeing you at your next visit!"}, "gmap_id": "0x8888a9449f5a96eb:0x357b34ee3c413093"}
{"user_id": "112132243471637126005", "name": "Allye Deerman", "time": 1543350712277, "rating": 5.0, "text": "PurifyU is my new favorite place!\nYour welcomed by a lovely spa aroma & a friendly staff.   Everyone is very knowledgeable.  I would recommend getting the package where you can use all three options (sauna, salt, & power-plate) It’s all amazing!!!   I love that I can get a quick but very effective workout in, then relax in the salt sauna.   Thank you Brenda for bringing this awesome addition to Ttown!", "pics": null, "resp": {"time": 1562690813156, "text": "Thanks for the awesome review, Allye!! We are excited Purify U has had such a great impact on your life!"}, "gmap_id": "0x8888a9449f5a96eb:0x357b34ee3c413093"}
{"user_id": "102382464021408017248", "name": "Jann Simpson", "time": 1537205333693, "rating": 5.0, "text": "I've been a patient of Brenda Branch for a while now, and I simply cannot express how great she and her services are! Not only did she help me put an autoimmune disease into remission, but now that I have experienced PurifyU Spa, I am even more impressed!  An hour's  workout in 10 minutes with the Power-plates!  The Oh.... so..... relaxing Detox in the Infrared Sauna :-)  The invigorating Salt therapy, Naturopathy Consultations, Natures Sunshine supplements and all of the wonderful perks like fresh lemon water, cool compresses, etc.. make this place a Class Act!  She and the entire staff truly care about health and wellness! You will not be disappointed!", "pics": null, "resp": {"time": 1562692927729, "text": "Jann, we are happy to know we made such a positive impact on your life and helped improve your health! Thank you for sharing your experience with us!"}, "gmap_id": "0x8888a9449f5a96eb:0x357b34ee3c413093"}
{"user_id": "102700482478542022239", "name": "Mary Navarro", "time": 1536605327460, "rating": 5.0, "text": "I love the salt therapy!  It really helps my many allergies!", "pics": null, "resp": {"time": 1562693058220, "text": "Thank you for sharing your experience with us, Mary! We are so happy to hear that Salt Therapy helped your allergies!"}, "gmap_id": "0x8888a9449f5a96eb:0x357b34ee3c413093"}
{"user_id": "102046463643503444326", "name": "Nina Williams", "time": 1562689615126, "rating": 5.0, "text": "I look forward to my Purifyu sessions every week! On my lunch break or before work, the sauna especially gives me relief from exercise soreness and daily stress!!", "pics": null, "resp": {"time": 1562690757704, "text": "Nina, we are incredibly grateful that you took the time to leave us a review! We love seeing your smiling face every week!"}, "gmap_id": "0x8888a9449f5a96eb:0x357b34ee3c413093"}
{"user_id": "117402602723585375882", "name": "debbie hillard", "time": 1536104373011, "rating": 5.0, "text": "Power Plate, Salt therapy, and infrared Sauna, it is the best spot in town!", "pics": null, "resp": {"time": 1562689800221, "text": "We are incredibly grateful that you took the time to leave us a review! It's customers like you that make our job wonderful. We look forward to seeing you again!"}, "gmap_id": "0x8888a9449f5a96eb:0x357b34ee3c413093"}
