{"user_id": "105299530302514936460", "name": "Robert Williams", "time": 1623627264862, "rating": 5.0, "text": "While looking for a new mower I found Hedden and stopped in and asked some questions. They really know the equipment they sell and offered me a great deal on a zero turn. I purchased one and even got it delivered, great customer service and great assembly and instruction when it was delivered. Thank you so much.", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "101478482807469811868", "name": "Julian Todd", "time": 1623112770022, "rating": 5.0, "text": "It's a great family business. This was the first place in town that answer all of my questions in regards to the mower I was purchasing. Made me feel very welcome. The staff was very knowledgeable and understanding. I will definitely be doing my business here from now on.", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "106720764216927281159", "name": "Owen", "time": 1614350963205, "rating": 5.0, "text": "I bought my homeowner zero turn from Hedden, and after 7years and just as happy as the day I bought it. The gravely is an outstanding mower, but the dealer does make the difference. Every spring I take advantage of Hedden's tune-up special, and get all routine maintenance done. They also do only what is needed, and will ask before any recommended work so there are no \"surprised. The mower always comes back clean, sharp, and ready for another flawless season. This is a great place to do business.", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "101480536058842602685", "name": "Peri LaTorre-North", "time": 1627663779456, "rating": 5.0, "text": "Great customer service! We'll be back.", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "107299144879275199146", "name": "mark hudson", "time": 1616005275491, "rating": 5.0, "text": "Bought a z turn mower.  Mark was very helpful in selecting the right make and model for my property, and gave me a very good price. Good folks. Highly recommend doing business with them!", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "104706642954005282692", "name": "Emily Todd", "time": 1623112726278, "rating": 5.0, "text": "Very family friendly. They were willing to answer all of my questions and were very patient.", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "117375688469333558978", "name": "Dustin Pressler", "time": 1614867907079, "rating": 5.0, "text": "I have been looking for a certain hedge trimmer and after calling 20 places I stopped in to see Mark and wouldn't you know he had it in stock. Excellent service and hassle free. Highly recommend", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "108966260159260909008", "name": "BYRON Johnson", "time": 1617452746717, "rating": 5.0, "text": "Great experience! Kind and Knowledgeable staff. Definitely will be back.", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "106773379780679129112", "name": "George Yandric", "time": 1600275720431, "rating": 5.0, "text": "This is a great place to do business. Mark is an extremely nice guy and I am completely satisfied with the whole sales process.", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "113862108449082692283", "name": "Zeke H", "time": 1565447937700, "rating": 4.0, "text": "I got a great deal on a Z mower and I love it. Buying at Hedden was easy, fast and simple. The owner of Hedden was a fantastic guide to the mower, and answered or better yet, showed me answers to all my question. Really this is a 5 star company but I deducted one star because the owner did not follow up after the sale. I would have expected this had I purchased the mower at Lowes or Home Depot. Otherwise, I'm happy with Hedden and I will buy my next mower from them. Oh yeah, the guy that delivered my mower was great and very knowledgeable. Remember to buy local and support people in the near community.", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "109696859316229245429", "name": "James Holder", "time": 1587582354866, "rating": 1.0, "text": "Called to price a new part didn’t give me a chance to tell her what all I needed wanted to charge 50 dollars in freight to order a mower deck for a rider.Told her I could order from Gravely direct and didn’t have to pay that amount for shipping needed to order about 300 dollars or so in parts but I will order direct because the young lady I talked to was short spoken and didn’t seem as if she wanted my business. I have purchased here before and had good service but not again.", "pics": null, "resp": {"time": 1587587365758, "text": "We are sorry for your experience.  We only pass along shipping that is charged to us.  We are sent mower decks by truck line and are charged by size, which is why this amount was higher than a normal freight charge for a parts order.  Again, we are sorry for your experience as we pride ourselves in giving great customer service."}, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "114190124474706826603", "name": "Kelly Helser", "time": 1569033564827, "rating": 5.0, "text": "I've taken an older chainsaw and lawn mower to Hedden a couple times over the past few years to keep them running. I've been more than happy with the price and when I pick up my equipment it runs better than new. It's a great feeling to find a shop that you're always confident that they'll do a high quality job and deal fairly with you.", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "105293078779637712618", "name": "John Griffin", "time": 1560188968097, "rating": 5.0, "text": "Great folks to deal with that have an absolutely great attitude of really trying to help their customers. I've done business with them at least 6 times and am very pleased every time. I will continue to do business with them in the future.", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "117132551032139033568", "name": "Todd Edwards", "time": 1587072876069, "rating": 5.0, "text": "will be using hedden again.after the last two trips to a well known huntsville small engine shop that didn't have simple things like blades and a belt.hedden had my off the wall belt 167\" in stock and waiting at the parts counter when i got there 10 min later.will be back.", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "100405558825939297594", "name": "Thomas Webber", "time": 1592926805785, "rating": 5.0, "text": "Great people and always willing to share knowledge and help.", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "113590017509221144185", "name": "Reggie Hubbard", "time": 1519693743391, "rating": 5.0, "text": "I just bought my first zero turn mower. I am not a 'for hire' professional, but I've been mowing grass for what seems like my whole life! Mark and crew answered all of my questions, asked me quite a few questions, and then gave me fair comparisons on all the models that were best suited to my needs. If service, honesty, and shopping local mean anything to you, give them a shot at earning your business. You won't be disappointed!", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "104706452836727849761", "name": "Wes Roland", "time": 1534775760555, "rating": 5.0, "text": "I recently purchased a zero turn from Hedden Lawn & Garden and the service was top notch.  I visited several other stores around town before making a decision on my purchase, and the experience at Hedden was far and away the best customer service I encountered.  I went in multiple times before I made up my mind, and every time they were extremely professional, knowledgeable, and remembered who I was.  This is a fantastic business, and all of my servicing and future equipment will be purchased from them.  If you are in the market for any new/used equipment, or if you need any existing equipment serviced, do yourself a favor and check out Hedden.", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "101758069620420649231", "name": "Bruce Rogers", "time": 1604961594674, "rating": 5.0, "text": "1) Had a problem with my push  lawn mower, would not stay started and Mr. Hedden said give me 5 minutes and just like that it runs like a dream. Not sure what he did but thanks\n2) Three weeks later I had work done on my 17 year old LX-277 John Deere and they did a wonderful job on the repairs, runs like new I will definitely come back thanks again\n3) After another year I needed some tires and a good once over on my\nLX-277 and they got it turned around extremely fast I will continue to rely on Hedden Lawn & Garden !", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "111206971607468786399", "name": "Darlene Carpenter", "time": 1557930720772, "rating": 5.0, "text": "What a treat to find great service and wonderful helpful knowledgeable folks! Been looking for a gas cap for my Husvarna, they didn’t have it in stock, but ordered one for me. Great people good price and best attitude!", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "101847828694268147598", "name": "Debbie Parker", "time": 1557682056217, "rating": 5.0, "text": "I've used Hedden's a few times. The great customer service they provide, prices and knowledge set them apart. I will be returning and I recommend them highly.", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "116093712474727688990", "name": "Trevor Newton", "time": 1530193959302, "rating": 5.0, "text": "Great service and great people! Never been turned down from anything here. If you have any problems with your mower, weed water, push mower, etc..come to Hedden Lawn & and Garden they will leave you happy and satisfied! Great customer service!", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "109673295918836825679", "name": "Richard Richardson", "time": 1492704549754, "rating": 5.0, "text": "Awesome experience. I bought a 60 zero turn gravely that has worked very well. I have a 5 acre lot to cut and this is the best mower I have jad. I also bought a weed eater from there. The customer service was great. Very nice and professional. I would recommend them to anyone looking for lawn equipment", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "109217109076052181805", "name": "Davy Thurmond", "time": 1530193821553, "rating": 5.0, "text": "I personally have bought 2 mowers from Mark and I’m in the process of buying another mower. Also I have had over 10 bought by friends and family. Marks customer service is the best in town IMO and as long as I buy new mowers Hedden Lawn and Garden will be my go to place for all my mowers. I own a Lawncare business and anytime I’ve had a problem which isn’t very often he has always made sure that I haven’t been without a mower. This is another reason why I will always continue to go see Mark. These guys treat you like family. And that’s the kind of place I will continue to keep my business!!!! They have definitely earned a lifetime customer!!!!!", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "109180880621997802183", "name": "Lowery Family Lawn Care", "time": 1493946518779, "rating": 5.0, "text": "It was a wonderful experience shopping here. Mark was very professional. He took the time to educate us on the equipment. He went above and beyond to ensure our needs were met. We will be continuing to do business with Hedden Lawn &a Garden for a long time.", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "118238044605074379418", "name": "Chris Cousins", "time": 1441198524736, "rating": 5.0, "text": "After going to Hedden Lawn and Garden, I will never go to a big box store again.  Mark helped me decide on the model that best suited my needs and gave me a fair price.  I strongly recommend stopping in and seeing what they have to offer.", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "114528150780998902271", "name": "Jeremy Carrick", "time": 1538789554082, "rating": 5.0, "text": "Great people, go above and beyond for there customers. Bought a brand new pro turn 460 that had problems before 100 hrs they replaced it with another one with 0hrs on it straight from factory within 2 weeks. 😁", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "107207325299255416123", "name": "Roger Little", "time": 1472742082484, "rating": 5.0, "text": "I was in the market to purchase a new mower and the Gravely/Ariens mowers seemed to be much better built than the mowers at the big box stores and were competitively priced as well.  Mark was great to work with and even personally delivered my new mower to my house on the same day  I purchased.  Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "114941534438374110950", "name": "Kian Dykstra", "time": 1534956484933, "rating": 1.0, "text": "Had a tune-up done on my mower last year.  This year informed that the blades were never lubricated with non-seizing lube at Hedden so my blades can no longer be removed from my mower.  NOT GOOD!", "pics": null, "resp": {"time": 1534964764936, "text": "We are sorry you are having trouble.  We do use impact when putting blades on for safety reasons.  If you want to bring your mower in, we will gladly get your blades off."}, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "117410259115069512567", "name": "Ryan Lindow", "time": 1541106965315, "rating": 5.0, "text": "Great service! Mark and crew went above and beyond to get me back in the field today. Thanks guys.", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "115182999869237957007", "name": "h h", "time": 1489179908395, "rating": 5.0, "text": "Called about a filter for my Maruyama and went up there and received excellent service and help.  Even took the time to help me put on the filter and an edger blade. This is an excellent business that understands their product and customer service.", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "114176386208854347161", "name": "Gary Kay", "time": 1426256476171, "rating": 5.0, "text": "I have been running Gravely mowers for over 10 years, they are great mowers. They don't break often but when they do Mark and his crew will take care of it asap. They do whatever it takes to keep us mowing. They are always friendly and very helpful.", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "102489616807076079406", "name": "michael taylor", "time": 1296916803704, "rating": 5.0, "text": "Had my mower in the shop recently for service and saved a bunch of money!! The mechanic was very helpful and done a great job. Parts were very reasonable. You guys have a customer for life!!\nI will be back and will tell my neighbors", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "115981313106955572678", "name": "Andrew Chancellor", "time": 1437600560339, "rating": 5.0, "text": "Had a great experience. Had them repair two chainsaws which have been sitting for years. Great service, quick turn around and reasonable prices.", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "105969574643934975094", "name": "Frank Smith", "time": 1532980543141, "rating": 5.0, "text": "Mark is good people. Always takes care of customers and sells a great line of equipment.", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "115715700661677803897", "name": "Mow Hawk Lawn Care", "time": 1495407705442, "rating": 5.0, "text": "My company has been searching for a new lawn mower repair shop, and Hedden Lawn & Garden has earned our business.  They'll fix any brand of equipment you take to them, and fix it faster than any other lawn mower repair shop in Huntsville.", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "114107939370863520730", "name": "Robert Justice", "time": 1385240656967, "rating": 5.0, "text": "Honest, hardworking shop of great people. Provides great advice and great service. Good selection of equipment, especially for commercial landscapers.", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "107205507982950645700", "name": "Mark Tcherneshoff", "time": 1533898568360, "rating": 5.0, "text": "I have been very impressed with the service I've been provided by Hedden Lawn & Garden. We just purchased our second Gravely from this store ... we love it.", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "112372643253562956800", "name": "Shelly Cagle", "time": 1365809765389, "rating": 5.0, "text": "I had a great experience with Hedden Lawn and Garden and that means a lot being a female. They quoted me a price and stuck to it. I will defiantly use them from now on.", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "105515250038010236491", "name": "Brian Patz", "time": 1436639038655, "rating": 5.0, "text": "Great products, service, and customer care! Mark, the owner, was very helpful in helping me find the right mower for my needs", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "110713947051726751978", "name": "Elaine Tcherneshoff", "time": 1488566805502, "rating": 5.0, "text": "They have been repairing our equipment for about 2 years now and we just bought our 2nd mower. Always great service!", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "111526995661543438832", "name": "blake stilwell", "time": 1434492384839, "rating": 5.0, "text": "I bought a zero turn gravely from them last year. They were very friendly and professional. The lawn mower has been great and has been everything I wanted and expected. Overall I belive they are great to do business with and have quality equitment. I would defiantly recommend them to anyone I know.\n\nThanks for the great experience.\nBlake Stilwell", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "106585858417373742560", "name": "Ron Conway", "time": 1471104108087, "rating": 5.0, "text": "Great customer service. Always a positive experience", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "102564862353844967003", "name": "mary malone", "time": 1554825510161, "rating": 5.0, "text": "Always a pleasure to do business with them", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "106402278739177001187", "name": "george harrell", "time": 1518127805124, "rating": 5.0, "text": "Mark is the best lawn equipment dealer in town.", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "101151683696626614352", "name": "Daniel Cole", "time": 1372342201852, "rating": 5.0, "text": "They have helped me on several occasions get my home equipment back in shape.  Very friendly, very helpful, good prices.", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "105744059205128826793", "name": "Steven Williams", "time": 1529521392165, "rating": 5.0, "text": "Great place to buy a mower and get parts", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "103878138242384667572", "name": "Greg Reaves", "time": 1498836266934, "rating": 5.0, "text": "Great customer service!  Found my permanent lawn mower repair company!", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "107811243775827637063", "name": "Daniel M", "time": 1543439734391, "rating": 5.0, "text": "Mark and his family are in the business of helping everyone with a need for lawn equipment or repairing lawn equipment, doesn't matter if your a standard consumer or a commercial customer, they take pride in what they do!", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "114912676920958731148", "name": "David Cooper", "time": 1459275665404, "rating": 5.0, "text": "Great service ...knowledgeable and very helpful Techs.  Will do business with them again!!", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "111279377637571777477", "name": "Thomas McLean", "time": 1385071666862, "rating": 5.0, "text": "Had several problems with Cub Cadet Lawn tractor 1045. They came to my house picked the unit up and had it back in 3 business days. They correctly diagnosed the problem (others had not) and gave me an accurate estimate. They won me as a permanent customer.", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "111508843192649056641", "name": "Gary Bridges", "time": 1551137509236, "rating": 5.0, "text": "You couldn't ask for better people to do business with.", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "105768533841608383235", "name": "wilbert peterson", "time": 1533915340323, "rating": 5.0, "text": "Great Service and friendly", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "110903555962437307293", "name": "Parke Keith", "time": 1487477653900, "rating": 5.0, "text": "Great service.", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "106941746537333544789", "name": "Christian Runge", "time": 1540937406627, "rating": 5.0, "text": "Great products", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "103411840429035234871", "name": "Macy Leona Meeks Meeks", "time": 1447786885706, "rating": 5.0, "text": "The service was great", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "103415501545529219277", "name": "Robin", "time": 1533236933454, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "105190102777533019277", "name": "Jason Morgan", "time": 1472162018037, "rating": 5.0, "text": "Great service, thanks", "pics": null, "resp": null, "gmap_id": "0x88626cc65d349351:0x4778ec70a7e8f291"}
{"user_id": "101026279768692059357", "name": "Todd Kirkland", "time": 1627055757790, "rating": 5.0, "text": "It is a great place.  Always helpful.\nFast and friendly people", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "118026136115828926019", "name": "Flippin Over2021", "time": 1625255791769, "rating": 1.0, "text": "They had lawn mower 1 week called to go pick up was told they were to busy and hadn't been able to work on it, said it will be done the following week,  called to pick up the second week and it still wasn't done. Had to pay $100 to have lawn care done. Finally 1 month later they said it was  done ✔ husband went to pick it up and it didn't start! Was told they don't understand why but will get right on it. Paid for lawn care again  $100! They called a week later said there was bad gas in in and they cleaned it out and did whatever else. A week later they call and complain that they need the room to come get it.  Husband is a truck driver he tried to pick it up but everytime he called they were either working on it or it wasn't done. We paid for lawn care again $100! Finally mower is done they offer to bring it and  tell us they are delivering in an hour. Got the money and didn't show! Next day husband called they said they were going to be here in 45 minutes.  2 and a half hours later I called and was  the person that answered was rude telling me they are busy, finally the lawnmower shows up! The driver \"Lee\" was extremely rude and had no apology for not coming when they said instead blamed all the problems on our mower! Including the gas going bad from sitting at the shop! We have done business with Sam's for years, NEVER AGAIN!\nJUST TRIED TO MOW FRONT YARD, THE MOWER SMOKED AFTER 5 MINUTES! GREAT JOB!🤬🤬🤬", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "100358378541457297160", "name": "Kei “Keikei” Da Fool", "time": 1623192501226, "rating": 5.0, "text": "Super cool shop and the guys were very knowledgeable and had excellent customer service!!!", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "112505243499214893388", "name": "john toth", "time": 1621902039110, "rating": 4.0, "text": "Good service reasonable prices", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "116936685189715166545", "name": "alfonzo hamilton", "time": 1621871475150, "rating": 5.0, "text": "They're always very busy but helpful", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "118249585298112336827", "name": "j silvey", "time": 1603932039363, "rating": 1.0, "text": "Dropped of my son's go cart in May, for the to repair a sticking throttle. Checked in every couple weeks to be told soon, next week, may the week after. I get that places are busy, but it got to be way too long.6 months, SERIOUSLY! 6 MONTHS. Finally I drive there, in my car, they tell me they can't fix it, no parts for that kind of cart. Then was told the cart repair guy quit/fired. 6 months not a call, nothing. So, our neighbor goes and picks up the cart. These guys load it with a forklift. Onto her small trailer. Now we have a cart that went in for a sticking throttle, no repairs done, we get it back, with 2 flat tires, and wont start at all now, I'm sure from sitting in the storage lot out in the rain for 1/2 a year. If you have a cart there, y'all better call because they arent fixing anything. As a side note, was told I could pick the cart up on a Saturday, go up and a random handwritten sign says on vacation until October 18th. Could have mentioned that when we were there, or when we called to verify hours. Went the following Saturday, the 24th, OPEN sign is on, not a soul to be found. NO REPAIRS, NO COMMUNICATION, NO CUSTOMER SERVICE. HOW ON EARTH ARE YOU GUYS EVEN IN BUSINESS?", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "114299734707998839075", "name": "Danielle Silvey", "time": 1603816258593, "rating": 1.0, "text": "TERRIBLE customer service!! Had our go kart for 8 months kept putting us off then FINALLY told us they couldn't fix it after 8 months!!  Then went TWICE to pick it up an they were closed  when we had called ahead of time an were told they were open!! Will NEVER go back there again!!! DO NOT RECOMMEND!!!", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "107517992457130137672", "name": "Cheshire Cat", "time": 1600703781801, "rating": 5.0, "text": "I've been using Sam's for years, to do my yearly maintenance,  as well as any repairs my Husqvarna riding mowers have needed. They've ALWAYS done an excellent job at keeping them in top operating condition at a reasonable rate, with timely service. I recently had some issues with one of my mowers, that they repaired, but 10 minutes into mowing, it broke down again. Needless to say, I was upset, and called to speak to the manager. I explained my maintenance and repair record and that I felt if everything had been done correctly, I wouldn't be having these issues. He told me to bring it back, and he would see to it that I was taken care of. He was true to his word, and now I'm back on a like new machine. I understand that they've been very short handed and working long hours due to covid19,  and God knows nobody's perfect, but he handled this customer like a good, honest businessman should. And really,  that's 5 stars right there. Add to that, the great service I've always gotten there...I will continue to recommend Sam's Small Engine.", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "111323289126678858439", "name": "Gary Corbitt", "time": 1619463321627, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "105967912640323737663", "name": "Helen Gerretson", "time": 1579291932225, "rating": 5.0, "text": "A call to Sam’s gave me the information and I took my push mower in for tuneup and repair. The cost was indeed in the window he gave me over the phone and a fair deal. The receipt is itemized. I’m taking my chainsaw there as Sam’s is now my go to place for small engine tool repairs.", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "114211338391244576841", "name": "Jim Evans", "time": 1600183778966, "rating": 5.0, "text": "Friendly people and Great service", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "117708371635560072420", "name": "Brian Dothan", "time": 1566051655410, "rating": 1.0, "text": "I bought a Stihl chainsaw from them and used it once. A year later it would not start. They told me it was no good and need to be replaced. WHAT???? It's a STIHL!!\n\nI took it home. Add some Mystery Oil in the block and waited 24 hours. Then it start easily and has been running for 9 years.\n\nThen they said the same thing about our generator which my employee took by there without my permission. They told him that the engine was no good and needed to be replaced.\n\nI told my employee to take it to another small engine shop. it was a small repairs and NOT a bad engine. We used it after Hurrican Michael.\n\nNever.. use Sams Small Engine", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "115762942143863486142", "name": "Ray", "time": 1502306427664, "rating": 5.0, "text": "I go there and every last employee is busy as can but someone always helps you instantly. They are always friendly & knowledgeable. Five stars is not enough!!", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "102609510264540140415", "name": "Daniel Bass", "time": 1539614508507, "rating": 5.0, "text": "Good prices on equiptment and on repairs. Awesome family atmosphere. And repairs are done in a timely manner. Would recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "114457688626813740472", "name": "Summer Magnuson", "time": 1553805408361, "rating": 5.0, "text": "Really know what they're doing. Fast work and very fair price.", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "109188734156614297892", "name": "Wale R", "time": 1533687707609, "rating": 5.0, "text": "Lee and Sam made me feel like family and the repairs were flawless! I highly recommend thsee guys", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "113485344350477658362", "name": "Carrie Harville", "time": 1537990210836, "rating": 5.0, "text": "Great customer care and fast turn around! Reasonable prices.", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "116716706475881910299", "name": "Tony Risor", "time": 1569072764072, "rating": 5.0, "text": "Always helpful and good on price", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "102617065842601460544", "name": "Mike Labanowski", "time": 1561222963317, "rating": 5.0, "text": "Quick service at a very fair price..", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "106687295311699638415", "name": "Matthew Cherry", "time": 1540660616034, "rating": 5.0, "text": "Quick and efficient service. Had plenty of everything in stock and prices are reasonable.", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "111394740194325454021", "name": "Ronald Bush", "time": 1534516300180, "rating": 5.0, "text": "Great place for parts. Very helpful and with great attitude.", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "101610343214816881360", "name": "Paul Meyers", "time": 1470442026914, "rating": 5.0, "text": "Been coming here for years.  They fix it first time, everytime.  It's good to know there are good people like these that don't mind working for a dollar rather than just 'taking' it from ya.", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "105764812129854082763", "name": "Pete Peterson", "time": 1561665996444, "rating": 5.0, "text": "Good people and they do do good work.", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "103267347087346580631", "name": "Chad Trenary", "time": 1527256179739, "rating": 1.0, "text": "Ridiculous service. Dropped off power washer to have carb rebuilt, was told it would be a week. After 2 weeks I go to pick it up and find it sitting outside, try to start it before I leave and it won’t start. Guy looks at me and says, “carb issues”. Yea, ya think??? Washer hadn’t been touched in two weeks. Taking business elsewhere.", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "117302964473411346595", "name": "Brian Davidson", "time": 1501256772116, "rating": 5.0, "text": "Excellent work, and quick turnaround time. Haven taken various pieces of equipment here and happy with each interaction/repair!", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "107905005570531646800", "name": "Blake Sanders", "time": 1450488521564, "rating": 5.0, "text": "Great service! Not sure what these other guys are saying.. lol 2 months wow thats your fault.. if you cant afford to pay for it and hit the ignore button when they call then its on you!!!", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "106673622661346084648", "name": "Tim Beech", "time": 1523494927195, "rating": 1.0, "text": "Visiting daughter and family, my son-in-law was due to get laid off in a day or two.  I decided to fix his riding mower for him, so he could cut grass when he got home. A 19hp Briggs and Stratton starter is what it needed. My son-in-laws neighbor referred me to Sams Small engine repairs in Dothan. The person that sales me the starter tells me $146.00 and then he’s going to charge me an extra dollar for using plastic. I am highly skeptical at this point, but figure “what the hay” maybe that’s what the cost. I looked them up on line, after I cut my daughters grass. You can buy them all day long for $29.00\n\nShysters!!!", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "106745084093105103106", "name": "Thomas Burk", "time": 1540348005299, "rating": 5.0, "text": "Great service. ...Walter was quick and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "113848590304841366917", "name": "Jeff G", "time": 1548114393276, "rating": 5.0, "text": "Great guys here. Quick, fair and honest.", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "115027421946304897456", "name": "james stanton", "time": 1543017495337, "rating": 5.0, "text": "Very professional staff, knowledgeable and great customer and staff relationships.", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "106213394367199852040", "name": "Walter Wood Jr.", "time": 1516147806773, "rating": 5.0, "text": "Fast and friendly service. Knowledgeable and fare prices.", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "106809437721023875014", "name": "Cid Dic", "time": 1554395058838, "rating": 5.0, "text": "Great service n very helpful and knowledgeable", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "107819739165783529374", "name": "Michelle Crittenden", "time": 1538079871201, "rating": 5.0, "text": "The staff is helpful and skillful in what they do.", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "113710582999247361595", "name": "Really Noyfb", "time": 1557259914921, "rating": 1.0, "text": "I took my weedeater in to get the blade repaired. They fixed the blade, but stole the pull cord assembly. They made me buy a replacement. These guys are thieves. Don't do business here.", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "101653320611964896747", "name": "Brad Watson", "time": 1415126078297, "rating": 1.0, "text": "CROOKS!!!! I left my chainsaw there with specific instructions to call me before they fixed it and never heard from them. A couple months later I went to check on it and they didn't have it. They told me that they get rid of unclaimed tools. I said it had been there only two months and I was supposed to have gotten a call prior to fixing it. Instead of being apologetic they were rude and hateful. Use anyone but SAM's SMALL ENGINE!!!!", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "110304568297712783361", "name": "Roger Mauldin", "time": 1506189187186, "rating": 1.0, "text": "I came in Saturday to get a belt.i had my old belt and the model number the guy didn't look at the model number, just the old belt and said I don't need the model number I see it on the belt .I got home layer because I had other things to do in town.and guess  what it's to big ,it's after 12 so I am out of luck because they are closed and dury the week I get home after they have closed. Not Happy", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "103936764995164778003", "name": "Charles Sanders", "time": 1456454226313, "rating": 5.0, "text": "Thay willing to help you out even if they have to say after hrs. Good people and good place to buy the best parts for all name brands I buy all my parts from thim and I believe in thare products its a STILL the only way to go so go see them for all your STILL BRAND NAMES. & TORO riding mowers. Thanks charles sanders Rehobeth. alabama", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "108882006121548770371", "name": "Bryan Nyman", "time": 1455113630036, "rating": 5.0, "text": "Not sure what these other people are talking about... I have used Sams many times over the years.  Not only have they always done a great job, they have answered questions for me over the phone to help me repair things myself.  They could've refused to answer and charged me to fix it.", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "115341424443815165799", "name": "Jason Tew", "time": 1566904252651, "rating": 3.0, "text": "Helpful and knowledgeable about lawnmowers.", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "110965365965801869397", "name": "Frederic Lecut", "time": 1468875639000, "rating": 5.0, "text": "12 years customer.  These guys fix everything fixable. Mowers; blowers,  generators... anything with a small internal combustion engine they'll fix. And if they can't they'll tell you who can do it.", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "106444449359562038848", "name": "Willis Huggins", "time": 1524591332312, "rating": 5.0, "text": "Very nice and he was very helpful", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "115901726014144780581", "name": "Ronnie Anderson", "time": 1546563644245, "rating": 5.0, "text": "Excellent service Lee is awesome", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "113138166039577701321", "name": "Paul Young", "time": 1540851495080, "rating": 5.0, "text": "Quick attentive sevice", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "115818563556127482483", "name": "Steve Hamrick", "time": 1508787340584, "rating": 5.0, "text": "Very good quality work good price for work", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "109184876103529290036", "name": "Marvin Smith", "time": 1526734161024, "rating": 1.0, "text": "Didn't fix machine, got it home still did not run😕", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "109345597582338704388", "name": "All Things Bro", "time": 1502369914996, "rating": 5.0, "text": "Always fast, friendly, and reasonably priced!", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "112936198089786724914", "name": "Shannon Thomas", "time": 1466689983639, "rating": 1.0, "text": "Took our lawnmower in last week to get fix only to bring it home with it not working still. I don't think they even touched it while it was there.", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "101492672751501431645", "name": "Ricardo Jimenez", "time": 1449759086550, "rating": 1.0, "text": "Racist and lazy and very disrespectful people on here specifically the fat guy that cant walk or talk, think customers have to do what he said....if you spec gd customer service go somewhere else this place sting", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "110156491142352234951", "name": "Joseph Brown", "time": 1542579725301, "rating": 5.0, "text": "Always great service", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
{"user_id": "105283416404578247358", "name": "Reginald Jones", "time": 1547512827915, "rating": 5.0, "text": "Great work", "pics": null, "resp": null, "gmap_id": "0x889292dc032e2d91:0xc4c84ae124a49f8a"}
