{"user_id": "112708010218004260571", "name": "Robert Harris", "time": 1627579197949, "rating": 1.0, "text": "Politically motivated and care more about enrolled students rather than students thriving and learning. Push propaganda without any research or science and shame those who do not fall in line. We are tired of the treatment and \"learning system\" that is used, most times kids have to have their parent teach them or teach themselves bc of work given without any teaching, prep or explanation. If you have the option home school or private school.", "pics": null, "resp": null, "gmap_id": "0x886214ac533bf3cf:0xbced1170130a5d81"}
{"user_id": "105583832628431142937", "name": "Kristi Tahada", "time": 1618953913596, "rating": 1.0, "text": "Well dang! I see now why this place has such horrible reviews. Called well before closing, nobody answered the phone, and there wasn't so much as an automated system to take a message or give you any information. That's business 101!", "pics": null, "resp": null, "gmap_id": "0x886214ac533bf3cf:0xbced1170130a5d81"}
{"user_id": "103050388012442980614", "name": "Thea Sommer", "time": 1549579182818, "rating": 1.0, "text": "This school system is quite corrupt. We always hear about how education is important, but that isn't what matters to this system. It's numbers. Students take between 10 and 20 standardized tests a year and are only seen as a way to give our schools a good reputation. Recently, Mountain Gap school has decided to take away all fun activities and free time during the day so students can study for the scantron test so the school has better numbers. Speaking of Mountain Gap, this school needs fixing. Why are we building new schools no one has to have instead of fixing up older schools. As one of the oldest schools here, Mountain Gap offers good education but terrible conditions. There are mice and cockroaches, and the heating/AC system is so outdated. When it was 75 degrees outside, the heat was still on. We had to suffer through a sweltering heat at almost 85 degrees. This school system needs to get its act together.", "pics": null, "resp": null, "gmap_id": "0x886214ac533bf3cf:0xbced1170130a5d81"}
{"user_id": "101358954336618212626", "name": "April Baker", "time": 1501786142873, "rating": 1.0, "text": "I have over the years visited the White Street office on many occasions and without fail the receptionist is ALWAYS EXTREMELY RUDE. She makes it very clear that the people coming in are nothing more than an inconvenience and she cares not of your needs or reason for being there. I have no idea why the school board would keep on a woman who so clearly detests the general population and public. I would think they would want a person in this position who would want to help and who would also be a good example to those she serves. Unbelievable!", "pics": null, "resp": null, "gmap_id": "0x886214ac533bf3cf:0xbced1170130a5d81"}
{"user_id": "105858649093446081256", "name": "Seymour Butts", "time": 1534970783548, "rating": 1.0, "text": "As a life-long resident and business owner of Huntsville, Alabama, I am shocked to learn that the Huntsville City Board of Education recently appointed our new superintendent of schools without a single interview.\n\nThis is as clear as any of “Abuse of Power” by the Board in having the nerve to hire their “pet superintendent” while not interviewing any of the other nine candidates. Of the ten candidates who applied, the least qualified when looking at experience and degree rank is the one the Board hired.\n\nBy the way, the Board president needs to save the tears for somewhere else as she has proven herself not to care at all about doing things the right way.\nAnd, that fool who sits next to her needs to get off the Meds. She congratulated the new superintendent by stating “Ohhhh, I’m so glad we did it this way tonight. You and I go way back to our glory days at Blossomwood. Our kids have grown up together.”\nNow, there are some qualifications and reasons to hire a superintendent who basically said nothing the entire evening.\n\nLastly, I give this Board 1STAR but I give Pam Hill 5 STARS. She is the only one of the 5 Board members that took a look at what was going on and said, “Stop. You are not wasting my time or the other candidates time by going through some dog and pony interview. You three already know who you want. It’s a done deal. But, let me tell you this, it is sad. Sad for our kids, teachers, parents. They trust us to do things honorablly and above-Board. We failed them tonight.”\n\nSo, congratulations to the three stooges! You have ruined our once proud school system, have established a history of not following the laws that are there for you three to follow, and then you have the audacity to try to get Sally “somebody” to censor Pam Hill because why?\nI tell you why.....Because, Pam is telling the truth.\nIt’s about time you learn that skill or resign.\n\n-Seymour", "pics": null, "resp": null, "gmap_id": "0x886214ac533bf3cf:0xbced1170130a5d81"}
{"user_id": "104404744143286087967", "name": "Brandon Young", "time": 1476316758639, "rating": 1.0, "text": "Huntsville building new schools that's great but what about the schools that need fixing? Mt gap school gives a good education but the school it's self is disgusting. Ceiling fallowing, whole everywhere and cocker roaches. Mice. Nasty. You need to stop and think about the schools that need fixing up. Its becoming a hassard to teacher and students", "pics": null, "resp": null, "gmap_id": "0x886214ac533bf3cf:0xbced1170130a5d81"}
{"user_id": "105298465354251215556", "name": "Stacey Joyner", "time": 1493147686202, "rating": 1.0, "text": "Every time you call every single person you speak to is rude. You don't get any call backs. They don't handle any situations. Everybody gets a smack on the wrist and gets in no trouble for any wrong doing. Cant wait to get my kids out of this district and never put them back. Worst district ever.", "pics": null, "resp": null, "gmap_id": "0x886214ac533bf3cf:0xbced1170130a5d81"}
{"user_id": "113629319741264445933", "name": "Eric Lee", "time": 1506105202040, "rating": 1.0, "text": "incompetent!!! we need some new school board members.", "pics": null, "resp": null, "gmap_id": "0x886214ac533bf3cf:0xbced1170130a5d81"}
{"user_id": "103640402748323497752", "name": "Tasheka Shields", "time": 1621365696419, "rating": 5.0, "text": "Nice place", "pics": null, "resp": null, "gmap_id": "0x888a520f6944d44d:0xa198a16d100a17d2"}
{"user_id": "105012662464543540081", "name": "Amy Jackson", "time": 1612449847369, "rating": 5.0, "text": "New central office is very nice and well organized.", "pics": null, "resp": null, "gmap_id": "0x8892929f6486193d:0x8a5b800b3b2e761f"}
{"user_id": "104535816263200900953", "name": "b m", "time": 1605539692937, "rating": 1.0, "text": "there virtual school is horrible   and teachers don't know how to use it properly   dale coounty  is way better", "pics": null, "resp": null, "gmap_id": "0x8892929f6486193d:0x8a5b800b3b2e761f"}
{"user_id": "105887274090422087273", "name": "Bryan Martin", "time": 1504160860372, "rating": 5.0, "text": "We the students at honeysuckle middle School are the smartest and respectful students you'll ever get to know, although we might have some ups and downs but we all was get along. Honeysuckle just might be one the best School in the city of Dothan. SO TO ALL YOU GROWN PEOPLE GET TO KNOW ALL BEFORE YOU JUDGE ALL", "pics": null, "resp": null, "gmap_id": "0x8892929f6486193d:0x8a5b800b3b2e761f"}
{"user_id": "101205670072299678736", "name": "Jessica McElroy", "time": 1505307511510, "rating": 5.0, "text": "I am so thankful for Honeysuckle stepping up and going the extra mile. My two children have been enrolled in the after-school program offering lots of creative, fun courses for the kids. They also provide food and transportation. I cant say how thankful I am. It is helping them and our family as a whole at this time. Orientation was excellent. The church was there, programs offered to better the students, everyone encouraging everyone to partake in the education of the children. Encouragement, discipline and charity creates a great atmosphere..Thank you to all that work with the community and the students of the future!!!", "pics": null, "resp": null, "gmap_id": "0x8892929f6486193d:0x8a5b800b3b2e761f"}
{"user_id": "109565406167737297134", "name": "Tanith Harbinger", "time": 1501266952082, "rating": 2.0, "text": "It's only bullying if a student does it to another student. If staff does it, it's encouraging the \"more troubled\" students to keep on the right path. And even if it is a student bullying another student, little to nothing is done. I've sat in the principal's office too many times to count and nothing was ever done. Counselor didn't help. Teachers watched things happen (not just to my child, but to others as well) and do nothing.", "pics": null, "resp": null, "gmap_id": "0x8892929f6486193d:0x8a5b800b3b2e761f"}
{"user_id": "106742229856360482703", "name": "Melissa Manchester", "time": 1456762745970, "rating": 1.0, "text": "The principal is completely unprofessional. He will over talk you and beat around the bush. Me Reynolds is the only respectable person in the front office. Staff talks to kids with such anger and bad attitudes. They need to get a real principal in the school before they totally mess up these kids futures.", "pics": null, "resp": null, "gmap_id": "0x8892929f6486193d:0x8a5b800b3b2e761f"}
{"user_id": "104200851357979687262", "name": "Megan Duffy", "time": 1501037038858, "rating": 1.0, "text": "This place need some Jesus!", "pics": null, "resp": null, "gmap_id": "0x8892929f6486193d:0x8a5b800b3b2e761f"}
{"user_id": "113116850165170287423", "name": "Daisyy Mitchell", "time": 1492445293751, "rating": 1.0, "text": "horrible. and nasty.  🤢🤢", "pics": null, "resp": null, "gmap_id": "0x8892929f6486193d:0x8a5b800b3b2e761f"}
{"user_id": "110778642645137495680", "name": "B Flows", "time": 1496171951641, "rating": 5.0, "text": "Great school. Had moved here locally and my son had a wonderful experience with community and made it so much easier to settle in. Thought husband was getting another job and we moved.", "pics": null, "resp": null, "gmap_id": "0x88628b67d8652583:0xab47da2f08f2cd42"}
{"user_id": "116495495444541305452", "name": "nerdy bandster", "time": 1461004770257, "rating": 5.0, "text": "Ardmore is the best school in the county! Love it here!", "pics": null, "resp": null, "gmap_id": "0x88628b67d8652583:0xab47da2f08f2cd42"}
{"user_id": "118368245368157514052", "name": "Steven Stark", "time": 1462766554107, "rating": 5.0, "text": "It's a good school", "pics": null, "resp": null, "gmap_id": "0x88628b67d8652583:0xab47da2f08f2cd42"}
