{"user_id": "109818712454173995648", "name": "Alissa Lapidus", "time": 1622053286098, "rating": 5.0, "text": "From the first phone call to delivery to picking up the equipment; this company shows they CARE! Wonderful friendly empathic and compassionate staff from start to finish. Wouldn’t it be great if all businesses ran this way? Class act!", "pics": null, "resp": {"time": 1623278505088, "text": "Thank you for the great review.  We appreciate you allowing us to serve you and please let us know if we can be of any help in the future."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "113571891123133732803", "name": "Margaret Huang", "time": 1611949730600, "rating": 5.0, "text": "It is so true as everyone described here! These guys go above and beyond to server their customers! I rented a scooter when I fractured my foot. The scooter quality is excellent, and it has a very good brake system! I highly recommend this shop to everyone!", "pics": null, "resp": {"time": 1623278605941, "text": "Thank you for letting us know how the equipment worked out for you.  We appreciate your comments and  wish you all the best with your healing process."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "107508978388063448091", "name": "Slick Rick", "time": 1605132560080, "rating": 5.0, "text": "I broke my ribs and standing/sitting was an excruciating experience.  These guys got a lift chair out to me the very next day.  The delivery guys were super helpful, and it was clear that I was their priority.  They moved furniture to another room to make space for the new chair, set everything up, explained and demonstrated the chair operation and stayed until I was operating it myself and happy with it.  Their patience and kindness made a very difficult time easier, and I am thankful.", "pics": null, "resp": {"time": 1623278911478, "text": "Thank you for the nice comments about our service folks.  I apologize for not responding to your post sooner.  We hope all went well with your rib recovery."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "104931108721210343855", "name": "Samantha Culman", "time": 1607135334386, "rating": 5.0, "text": "Great prices and great customer service. Highly recommend.", "pics": null, "resp": {"time": 1623278750931, "text": "I must apologize for taking so long to reply to your great comment.  Thank you and let us know if we can be of help in the future."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "115997537981158139224", "name": "Roger Schooley", "time": 1595692576410, "rating": 5.0, "text": "Excellent service with friendly and helpful staff. I called four different medical supply stores and attention medical had the best price and availability. Well pleased with service and will be my first choice in the future.", "pics": null, "resp": {"time": 1598395750063, "text": "Thank You for sharing your review.  Glad we could help and please let us know if we can help in any way in the future."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "103168819175630461771", "name": "Gwendolyn Horton", "time": 1611339567899, "rating": 5.0, "text": "Super nice.  If they cant help u out, they will point u in the right direction.", "pics": null, "resp": {"time": 1623278667874, "text": "Thank you for the nice comment any my apologies or my delay in responding to our comment."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "111843709049603020338", "name": "Nathan Wienhoff", "time": 1581599073620, "rating": 5.0, "text": "These guys go above and beyond to make sure the customer is taken care of.  I am extremely pleased with the level of service and compassion that David provided.  Highly recommend this place.  Most pleasurable experience I've ever had at a medical supply place, hands down.  👍👍", "pics": null, "resp": {"time": 1581608848609, "text": "Thank you for your kind words and if there is anything we can help with in the future, please let us know."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "102384770193649363783", "name": "Mary Herrington", "time": 1607655376480, "rating": 5.0, "text": "Great company very friendly and helpful.", "pics": null, "resp": {"time": 1623278705464, "text": "We appreciate your nice comment and my apologies for taking so long to post a response."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "105140773886955672363", "name": "Zach Pugh", "time": 1525745706897, "rating": 5.0, "text": "Great customer experience. Came in and was greeted and helped right away. Very helpful, courteous, and informative. I came in for some work shoes. The size I needed wasn’t in stock so they had to order some in but they came in really quick and work great.", "pics": null, "resp": {"time": 1525779674888, "text": "Thank you for allowing us to earn your business and for your review."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "111041257124089777494", "name": "Boyd Berryhill", "time": 1542052483260, "rating": 5.0, "text": "I have been a loyal customer for years. They have a friendly staff and GREAT customer service. Anytime I need something, I can count on expert knowledge and a caring attitude. Thank you for being here!", "pics": null, "resp": {"time": 1549907844454, "text": "Thank you for your review and king remarks."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "116975133388149727020", "name": "Marie Marlin", "time": 1573163580966, "rating": 5.0, "text": "Pleasant efficient staff and reasonable prices.  You’ll be glad you came.", "pics": null, "resp": {"time": 1573232583244, "text": "Thank You and please let us know if we can ever be of service."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "108411640472289600309", "name": "Renee Holder", "time": 1555441598590, "rating": 1.0, "text": "One of the worst companies I've ever had the displeasure of working with. Denying a completely  Handicap the right to a bed and wheelchair when she cannot move whatsoever on her own. This company is ridiculous!!!  She has Tricare and Medicare.  And they are worried that they will not get their money?!!! And this is a quote from a representative from their business.  If I could leave 0 stars, I would.", "pics": null, "resp": {"time": 1556229316196, "text": "Dear Ms. Holder.  I am very sorry you feel that our company is not providing the hospital bed and wheelchair because of being “worried that they will not get their money”.  That is not the main issue in this case, however.  Being paid for the equipment is important to us but most importantly is the medical necessity for the items provided.  Medicare has specific guidelines that we must follow in providing equipment that is ordered and if we do not follow them, not only payment is not received but it opens us up to potential Fraud and Abuse issues with Medicare for billing items that the medical records do not support.  Our Store Manager, myself and another clinical person reviewed the records and documents we have received from the physician’s office who is ordering the equipment and what we have so far, does not show medical necessity for the bed and chair.  We have asked for records that do support it and as of date, not received anything that does.  It is not our desire to withhold needed equipment from anyone who needs it, but we are compelled to follow established guidelines that support it which as of now, not supported by records in our possession.  We would be happy to schedule a meeting with the customer and/or yourself, if you are a designated representative, to provide a copy of the medical necessity requirements and discuss how the records we have compares to the requirements.  Please feel free to contact our local store and let us know when a good time would be.  Again, I am sorry for how you feel but we are not intentionally trying to cause stress for you or the customer.  We are simply following the medical policy established by Medicare."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "108615189785732703484", "name": "Brandi Mason", "time": 1557511813270, "rating": 5.0, "text": "Great selection and customer service mindset, kind and attentive to your specific needs.", "pics": null, "resp": {"time": 1558470382702, "text": "Thank You fr your review.  Please let us know if we can be of help in any way."}, "gmap_id": "0x88626cc7b1740001:0x31de57b0821398c5"}
{"user_id": "105806641400551701557", "name": "Greg Hicks", "time": 1622317920088, "rating": 5.0, "text": "Very nice people. Clean, and obviously very busy. Several of my riding friends have recommended this place for doing quality work.", "pics": null, "resp": null, "gmap_id": "0x8889bfdd2f410caf:0xf666e3cabfd567f4"}
{"user_id": "105493305110062755556", "name": "David Bartlett", "time": 1576983235185, "rating": 1.0, "text": "I just relocated to Alabama from Texas when I contacted, Ronnie.  I had been having problems with finding someone to work on my bike.  I have a ’95 Honda VT1100c Shadow.  No one wanted to work on it because of it’s age & my regular mechanic had closed up shop.  When I spoke to, Ronnie I explained what I wanted him to do.  I asked him how long would it take to complete the job.  He told him that it would be two weeks.  I agreed to that.  He came out to my house in late July to pick up my bike & take it to his shop.\nI waited the two weeks & gave him al call.  He said that he was still working on another bike & he was waiting for parts to come in.  I said, that was fine, I can wait for a few more weeks.  Two more weeks came about & he still hasn’t gotten to it.  So, I just gave up & bought another bike in September.  I finally got a call from him on October 10th & 12:38 pm.  He said that he got it done.  I called him back & asked him how much it was, he said the total was $865.44.   I told him I would have to pick it up in a month. He agreed.  When I got there on November the 23rd to pick it up, he had flattened the rear tire.  He said  he broke the valve stem.  He told me he was going to charge me $75.00 to replace the stem that he broke.  I then asked him if we could start it, he said again, no.  The bike did have to be bottle fed.  So, I took it home.  When I got home I bottle fed it, it wouldn’t start.  I called him & he said that it ran when he had it.  So, I asked him if he could look at it & see if he could figure out what was wrong.  He said that it would be two weeks & he would get $80.00 an hour to fix it.  Keep in mind, I just gave him the previous day, $865.00 in cash.  So, I took the carbs back off.  The only thing he changed was the diaphragms. The main jets, slow jets all were corroded & stopped up. He had the float heights all off.  He even used rubber hose for fuel line.  I called him back to ask for half a refund on it. I called him out on what he did.  When I told him that the jets were filthy & the carb bodies were filthy he stuttered & then told me that I am not getting sh*t back and hung up.  I wouldn’t let this man work on anything.  The review on here before mine had a bad experience & they were there when I picked up my bike.  If I could give it negative starts if I could. These pictures below show what I got for my money. You can see that the bottom of the carbs are green & the jets are old & stopped up.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMOikOY_9uySYZgFYs1yCu1pjr8BZtBxgR0_EOs=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNhLhKb5HMQDNeqRvZbtmc8KlHnW95v1eurcwvz=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOFfYMTVub6Q4n1Pl1qjaSVW3wzgg-2EQdl5Gce=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOohWrBi_KZuuZs2rloW7fiD3qhVAPjuRE0JFjC=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMLu6wYyOwVVADFo8rLp4GUUTVDDZj5Ase2sJ2S=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNB8ELRalR_eFBXcm4HlSFtTC2gO2l35PHpvTYa=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOU5e-7LjQrUBNqmroCXFgKbwERuAmEQZdOySBK=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNgVwuVEVgOaOQnwAqi7YlwXUGSHFWBUeoRahs-=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMnMu7Z4WXFhh-wL7F6MitbO42L2Uzj1C27niZD=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM2NUFL7xZB2E2_ba96Ko7Bd0NJFJ8rZ-zubAh6=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMzMI0yG2lwNxnXx4ddN8XuxyydEnCmQ480LnZK=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPt40-BH5IeCZHmqv2sKSd2wkMdHtAiFDnYzG02=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889bfdd2f410caf:0xf666e3cabfd567f4"}
{"user_id": "111015270129921825849", "name": "Keaton Christie", "time": 1618613495582, "rating": 5.0, "text": "Love going here! Lots of motorcycle parts... accessories... Clothing and leather...great place!", "pics": null, "resp": null, "gmap_id": "0x8889bfdd2f410caf:0xf666e3cabfd567f4"}
{"user_id": "109390838465678723837", "name": "Mark Shelton", "time": 1621899702433, "rating": 1.0, "text": "Extremly Unprofessional Suggest Anyone Needing Work Finds it Elsewhere", "pics": null, "resp": null, "gmap_id": "0x8889bfdd2f410caf:0xf666e3cabfd567f4"}
{"user_id": "111216200368422880565", "name": "lectricdave", "time": 1503762227850, "rating": 1.0, "text": "140.00 to install 2 tires,,, won't happen again", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN0QsWzPXm-KLfGCG4kLyhJVT5XxVW3mpoHbLGz=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889bfdd2f410caf:0xf666e3cabfd567f4"}
{"user_id": "107375511669424030144", "name": "Ryan Iversen", "time": 1618762154204, "rating": 5.0, "text": "Support your local small business owner", "pics": null, "resp": null, "gmap_id": "0x8889bfdd2f410caf:0xf666e3cabfd567f4"}
{"user_id": "115003322054522158865", "name": "Icysnoow S", "time": 1619589707509, "rating": 5.0, "text": "Awesome people", "pics": null, "resp": null, "gmap_id": "0x8889bfdd2f410caf:0xf666e3cabfd567f4"}
{"user_id": "100890734682737259929", "name": "Vickie Thrower-Mills", "time": 1577490640695, "rating": 1.0, "text": "We took our 2001 Indian Chief that had been setting up for 7 years to this shop.  Big Mistake.  He charged us $3500 plus to fix it.  He was clearly aware that it had set up.  The first time we went to get it, It would not start and the lights wouldn't work.  He ask how long has this gas been in here. My husband said 7 years remember you were supposed to drain the tank for me.  He even wrote it sat up for 7 years on the receipt.  He painted the front  fender with paint that didn't match.  He put a used rear tire on it and called it a new one.  It had dirt and clay mud on it and the bike wouldn't start so where would the mud come from on a new tire? .  We left it with him for obvious reasons.  My husband ask him to replace the bushing in the handle bars since we were leaving it anyway.We paid him in the beginning to change the light covers.  He charged us twice the original one he ordered we found in the saddle bags.    My husband starts home on it today.  The brake light would not go off and the mirror was just spinning. You would think he would have saw that when replacing the bushing in the handlebars. My husband gets to Arab while driving the brand new war bonnet on the fender fell off.  Oil is leaking from a bike that he supposedly changed the oil and fixed the clutch on it.  We paid this man 3700 plus and he didn't take enough pride in his work to even wipe the dust off the bike.  I was using his shop rag to do that while we were waiting to get it running last week.  He literally took it out of my hand.  When I first met him i told my husband he seems like a good Christian person.  Boy was I wrong he might be a Christian.  I have no Idea but good is far from the truth.  We are very upset with the way we were ripped off.\nWe took our bike to another shop because it was obvious that Ronnie did not change the tires, the battery, fix the carburetor or anything we ask him and paid him to do. They could not believe that anyone would say the changed tires when they were literally rotten around the rim because it had set up for 7 years. He really screwed us out of 3700.00 He is a dishonest man. The Battery was 7 years old yet he said it was new. Along with the tires.", "pics": null, "resp": null, "gmap_id": "0x8889bfdd2f410caf:0xf666e3cabfd567f4"}
{"user_id": "107726375256992219083", "name": "The Hillbilly", "time": 1561843855212, "rating": 5.0, "text": "Always a awesome time great people great service", "pics": null, "resp": null, "gmap_id": "0x8889bfdd2f410caf:0xf666e3cabfd567f4"}
{"user_id": "100884484475481851114", "name": "brandon brooks", "time": 1553464270658, "rating": 5.0, "text": "Good times qnd good craftsmanship.", "pics": null, "resp": null, "gmap_id": "0x8889bfdd2f410caf:0xf666e3cabfd567f4"}
{"user_id": "109582371073966106408", "name": "sarah Saunders", "time": 1553345844674, "rating": 5.0, "text": "Wonderful place to get all your needs.", "pics": null, "resp": null, "gmap_id": "0x8889bfdd2f410caf:0xf666e3cabfd567f4"}
{"user_id": "114049810155335917511", "name": "Wayne Gardner", "time": 1550061766885, "rating": 4.0, "text": "Nice place for motorcycle parts,or used motorcycles to buy", "pics": null, "resp": null, "gmap_id": "0x8889bfdd2f410caf:0xf666e3cabfd567f4"}
{"user_id": "116828016055628297057", "name": "Roberto Hernandez", "time": 1602779635010, "rating": 5.0, "text": "Amazing", "pics": null, "resp": null, "gmap_id": "0x8889bfdd2f410caf:0xf666e3cabfd567f4"}
{"user_id": "115142013436961669535", "name": "Chris Winchester", "time": 1573873718974, "rating": 5.0, "text": "Friendly service", "pics": null, "resp": null, "gmap_id": "0x8889bfdd2f410caf:0xf666e3cabfd567f4"}
{"user_id": "105120084918163923741", "name": "Jeff Cornett", "time": 1563108043241, "rating": 5.0, "text": "Very friendly place 2 visit", "pics": null, "resp": null, "gmap_id": "0x8889bfdd2f410caf:0xf666e3cabfd567f4"}
{"user_id": "108025752344111879030", "name": "Michael Martin", "time": 1566248166839, "rating": 5.0, "text": "Great place", "pics": null, "resp": null, "gmap_id": "0x8889bfdd2f410caf:0xf666e3cabfd567f4"}
{"user_id": "102867639872398486273", "name": "Monte Hall", "time": 1540241872747, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x8889bfdd2f410caf:0xf666e3cabfd567f4"}
{"user_id": "117716325470912002884", "name": "Farrell Rench", "time": 1499371980411, "rating": 4.0, "text": "Nice", "pics": null, "resp": null, "gmap_id": "0x8889bfdd2f410caf:0xf666e3cabfd567f4"}
