{"user_id": "113328786324309345035", "name": "Peggy Castenholz", "time": 1602540442140, "rating": 5.0, "text": "Highly recommend John Paul and the whole team at Island Enclosures. They were professional, timely, communicative and use high-quality materials. Always available every step of the process in creating our beautiful, outdoor screen enclosure,  built-in barbecue kitchen and installing the indoor blinds.   Enclosure withstood Sally with no damage. Definitely will use again on our next project!", "pics": null, "resp": {"time": 1602541997288, "text": "Thanks Peggy.\nYou guys are very gracious.  Thank you for being outstanding customers to work with."}, "gmap_id": "0x889a0546aedb2b93:0x52d530f3f7e1e33f"}
{"user_id": "117683184607508508493", "name": "Chase Beason", "time": 1588345900731, "rating": 5.0, "text": "Great company! I have had several projects completed by them, and I have been 100% satisfied every time. There were a couple of minor adjustments that needed to be made after the initial installation, and on both occasions, the owner, John Jones, had them corrected the very next day with absolutely no hassle. Their work is beautiful, and they will also work you in their schedule as quickly as possible if needed. The installer, Greg, is also great. I highly recommend this company for any outdoor projects you have!", "pics": null, "resp": {"time": 1588602141647, "text": "Thank you for your kind review!  We appreciate it."}, "gmap_id": "0x889a0546aedb2b93:0x52d530f3f7e1e33f"}
{"user_id": "104413765980263553441", "name": "Michael Templer", "time": 1609890663978, "rating": 5.0, "text": "Very happy with the new windows they installed. Excellent follow-up support.", "pics": null, "resp": {"time": 1609892717067, "text": "Thank you Mike.  Pleasure doing business with you!"}, "gmap_id": "0x889a0546aedb2b93:0x52d530f3f7e1e33f"}
{"user_id": "110696385860215309524", "name": "John Kendall", "time": 1599930370225, "rating": 5.0, "text": "Anything you need done these are the people to use.  Great local business that does things the right way.", "pics": null, "resp": {"time": 1599936233348, "text": "Thanks John!  You be safe out there."}, "gmap_id": "0x889a0546aedb2b93:0x52d530f3f7e1e33f"}
{"user_id": "105172896549507867595", "name": "Melody Winborne", "time": 1607526453625, "rating": 5.0, "text": "Great work", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPsQdO6VB8LwL_h7rBj64wkLZEKkLwFLtC974BG=w150-h150-k-no-p"]}], "resp": {"time": 1608655822233, "text": "Thank you!"}, "gmap_id": "0x889a0546aedb2b93:0x52d530f3f7e1e33f"}
{"user_id": "103044573418217358876", "name": "Brandi W", "time": 1553972877009, "rating": 5.0, "text": "They constructed a very nice patio, firepit, and outdoor kitchen area for us with a screen enclosure close to a year ago.  OUTSTANDING customer service.  John Paul was always available to answer any questions or concerns and the construction quality is fantastic.  Would highly recommend!", "pics": null, "resp": {"time": 1553976011769, "text": "Hi Brandi,\nThank you for your review.  It was a great pleasure to work with you.  All of at Island Enclosures, wish you and your family all the best."}, "gmap_id": "0x889a0546aedb2b93:0x52d530f3f7e1e33f"}
{"user_id": "107994520461299534215", "name": "Jackie Clark", "time": 1548534729376, "rating": 5.0, "text": "Staff was very friendly and knowledgeable. Products are top notch!", "pics": null, "resp": {"time": 1548870150070, "text": "Thank you for the review, and your repeat business!"}, "gmap_id": "0x889a0546aedb2b93:0x52d530f3f7e1e33f"}
{"user_id": "109805676566394538299", "name": "Robert Reynolds", "time": 1531922591449, "rating": 5.0, "text": "Very professional and I highly recommend. All projects started and completed on time.", "pics": null, "resp": {"time": 1531942138852, "text": "Thank you for the nice review! We look forward to working with you on future projects."}, "gmap_id": "0x889a0546aedb2b93:0x52d530f3f7e1e33f"}
{"user_id": "115961469319461547051", "name": "Will", "time": 1598940420473, "rating": 1.0, "text": "I was told that a man would come out and measure my doors and never did. I was told the door I ordered would be about $760 installed. A month later the secretary called me and said the door would be $760 if I installed it myself.\n\nI went to Home Depot and spent as much time as I did at Creative Aluminum. I try to support my local business first but apparently they do so well that they do not need my business.\n\nObviously Creative Aluminum thinks so highly of themselves that they have given themselves at least TWO 5 star ratings. Look at the reviews and you'll see that two of the reviewers that gave 5 stars has only ever given one review..... the only reviews they've ever given was to Creative Aluminum.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMfujzftFgaEfmkBLIVHYXu-AWZ6lfyLgFAxDnH=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMAlwgGyBZDbJt8MWu9wtwiExpHo3kQjQJXVYXv=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8888665640521ff9:0xe692a0464cb4857a"}
{"user_id": "115706361390602343986", "name": "Eileen Jenkins", "time": 1607347747089, "rating": 5.0, "text": "I have done work with this company this year on 2 different occasions I had frameless shower doors installed they were prompt and professional from the secretary to the installers. I will and plan to use them again. Very pleased", "pics": null, "resp": null, "gmap_id": "0x8888665640521ff9:0xe692a0464cb4857a"}
{"user_id": "106611584232540896936", "name": "Johnnie Simpson", "time": 1544578453005, "rating": 5.0, "text": "A great place to get storm windows, replacement windows, window repairs and custom aluminum work.", "pics": null, "resp": null, "gmap_id": "0x8888665640521ff9:0xe692a0464cb4857a"}
