{"user_id": "111135862606899802592", "name": "Evan Eppich", "time": 1629127153779, "rating": 2.0, "text": "I live about 5-10 minutes from this building and it took over 30 minutes before the locksmith even got assigned to me, plus another 30-45 minutes for him to arrive. And I think they outsource their work because when the actual locksmith got here, he mentioned that he can give better rates if I just call him directly. It's probably best to use a different service. The only reason this isn't a 1 star review is because once the guy actually got here he did a great job really quickly.", "pics": null, "resp": {"time": 1629129467081, "text": "Evan , thanks for sharing your feedback. We sincerely apologize for your negative experience with our locksmith services. Please contact our customer service team at support@key.me or call at (855) 343-5776. The KeyMe Locksmith team is here for you and looks forward to speaking with you soon."}, "gmap_id": "0x88892214b9537333:0xa9d0dc1c352d8e6e"}
{"user_id": "112673060584059130896", "name": "Kelly Garner", "time": 1611000722868, "rating": 5.0, "text": "Key was seamless, worked to perfection plus the process to having this key made was so easy and self explanatory. I'm only mad that I didn't come up with this invention first. Kuddos to KeyMe. Looking forward to using you again when that need arises.", "pics": null, "resp": {"time": 1611002516407, "text": "Hello Kelly, thank you so much for taking the time to leave us this amazing review. We’re so glad you had a good experience. The team here at KeyMe Locksmith is thrilled to hear such good feedback. We hope you try us again and check out our great selection of home, office, car, and RFID keys at a KeyMe kiosk or give our professional locksmiths a call."}, "gmap_id": "0x88892214b9537333:0xa9d0dc1c352d8e6e"}
{"user_id": "109596533386506143483", "name": "Lisa Forrestor", "time": 1611104583334, "rating": 1.0, "text": "You have all these rules! Call this number, then another secretary calls you back, then maybe an actual locksmith might call you...I wanted to talk to the person who would be doing the work.\nO well, the dealer was cheaper!!!", "pics": null, "resp": {"time": 1611075770089, "text": "Hello Lisa, thanks for sharing your feedback. We’re sorry you had a bad experience. If you wouldn't mind contacting us at (855) 343-5776 or support@key.me, we would appreciate the chance to take care of this. The KeyMe Locksmith team is here for you and looks forward to speaking with you soon."}, "gmap_id": "0x88892214b9537333:0xa9d0dc1c352d8e6e"}
{"user_id": "116448233890101787477", "name": "April Ray", "time": 1597339515669, "rating": 5.0, "text": "I just needed a couple copies of my apartment key so that if I got locked out I would have one hidden. I didn't really want to go and deal with Lowe's or Walmart because frankly Walmart scares me right now. The kiosk was in the front of the store. I never had to directly interact with anyone which was a plus. It was simple put the key in like you're putting it in the door and pick out which key you want and I was going to get two keys and it said that I could get a key for free so I ended up getting three keys for everything included around $20. It didn't take that long. They all worked in my door and I made sure that I did the fingerprint in case I ever get locked out of my apartment. All I have to do is go to the kiosk and do the fingerprint and get another key. That's worth its weight in gold. Above all I was very pleased except for I could have got it cheaper somewhere else but sometimes you get what you pay for. I would use them again..", "pics": null, "resp": {"time": 1597331535689, "text": "Hello April, thanks for your review. We would love to hear more about your experience with our key copy kiosk, so that we can use your valuable feedback to deliver an even better experience next time. Please reach out to our service team at (855) 343-5776 or email at support@key.me with any further suggestions you wish to share. The KeyMe Locksmith team is here for you and looks forward to speaking with you soon."}, "gmap_id": "0x88892214b9537333:0xa9d0dc1c352d8e6e"}
{"user_id": "115173415899453325819", "name": "Winfred Nichols", "time": 1610936461937, "rating": 5.0, "text": "Both new keys work fine.", "pics": null, "resp": {"time": 1610979446466, "text": "Hello Winfred, thanks for sharing your review with us and the community. Our KeyMe Locksmith team will definitely be happy to read what you wrote about your new keys. We hope you try us again and check out our great selection of home, office, car, and RFID keys at a KeyMe kiosk or give our professional locksmiths a call."}, "gmap_id": "0x88892214b9537333:0xa9d0dc1c352d8e6e"}
{"user_id": "114346212205337382132", "name": "Stephanie Grissom", "time": 1599754646126, "rating": 5.0, "text": "Great customer service, keys worked perfectly!", "pics": null, "resp": {"time": 1599762394933, "text": "Hello Stephanie, thanks for sharing your review with us and the community. Our KeyMe Locksmith customer service team will definitely be happy to read what you wrote. We are so glad that your keys work well. We hope you try us again and check out our great selection of home, office, car, and RFID keys at a KeyMe kiosk or give our professional locksmiths a call."}, "gmap_id": "0x88892214b9537333:0xa9d0dc1c352d8e6e"}
{"user_id": "113298496431121491548", "name": "Kathy Hesselbach-Dickerhoff", "time": 1582390473467, "rating": 4.0, "text": "I had a key done, but it didn't work.  Went back to the store I purchased it from and called the number on the kiosk.  The representative apologized, gave me my money back instantly, and I bought another key that did work.  Very happy with my purchase!", "pics": null, "resp": {"time": 1582417997552, "text": "Kathy , thank you so much for taking the time to leave us this amazing review. The team here at KeyMe is thrilled to hear such good feedback. We hope you try us again and check out our great selection of home, office, vehicle, and RFID keys at a KeyMe kiosk."}, "gmap_id": "0x88892214b9537333:0xa9d0dc1c352d8e6e"}
{"user_id": "114884059501980969696", "name": "Kajuana Griffin", "time": 1535328914359, "rating": 5.0, "text": "Oh my God this was the best server I've  ever had at his olive garden ,Evelyn is a top of line  server when I  tell you this young is on top of everything. She pays attention  to the smallest needs. When I  tell you don't have time to ask for anything,  shes already back with it .Such a sweet spirit  .Just as the title of the says. SHE S A KEEPER. Olive Garden struck Gold when  they hired Ms Evelyn  .keep up the good work  .Blessings to all", "pics": null, "resp": null, "gmap_id": "0x88892214b9537333:0xa9d0dc1c352d8e6e"}
{"user_id": "116204786398368083636", "name": "Pamela Pruitt", "time": 1566169901011, "rating": 5.0, "text": "Easy to use and accurate keys.", "pics": null, "resp": {"time": 1567088358493, "text": "Hi Pamela, thank you so much for taking the time to leave us this amazing review. We’re so glad you had a good experience. The team here at KeyMe is thrilled to hear such good feedback. We hope you try us again and check out our great selection of home, office, vehicle, and RFID keys at a KeyMe kiosk."}, "gmap_id": "0x88892214b9537333:0xa9d0dc1c352d8e6e"}
{"user_id": "107910109855333961865", "name": "Bis Office Systems", "time": 1596048837868, "rating": 5.0, "text": "Nothing but praise for the prompt and responsive service we receive from ADS. Dan is always accessible anytime I have called. We get better, more personalized service doing business with this local company.", "pics": null, "resp": {"time": 1596059280750, "text": "Thank you very much!\nWe always strive for excellent customer service.\nI will pass this on to our team!"}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "115783318236429783371", "name": "Spectrum Collision", "time": 1576277764595, "rating": 5.0, "text": "5 stars for the excellent work and customer service performed by Advanced Detection Security of Mobile. This company has taken care of our security systems for nearly 15 years. Flawless performance, quick service, and an excellent team of Christian people. Phone calls are always returned in a timely manner, and repair service is always very prompt, so you are never left unprotected.", "pics": null, "resp": {"time": 1576347588004, "text": "Thank you!"}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "117651966845211373822", "name": "Allen Huth", "time": 1582307868065, "rating": 5.0, "text": "ADS has kept my property safe and secure for about 20 years.  No problems with the system and great immediate response from the monitoring system when we trip the alarm.. ADS is dependable and customer focused. They have been around for 30 years because they serve us well!", "pics": null, "resp": null, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "113069128401939237896", "name": "Laveral Graf", "time": 1597254990061, "rating": 5.0, "text": "The people of ADS are always quick to pick up the phone, willing to help, friendly, and polite. Ashley and Thomas are very helpful over the phone.", "pics": null, "resp": {"time": 1597260548294, "text": "Thank you!\nOur Team strives for excellence in customer service every day!\nPlease let us know how we can do better."}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "115046851075976501832", "name": "Sandy Cooley", "time": 1586813972463, "rating": 5.0, "text": "I am the jail administrator @ Washington County Jail and we recently had ADS install new cameras. We were extremely pleased with the prompt service, efficiency and willingness to work with us. We highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "105737169638011377297", "name": "Jimmy Starr", "time": 1577669216207, "rating": 5.0, "text": "I have personally known Dan McDaniel for 35 years who is the president of ADS of mobile. And by the quality of his work and the performance he does with follow up with his customers is unmatched in the security industry. He’s an expert in fire alarm, security cameras, alarm systems and access control.He serves on the Alabama alarm association and it has been president in the past. He does a complete free appraisal of your home or business and gives a fair price for installing a security system and his monitoring is excellent.", "pics": null, "resp": {"time": 1577674984205, "text": "Thank you Mr. Starr!\nI am very  honored and humbled by your comments!"}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "109256222902771596307", "name": "Doug Simpson", "time": 1587671616503, "rating": 5.0, "text": "I had ADS come out and install the alarm and camera system at one of our buildings.\nThe install was professional and completed ahead f schedule.\nWe were so pleased that we have four buildings covered by ADS.\nI would highly recommend ADS for your security and video needs.", "pics": null, "resp": null, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "110759036940519179000", "name": "Claris Feibelman", "time": 1598903682140, "rating": 5.0, "text": "Been customer with ADS for over 30 years\nVery good and reliable service", "pics": null, "resp": null, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "108655195737571347994", "name": "Ell A May Absher", "time": 1559331074218, "rating": 5.0, "text": "I love this company. I work for another alarm company and Advanced Detection Security of Mobile, Inc. does some of our sub-contracting work. Kristen, their scheduler, always makes me feel like a priority. She is quick to respond and very efficient! I work with many many other alarm companies but Kristen is THE one I can depend on, not only to schedule quickly but to keep me updated as to delays, rescheduling, parts needed, etc. Keep up the great work Advanced Detection Security of Mobile, Inc.! You make my job so much easier. You and your team rock!\nLorna A, Customer Care Representative with SSS", "pics": null, "resp": {"time": 1576347720833, "text": "Thank you!"}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "117911848695015372526", "name": "sam sinclair", "time": 1590103461893, "rating": 5.0, "text": "They did a great job installing a security camera system for our church. Very pleased with both the process and the product.", "pics": null, "resp": {"time": 1590539543161, "text": "Thank you Sam!\nWe look forward to serving you and your church.\nADS  Video • Fire • Security  Team"}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "109136506989125288807", "name": "James W. Lyon", "time": 1561069335036, "rating": 5.0, "text": "I highly recommend Dan McDaniel and the Advanced Detection Fire, Security and Video Company (ADS).  They have protected my home and office for 20 years without incident.  In today's world, you can never be sure of your safety but ADS gives my wife and I peace of mind!", "pics": null, "resp": {"time": 1576347736912, "text": "Thank you!"}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "105123704507768856444", "name": "Nildee Herrera", "time": 1562616613153, "rating": 5.0, "text": "We have used ADS of Mobile for several local services. They have always been very professional and skilled for what we have needed. Today, we had an emergency service and asked them to help us, Kristen Lane jumped and made sure we were taken care of. Thank you! Thank you for allowing us to have a face in Mobile!", "pics": null, "resp": {"time": 1576347797975, "text": "Thank you!"}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "112247053110098419346", "name": "John Thompson", "time": 1545407098732, "rating": 5.0, "text": "My company, Thompson Wealth Management & Life Planning, recently purchased a new building,. Dan McDaniel, a personal friend and business associate for over 20 years personally, came out and drew up the right  security plan and hardware that fit my needs. They worked hard and  got the job done fast. I was extremely pleased with the costs and customer service i received and continue to receive. I would highly recommend ADS for your business or personals security needs.", "pics": null, "resp": {"time": 1545662857939, "text": "Thank you Mr. Thompson.\nOur team looks forward to serving your security technology needs for a long time!"}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "109385235557165000065", "name": "Mark Jones", "time": 1543449989642, "rating": 5.0, "text": "I am a business owner with 8 locations and have used ADS of Mobile for over 20 years for my burglar alarm and video surveillance needs. In all of that time, I have always had the piece of mind that my facilities were protected from crime.  I would sincerely recommend Dan McDaniel and ADS of Mobile because of their good products, professional installations and integrity. ADS of Mobile truly helps me sleep well at night!\n\nMark Jones\nMaster Cleaners", "pics": null, "resp": {"time": 1576347716576, "text": "Thank you!"}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "102033005987100391048", "name": "pamela farmer", "time": 1597265651761, "rating": 5.0, "text": "Wonderful, fast service. Highly professional", "pics": null, "resp": null, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "111979773914764911659", "name": "Shulanda Norwood", "time": 1557841057757, "rating": 5.0, "text": "I have contracted ADS now for 4 years.  Their customer service has always been professional and prompt.  I enjoy each time talking with Mr. Dan McDaniel he is very concerned about his client and I will definitely recommend ADS service to any client that is in need of quality good service. ADS Security will satisfy your needs.", "pics": null, "resp": {"time": 1557849299182, "text": "Wow!\nThank you so much Shulanda.\nAfter nearly 30 years in business we have learned that Customer Service is the MOST  important thing we can do! Please call me anytime I can help!\nDan McDaniel"}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "112320245542721095999", "name": "Eric Burroughs", "time": 1554808076033, "rating": 5.0, "text": "I work with contractors all over the country, often onsite personally. Mal from ADS is one of the best I have ever come across. He is extremely detail oriented and actually cares! Don't even second guess working with these guys, They are solid!", "pics": null, "resp": {"time": 1576347718795, "text": "Thank you!"}, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "102885234234637377522", "name": "Jacob Reynolds", "time": 1561752840237, "rating": 5.0, "text": "Their security systems and customer service is top notch! I would recommend this company to anyone whose looking for a high quality security system with great customer service!", "pics": null, "resp": null, "gmap_id": "0x889a4dbb59c7ce1b:0xb0c1156fb2b83c58"}
{"user_id": "106393880518477061437", "name": "Jerry D Snead", "time": 1628707108954, "rating": 5.0, "text": "McCord was recommended by a neighbor. I called and set an appointment. They were quick and professional.\nWhen James arrived, he quickly assessed the multiple installations and repair I needed. He then methodically attacked them, completing one after the other. There were several unexpected problems, but he kept at it until I was satisfied.\nI heartily recommend McCord Electric to anyone who needs a professional. Great people to work with!!", "pics": null, "resp": {"time": 1628721348308, "text": "Thanks for your business!\nIt was a pleasure"}, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "107007242207044319761", "name": "Robert Rutledge", "time": 1512072085430, "rating": 5.0, "text": "Awsome electrical service. Marty is very professional and yet personable. I had problems with the GFI outlets on the outside of the house. Marty walked me thru the whole process of checking them out and finding where the problem was.\n\nWhile he was there, we planned out exterior lighting I will be adding as well as installing interior LED cans. It's going to look great and will lower my cooling bill. LED lights put off almost no heat compared to incandescent lighting. He will be the one I hire for that project, too.\n\nIt's great to find \"my guy\" to take care of electrical issues.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP7kHzD0SkgQZ5KAHXStw4-bRGFFHqGhSH5rLC0=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMYNjbGn7juIK72bguyPBDgcQieQXi1trFxWSid=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "108368771310707701994", "name": "Bruce Barrett", "time": 1516920440827, "rating": 5.0, "text": "The first time I called McCord, they did a great job installing ceiling fans. So I called them again to remodel new lights in a \"turtleback\" ceiling. Marty and Wade positioned the fixtures perfectly. They completed the job efficiently, professionally, and cleanly. There wasn't even any dust from cutting through drywall. All I did was move back the furniture and enjoy the new lighting. I highly recommend McCord Electric Service. They are the \"GO TO\" electricians in my book, with 6-star service.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOEBEIuYYv_KfNfPdfGtaiFE0Zd0lO4WSO2tjoz=w150-h150-k-no-p"]}], "resp": {"time": 1516929635611, "text": "Thanks for your business. We appreciate it."}, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "113054051282962751751", "name": "Barney Zeitvogel", "time": 1609348319703, "rating": 5.0, "text": "Would definitely use again.  Marty took care of everything we needed to get done.", "pics": null, "resp": {"time": 1627680669315, "text": "Thank you for allowing McCord Electric to serve you."}, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "103001921389184437395", "name": "Michael Baker", "time": 1563798948533, "rating": 5.0, "text": "Mr. McCord was very professional and completed my 100 amp service as asked and as quoted. He actually even put an extra receptacle for no charge. His attention to detail and doing the project correctly was second to none. If you need an electrician in the Alabama Gulf Coast area, I strongly recommend his service.\n\nThanks again,\nMike", "pics": null, "resp": {"time": 1627680737475, "text": "You are very kind to leave such a great review of our electrical service."}, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "108771211274595016803", "name": "Seth Phelps", "time": 1505769481981, "rating": 5.0, "text": "Marty McCord offers quality electric work at a reasonable price and is prompt and honest in his dealings. I don't know what more you could ask of someone. We happened upon him thinking it was another electric company and have been thankful since. I would recommend him for any electrical work, be it small or large, as he has the experience, knowledge and desire to leave a customer satisfied.", "pics": null, "resp": {"time": 1505837362010, "text": "Thank You Seth, my pleasure."}, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "108039206098157453023", "name": "STACY MURDOCH", "time": 1533763534321, "rating": 5.0, "text": "Marty McCord and his co-worker,  Wade... are the BEST!  So accommodating and just on it with our electrical (numerous!) needs at our OB condo. We really lucked out opting to call these guys, was really just a fluke.  So happy to find “the guys” to take care of our electrical needs.", "pics": null, "resp": null, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "113318296399112104544", "name": "MIke Kanoza", "time": 1559492659788, "rating": 5.0, "text": "Marty was extremely helpful, knowledgeable and did great job adding a new outlet on our patio for ceiling fan- on time and very reasonable charge for his services-\nWe would not hesitate to call him again for any electrical work we have!\nThanks Marty", "pics": null, "resp": null, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "103319775399863248517", "name": "Douglas Yawn", "time": 1535124366885, "rating": 5.0, "text": "Our Orange Beach condo had two separate electrical issues. We had not previously used an electrician but chose McCord based upon their good reviews. We were not disappointed. Ben Clark arrived on time, worked diligently to identify the source of our problems and made the necessary repairs. One of the problems was caused by contractor errors when the condo was constructed over 30 years ago. We now have what everyone needs, a go to electrician. For professionalism, courtesy, experience and fair pricing, we highly recommend McCord Electric.", "pics": null, "resp": null, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "113670239001173091208", "name": "John Kirchhof", "time": 1550033977846, "rating": 5.0, "text": "I was having trouble with a GFI in our bathroom.  I called McCord Electric Service and Marty gave me a time he could meet me.  Marty showed up at that time and figured out what the problem was and fixed it right away.  I just found my new electrician.  I highly recommend McCord Electric if you need an honest and excellent electrical service. Thanks.", "pics": null, "resp": {"time": 1550330161434, "text": "Thank You John It was a pleasure"}, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "113788011623700451968", "name": "Max Speed", "time": 1561562099428, "rating": 5.0, "text": "We recently moved to the area and needed an electrician to fix my DIY goof up. Not knowing who to call, we went pot luck...and struck gold! Call this guy if you need assistance!", "pics": null, "resp": {"time": 1627680787091, "text": "Our electrical service is here for you day or nigh. Call weekends too if you have an emergency."}, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "105224655143846699764", "name": "kristie Barba", "time": 1516754115334, "rating": 5.0, "text": "Not only did he Marty return my calls quickly when I called to ask questions  but he was very prompt and well educated ! He showed up and provided an excellence service for our new kitchen lighting ! Marty is now in my contacts as our electrician ! Will recommend him for any job !", "pics": null, "resp": {"time": 1516764564579, "text": "Thanks so much."}, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "104146346592967747767", "name": "Machelle Thompsôn", "time": 1515179085267, "rating": 5.0, "text": "Marty  was wonderful. Found our problem quickly and had lights back on within an hour.", "pics": null, "resp": {"time": 1515181054710, "text": "Thanks for your business. I really appreciate it."}, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "100980857664612769756", "name": "Benjamin Miles", "time": 1534436543728, "rating": 5.0, "text": "Fast friendly service, clean work and good price!", "pics": null, "resp": null, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "113687326717291046082", "name": "Cindy Turner", "time": 1504637530222, "rating": 5.0, "text": "I had a ceiling fan replaced and he replaced my flouriscent kitchen lighting with new LED can lights. He was on time, cleaned up after he was done and charged me a fare price. I am recommending him to all my friends.", "pics": null, "resp": {"time": 1505837327388, "text": "Thank You Cindy"}, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "113850475802972492686", "name": "Nancy Williams", "time": 1516677323084, "rating": 5.0, "text": "This is the second time we've used Mr.  McCord services.   He's professional,  on time,  and is fair on pricing.   Very pleasant experience.", "pics": null, "resp": {"time": 1516717702705, "text": "My pleasure. Thanks for your business"}, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "103811717545694232069", "name": "Nedra Smith", "time": 1580772780839, "rating": 1.0, "text": "Did not return my call", "pics": null, "resp": null, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "116218328897504428456", "name": "Sandra Oneill", "time": 1559413431291, "rating": 1.0, "text": "Never returned my call.", "pics": null, "resp": {"time": 1559422576645, "text": "Sandra,  sorry I missed your call. I have been very busy. I have looked thru my call log and do not see your name. Are you sure you called me?"}, "gmap_id": "0x889a07a911059eef:0xf254c2780b3dd32"}
{"user_id": "117692154588342055570", "name": "Patricia Woodson", "time": 1517595487843, "rating": 5.0, "text": "Blown Away! These guys came in totally professional, set up my sound system, optimized it, and explained far more about it than I could read in any manual. They looked at other equipment in my home as a courtesy and explained proper use for them. They were friendly and courteous and did not rush through the process", "pics": null, "resp": {"time": 1525465012333, "text": "Thank you so much Ms. Woodson.  I hope you are enjoying you audio setup."}, "gmap_id": "0x888928f3d8d785dd:0x294b6de75eb20cc6"}
{"user_id": "106629754635906571197", "name": "Kim Patton", "time": 1505433189986, "rating": 5.0, "text": "Twisted installed 3 TVs plus sound bars in our latest home and multiple in our last home.  They go for perfection so it's hard for us to go anywhere else!!!  They will be installing our security camera system next!  Highly recommend them to any and everyone!", "pics": null, "resp": null, "gmap_id": "0x888928f3d8d785dd:0x294b6de75eb20cc6"}
{"user_id": "112950088088265238377", "name": "John McRae", "time": 1513222819545, "rating": 5.0, "text": "Service was a class act. We had a home theater installation. Friendly, knowledgable and reasonable. Very easy to work with. Prompt service. I highly recommend.", "pics": null, "resp": {"time": 1525465246524, "text": "Thank you Mr. John. I hope you are enjoying your awesome system."}, "gmap_id": "0x888928f3d8d785dd:0x294b6de75eb20cc6"}
{"user_id": "108770984922258139206", "name": "Todd Sellers", "time": 1512070344515, "rating": 5.0, "text": "Twisted did an outstanding job hanging the TV and soundbar in our living room. They were very professional and they made sure to clean up before they left. I will definitely be bringing them back to help me hang my other TVs! Great job guys!!", "pics": null, "resp": null, "gmap_id": "0x888928f3d8d785dd:0x294b6de75eb20cc6"}
{"user_id": "104779891600785130401", "name": "Wanda Spillers", "time": 1513905861892, "rating": 5.0, "text": "Very prompt! I was prepared for a long wait and they got it right the very first time. Professional, these are the subject matter experts! I highly recommend them.\n\nDr. Wanda Spillers", "pics": null, "resp": null, "gmap_id": "0x888928f3d8d785dd:0x294b6de75eb20cc6"}
{"user_id": "101171593808885680625", "name": "jean-pierre don juan", "time": 1513647292533, "rating": 5.0, "text": "Outstanding customer service, with impeccable know how.Offering ideas and suggestions that I hadn't even thought of that were time and money saving. Great all around experience.", "pics": null, "resp": null, "gmap_id": "0x888928f3d8d785dd:0x294b6de75eb20cc6"}
{"user_id": "105922210816087403534", "name": "Derrick M", "time": 1513660325482, "rating": 5.0, "text": "Chad is very reliable and always makes sure his work is perfection.", "pics": null, "resp": null, "gmap_id": "0x888928f3d8d785dd:0x294b6de75eb20cc6"}
{"user_id": "108528994475731326245", "name": "MaryAnna Raburn", "time": 1511564803675, "rating": 5.0, "text": "Professional, very responsive, courteous, service oriented, communicative and a job well done.", "pics": null, "resp": null, "gmap_id": "0x888928f3d8d785dd:0x294b6de75eb20cc6"}
{"user_id": "105446915836074230889", "name": "johnny appleseed", "time": 1513646807226, "rating": 5.0, "text": "These folks who came out and did a very good job did not charge an excessive amount would use again", "pics": null, "resp": {"time": 1525465320262, "text": "Thank you for the great review."}, "gmap_id": "0x888928f3d8d785dd:0x294b6de75eb20cc6"}
{"user_id": "111273382746271711257", "name": "LONGS ENTERTAINMENT", "time": 1614469430928, "rating": 5.0, "text": "The Company came and did a amazing job.!!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x888928f3d8d785dd:0x294b6de75eb20cc6"}
{"user_id": "108607535358463526434", "name": "Damon Hall", "time": 1518636544651, "rating": 5.0, "text": "Great service", "pics": null, "resp": {"time": 1525464854489, "text": "Thank You Mr. Hall"}, "gmap_id": "0x888928f3d8d785dd:0x294b6de75eb20cc6"}
{"user_id": "112317126159442378371", "name": "Alyn Boyer", "time": 1625058697421, "rating": 5.0, "text": "I thought Seth and his team were awesome. Very professional...on time... great music and the photo booth was also fun!", "pics": null, "resp": null, "gmap_id": "0x887d4847bba051d9:0x27cb9dafbe6b0529"}
{"user_id": "113753545530393532120", "name": "Daniel Westfall", "time": 1605733303295, "rating": 5.0, "text": "Overall great experience! Great communication leading up to and after the event, nice music selection, and a DJ that read the crowd well. They offer other services as well - including a cool photo booth. Would recommend.", "pics": null, "resp": null, "gmap_id": "0x887d4847bba051d9:0x27cb9dafbe6b0529"}
{"user_id": "115555951684107550038", "name": "Madison Poole", "time": 1605705519393, "rating": 5.0, "text": "Such amazing / professional people to work with! The communication before and during the wedding was phenomenal! If you’re looking for a fun DJ, you’re looking at the right place!", "pics": null, "resp": null, "gmap_id": "0x887d4847bba051d9:0x27cb9dafbe6b0529"}
{"user_id": "117907838586655513299", "name": "Shoals Diversity Center", "time": 1532370451903, "rating": 5.0, "text": "Reasonable prices, complete efficiency and superb communication.  We will never have another event without Fine Era!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP7iaTFsT1x_aTXxvqNE8y5qNSasAwBre9oRwIZ=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x887d4847bba051d9:0x27cb9dafbe6b0529"}
{"user_id": "102236065462838998956", "name": "Sara Moseley", "time": 1573511665772, "rating": 5.0, "text": "Great for Wedding Rentals and as a DJ!\nSeth and his team at Fine Era were responsive to communications, prompt, efficient, accommodating with the venue location, and offered an extensive menu of services at very reasonable prices.", "pics": null, "resp": null, "gmap_id": "0x887d4847bba051d9:0x27cb9dafbe6b0529"}
{"user_id": "105734223164660320772", "name": "Michael Henderson", "time": 1561505291974, "rating": 5.0, "text": "Absolutely professional. Top shelf production, will definitely hire again!", "pics": null, "resp": null, "gmap_id": "0x887d4847bba051d9:0x27cb9dafbe6b0529"}
{"user_id": "105020868738915951523", "name": "Leella Holt", "time": 1447336717234, "rating": 5.0, "text": "Seth at Fine Era Productions provides a wonderful experience for high school dances.  The music has already been \"scrubbed\" and is suitable for school venues.  Seth is prompt and dependable.  Fine Era Productions provides services in such a manner that school sponsors do not have to be concerned about the outcome!", "pics": null, "resp": null, "gmap_id": "0x887d4847bba051d9:0x27cb9dafbe6b0529"}
{"user_id": "110383955445711650681", "name": "Erin Gray", "time": 1438881269749, "rating": 5.0, "text": "Last year, our school had to find a new DJ. Seth and Fine Era Productions really came in to save the day! Not only are they fantastic at their job but they are really great people to work with. We used their DJ services that included up-lights as well as their bistro lighting. The event was a major success and looked amazing. The music is current and they know how to get the crowd going. I can not recommend Fine Era Productions enough! I've already reserved them for this year and can not wait to work with them again!", "pics": null, "resp": null, "gmap_id": "0x887d4847bba051d9:0x27cb9dafbe6b0529"}
{"user_id": "108614393673397163525", "name": "M Stevens", "time": 1573576412999, "rating": 5.0, "text": "Quick kiosk for having duplicates made. Good assortment of keys to choose from.", "pics": null, "resp": {"time": 1573853583264, "text": "Hi M, thank you so much for taking the time to leave us this amazing review. The team here at KeyMe is thrilled to hear such good feedback. We hope you try us again and check out our great selection of home, office, vehicle, and RFID keys at a KeyMe kiosk."}, "gmap_id": "0x888ced3b66cb9bbd:0x2ce2ce3520f90690"}
{"user_id": "101366038674557252421", "name": "NELLY", "time": 1601744691090, "rating": 5.0, "text": "Speedy and great customer service", "pics": null, "resp": {"time": 1601907851575, "text": "Hello Nelly, thank you so much for taking the time to leave us this amazing review. The team here at KeyMe Locksmith customer service team is thrilled to hear such good feedback. We hope you try us again and check out our great selection of home, office, car, and RFID keys at a KeyMe kiosk or give our professional locksmiths a call."}, "gmap_id": "0x888ced3b66cb9bbd:0x2ce2ce3520f90690"}
{"user_id": "105431565013846621244", "name": "Matthew Koss", "time": 1611144439809, "rating": 5.0, "text": "Tusco has been great to work with. Both their field and office staff have were very responsive and were more than willing to work with us as a team to solve challenges that arose from some of the unique conditions on our project. The installation + training of their security systems were seamless. I highly recommend Tusco!", "pics": null, "resp": null, "gmap_id": "0x8888ae43ffed3583:0x56f2f125bb6f8e87"}
{"user_id": "117695783830181554858", "name": "Teddy Rhodes", "time": 1622230045542, "rating": 5.0, "text": "All around Great People", "pics": null, "resp": null, "gmap_id": "0x8888ae43ffed3583:0x56f2f125bb6f8e87"}
{"user_id": "110344502713036741512", "name": "Mike Lamon", "time": 1603721184388, "rating": 5.0, "text": "In 2014 an F1 tornado came through my neighborhood destroying much of the fencing.  My neighbors and I contracted Tusco to replace the damaged fencing.  After several years some of the replaced fencing began to lean.   We contacted Tusco, who sent a representive out to investigate the problem.  He determined that some of the posts had not been treated by the company Tusco buys them from.  Tusco promptly  replaced the fence posts, making our fence new again.  We very much appreciate Tusco's response to the problem, and the professionalism of all who assisted us to include Julie in the office, Rick the supervisor / investigator, and the men who did the repair work.", "pics": null, "resp": null, "gmap_id": "0x8888ae43ffed3583:0x56f2f125bb6f8e87"}
{"user_id": "108261335326129714500", "name": "GR82B A MAR10 martin", "time": 1593640105018, "rating": 5.0, "text": "Absolutely the best company in the world!", "pics": null, "resp": null, "gmap_id": "0x8888ae43ffed3583:0x56f2f125bb6f8e87"}
{"user_id": "114230741267121467126", "name": "Jeremy Horton", "time": 1515872560621, "rating": 5.0, "text": "Very impressed with the workmanship and quality of their installation.", "pics": null, "resp": null, "gmap_id": "0x8888ae43ffed3583:0x56f2f125bb6f8e87"}
{"user_id": "103224413546495668498", "name": "Amanda Provancher", "time": 1497221013381, "rating": 1.0, "text": "Very very very rude. Do not recommend. Very reckless", "pics": null, "resp": {"time": 1502822851684, "text": "Amanda, we apologize for any negative impression you may have gotten from our company or employees. If you don't mind, can you please elaborate on your grievance with Tusco? We are a commercial perimeter security contractor, and it is unclear how we may have given such an impression to you personally as we conduct business solely with commercial contractors, property owners, and governmental agencies.\n\nThank you,\n\nTusco, Inc."}, "gmap_id": "0x8888ae43ffed3583:0x56f2f125bb6f8e87"}
{"user_id": "112223985601473858443", "name": "Ruth Horridge", "time": 1590931771347, "rating": 5.0, "text": "Awesome job on our website and local search submissions! Internet is faster at the house after only an hour and $50. Highly recommended.", "pics": null, "resp": {"time": 1590937264701, "text": "We appreciate the kind words!"}, "gmap_id": "0x8861d3dd2ca50ceb:0xdf0f9a72b14e713f"}
{"user_id": "105287502501371737686", "name": "Jon Greenwood", "time": 1590931128867, "rating": 5.0, "text": "Awesome service, on-time, and affordable!", "pics": null, "resp": {"time": 1590937248644, "text": "Thank you!"}, "gmap_id": "0x8861d3dd2ca50ceb:0xdf0f9a72b14e713f"}
{"user_id": "108575075306970505083", "name": "Kayelyn Penny", "time": 1624108217257, "rating": 1.0, "text": "Called, paid for, and scheduled a technician only to receive a text message stating there weren’t any available trucks in my area after verifying my information over the phone several times. Now I have to wait 3-5 days for a refund on top of paying someone else to get my car unlocked.", "pics": null, "resp": {"time": 1624118213656, "text": "Hi Kayelyn, thanks for letting us know about this issue. We sincerely apologize that we were unable to provide locksmith services in your area. The KeyMe Locksmith team is here for you and would appreciate the chance to make this right. Please contact us at (855) 343-5776 or support@key.me at your earliest convenience. We look forward to speaking with you and having the opportunity to serve you soon."}, "gmap_id": "0x888cf2e97e169da1:0xf946cfae8ba09a80"}
{"user_id": "109968072918048098115", "name": "Joseph Barnett", "time": 1619041192131, "rating": 5.0, "text": "Quick and easy and both keys worked perfrctly.", "pics": null, "resp": {"time": 1619100117085, "text": "Hi Joseph, thank you so much for taking the time to leave us this amazing review. The team here at KeyMe Locksmith is thrilled to hear such good feedback. We hope you try us again and check out our great selection of home, office, car, and RFID keys at a KeyMe kiosk or give our professional locksmiths a call."}, "gmap_id": "0x888cf2e97e169da1:0xf946cfae8ba09a80"}
{"user_id": "107773673369073326436", "name": "Tushar Mollik", "time": 1576977952610, "rating": 5.0, "text": "This is the best key duplication service I had experienced so far. You can save your keys in your account for cutting later in case you lose your key. It can copy your car key with transponder, that means you can start the car with that key. You can also cut 'duplication prohibited' keys. And the best part is you can do everything from a kiosk.", "pics": null, "resp": {"time": 1577727863134, "text": "Hi Tushar, thanks for sharing your review with us and the community. Our KeyMe team will definitely be happy to read what you wrote. We hope you try us again and check out our great selection of home, office, vehicle, and RFID keys at a KeyMe kiosk."}, "gmap_id": "0x888cf2e97e169da1:0xf946cfae8ba09a80"}
{"user_id": "109113620254468337168", "name": "Bob Slocumb", "time": 1564706670324, "rating": 4.0, "text": "very convenient to me, inside Kroger.  good quality service. I paid this higher price, but a little drive to Home Depot would save me a few bucks.", "pics": null, "resp": {"time": 1564770205204, "text": "Hi Bob, thank you so much for taking the time to leave us this amazing review. The team here at KeyMe is thrilled to hear such good feedback. We hope you try us again and check out our great selection of home, office, vehicle, and RFID keys at a KeyMe kiosk."}, "gmap_id": "0x888cf2e97e169da1:0xf946cfae8ba09a80"}
{"user_id": "105021931499335177628", "name": "Michael Miller", "time": 1580962927841, "rating": 1.0, "text": "The price is ridiculous. I put my key in it came up to pay $9.99. So I went to Home Depot and paid $2.25 I guess it is all about convenience but not for me.", "pics": null, "resp": {"time": 1580995633078, "text": "Michael , thanks for sharing your feedback. We sincerely apologize that your experience didn’t match your expectations. Please contact our customer service team at support@key.me or call at (855) 343-5776. We’ll work with you to resolve any issues as quickly as possible."}, "gmap_id": "0x888cf2e97e169da1:0xf946cfae8ba09a80"}
{"user_id": "115509754319889057498", "name": "Alexis Browning", "time": 1563238236763, "rating": 1.0, "text": "The machine was cute and all but $10 to duplicate a key ? I don’t think so.... Walmart charges only $3 to remake a key the only con is that it don’t open 24hrs like KeyMe.... i seen that price and turned around faster than flash cause periodt.", "pics": null, "resp": {"time": 1564171915034, "text": "Hi Alexis, thanks for sharing your feedback. We apologize that your experience didn’t match your expectations. Please contact our KeyMe service teams at support@key.me or call at 18553435776. We’ll work with you to resolve any issues as quickly as possible."}, "gmap_id": "0x888cf2e97e169da1:0xf946cfae8ba09a80"}
{"user_id": "106772750508328575371", "name": "Brandon Packer", "time": 1596400877165, "rating": 5.0, "text": "Speedy delivery  good product", "pics": null, "resp": {"time": 1590679320772, "text": "Hi, Brandon thank you so much for taking the time to leave us this amazing review. The team here at KeyMe is thrilled to hear such good feedback. We hope you try us again and check out our great selection of home, office, vehicle, and RFID keys at a KeyMe kiosk."}, "gmap_id": "0x888cf2e97e169da1:0xf946cfae8ba09a80"}
{"user_id": "100028962341863417267", "name": "Lindsey B", "time": 1604262267784, "rating": 5.0, "text": "Fast and friendly service", "pics": null, "resp": {"time": 1590324104316, "text": "Lindsey  , thank you so much for taking the time to leave us this amazing review. The team here at KeyMe is thrilled to see such good feedback. We hope you try us again and check out our great selection of home, office, vehicle, and RFID keys at a KeyMe kiosk."}, "gmap_id": "0x888cf2e97e169da1:0xf946cfae8ba09a80"}
{"user_id": "116500416154378300130", "name": "Dustin Maines", "time": 1583026682662, "rating": 5.0, "text": "Just easy and convenient anytime of the day", "pics": null, "resp": {"time": 1583031952701, "text": "Dustin , thank you so much for taking the time to leave us this amazing review. The team here at KeyMe is thrilled to hear such good feedback. We hope you try us again and check out our great selection of home, office, vehicle, and RFID keys at a KeyMe kiosk."}, "gmap_id": "0x888cf2e97e169da1:0xf946cfae8ba09a80"}
{"user_id": "103341276200501046123", "name": "Jerry Grant", "time": 1534788456157, "rating": 5.0, "text": "Very pleasant experience.  Got the keys copied without a special trip to the hardware store.", "pics": null, "resp": null, "gmap_id": "0x888cf2e97e169da1:0xf946cfae8ba09a80"}
{"user_id": "105946262325231529260", "name": "venus9 Cotton", "time": 1601932858345, "rating": 5.0, "text": "Great 😌", "pics": null, "resp": {"time": 1601935409361, "text": "Hello, thank you so much for taking the time to leave us this amazing review. We’re so glad you had a good experience. The team here at KeyMe Locksmith is thrilled to hear such good feedback. We hope you try us again and check out our great selection of home, office, car, and RFID keys at a KeyMe kiosk or give our professional locksmiths a call."}, "gmap_id": "0x888cf2e97e169da1:0xf946cfae8ba09a80"}
{"user_id": "117558654003632587809", "name": "K-way Cotton", "time": 1547086352837, "rating": 5.0, "text": "Very nice people and good customer service", "pics": null, "resp": {"time": 1564173985068, "text": "Hi K-way, thank you so much for taking the time to leave us this amazing review. We’re so glad you had a good experience. Next time you visit our kiosk, you should try the RFID! We hope you visit us again soon."}, "gmap_id": "0x888cf2e97e169da1:0xf946cfae8ba09a80"}
{"user_id": "109165960204212990619", "name": "Mike S", "time": 1570369484995, "rating": 5.0, "text": "Very convenient.", "pics": null, "resp": {"time": 1570632711179, "text": "Hi Mike, thank you so much for taking the time to leave us this amazing review. We’re so glad you had a good experience. The team here at KeyMe is thrilled to hear such good feedback. We hope you try us again and check out our great selection of home, office, vehicle, and RFID keys at a KeyMe kiosk."}, "gmap_id": "0x888cf2e97e169da1:0xf946cfae8ba09a80"}
{"user_id": "100867515873714902727", "name": "Robert High", "time": 1569853140731, "rating": 4.0, "text": "Excellent service!", "pics": null, "resp": {"time": 1569872231824, "text": "Hi Robert, thank you so much for taking the time to leave us this amazing review. The team here at KeyMe is thrilled to hear such good feedback. We hope you try us again and check out our great selection of home, office, vehicle, and RFID keys at a KeyMe kiosk."}, "gmap_id": "0x888cf2e97e169da1:0xf946cfae8ba09a80"}
{"user_id": "103295827771441549075", "name": "Dibyajyoti Sinha", "time": 1546395028032, "rating": 5.0, "text": "Quick and reliable!", "pics": null, "resp": {"time": 1564174014932, "text": "Hi Dibyajyoti, thank you so much for taking the time to leave us this amazing review. We’re so glad you had a good experience. Next time you visit our kiosk, you should try the RFID! We hope you visit us again soon."}, "gmap_id": "0x888cf2e97e169da1:0xf946cfae8ba09a80"}
{"user_id": "115781128716585281221", "name": "BS", "time": 1537751320471, "rating": 5.0, "text": "quick, comfortable", "pics": null, "resp": null, "gmap_id": "0x888cf2e97e169da1:0xf946cfae8ba09a80"}
{"user_id": "108418959675591341485", "name": "Ella R. Brown", "time": 1534540222552, "rating": 2.0, "text": "Never been", "pics": null, "resp": null, "gmap_id": "0x888cf2e97e169da1:0xf946cfae8ba09a80"}
{"user_id": "106465365670186022886", "name": "Dianne Richard", "time": 1618428111153, "rating": 3.0, "text": "Installation techs were knowledgeable.  However we purchased a keyless entry/ exit door feature.  This was an option that was very important to us and so we chose a security company that offered it.  When the installation tech arrived I was told that it could not be installed because I didn't have a dead bolt lock on the door.  That I could hire someone else to drill a hole in my door at additional cost.  Already paid $2500 for this security system and now I have to hire someone else to install the door lock.  I  called the salesperson and was told that she could get her husband to drill it. But then he couldn't because he was out of town.  So  3 days later got the hole drilled but when tech came back to install it the lock would jam.  Tech said they never drill door locks.  ADS doesn't pay for that tool because it is so expensive. Very frustrating!  Be careful with the salesperson!  Finally works after spending hours adjusting the door and lock.  Use another security company. Not ADS.", "pics": null, "resp": {"time": 1618489173753, "text": "Ms. Richard, I am sorry for the installation issues your encountered.  Please call us directly if you have any other issues.  We will be happy to work with you to make sure you are a satisfied customer."}, "gmap_id": "0x8889cb96d643e3a1:0x6fbaf83525cf89dc"}
{"user_id": "117335821984965359515", "name": "Steve Haynes", "time": 1601325146558, "rating": 5.0, "text": "The individual who came out to do our upgrade was absolutely a top-notch customer service oriented individual. He very thoroughly went through everything with meAnd spent time explaining the changes. He was also extremely friendly and engaging. Very satisfied with his work.", "pics": null, "resp": {"time": 1601382901720, "text": "Steve, thank you for your review! We are glad to hear your upgrade went well and our team was able to satisfy your security needs."}, "gmap_id": "0x8889cb96d643e3a1:0x6fbaf83525cf89dc"}
{"user_id": "108512401122093900602", "name": "TERESA VERRILLO", "time": 1605217740105, "rating": 5.0, "text": "Very kind, prompt and informative. Highly recommend ADS. Installer went above and beyond to make sure everything was up and working well. Thank you", "pics": null, "resp": {"time": 1607370451191, "text": "Teresa, we are so glad everything went well with with your installation! We appreciate your feedback and we hope you enjoy your new system!"}, "gmap_id": "0x8889cb96d643e3a1:0x6fbaf83525cf89dc"}
{"user_id": "102944411634167111429", "name": "Reva Morton", "time": 1611009971170, "rating": 5.0, "text": "When I call they are always helpful, and if I need them to come to my residence they are quick and friendly!", "pics": null, "resp": {"time": 1611259997621, "text": "Reva, thank you for leaving us your feedback. We're glad to hear your experience with our team has been great, and thank you for 7 years of business with ADS!"}, "gmap_id": "0x8889cb96d643e3a1:0x6fbaf83525cf89dc"}
{"user_id": "103250607869461362982", "name": "John Britt", "time": 1614812972785, "rating": 5.0, "text": "Tech did a good job.", "pics": null, "resp": {"time": 1614866473701, "text": "John, thank you for your 5-star review! We appreciate your feedback."}, "gmap_id": "0x8889cb96d643e3a1:0x6fbaf83525cf89dc"}
{"user_id": "112868083337480970397", "name": "Tom Pappas", "time": 1582976882538, "rating": 5.0, "text": "From start to finish, the entire team at ADS was friendly and professional. Kim did a great job of designing our system and Jason’s installation was top notch. I highly recommended ADS for your security system needs.", "pics": null, "resp": {"time": 1583520680674, "text": "This is great to hear, Tom! Thank you for sharing your feedback with us! We appreciate your business!"}, "gmap_id": "0x8889cb96d643e3a1:0x6fbaf83525cf89dc"}
{"user_id": "100158666392662462378", "name": "Jim Parham", "time": 1600790219407, "rating": 5.0, "text": "Installers were awesome, very neat and efficient!!", "pics": null, "resp": {"time": 1600807757894, "text": "Jim, we are glad our team was able to take care of you. Let us know if we can help you with anything else!"}, "gmap_id": "0x8889cb96d643e3a1:0x6fbaf83525cf89dc"}
{"user_id": "109940566555964119351", "name": "Duane E HILDRETH", "time": 1616458836443, "rating": 5.0, "text": "Excellent company", "pics": null, "resp": {"time": 1616597893625, "text": "Duane, thank you for your 5-star review! We appreciate your feedback."}, "gmap_id": "0x8889cb96d643e3a1:0x6fbaf83525cf89dc"}
{"user_id": "105145725495120423120", "name": "Karyn Turner", "time": 1583036363775, "rating": 5.0, "text": "Very friendly and knowledgable. Jason Childers Thank you much... Recommended any time..", "pics": null, "resp": {"time": 1583519416614, "text": "Thank you for taking the time to share your feedback with us, Karyn! We appreciate your kind words!"}, "gmap_id": "0x8889cb96d643e3a1:0x6fbaf83525cf89dc"}
{"user_id": "117193429355453127053", "name": "Bob Reed", "time": 1609195714079, "rating": 5.0, "text": "Quick response and professional", "pics": null, "resp": {"time": 1610547091099, "text": "Bob, thank you for your 5-star review! Our team appreciates your feedback."}, "gmap_id": "0x8889cb96d643e3a1:0x6fbaf83525cf89dc"}
{"user_id": "101519579924474904860", "name": "Me stricklin", "time": 1563296796601, "rating": 5.0, "text": "Pleased with ADS and technician, Jason,  who came out to add security to our garage. He was very knowledgeable, efficient, and respectful. Highly recommend Cullman ADS for home security needs.", "pics": null, "resp": {"time": 1563544676730, "text": "This is wonderful to hear Phyllis, we’re glad to see you're pleased with our work and enjoying being an ADS Customer! We look forward to working with you again in the future!"}, "gmap_id": "0x8889cb96d643e3a1:0x6fbaf83525cf89dc"}
{"user_id": "110275049460398262735", "name": "Mark Moon", "time": 1570203832965, "rating": 5.0, "text": "Great technician, very knowledgeable and and patient with me being late to the house. Love my service and am glad to know I can count on ADS to secure my home", "pics": null, "resp": {"time": 1570210136412, "text": "Thank you, Mark, for taking the time out to share your experience with us. We appreciate you as a customer and thank you for choosing us to protect what you treasure most. We are here for you!"}, "gmap_id": "0x8889cb96d643e3a1:0x6fbaf83525cf89dc"}
{"user_id": "118056409772714681524", "name": "Melissa Riddle", "time": 1587149948209, "rating": 5.0, "text": "Kenny was very knowledgeable! Great to work with and patient!", "pics": null, "resp": null, "gmap_id": "0x8889cb96d643e3a1:0x6fbaf83525cf89dc"}
{"user_id": "109361536779676178932", "name": "Bill Wilkinson", "time": 1589373382783, "rating": 5.0, "text": "A perfect gentleman and 100% skilled.", "pics": null, "resp": {"time": 1589395309660, "text": "Thank you for the kind words and review, Bill! We appreciate your business!"}, "gmap_id": "0x8889cb96d643e3a1:0x6fbaf83525cf89dc"}
{"user_id": "109859157031150921047", "name": "Janice Horton", "time": 1551101996104, "rating": 5.0, "text": "I do not leave reviews, but Jordan said I would be getting an email to leave one.  For Jordan I will leave one.  He was very helpful explaining the working of the system he installed.  He was also kind to my 95 year old mother.  He was also patient, working with me to use the ADS app. I like the system that was installed, it helps me to check on my mother anytime, it is a relief to and to my mother and brothers. If we need help again, I hope it will be Jordan who helps us. Thank you Jordan.", "pics": null, "resp": {"time": 1551548264403, "text": "We really appreciate you taking the time out to share your experience with us! We are so lucky to have customers like you and we are glad you're happy with our level of service. Thank you for your business!"}, "gmap_id": "0x8889cb96d643e3a1:0x6fbaf83525cf89dc"}
{"user_id": "116055625917018033899", "name": "Nancy Picogna", "time": 1586791720900, "rating": 5.0, "text": "The technician was very friendly, helpful and knowledgeable.", "pics": null, "resp": null, "gmap_id": "0x8889cb96d643e3a1:0x6fbaf83525cf89dc"}
{"user_id": "106739549154458808042", "name": "Jennifer Gillott", "time": 1586974912632, "rating": 4.0, "text": "Good curtious serve.  Thanks!", "pics": null, "resp": null, "gmap_id": "0x8889cb96d643e3a1:0x6fbaf83525cf89dc"}
{"user_id": "102041525920422039947", "name": "billie meggs", "time": 1563979494525, "rating": 5.0, "text": "The tech Jason was excellent. Very courteous and thorough.", "pics": null, "resp": {"time": 1564231951881, "text": "So happy to hear, we’re glad we could assist you in a positive way. We are here for you, Billie!"}, "gmap_id": "0x8889cb96d643e3a1:0x6fbaf83525cf89dc"}
{"user_id": "109806164592797560942", "name": "Kaye Cochran", "time": 1571699603135, "rating": 5.0, "text": "Kenny and Jason worked hard on getting our security issue resolved. Great customer service.", "pics": null, "resp": {"time": 1571941609935, "text": "This is wonderful to hear, Kaye, we’re glad to see you're pleased with our work and enjoying being an ADS Customer! We look forward to working with you again in the future!"}, "gmap_id": "0x8889cb96d643e3a1:0x6fbaf83525cf89dc"}
{"user_id": "104600900099857615295", "name": "ron dunn", "time": 1591211505526, "rating": 5.0, "text": "Very knowledgable and courteous", "pics": null, "resp": {"time": 1591301523080, "text": "Ron, we are pleased to hear your experience with ADS Security has been positive. We appreciate the 5-star review!"}, "gmap_id": "0x8889cb96d643e3a1:0x6fbaf83525cf89dc"}
{"user_id": "110016537690627938999", "name": "Joey King", "time": 1550260548549, "rating": 5.0, "text": "Ricky done a great job and thoroughly explained how to operate my cameras.", "pics": null, "resp": {"time": 1550674319287, "text": "We really appreciate you taking the time out to share your experience with us and we look forward to working with you again in the future. Thank you for your business!"}, "gmap_id": "0x8889cb96d643e3a1:0x6fbaf83525cf89dc"}
{"user_id": "102171943150992883165", "name": "Penelope Lee", "time": 1504887824099, "rating": 5.0, "text": "Great experience! Very kind reps who know their stuff. Would highly recommended.", "pics": null, "resp": null, "gmap_id": "0x8889cb96d643e3a1:0x6fbaf83525cf89dc"}
{"user_id": "100207771835581969240", "name": "Heather Gudger", "time": 1552332752239, "rating": 5.0, "text": "Great Experience! Can’t wait to use our new system!", "pics": null, "resp": {"time": 1552567846207, "text": "We really appreciate you taking the time out to share your experience with us! We are so lucky to have customers like you and we are glad you're happy with our level of service. Thank you for your business!"}, "gmap_id": "0x8889cb96d643e3a1:0x6fbaf83525cf89dc"}
{"user_id": "101325929528999624183", "name": "adrian cherry", "time": 1562923687809, "rating": 5.0, "text": "Technician was very knowledgeable and helpful!!!  Had my issue fixed in a matter of minutes.", "pics": null, "resp": {"time": 1563217040123, "text": "We really appreciate you taking the time out to share your experience with us and we look forward to working with you again in the future. Thank you for your business Adrian!"}, "gmap_id": "0x8889cb96d643e3a1:0x6fbaf83525cf89dc"}
{"user_id": "118361692190031031511", "name": "James Mabrey", "time": 1544028233836, "rating": 5.0, "text": "Sales were helpful and installation went as planned. Over all a good experience.", "pics": null, "resp": {"time": 1544116226927, "text": "James,\nThank you so much for your kind words! We appreciate your review and look forward to continuing our legendary service.\nADS"}, "gmap_id": "0x8889cb96d643e3a1:0x6fbaf83525cf89dc"}
{"user_id": "116215652036406345135", "name": "Tom Montgomery", "time": 1526056970978, "rating": 5.0, "text": "Very professional install with knowledgeable people. Local company here for years", "pics": null, "resp": {"time": 1526414074799, "text": "Thank you for your review and comments!"}, "gmap_id": "0x8889cb96d643e3a1:0x6fbaf83525cf89dc"}
{"user_id": "105338294505428305214", "name": "Roger Terry", "time": 1578430620948, "rating": 4.0, "text": "Friendly and knowledgeable", "pics": null, "resp": {"time": 1578759361753, "text": "Thank you for taking the time to give us a review, Roger! We appreciate your kind words! We look forward to working with you again."}, "gmap_id": "0x8889cb96d643e3a1:0x6fbaf83525cf89dc"}
{"user_id": "118010402481335997378", "name": "Misty Pearson", "time": 1537323999374, "rating": 5.0, "text": "They were fast and professional", "pics": null, "resp": {"time": 1537365858225, "text": "Misty,\nThank you so much for your kind words! We appreciate your review and look forward to continuing our legendary service.\n\nADS"}, "gmap_id": "0x8889cb96d643e3a1:0x6fbaf83525cf89dc"}
{"user_id": "116712609935706616496", "name": "Christen Payne", "time": 1597701355039, "rating": 5.0, "text": "Great price and service! We have been grateful to have our AAA security system to feel protected! Their customer service and call center staff are so supportive and helpful. Would definitely recommend!", "pics": null, "resp": {"time": 1597706532488, "text": "I really appreciate the feedback. Please call me if you need anything at all. Thanks and God bless"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "109583245416018099084", "name": "Vickey Ellison", "time": 1614136062687, "rating": 5.0, "text": "Services my son's business. He is pleased with the service.", "pics": null, "resp": {"time": 1614194485441, "text": "Thank you for the review. I'm glad we could help ☺"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "109078886114725343178", "name": "Cynthia Forsman", "time": 1598492910280, "rating": 5.0, "text": "Chris listened to what I needed and he delivered spot on! AAA Security will be who I call for any and all security needs. I would highly recommend them. Wish I could find painters this attentive!", "pics": null, "resp": {"time": 1598534902669, "text": "I appreciate the feedback. Please let me know if you need anything else. It was a pleasure working with you. God bless!"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "104523197909592298247", "name": "Trey Short", "time": 1589405017161, "rating": 5.0, "text": "I love working with these guys. They are quick, efficient, and the systems that they put in a top-notch and high-quality. When all is said and done I will have four separate property secured by these guys.", "pics": null, "resp": {"time": 1589421700466, "text": "Again I appreciate the business. If you need anything at all let us know. Enjoyed working with you"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "110613134373157650075", "name": "Jeremy Acray", "time": 1578535352649, "rating": 5.0, "text": "AAA has done several jobs for me over the last 15 years, both surveillance systems and security. They are currently helping me upgrade my home to become a more interactive “smart home.” They have always been very honest and dependable and stand  by their work. Highly recommended.", "pics": null, "resp": {"time": 1578535947805, "text": "Thanks again for the business. Let us know if you need anything else. Always here to help"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "112556834653081298966", "name": "Michael Rock", "time": 1571083910275, "rating": 5.0, "text": "I'm a long term client & I highly recommend Chris & his team. A recent office move went smooth as could be with a solid, professional installation. Great customer service and a quality product, all at a fair price.", "pics": null, "resp": {"time": 1571086061021, "text": "Thank you Michael for your business. Been a pleasure working with you guys. Call me for anything else you need"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "114744949756570811860", "name": "Robert Sadler", "time": 1578590892076, "rating": 5.0, "text": "Chris has serviced our business and Home with extreme professionalism and quality service. His staff is very knowledgeable and recommended quality products that perform and declared. Thanks Tripple AAA for making it easy to do a positive review!", "pics": null, "resp": {"time": 1578599782239, "text": "We are glad that you are satisfied with our service. Please let us know if we can help with anything else"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "108925138109331589442", "name": "Jimmy Loyd", "time": 1578531155744, "rating": 5.0, "text": "3 years and still great service. Helpful when you have a question and talking to a local person is always a plus.", "pics": null, "resp": {"time": 1578533516387, "text": "Thanks for the business. Please let us know if you need anything else"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "117786196804113453513", "name": "Hunter Perkins", "time": 1570128074718, "rating": 5.0, "text": "Great Company. Great people. Easy to work with and would highly recommend", "pics": null, "resp": {"time": 1570128769804, "text": "Thank you for your review! Please let me know if you need anything"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "115828939823142087264", "name": "Joel Gray", "time": 1578664552778, "rating": 5.0, "text": "This company is owned by honest hard working individuals who has the customers best interest at heart. That’s hard to come by!", "pics": null, "resp": {"time": 1578700214702, "text": "Thank you. Please let us know if we can help with anything else"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "105533973990381575144", "name": "Sharon Farley", "time": 1604614346540, "rating": 5.0, "text": "Good quality, on time.", "pics": null, "resp": {"time": 1604619538495, "text": "Thank you. Please let us know if we can help you with anything else"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "115918130127621274839", "name": "Angie Perkins", "time": 1570464873037, "rating": 5.0, "text": "Great service! Great monthly rates! They were right on time, very polite and trustworthy.", "pics": null, "resp": {"time": 1570748683292, "text": "Thank you!"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "113940167280255267948", "name": "James Putman", "time": 1570196046771, "rating": 5.0, "text": "The absolute best place in Northeast AL for all your home and business security needs. I would not trust anyone else but Chris Perkins and AAA SECURITY.*****", "pics": null, "resp": {"time": 1570197340040, "text": "Thanks for your review! Let us know if there is anything else we can help you or your family with. Thanks again!!"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "106522095140278932406", "name": "CLAY SIKES", "time": 1572477546948, "rating": 5.0, "text": "Great company! I would highly recommend", "pics": null, "resp": {"time": 1572480973443, "text": "Thanks! Let us know if we can help with anything else"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "104716897064604140992", "name": "Laurie Perkins", "time": 1577913284498, "rating": 5.0, "text": "I would highly recommend AAA Security. Good people", "pics": null, "resp": {"time": 1577926790298, "text": "Thank you 😊"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "117085481680902958942", "name": "Cody Berguson", "time": 1570216978476, "rating": 5.0, "text": "Did an outstanding job with very fair pricing installing cameras in our new pharmacy in Gardendale,AL.   They are always available to answer questions and work with all your security needs.  A+", "pics": null, "resp": {"time": 1570218245135, "text": "We greatly appreciate your business. Call us if you need anything at all"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "108302091857846622974", "name": "Brandon Perry", "time": 1582555359421, "rating": 5.0, "text": "Excellent company. Fast, trustworthy & dependable", "pics": null, "resp": {"time": 1582580683625, "text": "Thanks for the review"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "111722389998134474343", "name": "Glenda Hassell", "time": 1570461524774, "rating": 5.0, "text": "Wonderful folks to work with.  They responded quickly when called and worked with us to get exactly the system we asked for to replace our old outdated system. Highly recommend them.", "pics": null, "resp": {"time": 1571107677595, "text": "Thank you for the business. Please let us know if we can help with anything else"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "110773617046586010571", "name": "Kendra Perry", "time": 1582559863448, "rating": 5.0, "text": "Excellent service and high quality equipment!", "pics": null, "resp": {"time": 1582580689507, "text": "Thank you for the review! Please let us know if we can help with anything else"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "106923231385106596763", "name": "Mollie", "time": 1578790881705, "rating": 5.0, "text": "Amazing Price's and very professional!!", "pics": null, "resp": {"time": 1570139306412, "text": "Thank you"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "107251007784104441690", "name": "djack1776", "time": 1570461523723, "rating": 5.0, "text": "Chris came out and did an estimate which was a reasonable price, then set up a date and time to install the system. He arrived promptly at the time of the install, he was professional and knowledgeable. He left the house exactly as he found it no mess nor scuff marks. When left I had everything I needed to work the security system, and there weren't any hidden fees, or overage charges.", "pics": null, "resp": {"time": 1570741874133, "text": "It was a pleasure doing business with you. Let us know if you need anything"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "117244813199985668706", "name": "Roger Mills", "time": 1572457564634, "rating": 5.0, "text": "Great work great people", "pics": null, "resp": {"time": 1572462451285, "text": "Thanks for the review. Let us know if we can help with anything else"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "109032796575984958253", "name": "S G", "time": 1570461520353, "rating": 5.0, "text": "Super nice guy. Always helpful and friendly", "pics": null, "resp": {"time": 1572456788643, "text": "Thank you! Please let me know if we can help with anything else"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "106222375099892713216", "name": "Mitsu Swag", "time": 1570470651557, "rating": 5.0, "text": "Good prices and good people", "pics": null, "resp": {"time": 1570471904601, "text": "Thank you for the review! Please let us know if we can help you with anything"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "102781813966749278098", "name": "Sam Pollock", "time": 1583180416635, "rating": 5.0, "text": "Always professional and reliable service", "pics": null, "resp": {"time": 1583185218748, "text": "Thank you for the awesome rating! Please let us know if we can help you with anything else"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "112454059858416755301", "name": "Michael Campbell", "time": 1570461520584, "rating": 5.0, "text": "Local company with great service, much better than some corporate provider.", "pics": null, "resp": {"time": 1570741771957, "text": "Thank you. It was a pleasure doing business with you. Call us if you need anything else"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "108564100375700318013", "name": "Craig Kelley", "time": 1572745440170, "rating": 5.0, "text": "Great Company!", "pics": null, "resp": {"time": 1572754433961, "text": "Thank you. Let us know if we can help with anything else"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "115050960637172818716", "name": "matthew basaraba", "time": 1570217096290, "rating": 5.0, "text": "Fast and professional service! Thank you!!!", "pics": null, "resp": {"time": 1570218291339, "text": "Thank you for the review. Let us know if we can help with anything else"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "116771111395741735642", "name": "Roberto Sasquatch", "time": 1570461524580, "rating": 5.0, "text": "I have been a customer with AAA Security for several years now, and I have been extremely satisfied with them.... I contacted them to come out and straighten out a mess that another company had started and couldn't successfully complete.... AAA had my system up and running very quickly!.... Over the years, the service with AAA Security has been awesome!.... As a matter of fact, I think they should rename their company -  A+A+A+ Security..... Any time I have ever had any kind of problem, technical or otherwise, they were Promptly there to resolve the issue... I highly recommend this company for all security Needs.\nRay G.  Boaz, AL", "pics": null, "resp": {"time": 1572456769156, "text": "I appreciate the business. Let me know if you need anything else"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "104250355286695849426", "name": "Michael Stone", "time": 1570461518395, "rating": 5.0, "text": "Great service and great prices. Highly recommend this company to everyone.", "pics": null, "resp": {"time": 1570748642481, "text": "Glad we could help you. Thanks for the review. Call us if you need anything"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "114245956299478563011", "name": "Philly G", "time": 1570461518538, "rating": 5.0, "text": "Awesome service and solid reputation in gadsden and surrounding areas. Locally owned and operated.", "pics": null, "resp": {"time": 1572456805693, "text": "Thank you! Let us know if we can help with anything else"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "102409935404099742103", "name": "Chris H", "time": 1570461518444, "rating": 5.0, "text": "Great company to work with.", "pics": null, "resp": {"time": 1572456822388, "text": "Thanks for the business. Let us know if you need anything else"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "106827783113504898859", "name": "E W", "time": 1579037745358, "rating": 5.0, "text": "great company", "pics": null, "resp": {"time": 1579042635728, "text": "Thanks again for the business. Let us know if you need anything else"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "117640061676887271934", "name": "Tara Lovell", "time": 1571974330414, "rating": 5.0, "text": "Highly Recommend!!", "pics": null, "resp": {"time": 1572008038559, "text": "We appreciate your business for the past several years. Let us know if we can help with anything else"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "100555543250448279052", "name": "Karon Kimbril", "time": 1570461520517, "rating": 5.0, "text": "Honest service and reasonable prices!  If there’s ever a problem, they will take care of it!", "pics": null, "resp": {"time": 1571107716377, "text": "Thanks again for the business! It was a pleasure working with you. Let us know if we can help with anything else"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "113410017628342420376", "name": "Miles Mason", "time": 1575504655139, "rating": 5.0, "text": "great company", "pics": null, "resp": {"time": 1575509294381, "text": "Thank you. Let us know if we can help with anything else"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "116144567856020682655", "name": "Jonathan Reynolds", "time": 1570461524270, "rating": 5.0, "text": "Awesome customer service and very professional.", "pics": null, "resp": {"time": 1570810120070, "text": "Thank you for the business! Please let us know if we can help with anything else"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "112924977521131241573", "name": "John Valdes jr", "time": 1570461524308, "rating": 5.0, "text": "Great company!", "pics": null, "resp": {"time": 1571853069880, "text": "Thank you again for your business. Let us know if we can help with anything else"}, "gmap_id": "0x888a3f6bb5250813:0xfa754e340cf955d9"}
{"user_id": "116712609935706616496", "name": "Christen Payne", "time": 1597701375460, "rating": 5.0, "text": "Great price and service! We have been grateful to have our AAA security system to feel protected! Their customer service and call center staff are so supportive and helpful. Would definitely recommend!", "pics": null, "resp": {"time": 1597706485095, "text": "I really appreciate the feedback. Please call me if you need anything at all. Thanks and God bless"}, "gmap_id": "0x888bb32d620b8e83:0xd5e1274d95d4fdf5"}
{"user_id": "109078886114725343178", "name": "Cynthia Forsman", "time": 1598493266626, "rating": 5.0, "text": "I would highly recommend AAA Security! Chris was extremely attentive to what I needed and was very professional and thorough in getting it done.. I will never use anyone else for any security issues...", "pics": null, "resp": {"time": 1598534836360, "text": "I appreciate the feedback. Please let me know if you need anything else. It was a pleasure working with you. God bless!"}, "gmap_id": "0x888bb32d620b8e83:0xd5e1274d95d4fdf5"}
{"user_id": "105107509300133585367", "name": "Gala Martin", "time": 1594945850918, "rating": 5.0, "text": "AAA Security installed a home camera security system for me five years ago that has worked wonderfully!  They are extremely professional, responsive, work quickly, and leave you with very reliable security.  I highly recommend them!", "pics": null, "resp": {"time": 1594950713462, "text": "Thank you so much for the review. Please let us know if you need anything else"}, "gmap_id": "0x888bb32d620b8e83:0xd5e1274d95d4fdf5"}
{"user_id": "104523197909592298247", "name": "Trey Short", "time": 1589405038704, "rating": 5.0, "text": "I love working with these guys. They are quick, efficient, and the systems that they put in a top-notch and high-quality. When all is said and done I will have four separate property secured by these guys.", "pics": null, "resp": {"time": 1589421680707, "text": "Again I appreciate the business. If you need anything at all let us know. Enjoyed working with you"}, "gmap_id": "0x888bb32d620b8e83:0xd5e1274d95d4fdf5"}
{"user_id": "112588770725612165322", "name": "Jeremy Acray", "time": 1578535458116, "rating": 5.0, "text": "AAA has done several jobs for me over the last 15 years, both surveillance systems and security. They are currently helping me upgrade my home to become a more interactive “smart home.” They have always been very honest and dependable and stand  by their work. Highly recommended.", "pics": null, "resp": {"time": 1578536344992, "text": "Thanks for the business. Let us know if we can help with anything else"}, "gmap_id": "0x888bb32d620b8e83:0xd5e1274d95d4fdf5"}
{"user_id": "116144567856020682655", "name": "Jonathan Reynolds", "time": 1577913790359, "rating": 5.0, "text": "The installer was extremely meticulous and professional.  My monthly rates are much more affordable than I expected, and I would recommend them to anyone who is interested in a security and/or camera system.", "pics": null, "resp": {"time": 1577926723452, "text": "Thank you for the business. Please let us know if you need anything else. God bless!"}, "gmap_id": "0x888bb32d620b8e83:0xd5e1274d95d4fdf5"}
{"user_id": "114744949756570811860", "name": "Robert Sadler", "time": 1578591109339, "rating": 5.0, "text": "Chris has serviced our business and Home with extreme professionalism and quality service. His company has provided security surveillance and data communications. His staff is very knowledgeable and recommended quality products that perform and declared. Thanks Tripple AAA for making it easy to do a positive review!", "pics": null, "resp": {"time": 1578599760951, "text": "We are glad that you are satisfied with our service. Please let us know if we can help with anything else"}, "gmap_id": "0x888bb32d620b8e83:0xd5e1274d95d4fdf5"}
{"user_id": "108925138109331589442", "name": "Jimmy Loyd", "time": 1578539982575, "rating": 5.0, "text": "Great service and very knowledgeable. Has been serving my home for 3 yrs with no problems.", "pics": null, "resp": {"time": 1578572556002, "text": "Thank you for your business. Please let me know if we can help with anything else."}, "gmap_id": "0x888bb32d620b8e83:0xd5e1274d95d4fdf5"}
{"user_id": "101365537040734459667", "name": "Gregg Hankins", "time": 1582217080982, "rating": 5.0, "text": "They have served me for 6yrs now and have always been there when needed and if we accidentally set the alarm off it is only a minute until the authorities are calling.  I highly recommend this company.", "pics": null, "resp": {"time": 1582221372636, "text": "Thank you for the great review. Been a pleasure to work with you. Let us know if we can help you with anything else"}, "gmap_id": "0x888bb32d620b8e83:0xd5e1274d95d4fdf5"}
{"user_id": "110773617046586010571", "name": "Kendra Perry", "time": 1582559964773, "rating": 5.0, "text": "Excellent service, great equipment! Highly recommended!", "pics": null, "resp": {"time": 1582580629078, "text": "Thank you for the review! Please let us know if we can help with anything else"}, "gmap_id": "0x888bb32d620b8e83:0xd5e1274d95d4fdf5"}
{"user_id": "116417556698631853250", "name": "Laurie Perkins", "time": 1577912967304, "rating": 5.0, "text": "Great company! Very reliable and reasonable prices", "pics": null, "resp": {"time": 1577926694674, "text": "Thank you for your view. Let us know if we can help with anything else"}, "gmap_id": "0x888bb32d620b8e83:0xd5e1274d95d4fdf5"}
{"user_id": "117786196804113453513", "name": "Hunter Perkins", "time": 1577745786756, "rating": 5.0, "text": "Great company! Professional and reliable", "pics": null, "resp": {"time": 1577750815519, "text": "Thank you"}, "gmap_id": "0x888bb32d620b8e83:0xd5e1274d95d4fdf5"}
{"user_id": "115918130127621274839", "name": "Angie Perkins", "time": 1577922130084, "rating": 5.0, "text": "Great company. Christian owned and operated!", "pics": null, "resp": {"time": 1577926742505, "text": "Glad we could help. Let us know if we can help you with anything else"}, "gmap_id": "0x888bb32d620b8e83:0xd5e1274d95d4fdf5"}
{"user_id": "108302091857846622974", "name": "Brandon Perry", "time": 1582555479262, "rating": 5.0, "text": "Highest integrity & quality products!!!", "pics": null, "resp": {"time": 1582577047336, "text": "Thank you for the review!"}, "gmap_id": "0x888bb32d620b8e83:0xd5e1274d95d4fdf5"}
{"user_id": "106827783113504898859", "name": "E W", "time": 1579037801155, "rating": 5.0, "text": "great company", "pics": null, "resp": {"time": 1579042606344, "text": "Thanks again for the business. Let us know if you need anything else"}, "gmap_id": "0x888bb32d620b8e83:0xd5e1274d95d4fdf5"}
{"user_id": "108101021089654391498", "name": "Ma'at Dei", "time": 1620812389820, "rating": 5.0, "text": "Professional and fast. This is a great company and I would recommend them for any home or business.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "111650325185761495626", "name": "Robert Chappell", "time": 1614914408593, "rating": 5.0, "text": "I am very pleased with my ADT security system! The techs are very professional and exhibit extreme concern that you are completely satisfied with their work before they leave. Excellent customer service!", "pics": null, "resp": {"time": 1614952011011, "text": "Hi Robert. Thank you for the 5 Star Review :-)"}, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "113223786916724216152", "name": "Jay Starling", "time": 1614113761147, "rating": 5.0, "text": "Our sales representative, David Jackson, quickly responded to the request to review our current system and provided several system upgrade options.  Our installer, Jeff, arrived on time and did an outstanding job.", "pics": null, "resp": {"time": 1614130980565, "text": "This is great news, Jay. We appreciate the love ♥️ 💕 💞"}, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "111973787564470105759", "name": "Joyce Boigenzahn", "time": 1607606719142, "rating": 5.0, "text": "Thank you Scott for upgrading our home security system with ADT. We have used ADT for over 10 years and we have never had a problem. The tech, Scott was professional, polite, and very knowledgeable. He worked effectively and efficiently, answering all of my questions (I had alot) and even taking extra time to explain future upgrades. Thank you ADT and Scott.", "pics": null, "resp": {"time": 1607626861556, "text": "Thank you for being a member of the ADT family, Joyce, and for taking the time to share your awesome experience."}, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "113289572783623439442", "name": "jeffery davis", "time": 1624657138607, "rating": 1.0, "text": "No stars, I would not reccomend ADT anyone.   Worst customer service ever!", "pics": null, "resp": {"time": 1624712492892, "text": "Hello Jeffrey- We are so sorry to hear about your experience. We would love to help you. Please reach out to us at alwaysthere@adt.com for further assistance."}, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "104998227444322801517", "name": "Shellie Weaver", "time": 1600906606475, "rating": 5.0, "text": "Michael had exceptional customer service. He was efficient and attentive to all of our needs. When it came to providing an experience for us he went above and beyond. We would highly recommend him to anyone!! Job well done!!", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "102094764118638861613", "name": "Monica", "time": 1620728364176, "rating": 2.0, "text": "My ADT representative did an outstanding job. He went over several packages to ensure I knew my options. Working with David, I feel safe and secure. He answered all the questions I had and walked me through everything I needed. I will recommend Mr. Jackson's services to others.\n\nUpdate: I gave Mr. Jackson a referral to one of my friends and he criticized him on his credit without knowing if he was a victim of identity theft. Change the rating from 5 stars to 2 stars", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "115841425118961113086", "name": "L Craig", "time": 1589242898781, "rating": 5.0, "text": "Excellent service, quick install and has been a positive experience so far. My account representative took the time to make sure I had all that I needed and that I understood all of my equipment. I feel secure and I am very happy with ADT. Highly recommend their service and my representative David.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "107027554629984533229", "name": "Jan Kimble", "time": 1596399260966, "rating": 5.0, "text": "David Jackson was the sales representative from ADT. Mr. Jackson is very knowledgeable about the service I requested . He was highly efficient, arrived promptly for each scheduled visit and answered all of my questions. Very professional.\n\n.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "108576332391737540210", "name": "Joyce SIMMONS", "time": 1562443743868, "rating": 5.0, "text": "I am absolutely satisfied with the services I received from ADT Sales Representative David Jackson.  From the beginning till completion of installation.  David was thorough as well as PATIENT with me.  I had many questions but he answered them all.  I felt safe and comfortable with David.  He was extremely professional and knows his products well.  I will without hesitation recommend him to others.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "110643657650802303377", "name": "Carolyn Howze", "time": 1560377110353, "rating": 5.0, "text": "We've had ADT since becoming homeowners 5 years ago. Jonathan Givens is our awesome technician! He is very knowledgeable and we have had all positive experiences with his services. We are blessed to have him servicing our system and answering any questions we might have.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "106685406444347128393", "name": "Matt Campbell", "time": 1560015187858, "rating": 5.0, "text": "David Jackson, I greatly appreciate you sitting down with me and discussing the different types of products that ADT has to offer.  Purchasing something significant can be a very hard decision for most people, but having a professional like Mr. Jackson there to  assess the situation accurately is very helpful. Thank you for helping get my set up done as soon as possible. I do not know what kind of wand Mr. Jackson has under his sleeve, but it must be  really good because he was able to get me on the install schedule extremely fast. I recently had an issue so I wanted to secure my property and feel safe at home once again. ADT has an excellent set of products, many cameras and motion sensors, window monitors, temp controls, etc. What I like so far about the set up is that I can view all of the security on my phone and also on any computer.  I am looking forward to hearing from Mr. Jackson in the future and I hope to have a fantastic relationship with ADT. Thank you", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "114065927104297974792", "name": "J Renzenburger", "time": 1569958957165, "rating": 5.0, "text": "ADT Technician Jacob Bohannon was extremely quick and efficient. He had our system installed in no time and was very helpful explaining the features. Please be sure he is recognized for his outstanding attitude and great customer service, he is a real asset for ADT.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "107469307136677580990", "name": "Thaddeus Porter", "time": 1594120430628, "rating": 5.0, "text": "Fantastic customer service.  Very fast, very professional, and very knowledgeable!", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "103036244481624794110", "name": "Lisa Nicholas", "time": 1593713138735, "rating": 5.0, "text": "It was shared to me the system and how it work. The agent was understanding and gave details of the system.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "115380444109926682098", "name": "Sharity Scott", "time": 1559315685672, "rating": 5.0, "text": "You can't go wrong with Scott Chamblin! He updated our ADT system flawlessly. He was a true professional, very competent and proficient at his job. Once installs were complete, he was very patient with us while ensuring we could work the new system. We were very satisfied with the results. Will request him by name for any future services. Thanks Scott!", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "108469196919106911691", "name": "Sherrie Shown", "time": 1592274633676, "rating": 5.0, "text": "ADT has kept me feeling safe and secure for over 11 years.  The company is very customer oriented and will go above and beyond to see that everything is exactly to your liking.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "106111375037217473704", "name": "Tamara Myers", "time": 1594422383958, "rating": 5.0, "text": "Thank you David for all your help. You made sure to explain to me about ADT and what services they provided.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "106386327206677447903", "name": "Andrea Bach", "time": 1597015848238, "rating": 5.0, "text": "Great customer service always there for any questions.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "110309128180798684181", "name": "Linda Barsczewski", "time": 1564155023521, "rating": 5.0, "text": "We recently had an ADT tech, Jonathan Givens, at the house to assist us with an issue regarding our exterior security camera. Jonathan immediately knew what was causing the problem and was able to resolve it. He was professional, courteous and very knowledgeable. We sincerely hope that all ADT techs are like Jonathan... Thank you ADT and Jonathan!!! Job well done!", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "107962327280009634421", "name": "Bobby Ford", "time": 1556823573719, "rating": 5.0, "text": "My experience with ADT was outstanding.  I have nothing but great things to say about the service that I received from both the service agent (Ms Morgan Hamel), and the technician that installed the ADT system.  Accolades to both of your employees for outstanding service.  I end with big thank you to Ms Morgan for taking time to explain the different options and to help me select the best package to fit my requirements. The technician was great and he took the time to go over and familiarize me with each component on the system.   Thanks again and may God Bless....\nBobby L  Ford", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "104292460319233025104", "name": "Chip Westberry", "time": 1560602916300, "rating": 5.0, "text": "We have been using ADT security services for many years.  We recently completed an addition to our home and needed additional equipment.  David Jackson drove down from Montgomery to help us determine what equipment would best cover our needs.  He and James House were very knowledgeable and helpful.  We are very pleased with the results.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "113832712423835446145", "name": "Thomas Susi", "time": 1565040259896, "rating": 5.0, "text": "Service technician Jonathan Givens did a great job. Took his time and explained the system to this elderly couple. We are not that computer savvy so he was patient with us. Kind, polite and was on time.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "114583852960009506397", "name": "James M. Levy", "time": 1556636256867, "rating": 5.0, "text": "David did an exceptional job. He is friendly, professional and answered every question I had. Additionally, he cleaned up any mess made. I strongly and happily give him and ADT 5 stars!!", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "100513523916139289490", "name": "Wendy Gay", "time": 1563630031884, "rating": 5.0, "text": "We've had ADT for many, many years and David in Montgomery was by far one of our best reps.  He is very detailed and customer focused.  And wants only the best for me (customer).", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "107311463253930933763", "name": "Michelle S", "time": 1562354028244, "rating": 5.0, "text": "Jonathan Givens was my technician today, he was very prompt and was able to address my issue and get me back up and running in minutes.  He was excellent with my rescue dogs and explained what was going on along with the fix.  Only thing ADT needs to work on it length it takes to get a technician when a customer has a problem.  Waited about 2 weeks for appointment and in and out in like 30 minutes.  Jonathan Givens is a huge asset to your company and I tell all my friends about ADT and Jonathon.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "103199474430465666255", "name": "Francine Anderson", "time": 1563651944403, "rating": 5.0, "text": "I am so very happy I chose ADT for my home security. ADT Technician Scott Chamblin was the individual who came out to my home and he was so very informative and knowledgeable about the  company’s products and services.   Before leaving, Scott made sure that my new system was properly working and that I knew how to operate it along with the new features.  ADT, thank you for your protection and for sending such an outstanding technician to initiate your services.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "110573600556821866373", "name": "Gina Griffin", "time": 1560399893434, "rating": 5.0, "text": "Jonathan Givens was amazing.. i was initially told my appointment would be Friday but Jonathan saw that he was within 10 miles of my house and called me to see if he could come a few days early. This was such a blessing because i live alone and i depend on my security system. Thank you Jonathan", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "110360478281608214349", "name": "Joshua Carlson", "time": 1562100539407, "rating": 5.0, "text": "Got Jacob to set up our ADT alarm - he was exceptionally helpful and quick. Would definitely request him by name if we got more work done.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "117140979462627658534", "name": "Kathy Perreault", "time": 1562261563432, "rating": 5.0, "text": "Jonathan Givens, the technician who installed our ADT security system, was very knowledge and helpful. He was very patient as he guided us through the operation of the system. We were glad to hear that we can contact him directly if we have a question or a problem in the future.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "102784525424289572507", "name": "Yvette Esteves", "time": 1564602833120, "rating": 5.0, "text": "Mr. Givens arrived on time like always. He was on task right away. Mr. Givens updated our cel unit and successfully fixed ALL our Z-Wave switches. We appreciate his professionalism.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "106244995566605395594", "name": "Phillipian 4:10", "time": 1559340586721, "rating": 5.0, "text": "Scott Chamblin was perfect. He came in to upgrade our system and was professional and efficient.  He reviewed the entire system with our family, he was patient and thorough. Grateful for this type of customer service experience.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "103301205605834290249", "name": "Taye moore", "time": 1578101864388, "rating": 1.0, "text": "Terrible. They will give you a 5 hour window and be a no show.  say they tried to call and reschedule you for 2 weeks later.  Try another company.", "pics": null, "resp": {"time": 1578498691594, "text": "Hello Tay- We are disappointed to hear of your experience. We are happy to help you. Please reach out to us at alwaysthere@adt.com. Please provide us with your phone number, address and please reference your post."}, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "112259115655072385278", "name": "Leslie Strappy", "time": 1559055860889, "rating": 4.0, "text": "David has been awesome getting everything ready for me and also instrumental and helping me getting personal specifications set up on my new system.  This has been a smooth transition because of David.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "104386188900761439219", "name": "Anthony Barnes", "time": 1589336227649, "rating": 5.0, "text": "Mr. David Jackson was very nice and informative,  great job", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "102763548873064390826", "name": "Samantha Podloski", "time": 1553205635706, "rating": 5.0, "text": "Chris King was awesome. I love our system and he explained everything to me. He was very patient and helpful and answered all of my questions.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "113023382180283749032", "name": "Edie Butler", "time": 1567618019307, "rating": 5.0, "text": "Jonathon Givens has serviced our home issues several times and each time he has been professional, courteous, and genuinely interested in correcting all issues with excellent care.  We LOVE our ADT.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "110796622449800635390", "name": "Yvonne McBeth", "time": 1572040898061, "rating": 5.0, "text": "ADT, I had the pleasure of meeting Dakoda Blietz today.  He had come to installed additional equipment in my home.  I just wanted to thank and praise him for a job well done. His excellent customer service skills, his professionalism,  his patience and his thoroughness was 5 Star.  He answered my questions, asked again if I had any more question.  What  really impressed me,  was how he communicated back to the  ADT.  He repeated back to the office what he understood them say during the conversation for clarity.  I am retired 30 years in the utility industry  in customer service.  I rarely hear or see such committed service to ensure the customer is taken care the first time.\n\nPlease thank Dakoda for me again!!!!", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "108032616730463248098", "name": "MIKE COSBY", "time": 1558382905637, "rating": 5.0, "text": "Scott Chamblin was awesome! He was very Professional and on time. He made sure he answered all my questions and walked me through the ADT app, and made sure i had a full understanding of how you use my app. Thanks Scott!!", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "102543843397394672565", "name": "Kyle Nichols", "time": 1559426884866, "rating": 5.0, "text": "Scott Chamblin was very helpful with our out of date system. Fixed us up with a new system and made our home protected. He was professional and personable. Overall, very pleased with our ADT service.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "111111360918290092058", "name": "Anthony Channell", "time": 1563539270753, "rating": 5.0, "text": "I have had my ADT system for 90 days.  My Security Specialist, David Jackson, regularly checks with me on my system to make sure everything is going well.  He is most courteous and anxious to make sure I love and understand my security system.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "118383871042527160593", "name": "Robert Marshaljr", "time": 1564796941297, "rating": 5.0, "text": "Joanthan Givens repaired my ADT Security system at 2452 County Road 112, Dothan, Al in a very professional matter.  He is a great person to work with  and makes sure your system working right.  He is very hard worker.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "116800409984556398479", "name": "Vic Harris", "time": 1561047349708, "rating": 5.0, "text": "David Jackson helped my mother Dr. Ella Bolling Harris, yesterday on June 19th 2019. My mother had been given the run around byanother representative in a different state and due to that was planning on leaving ADT. But thanks to Mr. Jackson's knowledge, personable attitude and professionalism my mother continues to be a customer and a deal was made that accommodated her needs.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "114964724235281021300", "name": "Cyndi Harrell", "time": 1562696761005, "rating": 5.0, "text": "Mr. Givens was an excellent ADT Tech. He answered all our question made sure we knew how to work the system. Great job", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "103592236348967611146", "name": "Stephen M. Wright", "time": 1553454220922, "rating": 5.0, "text": "Scott Shamblin was a total professional.  He explained the tasks completed and answered all my questions.  His professionalism was evident from the time he arrived until the job was complete. Kudos to him.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "108831394462764944954", "name": "Mary Evans", "time": 1557428704266, "rating": 5.0, "text": "David, sales representative, is personable and kind. Set us up for ADT and technicians sent did a great job!", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "100021371062785215119", "name": "Ginger Hicks", "time": 1560293452421, "rating": 5.0, "text": "Jonathan Givens was very professional, knowledgeable and helpful to me.  He answered all my questions and was very nice", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "104626306103436017264", "name": "Lynn Hale", "time": 1552510364943, "rating": 5.0, "text": "David diagnosed the problem correctly, had the gear and hardware to fix it, and completed it without any fuss. Took the time to go over everything with me, and answered all my questions. Well done, David - Thank you", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "111075086510352649116", "name": "Mark K.", "time": 1563985208149, "rating": 2.0, "text": "I called ADT to request service/repair of 3 year old system, which was installed by ADT. Telephone Representative very helpful in setting up appt. She told me that there would be no charge for the service call as our monthly charge includes the warranty. Service appt. was for the next day - very quick in getting an appt. Service tech - Jonathon Givens - had to replace two door sensors. He then proceeded to tell my wife that our system was outdated and needed to be updated. He offered to update it for a $100 fee. My wife told him she would have to speak with me first before we agreed to anything resulting in a charge. Jonathon then asked my wife how long had we had our system. She told him three years in our current home and approximately seven years in our previous house (total of approximately ten years with ADT.)  He then said he'd go ahead and update our system for no charge, which he did. What was that about??  Offer to update the system for $100?  Would that be considered fleecing a client? And if he was going to update the system for $100, does he pocket the amount, since he updated the system anyway. Kind of \"sketch\" as the kids say these days.  I have not been impressed with ADT monitoring services in the past, and only continued service with them after the 2 year contract (at which time they were going to increase my monitoring price $10/month.) They agreed to keep it at the same rate as long as I agreed to another 2 years.  When the 2 years are over, I'm finished with ADT.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "112781402512861625953", "name": "Charles Hill", "time": 1560896187543, "rating": 5.0, "text": "ADT was here on time.  Tech ( Dakoda Blietz) was outstanding.  Very Polite, nice & professional young man.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "107476254934977971428", "name": "OLUSINA AKINDURO", "time": 1560023112026, "rating": 5.0, "text": "Jonathan Givens was very professional, courteous and did an exceptional job in a timely manner.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "106798747892668822121", "name": "Adnan Sabir", "time": 1607793168931, "rating": 1.0, "text": "Extremely dissatisfied.", "pics": null, "resp": {"time": 1607862328989, "text": "Yikes Adnan!- We're very sorry to learn of your unsatisfactory experience as an ADT family member! Please email our team directly at Alwaysthere@adt.com with more info in regard to your issue and the full address in which the services are located, so we may help you further. ~ Thank you"}, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "108378543961214611521", "name": "Jay Williams", "time": 1541472952780, "rating": 1.0, "text": "I was an 11 year customer of ADT. I was excited to move to a new home and take ADT with me. Unfortunately my mom passed away the day before ADT was set to install. Even under all that pressure I remembered to call and cancel the install while I was out of town. I've been out of pocket for weeks trying to handle mom's business, grieve, and still live so I haven't had a chance to reschedule. ADT proceeded to still charge me two months of service at my old location even though they knew I had cancelled the service at my old house. When I caught it, the call center manager told me that they still bill you 30 days after you cancel. I asked about the other month and she said \"oh we prorated that and took it out of your installation fee.\" So I prepaid $100 for an install that I didn't get. And they took money out of my installation fee for two more months before I caught it. All this while they say sorry for your loss but...at least we gave you back the second month. So instead of $100 back I got about $50. Even during our time with them we were paying several months during one of their glitches and they weren't even monitoring my home.\n\nNo more ADT for me. EVER. And I'll let everyone I know not to get ADT. There are other options now.", "pics": null, "resp": {"time": 1541529605945, "text": "Hello Jay. Our condolences for your recent loss! We'd like to look into your concerns further to help. Could you please email us the phone number and address associated with your account to AlwaysThere@adt.com? Thank you. -Andrew"}, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "109513736843071221838", "name": "Katie Roby", "time": 1558118059831, "rating": 5.0, "text": "Scott Chamblin updated my security system today. He did a fantastic job of installation and instructing on the usage of the updated technology", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "106983195951972019318", "name": "Michael Washington", "time": 1553081702383, "rating": 5.0, "text": "David was professional and helpful !", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "100694931449489644383", "name": "Alberta Giles", "time": 1542728105897, "rating": 5.0, "text": "Excellent customer service.", "pics": null, "resp": null, "gmap_id": "0x888e853ff021d80d:0xf7ad60f0c28dd7ed"}
{"user_id": "102723929157550867987", "name": "Steven Spurgeon", "time": 1616694353850, "rating": 5.0, "text": "I brought the Speaker and they installed the amp,  and I am very pleased  with these guys.  They were very Professional and Friendly and I will be back in the future! Thanks for hooking me up with a Great Sounding System!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMhiHP_5A2cjMxsa5VihWW9VOZHety27OUWw4gK=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOgAQxh7AWqkNGKHthPJDmuEUbBitWEyd2KqzEE=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x887d4e616b36a3d1:0xe77c1c5a1a06b533"}
{"user_id": "109598818115570134277", "name": "Shai G", "time": 1620839913620, "rating": 5.0, "text": "Awsome service, if anything needs to be altered they let you know. Very professional and quick. They updated the factory radio in two of my vehicles. The only place I go to for my audio needs.", "pics": null, "resp": null, "gmap_id": "0x887d4e616b36a3d1:0xe77c1c5a1a06b533"}
{"user_id": "105442008943532777182", "name": "Rachel Nix", "time": 1619205735039, "rating": 5.0, "text": "Excellent spot for getting your car hooked up with a solid stereo. The staff is friendly and knowledgeable. Prices are fair. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x887d4e616b36a3d1:0xe77c1c5a1a06b533"}
{"user_id": "116963059448944985583", "name": "John Lindsey", "time": 1615260453475, "rating": 5.0, "text": "Absolutely phenomenal work. I have a 2014 Tacoma double cab (very limited space) and they made it hit HARD and sound very clean. Very nice people and do very clean work. 10/10", "pics": null, "resp": {"time": 1616268239476, "text": "Thank you so much! If you need anything else just let us know"}, "gmap_id": "0x887d4e616b36a3d1:0xe77c1c5a1a06b533"}
{"user_id": "104038593999364367019", "name": "Haley Thornton", "time": 1500750009416, "rating": 5.0, "text": "Come see us for all your audio needs! Tint, mobile DVD players, backup cameras, we have it all 😊", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOUHO1Kv-fBmQFvWoZfT4OlrAQrYXWEU-YZhB0T=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNy2LsLyxwqTFITh28NPZe3MwoFtjDeT0_Ux21Y=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMEUQBDteMiDGSwDXqKtLlUBZm3-ZStLu_byQ_v=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x887d4e616b36a3d1:0xe77c1c5a1a06b533"}
{"user_id": "104255157375609180358", "name": "Ida Dyer", "time": 1624230715298, "rating": 5.0, "text": "Great customer service everybody was friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x887d4e616b36a3d1:0xe77c1c5a1a06b533"}
{"user_id": "110749435991472066896", "name": "Frederick Abbott", "time": 1610583205817, "rating": 4.0, "text": "They do good work in the timely manner. My only concern was no one there wears a mask doing this pandemic and when my car was returned it smelled like cigarette smoke. I don't smoke", "pics": null, "resp": null, "gmap_id": "0x887d4e616b36a3d1:0xe77c1c5a1a06b533"}
{"user_id": "112735059950440278838", "name": "steve Copeland", "time": 1605909330040, "rating": 5.0, "text": "If you're in the market for some great car audio sound, see these guys. They offer layaway, and a couple different finance options.", "pics": null, "resp": null, "gmap_id": "0x887d4e616b36a3d1:0xe77c1c5a1a06b533"}
{"user_id": "116530762504749581411", "name": "Aaron Wade", "time": 1583133082256, "rating": 5.0, "text": "Due to the nature of my job I am away from home five days a week (truck driver). Read the reviews on Google and gave them a call. Upon my arrival staff was extremely welcoming and professional. To my surprise I was able to get my vehicle serviced on a Saturday with no appointment. Installation price was competitive. Definitely worth the hundred plus mile drive!", "pics": null, "resp": null, "gmap_id": "0x887d4e616b36a3d1:0xe77c1c5a1a06b533"}
{"user_id": "118209389701698904356", "name": "William Joo", "time": 1616452124151, "rating": 1.0, "text": "Im give one they want make jokes and not listen to what was wanted for my car", "pics": null, "resp": null, "gmap_id": "0x887d4e616b36a3d1:0xe77c1c5a1a06b533"}
{"user_id": "110453519716658125763", "name": "James Stout", "time": 1591310438928, "rating": 5.0, "text": "Good people that are knowledgeable and perform quality work! Price's competitive, convenient waiting area inside. I've had them to perform work on 2 of my vehicle's so far and haven't had a problem yet 🙂", "pics": null, "resp": null, "gmap_id": "0x887d4e616b36a3d1:0xe77c1c5a1a06b533"}
{"user_id": "109100502399044706440", "name": "Jenna Hansford", "time": 1578357434794, "rating": 5.0, "text": "This place is amazing! Just left this shop with a brand new radio. Great job! They were very hard workers and fit me in all within 1 hour! I highly recommend!!!", "pics": null, "resp": null, "gmap_id": "0x887d4e616b36a3d1:0xe77c1c5a1a06b533"}
{"user_id": "116479226595707524952", "name": "chauncy king", "time": 1580069878606, "rating": 1.0, "text": "At first I would have gave 5 stars because they were friendly people they fit me in without an appointment. But then I few months after they installed my music it all started going out one speaker at a time until the point where no sound at all was coming out. So after that I decided to take matters into my own hands because I used to install music myself years ago. upon removing the panels from my doors an getting to the back of the speakers it was obvious that the wiring used on my speakers was very cheap because it had already dry rotted after a few months. I was able to get all my speakers back working again but then a few months after that they're already going back out only two of the speakers are working. so all-in-all I am not too happy about the job that was done on my vehicle.", "pics": null, "resp": {"time": 1580139828148, "text": "Hi Mr. King.\n\nUnless we're installing an amplifier or have reason to suspect that there is an issue with the wiring we just use the factory wire that's in the vehicle.\n\nWe also give you lifetime warranty on your labor. So if there was an issue you could have brought it back to us to check it out at no charge"}, "gmap_id": "0x887d4e616b36a3d1:0xe77c1c5a1a06b533"}
{"user_id": "112572608233468195440", "name": "Michael Tittle", "time": 1584236512000, "rating": 5.0, "text": "Justin and crew are good people.. Been there several times and each time I'm met with Honesty and a good deal. If Sundown and DD are what your audio goal is then this is the place in north AL you need to be. Oh, and Hailey is kinda cool too lol..", "pics": null, "resp": null, "gmap_id": "0x887d4e616b36a3d1:0xe77c1c5a1a06b533"}
{"user_id": "112142150734002608636", "name": "Justin Nix", "time": 1572453813955, "rating": 5.0, "text": "Went the shop. They are very knowledgeable about car audio and some great prices on DD and Sundown. That’s right they carry SUNDOWN. Possibly the first  dealer in North Alabama to do so. They had a Tahoe there with 8 15s in a 4th Order that got down and was just pure nasty on the Lows. It was a windy day at CarTunes in the Hoe. Thanks for the DEMO guys.", "pics": null, "resp": null, "gmap_id": "0x887d4e616b36a3d1:0xe77c1c5a1a06b533"}
{"user_id": "114852496708243758170", "name": "Nick Gist", "time": 1520315936825, "rating": 5.0, "text": "I just had all of my truck speakers and a cd player installed at Car Tunes of the Shoals and I am very pleased with the quality and service that I received! My speakers sound amazing and I didn't have to pay an arm and a leg either! I will definitely be back there soon. I have found my new Audio shop! Thank you Justin for the great service and for the good quality sounding speakers! I will definitely recommend your shop to anyone who needs great sounding speakers installed.", "pics": null, "resp": null, "gmap_id": "0x887d4e616b36a3d1:0xe77c1c5a1a06b533"}
{"user_id": "113294093946715162610", "name": "Randy Taylor", "time": 1571092719032, "rating": 5.0, "text": "Nice friendly people they know what there doing good prices only place I'll go for now on for my system needs", "pics": null, "resp": null, "gmap_id": "0x887d4e616b36a3d1:0xe77c1c5a1a06b533"}
{"user_id": "115453185023780046668", "name": "Bradley C", "time": 1580310659478, "rating": 5.0, "text": "Justin is super helpful and will give you the sound you need. 🔊🔊🔊", "pics": null, "resp": null, "gmap_id": "0x887d4e616b36a3d1:0xe77c1c5a1a06b533"}
{"user_id": "104166355304205186821", "name": "Mikel Miller", "time": 1600200126744, "rating": 5.0, "text": "Go holla at Justin over at car tunes! He'll always do u right!", "pics": null, "resp": null, "gmap_id": "0x887d4e616b36a3d1:0xe77c1c5a1a06b533"}
{"user_id": "101960784700385895689", "name": "Ronda Frank", "time": 1553292018880, "rating": 5.0, "text": "The staff genuinely care about you and your needs. They do not try to upsell you with stuff you don't need. I will be returning!", "pics": null, "resp": {"time": 1553292889793, "text": "Thank you for your business! We enjoyed working with you!"}, "gmap_id": "0x887d4e616b36a3d1:0xe77c1c5a1a06b533"}
{"user_id": "101345141769286272154", "name": "Omega Richardson", "time": 1551216956864, "rating": 5.0, "text": "Great customer&quality service! I will definitely return again!", "pics": null, "resp": null, "gmap_id": "0x887d4e616b36a3d1:0xe77c1c5a1a06b533"}
{"user_id": "105063328122388182584", "name": "Keith Abernathy", "time": 1543698271347, "rating": 5.0, "text": "Justin and Benton are true professionals, they made my budget system sound like it cost hundreds more, thanks guys", "pics": null, "resp": null, "gmap_id": "0x887d4e616b36a3d1:0xe77c1c5a1a06b533"}
{"user_id": "112641713325216618813", "name": "Ya boy Jbonez", "time": 1534130509997, "rating": 5.0, "text": "Awesome place and great people really good prices I’ll be back💯 They installed a KENWOOD DNX994s and all the modules job came out perfect 👌🏼", "pics": null, "resp": null, "gmap_id": "0x887d4e616b36a3d1:0xe77c1c5a1a06b533"}
{"user_id": "103517996641291680826", "name": "87 Chevy Caprice", "time": 1599500990350, "rating": 5.0, "text": "Good people", "pics": null, "resp": null, "gmap_id": "0x887d4e616b36a3d1:0xe77c1c5a1a06b533"}
{"user_id": "113343869885371270640", "name": "Jack McLemore", "time": 1558470781483, "rating": 5.0, "text": "For all your smart start needs", "pics": null, "resp": null, "gmap_id": "0x887d4e616b36a3d1:0xe77c1c5a1a06b533"}
{"user_id": "108457931765502749120", "name": "Betty Nestle", "time": 1549995774083, "rating": 5.0, "text": "Like there service", "pics": null, "resp": {"time": 1553303242514, "text": "Thank you! We greatly appreciate it!"}, "gmap_id": "0x887d4e616b36a3d1:0xe77c1c5a1a06b533"}
{"user_id": "116744503291177815653", "name": "regina hanback", "time": 1519369300645, "rating": 5.0, "text": "Love my tint job", "pics": null, "resp": null, "gmap_id": "0x887d4e616b36a3d1:0xe77c1c5a1a06b533"}
{"user_id": "103894708390948721427", "name": "Chrisee Richardson", "time": 1531261358145, "rating": 5.0, "text": "Owner and staff are wonderful.", "pics": null, "resp": null, "gmap_id": "0x887d4e616b36a3d1:0xe77c1c5a1a06b533"}
{"user_id": "100471762099926571046", "name": "Michael Powell", "time": 1550080299921, "rating": 5.0, "text": "Awesome", "pics": null, "resp": {"time": 1553303218364, "text": "Thank you!"}, "gmap_id": "0x887d4e616b36a3d1:0xe77c1c5a1a06b533"}
{"user_id": "101643199740396993547", "name": "Matt", "time": 1610906634523, "rating": 5.0, "text": "One of the best window tinting businesses in the Tri state area.  Accurate computer cut tinting process ensures the best installation quality.   I have been here for several of my cars.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "101695037577950491764", "name": "Matt Simmons", "time": 1616892259047, "rating": 1.0, "text": "I used to think my brother was someone he's never been - Honest.  Unfortunately you can't trust this business anymore.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "115339510481422696119", "name": "russell Duale", "time": 1594691542036, "rating": 1.0, "text": "DO NOT USE THIS COMPANY!!!!!! Dropped my car off at 0945 to have the windows tinted. Owner said he would call me as soon as he is wrapping things up so that I can pick my car up. 5 hours later, I still have not received a call from the owner. I decided to drive to the shop and check on the progress. When I arrived to the shop, I found that my car had not even been started!! Not only had it not been started, they left 40K car unlocked with the key in it with the shop locked up and not one employee to be found!! Again, DO NOT USE THIS SHOP FOR YOUR WINDOW TINT!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "118339289745771133231", "name": "Christian Colbert", "time": 1590256831290, "rating": 1.0, "text": "They have tinted a truck of mine in the past, it’s way over priced. Went there today to get one roll up door done and they told me to meet them at 1 and I get there at 1 and they tell me they can’t work on it. Drove 30 minutes. They looked high and weren’t even working. Talking the whole time I was there. Don’t use these guys", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "116041252602879384764", "name": "Dakota Pryor", "time": 1590515790586, "rating": 1.0, "text": "First off, we live an hour away from Dothan. We were told to be there at 10am...but we got there early. We were told it would take 3-4 hours so I had someone follow us so we could drive around to spare the time. After 4 hours we went back to find out that he had not even started on it and was working on someone else's vehicle! We got our keys and left! Poor customer service!", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "102376549027580655088", "name": "Eddy Palmer", "time": 1601810303290, "rating": 5.0, "text": "Quality tint. Expert installation.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "109935396516695633514", "name": "Barbara Coleman", "time": 1596662105330, "rating": 1.0, "text": "I took my son car to this shop on a Wednesday and didn’t get his car back until that following Tuesday and this was because I had to call the police on him . He did finish the tint but he wouldn’t answer calls . Not only that , he drove the car for personal use . Don’t use this place for tint.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "110089465949486875297", "name": "Kenneth Muna", "time": 1580067808805, "rating": 1.0, "text": "Terrible way to do business.  I have a lifetime warranty for my tint and I cant get ahold of anyone to get my tint fixed.  I called a ton of times and stopped by the shop several times only for no one to answer the door during business hours.  One time I saw Robbie the owner at the door and when I went up to the front door.....no answer again.  STAY AWAY FROM THIS SHOP.  THEY WILL RIP YOU OFF!!!!!  I'm taking my business elsewhere!!!", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "101389037124065354806", "name": "Jeffery Kelly", "time": 1557438182625, "rating": 1.0, "text": "DO NOT USE THIS COMPANY!!!!!!!!! Every 5 star feedback they have is paid reviews. They will drive you car home and use it for there own leisure. The Owner is a CONVICTED FELON. DO NOT DO IT!!! You might get lucky, or most likely you will lose your car and have to file police reports with hope you can find it. I have a very close friend that is in the same position. This company should be SHUT DOWN!", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "111077649273453655352", "name": "Kenneth Malone", "time": 1593382496042, "rating": 4.0, "text": "Has tinted all my cars professionally", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "109129261582157062941", "name": "Dan Kamilchu", "time": 1469064613382, "rating": 5.0, "text": "I love these guys! They do an outstanding job for a very reasonable price and they've been in the business for quite some time! Friendly, courteous, professional, and a quality job! Highly recommended especially for tinting your windows(which was my case). Keep up the great job, Rob & the crew!", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "114022046239114605122", "name": "Natalie Joiner", "time": 1471665046706, "rating": 5.0, "text": "My boyfriend called last minute to make an appointment and they were happy to fit me in do a tint job. The guy that drove my car in went out of his way to make sure I was aware of a problem with my car, which I thought was very nice. The guy at the desk was helpful with explaining the different tint types and with helping me make a decision on what I wanted. The job was great. The tint lined up with no bubbles. I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "113842211522444070317", "name": "The Dude", "time": 1490128093009, "rating": 5.0, "text": "I was very impressed with the quality of work and craftsmanship that came with the tint job. They have been in the tint business for a long time and it shows. Where else can you get a lifetime guarantee on not just the tint itself, but the installation of the window tint as well. All of that with the offer of quality tint from 3M at a cheap and competitive price.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "101830232312898193766", "name": "Bold Expression", "time": 1518215246025, "rating": 1.0, "text": "Told me the job would take 3 hrs but instead it had taken the entire day. Should’ve have stated on the phone that it may be a full day because I could’ve found someone else. NOT FAIR! If you tell a customer a certain time frame, stick to it or explain it may take longer! No recommendation from ever nor will I return.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "117171774785871459681", "name": "Jack Emerald", "time": 1503020562622, "rating": 1.0, "text": "Could a window tint outfit be more unprofessional or disappointing? I submit to you that Tint Spectrum holds the record for both accounts. They completely screwed up my Z71. The manager tried to sell me illegal tint, bragging that she had 20% on her car and nobody would ever ticket her, because she put tint on all the city police cars and it was illegal also. Yeah, that's what you want to here about local law enforcement. She was generally unpleasant and unprofessional. She shouted at her staff and fussed the entire time. The staff, by the way, were dirty and seemed incompetent. They left bubbles in my tint and blamed it on \"water residue\". Two weeks later, it's still here. Don't use these people. They are one step above crooks.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "116054935913000033643", "name": "Matthew Clawson", "time": 1358790825838, "rating": 5.0, "text": "They took me in on short notice, and did an excellent job on my car even staying to finish it after closing.  The car looks great!  I appreciate the attention to detail.  I recommend them for any tint work you need to have performed.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "117668097740456245190", "name": "Stacy 22", "time": 1593751192583, "rating": 1.0, "text": "Y’all Need Be Shut down the city will Very soon!!!", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "109757611253494853451", "name": "Caleb Cross", "time": 1503021082264, "rating": 1.0, "text": "Paid over $200 for a really crappy tint job. Tint has streaks and bubbles. In addition, there is overspray from the solution they used to apply the tint all over the interior of my Accord, in addition to streaks of it running down the doors. They literally sprayed what looked like gallons of this crap on my windows and let it run down through the interior of the door onto the ground. Is that not going to screw up my electrical?\n\nMeanwhile, the woman who was telling everybody what to do was nothing short of a witch. She kept shouting at people, cursing, and was very rude to me. One of the tint guys was making fun of the rims on my car while another kept spitting tobacco juice on the ground all around it. Then the owner lit up a cigarette and went to work on my window, blowing smoke all in my interior.\n\nWhy should I pay for this??? Incompetent staff, rude management, and an overall really bad experience. Don't waste your time. There are plenty of good tint shops in town without fooling with these people.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "106555191032613373324", "name": "Whitney Walker", "time": 1513379639879, "rating": 1.0, "text": "If I could score lower than 1 star, I would. For starters, my boyfriend dropped my car off on a Monday Morning with the promise that the turn around would be no more than 24 hours. As the days pass, he called for an update. After having several phone calls ignored, he finally went up there on Wednesday. The owner had a million excuses as to why the car wasn't complete, while he's sitting outside smoking a cigarette (doing nothing). He then told my boyfriend that he swears it will be done by 5pm the following day. My boyfriend went to get the car at 4:45 and it STILL was not complete, there was 1 window without tint. Of course, my boyfriend is upset and when he expressed his disappointment,  the owner cursed him out like it was his fault. Friday rolls around, it's after lunch and my car is STILL NOT FINISHED😠😠!!  MIND YOU, MY CAR HAS BEEN AT HIS SHOP SINCE MONDAY!!! DO NOT DO BUSINESS WITH THESE PEOPLE. If you pay with credit card they'll ask for a \"Cash Deposit\" 🤔🤔 I will never refer anyone to them or do business with them EVERRRRR again", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "104154592496680182787", "name": "Tawney Williams", "time": 1535060177745, "rating": 1.0, "text": "Do not use this company! Poor communication between the owner and his employees and them and us should have been my first red flag. The initial estimate almost doubled by the time the job started. Trash and debris left all over my yard every day. Shawty final work that was never inspected by said owner. Finally the work was finished and I had to have them come back out at threat of lawsuit to correct mistakes. Do not use this company!", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "108908816820367216409", "name": "Eli K", "time": 1503019736322, "rating": 1.0, "text": "This was absolutely the worst experience I've ever had with any car related shop. From the start, I was uneasy about the experience, but I went ahead with it. Huge mistake. I drove by today and a woman who said she was the owner's friend and acting manager waited on me. I asked her to inspect my car to put tint on the driver and passenger windows only. She inspected them and we agreed on a tint grade and a price. Then I walked down the street to the library to wait. About an hour later I decided to head back, and got a call from the manager on my way. She was agitated, and demanded to know if the car had ever had tint on it before. I replied that it may have, I bought it used. She said that they had already started applying tint to one window when they discovered that there was residue from old tint below the window sill. When I got back to the shop, the manager was in a frenzy. She pointed out the residue, and kept going on about how they had \"wasted $50 worth of tint\". I remained calm and asked them to finish the job. She said they would have to charge me $10 per window extra as a cleanup fee. I refused, saying it was their mistake and they should have inspected the windows more closely before starting (they are the experts, after all). She became very upset and began to shout, again blaming it on me for not telling her about the residue (which, again, was below the windowsill line and not visible). I stood my ground and insisted that it's not my job to know everything, that's why I brought it to a professional. She blew up, began to curse, shout, and refused to look at me in the eye. She shouted at the tint specialist to reassemble my car and send me away. I knew it would cost me even more at another tint shop to have them clean up the messed up tint that was already on my window from Tint Spectrum, so I reluctantly asked the tint specialist what it would take to get the job done right and get be out. He said it would take another $20, so I agreed to pay it. This time, I sat down in the shop and watched them the entire time. I'm not a tint expert by any means, but in my humble opinion, neither are these guys. One of them (who I later found out was the owner) was eating pizza over the hood of my car and asking me whether it was pink or red (it's obviously red). The tint specialist who was working on my car had to rip the tint from the passenger's window, replace it, install tint on the driver's side, rip it off and replace it, and then replace the tint on the passenger's side AGAIN. I'm not sure what he kept messing up, but if each one of those sheets was $50 worth of tint, he easily wasted over $200 worth. The manager continued to stomp around the shop shouting and cursing. The owner didn't seem to care. The tint specialist left lart \"3M\" logos on my window's right in the middle. The manager asked me if I wanted those removed (who in the world would WANT 3M logos in the middle of their window?).\n\nWhen it was all said and done, my final bill was $140 before tax, which was $20 higher than agreed upon earlier that morning due to absolutely no fault of my own. The manager remained rude and loud the entire time, and I must have waited in the shop for well over an hour after I got back from the library. The manager offered no apology other than something about \"didn't mean to snap earlier\". I don't think there is anything in the world that could make me go back to this place or recommend it. The manager is rude, loud, inappropriate and unfair. The staff are very slow, appear to be outrageously incompetent, and are all dirty on top of that (the tint specialist kept spitting tobacco juice on the ground right behind my car). The owner didn't seem to care about anything. I think the quality of the tint is good, since it's 3M. But the service and the installation quality were absolutely not even worth the one star I am forced to grant them. Do not take your car to this place. You will regret it, especially if you have to deal with the manager.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "110134234607469416856", "name": "Robert Tatum", "time": 1516754563899, "rating": 5.0, "text": "Been going here for 20 years. Great products. Great service. Great prices.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "115385248520901550693", "name": "Summer Knight", "time": 1545974637960, "rating": 1.0, "text": "Paid $300 cash, not check... and did not give me a reciept and would not fix problem with bubble in window tint and he scratched my car paint. Ripp off.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "107931430801316090486", "name": "Andrew Blood", "time": 1441043991810, "rating": 5.0, "text": "They are awesome. I didn't even call but when I showed up they gladly accepted my business and tinted my tail lights, and installed aftermarket headlights quickly and for a very reasonable price.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "114498044929809347664", "name": "Gerald Lucier", "time": 1455560016007, "rating": 5.0, "text": "Friendly and professional staff.  They were able to fit me in on short notice.  Highly recommend them for your window tinting needs!", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "114185460659871143299", "name": "Melvin M. Thomas", "time": 1508428057940, "rating": 5.0, "text": "Excellent Customer Service; very flexible, worked great with my scheduling issues; Immaculate finished product, I’m Very Happy With My Car!!!", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "112919036910363407512", "name": "Jemar Ford", "time": 1527962831772, "rating": 1.0, "text": "Do not go to this place. I had a 10 o’clock Saturday morning appointment, the tint guy never showed up. One of his workers was waiting for me when I showed up.  We talked for about 45 to an hour with hopes of this guy showing up. He kept saying that he’s on his way. Unfortunately this never happened. I don’t know how he stays in business.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "104294159030050619218", "name": "Jeff Hebderson", "time": 1527495783657, "rating": 5.0, "text": "Best place in all of Southern Alabama to get your windows tinted", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "100006500809345862159", "name": "jeff love", "time": 1502928606335, "rating": 1.0, "text": "Paid $320 for a horrible tint job.  Windshield strip had a bubble in it from a hair under the tint.  Both small back seat windows have foreign material under tint. Back window has a few small bubbles.  Inside Passenger side door and both back seat door panels were NOT wiped down after installation.  Had shoe prints on back seat. Took it back up to have it fixed and Robby said he would fix the issues, just come back sometime.  I'm thinking I'm here now, fix it now", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "117315838463473668918", "name": "Jeremy Hopper", "time": 1510111641281, "rating": 5.0, "text": "Great guy and better service! Will be going back for all of my future work.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "111497192859358093637", "name": "Scotty Chang", "time": 1494262936220, "rating": 5.0, "text": "Awesome service! Great work!", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "115342551679620052856", "name": "Joe F. Watson", "time": 1523054202549, "rating": 1.0, "text": "No. Overpriced and less than honest.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "110871723164996822807", "name": "My Bell", "time": 1546023517741, "rating": 1.0, "text": "He kept saying that he will get back in touch with me and never did.", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "111000426054975340541", "name": "Justin Schroeder", "time": 1519508352188, "rating": 5.0, "text": "Spot on work, always!", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "115221459250961340591", "name": "Jennifer Touchton-Dickens", "time": 1518718301879, "rating": 1.0, "text": "I spent 7 hours here to tint my 2015 Dodge Challenger with legal tint... When I left my car still has a few bubbles in it.... Needless to say, even though I have a lifetime warranty, and I will be returning to get the Tint fixed, I will NOT BE USING THEM AGAIN FOR ANY FUTURE VEHICLES..... AND I'M NOT A HAPPY CAMPER NEITHER", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "106038580733658193411", "name": "Muntileta Dalton", "time": 1491243099976, "rating": 5.0, "text": "Wonderful place", "pics": null, "resp": null, "gmap_id": "0x889293004402c64d:0x5a3bd58c8045da98"}
{"user_id": "112022007991916633597", "name": "Michelle Jones", "time": 1622594978257, "rating": 5.0, "text": "Schmidt Home Services was awesome to work with. Very responsive and great communication! We will definitely call them again in the future.", "pics": null, "resp": {"time": 1622597008058, "text": "Thank you.. we try our best to stay in touch with all out clients as much as possible.  I'm happy we where able to help you out. We look forward to working with you in the future."}, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "113373559091292995801", "name": "Annette Hardin", "time": 1614471657726, "rating": 5.0, "text": "Polite, on-time. Excellent work. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "110242958326644666701", "name": "Yingying Li", "time": 1614048480930, "rating": 5.0, "text": "very professional and helpful!", "pics": null, "resp": {"time": 1614051654942, "text": "Thank you 😊.. I'm glad we where able to figure out that headboard for you even though we where missing items for the assembly, Gotta love IKEA!😄"}, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "104119765343787468314", "name": "The Diva Mrs. Ash", "time": 1619216946665, "rating": 5.0, "text": "The gentlemen at Schmidt's were very professional, prompt, & informative. They installed a lock on my shed which was a complicated process. They were very diligent and kept me informed along the way.  I will definitely recommended their services to everyone & I will be using their services again!!", "pics": null, "resp": {"time": 1619217276326, "text": "Thank you very much. We are happy to help and are glad we where able to get your lock figure out."}, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "103209938140064926820", "name": "Peter M. Babnis", "time": 1622342120705, "rating": 5.0, "text": "Josh and Zack were awesome to work with. Easy to get in touch with, quick scheduling, and work was done to complete satisfaction. We’re new to Birmingham and are happy to have found Schmidt’s home services. I’d 100% recommend giving them a call and letting earn your business. We’ll definitely be working with them again on some larger projects.\n\nThanks guys!", "pics": null, "resp": {"time": 1622383806643, "text": "I'm glad we where able to be of assistance.  We pride ourselves on our customer satisfaction.  We look forward to working with you again in the future.  Welcome to birmingham We hope you like it here."}, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "114209927779929763129", "name": "Tennille Carter", "time": 1600910557720, "rating": 5.0, "text": "Joshua did an excellent job.  Very professional and reliable.  I live in another state so it was great to find a company I could trust to work on my rental property.", "pics": null, "resp": {"time": 1600906856722, "text": "Thank you for choosing Schmidt's Home Services.  The deck turned out great and look brand new. I look forward to any future projects you may have.  Call anytime and have a great day!\nJoshua Schmidt"}, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "113226486399779629131", "name": "E F", "time": 1615404106941, "rating": 5.0, "text": "Josh and everyone at Schmidts Home Services are really fast and professional. I called same day needing a door frame repaired and blinds hung and Zach came out got the job done that very day. This was very last minute and everyone was professional and thorough.\nThank you again, great service to use I highly recommend them!!!", "pics": null, "resp": {"time": 1616029727301, "text": "Thank you..I'm glad we where able to help you out with this project. Spread the word to family and friends that schmidt's Home Services can help with all your household needs."}, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "115378204361100570200", "name": "J Lewellyn", "time": 1625072028645, "rating": 5.0, "text": "Schmidt’s has been very easy to work with. They worked my job into their schedule quickly. As they would complete one job, I would ask if they could do another, and they got those done, too! I highly recommend!", "pics": null, "resp": {"time": 1625073276532, "text": "We were very happy to help. I'm glad everything turned out great.  If you need any help with any future projects feel free to contact us anytime. Thank you for your business."}, "gmap_id": "0x8889175dba066195:0x98a95a710ad9d6d2"}
{"user_id": "116524391470995567605", "name": "Meighan Warren", "time": 1617900599733, "rating": 5.0, "text": "I bought an old home and the interior doors and jambs weren't made for newer hardware. These guys were fast, efficient and inexpensive. I highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "106632182623428722722", "name": "Ryan Campbell", "time": 1572663549200, "rating": 5.0, "text": "The experience with this company was quality from the start. The gentleman on the phone was courteous and helpful. The team that came out called ahead and actually came early, which worked out perfect. In spite of the fact that they had misinformation about the service needed, they happily took care of my needs quickly, efficiently, and for a fair price. Great job, and I will use these guys for any future needs.", "pics": null, "resp": {"time": 1572670758590, "text": "Thank you, Ryan! Glad we could provide great service!"}, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "100113886753593450908", "name": "Howard Hapner", "time": 1584455060096, "rating": 5.0, "text": "Our locksmith installation is fantastic.  On time, professional and made some great suggestions for us.   I highly recommend the Flying Locksmiths for your home safety lock repairs and installation.", "pics": null, "resp": null, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "100233274270939966468", "name": "Staci Lawrence", "time": 1573607087912, "rating": 5.0, "text": "Jeff was amazing! Very friendly and got us taken care of quickly. I highly recommend for all your locksmith needs!", "pics": null, "resp": {"time": 1573614284037, "text": "Thank you for the kind feedback, Staci!"}, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "104749001795560715684", "name": "John Gillon", "time": 1556371671285, "rating": 5.0, "text": "This is the 2nd time I've used The Flying Locksmiths and let's just say I'm \"SOLD!\"\n\nWith others, you don't know who you're gonna get, when they'll show up, or what you'll be charged.\n\nJeff is always on time and goes above and beyond what one would think is normal for any service call. The biggest plus, pricing is more than fair in comparison to what I've been charged by others!!!\n\nPlain and simple...Jeff's the man!! I will use, nor refer anyone else for locksmith service!!!", "pics": null, "resp": null, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "103413464562303066833", "name": "Tamekka Hayden", "time": 1602953654681, "rating": 5.0, "text": "Wonderful customer service and very efficient", "pics": null, "resp": null, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "104622150509678300645", "name": "dan phelps", "time": 1528748091893, "rating": 5.0, "text": "Willis came out and got my door unlocked in no time without even drilling the knob... very professional and over all great work ethic. His prompt showtime, great work ethic and friendly demeanor is exactly what the world needs more of. Two thumbs up thank you willis", "pics": null, "resp": {"time": 1528890833548, "text": "Happy to hear you enjoyed the service provided and are happy we didn't need to drill your knob to get in unlocked. Thank you for the feedback Dan!"}, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "109802778681304093729", "name": "Patrick Graham", "time": 1554474441384, "rating": 5.0, "text": "The Flying Locksmiths were awesome! The Technician, Jeff, did a great job and was extremely courteous. He came to our house and did the job in no time. I will definitely be referring them and using in the future.", "pics": null, "resp": null, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "100779952155543376258", "name": "Valerie Boyd", "time": 1522171593355, "rating": 5.0, "text": "I don’t normally take the time to give reviews but These guys were so quick to respond. My front door lock broke and I called several local places that could not get to me for a few days. Flying Locksmiths came in a few hours. And Willis was very knowledgeable, friendly and quick!! Definitely recommend!!!", "pics": null, "resp": {"time": 1522173314568, "text": "Thank you, Valerie, for your review! We appreciate the recommendation and look forward to helping you out if you need it!"}, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "101109473942426680418", "name": "Rebekah Hewett", "time": 1520875243178, "rating": 5.0, "text": "The Flying Locksmiths came out to replace several old locks on our doors. They were quick and did great work! Customer service could not have been better. They were great about communication...not only were they on time, but they let you know when they are on their way! Will definitely use them again!", "pics": null, "resp": {"time": 1521473882515, "text": "We are happy to assist you quickly while providing great customer service. Thank you for the kind review Rebekah!"}, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "108635029448968252334", "name": "Gracie Julian", "time": 1513570242510, "rating": 5.0, "text": "I had an incredible experience with The Flying Locksmith’s. Everyone I talked to/the locksmiths that came out were so kind, easy to communicate with, and excellent at what they do. Tarence and Willis went above and beyond to ensure our locks were changed properly. We are grateful to have found this company and would highly recommend!", "pics": null, "resp": {"time": 1515700059035, "text": "We are so happy to hear you have had an incredible experience with us! Thank you for the kind review Gracie!"}, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "110225893386549243911", "name": "Lisa M. Carter", "time": 1522417522562, "rating": 5.0, "text": "John was awesome! He gave excellent customer service and went above and beyond to ensure that my husband and I felt secure in our home. I would highly recommend The Flying Locksmiths to all avidly seeking a locksmith!", "pics": null, "resp": {"time": 1522418690512, "text": "Thank you, Lisa, for your review! We hope to be able to help you again in the future if you need our locksmith services!"}, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "113048786523106332731", "name": "Allen M", "time": 1595028511988, "rating": 1.0, "text": "Wouldn't come out when needed", "pics": null, "resp": null, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "106555410896460093718", "name": "Elizabeth Pate", "time": 1517698911475, "rating": 5.0, "text": "Flying Locksmiths are always quick to respond and Willis and Terrence are helpful beyond the service call. We use them for all our business needs and will be my first call when I need a locksmith personally. Highly recommend!", "pics": null, "resp": {"time": 1517848937220, "text": "Thank you for the kind review Elizabeth! We appreciate the high recommendation and you using us for all your business needs!"}, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "110632349894135957003", "name": "Jared Shiver", "time": 1517755856710, "rating": 5.0, "text": "I couldn’t get into my camper, Willis came out early on a Saturday morning and helped me get in! Great communication between staff and all of them were willing to help to help the costumer. Great group of people! Will call again if I need anything!", "pics": null, "resp": {"time": 1517848906214, "text": "Glad we could help assist you with getting into your camper! Thank you for the kind review Jared!"}, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "111629526324909296624", "name": "Stacey Reed", "time": 1518117487497, "rating": 5.0, "text": "Flying Locksmith is awesome!  My front door lock stopped working, and they had someone at my house in 30 minutes!  Tarence was the nicest technician, knowledgeable and helpful.  I would highly recommend them.", "pics": null, "resp": {"time": 1519745625279, "text": "Thank you so much for the kind 5 star review Stacey!"}, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "118214447251879786317", "name": "Yousif Aboosi", "time": 1509292484757, "rating": 5.0, "text": "I was locked out of my apartment on a Friday night. Called three locksmiths and no answer. I called the flying locksmith and someone actually answered immediately ( not a machine but a person at 11:30 pm on a Friday). They were super professional and helpful. Definetly recommend them.", "pics": null, "resp": {"time": 1510170709278, "text": "We are happy we could quickly assist you Yousif! Thank you for the 5 star rating!"}, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "100310940652979077811", "name": "Ernest Derrico", "time": 1515109246565, "rating": 5.0, "text": "They were on time got the job done in reasonable amount of time. Courteous had me to try the locks an explained to me about the condition of the locks but was able to rekey them. Was satisfied with the job.", "pics": null, "resp": {"time": 1515699864389, "text": "We are happy to hear you are satisfied with the job completed and that we could quickly get the job done. Thank you for the feedback Ernest!"}, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "100902709604334172931", "name": "Sonya Jordan", "time": 1518777051543, "rating": 5.0, "text": "Scheduling was easy and they accommodated a late afternoon time for me.  Willis was on time, nice, and efficient.  He got my door unlocked and made me extra keys at a reasonable price.", "pics": null, "resp": {"time": 1519745514182, "text": "We are glad we could help get your door unlocked and make your new key at a reasonable price! Thank you for the kind review Sonya!"}, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "105567252006200505472", "name": "Debi Kozler", "time": 1506104285978, "rating": 5.0, "text": "Called five different locksmiths.   Needed in home quickly and was being told late evening and even Monday.   Flying was up for the challenge.\nI was in before noon.  Super accommodating and professional.   I now have their number in my phone.\n\nThey also help if you are locked out of your car.", "pics": null, "resp": {"time": 1507637435203, "text": "We are happy we could accommodate you and help you unlock your car Debi!"}, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "117288987514851607640", "name": "Guice Potter", "time": 1571410010100, "rating": 5.0, "text": "The best service you could possibly ever have.", "pics": null, "resp": {"time": 1571414797058, "text": "Thank you! Please let us know how we could assist you in the future."}, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "111969165305518455495", "name": "John Clay", "time": 1518274784562, "rating": 5.0, "text": "Was locked out of my home after-hours and needed a 24-hr locksmith. Flying Locksmiths arrived quicker than they said they would and were into my door within 5 minutes, and the service guy was very friendly and professional. Thanks for the save!", "pics": null, "resp": {"time": 1519745576733, "text": "John, thank you for the kind review! Glad we could quickly come out to help you get back in your home!"}, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "118087385532197289249", "name": "Rod Patton", "time": 1517504402962, "rating": 5.0, "text": "Willis and Tarence did an awesome job at my house.  They installed a wireless Lock which was perfect. I highly recommend The Flying Locksmiths to do your work.", "pics": null, "resp": {"time": 1517593294633, "text": "Thank you, Rod, for your review! Be sure to reach out to us if you need a locksmith in the future!"}, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "115121262078193456593", "name": "Micah Mccaleb", "time": 1546897430049, "rating": 5.0, "text": "Fantastic experience. 100% recommend them. Jeff did a fantastic job!", "pics": null, "resp": null, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "112636890730250204778", "name": "Josh Ritchie", "time": 1519068376793, "rating": 5.0, "text": "One of our employees accidentally broke their key off in our lock this morning. I called 2 other locksmiths and no one could get by to look at it today. Finally, I found the Flying Locksmiths. Their dispatch was very courteous and assured they could get someone out today.\n\nSure enough, Willis arrived and had the broken key out in minutes. He even diagnosed the issue that was causing our keys to stick in the lock and fixed it too AND made a new copy of the broken key. All in under 15 minutes.\n\nVery impressed by their service and skills and I know they will be the company we use for any future needs.", "pics": null, "resp": {"time": 1519745448090, "text": "Glad we could get someone out in a timely manner to get the broken key our and make you a new key. Thank you for the kind review Josh!"}, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "113575818891031961883", "name": "Brandon Fortie", "time": 1520981744571, "rating": 5.0, "text": "9 locks completed in 1.5 hours with 100% completed to exact way that was wanted. Very courteous and fast. Recommend to everyone", "pics": null, "resp": {"time": 1521473851402, "text": "We are happy to be able to get all your locks taken care of in a timely manner. Thank you for the recommendation Brandon!"}, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "104277685810098164708", "name": "Cutler Knupp", "time": 1564936582712, "rating": 5.0, "text": "Used for a re-key on a home. Good service and timely, would use them again.", "pics": null, "resp": null, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "104931222772187720253", "name": "Mary-Margaret Bradford", "time": 1518905821176, "rating": 5.0, "text": "Came to my house within 1 hour on a Friday night. The technician was friendly and knowledgeable. Would definitely use again.", "pics": null, "resp": {"time": 1519745466048, "text": "Happy to quickly assist you Mary-Margaret!"}, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "106901439884631406944", "name": "Michal Crowder", "time": 1524625734457, "rating": 5.0, "text": "I had a broken lock after hours and they arrived promptly and were very courteous and professional (and quick!).", "pics": null, "resp": {"time": 1524654662120, "text": "Glad we could quickly assist with fixing your lock and that you enjoyed our staff! Thank you for the kind feedback Michal!"}, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "114146065672906280993", "name": "Zachary Bryant", "time": 1512692764652, "rating": 5.0, "text": "Very professional, efficient and someone you can trust. I highly recommend them", "pics": null, "resp": null, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "100418589666369557266", "name": "Martine Hernandez", "time": 1530920565589, "rating": 5.0, "text": "Quick service.  Willis was very professional and courteous.", "pics": null, "resp": {"time": 1531229004887, "text": "Glad we could provide quick service to you Martine!"}, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "103877906211798235155", "name": "Carolyn Garrity", "time": 1520016247476, "rating": 5.0, "text": "Flying locksmiths were great!!   They offer same day service and did a great job fixing my front lock!", "pics": null, "resp": {"time": 1520262788897, "text": "Thank you so much for the great 5 star review Carolyn!"}, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "100245332361278525597", "name": "JL Chestnut IV", "time": 1519404974042, "rating": 5.0, "text": "Willis is super awesome...A1 Top service would not recommend any body else but these guys!!!", "pics": null, "resp": {"time": 1519745401438, "text": "We are so happy to hear you would not recommend any body else but us! Thank you for the kind review JL!"}, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "111177934690992315908", "name": "mustafaa abdullah", "time": 1517932031259, "rating": 5.0, "text": "Very professional. Terence great guy communicate well with clients speaks highly of the company.", "pics": null, "resp": {"time": 1519745608033, "text": "Glad you enjoyed our staff Mustafaa!"}, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "106702654301273891961", "name": "Joe Brown", "time": 1518405985822, "rating": 5.0, "text": "Awesome’ came in a timely manner and was very professional A+*++", "pics": null, "resp": {"time": 1519745533595, "text": "Thank you for the kind 5 star review Joe!"}, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "104618292735327546166", "name": "Banker Advice", "time": 1546897325831, "rating": 5.0, "text": "Jeff helped us out today. Had a small issue with a key not fitting right and he came out the next day and fixed it, no additional cost. Very responsive and when he says he will be there at a certain time, he is. Thank you", "pics": null, "resp": null, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "106750477635040977122", "name": "Micah Williams", "time": 1527443842165, "rating": 5.0, "text": "The locksmith was very professional and fast! Great job!", "pics": null, "resp": {"time": 1527600504165, "text": "Thank you Micah!"}, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "113110309834320101934", "name": "Ryan Payne", "time": 1517852046148, "rating": 5.0, "text": "Great service. Would recommend to a friend or use them again if ever locked out again.", "pics": null, "resp": {"time": 1519745688060, "text": "Thank you so much Ryan! We appreciate the kind review!"}, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "107352200382513908872", "name": "Christopher Fisher", "time": 1515688820698, "rating": 5.0, "text": "Prompt and professional. The technicians showed up on time, got the work done and were on their way.", "pics": null, "resp": {"time": 1515699792654, "text": "Thank you for the kind review Christopher!"}, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "103090150226528168280", "name": "Monica Brown", "time": 1563502939585, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "113385454836487466278", "name": "Threat Advice", "time": 1513188367073, "rating": 5.0, "text": "Great job, very polite and professional.", "pics": null, "resp": {"time": 1515700024010, "text": "Thank you!"}, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "106490766348346679477", "name": "Nancy R Higgins", "time": 1590106174078, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "115963277644262556889", "name": "Melinda Nalls", "time": 1519842488975, "rating": 5.0, "text": "Very friendly and wonderful service", "pics": null, "resp": {"time": 1519925939386, "text": "Thank you, Melinda, for your review!"}, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "102166323784621007407", "name": "Lib Barnette", "time": 1518033182023, "rating": 5.0, "text": "Terrance took care of the crazy lock right away!! Thanks!!", "pics": null, "resp": {"time": 1519745592887, "text": "Thank you Lib! Happy we could help!"}, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "111370036034312043225", "name": "Hugo Enrique reyes Suarez", "time": 1611340938470, "rating": 5.0, "text": "(Translated by Google) Good attention is missing someone who speaks Spanish\n\n(Original)\nBuena atención falta alguien que hable español", "pics": null, "resp": null, "gmap_id": "0x8889198f25cfb409:0x85aef85c456e60b4"}
{"user_id": "117566850070166186390", "name": "Jeramy Stainbrook", "time": 1623169255801, "rating": 5.0, "text": "Great service and good price.", "pics": null, "resp": null, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "112520993349530964283", "name": "Sean Carpenter", "time": 1493411891383, "rating": 5.0, "text": "Great professional service.. Someone always answers the phone day or night.  Speedy response time. Fair prices! I would highly recommend them!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMx0lViG7bEzAjrWDbH6OYVP6YBi4NMcUvNCDgp=w150-h150-k-no-p"]}], "resp": {"time": 1533069463139, "text": "Thank you!"}, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "111469517056775865101", "name": "dianne arnett", "time": 1619702418458, "rating": 5.0, "text": "They are an excellent company.   I had a rental condo where the entry keypad battery was dead and guests were scheduled to arrive.  The responded immediately.  Their website is easy to use and always reliable.", "pics": null, "resp": null, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "107025735821148452672", "name": "Robert McManus", "time": 1622606631765, "rating": 5.0, "text": "Great job, very quick!", "pics": null, "resp": null, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "102289338839534089471", "name": "Missi B", "time": 1623247985145, "rating": 5.0, "text": "The technician that was dispatched to my home after I locked myself out was courteous,  professional,  friendly and knowledgeable.   The price was extremely reasonable.   I cant say enough good things.", "pics": null, "resp": null, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "113316645048673367112", "name": "Bud Bouchard", "time": 1622029560524, "rating": 5.0, "text": "Highly recommend Aaron's for professionalism and promptness. Super nice people!", "pics": null, "resp": null, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "103171204176093041182", "name": "Lieba Macias", "time": 1605448436927, "rating": 5.0, "text": "Aaron's was a referral from an employee at a local store in Pensacola that had used their services in the past, and were very happy with the service. We took their advice and are also very happy with our purchase. They fit our tight delivery schedule, and the service from purchase to delivery was outstanding. They were on time, and took the greatest care to protect our product as well as not to do any damage to our property upon delivery. Extremely satisfied, and will not hesitate to refer to friends.", "pics": null, "resp": null, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "106629245996791546784", "name": "Kurt T. Bellow, Jr.", "time": 1612641047305, "rating": 5.0, "text": "Great service. I attempted to change a Kaba Lock to another brand on my condo.  When I realized this was above my skill level, I called Aaron’s and they came out within an hour and completed what I worked on for twice that long.  Responsive and professional.", "pics": null, "resp": null, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "116142474382849292622", "name": "Damon Huckleberry", "time": 1620303399802, "rating": 5.0, "text": "Used them for several services over the years, great!", "pics": null, "resp": null, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "101472666791020372690", "name": "Lora Crosley", "time": 1599488177977, "rating": 5.0, "text": "Had a great experience with this company. Getting ready for an event at my house and bathroom door locked...wouldn't get it opened. Called Aaron's. They were out to my house quickly. Super nice customer service and the price was fair! The locksmith had to replace a broken latch.", "pics": null, "resp": null, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "116273470215223374996", "name": "shelley desousa", "time": 1590883377935, "rating": 5.0, "text": "Love this guy.  Anytime we have to rekey because of staff changes, his company always takes care of it quickly.  I have lost car keys multiple times too and he got me in ti my vehicle.   Very fair prices too.", "pics": null, "resp": null, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "102388326901662625769", "name": "Karen Kelly", "time": 1597876612317, "rating": 5.0, "text": "Billy did an excellent job rekeying all my locks. He wore a mask, and doubled checked all the locks. I will definitely call them again if needed in the future.", "pics": null, "resp": null, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "103072645331787670559", "name": "Carolyn Anderson", "time": 1601050436745, "rating": 5.0, "text": "Wonderful service. Staff kind and very efficient", "pics": null, "resp": null, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "107238972653597520709", "name": "Bernard Cook", "time": 1599761055118, "rating": 4.0, "text": "Timely appointments, techs call ahead, arrive on time. However I wanted damaged hardware replaced but tech obviously misunderstood, locks were re-keyed & left as is.", "pics": null, "resp": null, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "111732064244600902018", "name": "Timothy OBrien (Printing Pros)", "time": 1572540748337, "rating": 5.0, "text": "Aaron's arrived within 15 minutes and was done re-keying our lock and making us several keys in even less time than that. Very polite technician. We would definitely used their services again!", "pics": null, "resp": null, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "100456725315961868473", "name": "Cristina Gregory", "time": 1609375996564, "rating": 5.0, "text": "Joe Brown owns this business & I wouldn't trust anyone else!", "pics": null, "resp": null, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "113364876780127612109", "name": "James Sutherland", "time": 1610426614659, "rating": 5.0, "text": "Nice guy took care of my problem.", "pics": null, "resp": null, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "110042120746517960366", "name": "Emmie Crump", "time": 1579052290711, "rating": 5.0, "text": "Very professional and kind service. Thank you Brian for fixing our door quickly. I will recommend you to any friends in the future.", "pics": null, "resp": null, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "112216097025032455060", "name": "Tony Raco", "time": 1582394162072, "rating": 1.0, "text": "She was rude and couldn't hear me on the phone. She had her kids in the background asking her questions. They were $30. More than the company I chose. My service I picked was polite and very reasonable. Never use this service!", "pics": null, "resp": null, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "106346744822779261346", "name": "Greg Palmer", "time": 1600208143394, "rating": 1.0, "text": "Your Employee was casing out my house . Let him know I will be in there waiting next time.", "pics": null, "resp": null, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "105010044700874153966", "name": "Corey Covington", "time": 1583871928272, "rating": 1.0, "text": "95$ Way to Expensive. And the flat rate is crazy. If it takes 10 - 15 mins; i could understand but less than a min. The worst part a guy in parking lot had the same kit and was fixing to help me for free", "pics": null, "resp": null, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "104788933259171560086", "name": "Daisy Peke", "time": 1531599089332, "rating": 5.0, "text": "Doug is the best! He came and unlocked my car today at the beach and seriously saved the day. He was friendly, fast and very good with communication. In addition to all of that,  the process took less than an hour!! 5 Stars in my opinion. Thanks again Doug!", "pics": null, "resp": {"time": 1533064167017, "text": "Thank you Daisy!"}, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "101728362571298106208", "name": "Tracy Wood Jones", "time": 1532912778549, "rating": 5.0, "text": "We were in a particularly difficult situation and the young girl who answered my call on a Sunday evening was fantastic and very caring and the technician who opened our car for my 17yr old son was prompt and awesome as well! Thank you so much! I would highly recommend Aaron's Lock Service.", "pics": null, "resp": {"time": 1533064149827, "text": "Thank you!"}, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "115415197130722316505", "name": "Jason Wheeler", "time": 1559695855466, "rating": 5.0, "text": "Thank you so much Brian!! I will be recommending Aaron's Lock Service to everyone. I can't remember the last time all the locks in my house worked, let alone being the same key. I'm glad to finally have a company I can trust. I had a bad experience with another locksmith company, and it left a bad taste in my mouth. On top of repairing all our locks, Brian wired up a new doorbell button. (He saw it in a box sitting on the counter and offered) I also appreciate him helping my wife carry in the groceries. lol.", "pics": null, "resp": null, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "109469709230677449227", "name": "Courtney Odom", "time": 1531022923664, "rating": 5.0, "text": "Eric helped us get back into my cousins car after she locked herself out. Very fast and efficient at his job. Highly recommend", "pics": null, "resp": {"time": 1533064203881, "text": "Thank you!"}, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "115586148691527479419", "name": "Jessica Wallace", "time": 1526520437577, "rating": 5.0, "text": "Got to our vacation rental to find out we couldn’t get the door open. Called around to several places, the receptionist was helpful and polite, they came quickly and he made sure the  job was done right. Amazing customer service! I highly recommend!!!!", "pics": null, "resp": {"time": 1533068570779, "text": "Thank you!"}, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "100115356359829429944", "name": "Beth Putman", "time": 1621789654223, "rating": 1.0, "text": "No answer", "pics": null, "resp": null, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "114634223419321010317", "name": "Holly Reineck", "time": 1487364450693, "rating": 5.0, "text": "We had a situation arise at our business this morning at 8AM and we needed all of our locks changed on a Friday before the weekend!  Billy, our technician, literally arrived not even 20 minutes later and had the job done within an hour!  We are very pleased with the work and will be using them for all our future needs!", "pics": null, "resp": {"time": 1533069477932, "text": "Thank you!"}, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "109109654606489781118", "name": "philip reed", "time": 1604333560336, "rating": 5.0, "text": "Outstanding customer service!!!", "pics": null, "resp": null, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "110837490672673187267", "name": "Jim Neal", "time": 1537953213136, "rating": 5.0, "text": "Aarons lock was great to do business with. The service rep was very helpful. answered all our questions. Great experience.", "pics": null, "resp": {"time": 1537961922769, "text": "Thank you for your business!"}, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "107227231308733936922", "name": "KnK Rupp", "time": 1530484148194, "rating": 1.0, "text": "Called for service when locked out of van. Dispatcher said 30 minutes...1 hour later when we called back she had not dispatched anyone because she said our phone number didn't show on her caller i.d. and she would call locksmith then. Called her back in 10 minutes to make sure she secured someone and she didn't remember talking to me, dispatching someone now.  Total wait of 2 hours later we got unlocked.  Brian was awesome, 5 minutes and he was done. Dispatch and her customer service was horrible.", "pics": null, "resp": {"time": 1533064297473, "text": "Thank you for your feedback. It made us aware of an issue that had to be addressed.  No customer should experience what you did. We would be happy to discuss this experience with you if you call 251.967.1919. Usually when people call us wanting an immediate response, they are already having a tough day. We work hard to help that day be better because they called us, not worse! Please accept our sincerest apologies for the way you were treated."}, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "114634223419321010317", "name": "Holly Reineck", "time": 1487364450693, "rating": 5.0, "text": "We had a situation arise at our business this morning at 8AM and we needed all of our locks changed on a Friday before the weekend!  Billy, our technician, literally arrived not even 20 minutes later and had the job done within an hour!  We are very pleased with the work and will be using them for all our future needs!", "pics": null, "resp": {"time": 1533069477932, "text": "Thank you!"}, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "103811486072982673405", "name": "Greg Summerford", "time": 1606321656272, "rating": 5.0, "text": "Timely and efficient", "pics": null, "resp": null, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "107944564240620758027", "name": "Gerry Thompson", "time": 1528391874471, "rating": 5.0, "text": "We installed an programmable lock on our condo a little over a year ago.  It worked until recently - we contacted Aaron's Lock Service and they had a tech out the next day.  He was able to reprogram our lock and it is working again. Good Job!", "pics": null, "resp": {"time": 1533065490567, "text": "Thank you!"}, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "109300377161757862013", "name": "Joey Conwill", "time": 1498160678651, "rating": 1.0, "text": "Aaron's was called out to our condo by someone that said they were staying there, had them sign a form then destroyed the lock to let them . It was a combination lock and there was a hidden key that would have overridden the lock if someone had bothered to contact the owner, or called the emergency number posted at the condo office, where a manager lives on the grounds. Aaron's said that was standard procedure, as long as the person signed the form, they could let them in. That's nice for all condo owners to know! Total cost to replace lock, almost $400. Aaron's took no responsibility. Not much integrity at this business.", "pics": null, "resp": {"time": 1533068364584, "text": "Integrity matters as well as ethical business practices.  We value and employ both in our business.  Emergency response locksmith technicians are there to help in challenging circumstances.  We do everything we can to gain entry before we considering drilling the lock.  This is a last resort.  We are sorry your lock was damaged but your renter misrepresented themselves as having authority to do so and chose to assume liability for such activity, just as they choose to assume liability for their treatment of the rest of your property when they rent from you.  With thousands of condos and hundreds of condo offices that are often closed or unmanned, we cannot track down every owner.  This is why we work hard to go above and beyond the minimum of what the law requires.  We love our customers, we love what we do and we work hard to do it well with integrity."}, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "100807195828404067374", "name": "John Morrison", "time": 1578528764366, "rating": 2.0, "text": "They could open the locked door but could not remake the key for 2013 Honda Civic..Unlock it for me did both for 125.00 and within an hour.", "pics": null, "resp": null, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "102242379664579991047", "name": "Connie Wagner", "time": 1567001643394, "rating": 5.0, "text": "Great service.....timely, reasonably priced!!", "pics": null, "resp": null, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "106799914891574802139", "name": "Mark Tillema", "time": 1559248840921, "rating": 5.0, "text": "Excellent service! Friendly and quick!", "pics": null, "resp": {"time": 1559259220269, "text": "Thank you Mark!"}, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "103063903607370943989", "name": "chase moses", "time": 1466815113672, "rating": 5.0, "text": "Got here quick and had the job done quick. And at a fair price. Would absolutely call them again", "pics": null, "resp": {"time": 1533086419469, "text": "Thank you"}, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "108014373618630653579", "name": "Wendy Sclater", "time": 1532454349693, "rating": 5.0, "text": "Very prompt and professional service. Highly recommended!", "pics": null, "resp": {"time": 1533064177410, "text": "Thank you!"}, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "106389931110421071560", "name": "Daniel Botts", "time": 1584451206848, "rating": 5.0, "text": "Very professional and prompt. Thank you Aaron's Lock Service for your group.", "pics": null, "resp": null, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "112423019132975626110", "name": "Linda Chancey", "time": 1523671593199, "rating": 1.0, "text": "We waited for an hour. The guy was suppose to call us when he got close and NEVER DID. When we called to complain the woman tried to accuse us of being drunk and hung up on us. When I couldn't hear her question she also decided to yell in my ear. Do yourself a favor and go with someone else. Ill never call this place again I can tell you that.", "pics": null, "resp": {"time": 1533066365233, "text": "I know this was some time ago, but I did want to respond.  No customer should encounter this type of treatment and the individual who is no longer with us.  We are sorry this was the treatment you encountered but anyone calling Aaron's will not receive this type of treatment."}, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "115152675628183007715", "name": "Stephen Lee", "time": 1527292806311, "rating": 5.0, "text": "Doug, shoes up on time and did exactly what we agreed to over the phone. Very profesional and freindly.", "pics": null, "resp": {"time": 1533068559943, "text": "Thank you!"}, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "118369822918257426039", "name": "Laurie Jackson", "time": 1543879476353, "rating": 5.0, "text": "Fast service to re - keying locks.   Very kind and clean.", "pics": null, "resp": {"time": 1543880634406, "text": "Thank you!"}, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "114731816563614310829", "name": "brenna stewart", "time": 1531281651464, "rating": 1.0, "text": "terrible service. was told it would be a 30 minute wait.  called back 40 mins later and they were supposedly on the way. called again 1 hour and 10 minutes after the first call and was told no one was coming out because i sounded drunk over the phone. i am 16 and definitely WAS NOT drunk. so, needless to say my car was not unlocked by them. TERRIBLE SERVICE WOULDNT RECOMEND TO ANYONE. only rating 1 star because that’s the lowest i can go.", "pics": null, "resp": {"time": 1533064112841, "text": "Thank you for your feedback.  It made us aware of an issue. We addressed that issue to ensure no customer experiences what you did.  We would be happy to discuss this experience with you if you call 251.967.1919.  Usually when people call us wanting an immediate response, they are already having a tough day.  We work hard to help that day be better because they called us, not worse!  Please accept our sincerest apologies for the way you were treated."}, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "108105919277216742870", "name": "Mark Curtis", "time": 1499468539305, "rating": 5.0, "text": "Fast service and no damage to car. Highly recommend", "pics": null, "resp": {"time": 1499638923158, "text": "Thank you for your review and for your business."}, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "103269336731093887250", "name": "TJB", "time": 1508209339037, "rating": 5.0, "text": "Locked our keys in the car and since the battery was dead On Star couldn't open it remotely. They called Aaron's and about 20 minutes later their locksmith Billy came out. He couldnt have been nicer. He unlocked the car in about a minute and then helped us jumpstart the car. Total pro and a really nice guy. Would highly reccomend Aaron's to anyone.", "pics": null, "resp": {"time": 1533068600726, "text": "Thank you!"}, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "103856207398116488766", "name": "Libby Shepard", "time": 1522455374700, "rating": 5.0, "text": "We have a camper that we keep on our property in Gulf Shores. Somehow our dogs (2 Cane Corso) lock us out, the key was inside the camper. After calling around to a few places, that said they would be several hours, an RV repair shop said to call Aaron’s. They said they could be there within the hour. Less than 20mins later Billy showed up and within 5 mins had us in the camper! He’s my hero! Thanks so much for everything!!", "pics": null, "resp": {"time": 1533068582857, "text": "Thank you!"}, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "110352596337262194206", "name": "Keith Sharp", "time": 1527299085232, "rating": 5.0, "text": "Very good customer service, was a little slow in getting to job but could have been factors that were uncontrollable. My keyless locks's battery had died -guest could not get in, they dixed everything and only charged $100 on Memorial day weekend.  Would use again", "pics": null, "resp": {"time": 1533065502197, "text": "Thank you!"}, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "103158185868509535628", "name": "Cyndi C", "time": 1529078435407, "rating": 5.0, "text": "Received prompt professional service. The locksmith was able to remove a jammed lock from a house door. It wasn’t easy but the technician stuck with it even when I was ready to have him cut the lock out of the door.  Thankfully will now only have to replace the lock and not the whole door.", "pics": null, "resp": {"time": 1533065479416, "text": "Thank you!"}, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "100271513425027782930", "name": "The Smiths Keeping it Real", "time": 1465146751965, "rating": 5.0, "text": "They were very professional. Arrived in a timely manner!! Car was unlocked in five minutes.", "pics": null, "resp": {"time": 1533086427308, "text": "Thank you"}, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "106863860814814552353", "name": "Addison Patterson", "time": 1533944734999, "rating": 5.0, "text": "super reliable and honest company.", "pics": null, "resp": {"time": 1533949717150, "text": "Thank you for your business!"}, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "103025934459558565383", "name": "Jodi Donald", "time": 1548462604059, "rating": 5.0, "text": "Aaron's Lock is our go-to locksmith for all our business needs at Kutter's. They show up on time and do the job right!", "pics": null, "resp": {"time": 1548463269263, "text": "Thank you!"}, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "106227689337702893379", "name": "lisa owens", "time": 1469409823334, "rating": 5.0, "text": "Very friendly great price. I ended up not needing them but glad to know I can count in them next time!", "pics": null, "resp": {"time": 1533086411997, "text": "Thank you"}, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "101647037191590527416", "name": "Brian Moyer", "time": 1534617005564, "rating": 5.0, "text": "Good guys. 👍", "pics": null, "resp": {"time": 1534618170126, "text": "Thank you!  I agree!"}, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "113659164051152260388", "name": "Devon Whyte", "time": 1570141525754, "rating": 5.0, "text": "They are very experience.", "pics": null, "resp": null, "gmap_id": "0x889a0538051bc32b:0x3e6c2d52e18465c4"}
{"user_id": "112546019658592382657", "name": "aaron vilarchao", "time": 1621086942026, "rating": 5.0, "text": "Great service, this guy always comes out and takes care of customers with keys locked in cars and when we have problems with our locks at our stores. Quick response and good service.", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "102542674988077737542", "name": "Lukas Gabriel", "time": 1613959591408, "rating": 5.0, "text": "Had my door open in less than 5 minutes! Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "117137167846670721776", "name": "Destini Lewis", "time": 1617990091710, "rating": 5.0, "text": "Ethan was absolutely amazing! He was attentive and worked quickly and efficiently! I would hands down recommend him to any and everyone.", "pics": null, "resp": {"time": 1617991414896, "text": "Thanks so much Destini! We appreciate you! Thanks so much for taking the time to leave us a review, and thank you for your business! Please let us know if we can ever assist you further."}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "107295809103733074187", "name": "Jasmine Myers", "time": 1617934747009, "rating": 5.0, "text": "Ethan was very professional and prompt. It took him no time to make key for me. I would definitely use them again if needed.", "pics": null, "resp": {"time": 1617935488657, "text": "Thanks so much Jasmine! We appreciate you and your business. Thanks for leaving us a great review!"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "108843955039981151452", "name": "HunterAWheeler", "time": 1622228662248, "rating": 5.0, "text": "Called and had a tech come out to the restaurant where I locked myself out of my car. As soon as he arrived it probably took 1 minute and I was back in my car. Very professional and fast service. Would recommend to anyone especially after having no luck with 3 other companies.", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "109074236261429634129", "name": "Chris Lewis", "time": 1610129835358, "rating": 5.0, "text": "Ethan was quick and everything works like it's supposed to.", "pics": null, "resp": {"time": 1610976098082, "text": "Thanks Chris we appreciate you taking the time to leave us a review."}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "110276397809106596526", "name": "BK Sensei", "time": 1610390015611, "rating": 5.0, "text": "Came by quick and got it done in two minutes with no hassle. Couldn't imagine anyone could do better.", "pics": null, "resp": {"time": 1610976069858, "text": "Thanks BK. Please let us know if you need anything in the future. Don't forget to share us with your friends and family!"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "111285891453672977610", "name": "alison nicole", "time": 1620085324777, "rating": 5.0, "text": "Unlock It For Me arrived within 30 minutes, unlocked my car, and made me a spare key (only taking an additional 10-15 minutes!!!) The dude was kind and found me in a busy parking lot. 12/10 recommend", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "115372479572829401207", "name": "Bailey Nall", "time": 1609208367161, "rating": 5.0, "text": "Ethan, was very quick and skillful with getting my door unlocked. He was very quick and punctual with his time frame and unlocked my door with ease! Very greatful, thank you Ethan!", "pics": null, "resp": {"time": 1610976184221, "text": "Thanks Bailey! Call if you ever need anything!"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "114271830547199124803", "name": "Juana Gutierrez", "time": 1615765790899, "rating": 5.0, "text": "This was the ONLY PERSON that I called out of 15 locksmiths in my area and surrounding area that drive from bham to Tuscaloosa to make a key for my car. The astonishing part is he was the ONLY PERSON to help me during our last winter storm advisory! Not only did he drive to me he also was fair priced!", "pics": null, "resp": {"time": 1613858976628, "text": "Thank you very much Juana"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "104654977986231640699", "name": "Danesha Hardy", "time": 1600454212897, "rating": 5.0, "text": "I called trying to get a key made for my mom because she had lost her keys, Ethan came out and got the job done for us with no problem. He was nice and friendly he stayed in contact to let us he was on the way. I would definitely give this company a 10+ and will be recommending them.", "pics": null, "resp": {"time": 1600817250132, "text": "Thanks so much Danesha! We appreciate your business."}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "104135963869750670515", "name": "Vicki Jackson", "time": 1619206562406, "rating": 5.0, "text": "Ethan was Heaven sent! He came in a very timely matter, and still discounted my already reasonable rate because he was 10 minutes past the quoted time. He was professional and friendly. I hope I won't need him again.😂 But if I do, I won't hesitate to call him or refer others to him. Thank you so very much, Ethan!", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "100095409171473470560", "name": "Sha Turner", "time": 1600576868392, "rating": 5.0, "text": "Ethan has been great !!!! This is the second time I’ve used this company the first time I locked my keys in my car he came right out and already had me a spare key made. Then a night like tonight I lock myself out my house he was in here in 8 minutes got me in 3. BEST LOCKSMITH IN BIRMINGHAM!!!", "pics": null, "resp": {"time": 1600817219983, "text": "Thanks Sha! We appreciate you and your business. Call us if we can ever help you again!"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "110870741907060752856", "name": "Tayler Hansford", "time": 1615121544235, "rating": 5.0, "text": "I got married recently, and on the morning of my wedding, I locked my keys in my car. We were already running late, so this was the worst possible timing. I called Unlock it for me, and Ethan was there in under 5 minutes. He got us into the car with no problems at all!\n\nIf it weren’t for Ethan, I wouldn’t have made it to my own wedding! Many thanks!", "pics": null, "resp": {"time": 1615604348377, "text": "Thanks so much Tayler!"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "117449183565539337748", "name": "Stefan Schulz", "time": 1613093384943, "rating": 5.0, "text": "Truly outstanding service! Ethan was extremely accurate and prompt and did exactly what was needed in a very professional thorough and highly rated manner. I would echo those who might have doubts and say that this guy is the best locksmith in the Birmingham area!", "pics": null, "resp": {"time": 1613208841618, "text": "Thanks so much Stefan!"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "106685491092082653505", "name": "Heather Franklin", "time": 1605962666862, "rating": 5.0, "text": "Awesome fast service for programming my new remote key fob. Will definitely use again if ever needed and would definitely recommend.", "pics": null, "resp": {"time": 1610976230159, "text": "We appreciate your business 🙂"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "102816650738572407672", "name": "M M G", "time": 1609651048867, "rating": 4.0, "text": "Quick service and great price after locking keys in car,cost about $65", "pics": null, "resp": {"time": 1609893976611, "text": "Thanks MMG we appreciate your business. feel free to use the contact form on our website to let us know how we could have earned your fifth star."}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "112125153256322801016", "name": "Michael Frost", "time": 1613025301632, "rating": 5.0, "text": "Amazing service!!! We’re currently states away and had to have our house unlocked. Unlock it for me was there within an hour and had us ready to go! I am so happy we used Unlock it for Me.\nResponsive\nCourteous\nFriendly\nProfessional\nGood pricing\nWhat else do you need???", "pics": null, "resp": {"time": 1613080473273, "text": "Thank you so much Michael we appreciate your amazing review! Please let us know if we can ever assist you in the future!"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "109094024036184304513", "name": "4 Worn Passports", "time": 1613079713807, "rating": 5.0, "text": "Ethan is the best! We had an extremely complicated car re-key. We acquired a car through an estate with no key and no vehicle history. The battery was dead, the key port was dead, it was a mess. He couldn't get it programmed the first time he came out (not his fault!) due to the battery and key port issues. He recommended a different website to purchase another fob, and we replaced the battery.\n\nOnce the second  fob arrived, Ethan came BACK out at NO CHARGE and was able to get the key programmed. If Ethan can salvage our mess of a situation, I'm sure he can handle yours! If I ever have key issues again, Ethan is my first and only call.\n\nThank you, Ethan.\nKellie McIntyre", "pics": null, "resp": {"time": 1613080546228, "text": "Thanks so much for doing business with us on your travels! Keep those passports wearin' 🤠"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "110332851824457029883", "name": "Lauren Staff", "time": 1609901568254, "rating": 5.0, "text": "Ethan was awesome. Can’t recommend enough.", "pics": null, "resp": {"time": 1610976151402, "text": "Thanks Lauren! We appreciate your business! Don't forget to tell all your friends about us! 😎👏"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "114991378673510979746", "name": "Misha Randle", "time": 1601258239959, "rating": 5.0, "text": "This was the only company that could unlock a smart lock! He was extremely professional & came in about 20-minutes.", "pics": null, "resp": {"time": 1610976293019, "text": "Thanks so much Misha"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "109992116316305798106", "name": "Deaury cospy", "time": 1600429124113, "rating": 5.0, "text": "Ethan was super fast and professional he went the extra mile to make sure we were ok", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "102136599132961117964", "name": "Andrew Bonner", "time": 1600808783169, "rating": 5.0, "text": "Ethan Lann great service came on time very reliable service i know who to call when that situation arises.", "pics": null, "resp": {"time": 1600817149465, "text": "Thanks so much for taking time to leave us a review! We really really appreciate it!"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "108830205783659819945", "name": "Sivi Jerigan", "time": 1599354163938, "rating": 5.0, "text": "I loss my keys called Unlock It For Me. Ethan technician on duty his response was great and he displayed professional etiquette. He conducted business and job was completed.", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "109085297444167124271", "name": "Ashley Ellis", "time": 1585609822911, "rating": 5.0, "text": "Ethan Lynn was great! He delivered prompt and professional customer service. He was also very friendly and courteous. I would definitely use this business again if needed in the future.", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "100825817510531360495", "name": "Yvonne Devore", "time": 1600965579241, "rating": 5.0, "text": "Ethan was GREAT!!! Will DEFINITELY be recommending his service.", "pics": null, "resp": {"time": 1610976268503, "text": "Thanks Yvonne!"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "105447919988106296126", "name": "Alex Wurstner", "time": 1582230146011, "rating": 5.0, "text": "Ethan was very professional very helpful I initially used unlock it for me to have my vehicle unlocked because I locked my keys in my truck. Once Ethan unlocked my vehicle he offered to make me a duplicate to save me money in the future. Overall my experience with Ethan and the company unlock it for me was excellent I have nothing but positive things to say about them I would highly recommend unlock it for me Birmingham for anyone needing commercial residential or personal automotive key or lock services. THEY ARE THE BEE’S KNEES WHEN IT COMES TO ANYTHING LOCK AND KEY.", "pics": null, "resp": {"time": 1610976315663, "text": "Thanks so much Alex"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "102050514797953079123", "name": "Zach Sims", "time": 1601649252123, "rating": 5.0, "text": "Very professional, quality work, and lightning fast!", "pics": null, "resp": {"time": 1610976255596, "text": "Thanks Zach. We appreciate your business and your review!"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "105606894019527410661", "name": "Jackancoke", "time": 1591406673816, "rating": 5.0, "text": "Had the best experience with them. 100% best customer service quick and easy.", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "108266902529552308750", "name": "Coritta Williams", "time": 1581730441470, "rating": 5.0, "text": "The guy was very professional. I had older locks on my front door so it wasn't as easy as these new models to open,  but he didn't stop until he got it unlocked! I was locked out of my house.. Thank you for great service!", "pics": null, "resp": {"time": 1581975208575, "text": "Thanks so much for your review"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "102865619721996381933", "name": "Lindsey Nowell", "time": 1582214841848, "rating": 1.0, "text": "I was expecting a good experience due to the reviews. Dispatch (Courtney) was quick, tech (Ethan) showed up 40 minutes later than promised. He was quick to unlock my car & request payment & gratuity but when I told him I needed an invoice he got short & condescending. He said it was too late to add the VIN to my texted invoice. I immediately reached out through Square due to the poor experience. They said they would gladly send an invoice. I replied 2 days ago with what my insurance needs for reimbursement purposes & they have gone silent.", "pics": null, "resp": {"time": 1582220502073, "text": "Good morning! We're sorry that you experienced this. We definitely want to help you get reimbursed. We have reached out to you to make sure we have all your correct information and to resend your documents. Please check your email."}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "116604702956774308202", "name": "Shunta Jeffery", "time": 1587689888614, "rating": 5.0, "text": "Where do I start!!???\n\nThese guys were the 4th call on my list after I had broken my key in half. The first 3 were snappy and not understanding of my situation. Courtney answered with so much politeness and care in her voice. She dispatched me to Ethan.\n\nOh Ethan!!! He's a jewel!!! He was soooooo patient with me and my 4 little people in the background. He went ABOVE AND BEYOND, kept in contact the entire time and is truly the man for the job!!!!! I can gush about his professionalism ALL DAY but I want people to read this and not turn away cause its long😂. He went to INCREDIBLE lengths to ensure I had a new, working key today and for that I am sooooo thankful!!!!\n\nI really hope management sees this and gives Ethan the praise he deserves!!!!", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "107797303885015409964", "name": "Lauren Davis", "time": 1579369675835, "rating": 5.0, "text": "Quickest time of arrival compared to other companies around town! And extremely fast getting me into my home!", "pics": null, "resp": {"time": 1579373582848, "text": "Thanks for the review Lauren We appreciate your business!"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "108239478221970928480", "name": "Dexter Berry Jr", "time": 1586896433599, "rating": 5.0, "text": "Ethan Lynn was great help me out with my key in no time really  was a great help price was very reasonable 👍  thx", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "114568410397532889593", "name": "Gina Frost", "time": 1609900426432, "rating": 5.0, "text": "Great! And fast!", "pics": null, "resp": {"time": 1610976162105, "text": "Thnx Gina!"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "111019365358389388305", "name": "Teresa Franks", "time": 1608817446705, "rating": 5.0, "text": "Was fast and friendly", "pics": null, "resp": {"time": 1610976204652, "text": "Thanks Teresa!"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "101617665129377814281", "name": "Nikki Hughes", "time": 1579300163423, "rating": 5.0, "text": "Thanks Courtney and Ethan!! Took mere seconds to get into my car. Price is good. You guys rock!", "pics": null, "resp": {"time": 1579306618757, "text": "Thanks for leaving us a great review. We'll give those two a pat on the back! 😎 Thanks Nikki! 🤘"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "100814454078272596360", "name": "Travis Kellogg", "time": 1581971513054, "rating": 5.0, "text": "Very fast and affordable. I was extremely happy with the service.", "pics": null, "resp": {"time": 1581982061247, "text": "Thanks Travis! We're glad we took great care of your needs."}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "101994627384367350603", "name": "MELANIN GAL", "time": 1585061462294, "rating": 5.0, "text": "it was less than 30 seconds and it was very fast!!! very affordable too!!", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "114194960585703240779", "name": "Rae ann Treadaway", "time": 1581146262541, "rating": 4.0, "text": "24/7 ,fast and friendly service.  They come to you, take credit and cash,", "pics": null, "resp": {"time": 1581150850562, "text": "Hey there. Let us know if we can do any better for you!"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "104565160480943989013", "name": "Sonya Ross", "time": 1573524200175, "rating": 5.0, "text": "Great service and very good with your time. Quick & Fasr", "pics": null, "resp": {"time": 1579306771368, "text": "Thank Sonya!"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "102213950759758611890", "name": "Tracey Bowen", "time": 1582851146970, "rating": 5.0, "text": "Ethan was super fast and efficient as well as a really nice person. My car was unlocked in seconds I had my car keys!!!", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "104139408307183595837", "name": "Stock Market Genius", "time": 1496364237254, "rating": 5.0, "text": "Came out to our office today and installed new deadbolts. I was wanting to get a lock with keys that you could not get copied anywhere. They were able to get me affordable locks and they got the work done super quick. I highly recommend them.", "pics": null, "resp": {"time": 1579307633036, "text": "Thanks! We appreciate you!"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "108895615374315472243", "name": "Big Whop", "time": 1573999685375, "rating": 5.0, "text": "Affordable Fast And Great Service.", "pics": null, "resp": {"time": 1579306754633, "text": "Thanks for letting folks know we don't do a big whop to their gwap 😎"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "115224016660358262382", "name": "JRS1998 _", "time": 1578668660471, "rating": 5.0, "text": "Very affordable and quick service.", "pics": null, "resp": {"time": 1579306657611, "text": "Thanks for your great review"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "103257833059949232018", "name": "Caleb Campbell", "time": 1518930040465, "rating": 5.0, "text": "I have used unlock it for me mutiple times! They do a great job! Brandon the owner is a nice caring dude! He is very experienced and can open any car or house doors and make keys! We have very high security locks! He could still do it! They work at a great great price! Highly recommend! There also great prices! Very reasonable!", "pics": null, "resp": {"time": 1579307362634, "text": "Thanks Caleb! We appreciate you!"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "113581620310609376985", "name": "Alex Dyer", "time": 1545418911095, "rating": 5.0, "text": "Awesome Prices, perfect communication via phone and text with accurate ETA's, took her only 30 min to get there. Very happy to get my car unlocked with such ease and so FAST.\n\nThanks Tabby for the great communication and good service.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNm1XSjW_Z84E_ErYb1uZfGM1iedK9DV4nsr9GM=w150-h150-k-no-p"]}], "resp": {"time": 1579307035116, "text": "Thanks Alex! Glad we got it right for you!"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "100285348112740662373", "name": "Co-Pastor Charlotte Wilson", "time": 1516799348109, "rating": 5.0, "text": "This is the a great company. Excellent and professional customer service. Best prices you will find. It seemed like he had our vehicle door opened in less than 30 seconds! I've made spare keys but if I'm ever in need of this type of service again, I will call them and recommend them to family and friends.", "pics": null, "resp": {"time": 1579307385713, "text": "Thanks Charlotte! We appreciate your fantastic review."}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "106701980946394500797", "name": "xTPOWx Pow", "time": 1472769845562, "rating": 5.0, "text": "Called all the way from North Carolina due to having my keys locked in the trunk of my 2007 Hyundai Elantra, A locksmith had unlocked my car for me, but the alarm system locked up my trunk release, they helped walk me through it on the phone, and didn't charge a dime. Super friendly awesome people, the kind of people you want to do business with. I strongly recommend them. Once again, thanks for the help, much appreciated!", "pics": null, "resp": {"time": 1493012278535, "text": "Thank you for taking the time to leave this review! Lots of folks have the same story! Glad we could help!"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "105026262713615105811", "name": "Abby Melton", "time": 1465167977190, "rating": 5.0, "text": "Robert was super sweet, arrived quickly and got our door open. He even waited on maintenance to see if they could open it beforehand (which they couldn't). Super easy, fast and very reasonably priced! Thanks again!", "pics": null, "resp": {"time": 1493012334214, "text": "Thank you leaving this review! We aim to offer service with no pressure and friendly staff! Glad we got it right!"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "103927896887352172668", "name": "Alexis Rowser", "time": 1442246946753, "rating": 5.0, "text": "The service was great. My car was very difficult to deal with and they both stayed to help me figure out a way to unlock my car. And the price was very cheap 2I would definitely suggest anyone to go to them.", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "106363203416156471380", "name": "Mark Lewis", "time": 1490393700206, "rating": 5.0, "text": "They got me unlocked and reprogrammed my car. The dealer wanted to charge me 700, and unlock it for me did it at a fraction of the cost. Great job", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "112708165551545329785", "name": "Alisha Bothwell", "time": 1416958485977, "rating": 5.0, "text": "I'm very impressed right now!! I found this company in the midst of my car keys being locked in my vehicle. Not only did Brandon pick up on the 1st ring but he was very helpful as well as friendly when it came to helping me solve my issue! The price was phenomenal & the service was quick! I would definitely recommend this company to anyone.", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "113798491919975797172", "name": "Zach White", "time": 1498436387305, "rating": 5.0, "text": "Most people wanted to charge me nearly double and had long wait times. Was even able to get a spare key made!!! Definitely recommend!!!", "pics": null, "resp": {"time": 1579307429615, "text": "Thank you Zak for your great review we tried to be fast and affordable!"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "110272785520915971841", "name": "Bryan Pope", "time": 1487034371275, "rating": 5.0, "text": "We lost our truck keys. I think our youngest flushed them down the toilet. After a week of searching we called UnlockThisForMe. This guy did a great job. He was very personable and informative. Would highly recommend.", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "118323682547682951323", "name": "Benji Laney", "time": 1476638703933, "rating": 5.0, "text": "Great experience she was here and done in under 20 minutes. Fast efficient and affordable. I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "116680906462936480396", "name": "Mary Carlisle", "time": 1448511220451, "rating": 5.0, "text": "Amazing!!! Called literally 15 other companies, and they couldn't help.. Brandon was on time, and fast! Friendliest service ever.. Thank y'all so much for saving the day!!!", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "106947994941403822407", "name": "Rodrick Toyer", "time": 1559123705754, "rating": 5.0, "text": "Loved it cause the wait time wasn't long", "pics": null, "resp": {"time": 1579306843643, "text": "Thanks Rodrick! We try to hurry 😎"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "113517021586829069589", "name": "Grace Adams", "time": 1531182169420, "rating": 5.0, "text": "Anthony did a fantastic job. It wasn’t easy to get unlocked but he did not stop until it was done! Thank you!!!", "pics": null, "resp": {"time": 1579307216123, "text": "Thanks Grace! Well pass those Kudos along!"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "100120621459124845227", "name": "Robert Gardner", "time": 1519338563903, "rating": 1.0, "text": "I scheduled service two days ago, giving them needed information to service my car lock. I waited for an hour over scheduled time for service.  No communication from these guys. After another call an hour later, they palmed me off on another lock service who promptly came out and took care of my problem. No recommendation here...", "pics": null, "resp": {"time": 1522469330451, "text": "Hi Robert. Sorry that we kept you waiting! We have been quite busy this spring, but that's no excuse to keep you waiting! I don't believe that you were \"palmed off\" but rather your call was handled by a provider at our sister company. Nonetheless if there is anything we can do for you please contact us via the form on our website."}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "117351576656823296086", "name": "John Kalousek", "time": 1491347460849, "rating": 5.0, "text": "Such a god send. After three hours of calling and dealing with other locksmiths who lied and falsely told me they were sending a technician, Unlock It For Me went out of their way at midnight to find a locksmith for me even though their staff locksmith was unavailable. Definitely earned a life long customer.", "pics": null, "resp": {"time": 1491364672681, "text": "Thank you very much for taking the time to leave us your review 😀"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "104672547461692593323", "name": "Moka Anjel", "time": 1538798312050, "rating": 5.0, "text": "Friendly, professional, got the job done - the first time.  I rarely recommend businesses but I highly recommend this one for your key/lock services.", "pics": null, "resp": {"time": 1579307074517, "text": "Thanks Moka! Call anytime!"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "107168346646834826544", "name": "Kat Parker", "time": 1464376381779, "rating": 5.0, "text": "I just needed a jumpstart for my car and they were fast and very polite. I loved their service and had a excellent experience. I would definitely reuse and recommend them.", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "116400960174684642691", "name": "patton fussell", "time": 1465271393293, "rating": 5.0, "text": "The employee was extremely polite and very helpful. Robert Burns, the owner, even called to follow up. I really appreciated that type of customer service!", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "109083144982446057870", "name": "Storm Smith", "time": 1496002280227, "rating": 2.0, "text": "Called to have my car unlocked and was told it would be a 45-60min wait and that I would get a call within 30mins to let me know someone was on the way. After an hour of waiting with no call and no one showing up I called Pop-A-Lock and they showed up in 20mins and were super friendly. Still never received a call from Unlock it For Me.", "pics": null, "resp": {"time": 1496295848133, "text": "We're sorry you had this negative experience. This is not the type of service we aim to provide. If you can please contact us with more information. We would love the opportunity to make up for letting you down."}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "108439503842150321492", "name": "Jay Morris", "time": 1462555357541, "rating": 5.0, "text": "Very quick, extremely helpful. Really, perfect service, couldn't ask for more. Made me an extra spare key and unlocked my car.", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "115882983107554189960", "name": "Lauren Jerge", "time": 1450386558371, "rating": 5.0, "text": "They were very fast. Very reliable. Would use them everytime and hand out there card to anyone in need of that type of service", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "110471528995516054064", "name": "mochihearts", "time": 1418337062049, "rating": 5.0, "text": "They were super helpful and friendly. It took the tech less than a minute to open my car. I will know who to use in the future if I am locked out of my car.", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "116101602983423498066", "name": "Lady Bug", "time": 1537656250868, "rating": 5.0, "text": "Ten STARS ........This ppl are wonderful wonderful,fast, convenient and I 100% recommend them", "pics": null, "resp": {"time": 1579307107019, "text": "😳 thanks a million 🌝🌝"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "115221366018377256211", "name": "G Duncan", "time": 1596426419613, "rating": 5.0, "text": "Fast and courteous", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "107310939854975824204", "name": "Lele Payne", "time": 1413935042082, "rating": 5.0, "text": "My experience was excellent. Got in car quick. Would recommend any one to use them.", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "100708357135918232865", "name": "ben allen", "time": 1528654542354, "rating": 5.0, "text": "Great services. Cut 2 keys in minutes and at great price", "pics": null, "resp": {"time": 1579307278619, "text": "Thanks Ben! Call anytime."}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "110978120289424875579", "name": "Kisha Tolbert-Simmons", "time": 1453001769886, "rating": 5.0, "text": "Quick, safe, and economical! It took the locksmith less than 20 minutes to arrive at my home. Once he arrived, my car door was unlocked within minutes!", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "104122843024260793581", "name": "Mandy McMillion", "time": 1522466672580, "rating": 1.0, "text": "Told me 30-45 minutes, I called to check in around 40 minutes, was told technician was in route. After an hour passed, I called again, dispatcher admitted technician got \"hung up\" on another job and hadn't even left yet. I demanded a time frame/to know where in route technician was. After a long pause for her to check where he was, I was told if I wanted to call someone, then go ahead. I did. Would never use this company again. All they needed to do differently was keep in touch if ETA changed. I'm locked out of my car with 3 young kids. I found their lack of communication and honestly on ETA unacceptable.", "pics": null, "resp": {"time": 1522469219345, "text": "Hey Mandy, please if you can send us an email via the contact form our website. I'm so sorry to hear that you had this experience. We aim to take much better care of our customers than this, and though it can get a bit hectic on a Friday night at 10 pm there's still no excuse for lack of communication. I would like to do all that I can to make this better for you."}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "104263794425575388574", "name": "Brandon Glenn", "time": 1443467174973, "rating": 5.0, "text": "After calling another company where the guy who answered was a jerk I found this company. They were kind, they got to my location quicker than expected and were finished in no time. I can't recommend them enough!", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "110265117634468998356", "name": "Tori B", "time": 1497211464905, "rating": 5.0, "text": "Very professional will recommend this company. Thanks so much", "pics": null, "resp": {"time": 1579307526675, "text": "Thanks so much TeeBae 🥰"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "114957197534584562518", "name": "James moses-coleman", "time": 1420421527418, "rating": 5.0, "text": "Just had these guys come out and unlock my Mustang..\nI had my keys in my hand literally 3 minutes after he got out of his car.\nHighly recommended!", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "115142606867050100609", "name": "Tim Evans", "time": 1405731688012, "rating": 5.0, "text": "Great people to do business with. Professional and their prices are very reasonable. Highly recommend!!!", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "111960686034225538237", "name": "Fincher Enterprise LLC", "time": 1557606689454, "rating": 2.0, "text": "Called several times with no answer, it seems like there is some sort of line error.", "pics": null, "resp": {"time": 1579306891374, "text": "We sorry you experience this issues we had some previous issues with a phone provider"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "115693291900448323654", "name": "Lala R", "time": 1532263163382, "rating": 1.0, "text": "24 hours is what time the website says but that's not true. Called at 7am and was told to call back at noon, smh 🤔", "pics": null, "resp": {"time": 1579307188016, "text": "We're so sorry you had this experience. Occasionally unforseen issues do arise. We're sorry we let you down."}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "107340508585014836663", "name": "Ashley Jackson", "time": 1585497163755, "rating": 5.0, "text": "Very fast response!!! Friendly and Reliable!!!", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "106645473270733565732", "name": "Rhodes Roberts", "time": 1462015630205, "rating": 5.0, "text": "Excellent service! These guys are great. They helped us out at a late hour on a stormy night. The technician arrived 10 mins faster than he predicted and had the door open in only a couple mins...in the rain. No hidden costs. They do accept credit cards.", "pics": null, "resp": {"time": 1483875564677, "text": "Thanks for the review!"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "106871083689260594175", "name": "Lyndsey Burton", "time": 1432331154917, "rating": 5.0, "text": "They are the freaking best. They are fast and extremely professional. Will always go to them.", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "103684526600971533451", "name": "Michael and Christi Cole", "time": 1454440419034, "rating": 5.0, "text": "Fast and speeding service. Excellent customer service. Very professional.", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "104016412178599155084", "name": "Deek Cunningham", "time": 1498022288096, "rating": 5.0, "text": "Professional, friendly and quick to arrive and complete the task! And the price was very reasonable as well!", "pics": null, "resp": {"time": 1579307510823, "text": "Thanks Deek were here for your locksmith needs 24/7"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "104139489695284718736", "name": "Shawntee38", "time": 1446931050478, "rating": 5.0, "text": "Fast, and friendly service. My door was open in less than a minute. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "104342099366093602297", "name": "LaVa Darby", "time": 1545808488687, "rating": 1.0, "text": "Very disrespectful enployee raising her voice to me because she got called out on an assignment. I told her supervisor she should resign moreless be fired. Instead of her doing her job she wants to argue with me when I live here. I would never recommend this place of business.", "pics": null, "resp": {"time": 1579307014833, "text": "We're sorry you had this experience. This was addressed with the former employee."}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "101679408838064835332", "name": "TaKeisha Flannigan", "time": 1432518612991, "rating": 5.0, "text": "Was locked out. Brandon said he would be there in 30 minutes..he got there in 20!!  They are reasonable and fast!! Thank you!!", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "110343222150600506070", "name": "LILI Yang", "time": 1420869040425, "rating": 5.0, "text": "I was going nuts when my rental car key locked inside to Hyundai Sonata. OMG! Rental car company suggests me get towel back to LAX. (40 miles).  I think must there someone or something can help.  Get on the google, there I found unlock for me....Such a life saving! For no where near me but solve my problems! I'd say YOU ROCK!!!", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "105246822073905315847", "name": "Tammy Nipper", "time": 1430512781358, "rating": 5.0, "text": "Quick response to open one of my employee's car after she locked her keys inside.  Great work.", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "110200042259556364207", "name": "Shannon M Bean", "time": 1558387640879, "rating": 5.0, "text": "He is my hero! Thank you, thank you. Thank you.", "pics": null, "resp": {"time": 1579306869406, "text": "You're our hero for leaving this review. Thank you Shannon!"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "109770880833784886772", "name": "Greg scott", "time": 1503519017374, "rating": 1.0, "text": "they don't answer the phone\nNot 24 hours for sure", "pics": null, "resp": {"time": 1503618216144, "text": "Hi can you please contact us with more information? When did you try to reach us? We were in fact experiencing some phone issues this week. Sorry we let you down! We'd love a chance to make it right!"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "117430446858550176217", "name": "Anthony Johnson", "time": 1454637532749, "rating": 5.0, "text": "Very polite and very quick!  Would definitely use again!", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "110795986834009963628", "name": "Summer Owens", "time": 1428632736919, "rating": 5.0, "text": "Freaking awesome service!!!! Was able to help me and get my door unlocked in minutes!!! Highly recommend to anyone!!!", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "103321517999318308549", "name": "torielle green", "time": 1404539459173, "rating": 5.0, "text": "He was fast and did a quick service. I would say he is the best in town!!", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "116689042342425422781", "name": "Erica Jones", "time": 1431821295201, "rating": 5.0, "text": "They were awesome they brought sunshine to my rainy day and he was super fast", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "116788244354001105129", "name": "Michael Reddy-Miller", "time": 1463780187860, "rating": 5.0, "text": "Great customer service...helped me out a lot...would definitely use again!", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "116057625540720135345", "name": "Adrian Glenn", "time": 1417042586973, "rating": 5.0, "text": "They are swift and very good, I would use them anytime.", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "116689042342425422781", "name": "Erica Jones", "time": 1431821295201, "rating": 5.0, "text": "They were awesome they brought sunshine to my rainy day and he was super fast", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "117069901625451416238", "name": "Ryan K Jones", "time": 1551205193874, "rating": 5.0, "text": "THE BEST AROUND!", "pics": null, "resp": {"time": 1579306955010, "text": "We're so glad you let everyone know! Thanks Ryan!"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "108852615340022379914", "name": "jack roberts", "time": 1417654447379, "rating": 5.0, "text": "Great job fast service in my time of need in Westside Birmingham", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "114323878969108861777", "name": "Jonathan preston", "time": 1454622350637, "rating": 5.0, "text": "These guys have the necessary skills! Had my car opened so fast it ALMOST made me mad lol", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "105419923897112156519", "name": "Bailey Harris", "time": 1421990444477, "rating": 5.0, "text": "Speedy fast. And cheap. Thanks for coming to the rescue.", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "117706036686609967544", "name": "Kathryn Hosmer", "time": 1464546173952, "rating": 5.0, "text": "Very quick and had the door open in seconds.", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "109224401949973931214", "name": "tynesia roby", "time": 1430896951979, "rating": 5.0, "text": "Brandon is a wonderful guy..Keep up the good work..", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "117421614100804635734", "name": "Retro Velt", "time": 1453020576140, "rating": 5.0, "text": "Quick and good service and reasonable prices thank you", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "102572723993785024526", "name": "Delaney Smith", "time": 1417814068722, "rating": 5.0, "text": "by far the cheapest, quickest, and easiest! ive used them probably about 10 times and it's cause I wouldn't use anyone else. I lock my keys in my car constantly and I've used ever locksmith company in bham. they are the besttt!", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "100855515120593454635", "name": "Monica Law", "time": 1471483682522, "rating": 5.0, "text": "Great. Timely. Cost efficient!", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "105718867979177858222", "name": "T Whit", "time": 1466488807038, "rating": 5.0, "text": "Awesome! They are very fast and professional", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "113152280215557370563", "name": "Abdul-Hakeem al-Amriki (Abu 'Esa)", "time": 1419441533628, "rating": 5.0, "text": "Super fast and friendly, and at a really low price, I highly recommend their services if you're forgetful like me", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "117942403149547691174", "name": "Rebecca Blumenfeld", "time": 1452919007069, "rating": 5.0, "text": "Fast service and incredibly reasonable price!", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "116142104190306287050", "name": "Michael Wayne Gray", "time": 1435002277457, "rating": 5.0, "text": "Prompt professional service, reasonable price.", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "114004115495513552781", "name": "Rachelle Ragland", "time": 1442091261778, "rating": 5.0, "text": "Wonderful and very quick. Thanks Brandon", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "100768919968957878162", "name": "Chanel Arnai", "time": 1434807612907, "rating": 5.0, "text": "Awesome service with the best prices surrounding Birmingham!", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "107325887057339997978", "name": "Eric Chiles", "time": 1413782053681, "rating": 5.0, "text": "Quick service and excellent prices...", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "103906445742697807988", "name": "Aisha Davis", "time": 1440109827671, "rating": 5.0, "text": "SERVICE WAS GREAT AND QUICK!", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "104287891700294375523", "name": "Echo Semaj", "time": 1439350740897, "rating": 5.0, "text": "Awesome! This place was great.", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "101477515031050817933", "name": "Elizabeth Cromwell", "time": 1463959409764, "rating": 5.0, "text": "Absolutely awesome !  Done quick and cheap!", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "107951622089543148608", "name": "Kenya Johnson", "time": 1568114157340, "rating": 5.0, "text": "Great and fast", "pics": null, "resp": {"time": 1579306811762, "text": "Thanks Kenya! We appreciate your review."}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "112502090775104090018", "name": "Daniel Burnham", "time": 1460603770420, "rating": 5.0, "text": "Prompt and very fair pricing.", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "106606884526473887461", "name": "Cheef G.Class", "time": 1455691384943, "rating": 5.0, "text": "Had to get a new set of keys made for my Ford Explorer. These guys are they cheapest in town!", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "106467974207922698063", "name": "Mike Epperson", "time": 1430760802020, "rating": 5.0, "text": "Excellent Service. We work with them regularly - Business 2 Business", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "104880946363798478175", "name": "Bella Abercrombie", "time": 1498432501872, "rating": 5.0, "text": "They just came and saved my life. I locked my keys in the car at work.", "pics": null, "resp": {"time": 1579307478946, "text": "Thank you Bella for leaving us this review we're glad to help you anytime"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "106686662702533655506", "name": "LaTrecia Durrough", "time": 1525572309106, "rating": 5.0, "text": "Great Service and prompt", "pics": null, "resp": {"time": 1579307329825, "text": "Thanks so much for your great review"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "111899550041446401014", "name": "Chris Myers", "time": 1577835294693, "rating": 5.0, "text": "Ethan Lann", "pics": null, "resp": {"time": 1579306667825, "text": "Thanks Chris"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "112042446375978341674", "name": "Lindsay T.", "time": 1439334092373, "rating": 5.0, "text": "fast and friendly and a great price!!", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "104647197586538024392", "name": "Ryan Wimbleduff", "time": 1417923801451, "rating": 5.0, "text": "Awesome fast good service", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "105276079036478263542", "name": "myriad myrtle", "time": 1466988312597, "rating": 5.0, "text": "The very best! 10*", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "114569283628995409542", "name": "Toree Madison", "time": 1527375910170, "rating": 5.0, "text": "Fast and easy", "pics": null, "resp": {"time": 1579307314161, "text": "We try hard! 😎"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "104460554605010587731", "name": "savage foeya", "time": 1506021577230, "rating": 1.0, "text": "Key did not work at all", "pics": null, "resp": {"time": 1506050861221, "text": "We are sorry your key doesn't work. If you'd please call or email describing the details of your experience. Address and invoice number are helpful.\n\nWe stand behind our work, so if a key we made doesn't work, we will rectify the situation. We apologize for any inconvenience you may have encountered"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "104647197586538024392", "name": "Ryan Wimbleduff", "time": 1417923801451, "rating": 5.0, "text": "Awesome fast good service", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "115404772740632755671", "name": "Damon Fields", "time": 1506020150942, "rating": 1.0, "text": "Took 3 hours for some one to come after they said it would be 1 hour", "pics": null, "resp": {"time": 1506050938778, "text": "If you'd please call or email describing the details of your experience. Address and invoice number are helpful. We can investigate the issue and offer a partial refund or discount on future work. Please contact us at unlockitforme.com/contact/"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "103314783720357977195", "name": "Cecilia Bradley", "time": 1490393297737, "rating": 5.0, "text": "Excellent and quick service", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "113818772146232407554", "name": "tonys transportation service Antonio young", "time": 1470974880243, "rating": 5.0, "text": "Great local company!", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "107319157335871521345", "name": "Adrienne Steele", "time": 1600572863291, "rating": 5.0, "text": "Ethan", "pics": null, "resp": {"time": 1600817232709, "text": "Thanks Adrienne!"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "102619444997456970370", "name": "Carlos Mcdaniel", "time": 1528584490972, "rating": 5.0, "text": "Good job", "pics": null, "resp": {"time": 1579307300181, "text": "Thanks Carlos! Glad you loved us!"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "114563313085707433146", "name": "Steve Namkoong", "time": 1536540824154, "rating": 5.0, "text": "Bradley was a ton of help, and he got here in no time and unlocked my door for me in less than a minute, I would very much recommend him if you are ever locked out or you lose your keys!", "pics": null, "resp": {"time": 1579307134029, "text": "We appreciate your review Steve 🙏"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "100553766275303624972", "name": "melodie wright", "time": 1488766861912, "rating": 5.0, "text": "Very good job", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "111292442455775567180", "name": "Brecia Oates", "time": 1508456098311, "rating": 1.0, "text": "They are not 24 hours I Called at 2:00 a.m no answer", "pics": null, "resp": {"time": 1508458509093, "text": "Hey Brecia, I am so sorry we let you down. Can you please get in touch with me, we would love to make this up to you. We are supposed to be 24 Hours, that being said, if someone did not answer the phone, we will get to the bottom of whoever wasn't doing their job at 2 AM. So sorry to have inconvenienced you. Please call me or text me at 205-400-8233 at your earliest convenience. Customer satisfaction is very important to us! Thank you for leaving your feedback!"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "101270064190001898848", "name": "dale jones", "time": 1497133830325, "rating": 5.0, "text": "Unlock my car and made me a new key.wondeeful service!", "pics": null, "resp": {"time": 1579307598209, "text": "Thanks for the Stars Dave! We appreciate your business"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "109653859105038159697", "name": "RUWAN K", "time": 1518987105440, "rating": 5.0, "text": "Good job", "pics": null, "resp": {"time": 1579307346765, "text": "(Translated by Google) Thanks Spring!\n\n(Original)\nThanks Ruwan!"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "113292993927811239870", "name": "Cynthia Ye", "time": 1506119395925, "rating": 5.0, "text": "The initial service was delayed. However, they followed up and eventually fixed up the service. My car fob functions well as now.", "pics": null, "resp": {"time": 1579307405229, "text": "Banks Cynthia we appreciate your business and thank you for your review."}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "114064689369296490847", "name": "Charles Terry", "time": 1488686838082, "rating": 5.0, "text": "Good Job", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "105889066927949660817", "name": "Stephanie Harbin", "time": 1488569183596, "rating": 5.0, "text": "Good service", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "109675640123555619390", "name": "Cridy18", "time": 1488565888731, "rating": 5.0, "text": "Good job", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "114641915446155205180", "name": "Aaron Robbins", "time": 1488565586414, "rating": 5.0, "text": "Good service", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "115764026138337274313", "name": "Lecia Wright", "time": 1507720014162, "rating": 1.0, "text": "Lady tech could not unlock my car", "pics": null, "resp": {"time": 1508458635191, "text": "Hey Lecia, Can you please provide us with some more details? At the time of your review (approx. 10-11-17) we did not and still do not have a female technician unlocking vehicles for us in the Birmingham / Hoover area. It is possible someone misrepresented themselves, at any rate, we would love to make this up to you any way we can. Get in touch with us and we will take care of you."}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "115288045635993934762", "name": "Sharon Uwanyuze", "time": 1472358893882, "rating": 5.0, "text": "Quick!", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "114064689369296490847", "name": "Charles Terry", "time": 1488686838082, "rating": 5.0, "text": "Good Job", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "114641915446155205180", "name": "Aaron Robbins", "time": 1488565586414, "rating": 5.0, "text": "Good service", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "105889066927949660817", "name": "Stephanie Harbin", "time": 1488569183596, "rating": 5.0, "text": "Good service", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "103024758402489037050", "name": "Phillip Epperson", "time": 1488686153625, "rating": 5.0, "text": "Good service", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "109675640123555619390", "name": "Cridy18", "time": 1488565888731, "rating": 5.0, "text": "Good job", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "107319157335871521345", "name": "Adrienne Steele", "time": 1600572863291, "rating": 5.0, "text": "Ethan", "pics": null, "resp": {"time": 1600817232709, "text": "Thanks Adrienne!"}, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "113713990685004887014", "name": "Marilyn Oden", "time": 1462577477171, "rating": 5.0, "text": "Quick service!!", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "102750693933855096793", "name": "Rachel Mcdonald", "time": 1463971153887, "rating": 5.0, "text": "They was fast", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "115252139985243172270", "name": "Matt Nichol", "time": 1438544941942, "rating": 5.0, "text": "Awesome service", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "105773825038558431872", "name": "Courtney Frazier", "time": 1429802533711, "rating": 5.0, "text": "great service", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "103090977956015498013", "name": "Chrissy Pavino", "time": 1419158490101, "rating": 5.0, "text": "awesome.. woke up and came right over!!", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "116572040708768192920", "name": "Christie Webb Thomas", "time": 1418441622939, "rating": 5.0, "text": "very prompt, cheap and very nice", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "100024391948560303921", "name": "kamille robinson", "time": 1431646882433, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "105773825038558431872", "name": "Courtney Frazier", "time": 1429802533711, "rating": 5.0, "text": "great service", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "102408788130361706799", "name": "india Lowe Lowe", "time": 1419158006279, "rating": 5.0, "text": "quick service was did", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
{"user_id": "118035238365246393305", "name": "Christina Barakat", "time": 1418592986802, "rating": 5.0, "text": "great service", "pics": null, "resp": null, "gmap_id": "0x88891898aeb74abd:0x5a8ad7b780ab0f36"}
