{"user_id": "103377794267257525569", "name": "Self Help CEE (TheRandomLife)", "time": 1626899252892, "rating": 1.0, "text": "My son (6) attended their youth class for what was about a month. For 140.00 per month, two days a week , and only one hour, we weren’t satisfied with how the classes were being taught. I can take my kid to launch in prattville and let him play longer for what we were paying.\nAny way, perhaps we weren’t  aware of their “new” policy that they introduced with Covid, or it was not explained to us in detail, but 3 months later we are still being charged 140.00 per month for the classes which we haven’t attended. We even tried cancelling back in May and was told that we would be fully refunded, and no longer charged. As of today 7/21/21, we have been charged yet again, and have now been told that there’s nothing that can be done about it and they we will not be refunded.\n\nEven Walmart has some kind of customer resolution procedure for situations like this. I don’t even see how they stay in business. If you are looking for a good martial arts place for your kids to go to GO SOMEWHERE else. They do not care about their customers, they only care about getting paid and robbing you of your time and money. The biggest mistake I made was signing up with them. If I could take legal action I would, because their policies are about robbery. They didn’t even apologize for the inconvenience.\n\nI will NEVER come here, or recommend this them. I I am Highly upset, and unsatisfied with their business practices, and customer service. They will suffer greatly from doing business this way! If I could rate negative zero stars I would!", "pics": null, "resp": null, "gmap_id": "0x888c2be41d55b4f9:0x4bd8e24a4961da3f"}
{"user_id": "103453347153635250013", "name": "Shelby Hall", "time": 1611112372013, "rating": 5.0, "text": "I joined to add something new to my exercise routine. I got the exercise and really enjoy the classes. The instructors do a good job and those in the class are a great group of people.", "pics": null, "resp": {"time": 1616551218929, "text": "Thanks Shelby! We sure are glad to have you training with us."}, "gmap_id": "0x888c2be41d55b4f9:0x4bd8e24a4961da3f"}
{"user_id": "118111342545363659212", "name": "William Jones", "time": 1549640056987, "rating": 5.0, "text": "With an amazing and caring military vet at the helm here, it's easy to see why this is the best place in town! I visited a few months back and was absolutely floored at the level of detail and caring they put into each student. I've been training martial arts all my life. If I move to Montgomery, this is where I'll train. I highly recommend it.", "pics": null, "resp": {"time": 1549892985209, "text": "Thanks William! It was a pleasure getting to meet and train with you. Hope to see you back soon."}, "gmap_id": "0x888c2be41d55b4f9:0x4bd8e24a4961da3f"}
{"user_id": "106940723589410666693", "name": "Shad Jones", "time": 1542402736396, "rating": 5.0, "text": "I’ve been training a few months here and it is wonderful. The staff is friendly and very helpful. The trainers and Mr Bill excellent teachers. They work closely with you and always have your Saftey at mind.  I’m always excited to go to another class and see what’s next, and how far I can push my limits. I highly recommend them for any of their training offered!", "pics": null, "resp": {"time": 1542426208740, "text": "It's an honor to have you on the mat. You're exactly the kind of student that makes it all worthwhile."}, "gmap_id": "0x888c2be41d55b4f9:0x4bd8e24a4961da3f"}
{"user_id": "104211957868084980018", "name": "David Leonard", "time": 1553565022673, "rating": 5.0, "text": "Bill is a seasoned, solid martial artist.  His comprehensive knowledge and grounded character-based teaching style make for a dynamic learning experience.  Students at this school will be challenged to be not only better martial artists, but also to incorporate discipline and integrity into thier everyday lives.  In 15 years of training, I have found few schools of this caliber.", "pics": null, "resp": {"time": 1565865724466, "text": "Thanks for the vote of confidence my friend!"}, "gmap_id": "0x888c2be41d55b4f9:0x4bd8e24a4961da3f"}
{"user_id": "101238769421389889989", "name": "Nikki Crockett", "time": 1566344130456, "rating": 5.0, "text": "Bill and his team are awesome. They have helped my son so much. He is no longer the shy reserved kid. Highly recommend.", "pics": null, "resp": {"time": 1566352055752, "text": "Thanks Nikki! Ethan is doing fantastic! He's come a long way."}, "gmap_id": "0x888c2be41d55b4f9:0x4bd8e24a4961da3f"}
{"user_id": "105551252747769597345", "name": "Sandra Lewis", "time": 1451147915153, "rating": 5.0, "text": "Awesome leaders here! Can't say enough about the atmosphere. They temper a sense of family, fun and learning all in a teaching setting. Your not only learning an art that will protect you but also teaches so many other things that seem to be lost in today's world.\nDiscipline\nComradery\nLasting friendships\nLeadership\nRespect\nSelf Esteem\nFun\nGoals\nValues\nand many more.", "pics": null, "resp": null, "gmap_id": "0x888c2be41d55b4f9:0x4bd8e24a4961da3f"}
{"user_id": "114804519032442411904", "name": "Logan Moorer", "time": 1529524240610, "rating": 5.0, "text": "I’ve been training and helping out at Montgomery Martial Arts now for a couple of years, and I can say without a doubt that I have been greatly blessed by the family I’ve  gained there. The environment is positive and the focus is always on encouragement for the sake of self improvement.", "pics": null, "resp": null, "gmap_id": "0x888c2be41d55b4f9:0x4bd8e24a4961da3f"}
{"user_id": "111701057122661949562", "name": "Corey E (cmericks)", "time": 1563505595891, "rating": 5.0, "text": "I am immensely pleased with this excellent program! I started bringing my kindergartner after a series of encounters with bullies at school. The program imbued confidence, practical tactics, muscle memory, and measured responsiveness. Bullies ceased to be an issue (i.e. confidence). Last weekend, I watched him instinctively (i.e. muscle memory) throw up his forearm (i.e. practical tactic) to block his brother's temper tantrum haymaker, then scoot back and assume a guard stance (i.e. measured responsiveness).", "pics": null, "resp": {"time": 1565865611437, "text": "Thanks Cory! Love it! Super glad to have you guys in our Academy."}, "gmap_id": "0x888c2be41d55b4f9:0x4bd8e24a4961da3f"}
{"user_id": "114860583433713450813", "name": "Bill Mehm", "time": 1528504915665, "rating": 5.0, "text": "Awesome gym with a great carriculum and instructors...evident by how much the student body has grown since opening. If you’re looking for an actual self defense school for yourself or your kid, this is it!", "pics": null, "resp": null, "gmap_id": "0x888c2be41d55b4f9:0x4bd8e24a4961da3f"}
{"user_id": "115677811097184443158", "name": "Steven Roberts", "time": 1595554923681, "rating": 5.0, "text": "Great classes and people", "pics": null, "resp": {"time": 1590086193151, "text": "Thanks for the stars brother! Glad you are enjoying your journey!"}, "gmap_id": "0x888c2be41d55b4f9:0x4bd8e24a4961da3f"}
{"user_id": "112249881202114853545", "name": "Jacob Saylor", "time": 1450458958489, "rating": 5.0, "text": "Great learning environment for both children and adults. If you're serious about martial arts, this is your best bet in the Montgomery area.", "pics": null, "resp": null, "gmap_id": "0x888c2be41d55b4f9:0x4bd8e24a4961da3f"}
{"user_id": "105460052914224119271", "name": "Gregory Williams", "time": 1450896432907, "rating": 5.0, "text": "Great atmosphere and great training partners make Montgomery Martial Arts an all-around excellent training environment.", "pics": null, "resp": null, "gmap_id": "0x888c2be41d55b4f9:0x4bd8e24a4961da3f"}
{"user_id": "104666365789971222895", "name": "Anna Rosemen", "time": 1528247736992, "rating": 1.0, "text": "So I came in once a few weeks back, and I stood waiting for them to come over to the counter so I could ask about the program to sign up and I stood there for a long time waiting and nothing. The people there saw me and they didn’t come over. They completely ignored me so I left.", "pics": null, "resp": {"time": 1528249329907, "text": "Hello Anna! I am so sorry to hear this. I really do not know how this could happen. There is always someone at the front counter unless there is an emergency. The head instructors are even trained to come over and assist you if they are not completely overloaded in class. However, if it happened please allow us to opportunity to make it up to you. I would like to offer you two weeks of free training to check things out and a personal private lesson. Please reach out to us during business hours and we will set up a time to make it happen. Thank you for your understanding."}, "gmap_id": "0x888c2be41d55b4f9:0x4bd8e24a4961da3f"}
{"user_id": "107776254708383876192", "name": "Beccy Campbell", "time": 1451519425828, "rating": 5.0, "text": "Amazing instructors that take a genuine interest in every student. My son has been taking Brazilian Jiu Jitsu and Krav Maga with these instructors for over two years. The staff, students, and parents at the school are like family to us.  The programs at Montgomery Martial Arts not only focus on teaching technique and skill but also on building self esteem and character development as part of the martial arts education.  Flexible class schedules during the week that allow for training time that meets the needs of students and affordable tuition rates. I would highly recommend this school for martial arts students of all ages.", "pics": null, "resp": null, "gmap_id": "0x888c2be41d55b4f9:0x4bd8e24a4961da3f"}
{"user_id": "113511260337352335118", "name": "raymond cruz", "time": 1498692081702, "rating": 5.0, "text": "Very friendly staff. Great place to train during my stay at Maxwell AFB!", "pics": null, "resp": null, "gmap_id": "0x888c2be41d55b4f9:0x4bd8e24a4961da3f"}
{"user_id": "111332906279131039006", "name": "Gina Daniel", "time": 1628037224694, "rating": 5.0, "text": "Gracie my instructor is knowledgeable and awesome!!  Facility is very nice! I enjoy very much taking classes here.", "pics": null, "resp": {"time": 1628038051859, "text": "Thank you, Gina! We enjoy working with you and are glad you're enjoying your training. Keep up the hard work!"}, "gmap_id": "0x8862133f3db62217:0xed5e4dd047a46b20"}
{"user_id": "107997324537257648177", "name": "Laura Rivers", "time": 1604869005730, "rating": 5.0, "text": "I am ecstatic for the opening of this local Madison “gem”! Gracie and Isaac truly go above and beyond. They are both, very knowledgeable and very passionate about the self-defense style that they teach.\n\nIf you are expecting this to be a “wax on, wax off” type of karate, think again! The personalized lesson was practical and relatable without having to paint a fence. And a HUGE bonus, both instructors are patient and encouraging! It’s absolutely all you could ask for in when it comes to learning self-defense!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO_L8ri0cRA5trF_XDCrkVmQcHPnfsdZd0fjH5g=w150-h150-k-no-p"]}], "resp": {"time": 1604869727698, "text": "Thank you Laura! We enjoy having you in the studio and know you'll do great things."}, "gmap_id": "0x8862133f3db62217:0xed5e4dd047a46b20"}
{"user_id": "103047355424581508878", "name": "Bart Roegner", "time": 1626136203327, "rating": 5.0, "text": "Isaac is an excellent teacher. He approaches teaching martial arts with patience and dedication. I highly recommend trying Kenpo with MadCity.", "pics": null, "resp": {"time": 1626139160695, "text": "Thanks, Bart! We really enjoy teaching you and appreciate your dedication."}, "gmap_id": "0x8862133f3db62217:0xed5e4dd047a46b20"}
{"user_id": "107529617076208577491", "name": "Matthew Eady", "time": 1604596816606, "rating": 5.0, "text": "An amazing school that teaches a very effective system of self-defense.  Patient, caring instructors who take time to pay the necessary attention to each individual student.  Great for people of all ages and all levels of physical fitness.  I could not recommend a better Kenpo in the North Alabama area.", "pics": null, "resp": {"time": 1604601015859, "text": "Thanks, Matt! We really enjoy teaching you and love getting to share our art with this area."}, "gmap_id": "0x8862133f3db62217:0xed5e4dd047a46b20"}
{"user_id": "110646145441436298162", "name": "Randall Rivers", "time": 1601309518840, "rating": 5.0, "text": "Great experience.  I wanted personal training, not a big group.  They offer several different options so you can find the one that works for you.  Good central location, nice facility and friendly, experienced trainers. I really like their focus on practical self-defense.", "pics": null, "resp": {"time": 1601310257812, "text": "Thanks, Randall! We think you'll excel quickly in our private program. We can't wait to see your progress."}, "gmap_id": "0x8862133f3db62217:0xed5e4dd047a46b20"}
{"user_id": "113963061688585154564", "name": "Christopher Weaver", "time": 1615331608713, "rating": 5.0, "text": "Amazing place! The instructors are friendly and very detailed in what they reach you.", "pics": null, "resp": {"time": 1615334204302, "text": "Thanks Christopher! We're glad you're enjoying your training so far - we appreciate all the hard work you put in."}, "gmap_id": "0x8862133f3db62217:0xed5e4dd047a46b20"}
{"user_id": "114157347272356245455", "name": "Farida Rennie", "time": 1602706889412, "rating": 5.0, "text": "I just took my first self defense lesson and I absolutely loved it. I felt that the lesson was not only fun but also practical. I was able to get a good workout while leaving with skills and improving my balance. I've already signed up for my next session!", "pics": null, "resp": {"time": 1602708043656, "text": "Thanks, Farida!! We appreciate your desire to learn and can not wait to see your growth in Kenpo."}, "gmap_id": "0x8862133f3db62217:0xed5e4dd047a46b20"}
{"user_id": "109223999688970650636", "name": "Orrin Coufal", "time": 1625839002628, "rating": 5.0, "text": "Accidentally posted this review on my girlfriends account.\n\nCompleted my week trial yesterday. I went 3 out of 4 days and I would have done 4 of 4 but I was tied up on Wednesday. I took Taekwondo classes when I was younger and enjoyed it and I wanted to start now to get healthier and learn some discipline and self defense. I will be signing up next week for sure. The class is taken seriously yet it is fun and you are able to learn a lot. I’m looking forward to progressing with Brister’s Martial Arts.", "pics": null, "resp": null, "gmap_id": "0x886211839458cde3:0x6b30b9efb57072de"}
{"user_id": "109083124904355544033", "name": "justine ralston", "time": 1625838809443, "rating": 5.0, "text": "Completed my week trial yesterday. I went 3 out of 4 days and I would have done 4 of 4 but I was tied up on Wednesday. I took Taekwondo classes when I was younger and enjoyed it and I wanted to start now to get healthier and learn some discipline and self defense. I will be signing up next week for sure. The class is taken seriously yet it is fun and you are able to learn a lot. I’m looking forward to progressing with Brister’s Martial Arts.", "pics": null, "resp": null, "gmap_id": "0x886211839458cde3:0x6b30b9efb57072de"}
{"user_id": "111391950572199234148", "name": "David Luders", "time": 1567460148259, "rating": 5.0, "text": "What a great program, he is here to develop anyone who wants to accept the challenge. Great mentor for all who study under him.  Keep up the good work.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO17JhP3Zj4R3aR5UJ7eWIYj8EE0kphwvwRgA0D=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOidHrODksczKZDi6XHkrfqi3LLGniz27AnhMdQ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNvp8tDaz8a2bgtymXjnSTvVuno9tdB_b3rWjg-=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOP4neesO6EiTcthCz0me-FFaYvoaF1lHNdmjdQ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOc9YigmzM92HoSPsn5WKczbXOn-S8jU_rILe0D=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886211839458cde3:0x6b30b9efb57072de"}
{"user_id": "101924195274981128749", "name": "N L", "time": 1607267829069, "rating": 5.0, "text": "My little one has been going to Brister’s for a couple years now. I can not say enough positive things. They truly love these kids and what they do. They encourage a positive environment and ensure the best for all participants no matter what age and level.", "pics": null, "resp": {"time": 1607269609219, "text": "Thank you for everything.  We appreciate your support."}, "gmap_id": "0x886211839458cde3:0x6b30b9efb57072de"}
{"user_id": "110100227134190414032", "name": "Ryan Anderson", "time": 1614033987845, "rating": 5.0, "text": "Awesome instructors. They are very good with teaching and molding young students with discipline while still having a light atmosphere for the young ones", "pics": null, "resp": {"time": 1614295332681, "text": "Ryan, thank you for the kind words."}, "gmap_id": "0x886211839458cde3:0x6b30b9efb57072de"}
{"user_id": "102369636234449608066", "name": "Mark Ratliff", "time": 1607470748676, "rating": 5.0, "text": "The Brister’s are exceptional, kind people that care for their students.  Our son started in Tang Soo Do and tried many local martial arts facilities, they all pale in comparison to the level of instruction and education the students get at Brister’s Martial Arts Academy.  We now have our daughter receiving instruction as well, highly recommend them!", "pics": null, "resp": {"time": 1607556498711, "text": "Mark, we are glad that you are so satisfied with the program.  It's wonderful having you a part of our system."}, "gmap_id": "0x886211839458cde3:0x6b30b9efb57072de"}
{"user_id": "113101273926021140304", "name": "Addie Hamren", "time": 1607377704000, "rating": 5.0, "text": "Our kids have attended classes at BMAA for 4 years now. We like that our kids are learning self-defense, but it goes way beyond that. They're learning respect, discipline, self control and much more. We highly recommend the Brister's martial arts family!!", "pics": null, "resp": {"time": 1607381660265, "text": "Thank you, glad to know that they are learning."}, "gmap_id": "0x886211839458cde3:0x6b30b9efb57072de"}
{"user_id": "105207431985765302424", "name": "Liz S", "time": 1608566673682, "rating": 5.0, "text": "Brister’s Martial Arts Academy provides an excellent program of respect and integrity for Taekwondo. They do not require contracts which is amazing! They understand life happens sometimes. They understand some kids need to take the summer off.\nThey care and make you feel like family. Our son not only reached his goal of earning his black belt, but his work ethic, ability to accept admonition, to stand in front of peers for testing, and to listen to direction and correction improved 100%. Our daughter is now taking classes and our son (11years old) told us to not let her quit until she gets her black belt. That says a lot!\nEven though there are many TKD studios near us we drive 30 minutes to BMAA. We wouldn’t trade a single minute for a closer studio.", "pics": null, "resp": {"time": 1608570977135, "text": "Thanks you so much for your confidence in our program."}, "gmap_id": "0x886211839458cde3:0x6b30b9efb57072de"}
{"user_id": "106912157360017153924", "name": "Sarah Sandora", "time": 1607477038844, "rating": 5.0, "text": "Wonderful martial arts program! Truly care about their students and offer a personal and professional environment.", "pics": null, "resp": {"time": 1607556528513, "text": "Thanks for the kind words, we enjoy having the girls in class."}, "gmap_id": "0x886211839458cde3:0x6b30b9efb57072de"}
{"user_id": "118350409829772107252", "name": "SebCuber", "time": 1607372293411, "rating": 5.0, "text": "Great martial arts studio. Mr Brister is patient, knowledgeable and invested in his students. Mrs Brister makes us all feel like part of their family. I feel like the Taekwondo lessons have made my son more respectful and my daughter able to defend herself.  They are both very excited about the new things they are learning.  I was also very impressed with all the ways Mr. Brister came up with in order for us to stay safe and comfortable during these trying times.", "pics": null, "resp": {"time": 1607373743016, "text": "Thanks for the kindness, glad to know that we are making a difference."}, "gmap_id": "0x886211839458cde3:0x6b30b9efb57072de"}
{"user_id": "101005254594478732824", "name": "Ben Branham", "time": 1444185780965, "rating": 5.0, "text": "My family has been with Bristers Martial Arts for a year and a half.  My son (7 years old) enjoys the sport and the progressive challenges.  As a parent I also attend the school.  My favorite aspect is that I can take the classes with my son and the two of us can enjoy the sport together.  As a parent I also appreciate the lessons given to kids on how to welcome other kids, how to protect yourself from bullies, and how to protect yourself from an attack by a stranger.  Very good school, and very positive and respectful staff.", "pics": null, "resp": {"time": 1444220285808, "text": "Ben, Thanks for the kind words."}, "gmap_id": "0x886211839458cde3:0x6b30b9efb57072de"}
{"user_id": "105439651560039800126", "name": "John Sandora", "time": 1591141574682, "rating": 5.0, "text": "Great place for kids to learn the sport and self discipline", "pics": null, "resp": {"time": 1607269554407, "text": "Thank you for the kind words. We appreciate your support."}, "gmap_id": "0x886211839458cde3:0x6b30b9efb57072de"}
{"user_id": "111316125975198166084", "name": "Nina Soden", "time": 1444227332362, "rating": 5.0, "text": "Both of my kids attend martial arts classes at Brister's Martial Arts Academy. Their self confidence has improved and they take more pride in the things they can do on their own now. I'm very happy that my kids are enjoying their classes and having fun. My son says that he likes that the classes are challenging and he really likes how Mr. Brister helps them learn while having fun.", "pics": null, "resp": {"time": 1444231293092, "text": "Thanks Nina"}, "gmap_id": "0x886211839458cde3:0x6b30b9efb57072de"}
{"user_id": "112825162445065538192", "name": "John Sandora", "time": 1550616934179, "rating": 5.0, "text": "My elementary school age daughters have attended here for over a year and we highly rate both the quality of instruction and the educational environment at Brister’s Martial Arts", "pics": null, "resp": null, "gmap_id": "0x886211839458cde3:0x6b30b9efb57072de"}
{"user_id": "101836030391826499851", "name": "Josh Johnson", "time": 1446759417057, "rating": 5.0, "text": "My two sons and I have been attending Brister's Martial Art's for about a year and half. The family atmosphere makes for an easy environment to learn, ask questions, and feel safe. The instructors do a great job of teaching and working with the students, both young and old, on learning new techniqes and forms, why they are important and when to use them. We enjoy being a part of BMAA and look forward to being a part of the Academy for a long time to come!", "pics": null, "resp": {"time": 1446764175804, "text": "Thanks Josh for the great review!"}, "gmap_id": "0x886211839458cde3:0x6b30b9efb57072de"}
{"user_id": "104596104848584268768", "name": "Tony Wallace", "time": 1522379510536, "rating": 5.0, "text": "Awesome instructor. Great with young kids.", "pics": null, "resp": {"time": 1522432155775, "text": "Thanks Mr. Wallace"}, "gmap_id": "0x886211839458cde3:0x6b30b9efb57072de"}
{"user_id": "100842264521567348173", "name": "George Strickland", "time": 1412642044459, "rating": 5.0, "text": "Mr. Brister is an amazing instructor dedicated to the pursuit of excellence in each and every student!", "pics": null, "resp": {"time": 1473258823227, "text": "Thanks for the KIND WORDS!!"}, "gmap_id": "0x886211839458cde3:0x6b30b9efb57072de"}
{"user_id": "117966643045464477767", "name": "George Green", "time": 1609280661091, "rating": 5.0, "text": "I came over from England, and asked to join a session and absolutely loved the place. It has a fantastic atmosphere, lovely people, and has a warm family environment. Professor George, is friendly, and articulates drills & movements very well. I felt extremely welcome! unfortunately I was only able to train a month, and was incredibly sad to stop!\n\nI plan to return as soon as possible, it is a fantastic place.", "pics": null, "resp": {"time": 1609393275438, "text": "Looking forward to your return George!!!\n\nSee you soon!!!"}, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "108181608335289813046", "name": "John Willis", "time": 1602039553101, "rating": 5.0, "text": "This place has literally helped me change my life for the good. Mind body and soul are all worked on here. The Professor, George Wehby, is very skilled and knowledgeable and has helped guide me on the way to becoming the best version of myself!", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "104290684489297892170", "name": "Maria Gilbert", "time": 1469309402597, "rating": 5.0, "text": "Had a fantastic birthday party for Jack at Lionheart today. All the kids were engaged, busy, and loved the obstacle course. Thank you George, Dustin and J.D. for making this a fun event for everyone!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNqfM4eRr2I6UGg5PxG0rkxXIfS6ZY8FRZ5fHYm=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOwj4VkFix1-88HCQzZF8WdPUiz_6L845TEublU=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "106020725954275620872", "name": "John McLemore", "time": 1596902738190, "rating": 5.0, "text": "I've been a member of Lionheart for around 2 years now, and I can't say enough good about it. I've been around combat sports and martial arts for some time now, and Professor Wehby is by far the most superior instructor that I have had the pleasure of learning from.\nThe atmosphere that's been created at this academy allows beginners to learn without feeling uncomfortable while also pushing the  more advanced students to improve.\nAwesome place.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "117854971485866066388", "name": "Aaron Travis", "time": 1595691757677, "rating": 5.0, "text": "Great place with a great atmosphere.  George is truly passionate about the art and takes a principle approach to teaching.  Perfect environment for the beginner or advanced student.  Become a part of the Lion Heart family!", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "101886573294471056100", "name": "Matthew Denaburg", "time": 1602184167616, "rating": 5.0, "text": "This school provides the perfect blend of a fun, welcoming environment and quality instruction. I have trained in eight different styles at various locations over the past 21 years, and Professor Wehby is by far the most accommodating instructor I have ever had the pleasure of training under. Whether you’re an experienced grappler, a striker who struggles with grappling (like me), or new to martial arts all together, this is the place to be. I truly can’t speak highly enough of Professor Wehby and his academy.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "103178900164268678950", "name": "Kirk Knudsen", "time": 1595429610209, "rating": 5.0, "text": "Great family atmosphere, wonderful place to train.  Instructors teach the Jujitsu concepts like no where else I’ve been.  I’d give it ten stars if I could.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "112385525376590742634", "name": "jeremy giadrosich", "time": 1595456777738, "rating": 5.0, "text": "I am a new student and can't say enough good things about both the instructor(George Wehby) or the people/enviroment at this school. George and the class have welcomed me open arms and made my first uncomfortable classes of not knowing anyone both inviting and accepted. I look forward to every class I attend not for just the teaching but also the camaraderie.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "105942575142355293612", "name": "Randall Phillips", "time": 1595386572814, "rating": 5.0, "text": "George Wehby is a true jiu jitsu gentleman. I have had him down to my school in Auburn to teach a seminar and every student loved having him. He teaches  jiu jitsu concepts that have lasting impressions on students. His character and professionalism in the jiu jitsu community is unrivaled.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "100534784673471152872", "name": "MrRshirley4", "time": 1598234178412, "rating": 5.0, "text": "Good instruction in jiu jitsu and in our spiritual life also.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "102724745932866278002", "name": "chris elms", "time": 1566666156791, "rating": 5.0, "text": "Every single person there was very friendly and welcoming. They all came up, introduced themselves, shook my hand unprompted.\nGreat place to train.\nThey even had a blue belt that looked exactly like Brad Pitt with a beard named david.", "pics": null, "resp": {"time": 1566667684792, "text": "😂 @ Brad Pitt look alike\n\nGlad you had a great time.\nSorry I missed training with you."}, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "117233433322048451922", "name": "Jody V", "time": 1478751059651, "rating": 5.0, "text": "I walked into this gym to just check it out 1 day. I have no prior experience with any martial arts. I like the way George broke every move down step by step & explained why it was done this way. He makes sure all levels of experience are understanding each move. Great place. Very friendly environment from the time I walked through the door. Students & instructor are great. I've been to a few class now & can't wait to go to the next.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "112025566894159895513", "name": "Nathan Fisher", "time": 1565478915233, "rating": 5.0, "text": "My son and I have both been training under Professor Wehby for about 9 months. Not only have we improved our fitness, but BJJ challenges each of us every session. This allows us to grow together as we each walk our walk in the gym. The instruction is top notch and the culture of the gym is very welcoming and accepting. Please come out and join us!", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "106845757624994192712", "name": "Patrick Norman", "time": 1461040218589, "rating": 5.0, "text": "Hands down the best thing I've ever done for myself! George is a fantastic teacher and really knows how to help you as an individual. Most fun thing you can do to lose weight and learn a skill. It has helped change my life and it can definitely do the same for you!", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "112531383566222456489", "name": "Eddy Parsons", "time": 1468437336989, "rating": 5.0, "text": "My daughter and I trained with Coach George for about a year. We both really enjoyed it and I feel like he helped advance the skill level of both of us. I hope to be able to train with him more in the future.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "102939123891104856574", "name": "Austin Dobbs", "time": 1511931421224, "rating": 5.0, "text": "Going to Lionheart Academy is one of the best decisions I've made. Really good atmosphere, and a great coach! Its definitely worth looking into.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "105073071856461247977", "name": "Howard Kersh", "time": 1461278007788, "rating": 5.0, "text": "The Lion Heart Academy has a very welcoming atmosphere and the majority of the students are working professionals.  There is a good mix of male and female students as well as ages and experience levels. I am 42 years old and I am not the oldest or the youngest. The instructor (George) is one of the best BJJ teachers that I have ever trained with.  I travel all over the country for work so I say this having had the opportunity to train at many well-known BJJ schools.  The big difference with George is that he spends a lot of time covering the body mechanics of the technique.  This teaching style makes it very easy to adapt the techniques discussed in class to different scenarios.  The class sizes are small so there is a lot of individualized instruction.  My game has completely evolved since training there.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "103777319471303701820", "name": "Doug Smith", "time": 1461103279196, "rating": 5.0, "text": "Professor George is an experienced Jiu Jitsu black belt with  the heart of a teacher. Quite a bit of individualized instruction even in group class setting. Everyone is welcomed, and very diversified classes with different sexes, conditioning and experience allows everyone to learn at their own pace without intimidation. Professor George is the best I have trained with. The training facility is new and clean and the rates are very affordable.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "111666963606185507472", "name": "Ben Jackson", "time": 1461116951483, "rating": 5.0, "text": "George is hands down the best BJJ instructor around. His teaching style is straightforward and easily understood. All of the people at the gym are extremely welcoming and helpful.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "107397303564790513887", "name": "Josh Taylor", "time": 1539918537180, "rating": 5.0, "text": "George Wehby is one of the best in his craft of Jiu Jitsu! The lessons of character and discipline he has instilled in my son are priceless!!!", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "104054365753629255678", "name": "Kuni Scissum", "time": 1524690242300, "rating": 5.0, "text": "George Wehby is a great instructor with a wealth of knowledge in BJJ, and trains a great group of people that I've been fortunate enough to meet and roll with. Every day I walk in is a challenge to myself to learn, to train hard, and to look for ways to improve. Lion Heart Academy is the place to go to if you want to develop in Jiu-Jitsu and as person overall.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "117189871459397081732", "name": "Judy Gibb", "time": 1549076919863, "rating": 5.0, "text": "Don't know all that I should know about this faculty trying to get more info", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "105637432171083816712", "name": "Jennifer Kersh", "time": 1461419833612, "rating": 5.0, "text": "As a 40 year old woman who is not and has never been an athlete or sporty or even graceful, I am astonished at how much I enjoy learning a martial art, and specifically, training at the Lion Heart Academy.  I have never done anything like this in my life, even as a child, so it took me years to get up the courage to give this a try and now I sincerely regret not having embarked on this journey much earlier in my life.  Coach George has created an inviting atmosphere of learning, where being open, friendly and respectful is the norm.  He is an extremely good teacher who knows his stuff which is important to me - if I am going to invest in myself and invest in a new skill, I want to learn it correctly and trust that my teacher knows what he is talking about.  There are many schools of BJJ out there and they are not all created equal.  BJJ is an excellent activity for women, I have learned tricks for defending myself against larger men, I am improving my coordination and core strength and I have met new friends.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "102286971270201316398", "name": "Dustin Gilbert", "time": 1461383665773, "rating": 5.0, "text": "George at the Lion Heart Academy has had a profound effect on the way that I view and practice BJJ (Brazilian Jiu Jitsu). He is a gifted instructor, breaking the subject matter down into ideas and principles, instead of trying to have his students memorize dozens of techniques like the steps to an overly elaborate dance. Great for over 40, out of shape guys like me to get back into shape and have fun doing it. You won't find better martial arts instruction in the Birmingham, Hoover, and Alabama area!", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "116105036524558654876", "name": "William Boutwell", "time": 1462653282592, "rating": 5.0, "text": "Professor George Wehby is one of the most amazing instructors that I have met in my martial arts journey. His ability to understand and communicate the principles and concepts of Jiu Jitsu are unparalleled. If you are in the Birmingham area this is were you need to train. If you are not in the area make the drive. You will be glad you did.", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "102139492260978477404", "name": "Keith Wilson", "time": 1471712444211, "rating": 5.0, "text": "Awesome guy!!! Awesome place!!!!!", "pics": null, "resp": null, "gmap_id": "0x88893d4d79f08b5d:0x1474f17dfac31149"}
{"user_id": "104027806870290515098", "name": "frank baker", "time": 1489734611164, "rating": 5.0, "text": "Dynamic Krav Maga and Fitness is a great place to learn a very practical form of self defense. Every class teaches practical moves that could be used immediately if you were put into a bad situation. The owner, Marty, is a genuinely nice guy who has a passion for teaching self defense. The assistant instructors are very knowledgeable and most have a background in several different martial arts disciplines. The students in the classes are all very friendly and ages and genders vary. The fitness classes also give a great workout and will help you in getting fit for self defense. Overall I highly recommend Dynamic Krav Maga and Fitness. If you're interested in self defense, you can't go wrong with Krav Maga. If you're thinking about trying it, give Marty a call or text and he can set you up with a free class so you can see if it's for you.", "pics": null, "resp": null, "gmap_id": "0x88626f8abee8963f:0xfb07610e39438410"}
{"user_id": "117397638041801813841", "name": "Brenna Sullivan", "time": 1460249752491, "rating": 5.0, "text": "I really love this place. I've learned so much about self-defense, my over-all health has improved (fat lost, endurance and lean muscle gained), plus I have a lot of new friends. Marty, the owner, is a great guy and a great instructor. The other instructors are great as well.\n\n(Also, speaking from personal experience- this is a great place for super-out-of-shape recovering couch potatoes to start :p )", "pics": null, "resp": null, "gmap_id": "0x88626f8abee8963f:0xfb07610e39438410"}
{"user_id": "109256953018443662601", "name": "Neal Evans", "time": 1531247065057, "rating": 5.0, "text": "Matthew is a phenomenal Krav Maga coach and instructor. My sons, who are teenagers, and I started with Vindication last fall, and have been devoted apprentices ever since. You will find all levels of experience in the class: from beginners to students who have already achieved some level of certification in Krav Maga. Women, men, young, and older--all types are of folks are welcome. Matthew provides attention to individual students, while keeping the class challenging and fun for all. Vindication Krav Maga is indeed challenging, but offers great rewards for those who dare!", "pics": null, "resp": null, "gmap_id": "0x88891a6c517be76f:0xefabd491a4165485"}
{"user_id": "112932692952736298698", "name": "S ONeal", "time": 1506542808081, "rating": 5.0, "text": "Matthew Holder is passionate about Krav Maga and a thorough instructor. If you are interested in self defense and want someone who has the patience and knowledge to help meet your specific needs he's the instructor for you! I highly encourage women who lack defense skills to try some classes. Even a few classes could mean the difference between becoming a victim and going home safe.", "pics": null, "resp": null, "gmap_id": "0x88891a6c517be76f:0xefabd491a4165485"}
{"user_id": "117858606729746917091", "name": "Andrew Brown", "time": 1508351835943, "rating": 5.0, "text": "I would recommend trying Krav Maga training to just about anyone, including those without any prior self defense experience. started without any background and have been training for about 5 months, and my wife and teenage daughter have also trained for several months. Be prepared to be challenged, physically and mentally, but in a good way and in a safe container. This class is also very physical, so it will double for your movement and exercise needs. The first 2 classes are free...try it out!", "pics": null, "resp": null, "gmap_id": "0x88891a6c517be76f:0xefabd491a4165485"}
{"user_id": "103625045484908168022", "name": "Christopher Story", "time": 1531777395874, "rating": 5.0, "text": "Matthew Holder is an excellent instructor for both myself and my young daughter.  He is very patient and thourough particularly with my daughter.  He pushes his students to excel helping them to really get the best benefit from the sessions.\n\nI wholeheartedly recommend Vindication Krav Maga for anyone wanting to gain a very practical and effective self defense education for all ages..", "pics": null, "resp": null, "gmap_id": "0x88891a6c517be76f:0xefabd491a4165485"}
{"user_id": "106497653525649910319", "name": "Erik Whiting", "time": 1481307833640, "rating": 5.0, "text": "I feel like there's no better way to spend an hour twice a week than making sure that you're safe during the rest of the week. Matthew Holder at Warrior Krav Maga Birmingham AL is a great humble teacher. He has a lot to teach and classes are always full of useful material.\n\nHardest part is going. If you haven't gone yet, try it! He's still offering the first class free!", "pics": null, "resp": null, "gmap_id": "0x88891a6c517be76f:0xefabd491a4165485"}
{"user_id": "107217506419672952996", "name": "Sam Logue", "time": 1482514558381, "rating": 5.0, "text": "Matthew Holder at Warrior Krav Maga in Birmingham Alabama is an incredible instructor! He always helps me improve my form and I'm getting the most killer cardio workout I've ever had during each session. I highly recommend him if you're looking for self defense classes or even just to get some great exercise.", "pics": null, "resp": null, "gmap_id": "0x88891a6c517be76f:0xefabd491a4165485"}
{"user_id": "116042535254012782650", "name": "William Jenkins", "time": 1554601206720, "rating": 5.0, "text": "Was a great class and in many ways life changing for me, definitely worth giving it a try.", "pics": null, "resp": null, "gmap_id": "0x88891a6c517be76f:0xefabd491a4165485"}
{"user_id": "100307855372752491867", "name": "Nicholas Holder", "time": 1509994002908, "rating": 5.0, "text": "I really enjoyed the classes I took at this self defense school and I feel confident if anything were to happen I would know  how to handle the situation. I would definitely recommend this krav maga school to everyone. The instructor makes it easy to pick up on and understand  so you can progress really quickly", "pics": null, "resp": null, "gmap_id": "0x88891a6c517be76f:0xefabd491a4165485"}
{"user_id": "104962719048305525826", "name": "Shreyashi Ghosh", "time": 1624035165760, "rating": 5.0, "text": "My son has been associated with this since he was 4 years old and it has been one of the best journeys he have had so far (he is 7 now). They give each of the students personal attention and treat everyone as part of one big happy WorldClass family. My son enjoys it and so do we.", "pics": null, "resp": {"time": 1624106741486, "text": "We are proud to have the opportunity to be part of your son's journey! Thank you!"}, "gmap_id": "0x8889164994d549eb:0x6a362c0d1aa377dd"}
{"user_id": "110860379773260947182", "name": "Brenda Guerrero", "time": 1601782148722, "rating": 5.0, "text": "Every person here is as committed, friendly and professional as you would wish they could be. There is no most accurate description of the experience than being here as part of the big tae kwon do family that Master Scarsella and team have accomplished. Every person that I can name, will be exceptional, from desk to the mat, to mat and office. So happy to be here.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNTM57HLv1ZTnnboPi5dUWp11eB0lnYkFMUDnkr=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889164994d549eb:0x6a362c0d1aa377dd"}
{"user_id": "117690208567805968280", "name": "Jennifer Campbell", "time": 1624031346957, "rating": 5.0, "text": "We love Master Scarsella's World Class Tae Kwon Do!! My son has learned so much and absolutely loves going to class. The instructors are all wonderful and are very constructive in their teaching. I'm so glad we found Master Scarsella's!!", "pics": null, "resp": {"time": 1624041191499, "text": "Thank you! We are so glad to have your family part of our school!"}, "gmap_id": "0x8889164994d549eb:0x6a362c0d1aa377dd"}
{"user_id": "103868470619748563661", "name": "Rachel Petry", "time": 1621902763340, "rating": 5.0, "text": "We love MSWCTKD!!! We continue to have an excellent experience at this dojang. We have 2 kids that are students and the staff does a great job keeping them engaged and motivated.  I would highly recommend if you or your child are interested, try a class! You will not be disappointed by the customer service and atmosphere.", "pics": null, "resp": {"time": 1621903960247, "text": "Thank you Mrs. Petry! We are so glad you're part of our TKD family!"}, "gmap_id": "0x8889164994d549eb:0x6a362c0d1aa377dd"}
{"user_id": "107986587415469112098", "name": "Adrian Carraman", "time": 1590521038127, "rating": 5.0, "text": "I like the place ,very clean", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP9Gbkq1wmX1ABkSeX3W8jYZk_5A1xdvpu9RVy2=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889164994d549eb:0x6a362c0d1aa377dd"}
{"user_id": "116043469987633343533", "name": "Bri Pena", "time": 1623707117823, "rating": 5.0, "text": "My son takes Taekwondo here and they are awesome! They really take the time with each child to help them reach their individual goals.", "pics": null, "resp": {"time": 1623709947570, "text": "Thank you so much for the kind words! We are so happy you're part of our World Class Family!"}, "gmap_id": "0x8889164994d549eb:0x6a362c0d1aa377dd"}
{"user_id": "111167109163883178286", "name": "Gina Moncada", "time": 1624035762289, "rating": 5.0, "text": "Our experience with Master Scarsella Family is amazing ,we're love the instructors, they're always polite and committed with all the students.", "pics": null, "resp": {"time": 1624106780277, "text": "Thank you! Looking forward to seeing a Black Belt in your family in the future!"}, "gmap_id": "0x8889164994d549eb:0x6a362c0d1aa377dd"}
{"user_id": "101513928275164681453", "name": "Bryan on gaming", "time": 1607631859209, "rating": 5.0, "text": "Don't expect to have frown in your face in this place, I am one student from taekwondo and this place is amazing, they used to have a small area near Inverness plaza and they had grown since then, this place is for all ages and has a great team. Master Scarsella and his team are very nice and will help you, they offer a free 3 day class and they'll let you try out if you dicide if you want to join taekwondo. They also have events every month like taekwondo championships and movie night. I been both of them and is really fun. Children can go to movie nights without their parents but the instructors will supervise them and is really fun. The championship is for all ages and for all belts. They take place in a school other than theirs because it is small. They are socially distant and if you don't feel safe doing in person, you can do taekwondo in home on zoom. Can't give the zoom code meeting for reasons but if you join, they will tell you the meeting code and instructions. A fun way and also a dedication to protect your self while having fun altogether!", "pics": null, "resp": {"time": 1607972450114, "text": "Thank you for the great World Class review! - MSWCTKD"}, "gmap_id": "0x8889164994d549eb:0x6a362c0d1aa377dd"}
{"user_id": "117550390449760843597", "name": "Cheryl Ingram", "time": 1590090845077, "rating": 5.0, "text": "Our daughter has attended training at Master Scarsella's for over 6 years and has grown in leadership and confidence. We are so glad we found Master Scarsella's.", "pics": null, "resp": {"time": 1590094802826, "text": "Thank you! We love having the opportunity to see her grow!"}, "gmap_id": "0x8889164994d549eb:0x6a362c0d1aa377dd"}
{"user_id": "113183594193991632405", "name": "Jacqui Sweet", "time": 1592851891091, "rating": 5.0, "text": "Awesome with children and teaches them respect and discipline.", "pics": null, "resp": null, "gmap_id": "0x8889164994d549eb:0x6a362c0d1aa377dd"}
{"user_id": "112333434551215376865", "name": "Em M", "time": 1499105697953, "rating": 5.0, "text": "Great experience! Master Scarsella and his staff are friendly, knowledgeable, helpful, and positive! Terrific location and building is really nice too!", "pics": null, "resp": null, "gmap_id": "0x8889164994d549eb:0x6a362c0d1aa377dd"}
{"user_id": "109937759192642320128", "name": "jerry clements", "time": 1361248122351, "rating": 5.0, "text": "The instructors are world class and work extremely hard to teach the best martial art to any age, and most importantly make it as fun as possible at any age.", "pics": null, "resp": null, "gmap_id": "0x8889164994d549eb:0x6a362c0d1aa377dd"}
{"user_id": "110390704527208621829", "name": "Weldon Birdwell", "time": 1533989672361, "rating": 5.0, "text": "Such an amazing program. Cannot say enough good things about the staff!", "pics": null, "resp": null, "gmap_id": "0x8889164994d549eb:0x6a362c0d1aa377dd"}
{"user_id": "115403831914981806034", "name": "Mark Carlisle", "time": 1405959664473, "rating": 5.0, "text": "My son has been taking Tae Kwon Do from Master Scarsella for 5 years.  From the very beginning, the staff has made the classes fun and exciting for the kids.  This is still my son's favorite activity after 5 years solid of participation.  It has been great for teaching my son the discipline required to achieve various goals along the way.  I think it has been great for teaching respect, hard work, and even public performance and confidence!  I would recommend Master Scarsella to anyone who has a child who is interested in martial arts or even just a fun activity.  Just be careful, because they will likely not want to stop once they have started!", "pics": null, "resp": null, "gmap_id": "0x8889164994d549eb:0x6a362c0d1aa377dd"}
{"user_id": "115019255617592464163", "name": "Luis Resto", "time": 1552433412323, "rating": 5.0, "text": "Great place; awesome instructors.", "pics": null, "resp": null, "gmap_id": "0x8889164994d549eb:0x6a362c0d1aa377dd"}
{"user_id": "104660580828547408078", "name": "LIn Jo", "time": 1562930837749, "rating": 5.0, "text": "me go liek I go go go win for vicory royalw", "pics": null, "resp": null, "gmap_id": "0x8889164994d549eb:0x6a362c0d1aa377dd"}
{"user_id": "116277707632641903647", "name": "Rachel Ashcraft", "time": 1430511416210, "rating": 5.0, "text": "Great experience for my son!", "pics": null, "resp": null, "gmap_id": "0x8889164994d549eb:0x6a362c0d1aa377dd"}
