{"user_id": "116360763903501209036", "name": "Willie Kitchens", "time": 1605557704948, "rating": 5.0, "text": "These are very nice and honest people. A family owned company that takes care of their employers and customers.", "pics": null, "resp": null, "gmap_id": "0x888a47e179c25afb:0x4b8770ce1f4ff400"}
{"user_id": "108204809502468578802", "name": "Wendy Wallace", "time": 1451585148855, "rating": 1.0, "text": "Would love to say great service but unfortunately I never received their service. I called and setup service to pump out RV the week before Christmas and was told they'd be out the following week. I waited and never received a call or a visit. I called the next week and was told that he forgot to dispatch the information. I reiterated the need for the pumping as we had holiday guests and really who wants to ask their guests to do their business in the woods. I was told they would be out Thursday. On Wednesday my 13 year old and I put gravel going to the RV to make sure the truck wouldn't get stuck with heavy rains. Not exactly a fun chore. On Thursday I called to see when the service truck would arrive only to be told that it wouldn't be this week at all. I explained that this had inconvenienced me, 13 year old, and a 91 year old and I would like to know exactly when they will provide the service. Chad then proceeded to tell me essentially.....we were out of his way. At this point I've decided to go elsewhere. Horrible customer service, lack of concern, and apparently unable to show up. If your looking for someone to get the job done you might have to call someone else just like I have too.", "pics": null, "resp": null, "gmap_id": "0x888a47e179c25afb:0x4b8770ce1f4ff400"}
{"user_id": "100975769239787276051", "name": "Ann Ridgeway", "time": 1495658472690, "rating": 5.0, "text": "Timely, good service, good price. Hard working guys who did a good job. I would use them again.", "pics": null, "resp": null, "gmap_id": "0x888a47e179c25afb:0x4b8770ce1f4ff400"}
{"user_id": "112168306541679721205", "name": "Mary Suggs", "time": 1490211357208, "rating": 4.0, "text": "Justin came out and put in a tank and lines, broke my water and electrical lines to the pier, he repaired the water line at the time. He acknowledges he saw the electrical lines, but failed to repair. Abel Septic has sent 2 electricians out, but no repairs have been made. That was 11 months ago. Still waiting.... I will update review if repairs  are made....\n\nUPDATE... Justin called in late February and reported he didn't realize my electricity had not been restored. He sent electricians who actually repaired my electricity in about an hour.\nThank you Justin and Abel Septic", "pics": null, "resp": null, "gmap_id": "0x888a47e179c25afb:0x4b8770ce1f4ff400"}
{"user_id": "102709428013638951295", "name": "Clay ROUTON", "time": 1532412505942, "rating": 5.0, "text": "He is great guy and got a good company why all y’all hatin", "pics": null, "resp": null, "gmap_id": "0x888a47e179c25afb:0x4b8770ce1f4ff400"}
{"user_id": "106202922282019589564", "name": "Carolyn Pritts", "time": 1503101630916, "rating": 1.0, "text": "Well, I would love to be able to say i had good service but that would be a lie. I called on wednesday for porta potty cleaning. Was told they would have a guy out in my area on Friday. Which was great for me. The guy said he was driving and couldnt take my info at time. Said he would call when he got back to office. LATE that evening i called him back again to give him the info. Said they would call before they came out. So now its friday....i called to see if he could give me a estimated time he would be out. He said he would have to call his driver and would return my call. After setting at home all day waiting for his call or someone to show up, guess what...NOTHING! So i had my husband call him and he tells my husband \"oh all of my guys are gone home, it will be monday\". Which he was told from get go that it needed done by friday. So  i would consider this company to be unprofessional and would NOT recommend to anyone. If they didnt want to do it all they had to do was say so and i would not have wasted my time.", "pics": null, "resp": null, "gmap_id": "0x888a47e179c25afb:0x4b8770ce1f4ff400"}
{"user_id": "106588361019286746476", "name": "Robert Amaro", "time": 1597707739033, "rating": 5.0, "text": "I've used these folks twice now.  Two years ago, directly after purchasing a house that had sat dormant for 3+ years, the septic system decided to act up.  The Tice's came out late at night and found out that my tank was 100% overgrown with tree roots (reminded me of the scene in the Creep Show episode with the meteor).  They pumped down the tank immediately so that we could shower, and within a week they had come out and completely cleaned out the root system (chainsaw work INSIDE my tanks).  They did an amazing amount of work for a great price.  Yesterday, the old system started acting up again.  They came out first thing this morning so we could shower for work.  As we had suspected 2 years ago, the roots had gotten into the drain system as well. Absolutely amazing folks! Will always use them.", "pics": null, "resp": {"time": 1597804364349, "text": "Thank you Mr Amaro. See you soon."}, "gmap_id": "0x88896512f3750d81:0x1bb51a0a83c5bbf4"}
{"user_id": "109458967490625523050", "name": "James McElroy", "time": 1584845266392, "rating": 1.0, "text": "Charged to much and did not finish pumping tank showed up nearly full tank complained about how much it cost him to empty truck ,left yard trashy with gloves and cardboard paper, said they would come back and finish pumping.      All they did was just pump water 1/3 of tank out in tank never came back would not recommend con artist. Tank was still 2/3 full call (Newell tank service they pumped out rest for a lot less than these would and was very professional)", "pics": null, "resp": {"time": 1590309323585, "text": "As I recall and I remember this night very well. We came out to your house and you had only dug up one side of your tank (1 lid) and you had another lid broken. We pumped all we could out bc we couldnt get to the other side that was not uncovered. We flushed out your field lines going back 125 ft bc they were stopped up and we were trying to save the lines for you bc you didnt have the $$ to upgrade your tank. He stayed out there with his HEAD down in your tank trying to help you out. Again, bc you didnt have the $ to upgrade he was going to go as far as bring you a concrete lid of ours to put on your tank in place of your broken lid. You talked to him the next day and he told you that he would come back out there and finish pumping the tank if you got it all uncovered and bring you another concrete lid with no charge. So that is why your tank did not get fully pumped out that night at 11pm."}, "gmap_id": "0x88896512f3750d81:0x1bb51a0a83c5bbf4"}
{"user_id": "105267892426680180346", "name": "wanda mccombs", "time": 1595352585426, "rating": 1.0, "text": "I definitely would not recommended Jim Rice or his daughter they have no jefferson County license will take your money and leave with out finishing they charged 1248.00 to just cleaned out septic tank and then started telling me I need to upgrade said I had no field lines which was grap said he needed 4000.00 up front total price 6800.00 well came 2 times at night digging my yard in meantime messing my yard up with bobcat well 23 of January got a code violation from Leeds had no permit well he took the bobcat and left leaving my holes a mess . legal aid Merkei Wright has done nothing they did a invoice stated what they have done which was out right lie charged 2 times stated cleaned and pumped tank . there price is so jacked up too people do not use them", "pics": null, "resp": {"time": 1595354285961, "text": "Lets be clear Ms McCombs. Jim worked under your house for 6.5 hours to unstop the pipes under your house and he laid in YOUR raw sewage to unstop your pipes. We have an Alabama State license and County License. We sent you a check back to refund your money bc of all the problems you have caused us. There was nothing we could do at the time bc the WHOLE COUNTRY was shut down during COVID-19 pandemic. You were not patient with us and would not give the country time to get back to normal. BUT Jim was all great and wonderful when he came out to YOUR HOUSE in the middle of the night to unstop your house so you could go to the bathroom.. HE WAS ALL GREAT AND WONDERFUL THEN."}, "gmap_id": "0x88896512f3750d81:0x1bb51a0a83c5bbf4"}
{"user_id": "104998209264057543495", "name": "Emery Piper", "time": 1573459559402, "rating": 1.0, "text": "This company is very untruthful. Please make sure you have an understanding about the price before they come. They seem to twist prices around where you think your getting one price but you get another. They may tell you no service fee or no disposal fee. Then charge you.  There work is good. But be careful you may paydouble what you expect.", "pics": null, "resp": null, "gmap_id": "0x88896512f3750d81:0x1bb51a0a83c5bbf4"}
{"user_id": "112547734298455193435", "name": "Wendi Phillips Lawley", "time": 1568443071354, "rating": 5.0, "text": "Called them on Tuesday and he came out that evening so I could expedite my closing on my house. Professional and efficient, did a wonderful job. I would definitely recommend!", "pics": null, "resp": {"time": 1568601880655, "text": "Thank you Wendi. We greatly appreciate you."}, "gmap_id": "0x88896512f3750d81:0x1bb51a0a83c5bbf4"}
{"user_id": "110481825621269420285", "name": "Wallace Ragsdale", "time": 1579703635281, "rating": 5.0, "text": "They didn't leave until my system was working and fixed.  Showed up same day,  on time.  Thank y'all for great service!  Will choose again!", "pics": null, "resp": {"time": 1579709532490, "text": "Thank you so much. We greatly appreciate your business."}, "gmap_id": "0x88896512f3750d81:0x1bb51a0a83c5bbf4"}
{"user_id": "112767189803217868600", "name": "Wanda Mcombs", "time": 1594139353955, "rating": 1.0, "text": "This company  is a RIP off, charge me 1248.00 to clean septic tank  then starting  claiming  I need an upgrade  and that I had no field lines  well I have live here 24 years , gave me a price of over 6,000.00 said he needed 4,000.00 up front well game over 2 times at night  digging  up yard  on 23 of January  got  a code violation  he didn't  have a permit  that night he pulled out  left my yard  a mess both front and back  with major holes,  can't  get him back come to find out  no Jefferson county license  either should  not even started  it , biggest  problem  and crook", "pics": null, "resp": null, "gmap_id": "0x88896512f3750d81:0x1bb51a0a83c5bbf4"}
{"user_id": "114793636630744703417", "name": "Brandy Stalls", "time": 1544147825707, "rating": 5.0, "text": "These guys where at our house within 3 hours of calling, they even beat me there from work! They made sure the job was complete and all was in working order before leaving. (They were personal and entertaining as well) AMAZING service, GREAT people!", "pics": null, "resp": {"time": 1546161609006, "text": "Thank you Brandy for the kind words. We strive for 100% customer satisfaction, and we are very happy when we achieve it.\nThanks again, Phaydra"}, "gmap_id": "0x88896512f3750d81:0x1bb51a0a83c5bbf4"}
{"user_id": "100926872477318953190", "name": "Cindy King", "time": 1616452046186, "rating": 5.0, "text": "They came out the next business day and were very professional and got the work done fast. Highly recommend.", "pics": null, "resp": {"time": 1616458003035, "text": "Thank! You. We do our best"}, "gmap_id": "0x8889ca3993a7cded:0xf87b9c4b61dcbad5"}
{"user_id": "103785793055546775989", "name": "Lindy Parsons", "time": 1578675890480, "rating": 5.0, "text": "Great service!  They showed up exactly when they said they would and had the job done in an hour. Very nice and helpful explaining our situation and giving some helpful advice. Thanks again for taking care of us in a thorough and timely manner", "pics": null, "resp": null, "gmap_id": "0x8889ca3993a7cded:0xf87b9c4b61dcbad5"}
{"user_id": "104371084870626615108", "name": "Emily Anne Jones", "time": 1564767125961, "rating": 5.0, "text": "These guys have been great! They really went above and beyond to help me troubleshoot and have even taken time after to help me with some more needs. Very kind and professional. Took the time to make sure the job was fully done right (we had a mess going on). Thanks so much guys!", "pics": null, "resp": null, "gmap_id": "0x8889ca3993a7cded:0xf87b9c4b61dcbad5"}
{"user_id": "116415037141763846226", "name": "Jimmy & Audrey Parker", "time": 1584801597409, "rating": 5.0, "text": "Quick, same-day service. The men did a great job. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x8889ca3993a7cded:0xf87b9c4b61dcbad5"}
{"user_id": "112237826035463310207", "name": "James Gormley", "time": 1574686113551, "rating": 5.0, "text": "This company really came through for me. Had a severely backed up septic tank. They came and worked past dark they fixed my problem in an hour that took me all day to try and fix. Honest respectful guys woul definitely call them again. Thanks jay and Jacob y'all saved my bacon. Happy holidays AAA", "pics": null, "resp": null, "gmap_id": "0x8889ca3993a7cded:0xf87b9c4b61dcbad5"}
{"user_id": "110130630439089785632", "name": "Sally Wilhite", "time": 1585934766209, "rating": 5.0, "text": "I'm so glad  I called  these guys.  They did  a great job, even found a problem with roots we didn't know  we had and fixed it. Very professional and sure would  recommend  them. They explained everything and offered options to prevent further problems.", "pics": null, "resp": null, "gmap_id": "0x8889ca3993a7cded:0xf87b9c4b61dcbad5"}
{"user_id": "116110655777506018266", "name": "Raymond Nichols", "time": 1531261963444, "rating": 5.0, "text": "Pumped out a 50 yr old septic system for the quoted price. Works perfectly now. I highly recommend using them.", "pics": null, "resp": null, "gmap_id": "0x8889ca3993a7cded:0xf87b9c4b61dcbad5"}
{"user_id": "109263037779135028625", "name": "Lisa Otts", "time": 1495230341477, "rating": 5.0, "text": "Wonderful service! Explained everything that they were doing and needing to do. Highly recommend for any septic services. Will definitely be using for any septic issues in the future.  Reasonably priced.", "pics": null, "resp": {"time": 1498595705707, "text": "Thank you for thanking the time to leave a review. We truly appreciate it."}, "gmap_id": "0x8889ca3993a7cded:0xf87b9c4b61dcbad5"}
{"user_id": "101302226828413381815", "name": "Samantha Knighten", "time": 1554215591788, "rating": 5.0, "text": "Did a great job . friendliest folks. They really helped us out getting it done so quickly.", "pics": null, "resp": {"time": 1554310716161, "text": "Thank you for the review. We try very hard to service you when you need us."}, "gmap_id": "0x8889ca3993a7cded:0xf87b9c4b61dcbad5"}
{"user_id": "115810519089118089749", "name": "Jeanette Speegle", "time": 1466113191389, "rating": 5.0, "text": "These guys were professional and great, they took care of our problem in a very timely manner. They were here when they told me they would be. I couldn't ask for better service. Highly recommend using them!", "pics": null, "resp": {"time": 1498595641287, "text": "Thank you for taking the time to leave your review. We truly appreciate it."}, "gmap_id": "0x8889ca3993a7cded:0xf87b9c4b61dcbad5"}
{"user_id": "101290677307158641927", "name": "Amy Black", "time": 1511984635569, "rating": 5.0, "text": "These guys were great! Fast service and the workers they sent out were extremely nice and helpful!", "pics": null, "resp": {"time": 1512663188773, "text": "Thank you may we try to be the best"}, "gmap_id": "0x8889ca3993a7cded:0xf87b9c4b61dcbad5"}
{"user_id": "107908464542396316799", "name": "Kirk Sloan", "time": 1540574685463, "rating": 5.0, "text": "On time, very courteous, worked quickly and was very professional.", "pics": null, "resp": {"time": 1540576167644, "text": "Thank you . We try hard."}, "gmap_id": "0x8889ca3993a7cded:0xf87b9c4b61dcbad5"}
{"user_id": "114357320937429485424", "name": "Christine Hardin", "time": 1483732655028, "rating": 5.0, "text": "These guys are awesome! I highly recommend using AAA.", "pics": null, "resp": {"time": 1498595580055, "text": "Thank you for taking the time to leave your review. We truly appreciate you."}, "gmap_id": "0x8889ca3993a7cded:0xf87b9c4b61dcbad5"}
{"user_id": "111671955271305159003", "name": "Brandon Dotson", "time": 1457723117972, "rating": 5.0, "text": "These guys did a fantastic job at a great price!! They even cleaned out the line coming from the house!", "pics": null, "resp": {"time": 1498595537417, "text": "Thank you for the review. We truly appreciate the opportunity to serve you."}, "gmap_id": "0x8889ca3993a7cded:0xf87b9c4b61dcbad5"}
{"user_id": "101938730886030278509", "name": "Manuel Valentino", "time": 1585180645096, "rating": 1.0, "text": "(Translated by Google) never returned my calls\n\n(Original)\nnunca devolvió mis llamadas", "pics": null, "resp": null, "gmap_id": "0x8889ca3993a7cded:0xf87b9c4b61dcbad5"}
