{"user_id": "105197761834799928790", "name": "The Healing Center Nevada", "time": 1501027300733, "rating": 1.0, "text": "Likes to LIE about value of cannabis\nLook like n a z i s too me at this pig shop", "pics": null, "resp": null, "gmap_id": "0x888c0255c6e50be9:0x3452233c89aadad2"}
{"user_id": "108840134226313748568", "name": "Luke Krause", "time": 1468188869805, "rating": 5.0, "text": "Excellent sheriff and deputies. They serve the county well.", "pics": null, "resp": null, "gmap_id": "0x888c0255c6e50be9:0x3452233c89aadad2"}
{"user_id": "112183544356782380867", "name": "Ashley Prime", "time": 1620843204652, "rating": 1.0, "text": "Nasty attitudes. Horrible! Would not recommend.", "pics": null, "resp": null, "gmap_id": "0x88904591d1f6641d:0xcae7780de81c3802"}
{"user_id": "104290236339221318874", "name": "collin keey Collin", "time": 1485472274873, "rating": 1.0, "text": "Aweful", "pics": null, "resp": null, "gmap_id": "0x88904591d1f6641d:0xcae7780de81c3802"}
{"user_id": "108544759362249658775", "name": "Roland Vance", "time": 1569684984824, "rating": 2.0, "text": "bad", "pics": null, "resp": null, "gmap_id": "0x88904591d1f6641d:0xcae7780de81c3802"}
{"user_id": "113141913876911031407", "name": "James Harrell", "time": 1614111451147, "rating": 1.0, "text": "I got pulled over going 44 in a 45 on Hand Ave. Deputy claimed I was in a school zone, but I was not. I even went back and rode past the spot 3-4 times to make sure and take pictures. There was no school zone anywhere near where I got pulled over. I was the only one out of hundreds who pleaded not guilty - so the judge made me wait until dead last, even after all the inmates (10 or 11pm). The cop did his routine with his lawyer about his speed gun maintenance etc. My turn, i admitted going 44mph..... in a 45. There is no school zone right before the court house. The judge knew I was right, they were all shocked, they knew I was right and they fd up, but judge found me guilty anyways. $633 ticket for doing 44 in a 45. My theory is the judge didnt want to call the cop a liar on the record - his past testimonies would be invalidated and his word would be tarnished. Plus... their image. The status quo. Etc. Anyways, Thanks a lot Baldwin County! (Class warfare)", "pics": null, "resp": null, "gmap_id": "0x889a0e0e626a188b:0x480b63da858e4e30"}
{"user_id": "114429042097496754686", "name": "Reece Palmer", "time": 1597683258030, "rating": 5.0, "text": "Deputy Corley pulled me over and while that might sound like the most terrifying thing you can think of, it was a great experience. I'm from out of state, Kentucky. Everyday you hear about officers abusing their power up to the point of killing citizens. I was initially scared but it ended up working out and my family and I were able to go and enjoy our vacation. I have nothing but good words for this department.", "pics": null, "resp": null, "gmap_id": "0x889a0e0e626a188b:0x480b63da858e4e30"}
{"user_id": "100374528576422089745", "name": "Alice Rives", "time": 1580235770876, "rating": 2.0, "text": "These sheriffs and correction officers are slow to care and even slower to process people.  Their attitude is you are not important. There is a process they follow and they do it ay their convenience.  If possible do not get arrested by these people.", "pics": null, "resp": null, "gmap_id": "0x889a0e0e626a188b:0x480b63da858e4e30"}
{"user_id": "116658192539177671952", "name": "Tammy Nance", "time": 1523360395249, "rating": 1.0, "text": "Deputy Paul likes torturing peaceful disabled people. And calling witnesses liars.\nI will just assume all Baldwin county deputies are trained cucks that are just as gay as deputy Paul and his \"boss\".\n\nFor your safety I suggest you do too.", "pics": null, "resp": null, "gmap_id": "0x889a0e0e626a188b:0x480b63da858e4e30"}
{"user_id": "108893011880937728793", "name": "David Rice", "time": 1544888489477, "rating": 5.0, "text": "Got a visit from a couple of deputies last night because some neighbors called to complain about us shooting in our back yard. They were very polite and informed us that because we live outside of city limits that we were well within our rights to shoot on our property. We had already stopped about an hour and a half before they showed up. I thanked them for checking on us because we could have been getting shot up ourselves.", "pics": null, "resp": null, "gmap_id": "0x889a0e0e626a188b:0x480b63da858e4e30"}
{"user_id": "113372664654031569921", "name": "SSRB Scott Bennett", "time": 1491173299944, "rating": 5.0, "text": "great department except they try to get as much as they can out of the people they pickup. Money wise on Fine's and they put ankle brace's on folk's even though the person being restrained from are in jail themselves they keep the monitor on you in there. But the person your wearing it because of is in jail in Daphne now. But I only know of this because I have 2 family nut's who do stupid S..t.  Baldwin county is a great department were fortunate to have such a good S department. There's going to be bad with the good and the good outways the bad. SRB69. 3-31-2017.", "pics": null, "resp": null, "gmap_id": "0x889a0e0e626a188b:0x480b63da858e4e30"}
{"user_id": "105004481171202666948", "name": "Jesus Christ", "time": 1532575093124, "rating": 5.0, "text": "Very professional and do a great job", "pics": null, "resp": null, "gmap_id": "0x889a0e0e626a188b:0x480b63da858e4e30"}
{"user_id": "102464136086531791697", "name": "life roller", "time": 1546143615704, "rating": 1.0, "text": "You really need to patrol the circle k it a meeting place for drug dealers I see it and been here for less then 10 hrs", "pics": null, "resp": null, "gmap_id": "0x889a0e0e626a188b:0x480b63da858e4e30"}
{"user_id": "115407482305327974384", "name": "Michelle England", "time": 1602235183578, "rating": 5.0, "text": "The sherrife told me if I pass out again he's gonna take my cloths and blanket and mattress.. That's the sheriff that runs the ward at night at the sherrifes dept.", "pics": null, "resp": null, "gmap_id": "0x8888e09d58f0df55:0x100872dc36180ef4"}
{"user_id": "108274014481696647009", "name": "Rod Cooper", "time": 1571243548140, "rating": 2.0, "text": "the email says to pick up permit so i drive all the way to bessemer and the clerk tells me they will mail it.👿👿.im started to think the clerks are just lazy because an associate of mine did the same thing at another office and he had his permit that day. i will no longer go to this  unprofessional performance failing location again..FIND PEOPLE WHO DON'T MIND WORKING.", "pics": null, "resp": null, "gmap_id": "0x8888e09d58f0df55:0x100872dc36180ef4"}
{"user_id": "115695639238700781512", "name": "Bowbee Outdoors", "time": 1545959355450, "rating": 1.0, "text": "Thug mentality. Never actually stopping true crime. Profile people regularly. Few locals near me like JC. They prosecute petty crimes for revenue and do nothing to keep areas safe. Maybe see an officer once every six months in my area. 8 houses in my area were robbed. They never showed up then but they always seem to show up for traffic violations and domestic calls. Again anything that's easy revenue they will be there. If it's at all a risk they are nowhere to be found. Only good officer iv encountered is officer Yarborough. He showed genuine dedication and a care for citizens.", "pics": null, "resp": null, "gmap_id": "0x8888e09d58f0df55:0x100872dc36180ef4"}
{"user_id": "108466176746116817441", "name": "Ronald Brown", "time": 1517007215049, "rating": 3.0, "text": "Nice", "pics": null, "resp": null, "gmap_id": "0x8888e09d58f0df55:0x100872dc36180ef4"}
{"user_id": "110683754565568457988", "name": "Tyler Montgomery", "time": 1629989395975, "rating": 1.0, "text": "The room service was not good, no video games or anything either. Would not recommend. I'd recommend a comfort Inn", "pics": null, "resp": null, "gmap_id": "0x888990a6209c9d79:0xb79233d7585f664"}
{"user_id": "114687328545517502782", "name": "Adam M", "time": 1629253500588, "rating": 5.0, "text": "Moon and the officers are the best he is great staying in the public eye addressing issues the public has and staying on top of things", "pics": null, "resp": null, "gmap_id": "0x888990a6209c9d79:0xb79233d7585f664"}
{"user_id": "111439523525761918820", "name": "The Binding of Bama", "time": 1627327638592, "rating": 1.0, "text": "Just seen the video of Cpl Gallow. Best case scenario this office has employed and promoted a man that doesn't know the very basics of the job he does. At worst he knew what he was saying was total bull.\nFor an officer of any rank to be so ignorant about ID laws is a concern, and to then appear to create a traffic stop out of thin air when he was frustrated that the driver knew he did not have to ID. He later admits he wanted the ID so that he could finger the guy was some future crime he imagines might happen and to top it all off he then walks into the simplest of traps by throwing out an unlawful order before leaving.", "pics": null, "resp": null, "gmap_id": "0x888990a6209c9d79:0xb79233d7585f664"}
{"user_id": "113197491789017795964", "name": "James CZ", "time": 1626971966528, "rating": 1.0, "text": "CPL. Gallow violates rights observed in the constitution and has shown a fundamental misunderstanding or blatantly lies about the interpretation of laws.", "pics": null, "resp": null, "gmap_id": "0x888990a6209c9d79:0xb79233d7585f664"}
{"user_id": "115170823119306279851", "name": "Robert Olgers", "time": 1627222662508, "rating": 5.0, "text": "Can't remember name but the officer that stayed with us while we waited with us till road side service came took our tire off and came back with the new one the officer stayed right behind my kids and grandkids and thank him is badge number is 141 ty you for all u did", "pics": null, "resp": null, "gmap_id": "0x888990a6209c9d79:0xb79233d7585f664"}
{"user_id": "115372099696104608232", "name": "Ewayne Austin", "time": 1615829883960, "rating": 1.0, "text": "Horrible food and service, beds are too small, rooms are tiny, and the entire place felt unsanitary. Mrs. Harp is the most unattractive human being I've ever met, and Econimus is a woodpecker pole.", "pics": null, "resp": null, "gmap_id": "0x888990a6209c9d79:0xb79233d7585f664"}
{"user_id": "108335410792380287281", "name": "Holly Jabali", "time": 1603392521002, "rating": 5.0, "text": "Had the opportunity to meet Tony Dodd, in regards to getting my late daughter's belongings. He was so attentive, humble, and helpful! He didn't rush me along, and spent the time going through all the evidence, just so I could get anything that was hers. He's a great man!", "pics": null, "resp": null, "gmap_id": "0x888990a6209c9d79:0xb79233d7585f664"}
{"user_id": "110275049460398262735", "name": "Mark Moon", "time": 1623957946494, "rating": 5.0, "text": "😁 Love my department", "pics": null, "resp": null, "gmap_id": "0x888990a6209c9d79:0xb79233d7585f664"}
{"user_id": "117616463369676726978", "name": "Elizabeth Childress", "time": 1514600501794, "rating": 1.0, "text": "I filed a report on 12/23/17, a serious crime. It has now been a week, a detective was just assigned to my case yesterday and still no one has contacted me. When I called to inquire I was told that they're busy with cases load and someone will be in touch with me soon. I guarantee you if the victim of the crime I reported was a deputy's child, a warrant would already be in ncic, yet here I sit, waiting for a phone call. This is ridiculous and disservice to the community. I am so disappointed, I know the sheriff's office is always slow to serve Hayden, but given the nature of this crime I truly believed there would be a sense of urgency. This is pathetic and has caused me great stress and a loss of respect for the department, I guess the citizens of Hayden just aren't important enough to serve promptly regardless of the seriousness of the situation.", "pics": null, "resp": null, "gmap_id": "0x888990a6209c9d79:0xb79233d7585f664"}
{"user_id": "112859952168120059496", "name": "Daniel Conniff", "time": 1480623878660, "rating": 5.0, "text": "Investigator Jeff Kirkland was very helpful and  patient. I appreciate the professionalism of all of the Deputies that were involved during a very difficult ordeal. They are all so respectful of the situation they attended to.", "pics": null, "resp": null, "gmap_id": "0x888990a6209c9d79:0xb79233d7585f664"}
{"user_id": "104017794118878473808", "name": "Anthony Cornelius", "time": 1513520018694, "rating": 4.0, "text": "Great place to live. Love our public servants.", "pics": null, "resp": null, "gmap_id": "0x888990a6209c9d79:0xb79233d7585f664"}
{"user_id": "107181264253508085528", "name": "Christian Dawson", "time": 1569093846220, "rating": 3.0, "text": "Never been and don't want to go", "pics": null, "resp": null, "gmap_id": "0x888990a6209c9d79:0xb79233d7585f664"}
{"user_id": "113269547724345391676", "name": "Paula Smith", "time": 1466170441253, "rating": 5.0, "text": "They are so nice and respectful.", "pics": null, "resp": null, "gmap_id": "0x888990a6209c9d79:0xb79233d7585f664"}
{"user_id": "109477120666920645869", "name": "angela colburn", "time": 1523682737600, "rating": 1.0, "text": "if i could give 0 stars i would   asked for assistance on getting my stuff back from our old roomates because they have an illegal gun and are scared to go get my stuff by myself and the police refused to help me.", "pics": null, "resp": null, "gmap_id": "0x888990a6209c9d79:0xb79233d7585f664"}
{"user_id": "107931922378043932328", "name": "Michael Grimm", "time": 1529147113683, "rating": 5.0, "text": "Excellent service and safety provided to the entire community.", "pics": null, "resp": null, "gmap_id": "0x888919c0364ada3f:0x647f5612adb7100c"}
{"user_id": "102558590222451784956", "name": "William Smith", "time": 1537964942026, "rating": 5.0, "text": "Its a Sheriff office but freindiest Deputies that are always ready to serve their community 👍", "pics": null, "resp": null, "gmap_id": "0x888dec5888c447d5:0x815993937a133a5b"}
{"user_id": "104456449030098999072", "name": "Yvette Shiver", "time": 1472715194811, "rating": 5.0, "text": "Best Sheriff's Department in Alabama.  Thank You. Sheriff Russell Thomas And To the Entire Department.  For keeping Pike County Safe..", "pics": null, "resp": null, "gmap_id": "0x888dec5888c447d5:0x815993937a133a5b"}
{"user_id": "100175924095218852348", "name": "Debbie Alford", "time": 1501826858776, "rating": 5.0, "text": "Quick to lend a helping hand....There when you need them! Honest...reliable and dependable!", "pics": null, "resp": null, "gmap_id": "0x888dec5888c447d5:0x815993937a133a5b"}
{"user_id": "104985689374967069561", "name": "Mary Hoppenbrouwer Lindsey", "time": 1562954151404, "rating": 5.0, "text": "They have always been there for us anytime we needed them.", "pics": null, "resp": null, "gmap_id": "0x888dec5888c447d5:0x815993937a133a5b"}
{"user_id": "115852293434368797613", "name": "TigerFury007", "time": 1616472271916, "rating": 1.0, "text": "Go in to get a simple pistol permit, lady behind the counter is very rude, very short with you and not very informative on anything that goes on there. Entire time your there they talk and treat you like a criminal or something just simply disrespectful and there very condescending and seem they always want to instigate stuff. I love and support law enforcement and this is sad to see.", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "108333285687161874316", "name": "Art Of Valor", "time": 1608184365216, "rating": 5.0, "text": "New Sheriff who's a good man and several new staff members. Kind, courteous and efficient! So glad to see this place improve dramatically. It's amazing what good leadership can do!", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "114821890412710344484", "name": "jennifer Gaylor", "time": 1580600514461, "rating": 1.0, "text": "I have called - left my name & number numerous times concerning a ROGUE jailer that is still there. Not heresay, I can & would prove it. But I can not get anyone to even return my call. Sad state of affairs.", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "113306748851935497946", "name": "Beavis Head", "time": 1546421386787, "rating": 1.0, "text": "What kind of sorry scumbag pockets money meant to feed people??? Does the sheriff running this place realize most people in jail have not been convicted of a crime and can not afford their bail? How many people are going to have to either get horribly ill from his jail or die before someone locks him up? Stuff like this is why the rest of the modern world looks at us like we are savages.", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "117811181679155903603", "name": "Cameron Ellison", "time": 1542049739174, "rating": 5.0, "text": "I had a truck stolen from North Gadsden. It was found in Georgia and Investigator Adam King worked with Adel Police Department and did a great job in recovering it.\n\nThanks\n\nCameron Ellison", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "103572600528244514112", "name": "Donna Garrett", "time": 1593098507622, "rating": 5.0, "text": "new sheriff doing great job", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "103224169940820492215", "name": "Bradley Swann", "time": 1535659382089, "rating": 1.0, "text": "Worst place ever. Roaches on the floors barely  even enough food to consider scraps. Severely under staffed . And all of them need more training . It's a joke fr.", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "101446980099384514200", "name": "Lindsey Casey", "time": 1524233257747, "rating": 1.0, "text": "I think its ridiculous how they run that show. Like having a 5 min window to be late for a visit that HAS to be scheduled by the inmate who may or may not even have the ability to write or call why should they suffer. Not everyone can work their schedule around such a meticulous time frame that your jail sets forth. I have a long way to travel. Here's a hint for backwoods law enforcement, maybe if you weren't so dang self righteous and would release some of your inmates on these petty crimes ya might not have more than you can handle. You treat ppl like animals and proud of it that's ridiculous. My dog eats more in scraps in a day than your inmates eat all week. Money hungry officials don't have a drop of concern or compassion. They don't even come close to meeting policy standards. They should be stripped of their rights and have to stay a week in their own filthy jail in order to accommodate inmates I feel that should be mandatory EVERYWHERE. Here's a thought ECDC, why don't you take some of that filthy profit that u make bank on from housing THOSE 3X OVER POPULATED ICE DETAINEES and come join us in the 21st century, at least adopt an online video visitation if you're going to proceed with such a demeaning visitation policy. As it is right now its simply a product of laziness and immobility. P.I.G.S. Public Imbeciles Gone Sh****", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "107026780753827009263", "name": "Brandi Roden", "time": 1547740936467, "rating": 1.0, "text": "Worst Sherriff’s Department ever! I know of at least two things they are doing illegally right now and I’m sure there are others. Very corrupt! And I’m not one to do negative reviews of places or even online reviews period. But this place is terrible and anyone I have gotten on the phone has a terrible attitude even when I am as polite as I can be.", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "100004970323579128041", "name": "Jonathan Burdette", "time": 1518030220360, "rating": 3.0, "text": "I went to the SAP program and I really owe MR  FEILDING AND BRYAN my life been clean since 2008 and was a heavy user tried to call and tell them I really glad that I meet them but had no luck.  Thanks guys.  Why 3 stars when I got hurt I did not get any help and know I am having to suffer the rest of my life because of it the nurses never called me in and checked me out I tried for months to get help and never get any very poor doctors and nursing staff.  Also had one good meal the 6 months I was there and that's because a news crew was coming in during lunch 😂  Wasn't beans and cabbage for lunch that day lol.", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "100845734352781801447", "name": "That dude 777", "time": 1563143537121, "rating": 1.0, "text": "Not much help and they all have a attitude problem. They treat everyone like a criminal.", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "109564533469768061446", "name": "nicawi46", "time": 1522462210698, "rating": 1.0, "text": "Even if an out-of-touch Alabama law makes it legal, it is still wrong. This sheriff lacks basic human decency and compassion. Drug treatments work, but most programs are vastly underfunded. It’s such a sad thing to see someone with power stigmatize people who already have it rough. Pig!", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "115775667651620516731", "name": "Miss La'Heaven Martin", "time": 1501067580027, "rating": 5.0, "text": "All police officer are not badd..My uncle served 28 years in the army and became a state enforcement officer..He is my hero, my father, my uncle, my protector but most of all he is my re model..my mentor..all above he who i praise with my heart n soul.....and i respect him", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOucYNo0LN4k6H5WS1ULXTQQP8DzRBTmYK-8aWb=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "112945851939455797517", "name": "michelle moye", "time": 1563850262090, "rating": 1.0, "text": "\"Lady\" and I us that term lightly,  that answered the phone was the most disrespectful person I have ever encountered.", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "115995521588068685011", "name": "Chandler Schneider", "time": 1591549330853, "rating": 1.0, "text": "The corruption and rudeness of this department are disgusting.", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "108078893417371163113", "name": "Roger Brooks", "time": 1498169759897, "rating": 5.0, "text": "Good people,friend and information technology,if you are honest nothing to worry about,,, not everyone is bad, keep 10 commandments and see,take your BIBLE with.", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "112870722552540478035", "name": "Oath Accountability Project", "time": 1519776752531, "rating": 1.0, "text": "Bunch of real jackboot thugs. The corrupt aherrif doesn't like anyone corroborating stories of his fraud. Shame on you sheriff. I hope you get cancer, a really bad kind. And I hope you need marijuana to treat and some cruel person keeps it from you.", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "107969841061117710983", "name": "Eric Hunter", "time": 1500767873359, "rating": 1.0, "text": "RACIST cops in uniform. It's only a matter of time before IA steps in an put a stop to these clowns terrorizing black communities. & believe me I WILL BE AROUND when it happens. Roaming the streets terrorizing good decent people who actually work for a living. Every Black American you pull over is NOT carrying a pistol nor is he/she a drug dealer. My suggestion to your backwood attitudes & small mind capacities you brought to our community would be \"terrorize some of those drug dealers you have paying you to look the other way\"& leave us working class law abiding citizens alone. What the community actually need to do is stand up an say enough is enough. Expose this department for what is actually taking place here in our community when we're in our homes in our beds asleep at night. Take it to the papers, TV news channels, an further. Use those smartphones when you're witnessing an officer out of line, i do.   #MAKEGADSDENGREATAGAIN", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "105831373611606449214", "name": "Zach Dygard", "time": 1521171969069, "rating": 1.0, "text": "Woowee. Corrupt sheriff uses $740,000 meant for inmates food for a fancy new \"beach house\"\n\nPoster boy for what is wrong with America. Greedy greedy corrupt cop.", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "106768589383264144915", "name": "Martin L", "time": 1520979995853, "rating": 1.0, "text": "Mr Todd Entrekin’s has no ethics to steal food funds for prisonners  provided by peoples taxes. He is a shame. And if it that was not enough he take revenge on a pot smoker for stooling him. What a low life. He is a model of american corruption. Legality without ethics.", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "117048070819954067888", "name": "Elizabeth Morgan", "time": 1550956782504, "rating": 1.0, "text": "Rude employees. Woman at counter had misspelled my last name and put wrong address on pistol permit.", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "115579065725514761513", "name": "Kenny Kuhner", "time": 1521895719078, "rating": 1.0, "text": "Starving the prisoners so you can get rich might not be technically illegal in Alabama but it is immoral as all get out. Do you go to Church, Sheriff?", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "102416822358992141745", "name": "Patrick Mortimer", "time": 1508811826777, "rating": 5.0, "text": "Friendly officers. Very helpful and courteous.", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "100102419613535049336", "name": "HotNoodleTruck", "time": 1521179173370, "rating": 1.0, "text": "The fact that you continue to employee people like Todd Entrekin says a lot about your county and its motives.  It's a disgrace to Americans and law enforcement everywhere, you should be ashamed.", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "111224593709951277066", "name": "Shelby Johnson", "time": 1535160597592, "rating": 1.0, "text": "If they had a half of a star I would have picked that image instead. this place is a total joke!", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "108657256763215888443", "name": "Rita Burns", "time": 1528155252695, "rating": 1.0, "text": "All active warrants should be posted on your website like Calhoun County Sheriff’s Office does!", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "110580418337192472514", "name": "Mindless", "time": 1519778912291, "rating": 1.0, "text": "They are corrupt, the Sheriff pockets money meant for prisoners food. These people are scum.", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "113304253396532630389", "name": "Ryan Bonds", "time": 1494468727521, "rating": 1.0, "text": "Officers often harass/beat the local population and abuse their badge. Specifically one officer Hammett. They are predators not law enforcement officers.", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "101958863843690824809", "name": "Michael Wizouski", "time": 1521158910979, "rating": 1.0, "text": "The sheriff is a lying con artist. He should be imprisoned and forced to eat peanut butter and jelly for the extent of his sentence for fraud and misallocation of public resources.", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "102675244558912535222", "name": "Stephen Aamodt", "time": 1532204975935, "rating": 1.0, "text": "Power hungry and controlling. Bad organization.", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "108593087180408928287", "name": "Katherine Jenkins", "time": 1521054302082, "rating": 1.0, "text": "Corrupt! Hope you all lose your jobs\nAnd you wonder why people hate cops when they can't stop stuffing there face with money no matter if it causes someone's else life in death or jail!", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "103701035016334815397", "name": "Tyler Michael", "time": 1536437886370, "rating": 1.0, "text": "Thank God the Sheriff wasn't reelected and is under investigation from the federal government. He's a bum!! Disgrace to law enforcement! But, can you really expect much more from Alabama?!", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "115455932635070117571", "name": "Eric Easterly", "time": 1520954417382, "rating": 1.0, "text": "Run by a Sheriff who loves to abuse his power and steal money, $750,000, from the people. Kick him out or take him out, either works for me", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "100635277155918049679", "name": "Sean Smith", "time": 1519774815893, "rating": 1.0, "text": "Public corruption, and trumped up charges for shame sheriff", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "106700771896754320334", "name": "L B", "time": 1521234670611, "rating": 1.0, "text": "The Etowah County Sheriff's Office is no better than the Manitowoc County Sheriff's Office.", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "113456769653359874527", "name": "Kyle Trotman", "time": 1521063649770, "rating": 1.0, "text": "Corrupt tyrants, what else is left to say...", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "109186058063088967647", "name": "Elizabeth Vasquez", "time": 1520989848434, "rating": 1.0, "text": "Racist trash", "pics": null, "resp": null, "gmap_id": "0x888a3c1df8861b83:0x91fcea188b32ddfc"}
{"user_id": "108218729260507960935", "name": "Timothy Neville", "time": 1627499751201, "rating": 5.0, "text": "Came today to apply for a pistol permit, thanks to the knowledgeable and kind staff I was able to apply. I noticed another reviewer making claims that his ethnicity caused him to be refused service, these claims are false and I believe he failed to follow protocol in applying.", "pics": null, "resp": null, "gmap_id": "0x88891b9a5dcf1229:0x84c17683954f5d1f"}
{"user_id": "114885415832436591264", "name": "Brandon Smith", "time": 1623182537476, "rating": 1.0, "text": "Terrible customer service, on par for this being both Alabama And a police department 😒", "pics": null, "resp": null, "gmap_id": "0x88891b9a5dcf1229:0x84c17683954f5d1f"}
{"user_id": "107364717867735427538", "name": "Derrick Mcbride", "time": 1610135193652, "rating": 5.0, "text": "Outstanding Rank 1 st in Birmingham Alabama and public relations and high School organizations", "pics": null, "resp": null, "gmap_id": "0x88891b9a5dcf1229:0x84c17683954f5d1f"}
{"user_id": "111820020109150997628", "name": "Traci Jackson", "time": 1574306798301, "rating": 5.0, "text": "My car stopped in an intersection downtown.  I think my alternator died....in the worse possible spot.  I sat there for 15 minutes at least waiting for a tow truck.  Finally an angel disgusted as a Sheriff asked if I could put the car in neutral so he could push it out of the way.  I put it in neutral and he pushed.....and pushed.....and pushed further than he planned because I could not follow simple directions.  😊  He got me out of traffic and into a safe place to wait for my tow.  I want to say THANK YOU so much for going above and beyond.  I regret not getting a name or a picture, he DESERVED to be acknowledged.  I hope this message reaches him.  My appreciation is beyond words.  ❤❤❤❤", "pics": null, "resp": null, "gmap_id": "0x88891b9a5dcf1229:0x84c17683954f5d1f"}
{"user_id": "114261889052281660355", "name": "Jason Guin", "time": 1588697269360, "rating": 1.0, "text": "All I wanted was to get my pistol permit but the lady behind the desk refused to accept my application. Then when I tried to bring it up to whoever is in charge, I hear them talking about how young I look and that I am a white male they don’t know if they can accept my application. Horrible and racist.", "pics": null, "resp": null, "gmap_id": "0x88891b9a5dcf1229:0x84c17683954f5d1f"}
{"user_id": "104816569941349270912", "name": "Daryl Isbell", "time": 1580236744408, "rating": 5.0, "text": "I would like to thank Sheriff Mark Pettway and the Jefferson County Live PD - SNET Team for visiting me at UAB Hospital at the Heart Transplant Intensive Care Unit. There visit and prayers lifted my spirits. I can't thank you enough. Thank you for your Service.", "pics": null, "resp": null, "gmap_id": "0x88891b9a5dcf1229:0x84c17683954f5d1f"}
{"user_id": "118291746541643410051", "name": "Lynda Giovino", "time": 1538068367239, "rating": 1.0, "text": "The inmates are treated sub-humanly. Sleeping on the floor, denied medical treatment for chronic, some life-threatening medical conditions.\nVisiting an inmate is near impossible. Video conference pads numbered 4, to more than 30 inmates. The noise level on both ends made communication almost impossible. One working phone for inmates to brawl over, regardless of seeking legal counsel or any other outside communication.\nJefferson County Sheriff's Department runs the jail like a zoo, a free-for-all regardless of the inmates' basic needs.\nJefferson County City Council and Mike Hale,Sheriff should be ashamed of the unnecessary hardship and cruelty inflicted upon the incarcerated.", "pics": null, "resp": null, "gmap_id": "0x88891b9a5dcf1229:0x84c17683954f5d1f"}
{"user_id": "113084996694674241163", "name": "Judah 144", "time": 1576293455447, "rating": 1.0, "text": "Response time is ridiculous I was on the phone for 49 mins before a deputy showed up....", "pics": null, "resp": null, "gmap_id": "0x88891b9a5dcf1229:0x84c17683954f5d1f"}
{"user_id": "108523393249880356979", "name": "Brian Williams", "time": 1453927494006, "rating": 1.0, "text": "The clerk informed to check back for approval in a month, but probably will take longer.   Absurd. Applicants should be vetted but this is excessive.   Although fees are very reasonable.", "pics": null, "resp": null, "gmap_id": "0x88891b9a5dcf1229:0x84c17683954f5d1f"}
{"user_id": "102274963850603434308", "name": "hilldwler 420", "time": 1478260891752, "rating": 5.0, "text": "Very friendly and helpful staff and fairly quick service . Better than going to the DMV.", "pics": null, "resp": null, "gmap_id": "0x88891b9a5dcf1229:0x84c17683954f5d1f"}
{"user_id": "101067982863222399976", "name": "Mrz Perry", "time": 1455047722375, "rating": 1.0, "text": "I know this isn't a place known for its customer service, but one would think that if you are a veteran training a new employee and you see the new employee is causing an hour delay due to not knowing the system and being old as dust, then as the vet one would think they would go ahead and take over to at least get the line down. Smdh. Online renewals from now on or else Jeffco needs to hire people not in their 90's to do a fast paced high demanding job.", "pics": null, "resp": null, "gmap_id": "0x88891b9a5dcf1229:0x84c17683954f5d1f"}
{"user_id": "111625764152107590895", "name": "James “XDMAN” Nicholas", "time": 1550476963172, "rating": 5.0, "text": "This is the main administration building for the Jefferson County Sheriff’s Dept. This is where you can go for all of your paperwork needs.", "pics": null, "resp": null, "gmap_id": "0x88891b9a5dcf1229:0x84c17683954f5d1f"}
{"user_id": "107494329353229301911", "name": "Oranjo from The block", "time": 1338572372825, "rating": 2.0, "text": "Be Line at the DMV.", "pics": null, "resp": null, "gmap_id": "0x88891b9a5dcf1229:0x84c17683954f5d1f"}
{"user_id": "112386767269735538734", "name": "James Rusnak", "time": 1583257744286, "rating": 5.0, "text": "to the officer TF-1 who pulled me over (the Canadian) on i20 near the Mississippi border at 12:00 am for following too closely behind a truck. Your partner was seemed disappointed you did not find anything in my car. After learning about civil asset forfeiture, my biggest fear was exactly this.  Thank you for not planting drugs in my car and being a professional good cop.", "pics": null, "resp": null, "gmap_id": "0x888602e8ca44ff9f:0xe9ad07ec2323c29e"}
{"user_id": "106621036431336371285", "name": "Mitchell Hartley", "time": 1577173010345, "rating": 1.0, "text": "Tried to report a crazed woman jumping in front of traffic at 1:30am on 69 and the dispatch officer basically blew me off, was rude, and hung up on me. Public safety must be at the low end of priority...", "pics": null, "resp": null, "gmap_id": "0x888602e8ca44ff9f:0xe9ad07ec2323c29e"}
{"user_id": "103346259606303922195", "name": "Sir Issaic Putin", "time": 1616541689844, "rating": 1.0, "text": "Denied me pistol permit renewal for a reason that is not listed in the law, super annoying\n\nEdit: I called back next day and they admitted I shouldn’t have been denied and issued one.", "pics": null, "resp": null, "gmap_id": "0x888602e8ca44ff9f:0xe9ad07ec2323c29e"}
{"user_id": "109223299009438982114", "name": "Michael Sherer", "time": 1504792648418, "rating": 5.0, "text": "Alarm was tripped at my house yesterday and it only took me 15 minutes to get home. By the time i got there, there was all ready an officer walking around the house making sure everything was o.k. I was impressed seeing how I live in the woods.Its good to know them guys are around when I cant be.", "pics": null, "resp": null, "gmap_id": "0x888602e8ca44ff9f:0xe9ad07ec2323c29e"}
{"user_id": "111630483201353315048", "name": "Carolyn Haines", "time": 1563803566351, "rating": 1.0, "text": "The sheriff's department needs to step up and charge the man who HUNG HIS DOG in a cage because neighborhood children tried to make the man give his dog water in record breaking heat. Charge him. Prosecute him. Do your job.", "pics": null, "resp": null, "gmap_id": "0x888602e8ca44ff9f:0xe9ad07ec2323c29e"}
{"user_id": "115734121951986674459", "name": "krystal ridenour", "time": 1511232622633, "rating": 5.0, "text": "Everyone was polite & made the overall whole process pleasant", "pics": null, "resp": null, "gmap_id": "0x888602e8ca44ff9f:0xe9ad07ec2323c29e"}
{"user_id": "115942614039092233236", "name": "Amanda Geezler", "time": 1523137787797, "rating": 5.0, "text": "They where vary helpful when i had trouble ......", "pics": null, "resp": null, "gmap_id": "0x888602e8ca44ff9f:0xe9ad07ec2323c29e"}
{"user_id": "117146342220943988671", "name": "Lucas “Lambreeezy” Lamb", "time": 1504283237082, "rating": 1.0, "text": "Called about a traffic incident, personnel that I spoke to were extremely rude and I was hung up on for asking a question.", "pics": null, "resp": null, "gmap_id": "0x888602e8ca44ff9f:0xe9ad07ec2323c29e"}
{"user_id": "115539630897770634605", "name": "Tish Hudson", "time": 1566331701584, "rating": 1.0, "text": "This place is a joke and a complete waste of my time. This jurisdiction should be ashamed of themselves.", "pics": null, "resp": null, "gmap_id": "0x8892466bbf400ba3:0x39231fa9cbab08a3"}
{"user_id": "115479747183607183621", "name": "Brandon York", "time": 1580490369283, "rating": 1.0, "text": "They never answer their phones. Like ever.", "pics": null, "resp": null, "gmap_id": "0x8892466bbf400ba3:0x39231fa9cbab08a3"}
