{"user_id": "108077579238692453446", "name": "Amy Bornstein", "time": 1623108791891, "rating": 5.0, "text": "I am a Artist, once a canvas has sold, it must be crated and shipped. The Owner by the name of Angeline and her staff are very helpful, patient, quick and very professional.\nI will be using them constantly from now on.\nIt’s peace of mind to know that my artwork will travel to its new home and arrive in perfect condition.\nThank you, MailPro!!👩‍🎨", "pics": null, "resp": {"time": 1623180808633, "text": "Thank you for the kind words! Always a pleasure to help our artists get their gorgeous art to where it's going!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "108953851903629446984", "name": "Missy Fantusi", "time": 1628421604821, "rating": 4.0, "text": "Nice greeting cards, last time I was there, I was waited on right away. That's great!!", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "112551252548474682989", "name": "Marsha Reynolds", "time": 1619026767954, "rating": 5.0, "text": "Most convenient mailing store I have ever been to. I am never going back to the post office. The service at MailPro is outstanding and the staff is extremely helpful and lovely. Will definitely be back again and again.", "pics": null, "resp": {"time": 1619092610963, "text": "Ooooh thank you for the 5 stars! And thank you for letting us help you! Always a pleasure to be of service to sweet folks like you!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "108194833469719585695", "name": "Steve Middlebrooks", "time": 1620943588421, "rating": 1.0, "text": "I went in to ship a golf club today at Mail pro in Owens crossroads Alabama. There was a lady in front of me that went in no mask on and the lady at the counter told her just to put her package over there. I came in with no mask on she told me to go back out and get a mask! Does she know the time it takes for Covid-19 to spread is it a short time or a long time? Apparently she works for the CDC and she knows all about it to discriminate against who wears a mask and who does not. If that service wasn't bad enough they charged me $51 to ship a golf club which normally would cost $39 anywhere else. Save your money save your time and save your humiliation Don't go here.", "pics": null, "resp": {"time": 1620961399940, "text": "Wow. Yes, two customers in a row walked right past our “masks required” sign that is posted on the door. The lady ahead of you could drop her prepaid off and go, you needed to be in the store longer. It would have been futile for her leave to get her mask and come back in - her task was complete.\n\nI’m sorry you feel humiliated by being asked to be compassionate to those around us that haven’t had their vaccination yet. We are still trying to follow the current CDC guidelines, they are on the CDC website if you need a refresher.\n\nAnd again, I’m sorry you felt the price to pack and ship your golf club was more than you wanted to pay. Generally the price for clubs to be packed and shipped runs between $25-$35. The weight, dimensions and destination for this particular package determined the options we gave you. We would have gladly handed it back to you if you had wanted, so you could “price shop” and maybe find an option that better suited your price range.\n\nAs always, you are welcome in our store in the future provided you can be considerate and compassionate to the other shoppers."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100916212036415759093", "name": "Kim Ringenbach (looneypumpkin)", "time": 1613569542336, "rating": 5.0, "text": "Mail Pro is the best place to ship from in Huntsville! The staff is super friendly and quick! I've never had an issue and the owner is the best!", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100916030163268426101", "name": "Garel 2008", "time": 1607049251654, "rating": 5.0, "text": "My wife sent an international mail to the Philippines with very important papers and very expensive. She had the wrong address on the package. She found out when she returned home, called them and they went through all the outgoing mail and found it and changed the address label in time. Great job! We will use MailPro again and with a great level of confidence.\n\nThanks! MailPro", "pics": null, "resp": {"time": 1607051157259, "text": "Aw! Thank you for the great review! Always happy to help, glad to get a package where it's supposed to go! Thanks for coming to see us!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100735917630884398660", "name": "D Gallagher", "time": 1622668226041, "rating": 1.0, "text": "Worthless.  Public notary doesn’t understand documents (questionable reading comprehension skills) and refused to accept any help (ie ignorant and stubborn).", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "112405032535452363722", "name": "Delilah Roberson", "time": 1618949027570, "rating": 1.0, "text": "Very rude and unprofessional simply because I asked for a tracking receipt.", "pics": null, "resp": {"time": 1619027075853, "text": "We have a sign on the door stating that a mask is required. You came in without a mask and we still served you. I'm sorry this was difficult for you, hope in the future you can find a place to return your prepaid drop offs that will be more to your liking."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "103643497643102984504", "name": "Peggy Coulter", "time": 1613505191333, "rating": 1.0, "text": "Closed office? What happened to \"the mail must go through\"? All roads clear here in Hampton Cove. Monday and Tuesday.", "pics": null, "resp": {"time": 1613506543842, "text": "Sorry we missed you. We were open Monday from 9 til around 1:30pm when the temperature dropped below freezing. My employees live over the mountain and I made the decision to remain closed today at 6:30 this morning when the news was reporting that schools, redstone and colleges were closed."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100256428479117552551", "name": "Jonathan Martinez", "time": 1610398309210, "rating": 5.0, "text": "Really efficient post office to drop or send mail. Hard workers and pleasant experience with customer service.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "114130145094223069253", "name": "Mary Marshall", "time": 1592581389539, "rating": 5.0, "text": "Always professional, friendly and knowledgeable about all methods of shipping. Very helpful and fun to chat with. My go-to place for shipping.", "pics": null, "resp": {"time": 1592591862288, "text": "Thank you for the sweet review!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100313294291552609460", "name": "Scotty Pate", "time": 1582242385133, "rating": 5.0, "text": "Fantastic business! I have shipped dozens of packages through them. Everything from legal papers to expensive fragile music instruments, and they have packaged and shipped everything perfectly. Love how convenient they are.", "pics": null, "resp": {"time": 1582322506908, "text": "Thank you so much for taking the time to write a review! It's pleasure to help you with all your tasks. Thank you for being a great customer!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116377114387881125250", "name": "Tee West", "time": 1575146678919, "rating": 1.0, "text": "Would give minus 5 stars if possible. Owner very rude!!!!!!!!!!!!!!!!!!!! A  package was processed couple months ago to Amazon from different person in store Today owner refused and said they DID NOT do the package before when in fact it was. Owner needs to learn how to actually run this store sufficiently. I'd been embarrassed to admit I was owner with that attitude. I just read your reply and trust me you were rude and have no intentions of ever doing service here again. That shows bad character on your part for reply such as that!!!!!!! What an arrogance!!!", "pics": null, "resp": {"time": 1575118391387, "text": "LOL!! Yes, I had the audacity to disagree with you... I'm sorry, you are simply mistaken. You chose the Amazon QR code that clearly states on your return for you to take the QR to branded UPS Store for them to scan.\n\nWe are MailPro, a UPS Authorized Shipping Outlet and can take Amazon returns with a UPS label when you choose \"UPS Dropoff\", our scanners can't scan UPS Store QR codes.\n\nLast time I'm sure we showed you how to cancel your return, and re-return it as a \"UPS Dropoff\" to process it for you. We do this approximately 20 times a day for all of our fabulous customers.\n\nI tried to show you how change your return but you were not receptive, choosing instead to be offended. Next time when you bring your QR code in - we'll be sure to walk you through each step so you can understand the process. Life is too short to go through it looking to be offended.."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "101165821461528592940", "name": "Christopher Coleman", "time": 1595596317473, "rating": 5.0, "text": "Great service and convenient location for mailing packages and returns to Amazon.", "pics": null, "resp": {"time": 1595614496284, "text": "Aw thanks! It's a pleasure to help!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "111275442294901164466", "name": "Erin Dwyer", "time": 1557851281853, "rating": 5.0, "text": "Fast, friendly, helpful - LOVE MailPro! I always bypass the Post Office for the ease and convenience of this local mailing center. They are the nicest and can't beat their amazing service!", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "118130912154506378661", "name": "Am C", "time": 1551548737108, "rating": 5.0, "text": "So helpful and friendly. Highly recommend this spot. Printed out my label and even supplied tape (both of which I forgot to bring). They took both of my packages (USPS and UPS)", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "110549728771214230733", "name": "Alta Finney", "time": 1533786437553, "rating": 5.0, "text": "We are here a couple times each month, and each time, we receive the most helpful service. It's so much easier to do business with people like these! They ask all the appropriate questions to ensure that my packages will arrive safely, and that is what good customer service is all about!", "pics": null, "resp": {"time": 1533833079754, "text": "Thank you for choosing us! It is our pleasure to help!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "112374901908076149586", "name": "Jose Vasquez", "time": 1545508604903, "rating": 5.0, "text": "This place may be tiny. This place may be hidden in the plaza. But ultimately this is the place one needs to go for all their shipping and printing needs. The staff 5/5. If customer service is key. Then they have the key to success.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOfL90X0oZ3lPYbsfNMC_H4tgUcKOfqyuFru2b9=w150-h150-k-no-p"]}], "resp": {"time": 1545679616684, "text": "Thank you for coming by and letting us help you with your project! Y'all were great!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "107940296177859176663", "name": "Rebekah Smith", "time": 1565538625407, "rating": 5.0, "text": "Convenient, friendly, and professional. They offer every service I need including notary and always find the best deals.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "109148092595887137192", "name": "Lacey House", "time": 1533419426999, "rating": 5.0, "text": "Fast service, friendly and professional staff, and many services available! I witnessed so many happy and satisfied customers while I was in today! I Definitely recommend this business for all your shipping, binding, and packaging needs! Their location is also very convenient! Thanks MailPro!", "pics": null, "resp": {"time": 1533420775509, "text": "Thank you! Your business is very much appreciated and please come again soon!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116662045511772687323", "name": "Richard McCollum", "time": 1573674839172, "rating": 1.0, "text": "They lost a FedEx package we sent. It has been a huge inconvenience for lots of people (and will continue to be for awhile). MailPro claims FedEx lost the package, but FedEx never scanned the package saying they picked it up, which leads me to believe MailPro lost it. FedEx claims MailPro lost it. Either way I really don't care, huge pain, never using the company again even though they are convenient.", "pics": null, "resp": {"time": 1573679750641, "text": "We are terribly sorry for your inconvenience. Your package did get picked up by FedEx, and we do have the manifest that the driver signed. It is rare that a package doesn't get scanned at the hub, but it does happen. We are sorry it happened to your package. All we can do is reimburse you for your shipping charge, which we have done."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "117940719761698850504", "name": "Rebecca Jensen", "time": 1552752934522, "rating": 1.0, "text": "I was in Mailpro yesterday. The lady with dark hair and bigger was ugly to me in front of customers. I was there before the lady she was waiting on and asked her a question. That’s when she got mad and said she was waiting on someone else. I then said that I was there first and she went off on me even pointing out that I had crossed the line when I parked. She gave me the email I needed to send my package with and really though t I would send package thru her after her behavior. I paid 11 cents and left. I will never go in that horrible store again.\n\nYour negative reply truly reflects the attitude you had toward me. Most reputable businesses try to correct the problem or apologize. They do not retaliate or make snarky comments.", "pics": null, "resp": {"time": 1552678459529, "text": "Every customer is important and appreciated in our store. But we do expect our customers to act with basic manners learned in kindergarten. You did enter the store first and began your Wayfair return on your phone at the counter. While you were being helped by Wayfair I began helping a customer that came in and was ready.\n\nYou interrupted this transaction to tell me to look for the Wayfair email. I explained to you that I was helping another customer and I would help you as soon as her transaction was completed. You said \"But I was here first!\" And I replied \"But you weren't ready.\" I was not unkind to you, I was not rude. I also mentioned that had parked diagonally in two spaces - to which you replied \"I've got a new car...\" Wow.\n\nI see you have sent four packages through us in the last two years. If you want to take you business elsewhere, that's your choice. Of course, you are still welcome continue to drop off your prepaid returns with us in the future."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "114185328257152977153", "name": "Robert Lee", "time": 1530048489816, "rating": 5.0, "text": "I'm literally in here all the time shipping random items or sending certified mail. The service is always great. Thanks for being awesome! I'm sure I'll see you sometime today to ship something else!", "pics": null, "resp": {"time": 1530049255315, "text": "Thank you! We strive to be of service, and appreciate your business!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "106582673482845655940", "name": "CurlyCutie", "time": 1533403156710, "rating": 1.0, "text": "My daughter and I just experienced the most horrendous display of racism and bigotry from the \"owner\" of this location that I have yet to encounter in this area.  I own a small business that I run out of my home in McMullen Cove (and yes, I do have a license with the City of Huntsville).  I mail packages on a daily basis.  Today, I missed my mail pick up and our local post office had already closed so we drove down to this store so that we could ensure our packages would go out today.  My 12 year old went in first and was refused service.  So, I then took the packages and went inside only to be told that, \"I don't receive anything from the Post Office for compensation and am not required to provide service to you.\"   I asked for her to put that in writing, she refused, spewed some other nastiness until 2 other individuals came in and I told her I would be reporting her to the proper authorities and I left.   As I type this, I am still shaken, that this kind of bigotry and hatred can still exist.  That people feel they have the right to treat others with such vile.  I will not be returning to this location ever and would strongly urge others to also find somewhere else to spend your hard earned money.", "pics": null, "resp": {"time": 1533411883334, "text": "Wow, I feel I have to respond to this - this goes beyond misleading and is simply a lie. There were others in the store that were witness to your extremely rude, and bullying behavior Saturday afternoon. I'm so sorry that we couldn't help you, and that you were not happy here. We really try hard to make every customers experience here a very good one. As I explained to you when you were here - your postal labels would not scan. I tried on both registers  - your labels were not clear enough to be scanned. You knew they were poor labels beforehand, because you were quick to *demand* that I type the numbers in and give you a receipt. I explained that we do not do this, as the post office may never scan and relabel them and we would be held responsible for shipments not delivered as the location that accepted them. I never refused to scan your items, I scanned them several times. I did refuse to give you a receipt for items that won't scan. Again, I'm sorry that you are not happy, but please don't make a racial issue out of a situation that race simply had no bearing. That is extremely sad. I do hope you find happiness wherever you find to drop off in the future."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "110073186716751295578", "name": "Judy Malone", "time": 1553216060550, "rating": 5.0, "text": "I'm in this store at least 3 times a week for something - they help me with everything. The Cove is lucky to have this little store, the workers are always knowledgeable, efficient, and cheerful. Thanks y'all! A+++++", "pics": null, "resp": {"time": 1553262273195, "text": "Thank you Judy! We love to make our customers happy."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "113120573937035350057", "name": "Gaybrielle Valverde", "time": 1561822588057, "rating": 5.0, "text": "I love how convenient this place is and I’ve never had a negative experience at this store.", "pics": null, "resp": {"time": 1561827258875, "text": "Well, the sweet people in this area, like you, make our job easy! Thank you so much for your kind review!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "112561891819366709974", "name": "Marie Channer", "time": 1533412424508, "rating": 5.0, "text": "LOVE! this store!  They are the go to place for my shipping.  They even mailed a grandfather clock....no problem they said.  Thank you MailPro!!!", "pics": null, "resp": {"time": 1533421262081, "text": "I remember the clock! Thank you for your business and the packing challenge!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "114939163847432919587", "name": "chris anderson", "time": 1547761319355, "rating": 3.0, "text": "The overall atmosphere isnt the same ,   I got some bad looks when I dropped off a return since I was only using the drop box and not paying to return through them", "pics": null, "resp": {"time": 1547760535442, "text": "I'm sorry to hear you feel this way. May I ask what we can do to improve your experience or correct the problem?"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "109908593061539807838", "name": "Britton Ethridge", "time": 1554480020942, "rating": 5.0, "text": "Went for help with a difficult Amazon return, & the very helpful staff worked with me to return the packages with no charge! Angeline was especially kind. Will be returning.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116360260574648898826", "name": "Joshua Magrath", "time": 1519421917819, "rating": 1.0, "text": "This place is over priced and lost their DHL access. In short the employee went through my package nosing around asking inappropriate questions. I have used them many times and always found this place over priced and unprofessional.", "pics": null, "resp": {"time": 1520622969300, "text": "Mr. Magrath, I’m sorry you felt unhappy with the quality of our service. Our records indicate that you’ve shipped two packages with us in as many years. One internationally, yes - we must ask questions about your shipment. “What are you sending? What is the value?” The details are required, not by us - but by international customs. We would absolutely not ask any “inappropriate” questions.\n\nLast week you came in and wanted to ship a box of “parts” and insure it. Yes, again, we need to know what you are sending and how much it’s worth. Not out of curiosity, but for insurance purposes. Again, not inappropriate questions. You were very vague about what it was - turned out to be paintball gun equipment, once we ascertained that it wasn’t firearm parts (we aren't licensed to send firearms or HAZMAT) and had no compressed cartridges included (HAZMAT) - we shipped it for you.\n\nYou seemed fine with the transaction at the time - I wish you had had the courage to complain in person instead of leaving a fully misleading review. Some people take these reviews seriously. Truth is, unhappy people write reviews, happy people come back (our customer count is up 30% since we bought the store in October) and we will continue to help our absolutely wonderful customers do what they are trying to do.\n\nOur staff has over 20 years collective experience in the packing and shipping industry. When you bring your items to us to ship, part of our service is ensuring that your item will make it to its destination in perfect shape. Sorry if you find this expertise “nosey”. Lol!\n\nWe are a DHL authorized shipping center, and we do accept pre-labeled DHL shipments at our location. We just don’t have enough demand for the service to print labels from our account."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "102206964601045706586", "name": "Wes Haley", "time": 1469547876625, "rating": 5.0, "text": "MailPro is the place to go when I need to ship a package. But it's also great for so many other things - notary services, live fingerprinting, moving supplies, copies, print jobs, etc.  - basically it's a one stop shop - convenient, courteous owners and employees, and fair prices.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "117402659533986240822", "name": "Brandon Stapler", "time": 1600542014438, "rating": 5.0, "text": "Awesome folks", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "109705648434260272701", "name": "Pat Carpenter", "time": 1489540471480, "rating": 5.0, "text": "Very convient. . Good service. Everything you need for mailing in one place.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116321132831559836704", "name": "Steve Vaughan", "time": 1596239345587, "rating": 1.0, "text": "They are very expensive.", "pics": null, "resp": {"time": 1596299738222, "text": "We don't have you in our records as a customer... Wrong store? Our prices are competitive with all the other pack and ship stores."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "103544018902048290752", "name": "Michael", "time": 1501897808239, "rating": 5.0, "text": "Good service. Quick.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100674572007366652313", "name": "Michele F", "time": 1565277290290, "rating": 5.0, "text": "We have never had anything but EXCELLENT service at this location", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116064553712770362564", "name": "David Farley", "time": 1553197171296, "rating": 5.0, "text": "Great staff, fast service.", "pics": null, "resp": {"time": 1553262186715, "text": "Thank you! We love to make our customers happy."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "103456385486869021430", "name": "Tns Wiley", "time": 1558554412993, "rating": 5.0, "text": "Wonderful speedy service!", "pics": null, "resp": {"time": 1558555792978, "text": "Thank you for coming in to see us!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "108077579238692453446", "name": "Amy Bornstein", "time": 1623108791891, "rating": 5.0, "text": "I am a Artist, once a canvas has sold, it must be crated and shipped. The Owner by the name of Angeline and her staff are very helpful, patient, quick and very professional.\nI will be using them constantly from now on.\nIt’s peace of mind to know that my artwork will travel to its new home and arrive in perfect condition.\nThank you, MailPro!!👩‍🎨", "pics": null, "resp": {"time": 1623180808633, "text": "Thank you for the kind words! Always a pleasure to help our artists get their gorgeous art to where it's going!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "108953851903629446984", "name": "Missy Fantusi", "time": 1628421604821, "rating": 4.0, "text": "Nice greeting cards, last time I was there, I was waited on right away. That's great!!", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "112551252548474682989", "name": "Marsha Reynolds", "time": 1619026767954, "rating": 5.0, "text": "Most convenient mailing store I have ever been to. I am never going back to the post office. The service at MailPro is outstanding and the staff is extremely helpful and lovely. Will definitely be back again and again.", "pics": null, "resp": {"time": 1619092610963, "text": "Ooooh thank you for the 5 stars! And thank you for letting us help you! Always a pleasure to be of service to sweet folks like you!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "108194833469719585695", "name": "Steve Middlebrooks", "time": 1620943588421, "rating": 1.0, "text": "I went in to ship a golf club today at Mail pro in Owens crossroads Alabama. There was a lady in front of me that went in no mask on and the lady at the counter told her just to put her package over there. I came in with no mask on she told me to go back out and get a mask! Does she know the time it takes for Covid-19 to spread is it a short time or a long time? Apparently she works for the CDC and she knows all about it to discriminate against who wears a mask and who does not. If that service wasn't bad enough they charged me $51 to ship a golf club which normally would cost $39 anywhere else. Save your money save your time and save your humiliation Don't go here.", "pics": null, "resp": {"time": 1620961399940, "text": "Wow. Yes, two customers in a row walked right past our “masks required” sign that is posted on the door. The lady ahead of you could drop her prepaid off and go, you needed to be in the store longer. It would have been futile for her leave to get her mask and come back in - her task was complete.\n\nI’m sorry you feel humiliated by being asked to be compassionate to those around us that haven’t had their vaccination yet. We are still trying to follow the current CDC guidelines, they are on the CDC website if you need a refresher.\n\nAnd again, I’m sorry you felt the price to pack and ship your golf club was more than you wanted to pay. Generally the price for clubs to be packed and shipped runs between $25-$35. The weight, dimensions and destination for this particular package determined the options we gave you. We would have gladly handed it back to you if you had wanted, so you could “price shop” and maybe find an option that better suited your price range.\n\nAs always, you are welcome in our store in the future provided you can be considerate and compassionate to the other shoppers."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100916212036415759093", "name": "Kim Ringenbach (looneypumpkin)", "time": 1613569542336, "rating": 5.0, "text": "Mail Pro is the best place to ship from in Huntsville! The staff is super friendly and quick! I've never had an issue and the owner is the best!", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100916030163268426101", "name": "Garel 2008", "time": 1607049251654, "rating": 5.0, "text": "My wife sent an international mail to the Philippines with very important papers and very expensive. She had the wrong address on the package. She found out when she returned home, called them and they went through all the outgoing mail and found it and changed the address label in time. Great job! We will use MailPro again and with a great level of confidence.\n\nThanks! MailPro", "pics": null, "resp": {"time": 1607051157259, "text": "Aw! Thank you for the great review! Always happy to help, glad to get a package where it's supposed to go! Thanks for coming to see us!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100735917630884398660", "name": "D Gallagher", "time": 1622668226041, "rating": 1.0, "text": "Worthless.  Public notary doesn’t understand documents (questionable reading comprehension skills) and refused to accept any help (ie ignorant and stubborn).", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "112405032535452363722", "name": "Delilah Roberson", "time": 1618949027570, "rating": 1.0, "text": "Very rude and unprofessional simply because I asked for a tracking receipt.", "pics": null, "resp": {"time": 1619027075853, "text": "We have a sign on the door stating that a mask is required. You came in without a mask and we still served you. I'm sorry this was difficult for you, hope in the future you can find a place to return your prepaid drop offs that will be more to your liking."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "103643497643102984504", "name": "Peggy Coulter", "time": 1613505191333, "rating": 1.0, "text": "Closed office? What happened to \"the mail must go through\"? All roads clear here in Hampton Cove. Monday and Tuesday.", "pics": null, "resp": {"time": 1613506543842, "text": "Sorry we missed you. We were open Monday from 9 til around 1:30pm when the temperature dropped below freezing. My employees live over the mountain and I made the decision to remain closed today at 6:30 this morning when the news was reporting that schools, redstone and colleges were closed."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100256428479117552551", "name": "Jonathan Martinez", "time": 1610398309210, "rating": 5.0, "text": "Really efficient post office to drop or send mail. Hard workers and pleasant experience with customer service.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "114130145094223069253", "name": "Mary Marshall", "time": 1592581389539, "rating": 5.0, "text": "Always professional, friendly and knowledgeable about all methods of shipping. Very helpful and fun to chat with. My go-to place for shipping.", "pics": null, "resp": {"time": 1592591862288, "text": "Thank you for the sweet review!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100313294291552609460", "name": "Scotty Pate", "time": 1582242385133, "rating": 5.0, "text": "Fantastic business! I have shipped dozens of packages through them. Everything from legal papers to expensive fragile music instruments, and they have packaged and shipped everything perfectly. Love how convenient they are.", "pics": null, "resp": {"time": 1582322506908, "text": "Thank you so much for taking the time to write a review! It's pleasure to help you with all your tasks. Thank you for being a great customer!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116377114387881125250", "name": "Tee West", "time": 1575146678919, "rating": 1.0, "text": "Would give minus 5 stars if possible. Owner very rude!!!!!!!!!!!!!!!!!!!! A  package was processed couple months ago to Amazon from different person in store Today owner refused and said they DID NOT do the package before when in fact it was. Owner needs to learn how to actually run this store sufficiently. I'd been embarrassed to admit I was owner with that attitude. I just read your reply and trust me you were rude and have no intentions of ever doing service here again. That shows bad character on your part for reply such as that!!!!!!! What an arrogance!!!", "pics": null, "resp": {"time": 1575118391387, "text": "LOL!! Yes, I had the audacity to disagree with you... I'm sorry, you are simply mistaken. You chose the Amazon QR code that clearly states on your return for you to take the QR to branded UPS Store for them to scan.\n\nWe are MailPro, a UPS Authorized Shipping Outlet and can take Amazon returns with a UPS label when you choose \"UPS Dropoff\", our scanners can't scan UPS Store QR codes.\n\nLast time I'm sure we showed you how to cancel your return, and re-return it as a \"UPS Dropoff\" to process it for you. We do this approximately 20 times a day for all of our fabulous customers.\n\nI tried to show you how change your return but you were not receptive, choosing instead to be offended. Next time when you bring your QR code in - we'll be sure to walk you through each step so you can understand the process. Life is too short to go through it looking to be offended.."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "101165821461528592940", "name": "Christopher Coleman", "time": 1595596317473, "rating": 5.0, "text": "Great service and convenient location for mailing packages and returns to Amazon.", "pics": null, "resp": {"time": 1595614496284, "text": "Aw thanks! It's a pleasure to help!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "111275442294901164466", "name": "Erin Dwyer", "time": 1557851281853, "rating": 5.0, "text": "Fast, friendly, helpful - LOVE MailPro! I always bypass the Post Office for the ease and convenience of this local mailing center. They are the nicest and can't beat their amazing service!", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "118130912154506378661", "name": "Am C", "time": 1551548737108, "rating": 5.0, "text": "So helpful and friendly. Highly recommend this spot. Printed out my label and even supplied tape (both of which I forgot to bring). They took both of my packages (USPS and UPS)", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "110549728771214230733", "name": "Alta Finney", "time": 1533786437553, "rating": 5.0, "text": "We are here a couple times each month, and each time, we receive the most helpful service. It's so much easier to do business with people like these! They ask all the appropriate questions to ensure that my packages will arrive safely, and that is what good customer service is all about!", "pics": null, "resp": {"time": 1533833079754, "text": "Thank you for choosing us! It is our pleasure to help!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "112374901908076149586", "name": "Jose Vasquez", "time": 1545508604903, "rating": 5.0, "text": "This place may be tiny. This place may be hidden in the plaza. But ultimately this is the place one needs to go for all their shipping and printing needs. The staff 5/5. If customer service is key. Then they have the key to success.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOfL90X0oZ3lPYbsfNMC_H4tgUcKOfqyuFru2b9=w150-h150-k-no-p"]}], "resp": {"time": 1545679616684, "text": "Thank you for coming by and letting us help you with your project! Y'all were great!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "107940296177859176663", "name": "Rebekah Smith", "time": 1565538625407, "rating": 5.0, "text": "Convenient, friendly, and professional. They offer every service I need including notary and always find the best deals.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "109148092595887137192", "name": "Lacey House", "time": 1533419426999, "rating": 5.0, "text": "Fast service, friendly and professional staff, and many services available! I witnessed so many happy and satisfied customers while I was in today! I Definitely recommend this business for all your shipping, binding, and packaging needs! Their location is also very convenient! Thanks MailPro!", "pics": null, "resp": {"time": 1533420775509, "text": "Thank you! Your business is very much appreciated and please come again soon!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116662045511772687323", "name": "Richard McCollum", "time": 1573674839172, "rating": 1.0, "text": "They lost a FedEx package we sent. It has been a huge inconvenience for lots of people (and will continue to be for awhile). MailPro claims FedEx lost the package, but FedEx never scanned the package saying they picked it up, which leads me to believe MailPro lost it. FedEx claims MailPro lost it. Either way I really don't care, huge pain, never using the company again even though they are convenient.", "pics": null, "resp": {"time": 1573679750641, "text": "We are terribly sorry for your inconvenience. Your package did get picked up by FedEx, and we do have the manifest that the driver signed. It is rare that a package doesn't get scanned at the hub, but it does happen. We are sorry it happened to your package. All we can do is reimburse you for your shipping charge, which we have done."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "117940719761698850504", "name": "Rebecca Jensen", "time": 1552752934522, "rating": 1.0, "text": "I was in Mailpro yesterday. The lady with dark hair and bigger was ugly to me in front of customers. I was there before the lady she was waiting on and asked her a question. That’s when she got mad and said she was waiting on someone else. I then said that I was there first and she went off on me even pointing out that I had crossed the line when I parked. She gave me the email I needed to send my package with and really though t I would send package thru her after her behavior. I paid 11 cents and left. I will never go in that horrible store again.\n\nYour negative reply truly reflects the attitude you had toward me. Most reputable businesses try to correct the problem or apologize. They do not retaliate or make snarky comments.", "pics": null, "resp": {"time": 1552678459529, "text": "Every customer is important and appreciated in our store. But we do expect our customers to act with basic manners learned in kindergarten. You did enter the store first and began your Wayfair return on your phone at the counter. While you were being helped by Wayfair I began helping a customer that came in and was ready.\n\nYou interrupted this transaction to tell me to look for the Wayfair email. I explained to you that I was helping another customer and I would help you as soon as her transaction was completed. You said \"But I was here first!\" And I replied \"But you weren't ready.\" I was not unkind to you, I was not rude. I also mentioned that had parked diagonally in two spaces - to which you replied \"I've got a new car...\" Wow.\n\nI see you have sent four packages through us in the last two years. If you want to take you business elsewhere, that's your choice. Of course, you are still welcome continue to drop off your prepaid returns with us in the future."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "114185328257152977153", "name": "Robert Lee", "time": 1530048489816, "rating": 5.0, "text": "I'm literally in here all the time shipping random items or sending certified mail. The service is always great. Thanks for being awesome! I'm sure I'll see you sometime today to ship something else!", "pics": null, "resp": {"time": 1530049255315, "text": "Thank you! We strive to be of service, and appreciate your business!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "106582673482845655940", "name": "CurlyCutie", "time": 1533403156710, "rating": 1.0, "text": "My daughter and I just experienced the most horrendous display of racism and bigotry from the \"owner\" of this location that I have yet to encounter in this area.  I own a small business that I run out of my home in McMullen Cove (and yes, I do have a license with the City of Huntsville).  I mail packages on a daily basis.  Today, I missed my mail pick up and our local post office had already closed so we drove down to this store so that we could ensure our packages would go out today.  My 12 year old went in first and was refused service.  So, I then took the packages and went inside only to be told that, \"I don't receive anything from the Post Office for compensation and am not required to provide service to you.\"   I asked for her to put that in writing, she refused, spewed some other nastiness until 2 other individuals came in and I told her I would be reporting her to the proper authorities and I left.   As I type this, I am still shaken, that this kind of bigotry and hatred can still exist.  That people feel they have the right to treat others with such vile.  I will not be returning to this location ever and would strongly urge others to also find somewhere else to spend your hard earned money.", "pics": null, "resp": {"time": 1533411883334, "text": "Wow, I feel I have to respond to this - this goes beyond misleading and is simply a lie. There were others in the store that were witness to your extremely rude, and bullying behavior Saturday afternoon. I'm so sorry that we couldn't help you, and that you were not happy here. We really try hard to make every customers experience here a very good one. As I explained to you when you were here - your postal labels would not scan. I tried on both registers  - your labels were not clear enough to be scanned. You knew they were poor labels beforehand, because you were quick to *demand* that I type the numbers in and give you a receipt. I explained that we do not do this, as the post office may never scan and relabel them and we would be held responsible for shipments not delivered as the location that accepted them. I never refused to scan your items, I scanned them several times. I did refuse to give you a receipt for items that won't scan. Again, I'm sorry that you are not happy, but please don't make a racial issue out of a situation that race simply had no bearing. That is extremely sad. I do hope you find happiness wherever you find to drop off in the future."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "110073186716751295578", "name": "Judy Malone", "time": 1553216060550, "rating": 5.0, "text": "I'm in this store at least 3 times a week for something - they help me with everything. The Cove is lucky to have this little store, the workers are always knowledgeable, efficient, and cheerful. Thanks y'all! A+++++", "pics": null, "resp": {"time": 1553262273195, "text": "Thank you Judy! We love to make our customers happy."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "113120573937035350057", "name": "Gaybrielle Valverde", "time": 1561822588057, "rating": 5.0, "text": "I love how convenient this place is and I’ve never had a negative experience at this store.", "pics": null, "resp": {"time": 1561827258875, "text": "Well, the sweet people in this area, like you, make our job easy! Thank you so much for your kind review!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "112561891819366709974", "name": "Marie Channer", "time": 1533412424508, "rating": 5.0, "text": "LOVE! this store!  They are the go to place for my shipping.  They even mailed a grandfather clock....no problem they said.  Thank you MailPro!!!", "pics": null, "resp": {"time": 1533421262081, "text": "I remember the clock! Thank you for your business and the packing challenge!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "114939163847432919587", "name": "chris anderson", "time": 1547761319355, "rating": 3.0, "text": "The overall atmosphere isnt the same ,   I got some bad looks when I dropped off a return since I was only using the drop box and not paying to return through them", "pics": null, "resp": {"time": 1547760535442, "text": "I'm sorry to hear you feel this way. May I ask what we can do to improve your experience or correct the problem?"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "109908593061539807838", "name": "Britton Ethridge", "time": 1554480020942, "rating": 5.0, "text": "Went for help with a difficult Amazon return, & the very helpful staff worked with me to return the packages with no charge! Angeline was especially kind. Will be returning.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116360260574648898826", "name": "Joshua Magrath", "time": 1519421917819, "rating": 1.0, "text": "This place is over priced and lost their DHL access. In short the employee went through my package nosing around asking inappropriate questions. I have used them many times and always found this place over priced and unprofessional.", "pics": null, "resp": {"time": 1520622969300, "text": "Mr. Magrath, I’m sorry you felt unhappy with the quality of our service. Our records indicate that you’ve shipped two packages with us in as many years. One internationally, yes - we must ask questions about your shipment. “What are you sending? What is the value?” The details are required, not by us - but by international customs. We would absolutely not ask any “inappropriate” questions.\n\nLast week you came in and wanted to ship a box of “parts” and insure it. Yes, again, we need to know what you are sending and how much it’s worth. Not out of curiosity, but for insurance purposes. Again, not inappropriate questions. You were very vague about what it was - turned out to be paintball gun equipment, once we ascertained that it wasn’t firearm parts (we aren't licensed to send firearms or HAZMAT) and had no compressed cartridges included (HAZMAT) - we shipped it for you.\n\nYou seemed fine with the transaction at the time - I wish you had had the courage to complain in person instead of leaving a fully misleading review. Some people take these reviews seriously. Truth is, unhappy people write reviews, happy people come back (our customer count is up 30% since we bought the store in October) and we will continue to help our absolutely wonderful customers do what they are trying to do.\n\nOur staff has over 20 years collective experience in the packing and shipping industry. When you bring your items to us to ship, part of our service is ensuring that your item will make it to its destination in perfect shape. Sorry if you find this expertise “nosey”. Lol!\n\nWe are a DHL authorized shipping center, and we do accept pre-labeled DHL shipments at our location. We just don’t have enough demand for the service to print labels from our account."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "102206964601045706586", "name": "Wes Haley", "time": 1469547876625, "rating": 5.0, "text": "MailPro is the place to go when I need to ship a package. But it's also great for so many other things - notary services, live fingerprinting, moving supplies, copies, print jobs, etc.  - basically it's a one stop shop - convenient, courteous owners and employees, and fair prices.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "117402659533986240822", "name": "Brandon Stapler", "time": 1600542014438, "rating": 5.0, "text": "Awesome folks", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "109705648434260272701", "name": "Pat Carpenter", "time": 1489540471480, "rating": 5.0, "text": "Very convient. . Good service. Everything you need for mailing in one place.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116321132831559836704", "name": "Steve Vaughan", "time": 1596239345587, "rating": 1.0, "text": "They are very expensive.", "pics": null, "resp": {"time": 1596299738222, "text": "We don't have you in our records as a customer... Wrong store? Our prices are competitive with all the other pack and ship stores."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "103544018902048290752", "name": "Michael", "time": 1501897808239, "rating": 5.0, "text": "Good service. Quick.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100674572007366652313", "name": "Michele F", "time": 1565277290290, "rating": 5.0, "text": "We have never had anything but EXCELLENT service at this location", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116064553712770362564", "name": "David Farley", "time": 1553197171296, "rating": 5.0, "text": "Great staff, fast service.", "pics": null, "resp": {"time": 1553262186715, "text": "Thank you! We love to make our customers happy."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "103456385486869021430", "name": "Tns Wiley", "time": 1558554412993, "rating": 5.0, "text": "Wonderful speedy service!", "pics": null, "resp": {"time": 1558555792978, "text": "Thank you for coming in to see us!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "108077579238692453446", "name": "Amy Bornstein", "time": 1623108791891, "rating": 5.0, "text": "I am a Artist, once a canvas has sold, it must be crated and shipped. The Owner by the name of Angeline and her staff are very helpful, patient, quick and very professional.\nI will be using them constantly from now on.\nIt’s peace of mind to know that my artwork will travel to its new home and arrive in perfect condition.\nThank you, MailPro!!👩‍🎨", "pics": null, "resp": {"time": 1623180808633, "text": "Thank you for the kind words! Always a pleasure to help our artists get their gorgeous art to where it's going!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "108953851903629446984", "name": "Missy Fantusi", "time": 1628421604821, "rating": 4.0, "text": "Nice greeting cards, last time I was there, I was waited on right away. That's great!!", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "112551252548474682989", "name": "Marsha Reynolds", "time": 1619026767954, "rating": 5.0, "text": "Most convenient mailing store I have ever been to. I am never going back to the post office. The service at MailPro is outstanding and the staff is extremely helpful and lovely. Will definitely be back again and again.", "pics": null, "resp": {"time": 1619092610963, "text": "Ooooh thank you for the 5 stars! And thank you for letting us help you! Always a pleasure to be of service to sweet folks like you!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "108194833469719585695", "name": "Steve Middlebrooks", "time": 1620943588421, "rating": 1.0, "text": "I went in to ship a golf club today at Mail pro in Owens crossroads Alabama. There was a lady in front of me that went in no mask on and the lady at the counter told her just to put her package over there. I came in with no mask on she told me to go back out and get a mask! Does she know the time it takes for Covid-19 to spread is it a short time or a long time? Apparently she works for the CDC and she knows all about it to discriminate against who wears a mask and who does not. If that service wasn't bad enough they charged me $51 to ship a golf club which normally would cost $39 anywhere else. Save your money save your time and save your humiliation Don't go here.", "pics": null, "resp": {"time": 1620961399940, "text": "Wow. Yes, two customers in a row walked right past our “masks required” sign that is posted on the door. The lady ahead of you could drop her prepaid off and go, you needed to be in the store longer. It would have been futile for her leave to get her mask and come back in - her task was complete.\n\nI’m sorry you feel humiliated by being asked to be compassionate to those around us that haven’t had their vaccination yet. We are still trying to follow the current CDC guidelines, they are on the CDC website if you need a refresher.\n\nAnd again, I’m sorry you felt the price to pack and ship your golf club was more than you wanted to pay. Generally the price for clubs to be packed and shipped runs between $25-$35. The weight, dimensions and destination for this particular package determined the options we gave you. We would have gladly handed it back to you if you had wanted, so you could “price shop” and maybe find an option that better suited your price range.\n\nAs always, you are welcome in our store in the future provided you can be considerate and compassionate to the other shoppers."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100916212036415759093", "name": "Kim Ringenbach (looneypumpkin)", "time": 1613569542336, "rating": 5.0, "text": "Mail Pro is the best place to ship from in Huntsville! The staff is super friendly and quick! I've never had an issue and the owner is the best!", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100916030163268426101", "name": "Garel 2008", "time": 1607049251654, "rating": 5.0, "text": "My wife sent an international mail to the Philippines with very important papers and very expensive. She had the wrong address on the package. She found out when she returned home, called them and they went through all the outgoing mail and found it and changed the address label in time. Great job! We will use MailPro again and with a great level of confidence.\n\nThanks! MailPro", "pics": null, "resp": {"time": 1607051157259, "text": "Aw! Thank you for the great review! Always happy to help, glad to get a package where it's supposed to go! Thanks for coming to see us!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100735917630884398660", "name": "D Gallagher", "time": 1622668226041, "rating": 1.0, "text": "Worthless.  Public notary doesn’t understand documents (questionable reading comprehension skills) and refused to accept any help (ie ignorant and stubborn).", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "112405032535452363722", "name": "Delilah Roberson", "time": 1618949027570, "rating": 1.0, "text": "Very rude and unprofessional simply because I asked for a tracking receipt.", "pics": null, "resp": {"time": 1619027075853, "text": "We have a sign on the door stating that a mask is required. You came in without a mask and we still served you. I'm sorry this was difficult for you, hope in the future you can find a place to return your prepaid drop offs that will be more to your liking."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "103643497643102984504", "name": "Peggy Coulter", "time": 1613505191333, "rating": 1.0, "text": "Closed office? What happened to \"the mail must go through\"? All roads clear here in Hampton Cove. Monday and Tuesday.", "pics": null, "resp": {"time": 1613506543842, "text": "Sorry we missed you. We were open Monday from 9 til around 1:30pm when the temperature dropped below freezing. My employees live over the mountain and I made the decision to remain closed today at 6:30 this morning when the news was reporting that schools, redstone and colleges were closed."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100256428479117552551", "name": "Jonathan Martinez", "time": 1610398309210, "rating": 5.0, "text": "Really efficient post office to drop or send mail. Hard workers and pleasant experience with customer service.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "114130145094223069253", "name": "Mary Marshall", "time": 1592581389539, "rating": 5.0, "text": "Always professional, friendly and knowledgeable about all methods of shipping. Very helpful and fun to chat with. My go-to place for shipping.", "pics": null, "resp": {"time": 1592591862288, "text": "Thank you for the sweet review!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100313294291552609460", "name": "Scotty Pate", "time": 1582242385133, "rating": 5.0, "text": "Fantastic business! I have shipped dozens of packages through them. Everything from legal papers to expensive fragile music instruments, and they have packaged and shipped everything perfectly. Love how convenient they are.", "pics": null, "resp": {"time": 1582322506908, "text": "Thank you so much for taking the time to write a review! It's pleasure to help you with all your tasks. Thank you for being a great customer!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116377114387881125250", "name": "Tee West", "time": 1575146678919, "rating": 1.0, "text": "Would give minus 5 stars if possible. Owner very rude!!!!!!!!!!!!!!!!!!!! A  package was processed couple months ago to Amazon from different person in store Today owner refused and said they DID NOT do the package before when in fact it was. Owner needs to learn how to actually run this store sufficiently. I'd been embarrassed to admit I was owner with that attitude. I just read your reply and trust me you were rude and have no intentions of ever doing service here again. That shows bad character on your part for reply such as that!!!!!!! What an arrogance!!!", "pics": null, "resp": {"time": 1575118391387, "text": "LOL!! Yes, I had the audacity to disagree with you... I'm sorry, you are simply mistaken. You chose the Amazon QR code that clearly states on your return for you to take the QR to branded UPS Store for them to scan.\n\nWe are MailPro, a UPS Authorized Shipping Outlet and can take Amazon returns with a UPS label when you choose \"UPS Dropoff\", our scanners can't scan UPS Store QR codes.\n\nLast time I'm sure we showed you how to cancel your return, and re-return it as a \"UPS Dropoff\" to process it for you. We do this approximately 20 times a day for all of our fabulous customers.\n\nI tried to show you how change your return but you were not receptive, choosing instead to be offended. Next time when you bring your QR code in - we'll be sure to walk you through each step so you can understand the process. Life is too short to go through it looking to be offended.."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "101165821461528592940", "name": "Christopher Coleman", "time": 1595596317473, "rating": 5.0, "text": "Great service and convenient location for mailing packages and returns to Amazon.", "pics": null, "resp": {"time": 1595614496284, "text": "Aw thanks! It's a pleasure to help!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "111275442294901164466", "name": "Erin Dwyer", "time": 1557851281853, "rating": 5.0, "text": "Fast, friendly, helpful - LOVE MailPro! I always bypass the Post Office for the ease and convenience of this local mailing center. They are the nicest and can't beat their amazing service!", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "118130912154506378661", "name": "Am C", "time": 1551548737108, "rating": 5.0, "text": "So helpful and friendly. Highly recommend this spot. Printed out my label and even supplied tape (both of which I forgot to bring). They took both of my packages (USPS and UPS)", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "110549728771214230733", "name": "Alta Finney", "time": 1533786437553, "rating": 5.0, "text": "We are here a couple times each month, and each time, we receive the most helpful service. It's so much easier to do business with people like these! They ask all the appropriate questions to ensure that my packages will arrive safely, and that is what good customer service is all about!", "pics": null, "resp": {"time": 1533833079754, "text": "Thank you for choosing us! It is our pleasure to help!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "112374901908076149586", "name": "Jose Vasquez", "time": 1545508604903, "rating": 5.0, "text": "This place may be tiny. This place may be hidden in the plaza. But ultimately this is the place one needs to go for all their shipping and printing needs. The staff 5/5. If customer service is key. Then they have the key to success.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOfL90X0oZ3lPYbsfNMC_H4tgUcKOfqyuFru2b9=w150-h150-k-no-p"]}], "resp": {"time": 1545679616684, "text": "Thank you for coming by and letting us help you with your project! Y'all were great!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "107940296177859176663", "name": "Rebekah Smith", "time": 1565538625407, "rating": 5.0, "text": "Convenient, friendly, and professional. They offer every service I need including notary and always find the best deals.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "109148092595887137192", "name": "Lacey House", "time": 1533419426999, "rating": 5.0, "text": "Fast service, friendly and professional staff, and many services available! I witnessed so many happy and satisfied customers while I was in today! I Definitely recommend this business for all your shipping, binding, and packaging needs! Their location is also very convenient! Thanks MailPro!", "pics": null, "resp": {"time": 1533420775509, "text": "Thank you! Your business is very much appreciated and please come again soon!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116662045511772687323", "name": "Richard McCollum", "time": 1573674839172, "rating": 1.0, "text": "They lost a FedEx package we sent. It has been a huge inconvenience for lots of people (and will continue to be for awhile). MailPro claims FedEx lost the package, but FedEx never scanned the package saying they picked it up, which leads me to believe MailPro lost it. FedEx claims MailPro lost it. Either way I really don't care, huge pain, never using the company again even though they are convenient.", "pics": null, "resp": {"time": 1573679750641, "text": "We are terribly sorry for your inconvenience. Your package did get picked up by FedEx, and we do have the manifest that the driver signed. It is rare that a package doesn't get scanned at the hub, but it does happen. We are sorry it happened to your package. All we can do is reimburse you for your shipping charge, which we have done."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "117940719761698850504", "name": "Rebecca Jensen", "time": 1552752934522, "rating": 1.0, "text": "I was in Mailpro yesterday. The lady with dark hair and bigger was ugly to me in front of customers. I was there before the lady she was waiting on and asked her a question. That’s when she got mad and said she was waiting on someone else. I then said that I was there first and she went off on me even pointing out that I had crossed the line when I parked. She gave me the email I needed to send my package with and really though t I would send package thru her after her behavior. I paid 11 cents and left. I will never go in that horrible store again.\n\nYour negative reply truly reflects the attitude you had toward me. Most reputable businesses try to correct the problem or apologize. They do not retaliate or make snarky comments.", "pics": null, "resp": {"time": 1552678459529, "text": "Every customer is important and appreciated in our store. But we do expect our customers to act with basic manners learned in kindergarten. You did enter the store first and began your Wayfair return on your phone at the counter. While you were being helped by Wayfair I began helping a customer that came in and was ready.\n\nYou interrupted this transaction to tell me to look for the Wayfair email. I explained to you that I was helping another customer and I would help you as soon as her transaction was completed. You said \"But I was here first!\" And I replied \"But you weren't ready.\" I was not unkind to you, I was not rude. I also mentioned that had parked diagonally in two spaces - to which you replied \"I've got a new car...\" Wow.\n\nI see you have sent four packages through us in the last two years. If you want to take you business elsewhere, that's your choice. Of course, you are still welcome continue to drop off your prepaid returns with us in the future."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "114185328257152977153", "name": "Robert Lee", "time": 1530048489816, "rating": 5.0, "text": "I'm literally in here all the time shipping random items or sending certified mail. The service is always great. Thanks for being awesome! I'm sure I'll see you sometime today to ship something else!", "pics": null, "resp": {"time": 1530049255315, "text": "Thank you! We strive to be of service, and appreciate your business!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "106582673482845655940", "name": "CurlyCutie", "time": 1533403156710, "rating": 1.0, "text": "My daughter and I just experienced the most horrendous display of racism and bigotry from the \"owner\" of this location that I have yet to encounter in this area.  I own a small business that I run out of my home in McMullen Cove (and yes, I do have a license with the City of Huntsville).  I mail packages on a daily basis.  Today, I missed my mail pick up and our local post office had already closed so we drove down to this store so that we could ensure our packages would go out today.  My 12 year old went in first and was refused service.  So, I then took the packages and went inside only to be told that, \"I don't receive anything from the Post Office for compensation and am not required to provide service to you.\"   I asked for her to put that in writing, she refused, spewed some other nastiness until 2 other individuals came in and I told her I would be reporting her to the proper authorities and I left.   As I type this, I am still shaken, that this kind of bigotry and hatred can still exist.  That people feel they have the right to treat others with such vile.  I will not be returning to this location ever and would strongly urge others to also find somewhere else to spend your hard earned money.", "pics": null, "resp": {"time": 1533411883334, "text": "Wow, I feel I have to respond to this - this goes beyond misleading and is simply a lie. There were others in the store that were witness to your extremely rude, and bullying behavior Saturday afternoon. I'm so sorry that we couldn't help you, and that you were not happy here. We really try hard to make every customers experience here a very good one. As I explained to you when you were here - your postal labels would not scan. I tried on both registers  - your labels were not clear enough to be scanned. You knew they were poor labels beforehand, because you were quick to *demand* that I type the numbers in and give you a receipt. I explained that we do not do this, as the post office may never scan and relabel them and we would be held responsible for shipments not delivered as the location that accepted them. I never refused to scan your items, I scanned them several times. I did refuse to give you a receipt for items that won't scan. Again, I'm sorry that you are not happy, but please don't make a racial issue out of a situation that race simply had no bearing. That is extremely sad. I do hope you find happiness wherever you find to drop off in the future."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "110073186716751295578", "name": "Judy Malone", "time": 1553216060550, "rating": 5.0, "text": "I'm in this store at least 3 times a week for something - they help me with everything. The Cove is lucky to have this little store, the workers are always knowledgeable, efficient, and cheerful. Thanks y'all! A+++++", "pics": null, "resp": {"time": 1553262273195, "text": "Thank you Judy! We love to make our customers happy."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "113120573937035350057", "name": "Gaybrielle Valverde", "time": 1561822588057, "rating": 5.0, "text": "I love how convenient this place is and I’ve never had a negative experience at this store.", "pics": null, "resp": {"time": 1561827258875, "text": "Well, the sweet people in this area, like you, make our job easy! Thank you so much for your kind review!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "112561891819366709974", "name": "Marie Channer", "time": 1533412424508, "rating": 5.0, "text": "LOVE! this store!  They are the go to place for my shipping.  They even mailed a grandfather clock....no problem they said.  Thank you MailPro!!!", "pics": null, "resp": {"time": 1533421262081, "text": "I remember the clock! Thank you for your business and the packing challenge!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "114939163847432919587", "name": "chris anderson", "time": 1547761319355, "rating": 3.0, "text": "The overall atmosphere isnt the same ,   I got some bad looks when I dropped off a return since I was only using the drop box and not paying to return through them", "pics": null, "resp": {"time": 1547760535442, "text": "I'm sorry to hear you feel this way. May I ask what we can do to improve your experience or correct the problem?"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "109908593061539807838", "name": "Britton Ethridge", "time": 1554480020942, "rating": 5.0, "text": "Went for help with a difficult Amazon return, & the very helpful staff worked with me to return the packages with no charge! Angeline was especially kind. Will be returning.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116360260574648898826", "name": "Joshua Magrath", "time": 1519421917819, "rating": 1.0, "text": "This place is over priced and lost their DHL access. In short the employee went through my package nosing around asking inappropriate questions. I have used them many times and always found this place over priced and unprofessional.", "pics": null, "resp": {"time": 1520622969300, "text": "Mr. Magrath, I’m sorry you felt unhappy with the quality of our service. Our records indicate that you’ve shipped two packages with us in as many years. One internationally, yes - we must ask questions about your shipment. “What are you sending? What is the value?” The details are required, not by us - but by international customs. We would absolutely not ask any “inappropriate” questions.\n\nLast week you came in and wanted to ship a box of “parts” and insure it. Yes, again, we need to know what you are sending and how much it’s worth. Not out of curiosity, but for insurance purposes. Again, not inappropriate questions. You were very vague about what it was - turned out to be paintball gun equipment, once we ascertained that it wasn’t firearm parts (we aren't licensed to send firearms or HAZMAT) and had no compressed cartridges included (HAZMAT) - we shipped it for you.\n\nYou seemed fine with the transaction at the time - I wish you had had the courage to complain in person instead of leaving a fully misleading review. Some people take these reviews seriously. Truth is, unhappy people write reviews, happy people come back (our customer count is up 30% since we bought the store in October) and we will continue to help our absolutely wonderful customers do what they are trying to do.\n\nOur staff has over 20 years collective experience in the packing and shipping industry. When you bring your items to us to ship, part of our service is ensuring that your item will make it to its destination in perfect shape. Sorry if you find this expertise “nosey”. Lol!\n\nWe are a DHL authorized shipping center, and we do accept pre-labeled DHL shipments at our location. We just don’t have enough demand for the service to print labels from our account."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "102206964601045706586", "name": "Wes Haley", "time": 1469547876625, "rating": 5.0, "text": "MailPro is the place to go when I need to ship a package. But it's also great for so many other things - notary services, live fingerprinting, moving supplies, copies, print jobs, etc.  - basically it's a one stop shop - convenient, courteous owners and employees, and fair prices.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "117402659533986240822", "name": "Brandon Stapler", "time": 1600542014438, "rating": 5.0, "text": "Awesome folks", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "109705648434260272701", "name": "Pat Carpenter", "time": 1489540471480, "rating": 5.0, "text": "Very convient. . Good service. Everything you need for mailing in one place.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116321132831559836704", "name": "Steve Vaughan", "time": 1596239345587, "rating": 1.0, "text": "They are very expensive.", "pics": null, "resp": {"time": 1596299738222, "text": "We don't have you in our records as a customer... Wrong store? Our prices are competitive with all the other pack and ship stores."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "103544018902048290752", "name": "Michael", "time": 1501897808239, "rating": 5.0, "text": "Good service. Quick.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100674572007366652313", "name": "Michele F", "time": 1565277290290, "rating": 5.0, "text": "We have never had anything but EXCELLENT service at this location", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116064553712770362564", "name": "David Farley", "time": 1553197171296, "rating": 5.0, "text": "Great staff, fast service.", "pics": null, "resp": {"time": 1553262186715, "text": "Thank you! We love to make our customers happy."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "103456385486869021430", "name": "Tns Wiley", "time": 1558554412993, "rating": 5.0, "text": "Wonderful speedy service!", "pics": null, "resp": {"time": 1558555792978, "text": "Thank you for coming in to see us!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "108077579238692453446", "name": "Amy Bornstein", "time": 1623108791891, "rating": 5.0, "text": "I am a Artist, once a canvas has sold, it must be crated and shipped. The Owner by the name of Angeline and her staff are very helpful, patient, quick and very professional.\nI will be using them constantly from now on.\nIt’s peace of mind to know that my artwork will travel to its new home and arrive in perfect condition.\nThank you, MailPro!!👩‍🎨", "pics": null, "resp": {"time": 1623180808633, "text": "Thank you for the kind words! Always a pleasure to help our artists get their gorgeous art to where it's going!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "108953851903629446984", "name": "Missy Fantusi", "time": 1628421604821, "rating": 4.0, "text": "Nice greeting cards, last time I was there, I was waited on right away. That's great!!", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "112551252548474682989", "name": "Marsha Reynolds", "time": 1619026767954, "rating": 5.0, "text": "Most convenient mailing store I have ever been to. I am never going back to the post office. The service at MailPro is outstanding and the staff is extremely helpful and lovely. Will definitely be back again and again.", "pics": null, "resp": {"time": 1619092610963, "text": "Ooooh thank you for the 5 stars! And thank you for letting us help you! Always a pleasure to be of service to sweet folks like you!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "108194833469719585695", "name": "Steve Middlebrooks", "time": 1620943588421, "rating": 1.0, "text": "I went in to ship a golf club today at Mail pro in Owens crossroads Alabama. There was a lady in front of me that went in no mask on and the lady at the counter told her just to put her package over there. I came in with no mask on she told me to go back out and get a mask! Does she know the time it takes for Covid-19 to spread is it a short time or a long time? Apparently she works for the CDC and she knows all about it to discriminate against who wears a mask and who does not. If that service wasn't bad enough they charged me $51 to ship a golf club which normally would cost $39 anywhere else. Save your money save your time and save your humiliation Don't go here.", "pics": null, "resp": {"time": 1620961399940, "text": "Wow. Yes, two customers in a row walked right past our “masks required” sign that is posted on the door. The lady ahead of you could drop her prepaid off and go, you needed to be in the store longer. It would have been futile for her leave to get her mask and come back in - her task was complete.\n\nI’m sorry you feel humiliated by being asked to be compassionate to those around us that haven’t had their vaccination yet. We are still trying to follow the current CDC guidelines, they are on the CDC website if you need a refresher.\n\nAnd again, I’m sorry you felt the price to pack and ship your golf club was more than you wanted to pay. Generally the price for clubs to be packed and shipped runs between $25-$35. The weight, dimensions and destination for this particular package determined the options we gave you. We would have gladly handed it back to you if you had wanted, so you could “price shop” and maybe find an option that better suited your price range.\n\nAs always, you are welcome in our store in the future provided you can be considerate and compassionate to the other shoppers."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100916212036415759093", "name": "Kim Ringenbach (looneypumpkin)", "time": 1613569542336, "rating": 5.0, "text": "Mail Pro is the best place to ship from in Huntsville! The staff is super friendly and quick! I've never had an issue and the owner is the best!", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100916030163268426101", "name": "Garel 2008", "time": 1607049251654, "rating": 5.0, "text": "My wife sent an international mail to the Philippines with very important papers and very expensive. She had the wrong address on the package. She found out when she returned home, called them and they went through all the outgoing mail and found it and changed the address label in time. Great job! We will use MailPro again and with a great level of confidence.\n\nThanks! MailPro", "pics": null, "resp": {"time": 1607051157259, "text": "Aw! Thank you for the great review! Always happy to help, glad to get a package where it's supposed to go! Thanks for coming to see us!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100735917630884398660", "name": "D Gallagher", "time": 1622668226041, "rating": 1.0, "text": "Worthless.  Public notary doesn’t understand documents (questionable reading comprehension skills) and refused to accept any help (ie ignorant and stubborn).", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "112405032535452363722", "name": "Delilah Roberson", "time": 1618949027570, "rating": 1.0, "text": "Very rude and unprofessional simply because I asked for a tracking receipt.", "pics": null, "resp": {"time": 1619027075853, "text": "We have a sign on the door stating that a mask is required. You came in without a mask and we still served you. I'm sorry this was difficult for you, hope in the future you can find a place to return your prepaid drop offs that will be more to your liking."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "103643497643102984504", "name": "Peggy Coulter", "time": 1613505191333, "rating": 1.0, "text": "Closed office? What happened to \"the mail must go through\"? All roads clear here in Hampton Cove. Monday and Tuesday.", "pics": null, "resp": {"time": 1613506543842, "text": "Sorry we missed you. We were open Monday from 9 til around 1:30pm when the temperature dropped below freezing. My employees live over the mountain and I made the decision to remain closed today at 6:30 this morning when the news was reporting that schools, redstone and colleges were closed."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100256428479117552551", "name": "Jonathan Martinez", "time": 1610398309210, "rating": 5.0, "text": "Really efficient post office to drop or send mail. Hard workers and pleasant experience with customer service.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "114130145094223069253", "name": "Mary Marshall", "time": 1592581389539, "rating": 5.0, "text": "Always professional, friendly and knowledgeable about all methods of shipping. Very helpful and fun to chat with. My go-to place for shipping.", "pics": null, "resp": {"time": 1592591862288, "text": "Thank you for the sweet review!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100313294291552609460", "name": "Scotty Pate", "time": 1582242385133, "rating": 5.0, "text": "Fantastic business! I have shipped dozens of packages through them. Everything from legal papers to expensive fragile music instruments, and they have packaged and shipped everything perfectly. Love how convenient they are.", "pics": null, "resp": {"time": 1582322506908, "text": "Thank you so much for taking the time to write a review! It's pleasure to help you with all your tasks. Thank you for being a great customer!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116377114387881125250", "name": "Tee West", "time": 1575146678919, "rating": 1.0, "text": "Would give minus 5 stars if possible. Owner very rude!!!!!!!!!!!!!!!!!!!! A  package was processed couple months ago to Amazon from different person in store Today owner refused and said they DID NOT do the package before when in fact it was. Owner needs to learn how to actually run this store sufficiently. I'd been embarrassed to admit I was owner with that attitude. I just read your reply and trust me you were rude and have no intentions of ever doing service here again. That shows bad character on your part for reply such as that!!!!!!! What an arrogance!!!", "pics": null, "resp": {"time": 1575118391387, "text": "LOL!! Yes, I had the audacity to disagree with you... I'm sorry, you are simply mistaken. You chose the Amazon QR code that clearly states on your return for you to take the QR to branded UPS Store for them to scan.\n\nWe are MailPro, a UPS Authorized Shipping Outlet and can take Amazon returns with a UPS label when you choose \"UPS Dropoff\", our scanners can't scan UPS Store QR codes.\n\nLast time I'm sure we showed you how to cancel your return, and re-return it as a \"UPS Dropoff\" to process it for you. We do this approximately 20 times a day for all of our fabulous customers.\n\nI tried to show you how change your return but you were not receptive, choosing instead to be offended. Next time when you bring your QR code in - we'll be sure to walk you through each step so you can understand the process. Life is too short to go through it looking to be offended.."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "101165821461528592940", "name": "Christopher Coleman", "time": 1595596317473, "rating": 5.0, "text": "Great service and convenient location for mailing packages and returns to Amazon.", "pics": null, "resp": {"time": 1595614496284, "text": "Aw thanks! It's a pleasure to help!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "111275442294901164466", "name": "Erin Dwyer", "time": 1557851281853, "rating": 5.0, "text": "Fast, friendly, helpful - LOVE MailPro! I always bypass the Post Office for the ease and convenience of this local mailing center. They are the nicest and can't beat their amazing service!", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "118130912154506378661", "name": "Am C", "time": 1551548737108, "rating": 5.0, "text": "So helpful and friendly. Highly recommend this spot. Printed out my label and even supplied tape (both of which I forgot to bring). They took both of my packages (USPS and UPS)", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "110549728771214230733", "name": "Alta Finney", "time": 1533786437553, "rating": 5.0, "text": "We are here a couple times each month, and each time, we receive the most helpful service. It's so much easier to do business with people like these! They ask all the appropriate questions to ensure that my packages will arrive safely, and that is what good customer service is all about!", "pics": null, "resp": {"time": 1533833079754, "text": "Thank you for choosing us! It is our pleasure to help!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "112374901908076149586", "name": "Jose Vasquez", "time": 1545508604903, "rating": 5.0, "text": "This place may be tiny. This place may be hidden in the plaza. But ultimately this is the place one needs to go for all their shipping and printing needs. The staff 5/5. If customer service is key. Then they have the key to success.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOfL90X0oZ3lPYbsfNMC_H4tgUcKOfqyuFru2b9=w150-h150-k-no-p"]}], "resp": {"time": 1545679616684, "text": "Thank you for coming by and letting us help you with your project! Y'all were great!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "107940296177859176663", "name": "Rebekah Smith", "time": 1565538625407, "rating": 5.0, "text": "Convenient, friendly, and professional. They offer every service I need including notary and always find the best deals.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "109148092595887137192", "name": "Lacey House", "time": 1533419426999, "rating": 5.0, "text": "Fast service, friendly and professional staff, and many services available! I witnessed so many happy and satisfied customers while I was in today! I Definitely recommend this business for all your shipping, binding, and packaging needs! Their location is also very convenient! Thanks MailPro!", "pics": null, "resp": {"time": 1533420775509, "text": "Thank you! Your business is very much appreciated and please come again soon!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116662045511772687323", "name": "Richard McCollum", "time": 1573674839172, "rating": 1.0, "text": "They lost a FedEx package we sent. It has been a huge inconvenience for lots of people (and will continue to be for awhile). MailPro claims FedEx lost the package, but FedEx never scanned the package saying they picked it up, which leads me to believe MailPro lost it. FedEx claims MailPro lost it. Either way I really don't care, huge pain, never using the company again even though they are convenient.", "pics": null, "resp": {"time": 1573679750641, "text": "We are terribly sorry for your inconvenience. Your package did get picked up by FedEx, and we do have the manifest that the driver signed. It is rare that a package doesn't get scanned at the hub, but it does happen. We are sorry it happened to your package. All we can do is reimburse you for your shipping charge, which we have done."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "117940719761698850504", "name": "Rebecca Jensen", "time": 1552752934522, "rating": 1.0, "text": "I was in Mailpro yesterday. The lady with dark hair and bigger was ugly to me in front of customers. I was there before the lady she was waiting on and asked her a question. That’s when she got mad and said she was waiting on someone else. I then said that I was there first and she went off on me even pointing out that I had crossed the line when I parked. She gave me the email I needed to send my package with and really though t I would send package thru her after her behavior. I paid 11 cents and left. I will never go in that horrible store again.\n\nYour negative reply truly reflects the attitude you had toward me. Most reputable businesses try to correct the problem or apologize. They do not retaliate or make snarky comments.", "pics": null, "resp": {"time": 1552678459529, "text": "Every customer is important and appreciated in our store. But we do expect our customers to act with basic manners learned in kindergarten. You did enter the store first and began your Wayfair return on your phone at the counter. While you were being helped by Wayfair I began helping a customer that came in and was ready.\n\nYou interrupted this transaction to tell me to look for the Wayfair email. I explained to you that I was helping another customer and I would help you as soon as her transaction was completed. You said \"But I was here first!\" And I replied \"But you weren't ready.\" I was not unkind to you, I was not rude. I also mentioned that had parked diagonally in two spaces - to which you replied \"I've got a new car...\" Wow.\n\nI see you have sent four packages through us in the last two years. If you want to take you business elsewhere, that's your choice. Of course, you are still welcome continue to drop off your prepaid returns with us in the future."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "114185328257152977153", "name": "Robert Lee", "time": 1530048489816, "rating": 5.0, "text": "I'm literally in here all the time shipping random items or sending certified mail. The service is always great. Thanks for being awesome! I'm sure I'll see you sometime today to ship something else!", "pics": null, "resp": {"time": 1530049255315, "text": "Thank you! We strive to be of service, and appreciate your business!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "106582673482845655940", "name": "CurlyCutie", "time": 1533403156710, "rating": 1.0, "text": "My daughter and I just experienced the most horrendous display of racism and bigotry from the \"owner\" of this location that I have yet to encounter in this area.  I own a small business that I run out of my home in McMullen Cove (and yes, I do have a license with the City of Huntsville).  I mail packages on a daily basis.  Today, I missed my mail pick up and our local post office had already closed so we drove down to this store so that we could ensure our packages would go out today.  My 12 year old went in first and was refused service.  So, I then took the packages and went inside only to be told that, \"I don't receive anything from the Post Office for compensation and am not required to provide service to you.\"   I asked for her to put that in writing, she refused, spewed some other nastiness until 2 other individuals came in and I told her I would be reporting her to the proper authorities and I left.   As I type this, I am still shaken, that this kind of bigotry and hatred can still exist.  That people feel they have the right to treat others with such vile.  I will not be returning to this location ever and would strongly urge others to also find somewhere else to spend your hard earned money.", "pics": null, "resp": {"time": 1533411883334, "text": "Wow, I feel I have to respond to this - this goes beyond misleading and is simply a lie. There were others in the store that were witness to your extremely rude, and bullying behavior Saturday afternoon. I'm so sorry that we couldn't help you, and that you were not happy here. We really try hard to make every customers experience here a very good one. As I explained to you when you were here - your postal labels would not scan. I tried on both registers  - your labels were not clear enough to be scanned. You knew they were poor labels beforehand, because you were quick to *demand* that I type the numbers in and give you a receipt. I explained that we do not do this, as the post office may never scan and relabel them and we would be held responsible for shipments not delivered as the location that accepted them. I never refused to scan your items, I scanned them several times. I did refuse to give you a receipt for items that won't scan. Again, I'm sorry that you are not happy, but please don't make a racial issue out of a situation that race simply had no bearing. That is extremely sad. I do hope you find happiness wherever you find to drop off in the future."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "110073186716751295578", "name": "Judy Malone", "time": 1553216060550, "rating": 5.0, "text": "I'm in this store at least 3 times a week for something - they help me with everything. The Cove is lucky to have this little store, the workers are always knowledgeable, efficient, and cheerful. Thanks y'all! A+++++", "pics": null, "resp": {"time": 1553262273195, "text": "Thank you Judy! We love to make our customers happy."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "113120573937035350057", "name": "Gaybrielle Valverde", "time": 1561822588057, "rating": 5.0, "text": "I love how convenient this place is and I’ve never had a negative experience at this store.", "pics": null, "resp": {"time": 1561827258875, "text": "Well, the sweet people in this area, like you, make our job easy! Thank you so much for your kind review!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "112561891819366709974", "name": "Marie Channer", "time": 1533412424508, "rating": 5.0, "text": "LOVE! this store!  They are the go to place for my shipping.  They even mailed a grandfather clock....no problem they said.  Thank you MailPro!!!", "pics": null, "resp": {"time": 1533421262081, "text": "I remember the clock! Thank you for your business and the packing challenge!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "114939163847432919587", "name": "chris anderson", "time": 1547761319355, "rating": 3.0, "text": "The overall atmosphere isnt the same ,   I got some bad looks when I dropped off a return since I was only using the drop box and not paying to return through them", "pics": null, "resp": {"time": 1547760535442, "text": "I'm sorry to hear you feel this way. May I ask what we can do to improve your experience or correct the problem?"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "109908593061539807838", "name": "Britton Ethridge", "time": 1554480020942, "rating": 5.0, "text": "Went for help with a difficult Amazon return, & the very helpful staff worked with me to return the packages with no charge! Angeline was especially kind. Will be returning.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116360260574648898826", "name": "Joshua Magrath", "time": 1519421917819, "rating": 1.0, "text": "This place is over priced and lost their DHL access. In short the employee went through my package nosing around asking inappropriate questions. I have used them many times and always found this place over priced and unprofessional.", "pics": null, "resp": {"time": 1520622969300, "text": "Mr. Magrath, I’m sorry you felt unhappy with the quality of our service. Our records indicate that you’ve shipped two packages with us in as many years. One internationally, yes - we must ask questions about your shipment. “What are you sending? What is the value?” The details are required, not by us - but by international customs. We would absolutely not ask any “inappropriate” questions.\n\nLast week you came in and wanted to ship a box of “parts” and insure it. Yes, again, we need to know what you are sending and how much it’s worth. Not out of curiosity, but for insurance purposes. Again, not inappropriate questions. You were very vague about what it was - turned out to be paintball gun equipment, once we ascertained that it wasn’t firearm parts (we aren't licensed to send firearms or HAZMAT) and had no compressed cartridges included (HAZMAT) - we shipped it for you.\n\nYou seemed fine with the transaction at the time - I wish you had had the courage to complain in person instead of leaving a fully misleading review. Some people take these reviews seriously. Truth is, unhappy people write reviews, happy people come back (our customer count is up 30% since we bought the store in October) and we will continue to help our absolutely wonderful customers do what they are trying to do.\n\nOur staff has over 20 years collective experience in the packing and shipping industry. When you bring your items to us to ship, part of our service is ensuring that your item will make it to its destination in perfect shape. Sorry if you find this expertise “nosey”. Lol!\n\nWe are a DHL authorized shipping center, and we do accept pre-labeled DHL shipments at our location. We just don’t have enough demand for the service to print labels from our account."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "102206964601045706586", "name": "Wes Haley", "time": 1469547876625, "rating": 5.0, "text": "MailPro is the place to go when I need to ship a package. But it's also great for so many other things - notary services, live fingerprinting, moving supplies, copies, print jobs, etc.  - basically it's a one stop shop - convenient, courteous owners and employees, and fair prices.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "117402659533986240822", "name": "Brandon Stapler", "time": 1600542014438, "rating": 5.0, "text": "Awesome folks", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "109705648434260272701", "name": "Pat Carpenter", "time": 1489540471480, "rating": 5.0, "text": "Very convient. . Good service. Everything you need for mailing in one place.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116321132831559836704", "name": "Steve Vaughan", "time": 1596239345587, "rating": 1.0, "text": "They are very expensive.", "pics": null, "resp": {"time": 1596299738222, "text": "We don't have you in our records as a customer... Wrong store? Our prices are competitive with all the other pack and ship stores."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "103544018902048290752", "name": "Michael", "time": 1501897808239, "rating": 5.0, "text": "Good service. Quick.", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "100674572007366652313", "name": "Michele F", "time": 1565277290290, "rating": 5.0, "text": "We have never had anything but EXCELLENT service at this location", "pics": null, "resp": null, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "116064553712770362564", "name": "David Farley", "time": 1553197171296, "rating": 5.0, "text": "Great staff, fast service.", "pics": null, "resp": {"time": 1553262186715, "text": "Thank you! We love to make our customers happy."}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "103456385486869021430", "name": "Tns Wiley", "time": 1558554412993, "rating": 5.0, "text": "Wonderful speedy service!", "pics": null, "resp": {"time": 1558555792978, "text": "Thank you for coming in to see us!"}, "gmap_id": "0x886211946d170b1f:0x88ce374972b76f07"}
{"user_id": "101381221796935302876", "name": "undefined", "time": 1577122848636, "rating": 5.0, "text": "Extremely professional and went out of their way for a critical overnight shipment. Drivers had already picked up and they personally called the driver and had them come back to the location and take my shipment.  Thank goodness!! Thanks Fed ex Jasper", "pics": null, "resp": null, "gmap_id": "0x888860d76abae589:0x7b62c65d7272554"}
{"user_id": "105851811887135774179", "name": "Rodman Gomez", "time": 1530979033216, "rating": 1.0, "text": "Sent package on Monday over night. Contents was not in the packaging when it arrived. Funny thing is, the packaging was still sealed up. Someone took lable off put it on another shipping envelope.  Lost over $7,000 from this. Update: I received the envelope back from the receiver you can clearly see the lable was removed and reattached to another envelope.  Its sad when you can not ship something and it is stolen.  Finally Fedex executives office called me told me they arw opening internal investigation of everyone that had this package.", "pics": null, "resp": null, "gmap_id": "0x888860d76abae589:0x7b62c65d7272554"}
{"user_id": "112596570982527458858", "name": "Scott Brown", "time": 1610927497363, "rating": 5.0, "text": "Friendly people", "pics": null, "resp": null, "gmap_id": "0x888860d76abae589:0x7b62c65d7272554"}
{"user_id": "107602358775656767981", "name": "Grace Thompson", "time": 1527677679410, "rating": 5.0, "text": "Excellent customer service.", "pics": null, "resp": null, "gmap_id": "0x888860d76abae589:0x7b62c65d7272554"}
{"user_id": "100354371084416913530", "name": "Amanda Patrick", "time": 1625069522580, "rating": 1.0, "text": "still waiting on my lawn mower to be delivered by this company. They called me on Monday, no fault of the driver, to let me know that when it was loaded they didn't put it on a pallet and the driver had no way to unload it, he stated he had reached out to the terminal with no response. Since, he didnt' want to mess up my lawn mower, he asked me if I could call the reschedule the delivery. When I called, I got a gentleman who said well who forgot to put a pallet under it, sir idk, I don't work for you guys. He said you don't have a man at home that can just take it off off the truck, I said no sir, don't know any man strong enough to unload a  zero turn lawn mower in a crate by himself. He goes and you don't have a fork lift, again no sir, don't have one of those lying around either. He goes well guess I don't have a choice but to bring it back in and put a pallet under it, this is just rediculous. I am sorry to be a bother, but it is now day two of it suppose to be delivered and I still have no lawn mower and no contact from this company. I had to pay freight and they wanted me to do the work to unload their mistake. I called the company and was advised that my lawn mower was sitting waiting to be re loaded, but they couldn't tell me when this might happen or when it would be delivered. I don't want a phone call from this company to just give me more excuses or ask me if I could that fork lift or hulk of a man to do their job. I just want my lawn mower and then I will make sure to NOT ever have to deal with this company again. Learn some customer service and don't get mad when you guys don't do your job.", "pics": null, "resp": {"time": 1625064777885, "text": "Amanda, we are sorry to hear you are frustrated with us. We would like to follow up with you; however, we will need a few more details in order to investigate your concerns. We invite you to provide more information on our R+L Cares forum, specifically designed to bring issues to our leadership teams for immediate review. Visit us at https://rlc.com/contact/rl-cares with your PRO (tracking) number for assistance."}, "gmap_id": "0x888e7dc0390d25c3:0x3805a6c930acfcb7"}
{"user_id": "107248921899381820108", "name": "Rick Winsatt", "time": 1617555108600, "rating": 4.0, "text": "Really nice people. Helped me out with loading a pallet on my truck with no problems.", "pics": null, "resp": {"time": 1617639866135, "text": "Rick, thanks for the positive review!"}, "gmap_id": "0x888e7dc0390d25c3:0x3805a6c930acfcb7"}
{"user_id": "108824544199334584125", "name": "Karen Smith", "time": 1605885144726, "rating": 1.0, "text": "Absolutely horrible experience except for the young lady who answered my phone call. I was told they would contact me before they delivered the item and they just plopped it in the middle of the yard exposed to the elements and it's too heavy for me to move. They refuse to make it right even though they had delivered the item within 15 minutes of me calling. Blamed everything on a new hire instead of keeping their word and honoring their commitment", "pics": null, "resp": {"time": 1605886166741, "text": "Karen, we apologize for your recent experience and would like to help, but we need more details regarding your concerns. Our We Care forum is designed to bring issues to our leadership team for immediate review. Please visit us at https://rlc.com/contact/rl-cares with additional information for assistance."}, "gmap_id": "0x888e7dc0390d25c3:0x3805a6c930acfcb7"}
{"user_id": "109437808739475072720", "name": "William Cosby", "time": 1591370279001, "rating": 5.0, "text": "They delivered as promised and when promised.  Driver was friendly and delivered into a tightly spaced area.  Great job 👍.", "pics": null, "resp": {"time": 1591378729517, "text": "Thank you William! We appreciate your review and business."}, "gmap_id": "0x888e7dc0390d25c3:0x3805a6c930acfcb7"}
{"user_id": "109613595320248934149", "name": "stacey morgan", "time": 1617128291373, "rating": 5.0, "text": "Service and staff was excellent!!!!", "pics": null, "resp": {"time": 1617201565001, "text": "Thank you for the wonderful rating Stacey! We are glad to hear that you had a great experience."}, "gmap_id": "0x888e7dc0390d25c3:0x3805a6c930acfcb7"}
{"user_id": "106195060322326225656", "name": "Gail Chappell", "time": 1529670629849, "rating": 5.0, "text": "T. Dorsey Was My Deliver Driver and I Was EXCEPTIONALLY Pleased With His PROFESSIONALISM and His AMAZING Driving Skills........", "pics": null, "resp": null, "gmap_id": "0x888e7dc0390d25c3:0x3805a6c930acfcb7"}
{"user_id": "103964427861940579166", "name": "Yuna Lee", "time": 1577140692287, "rating": 1.0, "text": "They are so irresponsible. Always tell the customer that they know nothing about it and they are the  second shift. Also, they dont keep the words they were supposed to do. So Be away from this company!!!!!!! Please!!!!", "pics": null, "resp": null, "gmap_id": "0x888e7dc0390d25c3:0x3805a6c930acfcb7"}
{"user_id": "103587004088493853733", "name": "Jessica Simpson", "time": 1515984325342, "rating": 5.0, "text": "Denise Tucker has exceptional customer service. I believe she's the receptionist.", "pics": null, "resp": null, "gmap_id": "0x888e7dc0390d25c3:0x3805a6c930acfcb7"}
{"user_id": "105186603207528260911", "name": "Steve Grauberger", "time": 1435513546097, "rating": 1.0, "text": "I live on a county road which is dirt.  Old Dominion would not deliver a shipment. They made up some lame excuse, I think, because it was raining that day.  They are not a good company to do business with. If you are a shipper make sure ahead of time that they will deliver to the address specified.", "pics": null, "resp": null, "gmap_id": "0x888c2de8ba9221c9:0xeab77f50829cd080"}
{"user_id": "112604735352855766862", "name": "Dariusz Lewandowski", "time": 1525572187676, "rating": 5.0, "text": "(Translated by Google) Business zone\n\n(Original)\nStrefa firm", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPT2UXajri1EEVGhGS6SETlgO-bIqrmRVzHaBPU=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPSk0-z-dMhiuW8oJ52StD3Wh4rvMteKWDZJGjR=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888c2de8ba9221c9:0xeab77f50829cd080"}
{"user_id": "107287934469088190160", "name": "Rotty Dude", "time": 1619804407139, "rating": 1.0, "text": "Said called me yesterday to schedule delivery of my equipment for today. I was to have equipment here to unload the truck myself. No problem, took off work (shut down a 3 person crew) and hire a skid steer operator with machine for the day to be here ($450, plus down time=$1350). They've waited until 12:00pm/day of delivery, to tell me they couldn't deliver my product. Not to mention, the machine isn't where I was told it was yesterday. Never again..", "pics": null, "resp": {"time": 1619981183348, "text": "We are truly sorry that your equipment was not delivered when it was scheduled. We completely understand your frustration and apologize for the inconvenience this caused you. We hope you have received your delivery but if not, will you please email us at CustomerCare@Saia.com, with your Pro #? We're happy to answer your questions and help anyway we can. Thank you!"}, "gmap_id": "0x88891da557900deb:0x61d78557242cf5a5"}
{"user_id": "101229213723832465162", "name": "Charles Whisonant", "time": 1623697897261, "rating": 5.0, "text": "Good bunch of boys! Got me in and out when I came to pick up some stuff ordered", "pics": null, "resp": {"time": 1623769944618, "text": "It's great to hear that you were able to quickly pick up your shipment, Charles! Thank you for your kind feedback and 5-star rating!"}, "gmap_id": "0x88891da557900deb:0x61d78557242cf5a5"}
{"user_id": "112545052650645265544", "name": "Tee", "time": 1600986711698, "rating": 5.0, "text": "Jenny was great in contacting driver for me to make sure item would still be delivered as scheduled.  Driver( i wish I could remember his name) called me not long after I spoke with Jenny to confirm he would be by in an hour. Sure enough the driver arrived on time and was extremely polite and professional, handled my delivery with care. I must say I am satisfied and I would recommend.", "pics": null, "resp": {"time": 1601043880966, "text": "Your review made our day, Tee! Thank you so much for taking the time to share your experience with Jenny and your delivery driver. We really love hearing that they were both so polite and professional and that you were pleased with the care they took in delivering your order. Your recommendation and kind words mean the world to our team. Thanks again for this wonderful feedback!"}, "gmap_id": "0x88891da557900deb:0x61d78557242cf5a5"}
{"user_id": "110429329944023019220", "name": "Tom Tom", "time": 1616877894787, "rating": 4.0, "text": "Informative delivery and executed delivery in timely manner", "pics": null, "resp": {"time": 1617040711094, "text": "Thank you very much for taking the time to let us know that you were pleased with your most recent experience with Saia, Tom. We really appreciate your business and positive feedback! We hope to have the opportunity to serve you again soon. Thanks!"}, "gmap_id": "0x88891da557900deb:0x61d78557242cf5a5"}
{"user_id": "113143203623649209432", "name": "Scott S", "time": 1591723229341, "rating": 5.0, "text": "Nice and neat looking landscaping. Looks clean and crisp", "pics": null, "resp": {"time": 1591810804778, "text": "Hi Scott, Thank you for taking the time to leave us this potisiteve feedback on Google - our team really appreciates it!"}, "gmap_id": "0x88891da557900deb:0x61d78557242cf5a5"}
{"user_id": "107795379448636455143", "name": "Josh Templet", "time": 1527294614041, "rating": 1.0, "text": "Absolutely terrible service. Terminal lied about attempting delivery as well as attempting to contact me. I took a whole day off work to accommodate their delivery window only to have their driver no show and lie about his attempt to deliver. I strongly recommend looking elsewhere for a reliable, honest freight company.", "pics": null, "resp": null, "gmap_id": "0x88891da557900deb:0x61d78557242cf5a5"}
{"user_id": "102458902800001092841", "name": "Andre Pickens", "time": 1594429584462, "rating": 1.0, "text": "They poor quality of shipping or delivery cause I didn't get my shipments when it suppose to be delivered don't have to worry about me using them anymore", "pics": null, "resp": {"time": 1594741266660, "text": "Hello Andre, Thank you for your honest feedback and we apologize for your disappointing experience! If you are willing to share more details about what happened, please email us at CustomerCare@Saia.com. We'll use your valuable feedback to help us improve."}, "gmap_id": "0x88891da557900deb:0x61d78557242cf5a5"}
{"user_id": "105120504952298710589", "name": "John Higginbotham", "time": 1547841011527, "rating": 2.0, "text": "This company cannot be trusted to give you accurate delivery times no matter what. I have the worst experience with this company each time I use them. I will no longer be using this freight company for further shipments. Customer service was rude and no willing to help solve a problem THEY created.", "pics": null, "resp": null, "gmap_id": "0x88891da557900deb:0x61d78557242cf5a5"}
{"user_id": "103757854306227118628", "name": "Leslie Hines", "time": 1515618046439, "rating": 5.0, "text": "Good company", "pics": null, "resp": null, "gmap_id": "0x88891da557900deb:0x61d78557242cf5a5"}
{"user_id": "111220096873414129225", "name": "Allison Wiley", "time": 1611339594555, "rating": 5.0, "text": "Great place of employment\nOld dominion can take care of any freight you need delivered", "pics": null, "resp": null, "gmap_id": "0x88891daf42af8ec3:0xd81ac8d45bc3c0f6"}
{"user_id": "117387479444082455521", "name": "Tamela Stanley (Aunt Tams)", "time": 1611197819107, "rating": 2.0, "text": "Didn't get to finish our business with this location. Too much drama with this site.", "pics": null, "resp": null, "gmap_id": "0x88891daf42af8ec3:0xd81ac8d45bc3c0f6"}
{"user_id": "117306616133400225852", "name": "Steven Burnham", "time": 1579910581858, "rating": 1.0, "text": "Worked with Upack and they contracted Old Dominion for our move. The move was from Virginia to Alabama at no point did Old Dominion or Upack mention anything about gravel driveways. It came to a complete surprise to us when they said that a gravel driveway would be off roading and they cannot do it. I would understand if it was parking the trailer on gravel or grass, however there is a 40 foot concrete pad at the top of the driveway. Just to elaborate a little more UPS, FedEx, Landstar have had no issues with the drive. There is no reason this should be an issue, howere it should have been communicated at some point that the driveway needs to be paved. It cannot be that my house is the only gravel drive in America", "pics": null, "resp": null, "gmap_id": "0x88891daf42af8ec3:0xd81ac8d45bc3c0f6"}
{"user_id": "114601215742984201588", "name": "Ellen Townley", "time": 1626315145862, "rating": 5.0, "text": "Very friendly", "pics": null, "resp": null, "gmap_id": "0x88891daf42af8ec3:0xd81ac8d45bc3c0f6"}
{"user_id": "110137899704764508404", "name": "Nicholas Keith", "time": 1578246931857, "rating": 5.0, "text": "Made picking up my kayak super easy and friendly", "pics": null, "resp": null, "gmap_id": "0x88891daf42af8ec3:0xd81ac8d45bc3c0f6"}
{"user_id": "113010369444447349969", "name": "Mike J", "time": 1578788923777, "rating": 5.0, "text": "Living up to there motto Helping the world keep promises!!!", "pics": null, "resp": null, "gmap_id": "0x88891daf42af8ec3:0xd81ac8d45bc3c0f6"}
{"user_id": "103315219566647854225", "name": "H D III.", "time": 1605278378119, "rating": 5.0, "text": "Great company", "pics": null, "resp": null, "gmap_id": "0x88891daf42af8ec3:0xd81ac8d45bc3c0f6"}
{"user_id": "113589281667350364367", "name": "V Johnson", "time": 1556760696592, "rating": 5.0, "text": "Super friendly! easy in easy out.", "pics": null, "resp": null, "gmap_id": "0x88891daf42af8ec3:0xd81ac8d45bc3c0f6"}
{"user_id": "117497571258483560541", "name": "Paul Sanford (PS)", "time": 1597857821636, "rating": 5.0, "text": "Awesome place", "pics": null, "resp": null, "gmap_id": "0x88891daf42af8ec3:0xd81ac8d45bc3c0f6"}
{"user_id": "107617823999567757489", "name": "Chris hill", "time": 1425372836199, "rating": 5.0, "text": "The best job I ever had.", "pics": null, "resp": null, "gmap_id": "0x88891daf42af8ec3:0xd81ac8d45bc3c0f6"}
{"user_id": "107086320337879568536", "name": "Jr Meloon", "time": 1566057399340, "rating": 5.0, "text": "Nice and friendly people", "pics": null, "resp": null, "gmap_id": "0x88891daf42af8ec3:0xd81ac8d45bc3c0f6"}
{"user_id": "103935185746467705518", "name": "Jon Mcleod", "time": 1506605926505, "rating": 5.0, "text": "Great place to work", "pics": null, "resp": null, "gmap_id": "0x88891daf42af8ec3:0xd81ac8d45bc3c0f6"}
{"user_id": "104847280887062000099", "name": "Chris bell", "time": 1492641652956, "rating": 5.0, "text": "Great work place", "pics": null, "resp": null, "gmap_id": "0x88891daf42af8ec3:0xd81ac8d45bc3c0f6"}
{"user_id": "106228589866823540985", "name": "Brad Burks", "time": 1476418774030, "rating": 5.0, "text": "Great place to work", "pics": null, "resp": null, "gmap_id": "0x88891daf42af8ec3:0xd81ac8d45bc3c0f6"}
{"user_id": "112677209952685006312", "name": "bwarren1975", "time": 1525916670324, "rating": 5.0, "text": "Awesome service", "pics": null, "resp": null, "gmap_id": "0x88891daf42af8ec3:0xd81ac8d45bc3c0f6"}
{"user_id": "112101429795797437196", "name": "Tim Reed", "time": 1501680093566, "rating": 5.0, "text": "My place of employment", "pics": null, "resp": null, "gmap_id": "0x88891daf42af8ec3:0xd81ac8d45bc3c0f6"}
{"user_id": "108833765567491866807", "name": "Madison Northrup", "time": 1608572186658, "rating": 5.0, "text": "Awesome and very friendly service! We use the shipping service there during their busiest time and they were very friendly and quick! Highly recommend using this business as shipping rather then the post office or any other choice.", "pics": null, "resp": null, "gmap_id": "0x88897d14f62ea909:0x90fb58612dddffe3"}
{"user_id": "110905265389094615493", "name": "Jason Dowling", "time": 1609087557099, "rating": 5.0, "text": "Great atmosphere, shipping in the back. Sandwiches in the front, who could ask for much more? ✌️", "pics": null, "resp": null, "gmap_id": "0x88897d14f62ea909:0x90fb58612dddffe3"}
{"user_id": "110890322584798452866", "name": "Kayla Priestley", "time": 1572547439642, "rating": 5.0, "text": "I sometimes go here to return Amazon purchases. They are always so helpful and friendly. For the first time I sat down and had lunch there. It was such a nice, comfortable dining experience even though I had a bunch of kids with me! They were very kind and accommodating. The chef salad was fresh, healthy and delicious. I can't wait to eat here again!", "pics": null, "resp": null, "gmap_id": "0x88897d14f62ea909:0x90fb58612dddffe3"}
{"user_id": "104979302760615509496", "name": "Henry Robertson", "time": 1595350964041, "rating": 5.0, "text": "It's in the back of an old store with wooden flooring, attached to a coffee shop.  They took care of me quickly, great atmosphere to pick up a sandwich too.", "pics": null, "resp": null, "gmap_id": "0x88897d14f62ea909:0x90fb58612dddffe3"}
{"user_id": "104804338498608459098", "name": "Champ Ion", "time": 1587057107325, "rating": 5.0, "text": "EXCELLENT Customer service. UPS drop off point.", "pics": null, "resp": null, "gmap_id": "0x88897d14f62ea909:0x90fb58612dddffe3"}
{"user_id": "113184118948763119677", "name": "Linda Ford", "time": 1558700613021, "rating": 5.0, "text": "These people are SUPER SMART at what they do and it is busy ALL THE TIME. Amazon makes doing a return dang near impossible, but these guys figured it out. GREAT PLACE!! VERY FRIENDLY! !!", "pics": null, "resp": null, "gmap_id": "0x88897d14f62ea909:0x90fb58612dddffe3"}
{"user_id": "110747516128449624789", "name": "jonathan crump", "time": 1549713735759, "rating": 5.0, "text": "These folks are always so helpful!  Thanks so much!", "pics": null, "resp": null, "gmap_id": "0x88897d14f62ea909:0x90fb58612dddffe3"}
{"user_id": "109758237651578878744", "name": "Jesse Martin", "time": 1547694322055, "rating": 1.0, "text": "FedEx has been constantly dropping my packages at the wrong address and now they have lost my phone I recently ordered. Now I have to go through this long process of contacting where I ordered it from and filing a police report just to try and get another one or my money back. If you have a choice don't use FedEx or at least not this FedEx.", "pics": null, "resp": null, "gmap_id": "0x88897d14f62ea909:0x90fb58612dddffe3"}
{"user_id": "109456461079273182919", "name": "Cecil Brown", "time": 1556496485547, "rating": 5.0, "text": "Wonderful customer service !", "pics": null, "resp": null, "gmap_id": "0x88897d14f62ea909:0x90fb58612dddffe3"}
{"user_id": "107459485962155245281", "name": "Dale Miller", "time": 1552934323895, "rating": 5.0, "text": "Good for package shipping", "pics": null, "resp": null, "gmap_id": "0x88897d14f62ea909:0x90fb58612dddffe3"}
{"user_id": "110527303023940401982", "name": "daniel reuben", "time": 1535943804059, "rating": 5.0, "text": "Very friendly I would go there again 😊", "pics": null, "resp": null, "gmap_id": "0x88897d14f62ea909:0x90fb58612dddffe3"}
{"user_id": "107883664956684109063", "name": "Lee Austin", "time": 1531776114876, "rating": 5.0, "text": "Very helpful.", "pics": null, "resp": null, "gmap_id": "0x88897d14f62ea909:0x90fb58612dddffe3"}
{"user_id": "110882473599909656140", "name": "Patrick Sims", "time": 1539258447383, "rating": 5.0, "text": "Debbie is the best!", "pics": null, "resp": null, "gmap_id": "0x88897d14f62ea909:0x90fb58612dddffe3"}
{"user_id": "111706196492720769056", "name": "Billy Thomason", "time": 1559353627316, "rating": 4.0, "text": "Small area of actual antiques", "pics": null, "resp": null, "gmap_id": "0x88897d14f62ea909:0x90fb58612dddffe3"}
{"user_id": "104245805782164956869", "name": "Jeremy Gossett", "time": 1473343865945, "rating": 5.0, "text": "FedEx and UPS Authorized Shipping Center.", "pics": null, "resp": null, "gmap_id": "0x88897d14f62ea909:0x90fb58612dddffe3"}
{"user_id": "103934359916977951038", "name": "Paul Godsey", "time": 1609101279141, "rating": 4.0, "text": "The Google direction don't give you the easiest way to this place", "pics": null, "resp": null, "gmap_id": "0x886284db02c254b3:0x7c16271d0ff9e4fd"}
{"user_id": "114280672560822281428", "name": "Ralph Fiscus", "time": 1523890414349, "rating": 5.0, "text": "The food here is great. No pool or jacuzzi. Prices are reasonable. Great staff. TV keeps playing the same thing on a loop. Smaller TV only plays boring videos. That Brewer guy is way too old to spell \"Great\" like that.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOVQ0MxkRfp1gaLrZUuz-iWTXDiiR047N8ZoR3i=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886284db02c254b3:0x7c16271d0ff9e4fd"}
{"user_id": "108098643440015472793", "name": "Chris Steely", "time": 1618445722663, "rating": 2.0, "text": "Was told item was in Decatur Warehouse and would be shipped out after the weekend. Two weeks later and three times being told it would ship out I finally received it.", "pics": null, "resp": null, "gmap_id": "0x886284db02c254b3:0x7c16271d0ff9e4fd"}
{"user_id": "118227196812919656833", "name": "G Bird", "time": 1504097830486, "rating": 5.0, "text": "Great place to work good money and part of the Teamsters.", "pics": null, "resp": null, "gmap_id": "0x886284db02c254b3:0x7c16271d0ff9e4fd"}
{"user_id": "112035170009145152684", "name": "Derek Floyd", "time": 1506982967841, "rating": 5.0, "text": "Good place to work teamsters backed by hoffia", "pics": null, "resp": null, "gmap_id": "0x886284db02c254b3:0x7c16271d0ff9e4fd"}
{"user_id": "106089088946088207188", "name": "greg birdwell", "time": 1523652067602, "rating": 5.0, "text": "Great place to work.", "pics": null, "resp": null, "gmap_id": "0x886284db02c254b3:0x7c16271d0ff9e4fd"}
{"user_id": "108440835422359242827", "name": "Lynn Brewer", "time": 1508943127964, "rating": 5.0, "text": "Gr8 job", "pics": null, "resp": null, "gmap_id": "0x886284db02c254b3:0x7c16271d0ff9e4fd"}
{"user_id": "104628133939113885715", "name": "Shoggoth Fodder", "time": 1622584605810, "rating": 5.0, "text": "I've been here maybe four times and have absolutely nothing to complain about.  The service is always incredibly friendly and helpful, and they really know their stuff.  I guess if I had to find a negative, it would be that the room is a bit small and can be crowded at times, but the kindness and friendliness of the staff make it an enjoyable place to be.  This place is well run, well organized, and well maintained.", "pics": null, "resp": null, "gmap_id": "0x88628b10cb8b37ad:0xa0ebe162b249f57b"}
{"user_id": "115137012775504877834", "name": "Joe Tillman", "time": 1592438421880, "rating": 5.0, "text": "I’m not sure what the folks with 1 Star or giving bad reviews. Went in there today for a public notary. The woman there was more than helpful and found me the cheapest shipping rates. Great experience.", "pics": null, "resp": null, "gmap_id": "0x88628b10cb8b37ad:0xa0ebe162b249f57b"}
{"user_id": "105087345668839625122", "name": "Farrah Tucker", "time": 1572915735964, "rating": 1.0, "text": "This place is horrible! My husband went in to ship a 2 oz bottle of vitamins back to the company and he was charged $18! They charge for a box and peanuts which is fine but they also charged him $5 to put it in the box! She never told him that he could avoid this charge if he packaged the item himself! I have always known that they were outrageously high on shipping but I will definitely never step foot back in this place! I don’t mind paying for goods and services but I never expected to be robbed by someone just to put a bottle in a box and tape it it up with tape and a box that I paid for! These people should be ashamed!", "pics": null, "resp": null, "gmap_id": "0x88628b10cb8b37ad:0xa0ebe162b249f57b"}
{"user_id": "105276969363573870710", "name": "Amy Starkey", "time": 1589048120093, "rating": 1.0, "text": "This lady charges wayyy too much. $5 to package something I had already bubble wrapped. Never going back.", "pics": null, "resp": null, "gmap_id": "0x88628b10cb8b37ad:0xa0ebe162b249f57b"}
{"user_id": "114927437682741146988", "name": "doris breasseale", "time": 1586113722062, "rating": 5.0, "text": "Great ladies to do business with.  Very helpful!!", "pics": null, "resp": null, "gmap_id": "0x88628b10cb8b37ad:0xa0ebe162b249f57b"}
{"user_id": "100505868790693810727", "name": "Stahler Heath", "time": 1610126534009, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x88628b10cb8b37ad:0xa0ebe162b249f57b"}
{"user_id": "103825872175411957604", "name": "Sarah Capps", "time": 1550891675193, "rating": 5.0, "text": "Great fast hones service, if the USPS can do it cheaper, they will let you know.  But usually I'm there because I don't want to wait in line at the USPS", "pics": null, "resp": null, "gmap_id": "0x88628b10cb8b37ad:0xa0ebe162b249f57b"}
{"user_id": "113973412303971582983", "name": "G Mitchell", "time": 1483884992903, "rating": 1.0, "text": "Very High Ship rates.. wanted $49 to ship  my package with UPS... I went 1/2 mile away and shipped with another Large UPS \"retailer\" for only $25.00! $24.00 savings! Later ,I checked on UPS site and sure enough the listed shipping rate(listed on website) was $25.. but some shady \"retailers\" add  very LARGE additional fees.. Beware of pakmail", "pics": null, "resp": null, "gmap_id": "0x88628b10cb8b37ad:0xa0ebe162b249f57b"}
{"user_id": "103544263873820500516", "name": "Maggie Wright", "time": 1565032635979, "rating": 5.0, "text": "Best ever people very friendly", "pics": null, "resp": null, "gmap_id": "0x88628b10cb8b37ad:0xa0ebe162b249f57b"}
{"user_id": "115035649157883417273", "name": "Summer Todd", "time": 1504236739263, "rating": 5.0, "text": "Came in desperate 1 minute before closing time and the lady helped me and never once acted bothered by helping me. This place is great because of the ladies that work there!!", "pics": null, "resp": null, "gmap_id": "0x88628b10cb8b37ad:0xa0ebe162b249f57b"}
{"user_id": "106480562051679944130", "name": "Amanda Havely", "time": 1505702616492, "rating": 1.0, "text": "Absolutely sad. Misinformed, ignorant. Waste of time and money for the company. If I was the employer I would be upset.  Will not ever return. Some businesses thrive when they mind their own businesses.", "pics": null, "resp": null, "gmap_id": "0x88628b10cb8b37ad:0xa0ebe162b249f57b"}
{"user_id": "116542279970834451387", "name": "Rich Morovitz", "time": 1512752148669, "rating": 5.0, "text": "Very friendly and courteous staff, tremendously helpful in shipping my bulky packages.", "pics": null, "resp": null, "gmap_id": "0x88628b10cb8b37ad:0xa0ebe162b249f57b"}
{"user_id": "101898207450388871825", "name": "M Kennedy", "time": 1489456151950, "rating": 5.0, "text": "Always attentive and nice.", "pics": null, "resp": null, "gmap_id": "0x88628b10cb8b37ad:0xa0ebe162b249f57b"}
{"user_id": "109054990236669021707", "name": "Stephanie Pugh", "time": 1527268416650, "rating": 5.0, "text": "Very nice lady", "pics": null, "resp": null, "gmap_id": "0x88628b10cb8b37ad:0xa0ebe162b249f57b"}
{"user_id": "112355922789886727099", "name": "Teresa Torres", "time": 1623111151755, "rating": 5.0, "text": "Brett from GNG autos was an very helpful individual. He contacted me quite often to inform me that he was working on the best possible pricing for the transportation of our 4 vehicles. He new and kept in mind exactly what my budget was and, what I would and would not pay. He kept in contact with me all the way until the end. Brett did a fabulous job and got me the best pricing as promised. Thank you for all you've done Teresa", "pics": null, "resp": {"time": 1623176850835, "text": "Thank you Teresa, it was a pleasure being able to help you. Please do refer us to your friends and family!"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "103085252640757836439", "name": "George Martinez", "time": 1615310541000, "rating": 5.0, "text": "My Experience with G&G Was perfect, they had perfect comunication and amaizing service they moved all my 3 Articulate Dump trucks", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP-IQTCLFz8lFhNJK96lgzNXzNvIh8CCFSKKdgc=w150-h150-k-no-p"]}], "resp": {"time": 1615329643399, "text": "🙏🙏"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "117381566466544596408", "name": "Alana Rodgers", "time": 1622400243511, "rating": 5.0, "text": "Exceptional service! Brett Robles at G&G Auto Transport made it very easy to understand the process to get my Jeep Wrangler transported. He was clear and concise since step 1 and throughout the whole process. Thanks again. Highly recommended.", "pics": null, "resp": {"time": 1622400967378, "text": "Thank you Alana, it was a pleasure working with you. Please keep our number and let us know if we can help you again"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "114877557766513087337", "name": "Umesh Kishnani", "time": 1621825416995, "rating": 5.0, "text": "Thank you for your professionalism! My experience with G&G Auto Transport was nothing short of exemplary. Brandon was utmost professional and thoroughly connected throughout the process. He even charged me the deposit fee after the driver had arrived and picked up my car. Please work with Brandon and team! I'll surely use their services next time I need my car transported!", "pics": null, "resp": {"time": 1621856009498, "text": "Thank you for choosing us Mr.  Umesh, we hope to work with you again soon"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "101044437182794405475", "name": "Logan G", "time": 1615469824591, "rating": 5.0, "text": "Best Company to move heavy equipments!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPrhrXu6qCq2bgJLOM3ZIyzzSaOFaHoOu-OTPBT=w150-h150-k-no-p"]}], "resp": {"time": 1615480321505, "text": "🙏🙏"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "108765404421403022764", "name": "Donna Brown", "time": 1620072658482, "rating": 5.0, "text": "I'll be using this company again.\nI am ill-equipped to be able to deal with this situation but Brett accomplished everything I paid for.\nI was given an itinerary that was delayed by 1 hour(Unexpected road work).\nThis company understands what their job is and takes the pressure off of myself.", "pics": null, "resp": {"time": 1621521445143, "text": "Thank you for your feedback Donna, we hope to work with you again soon"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "100493125780503441364", "name": "Debby Fischer", "time": 1623008977616, "rating": 1.0, "text": "I used G an G Auto to ship my car from Sacramento to  the Trenton TX area. I paid their deposit of $150 after they first quoted $100 and quoted first $800 then $850 to do the job. My son signed the contract and then the issues started. They were supposed to pick up my car on March 26, 2021 so it could get to Trenton Tx by end of March. They never called and I had to call them. Told me the driver is running late will call in the AM of March 27, 2021. Never called and no pick up. This repeated for 2 days. No one ever called back and I always had to chase them. Finally, a supervisor called back told me they driver was AWOL, the guy John who I was dealing with was fired and now they have to find a new driver,  like that was my fault. Took them days to get back to me after I spoke to another supervisor who said she would call back and guess what… no call back. Finally, they said the had a new driver and it would cost $1400 with $150 already paid so I would have to pay the driver $1250. After my son already signed a contract for $850. When I asked for a discount for my trouble and extra cost to rent my rental car for another week they told me no. I do not know how this company has such a high rating with the BBB when they obviously extorted $400 dollars from me to get my car to Trenton TX and another $700 for the extra week of my car rental. Not to mention they never called back and were dishonest from the beginning. This company is horrible. Find a different company and do not  trust rating from the BBB.", "pics": null, "resp": {"time": 1623013363615, "text": "We apologize about this please provide me an order # since i checked and we do not have an order under Debby Fischer."}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "114494768604812232492", "name": "Julie Weagley", "time": 1622256459628, "rating": 1.0, "text": "I hired them to transport my vehicle. For two days I was told that they would have a driver to pick up my car, several calls from me as to when they were going to be able to get the car. Told that they were having a difficult time finding a driver because the rate was too low. They rate that I was quoted by Brett at G&G. So I cancelled the service because they couldn't deliver what they promised. Then they have the nerve to change my debt card $200.00 without my authorization. I will be disputing the charge. You want to loose money and waste your time then this is the company for you.", "pics": null, "resp": null, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "112864359725708422539", "name": "Yolanda Neil", "time": 1612975780858, "rating": 5.0, "text": "This was my first experience with shipping my vehicle across country. Brett from G & G was the first person I called back after getting an overwhelming amount of shipping quotes. I shared with Brett he will the first contact I made and would continue to look around at other rates. Brett made sure I knew the right questions to asked, how to research other company as well as G & G.\nAfter speaking with other companies, I came back to Brett and G & G, due to the knowledge, responsiveness, transparency and customer service Brett offered. I would truly recommend G & G to anyone looking to ship their vehicle and know that you will receive quality service. Overall because of Brett’s ability to make me feel valued and he was working to meet my needs I would recommend G & G.\n\nThank you Brett for all you help!!!", "pics": null, "resp": {"time": 1612976747725, "text": "Thank you for your feedback Mrs Yolanda, we are proud to have met your expectations. Keep our contact and share it with you family and friends please. We hope to work for you soon!"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "108206575374534252591", "name": "SuperchargedSS1", "time": 1619726719889, "rating": 1.0, "text": "Scam artists. Their contracted driver provided a phony certificate of insurance.  When I brought it to Brett's attention he said he was going to talk to his supervisor and straighten it out.\nHe lied and never provides the correct one.\n\nAfter trusting them his driver proceeded to cancel the pickup 1 hour before the agreed to time.  Now G and G refuses to refund the $150 deposit.  A fraud case with the cc has been opened as well as a case with the FMCSA.\n\nTHIS COMPANY IS BAD NEWS. STAY AWAY", "pics": null, "resp": null, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "105267948240873417797", "name": "Jim Cuch", "time": 1615840890229, "rating": 5.0, "text": "Diana De Paz was fantastic. I really felt like she had my best interest in mind.\n\nI actually went with another broker first and then cancelled for their poor customer service. Diana stepped up, won my business and had a driver ready to pick up the vehicle within the hour.\n\nThanks!!!", "pics": null, "resp": {"time": 1615842632114, "text": "Thank you for your feedback Mr. Jim, we hope to work with you again soon!`"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "114244143052518370603", "name": "Jorge Perez", "time": 1615305430327, "rating": 5.0, "text": "I was recommended by a friend that uses G&G often, and I will do the same he did! recommend them to my friends! They have great customer service, Hunter was available at all moment answering all my questions, I was very satisfied when my car was delivered and will use them again!!", "pics": null, "resp": {"time": 1615329694968, "text": "🙏🙏"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "114174736794378540991", "name": "Brandon Perez", "time": 1620697640717, "rating": 5.0, "text": "I booked with other company but they were just playing with me, I got really sick of it so I contacted G&G they gave me a good price and they moved it the day I told them to, I had great communication they were really professional. I will highly recommend it and of course I will use it again.", "pics": null, "resp": {"time": 1620740389240, "text": "Thank you for working with us!"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "103644437642404714868", "name": "Carl Widener", "time": 1620070295179, "rating": 5.0, "text": "Brett was super nice and professional and the movement was awesome.   Will do business again for sure. Thanks", "pics": null, "resp": {"time": 1621521515169, "text": "Thank you for your feedback Carl, we hope to serve you again soon"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "118113397311118804576", "name": "The Monkey Brand", "time": 1618873890152, "rating": 5.0, "text": "G&G auto was amazing! Tony, the agent that helped me, especially. I really felt like he had in mind what was best for me and met my needs.", "pics": null, "resp": {"time": 1618934135984, "text": "thank you for your bussiness."}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "109770694028769484843", "name": "Marcus Owens", "time": 1618265996205, "rating": 5.0, "text": "Me an Brett Robles  have a excellent  relationship he made my  decision to go with him easy I had over 25 company  called me and I  turned then down for  Brett  Robles this guy really care about his  customers  I am shipping  over  a half a million  cars  🚗  an I a very pleased on how he handled things  thanks Brett 👍🏾", "pics": null, "resp": {"time": 1618275815710, "text": "Thank you for working with us God Bless!!"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "101282999161332448824", "name": "Tu novia La luna", "time": 1618873613840, "rating": 5.0, "text": "G&G is a wonderful company, every single time I have worked with them they have been the most helpful, they take all the factors into count and care for their customers.", "pics": null, "resp": {"time": 1618934330565, "text": "Thanks for working with us"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "109880992024718252278", "name": "Elmar Rojas", "time": 1618873680419, "rating": 5.0, "text": "My experience with G&G was amazing, they had perfect comunication throughout the whole process. The assistance, care and service the agent, Tony, provided was excellent.", "pics": null, "resp": {"time": 1618934321667, "text": "Thanks for working with us!"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "100421135786360650695", "name": "Heidy Alvarado Alvarado", "time": 1615310305411, "rating": 5.0, "text": "Great experience  in moving my International 4200, Great customer service . They always aupdated me, If you need any equipment to be shipped I  highly recommend this company.", "pics": null, "resp": {"time": 1615329657757, "text": "👏👏👏"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "107475515382333738695", "name": "Ricky Contreras", "time": 1615235150618, "rating": 5.0, "text": "Excellent customer\nAlways in  Communication from beginning to end.\nThats why I have continued to use G and G transports. Thanks to Brett and his customer service I will continue to do business with them.", "pics": null, "resp": {"time": 1615329741452, "text": "Thanks for the feedback Ricky. We are here when you need us"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "105056482511617335400", "name": "Asim Kazimov", "time": 1605568102532, "rating": 5.0, "text": "I ship vehicles all the time, I've used other car shipping companies before but I'm sticking with this one. Brett gives me the best price and works really hard to meet my expectations \"Promply and Efficiently\". The best part is that they are available 24/7! Highly recommended.", "pics": null, "resp": {"time": 1605635675981, "text": "Thanks for the feedback Mr. Asim, we are happy to have met your expectation. We are looking forward to working with you again soon."}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "111153913880653299597", "name": "Daniel Sloane", "time": 1616769283729, "rating": 1.0, "text": "I signed a contract with G and G Transport to have a vehicle transported from Florida to New York! After many many calls to someone named “Diana”, I think there must be 5-6 women named Diana there! I signed a contract with them on March 12th, 2021. The vehicle was supposed to be picked on March 26, I called that day and asked for a time windows of when they would be picking it up! I was then told they were still looking for a driver!!! This is 13 days after I signed the contract! They’ve done nothing about contacting me about pickup! They don’t return my calls, and I called their head office more than 90 minutes ago! He said he would call me right back! He didn’t!\nI would avoid this company like Covid 19! They have no clue what they’re doing and here I am, with a flight booked to Ny tomorrow morning, and my vehicle sits in my driveway!\nI would have to say, this is one of the worst companies I have ever dealt with!\nDan Sloane/Angelo Gencarelli", "pics": null, "resp": {"time": 1618275857758, "text": "we apologize for  this please in the future call at 256 272 9998"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "112188822502981734384", "name": "Dayana Miller", "time": 1615310201458, "rating": 5.0, "text": "jlg E450AJ\nprofesional company, they help me move my Boom Lift 100% recommended", "pics": null, "resp": {"time": 1615329678908, "text": "🙏🙏"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "102133578936861585441", "name": "Michael _", "time": 1609959968534, "rating": 5.0, "text": "They did a good job. There were a couple delays in picking it up, but the shipment arrived on time. Fairly priced & legit.", "pics": null, "resp": {"time": 1610033621858, "text": "Thank you very much for working with us!"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "110080166128930028816", "name": "Toni Sandoval", "time": 1603922462605, "rating": 1.0, "text": "DO NOT USE THIS COMPANY!!! I was in contact with Elsy for a month and she was very communicative, very friendly, very responsive. I was so excited to work with them until the Friday before my scheduled transport. She stop responding she strung me along all day believing that my vehicle would be picked up on the 26th and around 2pm she just stopped responding. I didn’t find out until after 5pm that my vehicle wouldn’t be picked up and  she hadn’t even notified me that the date would be pushed back or that she didn’t even HAVE A DRIVER!!! If you need transport I highly recommend Brad at Lightning Auto carriers", "pics": null, "resp": {"time": 1603979581917, "text": "We apologize for what happened Toni next time ask for a manager or call me at 256-272-9998 to prevent this from happening."}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "116589183410321314758", "name": "Gino Carlucci", "time": 1618350014308, "rating": 1.0, "text": "George called me names, failed to pick up the vehicle for 3 days, Overcharged me, Carrier said they were getting 750 and good ole George charge me 1050.00 Stay away from these guys.", "pics": null, "resp": {"time": 1618353129774, "text": "Sir we had 3 different drivers at different times, it's not our fault you could have the car ready. You working with multiple brokers doesn't help eather. We recoment choosing a company next time and stay loyal to them to avoid something like this from happening again. Your refund has be completed. Have a blessed day."}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "118265536265741013017", "name": "Tim Duncan", "time": 1596835472806, "rating": 5.0, "text": "This company offered the best price to ship my vehicle from Alpharetta, GA to Knoxville, TN.  I also checked their claim and they are indeed highly rated by the BBB.  Great personal service at a great price.  My personal thanks to the lovely Maria for seeing this through, because she was  there for me day and night.  So sweet, professional and helpful.  Thanks G&G Auto Transport, especially to Maria.", "pics": null, "resp": {"time": 1598486552832, "text": "Thank you for your business."}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "103294451360829009690", "name": "justin parsons", "time": 1596244656586, "rating": 1.0, "text": "***BEWARE*** DO NOT USE THIS COMPANY.  I scheduled a pickup for 7/31 to deliver my new vehicle from FL to NC.  Adam Gomez gave me a price of $600 and said my vehicle would be picked up and possibly delivered on 7/31but delivery would be no later than 8/1.  I called Adam at 8:30 AM on 7/31 to confirm pickup.  He said he would call me back in a hour or two.  At 1:30 PM, the car lot I purchased the vehicle from calls me.  They said they have here heard from G&G.  I called Adam and he told me they do not have a driver yet.  I told him that this was poor communication and he needed to call me back with a scheduled time for pickup.  At 6 PM I call G&G back and speak with someone different who says they still do not have a driver for my vehicle.  At 8 PM I receive a text from Adam saying they have a truck for $900 that can pick my vehicle up Sunday.  This is two days later than my original quote I and $300 more.  If you do not want your time wasted, use another company.", "pics": null, "resp": {"time": 1598551558020, "text": "Hi Mr. Justin I'm sorry to hear about your bad experience with our company, We're normally known for our exceptional attention to detail, and we regret that we missed the mark. Covid-19 has drastically changed the industry; prices are changing constantly, driver are staying home, there are looting and rioting all over the states etc. If you don't mind giving me a call at (256) 464-2554 at your earliest convenience, it would be greatly appreciated. We look forward to speaking with you and working toward earning back your business."}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "112157970455829624294", "name": "lana giorgobiani", "time": 1599087707260, "rating": 5.0, "text": "The best price to ship my vehicle from NJ to FL.  Great personal service at a great price.  Personal thanks to Mr. Adams to make this transaction very easy and pleasant.", "pics": null, "resp": {"time": 1599091584809, "text": "Thank you for choosing us, we hope we can do business in the future."}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "117367633701841229584", "name": "Sonia Cedeno", "time": 1594217289051, "rating": 5.0, "text": "I contacted this company and am giving them a good review not because they deliver my car not to their fault but because they were very professional and kept me informed on details. Hunter was absolutely very professional and great to deal with.", "pics": null, "resp": {"time": 1600263500196, "text": "Thanks a lot for your feedback mrs Sonia Cedeno, we hope to work with you again :)"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "117794203452514202813", "name": "Warren Mccloud", "time": 1587030558155, "rating": 5.0, "text": "I needed to get a car transported from Houston to Milwaukee, Wisconsin ASAP they made it happen. Great customer service, GREAT PRICE, and nice and respectful driver, car was picked up Friday made it to Milwaukee, Wisconsin that Sunday in perfect condition. I would definitely recommend GNG Auto Transport", "pics": null, "resp": {"time": 1589685440359, "text": "Thank you choosing us and we are happy to have met your expectations!"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "112800862367064515021", "name": "Jason Dennis", "time": 1598478577418, "rating": 1.0, "text": "I dont usually give negative reviews unless a company deserves it. And this company absolutely deserves it. I was to have my car shipped on a certain date and was ensured the driver would come. I ended up having to wait two days because the company was telling me false information and when I cancelled my pick up they never gave me my money back. This company is a sham and I wish for it to close down due to horrible services.", "pics": null, "resp": {"time": 1598486166724, "text": "Jason, we are truly sorry to hear that, our driver had many hiccups  at delivering a unit to the port and therefore he was unable to get to you fast enough, we apologize for everything please call me at 256-272-9998 to see how we can work it ask for Logan im the manager, we would love to get your business back."}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "113275475046698331807", "name": "Buba Jarjue", "time": 1597889369377, "rating": 1.0, "text": "GNG AUTO TRANSPORT VERY VERY POOR WHEN IT COME TO SERVICE, on Thursday the 08/13/2020 sign a contract for my truck to be pick up in Charlotte Nc I told them the due date for my truck to be pick up is Friday the 08/14/2020 they make a promise the truck will be pick up Friday morning not to worry.\nSo since they promise it will not pass the due date I was not worried.The date of the pick up around 1:45pm they call coming with lots of excuses the truck was never pick up the due date which end up costing me $160 cause the place was not open the entire weekend.\nThis is bad business promising a customer and not fulfilling it so please be careful with this company GNG AUTO TRANSPORT WHEN DOING BUSINESS WITH THEM BEFORE WHAT THEY DID TO ME HAPPENING TO YOU. I WILL NOT RECOMMEND THIS COMPANY WHEN COME TO MOVING YOUR CAR/TRUCK.", "pics": null, "resp": {"time": 1598918369656, "text": "Hi buba, sorry to hear what you went through i did not know about it any concerns please call me to find a solutions to the issue my name is Logan.."}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "107139965870826405426", "name": "jasmine cisneros", "time": 1594864711102, "rating": 1.0, "text": "DONT waste your time. They kept us waiting the whole day saying that they were going to pick up the vehicle and I already didn’t trust them so the unresponsiveness  definitely did it. It’s all about communication and that’s something they just couldn’t do.", "pics": null, "resp": {"time": 1614292217621, "text": "Sorry for the inconvenience. please give us call for future reference"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "117131285763928775227", "name": "tom Watts", "time": 1609192644331, "rating": 5.0, "text": "Responsible company that knows what they’re doing", "pics": null, "resp": {"time": 1609193688290, "text": "Thanks for the feedback Mr. Tom, we are happy to have met your expectations ;)"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "100621919247660806336", "name": "hener perez", "time": 1605555093375, "rating": 5.0, "text": "Great Service from beginning to end, this guys are the best.", "pics": null, "resp": {"time": 1605564894002, "text": "Thank you! For Choosing us!"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "105827401967236624812", "name": "Madinabonu Akbarova", "time": 1597255321379, "rating": 1.0, "text": "THE WORST COMPANY EVER!\n\nI could give them “LIAR OF THE YEAR COMPANY AWARD” !!! Totally waste of time! We have been waiting for 2days and they keep lying still! If you don’t wanna waste your time, look for another company!", "pics": null, "resp": {"time": 1598486395083, "text": "We are sorry for the delay in our response we were unable to find an order in our system under your name Madeena Akramova, if you need anything please call me at 256-272-9998 and i would appreciate if you  could check if you are sure leaving the comment to the correct company."}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "102023836510310491847", "name": "Shokhrukh Akramov", "time": 1597256279835, "rating": 1.0, "text": "EVEN DOES NOT WORTH ONE STAR\n\nI have been waiting for two days to pick my Ford F350, but they just wasted my time and money!!!", "pics": null, "resp": {"time": 1598486239432, "text": "Sorry for  taking so long to respond please call me at 256-272-9998-  to see how we can get it fixed we did not find an order under Shokhrukh Akramov."}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "113730446180130631506", "name": "Madinabonu Akbarova", "time": 1597255151845, "rating": 1.0, "text": "*****BE AWARE ****\nDon’t waste your time!!!!! They are not responsive!!! Liars I think it’s fake company!", "pics": null, "resp": {"time": 1598486514943, "text": "Madinabonu Akbarova unable to find your order in our system any questions call me 256-272-9998 to see how this can be fixed."}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "107740621491060073735", "name": "Candice Jones", "time": 1581744262856, "rating": 5.0, "text": "Great company that provides quality service at a reasonable price!", "pics": null, "resp": {"time": 1600263512947, "text": "Thanks a lot for your feedback mrs Candice, we hope to work with you again :)"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "114185372020057398661", "name": "Chad Finneman", "time": 1607482676776, "rating": 1.0, "text": "terrible company", "pics": null, "resp": {"time": 1611354648618, "text": "sorry we where not able to find an acct with you name"}, "gmap_id": "0x888a1da7b643a18b:0xa4bb3de63b59ef9d"}
{"user_id": "110901381016435385141", "name": "Lakendra Smith", "time": 1623323335591, "rating": 1.0, "text": "Every time my packages are delivered from this location my packages ALWAYS go the wrong address. They need to make sure these drivers are reading the correct and whole addresses. People would like to actually receive their packages. This only happens with FEDEX. This has happened to me on 4 different occasions. It showed my package was delivered but it’s not where to be found. This is a VERY VERY big inconvenience and poor customer service. I’m sure they don’t send their packages to someone else’s house. If I could chose what mail carriers could deliver my mail it SURE WOULDN’T be FEDEX not this location anyway. DEFINITELY DISAPPOINTED!!!!!!", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "105833351729459544773", "name": "Nikki Wilcox", "time": 1620436738958, "rating": 1.0, "text": "Looking for a good lawyer to represent all the customers that this place has stolen packages from.\nPlease help!", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "116238360565385026349", "name": "Michelle Wood-Capolino", "time": 1620135729038, "rating": 1.0, "text": "Too often I have to chase down my deliveries. They don't even get it to the right street or building,  let alone apartment.  And trying to contact the local hubs is next to impossible.", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "101606684503377931129", "name": "Mark Winslow", "time": 1623160344624, "rating": 5.0, "text": "out in the middle of no-where but they were very helpful", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "118129840810175429658", "name": "Steven Dyess", "time": 1604610194029, "rating": 1.0, "text": "Any package that goes to the Eastaboga, AL office is likely to be lost forever. I placed an order with a well known retailer 3 weeks ago and the driver left it at a house in different zip code. The retailer sent it a second time and I just got a notice that the delivery failed because no one was at home. I've been here all day, so he either went to the wrong house again or just lied about it. Calling FedEx will get you someone in India who can do nothing but write a report.\n\nFedEx stands all alone as the worst company on earth.", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "117091431483477945100", "name": "Richard Mannick", "time": 1597101771836, "rating": 1.0, "text": "I can't believe that a business like this only has one scanner and it's broke HOW do you run a business?????? Then I call customer service and they send me to places like Dollar General and they don't know nothing. But when you get send all over town by the service they provide and you can't even get a label printed and ship a package something is really WRONG. Don't know Want be doing business with FEDEX ANY MORE.", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "114542966748701095007", "name": "Heimdall's Gate", "time": 1612652476456, "rating": 4.0, "text": "Great service for everyone else except me ... Unfortunately I went to the wrong store.", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "113388407089080831743", "name": "Anitra Davis", "time": 1600801416115, "rating": 1.0, "text": "Waited 45 minutes during regular business hours to ship a package... made it all the way home n. They finally answered n said they was open but locked the doors bc a staff member had to leave. Went back still had to go to a different location the lady upfront didn’t know how to work the scanner to give back a receipt 9/22/20", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "115999864468797834629", "name": "Trevor Grubbs", "time": 1589819770312, "rating": 1.0, "text": "This place is the worst! Package sat on a truck to be delivered for (5) days! No delivery date could be confirmed.  Got fed up and ordered from another company that doesn't ship with FedEx, of course! This Eastaboga location seems to be incompetent and the 1 800 # is no help. Done with FedEx!", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "100605424041250108732", "name": "Hunter Webster", "time": 1604088634016, "rating": 1.0, "text": "Poor customer service from the lady in the front VERY RUDE. Will start using another location or ups.", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "109158620751733571764", "name": "elaine garduno", "time": 1590011292720, "rating": 1.0, "text": "Waited twenty mins in the front no one came out", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "110497104196944046515", "name": "Christine Wilson", "time": 1587405608055, "rating": 2.0, "text": "Delivery driver left my package 2 doors down from me today. Drivers from this location have been here several times so I don't understand why they left it at someone else's home. There is a sign on top of the mailbox with the address number on it. If I hadn't been watching for it I wouldn't have gotten my package.", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "109393312889510791773", "name": "Gene Peppers", "time": 1589127705889, "rating": 1.0, "text": "I want my packages that are disappearing!!! I’m going to report you to the police for THEFT", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "113059433672681033137", "name": "Johnny Carmicheal", "time": 1568736892348, "rating": 5.0, "text": "I thought the store was well ran and very friendly I would recommend it to anyone.", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "115613436598395999109", "name": "Deidra Milliner", "time": 1610744530742, "rating": 1.0, "text": "Customer service rep.", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "110229910328926115738", "name": "Little Big Truths", "time": 1559147368524, "rating": 1.0, "text": "Place is as scammy as they come! One of our packages has been delivered to wrong address and one of our neighbors brought it over. Second time, the driver scanned the product as delivered, but it never made it to our place. Basically, the driver either delivered it to the worn house again or flat out stile it. I’d wager it was stolen. We filed complaints, but nothing was investigated or reimbursed to us. Here’s reason why I’m inclined to believe that our second package was stolen - we forced them to deliver correctly was when we included a request to have package released under signature upon delivery. So driver knows where our place is and where to deliver... Now every time we order anything shipped, we specifically request NOT to ship items with FedEx...", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "110851076987678472442", "name": "Andrew Dunscombe", "time": 1597156331770, "rating": 5.0, "text": "Friendly and helpful experience", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "111480687387837464960", "name": "David Anderson", "time": 1575665691415, "rating": 1.0, "text": "They lied about attempting to deliver. I was sitting at home when I got a “missed you” text", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "101407076353403099491", "name": "Carmen C Yates", "time": 1531544639681, "rating": 5.0, "text": "I’ve had two Fedex packages delivered this week. BOTH ladies were excellent! I didn’t get the first lady’s name, but the second was Tria Sellers. Thank you for taking great care of my packages & making sure I received them!", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "106842510473317985184", "name": "TJ Redrock", "time": 1524263306882, "rating": 1.0, "text": "I can see why all the negative reviews. I had package scheduled to be delivered to our office and everything was on time until I got a delivery exception notification. It claimed that our business was close, which was not the case. We are under construction, but have very, very clear signs on directing traffic. Giving the benefit of the doubt, I called Fedex to let them know I need that pack THE DAY IT WAS SCHEDULED and that THEIR DRIVER is the one that failed to read clearly marked signs on where to deliver it. Neither UPS or USPS and any issues delivering. They sent the local hub the message that we needed the package that day. I scheduled this 15 mins after I got the delivery exception. The driver couldn't have been very far away at this time. After 5 o'clock I called again and basically said that they were not delivering it and that I could not pick it up until the next day. If I needed it the next day, that's when I would have scheduled the delivery. FedEx basically told me they don't care that it was their fault my package wasn't in my hand and they weren't going to do anything about it. Talk about great customer service. If you can, stick with UPS or even USPS if you want your package on time.", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "116111407769797302959", "name": "Lindy Alverson", "time": 1576371035739, "rating": 1.0, "text": "If I could give no stars, I would. My package has been at the facility since Wednesday and it is now Saturday night. Everyday I receive an email in the morning that my package is out for delivery and every evening I receive an email that no delivery was attempted. I tried to call and the customer rep hung up on me. Horrible place!", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "115163657621376496728", "name": "M.D. Harrell", "time": 1451986182234, "rating": 5.0, "text": "I missed a delivery and then drove 45 mins to this FedEx facility so that I could pick-up my package.  The facilities customer service operations stop at 6pm, but the driver wasn't going to be back until after 6.  The gentleman working the customer service center offered for me to wait in my vehicle until the driver returned and then he would come get me.  I received my package at about 6:15 and was able to head home very satisfied.", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "108362976726298584781", "name": "Tim Flood", "time": 1524859506533, "rating": 5.0, "text": "HAL package quickly staged upon my arrival, great security and communications. Fantastic experience.", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "111613303182408822964", "name": "Sandra Simpson", "time": 1512236492372, "rating": 5.0, "text": "as far as  the people  or drives r really nice  that bring you orders  to your house  i would gave them a `10 . now the man in my area for pick up  a 000 he will tell you go to the area where there is a store for you to drop it  and he will pick it up there", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "104908231797180356840", "name": "Vicky Li", "time": 1537235145953, "rating": 1.0, "text": "Horrible! I was waiting all day for my package by my door! Didn’t even come by and said “delivery exception”. The truck did not even come to my house yet they flat out lie and say I was not home when I obviously was!! They are the worst!!!", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "107291662569961994695", "name": "Matthew Sweeney", "time": 1508530452919, "rating": 1.0, "text": "FedEx is probably the worst shipping company in the world. If dudes in India can hand-deliver millions of lunches every day without getting anything wrong, a US company could at least have a functional website or a delivery schedule that accounts for people who work for a living.", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "106332479236336061186", "name": "Kim Fisher", "time": 1561768704356, "rating": 4.0, "text": "Always polite when I go to drop off my packages.", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "105175510950653969937", "name": "RMOONDOGGY", "time": 1454180168655, "rating": 1.0, "text": "Come to the door, already have their hang-tag filled out, tap once and high-tail to the truck and leave. Supposedly they will deliver on Saturday but will not even if the package was shipped with Saturday Delivery paid for....... Always the same...NEVER deliver on time.", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "106115880166146516456", "name": "Justlala Purkey", "time": 1466716139956, "rating": 2.0, "text": "Fed X 800 number is no help. You can't get in touch with the local office to ask a SIMPLE QUESTION. This is not really good business.  Can't say anything about the local office as I could not speak to anyone there.", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "109418759551299062970", "name": "Vicky Caldwell", "time": 1559495224425, "rating": 4.0, "text": "Good price and service", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "109770399512784564930", "name": "Melissa Moore", "time": 1459788881166, "rating": 1.0, "text": "If I could go lower than a 1, I definitely would! I have never had an accurate delivery come from this facility. It's like their drivers can't follow simple instructions. I mean, why would you try and deliver a sign for package outside of the specific instructions saying what times someone will be available to sign", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "101990735466026596231", "name": "Billy Voluntarist Burger", "time": 1420256140332, "rating": 1.0, "text": "Next day delivery. Yeah right! Got jacked around. My account has had specific instructions to leave all packages on front porch if no one is home. Called customer service several times. I got several different stories from several different people as to why package was not left. I was told I could drive 50 miles to pickup at the ship center on Saturday or wait until Monday for re-delivery. Then I was told that the shipper could request Saturday delivery. I conference the the shipper and Fed-ex and shipper provided account number for Saturday delivery. After being on the phone and talking to 4-5 diffrent people over a 2 hour period, I finally was told by a supervisor that the fed-ex ship center where my package was being held, was not even open on Saturday.REALLY? So due to thier incompetence not only will I not get my \"next day package\" on time, but when I do finally get the shipment, it will be useless to me. I guess I'm lucky I called back enough times to finally figure out that the ship-center was not open Saturdays, before I made a 100 mile round trip for nothing. Do not use Fed-ex if you need to get your packages delivered on-time. They cannot follow shipping instructions and are incompetent.", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "104719537383615923222", "name": "Zack Robertson", "time": 1475784965067, "rating": 1.0, "text": "Sat at home ALL DAY waiting for a delivery that would be here \"before 8 PM\". Walk outside to get something out of my truck and notice a tag hanging on the door. The driver didn't even attempt to ring the door bell or knock to where I could hear the door, and I only missed the delivery by 2 minutes. Tried to get in touch with someone from this facility to find out where the driver was, because I knew he had to be in my vicinity, only to be directed to some call center overseas where they didn't have any helpful information. If I could give zero stars, I would. Piss poor performance from this location.", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "116281253960147746430", "name": "Christian Smith", "time": 1526402393313, "rating": 1.0, "text": "Worst delivery I ever had ordered a car part I need for my only vehicle it was supposed to be delivered on the 11th they rescheduled it to the 15th and on the 15th I get a delivery’s exception for inspection worst company by far!!", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "112183806880483155214", "name": "Siomara Lopez", "time": 1473349992101, "rating": 1.0, "text": "wish I could give them a 0\nWaiting on a delivery for days, I even took a day off work to wait...when I checked online later that day, they had updated it saying they couldn't deliver because I wasn't home.. really bad service", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "108389291477513439513", "name": "Ken Davenport", "time": 1458695861374, "rating": 1.0, "text": "Several times on critical overnight or next day packages have not received them on time. Have received them as promised about half the time.  This FedEx location has terrible logistics. That is complicated by the fact that you cannot contact that place directly. So everytime I call I get someone in a central location who tells me that the bozo has \"put it on the wrong van\". So I had to cancel plans twice to stay in town to get the packages. Will not use FedEx again. Unfortunately the shipper use FedEx. They have not arrived at the same conclusion I have yet but they will with time\n\nUpdate 3months later....ok so since then I've had 4 more packages shipped with Fed Sux. One an expensive cello...arrived as promised. The other 3 ...DAYS late! It's unbelievable!!! UPS is killing FedSux. I get daily deliveries from UPS and you can bet your first born it will be delivered on the day it's promised", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "112678224471505987135", "name": "Angela Herring", "time": 1485439066927, "rating": 1.0, "text": "Horrible customer service!.  My mom waited at my house ALL DAY for a package that they delivered around 6:00.  I was there just before 6:00 and never saw them.  I wonder if they even knocked!  Use UPS instead!", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "108064846138241315789", "name": "Maria Newbold", "time": 1468885743103, "rating": 1.0, "text": "I had to drive about 30 min drive from my home to Eastabogo fedx location. My husband and I got there a little bit before 6pm (closing) time. We were surprised that the doors were lock because it was not 6pm. My husband knock on the door because the office inside light was on. I called the 800 number to see why the location closed early. The first customer service representative assistant that the location did not have a number. I hung up the phone and called again; the next customer rep was nice and she contact the location to see why the doors were closed before 6pm. Customer service rep stated that Jenny said that she was assisting another customer and she lock the door at 6pm. While i was on the phone with the customer rep the lady, Jenny, came to the door. She open the door half way and got my recipt and allowed me to come in the building. She stated to me that she lock the door at 6pm..i told her she didnt while still on the phone with fedx customer rep...the lady Jenny handed me back my reciept and told me I can get my package tommorrow. Customer service suck and that lady need to be fired.", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "114020309532702580573", "name": "Marcus Davinport", "time": 1526315892980, "rating": 1.0, "text": "Scanned bussiness closed at 630am.  Did not try to redeliver .   ........    still waiting on call back 2 plus weeks.", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "103284069270020186815", "name": "Isabela Venegas", "time": 1457818900289, "rating": 1.0, "text": "This place is horrible  because this is horrible service. We ordered our package to deliver on Saturday but they are closed even after you call Amzin twice to see if there is anyway to get it today they still say the cannot, while on the phone they treat me like I'm stupid and I don't like that at all.", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "100359662016954725290", "name": "Keren Wickey", "time": 1553316028136, "rating": 5.0, "text": "Very helpful and friendly!", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "101493416801490452398", "name": "David Lachman II", "time": 1437141673068, "rating": 1.0, "text": "An exercize in frustration. It's impossible to contact any FedEx facility and phoning customer \"service\" one gets someone different each time. My wife and I have been given contradictory information, promises have been made and not kept and it seems as if there's nothing we can do to affect what FedEx is going to do with the package we sent.  An absolutely terrible experience.", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "107358104168286123201", "name": "Racheal Bagley", "time": 1518898019922, "rating": 3.0, "text": "The website lies that are not open weekends. So sorry no idea of there any good.", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "110042564374907482496", "name": "Audrey Parks", "time": 1574764861488, "rating": 3.0, "text": "Friendly employees", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "118152298533655055910", "name": "Sonya Lloyd", "time": 1552993371752, "rating": 3.0, "text": "Sent off package", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "101140686031691413572", "name": "Heather Nichols", "time": 1525043953813, "rating": 5.0, "text": "I was in and out no problem", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "116788045489202211528", "name": "Joseph Gauldin (BanannaJoe)", "time": 1592528844808, "rating": 5.0, "text": "Very Friendly Staff", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "113474664133089658039", "name": "Jeff Watson", "time": 1532392203628, "rating": 1.0, "text": "Worst tracking I HAVE EVER SEEN !", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "108351957672070451415", "name": "#1 Remove Nameless", "time": 1531337764583, "rating": 1.0, "text": "Impossible to speak to anyone", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "108856614970536543100", "name": "Michelle Baker", "time": 1527307581579, "rating": 5.0, "text": "Loved it", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "102006534821730017164", "name": "Amy Lynne", "time": 1506657512321, "rating": 5.0, "text": "Very helpful and fast.", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "103453040022203531677", "name": "rachel bowling", "time": 1509193164763, "rating": 1.0, "text": "Sucks donkey. These people could care less.", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "113791568869619199640", "name": "DONNA MOORE", "time": 1506184900447, "rating": 3.0, "text": "I ordered 3 products at same time n day . 2 came Thursday for some reason this one went 15 minutes from me in Alabama to Georgia  now says I wasn't available on Friday for delivery when I was home all day", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "113358251050308476982", "name": "Luke Bailey", "time": 1488835916789, "rating": 1.0, "text": "Lousy job. Never again.", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "114127427374954625791", "name": "Mark Cuttie", "time": 1456422684214, "rating": 1.0, "text": "They wouldn't ship my package with direct signature at the time when i was at home for 3 days.Then i risked my job to stay home to receive my delivery to sign for it and they never delivered it.", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "104592757321245941993", "name": "Prettice Stockdale", "time": 1450975501665, "rating": 2.0, "text": "u pay for overnight and u get it 3 days later and u call can't talk to anyone except a Dam machine this location deliver when they want to no matter how importantit is to u to get your package it's have happen several times but eventually u will get your package.", "pics": null, "resp": null, "gmap_id": "0x888bcf0944ac4529:0x399cd70d8300bd13"}
{"user_id": "117652579935723379120", "name": "Michelle Bethune", "time": 1611752013196, "rating": 5.0, "text": "Pak Mail on Moores Mill has literally been my best friend while working remotely.  I often need to scan and ship and they are always friendly and professional.  They offer the best options for me and get the job done - so grateful for this team!", "pics": null, "resp": null, "gmap_id": "0x888ced8755137b9b:0x64cef06b08b8cf6b"}
{"user_id": "107330098598976656114", "name": "Eric Selz", "time": 1621014460593, "rating": 5.0, "text": "Fast, friendly and cheap. I will come back", "pics": null, "resp": null, "gmap_id": "0x888ced8755137b9b:0x64cef06b08b8cf6b"}
{"user_id": "112951111634915045161", "name": "hurtsboro fort davis", "time": 1614184744924, "rating": 1.0, "text": "Sent overnight by FedEx from this location on Monday.  Package had not arrived on Wednesday.  I called to check routing number and found out that it was misrouted and won't get there till Thursday.  Lady at Pak Mail was borderline rude.  Never again will I do business there and am still out over $55.", "pics": null, "resp": null, "gmap_id": "0x888ced8755137b9b:0x64cef06b08b8cf6b"}
{"user_id": "112419549329794200809", "name": "Casey Hall", "time": 1603292780722, "rating": 5.0, "text": "This is well run business that always takes care of whatever we need mailed.  Cant say enough good things.", "pics": null, "resp": null, "gmap_id": "0x888ced8755137b9b:0x64cef06b08b8cf6b"}
{"user_id": "116017562200736075182", "name": "Ryan Neal", "time": 1601127258400, "rating": 5.0, "text": "Glad to have these guys so close.  Really convenient.", "pics": null, "resp": null, "gmap_id": "0x888ced8755137b9b:0x64cef06b08b8cf6b"}
{"user_id": "108614393673397163525", "name": "M Stevens", "time": 1591710255029, "rating": 5.0, "text": "Fast friendly service going through the drive through during Covid-19.", "pics": null, "resp": null, "gmap_id": "0x888ced8755137b9b:0x64cef06b08b8cf6b"}
{"user_id": "103670823906354697840", "name": "Scott Fillmer", "time": 1521977149435, "rating": 4.0, "text": "They do what they are there to do, provide a solid reliable service to ship and they are very easy and convenient to drop off FedEx, UPS, or USPS. They don’t always have a ton of USPS supplies, which is ok but I’d do anything over having to go to the post office, and their prices are almost highway robbery. I get they have to mark up services, and for the most part shipping has become so expensive they are just passing along the cost, but it’s consistently very expensive to just take a box there to pay to ship if you are going UPS/FedEx. If so, get a prepaid label and drop it off, it’s just way too expensive. USPS prices are pretty standard so if sending Priority Mail just use a flat rate and ship from there.\n\nOutside shipping they have a great mail box service that will allow you to get an address that isn’t a PO Box but functions just like one. Prices are reasonable and the service is fantastic. Owners of the Pak Mail in Auburn are very involved in the community and support the area.", "pics": null, "resp": null, "gmap_id": "0x888ced8755137b9b:0x64cef06b08b8cf6b"}
{"user_id": "107406636835411382134", "name": "Erin Martin", "time": 1540255198931, "rating": 5.0, "text": "I won't use anyone else! GREAT customer service!", "pics": null, "resp": null, "gmap_id": "0x888ced8755137b9b:0x64cef06b08b8cf6b"}
{"user_id": "114027012586934888968", "name": "Eric Selz", "time": 1516544637759, "rating": 5.0, "text": "Fast, friendly and efficient.", "pics": null, "resp": null, "gmap_id": "0x888ced8755137b9b:0x64cef06b08b8cf6b"}
{"user_id": "103375681322199661591", "name": "Carlos Graf", "time": 1561471943196, "rating": 5.0, "text": "Quick service!", "pics": null, "resp": null, "gmap_id": "0x888ced8755137b9b:0x64cef06b08b8cf6b"}
{"user_id": "110236790598816636026", "name": "Spencer E", "time": 1485386054821, "rating": 1.0, "text": "Horrible attitude from lady behind counter. Will never my bring business back.", "pics": null, "resp": null, "gmap_id": "0x888ced8755137b9b:0x64cef06b08b8cf6b"}
{"user_id": "116057855735883239026", "name": "Loretta Smith", "time": 1487376107382, "rating": 5.0, "text": "Right on time for dropping off my package!", "pics": null, "resp": null, "gmap_id": "0x888ced8755137b9b:0x64cef06b08b8cf6b"}
{"user_id": "101813315923549277687", "name": "Damon Watford", "time": 1484561548136, "rating": 5.0, "text": "Great service!", "pics": null, "resp": null, "gmap_id": "0x888ced8755137b9b:0x64cef06b08b8cf6b"}
{"user_id": "106551467228385206486", "name": "Lauren Vernon", "time": 1623195459994, "rating": 1.0, "text": "I wish I could give 0 stars. Their delivery driver propped a 70 pound gun safe on my garage door. He/she did not knock to let us know where it was. When we opened the garage door it fell on my car!!! Now my car and the gun safe are damaged. To make matters even worse, they are currently ignoring my husband’s phone calls. Corporate said it was their responsibility to pay for the damages, but apparently the local office doesn’t seem to think so. Now I have another package to be delivered by them soon, and I am dreading it. I would purposely not order from any company that uses them if I could figure that information out.", "pics": null, "resp": null, "gmap_id": "0x88891b084070bdcf:0x2fdd184155ba24d"}
{"user_id": "118429817716433755424", "name": "Ethan R", "time": 1597872997906, "rating": 1.0, "text": "I guess we're just leaving things on the side of the road now.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMcI9JjtvnGOuLBXudwvyY7ePrdIybHP0vWt17n=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891b084070bdcf:0x2fdd184155ba24d"}
{"user_id": "112982908606165639165", "name": "Kimberly Smith", "time": 1620922684847, "rating": 1.0, "text": "A pure nightmare! Ordered lawnmower on walmart.com with 2 day delivery. Ordered Fri morning and was given delivery date of Monday. Monday morning at 6:08am, the package was scanned at Birmingham facility and \"Out for Delivery\" by the end of the day on Monday. Waited for package all day. Approx 7pm, status went from \"out for delivery\" to \"pending\". Started\ncalling for updates beginning Tuesday morning and package just seem to have disappeared. Customer service is obviously in another country and they can't tell me anything. It's Thursday now and still no package OR delivery date. I've offered to go pick it up and was told I didn't have that option. So my $300 paid in full lawnmower is no where to be found and I'm told I \"just need to be patient\". Who are they to decide when they want to deliver??? I will never use FedEx again nor will I order from any company that uses this carrier.", "pics": null, "resp": null, "gmap_id": "0x88891b084070bdcf:0x2fdd184155ba24d"}
{"user_id": "101993123302825649454", "name": "RED PILLED MIXED BREED", "time": 1623359176383, "rating": 1.0, "text": "I want to talk to a person in a computer bad service. What's the point on having a number if a (PERSON) isn't there!", "pics": null, "resp": null, "gmap_id": "0x88891b084070bdcf:0x2fdd184155ba24d"}
{"user_id": "110575764943343277603", "name": "Grace ʅʕ•ᴥ•ʔʃ", "time": 1612375411016, "rating": 1.0, "text": "This company needs to shut down. They suck.\nVery unprofessional and STEALERS", "pics": null, "resp": null, "gmap_id": "0x88891b084070bdcf:0x2fdd184155ba24d"}
{"user_id": "106931857294862056530", "name": "Alison W", "time": 1610726668753, "rating": 1.0, "text": "My e bike is shipping from Walmart so I had no control over woo carried it - omg! This has been a nightmare ! I’m 58 live alone and cannot move a 60lb package ! So I’ve tried Wlm sorts of ways ( notes outside , app notes etc ) to tell them to simply alert me abs I’ll open garage door - they can stick box straight onto truck bed ) my son said forget that and schedule to “hold for pickup “ the problem is I have no clue where to go in Birmingham and the app is no help !there has to be a main place but I have no clue .\nI hate this company", "pics": null, "resp": null, "gmap_id": "0x88891b084070bdcf:0x2fdd184155ba24d"}
{"user_id": "117685170867828667167", "name": "Donna Mencer", "time": 1614595948576, "rating": 1.0, "text": "I never get my packages on time through FedEx its usually several days to weeks after that they ever show up this shipping company should just close down for business and never open its doors again  byfar the worst shipping company ever and customer service is terrible ups is always on time and never late even during this pandemic", "pics": null, "resp": null, "gmap_id": "0x88891b084070bdcf:0x2fdd184155ba24d"}
{"user_id": "111481155208231093177", "name": "Scott Meyers", "time": 1621133565868, "rating": 1.0, "text": "Lost package and no updates for weeks….  Awful service.", "pics": null, "resp": null, "gmap_id": "0x88891b084070bdcf:0x2fdd184155ba24d"}
{"user_id": "103020964998499405556", "name": "Tony Ricco", "time": 1590506555391, "rating": 1.0, "text": "Said they could not locate my address but instead of calling me (which my number is on the package) they just decided not to deliver the package and reschedule for another day. UPS, USPS and Amazon have no problem finding my address. Please close down and let the professionals handle the shipping.", "pics": null, "resp": null, "gmap_id": "0x88891b084070bdcf:0x2fdd184155ba24d"}
{"user_id": "115160291721444931256", "name": "Holly Tyler", "time": 1592851132120, "rating": 1.0, "text": "I order a birthday gift for my boys that was suppose to be here last week. Now everytime I call they can not find it and no one never calls back. Worst place to send anything", "pics": null, "resp": null, "gmap_id": "0x88891b084070bdcf:0x2fdd184155ba24d"}
{"user_id": "114478730381345271169", "name": "BM", "time": 1591324107156, "rating": 1.0, "text": "Worst service and dishonest delivery drivers.  Was supposed to have package delivered on a Wednesday and they said nobody was home...(Lie!!).......second attemp on Thursday with the same nobody is home attempt..(lie!)......Birmingham, you need to get your Sh*t straight or hire somebody that can!!!!", "pics": null, "resp": null, "gmap_id": "0x88891b084070bdcf:0x2fdd184155ba24d"}
{"user_id": "103014464988185910772", "name": "Chris Stark", "time": 1604796129615, "rating": 1.0, "text": "3 out of 4 times Fedex doesn't deliver when they say they are. I get a notification that my package is loaded on the delivery truck in the morning and I never receive a delivery. The status then says \"Schedule pending\", with  no other information. Calling customer service is frustrating and a waste of time, they never have a answer or able to resolve anything.", "pics": null, "resp": null, "gmap_id": "0x88891b084070bdcf:0x2fdd184155ba24d"}
{"user_id": "117321034739569412704", "name": "drhardrock94", "time": 1596228336852, "rating": 1.0, "text": "They do not deliver on time. My shipment has been delivered damaged repeatedly. FedEx corporate should have stepped in long ago and fired the staff. Use UPS, USPS, or DHL.\n\nUpdate: they returned my package to the shipper after making no attempt to deliver. Company I ordered from (major retailer) made note to no longer ship to this area using Fedex and will only ship UPS moving forward.", "pics": null, "resp": null, "gmap_id": "0x88891b084070bdcf:0x2fdd184155ba24d"}
{"user_id": "109465015745238273505", "name": "Tyra Turner", "time": 1588298386994, "rating": 1.0, "text": "This has been the WORST service I’ve received! I’ve been lied to for two days about my package and still have no received it!!! And had a situation with another package just last week! I will NEVER send anything thing else through FedEx!!!!!!", "pics": null, "resp": null, "gmap_id": "0x88891b084070bdcf:0x2fdd184155ba24d"}
{"user_id": "111450300552845760961", "name": "Luke Bryant", "time": 1603555279091, "rating": 1.0, "text": "This is the worst company I have ever dealt with and will never use them again", "pics": null, "resp": null, "gmap_id": "0x88891b084070bdcf:0x2fdd184155ba24d"}
{"user_id": "117211486311548953856", "name": "xledllTroy Roberts", "time": 1576356771656, "rating": 1.0, "text": "Been waiting since December 10 for a package,that has been on a truck that long also,here it is the 14th and still no package.called and not one person can answer as to where my package is. As I told the last person good thing it was not meds I would be dead by now . They need to learn a thing or two from UPS . Worst company to deal with ever .", "pics": null, "resp": null, "gmap_id": "0x88891b084070bdcf:0x2fdd184155ba24d"}
{"user_id": "101907693188735297085", "name": "Elizabeth Jones", "time": 1586560819655, "rating": 1.0, "text": "Package was supposed to be delivered on the 6th. 6-8 said delivery not attempted.   Called  and was told that they don't know why it hasn't been delivered. That someone would contact me, well 2 days later (today) I called again and fedx told me they don't know what is going on and they started a investigation and someone was supposed to have called me. Still nobody has called and my package\nhas yet to be delivered.", "pics": null, "resp": null, "gmap_id": "0x88891b084070bdcf:0x2fdd184155ba24d"}
{"user_id": "103624304087825335795", "name": "Raven Minor", "time": 1574908682714, "rating": 1.0, "text": "Worste shiiping company available. Never seems to disappoint; either shipments are late, no show, missing, broken, or ripped open with items missing.....especially November through December.  My perishable baby food package left birmingham distro center at 7:10am (I live 45min away) here it is 9pm, no package🤔", "pics": null, "resp": null, "gmap_id": "0x88891b084070bdcf:0x2fdd184155ba24d"}
{"user_id": "115840201608708914569", "name": "L&S Taylor", "time": 1576209497068, "rating": 1.0, "text": "If I could give it no stars I would. This is the worst place ever. Package suppose be delivered on Monday here it is Thursday and still no package and this was multiple gifts for a Christmas party tomorrow. Even paid for express shipping. Still haven’t received the packages and was lied to when I called them. They stated the company put it for standard delivery and I had the company we purchased for on the other end of the phone that stated no they did not. It was sent express delivery and Belk had sent me the proof. Fedex phone rep still continued to lie on Belk. Then when told we were recording the conversation and wanted to see proof that Belk had sent the shipment out for standard 5-7 day delivery as he told us and have it emailed for documentation purposes he hung up because he knew he was caught in his own web of lies. On top of that, it shows the package has been at the Birmingham facility since the 10th and yet still hasn’t been delivered. The second package shows it is in Georgia and has been for 2 days with no movement. The rep said nobody would answer the phones at the Georgia facility in Kennesaw as well as this Birmingham facility so he couldnt speak with them about why the packages hasn’t moved or been delivered. This place is a total joke and fraud. They charge you for express shipping and never do it. That is the same as stealing from people. They take your money and then do not deliver. Horrible!", "pics": null, "resp": null, "gmap_id": "0x88891b084070bdcf:0x2fdd184155ba24d"}
{"user_id": "111932026090820778154", "name": "Google ruined Youtube", "time": 1587779765283, "rating": 1.0, "text": "This Birmingham fedex...They always deliver my package to my neighbor or it’s not on their truck when they stop to deliver. Incompetent", "pics": null, "resp": null, "gmap_id": "0x88891b084070bdcf:0x2fdd184155ba24d"}
{"user_id": "115774847936914939667", "name": "Jeff Powers", "time": 1585095486139, "rating": 1.0, "text": "Worst customer service of any company I have ever dealt with", "pics": null, "resp": null, "gmap_id": "0x88891b084070bdcf:0x2fdd184155ba24d"}
{"user_id": "102112239482429412130", "name": "robert furrh", "time": 1550961915790, "rating": 1.0, "text": "seems like the drivers cant read and then when you dont get your packages its up to you to do all the leg work fedex should just close and let ups handle everything then I know I will get what I have ordered and not have it sent to the wrong address and not be found", "pics": null, "resp": null, "gmap_id": "0x88891b084070bdcf:0x2fdd184155ba24d"}
{"user_id": "112898544799102770200", "name": "Abby Jones", "time": 1575547963040, "rating": 1.0, "text": "Waited ALL day on 12/4/2019 for a package that stated it was arriving and NEVER showed up!  Soo Angry!!!!! 😠😠😠😠😠\n\nWhere is my Package???  Beyond Ridiculous!!", "pics": null, "resp": null, "gmap_id": "0x88891b084070bdcf:0x2fdd184155ba24d"}
{"user_id": "116819157611226498323", "name": "Cheyanne Millwood", "time": 1584146606788, "rating": 1.0, "text": "TERRIBLE service and customer service!! Shipping always delayed!!! Lost my package!!", "pics": null, "resp": null, "gmap_id": "0x88891b084070bdcf:0x2fdd184155ba24d"}
{"user_id": "100778477980612477012", "name": "Glenn Michael", "time": 1590712843524, "rating": 1.0, "text": "terrible service and rude driver", "pics": null, "resp": null, "gmap_id": "0x88891b084070bdcf:0x2fdd184155ba24d"}
{"user_id": "104042989108467644047", "name": "Coco Foster", "time": 1568418706136, "rating": 5.0, "text": "Great c.f. service!!", "pics": null, "resp": null, "gmap_id": "0x88891b084070bdcf:0x2fdd184155ba24d"}
{"user_id": "112387282534351784523", "name": "Nelson Gurganus", "time": 1595542130790, "rating": 1.0, "text": "Unprofessional", "pics": null, "resp": null, "gmap_id": "0x88891b084070bdcf:0x2fdd184155ba24d"}
