{"user_id": "112318373947325999681", "name": "Jehle Dean", "time": 1622520030291, "rating": 3.0, "text": "I've NEVER seen a place to park here. We park the car elsewhere after launching", "pics": null, "resp": null, "gmap_id": "0x889a07998fb75647:0xdc75990ca16532f3"}
{"user_id": "105662408681677161136", "name": "Jane Biggs", "time": 1609884288863, "rating": 4.0, "text": "Good place to sit in your car and take in a great view.\nNice place to launch your boat.", "pics": null, "resp": null, "gmap_id": "0x889a07998fb75647:0xdc75990ca16532f3"}
{"user_id": "117925909566779679186", "name": "Nate Holland", "time": 1597764429789, "rating": 3.0, "text": "It’s not the nicest launch around, but it’s certainly not the worst.\nParking is near criminally short, less than 30 spaces with thousands of boats in the area.\nThe currents can get intense when the tide is going in/out, thankfully the ramp is sheltered relatively well so as long as you can get in the slot you’ll be good. The biggest challenge is docking with the currents and limited dock space available, overall though the benefit of being close to the pass is definitely worth it.", "pics": null, "resp": null, "gmap_id": "0x889a07998fb75647:0xdc75990ca16532f3"}
{"user_id": "100227297089796330047", "name": "Martin Stephens", "time": 1584341409494, "rating": 3.0, "text": "The pier is in good shape, however there isn’t near enough parking. If you park outside of a parking spot (even if you aren’t in the way) the marine police WILL have you’re vehicle towed. It’s 300$ or more to get it back. A little over the top if you ask me, give a parking ticket instead of towing it (if it’s not blocking anything or anyone). Instead, they tow it and charge 300$ To tow it about 4 miles.", "pics": null, "resp": null, "gmap_id": "0x889a07998fb75647:0xdc75990ca16532f3"}
{"user_id": "104936496752206521635", "name": "Julie Raupp", "time": 1611893227450, "rating": 5.0, "text": "Beautiful place at sunset.", "pics": null, "resp": null, "gmap_id": "0x889a07998fb75647:0xdc75990ca16532f3"}
{"user_id": "101960642484096243725", "name": "Patricia Smith", "time": 1618776277094, "rating": 5.0, "text": "Absolutely loved the park great staff American owned and operated. Very clean well maintained! Beautiful scenery on the Tennessee river....only draw back is the wifi! Other then that it was an amazing place to stay....we were there for 8 months! Thanks to all that made us feel like family", "pics": null, "resp": {"time": 1618778931155, "text": "Oh how I’m going to miss you, Patty!  You always left us smiling!  Thank you, and Godspeed."}, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "113268345278180324800", "name": "Attila Benoit", "time": 1591470559328, "rating": 5.0, "text": "Very nice and friendly place.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOo2Tiby3FsvSOxjiSadf0cOmUrAiz1OxXIcG4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPFRlOOExMHDmvO4VpL3o3hzrJerbBWZn2TxpI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN4nkG8K-6w2hg0uowHa6uItuuuC77yI6ZLMM8=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPFXP2xifc_cAF7qqTmc8xxc2NmrYxtuoL4r_I=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMtUngLkXMFyxXHF0DTNe4leo2KjvYRGsgzKtI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOzv-MbL3AxMqsmoe0Xv3KW30vz1cdcVEIoYwM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN8m1uNLE3oMYtosqf4hSPfGX4VnJuN8U2xgh4=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOvZi79xgC2SiWsZDRNfma1Ynp-7Z1ktQhky4w=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOLC_782HLEqHMj6jHfCaqj3tAzp5qJ3NAoEjc=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "104497490855548874361", "name": "Lesli Suttner", "time": 1618512089081, "rating": 5.0, "text": "Great campground! Beautiful site on the Tennessee River. Very clean and modern bathrooms. Definitely recommend. Will stay here again when I’m in the area.", "pics": null, "resp": {"time": 1618542377934, "text": "Lesli, thank you so much!  Safe travels."}, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "115038436799634670383", "name": "Cory McCreary", "time": 1615862133223, "rating": 5.0, "text": "We really enjoyed our two week stay here! Friendly tenants and staff. Quiet at night and spacious, gravel spots. Every site has a fire pit and picnic table. The community areas are great even though they removed the game room due to a fire. Bathrooms and showers are remodeled and clean. The laundry room is in need of an update but there are many  laundromats nearby if needed. Unfortunately, the WiFi is too weak to even connect to. Despite that, we would definitely stay here again.\n\nJust to note, it IS next door to a recycling plant but the noise was not bothersome to us. Also just to be aware, there are factories across the river that sound alarms on Mondays that could be mistaken for emergency alerts but are not.\n\n*** Because the WiFi issue is out of their control, I updated my review to 5 stars instead of 4.", "pics": null, "resp": {"time": 1615839914251, "text": "Thank you for your generous review.  The laundry room is currently being updated with the addition of more machines.  And yes, we despise the internet issue ourselves.  Unfortunately, we're located in a \"non-growth area\", so getting service is not possible, or fiscally not viable for our small business.  We're hoping we can get Starlink SOON!"}, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "116474018949000536867", "name": "Lisa Allred", "time": 1526255218615, "rating": 5.0, "text": "Very impressed with all the improvements done at Jays! So nice!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNkPyODDB0n2RWd1Hls-BOyjC79ieQvOCzFFwDB=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMXYyCSW3z2kjfWE4boxMjZvbPZB98XLRe1OtkI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP2WZ4aH3-9zyQOY61zAl9b1iARddwhVbjF52PC=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMdbZH_9-h_zETsiJFZrWZBVjZbHEi5U2L38n6F=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "104963270051357964225", "name": "Jessica Parker", "time": 1620954004942, "rating": 3.0, "text": "We stayed here 6 nights and had no internet the entire time. The lady at checkin stated that the company who had contracted to put internet and cable in had reneged on the work. Price per night should reflect lack of amenities stated on website. There is no clubhouse because the main office burned down and they converted the clubhouse into their main office. Neighboring noise from recycling plant during the day was annoying but tolerable. We felt like the price per night should have been between $30-$40 per night compared to other parks we have stayed in. Lake is beautiful and we enjoyed walking along the waters edge.", "pics": null, "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "106589878800610314413", "name": "Jim Shrader", "time": 1602288074249, "rating": 5.0, "text": "We've stayed at Jay Landings twice and were pleasantly surprised by all the updates. Elizabeth, Veronica and the staff are very friendly and were accommodating when we had to change reservations several times due to Covid restrictions.\nThe campground is clean with amazing views of the Tennessee River. Yes there are lots of full time campers but everyone is respectful and it's quiet at night. And the Sunsets are incredible.\nWe look forward to going back to one of our Homes away from Home.", "pics": null, "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "106312408278768151477", "name": "Clay Baldis", "time": 1623410486383, "rating": 5.0, "text": "Very nice facilities, love having my boat here!", "pics": null, "resp": {"time": 1623415331897, "text": "Thanks! We love having y’all here!"}, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "115636700869197182879", "name": "Daniel Lucas", "time": 1620087092818, "rating": 5.0, "text": "Friendly staff, and one of the lower costs in the Huntsville/Decatur area.", "pics": null, "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "110451862390374165389", "name": "kennykaren brown", "time": 1586866190843, "rating": 5.0, "text": "We came to Jay Landing on Super Bowl Saturday for a  3 month stay.  From the minute we arrived Valerie took very GOOD care of us.  On Sunday Joel and Elizabeth the owners threw a SUPERBOWL party worthy of Hollywood and   We met all our neighbors. This is a beautiful campground and Marina located right on the Tennessee River.  We have camped all over this USA and this is one of my favorite places.  EVER!!  I would highly recommend you check it out.   We hope to be back.", "pics": null, "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "118222471106571874039", "name": "george bush", "time": 1596688034713, "rating": 5.0, "text": "We are moving into the Jay's Landing RV Park for 5 to 6 months while the new house is built.  Jay's Landing is very clean and quiet.  Pool, laundry and right on the water if you have a boat.  Thus far we are very impressed and happy to be bere.", "pics": null, "resp": {"time": 1596719832406, "text": "Thank you, George. We are striving each day to finalize improvements. We hope all goes well with the process of building a new home. What an exciting time!"}, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "102810530345606228155", "name": "Daniel Ray", "time": 1595211077165, "rating": 4.0, "text": "Nice cozy place right on the river.  They had a pool, game room, first-come first-serve paddle board, kayaks, paddle boat.  Also a places to swim and fish(license required) in the river.", "pics": null, "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "117236004234624846336", "name": "Debra Sue Loyd", "time": 1601684417047, "rating": 5.0, "text": "We love it here. Grounds, facilities and amenities are well maintained.", "pics": null, "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "110412089006581829160", "name": "Linda mrsgagrandma@bellsouth.net", "time": 1604963291464, "rating": 1.0, "text": "Never checked iin spoke to them late Friday afternoon and gave 100 electric deposit called them Monday morning early and said plans changed on the job and wouldn't be coming and they said we used all but 4.00  of the deposit for the time we used we never checked in and  was there . Be careful", "pics": null, "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "111585681106274895891", "name": "Warner Arthur", "time": 1585673830709, "rating": 4.0, "text": "we had a great campsite, number 14. Water front and great view. Staff are all great. We did go thru tornado sirens and loud speakers saying to take shelter but I felt there was no place to go. We saw some folks around the bathhouse, but I doubt that would protect much.\nThe industrial complexes around us were 24/7 noise but inside we did not mind too much.  The paved road into the camp had huge dips and then also speed bumps, which really rocked the RV and the one near the road was so deep we bottomed out the hitch.", "pics": null, "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "114303109478296646668", "name": "Linda Gipson", "time": 1526853495950, "rating": 5.0, "text": "Beautiful place to visit for your RV parking or boating family fun", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipObDl-qNF234Uiry-FF_vOGIHruQ2RijMsy4hGN=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM4v_MxnWLw7HRcjFnqZWZDBap45I5fuql4vp-L=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "104294940253011592990", "name": "Kelvin Tigner", "time": 1612016888380, "rating": 5.0, "text": "Good people and no drama", "pics": null, "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "113896633609109736399", "name": "Ruben Moralez", "time": 1572507309546, "rating": 3.0, "text": "Overall this was a nice place to stay, recent upgrades were done to the road and bath houses. The pool was added but like every downside I’m going to mention, you have to pay to get your key pass and be sure not to loose it! The rent is supposed to be set but you’re always charged extra ALWAYS. I ended up paying 100 more every month because I went over my electricity supposedly. Other then paying more every month I’d say it wasn’t a bad stay the management is friendly for the most part I never had any issues with them. The spots are extremely tight and you can pretty much hear everything your neighbor is doing. There are loud noises from the plants around the park especially on the weekends.", "pics": null, "resp": {"time": 1572537813755, "text": "Thank you, Ruben, for your reply.  It allows us to provide information to future guests.   I'd like to respond to your \"downsides\".\n\nYes, we collect a $20 deposit on the \"key pass\" to the pool, which is similar to a hotel key to provide safe passageway into the pool for authorized users.  What you failed to mention is that you get that $20 back when you return the key, so you're not out any money.\n\nSecondly, the sites are metered, and tenants are charged .16/kWh for power usage, and one is invoiced anything usage over the $50 allowance.  Anyone is welcomed to monitor their usage by taking note of the meter reading.  It's certainly unfair for a 22' unit to have to pay a higher rent to cover the usage of a 42' unit which has 2 or 3 air conditioner units, therefore, we keep all things even by giving each monthly guest a $50 allowance toward their power.  How they use it is up to the tenant.  You were also here during the summer months when temperatures were extremely high and often record-setting, so yes, you would more than likely have a higher power usage to keep the camper cool.\n\nThirdly, the site you were on is one of our smaller and cheaper sites.  We have larger sites as well.\n\nLastly, we are located next to a scrap yard, and they do move scrap around 6 days a week.  Their weekend noise is no different than during the week.  You must have just been off on the weekends to hear it.\n\nAnd yes, we're continuing to make improvements on the property, including the addition of 21 more sites so we may welcome more guests!"}, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "114857665369474914851", "name": "Gloria Schulte", "time": 1569071767204, "rating": 4.0, "text": "Nice place. Bathrooms and showers are very clean. Pool is great. Not in great neighborhood but park is gated. Small but you can tell owners try to keep it maintained.", "pics": null, "resp": {"time": 1569145873202, "text": "Thank you, Gloria. I’d like to clarify. please. The area is safe, it’s just in an industrial area. Safe travels!"}, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "108405144497143874648", "name": "Carlton Daggett", "time": 1565501553337, "rating": 5.0, "text": "Highly recommend. Friendly staff, Nice pool, Water front Views. No problems with tenants here. I have been staying here for over a month now.", "pics": null, "resp": {"time": 1565577313914, "text": "Thank you, Carlton!  We are continuing to make improvements, so for you to take the time to post something positive is appreciated!"}, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "112104127514325125523", "name": "Calista Hans", "time": 1530211544726, "rating": 5.0, "text": "Great customer service! We were met by very friendly Jay Landings greeters as soon as we pulled into the marina who were helpful with all of our questions and getting us unpacked and settled in our boat for a long weekend stay. They also gave us a list of fun things to do and see along the Tennessee River. Bathrooms and facilities were clean and well-lit, and LOTS of great fishing!! We definitely plan on coming back!!", "pics": null, "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "118122030587862762128", "name": "Julie Ryan", "time": 1569788673465, "rating": 3.0, "text": "It's a beautiful places with a lot of recent upgrades. Very nicely recently renovated shower suites, nice pool, beautiful fire pit areas to watch the sunset.\n\nThe downsides are that the spots (especially the pullthroughs)are really small and cramped, the road into and through the campground while recently repaved is very narrow, the wifi is terrible, and the bugs are aplenty. We also noticed trash buildup in our sewage receptacle and broken glass all around our site.\n\nBased on older reviews, it appears they are taking steps to really improve the park and we hope that now that they've done some major things they'll take a look at the small things.\n\nWe'd also suggest they update their website with correct pricing as the price we were charged was about 25% higher than what their website quotes.", "pics": null, "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "100313156430514123342", "name": "Rosemary Swanner", "time": 1562587117090, "rating": 5.0, "text": "We stayed for July 4th holiday. Was a great vacation. The new pool was awesome. And the staff was very nice. Will go back soon.", "pics": null, "resp": {"time": 1562796003544, "text": "Thank you for your kind words, Rosemary!  We're pleased to hear from you, especially that you enjoyed the pool!"}, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "112550554242842637176", "name": "Terry Mims", "time": 1586874937155, "rating": 5.0, "text": "Great people. Very easy to deal with.", "pics": null, "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "108580503515539324573", "name": "Melissa Flowers", "time": 1572047233368, "rating": 5.0, "text": "I had a great time. If ever in Bama again, I would love to stay here.", "pics": null, "resp": {"time": 1572052287846, "text": "We would love to welcome your return. Thank you!"}, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "111872721078077838599", "name": "Loren Gard", "time": 1434763538382, "rating": 5.0, "text": "Stopped for the night while traveling.  Parked lake front with a great view. When we checked in the guy could not have been nicer. Price was very reasonable.\nIt was not crowded.\n\nWe were offered the free use of kayaks if we wanted.\n\nA great stop over when traveling. Stop short of the 280 space parking lot and have a waterfront wooded lot.", "pics": null, "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "103250149595644880423", "name": "David Jones", "time": 1409671817020, "rating": 5.0, "text": "Beautiful grounds with a peaceful and tranquil setting. Many amenities are close by. The owners are fantastic and treat you like family.\n\nThe facilities are spotless and the store is well stocked with boat supplies.\n\nThe boat repair service was done right the first time at very reasonable prices.\n\nAll in all we love this place and the people.", "pics": null, "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "115388722318308966973", "name": "Chris White", "time": 1515718579572, "rating": 5.0, "text": "I stayed here for the week of January 7-12 and it’s a very nice place. The staff is super friendly and helpful. It’s nice and quite plus it’s close to town but you don’t get all of the noise. I had a pretty easy time finding this place and easy to get into I would definitely recommend this place to anyone", "pics": null, "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "108515676496441058819", "name": "Debbie L", "time": 1495903012702, "rating": 5.0, "text": "We stayed the Memorial Day weekend here. We drove from Florida. Elizabeth and Joel were amazing hosts. They were extremely helpful and friendly. The park is well maintained. The bathrooms were clean. The price is right and the view was amazing. Definitely will be returning for the 41st Annual Hot Air Balloon Festival and will stay at Jay's Landing and Marina. I already have my reservation made.", "pics": null, "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "118392324169370369564", "name": "Sher Keb", "time": 1527521924361, "rating": 1.0, "text": "Very similar to roughing it by the river with electric, water and sewer.\n\nRegardless of anything (State or personal emergencies), reservations not cancelled 7 days in advance are not refundable where other campgrounds did give us a refund due to a state declared emergency. On May 27, 2018 when “The governors of Alabama, Florida and Mississippi declared a state of emergency in their states as Subtropical Storm Alberto spread north and west.\nAs for a overall review of Jay’s Landing in Decatur Alabama, see below:\n\nCon’s:\n-Interface with management done only by phone. Reservation, check-in & problem resolution.\n-400 feet of very pot holed narrow driveway. Many potholes in little bit of asphalt then much more potholes in the more clay than gravel drive. (Very muddy when it rains)\n-More long term “campers” in the park then recreational RV campers\n-Paper litter, cigarette butts, nut & bolts, metal scraps found on camp sites.\n-Bathroom & shower building is far from camping sites\n-Sites are close to each other\n-No fishing allowed.\n\nPro’s\n- 2 unisex bathrooms & showers were clean\n-Site utilities (electric, water & sewer) are convenient. Electric 30 amp circuit showed good connection and grounding.\n-Reservation email sent with a site map document with your site.\n-Picnic tables at each site.\n-Nice river view\n'Common area gazebo with a fire pit and a little playground.\n\nHas the makings of a nice RV park… Someday", "pics": null, "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "107168797488608095665", "name": "Dannyy Thompson", "time": 1595691179521, "rating": 3.0, "text": "Nice views and good for families", "pics": null, "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "107944361033235714209", "name": "millie boyken", "time": 1603201089186, "rating": 5.0, "text": "Fishing was good and camping was good", "pics": null, "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "117444100650644756284", "name": "Mike Bafundo", "time": 1540553316548, "rating": 5.0, "text": "It's a nice quite place on the lake. They staff is friendly and very helpful. It's a nice home away from home while working in Huntsville.", "pics": null, "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "115077059045438182155", "name": "Carolyn King", "time": 1443307581065, "rating": 5.0, "text": "A one night stay turned into four days. Would highly recommend this campground to fellow\nGood Sam Club Members.  The managers, the Gipson's are so nice and and go out\nof their way to make your stay a good one.  The view of Wheeler lake from your site\nis beautiful.and so relaxing.\nA & C King", "pics": null, "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "115044274756898306522", "name": "Suzie Albert", "time": 1430095145781, "rating": 5.0, "text": "We just spent two days at Jays Landings RV Park, and found it a great place to stay a day or so while traveling.  It was very relaxing watching the boats on the Tennessee River.  The owner and staff were very helpful and made our stay very enjoyable.\n\nSuzie & Darrell", "pics": null, "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "116093071786792843492", "name": "Jeff Rastin", "time": 1569462961791, "rating": 5.0, "text": "Growing and improving every year love to see that thanks", "pics": null, "resp": {"time": 1569672033790, "text": "We are trying!  Thank you for noticing and making a comment!!!  We hope to be complete by late Spring next year."}, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "114189703289297758577", "name": "D Vanloh", "time": 1466472723907, "rating": 5.0, "text": "We love Jay Landings Marina.  My wife and I spend a weekend there every summer and the owners are some of the most hospitable and friendly people we've ever met.  Our kids love the game areas they have almost as much as they love the chickens!  We will be back again soon!", "pics": null, "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "113595610755747182223", "name": "matt chitwood racing", "time": 1551619813809, "rating": 1.0, "text": "Worst RV campground we been to! We turned around and forfeited our money. But.... it is surrounded by metal scrap yards, if you like that kind of area.", "pics": null, "resp": {"time": 1557319475931, "text": "I am sorry you did not find us to your standards."}, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "105289903123281713218", "name": "April Scott", "time": 1595644298960, "rating": 5.0, "text": "Beautiful environment!", "pics": null, "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "105626102710464712769", "name": "Mary Novak", "time": 1459458126264, "rating": 5.0, "text": "Great views, clean restrooms! The owners are wonderful and so helpful.  The views are great and I really loved the fire pit and gazebo.  We will definately stay there again on our way to and from Gulf Shores.", "pics": null, "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "104621888184571670766", "name": "Donna Roy", "time": 1495902879808, "rating": 5.0, "text": "I can't say enough good things about Jay's landing and RV park. I've had a wonderful time here. Elizabeth and Joel go out of their way to make you feel welcome. I have already booked my site for next Memorial day weekend.", "pics": null, "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "116956407803215940597", "name": "Chris dillbeck", "time": 1522983765638, "rating": 2.0, "text": "Stayed for 2 nights with family.   This is in the middle of an industrial complex and felt like it is in a run down part of town.  Factory noise all the time.   The metal recycling yard is across the road.   Bathrooms are far away and pretty dirty.  Not to far from interstate.  Many long term campers.  Definantly not worth the amount we paid.  We stayed in site 14 on the water.", "pics": null, "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "113606654438900612898", "name": "Steve K", "time": 1522948510596, "rating": 4.0, "text": "Easy access to US-72 and nice location, especially if you have a boat and are looking for access to the river or an overnight stop between Atlanta and Memphis. The Wi-Fi seemed fine, and the laundry facilities were clean (although we didn't use them). The only recommendation is that they fill in some of the potholes on the drive in, as it's a little rough.", "pics": null, "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "108441054011545940324", "name": "Nancy Brown", "time": 1529247083676, "rating": 3.0, "text": "Shower area could have been cleaner\nPark and view on general was a nice view and peaceful setting.\nStaff was very friendly and nice and kid friendly.", "pics": null, "resp": {"time": 1557319679385, "text": "Please come back!  Yes, our bath house was in a “low standard” condition, but they have undergone renovation and are now stunning!!!"}, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "104107122649063831287", "name": "Renee Conway", "time": 1523507330322, "rating": 5.0, "text": "We went with all intentions of only staying a week to 10 days and enjoyed the camp site so well that we stayed for a month. Love the owners and employees are all so helpful and care about their property", "pics": null, "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "110276202252159778933", "name": "Jose Noway", "time": 1557293913206, "rating": 1.0, "text": "Might as well stay in a crackhouse. This place is just as dirty and has similar amenities. Only difference is the price.", "pics": null, "resp": {"time": 1557319399523, "text": "Mr. Stimpson, are you the owner of “The Other Woman”?  I’m not aware of another John/Jon Stimpson.\n\nCan you expound on what’s “dirty”?  If you’re referencing dusty, you are absolutely correct in referencing our previous state. However, we are undergoing major improvements and paving, which you wouldn’t know about since you haven’t been on the property nor a tenant in a year or so.\n\nIf this isn’t the same Mr. Stimpson, then please accept my apology, and will you further explain?"}, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "100763108007160163745", "name": "Faye Holt", "time": 1498580097366, "rating": 5.0, "text": "Sun set at Jay's landing", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNgRqsd32EYFIOijOX48FmROpE6a3XqzSbEDXNS=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "108829547367659534505", "name": "Dustin Pannell", "time": 1521548501994, "rating": 4.0, "text": "Good place nice ppl working nights very respectful... they tryed not doing thing around my camper while I was sleeping waited for me to get up and go to work first!!!!!", "pics": null, "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "113871904109743963954", "name": "Thomas Schmelzle", "time": 1551581601832, "rating": 3.0, "text": "Was a decent place to stay for a night.", "pics": null, "resp": {"time": 1557319485466, "text": "Thank you."}, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "105295776759968962869", "name": "Ronald Wojtylko", "time": 1545338849515, "rating": 1.0, "text": "Tight RV spaces, lousy internet.  Worst thing nay be that it is right next to SA recycling so at 6 am, the noise level gets quite high.  Place is a construction worker cash grab.", "pics": null, "resp": {"time": 1565663129566, "text": "Yes; some spaces are tight, but not all.  Yes, there is a recycling plant next door, and there are times when it is very noisy.  It makes me sad that you say we are a \"construction worker cash grab\".  We are in business to provide a nice place for \"construction worker(s)\", and when I have to turn someone down because we are full due to all of the work in the area, we feel badly that we cannot provide a safe environment for such wonderful tenants.  You haven't been here in awhile.  Please come back.  We are in the middle of major property improvements, and we'd like to think that you'd enjoy your next stay."}, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "118002583701077246958", "name": "chris corso", "time": 1466385525579, "rating": 4.0, "text": "We stayed for a night coming home from vacation and it was wonderful.  The facilities were very clean and the owners (who took over a few years back) keep the place ship shape and very pleasant.  This rv park/marina is surrounded by a lot of industry  but, this did not keep us from enjoying ourselves in the time we were there.  We had a great time checking out the giant old boats, chickens, playing basketball, and playing with the giant chess set and jenga.  This is not a traditional rv park with wooded surroundings, but we thought it was just great, and if we had brought our boat or fishing poles, we would have loved it even more as it is surrounded on 2 sides by water.  Recommend.", "pics": null, "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "107285913608635550939", "name": "Trish Juaire", "time": 1523139229245, "rating": 4.0, "text": "Nice place. Clean and respectable", "pics": null, "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "100248751667686807626", "name": "Spencer Campbell", "time": 1435759193556, "rating": 5.0, "text": "Come up one day and got a great offer", "pics": null, "resp": {"time": 1449625140715, "text": "Thanks!"}, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "109123574637933153018", "name": "Melissa Durgin", "time": 1517872819377, "rating": 5.0, "text": "Owners are very nice. Close to everything.", "pics": null, "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "108819832184208426936", "name": "Jon Stimpson", "time": 1535838949624, "rating": 2.0, "text": "Very dirty and spartan. Expensive considering the condition.", "pics": null, "resp": {"time": 1565663182997, "text": "You should revisit to see the improvements."}, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "110529333010218396784", "name": "Charles Dollar", "time": 1570664942719, "rating": 5.0, "text": "Yea,live in a marina,my kinda place", "pics": null, "resp": {"time": 1571417918814, "text": "Thanks, Charles!  It's coming along with more to come!"}, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "116475218649307060752", "name": "Brandon Chase", "time": 1441658437590, "rating": 3.0, "text": "Rates high compared to other rv parks close by.", "pics": null, "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
{"user_id": "107591624857877186506", "name": "john shallenberger", "time": 1512238377793, "rating": 5.0, "text": "Nice place , nice people", "pics": null, "resp": null, "gmap_id": "0x886285bb06e87b7f:0x94a3d5c4ffaec253"}
