{"user_id": "103080100546766466069", "name": "Eric Shugart", "time": 1576258274551, "rating": 5.0, "text": "What a fantastic experience. Very pleasant and repaired a gash that I thought was not repairable. In addition, I had a pair of boots with a rubber edge I didn't wear because of the wear. After about 45 seconds, the entire boot looked brand new. Going forward, they will be doing all of mine and my wife's show polishing and repair. Highly recommend to anyone with realistic expectations around shoe repair and or patch services.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "106072381611661291586", "name": "Sarah Ramdeen", "time": 1512244217727, "rating": 5.0, "text": "I wish I had thought to take before pictures of my boots. They look amazing now that the repairs are completed. I brought in two pairs of boots and the craftmanship on both are incredible. They look like new.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNRnAKN9X2IepudoP6VLYzySgWKd46073R0Lfg0=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "113393998999103138159", "name": "Jessica Cost", "time": 1591299240834, "rating": 1.0, "text": "THREE MONTHS ago, I took a pair of boots in for stretching. Still haven't gotten them back. I called about 6 weeks ago to check on them and the lady on the phone was very condescending and short. So, by the time I'll be getting them back, it will be too hot to wear them. IF I get them back...who knows at this point?! Save your time, folks. Go somewhere else.\n\nAlso, their showroom is disgusting. The whole place reeked of cigarettes and it's just a disheveled mess. Guess my boots will smell like smoke, too. Ugh.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "111395873695052236621", "name": "Kirk Ward", "time": 1537967993230, "rating": 5.0, "text": "I just don't see what the problem is.  The owner is very professorial, does a quality job and if you ask his opinion on something, be prepared for the answer.............whether you like it or not.  On this visit, her repaired a cut on the side of one of my boots and then did a really good job of cleaning them up without changing the color.  All at a more than fair price.  I will keep going back for as long as he is open.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "116337750171208002553", "name": "Elli Maye", "time": 1557157097961, "rating": 1.0, "text": "I brought in a pair of brand new shoes that needed a little sewing on a stitch for reinforcement. The repair work was shotty with threads hanging off and the stitch came out while I was still in the parking lot. I went back in, showed the lady, and she offered to try again, but with a trip coming up, there was no time for that. She did give me a full refund. It would've been nice to have the work done right the first time. The stitching was not the worst of it though. The smell of the business is of pure cigarette smoke. I was unable to get the smell out of my shoes and I ended up donating them. I don't understand why this hasn't been mentioned in any of the reviews. Word of caution: If you walk in and there is smoke hanging in the air, your items will smell like that and it won't come out.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "115788679123989731942", "name": "Cody Mac", "time": 1562764463499, "rating": 5.0, "text": "I've taken some custom leather shoes in multiple times for repairs (heavy wear and tear), and they always do a great job for me, at a reasonable price. If you need any shoe repair, or custom footwear repaired, definitely check them out!", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "104115964812741211739", "name": "Patti Jean", "time": 1580162531212, "rating": 1.0, "text": "Not a place I would recommend. I've been several times and each time the service is poor, they only take cash. Price changes from drop off date. Mediocre  at best.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "103617577515275419563", "name": "Jerry Barclay", "time": 1461850262596, "rating": 5.0, "text": "Highly recommended!  I needed a pair of dress shoes resoled, and needed them done quickly.  The owner gave me a quick turn-around date, had the shoes ready when promised, did very nice work and charged a very reasonable price.  I won't go anywhere else.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "116983769715430897611", "name": "hannah vaughn", "time": 1533401107760, "rating": 1.0, "text": "Honestly this guy is a joke and very unprofessional. We went in to get patches sewn onto our vests. He insulted another shops previous work, was disrespectful about our organization, and laughed and said he didn’t want future business if we had any, but he’d “be happy” to do the work we needed (he obviously was not excited about bringing him business). On top of all that, he said it would take a week to get the work done and scolded me for not asking about how long it would take over the phone? He couldn’t quote me a price over the phone so why would I ask about how long it would take if he “has to see the patches in person first”? We went to JT’s shoe repair and they had it done in an hour with exceptional quality and was nice as could be. Don’t waste your time with this guy, go to JT’s.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "110718460370893007797", "name": "Joseph Gibson", "time": 1512970940095, "rating": 5.0, "text": "Good prices and great service. He is honest and does not try to trick you into buying anything. He gets the job done.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "118050249585712961585", "name": "Ben Nemec", "time": 1517247041863, "rating": 5.0, "text": "Fantastic service. He'll shine, repair, and even recommend shoe brands based on his extensive experience in the industry.  Would highly recommend.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "108795607591870059607", "name": "Hegan Belue", "time": 1436560887447, "rating": 5.0, "text": "I had shoes polished and repaired.  Good work and reasonable pricing.  The man at the counter was very nice to do business with.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "101490841847462557006", "name": "Ben McDaniel", "time": 1556647114317, "rating": 5.0, "text": "They did a great job on a pair of shoes that I thought were ruined. They are super helpful and I would definitely recommend them to anyone!", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "111266290864855258793", "name": "David & Lisa McCord", "time": 1469936351373, "rating": 5.0, "text": "Brady's Shoe Repair is awesome!  Steve is very friendly and does excellent work.  Reasonable prices, quick turn-around time, and shoes that look like new again.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "109419116976408349387", "name": "Bonnie Harrison", "time": 1509374498108, "rating": 5.0, "text": "We have had our shoes repaired there for many years and he has always done an excellent job. We highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "115512278464062442451", "name": "Dave Root", "time": 1513963641104, "rating": 5.0, "text": "My mother broke my wife's favorite sandles.  Took them to Brady and he fixed them on the spot! Great service! I'll be going back!", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "112906954687000494213", "name": "soylent green", "time": 1492869721933, "rating": 5.0, "text": "always helpful and offers only the service i need, nothing that i dont need. bradys resoles both my work boots and my dress shoes and the work has always been done beyond my satisfaction. a plus is that the shoes are always returned looking better than when i dropped them off. i always recommend bradys.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "104707098972841612233", "name": "Farley Church Of Christ", "time": 1582825578701, "rating": 5.0, "text": "BRADY HAS RETIRED.  BUSINESS IS CLOSED.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "113966587557562553100", "name": "Sharp Shinerz", "time": 1559149357909, "rating": 1.0, "text": "If I could rate a absolute zero then I would . Had my boots for almost 4 months and every time I called he said it would be the next week . He was very rude over the phone and blamed the store that sent them to him for me as to why it was taking so long . Went in and they still was not done after . The boots had not even been touched . He was very rude and disrespectful. He said he told us not to come in till they was done . That the boot store that sent them to him was lying and he had not had them but a little while , but the boot store has receipt for when they mailed it and when he got them . A 2 week job turned into 4 months of nothing. He is a liar , unorganized, rude, disrespectful, and unprofessional. I nor the boot store I used will be using him again .", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "102181201063576670618", "name": "Barbara Lee Norris", "time": 1500819757869, "rating": 5.0, "text": "Excellent repair of three pair of shoes. Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "115132075894292883233", "name": "Katie Carpenter Stuhr", "time": 1468624474806, "rating": 5.0, "text": "The cobbler I recommend to all my friends...and you too.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "112699979732278133062", "name": "Lolita Jones", "time": 1551795408507, "rating": 5.0, "text": "Great place to take shoes for repair.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "118300175798471827665", "name": "Ric Patterson", "time": 1504127522050, "rating": 5.0, "text": "very pleased with his  work.....would recommend to anyone", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "103732718965218751981", "name": "Bill Allen", "time": 1471704273716, "rating": 4.0, "text": "They do a great job on shoes and boots. They do a horrible job of seeing patches to leather jackets/vests.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "109573694006607509589", "name": "Dana Dunne", "time": 1507363902642, "rating": 1.0, "text": "He insinuated my purse was cheap and that he could not repair it. Very rude.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "103426656294688436208", "name": "DJ Sam Smite", "time": 1531165157527, "rating": 1.0, "text": "Not done with excellence in mind. One should never have to pay for a repair and then be suggested to have to take it home to complete the repair with a touch up job. Counter productive.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
{"user_id": "100693737314065081755", "name": "Amber Bianchini", "time": 1366585164371, "rating": 2.0, "text": "The repair was poorly done, expensive ($20 for stitching and glue on soles), and new damage was done to my shoes.  When I asked about the new damage, I was treated extremely badly.  I will not be returning.", "pics": null, "resp": null, "gmap_id": "0x886212cec493ca7b:0x249e4e4502f2ec94"}
