{"user_id": "100827375924341717730", "name": "Simon Ranagan", "time": 1622226191925, "rating": 5.0, "text": "I found Dave on accident while looking for a place to stay on super short notice.  Not only did he personally call me to ensure everything went smoothly with renting, he continued to be personally involved in my stay, routinely checking to make sure I had everything I needed and was comfortable.  The few times I had any issues, like a small incident with the city dumping tree trimmings where I would park, he was super responsive and helpful in resolving the issue almost immediately.\n\nThe house itself was great and the location was super convenient.  It was a less than 10 minute drive to downtown, grocery stores, and the mall by exit ten, but also a quiet enough neighborhood that I could feel at home at the end of my day.  It was also a two block walk to Lakebottom Park, which really can't be beat.\n\nProbably the best part of my experience with renting from Dave though, was that he is 100% serious about looking out for people who have rented from him.  While moving to a new duty station, I contacted him asking if he wouldn't mind being a reference on a lease application.  He had the reference forms filled out and sent back to me just a couple hours later.  He is seriously awesome.\n\nIf I'm every back in the Columbus area again, he is the first person I would contact to rent from, without hesitation.", "pics": null, "resp": {"time": 1622232960228, "text": "It was my pleasure to host you Simon, good luck to you with everything. -Dave"}, "gmap_id": "0x888ccb76728417bb:0xd3c749a16486b273"}
{"user_id": "111534572610553468675", "name": "Lauren Mills", "time": 1595690477323, "rating": 5.0, "text": "I enjoyed  working with Dave at Going Places. He is very helpful, understanding, and strives to assist renters in every way possible! 5/5 stars for sure! Would give more if I could! Thanks again for all your hard work!", "pics": null, "resp": {"time": 1607382527813, "text": "Thanks Lauren! Till next time! :)"}, "gmap_id": "0x888ccb76728417bb:0xd3c749a16486b273"}
{"user_id": "104830898289542293067", "name": "Matvey Vikhrov", "time": 1572186529001, "rating": 5.0, "text": "The house is located in a nice location in proximity to the Lakebottom Park and Fall Line Trace running/biking trail. The house is large, dog friendly, with a secure backyard.\nDave is an honest person is easy to deal with. I recommend this family business.", "pics": null, "resp": {"time": 1607382554926, "text": "It was our pleasure to host you and your family!"}, "gmap_id": "0x888ccb76728417bb:0xd3c749a16486b273"}
{"user_id": "103544209742580863321", "name": "Elizabeth Westphal", "time": 1563228922564, "rating": 5.0, "text": "Dave is very professional, respectful and honest. He is great to work with and is very knowledgeable about Columbus and surrounding areas. I trust him with my business and would recommend him to anyone. Thank you Dave and Goings Places!!", "pics": null, "resp": {"time": 1563285356602, "text": "Thank you so much for your kind words Elizabeth! We look forward to seeing you again!"}, "gmap_id": "0x888ccb76728417bb:0xd3c749a16486b273"}
{"user_id": "100427620200208984381", "name": "Christina Holladay", "time": 1569432857505, "rating": 5.0, "text": "Dave and Goings Places is the best part of our move from Savannah to Phenix city! He worked with us every step and made sure we were taken care of! I wouldn’t trust anyone else!!", "pics": null, "resp": null, "gmap_id": "0x888ccb76728417bb:0xd3c749a16486b273"}
{"user_id": "106417505229458271280", "name": "Georgia Maese", "time": 1568938988606, "rating": 5.0, "text": "Had such a great stay! I definitely suggest staying here for BCT family day and graduation .", "pics": null, "resp": null, "gmap_id": "0x888ccb76728417bb:0xd3c749a16486b273"}
{"user_id": "104439693879016921222", "name": "A Speaks", "time": 1551460612775, "rating": 5.0, "text": "I had a very great experience working with Mr. Goings.Very professional, and hard working! I would definitely recommend Goings Places LLC.", "pics": null, "resp": {"time": 1551475208393, "text": "My job does not stop at closing. Reach out if you think I can ever help!"}, "gmap_id": "0x888ccb76728417bb:0xd3c749a16486b273"}
{"user_id": "107879453969803753276", "name": "Dwight Harrison", "time": 1538409357161, "rating": 5.0, "text": "Fair and knowledgeable. Dave & Goings Places are great to work with and will 100% recommend.  Thank you so much!!", "pics": null, "resp": {"time": 1563285511531, "text": "Thank you so much for the opportunity to serve! We look forward to working with you again!"}, "gmap_id": "0x888ccb76728417bb:0xd3c749a16486b273"}
