{"user_id": "104625960457922970656", "name": "Amanda Woodard", "time": 1623255754773, "rating": 5.0, "text": "Absolutely love this store.  They have an interior decorator on hand as well.", "pics": null, "resp": null, "gmap_id": "0x8889cbbfc3503a6b:0xb38df395e512e42c"}
{"user_id": "117339375945539569224", "name": "Jason Nicklaus", "time": 1465948498135, "rating": 5.0, "text": "This is a great home decor and furnishings store located in the revised downtown district of Cullman. You can also find unique gifts both big and small for anyone. I would recommend you at least stop in and take a look around as well as meet the great staff when you are in the area.", "pics": null, "resp": null, "gmap_id": "0x8889cbbfc3503a6b:0xb38df395e512e42c"}
{"user_id": "108204809502468578802", "name": "Wendy Wallace", "time": 1467407926664, "rating": 5.0, "text": "Very nice boutique shop. They are classed a home decor store but they truly have a little bit of everything here.", "pics": null, "resp": null, "gmap_id": "0x8889cbbfc3503a6b:0xb38df395e512e42c"}
{"user_id": "108545806718892733964", "name": "Amy Hancock", "time": 1507221444252, "rating": 5.0, "text": "Beautiful furniture and decor! They have items you just can't find anywhere.", "pics": null, "resp": null, "gmap_id": "0x8889cbbfc3503a6b:0xb38df395e512e42c"}
{"user_id": "101855414186147590130", "name": "Amy Hancock", "time": 1498167136263, "rating": 5.0, "text": "Gorgeous furniture and decor! Friendly staff and not overbearing.", "pics": null, "resp": null, "gmap_id": "0x8889cbbfc3503a6b:0xb38df395e512e42c"}
{"user_id": "115927340072809927438", "name": "Lance Stricklin", "time": 1625769443436, "rating": 5.0, "text": "Alisha and the shop’s owner made the most perfect arrangements for our loved ones funeral.  They went well beyond what anyone else would have done and took a simple idea through to a masterpiece. Do yourself a favor and take all your floral, decor and gift needs to them. You’ll be happy you did! A big thank you to everyone at Musle Shoals florist!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPJhl-01_yeGgW786GWPpKHeF9_lQ6vy-E8b52C=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x887d4eb6ed4ce74d:0xf4773df3daae3fbb"}
{"user_id": "105371804635247421783", "name": "Jamie Gilliland", "time": 1617201132381, "rating": 5.0, "text": "I absolutely love doing business here! They are very friendly, take the time to understand what you want and even though I ask a 1000 questions they don't make me feel like I am bothering them. They answer my questions and make sure I am satisfied with what I am ordering or if I have any more questions. It doesn't matter when I need something they have never turned me down. They do beautiful work and are very friendly! I highly recommend this florist!", "pics": null, "resp": {"time": 1617303839422, "text": "Thanks for that great review. We feel like we've got the best customers in the world and clients like you make this work fun and meaningful for us."}, "gmap_id": "0x887d4eb6ed4ce74d:0xf4773df3daae3fbb"}
{"user_id": "103628300943772943408", "name": "Samantha Dotson", "time": 1617203200210, "rating": 5.0, "text": "They always have a huge smile on their face like they are all happy to see ya. It’s never a bother for them to help to me out. I have a personal account and I just call for flowers, blankets, plants, and unique gifts too to be sent. Awesome place to do business with.", "pics": null, "resp": {"time": 1617303807076, "text": "We really appreciate those kind words! Thanks!"}, "gmap_id": "0x887d4eb6ed4ce74d:0xf4773df3daae3fbb"}
{"user_id": "105927924075118209652", "name": "Jennifer Pearson", "time": 1617202527134, "rating": 5.0, "text": "This is by far the most creative and wonderfully staffed Florist we've ever used. We have used them so many times I can't remember and all we do is call and give an idea of what we'd like and it comes out beautiful and more creative then we could have ever imagined. I would most definitely recommend everyone to use them for any occasion you may have. 5 star's and more in my eyes.", "pics": null, "resp": {"time": 1617303813471, "text": "Thank you for being our customer! We're glad you were pleased with our Florist. It’s always a pleasure"}, "gmap_id": "0x887d4eb6ed4ce74d:0xf4773df3daae3fbb"}
{"user_id": "106220236391468380964", "name": "Cheryl Thompson", "time": 1619696389460, "rating": 5.0, "text": "I called at 4pm the day before the funeral of a very dear friend with a specific arrangement in mind. Not only did they accommodate my request they did a beautiful job on it at a reasonable price. Will definitely use them again.", "pics": null, "resp": null, "gmap_id": "0x887d4eb6ed4ce74d:0xf4773df3daae3fbb"}
{"user_id": "104120018084605951319", "name": "Bevan Wilson", "time": 1617201597936, "rating": 5.0, "text": "Great customer service experience! And the arrangement was gorgeous! I was surprised at all the gifts that they offer, not just flowers. They have all occasions covered. Great job ladies!!!!", "pics": null, "resp": {"time": 1617303829400, "text": "We really appreciate that feedback."}, "gmap_id": "0x887d4eb6ed4ce74d:0xf4773df3daae3fbb"}
{"user_id": "101363441681415845682", "name": "shay shay", "time": 1612710299645, "rating": 5.0, "text": "Best florist around! Although im in N.J. i always use this shop to send flowers to my loved ones in Alabama. They have the most beautiful arrangements! Alisha is the best so professional and pleasant. I will continue using this shop for all my flowers 🥰. They are AWESOME!", "pics": null, "resp": {"time": 1613155452534, "text": "Thanks for that great review. We feel like we've got the best customers in the world and clients like you make this work fun and meaningful for us."}, "gmap_id": "0x887d4eb6ed4ce74d:0xf4773df3daae3fbb"}
{"user_id": "116877542616610588283", "name": "Sunshyne “Sunshyne” Brown", "time": 1615582916777, "rating": 5.0, "text": "Very friendly people and Detailed!! The flower arrangement is always so beautiful. It feels like home in the store. I ONLY shop here for flowers! 💚", "pics": null, "resp": null, "gmap_id": "0x887d4eb6ed4ce74d:0xf4773df3daae3fbb"}
{"user_id": "107078217808082055700", "name": "Bryan Tardo", "time": 1617219835797, "rating": 5.0, "text": "Great place. Helpful advice. Friendly people.", "pics": null, "resp": {"time": 1617303856163, "text": "Thank you for being our customer! We're glad you were pleased with our service"}, "gmap_id": "0x887d4eb6ed4ce74d:0xf4773df3daae3fbb"}
{"user_id": "107905549256952925290", "name": "Darrin Mcdowell", "time": 1581824701841, "rating": 5.0, "text": "This place made a beautiful arrangement for my wife on Valentines Day (02/14/20). I wanted to get her roses and they surpassed my expectations! They created a huge arrangement of red roses and added pops of color (blue and white). Extra friendly staff who delivered the arrangement to my wife's job within 3 hours of placing my order. I highly recommend to check them out! You wont regret it.", "pics": null, "resp": {"time": 1582035364065, "text": "Thanks for that great review. We feel like we've got the best customers in the world and clients like you make this work fun and meaningful for us."}, "gmap_id": "0x887d4eb6ed4ce74d:0xf4773df3daae3fbb"}
{"user_id": "106473144445870658150", "name": "Nancy Steadmon", "time": 1601903383711, "rating": 5.0, "text": "Felicia did my daughters wedding flowers, they were beautiful exactly what was described to her. Very nice to work with and even delivered early.", "pics": null, "resp": {"time": 1613155460727, "text": "Thank you for being our customer! We're glad you were pleased with with the wedding. It’s an honor to be a part of your special day."}, "gmap_id": "0x887d4eb6ed4ce74d:0xf4773df3daae3fbb"}
{"user_id": "105303740487271197885", "name": "Tina Jhin", "time": 1578121358857, "rating": 5.0, "text": "Muscle Shoals Florist is the Best!  They have made stunning arrangements for our family for years.  Also, we have trusted them for original prom designs that set apart my sons dates flowers or all of their proms.  I highly recommend them.", "pics": null, "resp": null, "gmap_id": "0x887d4eb6ed4ce74d:0xf4773df3daae3fbb"}
{"user_id": "113025148064258212463", "name": "Teresa Clark", "time": 1562703448833, "rating": 5.0, "text": "Whenever I call and order flowers I always get treated with respect and Paige always makes sure that they have the flowers that I’m needing.  Felicia makes such beautiful arrangements that I’m just amazed when they are delivered.  I couldn’t ask for better ladies that make sure I get what I’m paying for.  I won’t use anybody else!!  Thank you ladies for always taking care of me when I call!!", "pics": null, "resp": null, "gmap_id": "0x887d4eb6ed4ce74d:0xf4773df3daae3fbb"}
{"user_id": "111939853364179426142", "name": "Samantha dotson", "time": 1562721772512, "rating": 5.0, "text": "Best experience ever. Felicia has a great eye for the arrangements & she her works magic with the flowers LOL. The florist is a good atmosphere really rustic and a homey feel. I will be coming back soon. Thanks ladies for a great experience.", "pics": null, "resp": null, "gmap_id": "0x887d4eb6ed4ce74d:0xf4773df3daae3fbb"}
{"user_id": "109601032130105332592", "name": "Justin McAfee", "time": 1588196608448, "rating": 5.0, "text": "Best in town! Awesome customer service, and great Craftsmanship.", "pics": null, "resp": null, "gmap_id": "0x887d4eb6ed4ce74d:0xf4773df3daae3fbb"}
{"user_id": "115237862858766818894", "name": "Makensley (MaKensley) Renfro", "time": 1562718394247, "rating": 5.0, "text": "best shop!! Every time I walk through the doors they always make my day. love all the workers and most definitely the owner!!", "pics": null, "resp": null, "gmap_id": "0x887d4eb6ed4ce74d:0xf4773df3daae3fbb"}
{"user_id": "117278214318432028775", "name": "Angelica Rodriquez", "time": 1565858192869, "rating": 1.0, "text": "I don’t write reviews normally however our experience was horrible. Got a bouquet consisting of old flowers that looked worse than grocery store flowers. When I went to complain no one would answer the phone and store was closed I went by 3 days and could never find it open and no calls were returned. Don’t be taken like we were ! BAD BUSINESS", "pics": null, "resp": null, "gmap_id": "0x887d4eb6ed4ce74d:0xf4773df3daae3fbb"}
{"user_id": "118158468679520384698", "name": "Rhotee Jr Thompson", "time": 1505506462885, "rating": 5.0, "text": "It was my father's birthday weekend  , and we looked all over for a florist in muscle shoals al to deliver in a rural area to deliver a special order from his great grandson for his birthday.  I called muscle shoals florist and Stacy not only got it delivered  , but also bent over backwards to make sure we were satisfied with our order . So thank you Stacy 💖 little Wyatt is happy  , my husband and I are happy  , and big Wyatt is happy and felling very special for his birthday.", "pics": null, "resp": null, "gmap_id": "0x887d4eb6ed4ce74d:0xf4773df3daae3fbb"}
{"user_id": "113847873310738992232", "name": "BJ Michael", "time": 1550184554380, "rating": 5.0, "text": "Great service. I have used them several times over the last few years. Always friendly and beautiful flowers!", "pics": null, "resp": null, "gmap_id": "0x887d4eb6ed4ce74d:0xf4773df3daae3fbb"}
{"user_id": "102021493214248771036", "name": "Thomas Graham", "time": 1550162381483, "rating": 1.0, "text": "The people who work in this florist are rude. I pay you money and you provide a service, the ladies who work in this shop acted as if they were doing me a special favor, which somehow bothered them by providing a basic arrangement.", "pics": null, "resp": null, "gmap_id": "0x887d4eb6ed4ce74d:0xf4773df3daae3fbb"}
{"user_id": "114121706698458131876", "name": "Anna Gargis", "time": 1551238726867, "rating": 1.0, "text": "Valentines day...Delivery driver must have gotten his drivers license at the dollar tree. Cut several cars off and ran a totally red light. I called, not to complain, just to let someone know how reckless he was and the rude woman that answered the phone responded with \"it's Valentine's day and he is in a hurry\". Hope they treat their customers with more courtesy than that.", "pics": null, "resp": null, "gmap_id": "0x887d4eb6ed4ce74d:0xf4773df3daae3fbb"}
{"user_id": "109149730413277763787", "name": "Barry Moore", "time": 1548984368821, "rating": 5.0, "text": "They were outstanding and had every answer. A rough thing to have to do but they were so kind", "pics": null, "resp": null, "gmap_id": "0x887d4eb6ed4ce74d:0xf4773df3daae3fbb"}
{"user_id": "107875719041374072246", "name": "Greyson Long", "time": 1553548847621, "rating": 5.0, "text": "Couldnt ask for a better experience , deffinatley go out of their way to provide impecable service and make their customers happy. Talented ladies who treat you like family. Highly reccomend .", "pics": null, "resp": null, "gmap_id": "0x887d4eb6ed4ce74d:0xf4773df3daae3fbb"}
{"user_id": "109010807466102428498", "name": "Janice Myers", "time": 1562852188289, "rating": 1.0, "text": "Would not recommend to anyone!!! Save your money and go anywhere else . From the treatment I received by the Owner Mrs Renfro to the embarrassing arrangement that was received.\nWhen you are asked to pay for something you expect to get what you paid for. When I called back to question the arrangement she was so rude and did not care that we were not happy.\n\nSo unprofessional and such a BAD experience.", "pics": null, "resp": null, "gmap_id": "0x887d4eb6ed4ce74d:0xf4773df3daae3fbb"}
{"user_id": "116670649245521793206", "name": "Chryl Yarbrough", "time": 1581443754115, "rating": 5.0, "text": "Nice people, great flowers and gifts.", "pics": null, "resp": null, "gmap_id": "0x887d4eb6ed4ce74d:0xf4773df3daae3fbb"}
{"user_id": "110882164808929370817", "name": "James Ball", "time": 1514981193422, "rating": 5.0, "text": "Very helpful and I've always been satisfied with the flowers", "pics": null, "resp": null, "gmap_id": "0x887d4eb6ed4ce74d:0xf4773df3daae3fbb"}
{"user_id": "113813589023009080889", "name": "Ken", "time": 1440508911115, "rating": 5.0, "text": "This is the best place to order flowers in the area, they always make wonderful arrangements even when they don't have a lot of notice.", "pics": null, "resp": null, "gmap_id": "0x887d4eb6ed4ce74d:0xf4773df3daae3fbb"}
{"user_id": "112162901489071104244", "name": "Carrol Steakley", "time": 1432243209860, "rating": 1.0, "text": "I rarely order flowers and I am not happy with the whole teleflora website/florist experience. I feel that I should be able to pick out  a picture of the flowers and container that I would like to purchase, pay for it, and have it delivered. When I order an item, let's say a new chair,  I can see a photo of the  chair and know what I am paying for ,and when it arrives it should be the chair I ordered. I don't like paying for something that is NOT what I ordered. While I understand fresh flowers may need to be substituted the arrangement should resemble the photo. Flowers should be similar and the container should be exact.  A container should not be in a photo on the website if it is not \" in stock\". This is false advertising. Each individual florist probably doesn't have what is pictured on the Teleflora websites.\nI called the florist and expressed my concern and followed up with an email with pictures of what I ordered and what was delivered.  I ordered a beautiful sturdy white wicker basket with flowers and what I got was a cheap multicolored Easter egg basket. They substituted the basket and after I complained they were willing to offer me a credit of $2.50. What a joke!  I will not use this florist in the future for any reason and will never use a site that is managed by Teleflora. My thoughts are that the Teleflora company has way too many florist and they do not know what each flower shop has in stock. So when you order from a site like this one, you NEVER KNOW WHAT YOU ARE GOING TO GET. BEWARE. I wish I could put a photo on this commentary. I paid $45.73 for something that was NOT what I ordered.  Here is the response from the florist:\n\nThank you for your recent order. We pride ourselves on delivering the best, most fresh and most similar arrangements that we can for our customers and we have been doing so for over 38 year in the Shoals area! I am very glad you were pleased with the flowers that we provided for you and your mother.\n\nIn response to your recent request for a 50% refund here is our answer:\nThe basket chosen was unavailable and a similar value was substitute per our substitution policy.\nWe were also instructed to call and leave on the front porch if no one was available. Which we did. Our standard policy is to call and if there is no response, and no one is home, we leave a message as to where the flowers are. Since we were instructed, by you, to leave them, they were; only after a phone call was made. Had you not told us to leave the arrangement, and weather was not good for our arrangement, we would have left a message detailing where the arrangement could be picked up.\nAlso, you did not order from a 3rd party person. You placed your order on our website, which is managed and updated by Teleflora. They are our wire service and website managing team. They have thousands of florists that they service and we all obviously have different items in stock. They do a generic picture, and when a picture is chosen we try to fill the order as best we can with the flowers we have on hand at that particular time. Flowers are very seasonal and have a high turnover because of spoilage. Next time, a  call directly to the florist could save you a substitution since you would know immediately what they had available at that time.\n\nAs far as using another florist, they would offer the same substitution policy as us, so I don't know that you would've been happier.\n\nSince you were happy with the flowers provided in the arrangement and they were Pretty and Fresh I can NOT offer you a 1/2 refund of the product, being as though you were please with it. I will however refund you the \"basket\" charge since you were not pleased with the substitution chosen. I will be adding a refund of the Full container charge of $2.50 to your card. I hope this helps.\nThank you for your business.", "pics": null, "resp": null, "gmap_id": "0x887d4eb6ed4ce74d:0xf4773df3daae3fbb"}
{"user_id": "117367494261167025715", "name": "Muscle Shoals Florist", "time": 1577931026346, "rating": 5.0, "text": "It's my honor to work with you", "pics": null, "resp": null, "gmap_id": "0x887d4eb6ed4ce74d:0xf4773df3daae3fbb"}
{"user_id": "115982666640850188212", "name": "Linda Stephens", "time": 1490499055010, "rating": 5.0, "text": "My husband  gets me flowers", "pics": null, "resp": null, "gmap_id": "0x887d4eb6ed4ce74d:0xf4773df3daae3fbb"}
{"user_id": "117339375945539569224", "name": "Jason Nicklaus", "time": 1466621295284, "rating": 5.0, "text": "This is a great home decor and design shop! Many people know about Cullman Cabinet also located here but few are aware of The Added Touch which has furniture, lighting, and so much more. The staff are always friendly and willing to help you find that unique item or just let you look around at all the displays they have created.", "pics": null, "resp": null, "gmap_id": "0x8889cb8925547c4d:0x870aeb0c913846c0"}
{"user_id": "118280701801479505857", "name": "Mike Schafer", "time": 1600815881582, "rating": 5.0, "text": "Best shop in town!!", "pics": null, "resp": null, "gmap_id": "0x8889cb8925547c4d:0x870aeb0c913846c0"}
{"user_id": "108545806718892733964", "name": "Amy Hancock", "time": 1507218197339, "rating": 5.0, "text": "Love their selection on furniture, lighting. They have products you just can't find in any store.", "pics": null, "resp": null, "gmap_id": "0x8889cb8925547c4d:0x870aeb0c913846c0"}
{"user_id": "101855414186147590130", "name": "Amy Hancock", "time": 1503589252846, "rating": 5.0, "text": "Beautiful selection on home furnishings! Very friendly and helpful staff.", "pics": null, "resp": null, "gmap_id": "0x8889cb8925547c4d:0x870aeb0c913846c0"}
{"user_id": "105095346152268624860", "name": "Sheri Rutherford", "time": 1509156537870, "rating": 4.0, "text": "Very beautiful place and super friendly ladies to help with anything you need", "pics": null, "resp": null, "gmap_id": "0x8889cb8925547c4d:0x870aeb0c913846c0"}
{"user_id": "115567449547150762668", "name": "Tela Moreland", "time": 1501951317760, "rating": 5.0, "text": "There are some beautiful things here.", "pics": null, "resp": null, "gmap_id": "0x8889cb8925547c4d:0x870aeb0c913846c0"}
{"user_id": "103299145368743992516", "name": "Elaine Cole", "time": 1495738521146, "rating": 5.0, "text": "Always great service and selection. Wouldn't go anywhere else for lighting!", "pics": null, "resp": null, "gmap_id": "0x8889cb8925547c4d:0x870aeb0c913846c0"}
{"user_id": "110513761966952745065", "name": "Bobby Phillips", "time": 1484268086970, "rating": 4.0, "text": "Good selection", "pics": null, "resp": null, "gmap_id": "0x8889cb8925547c4d:0x870aeb0c913846c0"}
{"user_id": "117733354887108710158", "name": "Matthew Conde", "time": 1618495636071, "rating": 5.0, "text": "TOP NOTCH FLORIST! Bella Blooms is always on the spot with providing excellent, quick service with a reasonable price! They are very creative when it comes to their floral designs (not just flowers in a vase). Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888924176a4033bf:0x93584150065909fb"}
{"user_id": "103771872163105320299", "name": "Peyton Gans Booth", "time": 1604503594465, "rating": 5.0, "text": "I just got married on Halloween and I was shocked by the magic Jason & Michelle worked for me!! Honestly the most beautiful floral arrangements I'd ever seen. I received so many compliments. Jason is SO easy to talk to and listened to all of my requests. HIGHLY recommend!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNIsQVpIeNxfsHbIbuV_KVNaAAZBiI9Xv0q0x6H=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMAdVrzcVxXAhZQwcxZWibuR-Sz8oJ7Z8tsjVNG=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888924176a4033bf:0x93584150065909fb"}
{"user_id": "102179880632664833901", "name": "rick merriam", "time": 1607109814871, "rating": 5.0, "text": "This is the real deal florist. They have the best service and the best flower arrangement my wife has ever seen. I used to go to Homewood to get her flowers but not any more. This place is worth the drive", "pics": null, "resp": null, "gmap_id": "0x888924176a4033bf:0x93584150065909fb"}
{"user_id": "114009892588169535135", "name": "Amy B", "time": 1614640827332, "rating": 5.0, "text": "Beautiful flowers and very kind staff. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888924176a4033bf:0x93584150065909fb"}
{"user_id": "102637999823241322822", "name": "carla irwin", "time": 1499305086358, "rating": 5.0, "text": "Desiree and Kat were so amazing to us and the flowers were beyond amazing.  They were a true part of our wedding in every sense and I will miss talking with them.  I feel like we found not only a brilliant florist, but we found friends.  They took our vision and made it a reality.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNqR3lUJmU9bKBcj2OBtXYww_naS_UUhzgaG4Pg=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOVzQ-TVmFG6JteHbjBciBOy0GOV10TpkG5TbM3=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPx2tF2WylBjtSm3iPnRHXkGC-IJva-S_lVkIOh=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888924176a4033bf:0x93584150065909fb"}
{"user_id": "101408487402451904557", "name": "Mary Hales-Ward", "time": 1495111734133, "rating": 5.0, "text": "Being unable to attend a family funeral, I wanted to send something heartfelt and beautiful.  They did not disappoint.  The spray was outstanding and beautiful.  They completed it and delivered it in a timely manner and my expectations were exceeded.  I am so thankful I found them.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOEZDv7stXpqMe4_xX0szGS6rNhgBS6uq2UWkOB=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888924176a4033bf:0x93584150065909fb"}
{"user_id": "113582968150206278438", "name": "gabrielle byrd", "time": 1603759254249, "rating": 5.0, "text": "Incredibly talented and incredibly helpful! I loved my flower arrangements and it was such a quick and easy process!", "pics": null, "resp": null, "gmap_id": "0x888924176a4033bf:0x93584150065909fb"}
{"user_id": "102243710676529937844", "name": "Janis Laws", "time": 1579272499552, "rating": 5.0, "text": "I live in NC and my sweet daughter-in-law lost her grandmother.  I had no idea what florist to contact, but I was very impressed with this website.  The gentleman answering the phone was extremely nice and helpful, and even offered to deliver the plant to her home when he got off work at 5:00.  I am very glad I chose this place.  He did exactly what he said he would do and my daughter-in-law said the plant was beautiful.  Thank you for the great customer service, Bella Blooms and Designs.", "pics": null, "resp": null, "gmap_id": "0x888924176a4033bf:0x93584150065909fb"}
{"user_id": "114364863457094775587", "name": "Shelley Carrigan", "time": 1510252288759, "rating": 1.0, "text": "I ordered a basket and was a given a janky wood box with stems as the handles. The flowers were not vibrant and colorful, but they were dark and dull. On top of being unhappy with the flowers- Rodd Sinclair made it worse. His attitude is going to ruin this business. I'll order from Alabaster florist next time...I dont think they would hang up on me.... lets not forget to mention that they deleted my yelp review.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPWguI-e_3Mkhb3hwVPtD1fh5zJ9z9hkq9lApze=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMMKk5JChXBdUdVfGcohL5MOJ_HDcyTfx_UAzlR=w150-h150-k-no-p"]}], "resp": {"time": 1548775927631, "text": "🤦‍♀️🧠🏨🎟"}, "gmap_id": "0x888924176a4033bf:0x93584150065909fb"}
{"user_id": "112619345165946328925", "name": "Mark Stephenson", "time": 1590190087068, "rating": 5.0, "text": "Great job especially for a last minute call! She loved them", "pics": null, "resp": null, "gmap_id": "0x888924176a4033bf:0x93584150065909fb"}
{"user_id": "113222414376312214996", "name": "Patrick Lee", "time": 1582394559753, "rating": 5.0, "text": "Stopped in to get flowers sent to my wife on Valentine's Day. They were delightful to deal with, and the flowers looked amazing. Would absolutely recommend them to anyone in the area.", "pics": null, "resp": null, "gmap_id": "0x888924176a4033bf:0x93584150065909fb"}
{"user_id": "101062595728619438253", "name": "Lori Daza", "time": 1535139050550, "rating": 5.0, "text": "AMAZING customer service. Very easy to work with, friendly, courteous, knowledgeable... I can go on and on about how amazing they are but everyone should go find out more by choosing this place for your floral/gift needs! You will not be disappointed.\nRod went above and beyond for me when I called to make an order. I've honestly never had a better experience with a company. He was extremely accommodating and very very helpful; not to mention the flowers I ordered looked absolutely beautiful!\nThe quality of my bouquet was more than I expected.\nWill definitely come back!", "pics": null, "resp": {"time": 1548522524619, "text": "🙏🏻😻🥰🙌💐"}, "gmap_id": "0x888924176a4033bf:0x93584150065909fb"}
{"user_id": "105476465311287767201", "name": "tesla nichole", "time": 1462563240877, "rating": 5.0, "text": "I used Pelham Flowers for the first time today to send Mother's Day flowers. They were very helpful when I called and worked with my budget. The arrangement they put together and sent was beautiful!! It was so much better than I had even expected. I will definitely used Pelham Flowers again. I recommend you try them, also!", "pics": null, "resp": null, "gmap_id": "0x888924176a4033bf:0x93584150065909fb"}
{"user_id": "116366588806491743397", "name": "Ellen Fleisher", "time": 1372387569429, "rating": 5.0, "text": "Excellent!!! My husband and I used Pelham Flowers by Desiree for all our wedding and rehearsal flowers. We LOVED her work. She helped us create the perfect look we were hoping for at great price.She offered creative suggestions and was extremely professional.  I have used Pelham Flowers for several events and bought flowers from her for friends and family. Desiree is creative and wonderful to work with. I highly recommend her to anyone looking for an awesome florist!", "pics": null, "resp": null, "gmap_id": "0x888924176a4033bf:0x93584150065909fb"}
{"user_id": "105233358785877447912", "name": "Henry Collins", "time": 1423613906310, "rating": 5.0, "text": "The best place to get flowers. They are known for their modern and funky flower designs. I got flowers for my girlfriend from Pelham Flowers By Desiree last year for Valentines and it was absolutely gorgeous. Their products are by far the best priced among the flower shops in Birmingham area. The best thing I like about them are they use flowers from local growers around Jefferson and Shelby county. When you buy flowers from them you are actually contributing to the local economy. How cool is that? I ordered my flowers from them again this year to be delivered to my girlfriends work. I am excited to see their creation.", "pics": null, "resp": null, "gmap_id": "0x888924176a4033bf:0x93584150065909fb"}
{"user_id": "116923785294030284664", "name": "Mo Pop", "time": 1472562373913, "rating": 5.0, "text": "Desiree did my wedding flowers and they were so beautiful! I couldn't have asked for better! The colors were perfect and they were so unique! Love this florist and will definitely use them again!", "pics": null, "resp": null, "gmap_id": "0x888924176a4033bf:0x93584150065909fb"}
{"user_id": "117808476813063989234", "name": "Jennifer Jacobs", "time": 1433540180418, "rating": 5.0, "text": "I cannot recommend Flowers By Desiree enough. I am in Charleston, SC and I was trying to arrange a flower delivery for a family member who needed a bright spot in her day. The staff members were so helpful and explained what flowers they had available and delivered them to her just a few hours later. The descriptions did not do the flowers justice they were just beautiful!!! Thank you so much Flowers By Desiree!!!!!", "pics": null, "resp": null, "gmap_id": "0x888924176a4033bf:0x93584150065909fb"}
{"user_id": "117832396378532406047", "name": "Melissa Lesueur", "time": 1378935971738, "rating": 5.0, "text": "Pelham  Flowers by Desiree  and her staff are very nice, and their work is Amazing! I contacted Desiree to do a blanket of silk flowers for my Mother's funeral. My Brother's and I  met the with Desiree and gave her our Idea of what we wanted and the budget. Once we saw the flowers we were blown away of how amazing the flowers looked so real. This lady is very talented, and  you can tell that she absolutely loves what she does. Desiree went above and beyond our expectations!\nWe will not use any one else!", "pics": null, "resp": null, "gmap_id": "0x888924176a4033bf:0x93584150065909fb"}
{"user_id": "105491103838081202770", "name": "Pam Chut", "time": 1505780067765, "rating": 5.0, "text": "My husband recently surprised me with a bouquet from Pelham Flowers by Desiree.  Beautiful flowers and super fresh.  Love them!  Still fresh as new five days later.", "pics": null, "resp": null, "gmap_id": "0x888924176a4033bf:0x93584150065909fb"}
{"user_id": "108804623938663198205", "name": "Cliff Chappell", "time": 1370012895691, "rating": 5.0, "text": "I ordered flowers for a funeral, and they were very helpful in offering suggestions over the phone. The flowers were awesome.  I will definitely order from there again.  I highly recommend them and will recommend them to anyone I know needing flowers.  Thanks for the great service and product.", "pics": null, "resp": null, "gmap_id": "0x888924176a4033bf:0x93584150065909fb"}
{"user_id": "106360339806838944671", "name": "Jason Moore", "time": 1423617874905, "rating": 5.0, "text": "Best place in Birmingham to get your flowers! Unique floral designs and great service! I highly recommend this florist to all my friends!", "pics": null, "resp": null, "gmap_id": "0x888924176a4033bf:0x93584150065909fb"}
{"user_id": "100426276222897490648", "name": "joseph sowder", "time": 1542892829359, "rating": 5.0, "text": "Great florist. Have used for more than 1 wedding venue. Would use again.", "pics": null, "resp": {"time": 1548522300689, "text": "😻🙏🏻💐"}, "gmap_id": "0x888924176a4033bf:0x93584150065909fb"}
{"user_id": "104469512991965514518", "name": "Dr Kelsey Graham", "time": 1531095198443, "rating": 1.0, "text": "A couple of our neighbors graciously sent a plant to my wife who has a lengthy hospital stay.  I give the low rating here for two reasons- 1. A professional would have first checked with the hospital to ensure that plants or flowers were allowed. In my wife's case NONE are allowed on the entire floor where she is being kept. The plant was simply left at the nurses station and the staff of Pelham Flowers simply skipped away happily counting their dollars regardless of whether the intended party could ever enjoy the purchase or not. 2. The card that was placed on the plant is an over the top advertisement for Pelham Flowers. It is nothing more than a business brochure with a small print line indicating who the intended benefactor of the plant is.  Welcome to Amerika home of the god $$$$$ humans be damned! Money rules in spite of delivery or not. And please let us over promote ourselves in hospitals all around town by using the greeting card as nothing more than a advertisement!!!! Yeah!!!! No thanks. Totally inconsiderate and thoughtless taking of money- pure greed Amerikan style.", "pics": null, "resp": {"time": 1548522860268, "text": "😲🤥🍫🤦‍♀️"}, "gmap_id": "0x888924176a4033bf:0x93584150065909fb"}
{"user_id": "109609112562266572946", "name": "Karla Watson", "time": 1343848475867, "rating": 5.0, "text": "I love the friendly employees and their smalltown ideals! They are willing to go above and beyond to please their customers. Most of all, the flowers are GORGEOUS!! They can arrange them in any style you like...just ask them!! :)", "pics": null, "resp": null, "gmap_id": "0x888924176a4033bf:0x93584150065909fb"}
{"user_id": "110047419397286451947", "name": "Alan Thomas", "time": 1310420485560, "rating": 5.0, "text": "The arrangement was wonderful, delivery timing was perfect, and everything had such a personal and caring touch.  Desiree really put together something wonderful, and I wish I could post a picture of the gorgeous arrangement she created for me.  The wife loved it, and her coworkers were jealous.  I'm sure next time they get flowers sent to them, they will tell their boyfriends and husbands to call Desiree.", "pics": null, "resp": null, "gmap_id": "0x888924176a4033bf:0x93584150065909fb"}
{"user_id": "115627144723243159753", "name": "Miles Akins", "time": 1371735561964, "rating": 5.0, "text": "From the groom's perspective - we were on a budget for our wedding.  We met with 3 other florists before Desiree, and they all said they had ideas to keep us in budget, but their quotes said otherwise.  Then we contacted Desiree, and she really did have great budget-minded ideas that kept my checkbook happy.  I picked up the flowers myself the day of the wedding (to save some more cash). They were packed and ready to go when I arrived, and I was back on the road in no time.  Most importantly, my stressing bride instantly calmed down when she saw how beautiful the flowers turned out.  The flowers looked great in bouquets, on the tables and chairs, and on the cake.  My wife dried some of her bouquet and we placed them in frames on the wall.  I would definetely purchase flowers again from Desiree in a heartbeat.  Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x888924176a4033bf:0x93584150065909fb"}
{"user_id": "104842771574041507868", "name": "Debbie Atchley", "time": 1502110217357, "rating": 5.0, "text": "We chose Flowers by Desiree after receiving one of their arrangements.  They were so helpful and the arrangement we ordered was beautiful.  Their shop is filled with goodies too!", "pics": null, "resp": null, "gmap_id": "0x888924176a4033bf:0x93584150065909fb"}
{"user_id": "109927631858378097696", "name": "Bridgette Pertile", "time": 1363227059761, "rating": 5.0, "text": "My flowers were beautiful and the service was outstanding and very personable!!!  My daughter loved them!  I will definitely be using them for all my future flower needs.", "pics": null, "resp": null, "gmap_id": "0x888924176a4033bf:0x93584150065909fb"}
{"user_id": "113478770516351771638", "name": "Lloyd Winger", "time": 1515111460954, "rating": 5.0, "text": "Unfortunately  I received my bouquet during the recent severe cold spell.  My beautiful arrangement was damaged by the low temp.  Greg from Pelham Flowers by Desiree said they wanted to work with me and make it right.  I greatly appreciate how they handled my situation.  A replacement floral bouquet was offered along with a refund to the sender.  Because of this attitude I will not only return to this business but highly recommend them.  Thank you! P. Winger", "pics": null, "resp": {"time": 1548523559652, "text": "🙏🏻😞🙏🏻💐"}, "gmap_id": "0x888924176a4033bf:0x93584150065909fb"}
{"user_id": "103136168224154012801", "name": "Destiny Fitch", "time": 1474311700192, "rating": 5.0, "text": "Beautiful work! Will be using Desiree for all my floral needs", "pics": null, "resp": null, "gmap_id": "0x888924176a4033bf:0x93584150065909fb"}
{"user_id": "106942291405059005302", "name": "Jan Davis", "time": 1520693355905, "rating": 5.0, "text": "Real cute place, very hard workers.", "pics": null, "resp": {"time": 1548523474084, "text": "😻🙏🏻💐"}, "gmap_id": "0x888924176a4033bf:0x93584150065909fb"}
{"user_id": "111904637660531409979", "name": "Ryan Harmon", "time": 1553896066230, "rating": 3.0, "text": "Google hours are wrong. They were closed when I arrived. Hours on weekdays are until 4pm", "pics": null, "resp": null, "gmap_id": "0x888924176a4033bf:0x93584150065909fb"}
{"user_id": "109414499189016617172", "name": "DeAnne Daniels", "time": 1528257896591, "rating": 5.0, "text": "Beautiful arrangement.", "pics": null, "resp": {"time": 1548522905254, "text": "😻🙏🏻💐"}, "gmap_id": "0x888924176a4033bf:0x93584150065909fb"}
{"user_id": "102601943210488805985", "name": "David Robertson", "time": 1573314948369, "rating": 5.0, "text": "We visited Dukes Barber Shop. It's attached to the florist. Duke is awesome. Very fast and efficient. And inexpensive. Does a great job every time.", "pics": null, "resp": null, "gmap_id": "0x8889b56f149893a5:0x95e7ae87fabeff46"}
{"user_id": "117753524212618046784", "name": "Faye Dukes", "time": 1524006468886, "rating": 5.0, "text": "Lisa was just wonderful and made a beautiful arrangement for my grandfather's funeral.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPyy64Vm131B-bR3ROuRzQebYWIx4zqPlO3SPOY=w150-h150-k-no-p"]}], "resp": {"time": 1524090513924, "text": "Thank you."}, "gmap_id": "0x8889b56f149893a5:0x95e7ae87fabeff46"}
{"user_id": "114882891457790730055", "name": "Amanda Ford", "time": 1527429357584, "rating": 5.0, "text": "Wonderful place to get all your flower needs. Great owner and staff very helpful and friendly.", "pics": null, "resp": {"time": 1527430049852, "text": "Thank you Amanda."}, "gmap_id": "0x8889b56f149893a5:0x95e7ae87fabeff46"}
{"user_id": "113606122392454702182", "name": "Jim Kelley", "time": 1532132682562, "rating": 4.0, "text": "Haircut next door reason able", "pics": null, "resp": null, "gmap_id": "0x8889b56f149893a5:0x95e7ae87fabeff46"}
{"user_id": "117225718817241003314", "name": "val lamar", "time": 1516645174933, "rating": 4.0, "text": "Nice shop,lots to choose from.", "pics": null, "resp": {"time": 1518108089440, "text": "Thank you."}, "gmap_id": "0x8889b56f149893a5:0x95e7ae87fabeff46"}
{"user_id": "105511695525050417680", "name": "Paul Collier", "time": 1519135499263, "rating": 5.0, "text": "At the Barber shop $5  its hard to beet", "pics": null, "resp": {"time": 1519136281327, "text": "Thank you."}, "gmap_id": "0x8889b56f149893a5:0x95e7ae87fabeff46"}
{"user_id": "101876962388818449994", "name": "LISA JONES", "time": 1521632092869, "rating": 5.0, "text": "Beautiful arrangments.", "pics": null, "resp": null, "gmap_id": "0x8889b56f149893a5:0x95e7ae87fabeff46"}
{"user_id": "117509190383706161815", "name": "Brandon Combs", "time": 1512956150166, "rating": 5.0, "text": "Flower", "pics": null, "resp": {"time": 1518108102342, "text": "Thank you"}, "gmap_id": "0x8889b56f149893a5:0x95e7ae87fabeff46"}
