{"user_id": "112129748914304865934", "name": "Toni Duplantis", "time": 1629920900724, "rating": 1.0, "text": "My husband purchased a pair of emerald earrings that fell apart the third time wearing. Then they replaced, but with a lower  quality emeralds. It would seem that they should have used the better stones, but they didn’t.", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "101016800378502934610", "name": "Cassandra Myers", "time": 1629804227766, "rating": 5.0, "text": "I always receive a warm welcome from the Jared team members. My jewelry consultant Jessica is always engaging, thoughtful and ensures that I have a positive experience.", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "114704461423334875474", "name": "Willie Rhodes", "time": 1619022432426, "rating": 5.0, "text": "From the bottom of my ❤️ I want to give a HUGE!!!! Thumbs up and Hugs to Thomas Blais and the entire staff at Jared’s. When I tell you Thomas Blais had my wife smiling through her mask 😷 I was sold. Now I truly understand why he went to Jared. Thanks 🙏 again for all your help.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOZBS8F7zCh2ZhbV3oSM9tt95mLODzVlQMa5avN=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "105380848288978477102", "name": "Robin Michelle Young", "time": 1612827434003, "rating": 5.0, "text": "I just have to say what an amazing experience.  Thank you so much Trixie and Genevieve for taking time and paying attention to the little things.  I was a bit upset to find that the original ring I had ordered for my husband was not in stock in his size, resizing was not an option due to it being an online purchase.  These amazing ladies calmed me right down and showed me some gorgeous rings, turned a stressful situation into a very happy one.  Little did I know that I would fall in love with the rings that Genevieve showed me.  She has an artists eye for detail.  I described my husband and myself to her and she worked Magix by creating the perfect combination of rings for us.  I couldn't be happier and they are so much more beautiful than my original choices.  Trixie, your customer service was impeccable.  I can't thank you enough.  The two of you created an amazing dynamic that made sorting out an issue into a wonderful memory.  Thank you, Thank you, Thank you!", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "115403441718157859375", "name": "Patty Robertson", "time": 1621302384924, "rating": 5.0, "text": "Overall, my husband and I have had a pleasant experience with the staff at Jareds. They have beautiful jewelry. The ladies that work in sales are very pleasant, nice, and helpful. They always are very friendly toward us and really pay attention to what we are looking for when making important purchases. We have always had a great experience when purchasing jewelry from Jareds.", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "105579409406843846204", "name": "Lisa Miller", "time": 1624065237101, "rating": 5.0, "text": "Robin and Kayla were so nice and helpful . They are both true Assets to Jared's", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "103218367124728224871", "name": "Kendell Lewis", "time": 1613431294215, "rating": 5.0, "text": "Thank you to Trixie for making my current wedding ring what I envisioned. She helped me locate two bands that would serve as a guard to my engagement ring that was purchased several years ago. She found exactly what I wanted within my budget and arranged for them to be made into the ring as one piece. The whole process was super easy and the finish product is completely amazing.", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "113525372932454983837", "name": "Tim Richardson", "time": 1615662713064, "rating": 5.0, "text": "Fixed my wife's watch and cleaned her jewelry while we waited.  Also made 2 other purchases while we were there.  Very helpful and friendly.", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "112874740185096460078", "name": "Tyler Thomas", "time": 1622407876878, "rating": 5.0, "text": "The staff here are amazing", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "112031820341631680277", "name": "Erica Hughes", "time": 1601168923641, "rating": 1.0, "text": "I just received my ring from the third time it has had to be repaired (each time was due to an error on their side) and the wedding band is not straight and both rings were not sized correctly. I haven’t had the opportunity to wear my ring since March due to covid and not having a repair tech and then being super backed up... and I understand all of that.. I’m patient. But what I can’t understand is how they can drop the ball so much on something that means so much to me. Would not recommend.", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "115001475729706172067", "name": "mike Bray", "time": 1609701903406, "rating": 5.0, "text": "Liz is the best. She went above and beyond.  Ask for her.", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "109618363575507612949", "name": "Quamaine Hawkins", "time": 1615507387414, "rating": 5.0, "text": "Kayla is the bombbbbbbb she went over and beyond to get my wife and I what we wanted today!\nThanks Kayla", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "109200529349383651486", "name": "doug p", "time": 1596723356155, "rating": 5.0, "text": "Great selection of Beautiful crafted jewelry.  Great professionals who help you find what you're looking for.\nDon't waste your time going anywhere else.\nTake her to Jareds.", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "109638722730288106452", "name": "James Fondren", "time": 1608827709615, "rating": 5.0, "text": "Very nice salespeople good selections and pricing.", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "116345037513475946401", "name": "Bernadette Lovetere", "time": 1521503525612, "rating": 5.0, "text": "My husband and I came in specifically to find titanium wedding bands and their salesman Henry was amazing!! Prices were fantastic also!! 5/5 👌", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPo87kgouW14nAUfPOdiXqjHpECeaV26lq713UW=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "111201889428627324697", "name": "Erika", "time": 1577647027901, "rating": 5.0, "text": "Been waiting for months to do this review. Back in July or August I walked into Jared with my old wedding ring guard from my first marriage with hopes of designing something special for my daughter. Henry Darnell was wonderful in helping me design the best look with the diamonds I had in the ring. Today I was able to finally give the gift to my daughter for Christmas and she absolutely loved it!!! Thank you Henry and all who helped at Jared for such a wonderful experience.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPvLfNnH3bu_PysBcogsqfclJVIN6P45_YR0YML=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOqLu3wPtwGJ6exrO8jvvCPRisOvboueHrAEwUo=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "107988006820400308488", "name": "Terri Carmack", "time": 1579548299104, "rating": 5.0, "text": "We really enjoy coming inand purchasing jewelry here. It is always a top notch service. Prompt, friendly, and courteous. We rely on the knowledge of our sales people and we enjoy working with each and everyone in our selection of our favorite pieces. Thanks Jared!", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "113031067685039846412", "name": "Josh Harrison", "time": 1620672019200, "rating": 1.0, "text": "They are EXTREMELY pushy about getting their warranty plans, to the point that the salesman lied to me about what was covered (I had to look it up on Jared's website to find out), and that they added the warranty to our purchase without telling me (after we declined it) so I had to go back and get a refund.", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "109048647371811477603", "name": "Haley Alonso", "time": 1525463269983, "rating": 5.0, "text": "My now fiancé worked with Elizabeth to get my ring ordered (vera wang wedding set in size 7) and he also bought his wedding band that they altered to fit him (size 15) with no issues. All the ladies were amazing and nice for us. Would most definitely use them again!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPEJyC9RXsYZtns0hbb-mK2Z14kdXL2rC4J8uGT=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "114781662050809853521", "name": "Amazing Renee", "time": 1589382286382, "rating": 5.0, "text": "I have shopped for all my Jewelery needs and wants for over 20 years at Jared’s. I have always gotten the 5 star treatment whether it was a huge purchase or a simple repair. Yes, SHE takes him to Jared!!!!!!!!!!!!♥️♥️♥️♥️", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "106445245087372362868", "name": "J Wells", "time": 1599609250258, "rating": 5.0, "text": "Very helpful staff! Jessica Langley was my associate and she went above and beyond to meet my expectations!", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "112807437930449067690", "name": "Olive Dykes", "time": 1617320643564, "rating": 5.0, "text": "It sus so grate", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "110694606756959612706", "name": "Samantha Ferguson", "time": 1549764815090, "rating": 5.0, "text": "My boyfriend and I had a fantastic experience at the Jared Mobile location. Henry greeted us right at the door, worked with our budget, and created the most beautiful ring for us. Customer service was amazing. I’d recommend this location and the associate Henry Darnell to anyone. Can’t say enough how truly great the experience was :).", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "111342204026474831755", "name": "Renee Broomfield", "time": 1597636989305, "rating": 1.0, "text": "I drove from Mississippi to purchase a item that was being held for me, but the sales people were not able to find it. Very disappointed. Complete waste of time and gas. The sale person seemed unconcerned and uncaring. I did telephone the manager but have yet to receive any feedback.", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "104678660947602998651", "name": "Allyson", "time": 1598141481884, "rating": 1.0, "text": "Horrible experience! My brother ordered a custom wedding band and they sent the wrong one! He asked about ordering a new one and was told it wouldn’t be here until October (wedding is in September). When a refund was requested, they were extremely rude and unprofessional", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "117686223001241592170", "name": "Amanda Wiley", "time": 1543427920250, "rating": 5.0, "text": "I am fairly new to the Jared family! My now husband bought my engagement ring from Jared and we just couldn't help falling in love with the wonderful staff! Thank you again Trixie and Robin we will always be grateful for the long hours you have given us to ensure that we were truly happy with every piece we receive.", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "103646629729476775699", "name": "katherine bagley", "time": 1561752547402, "rating": 5.0, "text": "Did a wonderful job set the my 5 ct aquamarine into a ring. And when I took it in to get it cleaned they noticed it was loose and tightened it up.  The staff is friendly and very helpful", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "117398882666508722102", "name": "Carol Hunt", "time": 1545102916888, "rating": 5.0, "text": "I purchased a ring, Pandora bracelet and charms and couldn't have been happier with the quality of the jewelry or with the staff. Jessica and Elizabeth were helpful, professional and even though I wasn't planning on purchasing at the time they found things I couldn't resist. They took time to actually talk to me to see what I might like. In the day and age of little to no customer service it was a pleasure to go to a store that is focused on it. I will definitely return to this Jared's for all my jewelry needs.", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "102851604101828344326", "name": "Joy Salas", "time": 1554159639109, "rating": 5.0, "text": "The mobile store has amazing people who are very attentive to their customers. My husband and I have been using Jared’s for our main jewelers for years. The general manager here as well as all of the consultants know their customers by name and are always pleasant. Looking for beautiful and affordable jewelry that you know is real this is the place to go!", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "107962447982455047652", "name": "Pamela Biggs", "time": 1545102246760, "rating": 5.0, "text": "I love this store!  The people are so friendly and take time to show you items. I have made 2 purchases there so far and will be back. Definitely go there if you are looking for jewelry!", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "113468293735053783896", "name": "William Martin", "time": 1545104742427, "rating": 5.0, "text": "This is the best jewelry store I have been to in my twenty years of fine jewelry shopping. I was treated as if I was shopping without a budget. There was no rushing or hurrying. They took their time to show me pieces and made sure that I was happy with my selection. I was so happy with the service I took in my wife’s ring she was left by her mom to have it repaired and resized. It was fixed and looks brand new! The staff is very knowledgeable and friendly! This is the only place I will shop for jewelry from now on!", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "108546630234777873352", "name": "Brandi Robinson", "time": 1581960483387, "rating": 1.0, "text": "My husband and I went to Jarrods’s in Mobile Thursday to buy our granddaughter a pair of earrings for her birthday. The party was on Sunday. Jessica, our sales person, said we don’t have them in this store but let me call another and see if they have them. They did!!! Great!!!! She said they will be overnighted to Mobile store . Plenty of time to get them for the birthday party. Called Friday, did not come in. That’s fine, a truck comes in Saturday and Sunday. We call Saturday. Still hasn’t come in. I call back and ask them to track them. Jessica says it’s not on ‘her’ it’s on the other store that was overnighting them. What?!? I ask her to please follow up and ca them. Ask them what’s going on, have they been sent, can they track them ...\nJessica never bothered calling back.\nPoor little grand baby did not get her earrings for her birthday. Thanks a lot Jessica !!!! For not doing your job.", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "101465987176261169227", "name": "Kristin McCarron", "time": 1545102465004, "rating": 5.0, "text": "The location is awesome! Customer service is the best! They were so willing to go out of the way to help me find exactly what I was looking for! I will be sure to shop here for every occasion!", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "106880456990039904485", "name": "Tyler Thomas", "time": 1529461454069, "rating": 5.0, "text": "HANDS DOWN the best customer service! My husband and I went in to look for new wedding bands, and from the moment we stepped foot in the door we were greeted with warm welcomes by the staff. Trixie, Jessica, and Henry to be specific. These employees know what they are doing and know how to make a customer feel comfortable going through such a large purchase. I highly recommend this location and the above mentioned employees.", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "114034574099759409796", "name": "Bethany Heathcock", "time": 1562698031411, "rating": 5.0, "text": "The employees were so nice and very willing to help. They dont discriminate either because i walk inside in very simple clothes. They are very helpful.", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "108220062230827884441", "name": "Shey Thorn", "time": 1529461235507, "rating": 5.0, "text": "This was the absolute best experience in Jewlery shopping in my life. We started off coming in on Monday, when we were greeted by the whole staff and had our sale taken over by Henry. Henry was extremely kind and listened to everything we wanted, we viewed some stunning Men's rings, but decided to sleep on the purchase decision and make our minds up the next day. We came back in today, Tuesday, and we were greeted by Jessica, once again extremely kind and helpful, who helped us complete our sale. Throughout our stress free, easy process we were offered water by the GM, Trixie. She chatted with us about her amazing jewelry endeavors and made us feel right at home as we were completing our purchase. We are still in shock at the OUT OF THIS WORLD INCREDIBLE service we received. We can't wait to continue shopping with Jared, and we look forward to the amazing new selection of items coming within the next months!! Thank you from the bottom of my heart!", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "109608761603814161600", "name": "Michael Vanden Heuvel", "time": 1535839640492, "rating": 5.0, "text": "I've never been to any jewelry store in my life. I wanted to propose to my girlfriend, now fiance, and I knew the ring had to be spectacular. I stopped here on a whim for the sake of comparing prices to the other stores in the area. To be frank, I never saw those other stores. After a single visit at this location I was won over by their customer service, products, and in-store repair shop. As soon as I walked in the door I was greeted by Elizabeth Herboso. She was incredibly helpful and really knew her stuff. She helped me every step of the way and made the entire process from beginning to end very smooth, easing my mind any time I became unsure. But most of all she was very friendly and genuinely enthusiastic about getting the exact right ring for me and my bride-to-be. I couldn't have asked for a better first experience and I will most definitely be returning for future purchases.", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "116990073637189833439", "name": "Joe LeNoir", "time": 1499628586239, "rating": 5.0, "text": "I purchased a Tag Heuer F1 watch for my birthday present to myself. The lady who helped me with my purchase was fantastic. Her name was Elizabeth I believe. I got it home and ended up being unhappy with the watch. I googled their return policy and read one after another terrible reviews about their sales persons attitude about returns. So, naturally I expected to have a hard time. Once I got there, I spoke with Karen, the manager very briefly about my issues with the watch. She apologized several times and immediately refunded my money. The process took less than 10 minutes. All in all I was/am very very satisfied with Elizabeth/Karen/Jared! They are great and I highly recommend them. Ill definitely be back to purchase other pieces of jewelry.", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "113708474118209665859", "name": "Robert Turner", "time": 1602355784654, "rating": 2.0, "text": "The protocol to getting the store is ridiculous and the lady working in the store was rude.", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "110578230141899211664", "name": "Brittany Vickers", "time": 1558813301412, "rating": 1.0, "text": "Walked in wanting to upgrade my diamond in my engagement ring. Was immediately greeted and that was it. There 20 min and not helped. Walked out and will never return.", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "105958570715371089059", "name": "William Schenher", "time": 1537816065833, "rating": 5.0, "text": "Kayla helped me and was awsome. She got me in and out fast. Great service. Great salesperson!", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "104220365569396231925", "name": "Sheila Haviland", "time": 1563307019962, "rating": 5.0, "text": "My fiance and I met with Jessica. I told her what I was looking for and she picked out several setting for me.  Found the one I loved and we left keeping that ring in mind.  Visited 2 other jewelers only to return to Jareds. I did change my mind and decided on a cushion cut over a round diamond. She picked out  an almost flawless stone. The setting was white gold and we wanted platinum so they have to make a new setting and the gallery was to small for the stone so they will make the gallery to fit the stone. Awesone service, knowledgeable staff, friendly while being professional, treated us like family. Can't wait to see the end product , another 5-6 weeks. My fiance was pleased with the service  and their attention to details, and that says alot . I have since ordered his platinun wedding band waiting for it to arrive next week", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "102584645880155578400", "name": "WB Spencer", "time": 1535149809131, "rating": 5.0, "text": "Bought my son a Tag Heuer watch for his 16th birthday.  Very helpful staff and helped me pick out the right one for our budget.  I had never shopped a \"chain\" jewelry store before and was pleasantly surprised.  Will definitely go back here for any future watch or jewelry purchases!", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "108516754707734938358", "name": "Derek Scarbrough", "time": 1545081585835, "rating": 5.0, "text": "Without a doubt the Manager and the staff are the nicest and most helpful you can find. Have bought several items from the mobile store and will continue to do all of my jewelry shopping there.", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "114444615034340167898", "name": "JaCoiya Hall", "time": 1536371921394, "rating": 5.0, "text": "The staff here is unbelievable!  They have become like family .. Everyone is very knowledgeable and sooo inviting .. I find myself in there for at least an hour after getting my jewelry cleaned just chit chatting. .You have to visit this store!!", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "117238703188828994171", "name": "Crystal Hinds", "time": 1546282569017, "rating": 1.0, "text": "WARNING: DO NOT PURCHASE FROM HERE! My husband bought me a necklace we decided to return. He paid cash. The manager informed him they do not have enough of cash in the store (only $420) and they could mail us a check that would take 10 days to receive or they would call us once they have enough of cash onsite. This seems completely inconceivable and absolutely ridiculous to me that a nationwide store could legally operate like this. I’ve never in my life. And we will never, ever shop there again.", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "106228122288746497941", "name": "Christin Lisenby", "time": 1490371312030, "rating": 5.0, "text": "I was shocked to find this location rated a 1 star! Thomas and his team have treated me like family since my first visit in December 2016! They have gone above and beyond and I enjoy doing business with people who put the customer first and are so professional! I rarely leave reviews, but felt the need when seeing one persons negative experience, causing so much damage to this business.... Great job guys! I'm a BIG FAN!!!  Christin", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "101520599624416926682", "name": "Hanna Love", "time": 1508534892358, "rating": 1.0, "text": "The Manager Trixie has a very unpleasant attitude towards her co-worker. I seen her completely ignore a girl in a lab coat because she was doing something on the computer. I seen the girl talking to her and she didn’t even acknowledge her. How can you manage a team and treat them like that. I will not be coming back here. Sorry attitude I did not like. The girl was very kind to her. I had Henry help me with my Ever Us ring and I will recommend friends to see him. I also seen employees standing around talking loud so inapproiate.", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "100683770945741651118", "name": "Kia Sheridan", "time": 1549069825304, "rating": 5.0, "text": "I had an absolutely wonderful experience! Emma the salesperson was an absolute doll!", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "116088357970029407856", "name": "The Chambers", "time": 1547657904153, "rating": 5.0, "text": "Always a pleasure doing business their longtime customer", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "105390136723914728971", "name": "Cameron Blake", "time": 1506258977016, "rating": 1.0, "text": "My boyfriend bought me a pair of earrings ($620)which I couldn't have at the time due to circumstances.  So a full refund sounds simple right? wrong. Upon visiting the location  throughout the day only to still be told that they (Jared) didn't have enough cash which sounds silly actually. While being within our 30 day period. This location is very bad as far as customer satisfaction. Both the Black woman and old slim Caucasian woman should seek for another occupation. I was told that night there's another Jared's in Pensacola so I asked well did you call that store to see if they had the amount of cash? basically she informed me that she doesn't have common sense. You wouldn't want to do business with someone who is incompetent would you?", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "103038054604913506380", "name": "Courtney Pemberton", "time": 1502846301495, "rating": 1.0, "text": "Terrible experience. They did not deliver what they had promised, but rather a ring that had bad welds and a crooked diamond. And returning it was a nightmare, they did not refund all the money until we came back a second time. More like a galleria of incompetency.", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "112485282608525834451", "name": "John Wilson", "time": 1530110296861, "rating": 3.0, "text": "The store is very clean the people that I have dealt with inside are extremely nice and professional however their customer service department is a complete pile of crap. I have a credit card through their Genesis Bank. I was made to put a deposit down when I bought something I was also told that every time I buy something I have to put a deposit down. When I call Genesis they told me that even if I have an available credit limit they run and check your credit every time you purchase something and if they feel like not approving it for whatever reason they will not approve it even though you have available credit on your card they've already given you. I was not happy with that so I called Jared customer service and what I was basically told was we do not control the credit cards are banks policy is our bank's policy if you have a problem with it call them..\nI'm 55 years old I think credit cards from different jewelry companies different clothing stores and all other places. When you give me a credit card I expected to be a credit card you don't walk into JCPenney's buy $500 worth of clothes and have to give them $60 in advance you swipe your card you sign your paper and you leave.. what Jared is doing is not giving customers credit cards there financing the jewelry like you with your car or your house but they don't tell you that upfront.. so even though the people and the three different Jared stores that I've been to have been very professional and very nice because of your business practices you guys suck. I will pay the balance off of my card cut it up and never do business with you again..", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "107111036364273388056", "name": "Kim Newman", "time": 1487440061413, "rating": 1.0, "text": "My husband bought me a $2,500 cross necklace as a gift.  The chain was too short, he went back to swap it for a longer chain.  They wanted to give him a $15 credit for the chain and sell him a $150 chain. Really???  So your chains are only worth $15 and you sell them for $150?!!  Crooks! Take my advice NEVER shop at Jared!", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "107968154972640836652", "name": "Kailey Morgan", "time": 1530806288312, "rating": 5.0, "text": "That's really make miracles happen here I love it", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOSLfoI1H6aHksBIoS_nxSwn7rMoXVRY6wfKs4I=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "110774825231811086829", "name": "Jurone Daniels", "time": 1603244465969, "rating": 5.0, "text": "Very friendly staff", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "103074936992151587662", "name": "Bama P", "time": 1506697628659, "rating": 1.0, "text": "Horrible. Bought a ring and had to bring it in constantly for repairs. Whoever works on the jewelry must have gotten their certification from bishop state or something. Yea", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "104751801527561835213", "name": "Laporcha Richardson", "time": 1532819880662, "rating": 1.0, "text": "The whole staff have very nasty attitudes, always have something to say when returning an item with receipt, will never shop here again, i would rather go to Florida.", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "111522619121342164454", "name": "Robert Chavers", "time": 1608662755276, "rating": 5.0, "text": "Busy", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "115820148420866816751", "name": "Mark Brewton", "time": 1513645947331, "rating": 1.0, "text": "Felt pressured by sales staff", "pics": null, "resp": null, "gmap_id": "0x889a4db2f2aee9d5:0x4edafca465890835"}
{"user_id": "115216147850449291622", "name": "Louis Dixon", "time": 1615060572398, "rating": 5.0, "text": "Great service. We we're in and out and got exactly what we went for", "pics": null, "resp": null, "gmap_id": "0x889a4da2382ce71f:0x1573060748c99ae7"}
{"user_id": "105983571678416784731", "name": "William Denton", "time": 1522799617924, "rating": 5.0, "text": "I hunted for diamond stud earrings for my wife for our anniversary at many stores for several weeks.. Dealt with the manager and she was most helpful. She found me the perfect pair with the 4 C's I was looking for. She was understanding of what I was looking for and very courteous.  Most of all, she was very professional and helpful with my purchase.\n\nI will always return to Kay's for the quality service I received.", "pics": null, "resp": null, "gmap_id": "0x889a4da2382ce71f:0x1573060748c99ae7"}
{"user_id": "102864760326828167858", "name": "B Schjott", "time": 1593279055147, "rating": 1.0, "text": "My daughter ordered a heart beat necklace and ring on May 3rd, as of yesterday June 26th I received the necklace but no ring. The clasp on the necklace is broken and I can’t get any one to answer the phone at the local office.", "pics": null, "resp": null, "gmap_id": "0x889a4da2382ce71f:0x1573060748c99ae7"}
{"user_id": "113585645706700538983", "name": "Rayshundra Davis", "time": 1550963629148, "rating": 5.0, "text": "Great Customer Service.  Friendly staff and willing to help anyone that comes in. They take the time to get to know you and what your needs or desires are. Whenever I've encountered an issue, they took the time to try to solve the problem.  I always feel valued when I'm there.", "pics": null, "resp": null, "gmap_id": "0x889a4da2382ce71f:0x1573060748c99ae7"}
{"user_id": "113751478569641182486", "name": "Mel Mom of 5", "time": 1577071114779, "rating": 5.0, "text": "Love this place! Always get a nice friendly SMILE even when I'm just looking and wishing", "pics": null, "resp": null, "gmap_id": "0x889a4da2382ce71f:0x1573060748c99ae7"}
{"user_id": "113236122307505138478", "name": "Kimberly Nelson", "time": 1528660036088, "rating": 5.0, "text": "Sent wedding ring in for cleaning, check prongs in setting and replace lost side diamond.  My ring came back on time, and it was beautiful and immaculate.  Service was great and personnel very helpful.  My Father had his watch repaired here, and he received great service also.", "pics": null, "resp": null, "gmap_id": "0x889a4da2382ce71f:0x1573060748c99ae7"}
{"user_id": "110031256137338046622", "name": "Kendall Duke", "time": 1555945404403, "rating": 5.0, "text": "Was in recently and bought some earrings. Hannah is who helped us and she was very nice and knowledgeable. We had a great experience.", "pics": null, "resp": null, "gmap_id": "0x889a4da2382ce71f:0x1573060748c99ae7"}
{"user_id": "109144530215243824106", "name": "Nikki Hudson", "time": 1528757758040, "rating": 5.0, "text": "I have purchased jewelry and had repairs from this location. The service was excellent. I would definitely recommend this location to anyone. Never had any problems!!", "pics": null, "resp": null, "gmap_id": "0x889a4da2382ce71f:0x1573060748c99ae7"}
{"user_id": "114387265834726082521", "name": "D Johnson", "time": 1547289728931, "rating": 5.0, "text": "One of the best salesman ever, he took his time with me, he showed me exactly what I wanted to see, & answered all my questions.", "pics": null, "resp": null, "gmap_id": "0x889a4da2382ce71f:0x1573060748c99ae7"}
{"user_id": "107154645472731005317", "name": "Christina Denton", "time": 1522797373841, "rating": 5.0, "text": "High quality jewelry with reasonable prices.  Friendly staff. Manager extremely helpful and patient.", "pics": null, "resp": null, "gmap_id": "0x889a4da2382ce71f:0x1573060748c99ae7"}
{"user_id": "103975640135506680781", "name": "Kaitlyn Waltman", "time": 1457291518102, "rating": 1.0, "text": "My engagement ring was supposed to be sent to Virginia by a week ago, in a 6 prong setting. They haven't even started on it and it's 2 weeks later. I won't see my boyfriend again till the wedding. They ordered a 5 prong setting in white gold instead of yellow gold. They promised us again it'd be here by the 9th, we contacted them again and they said the repair shop still hasn't even gotten the part or promised to ship it. We just want the ring back. We don't even want the ring fixed by them. Kay's is awful! Do not trust them!", "pics": null, "resp": null, "gmap_id": "0x889a4da2382ce71f:0x1573060748c99ae7"}
{"user_id": "109838696407731972294", "name": "Sherri Beck", "time": 1545631294637, "rating": 5.0, "text": "They sales rep was absolutely remarkable they make you feel like they have known forever and work with you with a smile even if you are undecided and take awhile to make your own choices they do not rush you or make you feel as though you are taking up their time and they work with you till you find that perfect ring that says we will lol thank you Kay Airport Blvd Bell Air Mall I love my Wedding set your staff is the best oh and it doesn't matter what your budget amount is you will leave there with what you came for and in your price range and very satisfied thanks again", "pics": null, "resp": null, "gmap_id": "0x889a4da2382ce71f:0x1573060748c99ae7"}
{"user_id": "116814975122145245142", "name": "Hope Fulton", "time": 1476381094076, "rating": 1.0, "text": "I got the ring and it immediately had to be sent in for three weeks to be sized. It was sent back to me with one of the stones chipped, and then a different stone fell out of it a few weeks later. I took it in to have both stones replaced. It was gone for three weeks and was sent back to me with two stones chipped. They had to damage it out and give me a new one which was sent out for three weeks to be sized. I went to pick it up on the 'promise date' and at first they told me they lost it, but then they said it hadn't even been shipped out from their store to be sized until the day after I was supposed to pick it up. Throughout all of this Debbie has been extremely rude when I go in to the store. This whole experience has been a nightmare and I will never shop with Kay again.", "pics": null, "resp": null, "gmap_id": "0x889a4da2382ce71f:0x1573060748c99ae7"}
{"user_id": "106813789556085784227", "name": "Robert Stout", "time": 1573412990882, "rating": 5.0, "text": "Sami  gives first class service", "pics": null, "resp": null, "gmap_id": "0x889a4da2382ce71f:0x1573060748c99ae7"}
{"user_id": "114190164971078483220", "name": "Heather Bankester", "time": 1461613082535, "rating": 2.0, "text": "I sent my ring off to get sized. They said it would take 10 days and would be due back April 23. I called that morning and they proceed to tell me they do not get shipments on the weekends, but it should be here Monday. So I called again Monday morning and they told me the sizing company was running behind and it wouldn't be here until Wednesday!\nNow, I'm due to leave out of town for 10 days and I will not have my engagement ring! I am very disappointed.", "pics": null, "resp": null, "gmap_id": "0x889a4da2382ce71f:0x1573060748c99ae7"}
{"user_id": "108132685035891926959", "name": "Lee Will", "time": 1601770272240, "rating": 5.0, "text": "Kay Jewelers is the best😊👍", "pics": null, "resp": null, "gmap_id": "0x889a4da2382ce71f:0x1573060748c99ae7"}
{"user_id": "103731356428740011473", "name": "Charles Moseley", "time": 1528760118777, "rating": 5.0, "text": "Great service!  People are friendly.  Ms. Peavey, thank you.", "pics": null, "resp": null, "gmap_id": "0x889a4da2382ce71f:0x1573060748c99ae7"}
{"user_id": "106928504955542322291", "name": "Edward Moseley", "time": 1543193544089, "rating": 1.0, "text": "Found a citizen blue angels watch they wanted 700 for on Amazon for 386 way to high mark up on product", "pics": null, "resp": null, "gmap_id": "0x889a4da2382ce71f:0x1573060748c99ae7"}
{"user_id": "117413609731171644674", "name": "Trayce Franklin", "time": 1541299315164, "rating": 5.0, "text": "The sales rep was very polite and profesional", "pics": null, "resp": null, "gmap_id": "0x889a4da2382ce71f:0x1573060748c99ae7"}
{"user_id": "113686023418078601885", "name": "San Richards", "time": 1529389376758, "rating": 5.0, "text": "Great staff and quality jewelry", "pics": null, "resp": null, "gmap_id": "0x889a4da2382ce71f:0x1573060748c99ae7"}
{"user_id": "101195742745056939849", "name": "Nicole Wimpee", "time": 1551060207203, "rating": 5.0, "text": "Nice and friendly staff.", "pics": null, "resp": null, "gmap_id": "0x889a4da2382ce71f:0x1573060748c99ae7"}
{"user_id": "102279079185805251175", "name": "GROWN MAN BUSINESS", "time": 1517512560959, "rating": 1.0, "text": "Calling this Location during business hours is a waste of time, they won't answer!", "pics": null, "resp": null, "gmap_id": "0x889a4da2382ce71f:0x1573060748c99ae7"}
{"user_id": "113069171175600191561", "name": "Annie Smith", "time": 1542652597265, "rating": 5.0, "text": "Awesome no waiting", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNNbM6CAq8mC24la0AYP0C-o4-g40Dru8b6SFbi=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4da2382ce71f:0x1573060748c99ae7"}
{"user_id": "114537209137586778649", "name": "sami shakir", "time": 1532140442769, "rating": 5.0, "text": "Great service", "pics": null, "resp": null, "gmap_id": "0x889a4da2382ce71f:0x1573060748c99ae7"}
{"user_id": "111906584481438748917", "name": "Margie Francis", "time": 1534032750188, "rating": 5.0, "text": "Excellent", "pics": null, "resp": null, "gmap_id": "0x889a4da2382ce71f:0x1573060748c99ae7"}
{"user_id": "115239782371514309949", "name": "Desmond Williams", "time": 1616792088513, "rating": 5.0, "text": "It was awesome 👌 and I'm coming back for my Cubans ⛓.", "pics": null, "resp": null, "gmap_id": "0x888c2bd6de817abf:0x1042952f88aae42"}
{"user_id": "109687983674690601757", "name": "Dr.Ritchelle Broadnax,DNP,CRNP", "time": 1603893402397, "rating": 1.0, "text": "This is the worst jewelry store I’ve ever come across. I bought a necklace that I wanted to be shorter. It was immediately sent off to repair to be shortened for me.  I was never able to bring the necklace home. It’s been a month. Every time repair sends it back to the store it doesn’t pass the quality inspection and is sent back. I was actually in the store for one of the instances and saw for myself that the necklace was uneven and has some discoloration. However, there is obviously a lack of skill in their repair department because they can’t seem to get this simple adjustment done. So, basically I have purchased a necklace that Zales themselves have ruined and I will never bring home. I called Corporate and they NEVER answer the phone. You’ll be listening to music and fun facts about Opals for hours. I’ll be returning to the store to simply get a refund. Worst experience ever. I should have went to Jareds.", "pics": null, "resp": null, "gmap_id": "0x888c2bd6de817abf:0x1042952f88aae42"}
{"user_id": "117472591630944432270", "name": "Malcolm Banks", "time": 1581044982029, "rating": 5.0, "text": "Came to Zales today to get the Valentine's Day special and they were sold out! I was crushed! I sat and thought for a moment and I asked Gina one of the salespeople was it possible to buy one on order and she was able to make sure that I got my order and it was sent to the right place! The customer service from everyone was outstanding!", "pics": null, "resp": null, "gmap_id": "0x888c2bd6de817abf:0x1042952f88aae42"}
{"user_id": "114728949188423539864", "name": "James Serritelli", "time": 1599089251569, "rating": 1.0, "text": "Can't even answer the phone", "pics": null, "resp": null, "gmap_id": "0x888c2bd6de817abf:0x1042952f88aae42"}
{"user_id": "114224244669921908230", "name": "Justin Golson", "time": 1571348244309, "rating": 5.0, "text": "N'Gina is the best! Always gives great advice. Made all my purchases easy and stress free!!", "pics": null, "resp": null, "gmap_id": "0x888c2bd6de817abf:0x1042952f88aae42"}
{"user_id": "110261172943529185643", "name": "Sarah", "time": 1513382661032, "rating": 1.0, "text": "Horrible. When sizing my engagement ring, they messed up the writing that was on the underside of the band, and a diamond chip was missing.\n\nWhen I called, the manager refused to replace the ring. They were nasty and horrible on the phone; I’ve never gone through such a thing. They ruined my ring and refused angrily to fix it.\n\nI had to bring my DAD down there with me in person to demand a new ring. They were intimidated into doing it.\n\nAs soon as I got my new ring, one of the 3 main diamonds fell out.\n\nI will never go to Zale’s ever again, not even if I were on fire and they had water. What a joke. Nasty people; horrible merchandise. My diamonds probably aren’t even real.", "pics": null, "resp": null, "gmap_id": "0x888c2bd6de817abf:0x1042952f88aae42"}
{"user_id": "110334319289249790751", "name": "Era Rivers", "time": 1613442721639, "rating": 1.0, "text": "Customer Service is nonexistent", "pics": null, "resp": null, "gmap_id": "0x888c2bd6de817abf:0x1042952f88aae42"}
{"user_id": "117538438424032087814", "name": "Arthur Moye", "time": 1526733292842, "rating": 5.0, "text": "Great quality at a great price with outstanding customer service.", "pics": null, "resp": null, "gmap_id": "0x888c2bd6de817abf:0x1042952f88aae42"}
{"user_id": "111351144553852131236", "name": "Jarrod Roseberry", "time": 1554598237547, "rating": 5.0, "text": "Great!! Sales lady was great!!", "pics": null, "resp": null, "gmap_id": "0x888c2bd6de817abf:0x1042952f88aae42"}
{"user_id": "116421357724667352112", "name": "Marcel Metoyer", "time": 1519618908802, "rating": 1.0, "text": "Afraid to say..when we get our rings back will post more.", "pics": null, "resp": null, "gmap_id": "0x888c2bd6de817abf:0x1042952f88aae42"}
{"user_id": "101200814895440806986", "name": "Kannon Ramon", "time": 1512853990265, "rating": 1.0, "text": "Absolute nightmare", "pics": null, "resp": null, "gmap_id": "0x888c2bd6de817abf:0x1042952f88aae42"}
{"user_id": "116270570708504255639", "name": "Rollie McCall", "time": 1601647058673, "rating": 5.0, "text": "I've never had a bad experience while shopping at Kay's Jewelers University mall in Tuscaloosa, Alabama. Thanks to the store manager (Mrs. Sheila). She is the ultimate professional, very knowledgeable, friendly, and easy to do business with!", "pics": null, "resp": null, "gmap_id": "0x8888a831417e2e97:0xc02c1c21906f1a3e"}
{"user_id": "107552104507970204060", "name": "H J", "time": 1598463452569, "rating": 1.0, "text": "Our experience was less than amusing. Dwayne was a delight working with us originally, although Sheila the store manager is condescending and manipulative. Will be traveling out of town for any regular maintenance or future purchases to a different Kay jewelers location, if at all.", "pics": null, "resp": null, "gmap_id": "0x8888a831417e2e97:0xc02c1c21906f1a3e"}
{"user_id": "113222609600963462486", "name": "Kenneth Carter", "time": 1599173150999, "rating": 5.0, "text": "Mrs. Shelia takes pride in what she does. Her service and care for customers is phenomenal!", "pics": null, "resp": null, "gmap_id": "0x8888a831417e2e97:0xc02c1c21906f1a3e"}
{"user_id": "107148021040406097446", "name": "angela rose", "time": 1614024462098, "rating": 5.0, "text": "Staff is always pleasant.", "pics": null, "resp": null, "gmap_id": "0x8888a831417e2e97:0xc02c1c21906f1a3e"}
{"user_id": "115678181343736975589", "name": "Chrissy Moore", "time": 1620092039063, "rating": 5.0, "text": "Jamie was amazing....", "pics": null, "resp": null, "gmap_id": "0x8888a831417e2e97:0xc02c1c21906f1a3e"}
{"user_id": "113217098152214956178", "name": "Laticia Frost", "time": 1500922032820, "rating": 5.0, "text": "I love shopping at this store. All the people that work there is amazing. Robert is a very super nice guy that will make anything possible for you. And make your visit perfect. I recommend this store to anybody...", "pics": null, "resp": null, "gmap_id": "0x8888a831417e2e97:0xc02c1c21906f1a3e"}
{"user_id": "103868557766881697734", "name": "Shannon Strickland", "time": 1574391128744, "rating": 5.0, "text": "Great service, great quality, and really great price!", "pics": null, "resp": null, "gmap_id": "0x8888a831417e2e97:0xc02c1c21906f1a3e"}
{"user_id": "108390044886128837335", "name": "Mariano Rodriguez (Mariano Rodriguez)", "time": 1569795949656, "rating": 1.0, "text": "I came today to look at watches and I mentioned to my friend that I was wearing a Michael Kors watch on and the sales person named Dion decides to say out loud that my watch is from Walmart and really made me feel that if I didn't buy the watch he had that I was nothing.", "pics": null, "resp": null, "gmap_id": "0x8888a831417e2e97:0xc02c1c21906f1a3e"}
{"user_id": "111484940309691820593", "name": "Daniel Lundy", "time": 1598549005305, "rating": 1.0, "text": "Took my wife's rings to get resized. Waited 2 months before I got them back and could not get in touch with anyone. When I got them back,\nmy wife still can not wear them.", "pics": null, "resp": null, "gmap_id": "0x8888a831417e2e97:0xc02c1c21906f1a3e"}
{"user_id": "108072266375488474002", "name": "Sheila Richard", "time": 1567789751487, "rating": 5.0, "text": "Y'all go see Shelia O'Rourke! Awesome customer service!", "pics": null, "resp": null, "gmap_id": "0x8888a831417e2e97:0xc02c1c21906f1a3e"}
{"user_id": "100823562003114809660", "name": "Tom McDonnell", "time": 1431452959777, "rating": 5.0, "text": "The Tuscaloosa Store was a great experience. My wife was treated very friendly and professionally. The Staff went out their way to be helpful.", "pics": null, "resp": null, "gmap_id": "0x8888a831417e2e97:0xc02c1c21906f1a3e"}
{"user_id": "112351320961612416201", "name": "Janelle Stewart", "time": 1553648650625, "rating": 5.0, "text": "Long time customers and everyone always treats us great!!!", "pics": null, "resp": null, "gmap_id": "0x8888a831417e2e97:0xc02c1c21906f1a3e"}
{"user_id": "110073840303890316218", "name": "Nothin Fancy Home Cookin", "time": 1527544630898, "rating": 5.0, "text": "The Staff here are great and made our engagement and wedding set shopping a breeze!  The only store we ever shop for jewelry in any state we live.", "pics": null, "resp": null, "gmap_id": "0x8888a831417e2e97:0xc02c1c21906f1a3e"}
{"user_id": "109564231949211752209", "name": "SHAWN Roy", "time": 1475323416230, "rating": 1.0, "text": "You should be able to navigate the website without dealing with all of their ads and BS. Just trying to get an idea of their inventory. My idea don't bother with the store.", "pics": null, "resp": null, "gmap_id": "0x8888a831417e2e97:0xc02c1c21906f1a3e"}
{"user_id": "110414090096219461469", "name": "Butch Palmer", "time": 1425102201713, "rating": 1.0, "text": "Also had a terrible experience.  Not worth the price, not worth the time, and they will LIE to you to get you to buy from here.  Bought an engagement ring from here, paid half up front, said that I would pay the other half when I get back into the country (just in case she declined the proposal).  Well, when I got back and paid it off, they had already sent a mispayment to my credit history and LIED AGAIN, saying that they would erase it from there.  They put me down for a payment plan, of which I didn't want, because I WAS OUTSIDE OF THE COUNTRY.  If I pay half, and say I'm going to pay the other half in three months, that's what I'm going to do.\n\nAny business that promotes this kind of lying deserves to shut down.", "pics": null, "resp": null, "gmap_id": "0x8888a831417e2e97:0xc02c1c21906f1a3e"}
{"user_id": "111713982094923513384", "name": "Jean George", "time": 1448222431973, "rating": 5.0, "text": "I have brought about several things from Kays jewelry and I hope that my husband  going there for Christmas", "pics": null, "resp": null, "gmap_id": "0x8888a831417e2e97:0xc02c1c21906f1a3e"}
{"user_id": "109858826750511579936", "name": "Andrea Howell", "time": 1532368378396, "rating": 5.0, "text": "Always enjoy shopping here.", "pics": null, "resp": null, "gmap_id": "0x8888a831417e2e97:0xc02c1c21906f1a3e"}
{"user_id": "103239790568537092386", "name": "Krystal Cox", "time": 1583290322230, "rating": 5.0, "text": "Wonderful Staff. Very helpful and knowledgable. Helped me to create a beautiful ring. Deffinately reccomend.", "pics": null, "resp": null, "gmap_id": "0x8887d6340532493b:0x45278ee83d627663"}
{"user_id": "103505346120404451000", "name": "Janice Sanderson", "time": 1550278091358, "rating": 5.0, "text": "Pleasant atmosphere,  let you shop without any pressure.  Ready to assist if you needed. I put a necklace on layaway", "pics": null, "resp": null, "gmap_id": "0x8887d6340532493b:0x45278ee83d627663"}
{"user_id": "106936786996544205836", "name": "Michael Steelfox", "time": 1574474894276, "rating": 5.0, "text": "Love the staff at zales, in my opion they have a wide selection and they are always friendly. Been using them for years and never had a bad experience with them.", "pics": null, "resp": null, "gmap_id": "0x8887d6340532493b:0x45278ee83d627663"}
{"user_id": "100213313193577690202", "name": "Savannah", "time": 1515800599506, "rating": 5.0, "text": "I have bought two very beautiful rings here. Both we reasonably priced for the diamond. I would buy from here again", "pics": null, "resp": null, "gmap_id": "0x8887d6340532493b:0x45278ee83d627663"}
{"user_id": "110158854670759363068", "name": "Tiffany Otts", "time": 1536370464361, "rating": 1.0, "text": "Not a very good selection. Most of jewelry is basically the same style. Nothing is \"wow\" like some you would see in other stores or even on the website. Also, felt like I was getting the hawk eye by the sales lady. Very uncomfortable.", "pics": null, "resp": null, "gmap_id": "0x8887d6340532493b:0x45278ee83d627663"}
{"user_id": "110139680141666970083", "name": "Mary Hamby", "time": 1558718389720, "rating": 5.0, "text": "Great service with my repair and other service !!  Thank you !", "pics": null, "resp": null, "gmap_id": "0x8887d6340532493b:0x45278ee83d627663"}
{"user_id": "100267384512477666010", "name": "Venetia Varden", "time": 1531527177637, "rating": 5.0, "text": "Best Customer Service anywhere!", "pics": null, "resp": null, "gmap_id": "0x8887d6340532493b:0x45278ee83d627663"}
{"user_id": "113330901258684819318", "name": "TJ McDonald", "time": 1526331701790, "rating": 5.0, "text": "Great customer service.", "pics": null, "resp": null, "gmap_id": "0x8887d6340532493b:0x45278ee83d627663"}
{"user_id": "104427358812522616649", "name": "RTG!!!!!", "time": 1614474780106, "rating": 5.0, "text": "I love this store and all the employees in it. They helped my husband find my new wedding set and also helped me wrap my ring with a second band. I have dealt with different employees and had wonderful customer service from each one.", "pics": null, "resp": null, "gmap_id": "0x888e85144eb873a1:0xd46b0d34bfdd7a4b"}
{"user_id": "103832985301658852008", "name": "Idette Clay", "time": 1623250828870, "rating": 5.0, "text": "Kay's consultants are very knowledgeable about their product and service. I could not have chosen a better jeweler to make my purchases.", "pics": null, "resp": null, "gmap_id": "0x888e85144eb873a1:0xd46b0d34bfdd7a4b"}
{"user_id": "109824009424162472724", "name": "W Barringer", "time": 1599498755717, "rating": 5.0, "text": "Excellent visit!!  Store is kept clean and sanitary. The staff is top notch!!!!  Unfortunately they were unable to clean my jewelry but they had cleaner available for purchase. They helped educate me on how to clean it.  So glad I know how to properly clean my jewelry in the safety of my home! So willing to go above and beyond!!!  Will shop at Kay Jewelers in Prattville for life!!! Thanks again ladies!!!!", "pics": null, "resp": null, "gmap_id": "0x888e85144eb873a1:0xd46b0d34bfdd7a4b"}
{"user_id": "115851954871762983144", "name": "Kristy Kanagala", "time": 1612318630706, "rating": 5.0, "text": "I absolutely love this location! They work hard to build a relationship with you and get to know your needs and wants. They are consistently kind and attentive.", "pics": null, "resp": null, "gmap_id": "0x888e85144eb873a1:0xd46b0d34bfdd7a4b"}
{"user_id": "118361272904024369644", "name": "andrew runge", "time": 1609193440188, "rating": 5.0, "text": "Awesome customer service. My wife’s wedding band lost a diamond recently so we took it to Kay’s to get fixed. They had to mail the ring off and it was back at their store fixed in no time. I’m currently working 6 days a week so Sunday is our only day to get stuff done. We drove to Kay’s (about 45 minutes) to find out they were closed do to a busted water pipe. I sent Adrienne an email and within 30-40 minutes she was at the the store to meet me and give us the ring. Couldn’t ask for better service!", "pics": null, "resp": null, "gmap_id": "0x888e85144eb873a1:0xd46b0d34bfdd7a4b"}
{"user_id": "109658741861810550726", "name": "william norris", "time": 1609091018447, "rating": 1.0, "text": "I would like to start that I have never left a review for any business I have ever used. This experience has been an exception. I ordered a wedding ring on November 11th and it was scheduled to arrive on November 22. We check in several times up through December 11th and the order had not arrived. This was fine because our wedding is not until February 6th. In mid December, the store manager, Adrienne, realized that the ring had mistakenly been shipped to Oklahoma. I understand there are a lot of shipping issues at the moment so I completely understood. On December  23rd, I called and was told by the store manager that the best direction to go would be to do a completely new order and that is would be scheduled to arrive in mid January. For a wedding on February 6th, a mid January shipment was cutting it too close for comfort considering our experience to this point. Hopefully canceling the order and getting my money back will be a better experience. Unfortunately, I could not recommend purchasing a blow pop from this store.", "pics": null, "resp": null, "gmap_id": "0x888e85144eb873a1:0xd46b0d34bfdd7a4b"}
{"user_id": "104465747698400501464", "name": "Erin Putter (Chasing Life's Adventure)", "time": 1601730287743, "rating": 1.0, "text": "Refused to help. I understand that we are dealing with COVID and all but this location is keeping the doors locked and makes you wait outside until they see you. I went there with the intent to get my wedding rings sent off for sizing and soldering. Was told I needed an appointment. No one was in the store and I asked to simply give her my rings and wait for the paperwork outside. Was told no. What is so precious in a jewelry store that they have to be on a near lockdown status but I can go nearly anywhere else at this point? I wonder why they don’t just close the store for the duration so they can stop paying people to do nothing.", "pics": null, "resp": null, "gmap_id": "0x888e85144eb873a1:0xd46b0d34bfdd7a4b"}
{"user_id": "104331232233911073521", "name": "Caesar How", "time": 1546454659417, "rating": 5.0, "text": "The manager is awesome and always there and her staff rocks. Her commitment to service keeps me coming back. Every business needs someone like her for sustainability and image. She is a true gem for Kay and I will continue to come back as long as she is there.", "pics": null, "resp": null, "gmap_id": "0x888e85144eb873a1:0xd46b0d34bfdd7a4b"}
{"user_id": "113804646168203859170", "name": "M W", "time": 1495831933490, "rating": 1.0, "text": "Staff was rude and inconsiderate of me not having knowledge of the different cuts of diamonds. The sales representative eventually wouldn't answer any other questions and suggested I shop somewhere less expensive.. of course my budget was $15,000. Your loss Kay Jewelers.", "pics": null, "resp": null, "gmap_id": "0x888e85144eb873a1:0xd46b0d34bfdd7a4b"}
{"user_id": "109329432365500535471", "name": "Austin kane", "time": 1547131742590, "rating": 5.0, "text": "Got nice jewelry and the employees treat u with kindness and respect", "pics": null, "resp": null, "gmap_id": "0x888e85144eb873a1:0xd46b0d34bfdd7a4b"}
{"user_id": "113323237989679847620", "name": "Keith Jefferson", "time": 1546634157429, "rating": 5.0, "text": "Amazing staff and a great variety of jewelry", "pics": null, "resp": null, "gmap_id": "0x888e85144eb873a1:0xd46b0d34bfdd7a4b"}
{"user_id": "113658846981870187853", "name": "Lyn Adams", "time": 1488912965977, "rating": 5.0, "text": "Great customer service and good selection of items.", "pics": null, "resp": null, "gmap_id": "0x888e85144eb873a1:0xd46b0d34bfdd7a4b"}
{"user_id": "107465337736634247348", "name": "Mz. T. McKitt", "time": 1546050523722, "rating": 4.0, "text": "Staff & customer service was excellent!", "pics": null, "resp": null, "gmap_id": "0x888e85144eb873a1:0xd46b0d34bfdd7a4b"}
{"user_id": "115627817015887842827", "name": "SRT 392", "time": 1530923067313, "rating": 5.0, "text": "Very helpful and amazing customer service", "pics": null, "resp": null, "gmap_id": "0x888e85144eb873a1:0xd46b0d34bfdd7a4b"}
{"user_id": "105113976687708308899", "name": "Kent M McDonald", "time": 1547755309667, "rating": 5.0, "text": "I have visited this store four times and each visit has been a pleasure.", "pics": null, "resp": null, "gmap_id": "0x888e85144eb873a1:0xd46b0d34bfdd7a4b"}
{"user_id": "109961833999629826607", "name": "Jennie Bridges", "time": 1548644937239, "rating": 5.0, "text": "Friendly, helpful associates.", "pics": null, "resp": null, "gmap_id": "0x888e85144eb873a1:0xd46b0d34bfdd7a4b"}
{"user_id": "117189240162372476549", "name": "Amy Loan Goetting", "time": 1529349587842, "rating": 1.0, "text": "They messed up my $300 watch for a battery change and wanted to call the cops when I asked for a refund.", "pics": null, "resp": null, "gmap_id": "0x888e85144eb873a1:0xd46b0d34bfdd7a4b"}
{"user_id": "102505088674716981691", "name": "Paul Collins", "time": 1619358639808, "rating": 1.0, "text": "Sales lady ran over to make us put on a mask then we never saw anybody to help us actually buy something. Church music blaring. We politely left and walked down to Kay and spent our $1400. We won’t be back. EVER", "pics": null, "resp": null, "gmap_id": "0x8888e1b4793c6c13:0xbbd0d2b56817fb38"}
{"user_id": "114586757136124265037", "name": "Judy Wilson", "time": 1619647148819, "rating": 2.0, "text": "I can't believe how reduced their stock is. And no more Lancombe or Estee products.  Such a shame! Please please improve your products for us in Trussville.  I'm worried", "pics": null, "resp": null, "gmap_id": "0x8888e1b4793c6c13:0xbbd0d2b56817fb38"}
{"user_id": "108361516582701758271", "name": "Daphne Lett McKee", "time": 1621280826187, "rating": 5.0, "text": "Great customer service here..highly recommended.", "pics": null, "resp": null, "gmap_id": "0x8888e1b4793c6c13:0xbbd0d2b56817fb38"}
{"user_id": "114789036087068887103", "name": "Slymm Gilbert", "time": 1609602341483, "rating": 5.0, "text": "Me and my wife went to just look at a ring but we got such an amazing deal we couldn't pass it up. I advise any man that truly wants to make his partner happy to go and visit zales.", "pics": null, "resp": null, "gmap_id": "0x8888e1b4793c6c13:0xbbd0d2b56817fb38"}
{"user_id": "102952613248880929441", "name": "queen issa", "time": 1612724031286, "rating": 1.0, "text": "Ok on yesterday I took 2 of my rings to be sized I arrived at 6pm they close at 7 so when i first walked in the lady said could one of yall get her because i have do my closing stuff.Then a man tried to HELP me he wasn't friendly either.. Long story short my experience here was rude and awful I should have went to Kay Jewelry Zales in trussville were rude", "pics": null, "resp": null, "gmap_id": "0x8888e1b4793c6c13:0xbbd0d2b56817fb38"}
{"user_id": "106380403138149235090", "name": "Monique Houle", "time": 1613674239581, "rating": 2.0, "text": "I find it rather pathetic that a store that doesn’t even open till 11 am can’t be opened on time.  This is not the 1st time but it is the last time.", "pics": null, "resp": null, "gmap_id": "0x8888e1b4793c6c13:0xbbd0d2b56817fb38"}
{"user_id": "117337452315488955431", "name": "Byron Hinton", "time": 1624111689154, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x8888e1b4793c6c13:0xbbd0d2b56817fb38"}
{"user_id": "101017662899021256627", "name": "Tan Alexander", "time": 1628377405270, "rating": 5.0, "text": "Christina was AWESOME", "pics": null, "resp": null, "gmap_id": "0x8888e1b4793c6c13:0xbbd0d2b56817fb38"}
{"user_id": "106425420342356338430", "name": "Josh Mckee", "time": 1612992005712, "rating": 1.0, "text": "No one answers the phone", "pics": null, "resp": null, "gmap_id": "0x8888e1b4793c6c13:0xbbd0d2b56817fb38"}
{"user_id": "114062987217487735849", "name": "DeNaia Gilliam", "time": 1504313911632, "rating": 5.0, "text": "The manager Johna and her staff are super friendly, they make you feel welcomed and wanted as soon as you walk in the door! Went for my inspection and cleaning and they were all smiles! Thank you!", "pics": null, "resp": null, "gmap_id": "0x8888e1b4793c6c13:0xbbd0d2b56817fb38"}
{"user_id": "100544336567694399952", "name": "Kat Welch", "time": 1516569521280, "rating": 5.0, "text": "Jessica and associates as well as the manager are awesome. So very helpful and nice. Thank you.", "pics": null, "resp": null, "gmap_id": "0x8888e1b4793c6c13:0xbbd0d2b56817fb38"}
{"user_id": "109143521121514909243", "name": "Carolyn Grissom", "time": 1553360995780, "rating": 5.0, "text": "Very courteous, and friendly environment with a professional manner.", "pics": null, "resp": null, "gmap_id": "0x8888e1b4793c6c13:0xbbd0d2b56817fb38"}
{"user_id": "116236365220033923811", "name": "Luvonia Alexander", "time": 1483473832204, "rating": 5.0, "text": "Great staff.  Awesome discounts and beautiful jewelry", "pics": null, "resp": null, "gmap_id": "0x8888e1b4793c6c13:0xbbd0d2b56817fb38"}
{"user_id": "103217468450120118457", "name": "TIMMY WILLIAMS", "time": 1487531934955, "rating": 1.0, "text": "The tall white associate that works there is a jerk!!! Doesn't want to help and rude. He needs to be fired!!!", "pics": null, "resp": null, "gmap_id": "0x8888e1b4793c6c13:0xbbd0d2b56817fb38"}
{"user_id": "108144030752293818581", "name": "yolanda clark", "time": 1544680322868, "rating": 5.0, "text": "Wonderful experience that was easy", "pics": null, "resp": null, "gmap_id": "0x8888e1b4793c6c13:0xbbd0d2b56817fb38"}
{"user_id": "113735061441800164665", "name": "Jermane Latham", "time": 1562186873213, "rating": 4.0, "text": "Jessica is a sweetheart", "pics": null, "resp": null, "gmap_id": "0x8888e1b4793c6c13:0xbbd0d2b56817fb38"}
{"user_id": "104196536876368110472", "name": "B Harbin", "time": 1499332607356, "rating": 1.0, "text": "Sucks", "pics": null, "resp": null, "gmap_id": "0x8888e1b4793c6c13:0xbbd0d2b56817fb38"}
{"user_id": "114541059234970038937", "name": "Hope Chandler", "time": 1622052972819, "rating": 3.0, "text": "This is a complaint for the labs they use not the actual store itself... I sent my ring off a month ago to be resized and have my bands put together, it came back a week ago and there was a crack in my band so she sent it back off to another lab. Comes back in today and the ring looks like the lab didn’t even touch it still has the crack in it and all so she’s sending it back off again... these labs they use don’t do inspections before they send the jewelry back and they do poor jobs. We don’t spend thousands of dollars for our stuff to be treated like this.. The employees at the store in the mall are very helpful and understand my frustration and are just as mad as I am.", "pics": null, "resp": null, "gmap_id": "0x8892921311c230fd:0x186d43e3c6e283ec"}
{"user_id": "102557573110952173828", "name": "Lily Angelovich", "time": 1621214660312, "rating": 1.0, "text": "Went in there tonight and nobody even said hello or even tried to help us. Don’t judge a book by it’s cover. I was going to pay cash for the jewelry but since they were too busy talking and not trying to even help I’ll take my business elsewhere.", "pics": null, "resp": null, "gmap_id": "0x8892921311c230fd:0x186d43e3c6e283ec"}
{"user_id": "101397702881136732703", "name": "Jonathan Hobbs", "time": 1617667722824, "rating": 1.0, "text": "They love to sell the warranty but get an attitude when you need to use it.", "pics": null, "resp": null, "gmap_id": "0x8892921311c230fd:0x186d43e3c6e283ec"}
{"user_id": "110077456815213607321", "name": "Courtenay Nerbonne", "time": 1608778876115, "rating": 5.0, "text": "Very helpful and knowledgeable staff.  Super friendly and not pushy.  Fantastic shopping experience", "pics": null, "resp": null, "gmap_id": "0x8892921311c230fd:0x186d43e3c6e283ec"}
{"user_id": "116164727686192609901", "name": "Regina Mayzum", "time": 1620234004267, "rating": 5.0, "text": "Very nice and helpful staff", "pics": null, "resp": null, "gmap_id": "0x8892921311c230fd:0x186d43e3c6e283ec"}
{"user_id": "115877295422148427325", "name": "Ms Melody Rhines", "time": 1602096004884, "rating": 5.0, "text": "Lisa is GREAT! Professional, efficient, friendly & informed, ready to help with ANY jewelry needs it your concerns, Busy KAY JEWELERS in the Wiregrass Commons Mall in Dothan, you'll enjoy your experience 😉", "pics": null, "resp": null, "gmap_id": "0x8892921311c230fd:0x186d43e3c6e283ec"}
{"user_id": "107498901948482225730", "name": "William Neal", "time": 1612033267828, "rating": 1.0, "text": "Refused service due to me not wearing a mask which I cannot medically wear one ...\n\nI'll spend my money elsewhere in the future.", "pics": null, "resp": null, "gmap_id": "0x8892921311c230fd:0x186d43e3c6e283ec"}
{"user_id": "102497525057177535141", "name": "Shelia Hogans", "time": 1581828642559, "rating": 5.0, "text": "Amber is the BEST! She is well knowledgeable of all the products and services! She always takes considerable care of my husbands and I wants and what we like!", "pics": null, "resp": null, "gmap_id": "0x8892921311c230fd:0x186d43e3c6e283ec"}
{"user_id": "101968556481766257269", "name": "Kevin Kennedy", "time": 1545243088560, "rating": 5.0, "text": "I loved the service they gave me, they were very knowledgeable about the type of jewelry that I wanted. They suggested many types of pieces of jewelry that would be great for my lady. The sales Rep. Princess helped me with every little detail that I was looking for, she really knows what a Princess wants for she is princess herself just like her name. Thanks for all the help Princess.", "pics": null, "resp": null, "gmap_id": "0x8892921311c230fd:0x186d43e3c6e283ec"}
{"user_id": "109405690949739410163", "name": "Lanie Dixon", "time": 1568763213729, "rating": 1.0, "text": "Terrible customer service!!! My fiancé and I went to Kay’s in Wiregrass Commons over the weekend to try on wedding bands to go with my ring. They were pretty busy, busier than they normally are when I’m at the mall, so we decided to go visit another store since we knew we wouldn’t be helped for a while. We came back about 30 minutes later and there were 2 customers in the store. We sat down and waited for them to be helped first. We sat in the store for an HOUR and not ONE employee acknowledged us, told us they would be right with us, apologized, nor thanked us for waiting. We kept being walked by like we were dust on the ground. One of the worst customer service experiences I have ever had. Do better!!! I seriously could not believe the experience we had.", "pics": null, "resp": null, "gmap_id": "0x8892921311c230fd:0x186d43e3c6e283ec"}
{"user_id": "110994650388444799253", "name": "Amelia Whitaker", "time": 1528310535228, "rating": 5.0, "text": "The staff is friendly and knowledgeable.  They helped me with an item that needed work.  I have also been pleasantly pleased with the ring and earrings purchased from them.  Thank you Janet, and your staff.  Y'all are awesome!", "pics": null, "resp": null, "gmap_id": "0x8892921311c230fd:0x186d43e3c6e283ec"}
{"user_id": "101024877976867819406", "name": "Jerri O'Donohoe", "time": 1550533735932, "rating": 5.0, "text": "Kay Jewelers treats us like Royals. Sophia and the staff at Pearland Town Center are fabulous! We highly recommend Kay's.", "pics": null, "resp": null, "gmap_id": "0x8892921311c230fd:0x186d43e3c6e283ec"}
{"user_id": "113874089895614369377", "name": "Kristen Galego", "time": 1567203255529, "rating": 5.0, "text": "Just left Kay's in dothan thanks to kayla! Thank you kayla for making my dream come true. You went above and beyond for me everytime I look at my ring I'll be reminded of your amazing customer service <3.", "pics": null, "resp": null, "gmap_id": "0x8892921311c230fd:0x186d43e3c6e283ec"}
{"user_id": "114487221710114763586", "name": "Kamron Higgins", "time": 1537067156384, "rating": 5.0, "text": "I had such a great seamless experience . They listened to my likes and dislikes and provided me with the perfect ring ! The sales lady Kailah was amazing , she took her time and gave me plenty of options to choose from . She even took the time to learn how me and my now fiance met . Thank you kay jewelers Dothan for everything!", "pics": null, "resp": null, "gmap_id": "0x8892921311c230fd:0x186d43e3c6e283ec"}
{"user_id": "116576891825135155668", "name": "Crystal Arnold", "time": 1534457065942, "rating": 5.0, "text": "My husband, 2 kids and I went in last Friday to look for new bands for our vow renewal next month. We had the pleasure of Kailah, Svetlana and Kassie helping us pick our new rings. I tired on MANY and went back and forth...I was THAT customer and they were nothing but patient and didnt try to push a sale. They wanted to make sure I got exactly what I wanted. My girls started to get a bit restless after a couple HOURS and they got them something to keep them busy so my husband and I could shop. Thank you ladies for your kindess and we will be back!", "pics": null, "resp": null, "gmap_id": "0x8892921311c230fd:0x186d43e3c6e283ec"}
{"user_id": "104628365184767031741", "name": "Holley Hawkins", "time": 1501365585129, "rating": 1.0, "text": "If I could give this place a negative 10 that's what I would do. We have had such awful experiences with this place!!! I have 2 rings from them. One that was sent off 3 times. And a brand new one that I haven't even had a year sent off 5 different times!! Cracked stones, loose stones, bad brackets. It's really awful quality and awful customer service. We have been lied to over and over. Nothing has been done. My ring was supposed to be replaced this 5th time it's been gone and they never sent it off or ordered the replacement and I've been waiting since May!!!! Here it is August!!! I call to see if it was in because it was supposed to be here July 26th. They said yes. I go in to get it and it's my original, BROKEN ring!!!!!!! We will NEVER use Kay's again!!!!!!! The assistant manager Tara should be fired!!! She is AWFUL with customers and a liar!!! She was the one supposedly handling this!!!!!!", "pics": null, "resp": null, "gmap_id": "0x8892921311c230fd:0x186d43e3c6e283ec"}
{"user_id": "107940610676422739664", "name": "J j", "time": 1488234823907, "rating": 5.0, "text": "The nicest and most professional Jewelry store I've experienced In awhile!! props to Tara and Janet for their outstanding customer service!!", "pics": null, "resp": null, "gmap_id": "0x8892921311c230fd:0x186d43e3c6e283ec"}
{"user_id": "111499023374711220093", "name": "Kimberly Carter", "time": 1437400583788, "rating": 1.0, "text": "The worst customer service for a jewelry store I have ver seen, I had to send in my ring due to I believe a flaw for replacement.  I called on multiple occasions to find out about my ring and have yet to find out any information, very rude staff. This isn't the first time I have recieved a rude staff memeber either, I called to find out about a matching band and was given very rude customer service. I believe this will be the end of me buying from Kay.", "pics": null, "resp": null, "gmap_id": "0x8892921311c230fd:0x186d43e3c6e283ec"}
{"user_id": "100696992722353994282", "name": "Jeni Tart", "time": 1525888560909, "rating": 1.0, "text": "Two people working, both with customers, stood there for over 20 minutes. Neither even acknowledge that we were standing there. No be right with you, no nothing. Rude rude rude. Won't have my business ever again.", "pics": null, "resp": null, "gmap_id": "0x8892921311c230fd:0x186d43e3c6e283ec"}
{"user_id": "105856539902477383588", "name": "Akilah Howard-Brown", "time": 1551589740633, "rating": 5.0, "text": "Great and Friendly service", "pics": null, "resp": null, "gmap_id": "0x8892921311c230fd:0x186d43e3c6e283ec"}
{"user_id": "110345931195230519487", "name": "Deshanda Gardner", "time": 1505425579991, "rating": 1.0, "text": "The worst customer service ever will not be back.", "pics": null, "resp": null, "gmap_id": "0x8892921311c230fd:0x186d43e3c6e283ec"}
{"user_id": "102767770904425223117", "name": "Steve Brown", "time": 1621797954168, "rating": 1.0, "text": "Was looking to trade in a old ring I had purchased from Kay to bring down the cost. Found the ring I wanted in the store and decided to think about it. After leaving checked Kay's website and found the same ring for the same cost without trading in my ring. First thing came to mind was \"You Croaks\". I almost gave you \"CROAKS\" my ring for nothing. BUYERS BEWARE THIS IS WHAT IT HAS COME TO.", "pics": null, "resp": null, "gmap_id": "0x8862847cea393479:0xea6f934a008dc8e7"}
{"user_id": "101270413084719294850", "name": "Deanna Salazar", "time": 1610322439059, "rating": 5.0, "text": "My husband wanting to surprise me for Christmas this year 2020 and doing so we went to Kay in Decatur on the 24th of December. We got there and he purchase me a beautiful ring-! The young lady Jasmine was working and was helping us to decide and making this the best experience ever-! With the holidays here Jasmine told us it would take about 2 plus weeks for it to be returned. I went into the storr tonight just to see if my ring was back and to my surprise it was-! With the holidays and everything it did take the 2 weeks-! Jasmine and the other young lady that night (Diana) was wonderful-! Jasmine tonight was wonderfule-! I recommend them to anyone-! Thanks again Jasmine", "pics": null, "resp": null, "gmap_id": "0x8862847cea393479:0xea6f934a008dc8e7"}
{"user_id": "102303836111485374369", "name": "Sarah Blakely", "time": 1600652820818, "rating": 5.0, "text": "I went to Google to get the store's number and saw the last 2 reviews and had to say something! We will be calling corporate as well! We NEVER go to the Decatur location, because of past experiences,  but recently we had a wedding to attend in town and stopped in. Jessica, the store Manager, was INCREDIBLE.  I had dreaded walking in and she immediately made us feel at home. The reason I am leaving a review is because not only was the man claiming a dispute with his credit company in there and behaving like an absolute juvenile, I fully believe the call she received from who I gathered (from eavesdropping tbh) was corporate was in regards to the man on here complaining about \"an order.\" First of all, I am a retail manager as well. If I gave a return on a machine we sent somewhere for maintenance I would lose my job.  The man acted like a baby, and my husband was irate that a grown man should behave that way. The manager, though, was nothing less than professional,  and dealt with it better than I would have for sure! Secondly,  when I listened to her phone conversation about pendant man,  Jessica said more than once but shouldn't we do something for him, they hadn't found out if they could yet (or something like that.) All I thought that day was wow, people are so rude, and it's not even their fault. I never thought I would recommend the Decatur store, but 100% I recommend to everyone! The staff is nice, I actually trust them for once, and the manager Jessica is clearly willing to go above and beyond to try to help you even when you act like a total jerk to her. I admit even I kinda did at first, I just expected the kind of service that caused us to stop going there. Jessica if you see this, you have customers for life - The Blakely Family", "pics": null, "resp": null, "gmap_id": "0x8862847cea393479:0xea6f934a008dc8e7"}
{"user_id": "117174930376415819965", "name": "corey house", "time": 1600522467661, "rating": 1.0, "text": "Dishonest, no Integrity, and their word means nothing. Bought diamond earrings from Decatur, Al store and thought ordered custom diamond picture pendant to match earrings. After several assurances the piece could be made kay finally told me the piece couldn't be made but would not take earrings back because 30 day window passed for refund but it passed because I was waiting on pendant to be made. I did inform kay in beginning that I was getting earrings and pendant as set. They finally told me custom order was never put in is the reason for no refund which wasnt my fault. I don't work for kay and I don't know the protocol  but the store manager took my order or at least I thought and once they couldn't deliver they used a technicality to keep my money. They dont have the best merchandise anyway but make sure you cross your t's and dot your i's when dealing with them.", "pics": null, "resp": null, "gmap_id": "0x8862847cea393479:0xea6f934a008dc8e7"}
{"user_id": "109697857957764557291", "name": "Chasity Warren", "time": 1584222484431, "rating": 5.0, "text": "I had went to two different jewelers to order my daughter a class ring and no one seemed to care to help, just told to go online. I did not know her size and she was with me but no one seemed to want to help. Walked into Kay jewelers on 6th ave and it was totally different. They were super friendly and there’s was also online but she pulled it up and ordered it with me there and sized my daughter. We received it today and went in to pick up and love it and also the same friendliness. Thank you for being good at what you do!", "pics": null, "resp": null, "gmap_id": "0x8862847cea393479:0xea6f934a008dc8e7"}
{"user_id": "114999514352448933248", "name": "Amanda Lambert", "time": 1581211850864, "rating": 5.0, "text": "Me and my husband were at Kay Jewelers tonight. The gentleman that helped us was very pleasant. We had a great experience picking out my valentine’s present.", "pics": null, "resp": null, "gmap_id": "0x8862847cea393479:0xea6f934a008dc8e7"}
{"user_id": "117809409834215862364", "name": "Paul Eichwurtzle", "time": 1595706462535, "rating": 5.0, "text": "Friendly, thorough, professional service. Reasonable pricing.", "pics": null, "resp": null, "gmap_id": "0x8862847cea393479:0xea6f934a008dc8e7"}
{"user_id": "100812277500082119633", "name": "Midnight_Rider 2020", "time": 1615452172822, "rating": 5.0, "text": "Good and pretty jewelry", "pics": null, "resp": null, "gmap_id": "0x8862847cea393479:0xea6f934a008dc8e7"}
{"user_id": "110730501645668626104", "name": "Jo Dumas", "time": 1541269061442, "rating": 1.0, "text": "Bought a pocket watch for my son in law for his graduation from the police academy. Took it back there 2 times to have it engraved. They couldn't find the engraving paperwork both times. Thought since I purchased it there it wouldn't be a problem to have it engraved.Will be taking it somewhere else. Very unprofessional staff.", "pics": null, "resp": null, "gmap_id": "0x8862847cea393479:0xea6f934a008dc8e7"}
{"user_id": "106226698010544039202", "name": "Ashlie Richie", "time": 1550850765362, "rating": 1.0, "text": "I took my husbands wedding ring in to be sized and they told us to come back in two weeks to pick it up. When we got there to get his ring they couldn’t find it and asked us if we were sure it was this store that we used. Then they finally found it and the bag it was in had giant red writing on it that said “Have Not Paid”. I explained to the lady that when I bought the ring I also bought the warranty and that when they found us in the system two weeks prior that they said because I bought that we would not have to pay for it to be sized. She looked us up in the system and could not find us again. When we came in the first time they had trouble finding me in the system and the same lady took all my information and said she would update me in the computer so we would not have to go through all of that again. When I explained that, she laughed and said “Oh that was me haha I didn’t do it.” So they spend like 20 minutes just trying to find us in the computer and then acted like they didn’t want to give us our ring once they found us. We found out after we left that after all of that they did not even size it!! We definitely will NOT be coming back here.", "pics": null, "resp": null, "gmap_id": "0x8862847cea393479:0xea6f934a008dc8e7"}
{"user_id": "118205108761816132567", "name": "Michael R", "time": 1449459219754, "rating": 1.0, "text": "Gary, the manager, assured me my ring would be in the month before my wedding, and told me if he was ever out of the store his co-manager Cristy would take care of me. Nobody followed up with me regarding the ring or informed me they would not have it by the date we needed it. A week before the wedding date I called up to the store and was told Gary was out of town so I left my name and number and asked to have Cristy call me. No response. Two days later I called and again asked for Cristy by name. The girl came back to the phone and said Cristy did not call me back because Gary knew about my account, not her. She didn't take my call. We did not have a ring on the wedding date, we couldn't even talk to anybody who knew the status. I finally received the ring, well past the wedding date, about twice as long as Gary told me it would take. Gary repeatedly blamed the shop for not having or knowing about my ring. When I picked up the ring I told Gary they dropped the ball and I felt like they should adjust the price of the ring - or do something to make it right. Gary looked me in the eyes and told me \"I will go to bat for you\" in regards to making it right, he said he would contact me in a few days. After a month I called Gary back today to ask for his district managers number, in hopes of finally getting a resolution. Gary said to me, \"I thought we were done when you picked up your ring\". A far cry from going to bat for me like he said he would. I feel like Gary intentionally lied to me to get rid of me. I closed my account and wont do business with Kay or Gary or Cristy again.", "pics": null, "resp": null, "gmap_id": "0x8862847cea393479:0xea6f934a008dc8e7"}
{"user_id": "101758751138376967519", "name": "Zach Richie", "time": 1550694517610, "rating": 1.0, "text": "Not good service. Didnt believe we bought my wedding band there even though it was in the computer. Took it to get sized and it was never sized. The woman claimed we didn't have warranty on the ring and almost refused to give it to me. They finally found it in the computer and saying it wasn't purchased there and they pulled it up 2 weeks before hand. Will take my business elsewhere.", "pics": null, "resp": null, "gmap_id": "0x8862847cea393479:0xea6f934a008dc8e7"}
{"user_id": "109508137692215896816", "name": "Captain_Redpill", "time": 1542830565028, "rating": 1.0, "text": "Ever since the store changed locations and employees the only kiss that begins with this Kay's is kiss customer appreciation and service goodbye.", "pics": null, "resp": null, "gmap_id": "0x8862847cea393479:0xea6f934a008dc8e7"}
{"user_id": "112934043548388738298", "name": "farrah derusseaux", "time": 1597533734396, "rating": 5.0, "text": "Awesome, Excellent Customer Service", "pics": null, "resp": null, "gmap_id": "0x8862847cea393479:0xea6f934a008dc8e7"}
{"user_id": "112543135758943730639", "name": "Landon Smith", "time": 1545179719392, "rating": 5.0, "text": "Love the staff here! Very friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x8862847cea393479:0xea6f934a008dc8e7"}
{"user_id": "108980205164613426892", "name": "Ashley Kirby", "time": 1540682634925, "rating": 1.0, "text": "I had the worst experience ever with this store. I took my engagement ring in for its 6 month checkup and to go down a quarter of a size. They told me to come back in two weeks and it will be here. So two weeks later we go in to get it and it’s been ruined when they went to go down a half a size. Had a huge gash in it, popped out two big diamonds and a diamond on the side. We were heartbroken, they also told us that it was a discontinued ring so they couldn’t reorder another ring and to pick another ring. So I spent a couple days looking and just couldn’t find any ring that I liked. So I ended up going to the Kay’s in bridgestreet and instantly falling in love with one. Told them the situation and they were so shocked. They said they had never had a ring be sent off and be ruined at their store. They told me to tell Decatur which one I wanted and they could have it ordered. So my fiancé called Decatur asking if they could have it in my size and ordered and the girl said absolutely you can, come tomorrow and we will have it all ready for you. Well we go the next day and the girls calling all these places just to come back to me to say we can’t get your ring in a size for you so pick another ring. I was so upset. They ruined my ring, then told me the night before they could just to have me go all the way to the store to tell me no they can’t pick another one. I was so angry I ended up leaving. I later in the week went back to the bridestreet and they were so shocked with Decatur’s performance to us, they said we can absolutely get you the ring you want in the size you need and they were confused why Decatur told us we couldn’t. They told us to go into Decatur, get our ring and walk out and call customer service. So we did and the store manager himself fixed us up at bridgestreet with the ring we wanted, plus the band, the size we wanted, and ensured us it would be in two weeks in time for engagement pictures. Yesterday my ring came in, it’s absolutely perfect!! It just goes to show Decatur is very unprofessional, their workers are unskilled and the store manager not once came to handle the situation or talked to us about it even when we were two feet away from her. Decatur has forever lost my service and bridestreet will forever by my hero’s who came in and cleaned up their mess.", "pics": null, "resp": null, "gmap_id": "0x8862847cea393479:0xea6f934a008dc8e7"}
{"user_id": "109305730831048236733", "name": "Brandi Perry", "time": 1574733262054, "rating": 1.0, "text": "Sandy, the store manager, at the Decatur store, is so rude and unprefesionel. Kay lost a lot of family business because of her. She was so awful she was reported to cooperate. Sandy. Customer service is a must in retail.", "pics": null, "resp": null, "gmap_id": "0x8862847cea393479:0xea6f934a008dc8e7"}
{"user_id": "114969429984185862987", "name": "Maurice Blumberg", "time": 1559423868091, "rating": 5.0, "text": "Go to a Dana Augustine one day show, bring your stones and see what they can do in the day.", "pics": null, "resp": null, "gmap_id": "0x8862847cea393479:0xea6f934a008dc8e7"}
{"user_id": "108409169467544310054", "name": "Jason Terry", "time": 1595351386032, "rating": 5.0, "text": "Great people", "pics": null, "resp": null, "gmap_id": "0x8862847cea393479:0xea6f934a008dc8e7"}
{"user_id": "114832451787642463340", "name": "John Zink", "time": 1543513453722, "rating": 1.0, "text": "The store closed.   Weeks ago 😐", "pics": null, "resp": null, "gmap_id": "0x8862847cea393479:0xea6f934a008dc8e7"}
{"user_id": "105511074938244367849", "name": "Mr Review", "time": 1524048064627, "rating": 1.0, "text": "Employees are horrible they treated me like my service wasn’t important", "pics": null, "resp": null, "gmap_id": "0x8862847cea393479:0xea6f934a008dc8e7"}
{"user_id": "117842076252563314720", "name": "April L. Butler", "time": 1533947701534, "rating": 5.0, "text": "The team at the Kay Jewelers in Brookwood Mall were a wonderful help and so patient while designing an upgraded ring for me.  Excellent service and seemingly unlimited options for even the pickiest bride.  If we ever upgrade again, this is where I'll go, hands down!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN0whArg8lUvclr9PUm7zS3B0E8jQSi2Vh3_0sR=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889199120f82e59:0xc026b95d1d5c4937"}
{"user_id": "104961784349868067870", "name": "Dawn Productions", "time": 1576101787395, "rating": 5.0, "text": "I had a great experience there today 12/11/19 as usual. I don’t know why I even attempted to go to any other Kay’s because they don’t have anything and they will basically harass you to buy something. However, I’ve never had that experience at Brookwood. The ladies are always helpful, nice, and they don’t harass you (which is a plus, because If I feel like you’re pressuring me I will walk out and not purchase anything.) Brookwood always have a great selection of jewelry and great customer service. And I am one of those people who “wants to buy something but don’t know what” aka “the complicated, undecided shopper”. Today a young girl name Chariot helped me trade my old ring and pick a new one I wanted to give my mom for Christmas.  She was guided by the of the mangers, I didn’t get her name. But she was a cute middle age black woman. They suggested things to help me make a decision and I purchased my moms gift and actually felt good about it. (Unlike when I purchase something at other Kay’s and end up returning it LOL). Thanks for helping me today and keep up the good work. Soon you guys soon !!!", "pics": null, "resp": null, "gmap_id": "0x8889199120f82e59:0xc026b95d1d5c4937"}
{"user_id": "101106051580444581550", "name": "Jackie Carter", "time": 1491308436080, "rating": 5.0, "text": "My fiancé and I loved our experience here! Great staff who were knowledgeable and helped us find the perfect ring! We will be going back!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO5Vr7g_4rAhNLCVVVQrz-z6LLNTopvKjkIbt7d=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8889199120f82e59:0xc026b95d1d5c4937"}
{"user_id": "115458402459318860782", "name": "JOHN MORENO", "time": 1561147502274, "rating": 5.0, "text": "i alway buy from Alexis at Kay Brookwood mall! She is the best and takes the time to meet my needs or let me know what I need. She is like my personal agent, Thats how she makes everyone feel and its rare and special. If you have a need. Go there, every time.", "pics": null, "resp": null, "gmap_id": "0x8889199120f82e59:0xc026b95d1d5c4937"}
{"user_id": "111510921373565484439", "name": "Matthew Leonardi", "time": 1528939370418, "rating": 5.0, "text": "By far the best customer service I have ever received, my fiance and I went to pick out our wedding bands and was warmly greater by Ms. Blevins. She was extremely nice, extremely patient, and made sure we got exactly what we wanted at a great deal. She was extremely kind so much that we offered to take her to dinner for her amazing help. Such an incredible professional atmosphere. The rest of the staff was friendly to. I highly suggest going there and asking to speak to Ms.Blevins for she will make you feel right home. They were so friendly that we stay after our purchase for about a half hour just to have conversation. IF YOU WANT PROFESSIONAL AND KIND HELP LOOK NO MORE, MS.BLEVINS IS WHO YOUR LOOKING FOR.", "pics": null, "resp": null, "gmap_id": "0x8889199120f82e59:0xc026b95d1d5c4937"}
{"user_id": "114774125093596944695", "name": "Stephen Hess", "time": 1528249230657, "rating": 5.0, "text": "Always such helpful staff. Really pretty pricey but you pay for what you get.", "pics": null, "resp": null, "gmap_id": "0x8889199120f82e59:0xc026b95d1d5c4937"}
{"user_id": "102074651691238712258", "name": "Alexis Diamonds", "time": 1470958028476, "rating": 5.0, "text": "Staffed with associates happy to serve you. You will enjoy your jewelry shopping experience", "pics": null, "resp": null, "gmap_id": "0x8889199120f82e59:0xc026b95d1d5c4937"}
{"user_id": "115458150042366938166", "name": "Cedric M", "time": 1526951115479, "rating": 5.0, "text": "The salesperson was very nice and helpful.", "pics": null, "resp": null, "gmap_id": "0x8889199120f82e59:0xc026b95d1d5c4937"}
{"user_id": "112748555372814041209", "name": "Miguel Quiroz", "time": 1527043345409, "rating": 5.0, "text": "Best place to buy jewelry.", "pics": null, "resp": null, "gmap_id": "0x8889199120f82e59:0xc026b95d1d5c4937"}
{"user_id": "114818609260805859135", "name": "Jasper Hicks", "time": 1543024512004, "rating": 5.0, "text": "Excellent pricing and exceptional saleslady", "pics": null, "resp": null, "gmap_id": "0x8889199120f82e59:0xc026b95d1d5c4937"}
{"user_id": "108912388393532966045", "name": "Kimary Dickerson", "time": 1526341647829, "rating": 2.0, "text": "Manager was rude and pushy. She even took a personal phone call while consulting with me...", "pics": null, "resp": null, "gmap_id": "0x8889199120f82e59:0xc026b95d1d5c4937"}
{"user_id": "106544960957691109914", "name": "Shelby Sam", "time": 1434411709929, "rating": 5.0, "text": "This store has really turned around the past few months! Ask for Chris", "pics": null, "resp": null, "gmap_id": "0x8889199120f82e59:0xc026b95d1d5c4937"}
{"user_id": "105354180318292925851", "name": "Lyndsey Batista", "time": 1626479557110, "rating": 1.0, "text": "I was very disappointed in the service I received from the Kay’s associates. I was there a little while ago to pick out a promise ring my boyfriend was going to purchase for me. When I entered the store I was not greeted what so ever. I stood in that store for over 15 minutes and no one had said a word to me. I can understand being busy with other customers or not realizing someone had walked in but 2 separate employees had walked past me and didn’t even acknowledge my presence. By the time an associate did assist me I was very bothered but they didn’t seem to want to assist someone that was “just looking”. The person seemed highly irritated once I told him I was just looking for a promise ring my boyfriend is buying for me. 10/10 do not recommend this store and will only be shopping at Zales or Jared’s form now on.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0x2dea3497b2214921"}
{"user_id": "113940602914333287278", "name": "Marchello Perkins", "time": 1618357695639, "rating": 1.0, "text": "Was in Kay's for 30 minutes and the lady refused to acknowledge my presence, over there playing on phone and running customers off....smh...good help hard to find. Wish I would've gotten her name, she's white and wears glasses in the Hoover's location. Just no assistance", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0x2dea3497b2214921"}
{"user_id": "104424188318253818271", "name": "Hectorsii Garcia", "time": 1624212256082, "rating": 5.0, "text": "Amazing! The man that attended us today was very nice with us and payed full attention to what we wanted and helped us a lot. He was also very kind. Thank you again sir.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0x2dea3497b2214921"}
{"user_id": "110867222963464815577", "name": "Doressa Glover", "time": 1624577552206, "rating": 5.0, "text": "Great customer service the beautiful African American female was awesome. Sorry I forgot her name but she ROCKS.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0x2dea3497b2214921"}
{"user_id": "115275518925891619673", "name": "Brigit Thomas", "time": 1620222481664, "rating": 5.0, "text": "Love this store and the service is exceptional. Also, I love my ring!", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0x2dea3497b2214921"}
{"user_id": "109541859240057606603", "name": "Jonathan Saliba", "time": 1574732786192, "rating": 5.0, "text": "The manager, Christie, is one of the most nicest and most professional people that you will ever meet. My wife lost and earning and I was trying to replace it. Christie went above and beyond!!! She called I am not sure where to see if they still had this type of earring and of course after 10 years from the original purchase they did not. She then called the people that make the jewelry to see if they could make the pair for me again. They could but it was at a much higher price than the original purchase. I didn’t go that route. I came back today months after talking with her about some other pieces and she helped me again. I am not sure about the other comments about the manager are all about but Christie is the reason I will continue to shop at this store. She deserves a raise and some kind of recognition for what she does everyday. I literally could have walked out and gone to one of the many other jewelers stores in the mall and probably gotten something very similar but because of her I did not. Thank you for the great customer experience.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0x2dea3497b2214921"}
{"user_id": "115131767057135983229", "name": "amy mims", "time": 1599884303403, "rating": 5.0, "text": "Christy the store manager was wonderful! Polite, professional and just precious! The bears that help St. Jude's just made me love this Kay's location that much more!!!!!", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0x2dea3497b2214921"}
{"user_id": "100931064821901674444", "name": "BOBBY EDWARDS", "time": 1607120543539, "rating": 1.0, "text": "wife purchased a band for our anniversary and 1 year later a diamond fell out took it back to store had it repaired. Three years later another diamond has fallen out this time they wouldn't repair it so I will take it to another jeweler that is not kay and have it repaired .\nDO NOT BUY ANY JEWELRY FROM THEM THEY'RE PRICES ARE TO HIGH FOR A CHEAP  PRODUCT .", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0x2dea3497b2214921"}
{"user_id": "114505476588022995834", "name": "jaime hudson", "time": 1536197904803, "rating": 5.0, "text": "My husband and I had Christie helping us and she honestly made our whole wedding experience 10x better helping us with our rings. She truly cared and was interested in our big day and wanted us to have the best experience possible. She was wonderful & so helpful, loved her very much!", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0x2dea3497b2214921"}
{"user_id": "109804731701691451248", "name": "Christie Thomas", "time": 1549505058205, "rating": 5.0, "text": "I just love the location and Ms. Christie and I bonded as if we were best friends. ( Same name and spelling.) The service was great from her and Krissa. I will be going back sooner than later.  😍😍😍 Thanks ladies for great customer service.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0x2dea3497b2214921"}
{"user_id": "101499840101730280667", "name": "Jeanetta Conner", "time": 1572746221696, "rating": 1.0, "text": "I have been a Kays customer for at least 15 years. The service is normally good but that has changed with the store manager now. She is very condescending and not sympathetic to customer issues. When you have defective jewelry that you're selling as high quality, that's a problem. If I bring something back to you once because of a defect, you would think you would make sure that never happens again. So if I have to bring it back a 2nd then 3rd time, now you're wasting not only my money but my time. For the first time in over 15 years I did not feel like a valued customer at all. I will never spend another penny in this Kay's again.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0x2dea3497b2214921"}
{"user_id": "101578746658338450416", "name": "Lee042690", "time": 1532454070461, "rating": 5.0, "text": "We bought my finance's engagement ring and wedding band, also my wedding band. Love the people that work there. They're very helpful and nice. Always friendly when we take our rings to get cleaned.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0x2dea3497b2214921"}
{"user_id": "118435284352297508975", "name": "Bear Blackmon", "time": 1573163447481, "rating": 5.0, "text": "Again, Christine and Andrea did an exceptional job helping me order the perfect diamond earrings for my daughter's 18th birthday.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0x2dea3497b2214921"}
{"user_id": "106717325011033090110", "name": "Krysta Pearson", "time": 1532453552450, "rating": 5.0, "text": "I have a Kay's near me but because of the great experiences I've had and continue to have at this location I drive an hour to this location even if it is just for my free inspections. Perfect experience every time.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0x2dea3497b2214921"}
{"user_id": "104961784349868067870", "name": "Dawn Productions", "time": 1582870898115, "rating": 5.0, "text": "The ladies here are always so nice.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0x2dea3497b2214921"}
{"user_id": "114699995720814338617", "name": "Kawanna Bryant", "time": 1538409311255, "rating": 5.0, "text": "The sales associate, April, was very respectful and helpful. She was attentive from the time I walked in to the time I walked out. I will definitely come here for all my jewelry needs from now on.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0x2dea3497b2214921"}
{"user_id": "102182662530781472919", "name": "Colter C", "time": 1526164607961, "rating": 5.0, "text": "I purchased a  Mother's Day present today at Kay Jewelers, and I had a pleasant and productive shopping experience.  Peggy was friendly and helpful.  Thank you!", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0x2dea3497b2214921"}
{"user_id": "102644853789258721775", "name": "Hannah Tell", "time": 1561138676350, "rating": 1.0, "text": "Go anywhere but here. Kays in general has some unethical sales practices. They WILL lie to you.\n\nReturning the engagement ring we bought today because they told my anxiously excited BF the ring he picked was in my size (5) only to tell him after paying it was a 6 (another associate told me no ring in the store has EVER been in a 5) She just lied because she knew how badly he wanted to give me a ring now.\n\nI plan to bring it back and tell her another kay store has it in my size just so I can hear her tell me \"we never carry 5's\" after that bold face lie she told my BF.\n\nF*** Kays....they also told me id get an additional 10% off for getting a credit card, so I did even though we wanted to pay cash, only to be told right after getting approved the discount couldn't be applied. Now I'm stuck with their credit card. Seriously, just go ANYWHERE but kays. I have friends who have worked there and this is STANDARD.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0x2dea3497b2214921"}
{"user_id": "113356015648991867483", "name": "Ashely Harrell", "time": 1558913519242, "rating": 5.0, "text": "I truly want to give the ladies at the Kay Jewelers in the Riverchase Galleria Mall the biggest compliment I can. April and Christie went above and beyond with their customer service to help me with my issue and ensure all my needs were met. I had to get my wedding ring cleaned and repaired as a diamond had fell out. I sent the pieces of jewelry off mid-March and was expecting them back around early-April. My jewelry ticket consisted of one diamond in my band to be replaced, the three separate pieces sautered together, and the final ring cleaned. Upon mid-April, I did not hear from the store on the status of my ring so my husband and I went to the store in person to get an update. Ms. April informed me that the ring was being held because they wanted to make sure that I was okay with how the ring would potentially come out and discuss any pitfalls. I was informed there would be a potential gap in the ring once the pieces were sautered together. Upon me giving the okay, the ring was supposedly sent to be fixed and I continued to wait patiently. During that time, Ms. April helped me find two other LeVian rings that were on sale and that were absolutely gorgeous and suitable to wear at my job. I decided that once my other rings came back, I would get the two new rings resized for my finger. Coming into the first week of May, I discovered my ring was still not back and at this point I was getting very flustered. Ms. Christie spoke with me and ensured that she would get my ring repaired and back to me quickly and had apologized for the long wait. She personally made sure to let the jeweler know to expedite the process. When my ring finally did arrive back, the middle stone of the main ring was still cloudy, there was black residue on the ring bands, the ring was resized even smaller than my finger, and the same diamond was missing when it was presented to me. At this point I was livid, upset, and refused to do any more business with Kay Jewelers. Despite my ordeal, Ms. April and Ms. Christie showed me the greatest empathy for my situation. I was given a comforting and sorrowful hug from Ms. April. Ms. Christie personally took my ring to the jeweler and stayed with it until it was complete so that I would have the ring that same day and not have to wait any longer then I already had. In addition, she ensured that the other two rings that I recently purchased was resized that say day and back on my hand. These ladies truly exemplify the highest standard for customer service. My frustration and anger was not toward these two ladies but toward the poor service I received from the people repairing my ring. Now I do not take my ring off. Each ring or necklace I get from Kay’s is not just a piece of jewelry, but it is a story of my life. With these ladies understanding that, they will continue to earn my business from here on out.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0x2dea3497b2214921"}
{"user_id": "101833285152213238603", "name": "Merv Plank", "time": 1559326913963, "rating": 5.0, "text": "They always are so helpful in finding the right Jewelry for the occasion. Core staff has been there a long time and know me", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0x2dea3497b2214921"}
{"user_id": "107781432309581618553", "name": "Aki Shin", "time": 1517115537411, "rating": 5.0, "text": "Professional service! And very nice, though I chosen another store at last, they're still super.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0x2dea3497b2214921"}
{"user_id": "104768334625240570694", "name": "Steph Borders-Savage", "time": 1580418708975, "rating": 5.0, "text": "Awesome customer service and quality of jewelry", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0x2dea3497b2214921"}
{"user_id": "103041646433691960768", "name": "Natassia Gardner", "time": 1456334096079, "rating": 1.0, "text": "Been with them for years on years and I will never deal with them again. Once I get my jewelry back, or should I say if... I will not be returning. Good job screwing up a simple job. Wish I would have picked a different company to begin with!", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0x2dea3497b2214921"}
{"user_id": "112200681104335372413", "name": "p fritts", "time": 1516505350320, "rating": 4.0, "text": "Did not have the same experience that others here said they did. April helped me and was very knowledgeable about the jewelry and very helpful with advice on what to get my wife since I am a clueless guy. And I'm my price range.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0x2dea3497b2214921"}
{"user_id": "107834661320713569414", "name": "Morning Jones", "time": 1497976672646, "rating": 1.0, "text": "My fiancé proposed to me with a beautiful ring from this location Kay's. They told him that he earned $1300 dollars of rewards for his purchase that he could use towards our bands before they expire in a few months. When we returned to look at bands, the sales associate proceeded to tell us that it isn't a $1300 worth of rewards, it's 1300 rewards points. She also told us you have to spend an outrageous amount to even redeem any of your \"$1300\" reward points. That same day I had my ring and band sent off to be resized. The sales lady told me that they would be ready on the twentieth, which was nearly two weeks. I showed up today to pick up my rings, and a very rude pretentious older sales man informed me that neither of my rings were ready to pick up and that I would have to come back another time. I was pretty pissed to say the least. And I am still waiting for a call about picking up my rings. I would not recommend this store at all.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0x2dea3497b2214921"}
{"user_id": "115062728764963976998", "name": "Marquita Baynes", "time": 1452813820239, "rating": 1.0, "text": "The sales associate are rude as hell!!!!! I've had nothing but bad experiences since I had my ring sent off for repair. I wouldn't  recommend anyone to buy from kays. #onepissedcustomer", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0x2dea3497b2214921"}
{"user_id": "113673228262085036003", "name": "Neka W", "time": 1385274620693, "rating": 1.0, "text": "Terrible! I came into this Kay to get a necklace repaired, and I was told that it had to be sent off for repair. I was told that my necklace would be back within a week's time, and I would receive a phone call when it was ready. It has been a whole MONTH, and I have yet to receive a call. I have been back on 2 separate occasions to inquire about the whereabouts of my jewelry, and those have both been frustrating experiences because no one had any answers for me. Avoid this location if possible!!", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0x2dea3497b2214921"}
{"user_id": "105002110548203955409", "name": "Keshia Hill", "time": 1521839890328, "rating": 5.0, "text": "April really helped me find the right gifts for several family members throughout the year. She is my go to sales woman.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0x2dea3497b2214921"}
{"user_id": "101393172762099893253", "name": "Marilyn Murders", "time": 1431101803486, "rating": 1.0, "text": "They'll hire you as full time, take your sales, and after the holidays they will offer you 13 hours a week. Not worth the hassle and they pay blows.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0x2dea3497b2214921"}
{"user_id": "116428284113442259493", "name": "James Rogers", "time": 1530058104652, "rating": 4.0, "text": "Found what I was looking for. In and out", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0x2dea3497b2214921"}
{"user_id": "103838442183096646745", "name": "Michael Pratt", "time": 1546305317545, "rating": 5.0, "text": "Awesome sauce", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0x2dea3497b2214921"}
{"user_id": "108151906225959804950", "name": "Jason", "time": 1624815370323, "rating": 1.0, "text": "The Zales in Foley Alabama has employees that will mislead you. The told my wife a size 7 ring with wrap around stones could be sized to a 5. Then stated it would be a 3 to 4 week wait to get it sized, then recommended another jeweler to size it in 24 hours. We bought the ring ( over $1000) and went to the other jeweler who said there was no way he could sized it and they knew. When we took it back ( 1 hour later) they started acting like they could only refund $200, they did end up refunding the whole amount. This sale was a blatant lie from the beginning.  An attempt to make a sale at all costs and not refund your money. Full of lies.", "pics": null, "resp": null, "gmap_id": "0x889a0e3378b63149:0x38a08331cfe85986"}
{"user_id": "110511108367107737234", "name": "Kathrine Steinbach", "time": 1620240088295, "rating": 1.0, "text": "I’ve always heard bad things about signet owned jewelry stores and big brand jewelry stores but I never experienced it first hand until I visited this store.\n\nI received a lovely white sapphire ring as a gift which was purchased online. About a month after receiving the ring, it became apparent to me that the main stone was loose (it was not only wiggly and I could feel it, but it was actually rattling audibly). From being loose there was dust/dirt trapped between the stone and the basket of the stone. Keep in mind I had not been wearing it daily so it was surprising it came loose after such a short period of time.\n\nI brought the ring to the foley Zales to have the sterling silver prongs tightened and the basket cleaned. The rep there said since it wasn’t purchased with warranty I had to pay out of pocket for both the cleaning and repair. It would cost $90.00. (Almost as much as the gift itself, but I couldn’t do anything about the fact it hadnt been purchased without a warranty and I wasn’t going to call up the person who gave it to because that would be rude).\n\nWhen I picked up the ring I was ready to pay for services done, except the moment my hands touched it I knew it was still loose. I showed the representatives behind the counter and they swore up and down to me that it wasn’t loose and it was my imagination. They wiggled it and one even got her pen ink on it trying to “disprove” me.\n\nThey said they could send it back free of charge so I said ok. But I got a bad feeling and since it had become a sentimental gift I felt like I no longer trusted that store to handle it since I felt like they were lying to me about it not being loose. I asked them for it back and they said yes but they would have to charge me the $90.00. I didn’t want to have a confrontation with them so I paid and figured maybe I should just get a second opinion because it very well could be my imagination.\n\nShe swipes my card and is packing it up and I said “I hear it rattling, tell me you can’t hear that! Call me crazy, It can’t be my imagination!”\n\nShe held it up to her ear and to my surprise said “yes! I do hear it rattling. You’re not crazy”.\n\nIm dumbfounded!! Before I paid, she said it wasn’t loose, lied to my face, then the moment I swiped my card, she acknowledged it was loose!!! I am appalled. I’m just going to dispute the transaction with my bank now because there is no way I trust the people working there. And I’m going to advise the person who purchased it for me to do the same. I won’t be making any purchases from jewelry stores like this again. I learned the hard way, at least this time it was only $90 instead of $900", "pics": null, "resp": null, "gmap_id": "0x889a0e3378b63149:0x38a08331cfe85986"}
{"user_id": "104986608363801725007", "name": "King Goldiloks", "time": 1619992284922, "rating": 5.0, "text": "Had a great experience very friendly staff and great customer service", "pics": null, "resp": null, "gmap_id": "0x889a0e3378b63149:0x38a08331cfe85986"}
{"user_id": "116651715813493614999", "name": "Curt Brewer", "time": 1616286202853, "rating": 5.0, "text": "Purchased an engagement ring here. The staff is always friendly and professional.", "pics": null, "resp": null, "gmap_id": "0x889a0e3378b63149:0x38a08331cfe85986"}
{"user_id": "108086889687988157879", "name": "Zeth Willard", "time": 1610384679326, "rating": 1.0, "text": "The staff were very unprofessional and rude. Don't waste your time, go to Kay's right next door.", "pics": null, "resp": null, "gmap_id": "0x889a0e3378b63149:0x38a08331cfe85986"}
{"user_id": "104809610838046849396", "name": "Diana Irrgang", "time": 1601329850555, "rating": 5.0, "text": "had to have my ring inspected. in Out quick and professionally.", "pics": null, "resp": null, "gmap_id": "0x889a0e3378b63149:0x38a08331cfe85986"}
{"user_id": "106936834163959129072", "name": "Meghan Hadley", "time": 1581036581049, "rating": 5.0, "text": "My engagement and wedding band came from Zales and it was the best shopping experience ever! I would recommend this store to anyone shopping for jewelry for any occasion.", "pics": null, "resp": null, "gmap_id": "0x889a0e3378b63149:0x38a08331cfe85986"}
{"user_id": "113990414060397944254", "name": "Courtney Mosley", "time": 1549163209309, "rating": 5.0, "text": "Everyone was so nice and friendly, very pleased. My fiance were in there to pick out or wedding bands, and we left there so satisfied. Thanks to Robin!", "pics": null, "resp": null, "gmap_id": "0x889a0e3378b63149:0x38a08331cfe85986"}
{"user_id": "110117695268238503574", "name": "Art Ross", "time": 1599171784962, "rating": 2.0, "text": "They say their open and they aren't today.", "pics": null, "resp": null, "gmap_id": "0x889a0e3378b63149:0x38a08331cfe85986"}
{"user_id": "109541505282891714383", "name": "Octavia Bruhn", "time": 1530568413171, "rating": 5.0, "text": "Wonderful staff! Sheila and Amanda worked with us and found exactly what we wanted. Thank you for a great experience!", "pics": null, "resp": null, "gmap_id": "0x889a0e3378b63149:0x38a08331cfe85986"}
{"user_id": "107994520461299534215", "name": "Jackie Clark", "time": 1548539937485, "rating": 5.0, "text": "Customer service is great. So patient and helpful. Especially, Mrs. Sheila!", "pics": null, "resp": null, "gmap_id": "0x889a0e3378b63149:0x38a08331cfe85986"}
{"user_id": "110650080050399076122", "name": "April Kaczmarczyk", "time": 1534868441237, "rating": 5.0, "text": "Manager Sheila is amazing..thanks for all your help", "pics": null, "resp": null, "gmap_id": "0x889a0e3378b63149:0x38a08331cfe85986"}
{"user_id": "117098971899062527897", "name": "Roy “R” C", "time": 1537550926881, "rating": 5.0, "text": "Shelia is AMAZING!\nShe will make it happen!!!!\nGreat Personality and Quick to\nhelp !!!", "pics": null, "resp": null, "gmap_id": "0x889a0e3378b63149:0x38a08331cfe85986"}
{"user_id": "107343034234252403837", "name": "Betsy Nolan", "time": 1532722053953, "rating": 5.0, "text": "Great service! Great selection!", "pics": null, "resp": null, "gmap_id": "0x889a0e3378b63149:0x38a08331cfe85986"}
{"user_id": "113232994796634335046", "name": "Bill Scott", "time": 1527097863000, "rating": 5.0, "text": "Had to have a watch band adjusted.  Great service staff very helpful and friendly", "pics": null, "resp": null, "gmap_id": "0x889a0e3378b63149:0x38a08331cfe85986"}
{"user_id": "104847651786763092529", "name": "Patricia Mattingly", "time": 1493941595033, "rating": 5.0, "text": "Always friendly and ready to help", "pics": null, "resp": null, "gmap_id": "0x889a0e3378b63149:0x38a08331cfe85986"}
{"user_id": "110299119165988211281", "name": "James Hamilton", "time": 1615230225363, "rating": 5.0, "text": "They listened to what I was looking for and they gave a good amount of ideas an suggestions.", "pics": null, "resp": null, "gmap_id": "0x889a68210bdbea6d:0xd5e4dcdfa346b928"}
{"user_id": "112381832808516894363", "name": "Cameron Johnson", "time": 1598355885027, "rating": 1.0, "text": "\"First things first we have to wear a mask\"  i was in about a week ago. The lady tried multiple times to make me wear a muzzle so I went to zales at the mall in mobile. I gave them 8 grand, They have a awesome staff and a better selection. Highly recommend zales.", "pics": null, "resp": null, "gmap_id": "0x889a68210bdbea6d:0xd5e4dcdfa346b928"}
{"user_id": "114277101905741850188", "name": "Joshua Morrison", "time": 1611525473371, "rating": 5.0, "text": "Katie is the awesome my wife’s necklace would have never been fixed if she hadn’t taken the time to help me. Thank you!", "pics": null, "resp": null, "gmap_id": "0x889a68210bdbea6d:0xd5e4dcdfa346b928"}
{"user_id": "103386773982319411731", "name": "MBG GLOBAL", "time": 1620601638423, "rating": 5.0, "text": "Tator she's awesome", "pics": null, "resp": null, "gmap_id": "0x889a68210bdbea6d:0xd5e4dcdfa346b928"}
{"user_id": "117499613673149353108", "name": "Brie Cook Sanders", "time": 1594922232156, "rating": 1.0, "text": "Katrina (Store Manager) The Worst Customer service ever! She's very argumentative, very unprofessional, She hung up in our face twice, said her manager would stand behind her 100 percent. We asked to speak with her district manager she told us she could not do that and continue to argue with us! This entire experience from the store and corporate has been the worst ever! This Kays has not been the same since they moved from Spanish Fort and Renee' was moved to the Pace Store! Sadly our jewelry was already paid for and shipped to that store for my mother in law! Now were having a hard time getting it order. BAD MANAGEMENT!!!! We will be contacting Mr.Brown", "pics": null, "resp": null, "gmap_id": "0x889a68210bdbea6d:0xd5e4dcdfa346b928"}
{"user_id": "115086784780391551176", "name": "Shelley Moore", "time": 1571422291074, "rating": 5.0, "text": "We love the ladies at the Daphne location. They are always so helpful and take great care of our family.", "pics": null, "resp": null, "gmap_id": "0x889a68210bdbea6d:0xd5e4dcdfa346b928"}
{"user_id": "117547904296396462826", "name": "Mandey Shiver", "time": 1547595942875, "rating": 5.0, "text": "The engagement ring that I had now had for five years kept loosing diamonds every couple of months.  I was so frustrated with this happening. Luckily, every time I went into Kay’s to get it sent off I dealt with the same sweet girl, Elizabeth.  Elizabeth was always very understanding and apologetic.  After about the fourth time of loosing a diamond Elizabeth told me she would talk to her manager to see if they could get me a new ring or just pick out a completely different one.  I sent it off that time and believe it or not, four months later a diamond was missing again. I went back up to Kay’s and luckily Elizabeth was there and I didn’t even have to explain to her what happened, she remembered every detail we had talked about.  I ended up picking out a simple solitaire ring. I hated having to change the ring design but luckily because of Elizabeth’s AMAZING customer service and patience the process was a breeze! Every Kay store needs an Elizabeth in their store!", "pics": null, "resp": null, "gmap_id": "0x889a68210bdbea6d:0xd5e4dcdfa346b928"}
{"user_id": "111051006998732600872", "name": "James Jones", "time": 1547508430442, "rating": 5.0, "text": "Overall experience @kay jewelry jubilee square Daphane,Al. Wonderful the ladies are amazing great personalities, she insisted to wrap my purchase as if it was Christmas all over. My visit was tremendous I will most definitely be doing more business. Thanks ladies Catrina and stuff...!", "pics": null, "resp": null, "gmap_id": "0x889a68210bdbea6d:0xd5e4dcdfa346b928"}
{"user_id": "118094652770194063782", "name": "Jessica Ascott", "time": 1540154176831, "rating": 5.0, "text": "Joann and Katrina were such a great help with getting my engagement ring cleaned and answering any questions we had about other wedding ring purchases! My fiance and I always have great service when coming here and the staff is always ready to help out!", "pics": null, "resp": null, "gmap_id": "0x889a68210bdbea6d:0xd5e4dcdfa346b928"}
{"user_id": "109250779983167842814", "name": "John Tesch", "time": 1605473584190, "rating": 5.0, "text": "Very helpful", "pics": null, "resp": null, "gmap_id": "0x889a68210bdbea6d:0xd5e4dcdfa346b928"}
{"user_id": "104080189991714298661", "name": "James Hay", "time": 1540057826937, "rating": 5.0, "text": "Are always energetic and positive when I walk in.  They remember each of my family member’s names and ask how they are doing.  Very friendly and personable.", "pics": null, "resp": null, "gmap_id": "0x889a68210bdbea6d:0xd5e4dcdfa346b928"}
{"user_id": "103684086510645239459", "name": "Edward McCall", "time": 1549323576545, "rating": 5.0, "text": "Love how friendly the sales associate are made me feel like I could get anything in the store....", "pics": null, "resp": null, "gmap_id": "0x889a68210bdbea6d:0xd5e4dcdfa346b928"}
{"user_id": "102598801207801640388", "name": "David Gatlin", "time": 1539623098472, "rating": 5.0, "text": "Great experience! The staff was very friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x889a68210bdbea6d:0xd5e4dcdfa346b928"}
{"user_id": "116332816461256291545", "name": "Stacey Lavender", "time": 1545841716862, "rating": 1.0, "text": "I called today to order 2 links for a watch that was not purchased from them but a brand they carry. I was told that yes they CAN order links had I purchased the watch from them, but since I did not purchase the watch from them, I had to order them directly from the manufacturer. To be told they would not help me because the watch was not bought from them(which I did not purchase the watch, it was a gift for my dad) put a nail in the coffin. I have spent a lot of money in there over the years but they will never receive another penny of my money. SUPER POOR BUSINESS PRACTICES!!!!!!!", "pics": null, "resp": null, "gmap_id": "0x889a68210bdbea6d:0xd5e4dcdfa346b928"}
{"user_id": "105825420419988270333", "name": "Amanda Carrier", "time": 1541284884215, "rating": 5.0, "text": "The ladies that work are super sweet and incredibly helpful ❤", "pics": null, "resp": null, "gmap_id": "0x889a68210bdbea6d:0xd5e4dcdfa346b928"}
{"user_id": "115308477395866682016", "name": "Cara Rigby", "time": 1512306948658, "rating": 1.0, "text": "HORRIBLE MANAGER NAMED MICHELLE!!!\n\nWorst Customer service ive ever experienced anywhere! Went to Kays about a week & a half ago to look and purchase an engagement ring with my fiance. Starting looking at rings in our budget and was only shown 1 ring which I loved (& the girl who showed us the ring got kinda in trouble for showing it to us) until they said they were having a diamond show & started showing me rings from those cases, apparently they only have a diamond show every so often and I was shown about 3 rings or so from those cases & ended up picking one of the 3 after being felt like those were the only ones in our budget and  I was pressured into it. We were able to get the ring sized that day & take it home.\n\nSkip to week or so later, I decided to just browse online at rings that were in our budget & that said available in store at my local store. Came across several beautiful rings that I was NEVER shown to begin with so I decided to call and speak with the manager who helped us & told her about how I had seen a few online that said they were available in store & in our budget, so I go to the store to see them in person to make sure I didn't pick the wrong ring.\nGot there & the manager who from the first visit was super helpful and nice, didn't speak to me once when I entered the store. I showed the girl who was helping me a few rings I seen online that said they were in store & the first ring she said \" oh we just sold that ring\" the 2nd and 3rd ring I showed her she Said \" I don't think we have it\" & I was like \"why would it say it was in store if It wasnt?\" She couldn't give me an answer. She did everything in her power to convince me to keep the ring I had but that pissed me off even more so I still ended up returning the ring which I know they aren't happy about, but I wasn't happy with being pretty much only shown options that benefited them. They didn't treat me the same as the first experience & u just don't do your customers that way. Regardless. I will do everything to make sure everyone is aware of how crooked this place is.\n\nAlso, after returning the ring (which was leased throigh progressive) we made an account online to see how the process of the refund was going, come to find out our total was double the price we were told it would be in store from the kay employees. The deposit we put down was suppose to be 79 dollars and would also be the amount of our monthy payment & after looking online we discovered they charged us 86 dollars for the deposit & that our payments would be 91.60 WEEKLY! We were told 79 dollars and some change monthly and then it shot up to 91.60 weekly! They never went over the contract or interest rate with us.\n\nAfter the return I asked the employee if everything on their end was done and all we were waiting on was the leasing company to do their part. Called the leasing company to find out that they were waiting on KAYS to send the invoice over to get the refund process done & taken care of.\n\nCalled Kays once again to speak with the unprofessional, rude heifer off a \"Manager\" to make sure they sent the invoice in and to try to get some answers as to why she never vocally disclosed with us while signing the lease that our total was actually double the price she told us, & she would not answer the question. All she would say was \"you made the return, what else do you need, blah blah..\" How they can get away with is beyond me, after asking her multiple times times she actually HUNG UP on us. I called bk & another girl asnwer the phone, I continued to try to get answers we as customers deserved & as I was speaking the girl started pressing buttons on the phone & then hung up on me, incredibly immature & unprofessional. I am mind blown at my experience. I made a complaint with corporate, with the better business Bureau and got intouch with the district manager with the help of another kays manager of a different location!\nKAYS IS A FREAKING JOKE, THEY LIE & NEVER FULLY DISCLOSE THE FULL TRUTH & PRICE TO THEIR CUSTOMERS IN ORDER TO MAKE THEIR SALES & COMMISSION!", "pics": null, "resp": null, "gmap_id": "0x889a68210bdbea6d:0xd5e4dcdfa346b928"}
{"user_id": "112977397783382884839", "name": "Kim Tracey ella", "time": 1507422098048, "rating": 4.0, "text": "Nice stuff good personnel willing to help you", "pics": null, "resp": null, "gmap_id": "0x889a68210bdbea6d:0xd5e4dcdfa346b928"}
{"user_id": "114545462214460445298", "name": "Colton Pennington", "time": 1514331501724, "rating": 1.0, "text": "The worst place ever! They do not know how to answer the phone. And when they do answer the phone their rude! I refuse to buy anything else from Kay's!", "pics": null, "resp": null, "gmap_id": "0x889a68210bdbea6d:0xd5e4dcdfa346b928"}
{"user_id": "116733912777691575348", "name": "Darius McCall", "time": 1552172652032, "rating": 5.0, "text": "One of the best group of jewelers I have ever dealt with!!!!!!!!!!!! Katrina was great", "pics": null, "resp": null, "gmap_id": "0x889a68210bdbea6d:0xd5e4dcdfa346b928"}
{"user_id": "117472429731450276904", "name": "Alex Nguyen", "time": 1526068498920, "rating": 2.0, "text": "Didn't like the shipping service that they provide with the  customization", "pics": null, "resp": null, "gmap_id": "0x889a68210bdbea6d:0xd5e4dcdfa346b928"}
{"user_id": "114351835951222146304", "name": "Audrey Murray", "time": 1603825729828, "rating": 5.0, "text": "Great place for the finest jewelry! The staff are ALL very polite and friendly! My husband got my engagement set from here and it is GORGEOUS!", "pics": null, "resp": null, "gmap_id": "0x888c2bd6de817a93:0x79c5ca34566adcef"}
{"user_id": "114969429984185862987", "name": "Maurice Blumberg", "time": 1553356933796, "rating": 5.0, "text": "Great place and helpful people. You must ask about Dana Augustine show, bring your stones or pick from theirs, extraordinary quality, and they will finish your piece in the same day of the show.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNA5kfKpDKOlJFqcFvYiCfLD6-rJEEL6Mw_V5Kc=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNmKall4Klq0AVU8HBuCYju1prj8LY8aGM5KoP_=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNUM0_CQnX478UocBrVYBtTdJ3CPF-am03rxUnI=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMxHL-ngx9wvIdglDFD50AZwFhdYAvzekR07y_p=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x888c2bd6de817a93:0x79c5ca34566adcef"}
{"user_id": "113567774977341837604", "name": "Kirsten Cody", "time": 1598226323718, "rating": 5.0, "text": "Very professional and nice staff. So happy I chose to shop Zales as opposed to other jewelry competitors!", "pics": null, "resp": null, "gmap_id": "0x888c2bd6de817a93:0x79c5ca34566adcef"}
{"user_id": "117766094012635723763", "name": "Shawn Cowan", "time": 1623529310625, "rating": 1.0, "text": "Not there anymore", "pics": null, "resp": null, "gmap_id": "0x888c2bd6de817a93:0x79c5ca34566adcef"}
{"user_id": "115803195823633418107", "name": "chris gulley", "time": 1559602978898, "rating": 2.0, "text": "Better customer service would be appreciated....even for people thats not dressed in suit and tie......I walked into Kay’s and the sales associate looked at me and didn’t say anything. Not even a minute later a older gentleman walked in and she said hello, how are you. It wasn’t until the short Latino lady walked out, thats when I was acknowledging, and asked how may I help you. She  assisted me with paying on my account and looking at other jewelry as well.", "pics": null, "resp": null, "gmap_id": "0x888c2bd6de817a93:0x79c5ca34566adcef"}
{"user_id": "100800411059788434454", "name": "Mac Hollie", "time": 1551016205138, "rating": 5.0, "text": "Professional and courteous. In and out fast. Great quality of merchandise.", "pics": null, "resp": null, "gmap_id": "0x888c2bd6de817a93:0x79c5ca34566adcef"}
{"user_id": "115907581146571771282", "name": "Megan Luster", "time": 1512414620671, "rating": 1.0, "text": "If I could give zero stars I would. The people I have talked with in the Eastdale mall store have been pretty nice, however corporate and their bank genesis are horrible. I have been fighting for weeks with this company. I have a contract with you, Kay Jewelers, if you can’t keep up with your end of the deal why should I? I just want my money back. Hopefully it will be solved today.", "pics": null, "resp": null, "gmap_id": "0x888c2bd6de817a93:0x79c5ca34566adcef"}
{"user_id": "107380153044660040552", "name": "Rahsaan Smith", "time": 1530048820778, "rating": 5.0, "text": "Kristopher Fuller is the absolute best salesman I've ever encountered!! Very professional and informative!!", "pics": null, "resp": null, "gmap_id": "0x888c2bd6de817a93:0x79c5ca34566adcef"}
{"user_id": "107282422492338065610", "name": "Amy Whittington", "time": 1494717893675, "rating": 1.0, "text": "Absolutely horrible customer service. It is definitely worth the drive to Prattville to not have to deal with the incompetence at this location. Please save yourself the trouble of going to this location multiple times hoping it was a bad day to just be disappointed yet again.", "pics": null, "resp": null, "gmap_id": "0x888c2bd6de817a93:0x79c5ca34566adcef"}
{"user_id": "104303720283240335798", "name": "isadoreflowers", "time": 1536704102538, "rating": 5.0, "text": "Very helpful people I love this store", "pics": null, "resp": null, "gmap_id": "0x888c2bd6de817a93:0x79c5ca34566adcef"}
{"user_id": "103346826682178201586", "name": "Donald Robinson", "time": 1489707426326, "rating": 5.0, "text": "Great people great jewelry. Be back next month", "pics": null, "resp": null, "gmap_id": "0x888c2bd6de817a93:0x79c5ca34566adcef"}
{"user_id": "105107836868374881655", "name": "Isaac Rogers", "time": 1493141893703, "rating": 1.0, "text": "Wish i could give them 0 stars cause my service wasn't even close to a 1star. Went through so much with them i can't even type it all. The employee i dealt with needs to go back to training because her goof up costed me  money and stress and the company did not want to own up to their mistake and fix it.  I will never do  business with Kay again. I should have went to Zales.", "pics": null, "resp": null, "gmap_id": "0x888c2bd6de817a93:0x79c5ca34566adcef"}
{"user_id": "112458954335599484241", "name": "Ashley Vice", "time": 1518831731607, "rating": 5.0, "text": "The staff doesn't badger you into a decision and they are very helpful and understanding about price range.", "pics": null, "resp": null, "gmap_id": "0x888c2bd6de817a93:0x79c5ca34566adcef"}
{"user_id": "108609205834082327731", "name": "Alfred Willis", "time": 1545329852553, "rating": 5.0, "text": "Great", "pics": null, "resp": null, "gmap_id": "0x888c2bd6de817a93:0x79c5ca34566adcef"}
{"user_id": "117905836529245984330", "name": "Horace Brown", "time": 1501537880086, "rating": 1.0, "text": "Horrible service never go there", "pics": null, "resp": null, "gmap_id": "0x888c2bd6de817a93:0x79c5ca34566adcef"}
{"user_id": "108262521736824548433", "name": "Treona Mccall", "time": 1482176944102, "rating": 1.0, "text": "Return a item before holidays even came and the lady said they got to send me a check to my house and it's been passed 25 days and I haven't received no check yet", "pics": null, "resp": null, "gmap_id": "0x888c2bd6de817a93:0x79c5ca34566adcef"}
{"user_id": "111517649415586098996", "name": "TaLandria Nation", "time": 1469290244276, "rating": 5.0, "text": "Ask for Chris!", "pics": null, "resp": null, "gmap_id": "0x888c2bd6de817a93:0x79c5ca34566adcef"}
{"user_id": "108974364688755947731", "name": "Julie Mathis", "time": 1623288793847, "rating": 5.0, "text": "Wonderful experience with selecting diamond wedding set and rings. Quality, sparkling diamonds, with a professional staff! Wonderful warranty for the jewelry as well.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "114522827466975670076", "name": "Meeka Acklin", "time": 1611016407009, "rating": 1.0, "text": "If I could negative a thousand I would. Someone at this store stole my bracelet I ordered online to be sent to this store. Ordered online for a Christmas gift, got tracking info & it was delivered to the store 12/15. The store gave me 3 different stories about what happened to my product, provided a different tracking number. Customer had the HARDEST time trying to get someone on the phone at the store. This was a Christmas gift. Then customer service is just as bad. Ordered 12/11/2020 & it’s 1/18/2021, I have no product or no refund. I would recommend NEVER ordering from Zales & dealing with the Zales at the Galleria. Worst store EVER.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "117001531939207047166", "name": "Martin Howell", "time": 1613070622455, "rating": 5.0, "text": "We've shopped here for years. Their service is great!\nThey are exercising safe COVID protocols.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "116322383298058604575", "name": "Buck Caradine", "time": 1615917394991, "rating": 5.0, "text": "They are all nice in this store. Quick to help you.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "115026189579229050098", "name": "Candy Laine", "time": 1616276372695, "rating": 1.0, "text": "Do not shop with Sam. She's super rude. She threw away part of a necklace that I had a warranty on because we didn't have the other tiny piece to it. I had to call the district manager in order to get it rectified. She kept interrupting us while we were talking to the assistant manager talking to us in a condescending way. Worst experience ever.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "114750641436367167326", "name": "Kristina Sims", "time": 1616807122246, "rating": 1.0, "text": "The warranty is bs bc they will replace a 2 carat diamond if lost but not the chain? AFTER we purchased lifetime! The ladies were extremely rude and acted as if they owed the mall. Will it be back!! Don’t trust those people", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "107836619375656051354", "name": "Ephraim Maynard", "time": 1597772526518, "rating": 5.0, "text": "Great Sales Staff. They are very helpful and kind. This time Sam helped me pick out a great present for my wife's birthday. Sam was wonderful and knowledgeable about everything she showed me.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "105872246386352635523", "name": "Tammy Otten", "time": 1616954138492, "rating": 2.0, "text": "Very rude, will not do warranty inspection without an appt nor on Sunday's", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "116133860129295203512", "name": "Roy ORR", "time": 1613323810310, "rating": 4.0, "text": "Customer service is Excellent", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "112194624942058213454", "name": "Rodney Burnes", "time": 1609116258044, "rating": 4.0, "text": "Very nice selection!", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "112482404454873890650", "name": "becky Hall", "time": 1574613716771, "rating": 1.0, "text": "Buyers beware!!! My fiancé bought my engagement ring from here. I came to get it sized and it came back with a diamond missing and the size was wrong. The salesperson, Sam told me everything goes to corporate so I thought it was in good hands. They sent it off again and went it returned it was a whole other ring. My beautiful ring was completely scratched up and 4 of my once flawless colorless diamonds were now visibly yellow! Turned out that Sam lied to me because it had went to a local jeweler. The managers excuse were the diamonds must of gotten burnt. There were many other excuses but this one was most shocking. Diamonds don’t burn!! We told them we wanted the original diamonds put back in and have it appraised to see if it matched our original cert card and they refused. All trust was out the window and we had no choice but to return it. They have made the whole experience a complete nightmare and have now ruined my engagement. I’ve heard horror stories of this place swapping diamonds before and clearly they’re still doing it! Do not buy from these people they commit fraud with no conscience.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "114031833231595534232", "name": "Ashley Robertson", "time": 1572191797493, "rating": 4.0, "text": "We are always greeted warmly and treated kindly. They don't try to push anything on you and are very helpful.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "100649243290597083840", "name": "ladonna crum", "time": 1572879047331, "rating": 5.0, "text": "Shazi and Jari (manager) were very accommodating and professional.  They both displayed exceptional customer service and a high level of professionalism. GREAT JOB!", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "112608597632858841542", "name": "Tameka Jamison", "time": 1576985950454, "rating": 5.0, "text": "Customer Service is awesome! Our sales associate remembered our faces, and the type of ring I desired!!!! Sam is the Best!!!", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "106410443405084419227", "name": "frank johnson", "time": 1552600589606, "rating": 5.0, "text": "Sam was perfect in every way as a sales person. I came in the store with a set amount in mind. Needless to say that didn't stay 😊. Great sales pitch, created a warm environment with a family atmosphere. I was very pleased with my purchase and would recommend any and everyone whose in the need for any type of jewelery to visit Zales in the mall and ask for Sam 😊", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "117101388242716070420", "name": "Randy Hollis", "time": 1547935533380, "rating": 5.0, "text": "Mrs Sam is a amazing person she has helped me beyond. Very nice women. She is very good at helping.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "112866901423440982534", "name": "SaTrisha Moore", "time": 1553461908204, "rating": 5.0, "text": "Sam was very nice and helpful. She is very knowledgeable. I would recommend her for any jewelry needs.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "104809287127808761411", "name": "Lawrence Darksavior", "time": 1561497228261, "rating": 5.0, "text": "I visited the store for the first time and it was a great experience from start to finish both of the sales people Erin & Mike really went above & beyond to make sure I was taken care of.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "101343292406188562810", "name": "John Doe", "time": 1565044901120, "rating": 1.0, "text": "The Good\n* nice selection of rings and jewelry\n* competitive prices with other jewelry dealers\nThe Bad\n* staff is very rude (two Indian ladies)the worst\n* very pushy and try to rush you to make a selection\n* not honest about warranty if you don't have it in writing then you don't have it at all..\n* they tried to add other services on my purchase without telling me", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "112296481244571542349", "name": "Jonathan Norman", "time": 1574615139261, "rating": 1.0, "text": "Awful experience all around. They butchered and destroyed my fiancé’s ring when she sent it off to be sized, twice. The lack of taking responsibility along with the lies and excuses the staff made up were beyond baffling. I will never set foot in this place again.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "110025223408749199395", "name": "Shane Williams", "time": 1541710650792, "rating": 5.0, "text": "Sam was awesome and very professional and made me feel comfortable and didn't make me feel pressurized to buy. She took her time and helped me find the perfect ring!", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "111942684113287130127", "name": "Jessica Ellis", "time": 1562543268395, "rating": 5.0, "text": "Shazi is wonderful!!!! She has made me want to continue to be a Zales customer. After dealing with the Trussville store 3 separate times and having no success in getting answers in getting a wedding band and a certification cardfor my engagement ring, she took 30 minutes out of her time to take care of us. She got with her manger about getting our cert card and then explained in detail why my engagement ring that was purchased in May was no longer being made as well as the band to accompany it. She then worked diligently to find a band that complimented my ring. If not for her we would’ve taken our bus was to Kay’s or Jared’s and been done but she took time out of her day to handle a simple customer service issue and made us her personal customers for life.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "109503612837383056466", "name": "Bethany", "time": 1525655254716, "rating": 1.0, "text": "Very poor experience. Clearly commission based, where no one wants to be inconvenienced to clean/inspect your ring to keep up the warranty as instructed; only to wait on those to make a sale. Waited a very long time for my turn and was treated incredibly rudely. Do not plan to ever purchase anything from them again.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "117066970670573976853", "name": "Kayla Lorence", "time": 1538329922588, "rating": 1.0, "text": "Horrible customer service from both Indian ladies. The older Indian lady had a straight up attitude. They treat customers different depending on if they are coming in to buy something new vs. getting something cleaned or replaced. I don’t know if it’s a commission thing or it’s just who they are. ( where they realize they won’t be getting any commission off of you, therefore service is bad). I honestly don’t know.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "107068714553543475677", "name": "Stephanie Donnell", "time": 1527959182348, "rating": 5.0, "text": "I went to exchange my ring, and the sales representative Shazi was amazing. She was very helpful! She took her time showing us rings and very patient.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "102028032170908328900", "name": "Jalesa Mitchell", "time": 1553453662562, "rating": 5.0, "text": "Sam was amazing , go check her out ! She did everything she could to get me the ring of my dreams !!!!", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "110044423798674805209", "name": "Naia “Shiro” Ōkami", "time": 1551042160968, "rating": 1.0, "text": "Went to look at engagement rings with my fiance and her sister. Was not acknowledged by any staff. Tried multiple times to at least get my presence acknowledged and was treated terribly. Lost a customer that was ready to buy!", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "105340777725793917147", "name": "Fred Beeson", "time": 1512338219925, "rating": 5.0, "text": "Shazi is the best ! She helped me pick out the perfect diamond. No pushy sales tactics with her. Very helpful and professional.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "117193896798799393618", "name": "S Taylor", "time": 1579125463299, "rating": 1.0, "text": "I bought a ring here, and brought it in soon after because I noticed scratches on it and needed them to clean it. When I went to go get my ring, the employee I dealt with had a poor attitude. I asked her if anything was wrong, and she didn't say anything. I won't be going back here again.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "109784644768834302542", "name": "main man", "time": 1539476422449, "rating": 5.0, "text": "Ask for Shazi or Sam both are friendly and helpful..knowledgeable about all things diamonds.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "101647037370351416538", "name": "Jordyn Gilley", "time": 1473215889591, "rating": 1.0, "text": "Do not waste your hard earned money here. My ring has broken twice in 2 months, not to mention the first time it took them 3 weeks to return it. The second time 4 weeks. And even then they won't call you to tell you it's ready. You literally have to call every day and pester them to see if it's back from repair.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "117276876861066592337", "name": "Judy Pruett", "time": 1551154451798, "rating": 5.0, "text": "If you are wanting the best Jewelry Consultant, ask for Shazi! She is extremely knowledgeable and personable  She takes her time to find out what you are looking for.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "115550437288947142185", "name": "Brittany Lamb", "time": 1547332776423, "rating": 1.0, "text": "Buyer beware!! I searched for months to find a ring that I wanted for Christmas. My husband I went to the Galleria location to get my size and we wanted to look at the one I had found. Unfortunately it was an “online only” item. The woman who got my size acted as if she was not only inconvenienced by us but as if she was better than us. So my husband ended up ordering the ring and gave it to me on Christmas Eve. When I took it out of the box and put it on I noticed one of the diamonds were missing. My husband immediately called their 1-800 customer service number and they directed us to take the ring to the nearest Zales and they would decide wether to have the ring repaired or replaced. Being Christmas Eve night the location was closed and closed the next day for Christmas. We went to the Galleria location on December 26th and when we explained the situation to an employee they went and got the manager. The manager then asked what we wanted done. I told them I wanted it fixed. Then they asked if I had the paper work for the diamond bond that came with it. I told them no that it should be fixed period considering it was a brand new ring. After about 30 minutes of talking to the manager she said she would take care of it and we wouldn’t have to use the diamond bond and we wouldn’t have to pay for anything. I even went ahead and bought the extended warranty on the metal and the sapphire. The manager said it should be ready by January 7th. When that day got here my husband called and it was not ready yet. Well my husband got a call yesterday, January 10th, that the ring was ready and that it was going to cost $110. When we got there to pick up the ring the woman that was working was the rude woman that waited on us before and the one that rang up my extended warranty. She told us it was going to be the $110. I told her we weren’t paying a dime that the manager was supposed to be taking care of it. Apparently the manager was not there and had made no notes of anything!! I got extremely frustrated and upset. Eventually, after getting verbal and irrate, another employee came over and tried to calm me down. The woman ended up giving us the ring and not charging us. None of this should have ever happened. I will never buy another thing from Zales again!!", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "116303060122787933577", "name": "Stephen Glass", "time": 1549776767353, "rating": 1.0, "text": "Terrible staff they are rude. Be careful they will charge you more and not tell you that they added stuff to your receipt.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "107138437641992362510", "name": "Juarron Jackson", "time": 1539896421665, "rating": 5.0, "text": "Ms sam andMrs Shazi are very professional and friendly I had a great experience .And I will like to come back next time with my friends", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "110905135672347968952", "name": "HayRed", "time": 1488982273632, "rating": 1.0, "text": "The sales lady seemed bordeline psychotic. My boyfriend and I wanted to look at engagement rings that I had seen online just to see what they looked like in person. We told the sales lady multiple times we were NOT buying a ring, yet she kept pestering. \"Why are you not buying a ring today? Why can't you? You can just give me your credit card you don't have to give me any money today.\" Then she says to my boyfriend, \"Is it because she's here with you?\" And then she proceeds to look at me and say, \"Can I speak with him alone please?\" Needless to say I said NO and we left. Crazy!!! Don't go to this jewelry store. My boyfriend and I both left angry.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "104553771148263250419", "name": "Da Mo", "time": 1503806663810, "rating": 1.0, "text": "Do not buy from zales, at least not this store. Made the mistake of buying from there. The lady was super pushy and she literally was forcing me to buy. Don't waste your time and money.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "104755082565591968467", "name": "HeavyChevy17", "time": 1508609758558, "rating": 1.0, "text": "I will never buy anything again from zales thanks to pushy Sam.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "102765411217762969516", "name": "E", "time": 1489102136422, "rating": 1.0, "text": "Saleslady was super pushy and would not listen to neither me nor my wife. Also do not let her check your credit, never signed anything and they opened a line of credit anyway. Then I call and she was rude and did not want to listen again. Best advice is to go to DD or somewhere else, completely unprofessional.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "101229280244953087813", "name": "Stephanie Earley", "time": 1358209884153, "rating": 3.0, "text": "Sam, the saleslady, was ULTRA pushy. I know it's a commission job, but seriously, she    tried to force a sale on me. Definitely better jewelry stores in the Galleria. Try Helzberg or Kay.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "110538070449697916415", "name": "Bridgette McBride", "time": 1517298468065, "rating": 5.0, "text": "I went there in September and I was really impressed with Shazi. She was very helpful and friendly. I really couldn't decide what I wanted. Shazi gave me her card and asked me to come back. Well I must say I traveled 4 hours to get there. I came back on the 9th of December and I stopped by. Shazi had a customer but she noticed that I was waiting for her. Very good customer service. After she got through she helped me and I promised I love my rings. Again,I really couldn't decide what I wanted but she helped me all the way. Once I finished she thanked me and actually came from behind the counter and gave me a hug. I promise you can't find customer service like that all the time. Shazi u keep up the good work and I assure you that it will take u far in life. Thanks again Shazi☆☆☆☆☆", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "100237320718869814117", "name": "B Little", "time": 1526705815564, "rating": 3.0, "text": "wouldn't shop here,they are not serious enough with buyers,and try to push different merchandise other than what you want.I wanted white gold,they pushed yellow gold,but a selection of white gold mens necklaces available.Figgaros,cubans,so forth and so on....", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "102583886490240118197", "name": "Kenyun Moore", "time": 1553736813097, "rating": 5.0, "text": "I incourage you to go spend money some and to visit with Sales associate (Sam)", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "107781432309581618553", "name": "Aki Shin", "time": 1517114901281, "rating": 1.0, "text": "Very bad experience. The customer services look very evil, when I got into the store, they looked at me unfriendly. And when I left, they talked and laughed, very rude.", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "105153463822445382139", "name": "Mrs Patrick", "time": 1471889313879, "rating": 1.0, "text": "No words, do not buy from zales", "pics": null, "resp": null, "gmap_id": "0x8889221402e1fc1d:0xdf5089bd7c120266"}
{"user_id": "109895773782250805352", "name": "Christina Wilson", "time": 1618686746627, "rating": 2.0, "text": "My friend and I literally sat, watched and actually heard them talking bad about me after I purchased a $3,000 ring. I bought my ring last Tuesday. They hurried it's sizing for me so it would be ready. That's ONE star. They told me it would be ready at 2pm. Wasn't. Then I was told 3pm. Wasn't. Then I was told 4pm. Wasn't. Then, at 5pm, I was told she left to pick up my ring, would be back in 15 minutes and I could go ahead and head up there. 30 minutes later I'm there. My ring isn't. An hour and 15 minutes later and she's not back with my ring. An hour and a half later, she's there with my ring. Isn't nice. Isn't happy. Isn't smiling. This is the MANAGER. She hands me my rings, doesn't ask if they fit ok, doesn't ask if I like them, doesn't ask if that would complete my purchase or if I need anything. Throws it in a box, hands it to me without saying a word and walks away! They talked bad about me because I'm already under the pressure of my wedding, getting my rings on time and I'm mad because they've told me lies all day long! Of course I'm going to be upset! I was lied to several times! What sucks for them?? I was preparing to buy a bracelet and a pair of earrings but instead, I walked out. When we got home we closed our credit account with them. TWO stars because my rings are absolutely beautiful. But, I will never go there again! She was sooo nice when she was selling me the rings but after she got her commission, she no longer cared if she upset me or not. She's the manager, yet her and her two employees sat there and talked about me while all three staring at me! So, two stars. For my beautiful rings and them helping me get my rings on time. What really sucks is I already left her a great review from when she wanted my money and sold me the rings. I'd love to speak to someone higher up, but they all seem to believe their employees, even if there are cameras. BTW, when I left, I went to Kay's and bought my earrings and bracelets from them! I was treated wonderfully there and would definitely recommend them! Not Zales.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNWVX0hMRI_s7E2oP-enDOtPQ2NaqBAsJitDpSE=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4da185689b79:0x50916a0e1ccfac2a"}
{"user_id": "103386168700092002788", "name": "Isaac Redding", "time": 1622241421154, "rating": 1.0, "text": "Came to the store and found the ring my fiance wanted, ordered it and when it came in it was a 7 instead of a 6. They told me they could resize it but I wanted to pop the question, so, I told them I'd bring it back after the proposal. I ask her and she said yes but noticed, the chocolate diamonds that were supposed to be there were regular white diamonds. So, we dropped it off and now it's been two months and they won't give us the ring back and won't refund the ring. Beware of this place, read the other reviews they are scam artists that are trying to find behind a corporate name.", "pics": null, "resp": null, "gmap_id": "0x889a4da185689b79:0x50916a0e1ccfac2a"}
{"user_id": "114944816527820852406", "name": "Charity Walker", "time": 1609443761161, "rating": 1.0, "text": "I'm so disappointed and aggravated. Sent in my engagement ring to be sized BEFORE THANKSGIVING. I called multiple times after 3 weeks because they said that's about how long it would take. I called the Monday before  Christmas and they said it was shipping still.. Since then I've called daily with no one answering my calls. Someone finally answered today and said it was still shipping but then called my fiance back and said it is here.. when i arrived at the store and tried it on its STILL too loose. Oh and the lady said its been done since 12/10. No one bothered to call us. Horrible experience and ill have to get it resized again, but I'm going to go somewhere else for that now.", "pics": null, "resp": null, "gmap_id": "0x889a4da185689b79:0x50916a0e1ccfac2a"}
{"user_id": "102712816421562858567", "name": "zoey bryant", "time": 1603816642640, "rating": 1.0, "text": "My boyfriend got me an engagement ring and planned a trip to propose to me. He let them know his plans and what date we were going out of town. The sales team promised and assured him it would be back in time for his planned trip. It was not", "pics": null, "resp": null, "gmap_id": "0x889a4da185689b79:0x50916a0e1ccfac2a"}
{"user_id": "114145222984603757682", "name": "Madeline Hawkins-Standley", "time": 1534445627989, "rating": 1.0, "text": "This is a review on Signet Jewelers, the company that owns Zales, Kay, and Jarred. This Zales location is where my husband, the man in uniform in the picture below, bought my wedding ring (#19868058) on October 2017. When first purchased from Zales, the ring had a morganite stone, which was beautiful, but I had my heart set on aquamarine. We also purchased the lifetime warranty on the ring, and later another warranty just on the aquamarine stone I picked out. To make a long story short (for character count) during our time at Zales we were lied to, given false information, struggled getting in touch with the store as well as returned calls, and were pressured to purchase an aquamarine stone at a price much higher than previously discussed. Overall, my husband and I were very displeased with the service we received at Zales. Anyway, after a painstaking process, I finally got my ring back around December-January with the new aquamarine stone. Being fed up with Zales, my husband and I decided to go to Kay to have our wedding bands made. We went the same day I got my ring back from Zales to begin the process of ordering our wedding bands through Kay. His wedding band was relatively simple and took only about a month or 2 until we were able to pick it up, however, mine had to be custom made to fit the oval of my wedding ring. I picked the french beaded design Kay had for my wedding band to be made and they put all the information into the computer system. Kay assured us the bands would be ready in time for our wedding and that they would give us a call when I was able to pick my engagement ring up and to review and approve a molding of my wedding band. About 2 months went by and we hadn't heard anything, but I needed my ring for our engagement party. I had it for about a week and was told Kay needed it back to make the wedding band. Finally at about April or May we received the call that I was able to pick up my engagement ring, but never had a molding to look at and approve. In late May, about 2 weeks before we were getting married, Kay called and said my wedding band was ready. Upon seeing my wedding band that we had waited 4-5 months for the first time, I burst out crying uncontrollably and couldn't even speak to the lady. They had made the band in the wrong design. I was told that I either had to use that band to be married with and then we could start the process all over again after our honeymoon or that I wouldn't have anything to be married with. After several discussions with corporate, we were able to get our money back in full for my wedding band. I felt so defeated... I only had my engagement ring about 2 months out of our 9 month engagement period and I had no wedding band to be married with. Luckily, we found a local, family owned store that was able to make my wedding band in 2 weeks. Lou's in fact overdid themselves and made my wedding band OVERNIGHT! I saw the molding one day and was able to pick up my wedding set the next day! They saved us. But back to my aquamarine wedding ring. On the 5th day of our cruise I lost my stone. As you can see in the pictures below, the prong completely broke off and the stone fell out. I searched the ship for 4 hours, sobbing the entire time and finally a little girl found the stone at the bottom of the pool! We took the ring back to Zales as soon as we got back to port and they soldered a new prong on in about 2 weeks or so. Not even a month later when we were in Savannah for my birthday, I was taking my wedding set off to clean it and the band completely snapped in half (picture bellow). I took my ring to a local Zales a few days later, but not until another area on the band broke, leaving my ring in 2 pieces. Since we had the complete warranty on the ring and stone and this was the second time the ring had broken I told Zales that I wanted my aquamarine stone put into a new setting. Well now I have my ring back. No new setting, just soldered in 3 separate places. Now I'm scared just to put the ring on my finger. Why are we treated like this when we've paid so much money?", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN_G9nZMWGEKaykUu4_hJqkMuPOTGvyA-tVHezQ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMkZzymrZ58H7rgSUcx4aAYMPcnQuSVKUFkoJZt=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPhIvb-S9YhwDKqyDwFWD3rOrPGXQ9TQd-v51p7=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889a4da185689b79:0x50916a0e1ccfac2a"}
{"user_id": "105755129075877896617", "name": "Nemindra Mahathalagalage", "time": 1609696111642, "rating": 1.0, "text": "I went to the Zales store in Mobile AL to buy piece of jewelry and I was there for 5 minutes nobody came to greet me.  One lady was having a personal discussion with another person and laughing.  She saw me but didn't even want to say hi.  Just want to let you know went the Kay jewelers and spent 3K.  Service is horrible!  Not recommending your store to anyone.", "pics": null, "resp": null, "gmap_id": "0x889a4da185689b79:0x50916a0e1ccfac2a"}
{"user_id": "111410093654353660033", "name": "Tyler Etheridge", "time": 1608150687235, "rating": 1.0, "text": "I would give zero if I could. I made a purchase through Zales which was shipped by UPS. The order was lost by UPS and Zales refuses to refund my money or resend the order until UPS investigates which takes 30 days. This was a Christmas gift that won't make it before the holiday!", "pics": null, "resp": null, "gmap_id": "0x889a4da185689b79:0x50916a0e1ccfac2a"}
{"user_id": "102114704777941466264", "name": "E Bee", "time": 1606330550728, "rating": 5.0, "text": "great people  working who love there job", "pics": null, "resp": null, "gmap_id": "0x889a4da185689b79:0x50916a0e1ccfac2a"}
{"user_id": "109133116751639654206", "name": "GeKayla Williams", "time": 1560030118367, "rating": 1.0, "text": "My boyfriend and I will NEVER purchase anything else from Zales. Their team is horrible and I mean horrible when it comes to communicating with each other. A necklace that was purchased for me for Christmas was brought back to the store to get repaired in April they gave us a promise date of the next week. Since then we’ve called them four different time and has received four different dates and everyone I talk to seems to have no knowledge of what’s going on and when my necklace will be repaired and sent back to the store.", "pics": null, "resp": null, "gmap_id": "0x889a4da185689b79:0x50916a0e1ccfac2a"}
{"user_id": "105199975561546051252", "name": "Jamie O'Bryant", "time": 1513836124679, "rating": 2.0, "text": "Paid for a nice wedding band there. The display one was broken,  so they had to order another one.  They told us to take the broken display ring,  and \"exchange\" it when the new one came in.  I was not willing to be responsible for a ring that was already broken that I was not planning to keep. They finally agreed that we could pay and then pick up the ring when it came in 5 days.   Over a month later,  and several calls,  they couldn't figure out where the ring was, maybe they never ordered it.   They told us on Thursday that they'd order it and they'd call us Monday.  By Wednesday we called several times,  no answer EVER at the store during business hours.  Finally got an answer,  and they hung up on me.  We drove to the store,  waited in a huge crowd while only 3 employees tried to handle at least 20 customers (days before Christmas).  The only good thing about the experience was the person we purchased from was nice and spent time with us, and the person we requested our refund from was very understanding.  When we got there,  they did have the ring,  but we just got a refund because we don't want to deal with this location ever again.  There's plenty of other jewelers in Mobile,  even if we end up spending more money. We don't want to deal with a lifetime of repairs,  cleanings, resizings, etc through this location.  They have a nice selection and good deals,  but I'd only buy for something that is a one time thing,  like a necklace,  not something that you'll need to deal with them regularly.", "pics": null, "resp": null, "gmap_id": "0x889a4da185689b79:0x50916a0e1ccfac2a"}
{"user_id": "103248012173972758149", "name": "Ashley McPherson", "time": 1559668263248, "rating": 1.0, "text": "Rude and unprofessional sent my ring off to get a diamond replaced took almost a month. Then they never called and let me know my ring was back.  And it had been back for almost a week .I wouldn't give a damn if all the diamonds fell out im not sending it back!!!", "pics": null, "resp": null, "gmap_id": "0x889a4da185689b79:0x50916a0e1ccfac2a"}
{"user_id": "108172643559551885558", "name": "Horace Williams", "time": 1578720382616, "rating": 5.0, "text": "Good customers serve", "pics": null, "resp": null, "gmap_id": "0x889a4da185689b79:0x50916a0e1ccfac2a"}
{"user_id": "104526365117785902327", "name": "Ken Miller", "time": 1485043671183, "rating": 1.0, "text": "Had to make four trips! Ordered a new wedding ring, and they couldn't find it, after they called and said it was here. All around terrible experience. Will never shop there again!", "pics": null, "resp": null, "gmap_id": "0x889a4da185689b79:0x50916a0e1ccfac2a"}
{"user_id": "117232659466433655242", "name": "Jennypher Begley", "time": 1482199187930, "rating": 5.0, "text": "I have always had EXCEPTIONAL service withe the Zales team, every state I've lived in &  every team I've had to utilize - all extremely helpful. I've been to numerous other dealers & have had VERY poor experiences; diamonds falling out, numerous returns, etc. The team at Zales has always been 100% straight forward & willing to assist, which is why, hands down, I make all my diamond purchases with them!!", "pics": null, "resp": null, "gmap_id": "0x889a4da185689b79:0x50916a0e1ccfac2a"}
{"user_id": "108634357724983004217", "name": "Jessica Reid", "time": 1487271136155, "rating": 1.0, "text": "Sent my ring off to be repaired, never got notified when the ring came back, called over 8 times in a day at various times and was unable to get anyone to even pick up the phone, once they answered they couldn't figure out if it was in or not, had to call corporate...turns out my ring has been there for over 2 weeks and they don't know what happened...yea right. Will not be using this location ever again...", "pics": null, "resp": null, "gmap_id": "0x889a4da185689b79:0x50916a0e1ccfac2a"}
{"user_id": "104626187529487089451", "name": "Nadia Washington", "time": 1550284770543, "rating": 5.0, "text": "Always helpful...everyone.", "pics": null, "resp": null, "gmap_id": "0x889a4da185689b79:0x50916a0e1ccfac2a"}
{"user_id": "108461717435881369115", "name": "Laura Peacock", "time": 1450943731476, "rating": 3.0, "text": "I know that it probably had something to do with the holiday season but it took about 10 minutes to get someone to help me and employees kept skipping me and helping other customers.", "pics": null, "resp": null, "gmap_id": "0x889a4da185689b79:0x50916a0e1ccfac2a"}
{"user_id": "101834716996712449159", "name": "Angel Waltman", "time": 1449092060038, "rating": 1.0, "text": "Long story short, I've been married 6 months and I have only had my ring a total of 6 weeks because the diamonds keep falling out. I was told 6 weeks at most and each time I has to wait 8 weeks or more for it to be repaired. Not to mention we didn't receive my husbands ring until a few days before we got married. Because it was special ordered and they either lost it or sold it to someone else and had to reorder it. Save your time, money and sanity and go somewhere else!", "pics": null, "resp": null, "gmap_id": "0x889a4da185689b79:0x50916a0e1ccfac2a"}
{"user_id": "113028482853111396270", "name": "Erica Edwards", "time": 1455902237732, "rating": 1.0, "text": "I promise, I will never ever buy anything else from Zales!!!! I purchased a\nsterling sliver ring for my mom for Christmas and thie ring has transhed. Customer service told me, ” sterling sliver tarnshes over time”. Really I got it in Dec 2015 it’s only Feb 2016… REALLY I paid too much for this fakes A** ring!!! Somebody need to stop them", "pics": null, "resp": null, "gmap_id": "0x889a4da185689b79:0x50916a0e1ccfac2a"}
{"user_id": "115791686145887402186", "name": "Courtney Johnston Clay", "time": 1449297231605, "rating": 5.0, "text": "Always helpful & have everything I need", "pics": null, "resp": null, "gmap_id": "0x889a4da185689b79:0x50916a0e1ccfac2a"}
{"user_id": "112647744628467461213", "name": "CJBuzz buzanowski", "time": 1545004319162, "rating": 5.0, "text": "Great store", "pics": null, "resp": null, "gmap_id": "0x889a4da185689b79:0x50916a0e1ccfac2a"}
{"user_id": "101644204587953882138", "name": "jennifer H", "time": 1443456323075, "rating": 1.0, "text": "Very poor Customer service. Would never recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x889a4da185689b79:0x50916a0e1ccfac2a"}
{"user_id": "117108852730455241188", "name": "Tim Haynes", "time": 1620003691939, "rating": 5.0, "text": "Thanks to everyone at Kay’s for helping me design the perfect ring!  It was an easy process thanks to the experienced, friendly, knowledgeable employees at the store. Excellent communication throughout the entire process. They helped create a one of a kind ring that nobody will ever have. If you want a one of a kind engagement ring, go to Kay Jewelers in the Oxford Mall. I will do all my business with them and I highly recommend them over the other stores in this area. Thanks again for your professionalism, your excellent communication and your outstanding customer service.", "pics": null, "resp": null, "gmap_id": "0x888bb115506a2e83:0x35e4640c52e1d30e"}
{"user_id": "106810623437061327605", "name": "Jeremy Walker", "time": 1618626038612, "rating": 5.0, "text": "Super friendly employees. Very professional! Great prices! Had a fun time shopping here. I went to a few other stores before going here and this store had the best prices and the employees helped me pick out the perfect ring! I will be back!", "pics": null, "resp": null, "gmap_id": "0x888bb115506a2e83:0x35e4640c52e1d30e"}
{"user_id": "106459118893713136748", "name": "Lori Christopher", "time": 1619884626333, "rating": 5.0, "text": "Love to shop here!  Great deals and friendly, knowledgeable associates.", "pics": null, "resp": null, "gmap_id": "0x888bb115506a2e83:0x35e4640c52e1d30e"}
{"user_id": "113907393791612575143", "name": "Trevor Stewart", "time": 1620229760713, "rating": 5.0, "text": "Best selection of jewelry in town, and very helpful staff!", "pics": null, "resp": null, "gmap_id": "0x888bb115506a2e83:0x35e4640c52e1d30e"}
{"user_id": "108882917509415295020", "name": "Melonie Tillery", "time": 1619885197101, "rating": 5.0, "text": "Friendly and knowledgeable staff. Always there to help on any accession.", "pics": null, "resp": null, "gmap_id": "0x888bb115506a2e83:0x35e4640c52e1d30e"}
{"user_id": "116536107281406438770", "name": "Carly W", "time": 1619884430699, "rating": 5.0, "text": "Best place to buy jewelry!", "pics": null, "resp": null, "gmap_id": "0x888bb115506a2e83:0x35e4640c52e1d30e"}
{"user_id": "100831891991100825275", "name": "Georgia Monroe", "time": 1591408738418, "rating": 5.0, "text": "Professional employees, best selection of jewelry in this area, lowest prices. They greet you with a smile and are so friendly. If you are looking for a piece of jewelry, try them first. You will not be disappointed!", "pics": null, "resp": null, "gmap_id": "0x888bb115506a2e83:0x35e4640c52e1d30e"}
{"user_id": "101435089024690674622", "name": "Tabitha Smith", "time": 1594238279175, "rating": 5.0, "text": "All smiles and friendliness in this store! Jeff, Josh, and Melonie have been working there for many years. They are the kindest people. If you are looking for jewelry, this is the place to shop. Super low prices and great quality jewelry!", "pics": null, "resp": null, "gmap_id": "0x888bb115506a2e83:0x35e4640c52e1d30e"}
{"user_id": "116952589325003485853", "name": "Matthew T", "time": 1597509984622, "rating": 5.0, "text": "Good variety of men/women jewelry such as watches, rings, necklaces.  Most of the core brands were represented such as Citizen, Movado, Bolivia.", "pics": null, "resp": null, "gmap_id": "0x888bb115506a2e83:0x35e4640c52e1d30e"}
{"user_id": "118444165310866372189", "name": "Fye ZeZe", "time": 1599678946914, "rating": 5.0, "text": "Grace was really helpful and mindful of what we wanted and our choice couldn't be more perfect without her, my wife is very happy! Thank you!", "pics": null, "resp": null, "gmap_id": "0x888bb115506a2e83:0x35e4640c52e1d30e"}
{"user_id": "110484302190814154194", "name": "Mattie Gray", "time": 1515992984356, "rating": 5.0, "text": "Excellent customer service! Highly recommend to anyone looking to buy a diamond without the hassle....or guilt.  They had the perfect ring to suit my (not very big) budget and got it to me just in time for the big moment.", "pics": null, "resp": null, "gmap_id": "0x888bb115506a2e83:0x35e4640c52e1d30e"}
{"user_id": "113053662277073201182", "name": "Beverly Ritchey", "time": 1535415266785, "rating": 5.0, "text": "Had the jewelry inspected an cleaned! Well worth the time and effort when it looks so good when they're done! Awesome job!", "pics": null, "resp": null, "gmap_id": "0x888bb115506a2e83:0x35e4640c52e1d30e"}
{"user_id": "103719422549390883461", "name": "Ronnie Denney", "time": 1527626628757, "rating": 4.0, "text": "Nice, the Beautiful woman was very helpful in finding the rite ring for my wife. She was not a pushy lady as trying for me to buy something I didn't like.  Great place to get your jewerl.", "pics": null, "resp": null, "gmap_id": "0x888bb115506a2e83:0x35e4640c52e1d30e"}
{"user_id": "112239479916651896328", "name": "brannon ogle", "time": 1576466942443, "rating": 2.0, "text": "Uneducated and lousy customer service. Would highly recommend Diamond Depot.", "pics": null, "resp": null, "gmap_id": "0x888bb115506a2e83:0x35e4640c52e1d30e"}
{"user_id": "103392764491427217679", "name": "Heaven Black", "time": 1530657281252, "rating": 4.0, "text": "The prices weren't bad. Quality is amazing. Customer service is lacking.", "pics": null, "resp": null, "gmap_id": "0x888bb115506a2e83:0x35e4640c52e1d30e"}
{"user_id": "102944792562418586899", "name": "President Oatmeal", "time": 1543176610614, "rating": 5.0, "text": "Great store. Great gifts for a smaller jewelry store. Awesome employees, very nice and patient.", "pics": null, "resp": null, "gmap_id": "0x888bb115506a2e83:0x35e4640c52e1d30e"}
{"user_id": "103729734249989627561", "name": "Jenniffer Whyte", "time": 1557089750740, "rating": 1.0, "text": "The customer service was not good. They called us to pick up our watch today (5/5/19), after we dropped it off in December. They charged us $214.50, and all they did was basic battery test gasket.", "pics": null, "resp": null, "gmap_id": "0x888bb115506a2e83:0x35e4640c52e1d30e"}
{"user_id": "110622631047830295565", "name": "Kelly Glass", "time": 1578516739000, "rating": 1.0, "text": "I would give a 0 if I could", "pics": null, "resp": null, "gmap_id": "0x888bb115506a2e83:0x35e4640c52e1d30e"}
{"user_id": "110583485531909757329", "name": "Joey Brown", "time": 1546640920139, "rating": 5.0, "text": "Absolute amazing shopping experience! Fast and extremely friendly customer service!!", "pics": null, "resp": null, "gmap_id": "0x888bb115506a2e83:0x35e4640c52e1d30e"}
{"user_id": "118226304983532184098", "name": "Morpheus The chosen one", "time": 1526220300452, "rating": 5.0, "text": "Great service. Had a good experience here. Mary was very professional and very helpful to me.", "pics": null, "resp": null, "gmap_id": "0x888bb115506a2e83:0x35e4640c52e1d30e"}
{"user_id": "103278626123235170726", "name": "Chris Adair", "time": 1533762972821, "rating": 5.0, "text": "Had a great buying experience..purchased a bracelet for my wife.. very well attended to.", "pics": null, "resp": null, "gmap_id": "0x888bb115506a2e83:0x35e4640c52e1d30e"}
{"user_id": "117637960014373152706", "name": "Miranda Mason", "time": 1561315730649, "rating": 5.0, "text": "Gorgeous jewelry and friendly staff.", "pics": null, "resp": null, "gmap_id": "0x888bb115506a2e83:0x35e4640c52e1d30e"}
{"user_id": "105017005211193505692", "name": "taylor chambers", "time": 1386452424276, "rating": 5.0, "text": "Had great customer service , super friendly ,and awesome music . I was impressed with competitive pricing ,the verity of jewelry,and knowledge of products. With all of the choices ,I was able to make decision and wife is very pleases with gift . Thank you Kays for all the help .\nTaylor.", "pics": null, "resp": null, "gmap_id": "0x888bb115506a2e83:0x35e4640c52e1d30e"}
{"user_id": "114407126395126968938", "name": "Rachel Ford Cleveland", "time": 1462055332184, "rating": 5.0, "text": "wonderful customer service & my diamonds are beautiful.", "pics": null, "resp": null, "gmap_id": "0x888bb115506a2e83:0x35e4640c52e1d30e"}
{"user_id": "107947785683566649477", "name": "Nona Berry", "time": 1466608544025, "rating": 4.0, "text": "Good selection of merchandise, great service assistance.", "pics": null, "resp": null, "gmap_id": "0x888bb115506a2e83:0x35e4640c52e1d30e"}
{"user_id": "116275450965468221303", "name": "Gary Shekels", "time": 1538878343418, "rating": 5.0, "text": "Good prices", "pics": null, "resp": null, "gmap_id": "0x888bb115506a2e83:0x35e4640c52e1d30e"}
{"user_id": "105223300494313216616", "name": "Alexia Rose Niles", "time": 1607793440733, "rating": 1.0, "text": "The first woman that spoke to me was extremely rude. First asking me, “Did he say you could come look at rings?” What?! I told her I wanted to look myself and figure out what style I liked in person... She then proceeds to walk away and I received no assistance. A second lady comes by and was shocked I wasn’t getting assistance. The first woman piping in with, “Oh she’s just looking. She doesn’t need in anything.” Didn’t know I wasn’t allowed to look at the rings just like any other customer? I look very young, but I should not be treated like I am less than any other person coming in.\n\nThe second woman assisting me actually set up an account and allowed me to try on and see the rings. Though I found a pretty, dainty ring I liked and she says, “You don’t want that! Those are technically promise rings.” Which I responded that I liked how dainty it was and that’s more of the style I liked. I was not a fan of being told what I should and should not like. I will be finding another jeweler that has my best interest and desires in mind.\n\nOverall not a good experience. There are many other friendly, reputable, and professional jewelers in Huntsville that I would recommend over Jared’s at Bridge Street ANY DAY. Please take your business elsewhere this holiday season and after.", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "109605379684074023247", "name": "Christy Vaughn", "time": 1619281781394, "rating": 5.0, "text": "Tasha is AMAZING!!! She is our go to girl at Jared's EVERY TIME since our first purchase in may of 2018!\nUpdate*** picked up my custom design ring today with my rare black pearl I got in Hawaii... Absolutely amazing job\n\nNext visit, since I can't do another review Tasha again helped me purchase MANY items, unfortunately I picked the same watch out for my husband he bought a couple years ago so the next day I went to return it, bought thru progressive leasing, and geta different one same price, Rachel the GM is also AMAZING! She spent 3 hours dealing with Progressive Leasing to get this all handled! Thank you all who work there, you all have the best Customer service I have ever seen and delt with!\n\nRepairs and custom designs here are ABSOLUTELY beautiful and ALWAYS on time!!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO1HON1fw43AvR-pkyjNBYWt-mseL2foq0Ft_bw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP5hUc2VKWJ6c7ps5qIlUxfMJjTAmnbwu0DVNuv=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNPyKuxWjkx8szciXnAzWPHfLXJ4JXfrYSs5tuC=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPcO_sr8pwJjHRI6IbxukNOmOLO--Glxfu0nH2_=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNGhpxRH60OLGelifulWOEW03Eac8eqN6xdPYDh=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN0JuGi9QAjdz54pcL9Byf5XzUAzNHxw69UTJPT=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP3VLqkQlm0XXkbp_i2uWUVHTG4efHckNbHDE7r=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMv6tQHsPULUbMRRy04EtgZ1Ev9gof3l02ir39-=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "101585143373971259236", "name": "Trenton McCall", "time": 1610997801387, "rating": 5.0, "text": "So I knew exactly what I was looking for as I walked in and was kindly greeted by Rachel. She told me she would be with me in a moment and in a moments time she was there to assist me. I showed her the pictures of the two bracelets I was needing to purchase for Valentine’s Day. She disappointedly told me they do not have those in store I would have to order them on-line. I told her I’ve NEVER ordered anything on-line before. Rachel told me to come have a seat she would order them with me and I could just come back and pick them up when they arrive. She was kind and helpful. Doesn’t sound like much maybe to some, but I think she went out of her way to make sure I was happy. I’ll definitely be back", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "115592904178522742812", "name": "Addy Schmuck", "time": 1617481374382, "rating": 5.0, "text": "Great customer service. Vickie was very helpful with us. Would highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "103741710837112627573", "name": "Treasure Williams", "time": 1558559479824, "rating": 5.0, "text": "Excellent products, awesome staff. You can also sell them your (real) jewerly. Look online from pre-owned watches-great for if you are looking for a nice pre-owned watch", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNm0lsGG-cU-h_LJ9CuXpBWh67D6EggrW_7hTw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP_s1F8OKoGiYwRZkcJ65BqtKDygphHWzSkEWc=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "113272971974348599488", "name": "Bridget Williams", "time": 1610910340043, "rating": 5.0, "text": "Best Jared's that I have visited.  They went above and beyond to fix my ring. Plus the employees are very nice.", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "102785233594842340517", "name": "Heather Welch", "time": 1610243442251, "rating": 5.0, "text": "The Huntsville store was an amazing experience! We used Tasha and she was so knowledgeable and professional. She got us exactly what we wanted.", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "101980097514128403308", "name": "Angela King", "time": 1608760069452, "rating": 5.0, "text": "Tasha helped us upgrade my engagement ring. She is very knowledgeable and fun to work with! Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "111889306431816708212", "name": "Katreena Mullican", "time": 1590323051139, "rating": 5.0, "text": "Had a great experience at Jared's of Bridge Street, Huntsville.  Mechelle was wonderful!  She helped us pick out a beautiful setting and stone from their impressive collection for our anniversary.  She took time to explain and present various options.  My ring was assembled, sized, and ready for pickup same-day.  Highly recommend stopping by!", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "112667345735747018557", "name": "Tina Wells", "time": 1609359686627, "rating": 1.0, "text": "I was extremely disappointed and appalled at the treatment I received at this location. The lady met us at the door which was locked due to Covid, which is fine, I understand but when she opened the door, she basically asked what we wanted like we couldn’t enter the store without some kind of pass. That already made me uncomfortable. After telling her we were shopping for an engagement ring she led us to the counter to have a look. She then proceeded to ask us how long we have been together as if we needed to meet her approval. Next she asked where we met. I did not appreciate her being so nosey. After looking a a few rings, I didn’t see anything that had a large enough diamond for me. She sighed at me when I told her the one she showed me was not large enough. Overall made my experience not fun at all. I would not recommend shopping this location!!", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "102954886716319469662", "name": "Gary Watkins", "time": 1616085897893, "rating": 5.0, "text": "Really nice jewelry at great prices", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "118381877533658749699", "name": "Royce Estes", "time": 1616428300120, "rating": 5.0, "text": "Friendly people and beautiful merchandise!", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "107914069771827562988", "name": "Tonya Staggs", "time": 1603051829689, "rating": 4.0, "text": "They dont sale pandora  any more😪. Very nice place.", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "102067191249824913638", "name": "Larry Burger", "time": 1581808823357, "rating": 5.0, "text": "Great inventory and the best sales staff. They even cleaned each piece of jewelry before packaging it for me.", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "115378390494302001108", "name": "David Hambey", "time": 1607792467428, "rating": 1.0, "text": "Extremely rude employees, they treated us like we were not welcome from the moment we walked into the store.", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "112728691397888337844", "name": "Sheryl Payne", "time": 1559048039332, "rating": 5.0, "text": "So glad I stopped in on the day that i did.  I got to work with Ms. Tasha and she made my first whole (by myself) jewelry buying experience a success.  Will definitely be stopping through again!", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "110603284797226456977", "name": "Christina Mascarinas", "time": 1558993139725, "rating": 1.0, "text": "Each employee I encountered was incredibly snooty and rude to the point it was almost comical because they have nothing to be snooty about. The jewelry was nothing to write home about, even if I would have found something I don’t want a piece from a store with such bad energy.", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "113634105924411107397", "name": "Joseph Cuzzort", "time": 1549910273931, "rating": 1.0, "text": "Typically, great customer service. Not today, no one said hello as I entered and I walked around the showcases multiple times and not one employee asked if they could assist me or say though would be with me in a moment.\n\nNot a good experience today.\n\nJoseph", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "105638772015352480942", "name": "Robin Warren", "time": 1531332096043, "rating": 5.0, "text": "I was greeted as soon as I stepped in the door.  I  was treated  very professionally. My  rings were checked and cleaned.  Thank goodness I asked her to clean my other rings.  She saw some diamonds missing.   It is being fixed now.", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "101038215137901151211", "name": "J HONEZ", "time": 1563818365415, "rating": 1.0, "text": "Terrible place to buy from.  Constant lies.  They never have your information in the system even though you spent thousands of dollars with them and show up for warranty work to maintain it.  They never seem to have you in the system so keep your paperwork.  They also like to chip your diamonds on purpose it seems so that they can force you into getting lesser diamonds or non certified diamonds to maintain your warranty.  Will not issue a refund for the lesser value diamonds they put into your rings either.  Maybe other Jared's are different but don't buy from this location.  Great scam they have going on", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "105226215505838292961", "name": "Charlotte Smartt", "time": 1528468625441, "rating": 5.0, "text": "Everyone at the store was such a pleasure to work with. They take the time to explain everything you try out many options and they make you feel very comfortable shopping there. I highly recommend this store. They are  absolutely the best people to work with .", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "113420017555408360429", "name": "Jason Watson", "time": 1512669901310, "rating": 5.0, "text": "Very courteous, professional and prompt. Have been to this store twice,  and couldn't have asked for a better experience.  Lexi and Riley are awesome, and I can't thank them enough.  Knowledgeable,  friendly, and patient with my many questions.\nHighly recommend Jared and this location! Will be back again and again.", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "110520994243390660936", "name": "Cherish Charles", "time": 1504835301563, "rating": 5.0, "text": "The staff at this location are simply unparalleled in their friendliness, product knowledge and willingness to assist me every time I come in. I truly feel appreciated as a customer and would recommend without hesitation. Shout out to Brian, in particular for going above and beyond with my late night repair. I truly appreciate your help. Thank you!", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "104380058586922734076", "name": "Branden Schlesinger", "time": 1556501260225, "rating": 5.0, "text": "Really amazing customer service!  They really went above and beyond to make everything perfect!", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "113519557413290107707", "name": "Marty Howard", "time": 1494001674542, "rating": 5.0, "text": "Great experience throughout engagement shopping experience. Went to several different Jewelry store and was treated like family at Jared's. Cameron was our salesperson and did a terrific job of listening and guiding us thru the process to find the perfect engagement ring as well as wedding rings. BTW She said YES and we were married yesterday. Thank you Cameron and support staff at Jared's.\nHighly recommend!!!!", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "112869680600831251400", "name": "Kenneth Hughes", "time": 1559181252115, "rating": 5.0, "text": "Awesome staff, service, and customer service! Patricia was an amazing sales associate!", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "101684732716359341329", "name": "Robert Makowski", "time": 1484641267110, "rating": 5.0, "text": "They have a great store, and wonderful, knowledgeable people! They will make you feel comfortable, and treat you fairly. Me and my family loved the items we purchased. Thanks y'all I'll be back soon!", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "118026932175003395389", "name": "Jack Brown", "time": 1544210613673, "rating": 5.0, "text": "This was my first purchase from Jared's. The entire transaction was very pleasant. They have a customer for life.", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "116299953982069317763", "name": "Dale Barksdale", "time": 1491224240090, "rating": 5.0, "text": "My husband and I wanted to buy new wedding bands for our 10th anniversary.  Cameron, our salesman, could not have made our experience any better. He was very knowledgeable and easy to work with. We could not be happier with our jewelry or the customer service.\nWe were so pleased with our experience we also bought a Citizen watch for my husbands birthday (his birthday is just a few days after our anniversary). We had to take the watch back the day after we purchased it because it did not work :(. Cameron also helped us with that. He swapped it out and was very  apologetic. We understand things happen (even with expensive pieces of jewelry), but the excellent customer service will keep us coming back.", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "114095325836541260875", "name": "Emily Gangl", "time": 1531490576927, "rating": 5.0, "text": "The sales associates were extremely helpful and patient with me as I looked through many options for my wedding ring!", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "115362149944190123251", "name": "Don Ebert", "time": 1520345909773, "rating": 5.0, "text": "Long story short without the details, Charles Brown AKA \"Charlie Brown\" as general manager at the Huntsville location went above and beyond to satisfy a customer...me.  Over what I believe to be a legitimate issue, I had begun to put Jared -Galleria behind me, both figuratively and literally!  Fortunately, Mr Brown caught me in the parking lot and asked to be given a chance to fix the issue.  I did.  He did and I suggest you try Jared's for your jewelry needs.", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "108816632264118092546", "name": "Aisha Buycks Realtor (Huntsville Madison AL)", "time": 1535662550970, "rating": 5.0, "text": "I love Jared at Bridgestreet they take great care of your pieces. I have taken them my wedding set to tighten and clean. I always get them back perfect and blinging. Patricia Mitchell is awesome and gives great customer service. She listens and gets you exactly what you are looking. Their repair service are responsible and give a very reasonable turn around. They will also clean and redip your rings to bring them back up. They will continue to be my go to jeweler. They are friendly and very informative about their pieces.", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "102133917241148344117", "name": "Rae M", "time": 1528978743915, "rating": 1.0, "text": "I have talked to them 3 times in store about getting a quote for a ring to be made. It was a wedding band we got from them 6 years ago. They don’t make it anymore so we have asked them 3 different times leading up to our 5th wedding anniversary how much it would cost to have a duplicate made. The second and third time they apologized that they hadn’t followed through. This last time 2 girls wrote down information and promised to get in contact with us soon after our last visit. Well our 5th anniversary has come and gone and we still don’t have a quote. Guess that’s not happening. Really frustrated.", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "102456050981596548564", "name": "Chelsea Marbut", "time": 1491080988169, "rating": 1.0, "text": "Insufferable customer service.\nThe gentleman I spoke with told me that although he could pull up my information and see my extended care plan, the previous store did not correctly handle my paper work so there was nothing he could do for me, as far as repairing my ring... remember he's telling me this as he's viewing my extended care plan.\n\nHis parting words for me were, \"I'm sorry, I'm trying to teach people how to correctly use our system, and the other store didn't do it correctly.\"\n\nSince this is the 4th time in two years that my ring has needed repairing, this was a terrible experience to accompany that.\n\nUpdate:\nThe GM of the Hoover Location has helped resolve this problem via a phone call... through difficulty from the Huntsville Location.\nWe do not plan to use the Huntsville Store going forward.", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "108837882729576506731", "name": "T Mac", "time": 1545173104508, "rating": 5.0, "text": "A very good place to shop", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "115412558063873766637", "name": "Kyle Jett", "time": 1493131163494, "rating": 5.0, "text": "Excellent customer service. Staff was very helpful and informative.", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "107708897552136931699", "name": "Angie Clemore", "time": 1509503645336, "rating": 1.0, "text": "This place is extremely discriminatory. My friends and I are all black youths with very well paying jobs and were intrested in their rings. When we got there we were instantly stared at and treated like we didn't belong. There was a tall white man who seemed very rude eyeing us the whole time and even made a sure to mention the quality of the security cameras without our asking anything. Half of us left to sit in the car (because of the cold treatment) and HE FOLLOWED US OUTSIDE!! Soon after security was called and we decided to spend our money somewhere less racist. My family, friends and I are never shopping here again. It's just disgusting.", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
{"user_id": "101888624727104323658", "name": "Vinie Carter", "time": 1519351041207, "rating": 5.0, "text": "Very good customer service", "pics": null, "resp": null, "gmap_id": "0x88626eba65dff311:0xa1d9b9a2ca05f07e"}
