{"user_id": "116858711592969006195", "name": "Justin Walters", "time": 1623335195355, "rating": 5.0, "text": "Had a blast here and was my first time skydiving!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipN1Cl6OpqY5c594uhP72vFlYAIsXBgAsmVnx5Id=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN3ZSzuiJq_jMVcvbpc6Pkbx8nVOpiaGOC-rvbp=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMg-ZN9EYEA2Jk1jiiSo3yG1q_SLx2MKal9Z2O7=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPkjPcfosUGddod7tVJDMZHBirQ0vgQIhU7ZLXS=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMXoTxziS81R1hHZBJ6EehY-uP5IwaXfr0XzKLf=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "115013317542360390348", "name": "Anette Wade", "time": 1621979236889, "rating": 5.0, "text": "This was my first time to sky dive and I am still in awe ! Skydive the Gulf is completely amazing. I have never met another staff where everyone is so friendly,professional,and most of all they make you feel like they truly care about you!!! From first meeting Rachel at the front desk to get checked in to my instructor Charles, to the pilot of the plane, to everyone else we came in contact with, they were so nice and helpful !  This is a young crew and I am still in awe at how awesome they are in operating this company. As far as my jump, I wasn’t nervous at all because I was very comfortable and secure in everything Charles  had told me in preparation. The jump was incredible and I don’t think my feet will ever totally touch the ground again !!! I am ready to go again and when I do it will be more than worth the miles to go back to Skydive the Gulf. You absolutely can’t go wrong with these guys !!! They are the best by leaps and bounds.  To the staff, thank you so much for one of the greatest adventures in my life and being able to check off number 1 on my bucket list !!!\nI pray that you will be safe and be blessed in all of your endeavors!\n\nThank you from the bottom of my heart,\nAnette Wade", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116172087368594226834", "name": "Quite Marvelous", "time": 1601674136844, "rating": 5.0, "text": "I'm still in awe and speechless. The experience, the environment, the freedom and beauty of the fall...all of it was breathtaking and remarkable. The staff is warm, knowledgeable, and fun. The property is beautiful, calming, and absolute solace. My jump was at 1:30. It's 4 in the afternoon and I am still here,  basking in the splendor of what just occurred. I went skydiving! 💞", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOvs8EQHk4kRCGBasIuONrC37SQ2PicQeJGwFWN=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNRgJEM9hm_iZZpPl0zJHucXor-nUMzL5MLLZ-K=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPiiHNSFzY9ZQysvL5EVPWq1RSZCZw1CpQ601Dx=w150-h150-k-no-p"]}], "resp": {"time": 1601939552287, "text": "Girl! We had a blast thank you for such a sweet review!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112175619661701910263", "name": "Bradford Powers", "time": 1621949170931, "rating": 5.0, "text": "For my wife’s birthday I gave her and her friend a sunrise jump to the beach with Skydive Gulf. The entire experience was amazing and if you are reading this review because you are unsure - stop reading and sign up.  The staff were the perfect mix of laid back and professional.  They manifested their expertise when needed and kept it light for the first time jumpers.  The landing at Florabama on the beach is something the jumpers and those of us cheering from the sand will never forget.  This was my wife’s first jump and the instructors and all the staff were amazing. If you want to celebrate America support this business and make a jump to one of the most iconic beach bars in the world.  Sign up now !!!!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "109820646555775016600", "name": "Jennifer Patterson", "time": 1623453262018, "rating": 5.0, "text": "For someone who us TERRIFIED of heights, this was SUCH an amazing experience and as hard as it is to believe so incredibly peaceful!! Instructor's are very knowledgeable and talk you through every piece of safety you need to know. Great job with this staff!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "114004084549729152785", "name": "Taron Reiannon", "time": 1623968629302, "rating": 5.0, "text": "Super easy & comfortable experience! Everyone was so incredibly nice and welcoming! I recommend this experience to any and everyone who gets the chance!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "114359234313651826478", "name": "Mac Coleman", "time": 1623945337474, "rating": 5.0, "text": "We had an amazing time! Staff were friendly and helpful. We were in and out in about an hour. Absolutely will return!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112498483855664963478", "name": "Jennifer Wymer", "time": 1623431111198, "rating": 5.0, "text": "What am we some experience... Charles and Luis are both amazing!! Definitely will do it again!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "100655173618267475130", "name": "Bryan Whatley", "time": 1614312381794, "rating": 5.0, "text": "Had the most amazing, relaxing, and very spiritual time diving through the heavens. I’ve never been more calm and at ease in doing something so incredible. I felt like I was in complete zen.\n\nMy instructor, Charles Price, rocks!  He is a great guy and very funny.   I know I’ll do this again several times and then go for my solo dives.  All the people at Skydive The Gulf are awesome!   Thanks so much and I’ll see you in the sky again soon!!", "pics": null, "resp": {"time": 1617892436349, "text": "Thank you for the awesome review! Charles is the man for sure:) Hope to see you again soon!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "102101945671176542552", "name": "Herman L", "time": 1623947586363, "rating": 5.0, "text": "This was on my bucket list and was the most amazing experience I’ve ever had! If you haven’t went skydiving add it to you bucket list and do it cause your missing out!!!! Will be back", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "105481737367082739327", "name": "Žarko", "time": 1622851712051, "rating": 5.0, "text": "First time sky diving and i loved every minute of it. Very professional and engaging crew. The weather was perfect, beautiful scenery of the Gulf. Totally recommend it 👏🏻👌🏻😎", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "118360509467768075696", "name": "James Harrison", "time": 1623337966115, "rating": 5.0, "text": "Great Location/ flying the classic Skydiving airplane the Cessna-182/ clean safe operation/ outstanding DZ to make your first Tandem jump.", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103521964018903438009", "name": "Trevor G", "time": 1623959873988, "rating": 5.0, "text": "What a rush! I'll be back in a couple of weeks...better than 5 stars! Thank you Luiz, Rachel and the rest of the crew!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "115038839979029405951", "name": "Tava Rose", "time": 1613866066768, "rating": 5.0, "text": "This was the most incredible experience of my life! I’ve already planned another day to come back and do it again! My instructor, Charles, jumped with me and did a great job at joking around to make us feel more comfortable. This was my first time skydiving and they all made us feel so relaxed. I would highly recommend this place for your first skydiving experience, because the views are hard to beat too!", "pics": null, "resp": {"time": 1617892365703, "text": "Thank you Tava, we would have to agree these views are top notch! Hope to see you again soon!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "110429508634243476266", "name": "Rubijo Purdy", "time": 1615638561856, "rating": 5.0, "text": "The staff are fantastic! Explain everything throughly and it’s obvious that it is important to them their clients have an amazing experience. My tandem jumper was great. And after the jump you have a great video. They really do a good job making the videos. This was on my “bucket list”. So glad I went with this crew for my first time. Wonderful experience all the way around. Would recommend them to anyone.", "pics": null, "resp": {"time": 1617892117501, "text": "Thank you for the nice review. We are grateful for people like you. Hope to see you again for your 2nd jump!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "110194960343663159488", "name": "Christi", "time": 1621706462410, "rating": 5.0, "text": "Definitely one of the best experiences of a lifetime! Thank you to Charles for being such a great jump instructor. If you have a bucket list, DO NOT skip this experience. I'm already planning the next jump!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103670104030653592267", "name": "Mallory Jones", "time": 1622212837199, "rating": 5.0, "text": "Had such an amazing time skydiving with this team! They were friendly, fun and comforting for myself and a group of friend's first skydive. Would definitely return for another dive on the Gulf!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116813431247211347158", "name": "Kassi Fowler", "time": 1619909369621, "rating": 5.0, "text": "I've caught air a couple of times here and it just gets more amazing each time. I will be back, I recommend this therapy to everyone. It's addictive. Sky is the limit, so go get it!!!!!", "pics": null, "resp": {"time": 1620247181308, "text": "Great to see you in the air again! Thank you."}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "106228445937993909255", "name": "Pollyana Pereira Polly", "time": 1617512289353, "rating": 5.0, "text": "FANTASTIC!\nOne of the greatest days of my life!\nThe all staff was super friendly.\nRachel is so sweet and caring; and Luiz is an amazing instructor.  Awesome vibe the whole time.. Without doubt I will be returning soon!", "pics": null, "resp": {"time": 1617891581424, "text": "Thank you for coming out to make a beach jump with us Pollyana! You girls were awesome to hang out with! Hope to see you again soon!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "102461172950459845265", "name": "Angelica Rodriguez", "time": 1620405543775, "rating": 5.0, "text": "This was amazing! Everyone was super nice and Charles makes you feel so comfortable and is so fun!! Will definitely do it again.", "pics": null, "resp": {"time": 1621180731451, "text": "We love Charles, thank you for coming out Angelica!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116170964524991585426", "name": "Ara Margist", "time": 1622736324564, "rating": 5.0, "text": "It was such an amazing experience! This is my second time doing it, and I would definitely would love to do it again with them!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116306992605249675873", "name": "Julie Bozich", "time": 1613500629477, "rating": 5.0, "text": "Great experience! The staff is well trained and so nice! I would highly recommend this place!! I’ll definitely go back! It a must to buy the pics and video. The owners are the sweetest ever. ❤️", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "113106930069083570961", "name": "Jennifer Sublett", "time": 1617540748837, "rating": 5.0, "text": "Amazing experience!  The staff here is so warm and welcoming. They really put your mind at ease so you can fully enjoy the experience. Thanks so much Charles, Rachel, Luke, Brooke, and of course Frank.", "pics": null, "resp": {"time": 1617891528626, "text": "Thank you for the sweet review Jennifer! We had a blast jumping with you!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "105417870886371819983", "name": "Savannah Buckman", "time": 1619798735464, "rating": 5.0, "text": "BEST FIRST EXPERIENCE!! The staff is hands down very friendly and professional!! I jumped with Luiz and he was very informative from the moment he installed my harness until landing! Definitely will come back and do it again!!!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "113586648308754811330", "name": "Brooke Duhon", "time": 1621961933576, "rating": 5.0, "text": "absolutely one of the best experiences of my life and the people there contributed to it for the majority of this experience! i’ll definitely be back", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103416334673512409472", "name": "Thomas Emmerich", "time": 1619112768375, "rating": 5.0, "text": "What an awesome experience! The staff and crew were efficient and made everything fantastic and safe. Would highly recommend and jump again!", "pics": null, "resp": {"time": 1619458855162, "text": "Thank you Thomas!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117934555797315973155", "name": "Kendall", "time": 1619909039805, "rating": 5.0, "text": "Very nice and professional staff. Guide you through the whole process. Real nice people. Thanks for a awesome time.", "pics": null, "resp": {"time": 1621181281477, "text": "Thank you Kendall! We hope to see you again!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "107861760003172574389", "name": "Taylor Merritt", "time": 1619364640556, "rating": 5.0, "text": "This place is awesome! The pilot was very cool and Charles was nice. The dogs were my favorite part. Super pet friendly, relaxed, and layed back place.", "pics": null, "resp": {"time": 1619458766968, "text": "Thank you Taylor We love our puppers!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "114466294352828609601", "name": "Shea Wilson", "time": 1615642143037, "rating": 5.0, "text": "The best experience ever!! Some of the nicest people you will ever meet. The best part of my trip by far! If I could give more than five stars I would. Just amazing!!!!", "pics": null, "resp": {"time": 1617892156009, "text": "awwww thank you Shea such a sweet review. Thank you for choosing us to jump with!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "118436466066767747829", "name": "Allie Baldridge", "time": 1622736303488, "rating": 5.0, "text": "Very fun experience, i would go again !! they were very informative about everything that was happening and it made the overall experience 10x better (:", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "108613590819034414855", "name": "Bob Johnson", "time": 1622154564779, "rating": 5.0, "text": "First time sky diving and I would recommend this operation. Fun, Friendly staff took really good care of us!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "100947282207074713941", "name": "Justin Gay", "time": 1617928036922, "rating": 5.0, "text": "Absolutely amazing experience. The whole team was great to work with, educational, and great throughout. Highly recommend the Sunset Beach landing. Will do it again", "pics": null, "resp": {"time": 1619458903771, "text": "Thank you Justin! Hope to see you again!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "101150331261889214307", "name": "J Meek", "time": 1621691339992, "rating": 5.0, "text": "Super great place!!  Luis was absolutely awesome.  Great and friendly staff", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "102866183377894701451", "name": "Terri Barnes", "time": 1622391955171, "rating": 5.0, "text": "The most amazing thing I’ve ever done.... the ppl that run SkyDive the Gulf are the best... Charles, your the best... love ya!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "111480804622308886930", "name": "Guy Smith", "time": 1618172956171, "rating": 5.0, "text": "Had the most amazing experience!\n1st time jumper and will do it again!!!All of the staff were very professional, helpful and attentive to detail!!\nHighly recommend to anyone", "pics": null, "resp": {"time": 1618576412790, "text": "Thank you Guy!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "110683614045809253908", "name": "Joshua Loria", "time": 1615737682851, "rating": 5.0, "text": "Best experience of my life and would definitely do it a million more times. Good people and good atmosphere. My instructor made me feel safe the whole time! Thank you guys for this experience. -Taylor barger", "pics": null, "resp": {"time": 1617892212676, "text": "Thank you for jumping with us Taylor!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "109769557999940583775", "name": "David Jones", "time": 1613940449331, "rating": 5.0, "text": "Exhilarating!\n\nWent for a friend's bachelor party. It was the first time for him and most of us. I truly enjoyed Skydive the Gulf's service.\n\nNothing like diving out of the plane free- falling!", "pics": null, "resp": {"time": 1617892385971, "text": "Thank you for coming out David!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103514782999299857732", "name": "Lindsay Boyle", "time": 1617927982950, "rating": 5.0, "text": "First time skydiving and it was awesome!!!  Charles was a great instructor!  Can't wait to come back on our next trip to the gulf coast!", "pics": null, "resp": {"time": 1619458877958, "text": "Thank you for jumping with us Lindsay!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "100888824752878315640", "name": "Naomi Jones", "time": 1618173410772, "rating": 5.0, "text": "My first jump and it was great!! Charles was very knowledgeable and made me feel safe. Everyone at SkyDive The Gulf was fun and made the experience memorable!!", "pics": null, "resp": {"time": 1618576375589, "text": "We had a blast on your jump! Thank you for joining us!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "109969962623261136990", "name": "RON MULLEN", "time": 1622302497050, "rating": 5.0, "text": "10,000 feet above Flora-Bama.The jump the adrenaline rush then a Bushwacker. Awesome 🎉🎉👍", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "114662403301288003277", "name": "Rick Walker", "time": 1599255539392, "rating": 5.0, "text": "This was without a doubt one of the most awesome experiences of my life. Everyone was fantastic, they made us feel like part of the family. I really can't imagine finding a better group of people. The views from that altitude are unlike anything you have ever experienced. If you have ever wanted to feel true freedom with the calming effect only the beautiful blue sky can deliver this is what you've been searching for. Worth every penny I assure you! Thanks to all of you at “Skydive the Gulf” for a wonderful experience. Charles and Luke, you guys are the best!! My son and I will definitely be back!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "111290075559026346117", "name": "Kim Santini", "time": 1619903607210, "rating": 5.0, "text": "It was a great experience never in my life I thought I would ever skydive... so if you are thinking about it you should do it ..Y.O.L.O.", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112743276666204889191", "name": "Madison Wilson", "time": 1614479820272, "rating": 5.0, "text": "Today was the best experience I’ve ever had. Thank you to the crew for making me feel safe and comfortable the whole way down. What an experience!!!! I would do it again tomorrow.", "pics": null, "resp": {"time": 1614706884367, "text": "Thank you for jumping with us. Hope to see you next time!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "102255884637562335747", "name": "James Nash", "time": 1619903747301, "rating": 5.0, "text": "My first time .awesome people and great experience. Will definitely  be back", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116128688446861429971", "name": "Angela Johnson", "time": 1622154497353, "rating": 5.0, "text": "Awesome experience! The employees make everything even more enjoyable!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "108114370320571788278", "name": "Skyler Jones", "time": 1623348127208, "rating": 5.0, "text": "Hands down the best staff! 10/10. Awesome experience!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "115278098822813032001", "name": "Kait Neese", "time": 1620933534503, "rating": 5.0, "text": "LUIZ WAS AWESOME! The entire staff is super friendly and helpful, would 10/10 recommend!!", "pics": null, "resp": {"time": 1621180672843, "text": "Thank you Kait!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "106440549723144932094", "name": "Chris Roach", "time": 1615251892683, "rating": 5.0, "text": "I wish I could remember everyone's names because everyone there is awesome and extremely friendly. Luke was my instructor and was an absolute pleasure to jump with. This was my 4th time jumping (first time at Skydive the Gulf) and I had such a blast with these guys I went right back up and jumped again for jump number 5. The second go around Luke gave me my own altimeter, had me open the plane, pull the chute, and steer the canopy pretty much the whole time except for landing. If I get the chance to come back to Alabama again I'll definitely go back and opt for the beach landing. If you've ever wanted to go and been on the fence, just come here and do it. I promise you that you'll be in great hands with these guys. There's absolutely no rush in the world like it. My only regret was not jumping a 3rd time!", "pics": null, "resp": {"time": 1617891742802, "text": "Thank you so much and im glad it worked out where we could take you right back up! Hope to see you again!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "114662403301288003277", "name": "Rick Walker", "time": 1599255539392, "rating": 5.0, "text": "This was without a doubt one of the most awesome experiences of my life. Everyone was fantastic, they made us feel like part of the family. I really can't imagine finding a better group of people. The views from that altitude are unlike anything you have ever experienced. If you have ever wanted to feel true freedom with the calming effect only the beautiful blue sky can deliver this is what you've been searching for. Worth every penny I assure you! Thanks to all of you at “Skydive the Gulf” for a wonderful experience. Charles and Luke, you guys are the best!! My son and I will definitely be back!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112743276666204889191", "name": "Madison Wilson", "time": 1614479820272, "rating": 5.0, "text": "Today was the best experience I’ve ever had. Thank you to the crew for making me feel safe and comfortable the whole way down. What an experience!!!! I would do it again tomorrow.", "pics": null, "resp": {"time": 1614706884367, "text": "Thank you for jumping with us. Hope to see you next time!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "106440549723144932094", "name": "Chris Roach", "time": 1615251892683, "rating": 5.0, "text": "I wish I could remember everyone's names because everyone there is awesome and extremely friendly. Luke was my instructor and was an absolute pleasure to jump with. This was my 4th time jumping (first time at Skydive the Gulf) and I had such a blast with these guys I went right back up and jumped again for jump number 5. The second go around Luke gave me my own altimeter, had me open the plane, pull the chute, and steer the canopy pretty much the whole time except for landing. If I get the chance to come back to Alabama again I'll definitely go back and opt for the beach landing. If you've ever wanted to go and been on the fence, just come here and do it. I promise you that you'll be in great hands with these guys. There's absolutely no rush in the world like it. My only regret was not jumping a 3rd time!", "pics": null, "resp": {"time": 1617891742802, "text": "Thank you so much and im glad it worked out where we could take you right back up! Hope to see you again!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "111290075559026346117", "name": "Kim Santini", "time": 1619903607210, "rating": 5.0, "text": "It was a great experience never in my life I thought I would ever skydive... so if you are thinking about it you should do it ..Y.O.L.O.", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "102255884637562335747", "name": "James Nash", "time": 1619903747301, "rating": 5.0, "text": "My first time .awesome people and great experience. Will definitely  be back", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "102555083807264293374", "name": "Tristin Woodruff", "time": 1617478876055, "rating": 5.0, "text": "The staff was very friendly and answered any questions we had. We had a great experience. Also, they have a dog on the sight that calmed our nerves before the jump.", "pics": null, "resp": {"time": 1617891635846, "text": "Thank you so much for the nice review! We love our puppies! glad you had a good time. See you again soon!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "118301105185486517658", "name": "Ricki Vann", "time": 1613766304262, "rating": 5.0, "text": "Amazing place to go skydiving! I went for my first jump today and it was incredible! I felt totally safe and comfortable. My husband also did it and it was his third time. The view was unbelievable. We got an amazing view of the Gulf and the shoreline. I jumped with Charles and he was wonderful. His dog was so sweet! I asked Broke for a pep talk before the jump and she told me some incredible advice. Just talk with Broke if you are nervous and she will help you out!!\n\nIf you’re thinking about skydiving... this is your place!!\n\nWe loved our trip and are SO thankful for this wonderful group in Elberta. Thanks y’all! Amazing day. Amazing views. Rush of a lifetime. Awesome experience and I’m super thankful for y’all! Thank you!!", "pics": null, "resp": {"time": 1617892310063, "text": "What a great review Thank you so much for coming out to jump with us. We hope y'all come back again!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "115278098822813032001", "name": "Kait Neese", "time": 1620933534503, "rating": 5.0, "text": "LUIZ WAS AWESOME! The entire staff is super friendly and helpful, would 10/10 recommend!!", "pics": null, "resp": {"time": 1621180672843, "text": "Thank you Kait!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "107974066114776894449", "name": "Mike Alves", "time": 1621268815584, "rating": 5.0, "text": "This was my first skydiving experience and the staff made it very easy to understand and it was a very relaxing environment.  I am hopefull that I will make many more jumps with them.", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "108080804884094366107", "name": "Kathleen Smith", "time": 1619734000485, "rating": 5.0, "text": "It was my first time skydiving, and I felt safe the whole time. It was the best experience ever!!!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "100378638445707862708", "name": "Original Polywog", "time": 1615144184129, "rating": 5.0, "text": "First and Second skydive in the books!!! Great staff, really good instruction, pilot was awesome. Went with a group of 8 and felt right at home. Cant wait to do this again and again and....Lol.", "pics": null, "resp": {"time": 1617891699489, "text": "Thank you so much for coming out and jumping with us, You all were awesome! See you again soon!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "114759862606689878412", "name": "Alex Postlewait", "time": 1623337709333, "rating": 5.0, "text": "Great experience !! Friendly staff! Great atmosphere! Come jump!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "101890346203881533049", "name": "Alfred Biland", "time": 1617568081654, "rating": 5.0, "text": "Had a fantastic time.   Staff professional,  helpful and put safety as our first priority.", "pics": null, "resp": {"time": 1617891461384, "text": "Thank you for the nice review Alfred! We hope to see you and your son back in the sky again soon!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "115715967844597144223", "name": "Mike Barnes", "time": 1622392012217, "rating": 5.0, "text": "Words can’t describe how awesome!!! All the staff are great. Do this!!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "109865287041955599935", "name": "Mason Kirk", "time": 1601770474195, "rating": 5.0, "text": "Thank you Luke and Charles for taking my wife up her 3rd time and my 1st time and Tim for flying us up and kicking us out! Truly a great experience, I had assumed it would be like stomach drop from roller coasters at amusement parks but that feeling is only for the first second or two then it feels like your just suspended in the air.\n\nCan't wait to get fully certified and be jumping on my own. 10/10 would recommend!", "pics": null, "resp": {"time": 1601939441285, "text": "Mason thank you so much for coming out! We hope to see you again."}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "111768445984717566544", "name": "Wyatt Reynolds", "time": 1599447561149, "rating": 5.0, "text": "My name is Wyatt Reynolds and somehow my daughters name is on my google account.  Just wanted to thank you for the absolutely fantastic experience Sept. 3rd.\nCharles, Rachel, Tristan, The lady who was packing a chute and who filmed us landing( who's name I forgot to write down) , You all deserve to be rated 10 stars!\nWishing your business the continued success you so richly deserve!\np.s. shout out to Reese & Frank", "pics": null, "resp": {"time": 1599972473805, "text": "Hey thank you Wyatt, and Brooke says thank you too(the parachute packer)! We had a great time and hope to see you again!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "100699062259091709298", "name": "Wyatt Chipley", "time": 1618084051904, "rating": 5.0, "text": "A fantastic experience!!! I would 10/10 recommend to any friends and family!", "pics": null, "resp": {"time": 1618576464036, "text": "Thanks Wyatt! See ya next time!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116932280843890975684", "name": "Richie Peak", "time": 1623289589415, "rating": 5.0, "text": "I mean if you don't trust just anyone to jump out of a plane with.", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104435055517540870573", "name": "jacob roe", "time": 1622217288496, "rating": 5.0, "text": "First tandem jump and these people were awesome", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112211643823540201955", "name": "Courtney Wilkerson", "time": 1605823266753, "rating": 5.0, "text": "Charles was an AMAZING instructor! I couldn’t have imagined a better first skydive. I got a little nervous on the plane, and Charles even helped me through it with some breathing exercises! Definitely an experience I will never forget.", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "101649952932708279714", "name": "Abby Baker", "time": 1622217324707, "rating": 5.0, "text": "It was great! Definitely a awesome experience!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "100420282531369574500", "name": "Will Purvis", "time": 1597593660814, "rating": 5.0, "text": "Absolutely AMAZING all around experience! The staff was so down to earth. Made us feel at home. Literally one of the greatest days of my life! If you are considering skydiving, sky dive HERE! Spectacular views of the Gulf, the beach, and countryside! Can’t wait to go again! Spent a couple hours with these guys but they are forever family!!!!", "pics": null, "resp": {"time": 1597761163581, "text": "Thank you for jumping with us Will. We hope to see you again!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112954159933406120952", "name": "Rachel Fraser", "time": 1622241823711, "rating": 5.0, "text": "These guys rock!!! Thanks for the awesome experience 😎", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117191348739243770701", "name": "Harry Green", "time": 1615595368742, "rating": 5.0, "text": "First time!!! Awesome place to skydive! Beach landing is a must. The views are amazing and the staff is the best!! Love Skydive the Gulf!!!!", "pics": null, "resp": {"time": 1617891770766, "text": "Thank you for coming out and jumping with us!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116385862274736138441", "name": "Jon Shaw", "time": 1603669722555, "rating": 5.0, "text": "Just got done doing my second skydive with Zach and Luke, and I have never felt more safe falling from an airplane in my life. All the staff was so sweet and accommodating. Will be back multiple times for the beach jump.\n\n5 stars just doesn’t do this place justice", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103813360156222330186", "name": "ev Kaestner", "time": 1597718410230, "rating": 5.0, "text": "This was an absolutely breath-taking experience from start to finish!\n\nThe amazing staff helped my boyfriend ask me to marry him. He bought the GoPro package (which was a super sneaky way of capturing the proposal without raising any suspicion). I suspected absolutely nothing even though the entire staff was in on it. The actual skydiving was so wild and incredible and the staff made me feel safe and excited the whole time. I'd never been skydiving before and skydiving over the beach was hands down the coolest thing I've ever experienced!\n\nThey were also super fast in getting us the footage. I was expecting to have to wait a week and they got it to us in around 24 hours. They even made us a full on edited video with music of the experience so we could show our families!\n\n100% recommend. We'll definitely be back!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPhACflAJx8Kpik3krwkiXWqSCPrsFc6m9XZuGb=w150-h150-k-no-p"]}], "resp": {"time": 1597761090793, "text": "Thank you both for coming out and sharing such a special day with us we had a great time jumping on the beach. Congratulations!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "100890815107147288094", "name": "Kaleb Boutwell", "time": 1604440001700, "rating": 5.0, "text": "Wow!! You guys rock!! Thanks so much!!! The whole experience here at Skydive the Gulf was phenomenal! From booking the trip to landing on the beach, these guys know how to impress and make it an amazing journey! Not to forget the beautiful proposal package they put together for me and my fiancé!! 10 out of 10 for sure!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103804891624463726227", "name": "Danielle Phillips", "time": 1619382684969, "rating": 5.0, "text": "Such wonderful service!! Would recommend jumping there!!", "pics": null, "resp": {"time": 1619458678082, "text": "Thank you Danielle so much for coming out!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "114996973356643492046", "name": "Jo Ann Spears", "time": 1596208552190, "rating": 5.0, "text": "Jason and Jami loved their skydiving experience with Skydive the Gulf!! This was Jason’s second time and Jami’s first time to jump. They LOVED it!! The staff was so friendly and fun! Great meeting Tristen - such a super cool guy with lots of fun stories! ! Luke and Charles were fabulous on the jumps. Great place to skydive!! Highly recommend for all the crazy people wanting to jump out of a perfectly good airplane 😬🤣", "pics": null, "resp": {"time": 1597802841218, "text": "Thank you for the great review JoAnn!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "113625498857515796483", "name": "Rachel Breckner", "time": 1599319901934, "rating": 5.0, "text": "Rob and I had a fantastic skydive this morning for my birthday! Rachel did a great job getting us all signed up and ready to go, Luke and Charles were awesome instructors and Todd did a fantastic job dropping us off in the air at the Florabama! Highly recommend Skydive at the Gulf and definitely recommend the beach landing! Great staff all the way around! 🤙🏼", "pics": null, "resp": {"time": 1599972831894, "text": "Thank you Rachel!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103298092288667564484", "name": "Briana", "time": 1594393972699, "rating": 5.0, "text": "The staff was very amazing and helpful at Skydive the Gulf! I was super excited and super nervous; however, the staff made my experience  very calming and very helpful. They’re also very, very professional! When I walked into the building, they greeted me with a warm welcome and a warm smile! Charles was my instructor, he was so awesome and so friendly. He made my jump even more relaxing than ever! I will definitely do this again!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "106870096276572749826", "name": "Mark Frederick", "time": 1603075643647, "rating": 5.0, "text": "I can't begin to describe this. Super! Exhilarating, exciting, you've got to try it! The view from 10,000 ft. is breath taking. My jump instructor was great.", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "113401357574349668871", "name": "Kiara Wagoner", "time": 1600017046011, "rating": 5.0, "text": "This was a great way to celebrate my 23rd birthday! I had so much fun! Charles, my instructor, was so funny and he calmed my nerves about jumping! I wasn’t sure if this would be something I would do again, but after my jump, I definitely know I will be back!!", "pics": null, "resp": {"time": 1601939743514, "text": "Thanks for coming out Kiara!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "108576023485186669158", "name": "Leigh Ann Gates", "time": 1601739985392, "rating": 5.0, "text": "My son jumped and had a GREAT time.  He hasn’t stopped talking about what a rush it was.  Everyone there was very nice.  The pics are beautiful.  Highly recommend!", "pics": null, "resp": {"time": 1601939515976, "text": "Thank you for bringing your son out!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116772255497133449750", "name": "Lori Weatherly", "time": 1560711407963, "rating": 5.0, "text": "Amazing experience!! Knowledgeable, professional, super friendly staff!! Brooke was amazing hanging out with my family waiting on me to jump; Lee is who I jumped with and he was fantastic! And Collin, of course, was a great pilot! I was able to release my stepdad’s ashes in the air and Lee captured it all on video. Would highly recommend this adventure of a lifetime! Hoping I get the chance to do it again!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMsr0YlLX6iT_LpZz0Byq1OMYnfmTKl4rs9jbZE=w150-h150-k-no-p"]}], "resp": {"time": 1563070892624, "text": "Thank you for the sweet review. Im glad we could be a part of your special day!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "106818949276865756861", "name": "Emily", "time": 1623347285837, "rating": 5.0, "text": "Amazing experience!!! Awesome instructors!! Highly recommend!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "100200061322221649781", "name": "Emma-Lee Stokes", "time": 1619382608501, "rating": 5.0, "text": "Awesome place! Great staff!", "pics": null, "resp": {"time": 1619458732931, "text": "Thank you Emma!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "107577041437054180100", "name": "AGC KYLCR", "time": 1619382664982, "rating": 5.0, "text": "Best place to jump you could ask for!", "pics": null, "resp": {"time": 1619458706433, "text": "We agree haha. thank you for choosing us, because of you we get to do what we love!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "108296245226693155042", "name": "Heather Miller", "time": 1595023841716, "rating": 5.0, "text": "This was the most amazing experience! Definitely something everyone should do at least once! I personally plan on trying every package they have and then some!!! Thanks for your kindness and your professionalism all in one! Great people and will never forget today! I will be booking another jump soon!!!", "pics": null, "resp": {"time": 1596131216047, "text": "Thanks Heather, We cant wait to jump with you again!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "100077171672724559999", "name": "jennifer Hammonds", "time": 1601671796979, "rating": 5.0, "text": "One of the most amazing experiences of my life! From the moment you walk in the door you feel the experience and professionalism.\nThe jump was incredible, Luke was calm and kind and I felt I was in the safest of hands! Thank you friends!!", "pics": null, "resp": {"time": 1601939688854, "text": "Thank you so much for coming out Jen! We knew you would love it!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116295179911456360079", "name": "Camryn Stevahn", "time": 1615737236098, "rating": 5.0, "text": "this was an amazing experience!!! Beautiful weather and great staff.", "pics": null, "resp": {"time": 1617892170402, "text": "Thank you for coming out Camryn!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "111066464397646016003", "name": "Lucas Bandy [Student]", "time": 1598197299215, "rating": 5.0, "text": "Excellent experience! The staff were professional, easy to get along with, and calming. This was my second jump and it was great. Beautiful views of the coast during the flight. If you are in the area I would highly recommend jumping with Skydive the Gulf!", "pics": null, "resp": {"time": 1598278845719, "text": "Thank you Lucas, We love this view!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "109757226853195379741", "name": "Dina Mellott", "time": 1623436232345, "rating": 5.0, "text": "Live like you were dying! Just do it!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "100350129570103309323", "name": "Stephanie Huston", "time": 1599935279675, "rating": 5.0, "text": "2nd time going and still an amazing experience! Will go again! All instructors are very professional and a lot of fun! 🤘🏼🙌🏻 I would recommend this place to anyone! ✌🏼", "pics": null, "resp": {"time": 1599972337917, "text": "See you for number 3!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "100894265274783366856", "name": "Meshan Griffin", "time": 1600017061875, "rating": 5.0, "text": "I had a great experience on my first skydive and plane ride! My instructor Luke was great and was very clear on instruction and what to expect. I highly recommend going, it is a peaceful experience that everyone should enjoy atleast once.", "pics": null, "resp": {"time": 1601939571982, "text": "Thank you Meshan!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "100253762351398346559", "name": "james carlo marasigan", "time": 1538800399186, "rating": 5.0, "text": "My brother and his friend, as well as me, have a blast experience that we cannot forget in our lives. The crew are awesome. Jumping from plane and skydiving in the clouds it takes your heart away with those majestic clouds. Highly recommended skydive the gulf to friends, family and co-workers. Thanks again for the adrenaline rush that you given to us and hoping that we can do it again.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMovIid8JggPmrjCfUGhYAuMmRgue5c4iSJXH0p=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNyFpukr1xGtBUrUqb56WooVV0Ixdjax03K5lLv=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "108909166389891419132", "name": "Christopher Bavuso", "time": 1604691556115, "rating": 5.0, "text": "Awesome experience! Best birthday present ever. Will for sure do again! Team was super helpful and friendly.", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117710540897752365841", "name": "Larry Mowrey", "time": 1615053491955, "rating": 5.0, "text": "Awesome experience and views!!! Luiz Dia.was great as an instructor and tandem parachutist!!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "109212308017144292571", "name": "Larry Primeaux", "time": 1592354014717, "rating": 5.0, "text": "Great experience! As a first time jumper I was unsure of what to expect and the friendly staff answered all my questions and made me very comfortable with the whole experience. The views were amazing and would definitely recommend Sky Dive the Gulf to anyone interested in sky diving. They took good care of me and they will do the same for you. Be sure you get the media package too! It's worth it! Thanks to Luke and the rest of the staff!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "107315365397516938227", "name": "P.I.T. Crew", "time": 1591318921395, "rating": 5.0, "text": "Absolutely amazing first time experience with skydive the gulf! The staff made me feel like it was jumping with old friends and not people I'd just met. I had a smile on my face from start to finish and it'll stay there for quite a long while I'm sure! It definitely won't be my last experience with them, 12/10 recommend!", "pics": null, "resp": {"time": 1592510116887, "text": "That is nice, Thank you #wefamily"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "100909253532263619349", "name": "Boni M", "time": 1597979173419, "rating": 5.0, "text": "The staff was super friendly and welcoming and made the whole experience seamless from start to finish. Plus you get to see a beautiful view of the coast before you jump. I had a freaking blast!!! Thank you guys for making my birthday awesome :)", "pics": null, "resp": {"time": 1598278868639, "text": "Thank you for spending your birthday with us!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "100084387115096114060", "name": "Cindy Blum", "time": 1606076529116, "rating": 5.0, "text": "First time jumper and the team made the experience the best. Well done and will be back again!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "118098016508586683137", "name": "Josh Carden", "time": 1596905664858, "rating": 5.0, "text": "Such an awesome birthday experience! They made it such a great trip! Can’t wait to come back and do it again! I would highly recommend these guys to anyone wanting to have the time of their life!", "pics": null, "resp": {"time": 1597802695460, "text": "Thank you Josh! Glad we could spend your birthday with you!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "108802262021269992635", "name": "Sammy Jo", "time": 1601742652481, "rating": 5.0, "text": "This place is amazing! Very informative and safe. Everyone is friendly and make sure you have a fun and safe jump.", "pics": null, "resp": {"time": 1601939477902, "text": "Thank you Samantha!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "107264597145919061138", "name": "Instant Replayed", "time": 1606076571650, "rating": 5.0, "text": "The crew was excellent great place to chill and then jump and get worked up.  Then chill again awesome trip.", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "100491123949661233811", "name": "Danny Dees", "time": 1599849800356, "rating": 5.0, "text": "This is the only place to have the experience of a lifetime! The best instructors! The best staff! The best jump!\n\nIt was like a five minute orgasm! I’ve never had a high like this! Thank you thank you thank you!", "pics": null, "resp": {"time": 1599972362541, "text": "WOW thanks Danny!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "110327742208725693153", "name": "Jami Spears", "time": 1596215772648, "rating": 5.0, "text": "My first jump and the start of my skydiving journey now!!! It was the best thing I’ve ever done and the best feeling in the world. I would go again now if I could!! Skydive the gulf is the way to go. Thank you so much to Luke and Charles for a great jump! And also tristen for flying us!", "pics": null, "resp": {"time": 1597802864846, "text": "Thank you Jami for coming out!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104341424790385202161", "name": "Tait Wallace", "time": 1599951353700, "rating": 5.0, "text": "This was one of the best times of my life! Super easy and the coolest staff around! Highly recommended and absolutely can’t wait to get back and go again!!", "pics": null, "resp": {"time": 1599972326689, "text": "Thanks for coming out Tait , see you soon!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "107547609533273938375", "name": "Wes Barr", "time": 1603718542770, "rating": 5.0, "text": "What a magnificent day! If you are thinking about going skydiving in this area look no further. You will have a blast with a very professional crew.", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "106412695016767191085", "name": "christin evans", "time": 1597426695819, "rating": 5.0, "text": "Absolutely the best! This was my husband's 3rd jump, his first here and he has declared this his FAVORITE jump ever. Very helpful, nice folks. We had an awesome time and will return!", "pics": null, "resp": {"time": 1597802417424, "text": "Thats awesome!!! Hope to see him and YOU in the sky again!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "109228159144163019081", "name": "Jessie Radcliff", "time": 1592840167117, "rating": 5.0, "text": "Brooke, Rachel, Luke, & Charlie are all incredible!  With the help of Skydive The Gulf we had our dream baby gender reveal. Everything was absolutely perfect! The staff was so incredibly friendly, knowledgeable, and kind. Luke & Charlie were awesome instructors for my husband (5th jump) and my sister in law (1st jump). Brooke & Rachel were beyond amazing with arranging the big reveal on the beach with me. The team took care of absolutely everything so that all we had to do was enjoy the moment. Seriously I cannot rave about this team enough! I would highly recommend them! We all love Skydive The Gulf :).", "pics": null, "resp": {"time": 1593704270475, "text": "Thank you for the sweet review Jessie! You guys are the sweetest! We are so happy we were able to be a part of your special day!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "114892405694013392484", "name": "K P", "time": 1591023900827, "rating": 5.0, "text": "I had the most amazing experience here for my first time sky diving. Everyone who works there is so genuine and sweet.  I had Luke as my skydiving instructor. He has the best vibes and made me feel so safe and comfortable! I would go back and do it again, highly recommended!", "pics": null, "resp": {"time": 1592510438554, "text": "Thank you we love Luke!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112189417224379274782", "name": "erin lockhart", "time": 1606497909396, "rating": 5.0, "text": "Such a fun experience to mark off my bucket list. Luke was awesome!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103636823360461446030", "name": "Kohli Adams", "time": 1590679115892, "rating": 5.0, "text": "Tomorrow we get married and today we Skydived the Gulf to celebrate! Everything about the experience was incredible. I truly wouldn’t be able to find enough kind words to describe the staff. They are all true gems. Do it!!! You won’t be disappointed.", "pics": null, "resp": {"time": 1592510342975, "text": "So nice thank you Kohli! Congrats on your marriage!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116834550986325317589", "name": "Austin Horslund", "time": 1619809819887, "rating": 5.0, "text": "So AMAZING!!! Thank you guys.", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "110285876815938034270", "name": "Robert Poole", "time": 1591404219754, "rating": 5.0, "text": "Wow! Thats the best, first word I could think of. Talk about an experience of a lifetime. I imagined it being so much worse. I imagined fear from the start to finish. At skydive the Gulf, there was none. I didn't second guess anything. The staff made it so easy. Not only easy, but enjoyable. Their attitudes throughout the entire experience is what made it so memorable. 11/10 would recommend. Hands down. My instructor was Luke. Awesome dude. And to every one else who helped and made it possible from the awesome lady who packed the 'chutes to the pilot of the plane and the woman who had us do paperwork. It was all smiles. I WILL be back.", "pics": null, "resp": {"time": 1592510194263, "text": "Thanks for all the shout outs Robert such a nice review :) Thanks for coming out!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112508918884368309612", "name": "Niki Underwood", "time": 1600022370288, "rating": 5.0, "text": "Skydiving here was absolutely amazing! The people are so chill & help you feel chill 😎 would definitely recommend skydiving here to anyone!! 🪂", "pics": null, "resp": {"time": 1601939585994, "text": "Thank you Niki!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112954960658592106327", "name": "Carly Schiro", "time": 1582472105876, "rating": 5.0, "text": "Amazing place to do your first tandem jump at! The instructor Lee is very informative and willing to teach you important things if you are interested in getting certified!!!! All the of the staff makes you feel at ease from the moment you walk in! Baby driver (pilot) is a spot on driver!!! I can’t wait to go again soon!!!!! I love life again! No words can describe how much my mindset has changed!!! Thank you all!!!", "pics": null, "resp": {"time": 1592515885328, "text": "Your killing it Carly!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "109337185003012542107", "name": "Hunter Fair", "time": 1590864770599, "rating": 5.0, "text": "My first time skydiving and all I can say is wow!! Could not have had a better experience.  They did a fantastic job and I loved every moment of it. The facility is a little small but they make up for it with a fantastic staff. Definitely recommend Skydive the Gulf.", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117287865324471959182", "name": "Micaela Jackson", "time": 1599416028352, "rating": 5.0, "text": "This place was so awesome! It was my first time skydiving and they told me everything I needed to know! I felt well prepared and my jump went so smoothly!", "pics": null, "resp": {"time": 1599972521436, "text": "Thank you so much for the awesome review, we had a blast!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "105955623751561948743", "name": "Ron Sparnecht", "time": 1599679378574, "rating": 5.0, "text": "Absolutely the best experience ever . Haven’t done a tandem jump before but would say this is the best place to sky dive ever . Great staff , Mr Charles and Luke were awesome to jump with . Took my wife Nichole for her birthday present on 9/5/20 and we had a absolute blast . We will definitely be back and jump with you again and will highly recommend you guys . Again thanks for everything it was perfect .", "pics": null, "resp": {"time": 1599972399856, "text": "Thank you Ron we had a blast! I hope you come back to see us!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "108733082145961385313", "name": "Ethel Kees", "time": 1621793536215, "rating": 5.0, "text": "Awesome people and ready to JUMP", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "118399741148538079639", "name": "mary bowab", "time": 1598205377529, "rating": 5.0, "text": "AMAZING EXPERIENCE!!! This is the BEST place to skydive!  Wonderful and fun staff and loads of fun! I could not recommend this enough!", "pics": null, "resp": {"time": 1598278809887, "text": "Thanks Mary so glad you came back to see us. Next time don't make it a three year stretch!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "106800889133250648209", "name": "David Lyle", "time": 1596325562985, "rating": 5.0, "text": "Went skydiving with these folks today. It was the most amazing experience of my life!  Charles was very patient with me though I was scared to death! Lol  Very friendly staff. Can't wait to go again.", "pics": null, "resp": {"time": 1597802912002, "text": "Awesome thanks for trusting us! Hope to see you again."}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "110187504936999268325", "name": "Tiffany Coleman", "time": 1588543354772, "rating": 5.0, "text": "You need to come here to skydive if you near the gulf shores. The staff is very professional and friendly. They made me feel comfortable and answered all my questions. This was my first time skydiving and due to my experience here I will definitely jump again and come back. If you can choose the beach landing experience. You will not regret it.", "pics": null, "resp": {"time": 1592511446046, "text": "Thank you Tiffany so glad you came out."}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "113791708283248915430", "name": "Simon Waldrop", "time": 1598205272273, "rating": 5.0, "text": "Absolutely the most exhilarating experience! The staff were fun and knowledgeable and the jump was a thrill like no other. Will come back!", "pics": null, "resp": {"time": 1598278821572, "text": "Thank you Simon!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "110810571467774662520", "name": "Allee Bertolla", "time": 1594594679238, "rating": 5.0, "text": "Awesome experience with the Skydive The Gulf crew! The staff was super polite and welcoming. I got to jump with Luke, and the jump was something everyone should experience. I Highly recommend Skydive The Gulf for anyone looking to give skydiving a try.", "pics": null, "resp": {"time": 1597802956999, "text": "Thank you Allee. Come out and see us again!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "113105332305487980811", "name": "David Carvin", "time": 1611791685386, "rating": 5.0, "text": "The staff is great...made the jump easy & enjoyable!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "100393868161115296362", "name": "Brandon Bynum", "time": 1619805338909, "rating": 5.0, "text": "Hell of a time, Hell of a crew and one Hell of a rush!! Great experience!!!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "108238906232554464114", "name": "Romundra Braddy", "time": 1593211339204, "rating": 5.0, "text": "I came here to celebrate my 25th birthday! The whole experience was amazing! Everyone we encountered was super friendly from the start to finish . I would recommend to anyone and would definitely be back! Thank you for making my birthday special", "pics": null, "resp": {"time": 1593704367226, "text": "Thank you for coming to jump with us Romundra!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "100393868161115296362", "name": "Brandon Bynum", "time": 1619805338909, "rating": 5.0, "text": "Hell of a time, Hell of a crew and one Hell of a rush!! Great experience!!!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "111104294184989107596", "name": "S L", "time": 1604760137744, "rating": 5.0, "text": "Excellent experience and expertise! All staff friendly, helpful and entertaining 😆", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "113569049009103256600", "name": "Jill Mowrey", "time": 1615053426984, "rating": 5.0, "text": "Omg! Freaking awesome!!! Wanna do it again! Thank you Charles!!!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "110187504936999268325", "name": "Tiffany Coleman", "time": 1588543354772, "rating": 5.0, "text": "You need to come here to skydive if you near the gulf shores. The staff is very professional and friendly. They made me feel comfortable and answered all my questions. This was my first time skydiving and due to my experience here I will definitely jump again and come back. If you can choose the beach landing experience. You will not regret it.", "pics": null, "resp": {"time": 1592511446046, "text": "Thank you Tiffany so glad you came out."}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116823730220970437284", "name": "Anthony Yates", "time": 1596980457028, "rating": 5.0, "text": "20/10 recommended this experience. Absolutely nothing else like it! The staff were professional and awesome to work with !  🤙🏻", "pics": null, "resp": {"time": 1597802454017, "text": "Thank you for jumping with us Anthony!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "118049702429041940783", "name": "Erin B Hudson", "time": 1601673778940, "rating": 5.0, "text": "Very professional and welcoming environment! We really enjoyed our time, and my personal experience was pure BLISS!!!!!!!! I can't wait to do it again!", "pics": null, "resp": {"time": 1601939716179, "text": "Thanks for coming out Erin! See you again soon!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "100830231283770030690", "name": "Reasonable Gump", "time": 1590192830880, "rating": 5.0, "text": "I brought my wife here for our anniversary, though I didn't tell her where we were going. We did the beach landing and had an awesome time, I thought about my past dives and can say for certain that this one was the best, hands down, so it gets 5 stars. Only word of caution, don't expect getting to actually dive at sunset, as apparently by that point it is too dark for them to take you safely.", "pics": null, "resp": {"time": 1592511166154, "text": "Thanks for coming out! Yes, we always steer to the side of safety."}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "115012648517232979534", "name": "Santana Mead", "time": 1601847397946, "rating": 5.0, "text": "Luke and Charles were awesome!!! Amazing experience, beautiful view, and talented instructors! Thank you guys 😝", "pics": null, "resp": {"time": 1601939339049, "text": "Thank you Santana we had a blast!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "111845940206614198645", "name": "Cj Marvin", "time": 1599934844458, "rating": 5.0, "text": "Amazing experience! Not scary at all! Definitely recommend and will go again soon! The people are cool and made you feel comfortable and very professional! 🤟🏼", "pics": null, "resp": {"time": 1597802365791, "text": "Thank you for coming out CJ hope to see you agin!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "107243004172466214642", "name": "Joshua Borelli", "time": 1596399568820, "rating": 5.0, "text": "Super Amazing. Super fun. Everyone needs to try this at some point or another one of the best experiences of my life!!", "pics": null, "resp": {"time": 1597802497332, "text": "Thanks for coming out Joshua!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104154670319001737530", "name": "Michael Grijalva", "time": 1619809912680, "rating": 5.0, "text": "These guys are awesome 💯", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "107243004172466214642", "name": "Joshua Borelli", "time": 1596399568820, "rating": 5.0, "text": "Super Amazing. Super fun. Everyone needs to try this at some point or another one of the best experiences of my life!!", "pics": null, "resp": {"time": 1597802497332, "text": "Thanks for coming out Joshua!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "102887771724703480822", "name": "Rachel Moon", "time": 1593456020858, "rating": 5.0, "text": "The center is cozy and has lots of room to hangout inside and out. There are picnic tables also if you bring lunch and want to snack with your friends. Such a knowledgeable and attractive staff!", "pics": null, "resp": {"time": 1593704034344, "text": "So good looking;)"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "106749060395790790677", "name": "Josie (Brooke) Rodenberry", "time": 1592491133771, "rating": 5.0, "text": "The most incredible experience! Highly recommend Skydive the Gulf to anyone interested in the most surreal thrill with beautiful views. The staff (and their sweet dogs) are so nice, knowledgeable, and calming. Perfect start to my bachelorette weekend!", "pics": null, "resp": {"time": 1592509666760, "text": "Thank you for coming out the puppers say thanks for the pets!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117449491837566475417", "name": "Julisa groves", "time": 1615753885546, "rating": 5.0, "text": "ABSOLUTELY INCREDIBLE. 10/10 RECOMMEND!!!!", "pics": null, "resp": {"time": 1617891647245, "text": "Thank you Julissa!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "113707096514474392138", "name": "Loala_rider Gordon", "time": 1575470210976, "rating": 5.0, "text": "I surprised my wife with a Skydiving adventure yesterday! The staff was incredible! They were easy to work with and great at explaining and coaching as she prepared to embark in this new experience! She has not quit talking about how amazing it was and how her instructor made the experience so easy and amazing. She got to cross this obstacle off her bucket list and we strongly recommend it to anyone looking for that adrenaline rush and new look on the world from 10,000 feet!! Thank you guys for being awesome!", "pics": null, "resp": {"time": 1576068327939, "text": "Thank you so much for choosing us!!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "106028641875221321423", "name": "Bryan Yowell", "time": 1596733537546, "rating": 5.0, "text": "This was a once in a lifetime experience!  So glad we were given the opportunity. Thank you!", "pics": null, "resp": {"time": 1597802628083, "text": "You should do it twice :) Thanks for coming out!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116447172597320050171", "name": "Mallory Rorie", "time": 1596904752881, "rating": 5.0, "text": "This jump was amazing! The people here are so friendly and help you in anyway they can. Definitely will jump here again!!!", "pics": null, "resp": {"time": 1597802664294, "text": "Cant wait to jump with you again!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "106724784284496186506", "name": "Kaylon Turner", "time": 1592494326807, "rating": 5.0, "text": "The most incredible way to celebrate my 30th birthday with a beach landing! The staff here is sweet and knowledgeable. Excited to see photos and my video!! I will definitely be back.", "pics": null, "resp": {"time": 1592509617514, "text": "Thanks for spending your birthday with us! Your a rock, star see you agin soon!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "102203880057158581988", "name": "Alyssa Thompson", "time": 1592001756184, "rating": 5.0, "text": "Absolutely the best experience! The staff did a wonderful job making this the experience of a lifetime. I will definitely recommend this to anyone interested in having an exciting time!", "pics": null, "resp": {"time": 1592510057912, "text": "Thank you for jumping with us Alyssa!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "100220841671296829509", "name": "jakob russell", "time": 1595032488634, "rating": 5.0, "text": "This was the best experience I could possibly imagine I never felt closer to my higher power. Thank you guys and I suggest anyone who first jumps to definitely go here.", "pics": null, "resp": {"time": 1597803002999, "text": "Thank you so much for coming out!!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "107463065480333351313", "name": "Josh Hallman", "time": 1569721975683, "rating": 5.0, "text": "Took my first jump today and it was awesome! Everyone was very nice and professional. Lee is a great instructor. He made sure I had a fun and safe experience. The video and pictures turned out great and now I have proof I actually jumped! Can't wait to do it again!", "pics": null, "resp": {"time": 1571228532364, "text": "haha Yes pictures or it didn't happen:) Thanks for coming out Josh!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116034841154787893204", "name": "Heather Curry", "time": 1571800932294, "rating": 5.0, "text": "My experience with Skydive The Gulf was absolutely AMAZING!! Skydiving with Zach, was by far, on of the best experiences of my life.  I would do it 10,000 more times if I could!!  Skydiving over the Gulf of Mexico was breathtaking and landing on one of my favorite places, the beach, was awesome!!  If you have ever thought about skydiving, don’t hesitate!  I’m so glad I did and my first time was with Skydive The Gulf!  Everyone there is phenomenal!", "pics": null, "resp": {"time": 1572834565068, "text": "Thank you so much Heather you were a blast to jump with!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "109358385282388009213", "name": "Austin Fick", "time": 1601156924460, "rating": 5.0, "text": "Great staff all around. Very nice and fully recommend", "pics": null, "resp": {"time": 1601939620589, "text": "Thank you Austin!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112644891026183778527", "name": "Katherine Taylor", "time": 1617566922510, "rating": 5.0, "text": "The best thing ever!!", "pics": null, "resp": {"time": 1617891494192, "text": "We would have to agree Kathrine! Thank you for jumping with us!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "107960153970869241281", "name": "Brandon Walker", "time": 1599248199822, "rating": 5.0, "text": "Unreal experience!! My father and I shared an experience together that I’ll never forget! Thanks, Dad and thank you to the staff for being so friendly and making this experience epic!! 🤘🏼", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "102313911326050796135", "name": "Ciera Lynn", "time": 1599416363420, "rating": 5.0, "text": "This was my second skydive and this place was amazing! Such great staff and very professional!", "pics": null, "resp": {"time": 1599972495069, "text": "We will see you again soon!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "115600483495625528986", "name": "Hayes Hatfield", "time": 1596943302426, "rating": 5.0, "text": "The staff was very knowledgeable and fun! Easy-going staff and helpful. Definitely plan on going again!!", "pics": null, "resp": {"time": 1597802725231, "text": "Woohoo can't wait to jump with you again!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104883688720263429817", "name": "Margaret Luter", "time": 1606592218819, "rating": 5.0, "text": "Awesome people and great views! Will definitely be back!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "105638853068339009295", "name": "Devon Boykin", "time": 1596147011740, "rating": 5.0, "text": "Amazing experience! Everyone should try it once. Staff is great at calming nerves and ensuring you have an amazing time!", "pics": null, "resp": {"time": 1597802775190, "text": "Thank you Devon!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "101861800138415566230", "name": "Carolyn Phoenix", "time": 1591299405741, "rating": 5.0, "text": "They helped me through my first jump and made it something I'll never forget! They explain everything and make sure you understand the skydiving process before you begin. Totally worth skydiving with Skydive The Gulf!!! Awesome people and awesome experience!", "pics": null, "resp": {"time": 1592510823926, "text": "Thank you Carolyn so glad you had a great time!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "115381750282961899471", "name": "Ryan Glossop (Ryan G.)", "time": 1592597341883, "rating": 5.0, "text": "Tandom skydiving, was pretty sweet. The freefall was exhilarating. The only downside was there was no ear protection in the airplane, which would have been nice.\nAlso, the photos for the trip are like and extra hundred dollars, which is a bit much...having an option for just a few photos, rather than the full edited video and everything would be nice.", "pics": null, "resp": {"time": 1593704709775, "text": "Thanks so much for coming out and jumping with us. The Picture Package is 79.00 for 150 HD photos. We are sorry that this was an issue. we are glad you had a great time jumping with us! Hope to see you again."}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116010956251550118844", "name": "Seth G", "time": 1598549547468, "rating": 5.0, "text": "If you’re looking to have a fun time skydiving with awesome professionals come to skydive the gulf! Second jump was here and it was a blast!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "109995459849270199255", "name": "Emily Daughenbaugh", "time": 1606497921274, "rating": 5.0, "text": "The team was amazing and made you feel very comfortable.", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "106040798061440035294", "name": "Louisa", "time": 1599175945378, "rating": 5.0, "text": "Absolutely incredible!! So much fun and the crew is amazing. Can’t recommend enough!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "101785552150697589655", "name": "Chet Cantrell", "time": 1598627865999, "rating": 5.0, "text": "Awesome awesome!! Amazing staff and Charles was great to jump with!! Really made everything feel comfortable and fun!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "105202592112007397722", "name": "Brittany Kennedy", "time": 1618170401808, "rating": 5.0, "text": "Great first experience!! Highly recommend!!!", "pics": null, "resp": {"time": 1618576433693, "text": "Thanks for jumping with us Brittany!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "105228960783453656181", "name": "Jeremy Lewis", "time": 1597442269381, "rating": 5.0, "text": "Went today and it was a blast Luke and Charles are amazing along with everyone else there. So ready to go again", "pics": null, "resp": {"time": 1597802386929, "text": "Thank you for jumping with us Jeremy!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "109770189105905181356", "name": "Floyd Vanderver", "time": 1594332800445, "rating": 5.0, "text": "Awesome jump! Felt very comfortable. Experienced staff made the trip worthwhile!\nHighly recommend!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104467270033588239334", "name": "Shelby K", "time": 1579475913332, "rating": 5.0, "text": "This was my first skydive experience and it was definitely one of the most memorable moments of my life. The staff was super friendly and very experienced! They made me feel safe. All around a fun experience! Thank you", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104257182800514791270", "name": "austin crawford", "time": 1598549418188, "rating": 5.0, "text": "Awesome jump for my first time jumping staff is friendly and awesome go there!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "105202592112007397722", "name": "Brittany Kennedy", "time": 1618170401808, "rating": 5.0, "text": "Great first experience!! Highly recommend!!!", "pics": null, "resp": {"time": 1618576433693, "text": "Thanks for jumping with us Brittany!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112359832507561944280", "name": "Christopher Raye", "time": 1599171774119, "rating": 5.0, "text": "It was amazing and very smooth! The people were very nice and they were extremely knowledgeable!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "115381750282961899471", "name": "Ryan Glossop (Ryan G.)", "time": 1592597341883, "rating": 5.0, "text": "Tandom skydiving, was pretty sweet. The freefall was exhilarating. The only downside was there was no ear protection in the airplane, which would have been nice.\nAlso, the photos for the trip are like and extra hundred dollars, which is a bit much...having an option for just a few photos, rather than the full edited video and everything would be nice.", "pics": null, "resp": {"time": 1593704709775, "text": "Thanks so much for coming out and jumping with us. The Picture Package is 79.00 for 150 HD photos. We are sorry that this was an issue. we are glad you had a great time jumping with us! Hope to see you again."}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "108551509735849612994", "name": "Skydiving Trucker", "time": 1555278689941, "rating": 5.0, "text": "Totally awesome experience! This was my 2nd time ever jumping and it was just as awesome as the first! I’ll be back! Thanks y’all!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP3ZAyXDXSDwTnfwyofAg25KiChMYaAupJqpV6p=w150-h150-k-no-p"]}], "resp": {"time": 1555390631497, "text": "Thank you John! see you soon!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "114243318741924079782", "name": "ilah thomas", "time": 1596980439670, "rating": 5.0, "text": "Great staff and such a wild experience! My first jump and they made it so much fun.", "pics": null, "resp": {"time": 1597802477992, "text": "Thank you for jumping with us! Come back and see. us again."}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "118347129380548042996", "name": "Robyn Borelli", "time": 1596399924444, "rating": 5.0, "text": "Great place to skydive. Awesome crew. Makes you feel at ease.", "pics": null, "resp": {"time": 1597802514805, "text": "Thank you Robyn! Hope to see you again!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "118085932310685196623", "name": "Zia Oatley", "time": 1588550830270, "rating": 5.0, "text": "I thoroughly enjoyed my first sky dive today. Charles was a wonderful tandem instructor and camera man to document my adventure! Thanks!", "pics": null, "resp": {"time": 1592511459729, "text": "Thank you Zia!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "100393027984334130096", "name": "Samuel Sanning", "time": 1601753883872, "rating": 5.0, "text": "Charles and Luke are awesome! Great views and a great jump!", "pics": null, "resp": {"time": 1601939453897, "text": "Thank you Samuel!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117449310795280962143", "name": "Brandon Jackson", "time": 1593211391724, "rating": 5.0, "text": "My experience was every bit of amazing! I was terrified but the staff and the instructors were amazing! I will definitely do it again", "pics": null, "resp": {"time": 1593704401258, "text": "Thanks for coming out Brandon, see you again soon!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "111700937292684748342", "name": "Esdraelon", "time": 1522219111847, "rating": 5.0, "text": "I'd wanted to skydive for years and finally took the plunge on March 13th!  It was the most amazing experience of my life and I plan to become certified to solo as soon as I can.  The folks at SkyDive the Gulf are a fun, professional bunch who love what they do and they made it EASY!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP9viGdT1PeFAdjadQf1rY8Qe9Vrjh5PpwNMHUO=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104297495390316793989", "name": "John Smith", "time": 1583002161334, "rating": 5.0, "text": "The best experience I have ever had!  The crew was super friendly and knowledgeable! I 100% recommend doing this with skydive the gulf!  I will definitely be back!  Luke was awesome!", "pics": null, "resp": {"time": 1592511663117, "text": "Come see us again!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "106614268449504579878", "name": "M G", "time": 1593274819161, "rating": 5.0, "text": "Came with my brother. It was amazing. He's hooked. We'll definitely be back.", "pics": null, "resp": {"time": 1593704147309, "text": "Thanks for jumping with us Mark!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104847946112111671842", "name": "Alison McCormack", "time": 1598210330375, "rating": 5.0, "text": "This place was awesome! Will definitely be back if in the area!", "pics": null, "resp": {"time": 1598278746334, "text": "Thanks for coming out Alison!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103177452572167629141", "name": "Megan Reynolds", "time": 1596425337342, "rating": 5.0, "text": "Super chill staff. I just came by myself spontaneously and had a great time", "pics": null, "resp": {"time": 1597802601775, "text": "We are so glad you Madde that decision!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "110462495261115898499", "name": "JE Thomas", "time": 1566350306772, "rating": 5.0, "text": "I just had the most amazing experience of my life. Skydiving has always been on the list of things to do... I'm so glad I went with SKYDIVE THE GULF. Everyone was so nice and professional. Thanks again to Lee, Luke, and Colin for starting my birthday off right with a great beach landing.", "pics": null, "resp": {"time": 1566429554112, "text": "Thanks for sharing your birthday with us!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "102032878271302332996", "name": "dylan mcfarland", "time": 1589046021488, "rating": 5.0, "text": "Amazing experience! The staff is very friendly and very experienced. I highly recommend this company and people", "pics": null, "resp": {"time": 1592511499372, "text": "We are so glad you chose us for your tandem skydive."}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "106341119875181863495", "name": "Pamela Maloney", "time": 1599172277154, "rating": 5.0, "text": "It was a birthday present for myself, and it was beyond amazing!!! I’m going every year on my birthday from now on!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117241111450323451265", "name": "Allison Haywood", "time": 1596996901652, "rating": 5.0, "text": "Breathtaking experience! The whole staff is so nice and welcoming.", "pics": null, "resp": {"time": 1597802427019, "text": "Thank you Allison!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116164310201087193922", "name": "Liz Shin", "time": 1566762619707, "rating": 5.0, "text": "Best experience ever! 10/10 recommend. I was super nervous but Jay and the whole crew made me feel super safe and comfortable. The whole experience was worth everything. Thank you guys for a great day!", "pics": null, "resp": {"time": 1566994289761, "text": "Thank you for coming out Liz!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112595570524064119856", "name": "Christopher Hall", "time": 1569719922140, "rating": 5.0, "text": "First time jump today. Did the morning beach skydive & it was amazing! Everyone was friendly & professional and Cory is an awesome instructor. Don’t forget to get the media package - it’s worth it. Will definitely have to come back again!", "pics": null, "resp": {"time": 1571228494041, "text": "Thank you Christopher! See you next time!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "105821952779339480505", "name": "Robbie Gates", "time": 1601144182421, "rating": 5.0, "text": "Wow!!!!! These guys are amazing!! Everyone was so nice, and this is by far the coolest thing I’ve ever done in my life!!! 13/10 recommend!!! Go see them!!!!!", "pics": null, "resp": {"time": 1601939604273, "text": "We agree it sure is the coolest thing ever!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112943182348759242812", "name": "Brandon Dunn", "time": 1592868126878, "rating": 5.0, "text": "Don't normally leave reviews, but this was a experience of a life time. Couldn't imagine a more awesome place to skydive. The view is amazing. Then to skydive into the Flora-bama.....what else could you ask for. Now for the instructors, they were just as amazing. Granted I was nervous since it was my first time to jump, but my girlfriend literally almost had a panic attack. I was scared she wasn't going to jump and regret it forever. BUT her instructor (sorry I forgot his name , sort of had other things on my mind when we were introduced,LOL) he was top notch with her. He talked to her and re insured her even did breathing exercises with her. Built her confidence up and she was sooo proud that she did it. These guys get 5 plus stars!. Thanks again guys.", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "105235750111365637612", "name": "Kimberly Doyle", "time": 1590174270821, "rating": 5.0, "text": "The biggest, best birthday ever! Great instructors and friendly employees. If you ever thought you'd wanna go, do it!", "pics": null, "resp": {"time": 1592510999200, "text": "Thanks for coming out Kimberly!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104187165917944466536", "name": "Steven Speckmann", "time": 1599166973563, "rating": 5.0, "text": "Amazing experience and walked us through everything. Didn’t have to ask any questions at all!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "109012484132151083321", "name": "EJ X", "time": 1592173701224, "rating": 5.0, "text": "Awesome experience! I’m still Speechless!!! “Go head & knock it off your bucket list” 😎 #yolo.\n\nComing back in two weeks for a couples jump 🤞🏾🤴🏾👸🏽❣️", "pics": null, "resp": {"time": 1592510028521, "text": "NICE! Cant wait to see you again."}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "118074352193844212575", "name": "Shane Burns", "time": 1562356651527, "rating": 5.0, "text": "Awesome experience! Everyone was helpful and informative with questions. Would definitely do it again. Fantastic view of the coast too! Definitely worth the experience if you’re on vacation, or just need a thrill. Highly recommend!", "pics": null, "resp": {"time": 1563070219865, "text": "Thank you Shane!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "110928030606358022256", "name": "Travis Walker", "time": 1564526903880, "rating": 5.0, "text": "My first time. Indescribable experience of pure awesomeness!!! This will be a new addiction for me. Super nice and helpful people here all the way around. Lee was my instructor and he was a super cool cat! Made me feel right at home. Freakin' Rad! Thank you, Skydive the Gulf you guys rock!!!", "pics": null, "resp": {"time": 1564625008068, "text": "Thank you so much Travis we appreciate it!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117113147483710771276", "name": "Shari Sahli", "time": 1589575189259, "rating": 5.0, "text": "Had a fantastic time, really appreciated the great customer service.  Definitely be back.  Thanks Charles !!  Chris", "pics": null, "resp": {"time": 1592511570652, "text": "Thank you Shari"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "110765549888962463175", "name": "Lisa Weaver", "time": 1599167054394, "rating": 5.0, "text": "Awesome experience for someone who doesn’t like heights.", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112415134651184314944", "name": "Dalton Campbell", "time": 1569769651637, "rating": 5.0, "text": "The team here is amazing!!! My first jump and couldn’t be happier I chose Sky Dive the Gulf. If it’s going to be your first jump definitely get the beach landing! Everyone is super nice and are very clear on the instructions on what you need to do.", "pics": null, "resp": {"time": 1571228576135, "text": "Thank you Dalton! Beach jumps!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117954981455925574835", "name": "Egghead Media", "time": 1588543120598, "rating": 5.0, "text": "Yo this place right here is amazing very easy and fun very personal and they make you feel very comfortable very nice staff and very cool plane ride and the jump landing on the beach was breathtaking that k you for making my surprise for my girlfriend memorable.", "pics": null, "resp": {"time": 1592511416539, "text": "Thank you for coming out."}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "109369372626584093085", "name": "Melissa Renaud", "time": 1569946934617, "rating": 5.0, "text": "Amazing drop zone! The owners and the Staff are incredible. Everyone is so friendly. If you are looking for the best skydive experience of your life this place is it! Go Jump with them, I Highly recommend this Drop Zone!!!", "pics": null, "resp": {"time": 1571228628823, "text": "Thank you Melissa!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112385570627401981722", "name": "Matthew Fogle", "time": 1592585146818, "rating": 5.0, "text": "Awesome first experience. A lot of fun, chill place. 10/10", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "107915883275436943092", "name": "RIchard Phillips", "time": 1615132499847, "rating": 5.0, "text": "Great staff and experience of a lifetime!!!", "pics": null, "resp": {"time": 1617891659317, "text": "Thank you Richard!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "110297650044758013366", "name": "Don Taylor", "time": 1567437112295, "rating": 5.0, "text": "The jumper was Bill Davidson:\n“Today was a fantastic experience. I had 292 static line jumps, but this was my first deliberate freefall. Jump number 293. Lee was my tandem instructor and he was great. He let me pull the ripcord and let me drive halfway down. I highly recommend it for anybody. It’s awesome.  The whole operation was fantastic from check in, training, and suiting up. The pilot was great and Lee, the instructor, was fantastic! Everybody needs to come and jump with them!”", "pics": null, "resp": {"time": 1567733449619, "text": "Thank you so much for coming! Lee had a great time jumping with you."}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104091772240608496816", "name": "Sarabeth Uriz", "time": 1556378498333, "rating": 5.0, "text": "Everyone there is so friendly. They really make you feel welcome. The jump was amazing. I just wish the skydive lasted longer!! Overall an excellent experience. They will even edit your picture/video package right after if you're willing to wait about 15 minutes!", "pics": null, "resp": {"time": 1556415661034, "text": "Thank you so much for choosing us to jump with! We are so happy you were able to get your Video and pictures when you left."}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "111476987240758467048", "name": "Julie Calo", "time": 1581218996646, "rating": 5.0, "text": "This was a surprise gift for my 54th birthday!\nIt was the most amazing experience of my life!\nFrom the moment we arrived the guys made me feel super comfortable!\nI was more excited than scared!\nKelly was my tandem guy, he couldn’t have been more amazing!\nHe instructed and guided me and made this the best adventure ever!!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "115344435909272648095", "name": "Haley Green", "time": 1589652010474, "rating": 5.0, "text": "I was scared for 3 days FOR NO REASON. The only unfortunate thing that happened was I lost my hair tie. Everyone was great, the dog was great. The jump was great. Ahhh so worth it.", "pics": null, "resp": {"time": 1592510966499, "text": "Thanks Haley! The pups say thank you!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "105109799243650486030", "name": "Chelsy Oubre", "time": 1554155139642, "rating": 5.0, "text": "The jump and the whole experience was amazing! Everyone from booking with Mr. Jake & signing in with Ms. Brooke. It was my first time jumping & I was able to jump with another first time jumper. The pilot Lee flew us up and over some good views. It was a smooth ride. My jumping buddy was Luke he was wonderful, he made me feel comfortable & safe! The jump was fantastic as well. It was very fast but it was so beautiful. Not hard at all if you listen to all the instructions given. I would jump with these guys again!", "pics": null, "resp": {"time": 1554779056205, "text": "Thank you Chelsy! You rocked it!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "110311123089949978874", "name": "Hang Ten Helicopters", "time": 1558445075191, "rating": 5.0, "text": "By far the best experience you’ll get in the area! Drive up, hop in and jump out! These guys make you feel welcome, safe and ensure you enjoy every second of your plummet to earth. Smooth landings always and nothing but smiles to last a lifetime! Highly recommend! Thanks again for my birthday jump! ❤️", "pics": null, "resp": {"time": 1559235011209, "text": "We will see you again next year!!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "102760974537173892047", "name": "Sarah Caylor", "time": 1568561560938, "rating": 5.0, "text": "Loved this!!! I would absolutely go with these guys again. They were extremely professional and knowledgeable and made my first jump an incredible experience. Such an awesome rush.  Can’t wait to do it again!", "pics": null, "resp": {"time": 1571228754022, "text": "Thank you Sarah see you next time!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "106664690872452980450", "name": "Hunter Stewart", "time": 1568765754230, "rating": 5.0, "text": "First time jumping and it was an EPIC experience! The instructors were very friendly and helpful. Got the proposal package and everything was done very nicely. Get the pictures and videos you won’t regret it! Definitely coming back again.", "pics": null, "resp": {"time": 1571228801068, "text": "Thank you Hunter for spending your special day with us!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "106157607284436299650", "name": "Josiah Mckee", "time": 1592684935810, "rating": 5.0, "text": "Had a wonderful time! I would recommend anyone to go visit them!", "pics": null, "resp": {"time": 1593704295064, "text": "Thanks fir coming out Josiah!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103992523075900984324", "name": "Brenda Morrell", "time": 1578327524931, "rating": 5.0, "text": "Unbelievable!! Best experience I have ever had! So worth it, and the instructors made everything so comfortable and easy. Would do it again in a heartbeat!", "pics": null, "resp": {"time": 1578777629933, "text": "Thank you for coming out Brenda!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117356379550475919184", "name": "Hannah Grant", "time": 1592507147793, "rating": 5.0, "text": "Greatest experience ever! Awesome vibe, awesome people, amazing jump.", "pics": null, "resp": {"time": 1592509529118, "text": "Thank you so much for coming out to jump with us!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "113802020522883939725", "name": "Scott Mikles", "time": 1559659172641, "rating": 5.0, "text": "I did my first jump with Skydive The Gulf and couldn't have been more pleased with the overall experience. Felt very comfortable and confident going up with this group. I highly recommend them. Such a chill, kind group of people. My type of people. Go jump with them.", "pics": null, "resp": {"time": 1559741474629, "text": "Thank you scott!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "108551509735849612994", "name": "Skydiving Trucker", "time": 1555278689941, "rating": 5.0, "text": "Totally awesome experience! This was my 2nd time ever jumping and it was just as awesome as the first! I’ll be back! Thanks y’all!!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP3ZAyXDXSDwTnfwyofAg25KiChMYaAupJqpV6p=w150-h150-k-no-p"]}], "resp": {"time": 1555390631497, "text": "Thank you John! see you soon!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "107207988756990734074", "name": "DFlannery2", "time": 1582646811339, "rating": 5.0, "text": "Biggest rush I’ve ever had in my life. You will never know how it feels until you do it. Great experience with skydive the gulf. Crew was awesome!! Facility is super cool. You get great views on the way up and on the way down. Great way to enjoy a vacation. Highly recommend skydive the gulf for your next adrenaline experience!!", "pics": null, "resp": {"time": 1592515852823, "text": "Thank you for the awesome feedback. We are so glad you chose us to jump with!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117666589500305266405", "name": "Jordan Rexroat", "time": 1571162306592, "rating": 5.0, "text": "This was my first jump and it was incredible. I highly recommend skydive the gulf and doing the beach jump. Be sure to get the video if its your 1st time! All of the staff was amazing and we will definitely be going back!", "pics": null, "resp": {"time": 1571228306555, "text": "Thank you Jordan! We love beach jumps!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "113212215771547427270", "name": "Susan Godwin", "time": 1601303363398, "rating": 5.0, "text": "Staff was amazing, great experience! Thank you guys.", "pics": null, "resp": {"time": 1601939628801, "text": "Thank you!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "107134247899065711381", "name": "Al Biland", "time": 1617567804698, "rating": 5.0, "text": "Awesome experience!", "pics": null, "resp": {"time": 1617891473302, "text": "Thank you for jumping with us Al!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "106738337967012375585", "name": "Ashley Wilson", "time": 1620405563647, "rating": 5.0, "text": "Amazing experience, do it !!!", "pics": null, "resp": {"time": 1621180697025, "text": "We agree! hank you Ashley!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "108875345961331868420", "name": "Kyle Gagnon", "time": 1596298221261, "rating": 5.0, "text": "Experience of a lifetime, I can’t wait to come back. Luke & Charles were very knowledgeable & professional as it gets, you won’t experience anything better elsewhere!", "pics": null, "resp": {"time": 1597802883959, "text": "Thank you so much Kyle!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112518097507731758323", "name": "Bonnie Tarr", "time": 1594570269804, "rating": 5.0, "text": "The. Eat SkyDive place we have been to so far! Awesome experience!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "105493447186293727267", "name": "EmeraldLife", "time": 1592676212345, "rating": 5.0, "text": "Extremely supportive staff, possible experience! Recommend everyone try!", "pics": null, "resp": {"time": 1593704833302, "text": "Thank you!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104285305322010857848", "name": "Colin Clendenin", "time": 1591299419453, "rating": 5.0, "text": "First time ever sky diving and I was beyond impressed with the experience great views and great people!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117110464033082979542", "name": "Matt Wettengel", "time": 1533220276409, "rating": 5.0, "text": "Totally loved jumping for my first time with this crew! They made sure our group had a good time, even those of us who didn’t jump, and the photos and videos of our experience are amazing! Keep up the good work, team!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPtPGxR6JDiPyruev-Gt7LCCor9Cha9DC_IEMDw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP0xdF8TQOabYceys0rIejq9diJJm8zxFXWf7Mm=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "111474715730140544083", "name": "Charity Crutchfield", "time": 1596143654641, "rating": 5.0, "text": "Bests experience i’ve ever done! would recommend to anyone!", "pics": null, "resp": {"time": 1597802750177, "text": "Thank you for coming out Charity!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "107971351709494949500", "name": "Logan Rexroat", "time": 1571159562742, "rating": 5.0, "text": "Most incredible ride I've ever been on. The staff is very down to earth and humble. They will take good care of you...there is nothing to be afraid of.", "pics": null, "resp": {"time": 1571228322182, "text": "Thanks Logan!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104285305322010857848", "name": "Colin Clendenin", "time": 1591299419453, "rating": 5.0, "text": "First time ever sky diving and I was beyond impressed with the experience great views and great people!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "115151252069530618842", "name": "Austin Deets", "time": 1579986360936, "rating": 5.0, "text": "Amazing jump! Super friendly staff. Its definitely worth it!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "107971351709494949500", "name": "Logan Rexroat", "time": 1571159562742, "rating": 5.0, "text": "Most incredible ride I've ever been on. The staff is very down to earth and humble. They will take good care of you...there is nothing to be afraid of.", "pics": null, "resp": {"time": 1571228322182, "text": "Thanks Logan!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "107800213115549799795", "name": "Keshia Pettway", "time": 1562345142778, "rating": 5.0, "text": "ABSOLUTELY PHENOMENAL! ONE OF THE BEST EXPERIENCE I'VE EVER HAD! THE STAFF WERE EXTREMELY FRIENDLY, AND MADE THIS ENTIRE EXPERIENCE FEEL SO CONFIDENT. FROM BEGINNING TO END, EVERY ASPECT OF THIS ADVENTURE WAS AN ABSOLUTE PLEASURE! I WILL DEFINITELY BE MAKING THIS A YEARLY ADVENTURE OF MINE!! THE RUSH, THE VIEW, THE LANDING ON THE BEACH IS JUST UNEXPLAINABLE! IT'S A MUST THAT EVERYONE TRY THIS AT LEAST ONCE I'M THEIR LIFE!", "pics": null, "resp": {"time": 1563070336683, "text": "Thank you so much Keshia!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "106738337967012375585", "name": "Ashley Wilson", "time": 1620405563647, "rating": 5.0, "text": "Amazing experience, do it !!!", "pics": null, "resp": {"time": 1621180697025, "text": "We agree! hank you Ashley!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "105493447186293727267", "name": "EmeraldLife", "time": 1592676212345, "rating": 5.0, "text": "Extremely supportive staff, possible experience! Recommend everyone try!", "pics": null, "resp": {"time": 1593704833302, "text": "Thank you!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "108875345961331868420", "name": "Kyle Gagnon", "time": 1596298221261, "rating": 5.0, "text": "Experience of a lifetime, I can’t wait to come back. Luke & Charles were very knowledgeable & professional as it gets, you won’t experience anything better elsewhere!", "pics": null, "resp": {"time": 1597802883959, "text": "Thank you so much Kyle!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103865708530754858117", "name": "Jordan Trias", "time": 1571163869103, "rating": 5.0, "text": "Such a great time, even better the second time! Thank you so much for the jump and the great views! I had an absolute blast. Highly recommend!", "pics": null, "resp": {"time": 1571228274996, "text": "Thanks for coming out Jordan!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "106618196457462019049", "name": "Steven Gilbreath", "time": 1595796546475, "rating": 5.0, "text": "Good people, great time. So badass.", "pics": null, "resp": {"time": 1596131129439, "text": "Thank you!!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "115298980888359760847", "name": "Liz Holland", "time": 1582394612764, "rating": 5.0, "text": "They were amazing and so friendly!! Best place around and a wonderful skydiving experience. You won’t regret it! Go for it!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "115974313570678865098", "name": "Vanessa Kaibigan", "time": 1579986033439, "rating": 5.0, "text": "Such an amazing experience. The staff is amazing. Definitely something I want to do again. :)", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104888444846698045959", "name": "Matt Norton", "time": 1561345010031, "rating": 5.0, "text": "Loved my experience at skydive the gulf!! Wonderful people. I did my 3rd skydive here. I am heading to skydiving classes very soon! Thanks again guys!! !!Highly recommend skydive the gulf!! Thanks again Lee I had a blast!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOaJsB-D9aKg_DCGa7vhyegHBX2asfEnmpJeBBc=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNmvxN5-gUHlj4Q6vabAyrF531uH75WRR22pl1A=w150-h150-k-no-p"]}], "resp": {"time": 1563070693839, "text": "We love Lee! Thank you for coming to jump with us! Keep in touch when you get licensed!\n~Blue Skies"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "113337227234877721833", "name": "tommy agnew", "time": 1604167520688, "rating": 5.0, "text": "Wonderful staff!!  Great experience!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "115705311920369567527", "name": "Billy Sahli", "time": 1589575031735, "rating": 5.0, "text": "Best jump out of 4.  Luke and the entire staff were great!!", "pics": null, "resp": {"time": 1592511513738, "text": "Thank you Billy!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116534363295069764161", "name": "Sandra Middleton", "time": 1576614978523, "rating": 5.0, "text": "Lee and Kelly made this terrifying adventure perfect...They took all my fears away and made it an AWESOME experience..I honestly can't wait to do it again..There is no doubt I will be going back to Skydive the Gulf . THANK YOU GUYS FOR MAKING MY 50TH THE BEST!!!!", "pics": null, "resp": {"time": 1578777696403, "text": "Thank you for sharing your special day with us!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103059803187644103368", "name": "carly helm", "time": 1551570760024, "rating": 5.0, "text": "Greatest moment of my life!! The jump was amazing!! Lee, my jumper buddy made every go as smoothly as possible and made my experience something I'll never forget!! If you're looking to jump out of a plane, please do it with these guys. You wont regret it!", "pics": null, "resp": {"time": 1553526116667, "text": "We love Lee , Thank you for choosing us. See you again soon."}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "106902490939856390340", "name": "Heather Mason", "time": 1594491732661, "rating": 5.0, "text": "The staff is amazing....including the four legged ones !!!!! This is going to turn into an addiction , I can tell already!!!💜💜💜💜", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104261655753017941979", "name": "Jerry Jones", "time": 1596992805796, "rating": 5.0, "text": "Amazing staff! Great experience!", "pics": null, "resp": {"time": 1597802436040, "text": "Thank you Jerry!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "110931133946440348705", "name": "Hannah Davis", "time": 1563299789282, "rating": 5.0, "text": "Absolutely LOVED my experience!! The entire staff was awesome and made me feel comfortable the whole time. I would definitely do it again! Great place to skydive for my first time!", "pics": null, "resp": {"time": 1563887958039, "text": "hank you for trusting us Hannah! hope to see you again!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116245172340467556770", "name": "Edwina Smith", "time": 1596147456163, "rating": 5.0, "text": "Had an amazing time. Luke was amazing instructor!", "pics": null, "resp": {"time": 1597802804427, "text": "He sure is a great instructor! Thank you for coming out!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "106737560100422909907", "name": "Linda Sank", "time": 1554325954258, "rating": 5.0, "text": "My daughter and I have been wanting to go sky diving for a long time. While vacationing at Fort Morgan, AL we had the perfect opportunity. The staff was extremely courteous and thorough in their instructions.  We jumped and had the time of our life.  I would highly recommend this group for an exciting adventure.\nDonald C. From Louisiana", "pics": null, "resp": {"time": 1554778982327, "text": "Thank you so much, we had a blast with you guys!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "105035732545721932559", "name": "H Garcia", "time": 1561242901043, "rating": 5.0, "text": "I am so impressed with my experience here start to finish. The entire staff was amazing and made me feel oddly comfortable about the fact that I was about to skydive for the first time. This was the best possible skydive I could have asked for. Highly recommend.", "pics": null, "resp": {"time": 1563070625169, "text": "Thank you so much for coming out!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103805846291589375225", "name": "Amber Ryals", "time": 1589587549134, "rating": 5.0, "text": "First time to ever skydive and the crew was amazing!! Will definitely be back to do it again!!", "pics": null, "resp": {"time": 1592511628455, "text": "See you again soon!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112137610103285897375", "name": "Melissa Buller", "time": 1572205881290, "rating": 5.0, "text": "Brooke, Luke, and staff were amazing!! They were very professional and made it an experience I will never forget!! Thank you for the most fun Ive ever had!!", "pics": null, "resp": {"time": 1572834536727, "text": "Thanks for spending time with us Missy! See you in the Virgin Islands!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116118418925148679797", "name": "Will Keyes", "time": 1572819905157, "rating": 5.0, "text": "One of the greatest experiences ever! They made us feel comfortable and safe! Highly recommend trying it at least once.", "pics": null, "resp": {"time": 1572831910418, "text": "Thank you for choosing us Will!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112580553752083351775", "name": "Amy Cuny", "time": 1564786945339, "rating": 5.0, "text": "Awesome! Lee was amazing and Luke was so great diving with my daughter, Kelsey! Best adrenaline rush ever! Celebrated 50th birthday with a sky dive. Best gift ever! I will be back to do it again!", "pics": null, "resp": {"time": 1566430016137, "text": "Thanks for coming out Amy!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "110612343614271205600", "name": "Tiffany Hamlin", "time": 1588519529849, "rating": 5.0, "text": "So grateful to these folks, whole crew was amazing!  Changing lives one jump at a time!👏👏🤙", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM07Lo6e5xNmIaNlVFX0s4zdocn2kubMbDWNtm_=w150-h150-k-no-p"]}], "resp": {"time": 1592511391776, "text": "Thats right because of you we get to do what we love!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "118056770886889846066", "name": "Troy Holland", "time": 1590256600998, "rating": 5.0, "text": "Amazing experience. Extremely professional and fun staff", "pics": null, "resp": {"time": 1592510849555, "text": "Thank you Troy"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "115814387434677608726", "name": "Shannon Parnell", "time": 1584221597573, "rating": 5.0, "text": "That was the experience of a lifetime!! This is a must do! These guys are great! Special thanks to Luke you guys are awsome!", "pics": null, "resp": {"time": 1592511696614, "text": "Thank you we love Luke!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "109491803522654310215", "name": "Brandi Wilson", "time": 1582394598234, "rating": 5.0, "text": "Excellent Experience! Excellent Staff, made the first experience a piece of cake..... Definitely recommend to anyone!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "115818461132152748324", "name": "Jessica McCrory", "time": 1580071015206, "rating": 5.0, "text": "Got to go see Lee! Great experience! Got us hooked. We’re ready to go again... life changing experience!", "pics": null, "resp": {"time": 1592515978785, "text": "Thank you Jessica!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112615682257398512462", "name": "Cory Maples", "time": 1569945672202, "rating": 5.0, "text": "Most professional and experienced staff and best views to make a skydive! If your gonna jump, do it here! Beach landings are about as soft as you can get!", "pics": null, "resp": {"time": 1571228609736, "text": "Thanks Cory!! Your awesome!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "111347066403909222871", "name": "bailey rice", "time": 1591983675049, "rating": 5.0, "text": "Amazing experience! The people are great and the jump was incredible", "pics": null, "resp": {"time": 1592510256402, "text": "Thanks for coming out Bailey your family was such a fun group!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "114604746737194858969", "name": "Amanda Perrydore", "time": 1604771943077, "rating": 5.0, "text": "Coolest experience of my life!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "114550438108198705232", "name": "Sadie Campman", "time": 1563414133842, "rating": 5.0, "text": "Luke and the crew were amazing! This was my second tandem jump so he offered to let me pull the chute (although he ended having to since I couldn’t find it). I got my pictures and video and they are so great and perfectly capture how fun of a jump it was over the beautiful ocean.", "pics": null, "resp": {"time": 1563888025626, "text": "Thanks for coming out Sadie! Don't worry we have your back!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "100971278146413486172", "name": "B. B.", "time": 1569189556978, "rating": 5.0, "text": "I booked last moment today for today and got in with no problems. The staff is nice and laid back. I enjoyed them. I will be back", "pics": null, "resp": {"time": 1571228823808, "text": "Thank you so much!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "101681814897129615020", "name": "Garret Luke", "time": 1623450972884, "rating": 5.0, "text": "Great experience!!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103220663533310498665", "name": "Christopher Zareefeh", "time": 1581987661581, "rating": 5.0, "text": "Super awesome and great experience.\nI booked two tandem jumps as a proposal package at sunset, all as a surprise for my, now, fiancée.\nThey made sure both, the jumps and the proposal went superbly well, and without her knowing anything about it until she got to the beach.\nThe jump was super.  Lee and kelly, the instructors, made sure that both of us were fully engaged, throughout all phases, the pre-jump, the plane ride, the jump, parachute deployment, controls and maneuvers...\nThe landing was super smooth...\n\nThe photo and video footage was amazing and well put together.  I highly recommend anyone doing a jump to purchase the photo/video package. Not to mention that the processing speed of the photos and videos was amazing, we got them the same day.\n\nAs for the proposal, they made sure everything was prepared, ready and taken care of.  They went out of their way to ensure everything is top notch.\nThank you for all the crew,  lee, Kelly, ally, Kerri, Jacob, Luke and the Pilot( sorry, I’m horrible and I forgot your name), and a few others behind the scenes...more than 8 people worked together to make this proposal happen for us, two people...on a special occasion.\n\nWe do appreciate what y’all have done for us...\n\nI highly recommend those guys for anyone thinking about doing anything fun in the area... You will not be disappointed... guaranteed...\n\nThank you all...", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "111703101688302771931", "name": "Meagan Hawkins", "time": 1557598089480, "rating": 5.0, "text": "Best experience I have ever had. Third time sky diving but this place takes the cake. Excellent staff for an excellent experience. I highly recommend. You won't be disappointed!", "pics": null, "resp": {"time": 1559235203010, "text": "Awesome! Thank you Meagan!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103590270306602030958", "name": "madison petrie", "time": 1590351059194, "rating": 5.0, "text": "Hands down best drop zone! Such polite staff, talented and confident pilot, cute dogs, I love this place.", "pics": null, "resp": {"time": 1592510301370, "text": "Thank you! The pups say Thanks too!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103812246199151751711", "name": "Erica Hines", "time": 1569261409414, "rating": 5.0, "text": "Skydive the gulf is amazing! Mine and my husbands first time skydiving and it was an experience we will never forget! Also amazing staff, fun and very friendly!", "pics": null, "resp": {"time": 1571228417073, "text": "Thanks for choosing us Erica!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116490200482549916318", "name": "James Kimmel", "time": 1592602418088, "rating": 5.0, "text": "very nice staff especially the manifest lady was excellent.", "pics": null, "resp": {"time": 1593704748582, "text": "Thanks James!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112594133857425527384", "name": "Valarie Preston", "time": 1564347824897, "rating": 5.0, "text": "Sky Dive the Gulf is extremely professional!  From the start to the end!  Lee was great and made me feel 100% comfortable for my first sky dive!", "pics": null, "resp": {"time": 1564625229692, "text": "Thank you Valarie, we take pride in keeping our safety our number one priority!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104741603530442559448", "name": "Frank Messe", "time": 1563118725066, "rating": 5.0, "text": "Soooo much fun!! Definitely worth the money! Every one here is so nice and explains everything very well to make you as comfortable as possible. 10/10 would recommend again!", "pics": null, "resp": {"time": 1563888035277, "text": "Thanks Frank!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "101993567707501726527", "name": "Brandon A", "time": 1553020448514, "rating": 5.0, "text": "Was my first time jumping, I absolutely LOVED IT!!! The entire staff is extremely knowledgeable and super cool people. If you've never jumped out of an airplane, I highly recommend it and recommend these guys. They're pros!!", "pics": null, "resp": {"time": 1553525865561, "text": "Thank you Brandon!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "107722988101333684776", "name": "Jazzy Eicher", "time": 1563232572744, "rating": 5.0, "text": "The staff made us feel so comfortable since it was our first jump. We did the sunset jump onto the beach at the Florabama and it was so perfect. HIGHLY RECOMMEND. will definitely be back for another jump!!!", "pics": null, "resp": {"time": 1563887678583, "text": "Thank you for jumping with us! We love ending our days at the beach!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "109631504052109025550", "name": "Nick Green", "time": 1577722305876, "rating": 5.0, "text": "One of the best experiences I have ever had!!! If you are thinking about skydiving, I highly recommend doing it at Skydive The Gulf! Go for the beach landing!!", "pics": null, "resp": {"time": 1578777651362, "text": "We love beach jumps. Thank you for choosing us!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103289812569671588199", "name": "Lindsey McIlwain", "time": 1592503640905, "rating": 5.0, "text": "awesome experience!! they made it so easy and less nerve wracking", "pics": null, "resp": {"time": 1592509565323, "text": "Aww thanks we sure do love what we do!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112652999353490018933", "name": "Jeremy Buisson", "time": 1560798239502, "rating": 5.0, "text": "1st time skydiving and this was the best place for my first jump. Staff was very friendly and knowledgeable.the jumpers was excellent and very friendly.even let you steer the chute on the way down. Will go again with them when ever I'm in that area!", "pics": null, "resp": {"time": 1563070939672, "text": "Thank you Jeremy,See you soon!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "102438079320293627325", "name": "Byron McDougle", "time": 1566579984022, "rating": 5.0, "text": "Small town boy just fell 10,000’ and LOVED IT!  I knew about jump for a few days and was scared to death.  The flight up was no fun, but after that 1st step; THE MOST THRILLING THING EVER!", "pics": null, "resp": {"time": 1566994389165, "text": "Thank you for coming to jump with us Byron!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "110287958284232559209", "name": "Nicole Pitts", "time": 1530462790107, "rating": 5.0, "text": "We had the Best experience with the team at sky dive the gulf. Everyone was professional and full of knowledge making the jump the most amazing experience. Don’t hesitate. Book it now. Have the time of your life. Then book 24 more because our gonna love it!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104100698304298187553", "name": "Timothy Watson", "time": 1561496590823, "rating": 5.0, "text": "I jumped for the first time today, and what an experience!! The staff were friendly and professional and calmed any nerves that I may have had. I highly recommend Skydive the Gulf. 10 out of 10. Thank you for an amazing experience :)", "pics": null, "resp": {"time": 1563070274556, "text": "Thank you Timothy!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116438114519526599879", "name": "Sereena Thomson", "time": 1566149101170, "rating": 5.0, "text": "Best experience of my life!!! The instructors were amazing! Definitely suggest everyone come here to skydive!! I'll be back for sure❤", "pics": null, "resp": {"time": 1566429588725, "text": "Thank you Sereena!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "102200650700051851243", "name": "Emma McManus", "time": 1599433135899, "rating": 5.0, "text": "Friendly staff, can’t wait to jump again!", "pics": null, "resp": {"time": 1599972481161, "text": "Thank you Emma"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117896684714670199376", "name": "John Hendricks", "time": 1568473947911, "rating": 5.0, "text": "Incredible experience with an awesome tandem instructor. Would absolutely recommend, especially for your first time! Diving over and landing on the beach was just icing on the cake.", "pics": null, "resp": {"time": 1571228678637, "text": "For Sure the beach landings are awesome! Come back and see us!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "108895689631239995814", "name": "S O", "time": 1559703601039, "rating": 5.0, "text": "Amazing, super-experienced staff put us at ease during the entire process. Cannot wait to jump again with this crew! The site near the coast is stunningly beautiful from the sky. Awesome people who love what they do, communicate with and instruct customers with great care, and who are so open in sharing the glorious experience that is skydiving.\n— Pat McGinty, Louisiana", "pics": null, "resp": {"time": 1559741442166, "text": "Thank you Pat , we had such a great time jumping with you!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "118080722002625770599", "name": "Ryan Schnieders", "time": 1524699749533, "rating": 5.0, "text": "Hands down the most professional drop zone. I immediately felt welcome and safe. Phenomenal staff, extremely knowledgeable and had a clear goal of making my skydive the most amazing and personal experience. Landing on the beach is the cherry on top! Could not have asked for more. I can't wait to go again.", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103487363412671892737", "name": "Aly Bingham", "time": 1622742649774, "rating": 5.0, "text": "Freaking AMAZING!!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "114865191020076951800", "name": "Tom Sumner", "time": 1581238091351, "rating": 5.0, "text": "Awesome experience.  Great staff and instructors.  Thanks again.", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "107656921981950444048", "name": "Collin Rigby", "time": 1553866611648, "rating": 5.0, "text": "Such wonderful staff and just “Wow” what a wonderful experience. I will defiantly be back; These guys are the definition of professionalism and customer service. Skydive the gulf is the only way to go!", "pics": null, "resp": {"time": 1554779126795, "text": "Thank you! We sure do love our pilot!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "107750501902761163026", "name": "Jennifer K", "time": 1528121273785, "rating": 5.0, "text": "I highly recommend these guys. They are very helpful to first-timers. The ground crew were both very friendly and hilarious. They kept us informed with what was happening and was awesome with our little ones.\nThank you for making Marlon's day. Our family had a blast!!!!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117060345350935812384", "name": "Audie Russell", "time": 1563299733917, "rating": 5.0, "text": "I was a tad nervous about this adventure. But the entire staff was amazing! Super happy that I got to check this one off the bucket list!", "pics": null, "resp": {"time": 1563887848387, "text": "Thanks for choosing us for your Tandem jump!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "110007677556888363152", "name": "Caleb Atwood", "time": 1555369796503, "rating": 5.0, "text": "FIRST TIME SKYDIVING! Luke and Lee were awesome tandem instructors. Bachelor party was a success thanks to their hospitality and expertise! Can’t wait to come back one day!", "pics": null, "resp": {"time": 1555390599863, "text": "Thank you Caleb you guys were a blast!! Congradulations!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "101770879128227298396", "name": "D Darnell", "time": 1536961588139, "rating": 5.0, "text": "All I can say is “just stop thinking about it ...JUMP”!!  Easy place to do business. I called many times nothing but good customer service and very accommodating. Knowledgeable tandem instructor. It was all great.", "pics": null, "resp": {"time": 1537273357188, "text": "Thank you so much!! Come back and see us!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112204283291480280607", "name": "Ashlan Oranje", "time": 1570989015215, "rating": 5.0, "text": "Great experience. Super nice staff! Would definitely recommend and do again!!", "pics": null, "resp": {"time": 1571228344227, "text": "Thank you so much for choosing us Ashlan!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104556603717369571546", "name": "Lindsey Williams", "time": 1539540026608, "rating": 5.0, "text": "We love Skydive the Gulf! Lee and Luke are amazing and make you feel comfortable. Kerri and Brooke are awesome, as well! After 2 jumps with them, I won’t go anywhere else! Working on becoming certified, so I can work with them!", "pics": null, "resp": {"time": 1549850367953, "text": "Thank you for making some jumps with us! Have a great time working on your license!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "118072760087353401894", "name": "Jay Tiniacos", "time": 1562759415803, "rating": 5.0, "text": "Awesomeness.  Will be back again!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPn4779cnwiGfuNy1wVU-vqHphMTQLrjzlYE_9c=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP5zE0HGH5n9RHZ0qdctpBz2lbJlU8hBJmtCXGN=w150-h150-k-no-p"]}], "resp": {"time": 1563069887535, "text": "Thanks for jumping with us Jay!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104978497953332469967", "name": "drahrig", "time": 1589646161973, "rating": 5.0, "text": "Freaking awesome\nAnybody interested DOOOO IT HERE!!", "pics": null, "resp": {"time": 1592510910807, "text": "Thank you, we agree:)"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112532911444685274328", "name": "Angela Meyer", "time": 1562521780006, "rating": 5.0, "text": "I looked for months to find a place where I could skydive and land on the beach. Skydive the Gulf provided an awesome experience during my first tandem skydrive! Super friendly staff, beautiful views, and an incredible memory! I look forward to jumping with their team again in the future!", "pics": null, "resp": {"time": 1563070159718, "text": "Thank you for choosing us!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103423864404150573714", "name": "Trent Morrell", "time": 1578328961876, "rating": 5.0, "text": "Unbelievably the greatest! What an experience!\nThe instructors where the best!", "pics": null, "resp": {"time": 1578777606791, "text": "Thank you Trent!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "102354294658837809725", "name": "Madison Schmaedeke", "time": 1562534259842, "rating": 5.0, "text": "Truly one of the coolest experiences of my life! Absolutely incredible staff, pilot and is instructor - hats off to the whole team for such a cool cross off the bucket list!", "pics": null, "resp": {"time": 1563069952706, "text": "Thank you Madison!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "113453362637881999907", "name": "Sara Allman", "time": 1557523235894, "rating": 5.0, "text": "Such an amazing first skydiving experience!!! The staff were all SUPER and did an AWESOME job in making everything super simple and fun! Definitely Skydive the Gulf with these awesome people!", "pics": null, "resp": {"time": 1559236350581, "text": "Thank you Sara for coming out!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "107255080032630801257", "name": "April Cook", "time": 1528727772390, "rating": 5.0, "text": "What a great experience!  We were set up for a sunset jump on the beach and the weather didn’t permit us. I must say that they watched the weather cell until the very last minute that we may could have jumped.  So we scheduled for first thing the next morning and were not disappointed at all!  All the staff are friendly and knowledgeable. Very professional. Luke was my instructor and explained everything well and made sure I was comfortable with the steps.  The plane ride was easy and comfortable (don’t let the size fool ya.) Kerri and Brooke were waiting for us at the beach and transported us back to the hanger. Lee was the other instructor and was amazing as well. I thoroughly enjoyed my experience and highly recommend them to anyone!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "115366048898366254882", "name": "Tamra Moorman", "time": 1536893801661, "rating": 5.0, "text": "Great  crew told us exactly what would happen! It was amazing and went by super fast! Landing was nothing, so easy... Great pros running this!", "pics": null, "resp": {"time": 1537273309321, "text": "Thank you so muvh Tamra!!! Your awesome!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "114167985931360606390", "name": "Peter Thomas", "time": 1590098798945, "rating": 5.0, "text": "Had a blast, they were all awesome and you’d be a fool not to jump out of their plane!", "pics": null, "resp": {"time": 1592510981684, "text": "Thank you Peter!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116511976678768865342", "name": "Seth Hewerdine", "time": 1595176170736, "rating": 5.0, "text": "Most amazing experience of our lives!", "pics": null, "resp": {"time": 1596131172450, "text": "Thank you Seth, so glad y'all chose us for your tandem skydive!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "107693419988856319317", "name": "Lisa Wadley", "time": 1563561305597, "rating": 5.0, "text": "I had a great time today!  If you’re looking for an awesome activity to get you’re adrenaline flowing, this is a must try adventure.", "pics": null, "resp": {"time": 1563887536540, "text": "Thank you Lisa!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "102797725632122828227", "name": "Bran Theravenman", "time": 1564167351178, "rating": 5.0, "text": "Great staff and great flight! Had an amazing time! They even let me spread my mom's ashes out while we dropped! :)", "pics": null, "resp": {"time": 1564626102565, "text": "Thank you Bran!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "102154432632580623743", "name": "Aubrey Darrough", "time": 1557522971423, "rating": 5.0, "text": "Had a great time today! What a wonderful way to spend a vacation day with your best friend!! The staff was so friendly and helpful :)", "pics": null, "resp": {"time": 1559236374687, "text": "Thank you for jumping with us Aubrey!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116087641922879816637", "name": "Morgan B", "time": 1566762543945, "rating": 5.0, "text": "Best experience ever!!! And the photos/videos were priceless. Already planning our next jump 😁", "pics": null, "resp": {"time": 1566994304662, "text": "Thanks for coming out Morgan!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117677097069129521191", "name": "Meghan Starratt", "time": 1562525537774, "rating": 5.0, "text": "Absolutely the best experience!! The staff was super friendly and helpful!! I can’t wait to come back!!\n10/10 recommend", "pics": null, "resp": {"time": 1563070128404, "text": "Awesome, glad you had a good time! See you next time."}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103314692559911271169", "name": "Todd Crutchfield", "time": 1596143829863, "rating": 5.0, "text": "Most fun I’ve ever had!!", "pics": null, "resp": {"time": 1597802763309, "text": "Same! Come out and jump again!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117356420254347065458", "name": "Elizabeth Eubanks", "time": 1535896660559, "rating": 5.0, "text": "The entire crew at Skydive the Gulf were amazing! Lee was very outgoing, friendly, and thoroughly explained everything so I never felt scared or unprepared. This was one of the best moments of my life and I can’t wait to do it again! Would highly recommend anyone to jump with these guys.", "pics": null, "resp": {"time": 1535943702757, "text": "Thank you Elizabeth! Look forward to seeing you in the sky soon!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116925700669630794102", "name": "Chris Loar", "time": 1560284121217, "rating": 5.0, "text": "Had the BEST experience here for my first-ever skydive!  Lee was wonderful to tandem jump with, and the whole staff was very cool and helpful.  Will be back many more times, for sure!!!", "pics": null, "resp": {"time": 1563070767278, "text": "Thank you for jumping with us"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "118254120590867023507", "name": "Cameron Rice", "time": 1591983685930, "rating": 5.0, "text": "Amazing highly recommend. Luke is the man to go with!!!", "pics": null, "resp": {"time": 1592510276212, "text": "Thank you Cameron. #instafamous"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "101190445461153021853", "name": "David Beard", "time": 1532790738552, "rating": 5.0, "text": "Had an amazing first jump! I jumped with Lee and he made everything just seem so comfortable.  Great friendly staff, no stress atmosphere and just amazing.  I highly recommend and I will be back again.", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116092978739833411567", "name": "Collector Jon", "time": 1563232942827, "rating": 5.0, "text": "Had a great experience for my 1st jump. Great friendly staff. Will definitely be back 2 jump again.", "pics": null, "resp": {"time": 1563887816973, "text": "Cant wait for you to come back!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103014431549425839762", "name": "Stephanie Nematzhonovttu1ywyyw", "time": 1555534951922, "rating": 5.0, "text": "Super friendly and knowledgeable staff. Best birthday experience ever!! Can't wait to come back and do it again", "pics": null, "resp": {"time": 1556416003258, "text": "Thank you for spending your birthday with us!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116215132826336857477", "name": "Crystal", "time": 1558731465719, "rating": 5.0, "text": "Amazing experience and crew! Very professional yet down to earth and fun. Will definitely be back!", "pics": null, "resp": {"time": 1559234954024, "text": "Cant wait to see you again!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "105917198664253702426", "name": "Teresa Ford", "time": 1566315464037, "rating": 5.0, "text": "“Amazing” Breathtaking experience!!!\nBeautiful view that included a rainbow 🌈.\nSo exciting...ready for my next jump with\nSkydive the Gulf.", "pics": null, "resp": {"time": 1566429571338, "text": "Thanks for jumping with us!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104605477037743287644", "name": "Diamayana P", "time": 1558374873074, "rating": 5.0, "text": "First time jumper and it was incredible!! The views at phenomenal and the staff are all so friendly, knowledgeable, and excited with us! Thank you guys so much for an incredible first experience!!", "pics": null, "resp": {"time": 1559235041334, "text": "Thank you for choosing us for your tandem jump Diamond!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "105151052495930196716", "name": "Melanie Rice", "time": 1591982721953, "rating": 5.0, "text": "AWESOME experience!!! Would totally do it again!! Charles you ROCK!!", "pics": null, "resp": {"time": 1592510212541, "text": "Yay for Charles! Thank you!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116260771027323502546", "name": "Andrea Norton", "time": 1559313361298, "rating": 5.0, "text": "Awesome! People who run the place take great care of you. The jump was amazing! Highly recommend sky diving!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "110608818330707804366", "name": "Mariah Stark", "time": 1531234177260, "rating": 5.0, "text": "This place has the best staff and most friendly people around. We had an awesome first time jump and landed on the beach! 2 miles up and the rush was such a thrill! Thanks for a great time :)", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "107023081306514531980", "name": "Brittany Denson", "time": 1573321099768, "rating": 5.0, "text": "Awesome experience and the people are all friendly and professional! Loved it and will jump again!", "pics": null, "resp": {"time": 1576068360577, "text": "Thank you Brittany!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "118217246539201435052", "name": "Derek Daniels", "time": 1593101206635, "rating": 5.0, "text": "Great place! So much fun!", "pics": null, "resp": {"time": 1593704327458, "text": "Thank you fir coming to jump with us Derek!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "114576663034014903660", "name": "Jared Stokes", "time": 1593100675019, "rating": 5.0, "text": "So much fun! Great place!", "pics": null, "resp": {"time": 1593704307829, "text": "Thank you for choosing us"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "100033570045276720839", "name": "Brooke Mullican", "time": 1560106998368, "rating": 5.0, "text": "Awesome place and folks. Lee and Luke were great. Very safe and fun environment for the wife and I 7th Anniversary gift!!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "113239781106356008106", "name": "Blake Cowart", "time": 1563555340373, "rating": 5.0, "text": "My first jump. Awesome people! Very friendly! Had an awesome time! I highly recomend!", "pics": null, "resp": {"time": 1563887551206, "text": "Thanks for coming out Blake!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "105868237425364464270", "name": "Krystle Norman", "time": 1567189971572, "rating": 5.0, "text": "Tou all were super helpful and nice!  Made it very fun.  Jay is awesome   Thanks guys!!", "pics": null, "resp": {"time": 1567733465797, "text": "Thank you!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "110690688617506783804", "name": "Stephen Robertson", "time": 1579649917768, "rating": 5.0, "text": "Jake strain is the man! If you are looking for a great skydiving experience, look no further!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "110968014409127334453", "name": "Jonathan Faulkner", "time": 1530492084136, "rating": 5.0, "text": "Had an incredible experience jumping with these guys! It was my first jump and they made the process very stress free. They kept us relaxed and were very informative and knowledgeable throughout the whole experience! Would give it 10 stars if I could!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "113277810958018143187", "name": "Eric Cobb", "time": 1535830286596, "rating": 5.0, "text": "Just completed my first ever jump this morning with Lee. He and Luke made it a very laid-back, fun experience! And the pilot, John, made the trip to 10,000' an enjoyable ride. This place is top-notch. I will be back!", "pics": null, "resp": {"time": 1535943853327, "text": "Thank you Eric, see you back in the sky for jump number two."}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "108394695606627103226", "name": "Haldthin", "time": 1566149009185, "rating": 5.0, "text": "It was so much fun! The staff was very friendly and conversational and calming! You have to try it at least once!", "pics": null, "resp": {"time": 1566429755683, "text": "Thank you for choosing us for your tandem skydive!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "101999450628797795924", "name": "John DelPrete", "time": 1553255863451, "rating": 5.0, "text": "Skydive The Gulf has structured their business model in order to meet its mission goal, which is to provide you, the tandem student with the best safest and personalized experience possible.  Not the average DZ; commonly know as “Tandem Factories”.  The schedule allows enough time so that they may get to know each of you and for you to know and be comfortable with each of the staff members.  They understand that committing to a skydive is a big decision so enough time is planned to make the experience about you, creating an ever lasting memory filled with awesome.  Tandem skydiving is all that they do.  The philosophy is to eliminate distractions, focus, achieve excellence and become the very best.  Locally owned and operated; the team are not only colleagues but friends with the same mind set and goals, to provide you the tandem student with a safe and personalized experience, as opposed to other DZ’s whose goal is to process as many people in the shortest time possible regardless of weather conditions.   Each team member has the authority to halt operations at any time if safety is a concern.  Safety and your experience are foremost not the bottom line.  “To those who jump no explanation is necessary, to those who don’t jump no explanation is possible.”  What are YOU waiting for?????", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "111671696495891731319", "name": "Chaz Busbin", "time": 1558979185992, "rating": 5.0, "text": "Such Ana amazing experience! The instructors really are awesome. I highly recommend this place and this experience.", "pics": null, "resp": {"time": 1559234863289, "text": "Thank you Chaz!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "115551264693327459001", "name": "Jessie Bauer", "time": 1570409486236, "rating": 5.0, "text": "Had my first jump here yesterday and it was amazing! The staff was super friendly and made the whole experience unforgettable!", "pics": null, "resp": {"time": 1571228369305, "text": "Thank you Jessie!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117746821634235680870", "name": "Kristen Warner", "time": 1566149068144, "rating": 5.0, "text": "Absolutely incredible experience!!!! Instructors and staff were beyond helpful and knowledgeable!  I will 100% be coming back for another jump!", "pics": null, "resp": {"time": 1566429738030, "text": "Thank you Kristen!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "105700220410160529651", "name": "Monroe Gray", "time": 1560884071214, "rating": 5.0, "text": "Very hospitable and eager to be helpful. Very courteous of the customer’s interests. Would certainly recommend it and return again!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "102935425185154777900", "name": "Yoga with Ashley", "time": 1556931598478, "rating": 5.0, "text": "This spot is absolutely beautiful. The staff here are incredible. Do yourself this favor and jump out of a plan with the best!", "pics": null, "resp": {"time": 1557284648207, "text": "Thank you so much Ashley!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103692951506302630454", "name": "Ally", "time": 1553301597084, "rating": 5.0, "text": "Amazing experience! The staff was amazing and super helpful and made the experience even better. I would definitely recommend them.", "pics": null, "resp": {"time": 1553525808478, "text": "Thank you Sheree!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "105492460726433015819", "name": "scott fulton", "time": 1525100951385, "rating": 5.0, "text": "This was my first jump and it could not have gone better! The whole staff was super friendly and welcoming, very laid back. Luke and Brooke were the perfect instructors and the pilot did a fantastic job! Amazing views of the land and ocean. Next time I'm in the area I will absolutely be going with them! Thank you!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103615018743108868394", "name": "Jerry S", "time": 1565379237284, "rating": 5.0, "text": "First skydive, Skydive The Gulf made it easy. Instructors and staff were great. Whole experience was fantastic!", "pics": null, "resp": {"time": 1566429888117, "text": "Thank you Jerry!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "109537367003347286108", "name": "Heather Hayes", "time": 1529531723397, "rating": 5.0, "text": "My boyfriend and I jumped for the first time yesterday. I was so nervous when flying up but they helped me relax and just enjoy the experience! They all did a great job. They have awesome personalities and just want you to have fun. They are above all very experienced and I felt I was in great hands", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116479792659838652051", "name": "Broc Thomas", "time": 1565653413139, "rating": 5.0, "text": "Absolutely amazing jump and highly recommend! Very professional, safety oriented, and super friendly! Cant wait until next time!", "pics": null, "resp": {"time": 1566429806979, "text": "Thank you Broc!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "102837904510510835626", "name": "Dman From Okaw", "time": 1558970123175, "rating": 5.0, "text": "This was an incredible experience. I truly recommend trying this place out for everyone. The staff was amazing and truly was there to help.", "pics": null, "resp": {"time": 1559234882184, "text": "Thank you for choosing us!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104337389977724708517", "name": "Christopher Chavers", "time": 1563986028656, "rating": 5.0, "text": "The whole process from start to finish was so easy and memorable working with a staff that was very knowledgeable and fun. This was by far my favorite jump yet, and the first of many more to come later!", "pics": null, "resp": {"time": 1576068512313, "text": "Thank you!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112232632166775842012", "name": "Cody Banks", "time": 1521305037172, "rating": 5.0, "text": "So my younger sister wanted to go skydiving for her birthday and I’m terrified of heights but I went. I’m so glad I did! It was a freaking blast and I loved it. If you ever want to try it go here because they are understanding and they make you feel safe and they have fun. So go check them out.", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "118430511097124741205", "name": "Elliott Ewing", "time": 1559667076708, "rating": 5.0, "text": "What a fantastic experience! Fun Crew too! Hope to visit again next year. For those on the fence about jumping, do it!", "pics": null, "resp": {"time": 1559741455529, "text": "yes, just do it!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112707690119974590491", "name": "Yadira Hicken", "time": 1558581772241, "rating": 5.0, "text": "I would do this again in a heartbeat! If you have the opportunity, i would recommend the sunset beach landing 100,000% ... The views are incredible and the staff is soooo friendly and accommodating from start to finish. Even checking in with you on the way up to make sure you're having a good time.. Looking forward to the next time, for sure, DO IT!!", "pics": null, "resp": {"time": 1559234980924, "text": "Thank you for jumping with us!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "115159975545460785501", "name": "Rebekah Choiniere", "time": 1601303370889, "rating": 5.0, "text": "Great place and staff.", "pics": null, "resp": {"time": 1601939645663, "text": "Thank you for coming out Rebekah!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112654652091363642494", "name": "Dana Hall", "time": 1563301299064, "rating": 5.0, "text": "AMAZING EXPERIENCE!!!! They were so great with us and the jump was better than I ever imagined! Thank you for a great jump!", "pics": null, "resp": {"time": 1563887988765, "text": "Thank you for coming out Dana!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "107410926092423296248", "name": "Kendall Sainata", "time": 1569286919320, "rating": 5.0, "text": "The staff does everything they can to keep you safe and make your experience the best it can possibly be! It was so perfect!", "pics": null, "resp": {"time": 1571228444886, "text": "Awesome Thank you Kendall!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "114312991584330909464", "name": "Christie McBride", "time": 1590247314101, "rating": 5.0, "text": "The best time of my life!! Wonderful people!! Wonderful time!!", "pics": null, "resp": {"time": 1592510841296, "text": "Thank you Christie!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "100385612796842809099", "name": "Ashley White", "time": 1592599402490, "rating": 5.0, "text": "Awesome staff and awesome experience!!! Would do it again!", "pics": null, "resp": {"time": 1593704721572, "text": "Thanks for coming out"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "105974778605608045182", "name": "chris neal", "time": 1567526434299, "rating": 5.0, "text": "Second jump this year! Amazing and professional as always. I can’t see myself ever jumping anyone else.", "pics": null, "resp": {"time": 1567733338656, "text": "Awe Thanks Chris your a rockstar!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "114014391740316275483", "name": "Maggie Jasper", "time": 1531952746442, "rating": 5.0, "text": "Skydive the gulf was insane! Amazing crew, made me feel completely at ease. We even dropped through a rainbow which was absolutely amazing! Made my first jump incredible!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104990728451683321662", "name": "JakElSnoopDotShi Low", "time": 1561487669422, "rating": 5.0, "text": "Fantastic experience!   Felt like we were in good hands with experienced professionals.  Will be back!  Thank you!", "pics": null, "resp": {"time": 1563070741727, "text": "Thank you for coming out!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "111217413131827869472", "name": "Chris Holder", "time": 1531242219199, "rating": 5.0, "text": "This is one awesome and special place. Great souls and wonderful times. Luke and Brooke are running a 100% first class DZ. Beautiful gear , Aircraft and location. Awesome place for birthdays, Anniversaries, or any other special family events.", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104183445425514088930", "name": "Anna Hodson", "time": 1562356635236, "rating": 5.0, "text": "This was my second jump and it was even better than the first!! So glad I chose Skydive the Gulf!! The people, jump, and view are awesome!", "pics": null, "resp": {"time": 1563070246665, "text": "Thank you Anna!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "102308051565260228431", "name": "Sean Walker", "time": 1558203075552, "rating": 5.0, "text": "Had a blast jumping for my first time with Lee. Will come back and definitely recommend! One of a kind experience.", "pics": null, "resp": {"time": 1559235119394, "text": "We love Lee! see you again soon!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "100385612796842809099", "name": "Ashley White", "time": 1592599402490, "rating": 5.0, "text": "Awesome staff and awesome experience!!! Would do it again!", "pics": null, "resp": {"time": 1593704721572, "text": "Thanks for coming out"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "111217413131827869472", "name": "Chris Holder", "time": 1531242219199, "rating": 5.0, "text": "This is one awesome and special place. Great souls and wonderful times. Luke and Brooke are running a 100% first class DZ. Beautiful gear , Aircraft and location. Awesome place for birthdays, Anniversaries, or any other special family events.", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117974882284151236684", "name": "James Quillen", "time": 1567791776136, "rating": 5.0, "text": "Highly recommend any first time skydiver to use them. Incredible sights and staff.", "pics": null, "resp": {"time": 1571228650187, "text": "Thanks for coming out James!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "114794199499933043861", "name": "Anthony Stark", "time": 1531234007465, "rating": 5.0, "text": "This place was amazing! The staff is great and so down to earth. First time jumping out of a plane and we landed on the beach! Super awesome time :)", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "118182043331071441028", "name": "Kayla Feist", "time": 1562422627033, "rating": 5.0, "text": "An awesome jump and the instructors were awesome! Would definitely do again and landing on the beach was amazing!", "pics": null, "resp": {"time": 1563070179101, "text": "YAY! Thank you for choosing us!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "109679994485082072683", "name": "JD Smith", "time": 1525295875938, "rating": 5.0, "text": "My first jump ever.  Great time and great crew.  Will do it again next time I’m in the area.  Professionalism all the way from start to finish.  Had a blast!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "115845589476372622689", "name": "James Catalano", "time": 1560620003837, "rating": 5.0, "text": "Incredible experience! Professional staff. Can't recommend it enough. You must do this before you die.", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "101534589483504929776", "name": "Alexxa Roberts", "time": 1530640688795, "rating": 5.0, "text": "So Much Fun! The location was easy to get to and the team greeted us with smiles apon our arrival.  The team ran everything efficiently and were very thorough in giving directions and answering questions.  Very personable and professional, they made this experience unforgettable! We will be back next summer for the beach landing!!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "110280830509948722886", "name": "Geoff Monzingo", "time": 1522087980443, "rating": 5.0, "text": "My wife and I jumped for the first time ever to celebrate our anniversary, with no real expectations other than a check mark on the bucket list.  As mentioned in the other comments, Luke, Brooke, Lee, Kerri & John were very patient, professional and fun. They make you feel very welcome and put your nerves at ease (trust me, I asked them all a LOT of questions).\n\nThe views on the jump are spectacular as advertised, but what stuck out to me the most was their incredible passion for what they do, and their enthusiasm in sharing it with others. Each and every one of them is a great ambassador for the sport. We have been back to jump again since, and it was even better. Can't wait to get licensed and do some fun jumps with these guys! I'll be returning for at least a monthly fix until that time.", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "113459871588135357039", "name": "Chris Beck", "time": 1558287183308, "rating": 5.0, "text": "Absolutely amazing experience. First time and it felt like my 100th jump. Super professional and friendly staff. There needs to be 10 stars. Will be back", "pics": null, "resp": {"time": 1559235095410, "text": "Yes!!! 10 Stars! thank you for jumping with us!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "107467301834967545464", "name": "Levi Bird", "time": 1576864437533, "rating": 5.0, "text": "Awesome time, friendly staff, would definitely do it again!", "pics": null, "resp": {"time": 1578777664970, "text": "See you again Levi"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112612842393710033917", "name": "Christy Alexander", "time": 1568671867376, "rating": 5.0, "text": "Awesome people! Thanks for helping me check this off my bucket list!", "pics": null, "resp": {"time": 1571228771231, "text": "No problem. Thank you for choosing us!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "100345210200673258890", "name": "Irène", "time": 1568561549664, "rating": 5.0, "text": "Great experience with a fantastic team of professionals. Can’t wait to come again!", "pics": null, "resp": {"time": 1571228732686, "text": "See you next time Irene!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "107618422007008347711", "name": "Rashawn Norman", "time": 1561164805719, "rating": 5.0, "text": "It’s was freaking amazing the perfect plan 2 get engaged 2 my girlfriend the staff was great safety is first then the fun I will most definitely be coming back for our anniversary jump 💯", "pics": null, "resp": {"time": 1563070448780, "text": "Thanks for letting us be a part of your special day!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "102062792559104084188", "name": "brittany edwards", "time": 1524981696338, "rating": 5.0, "text": "My brother and I jumped for the first time today with this team, and we could not have picked a better one! The staff members were so warm and welcoming. They went above and beyond to make our time there pleasant. I am terrified of heights but have always wanted to go skydiving. I finally sucked it up and went, and it was everything I wanted it to be!\n\nP.S.- TO ALL THE CHICKENS, 🐓 (like me) just do it, it’s so worth it!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "114997158117832459614", "name": "Tori Pace", "time": 1554154935843, "rating": 5.0, "text": "Awesome experience! Would definitely do it again. Staff was friendly and comforting throughout the adventure.", "pics": null, "resp": {"time": 1554779071219, "text": "Thank you!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "118182043331071441028", "name": "Kayla Feist", "time": 1562422627033, "rating": 5.0, "text": "An awesome jump and the instructors were awesome! Would definitely do again and landing on the beach was amazing!", "pics": null, "resp": {"time": 1563070179101, "text": "YAY! Thank you for choosing us!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116189677494709072503", "name": "Oscar carter", "time": 1564948040629, "rating": 5.0, "text": "Had an amazing time..the team at skydive the gulf was very friendly.had alot of fun hanging out with Lee (my jump guy) ,Luke,and Collin(our pilot)..as well as the ppl on the ground with the family..and was very informative keeping us all posted on what was going on through this experience..cant wait to jump again..", "pics": null, "resp": {"time": 1566429982819, "text": "Thank you Oscar!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "111644417903849764127", "name": "Ricky King", "time": 1564971778666, "rating": 5.0, "text": "These folks never disappoint 2nd year in a row we have jumped with them extremely safe and professional operation.  Looking forward to next year's vacation.", "pics": null, "resp": {"time": 1566429960408, "text": "See you next year Ricky!!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "101534589483504929776", "name": "Alexxa Roberts", "time": 1530640688795, "rating": 5.0, "text": "So Much Fun! The location was easy to get to and the team greeted us with smiles apon our arrival.  The team ran everything efficiently and were very thorough in giving directions and answering questions.  Very personable and professional, they made this experience unforgettable! We will be back next summer for the beach landing!!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "113868210777061707795", "name": "Austin .Briggs", "time": 1590857989044, "rating": 5.0, "text": "The most fun I’ve ever had", "pics": null, "resp": {"time": 1592510359185, "text": "Awesome, Thanks for choosing us!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "114794199499933043861", "name": "Anthony Stark", "time": 1531234007465, "rating": 5.0, "text": "This place was amazing! The staff is great and so down to earth. First time jumping out of a plane and we landed on the beach! Super awesome time :)", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103775284293449547974", "name": "Quicky Smith", "time": 1533004591432, "rating": 5.0, "text": "I flew with skydive the gulf on vacation today and had a BLAST! They were professional and informative.We did the morning jump and landed on the beach right in front of Florbama, Luke was my tandem instructor and he did a great job making sure I was  comfortable and confident! The whole team was great including the pilot :-) Cant wait to go again! I would definitely suggest jumping @ skydive the gulf it's the best jump team around", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "111753249865189623713", "name": "Donald Owings", "time": 1532647329292, "rating": 5.0, "text": "This place is great! The staff is wonderful.\nThe best place to go jump for sure. Great job guys with my group.", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103551000683239229787", "name": "Amanda Slove", "time": 1534385030064, "rating": 5.0, "text": "This was my third jump and for sure my favorite one so far. The staff is so personable and you can tell they really love what they do. Plus great views. Highly recommend!", "pics": null, "resp": {"time": 1535945045163, "text": "Thank you Amanda!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "110280830509948722886", "name": "Geoff Monzingo", "time": 1522087980443, "rating": 5.0, "text": "My wife and I jumped for the first time ever to celebrate our anniversary, with no real expectations other than a check mark on the bucket list.  As mentioned in the other comments, Luke, Brooke, Lee, Kerri & John were very patient, professional and fun. They make you feel very welcome and put your nerves at ease (trust me, I asked them all a LOT of questions).\n\nThe views on the jump are spectacular as advertised, but what stuck out to me the most was their incredible passion for what they do, and their enthusiasm in sharing it with others. Each and every one of them is a great ambassador for the sport. We have been back to jump again since, and it was even better. Can't wait to get licensed and do some fun jumps with these guys! I'll be returning for at least a monthly fix until that time.", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "101305406261113876743", "name": "BARRY BRIGHT", "time": 1560945158679, "rating": 5.0, "text": "This was the first time doing ANYTHING like this!!!  Great people and safety was first and formost...  Will most definitely be back for a beach landing.", "pics": null, "resp": {"time": 1563070378471, "text": "Thanks for coming out Barry, we had a blast!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "109679994485082072683", "name": "JD Smith", "time": 1525295875938, "rating": 5.0, "text": "My first jump ever.  Great time and great crew.  Will do it again next time I’m in the area.  Professionalism all the way from start to finish.  Had a blast!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "100726435851922935875", "name": "Abby Muniz", "time": 1560100127575, "rating": 5.0, "text": "OMG I HAD AN AMAZING TIME!! I’m ready to do it all over again!! Luke was amazing!! They where very professional and very nice and caring!! Def recommend!!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "100726435851922935875", "name": "Abby Muniz", "time": 1560100127575, "rating": 5.0, "text": "OMG I HAD AN AMAZING TIME!! I’m ready to do it all over again!! Luke was amazing!! They where very professional and very nice and caring!! Def recommend!!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "113868210777061707795", "name": "Austin .Briggs", "time": 1590857989044, "rating": 5.0, "text": "The most fun I’ve ever had", "pics": null, "resp": {"time": 1592510359185, "text": "Awesome, Thanks for choosing us!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "110934054672164824832", "name": "Chad Corey", "time": 1596394684640, "rating": 5.0, "text": "Great fun, great people!", "pics": null, "resp": {"time": 1597802922160, "text": "thank you Chad"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "108676637995876259220", "name": "Joseph Monile", "time": 1566706803974, "rating": 5.0, "text": "Best staff ever they were kind and very close to you.", "pics": null, "resp": {"time": 1566994341488, "text": "Ha,  Thanks for being close to us!! Come back and see us!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "107891470920837590942", "name": "James Bailey", "time": 1525485154122, "rating": 5.0, "text": "Me and my friend cole did our first jump here, great staff seriously amazing people.  We chose to do the sunset skydive which cost a little bit more but i would highly recommend.   My experience here is something i will always remember and for that i am grateful, thank you guys for the amazing experience .", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103916719299531814588", "name": "Jason Brickey", "time": 1534288957583, "rating": 5.0, "text": "One of the best experiences of my life. Both instructors are confident in what they do which helped provide peace of mind. If you ever have even considered jumping out of an airplane, do it and do it with these guys!", "pics": null, "resp": {"time": 1535944593329, "text": "Thank you Jason, the guys take pride in making sure you are safe and have the best time of your life!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104721203554637238986", "name": "Dawn M515", "time": 1534306271978, "rating": 5.0, "text": "This was my second jump with Luke! 3rd total! There will be a 3rd with Luke at his place in the Caribbean in a couple months! Professional and awesome people to know! Much love to this couple out there chasing their dreams and LOVING what they do!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "108290631494782349377", "name": "Samantha Villanueva", "time": 1563660083297, "rating": 5.0, "text": "My instructor was great and I would do it again in a heart beat !!! Thank you for keeping me safe :)", "pics": null, "resp": {"time": 1563887507554, "text": "Thank you for jumping with us Samantha!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "113803088138017267071", "name": "Cameron Coley", "time": 1561240641074, "rating": 5.0, "text": "Great staff! They make you feel so welcome and def calm your nerves!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "110220966194649720198", "name": "sarah grijalva", "time": 1619810032910, "rating": 5.0, "text": "Time of my life!!! DO IT!!!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "106538186192241399274", "name": "Laura Robinson", "time": 1533842764398, "rating": 5.0, "text": "This was my first experience skydiving. Lee talked me through the process which really helped me. . It was a breathtaking experience. The crew was professional and friendly. Definitely helped to relieve nerves.", "pics": null, "resp": {"time": 1535944902569, "text": "Thank you Laura, Lee is such a wonderful teacher. Thank you for choosing us!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "108385037904025989842", "name": "Colton Stephens", "time": 1562539135285, "rating": 5.0, "text": "Awesome experience.  My first tandem jump and everyone was so great!!! Thank you!!", "pics": null, "resp": {"time": 1563069933200, "text": "Thank you for choosing us Colton!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "111041850036035639212", "name": "Leanne Freeman", "time": 1534516638311, "rating": 5.0, "text": "The whole crew at skydive the Gulf was amazing, This is a once in a lifetime experience you must do you won't regret it especially in the hands of the staff at skydiving the gulf!!!THEY ARE AWESOME!!! We will definitely be back on our next trip to gulf shores..", "pics": null, "resp": {"time": 1535945164394, "text": "Your awesome Leanne!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116911444121255475838", "name": "cyndie gaines", "time": 1564240711680, "rating": 5.0, "text": "Awesome!! People are great here. Will definitely do this again.", "pics": null, "resp": {"time": 1564625274512, "text": "Thank you Cyndie!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117907670049468594627", "name": "laura white", "time": 1561133471504, "rating": 5.0, "text": "Amazing experience! Staff was great! One more ✔ off my bucket list!", "pics": null, "resp": {"time": 1563070415955, "text": "Thanks for choosing us Laura!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "102595567531271868022", "name": "Christian Strozier", "time": 1592585090888, "rating": 5.0, "text": "Amazing place had a blast!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "105597374668424981089", "name": "Ben Woolslayer", "time": 1556468418685, "rating": 5.0, "text": "This is an amazing place to skydive! Beautiful scenery, safe airplane, and very professional staff!! I\nWill be back for more!", "pics": null, "resp": {"time": 1557284680541, "text": "Thank you Ben you are an amazing parachute packer!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "113041729894056575564", "name": "Logan Vidrine", "time": 1560797598162, "rating": 5.0, "text": "Awesome experience! Had an awesome time! Would recommend to anyone!", "pics": null, "resp": {"time": 1563070903682, "text": "Thank you Logan!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103131136270112497807", "name": "Eric Bevelle", "time": 1532183877917, "rating": 5.0, "text": "The staff was amazing! This was my first jump and I'll have to say I will be back after the experience I received from SKYDIVE THE GULF. I would suggest doing the beach landing, the views are amazing, and if you're lucky you'll have some clouds to fall thru.\n\nThanks guys@SKYDIVETHEGULF", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "114736233371417925381", "name": "Kandace Ballard", "time": 1599235813248, "rating": 5.0, "text": "It was an amazing experience!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103916719299531814588", "name": "Jason Brickey", "time": 1534288957583, "rating": 5.0, "text": "One of the best experiences of my life. Both instructors are confident in what they do which helped provide peace of mind. If you ever have even considered jumping out of an airplane, do it and do it with these guys!", "pics": null, "resp": {"time": 1535944593329, "text": "Thank you Jason, the guys take pride in making sure you are safe and have the best time of your life!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117393031653428382394", "name": "victoria m", "time": 1532583982944, "rating": 5.0, "text": "Fantastic first skydiving experience with my boyfriend on vacation! Both our guides were so friendly and both were such good guides on the way down! And my pictures were so cool! Can’t wait to jump again!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "118130856870982258272", "name": "Blake Dufour", "time": 1563555286221, "rating": 5.0, "text": "Well worth it! So much fun and very friendly helpful staff!", "pics": null, "resp": {"time": 1563887569355, "text": "Thanks for jumping with us Blake!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104547476138031270945", "name": "Jennifer Joyner", "time": 1557701294511, "rating": 5.0, "text": "Top notch professionals! Booked for my 50th birthday and jumped on Mother's Day. Friendliest staff, exceptional communication and I cannot wait to Skydive the Gulf again!", "pics": null, "resp": {"time": 1559235151239, "text": "Thank you Jennifer glad we could spend your birthday with you!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104422481524781372618", "name": "Manita Johnson", "time": 1561303132135, "rating": 5.0, "text": "These guys are great!!! Awesome experience!!! I would (and do) recommend them to everyone!’", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116458292755792776244", "name": "Lindsay Henson", "time": 1532390331470, "rating": 5.0, "text": "The most fun I believe I have ever had. Definitely will be doing business with them again. Very friendly and fun atmosphere", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "110325280382850738064", "name": "Wildflower Farm", "time": 1560875814485, "rating": 5.0, "text": "My husband had an amazing experience! They took such good care of him and the staff is the sweetest!!", "pics": null, "resp": {"time": 1563070947902, "text": "Thank you!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116863284950583546663", "name": "Chris Wallace", "time": 1556127596750, "rating": 5.0, "text": "I haven't had the chance to jump yet due to weather but the  rew at Skydive the Gulf are beyond professional and friendly. I cant wait to reschedule my jump (better weather day)... but highly recommend! I hope to get enough jumps to where I can do it solo one day. I'll see yall soon... thank you all for your hospitality and hope you keep the \"Fowl Weather\" Band Rocking... I'll bring my guitar next time!", "pics": null, "resp": {"time": 1556415765706, "text": "Hey Chris, Thanks for hanging out with us!! We will get you in the sky soon enough. Now that the weather is warming up. You are going to love it!! See you soon my friend."}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116911444121255475838", "name": "cyndie gaines", "time": 1564240711680, "rating": 5.0, "text": "Awesome!! People are great here. Will definitely do this again.", "pics": null, "resp": {"time": 1564625274512, "text": "Thank you Cyndie!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103295196191091263691", "name": "Kathy Saxon", "time": 1575050926488, "rating": 5.0, "text": "Wonderful.  Professional yet FUN...", "pics": null, "resp": {"time": 1576068339841, "text": "Thank you Kathy!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "113041729894056575564", "name": "Logan Vidrine", "time": 1560797598162, "rating": 5.0, "text": "Awesome experience! Had an awesome time! Would recommend to anyone!", "pics": null, "resp": {"time": 1563070903682, "text": "Thank you Logan!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "115578355020695278809", "name": "Tayler Comeau", "time": 1563546818553, "rating": 5.0, "text": "Awesome experience. Will definitely be doing this again!", "pics": null, "resp": {"time": 1563887588560, "text": "Can't wait to see you again!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112837409305935764580", "name": "Justin Lowery", "time": 1584126339820, "rating": 5.0, "text": "Awesome experience, people are highly professional, overall great experience!!", "pics": null, "resp": {"time": 1592511681361, "text": "Thanks for coming out to jump with us!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "107891470920837590942", "name": "James Bailey", "time": 1525485154122, "rating": 5.0, "text": "Me and my friend cole did our first jump here, great staff seriously amazing people.  We chose to do the sunset skydive which cost a little bit more but i would highly recommend.   My experience here is something i will always remember and for that i am grateful, thank you guys for the amazing experience .", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "102380557204547313581", "name": "Zach Hines", "time": 1569262077183, "rating": 5.0, "text": "Very professional! Would recommend to anyone! Thank you!", "pics": null, "resp": {"time": 1571228425262, "text": "Thank you Zach!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "111041850036035639212", "name": "Leanne Freeman", "time": 1534516638311, "rating": 5.0, "text": "The whole crew at skydive the Gulf was amazing, This is a once in a lifetime experience you must do you won't regret it especially in the hands of the staff at skydiving the gulf!!!THEY ARE AWESOME!!! We will definitely be back on our next trip to gulf shores..", "pics": null, "resp": {"time": 1535945164394, "text": "Your awesome Leanne!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "106538186192241399274", "name": "Laura Robinson", "time": 1533842764398, "rating": 5.0, "text": "This was my first experience skydiving. Lee talked me through the process which really helped me. . It was a breathtaking experience. The crew was professional and friendly. Definitely helped to relieve nerves.", "pics": null, "resp": {"time": 1535944902569, "text": "Thank you Laura, Lee is such a wonderful teacher. Thank you for choosing us!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116460841640794992237", "name": "Lundy Williams", "time": 1539537687110, "rating": 5.0, "text": "Love love love this place!! Fourth jump so far and they are always perfect! Will not go with anyone else! 2 thumbs up 👍🏻👍🏻", "pics": null, "resp": {"time": 1553526176321, "text": "YOU ARE AWESOME!!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112161606928127546032", "name": "Steve Butts", "time": 1559498945050, "rating": 5.0, "text": "We did this for my wife's birthday and it is incredible, Luke and his team are very professional and fun! Ya gotta do this!", "pics": null, "resp": {"time": 1559741541910, "text": "Thank you Steve!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "108712206211521092922", "name": "Bailey Pentz", "time": 1563755466983, "rating": 5.0, "text": "Amazing. Absolutely amazing people and experience. HIGHLY recommend!!!", "pics": null, "resp": {"time": 1563887484552, "text": "Thank you Bailey!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "111283272310916384300", "name": "Chase Pate", "time": 1562017066762, "rating": 5.0, "text": "This place is a definite MUST GO!!! I had the best time of my life today skydiving with these guys 😍", "pics": null, "resp": {"time": 1563070307113, "text": "Thank you Chase!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "110904671729725675249", "name": "Ryan", "time": 1551570726030, "rating": 5.0, "text": "Was an awesome experience. Did the proposal package! And of course she said yes!! Check these guys out!", "pics": null, "resp": {"time": 1553526135784, "text": "Thanks Ryan Congrats!!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "115204824631328133306", "name": "Lauren Hockman", "time": 1527796922996, "rating": 5.0, "text": "Landing on the beach was incredible but Brooke, Luke and Lee take the experience to the next level. Highly recommend. Everyone needs to jump with them!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "102760678840809182477", "name": "Herrington Transportation", "time": 1534457392138, "rating": 5.0, "text": "Had a blast!  Everyone was very friendly and they did an awesome job on my video!  Thanks I will do it again with the kiddos next time!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "109276166126796800380", "name": "Patrick Simoneaux", "time": 1593286267212, "rating": 5.0, "text": "Totally awesome experience and crew!!!\nWe will be back!!!", "pics": null, "resp": {"time": 1593704091661, "text": "Thanks Patrick can't wait to see you again!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "110494867608120146656", "name": "Chance Guess", "time": 1559499860660, "rating": 5.0, "text": "Amazing time for my first jump!  Ready to continue this rush another time!  Thank you Luke for a great jump!", "pics": null, "resp": {"time": 1559741529108, "text": "Thanks chance!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "115779216485977085335", "name": "Jenny West", "time": 1553465773007, "rating": 5.0, "text": "First time skydiving! It was incredible! Beautiful weather for an awesome jump!", "pics": null, "resp": {"time": 1553525367744, "text": "Thank you for choosing us Jenny! We hope to see you again."}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "100877492502061926745", "name": "Amy Rector", "time": 1598549466462, "rating": 5.0, "text": "Best Vacation Experience to Date!!!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "109139336324548765242", "name": "Sarah Gallo", "time": 1553219886963, "rating": 5.0, "text": "The staff are awesome! You can tell that they really enjoy what they do.", "pics": null, "resp": {"time": 1553525844851, "text": "We sure do, and because of people like you we get to continue to do what we love."}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104739544920391909416", "name": "Jerry Naramore", "time": 1531264959641, "rating": 5.0, "text": "This is addicting. We are going to have to do this every year. The people are fantastic. There are no words to describe this feeling.", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "102552641419885321256", "name": "Brandy Jensen", "time": 1569767574719, "rating": 5.0, "text": "This was mine and my son's  skydive and could not have better instructors! Thank you for an amazing experience!!", "pics": null, "resp": {"time": 1571228550563, "text": "Thank you for choosing us Brandy!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "102229419335498709713", "name": "BMC Sunshine", "time": 1554999365861, "rating": 5.0, "text": "Such an incredible feeling of adrenaline and just being free in the sky no worries, no cares,  no stress, just feeling fully alive and present in the moment!", "pics": null, "resp": {"time": 1555390690040, "text": "Thank you so much!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "106558313000434133695", "name": "THE NOT SO PERFECT VEGAN THE NOT SO PERFECT VEGAN", "time": 1553019761120, "rating": 5.0, "text": "PURCHASED THIS TRIP FOR MY FIANCE AND I, AND I WOULD DO IT ALL OVER AGAIN! It was an amazing EXPERIENCE and we will definitely be back!!", "pics": null, "resp": {"time": 1553525880235, "text": "Thank you!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116066308835266023443", "name": "nichole hopper", "time": 1564185739851, "rating": 5.0, "text": "First time and that was amazing!! Lee was super cool! 10/10 recommend!!", "pics": null, "resp": {"time": 1576068456849, "text": "We love Lee thank you for coming out!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "110084646278498363477", "name": "Taylor Basiger", "time": 1555878312820, "rating": 5.0, "text": "Missed Easter sermon but worth it. Best time ever! 10/10 recommend!!", "pics": null, "resp": {"time": 1556415975479, "text": "Thank you Taylor. Come back after service next year!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112151439521249284397", "name": "Chase Malensky", "time": 1530311684511, "rating": 5.0, "text": "We both lived and I highly ( get it ) recommend it. They are all great. Thanks so much", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "115628928380285220583", "name": "Reginald Collins", "time": 1556310512001, "rating": 5.0, "text": "Best time of my life . Great crew make you feel welcomed and relaxed !", "pics": null, "resp": {"time": 1556415680727, "text": "Thank you Reginald!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "105988277970132643395", "name": "Kim McCoy", "time": 1563118867175, "rating": 5.0, "text": "Great experience for My Daughters 19th Bday!!\nThanks for the memories", "pics": null, "resp": {"time": 1563887640100, "text": "Thank you Kim!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "106008271009299954479", "name": "Rexicon_jlu Adventures", "time": 1564185968292, "rating": 5.0, "text": "Great group of people, and what an awesome experience! Gorgeous views!", "pics": null, "resp": {"time": 1576068442574, "text": "Thank you Paul!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116089240222900037143", "name": "Russ Geisenheimer", "time": 1553618773308, "rating": 5.0, "text": "Very professional.  Excellent experience.  Friendly staff. 10 out of 10. Will never forget it.", "pics": null, "resp": {"time": 1554779139714, "text": "Thank you Russ!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "113047128446780741626", "name": "Chloe Wise", "time": 1538929242675, "rating": 5.0, "text": "Skydive the gulf is the coolest experience I’ve ever had! Everyone is so friendly and nice and the jumps are absolutely gorgeous! If your thinking about skydiving, this is the place to go!!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117140522572915831560", "name": "Miranda Blehm", "time": 1552787895940, "rating": 5.0, "text": "Skydiving was such an unbelievable experience and the staff at Skydive The Gulf was so down to earth and comforting through the whole thing. Everyone should do this at least once in their life, because it’s truly incredible!", "pics": null, "resp": {"time": 1553525911693, "text": "That is so nice, Thank you Miranda!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "106468466298417428861", "name": "J T", "time": 1565543132267, "rating": 5.0, "text": "Awesome experience all around. Definite pros.", "pics": null, "resp": {"time": 1566429875178, "text": "Thank you So much!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "106075082197288891461", "name": "Wes Tolbert", "time": 1528899446727, "rating": 5.0, "text": "Staff was very friendly and professional! They go out of their way to make you feel comfortable, and relaxed before you jump! My wife and I jumped for our 15th wedding anniversary, and we are so glad we did it! May make it a yearly tradition!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "108766308999273267146", "name": "Julie Reis", "time": 1569336022133, "rating": 5.0, "text": "Most Amazing experience ever! Will be back for more!", "pics": null, "resp": {"time": 1571228456837, "text": "See you next time Julie!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "105976477987519000663", "name": "Kimberly Gray", "time": 1522158476710, "rating": 5.0, "text": "So much fun! Everyone there is very nice and professional. I definitely suggest it to all first time sky divers", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "109201721871952700800", "name": "Jacob McConnell", "time": 1538944310282, "rating": 5.0, "text": "Great team that knows how to maintain professionalism, be safe, and have fun at the same time. Hank was a great tandem for my first sky dive!", "pics": null, "resp": {"time": 1553526258803, "text": "Thank you Jacob!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "102574794207053381880", "name": "Casey Gray", "time": 1527951314797, "rating": 5.0, "text": "These guys are AMAZING!!!\nThe instructors are so knowledgeable and make sure your jump is the best ever!!\nWe will definitely be jumping with this great group of guys again!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "110568815893178530197", "name": "lisa steyer", "time": 1592499268838, "rating": 5.0, "text": "This place is awesome!  Just do it!!!", "pics": null, "resp": {"time": 1592509576754, "text": "Yes!!! Just do it!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "101873656008513780420", "name": "Tyler Julian", "time": 1559575619737, "rating": 5.0, "text": "This was amazing!! Best experience ever!! Highly recommended!! Luke was awesome", "pics": null, "resp": {"time": 1559741502545, "text": "Thank you Tyler, we love Luke!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "106111730557268405652", "name": "Rhonda Spurgeon", "time": 1559404437363, "rating": 5.0, "text": "Awesome company! My husband had a blast!! We will definitely be back!!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "106731930160423458743", "name": "James Stell", "time": 1569181197026, "rating": 5.0, "text": "Awesome! Had a blast jumping with Lee! Awesome staff and location!!!", "pics": null, "resp": {"time": 1571228810775, "text": "Thank you James!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "101065549602455610901", "name": "Barry Muise", "time": 1530980223694, "rating": 5.0, "text": "First time to jump and couldn’t be more happier with the overall experience! Highly impressed with every staff member involved to make you feel comfortable for the jump. I will be back to do it again!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "115600741121110323163", "name": "Danielle Barron", "time": 1570294744619, "rating": 5.0, "text": "It was an amazing experience, gorgeous views, awesome instructors! Do it!", "pics": null, "resp": {"time": 1571228392461, "text": "YES!! We agree do it! Thanks for coming out!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "100787551722186387576", "name": "Jeremy Mueller", "time": 1529709323435, "rating": 5.0, "text": "Awesome! Great crew! Highly recommend. It was my first time and I'll definitely be going again", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103130534256255607808", "name": "Kendra Thompson", "time": 1534286843553, "rating": 5.0, "text": "Fulfilled a dream on my bucket list! Had a great experience. Thank you Luke and team!", "pics": null, "resp": {"time": 1535944639449, "text": "No problem Kendra, because of you we get to do what we love."}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "111550955140990516553", "name": "Payton Price", "time": 1561912695628, "rating": 5.0, "text": "Coolest place ever! Luke was great to jump with!", "pics": null, "resp": {"time": 1563070292171, "text": "We love Luke! Thank you for coming out!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116275307667084958459", "name": "Debbie Edwards", "time": 1537811753602, "rating": 5.0, "text": "My husband and daughter just jumped! Best experience ever! Great job guys!! We will be back for sure!! Thank you!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "106878953519696945697", "name": "Sherrill Dorris", "time": 1563301130417, "rating": 5.0, "text": "Awesome.... I'm so impressed.. Loved it!", "pics": null, "resp": {"time": 1563887971483, "text": "Thank you Sherrill!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "109646514363161133293", "name": "j culver", "time": 1537027497941, "rating": 5.0, "text": "Amazing experience. Luke and Lee were great. Highly recommend to everyone", "pics": null, "resp": {"time": 1537273380093, "text": "Awesome, Thank you!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103431431694502794815", "name": "Charlene Williams", "time": 1559572444513, "rating": 5.0, "text": "AMAZING!  Lee, Luke and Colin were incredible.   Defined a must in your bucket list!", "pics": null, "resp": {"time": 1559741517687, "text": "Thank you Charlene!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "105268956605972327346", "name": "Hadley Starratt", "time": 1562525813582, "rating": 5.0, "text": "This was such a great place!!! I’ll definitely be back!", "pics": null, "resp": {"time": 1563070103553, "text": "Thank you Hadley!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "101014687020496619626", "name": "Ryan Herren", "time": 1551035343085, "rating": 5.0, "text": "Great jump! View was awesome! Great crew! Would definitely go with these guys again!!!", "pics": null, "resp": {"time": 1551049371858, "text": "Thank you so much Ryan!!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "111816153601893367571", "name": "katelyn arnone", "time": 1560797850413, "rating": 5.0, "text": "MOST AMAZING TANDEM JUMP! Will be coming back next visit!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "102372731636669169612", "name": "brad lewis", "time": 1528577379544, "rating": 5.0, "text": "Amazing experience. Very professional staff all the way around. Highly recommended. I will be coming back", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "107199932017826710840", "name": "Kelis Rich", "time": 1590350891963, "rating": 5.0, "text": "best place to to skydive!", "pics": null, "resp": {"time": 1592510892610, "text": "Yeah!! Thanks for choosing us!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "101361171689174177212", "name": "Jen Nifer", "time": 1533168614288, "rating": 5.0, "text": "Took the sunset skydive yesterday, and it was fantastic! The beach landing was top notch, and the instructors go beyond and above to give you a good experience! (They even waited a few extra minutes to leave so my husband and baby would have time to get to the dropsite to watch!)", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104664709896003850914", "name": "Mychael Rome", "time": 1535766701266, "rating": 5.0, "text": "So much fun! Super friendly instructors. Had yue best time of my life!!", "pics": null, "resp": {"time": 1535943816812, "text": "Congratulations on your engagement!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117455421280442866375", "name": "Robin Dorf", "time": 1532124943638, "rating": 5.0, "text": "Everyone here was amazing!! They were very fun and made my birthday exciting!! Definitely coming back! Next time with my husband!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "102449913733657680536", "name": "Roy De La Cruz Sr", "time": 1555171631207, "rating": 5.0, "text": "WOW.... greatest experience... no where near static jump.....", "pics": null, "resp": {"time": 1555390670939, "text": "That is true, nothing like a good freewill jump!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "105990524813180141739", "name": "Emily Moore", "time": 1534723846024, "rating": 5.0, "text": "It was amazing!! Everyone was so great and encouraging! It was beautiful and such an awesome experience.", "pics": null, "resp": {"time": 1535944357750, "text": "Thank you Emily!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117300065989061853057", "name": "Luke Knehans", "time": 1557164280212, "rating": 5.0, "text": "Great team and a wonderful jumpsite over the gulf!\n\n#HappyCustomer", "pics": null, "resp": {"time": 1557284600574, "text": "Thank you Luke you rock!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "111740261372173254736", "name": "timothy steiner", "time": 1520775250925, "rating": 5.0, "text": "Had a great time!! Extremely professional, and experienced staff. Great experience and I highly recommend them. Do the sunset jump btw.", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103236785486040078904", "name": "Doug Basiger", "time": 1555878491551, "rating": 5.0, "text": "It's not scary! Great time, great crew very professional.", "pics": null, "resp": {"time": 1556415930428, "text": "Thank you Doug!! See you again soon."}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116244652158435613909", "name": "sabrina gentry", "time": 1558290058145, "rating": 5.0, "text": "It was such an amazing experience!!! Great staff and beautiful views!", "pics": null, "resp": {"time": 1559235065617, "text": "Thanks for coming out Sabrina!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "106201498677847593515", "name": "Matt Snow", "time": 1538596859409, "rating": 5.0, "text": "Awesome experience!  They are very skilled and I will definitely do it again!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117593121252475930722", "name": "Johnathan Turner", "time": 1565738277791, "rating": 5.0, "text": "Breathtaking experience and felt safe the entire time", "pics": null, "resp": {"time": 1566429788521, "text": "Thank you Jonathan safety is our number one!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "114898381286283493037", "name": "Hallie Hodges", "time": 1538941044630, "rating": 5.0, "text": "These guys are amazing and couldn’t ask for a better crew! My first jump and I can’t wait to do it again!!!\n#skydivethegulf", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "107754450161529108841", "name": "Lindsay Mooney", "time": 1527797248024, "rating": 5.0, "text": "I was in town visiting Orange Beach, AL on vaction and wanted to do something epic, of course skydiving came to mind! Talk about a rush!!! I could not have had a better experience! The drop zone is so nice, clean, and welcoming. Luke and Brooke make you feel right at home and put all your worries to rest. The staff is friendly and very knowledgeable, all around great people and environment. Luke and Brooke made my jump memorable and something I will never forget. While your in Florida-Bama Sky Dive the Gulf, you won’t be sorry!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "110901850292540277927", "name": "Ben Kuipers", "time": 1558801433373, "rating": 5.0, "text": "Fantastic Staff, great jump, really want to do it again.", "pics": null, "resp": {"time": 1559234909744, "text": "Thank you Ben! We will be here come back!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "100078755722327775414", "name": "Oscar Carter", "time": 1564870128909, "rating": 5.0, "text": "Really great environment and amazing staff.", "pics": null, "resp": {"time": 1566429998357, "text": "Thank you!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "102651594514819810997", "name": "Martha Argotte", "time": 1518914450054, "rating": 5.0, "text": "Very professional and fun staff! Thoroughly enjoyed the experience, it was great! Awesome new attraction on the gulf!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112329397099286429951", "name": "Barbara Pendergraft", "time": 1533917809815, "rating": 5.0, "text": "Took my husband and son for their birthdays, Luke and Lee took great care of them and they said they had a lot of fun!! Would recommend them to anyone I know.", "pics": null, "resp": {"time": 1535945220201, "text": "Thanks Barbara!! We had a blast with your boys!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "111299224956381402608", "name": "Heidi McBride", "time": 1528296360920, "rating": 5.0, "text": "On of the most amazing experiences I have EVER had!! The people are an absolute blast and I simply can't wait to go again!!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117640202586050327597", "name": "Molly Jasper", "time": 1531952420736, "rating": 5.0, "text": "The staff is incredible and the experience was insanely awesome! Take an hour out of your ‘alright’ beach trip to jump out of a perfectly good airplane and make your trip a hell of a lot more exciting!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "111004261111395864411", "name": "ROEL DE LA CRUZ", "time": 1555171642423, "rating": 5.0, "text": "Had a great time professional and friendly staff differently recommend", "pics": null, "resp": {"time": 1555390646493, "text": "Thank you so much!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104971259390410393928", "name": "Horatio Menendez", "time": 1571163945250, "rating": 5.0, "text": "Really amazing experience and phenomenal staff", "pics": null, "resp": {"time": 1571228255258, "text": "Thank you for coming out Horatio!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "109101563273360878797", "name": "Slingbasher", "time": 1527973353821, "rating": 5.0, "text": "Went for my second jump. Great experience. Beautiful views. Thanks", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "105565757308544717908", "name": "Brennan Crim", "time": 1565030015537, "rating": 5.0, "text": "Best thing I've ever experienced!!! Thank you!", "pics": null, "resp": {"time": 1566429943044, "text": "Thank you Brennan!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116292348981336102807", "name": "Brooke Brown", "time": 1519673516384, "rating": 5.0, "text": "The staff is so friendly and make you feel very compfortable. The view of the gulf is breathtaking, souring around under parachute was one of the most soothing things I’ve experienced!! The video and picture package is a must!!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103527440359338384523", "name": "Amy Vaughan", "time": 1583005805476, "rating": 5.0, "text": "Most amazing experience ever!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "113378740664717341854", "name": "irelynn kobusch", "time": 1564167189949, "rating": 5.0, "text": "Awesome time would recommend to anyone!", "pics": null, "resp": {"time": 1576068488526, "text": "Thank you!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "111643566791512255833", "name": "Kelly Cirioni", "time": 1534615807012, "rating": 5.0, "text": "Fantastic way to spend my 30th birthday! :-) Thank you Luke and the team for a safe and fun day!", "pics": null, "resp": {"time": 1535945087068, "text": "Thank you for spending your birthday with us!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104560825127489557686", "name": "Philipp Roar 3RD", "time": 1554846096810, "rating": 5.0, "text": "A thorough walk through for newcomers and friendly, excellent instructors. This made my first jump worth many more 😎", "pics": null, "resp": {"time": 1555390757945, "text": "Thank you Philipp!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "101400573582921007915", "name": "Rebba Dickerson", "time": 1551464379145, "rating": 5.0, "text": "Amazing time! Amazing staff! Highly recommend.", "pics": null, "resp": {"time": 1553526148528, "text": "Thank you Rebba!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "111347252288292825948", "name": "Michelle C", "time": 1529335975703, "rating": 5.0, "text": "What a great experience!  I even got to take the chute and steer through the clouds ! I would come back and do this again . All of the staff was wonderful!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117558023724050879725", "name": "Brookelynn Garrett", "time": 1563562083709, "rating": 5.0, "text": "Very friendly staff, a nice jump.", "pics": null, "resp": {"time": 1563887521446, "text": "Thank you Brookelynn!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "102527813549726482388", "name": "Molly Moon", "time": 1525878046009, "rating": 5.0, "text": "My husband and I had a wonderful experience with Skydive The Gulf. Everyone we came in contact with was friendly, fun, and most importantly, great at what they do. I would highly recommend them to anyone wanting to experience an incredible adventure.", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "106987403349525967900", "name": "Heather Cato", "time": 1532125278267, "rating": 5.0, "text": "Awesome office. Friend went skydiving and had a blast! Awesome crew!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "105525370742204647385", "name": "Jennifer Hunter", "time": 1534723735316, "rating": 5.0, "text": "Amazing experience!!! The staff were so easy going and made me feel so comfortable about the jump!!! Beautiful ocean view and awesome way to land!!!! Highly recommend!!!!", "pics": null, "resp": {"time": 1535944424690, "text": "Thank you Jennifer, we are spoiled with this view thats for sure!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103951134900989323758", "name": "Brooke Tanner", "time": 1539537643740, "rating": 5.0, "text": "3rd time at skydive the gulf!! Great staff & awesome view! Never disappoints!", "pics": null, "resp": {"time": 1553526197556, "text": "Thank you Brooke, You girls are awesome!!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "113820127125349767010", "name": "Kaitlyn Boswell", "time": 1536589887087, "rating": 5.0, "text": "I had the best experience with Skydive The Gulf. Very professional and the staff is amazing. Highly recommend!", "pics": null, "resp": {"time": 1536596319023, "text": "Thank you Kaitlyn!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "109909030944612428575", "name": "Josh Bennett", "time": 1534113400468, "rating": 5.0, "text": "Hell of a time! Awesome staff and you can’t beat the view! Definitely coming back!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "113043856315847313243", "name": "Chris Worley", "time": 1529774743048, "rating": 5.0, "text": "Awesome experience. The people where awesome. Definitely doing it again.", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "106990202974160559442", "name": "Abby Bernier", "time": 1566668488092, "rating": 5.0, "text": "Absolutely so amazing! Would come back and do it again and again and again!!!!", "pics": null, "resp": {"time": 1566994357962, "text": "See you again Abby!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "115450758331040665659", "name": "Will Swihart", "time": 1527903145574, "rating": 5.0, "text": "Luke and Brooke were so knowledgable and made me feel so comfortable throughout the entire process.  I'd recommend this experience to anyone looking for something different and fun.", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "113898376603330102167", "name": "Donald Owings", "time": 1533130385469, "rating": 5.0, "text": "This staff was wonderful and would highly recommend this drop zone to everyone to go have a wonderfully time jumping!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "107742433608193142849", "name": "Collin Versluis", "time": 1551999071910, "rating": 1.0, "text": "Can't skydive unless you're 19 years old? Really? You had to add one year more than every other skydiving location? For what reason? Also, they never answer their phones.", "pics": null, "resp": {"time": 1553526081820, "text": "Hello Collin, We are very sorry that you are upset about this. Unfortunately This is out of our control. This is an Alabama state law. We are very sorry that you could not make a skydive with us. We would love to take you when you turn 19."}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117883800270031434686", "name": "Sherry Mueller", "time": 1529709730021, "rating": 5.0, "text": "Awesome people and awesome experience! Would 100% recommend this place to any first timers like myself!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112124019531163948575", "name": "Setteling Shadow", "time": 1533656142463, "rating": 5.0, "text": "Hands down the best experience I have ever had!!! They were very helpful, poliet, and friendly. I will drfiedefin be coming back to do the beach jump!!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "110350473952480515957", "name": "Amy Murph", "time": 1533744393470, "rating": 5.0, "text": "Skydive the Gulf was the best experience (and view) around! I can’t wait to jump again.", "pics": null, "resp": {"time": 1535944851594, "text": "Amy, your jump is one for the books. What a clear beautiful day!!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "114578324150608573823", "name": "Ani C", "time": 1521780746140, "rating": 5.0, "text": "Did my first jump today.... amazing experience!  Awesome people to do it with!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112143644779437082673", "name": "Alex Bingham", "time": 1522631985970, "rating": 5.0, "text": "Awesome crew, did my first jump with them.  Everyone was super fun and professional 10/10", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "114830647838214290511", "name": "Kyle David Johnson", "time": 1565650723666, "rating": 5.0, "text": "It was wild...first time on a plane. Never landed though lmao.", "pics": null, "resp": {"time": 1566429842837, "text": "Awesome!!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "113989156918587570536", "name": "Brian Hartman", "time": 1527453493237, "rating": 5.0, "text": "Friendly and awesome staff. The exsperienced jumpers and views were amazing!\n\nDEFINITLY CHECK THIS PLACE OUT!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "114574123285484280689", "name": "Kennady Thurston", "time": 1531322076466, "rating": 5.0, "text": "It was awesome! I would totally recommend! Head out here ASAP!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104710943809018989015", "name": "Rickey Smith", "time": 1535155030954, "rating": 5.0, "text": "It was the best 50 th Birthday that I ever had .amazing the people it skydive the gulf were great I will be back.thanks", "pics": null, "resp": {"time": 1535944152937, "text": "Thanks for spending your 50Th in the sky with us!!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "111666528223488072174", "name": "Kurt Umali", "time": 1518932608061, "rating": 5.0, "text": "I had an amazing experience from this place! They have great people and a very fun atmosphere!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "118009348529244850273", "name": "Scott W", "time": 1557700779502, "rating": 5.0, "text": "Absolutely the greatest experience EVER YOLO", "pics": null, "resp": {"time": 1559235176112, "text": "YOLO for sure! thanks fr coming out!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "108797047491378074533", "name": "garrett fisher", "time": 1521230054144, "rating": 5.0, "text": "Unbelievable view for a once in a lifetime jump! Thanks a million to the great guys and girls at \"sky dive the gulf\"!!!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "109348728761336491731", "name": "J Rob", "time": 1535903158934, "rating": 5.0, "text": "Had an absolute blast! Everyone had great vibes and were extremely professional, highly recommended 🤙", "pics": null, "resp": {"time": 1535943625181, "text": "Thank you Randy! We hope to jump with you again!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112904557609052301080", "name": "Tommy Wild", "time": 1557066855003, "rating": 5.0, "text": "Amazing staff and an amazing jump! Don’t question it, just do it!", "pics": null, "resp": {"time": 1557284612923, "text": "Thats right!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "107455937639649858916", "name": "Trace Adams", "time": 1584126944949, "rating": 5.0, "text": "Absolutely incredible time.", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "113009797469099116617", "name": "Joleen Green", "time": 1532446952278, "rating": 5.0, "text": "The entire team at Skydive The Gulf are simply amazing!     Because of these folks, my first skydive will NOT be my last!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "102404518991392481873", "name": "Ashley Cooper", "time": 1528727961633, "rating": 5.0, "text": "This was my first skydiving experience and also my first time to be in a plane. I was terrified because I have a fear of heights. Lee was my instructor and really helped me to overcome my fears. The instructors, pilot, and all staff made this an incredibly enjoyable experience. I will definitely be back!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117612649930278420304", "name": "Rose Monzingo", "time": 1520101029826, "rating": 5.0, "text": "GREAT experience!!!! Instructor Luke was awesome, felt really safe before jump and until landing. We will be back!!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "105845660234362306250", "name": "Jodi Clifton", "time": 1533590465024, "rating": 5.0, "text": "What a great time. Everyone there was knowledgeable and professional. Couldn’t have been better !!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "102074701823761817361", "name": "Ashley Vanderhoof", "time": 1526433458732, "rating": 5.0, "text": "Incredible experience and amazing staff who made everything comfortable and fun. Highly recommend Skydive the Gulf for a once in a lifetime experience!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "109411335865780637435", "name": "Chris Santmyer", "time": 1520704344378, "rating": 5.0, "text": "Jumped for the 1st time today. Amazing is an understatement! Great staff", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "107743403436840696542", "name": "Monica Cruz", "time": 1534109340493, "rating": 5.0, "text": "Amazing staff and beautiful views! I Highly recommend skydive the gulf!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117393715521379725033", "name": "Jordan Reeves", "time": 1533652074699, "rating": 5.0, "text": "They make everything so easy and enjoyable! You won’t regret it!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117024445298599378549", "name": "Caleb Q", "time": 1528578663771, "rating": 5.0, "text": "Such an awesome experience and awesome staff they are very friendly and very detailed by far one of the best exexperienes of my life", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "111771481659342832240", "name": "Living Life", "time": 1584221757304, "rating": 5.0, "text": "These guys are great!", "pics": null, "resp": {"time": 1592511707736, "text": "So are you!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116286267408124282114", "name": "BRS Be Right Service", "time": 1543815507284, "rating": 5.0, "text": "Awesome all the way around", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipP5Fh_xCWYjuPR8LznZU2kUciub57HUdzpzMYJx=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPXbpPM_5jkQUXGuWqAP1o-BIltVcmkEQ3eA3g6=w150-h150-k-no-p"]}], "resp": {"time": 1551049385666, "text": "Thank you see you again soon!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "105165307715402043471", "name": "Gulnara Kulmagambetova", "time": 1520704222013, "rating": 5.0, "text": "We have celebrated my husband's 30th birthday with \"Skydive the Gulf\". Awesome experience!!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117310589684993140419", "name": "joe miller", "time": 1563118672936, "rating": 5.0, "text": "10/10 would recommend again", "pics": null, "resp": {"time": 1563887609674, "text": "Thank you for jumping with us Joe!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "115147378330618342519", "name": "Ashley Graham", "time": 1528577281054, "rating": 5.0, "text": "1st time- great experience. The place and staff are awesome!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "109940615441570666293", "name": "Mallie Moore", "time": 1532190644393, "rating": 5.0, "text": "They people are so great! Awesome experience", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "118139731207494369366", "name": "Leisha Reaves", "time": 1589651658484, "rating": 5.0, "text": "YOLO! Would do it again in a heartbeat!!", "pics": null, "resp": {"time": 1592510925505, "text": "Come see us again Leisha"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "105865002138721394698", "name": "Kinzie Daniels", "time": 1554913978588, "rating": 5.0, "text": "Best group ever! Totally worth it! ❤️", "pics": null, "resp": {"time": 1555390711592, "text": "Thank you Kinzie!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "101195149871983519551", "name": "Pearl Mcl", "time": 1553618676415, "rating": 5.0, "text": "Awesome staff! Great experience!", "pics": null, "resp": {"time": 1554779155516, "text": "Thank you for choosing us Pearl!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "115098906453853555767", "name": "Mark McLain", "time": 1525276336157, "rating": 5.0, "text": "Great experience. Thank you for an awesome skydive.", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "109281008162699210904", "name": "Anne St Pierre", "time": 1539547264749, "rating": 5.0, "text": "Awesome, they made it so fun! Highly recommend!", "pics": null, "resp": {"time": 1549850419658, "text": "Thank you for jumping with us Anne! Hope to see you again."}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103283097466492316853", "name": "Amy Blue", "time": 1538244455030, "rating": 5.0, "text": "Amazing! I felt completely safe .The experience was unbelievable .Great instructor. I can't say enough good things", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117083840919791922925", "name": "Kyle Wagner", "time": 1525620393322, "rating": 5.0, "text": "Thank you!! I loved being at Skydive The Gulf and would for sure sky dive with them again!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104876494067735804436", "name": "Ella Davis", "time": 1530982469185, "rating": 5.0, "text": "Honestly best experience of a lifetime, only meeting the intrustors for five minutes and they feel like best friends. All I can say is go SKYDIVING!!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "114506293193228751365", "name": "Jeff Lascari", "time": 1532016325497, "rating": 5.0, "text": "Awesome experience, great instructors, Zack was great for my first jump!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117833079382565154732", "name": "perttu salminen", "time": 1531676288104, "rating": 5.0, "text": "Exellent experience, crew and facilities. Strongly recommend", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112575312652894542274", "name": "April Green", "time": 1532016156280, "rating": 5.0, "text": "Awesome!!! The best part was they let me fly the parachute. Everyone should try it.", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "118046928559865067478", "name": "Mattia Malacarne", "time": 1532732668490, "rating": 5.0, "text": "This experience is awesome! The teachers are funny and the jump is easy! I raccomend it to everyone! Both Italian and Americans! Sia italiani che americani! I’m Italian! 😉", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "100851495938442490834", "name": "Luke Church", "time": 1512696676827, "rating": 5.0, "text": "Skydiving over Orange Beach and Gulf Shores into the famous Florabama bar!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "108298544688936102782", "name": "Dawn Hollar", "time": 1530918667573, "rating": 5.0, "text": "Amazing!!  I loved the freefall the best.   It was exhilarating!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "105246385808518290204", "name": "Emma Robbins", "time": 1554847457541, "rating": 5.0, "text": "Blessed with smooth safe trip and the best staff!!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117215599531406132896", "name": "Sage Oranje", "time": 1570988898619, "rating": 5.0, "text": "Super friendly staff!", "pics": null, "resp": {"time": 1571228355583, "text": "Thank you Sage!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "108302146373088043513", "name": "Robin Dearick", "time": 1562016593382, "rating": 5.0, "text": "Amazing people! What a ride!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "110992783248447116048", "name": "Rick Hollar", "time": 1530914842871, "rating": 5.0, "text": "The ultimate experience!!!  Lee and all the staff were fantastic!  Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104998958704113885600", "name": "Kelly Hollar", "time": 1530918676536, "rating": 5.0, "text": "What an awesome experience! Luke was a great instructor!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117309257481014414661", "name": "Ryan Scully", "time": 1534638893120, "rating": 5.0, "text": "Awesome time! Highly recommended.", "pics": null, "resp": {"time": 1535944441361, "text": "Thanks Ryan!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "111636379945952635536", "name": "Ane Jurisic", "time": 1530312335604, "rating": 5.0, "text": "The staff is very attentive and welcoming for any and all newcomers!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "100622651817921028509", "name": "Marnie Davis", "time": 1522006383048, "rating": 5.0, "text": "What an awesome experience !!! Lee, Luke, Brooke, John and Kerri,.... We're so fun and made my 50th bday amazing and very memorable. I can't wait to do it again.\nIt's so nice to be around fun- loving people that are smart, safe and just alot of fun,\n😊💃💃💃🕺🕺🍀🍀🌈, Freefalling- Tom petty and Lee's a \"Rockstar\", post Malone, thanks guys", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117671665765977795999", "name": "Tameka Lindsay", "time": 1528580980671, "rating": 5.0, "text": "Awesome day!!!! Great customer service and amazing jumpers", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "100081605329078904268", "name": "Pasi Toivonen", "time": 1533043923441, "rating": 5.0, "text": "Good service... Friendly people... Professional skydive group..", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "100805475437102173883", "name": "Jerry Graham", "time": 1594588624133, "rating": 5.0, "text": "Fantastic Adventure", "pics": null, "resp": {"time": 1597802933483, "text": "Thank you Jerry!!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "114476077174458001511", "name": "austin lusher", "time": 1592602322084, "rating": 5.0, "text": "10/10 would do it again", "pics": null, "resp": {"time": 1593704732720, "text": "Thanks Austin!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116047834167413493576", "name": "whosthemat", "time": 1531583921369, "rating": 5.0, "text": "Quality people with a great fall! 🙌", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103406662562776325219", "name": "Tara Santosuosso", "time": 1561914892766, "rating": 5.0, "text": "What a great experience!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112276478361633805034", "name": "Wendy Ginn", "time": 1582471938531, "rating": 5.0, "text": "The man had the best time!!!", "pics": null, "resp": {"time": 1592515898116, "text": "Thanks for bringing him out!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "115598269432666816111", "name": "Greg W", "time": 1530982105867, "rating": 5.0, "text": "Most exhilarating experience of my life!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "105579296790356532164", "name": "Jordin daversa", "time": 1590858148879, "rating": 5.0, "text": "Great and awesome", "pics": null, "resp": {"time": 1592510368364, "text": "Thank you."}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "117616454487975092132", "name": "Chad Meller", "time": 1534286705129, "rating": 5.0, "text": "It was awesome s taff was amazing", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "101079088589601430426", "name": "David Hollar", "time": 1530918509458, "rating": 5.0, "text": "Great experience!  Highly recommended!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "111186205447461031620", "name": "Nicolette Meredith", "time": 1537792426401, "rating": 5.0, "text": "Amazing experience with friendly staff.", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "108200382824954853244", "name": "Chris Bruce", "time": 1527453540645, "rating": 5.0, "text": "Awesome experience and a great pepole!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "113582209001706487381", "name": "June Lee", "time": 1552760249769, "rating": 5.0, "text": "First jump and loved it ..", "pics": null, "resp": {"time": 1553525920668, "text": "Awesome!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "113357116398570835220", "name": "Ginjer Wulff", "time": 1537559582523, "rating": 2.0, "text": "Booked with them last week. Confirmed our jump with them the day before. Drove to alabama to do the jump, and 1 hour before our take off time, the guy calls and says they dont have a plane.", "pics": null, "resp": {"time": 1537580625417, "text": "Hello Ginger, We would like to sincerly apoligize that you had to drive and were not able to jump. In regaurds to the reason, Saftey is our number one priority! We would never want to put you as our customers or our instructors in danger. Planes do have problems just like cars. We are so sorry that an issue came up in time of you reservation. We Flew a diffrent plane in this evening and we will be back in business first thing tomorrow. Like we explained on the phone we would love for you to skydive with us. If you read any of the reveiws of any one who has jumped with us you will see we are a strong team and we love making our customers happy.\nWe hope you understand and are able to forgive us.\nBlue Skies,\nthe Team at Skydive The Gulf"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "110616330126762377846", "name": "Chaise Coffey", "time": 1533589281541, "rating": 5.0, "text": "Staff was friendly and very informative!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "108647494138244293612", "name": "Madison Brown", "time": 1564424871306, "rating": 5.0, "text": "Such a great experience and such a great staff!!!!10 out of 10 recommend!!!!!", "pics": null, "resp": {"time": 1564625054794, "text": "Thank you Madison!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "113655887191703451858", "name": "Di Chen", "time": 1534952697917, "rating": 5.0, "text": "One of the best experiences ever!", "pics": null, "resp": {"time": 1535944198548, "text": "We agree!! Thanks for choosing us!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103042388686809010902", "name": "Mary Griffin", "time": 1559426183769, "rating": 5.0, "text": "Awesome people, awesome experience!!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "108249091368449643992", "name": "AustinLukeOfficial", "time": 1522159753649, "rating": 5.0, "text": "Perfect place to spend my birthday", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "107933499761275729108", "name": "shanta westry", "time": 1528581352044, "rating": 5.0, "text": "Holy Biscuits and Gravy!!!!!!!!! Best trip ever!!!!! Lee you are awesome! Will be back again.", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "113676878527005321390", "name": "Tamara Mizell", "time": 1572819844541, "rating": 5.0, "text": "Everything was amazing! !!", "pics": null, "resp": {"time": 1572834501029, "text": "Thanks Tamara"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "109266498288956179807", "name": "Amy Welty", "time": 1539384937150, "rating": 5.0, "text": "Omg!! BEST. EXPERIENCE. EVER!!! I'll be back!", "pics": null, "resp": {"time": 1553526228924, "text": "Cant wit to see you Amy!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "105073815811065470625", "name": "tristin prince", "time": 1564520093301, "rating": 5.0, "text": "incredible experience!!!!!", "pics": null, "resp": {"time": 1576068406872, "text": "Thank you Tristin!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104876525706668877081", "name": "Katie Caldwell", "time": 1560797672200, "rating": 5.0, "text": "Awesome!!! The clouds were amazing!!! Loved it!!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "102143625973134857517", "name": "Jennifer Ellison", "time": 1534087233986, "rating": 5.0, "text": "Incredible experience!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "105847708846790569521", "name": "Gail Lafleur", "time": 1557164350509, "rating": 5.0, "text": "Awesome", "pics": null, "resp": {"time": 1557284584400, "text": "Thanks Gail!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "105505638685915999837", "name": "Alexander Thomas", "time": 1554070491293, "rating": 5.0, "text": "This experience was amazing!!", "pics": null, "resp": {"time": 1554779087302, "text": "Its the best, thank you for choosing us!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104530472308880323102", "name": "Jan Rogers", "time": 1562345845232, "rating": 5.0, "text": "Amazing!! Great group of owners and instructors!!!!", "pics": null, "resp": {"time": 1563070346699, "text": "Thank you Jan"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "115599346154795002535", "name": "Libby Thompson", "time": 1565140382000, "rating": 5.0, "text": "The best experience ever!!! Will be back!!!", "pics": null, "resp": {"time": 1566429930201, "text": "Thank you Libby. See you soon!!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "109238540213835553410", "name": "Lindsey Dunn", "time": 1553357066237, "rating": 5.0, "text": "A check off the bucket list!", "pics": null, "resp": {"time": 1553525510551, "text": "Thank you for choosing us for your Tandem jump!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116763614435832010529", "name": "Brandy Dailey", "time": 1567439227833, "rating": 5.0, "text": "Duh best", "pics": null, "resp": {"time": 1576068385723, "text": "Thanks!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104853435532281976599", "name": "Brenda Brown", "time": 1564425283924, "rating": 5.0, "text": "Absolutely  incredible!!!", "pics": null, "resp": {"time": 1564625027976, "text": "Thank you Brenda!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "100638422263734371839", "name": "tyler johanson", "time": 1529703618326, "rating": 5.0, "text": "Had a blast!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "109713465039855778777", "name": "Michael Dunn", "time": 1553357460835, "rating": 5.0, "text": "Freaking amazing!", "pics": null, "resp": {"time": 1553525485192, "text": "Thank you Michael!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "110306273580014613108", "name": "Eric Buer", "time": 1522772907270, "rating": 5.0, "text": "Total Pros from every aspect; brief, flight, instructors and, of course, the jump!!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "110126305023032791253", "name": "Lauris Joyner", "time": 1557700907041, "rating": 5.0, "text": "Very cool", "pics": null, "resp": {"time": 1559235159367, "text": "Thank you!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "116469323542830403098", "name": "Steven Agudelo", "time": 1530997992834, "rating": 5.0, "text": "Pretty rad", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "106868373297736273964", "name": "Danielle Files", "time": 1559574135642, "rating": 5.0, "text": "The guys are awesome!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "109195010078994885089", "name": "Brian", "time": 1531155180583, "rating": 5.0, "text": "Had a great time!!  Do it!!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "112622290148623750378", "name": "Terri Pietrzak", "time": 1538242365985, "rating": 5.0, "text": "Had a great time at Skydive the Gulf!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "102507579011182593632", "name": "Will Arrington", "time": 1555457457458, "rating": 5.0, "text": "Loved it!!!", "pics": null, "resp": {"time": 1556416025253, "text": "Thank you for choosing us o jump with."}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "102649245478808548128", "name": "Adam Cook", "time": 1553357460845, "rating": 5.0, "text": "Amazing Experience!!!!!", "pics": null, "resp": {"time": 1553525472242, "text": "Thank you Adam!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "109036130361468693197", "name": "Brad Polk", "time": 1559663601438, "rating": 5.0, "text": "Awesomeness!!!!!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "103252575659384407627", "name": "Karen Boyd", "time": 1522529355838, "rating": 5.0, "text": "Amazing!!", "pics": null, "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "104900240272459917065", "name": "Christopher Müller", "time": 1558711658135, "rating": 5.0, "text": "(Translated by Google) It was a great experience. Great teacher and pure adrenaline. I would do it again anytime! Thank you\n\nIt was a great experience. Great teacher and pure adrenaline. I would do it again anytime. Tank you\n\n(Original)\nEs war ein super tolles Erlebnis. Super Lehrer und Adrenalin pur. Ich würde es jederzeit wieder tun! Danke\n\nIt was a great experience. Great Teacher and pure adrenaline. I would do it again anytime. Tank you", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMM7kteMQxDxJqE45NViTvsZIxMzqLWDCXBZizB=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
{"user_id": "106886162415186412605", "name": "Wolfgang Strauss", "time": 1558778884468, "rating": 5.0, "text": "(Translated by Google) It was a great experience. Great teacher and pure adrenaline! Thank you\n\nIt was a great experience. Great teacher and pure adrenaline. Thank you\n\n(Original)\nEs war ein super tolles Erlebnis. Toller Lehrer und Adrenalin pur! Danke\n\nIt was a great experience. Great Teacher and pure adrenaline. Thank you", "pics": null, "resp": {"time": 1559234933289, "text": "Thank you Wolfgang!"}, "gmap_id": "0x8890a0a606b27d91:0xc7057dfbd1cbce9e"}
