{"user_id": "107100863158548530864", "name": "judy adamson", "time": 1599431805537, "rating": 5.0, "text": "I have been trying to find out for over a year what was wrong with me. I went to see Dr Varquez at serenity sleep lab and omg it had been the best experience ever. She not only found my problem it is getting fixed right away. The place is so nice and peaceful. Great rooms with huge bathrooms and very comfortable beds. The tech I had was also excellent. So nice and treated you like a person not a patient or a number.\nI would and already have recommended this place and Dr Varquez for help with any problems you have not just your heart. Which she is an excellent cardiologist. She is my doctor for life.", "pics": null, "resp": null, "gmap_id": "0x8889c94ab0d25b41:0x8c8cfd87f3b5fe53"}
{"user_id": "108867396310918891673", "name": "Jeremy Payne", "time": 1605713846417, "rating": 5.0, "text": "The staff at Serenity were very professional and friendly. They gave me several masks to try to get a great fit. On short sleep, I still awoke refreshed.\nJerica took plenty of time to get my settings correct for my needs.\n\nGreat crew and facility.", "pics": null, "resp": null, "gmap_id": "0x8889c94ab0d25b41:0x8c8cfd87f3b5fe53"}
{"user_id": "100302828790503213575", "name": "Nisa Briana", "time": 1590344361573, "rating": 5.0, "text": "I was having trouble sleeping peacefully through the night until I came to serenity sleep lab.\nThe technician was so kind and very professional at all times, they answered any and all questions I had to assure I’d get the proper help needed. The facility as well as the rooms were extremely sanitary as well as comfortable.  I've had the best sleep since my visit and I highly recommend them!", "pics": null, "resp": null, "gmap_id": "0x8889c94ab0d25b41:0x8c8cfd87f3b5fe53"}
{"user_id": "104093559233400833833", "name": "Jan Childers", "time": 1596152852171, "rating": 5.0, "text": "Wonderful staff. Clean comfortable sleep area. Finally a Dr and staff that I can trust that will listen to me and help me. Would recommend to anyone.", "pics": null, "resp": null, "gmap_id": "0x8889c94ab0d25b41:0x8c8cfd87f3b5fe53"}
{"user_id": "101278467343576179027", "name": "chris storey", "time": 1594776382383, "rating": 5.0, "text": "The woman at the front desk is absolutely wonderful she is helpful and you can see she genuinely loves her career! The woman that calls you back and asks you the questions is extremely rude and I mean very condescending. She acts like you are a problem. Someone needs to teach her customer service and knock her down a few pegs. And of course no comment from the owner about this one. Someone called and spoke with with my fiance today and apparently this woman no longer works there and you reached out to make it right and thats what matters. Thank you for doing that so this  will be the reason I change this today.", "pics": null, "resp": null, "gmap_id": "0x8889c94ab0d25b41:0x8c8cfd87f3b5fe53"}
{"user_id": "117399799681376171961", "name": "Cheri Gibbs", "time": 1596163075423, "rating": 5.0, "text": "My husband had an amazing experience at Serenity Sleep Lab. After receiving his CPAP machine, he sleeps so much better and can tell a difference in his overall health. Dr. Varquez comes highly recommended by our family! If you need a sleep study, this is the best place in Cullman.", "pics": null, "resp": null, "gmap_id": "0x8889c94ab0d25b41:0x8c8cfd87f3b5fe53"}
{"user_id": "105420668949365868576", "name": "Kayla Beth Drake", "time": 1592432571618, "rating": 5.0, "text": "This place is amazing!! They have took care of my husband and has been so sweet to us!! Highly recommend", "pics": null, "resp": null, "gmap_id": "0x8889c94ab0d25b41:0x8c8cfd87f3b5fe53"}
{"user_id": "115765352531427499044", "name": "chad martin", "time": 1596246517877, "rating": 5.0, "text": "The whole experience was amazing. The staff was truely awesome, and Dr. varquez was spot on with my diagnosis and truely passionate at what she does. And the staff is very nice and very helpful! The sleep study room is like being in a 5 star hotel, private bathroom, tv, very comfy bed, and a machine that makes nature sounds to help you go to sleep! I absolutely highly recommend you to go here, and im very very thankful that i did, because it has changed my life! And you can get your results the next morning after the study, dr. varquez comes in and talks to you in your room and gives you the results. And the biggest thing you can receive your cpap machine after as well! alot of places wont do that", "pics": null, "resp": null, "gmap_id": "0x8889c94ab0d25b41:0x8c8cfd87f3b5fe53"}
{"user_id": "101797270115071893055", "name": "Brenda Holmes", "time": 1566948926053, "rating": 5.0, "text": "Calm environment. Comfortable bed. Tech very friendly and knowledgeable. Would recommend this sleep lab to anyone", "pics": null, "resp": null, "gmap_id": "0x8889c94ab0d25b41:0x8c8cfd87f3b5fe53"}
{"user_id": "111322020197142170254", "name": "Shondra Patterson", "time": 1571247692713, "rating": 5.0, "text": "Great atmosphere! Friendly staff. Dr Varquesz is great at what she does! She researches until she finds the answers you need! Great doctor great staff!", "pics": null, "resp": null, "gmap_id": "0x8889c94ab0d25b41:0x8c8cfd87f3b5fe53"}
{"user_id": "115390020647868941954", "name": "Alyssa", "time": 1577981608672, "rating": 5.0, "text": "I just completed my second sleep study at Serenity Sleep Lab. I was able to get my machine and mask from SSL without going thru a medical supply company. Great Experience! The room is set up very well with a private bath. The sleep tech is very knowledgeable and friendly. Dr.Varquez comes in early to go over the results, which is wonderful. I was even able to make it to work the next morning!", "pics": null, "resp": null, "gmap_id": "0x8889c94ab0d25b41:0x8c8cfd87f3b5fe53"}
{"user_id": "110931831646331026376", "name": "Molly Chesser-Black", "time": 1581797782521, "rating": 5.0, "text": "Love dr Varquez and her staff that conducted my sleep studies!!! Dr. Varquez helped with my restless legs, restless sleep, and my heart!!! Now I have a much better quality sleep experience.", "pics": null, "resp": null, "gmap_id": "0x8889c94ab0d25b41:0x8c8cfd87f3b5fe53"}
{"user_id": "109356893086196791062", "name": "Ronnie", "time": 1579973109987, "rating": 5.0, "text": "Thanks for taking care of my sleep apnea. Great staff. Professional.", "pics": null, "resp": null, "gmap_id": "0x8889c94ab0d25b41:0x8c8cfd87f3b5fe53"}
{"user_id": "101640392839580845865", "name": "Sandra Chambers", "time": 1580437024897, "rating": 5.0, "text": "The best sleep study ever and I have been to Birmingham,Cullman the teck was so friendly and very good at her job and Dr. Varques is their first thing in morning to let you know how your study went .. Getting my new c-pap and pressure on what I needed was handled in a quick manner . I've had the best sleep since my visit with Serenity Sleep Cullman Alabama .. I highly recommend them ..", "pics": null, "resp": null, "gmap_id": "0x8889c94ab0d25b41:0x8c8cfd87f3b5fe53"}
{"user_id": "107033488402229408013", "name": "Jeremy Erby", "time": 1605711276165, "rating": 5.0, "text": "Great service and staff", "pics": null, "resp": null, "gmap_id": "0x8889c94ab0d25b41:0x8c8cfd87f3b5fe53"}
{"user_id": "105627769130134708403", "name": "Eric White", "time": 1596038426646, "rating": 5.0, "text": "since visiting Dr Varquez\noffice, my sleep quality has increased.", "pics": null, "resp": null, "gmap_id": "0x8889c94ab0d25b41:0x8c8cfd87f3b5fe53"}
{"user_id": "107364841369420735953", "name": "Dee bowden", "time": 1504701721253, "rating": 1.0, "text": "I would never go to this place,  my husband went and it's  been 4 months can't get them to do anything for him they won't return phone calls this place is a joke  my advice don't even bother with these people, go to Birmingham!!!!", "pics": null, "resp": null, "gmap_id": "0x8889c94ab0d25b41:0x8c8cfd87f3b5fe53"}
{"user_id": "111514607021484662517", "name": "Michele Willingham", "time": 1624634785734, "rating": 5.0, "text": "The staff was patient and knowledgeable. They were very professional and kind to me. Will definitely be returning for all my future needs. Shelby was amazing!", "pics": null, "resp": {"time": 1626964648119, "text": "American Sleep Medicine strives to provide great patient care every day to every patient."}, "gmap_id": "0x888904b447e411d3:0xee95a4471eddccea"}
{"user_id": "108368440167256862206", "name": "Zachary Taylor", "time": 1624638125346, "rating": 5.0, "text": "Rooms were clean and neat. Staff was fantastic! Very knowledgeable, professional, and friendly. The location is in a nice, but secluded area.", "pics": null, "resp": {"time": 1626964643344, "text": "American Sleep Medicine strives to provide great patient care every day to every patient."}, "gmap_id": "0x888904b447e411d3:0xee95a4471eddccea"}
{"user_id": "116897960179986085560", "name": "Gayle Payton", "time": 1624901555067, "rating": 1.0, "text": "I did the at-home sleep study. A device was provided for  me to wear at home.    My results showed that I had sleep apnea.   In order to get a CPap device, they said I had to come spend the night there.   They should have told me that in the beginning.   I have found someone else to do at-home study without going in.   Now I have to wait for insurance to cover again.", "pics": null, "resp": {"time": 1626964633836, "text": "American Sleep Medicine strives to provide great patient care every day to every patient."}, "gmap_id": "0x888904b447e411d3:0xee95a4471eddccea"}
{"user_id": "114120241071453314875", "name": "Misty Stokes", "time": 1614876867581, "rating": 5.0, "text": "Had my first sleep study this week. The staff was super nice especially Justin who was on the night staff. He is so kind and so professional. He apologized every time he had to come in to my room for something. The next morning he was so cheerful and made me forget how tired I was for a bit. I would definitely recommend them.", "pics": null, "resp": {"time": 1626964845180, "text": "American Sleep Medicine strives to provide great patient care every day to every patient."}, "gmap_id": "0x888904b447e411d3:0xee95a4471eddccea"}
{"user_id": "108241669187498301514", "name": "dev312589", "time": 1617933954549, "rating": 5.0, "text": "Amanda & Shelby did a great job in helping me figure out how to solve my sleep apnea. These guys are pros and the facility is very nice.", "pics": null, "resp": {"time": 1626964759862, "text": "American Sleep Medicine strives to provide great patient care every day to every patient."}, "gmap_id": "0x888904b447e411d3:0xee95a4471eddccea"}
{"user_id": "115333937066261779266", "name": "Lisa Preston", "time": 1617217459892, "rating": 5.0, "text": "Conner was an excellent tech during my sleep study\nHe was Very professional 👏\nI couldn't have ask for a better tech\nI was a little nervous at first but he made me feel comfortable\nConner is a rock star !!!", "pics": null, "resp": null, "gmap_id": "0x888904b447e411d3:0xee95a4471eddccea"}
{"user_id": "109428279547210281688", "name": "Nicholas Coker", "time": 1612560296114, "rating": 5.0, "text": "Had been having some trouble with my sleep apnea, and these folks took great care of me. Process was simple in that had I had a consultation with one of their doctors (Dr. Nabi) and then came in for a sleep study. Their facility was comfortable, and I was surprised to see all the amenities they had (i.e. a private bathroom complete with a shower and soaps). It was very easy for me to fall asleep as well—the rooms have no windows, so it's nice and dark, and it was very quiet as well. I was told I would receive my results in 7-10 days, but I heard back much sooner after 3 days. Throughout the whole process, the entire staff was very friendly and seemed genuinely committed to help me with my problem and make sure I was covered (an attitude I've found to be surprisingly rare in the healthcare world, especially after the COVID-19 pandemic). Overall, highly recommend for anyone needing a sleep study.", "pics": null, "resp": null, "gmap_id": "0x888904b447e411d3:0xee95a4471eddccea"}
{"user_id": "113105674958251866560", "name": "BOBBY PHILLIPS", "time": 1623189440370, "rating": 2.0, "text": "Went and did the sleep study 10 days ago, and still no results.", "pics": null, "resp": {"time": 1626964674984, "text": "American Sleep Medicine strives to provide great patient care every day to every patient."}, "gmap_id": "0x888904b447e411d3:0xee95a4471eddccea"}
{"user_id": "108467804926329475119", "name": "Kristin Weldon", "time": 1484363905230, "rating": 5.0, "text": "My cardiologist referred me here. It was a great experience considering having a sleep disorder. The Dr was very thorough during my consultation. The staff was very friendly and my sleep study was easy and painless!! Received my medical equipment from the inhouse provider and couldn't have made a better choice!! This facility is now under new management from what I hear- and it's WONDERFUL. If you have to have a study, sleep here!!!", "pics": null, "resp": null, "gmap_id": "0x888904b447e411d3:0xee95a4471eddccea"}
{"user_id": "111781012032362001653", "name": "S Henderson", "time": 1522933913322, "rating": 5.0, "text": "My boyfriend recently completed a study here and the staff was very nice and knowledgeable. I would recommend this facility. The beds aren't new but the environment is clean and inviting.", "pics": null, "resp": null, "gmap_id": "0x888904b447e411d3:0xee95a4471eddccea"}
{"user_id": "100885222931244584172", "name": "Adam Meadows", "time": 1462829912134, "rating": 5.0, "text": "I didn't have to wait long for an appointment or follow-up.  I had to wait nearly a month to get in at another local sleep lab.  The staff was very professional.  My technician was very professional and friendly, and shared his knowledge throughout the process.  Had my initial study AND my study with CPAP both completed inside of 2 weeks.  Rooms were quiet and comfortable and I have NO complaints.", "pics": null, "resp": null, "gmap_id": "0x888904b447e411d3:0xee95a4471eddccea"}
{"user_id": "104298551430992645247", "name": "Cory York", "time": 1582721434907, "rating": 5.0, "text": "Great providers. Explain things well.", "pics": null, "resp": null, "gmap_id": "0x888904b447e411d3:0xee95a4471eddccea"}
{"user_id": "102101229978312676876", "name": "Bryan Benson", "time": 1455910706338, "rating": 5.0, "text": "Great Experience and everyone was very helpful. I really don't know how you could beat their service, but as you can see from the posts, some people you just can't make happy. I highly recommend!", "pics": null, "resp": null, "gmap_id": "0x888904b447e411d3:0xee95a4471eddccea"}
{"user_id": "111069223727151187821", "name": "Claudette Lovvorn", "time": 1487787872661, "rating": 1.0, "text": "American Sleep Centers is a good place to have a sleep study but their affiliate, American Sleep Products, is a terrible place to buy your equipment.  Everything was fine for me up until the point of billing, when the nightmare started.  They gave me wrong information about the estimated amount due (off by $500), waited 14 months to bill me, then gave me a different story every time I called about it.  Not even the bare minimum of an apology or recognition of any error on their part whatsoever.  Some of the worst customer service I have ever experienced.  I only gave it one star because zero isn't a choice.", "pics": null, "resp": null, "gmap_id": "0x888904b447e411d3:0xee95a4471eddccea"}
{"user_id": "104347868410212403580", "name": "Amy D", "time": 1522975882442, "rating": 1.0, "text": "Never been so disrespected in my life. That older woman Jenifer  needs some lesson in manners and that whole place needto learn to put patients first. Don't go here..", "pics": null, "resp": null, "gmap_id": "0x888904b447e411d3:0xee95a4471eddccea"}
{"user_id": "117725637748564385260", "name": "Seven Bomani", "time": 1528314858471, "rating": 2.0, "text": "I CLEARLY asked what would be the charge of this procedure according to my insurance and was given an answer of no charge to me. Later I was hit with a $700 bill and a fee of $600 plus dollars for the CPAP machine. If I had known this in advance I would have most definitely waited until I had saved up to afford it. PLUS THEY KILLED MY INSURANCE IN FEES.\nAlthough my experience of the actual sleep study wasn't bad, I felt hustled out of money I did not have to spend at that time. I dislike liars, therefore I give them 2 stars and a big DO NOT GO to this place.", "pics": null, "resp": null, "gmap_id": "0x888904b447e411d3:0xee95a4471eddccea"}
{"user_id": "108993032324928278617", "name": "Rock Hobbs", "time": 1516744783909, "rating": 1.0, "text": "Worst service I have ever seen. Unprofessional and very unorganized. They have multiple companies and doctors working on their own schedules and noone is in charge. Beds are shabby and night staffing is very limited. Three weeks out and still no doctors report or notes available so I can't get the equipment!!!! Still no sleep...Don't think they care! Don't go there.", "pics": null, "resp": null, "gmap_id": "0x888904b447e411d3:0xee95a4471eddccea"}
{"user_id": "104994876914800451991", "name": "Brian Stevenson", "time": 1461717861711, "rating": 5.0, "text": "Very friendly and professional staff. The atmosphere was more like a nice hotel stay, rather than a hospital. I don't know how a sleep study could go any smoother.", "pics": null, "resp": null, "gmap_id": "0x888904b447e411d3:0xee95a4471eddccea"}
{"user_id": "106347455523946843032", "name": "Yung Mew", "time": 1515145524145, "rating": 1.0, "text": "Left several unanswered messages to obtain a CPAP via insurance only to be told they were “back ordered.”  When I finally was contacted by the company they advised me it was my fault and that the insurance had lapsed and it did not meet my deductible, even though I called a month in advance.  This company is terrible at handling proper business and I strongly advise you to seek sleep treatment elsewhere", "pics": null, "resp": null, "gmap_id": "0x888904b447e411d3:0xee95a4471eddccea"}
{"user_id": "104718305175667154965", "name": "Derick Oglesby", "time": 1553103831887, "rating": 1.0, "text": "I needed my machine adjusted because its forcing way to much air into my stomach so i called to make an appointment. Well the girl says i dont need an appointment i can walk in anytime. I skipped lunch at work to take my machine to their office and when i got there they said no you need an appointment. They said i could come back around 3 which would make me miss several hours of works. I said i couldnt do that and they say well he is out all next week so we cant get you in till he gets back. So now i have a very expensive bipap machine thats just a paperweight for the next few weeks", "pics": null, "resp": null, "gmap_id": "0x888904b447e411d3:0xee95a4471eddccea"}
{"user_id": "110409109604769107758", "name": "Rosamaria Sabatino", "time": 1470231433630, "rating": 5.0, "text": "Excellent customer service, more businesses should have customer service employees like Tiffany and Desiree, they are very knowledgeable of the products and have great people skills, very helpful and respectable, and when they tell you that they will call you back .....THEY DO!", "pics": null, "resp": null, "gmap_id": "0x888904b447e411d3:0xee95a4471eddccea"}
{"user_id": "101395371326757386272", "name": "Michael Steffens", "time": 1382019986590, "rating": 1.0, "text": "If I could give it no stars, I would. Despite being clear that I needed CPAP titration at my appointment, they had no idea why I was there, or who I was to see. They wanted me to fill out paperwork that completely didn't apply (a release for an insurance company I don't have) and authorize thousands of dollars of tests in advance that I don't need. Every interaction marked them as not having any idea what they were doing or why. When I wrote to the contact email on their website, it bounced as being nonexistent. Do yourself a favor and find a different provider.", "pics": null, "resp": null, "gmap_id": "0x888904b447e411d3:0xee95a4471eddccea"}
{"user_id": "116739407767726560808", "name": "Melanie Strauss", "time": 1516854065041, "rating": 5.0, "text": "Staff was friendly. Process was easy. No complaints!", "pics": null, "resp": null, "gmap_id": "0x888904b447e411d3:0xee95a4471eddccea"}
{"user_id": "115938688543386964136", "name": "Michelle Coleman", "time": 1477406608064, "rating": 1.0, "text": "CAN NOT SAY ANYTHING GOOD ABOUT THIS PLACE.  I THINK IT'S A SCAM.  IF YOU HAVE A SLEEP DISORDER AND REQUIRE MORE THAN A CPAP, WHICH IS THEIR SPECIALTY, THEN YOU ARE SOL MY FRIEND.\nTHEY ARE SUPER FRIENDLY AND ALL SMILES AS LONG AS YOU GET THAT CPAP MACHINE AND PRETEND TO BE HAPPY AND DO NOT CALL THEM BACK FOR ANY TYPE OF ASSISTANCE.  MY DOCTOR WAS DR. JAY HEIDECKER, MAYBE IT'S JUST HIM...\n(I had to pick 1 star for it to post)", "pics": null, "resp": null, "gmap_id": "0x888904b447e411d3:0xee95a4471eddccea"}
{"user_id": "105087612454626850953", "name": "joe hill", "time": 1511142832530, "rating": 1.0, "text": "Their doctor left and now they have some substitutes that are only interested in your money. Don't go. The care is horrible now and you will be miserable.", "pics": null, "resp": null, "gmap_id": "0x888904b447e411d3:0xee95a4471eddccea"}
{"user_id": "102786846818074904359", "name": "B Stutts", "time": 1366838840452, "rating": 2.0, "text": "Poor service - except for the one night nurse who was freiendly, concerned and helpful.\n\nStaff in follow up to receive information were unprofessional and even combative at times.  Place seems in need of an attitude adjustment.\n\nUse another service to get the equipment for sure.", "pics": null, "resp": null, "gmap_id": "0x888904b447e411d3:0xee95a4471eddccea"}
{"user_id": "101592307182319112377", "name": "Bama Fan", "time": 1523834284143, "rating": 1.0, "text": "Itchy, blotchy, real red skin after my sleep test. Turns out it may have been bed bugs from this place!'!' Be aware!'!!", "pics": null, "resp": null, "gmap_id": "0x888904b447e411d3:0xee95a4471eddccea"}
{"user_id": "113649188073578500051", "name": "Jennifer Laird", "time": 1501013157323, "rating": 1.0, "text": "Horrible experience. I have been dealing with inept administrative staff at this facility for five weeks since my initial appointment and still do not have a date for my sleep study.  I am taking my business elsewhere.", "pics": null, "resp": null, "gmap_id": "0x888904b447e411d3:0xee95a4471eddccea"}
{"user_id": "100044950640218494197", "name": "Janet Hartmann", "time": 1435156394699, "rating": 1.0, "text": "Very unhappy with my first sleep study!!  After the study I was called to say that it was very important that I come back in, as soon as possible, for the CPAP fitting.  I thought I could possibly DIE if I didn't.  Then, after the fitting, I HEARD NOTHING!!!  When I called back to see what the next step was, I was told that my sleep apnea was mild to moderate and no need to worry......they just wanted the 2 different $50.00 copays from me!!  Then, I found out from my insurance company that I should have been charged only $25.00 per visit, not $50.00 per visit!  I wonder how many people are told that they owe 50.00 when they only owe 25.00.   Let's see how long it takes this \"scam\" to send me a refund check....  UPDATE>>>>>>Its been 4 WEEKS and I haven't received a refund check!\n\nAlso, I always have to use the restroom in the middle of the night and I was told that I only had to let them know and they would come, immediately, and unhook me........I let them know at 2:00am that I had to get up.......no one responded until 2:45am........glad it wasn't an emergency.\n\nNOT A GOOD EXPERIENCE!!!  I will now be going to UAB to have the study done again.", "pics": null, "resp": null, "gmap_id": "0x888904b447e411d3:0xee95a4471eddccea"}
{"user_id": "114613173807866049030", "name": "Paige Roy", "time": 1546988998747, "rating": 5.0, "text": "They have the nicest staff and nice facilities.", "pics": null, "resp": null, "gmap_id": "0x888904b447e411d3:0xee95a4471eddccea"}
{"user_id": "111522455413489942046", "name": "Keri Ann", "time": 1525297968513, "rating": 2.0, "text": "They reuse masks after your study and then takes weeks to give results. Very frustrated patient", "pics": null, "resp": null, "gmap_id": "0x888904b447e411d3:0xee95a4471eddccea"}
{"user_id": "104346791129942104147", "name": "Rhonda Lockhart", "time": 1449609893706, "rating": 5.0, "text": "Excellent atmosphere but a bit of noise. Very professional staff.", "pics": null, "resp": null, "gmap_id": "0x888904b447e411d3:0xee95a4471eddccea"}
{"user_id": "108370784479449481763", "name": "Aaron Powell", "time": 1511296983924, "rating": 1.0, "text": "Very painful process. They over charged me and double billed my health insurance. Took months to fix. Save yourself go somewhere else.", "pics": null, "resp": null, "gmap_id": "0x888904b447e411d3:0xee95a4471eddccea"}
{"user_id": "101283210856053642610", "name": "Dan Little", "time": 1495553714817, "rating": 1.0, "text": "wow - these guys are AWFUL - they are more interested in churning fees than providing adequate care - DO NOT GO HERE - there are better options", "pics": null, "resp": null, "gmap_id": "0x888904b447e411d3:0xee95a4471eddccea"}
{"user_id": "117946633908273184465", "name": "Blazers Fan", "time": 1548908444157, "rating": 1.0, "text": "DOCTOR STEPHEN IS NO LONGER THERE. Was told he was out of office for the day. I arrived to find that he was no longer working there. Service has greatly declined and I will not be returning.", "pics": null, "resp": null, "gmap_id": "0x888904b447e411d3:0xee95a4471eddccea"}
{"user_id": "100188475556070003347", "name": "David Sweet", "time": 1625257916749, "rating": 1.0, "text": "These are some of the rudest people l have ever encountered. You cannot get anywhere with anyone in person, or on the phone. They like to hide behind the phone so they can continue to be rude and then put you on hold for so long in hopes that you will hang up.\n\nI understand there is construction going on, but why would you allow them to park their machinery or put their supplies in the handicap spots. Handicap parking is already limited, especially van accessible spots.", "pics": null, "resp": {"time": 1625674720666, "text": "Hi Mr. Sweet, we would like to discuss this matter further. Will you please call our office at 414-5900 and ask to speak with the operations manager so that we can help resolve any issues that may be. All the best, and we look forward to hearing from you soon."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "114122180049592975248", "name": "Abigail Laird", "time": 1628755521857, "rating": 1.0, "text": "I've had constant pain for years now and because I'm young the doctors feel \"uncomfortable\" trying more serious treatments even though I'm losing my whole life to this pain. For over 2 years I have had to wait 1 to 2 months for my doctors appointments and every appointment they tell me the same thing and go in circles with me, refusing to progress treatment. On top of that when they reply to reviews they copy and paste the same message over and over again. They are not listening to me and they won't listen to you. They don't care.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "100072144027300149007", "name": "V White", "time": 1623944197402, "rating": 1.0, "text": "At first doctor was nice the first few visits. Then the doctor started to act like he did want to be bothered. Came in leaned against the cabinet acting like I was a waste of his time. Yesterday stated he didn’t keep track of my health that I saw specialist for that let them keep track of my seizures and heart. He was only there for general things. But yet he is required by law and my insurance to keep track of who I see and my medical records. To which he demanded I find another doctor all because my disability lawyer asked if he could give his opinion on a form since he was to be talking with all doctors he referred me to. The billing and customer service department of the group believe that I got what I deserve and the doctor is correct. I am a person that has seizures and has AFib and has not been driving since a wreck to where this is the second general practitioner has refused to listen as a doctor should. And force me to find another doctor and the cost of losing everything because of they don’t care.", "pics": null, "resp": {"time": 1624291869282, "text": "We would like to discuss this matter further, so we encourage you to call our office at 414-5900 and ask to speak with the operations manager so that we can help resolve any issues that may be. All the best, and we look forward to hearing from you soon."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "110408389021647933884", "name": "The Sullivans", "time": 1616935158158, "rating": 5.0, "text": "The doctors are very thorough! The nurses, lab techs, and the entire staff are very professional, helpful, friendly.\nThe Follow my Health app that the doctor office use is very helpful to me. I can keep up with all of my lab results and be made aware of any changes in minutes.\nI would highly recommend A.M.G.", "pics": null, "resp": {"time": 1621282650025, "text": "Thank you for the kind words and the 5-star review. Our healthcare team takes great pride in creating an environment where patients receive quality, individualized and compassionate medical care. Thanks again for the feedback!"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "108259019381558190450", "name": "Miss Shauntay", "time": 1618478030563, "rating": 1.0, "text": "If you have a bill you can’t even make an appointment. They are going to constantly push that bill in your face. Not only that Dr. Carlos doesn’t care about his patients. More than once he’s come in seen me for 2 minutes and dumped me out. I didn’t feel that I had answers or anything. He just gets his money and doesn’t care. He doesn’t take your symptoms serious. Over a year ago I saw him about symptoms he told me I just needed to lose weight. Long story short I nearly died because of a appendicitis. He doesn’t investigate anything. He writes prescriptions and referrals wrong also. They will get your money for sure! But care is below average. Nurses are nice and fast though", "pics": null, "resp": {"time": 1621282602343, "text": "We would like to discuss this matter further, so we encourage you to call our office at 414-5900 so that we can help resolve any issues that may be. All the best, and we look forward to hearing from you soon."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "105839049446841841103", "name": "Trevor Bell", "time": 1598745913158, "rating": 1.0, "text": "I am appalled how my mother has been treated and even myself as I was trying to get some answers related to her overall well being. Dr Burch was not concerned about patient care and did not give me the time a day to discuss some concerns I had. After trying to speak with the Practice Administrator, I was given to HR.  If you go here, Do not except phones calls back timely nor compassion regarding your loved ones well being. They should really evaluate their “core values” and conduct some S E R V I C E training within their office and staff.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "106658978299455795244", "name": "Janelle Presnall Barbato", "time": 1597967399917, "rating": 5.0, "text": "Well you might have a little wait time but the doctors are outstanding! I love it! These doctors still come visit you in the hospital!", "pics": null, "resp": {"time": 1598281426049, "text": "Thank you for the kind words and the 5-star review, Janelle. Our healthcare team takes great pride in creating an environment where patients receive quality, individualized and compassionate medical care. Thanks again for the feedback!"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "113802026061945133288", "name": "Terri Gaal", "time": 1596136311687, "rating": 5.0, "text": "My family and myself have seen numerous Dr.'s in this group.  They are caring and help address your health issues.  The entire staff is friendly and helpful.", "pics": null, "resp": {"time": 1597683570940, "text": "Hi Terri, thank you for the kind words and the 5-star review. Our healthcare team takes great pride in creating an environment where patients receive quality, individualized and compassionate medical care. We're glad that we can serve and meet the healthcare needs for you and your family."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "114547424449841324436", "name": "RJ Clark", "time": 1594938400854, "rating": 1.0, "text": "This place is ridiculous. Every time I go I have to wait over an hour for an appointment at 2 that will last maybe 10 minutes. After seeing the doctor finally at around 4:45, I was sent to get lab tests and then an x-ray. Lucky for me after I was able to get my lab done it was 5:15. Which is when the x-ray closes. Waste of time", "pics": null, "resp": {"time": 1596136494822, "text": "We value our patients greatly and ask you and all of our patients to feel free to provide feedback about our services. We really would like to discuss this matter further so that we can help resolve any issues that may be. Would you mind speaking with our operations manager about your experience?"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "114049596922624930484", "name": "Butch Ladner", "time": 1592501351332, "rating": 3.0, "text": "I like all the doctors that I have seen over the years but I quit going there after I scheduled the 1st blood work appointment of the day. After about 15 minutes past my appointment while sitting in the waiting room, I called and knocked on the door... no response. I had to be at work so I left. Later I filled out forms to have my records sent to another facility but they were apparently never transferred.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "117411607479349393115", "name": "Deanna Davis", "time": 1597868154706, "rating": 5.0, "text": "I love the docs n staff and the fact that they are right at my hospital", "pics": null, "resp": {"time": 1606849123022, "text": "Thank you for the kind words and the 5-star review, Deanna. Our healthcare team takes great pride in creating an environment where patients receive quality, individualized and compassionate medical care. Thanks again for the feedback!"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "103597519588746451759", "name": "Kent Busby", "time": 1599001793278, "rating": 5.0, "text": "Fast and efficient!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMDuQ9I70L6wSoG2c4a3s9XRbW8YcHKdw-TiBlb=w150-h150-k-no-p"]}], "resp": {"time": 1606848995468, "text": "Thank you for the kind words and the 5-star review, Mr.Busby. Our healthcare team takes great pride in creating an environment where patients receive quality, individualized and compassionate medical care. Thanks again for the feedback!"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "108999883754558901602", "name": "Sarah S", "time": 1596091461530, "rating": 1.0, "text": "If you want to waste your time using this Dr's office then this is the place for you! I have NEVER in my life dealt with a medical office with such poor service. Whenever you call this office to leave very important information concerning your health, asking for a NURSE to call you, be prepared to wait days (thats even if you get a return phone call) The Dr seemed like a very concerned physician however his nurses like to treat patients like their the Doctor! I had one nurse who called me back after 4 days and she tried to tell me she knew exactly what the Doctor had ordered me to do with a certain medication and when i ask her how she knew, she tried to tell me she was in the room with the Dr. which I called her out on because she wasnt in the room with the dr and I. A lady by the name of Jordan was, this ladies name was Gloria! When I confronted her and told her NO MA'AM you were not in the room Jordan the dr and myself were the only 3 people in there that day, she put le on hold and later came back to the phone with a different attitude, but informed me that my Dr was out of town and guess what HE HAD NO FILL INS.. I have worked in the medical field and bo that Drs cant just leave their patients without ANYONE to help them with their medical needs!! Long story short I went without my medication from Thursday until the following Thursday! 7 FULL DAYS!! It was no big deal to this lady at all!! I have gladly found another physician and I honestly wouldn't take my animals to this office!! So again if you want to deal with getting the run around THIS IS YOUR PLACE, IF NOT DONT BOTHER EVEN MAKING AN APPOINTMENT!! I will be reporting this medical office!! Thanks for wasting my time Alabama Medical Group!! Maybe dr Rubenstein needs to stick with being the mayor and retire at being a physician!!!", "pics": null, "resp": {"time": 1596136407942, "text": "Hi Sarah,we value our patients greatly and ask you and all of our patients to feel free to provide feedback about our services. We really would like to discuss this matter further so that we can help resolve any issues that may be. Would you mind speaking with our operations manager about your experience?"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "109278907505601771623", "name": "Janet Newburn", "time": 1580262751417, "rating": 2.0, "text": "I don’t normally write online reviews, but this group is terrible.  The Doctor’s and staff are nice, but lack professionalism. I see Rubinstein at the Saraland location and Siegel at the Springhill location.\nThe wait times are off the charts. When you ask why you are waiting so long, they either just look at you or push you to another waiting area. My time is just as important as theirs. I was at the Saraland location today for over 2 hours. I saw Rubinstein for approx. 4 minutes. Routine checkup.\nThe staff has not the first clue about what’s going on medically with patients.  I have been called with incorrect information regarding my results, I have had to tell them what they were supposed to be doing per visit with Doctors.  I have been scheduled for a procedure that was ill prepared then I was forgotten.\nOffice Managers, are you reading these reviews?\nPatient care should come first and far most at all times.  The staff in these offices should be more concerned with this than what they are having for lunch.\nI walked out after seeing Rubinstein today after I was left sitting to have blood drawn. (I know how long it takes to draw blood)\nI’m sure they couldn’t care less! Sooner or later this junk is going to catch up with y’all.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "100877325519879114300", "name": "Howard Rhodes", "time": 1594666879937, "rating": 1.0, "text": "They wouldn't call in my blood pressure medication while I was out of town, And had much attitude about it !  So I had to find a new doctor.", "pics": null, "resp": {"time": 1596136522089, "text": "Hi Mr. Rhodes, value our patients greatly and ask you and all of our patients to feel free to provide feedback about our services. We really would like to discuss this matter further so that we can help resolve any issues that may be. Would you mind speaking with our operations manager about your experience?"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "103772813478267092741", "name": "Becky Kidd", "time": 1566764803412, "rating": 5.0, "text": "I am so very thankful to Dr. Jonathan Siegel and his wonderful staff. Each person was extremely helpful, professional, and caring to me, from the initial consultation with Dr. Siegel, to follow up after my procedure.", "pics": null, "resp": {"time": 1566930659186, "text": "Thank you for the kind words, Ms. Kidd. We're glad to have Dr. Siegel as a member of our team and are so glad you shared your feedback with us."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "115645794739993181607", "name": "SHANTA EDWARDS", "time": 1568308488496, "rating": 1.0, "text": "This is the worst group in the Bay Area PERIOD!! I was turned away because I couldn't pay $110 on a previous bill that didn't even belong to the Dr I was seeing! I made arrangements on this bill and have been paying monthly but this DR refused to see me still!! All the money that I've paid and my insurance have paid and this is how I'm treated!!! I'm not asking for special treatment, just trying to be treated!\n\nI am in severe pain and I am ashamed for this group that they would care more about money than they would helping care for their patient! What kind of medical practice does this!!!!! Only money hungry ones. I will NEVER come back to this establishment nor will I recommend them to anyone. I am going to share this story on social media as well, to let people see how these practices are letting patients suffer because of the almighty green dollar. It is not right nor is it fair. I could see if I had NEVER paid them anything, but to pay every month even with me not even working, makes this situation not only sad but despicable and down right disheartening.  Thanks so much Alabama Medical Group and your doctor's for always putting money first over patients!!!!!!!!!!!", "pics": null, "resp": {"time": 1568318194483, "text": "Hi Ms. Edwards, on behalf of Alabama Medical Group I apologize that you feel this way. I've spoken with the customer service rep who assisted you today and I have reviewed your file and there seems to be some inaccuracy's with your statement that I'm hoping we can clarify. If you will please call our office at 414-5900, our operations manager would like to discuss your visit in further detail. Thank you and we look forward to hearing from you soon."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "111948156850650712197", "name": "Kaitlyn Franklin", "time": 1566523939687, "rating": 1.0, "text": "These doctors are the most neglecting, ill mannered doctors I have ever come across and not to mention horrible communication and listening skills. And then they’ll continue to pass you around to many other doctors because they don’t have the means to help. My family and I decided to pull from this doctors office today. Never again.", "pics": null, "resp": {"time": 1566930495208, "text": "Hi Ms. Franklin, we value our patients greatly and ask you and all of our patients to feel free to provide feedback about our services. With that being said, you left no details about your experience that resulted with you leaving us with a 1-star review. We really would like to discuss this matter further, so I would like to encourage you to call our office at 414-5900 so that we can help resolve any issues that may be. All the best, and we look forward to hearing from you soon."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "102470176151313839239", "name": "Karen Bozant", "time": 1516898167158, "rating": 5.0, "text": "The doctors are great and the lab techs work quickly. I'm amazed that I don't have long waits like other places. They get to know you and not just push you through their office.", "pics": null, "resp": {"time": 1517335519319, "text": "Thank you for the feedback Ms. Bozant!"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "102065393161772879398", "name": "Deanna Davis", "time": 1557694251896, "rating": 5.0, "text": "The docs are wonderful caring kind people. The staff are precious. A blessing!", "pics": null, "resp": {"time": 1557752797132, "text": "Thank you for the 5-star review and the positive feedback. We are so pleased to hear such kind words about our staff."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "101834874133775682304", "name": "Cliff Wright, Sr.", "time": 1487116906874, "rating": 5.0, "text": "One stop shop for all things internal. Have seen many of the doctors for various conditions and treatments and all are knowledgeable and professional. My personal favorite is Dr. Don Sanders; you won't find a more caring and compassionate doctor anywhere, especially one that actually listens to (not just hears) his patients. Front desk staff does leave a lot to be desired as they are young and tend to be rude and impatient, but you're not there to see the 'staff' so just blow it off.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "108583936746234276700", "name": "Betty White", "time": 1527424613482, "rating": 5.0, "text": "Hands down the best group I have been with! I would definitely recommend this place as not only the best on the coast, but probably the best in the country!", "pics": null, "resp": {"time": 1531946217349, "text": "Thank you for the kind words, Mrs. White. Our healthcare team at Alabama Medical Group takes great pride in creating an environment where patients receive quality, individualized and compassionate medical care."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "100660206795587994091", "name": "Caitlin Brown", "time": 1565360593343, "rating": 1.0, "text": "The WORST doctors office I’ve ever dealt with. These people are ignorant and incompetent. Horrible horrible staff, do NOT recommend .", "pics": null, "resp": {"time": 1565629726845, "text": "Hi Ms. Brown, we value our patients greatly and ask you and all of our patients to feel free to provide feedback about our services. With that being said, you left no details about your experience that resulted with you leaving us with a 1-star review. We really would like to discuss this matter further, so I would like to encourage you to call our office at 414-5900 so that we can help resolve any issues that may be. All the best, and we look forward to hearing from you soon."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "104845393980734080516", "name": "Lacey McElderry", "time": 1462815853800, "rating": 5.0, "text": "This is a great doctor's office. The staff and the care that you will receive is top notch. I highly recommend the delicious dietitian program.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "112527433897831320353", "name": "Kacey Young", "time": 1559852828371, "rating": 1.0, "text": "Waited two hours for my mother to see a doctor for a scheduled appointment. Then the front desk was very rude. Never apologized for the two hour wait. They are overbooked. Shouldn’t have to wait all day for appointment.", "pics": null, "resp": {"time": 1560178187698, "text": "Hi Ms. Young, we're sorry to hear that your mother's appointment ran late, but unfortunately due to the nature of our business sometimes this happens. With that being said, we never want our patients to be unhappy and we apologize for the unpleasant experience. If you would like to discuss this matter further or if we can reschedule your mothers appointment, please call 414-5900 and ask to speak with our operations manager and she will get her scheduled."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "108876214357831787440", "name": "R.Allen Crowe", "time": 1550779389888, "rating": 1.0, "text": "So I just retired from the United States Navy after 28 years of service.  My family and I moved to Mobile, Alabama for our last move as we intend to live here for the rest of our lives.  Well as in any place you live there are many good things and there are not so good things that you experience.  We just came across a not so good thing and that is the Alabama Medical Group, P.C.  We were only with this PCM and the medical group for 3 or 4 months when we received in the mail a letter from them dismissing one of my family members.  The letter did not state any reason why only that they “need to do this from time to time.”  When asked why our family member was dismissed their representative would not provide a reason and on top of that they were rude during our phone conversation.  As a Navy Captain (retired) who has been to many places in this world along with my family who have been with me through all of that,  this has been the most disappointing experience of my career and was upsetting for my family members.  As a result of this,  my entire family has now changed PCMs.  I hope this feedback will help the management of Alabama Medical Group to self reflect and make some changes for the better. In the meantime,  I would not recommend this facility if you are a veteran as I assume they do not hold the veteran status as important.  That is strictly my impression.", "pics": null, "resp": {"time": 1551286970550, "text": "Capt. Crowe, I've looked into the situation involving your wife's experience at our practice and due to HIPAA compliance regulations there is very little I can comment about her visit and post publicly on the internet. It's unfortunate to hear that she had a negative experience, and I would like to encourage her to call our office at 414-5900 and ask to speak to the operations manager or the marketing director so we can discuss the allegations in your comments above. One comment that I can, and would like to address, is your statement saying that we do not support veterans. That simply is not true. In fact, several of our physicians currently serve in the military, along with members of our staff, as well as their spouses. We appreciate their service to our country along with yours and the other men and women who chose to make that sacrifice to protect and serve our great nation."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "105074773294626981722", "name": "Trevor Clifton", "time": 1521137650713, "rating": 5.0, "text": "I may be partial, but Alabama Medical Group is the best practice in Mobile! I will definitely continue to use my physician and the organization for any needs that they are able to assist with.", "pics": null, "resp": {"time": 1521138312641, "text": "Trevor, we don't think you are being partial at all. We appreciate your 5-star review and positive comments!"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "106422606782648998008", "name": "June Reddix-Stennis", "time": 1538776500624, "rating": 1.0, "text": "Just left the Alabama Medical Clinic Walk In Clinic, I was refused service first because it was 4:15pm but the Facebook page says the close at 5pm and the website says they close at 4:30pm, either way I got there at 4:15pm so she said they couldn’t see me because they cut off at 4:15! Then she asked if my primary doctor was in the group, my response was no but I have two specialist in the group, so she then informed me that they couldn’t see me because I didn’t have a primary doctor there. The website says nothing about having to already have a primary there! Either she was lying or the website is giving out bad information! I just drove all the way from west Mobile to go to the walk in clinic and couldn’t even walk in! Wow! I’m sooo disappointed, someone really needs to correct this problem, it’s so unprofessional and so was she! My visits with my specialists there have been great but the Walk in Clinic needs work!", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "104937206293796425931", "name": "Laurie Watson McKay", "time": 1496175842762, "rating": 5.0, "text": "My surgeon was Dr. Scott. He was fantastic and very down to earth. I would trust him to cut me open anytime! :-)", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "117914164218167977798", "name": "Jennifer Schuller", "time": 1492451124413, "rating": 5.0, "text": "Internal Medicine Center is made up of a group of kind, caring and compassionate physicians who are highly skilled and trained to take care of all of your healthcare needs.", "pics": null, "resp": {"time": 1560264058735, "text": "Thank you for the 5-star review and the positive feedback. We are so pleased to hear such kind words about our staff."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "108754969109803500157", "name": "Robert Johnson", "time": 1470864349303, "rating": 4.0, "text": "i like Dr Carlos and think he's a good dr but I wish the waiting time wasn't always so long to see him.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "105907220982380648113", "name": "Frances Moore", "time": 1433257481641, "rating": 1.0, "text": "I found that the Doctors at the center are helpful but the staff are horrible.  They are not concerned with the patients health.  They are not helpful and when you are sick you want to be able to see the doctor.  I was told that I could go to their urgent care facility the next morning if I was having a problem.  Horrible staff I would not recommend this facility to a dog.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "109606875225452259763", "name": "Bo Lambert", "time": 1486094853163, "rating": 5.0, "text": "Best doctor...Dr Arnold....nice to know some one cares when you go in...and oh by the way..WDE..DOC!!!", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "108449377063460987318", "name": "Neal Hattenstein", "time": 1490366132515, "rating": 5.0, "text": "Dr Alan Shaine is my Doctor and he is a womdeeful doctor sits with you and exam .just great bed side mannnee", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "112636333242840920295", "name": "tammy beard", "time": 1467068304662, "rating": 1.0, "text": "The facility itself may be ok. Idk. But , in my opinion, Dr. Amy Strasburg is rude, vapid, unprofessional and would be better suited for a career behind a cosmetics counter. If you go there, ask for a different doctor. And be prepared for each and every visit to take two or three hours. Apparently, their system completely collapses on a regular basis.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "109773861361038995364", "name": "Rebekah Graham", "time": 1542482155457, "rating": 5.0, "text": "Everyone is friendly and Dr. Hayden Long is the best.", "pics": null, "resp": {"time": 1547573568593, "text": "Thanks Rebekah, we are so glad to have Dr. Long as a member of the AMG team!"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "100414115519850203702", "name": "Daniel Crocetti", "time": 1417005648420, "rating": 5.0, "text": "Great team of professionals, providing excellent care.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "114181223864192186992", "name": "Mohamad Sahyouni", "time": 1555080582287, "rating": 1.0, "text": "Horrible.", "pics": null, "resp": {"time": 1560178315712, "text": "Hi Mr. Sahyouni, we're sorry to hear that you had an unpleasant experience at our practice and would like to discuss the details of your experience. Would you mind if our operations manager contacted you to discuss?"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "116701707057439435212", "name": "June McClendon", "time": 1624732343673, "rating": 4.0, "text": "I highly recommend Southern ENT & Dr Walters. Likes: Website has printable new patient forms that I completed before my appointment. Comfortable waiting area. Once I got to the exam room, I was seen right away. First by the friendly, efficient & knowledgeable auditory tech who took me to the sound-proof room for testing. I was pleasantly surprised that there was no wait time between testing & meeting with Dr Walters to review my results. Five stars for Dr Walters! It was obvious that he had reviewed my paperwork in advance,. He explained my results, answered my questions, and recommended a course of action clearly & patiently. I felt like he was seeing me as a person, not as a condition. Why not 5 stars? 40-minute wait time before getting to exam room & inability to complete & submit patient forms online.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "109321360756288387280", "name": "Deborah Hataway", "time": 1626970799152, "rating": 5.0, "text": "I am  completely satisfied with my appointment with  Dr. Lowery.  He put me at ease.   He has been my ENT for over 10 years and I drive over 45 miles one way because I trust him and his diagnosis each visit I have had.  He orders test when needed to ensure we know what we are dealing with.\nI recommend the Southern ENT & Sinus Center to any and everyone that needs an ENT.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "118206263218210649794", "name": "CLH 79", "time": 1624315376044, "rating": 5.0, "text": "We saw Dr Fort for my son's frequent nosebleeds. He was very nice and helpful. The office is large and clean. His nurse/assistant and the front desk clerk were very nice also. Overall a great place. Easy to get an appt too.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "115699391723525140900", "name": "Rhonda Rhudy", "time": 1626815709843, "rating": 5.0, "text": "Dr Walter's was very kind & thorough with my 15 year old daughter's sinus surgery. He explained the procedure to where she understood", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "112046350063589526968", "name": "M J", "time": 1617746675071, "rating": 5.0, "text": "The assistant for Dr Lowery is very gentle and patient. Dr Lowery was very attentive and informative. I did not feel rushed as I usual do when visiting the doctors. Dr Lowery and his assistant listen and were compassionate. I would recommend them to my clients as well.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "118241715010888133577", "name": "James Sparks", "time": 1617825141048, "rating": 5.0, "text": "Great experience.  Dr. Walton was wonderful and concerned about my illness. Would highly recommend if you need a great ENT", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "102613799315012531350", "name": "Dana Price", "time": 1607193969266, "rating": 5.0, "text": "I saw Dr. Walters for the first time.... I am completely pleased! He took time with me , listened to me and discovered an issue that was previously missed by another ENT in my hometown. He took care of the problem and I felt immediately better! He will definitely be MY doctor from now on!", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "110115481554068986918", "name": "Lauren Gingo", "time": 1612680192404, "rating": 5.0, "text": "Dr. Fort seen my husband for a 2nd opinion and we were very impressed. He listened to all his concerns, explained in detail what he was thinking, prescribed him medication, and getting him to a specialist for more in depth testing for his trouble swallowing. He also wants him to follow up with him in the near future. One of the best Drs he's seen, not just ENT Dr's.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "107841753224888819299", "name": "Pamela Williams", "time": 1612467369274, "rating": 5.0, "text": "Dr Walters was very professional and answered my questions precisely. I will recommend him.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "106998141012729230339", "name": "Ray White", "time": 1605305090089, "rating": 5.0, "text": "I was very happy with the office staff and with Dr. Lowery in their manner and concern for my well being. I highly recommend them to anyone.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "108948349441784284622", "name": "D J", "time": 1608324642124, "rating": 5.0, "text": "They seem to be extremely cautious with Covid safety.  Dr. Walters is the BEST. Very patient,  explains well, answers all questions and really cares.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "103746235602676490083", "name": "Bobbi Lee", "time": 1604173689837, "rating": 5.0, "text": "Excellent care, I felt welcomed and that all personnel were courteous and professional.  I was seen at my appointment time, in spite of COVID precautions and the aftereffects of Hurricane Zeta. Dr. Lowery was polite and answered my questions.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "103424394194085224746", "name": "Heather Brownlee", "time": 1561036309536, "rating": 5.0, "text": "Went here yesterday for extreme ear pain. I had already been to a doctor and received antibiotics for what I was told was an inner ear infection. Upon arriving the nurses were extremely helpful and nice with helping me get my insurance figured out. I was taken to the back for a hearing test by another very nice lady she explained everything she was doing and explained the graph to me after we were completed. Dr.Walters was very thorough and looked in both ears more than once. He determined I DID NOT have an inner infection but, a protruding ear drum! He was able to pop it back in place for immediately relief. I was very happy with my visit here and everyone on the staff is extremely helpful and nice! I recommend anyone to go here!", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "109082315971785092268", "name": "Betty Bryant", "time": 1601771274314, "rating": 5.0, "text": "Prompt attention, thorough exam, left satisfied. Personnel very friendly.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "106411139485337673177", "name": "Ala Barakat", "time": 1574714147498, "rating": 5.0, "text": "Friendly staff, no waiting on appointments. Dr. Walters was very friendly and knowledgeable. Highly recommend him.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "108067481546921736104", "name": "Monty Reed", "time": 1603902935200, "rating": 5.0, "text": "Got me in same day I called. Fixed my gland immediately", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "113319179488473931618", "name": "Johnny Walker", "time": 1552072589188, "rating": 5.0, "text": "The staff is the best! They go out of their way to make you feel welcome and do an excellent job. I wouldn't considering going anywhere else and my treatment has been nothing short of a life changer.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "112769715152790815053", "name": "TommyMary Grant", "time": 1605295090543, "rating": 5.0, "text": "In and out in a reasonable time", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "105284883321240640723", "name": "Linda Lee", "time": 1603551441345, "rating": 5.0, "text": "Excellent serviice.", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "115527044841455865302", "name": "mike yeskevicz", "time": 1578437344859, "rating": 5.0, "text": "Dr.  W is great and very good bedside manner", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "111118226927417170590", "name": "James Patillo", "time": 1553719603482, "rating": 1.0, "text": "I was a patient of Dr. Jebeles for many years and was very pleased with him. In Nov 2018 I developed a severe nose bleed, something I never had previously. Had to go to emergency room where they advised me to go to my ENT Dr.  Which I did with Dr. David Walters with Southern EnT. He did nothing to treat the condition, other than advised me to go to the emergency room. Of course I told him I was at his office from what I was told to do from  emergency room Dr. that night the bleeding was severe and I called and talked to Dr . walters the next morning he advised me to go to the emergency room. Ayer a few days of  very severe bleeding I was able to get an  appointment  with  another ENT. Dr. Who immediately cart irised my nose.This Dr could not believe why Dr Walters would not treat this conditionThe bleeding was very severe and I felt it to be life threating. After almost 20 years I will never  go back to Southern ENT  And Sinus", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "117192137654006299074", "name": "Leah D", "time": 1479840431368, "rating": 5.0, "text": "I had a reaction to a steroid shot out of nowhere (that doesn't EVER happen to me), and the entire staff went out of their way to make sure I was taken care of. I was very much so blessed with their patience and kindness", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "102494647938481819406", "name": "Lindsay Brock", "time": 1581728459297, "rating": 5.0, "text": "Great place great people 👍", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "105138833436904284223", "name": "ANNimal 2020", "time": 1528596393523, "rating": 1.0, "text": "The rudest staff ever & Dr. Jebeles is in & out not hearing a word you say misdiagnosing you. Had to end up using another AWESOME ENT at ENT of Alabama at St. Vincent’s", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "110847520477891799177", "name": "Mike MacMahon", "time": 1470661769547, "rating": 5.0, "text": "Prompt scheduling, attentive staff, and great doctors finally got me relief from my chronic sinusitis. Hooray!", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "116296672795214289271", "name": "Ana Johnson", "time": 1497964879095, "rating": 5.0, "text": "Great staff! Quick and efficient!!", "pics": null, "resp": null, "gmap_id": "0x88890e0b5082dacb:0xbbbce3be4b68bd71"}
{"user_id": "116147693571793974844", "name": "Patti Sampson-Steeno", "time": 1625593728608, "rating": 1.0, "text": "It took be 3.5 hours to get what suppose to be an MRI, simple one to last 30 min.,on my lower back. I complete it, they then inform me that they now need to do contrast. It took 2 nurses, 5 stabs to finally get the IV. (I get blood drawn very often, so it wasnt me). I then wait to get what they say will only be 10 min more of the MRI and it's actually 20. Here's the kicker, I wait 2 weeks for the reading at my Dr., they never received the results from Tyler!! Now i have to wait LONGER, with pain for them to track down why and where they are!!!", "pics": null, "resp": null, "gmap_id": "0x888bb3c1675000ad:0x9da5298a5f20e7dd"}
{"user_id": "105759492286438490804", "name": "Artheria O'Neal", "time": 1605289624544, "rating": 5.0, "text": "Good!! Bedside manners💜", "pics": null, "resp": {"time": 1605903807760, "text": "Thanks for your review Artheria!"}, "gmap_id": "0x888bb3c1675000ad:0x9da5298a5f20e7dd"}
{"user_id": "105612516820126871830", "name": "Crystal Anderson", "time": 1491503571674, "rating": 5.0, "text": "My family loves the Tyler Center. Everyone is always nice and helpful. It is very clean and maintained well. We have never had any problems at all.", "pics": null, "resp": null, "gmap_id": "0x888bb3c1675000ad:0x9da5298a5f20e7dd"}
{"user_id": "107577792448455454403", "name": "ROLL TIDE", "time": 1526444623119, "rating": 4.0, "text": "Some of Anniston's Best Dr's have Office's in this building", "pics": null, "resp": null, "gmap_id": "0x888bb3c1675000ad:0x9da5298a5f20e7dd"}
{"user_id": "102807110302686839197", "name": "Diane Natale", "time": 1596742884994, "rating": 3.0, "text": "They can never find my prescription. I am always at the Sleep Center when they fax my prescription over.  I have to call and ask the Sleep Center to fax them another prescription. Time consuming.", "pics": null, "resp": null, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "100061593155281889111", "name": "Tony Blankenship", "time": 1583439410650, "rating": 5.0, "text": "Staff wonderful and very helpful.  Margo did great job.  Good expression looking forward to working with these guys.", "pics": null, "resp": {"time": 1583443478168, "text": "Thank you so much for choosing Medlogic.  We look forward to working with you as well."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "108095796035458558196", "name": "Jason Paul", "time": 1542140644594, "rating": 5.0, "text": "I live a long distance from this location and was there to see my Dr who referred me here. Everyone was so nice and accommodating. They made sure I was taken care of all in one visit and made getting my new CPAP a pleasant experience. The staff was very knowledgeable and extremely nice. I highly recommend anyone using them.", "pics": null, "resp": {"time": 1542142729196, "text": "Thank you for choosing Medlogic. We strive to make sure every patient has a positive experience. Thank you again for allowing us to take care of your CPAP needs."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "111790554795915948891", "name": "Kevin Henderson", "time": 1554989377723, "rating": 5.0, "text": "Much love for Medlogic! I arrived in town aaaaaand, sure enough, I forgot my power supply for my CPAP.  I called Medlogic to see if I could purchase a power supply, oh and it was 5 min before closing,  after explaining my situation they said they would wait for me to arrive at their store (huge relief !).  After they found out I was only in town for two days before heading home, they told me I could simply borrow the power supply and return it before leaving town.  I can honestly say that I have experienced customer service like this in such a long, long time! Y'all are such a blessing, and I'm very grateful!", "pics": null, "resp": {"time": 1555064851507, "text": "It was our pleasure to help. Thank you for the kind words."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "111334775645572059024", "name": "Dan Jones", "time": 1517582892553, "rating": 5.0, "text": "After waiting for almost a week for another provider I called Medlogic. Great choice!! I had my new CPAP the same day. Cassandra was great! Knowledgeable and efficient. Can't say enough good things. Highly recommend Medlogic. Thank you !!!!", "pics": null, "resp": null, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "109818105006541160121", "name": "Cheryl Ivey", "time": 1550243122937, "rating": 5.0, "text": "Using Med Logic at UAB Medical West.  Had all of my supplies and so I didn't have to drive down to Hwy 280!  The best part was the personalized service on getting happy with the CPAP which is priceless.  I haven't felt this good in years!  Thank you all so much.  Excellent!", "pics": null, "resp": {"time": 1550243914543, "text": "Cheryl, thank you for your kind words and for trusting Medlogic with your CPAP therapy."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "110415395050525563526", "name": "Benita Higginbotham", "time": 1582312564241, "rating": 5.0, "text": "Wonderful place to go for medical supplies. Very professional  friendly and knowledgeable.", "pics": null, "resp": {"time": 1582313884047, "text": "Thank you for allowing us to take care of you."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "111766140048581638984", "name": "Gordon Zane", "time": 1565048975673, "rating": 1.0, "text": "Vary sad that was unable to purchase supplies and new head gear from Medlogic. Was wanting to try use a new place and share a new experience . People were very friendly but refused to sell me anything without a prescription. So I left went down to my other choice on Hwy 280 and bought everything I needed without prescription. Spent over $400 dollars that I could of spent at  Medlogic. I still refused to figure out why a business would turn down business when in fact you and order the same products on line🤔. I call my Dr. who said why would you need a scrip when paying cash and it’s not going against your insurance. Apparently someone didn’t ask the right question and assumed it was insurance which you do need a scrip. Sorry for their loss and and business. Reply: You do not need prescription for CPAP supplies, only for MACHINE. READ federal guide lines. Supplies are Not regulated.", "pics": null, "resp": {"time": 1565046424588, "text": "I would like to thank you for coming in today. Like we explained to you earlier, the masks are a prescription only item. Due to federal regulations, we  must  have a prescription on file to fulfill an order,  even to a private pay customer.  If you look at the package that your mask comes in, you will notice the \"Rx only\" label .  My apologies if you felt like we didn't want to help you. We just try to follow the rules and do the right thing so that we have longevity in the CPAP world. Our number one priority is always to help with the patient's compliance and achieve a better quality of life via their CPAP therapy."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "114702443519501477620", "name": "Jennifer Nolan", "time": 1515424957919, "rating": 5.0, "text": "We called and were able to get an appointment the same day.  The staff was very friendly and helpful.  They also had a great selection of equipment.  I'm so glad we chose them.", "pics": null, "resp": {"time": 1515608576370, "text": "THANK YOU JENNIFER, IT WAS OUR PLEASURE!"}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "107573445381164469810", "name": "Karla Thomas", "time": 1550349476606, "rating": 5.0, "text": "Thank you Medlogic, you are the best!  With Medlogic and Med West sleep clinic working together you both definitely went above and beyond what anyone else could do for me!  My stupid obstructive and central sleep apneas are the hardest and most expensive to treat and you did it inexpensively and quickly!!  You definitely saved my life!  Thank you Kelly and the guy on the phone, sorry I forgot your name... that memory loss from sleeping without breathing , hopefully soon to breathe and sleep comfortably. You are the best!!! Thanks for working your magic for me!  Not a 'paid for' review either!", "pics": null, "resp": {"time": 1550228883817, "text": "Farrar (clinic) and Kelly (guy on the phone) are great! Thank  you so much for trusting Medlogic with your care."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "114204032019116028730", "name": "evelyn bryant", "time": 1512681475852, "rating": 5.0, "text": "I don't know how I would have gotten through without the help of Farrah! She is so helpful and knowledgeable, she explained how to use everything I had and even answered some questions when I got home and had more. Thanks so much got having a caring staff!!", "pics": null, "resp": null, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "112533226777527681748", "name": "MeanMarceline Vampirequeen", "time": 1540927089301, "rating": 1.0, "text": "If this was the last place I could get CPAP supplies I would rather die in my sleep than to give them a single dollar of my money. All these 5 star reviews are paid for. The staff was so rude the office manger was hiding and they are tripling the price of their supplies.", "pics": null, "resp": {"time": 1540929560475, "text": "I apologize that you feel this way.  Per your phone conversation with our office, you had a piece broken on your mask. Since you weren't an existing patient we had no way of knowing what mask you have. We recommended that you bring in your mask so we could see if we had any parts to accommodate your needs.  If you recall, no pricing was ever discussed because we didn't know what piece you needed.  You stated you had driven a long way and asked where the manager was.  I am in fact the manager and I walked up to the counter when I finished the phone call I was on.  I walked up to intercede and you stated you would not be getting supplies from us but would take our candy out of the candy bowl.  I'm so sorry you felt like you had a less than positive experience.  We strive to meet all patient's needs."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "102998320374562040844", "name": "Wally Conway", "time": 1513987947728, "rating": 5.0, "text": "They called the same day they  got my prescription. I had an appointment the next day with very helpful staff! They explained the usage and care very thoroughly. This is the place I will recommend to friends and family!", "pics": null, "resp": {"time": 1514312475155, "text": "Thank You Mr.Conway! We look forward to providing great service to you and your family for many years to come!"}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "100442895061753350235", "name": "Henry Ricks", "time": 1550250259225, "rating": 5.0, "text": "I had a very profitable meeting with the Medlogic CPAP representative who did a through job of explaining the machine features/operation, supplies, billing, and support from the local office and ineractive internet functionality that the machine has. I went home looking forward to getting the old machine in storage and the new machine up and running. Best of all, I can now start using my So clean device which didn't work with my older CPAP machine.", "pics": null, "resp": {"time": 1550251550929, "text": "Thank you so much for the wonderful compliment. We strive to make each patient feel comfortable and confident when starting their CPAP therapy."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "107253215794354219666", "name": "Rod Peeks", "time": 1553108924210, "rating": 5.0, "text": "MedLogic did a yoeman’s job of helping me with my CPAP needs. Stacey and Josh went above and beyond in their efforts to help me have a successful experience. Thank you.", "pics": null, "resp": {"time": 1553137396005, "text": "We are so pleased that you had a great experience! Please let us know how we may assist you in the future ."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "109029184218490107143", "name": "Donna Morgan", "time": 1534960084332, "rating": 5.0, "text": "Kelly was an excellent individual to work with for my CPAP. He explained everything in great detail. I feel very comfortable in knowing I can count on him for my CPAP needs.", "pics": null, "resp": {"time": 1534960945439, "text": "Thank you for choosing Medlogic. We look forward to helping you with your sleep management."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "103838025172920458718", "name": "Koodan 77", "time": 1547852802788, "rating": 5.0, "text": "Very nice and friendly staff. Handled themselves professionally and helped me get what I needed quickly", "pics": null, "resp": {"time": 1548070846946, "text": "Michael, thank you for your kind review. As always, please feel free to call us if you ever have any questions."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "100169475061859826309", "name": "Joanne Anthony", "time": 1534994247903, "rating": 5.0, "text": "Everyone was friendly and knowledgeable about the products.  I was fitted for my new CPAP machine and had all the paperwork finished up in almost no time at all.  Definitely the place to go for your CPAP needs.", "pics": null, "resp": {"time": 1534994988141, "text": "Thank you so much for choosing us as your sleep management company! We look forward to servicing you with all of your Cpap needs In the future."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "115299172007458503358", "name": "Patty Bryant", "time": 1512682088027, "rating": 5.0, "text": "I felt right at home with the staff. Carla,Josh and Farrar are the best. They are knowledgeable and friendly. I especially appreciate the fact that you are educated on the operation and care of your machine before you leave.", "pics": null, "resp": null, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "102676517678953621662", "name": "Amy Persich", "time": 1512680111562, "rating": 5.0, "text": "Staff is amazing and so knowledgeable. They really take their time in explaining everything and making sure you understand as well. Selection of products was great as well.", "pics": null, "resp": null, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "108960186532086264063", "name": "Valerie T Porter", "time": 1536772841909, "rating": 5.0, "text": "Great experience!! The young lady that gave me instructions was pleasant, knowledgeable and thorough. I really enjoyed her humor.", "pics": null, "resp": {"time": 1535651294967, "text": "Thank you for using Medlogic! We look forward to working with you in the future!"}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "112994590836254276648", "name": "Jan Darby", "time": 1550620208960, "rating": 5.0, "text": "Pleasant experience. Feel much better about care that I will receive from needing CPAP supplies.", "pics": null, "resp": {"time": 1550621839008, "text": "Thank you for your kind words. We look forward to taking care of you and your CPAP needs."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "103372736870767370524", "name": "Luci Tucker", "time": 1533923129291, "rating": 5.0, "text": "The employees are very kind and helpful.  They answered all of my questions and made me feel as ease.", "pics": null, "resp": {"time": 1533929092776, "text": "Thank you for choosing Medlogic."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "102021962943186111247", "name": "Sonia Cardwell", "time": 1553634134139, "rating": 5.0, "text": "Friendly service and extremely helpful answering all my questions. Margo was awesome!", "pics": null, "resp": {"time": 1553635284124, "text": "Sonia, thank you so much for allowing Medlogic to take care of you. Please let us know if we can be of further assistance."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "105479060192586942072", "name": "Mizz Tanya", "time": 1542121518923, "rating": 5.0, "text": "I will recommend Medlogic to anyone with their CPAP needs.  I loved the staff as they were very much helpful in me selecting the right CPAP machine along with all the items needed to go along with my machine.", "pics": null, "resp": {"time": 1542123296371, "text": "Thank you so much for allowing Medlogic to take care of you."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "118041168786900554137", "name": "Sandy Roberson", "time": 1542386367210, "rating": 5.0, "text": "Margo did a great job explaining everything about my machine! Praying for a good nights sleep!", "pics": null, "resp": {"time": 1542388204290, "text": "Thank you so much for allowing Medlogic to take care of your CPAP needs. Here's to your good night sleep."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "104800768358251210334", "name": "Alisa Smith", "time": 1534873590195, "rating": 5.0, "text": "The staff is extremely helpful and take their time to assist you in selecting the best products for your needs.", "pics": null, "resp": {"time": 1534874290612, "text": "Thank you Alisa! We look forward to providing you in the future with 5 star care."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "113237867292351956125", "name": "Christa Wolfe", "time": 1534790410099, "rating": 5.0, "text": "The staff was very friendly and helpful.  They have  a great selection of equipment to chose from.", "pics": null, "resp": {"time": 1534791192844, "text": "Thank you for your kind words. We are always here for you if you have any questions."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "101421321187241993315", "name": "JAMES B", "time": 1534941681438, "rating": 5.0, "text": "Thorough review  and demonstration of CPAP use. Good communications. Recommend.", "pics": null, "resp": {"time": 1534942803515, "text": "Thank you choosing Medlogic. We look forward to servicing you with five stars in the future."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "115187083703835341100", "name": "Ginny Milton", "time": 1534784419242, "rating": 5.0, "text": "Farrar King and Carla Shelton were excellent in training me for my new cpap. They both spent extensive time to make sure I understood the care and use of my cpap. They both offered phone support anytime.\nI would highly recommend patients to this company . They take the time to listen and  understand your particular problems and can offer advice to resolve any needs you may require.", "pics": null, "resp": {"time": 1534784561923, "text": "Thank you so much for your kind comments. We want each patient to feel like they are our only one and not just a number in our computer. And please don't hesitate to call us with any questions or concerns. We are always here to offer any assistance that is needed."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "103024080882080501975", "name": "Nancy Sailer", "time": 1513789003468, "rating": 5.0, "text": "Great products, easy to use, and staff very knowledgeable. Josh took the time to answer our questions and was very thorough with education of products.", "pics": null, "resp": {"time": 1513886220704, "text": "THANK YOU NANCY FOR BEING A GREAT CUSTOMER AND GIVING US AN OPPORTUNITY TO WORK WITH YOU!"}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "105431874069108938299", "name": "John Sardin", "time": 1551991937689, "rating": 1.0, "text": "Approximately, two weeks ago I came in to look at the newer machines because mine was 6 yrs. old and stopped working.  UAB Sleep Center faxed my prescription over. Two days go by and no called asking me to come in. I called and they tell me I needed to see my doctor first. I had no problem with that, but someone should have called and informed me. I saw my doctor and he sends my info over. Two days go by and no call back. UAB called in for me and they were told they needed more info. UAB asked why no one called to inform them and you all did not give a good answer. Even though info was missing, callbacks are vital and it shows good customer service and concern for the customer.  UAB sent my info to OxyMed and I received a call the very next morning (today) to come and pickup my CPAP. They were very professional on the call and my visit there was awesome.", "pics": null, "resp": {"time": 1552301566226, "text": "My sincerest apologies for the lack of communication. While we do have a record of the requests for additional documentation from your doctor  and sleep lab we failed to keep you informed on the status of your documentation retrieval. We always strive to give each patient five star service and again I'm sorry that we fell short.  I'm glad you  were able to get taken care of and I  will use this situation and your comments as a learning tool with my staff."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "113558829410141992169", "name": "susan harrison", "time": 1537569850935, "rating": 5.0, "text": "It was great Farrah was very nice and informative on explaining the c pap process", "pics": null, "resp": {"time": 1537571723656, "text": "Thank you for allowing Medlogic to take care of your CPAP therapy."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "103396601688105387264", "name": "Donna Daniel", "time": 1537823234942, "rating": 5.0, "text": "Stacy and Margo did a great job explaining the machine and how to use it properly.", "pics": null, "resp": {"time": 1537824091935, "text": "Thank you so much for your kind remarks. Thank you for choosing Medlogic."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "112257267206586503720", "name": "Lady Cole", "time": 1526651662789, "rating": 5.0, "text": "Thank you so much for explaining to me everything I needed to know about my cpap machine.", "pics": null, "resp": {"time": 1526652442619, "text": "Thank you so much for Intrusting us in your care!! We look forward to providing you with a great care!"}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "107640787416179852493", "name": "Camilo Gomez", "time": 1539709741837, "rating": 5.0, "text": "Excelent service. Margo was very helpful, patient and profesional.", "pics": null, "resp": {"time": 1539710451576, "text": "Thank you so much and thank you for choosing Medlogic for all of your Pap needs!"}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "110420083049680754992", "name": "Michael Scott", "time": 1538600733635, "rating": 5.0, "text": "Excellent service.  Especially the follow up. Clearly a commitment to serving their customers.", "pics": null, "resp": {"time": 1538603178038, "text": "Thank you for allowing us to help you with your CPAP therapy."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "112983834230242094075", "name": "Miranda Pate", "time": 1540402068743, "rating": 5.0, "text": "Everyone was very friendly and informative. I highly recommend this company.", "pics": null, "resp": {"time": 1540402711308, "text": "Thank you so much for allowing Medlogic to take care of you."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "117365253746768062478", "name": "Joshua Velo", "time": 1512676183019, "rating": 5.0, "text": "They are very cooperative, they are extremely respectful and know what they are doing.Just in general are very good people definately deserves a five out of five stars.", "pics": null, "resp": null, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "108615456526840998423", "name": "Patricia Spalding", "time": 1545417021014, "rating": 5.0, "text": "Staff was very friendly and answered all my questions to my satisfaction. I'll use them from now on for CPAP needs.", "pics": null, "resp": {"time": 1545417815844, "text": "Thank you Patricia! We look forwards to our new relationship with you! Happy Holidays!"}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "104552225421483706932", "name": "Philip Jaffe", "time": 1546450169839, "rating": 5.0, "text": "Very easy process to get set up. Staff explained everything very well.", "pics": null, "resp": {"time": 1546462940613, "text": "Thank you for allowing Medlogic to take care of your CPAP therapy."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "109496070993183712125", "name": "Keith Carlin", "time": 1549325182905, "rating": 5.0, "text": "Best service. Very knowledgeable.", "pics": null, "resp": {"time": 1549326254881, "text": "Thank you for allowing Medlogic to take care of you !!!"}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "114749057444648595307", "name": "Andreyuanna Briggins", "time": 1533915335050, "rating": 5.0, "text": "Margo was awesome!\nThank you so much for everything!", "pics": null, "resp": {"time": 1533918291678, "text": "Thank you for trusting us with your CPAP needs."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "107054100603750464626", "name": "Esther Vaughan", "time": 1546977026633, "rating": 5.0, "text": "Easy access and quick, friendly service.\nVery clear explanation of device and options.", "pics": null, "resp": {"time": 1546977745707, "text": "Thank you Esther for your kind review and allowing Medlogic to take care of your CPAP needs."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "115947553296474749291", "name": "rebecca Beacham", "time": 1516392456169, "rating": 5.0, "text": "Very helpful. The waiting area was super comfy", "pics": null, "resp": null, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "103772026577371185703", "name": "Keelie Yowe", "time": 1512676159134, "rating": 5.0, "text": "Farrar and Carla are very knowledgeable in this business. They are also very helpful and kind. Thank You bham for the best medlogic branch!", "pics": null, "resp": null, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "103940461880312762213", "name": "C S", "time": 1512685461268, "rating": 5.0, "text": "The whole experience was truly amazing. We laughed, we cried. I'm going to go back there again and again.", "pics": null, "resp": null, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "103724561465488612994", "name": "Bonita Crowe", "time": 1513697311893, "rating": 5.0, "text": "Been with 3 companies due to insurance providers & Medlogic is the most thorough  & helpful.", "pics": null, "resp": {"time": 1513718111313, "text": "Thank you! We try very hard!"}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "111365942437136041224", "name": "Jennifer Johnson", "time": 1512677773904, "rating": 5.0, "text": "The customer service and knowledge of all the equipment from the people at MedLogic is phenomenal and above all the rest!! Thank you for taking care of my family!!", "pics": null, "resp": null, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "115255362658955605172", "name": "Faye Holtzclaw", "time": 1533928172543, "rating": 5.0, "text": "Outstanding customer service!!!  Looking forward to future interactions.", "pics": null, "resp": {"time": 1533934622137, "text": "We are so happy we were able to provide service to you!! Looking forward  to our new relationship!!!"}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "113438229360468439844", "name": "Greg Mckinney", "time": 1545264252193, "rating": 5.0, "text": "The staff was friendly and very helpful.", "pics": null, "resp": {"time": 1545305839337, "text": "Thank yo so much Mr. McKinney for allowing Medlogic to take care of you."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "113701611192717190830", "name": "Erica Meadows", "time": 1512675138360, "rating": 5.0, "text": "So helpful and the staff is super good looking!", "pics": null, "resp": null, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "114879857341523076814", "name": "dipdive", "time": 1552057621124, "rating": 5.0, "text": "Very knowledgeable and super friendly.", "pics": null, "resp": {"time": 1552300732517, "text": "Thank you so much for allowing Medlogic to take care of you."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "117108561579017028778", "name": "Jason Seavers", "time": 1534782564501, "rating": 5.0, "text": "Flawless service and follow through", "pics": null, "resp": {"time": 1534783350543, "text": "Thank you so much for choosing Medlogic."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "113062680036713344966", "name": "Summer Ransom", "time": 1512674625280, "rating": 5.0, "text": "Josh was so helpful!", "pics": null, "resp": null, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "100765876721359343859", "name": "Tyler Gentry", "time": 1512677534144, "rating": 5.0, "text": "I could not have ask for better customer service!!", "pics": null, "resp": null, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "103974140704658980595", "name": "Nathaniel Br", "time": 1539042671786, "rating": 5.0, "text": "Service was excellent.", "pics": null, "resp": {"time": 1539046255094, "text": "Thank you for choosing Medlogic."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "111137022955798564060", "name": "Jeff Wallace", "time": 1534368698241, "rating": 5.0, "text": "Margo is Awesome!", "pics": null, "resp": {"time": 1534466430580, "text": "Thank you Jeff!! We think she is pretty terrific as well! We look forward to working with you!"}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "116900259880909293075", "name": "Dennis Wallace", "time": 1540497454492, "rating": 5.0, "text": "Great service", "pics": null, "resp": {"time": 1540502788499, "text": "Dennis, thank you for letting Medlogic help you with your CPAP."}, "gmap_id": "0x888917b10b8b987d:0x10da157ffb813e8c"}
{"user_id": "112024404093509722998", "name": "Melinda Boggs", "time": 1578671632871, "rating": 5.0, "text": "I was referred to Dr. Crowder-Hicks after open heart surgery in 2018. This lady is a fantastic doctor! Bedside manner is awesome. Personality like none other. Just a genuine, good person. I would highly recommend her.", "pics": null, "resp": null, "gmap_id": "0x889a4e1c84fe6ebd:0xb0a337c9ff499167"}
{"user_id": "101608011335271665309", "name": "Lesia Feagin", "time": 1550169073694, "rating": 5.0, "text": "Dr. Crowder Hick, is my sleep apnea doctor, thanks to her treatment plan I can actually sleep at nights without feeling drained and a pounding headache every morning.  Very best at patient care.", "pics": null, "resp": null, "gmap_id": "0x889a4e1c84fe6ebd:0xb0a337c9ff499167"}
{"user_id": "105016768690061776514", "name": "Brenda Sheppard", "time": 1557757990920, "rating": 5.0, "text": "The best Doctor ever", "pics": null, "resp": null, "gmap_id": "0x889a4e1c84fe6ebd:0xb0a337c9ff499167"}
{"user_id": "117568858545609498750", "name": "Lisa Overton", "time": 1624293600231, "rating": 5.0, "text": "I’m very happy to leave my first and only Google review (so far, ever) for this excellent medical equipment company! I came in today and met with Danielle who provided me with new medical equipment and the most thorough and stellar instructions! The experience far exceeded my expectations, as well as the quality and features of the equipment itself. Unfortunately, my visit was necessitated by a medical equipment recall. However, this visit put my mind at ease about my ongoing treatment with the new equipment. If you are looking for fast, friendly, and informed service, I highly recommend ONeal Medical!", "pics": null, "resp": {"time": 1624298689257, "text": "Thank you Lisa, we appreciate you and your kind words!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "104681234738951070867", "name": "Susan Johnson", "time": 1595971146157, "rating": 5.0, "text": "I am so glad ONeal Medical is taking care of business while protecting its customers! Farrah came out to my car, picked up my CPap, took it inside for a checkup, and returned it to me in my car. I had been having problems with it and Farrah fixed the problem! I left happy and with a working machine!🥰", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPqewOpk15gDWxV3-Jhm1vqTrc1fAhe4rwJtaIj=w150-h150-k-no-p"]}], "resp": {"time": 1595975244541, "text": "Thank you Suzan, Farah does a wonderful job and while this time has been challenging for us all, we do also appreciate you mentioning the fine service!  Stay well!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "101088033011776367530", "name": "Shaney Dunn", "time": 1621366770549, "rating": 5.0, "text": "Joe & Woody are like family. Dr. Lee's office has done business with this company for over 20 years. If you call or send a email you will get an immediate response. They are here to deliver top notch quality care. Use  this company , amazing service.", "pics": null, "resp": {"time": 1624298735874, "text": "Thank you Shaney, we try hard every day to be the best we can and appreciate your feedback!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "114654149236723827382", "name": "Steven Lee", "time": 1616079919286, "rating": 1.0, "text": "I am not happy. When I bought my Resmed Airsense 10 CPAP they had a VERY limited selection of masks and I'm not happy with the outside vendor mask they had to special order.\n\nLast night my CPAP died middle of the night...repeated attempts to cycle power failed. Had to pull out old CPAP. Showed up at office when they opened, when they plugged it in it worked, but I'm leaving on a trip and don't trust it. The only option they offered was sending it to Resmed...not really an option if you don't have a backup machine. Previous vendor I used just gave me a replacement machine when I had problems.\nBottom line they have VERY limited selection of equipment and no option for loaner or replacement for a critical piece of medical equipment which is still under warranty. I will be changing CPAP vendors immediately.", "pics": null, "resp": null, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "102873856500315189663", "name": "Philip Robinson", "time": 1608857346921, "rating": 5.0, "text": "A gift for Christmas\nMost of us look to give and receive monetary and presents for Christmas.\nI too look forward to this, why?, because of the system we've been conditioned too.\nWell I received a gift today that beats all those gifts.I Received a gift of friendship\n\nI came to spend Christmas with one of my children . I drove 12 hrs. To get here only to find out at 1130pm. That part of my cpap mask was left at home 12hrs. Away. I went to a late night emergency clinic to find one only to find out they couldn't help. I then went to the emergency room at the closest hospital to find out theirs weren't comparable either. I almost resigned myself to stay up all night fearing to go too sleep.  See sleep Anna is nothing to play with, breathing can stop and kill you so going to sleep is dangerous.\n\nI went on line to see if any of the company's that delt with breathing equipment if they had any emergency after-hours  procedures.God is great. As I glanced through  all the options this one stuck out for the simple reason that they emphasized their care for late-night and emergency needs. My son and I called and left messages hoping that someone would call back.\n\nTheir advertisement said that after 12pm that their recording system would call back in the morning. But being it's a holiday I didn't think anyone would.  But by the grace of God around 1210 I was at the hospital emergency room when I got a call. To my surprise the caller wasn't the on call person but one of the owners themselves.\n\nSee he took the on-call because the on-call person tested positivefor Cov19 and he decided to not put anyone else on call.  He had never before  been on call. He met me at his office 15 minutes later, gave me a complete upgraded mask for  free. Saying no one should be deprived of a goods night sleep.\n\nSo to Michael Harden with ONEAL MEDICAL in Birmingham Alabama, you have given me the best Christmas gift, friendship,commitment,and above all, your word that you would answer anyone who needed help no matter when.\n\nThanks", "pics": null, "resp": {"time": 1608916953736, "text": "Thank you Phillip!  All our best and happy holidays sir!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "114623558906915944218", "name": "Bob Beaty", "time": 1602089834124, "rating": 5.0, "text": "O'neal has been my CPAP supplier/support go-to for several years. They all are friendly and always helpful. During this \"challenging time\" the necessary curbside interaction with masking and social distancing is very professional and courteous.  Farah is very knowledgeable and up to date on multiple CPAP systems and the proper accessories.\nShe quickly re-set my machine's prescription and provided me a status update on my machine.  They are a pleasure to work with.\nB", "pics": null, "resp": {"time": 1602597758618, "text": "Thanks Bob! We appreciate you letting us know about your positive experience!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "114567585681602944469", "name": "Pete Partin", "time": 1582418995250, "rating": 1.0, "text": "My husband has been on oxygen since 2015.  Since 2017 he has repeatedly asked about a portable concentrater.  Repeatedly he was told that he did not qualify and would not qualify until he had been on oxygen for 5 years.  Now he has a doctors prescription for one but they will not submit it to Medicare because he will be \"in the gap\" starting in April and they will not be receiving any reimbursement from Medicare, but  would have to continue providing service regardless.", "pics": null, "resp": {"time": 1582464825544, "text": "Is your husband a current OXYGEN customer of ONeal Medical because we have no way of knowing based simply on a Google review.\n\nRegardless, a 1 star review is simply not warranted based on the policy of YOUR insurance plan.  We aren't happy about Medicare's policy of paying for oxygen, we hear complaints about it frequently and so do other oxygen companies, but ONeal Medical didn't create the \"gap\" and Medicare's low payment rates,\n\nYour insurance plan, Medicare, created this mess, not ONeal Medical.\n\nYes, it is up to our company to provide service for the entire 5 years, yet ONLY get paid for the first 3, and then for 2 whole years (the \"gap) basically free of charge. Bear in mind that over this entire 5 year period, we include:\n-24 hours service\n- maintain the equipment\n- free delivery\n-all tubing and supplies / filters\n-file paperwork on the patient's behalf,\n-and from time to time we even provide free oxygen service for patients who travel.\n\nWe would be happy to assist once the \"gap\" period is over, you have the option of privately purchasing a portable oxygen concentrator, but in no way we did we earn a 1 star review as  we feel your review is more a reflection of Medicare's onerous policy, perhaps your misunderstanding of such, but in no way of our company’s performance.\n\nYou can call our office and ask to speak to one of the owners for a more detailed explanation if you wish, and you can call 1-800- MEDICARE as well.\n\nThe process of getting a portable oxygen concentrator, a fairly complex medical device, is VERY fact dependent, there are significant clinical issues to consider as well, so we would encourage you to contact us again so we can fully explain your options, but a 1 star review, no, that's simply not warranted.\n\nNot at all."}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "102662807047269058970", "name": "Cooper Family", "time": 1582752586627, "rating": 5.0, "text": "The staff is knowledgeable and friendly! They really spend the time to help you understand the equipment and do whatever they can to make you happ!", "pics": null, "resp": {"time": 1582757541418, "text": "Hey thank you!  We appreciate this and will pass along to our staff!  Call if you ever need us!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "110500818666655555266", "name": "Casey Bentley", "time": 1563972245695, "rating": 5.0, "text": "Great family owned business for ALL your DME needs!  Great people.", "pics": null, "resp": {"time": 1565799763692, "text": "Thank you Casey!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "107899614337291875242", "name": "Lauren Stinson", "time": 1550454301849, "rating": 5.0, "text": "Excellent and prompt service from O'Neal Medical! Both gentlemen that came to our home to set up oxygen equipment were courteous, patient and knowledgeable. The support staff were also very friendly and helpful. It was wonderful to work with such professional and personable staff members during a stressful time. I would highly recommend O'Neal Medical!", "pics": null, "resp": {"time": 1565799838745, "text": "Thank you Lauren!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "109257703902066368292", "name": "Clarence Fortune", "time": 1548255961903, "rating": 1.0, "text": "Very poor customer service. Received 4 threatening statements for products paid for 4 months ago. Management refused to come to the phone or come out of the office to discuss this. I insisted on a statement showing my entire payment history which showed a zero balance. After receiving another statement for these same changes, management still refused to discuss this.", "pics": null, "resp": {"time": 1548278602186, "text": "Someone will contact you.  We strive for great customer service."}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "116838303445337895732", "name": "W Smith", "time": 1536880468221, "rating": 5.0, "text": "I was using another Medical Supply in Pelham Al. They were the worst company I've ever encountered. I was looking for a good Medical supply and ran across O'Neal Medical. I gave them a try. They actually repaired my C-Pap mask to fit properly, and I wasn't their customer at that time. In days to come I became a customer of O'Neal Medical, and very glad I did.\nThe people are very courteous and caring. They seem to give you the time needed to get you fitted and make sure your happy. My experience with O'Neal Medical is EXCELLENT.....proud to have found them.\nWalt S", "pics": null, "resp": {"time": 1565799847860, "text": "Thank you!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "101956615004864688548", "name": "Cindy Allen", "time": 1460864421091, "rating": 5.0, "text": "I have been using O'Neal Medical for my CPap needs for the last 5 years. They are very helpful whenever I need them to answer any question that I might have. They also have the supplies that I need on hand. I don't have to wait 6 week like I did at my previous supplier. Thanks O'Neal for taking care of us!", "pics": null, "resp": {"time": 1460991374524, "text": "Thank you for the kind words!  We value each and every customer!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "117675592409946593202", "name": "SAL ROSSI", "time": 1597820741925, "rating": 5.0, "text": "Very professional.", "pics": null, "resp": {"time": 1597837190981, "text": "Thanks Sal, we appreciate you!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "109349567589229709050", "name": "Scott Davis", "time": 1536859508261, "rating": 5.0, "text": "Very responsive to my CPAP needs. Very friendly staff.", "pics": null, "resp": {"time": 1565799858470, "text": "Thank you Scott!"}, "gmap_id": "0x888923a7d2fbe47d:0x1c69d6f4b259b17c"}
{"user_id": "109903370887922201950", "name": "Houston Huggins II", "time": 1602008970403, "rating": 1.0, "text": "New to the area. This is, without question- the WORST patient care experience I have ever had! The doctor is completely detached from the patient care process. She is a condescending narcissistic clock watcher. There was no information about my supplies prescription given to me. I am ashamed to say that I waited 6 weeks to reach out to the sleep center to find out where my supplies were-but then I was told who the supplier was and that I had to make contact with them and go get the supplies. DON'T MAKE THE SAME MISTAKE I MADE....DON'T WASTE YOUR VALUABLE TIME.....DON'T GO HERE!", "pics": null, "resp": {"time": 1611249443120, "text": "Hello, Mr. Huggins. We're so sorry to hear that you had a negative experience with one of our physicians. Please consider calling the Patient Advocate so we can learn more about your concerns and work to address them. The advocate can be reached at (256) 265-9449."}, "gmap_id": "0x886266229824aec1:0x1ff17cfb8c48325e"}
{"user_id": "102404628161888105457", "name": "Simeon", "time": 1448007697817, "rating": 5.0, "text": "Staff is very nice and answered all of my questions.", "pics": null, "resp": null, "gmap_id": "0x886266229824aec1:0x1ff17cfb8c48325e"}
{"user_id": "103629218486334923927", "name": "Polly Oneal", "time": 1551282951240, "rating": 5.0, "text": "Efficient Dr. & Staff", "pics": null, "resp": null, "gmap_id": "0x8888a800a8c52b09:0x80355a923e588a14"}
