{"user_id": "115952524104878996236", "name": "Pritchard Allen", "time": 1602276811997, "rating": 5.0, "text": "Love going in this place. The staff is always extremely helpful and friendly and the prices are very competitive. If you need something soccer related, they've got it and will take great care of you.", "pics": null, "resp": null, "gmap_id": "0x888918fd12d554ed:0x45a1644ae65d7546"}
{"user_id": "109021368200460848711", "name": "jjefferi001", "time": 1612122058288, "rating": 5.0, "text": "Best soccer store ever", "pics": null, "resp": null, "gmap_id": "0x888918fd12d554ed:0x45a1644ae65d7546"}
{"user_id": "101615955155635895773", "name": "Eddie Castaneda", "time": 1530492872719, "rating": 5.0, "text": "This is greatest soccer store! I’ve been looking for a Mexico jersey for a while and couldn’t find them in any stores around me in Atlanta or online. So I googled some soccer stores outside of state and I happened to come up on this one. So I called and asked if they had any and he said they’re going fast but he had some. I told him I was driving from over 2 hours away just to get that Mexico jersey and he did not hesitate to hold the jersey for me. I told him I’d be there the next day when they opened. So the next day I left from Atlanta to Alabama (just a little over 2 hour drive). It was definitely worth the drive! As soon as we walked in he was quick to show me the jersey. We also looked around the store and they have a really great selection of soccer stuff. I definitely recommend this store to anyone! Great customer service!", "pics": null, "resp": null, "gmap_id": "0x888918fd12d554ed:0x45a1644ae65d7546"}
{"user_id": "109735627148416967102", "name": "Brian Burris", "time": 1503581888463, "rating": 5.0, "text": "I love this place and Michael, the owner, as well as the rest of the staff are very professional, helpful, friendly, and great to work with.   Best place in Birmingham with the best prices for everything soccer and this is where I send my players when they need gear. Perfect store for both players and coaches.  Stay away from the bigger chains when you can and support local ownership.", "pics": null, "resp": null, "gmap_id": "0x888918fd12d554ed:0x45a1644ae65d7546"}
{"user_id": "101743733764088910855", "name": "ford boswell", "time": 1485910476471, "rating": 5.0, "text": "Best soccer shop in town by far. Apparently it's under new ownership now, and has moved from its old location to the adjacent shopping center. New owner is extremely helpful on the phone and in person. Store selection is great for youth and adults and prices are in line with online retailers. They even had youth Copas. Why go anywhere else?", "pics": null, "resp": {"time": 1485936643936, "text": "Thank you very much for the positive review! We appreciate your business and hope you come back and see us soon."}, "gmap_id": "0x888918fd12d554ed:0x45a1644ae65d7546"}
{"user_id": "104940945612604210074", "name": "Francisco Lopez", "time": 1505923686470, "rating": 5.0, "text": "I went to the store no to long ago and it was great! I  Love their prices on cleats. But the help that they give you is even better they will let you try on every pair of cleat if needed! They will Help you dicide if your unsure. My son needed everything for soccer I walked in and walked out in less than 10 minutes with everything I needed for my son. If you don't know anything about soccer don't worry the guys at soccer Nation will help you!", "pics": null, "resp": null, "gmap_id": "0x888918fd12d554ed:0x45a1644ae65d7546"}
{"user_id": "107622135192848016573", "name": "Katherine Lewis", "time": 1519506668871, "rating": 5.0, "text": "I know nothing about soccer, but both my kids wanted to play. We received great service with sizing for both kids. They had all the colors you could imagine in several different shoes/guards/socks. My picky kids even got the preferred colored balls (that were checked and inflated with air if needed). All within 2 miles of our house! Thanks.", "pics": null, "resp": null, "gmap_id": "0x888918fd12d554ed:0x45a1644ae65d7546"}
{"user_id": "113259993096284344096", "name": "Whit Blackburn", "time": 1498522929215, "rating": 5.0, "text": "Best place in Birmingham to buy anything soccer!! Come support your local soccer shop!! Brought the price down to where I was comfortable buying and could buy! Great service!", "pics": null, "resp": null, "gmap_id": "0x888918fd12d554ed:0x45a1644ae65d7546"}
{"user_id": "114354963914397347923", "name": "Jose Samora", "time": 1498313629908, "rating": 3.0, "text": "I was in town on business and wanted to pick up a gift for my son to take home. I arrived at the store during a torrential downpour. There was nobody inside for a couple of minutes. Finally a worker arrived from the back. He made it seem like it was a hassle that I was there.\n\nI looked around for at least twenty minutes. I asked for help on sizing on the kids kits and he didn't know what the numbers correlated to in S/M/L.  I ended up buying a jersey for myself.\n\nThe store and selection were great. The service was not. I went to another store in town that had a decent selection but excellent service.", "pics": null, "resp": {"time": 1498490136955, "text": "Jose, first thank you for stopping by although it was horrendous weather. And, also thank you for supporting our local business and purchasing a jersey from us. Now about your experience with our employee, I would like to talk to you personally about that because we strive for excellent customer service here at Soccer Nation, and it seems that we did not satisfy that with your case. Could you call our store (205)822-7900 and ask for our store Owner, Michael. We'd like your feedback to resolve this matter and improve customer service through our employees. Thank you!"}, "gmap_id": "0x888918fd12d554ed:0x45a1644ae65d7546"}
{"user_id": "103610777712575692006", "name": "Owen Stayner/ThisWorkplace360", "time": 1559575856213, "rating": 5.0, "text": "Great selection and easy location with lots of parking. Very friendly staff", "pics": null, "resp": null, "gmap_id": "0x888918fd12d554ed:0x45a1644ae65d7546"}
{"user_id": "110071871398925824376", "name": "Himber Orellana (Mr. O)", "time": 1539284602582, "rating": 5.0, "text": "Great store.  Found everything I needed. Griefer coach and new soccer parents.", "pics": null, "resp": null, "gmap_id": "0x888918fd12d554ed:0x45a1644ae65d7546"}
{"user_id": "109655891144085650720", "name": "Lance Curry", "time": 1551034481199, "rating": 5.0, "text": "Great selection, knowledgeable staff. Everything a soccer player could want or need.", "pics": null, "resp": null, "gmap_id": "0x888918fd12d554ed:0x45a1644ae65d7546"}
{"user_id": "115392937159703287326", "name": "javier valencia", "time": 1498519178597, "rating": 5.0, "text": "Been doing business with them since they moved and changed their name i have to say managment is awesome very polite to customers", "pics": null, "resp": null, "gmap_id": "0x888918fd12d554ed:0x45a1644ae65d7546"}
{"user_id": "107799858314769773208", "name": "red_pandaGaming", "time": 1536090945184, "rating": 5.0, "text": "Didn’t have good range in sizes and selection was on the low end in the store, however the owner and the store is very compromisable and will work with you if you need anything specific. Came back and found everything that I was lookin for and more.", "pics": null, "resp": null, "gmap_id": "0x888918fd12d554ed:0x45a1644ae65d7546"}
{"user_id": "107672176145395570866", "name": "Elizabeth Ochoa", "time": 1485239077993, "rating": 5.0, "text": "Great selection of soccer gear, and new store renovation looks great!!👍🏼", "pics": null, "resp": null, "gmap_id": "0x888918fd12d554ed:0x45a1644ae65d7546"}
{"user_id": "100505103005926214067", "name": "David Gonzalez", "time": 1474494485371, "rating": 5.0, "text": "Great store! Has everything you need with great prices.", "pics": null, "resp": null, "gmap_id": "0x888918fd12d554ed:0x45a1644ae65d7546"}
{"user_id": "118095008521537277234", "name": "Conner Harry", "time": 1485130675924, "rating": 5.0, "text": "Responded to all of my questions and was very nice.", "pics": null, "resp": null, "gmap_id": "0x888918fd12d554ed:0x45a1644ae65d7546"}
{"user_id": "107358436341166606865", "name": "KaiLian Davis", "time": 1545415098104, "rating": 5.0, "text": "So helpful and friendly!", "pics": null, "resp": null, "gmap_id": "0x888918fd12d554ed:0x45a1644ae65d7546"}
{"user_id": "114273850206918808178", "name": "Eduardo Ochoa", "time": 1555887379856, "rating": 5.0, "text": "This customer service is clutch", "pics": null, "resp": null, "gmap_id": "0x888918fd12d554ed:0x45a1644ae65d7546"}
{"user_id": "113327648651275060035", "name": "Sam S", "time": 1508952695264, "rating": 5.0, "text": "Great customer service", "pics": null, "resp": null, "gmap_id": "0x888918fd12d554ed:0x45a1644ae65d7546"}
{"user_id": "106007348253712811444", "name": "Ever Duarte", "time": 1539035181785, "rating": 5.0, "text": "(Translated by Google) Excellent Soccer Store\n\n(Original)\nExcelente tienda de Soccer", "pics": null, "resp": null, "gmap_id": "0x888918fd12d554ed:0x45a1644ae65d7546"}
