{"user_id": "110686894710486879266", "name": "Holly Walker", "time": 1602635578401, "rating": 5.0, "text": "This counselor is amazing. She was very helpful!! Really appreciate all of her help!", "pics": null, "resp": null, "gmap_id": "0x888a3eaff1aa5223:0x4ad10ecb2542b819"}
{"user_id": "107542633975982889553", "name": "Kadie Oquain", "time": 1597091640070, "rating": 5.0, "text": "A very friendly place nice people too", "pics": null, "resp": null, "gmap_id": "0x888a3eaff1aa5223:0x4ad10ecb2542b819"}
{"user_id": "105165656772873295699", "name": "Elizabeth Barrera", "time": 1600892542403, "rating": 1.0, "text": "How do I give you zero stars? The staff is not well-informed and rude. I have trouble with your staff almost every visit.\nDuring my very first visit, the staff was incredibly rude and inconsiderate. The lady told me not to wait too long to have children. She said that she has a 10 year old and she’s 26, so she had her child when she was 16 - a child having a child.\nI am an adult that choosing not to have children at this time. I don’t understand why someone who isn’t a doctor or knows my medical history, would be giving me this advice. Completely rude and unprofessional.", "pics": null, "resp": {"time": 1600893442262, "text": "Ms. Barrera, Sorry we didn't live up to 5-STARS. We appreciate your feedback - but would like the opportunity to make it right, if possible. We would like to discuss this situation further with you. Please call (251) 690-8832 and ask to be transferred to Kelly Warren. She is in charge of Family Health. Thank you and please call us."}, "gmap_id": "0x889a51e2105ccc75:0x20501561a63c2a6c"}
{"user_id": "114600898752157286665", "name": "Daniel Stombaugh (The Man and The Wall)", "time": 1600895167449, "rating": 5.0, "text": "People react to stress in different ways. The most common way is with impatience, rudeness, and overall and concern for anyone else. I wanted to leave a review about the clinical staff at the Mobile County Health Department. I have personally seen them go above and beyond to make sure that their clients are greeted, processed, and cared with excellence in spite of the way they are treated in return. I know it can be tough to give patience to someone who is not giving you patience, and it is difficult to give love to someone who is not showing love, to provide professional responses to unprofessional comments. The Mobile County Health Department staff excels in responding with kindness, fairness, and with compassion! Thank you for what you all do!", "pics": null, "resp": {"time": 1600953626916, "text": "Thanks for the 5-STAR review!"}, "gmap_id": "0x889a51e2105ccc75:0x20501561a63c2a6c"}
{"user_id": "110248679584865014002", "name": "Candace Casher", "time": 1614892209234, "rating": 1.0, "text": "I would give them 0 stars if I could very unprofessional.", "pics": null, "resp": {"time": 1614893083818, "text": "Sorry we didn't live up to 5-STARS. We appreciate your feedback - but would like the opportunity to make it right, if possible. We would like to discuss this situation further with you. Please call (251) 690-8832 and ask to be transferred to Kelly Warren. She is in charge of Family Health. Thank you and please call us."}, "gmap_id": "0x889a51e2105ccc75:0x20501561a63c2a6c"}
{"user_id": "105185616189464877064", "name": "Keirstyn Leigh-Ann", "time": 1605218024179, "rating": 1.0, "text": "wish i could give 0 stars absolute horrible staff . tried to take a minor back by their self on their first visit . i wouldn’t even let my worst enemies go there . highly disrespectful.", "pics": null, "resp": {"time": 1605273225219, "text": "Sorry we didn't live up to 5-STARS. We appreciate your feedback - but would like the opportunity to make it right, if possible. We would like to discuss this situation further with you. Please call (251) 410-4377 and ask to be transferred to Charity Gardner. She is in charge of Family Health's Women's Center. Thank you and please call us."}, "gmap_id": "0x889a51e2105ccc75:0x20501561a63c2a6c"}
{"user_id": "114398964547755717902", "name": "Sierra Young", "time": 1584483378153, "rating": 1.0, "text": "I've been coming to the women center for 11 years. One of the Nurse Practitioners was highly rude, it made me feel uncomfortable giving her my personal information. The mid nurse told me this will be the last time I assist you. I will not recommend women center to no one. They only care for women that are pregnant. The Staff was unprofessional I never come back into this place.", "pics": null, "resp": {"time": 1584542291417, "text": "Sorry we didn't live up to 5-STARS. We appreciate your feedback - but would like the opportunity to make it right, if possible. We would like to discuss this situation further with you. Please call (251) 690-8832 and ask to be transferred to Kelly Warren. She is in charge of Family Health. Thank you and please call us."}, "gmap_id": "0x889a51e2105ccc75:0x20501561a63c2a6c"}
{"user_id": "109194252358337414714", "name": "Angela King", "time": 1534820494860, "rating": 1.0, "text": "They have the patient portal so you can communicate with them, but nobody ever responds. I sent a message in February and to this day still haven't received a reply. I called today and nobody even answered the phone. I'm trying to make an appointment and can't. Is the place even still open?", "pics": null, "resp": {"time": 1534853912840, "text": "Sorry we didn't live up to 5-STARS. We appreciate your feedback - but would like the opportunity to make it right, if possible. We would like to discuss this situation further with you. Please call (251) 690-8832 and ask to be transferred to Dr. Angelia Lewis. Dr. Lewis is in charge of Family Health. Thank you and please call us."}, "gmap_id": "0x889a51e2105ccc75:0x20501561a63c2a6c"}
{"user_id": "117956665814948076450", "name": "sabrina martin", "time": 1606252513474, "rating": 1.0, "text": "If I could  give less than one star I would the minute I walked in everybody was rude After waiting weeks for appointment I was told I couldn't see the doctor because they couldn't find my records wouldn't even let me see a doctor even though I had appointment I need to see a doctor bad have to wait again and go somewhere else!", "pics": null, "resp": {"time": 1606311006955, "text": "Sorry we didn't live up to 5-STARS. We appreciate your feedback - but would like the opportunity to make it right, if possible. We would like to discuss this situation further with you. Please call (251) 690-8832 and ask to be transferred to Kelly Warren. She is in charge of Family Health. Thank you and please call us."}, "gmap_id": "0x889a51e2105ccc75:0x20501561a63c2a6c"}
{"user_id": "102528215224572588880", "name": "LOVELY JJ", "time": 1514539433804, "rating": 1.0, "text": "Very rude staff I called on a Friday around twelve to make appointment was put on hold for ten minutes just to be told a nurse would call me back. Never was I told that they have 24-48 hrs to return your phone call. I would have just went to hospital.  So I called them again on a Wednesday around 4pm just to be spoken to very rude.  Because again no one returned my call. Its too many Doctor office in Mobile. Still don't have an appointment and I'm still in pain I think its cancer but I don't know. I explained all of that to the  lady Friday. How the infection could be spreading. My point is these people dont Care about your care at all. Go some place else.", "pics": null, "resp": {"time": 1514899899940, "text": "We would like to discuss this situation further with you. Could you please call (251) 690-8832 and ask to be transferred to Dr. Angelia Lewis? Dr. Lewis is in charge of Family Health and would like to speak to you regarding your experience at the Women's Health Center. Thank you."}, "gmap_id": "0x889a51e2105ccc75:0x20501561a63c2a6c"}
{"user_id": "107391704134871226103", "name": "Brittney Catchings", "time": 1508277758298, "rating": 3.0, "text": "Got there at 1130 , appointment was at 12 didnt get seen til 1. Way to long to wait. The women at the front desk seem like they have an attitude. No reason to have a attitude. If you don't like the public, find another job. Also, the women at the front shouldn't discuss patients aloud where they can be heard.", "pics": null, "resp": {"time": 1508351094940, "text": "We are sorry to hear about what happened.  We would like to discuss this situation further with you. Could you please call (251) 690-8832 and ask to be transferred to Dr. Angelia Lewis? Dr. Lewis is in charge of Family Health and would like to speak to you regarding your experience at the Women's Health Center."}, "gmap_id": "0x889a51e2105ccc75:0x20501561a63c2a6c"}
{"user_id": "108741410623994022659", "name": "Agalean Clemons", "time": 1465400031033, "rating": 5.0, "text": "Always quick n everyone that works there is nice...", "pics": null, "resp": {"time": 1476711114874, "text": "Thanks for the kind words and 5-Star review!"}, "gmap_id": "0x889a51e2105ccc75:0x20501561a63c2a6c"}
{"user_id": "100598554270699563292", "name": "Sabrina Lampkin", "time": 1559710467896, "rating": 1.0, "text": "My appointment was at 9:30 I seen a doctor at 11:00 they slow and rude.they lied about I was high risk of diabetes", "pics": null, "resp": {"time": 1559743141367, "text": "Sorry we didn't live up to 5-STARS. We appreciate your feedback - but would like the opportunity to make it right, if possible. We would like to discuss this situation further with you. Please call (251) 690-8832 and ask to be transferred to Kelly Warren. She is in charge of Family Health. Thank you and please call us."}, "gmap_id": "0x889a51e2105ccc75:0x20501561a63c2a6c"}
{"user_id": "114560148923091028022", "name": "Stephanie Perales", "time": 1516986431975, "rating": 1.0, "text": "Always hard to make an appointment have called on two different occasions and all they tell me is to call the next day", "pics": null, "resp": {"time": 1516987204095, "text": "Sorry we didn't live up to 5-STARS. We appreciate your feedback - but would like the opportunity to make it right, if possible. We would like to discuss this situation further with you regarding the Woman's Health Center on Cox Street. Please call (251) 690-8832 and ask to be transferred to Dr. Angelia Lewis. Dr. Lewis is in charge of Family Health. Thank you."}, "gmap_id": "0x889a51e2105ccc75:0x20501561a63c2a6c"}
{"user_id": "115962906279157035200", "name": "Paige Ecker", "time": 1564587795215, "rating": 1.0, "text": "The staff was friendly BUT getting someone on the phone or even getting them to call you back is like pulling teeth I swear and waiting almost two weeks for a call is ridiculous", "pics": null, "resp": {"time": 1564662105934, "text": "Paige, sorry we didn't live up to 5-STARS. We appreciate your feedback - but would like the opportunity to make it right, if possible. We would like to discuss this situation further with you. Please call (251) 690-8832 and ask to be transferred to Kelly Warren. She is in charge of Family Health. Thank you and please call us."}, "gmap_id": "0x889a51e2105ccc75:0x20501561a63c2a6c"}
{"user_id": "107518830114998563835", "name": "Monique Martin", "time": 1502370638929, "rating": 1.0, "text": "You can never get anyone on the phone to schedule an appt always a wait", "pics": null, "resp": {"time": 1502715183982, "text": "We would like to discuss this situation further with you. Could you please call (251) 690-8832 and ask to be transferred to Dr. Angelia Lewis? Dr. Lewis is in charge of Family Health and would like to speak to you regarding your experience at the Women's Health Center."}, "gmap_id": "0x889a51e2105ccc75:0x20501561a63c2a6c"}
{"user_id": "101394856852426848023", "name": "DadaSay True", "time": 1456405640455, "rating": 5.0, "text": "Quick and very caring and respectful", "pics": null, "resp": {"time": 1476711092562, "text": "Thanks for the rating of 5-Stars!"}, "gmap_id": "0x889a51e2105ccc75:0x20501561a63c2a6c"}
{"user_id": "115975198231760035535", "name": "Cocina con Vanessa", "time": 1569955578669, "rating": 5.0, "text": "(Translated by Google) It is true that those who attend do not do it well but I went for 8 months and I always preferred that Angelica took care of me because she is very kind and knows how to do her job very well so I have no complaint with her but the other people who attend very bad\n\n(Original)\nes cierto  los que atienden no lo hacen bien pero yo fui por 8 meses y siempre prefería que me atendiera Angelica porque ella es muy amable y sabe hacer muy bien su trabajo así que no tengo queja con ella pero las demás personas que atienden muy pésimo", "pics": null, "resp": {"time": 1569957254756, "text": "Thanks for the 5-STAR review!"}, "gmap_id": "0x889a51e2105ccc75:0x20501561a63c2a6c"}
{"user_id": "108723069670348286189", "name": "Lilian Hernandez", "time": 1566222815172, "rating": 1.0, "text": "(Translated by Google) Very bad attention and whenever I go, there is no doctor and no doctor, so what is a clinic for?\n\n(Original)\nMuy mala la atención  y siempre que voy no ay doctor nunca ay doctor entonces para que es clinica mi pregunta será por ser hispana será racismo o así será con todas las personas", "pics": null, "resp": {"time": 1566226204211, "text": "Ms. Hernandez, we would like to discuss this situation further with you. Could you please call (251) 690-8832 and ask to be transferred to Kelly Warren? You can also leave a detailed message at that number. Mrs. Warren is in charge of Family Health and would like to speak to you regarding your experience at the Women's Health Center. Thank you."}, "gmap_id": "0x889a51e2105ccc75:0x20501561a63c2a6c"}
{"user_id": "100337269323027494756", "name": "Kathy LaRusso", "time": 1602363193439, "rating": 5.0, "text": "I have been seeing Leslie on and off for 2 years.  I am back seeing her on a bi weekly basis.  I think she is fantastic,  I feel safe opening up to her and i respect the direction/work i commit to doing outside of our sessions.  Since Covid all her sessions are via video which is even more convenient.  She has a great staff that is always willing to help with change in schedules, etc.  I recommend her highly.", "pics": null, "resp": null, "gmap_id": "0x88891764eb37a623:0xcdc199130ac856da"}
{"user_id": "106853080787595576763", "name": "Sarene Hampton", "time": 1576727234986, "rating": 2.0, "text": "Inconvenient to get to and limited parking.", "pics": null, "resp": null, "gmap_id": "0x88891764eb37a623:0xcdc199130ac856da"}
{"user_id": "115560266253947324427", "name": "Jennifer Martin", "time": 1610032670384, "rating": 5.0, "text": "While not impressed with the health side I’m very pleased with the dental care. I had to have a couple of teeth pulled. The staff was friendly. The dentist is down to earth, was upfront about how to treat my teeth, and the cost. He made sure I was completely numb and explained everything he was doing or what I was about to hear. I’m an anxious person and he relieved my anxiety by being aware of when my hands tensed up, he would talk to me and ask if I was ok. I was extremely nervous because this was my first experience at a dental clinic rather than private practice. I was extremely pleased and will definitely recommend him to others.", "pics": null, "resp": null, "gmap_id": "0x889baebdcf7f5375:0x12801076f221225f"}
{"user_id": "115482212534389928686", "name": "william smith", "time": 1528461859133, "rating": 5.0, "text": "not sure why everybody complains about this place,I never have a problem when I come here", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMZBDoQ5ByWNB4wtiwZ5_9DsoHlBF0oeSy7fQIM=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOM7YOtRsr6z4BrN3myYXnIWX65XmBDjOc-2oHa=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x889baebdcf7f5375:0x12801076f221225f"}
{"user_id": "103972268638004438018", "name": "Jonathan Lewis", "time": 1611179163084, "rating": 5.0, "text": "Ladies were nice..everything was clean...i wonder why they have such a bad rating on google?", "pics": null, "resp": null, "gmap_id": "0x889baebdcf7f5375:0x12801076f221225f"}
{"user_id": "116893503996608071653", "name": "Barbara Rodriguez", "time": 1582123433812, "rating": 5.0, "text": "My children have been patients of Dr. Bedsole for many years. They are now surly teenagers but she knows how to handle them in a way to get through to them. The level of care my children have received here has always been excellent. The staff may not be the warmest but that does not affect the quality of the services they provide. the work the staff does here is essential and exceptional. Thank you all for the work you do.", "pics": null, "resp": {"time": 1582130918500, "text": "THANKS FOR THE 5-STAR REVIEW!"}, "gmap_id": "0x889baebdcf7f5375:0x12801076f221225f"}
{"user_id": "100297345154044636193", "name": "William Smith", "time": 1603209538354, "rating": 1.0, "text": "Long wait,over an hour.no entry without masks.must stay in your car until your appointment time.", "pics": null, "resp": null, "gmap_id": "0x889baebdcf7f5375:0x12801076f221225f"}
{"user_id": "106850270001888697919", "name": "Amanda Roper", "time": 1566309331752, "rating": 1.0, "text": "They never answer the phone.   Been on hold twice.   1st time for 37 minutes.  2nd time 44 minutes.   Still haven't gotten anyone!!", "pics": null, "resp": null, "gmap_id": "0x889baebdcf7f5375:0x12801076f221225f"}
{"user_id": "104189061303644429247", "name": "Tasha Osburn", "time": 1563385346113, "rating": 1.0, "text": "This place has gotten so bad, it was never good but now... I hate going here. It’s always a hassle. Now they make you sign in in a book so they don’t have to deal with you at all and for people getting their birth control that sucks bc we have to pee before the appointment. So I have to hold it for an hour until you decide you’re ready to see me? Even tho I had an appointment for an hour ago? The ladies at the front desk are so rude and don’t want anything to do with the people that come here. Unless you speak Spanish. Then they’ll bend over backwards for you. Completely unprofessional, all of them. The girl taking my blood couldn’t find a vein... I have VERY high veins. They are always very visible. She was literally digging the needle back and forth in my arm going arm to arm. First time I’ve ever been close to passing out. As soon as I realized what was happening I fought it with everything in me while they laughed and said how white I was. I hate it here.", "pics": null, "resp": null, "gmap_id": "0x889baebdcf7f5375:0x12801076f221225f"}
{"user_id": "112070158585829659620", "name": "Anthony “T.J.” Hanson Jr", "time": 1565019137440, "rating": 5.0, "text": "The dental service staff was just wonderful. They greeted us with big smiles with no judgemental vibes, they're great with my lol princess, and were also very helpful and informative. I give them a 5 stars all day long.", "pics": null, "resp": {"time": 1565025756306, "text": "THANKS FOR THE 5-STAR REVIEW OF DENTAL SERVICES!"}, "gmap_id": "0x889baebdcf7f5375:0x12801076f221225f"}
{"user_id": "106946958377358134665", "name": "Gina Holland", "time": 1560979443385, "rating": 5.0, "text": "Absolutely love this place, great doctors and staff", "pics": null, "resp": null, "gmap_id": "0x889baebdcf7f5375:0x12801076f221225f"}
{"user_id": "107770483665182562591", "name": "Aaron Sheppard", "time": 1582641098675, "rating": 5.0, "text": "Great place, great doctors", "pics": null, "resp": null, "gmap_id": "0x889baebdcf7f5375:0x12801076f221225f"}
{"user_id": "111200287190932733504", "name": "Rebecca Nason", "time": 1472054806447, "rating": 3.0, "text": "Though the dentist is great...his help is not.  My first experience left me concerned. The nurse handling xray pads and equipment that went in my MOUTH with her bare hands. Another nurse shook out a pair of gloves from the doorway to remind her...but she ignored it. I prayed for a different nurse for my next appointment. My second visit was worse...while prepping equipment (even the needle and tools) still no gloves...she's apparently unconcerned about her own health as well.", "pics": null, "resp": null, "gmap_id": "0x889baebdcf7f5375:0x12801076f221225f"}
{"user_id": "111993421303215613396", "name": "Whitney Pittman", "time": 1573235109960, "rating": 1.0, "text": "Called to try and make a wic appointment. Was confused on the question the lady was asking me and she was beyond rude and I hung up. I Will not be going to this location.", "pics": null, "resp": {"time": 1573239619682, "text": "Sorry we didn't live up to 5-STARS. We appreciate your feedback - but would like the opportunity to make it right, if possible. We would like to discuss this situation further with you. Please call (251) 690-8805 and ask to be transferred to Amanda Arnold. She is in charge of WIC. Thank you and please call us."}, "gmap_id": "0x889baebdcf7f5375:0x12801076f221225f"}
{"user_id": "104691507525692070727", "name": "Ashley Gafford", "time": 1527675513482, "rating": 1.0, "text": "Nurse practitioner is horrible. My child has horrible shot anxiety and she didn't even acted like she cared. Kept putting off during the visit to give shot making mh 5 year old anticipate it even more. Didn't get any info about what shots she gave my children. Wasn't clear about anything. Was more considered about when my children has shots last after I told her over and over. Said shot records aren't updated but when I checked and compared old record, they had the exact same ones except the new one had new shots from that day of course. Didnt get prescriptions for medication as she said she was going to do, she didnt write anything down, probably why she kept askong the same questions over and over every time she reentered the toom. Absolute horrible experience. Not to mention was there almost 3 hours for shots.  She is very unprofessional. Parents, do not take your children there. An actual doctor never spoke with me either. Which I've been to health departments prior, my kids have gotten all there shots at one, but this one do not attempt!!!!", "pics": null, "resp": null, "gmap_id": "0x889baebdcf7f5375:0x12801076f221225f"}
{"user_id": "103134324428448998930", "name": "Sara Ferrera", "time": 1496261582385, "rating": 1.0, "text": "Dr. Spiro is a jerk and a joke. Nobody wants to do their job I wouldn't take a dog to this place. It's a last resort as is but i have never in my life seen somewhere that if one person is not there they cant even function and doctor that screams at a nurse because he is too stupid to answer a question in his field of work to tell this lady the answer WOW", "pics": null, "resp": {"time": 1531139892651, "text": "Sorry we didn't live up to 5-STARS. We appreciate your feedback - but would like the opportunity to make it right, if possible. We would like to discuss this situation further with you. Please call (251) 690-8832 and ask to be transferred to Kelly Warren. She is in charge of Family Health. Thank you and please call us."}, "gmap_id": "0x889baebdcf7f5375:0x12801076f221225f"}
{"user_id": "117078324937616882195", "name": "Don Tomas the Time Lord", "time": 1549390343984, "rating": 1.0, "text": "This place needs to be shut down they do not have an x-ray machine you have to go to another facility just to get an x-ray", "pics": null, "resp": {"time": 1549394482673, "text": "Sorry we didn't live up to 5-STARS. We appreciate your feedback - but would like the opportunity to make it right, if possible. We would like to discuss this situation further with you. Please call (251) 690-8832 and ask to be transferred to Kelly Warren. She is in charge of Family Health. Thank you and please call us."}, "gmap_id": "0x889baebdcf7f5375:0x12801076f221225f"}
{"user_id": "109292223286709901852", "name": "Katarina Starnes", "time": 1516676487135, "rating": 1.0, "text": "I made an appointment days prior to my visit. I get there and sign in and as I'm waiting, I get a call from this place, saying no doctors are available for the rest of the day because I didn't give a notice/make an appointment. Waste of my time. Never going back.", "pics": null, "resp": {"time": 1531139823571, "text": "Sorry we didn't live up to 5-STARS. We appreciate your feedback - but would like the opportunity to make it right, if possible. We would like to discuss this situation further with you. Please call (251) 690-8832 and ask to be transferred to Kelly Warren. She is in charge of Family Health. Thank you and please call us."}, "gmap_id": "0x889baebdcf7f5375:0x12801076f221225f"}
{"user_id": "102001682953927756321", "name": "Jaye J", "time": 1515622808104, "rating": 1.0, "text": "They would not let my son see a doctor because I was the father and not the mother but we are both married to each other and he is our biological son,I do not understand why I could not take him to his appointment because I was the father, I was told only the mother could bring him in for his appointment when it was scheduled it was told that I the father will be bringing him in for the appointment.", "pics": null, "resp": {"time": 1531139836294, "text": "Sorry we didn't live up to 5-STARS. We appreciate your feedback - but would like the opportunity to make it right, if possible. We would like to discuss this situation further with you. Please call (251) 690-8832 and ask to be transferred to Kelly Warren. She is in charge of Family Health. Thank you and please call us."}, "gmap_id": "0x889baebdcf7f5375:0x12801076f221225f"}
{"user_id": "107661641613849697568", "name": "Haley Finney", "time": 1501507300243, "rating": 1.0, "text": "Nobody ever answers the phone. I've been trying to call for over an hour now right when they opened and nothing.", "pics": null, "resp": {"time": 1531139812944, "text": "Sorry we didn't live up to 5-STARS. We appreciate your feedback - but would like the opportunity to make it right, if possible. We would like to discuss this situation further with you. Please call (251) 690-8832 and ask to be transferred to Kelly Warren. She is in charge of Family Health. Thank you and please call us."}, "gmap_id": "0x889baebdcf7f5375:0x12801076f221225f"}
{"user_id": "102001682953927756321", "name": "Jaye J", "time": 1515622808104, "rating": 1.0, "text": "They would not let my son see a doctor because I was the father and not the mother but we are both married to each other and he is our biological son,I do not understand why I could not take him to his appointment because I was the father, I was told only the mother could bring him in for his appointment when it was scheduled it was told that I the father will be bringing him in for the appointment.", "pics": null, "resp": {"time": 1531139836294, "text": "Sorry we didn't live up to 5-STARS. We appreciate your feedback - but would like the opportunity to make it right, if possible. We would like to discuss this situation further with you. Please call (251) 690-8832 and ask to be transferred to Kelly Warren. She is in charge of Family Health. Thank you and please call us."}, "gmap_id": "0x889baebdcf7f5375:0x12801076f221225f"}
{"user_id": "113529958662045681860", "name": "Monica Parrish", "time": 1478786708515, "rating": 4.0, "text": "Always helpful", "pics": null, "resp": null, "gmap_id": "0x889baebdcf7f5375:0x12801076f221225f"}
