{"user_id": "104157861279324833069", "name": "Bart Slawson", "time": 1617820572809, "rating": 5.0, "text": "I recently had an inverter control panel burn up. I have a 16 year old solar power system so fixing and replacing was a challenge. Eagle called the manufacturer Outback and asked them if they could fix the inverter. At first they said probably not and needed a new inverter but would not be compatible with rest of my system. After some talks Eagle got Outback to fix inverter for reasonable price, returned inverter, Eagle installed it perfectly with no issues at price quoted. I am very very pleased. Thanks Eagle.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOrWnKt1WzgBbRGsnRMFZLtUIM2cD2lGpDwb4Ie=w150-h150-k-no-p"]}], "resp": {"time": 1617823259281, "text": "Thank you for your kind review Bart. We aim to please!"}, "gmap_id": "0x88891a74c76cd647:0x688732bb1c7db58b"}
{"user_id": "101858998713617623240", "name": "Douglas Melton", "time": 1605316538227, "rating": 5.0, "text": "Eagle Solar & Light did an outstanding job for my business.  They handled every detail from start to finish and have come back to check the panels just like they said they would.  The solar panel system has saved me money on taxes and the monthly power bill.  I highly recommend talking to these guys if you are thinking about solar power.", "pics": null, "resp": {"time": 1605367295867, "text": "Thank you so much for your glowing review!"}, "gmap_id": "0x88891a74c76cd647:0x688732bb1c7db58b"}
{"user_id": "102278904319237039398", "name": "Skip Yates", "time": 1513635910962, "rating": 5.0, "text": "Eagle Solar & Light did a great job installing our photovoltaic system in October 2017, despite having to work through a Montana snowstorm to get it finished. Start to finish took about 6 hours for a 7 KW system.\nAll of the materials arrived a couple of weeks before installation, and the guys traveled to Montana with their tools and got right to work. Sam, Joe and Michael were professional, knowledgeable and easy to work with. The installation breezed through the county inspection with no problems, and we were producing electricity immediately.\nIf you're looking for a cost-effective, professional,  timely solar consultation and install or lighting consultation, I highly recommend contacting Eagle Solar & Light.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPXaSwpCWsvLBXeGXuZGK-9ILFin04P6XXSwBrJ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNlKt-YP2aWiY11_MO2vQwkKSiJUMBsmE09ooun=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO82J3eQ4xXu8EOCitfR5aSYImNmi2t-BUOj_v_=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891a74c76cd647:0x688732bb1c7db58b"}
{"user_id": "117375646141363039427", "name": "Rachel Williams", "time": 1604883698748, "rating": 2.0, "text": "Extremely nice but zero follow through. (they don't provide information when they say they will, don't follow up when they say they will, don't return phone calls, emails, and social media messages (or if they do, they say they will get back to you but never do)", "pics": null, "resp": {"time": 1602249416117, "text": "We are sorry to see you were less than satisfied.   Please call us at 800-982-0808 to clarify and allow us to address your concerns."}, "gmap_id": "0x88891a74c76cd647:0x688732bb1c7db58b"}
{"user_id": "106344686006842798510", "name": "Andrew Edwards", "time": 1591655334432, "rating": 5.0, "text": "ES&L did a great job with a 27KW system at our office 3901 Messer Airport Highway.  I'd highly recommend them for a solar installation.", "pics": null, "resp": null, "gmap_id": "0x88891a74c76cd647:0x688732bb1c7db58b"}
{"user_id": "100402060424410675517", "name": "Mackenzie Brown", "time": 1546548876304, "rating": 5.0, "text": "Eagle Solar & Light did an excellent job installing a system on SouthPoint Bank's new headquarters. When we started construction, we knew we wanted to better our efficiency while using local contractors and materials. Eagle Solar & Light fit the bill perfectly. Thanks!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMosj0D-B0p4EdqqRU1WaQvyFAK6vu1Twh_KijL=w150-h150-k-no-p"]}], "resp": {"time": 1547143230834, "text": "Thank You! We are always happy to help local businesses better their efficiency with solar power!"}, "gmap_id": "0x88891a74c76cd647:0x688732bb1c7db58b"}
{"user_id": "108604605433050526663", "name": "Charles Scribner", "time": 1513639793374, "rating": 5.0, "text": "Eagle Solar did an excellent job installing a Solar Air Conditioner/Heat Pump at my house.  We very pleased with their work and the finished product.  These were its specifications:\n~Connect up to 3 solar panels (900watts)\n~Runs on Solar Power & AC Power\n~11,500 BTU Cooling/13,000 BTU Heating (1 Ton equivalent)\n~Plug n Play Solar Connection\n~No Batteries Required\n~SEER 35\n~Average Power Consumption Cooling = 585 Watts\n~Average Power Consumption Heating = 860 Watts", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPAHdYwSTD_wrebM_eqanKgQLc5vExL2z-RCSYG=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891a74c76cd647:0x688732bb1c7db58b"}
{"user_id": "101590974102285945415", "name": "Amber McKowen", "time": 1513696738998, "rating": 5.0, "text": "The team at Eagle Solar & Light was great to work with. They worked around our schedule and provided a great product for our school. I would not hesitate to consider working with them again.", "pics": null, "resp": null, "gmap_id": "0x88891a74c76cd647:0x688732bb1c7db58b"}
