{"user_id": "104157861279324833069", "name": "Bart Slawson", "time": 1617820572809, "rating": 5.0, "text": "I recently had an inverter control panel burn up. I have a 16 year old solar power system so fixing and replacing was a challenge. Eagle called the manufacturer Outback and asked them if they could fix the inverter. At first they said probably not and needed a new inverter but would not be compatible with rest of my system. After some talks Eagle got Outback to fix inverter for reasonable price, returned inverter, Eagle installed it perfectly with no issues at price quoted. I am very very pleased. Thanks Eagle.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOrWnKt1WzgBbRGsnRMFZLtUIM2cD2lGpDwb4Ie=w150-h150-k-no-p"]}], "resp": {"time": 1617823259281, "text": "Thank you for your kind review Bart. We aim to please!"}, "gmap_id": "0x88891a74c76cd647:0x688732bb1c7db58b"}
{"user_id": "101858998713617623240", "name": "Douglas Melton", "time": 1605316538227, "rating": 5.0, "text": "Eagle Solar & Light did an outstanding job for my business.  They handled every detail from start to finish and have come back to check the panels just like they said they would.  The solar panel system has saved me money on taxes and the monthly power bill.  I highly recommend talking to these guys if you are thinking about solar power.", "pics": null, "resp": {"time": 1605367295867, "text": "Thank you so much for your glowing review!"}, "gmap_id": "0x88891a74c76cd647:0x688732bb1c7db58b"}
{"user_id": "102278904319237039398", "name": "Skip Yates", "time": 1513635910962, "rating": 5.0, "text": "Eagle Solar & Light did a great job installing our photovoltaic system in October 2017, despite having to work through a Montana snowstorm to get it finished. Start to finish took about 6 hours for a 7 KW system.\nAll of the materials arrived a couple of weeks before installation, and the guys traveled to Montana with their tools and got right to work. Sam, Joe and Michael were professional, knowledgeable and easy to work with. The installation breezed through the county inspection with no problems, and we were producing electricity immediately.\nIf you're looking for a cost-effective, professional,  timely solar consultation and install or lighting consultation, I highly recommend contacting Eagle Solar & Light.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPXaSwpCWsvLBXeGXuZGK-9ILFin04P6XXSwBrJ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNlKt-YP2aWiY11_MO2vQwkKSiJUMBsmE09ooun=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO82J3eQ4xXu8EOCitfR5aSYImNmi2t-BUOj_v_=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891a74c76cd647:0x688732bb1c7db58b"}
{"user_id": "117375646141363039427", "name": "Rachel Williams", "time": 1604883698748, "rating": 2.0, "text": "Extremely nice but zero follow through. (they don't provide information when they say they will, don't follow up when they say they will, don't return phone calls, emails, and social media messages (or if they do, they say they will get back to you but never do)", "pics": null, "resp": {"time": 1602249416117, "text": "We are sorry to see you were less than satisfied.   Please call us at 800-982-0808 to clarify and allow us to address your concerns."}, "gmap_id": "0x88891a74c76cd647:0x688732bb1c7db58b"}
{"user_id": "106344686006842798510", "name": "Andrew Edwards", "time": 1591655334432, "rating": 5.0, "text": "ES&L did a great job with a 27KW system at our office 3901 Messer Airport Highway.  I'd highly recommend them for a solar installation.", "pics": null, "resp": null, "gmap_id": "0x88891a74c76cd647:0x688732bb1c7db58b"}
{"user_id": "100402060424410675517", "name": "Mackenzie Brown", "time": 1546548876304, "rating": 5.0, "text": "Eagle Solar & Light did an excellent job installing a system on SouthPoint Bank's new headquarters. When we started construction, we knew we wanted to better our efficiency while using local contractors and materials. Eagle Solar & Light fit the bill perfectly. Thanks!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMosj0D-B0p4EdqqRU1WaQvyFAK6vu1Twh_KijL=w150-h150-k-no-p"]}], "resp": {"time": 1547143230834, "text": "Thank You! We are always happy to help local businesses better their efficiency with solar power!"}, "gmap_id": "0x88891a74c76cd647:0x688732bb1c7db58b"}
{"user_id": "108604605433050526663", "name": "Charles Scribner", "time": 1513639793374, "rating": 5.0, "text": "Eagle Solar did an excellent job installing a Solar Air Conditioner/Heat Pump at my house.  We very pleased with their work and the finished product.  These were its specifications:\n~Connect up to 3 solar panels (900watts)\n~Runs on Solar Power & AC Power\n~11,500 BTU Cooling/13,000 BTU Heating (1 Ton equivalent)\n~Plug n Play Solar Connection\n~No Batteries Required\n~SEER 35\n~Average Power Consumption Cooling = 585 Watts\n~Average Power Consumption Heating = 860 Watts", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPAHdYwSTD_wrebM_eqanKgQLc5vExL2z-RCSYG=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x88891a74c76cd647:0x688732bb1c7db58b"}
{"user_id": "101590974102285945415", "name": "Amber McKowen", "time": 1513696738998, "rating": 5.0, "text": "The team at Eagle Solar & Light was great to work with. They worked around our schedule and provided a great product for our school. I would not hesitate to consider working with them again.", "pics": null, "resp": null, "gmap_id": "0x88891a74c76cd647:0x688732bb1c7db58b"}
{"user_id": "102291662916052329233", "name": "Brian Hall", "time": 1619637787868, "rating": 5.0, "text": "Mr. Holland gave my family and I a tour of his off grid home. He explained everything very well and was very good at answering our many questions. He is an expert in the field and provides honesty without sales pressure. I highly recommend this company for alternative energy solutions.", "pics": null, "resp": {"time": 1619660717643, "text": "Thanks for the kind remarks!  It was a pleasure having you here."}, "gmap_id": "0x8889d9ec57cdc57b:0x79cc4870d3e2db55"}
{"user_id": "102886176615177332104", "name": "Armen Dzhagaryan", "time": 1617391141700, "rating": 5.0, "text": "Back in 2018, Ron and his team installed Tesla charger at our house. They done a very professional work. Very honest and reasonable price. Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x8889d9ec57cdc57b:0x79cc4870d3e2db55"}
{"user_id": "101577353036252072223", "name": "Nike Zeus", "time": 1618326559290, "rating": 5.0, "text": "Great set-up. Friendly and knowledgeable. If you're going off-grid this is the place to call. Or even grid-tied solar. They do it all.", "pics": null, "resp": null, "gmap_id": "0x8889d9ec57cdc57b:0x79cc4870d3e2db55"}
{"user_id": "103291640949527914299", "name": "Steven Peeples", "time": 1601730572628, "rating": 1.0, "text": "Ron invited my wife and me to see his off-grid home and to discuss our design. Turns out he just wanted to talk \"at\" us for hours on end explaining every detail of his system. He never asked us what we wanted or where we were with our house build (which was half finished). We had to interrupt him to get on the topic of our design. After two and a half hours of him talking \"at\" us with no end in sight, we interrupted so we could leave. Although we asked for a quote and followed up two weeks later, we never got anything. If he didn't want the job, he could have just said so. This delayed our design by four weeks.", "pics": null, "resp": {"time": 1601739789359, "text": "Steven, I appreciate and understand your comments.  I deeply regret that I failed to make your tour and the follow-up everything it could and should be.  I'll admit that I often talk too much listen too little.  I intend to take your comments to heart and make changes in my tour presentation to avoid a repeat of your experience.\n\nI spend an inordinate amount of time replying to and communicating with people that have expressed an interest in solar, especially those that have taken the time to come for a tour.  There is one of me and still only 24 hours in a day.  I don't intend to neglect anyone, but my attention goes to those that \"squeak\" the most.  I do wish I'd taken the time to follow up with you and am looking for ways to remedy this deficiency as well.\n\nIt has been five months since you were here and the window of recovery may no longer be open, but if there is anything I can do, PLEASE do not hesitate to let me know.  I'd truly appreciate the opportunity to be of any assistance I can."}, "gmap_id": "0x8889d9ec57cdc57b:0x79cc4870d3e2db55"}
{"user_id": "112719944414639030288", "name": "Vince Piquet", "time": 1596048624614, "rating": 5.0, "text": "Very knowledgeable. Mr. Ron Holland took time out of his day and spent approximately 5 hours showing and explaining to us how solar works and what was required. We will most definitely be doing business with this company and gentlemen in the near future.", "pics": null, "resp": {"time": 1596053189415, "text": "Thanks, V.  It was a pleasure meeting you guys!"}, "gmap_id": "0x8889d9ec57cdc57b:0x79cc4870d3e2db55"}
{"user_id": "102861470035448915956", "name": "Billie Taylor", "time": 1596048825994, "rating": 5.0, "text": "Was extremely knowledgeable about solar-power off grid living. Explained everything in explicit detail. It's not just about going solar as most people think. It is a different way of living. And he explained everything about that. Opened my eyes to things I had not thought about. And he knows because he lives this life not just sells and installs solar power. My husband and I spent several hours with him. We learned so much. I recommend if you are interested in going off grid this is the company to use to make your lifestyle change.  It is going to be an amazing journey.", "pics": null, "resp": {"time": 1596115724610, "text": "And you will never look back.  Freedom is wonderful!"}, "gmap_id": "0x8889d9ec57cdc57b:0x79cc4870d3e2db55"}
{"user_id": "118237769676294769350", "name": "Caleb Martin", "time": 1592248673342, "rating": 5.0, "text": "We had a great time touring this solar facility! Ron was incredibly informative and gracious to show us around his place. I appreciate his honest approach in providing us the tools we need to make an informed decision.", "pics": null, "resp": {"time": 1592278372780, "text": "I enjoyed meeting you guys and appreciate your interest.  Thanks for the review and your kind remarks."}, "gmap_id": "0x8889d9ec57cdc57b:0x79cc4870d3e2db55"}
{"user_id": "107940012260298141721", "name": "John Sauer", "time": 1592432767910, "rating": 5.0, "text": "My visit was extremely beneficial in appreciating the possibilities of off-grid living.  This was helpful in understanding the potential.  Ron is extremely knowledgeable and spent a lot of time sharing information.", "pics": null, "resp": {"time": 1592454340904, "text": "Was nice visiting with you.  I'm looking forward to evaluating your house for solar possibilities."}, "gmap_id": "0x8889d9ec57cdc57b:0x79cc4870d3e2db55"}
{"user_id": "101796625227687989206", "name": "Chase Keel", "time": 1563805937574, "rating": 1.0, "text": "The personnel have been a problem to work with from the start of the installation. I feel misled about the local power company credits available. My system went online in October of 2017, and getting support from this company when issues have occurred has been near impossible. I have one panel that has been out for over 6 months. As I write this, I am waiting on them to show up to address my faulty panel. They were supposed to be here at 9, and it’s currently 9:30. Consistently late and lacking in support.. I wish I had my money back.", "pics": null, "resp": {"time": 1564161631873, "text": "Doug, I'm sorry you are unhappy with your system and our performance. You reviewed and signed all the power company documents.  I always regret any problems with equipment, but the manufacturer has stood behind their warranty and we've done the work to make corrections.  Your system is 100% today.  My biggest regret our inability to make you a VERY satisfied customer.   Ron, Owner of Solar Technology Alabama"}, "gmap_id": "0x8889d9ec57cdc57b:0x79cc4870d3e2db55"}
{"user_id": "103548034070892975595", "name": "Michael Smothers", "time": 1555308492641, "rating": 5.0, "text": "My visit was extremely helpful in understanding the details of off-grid living. Knowledgable and patient staff. Highly recommend if you are considering solar or off-grid lifestyle.", "pics": null, "resp": {"time": 1555517958165, "text": "I'm glad we could bring you some clarity, Michael! Jumping in to solar can seem daunting at first, but the benefits and rewards are well worth it. Feel free to reach out if there's anything else we can do to help.\n\nRon, Owner of Solar Technology Alabama"}, "gmap_id": "0x8889d9ec57cdc57b:0x79cc4870d3e2db55"}
{"user_id": "108480587395293393681", "name": "Lawrence Daniel", "time": 1501442031288, "rating": 5.0, "text": "I thought I knew what I wanted but after meeting with Ron, he designed the perfect system to meet my requirements.  Ron and his staff setup a system that can function in case of grid failure, is complete, independent, and will provide power long-term.  Extremely knowledgeable, hardworking and conscientious staff.  Perfect installation and excellent training.  If you need anything solar, Solar Technology Alabama is the only choice.", "pics": null, "resp": {"time": 1555535042282, "text": "Thanks for the kind words, Lawrence -- glad we could get you all set up. Sometimes a hands on approach to your installation is the best one. Your system should keep you powered for years to come, but if there's ever anything you need, give us a call. -Ron, Owner of Solar Technology Alabama"}, "gmap_id": "0x8889d9ec57cdc57b:0x79cc4870d3e2db55"}
{"user_id": "109290663982171961483", "name": "Carl Katterson", "time": 1501163251658, "rating": 5.0, "text": "Excellent workmanship, professional and easy to work with. Ron, Roger and the rest that I've met and worked on my project were great.", "pics": null, "resp": {"time": 1555946778016, "text": "We're glad that we were able to help you, Carl! Thanks for the kind words about our workmanship. We look forward to working together again in the future. -Ron, Owner of Solar Technology Alabama"}, "gmap_id": "0x8889d9ec57cdc57b:0x79cc4870d3e2db55"}
{"user_id": "112401506454603620035", "name": "Ron Holland", "time": 1498600367985, "rating": 5.0, "text": "We wanted a small back-up system in case of a grid failure. I contacted several other companies and decided\non Ron Holland of Solar Technology Alabama. Ron, Christian and Scotty were all very knowledgeable, professional and honest. I would highly recommend them to anyone.   From our customer, J.B. on 08/23/2015", "pics": null, "resp": {"time": 1555683408285, "text": "I'm glad I could help you find what you were looking for! Solar is great as a main system or a backup plan. Give us a call if there's anything else you need. -Ron, Owner of Solar Technology Alabama"}, "gmap_id": "0x8889d9ec57cdc57b:0x79cc4870d3e2db55"}
{"user_id": "105243261263995551540", "name": "Cotton Rohrscheib", "time": 1462418834158, "rating": 5.0, "text": "Great people, extremely knowledgeable, and easy to work with!", "pics": null, "resp": {"time": 1555962407460, "text": "We love the job we do, Cotton -- that's why it's so fun for us! Thanks so much for the kind review. We hope you had a great experience. Give us a call if you need any more help with a solar installation. -Ron, Owner of Solar Technology Alabama"}, "gmap_id": "0x8889d9ec57cdc57b:0x79cc4870d3e2db55"}
