{"user_id": "100083162803916985556", "name": "Decho 7x", "time": 1623450985758, "rating": 5.0, "text": "This place is amazing. Due to the Coronavirus outbreak it's been rough for this place. The owner is the only person running the whole place. If anyone needs a job around the area, come visit this man. Food is amazing & support local business.", "pics": null, "resp": null, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "114524315967923179605", "name": "Jude Forsyth", "time": 1622677597182, "rating": 4.0, "text": "Nice people who cook good food. Tell them if want something different and they are helpful. I like to order my dishes without broccoli. I ask for extra veggies in my noodles. They are good about allowing substitutes. We did a take out for Mother's Day and they gave us plenty of food.\n\nGood dine in or take out. Located in Flowl River on Dauphin Island Parkway.", "pics": null, "resp": {"time": 1623641866257, "text": "Hi Jude, thank you for being longtime friends of Oriental Palace."}, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "112209841167491633368", "name": "Bob Brandt", "time": 1623870156814, "rating": 5.0, "text": "Never disappointed 😊We had the good fortune to re-discover this location. They were just the BEST in Slidell,LA  21 years ago.", "pics": null, "resp": null, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "112892871605255251471", "name": "Taylor Snow", "time": 1614985720469, "rating": 1.0, "text": "We are here twice while in town. The restaurant dining room appears to be closed forever and this has been turned into carry out also. Our first experience we stopped in on our way home. The woman who I assume owns the pace helped us and could not have been nicer. Our food was delicious. However, all of that is overshadowed by our experience in attempting to order over the phone a week later. A man answered who I assume is her husband and he was extramural rude. I could not get a word in with him, constantly cutting me off and getting angry with me for trying to tell him our order. I ended up telling him he was being rude and that we would be taking our business elsewhere, he informed me he did not care. Pirates Pizza is highly recommend on the island. Go there instead.\n\nI would eat here again, if I hear he is gone.", "pics": null, "resp": {"time": 1615094259092, "text": "It's been tough for everybody since this pandemic. We've tried our best to remain open, with takeout only during this time.\n\nSorry your experience wasn't up to par. In this area, bad phone reception is common. And sometimes, we must take orders under very noisy kitchen environment, talking over loud equipment, exhaust fans, woks . . .\n\nIt happened to be so that day. Couldn't hear you at all the 1st call.\n\nWhen we called back, it was still a spotty connection. We heard you wanted 102 (Palace Special Shrimp) with rice noodles. We tried explaining the 102 comes with white rice (or fried rice). It was frustrating because of the connection - something out of your control. If you heard our voice grew loud or shout-y, it was due to the environment, not our intentions. Then you said you changed your mind.\n\nAgain, sorry it came off as a less than happy experience! We hope you give us another chance, and our doors remain open to you in the meantime."}, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "104029731030475670885", "name": "Natalie Taylor", "time": 1614362858306, "rating": 5.0, "text": "Love this restaurant!  It's a standard go to when we are in the area.  Consistently great good, and the service is second to none.  It won't take long for you to see what I mean.  Give it a try, I guarantee you won't be disappointed!", "pics": null, "resp": {"time": 1614573169379, "text": "Natalie, thanks so much for taking the time to write this awesome review!"}, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "107565643189478262943", "name": "Asad Khan", "time": 1607130271336, "rating": 5.0, "text": "The food here is absolutely amazing... I stopped by for the first time tonight... Picked up a couple of entrees and am simply surprised how great the food is...\n\nThere is no dine in service currently.... I spoke to one of the owners of this establishment tonight too... She was pretty awesome and really described the cuisine well...\n\nI honestly did not expect this quality of food down so South... I believe that this restaurant has been in operations since 2001 and now I understand why...\n\nOrange chicken is awesome!!! I have found a gem...", "pics": null, "resp": {"time": 1614573235794, "text": "Hi Asad! Thanks so much for taking the time to write up this thoughtful, detailed feedback."}, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "100248612935964355170", "name": "Josh Cooper", "time": 1618271932886, "rating": 5.0, "text": "The food is consistently good.  The staff provides excellent service and is very pleasant to speak with as well!", "pics": null, "resp": {"time": 1618366348488, "text": "Glad you enjoyed our food! Looking forward to the next time you're in the area."}, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "115881085193990210925", "name": "Jim Napier", "time": 1620704245721, "rating": 3.0, "text": "It wasn't the worst Chinese I've ever had but it had room for some improvement. In a pinch I guess it would be okay", "pics": null, "resp": null, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "108586730893762503800", "name": "Rainy Day", "time": 1579041768908, "rating": 4.0, "text": "It may not be my favorite place, but the food is cooked fresh and if eating in, the portions are definitely worth the price. It's a quiet little restaurant with children's art on the walls. It has a real family vibe. I haven't had a lot of things on the menu, but the egg rolls are really good.", "pics": null, "resp": {"time": 1573185536549, "text": "Glad to hear your feedback! Hope we can turn into your favorite place soon."}, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "118110487018437017867", "name": "Donna Marie", "time": 1565447635442, "rating": 4.0, "text": "Really good food, friendly service. I've been here a couple times now, they are always welcoming. The place is kept very clean. The food is good. I love that they can alter a dish to your preference, like taking the spice out or adding it.", "pics": null, "resp": null, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "106010756939676474827", "name": "Mj Brown", "time": 1573002587493, "rating": 5.0, "text": "Food was perfect. At 5 minutes til closing the owner welcomed us graciously and even chatted with us while we waited on our order.\nDefinitely  going back!", "pics": null, "resp": {"time": 1573099561911, "text": "We always like to hear from new friends. Thanks for telling us how y'all enjoyed your experience with us. Looking forward to seeing you next time!"}, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "115665999642717403491", "name": "Mary Mareno (Petals)", "time": 1591145229888, "rating": 5.0, "text": "Always good food, usually get takeout.  Generally ready 15 to 20 minutes.  Plenty to eat and good friendly people.", "pics": null, "resp": null, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "104992416640369985282", "name": "Celeste Holsombach", "time": 1565551193055, "rating": 5.0, "text": "Best chinese food you can get! The owner and his family are always wonderful. We've been eating there since before I can remember and we'll keep eating there for as long as they're open!", "pics": null, "resp": {"time": 1565666955724, "text": "Hi Celeste! We always love seeing you and your whole family. Thank you so much for being longtime friends of Oriental Palace."}, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "109807495399620929802", "name": "Mark Byrd", "time": 1578761235649, "rating": 5.0, "text": "He makes all his own, from scratch. Wonderful experience. Always", "pics": null, "resp": {"time": 1578889584132, "text": "Thanks for telling us about your great experiences Mark, we take pride in making food from scratch. See you next time"}, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "102347729127067246547", "name": "Shelia Kimbrell", "time": 1572116942526, "rating": 5.0, "text": "Wonderful family restaurant. Food is excellent, restaurant is clean and the owners are absolutely lovely people!!! One of our favorite places to go.", "pics": null, "resp": {"time": 1572144408627, "text": "Hi Shelia, always glad to see old friends back. So happy to hear you had a great time with us. Hope to see y'all soon!"}, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "115737133621899456099", "name": "Joanne Dees", "time": 1562985514339, "rating": 5.0, "text": "I love this place!!  Really sweet owners, and the food is excellent!  Every dish is made to order.  👍👍", "pics": null, "resp": {"time": 1563053528086, "text": "We are so happy to hear that you enjoy our dining experience Joanne! It is always a pleasure serving patrons like you."}, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "104037640884903367301", "name": "Ryan Ransom", "time": 1545862532237, "rating": 5.0, "text": "First time here stopped on the way back from visiting Fort Gains. Had the Orange chicken and shrimp rangoons. Food and service were excellent. It was fairly quiet being the off season and mid afternoon.", "pics": null, "resp": {"time": 1545942186061, "text": "Thanks for the great feedback! Hope to see you again if you around Dauphin island area."}, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "112521878897695071152", "name": "Lenny Mayers", "time": 1449279880791, "rating": 5.0, "text": "It was a real treat to have such tasty Chinese food down here in Theodore. The chef and staff were very pleasant. The restaurant is very nice and the restroom was very clean. A very nice restaurant, indeed. Thank #You.\nIf I'm ever in the area.......\n#Godspeed.", "pics": null, "resp": null, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "108066609714386398410", "name": "Comrade Salad", "time": 1547665532111, "rating": 1.0, "text": "Let me preface this by saying I have eaten at almost every Asian restaurant in the Theodore and Mobile area, so I've been around.\n\nThis place has the potential to be good, but it isn't it falls short. I ordered the General's Chicken and it came with Fried Rice and a Vegetable Roll. What I got was.... bad. I watched them microwave the food from my seat, so I already knew what was coming. The chicken has a strange after taste and tasted nothing like what you might expect it to taste like, and the Vegetable Roll was uneatable. Worst of all though was the Fried Rice. It was mushy, not at all fried and made to order and tasted like prepackaged rice.\n\nIf this place wants to become a great eating place it needs to wake up. COOK my food, don't reheat it. NOTHING is worse than Fried Rice that is just microwaved. Conversely, I LOVE fresh made rice and won't mind the wait.\n\nUntil they start actively making their food to order WHEN it is ordered I will not reccomend this place. Sorry.", "pics": null, "resp": {"time": 1547697663172, "text": "Thank you so much for taking time out and giving us feedback! We're sorry your meal did not satisfy your expectations.\n\nOur General Chicken is served fresh from the wok with our own recipe, and eggrolls here have always contained vegetables and shreds of pork.\n\nTrue fried rice will naturally vary, and today's was on the soft side. We apologize that it didn't match your tastes. We always take good feedback to heart, and aim to improve next time!"}, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "101000813893957881260", "name": "Kim Thomason", "time": 1543115769666, "rating": 5.0, "text": "Best wonton and egg drop soup.  The Saturday special was wonderful.  Best sweet and sour chicken I have had in 40 years. Will come back when in the area", "pics": null, "resp": {"time": 1543121378882, "text": "Thank you for dining with us, welcome back and have a happy and safe holiday !"}, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "104124685854222856150", "name": "Pamela Waleri", "time": 1547586791324, "rating": 5.0, "text": "Food is always fresh. The eggrolls are very good. Very friendly owners. Clean & comfortable.", "pics": null, "resp": {"time": 1547609247233, "text": "So happy to hear this. We always pride ourselves on freshness. Thank you for the great review!"}, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "114023487879817745438", "name": "Tommy Harmon", "time": 1571181855242, "rating": 4.0, "text": "Slow getting us our food. But was good when we got it", "pics": null, "resp": {"time": 1571194133489, "text": "Hi Tommy! Fresh good food takes time. You added on to your to-go while waiting. If you are in a hurry, ordering ahead is best."}, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "103304141103020099203", "name": "Keith Morrison", "time": 1450740829261, "rating": 5.0, "text": "I've been a customer of Oriental Palace since they opened 11 or 12 years ago. They are so friendly and accommodating. When we call for carry out they know who we are and our preferences. The food is simply fantastic and in all these years I have never, as in not once, received a dish that I was not pleased with.", "pics": null, "resp": null, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "113401641774767970723", "name": "Bill Schenk", "time": 1577594349172, "rating": 5.0, "text": "Chef will adjust the entree for you, and good value for money. Curry Shrimp rocks!", "pics": null, "resp": {"time": 1577673876487, "text": "Glad you love the Curry Shrimp and our 5 star spicy scale! Try the Friday Special Hunan Shrimp, a signature spicy dish. It might surprise you. Happy New Year🎊"}, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "107733104573891911729", "name": "Jim Stricker", "time": 1553703581864, "rating": 5.0, "text": "We loved the restaurant and went as often as we could while we were in Alabama. The food is fresh and delicious.", "pics": null, "resp": {"time": 1553739587182, "text": "Glad to hear you love our restaurant, and we love seeing our customers often too. Looking forward to your next visit around the area."}, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "115080762691692214118", "name": "Laura Lee Cain", "time": 1347599873833, "rating": 5.0, "text": "Authentic with a capital \"A\". Food is incredible . On the way to Dauphin Island. The owners are very nice people. My 16 year old and 9 year old love to eat here. Really great food.", "pics": null, "resp": null, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "103409955913661370402", "name": "Aziza M", "time": 1543107908260, "rating": 5.0, "text": "The best wonton soup I have ever tasted! Everything was delicious I will be coming back when ever I am in the area.", "pics": null, "resp": {"time": 1543121511927, "text": "Thank you for dinning with us, welcome back and have a wonderful holiday!"}, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "104382549747483098051", "name": "Terry Blakeney", "time": 1570831185063, "rating": 1.0, "text": "All the food taste the same ... and cooked to long.. and to high priced", "pics": null, "resp": null, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "115080762691692214118", "name": "Laura Lee Cain", "time": 1347599873833, "rating": 5.0, "text": "Authentic with a capital \"A\". Food is incredible . On the way to Dauphin Island. The owners are very nice people. My 16 year old and 9 year old love to eat here. Really great food.", "pics": null, "resp": null, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "103409955913661370402", "name": "Aziza M", "time": 1543107908260, "rating": 5.0, "text": "The best wonton soup I have ever tasted! Everything was delicious I will be coming back when ever I am in the area.", "pics": null, "resp": {"time": 1543121511927, "text": "Thank you for dinning with us, welcome back and have a wonderful holiday!"}, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "117447323389601157201", "name": "Jessie Mae", "time": 1564529127329, "rating": 5.0, "text": "Good food and friendly folks.", "pics": null, "resp": null, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "114409760344914719368", "name": "Kaylee Patrick", "time": 1589490615985, "rating": 5.0, "text": "Food there is always good", "pics": null, "resp": null, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "105726840199922773663", "name": "Gene Fox", "time": 1556226270270, "rating": 5.0, "text": "Great food and friendly staff!", "pics": null, "resp": {"time": 1556388009494, "text": "Thank you so much for letting us know you enjoy your experiences with us."}, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "118246058068220458158", "name": "Richard Brewer", "time": 1408571566214, "rating": 5.0, "text": "Ignore the review by Aaron Wayman.  He doesn't know what he is talking about.  I live on Dauphin Island, and I have been going to this restaurant since they first opened about ten years ago.  The food is always excellent, and the owner and staff are always very pleasant.  Like most people, I have eaten at many different Chinese restaurants in my life, and I would place this one at the very top of my list.  Their prices are no different than other restaurants.  I have no idea how the other reviewer could have spent $55 dollars unless he was feeding his entire family.  Some people just like to have something to complain about.", "pics": null, "resp": null, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "100824543519356626724", "name": "Justin Parker", "time": 1455932255909, "rating": 4.0, "text": "It's decent, they need more business to increase quality and consistency of the food. Excellent place to eat lunch or dinner after a long day on the water.", "pics": null, "resp": null, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "114642895783139308084", "name": "Donald Tomino", "time": 1502726658173, "rating": 5.0, "text": "Always my number 1 choice. Never a bad meal. Don't pass up a chance to eat here.", "pics": null, "resp": null, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "117881351517501708550", "name": "Charles Whatley", "time": 1543277630707, "rating": 5.0, "text": "Best Chinese food I've eaten! And the owners are so gracious, it's like eating in their home!", "pics": null, "resp": {"time": 1543309002953, "text": "Thank you for dining with us, welcome back anytime and have a wonderful holiday!"}, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "102183886177588521706", "name": "Aaron Wayman", "time": 1370270092731, "rating": 3.0, "text": "Worst food I have ever eaten and I've had some really bad food before.  The eggrolls are loaded with tons of ginger.  The hot and sour soup was loaded with sugar.  Chicken was bland and rubbery and tasted like it was cooked in a microwave.  Vegetables were undercooked.  Fried rice was soggy and salty.  The food is way over priced.  I could have bought $55 dollars worth of dog food and had a better meal.  If you read this review please stay away unless you are preparing for fear factor.", "pics": null, "resp": null, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "117881351517501708550", "name": "Charles Whatley", "time": 1543277630707, "rating": 5.0, "text": "Best Chinese food I've eaten! And the owners are so gracious, it's like eating in their home!", "pics": null, "resp": {"time": 1543309002953, "text": "Thank you for dining with us, welcome back anytime and have a wonderful holiday!"}, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "111476304332150378379", "name": "John Hall", "time": 1535241041300, "rating": 5.0, "text": "Awesome food. Great service", "pics": null, "resp": null, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "101230883377735787004", "name": "Kevin Williams", "time": 1528061839718, "rating": 5.0, "text": "One of the best Chinese food restaurants I've ever been to.", "pics": null, "resp": null, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "101177225290979492021", "name": "Kevin McCandless", "time": 1533481069719, "rating": 3.0, "text": "They only get 3 for being out of sweet and sour pork. Otherwise 5.", "pics": null, "resp": null, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "101091582556971868110", "name": "Rickey Littel", "time": 1462396390579, "rating": 5.0, "text": "We have been a customer for 15 years they're friendly and the food is excellent", "pics": null, "resp": null, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "107845654557874318657", "name": "Cindy Collins", "time": 1524788098040, "rating": 5.0, "text": "Delicious food, friendly service.", "pics": null, "resp": null, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "114116764122808664849", "name": "787sonny", "time": 1435011449193, "rating": 5.0, "text": "Very pleasant experience, food was excellent quality and taste. I will visit again when I go to Mobile.", "pics": null, "resp": null, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "117362293359799051163", "name": "Angela", "time": 1482368282139, "rating": 5.0, "text": "BEST Chinese food you will ever eat! Hung and his wife are the most friendly loving people you will ever meet.", "pics": null, "resp": null, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "114059728519586126025", "name": "Johnny Jones", "time": 1480273837837, "rating": 4.0, "text": "A little pricy but its first class quality food. Best in mobile.", "pics": null, "resp": null, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "108337942747394084089", "name": "Tracy McDonald", "time": 1515979083121, "rating": 5.0, "text": "Very friendly! Wonderful food and drinks! Very clean!", "pics": null, "resp": null, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "113965638177079356285", "name": "Christopher Bryant", "time": 1424050299396, "rating": 5.0, "text": "Food is good but have not been in some time but still top notch", "pics": null, "resp": null, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "114678172589220805810", "name": "Cynthia Hall", "time": 1547918946484, "rating": 1.0, "text": "Terrible. Rice was mushy, shrimp was soggy, could not taste any shrimp in the ragoon", "pics": null, "resp": {"time": 1547958882274, "text": "Correct us if we're mistaken, but you seem to be Friday night's party of two who ordered Sweet & Sour Shrimp, and Sweet & Sour Chicken. It's too bad that we didn't meet your standards! But our waitress, Connie, did ask you how your dinner was a couple times. She mentioned you left us plates with only bits of chicken.\n\nAs to our Shrimp Rangoons, they are filled with cream cheese and beat shrimp. Our local patrons love this recipe!\n\nWish you could've told us about your opinions right away, so we could better serve you then!"}, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "109162811909351671408", "name": "Mike Pullen", "time": 1450142010729, "rating": 1.0, "text": "Only one other small group in the restaurant and it took one and a half hours  to get our first plate on the table took nearly half an hour to serve the table of 9", "pics": null, "resp": null, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "116097023179696766267", "name": "Dennis Frennea", "time": 1526698637096, "rating": 5.0, "text": "Very friendly, food was wonderful!", "pics": null, "resp": null, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "102924370689353337860", "name": "Elizabeth Dumas", "time": 1472774655715, "rating": 5.0, "text": "I've been eating there my entire life and no matter where or what type of Asian place I eat this is still the best place to me and my family.", "pics": null, "resp": null, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "117466594143953574572", "name": "John Deakle", "time": 1562975548367, "rating": 5.0, "text": "Great food", "pics": null, "resp": null, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "108730415867708162165", "name": "Michael Farrier", "time": 1517012560905, "rating": 4.0, "text": "Food was very good", "pics": null, "resp": null, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "107773910865723881946", "name": "Craig Lott", "time": 1546125033629, "rating": 5.0, "text": "#MyFavoritePlaceToEat", "pics": null, "resp": {"time": 1546139082087, "text": "#OurFavoriteCommentToHear"}, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "107695259700085246026", "name": "Sanford G", "time": 1541118299591, "rating": 5.0, "text": "Great", "pics": null, "resp": {"time": 1541182829431, "text": "Thank you!"}, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
{"user_id": "112843063831056106063", "name": "Dano Sheldt", "time": 1463699148538, "rating": 5.0, "text": "Good food", "pics": null, "resp": null, "gmap_id": "0x889a34430abb7193:0x73a92330eae9c41e"}
