{"user_id": "113393998999103138159", "name": "Jessica Cost", "time": 1618523981494, "rating": 5.0, "text": "Dr. Reddy literally saved my life. I came to her three years ago on over 200 units of insulin a day, an Alc of 10.5, and extremely overweight...absolutely miserable. She released me from her care, today, because I no longer need her services. Today, I am completely OFF of insulin, down two medications, and have lost almost 100lbs. She was so very decisive in my care. She was thorough and she doesn't mince words. If you, the patient, does what she advises you to do, YOU WILL SUCCEED. PERIOD. She's good people!!!", "pics": null, "resp": {"time": 1618581789355, "text": "Hello, Ms. Cost. Wow, what an incredible story! Thank you for sharing. We're so pleased to know that you are now off insulin and on the road to a healthier future. We will make sure Dr. Reddy and the rest of the Huntsville Hospital Endocrinology & Diabetes Clinic team know how much you appreciate their efforts. We wish you continued good health."}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "108087568096497140502", "name": "Judi McMillin", "time": 1609363134047, "rating": 5.0, "text": "Dr. Reddy takes care of me for both diabetes#2 and thyroid issues. She is very comforting, knowledgeable, caring, etc. She never rushes my appointment. True...it does take some time waiting for her but it is very worth it. Her staff is fabulous....they all are friendly and caring. The one (Brian) is a total riot! He's very funny and likes to joke with me. This truly is THE doctor you need for these conditions.", "pics": null, "resp": {"time": 1611608916903, "text": "Hello, Ms. McMillin. Thank you so much for the kind words and the great review! We are so pleased to hear that Dr. Reddy and the rest of our team are meeting your needs. We look forward to continuing to care for you in the future."}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "106810881904472922741", "name": "stacy wilks", "time": 1605809550952, "rating": 5.0, "text": "Dr. Reddy is by far the best endocrinologist I have ever been to. She listens and never seems rushed when we are discussing my plan of care. The wait has been very long because of the Covid issues and how long it takes with patients plus the tele calls. The office staff is wonderful. Lynn always answers all questions and is pleasant despite these trying times. I feel like I am getting the best care of all of my years with type 1 diabetes.", "pics": null, "resp": {"time": 1611260854543, "text": "Wow, Stacy. What a wonderful review! We're so pleased  to know that Dr. Reddy is not just meeting your expectations but exceeding them. We appreciate your support and are glad you are part of our Huntsville Hospital Endocrinology & Diabetes Clinic family."}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "115589825808441670651", "name": "Nichelle Carpenay", "time": 1600889188747, "rating": 5.0, "text": "I LOVE this office with Dr. Jindal and his staff! The staff is sure to make you smile and keep you well informed with appointments, prescriptions etc. They even sent a sweet card in the mail. Very, very professional and kind. And Dr. Jindal is such an encouragement and great help with getting his patients better and giving vital information on what is necessary to get healthy. I have already seen improvements being one of his patients. Thanks Dr Jindal and Staff😊", "pics": null, "resp": {"time": 1601059098695, "text": "This is all wonderful to hear, Nichelle! We're so glad to have you as a patient and to know that your health is improving with Dr. Jindal's care. Thank you for taking the time to let others know of your experience with our clinic."}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "106893672237859183268", "name": "Jamie Weinstein", "time": 1582571937853, "rating": 5.0, "text": "Dr Reddy is by far the best endocrinologist that I have seen in my 25 years with type 1 diabetes. She is super knowledgeable and up to date on all new devices and medications and most importantly she listens to every concern and comment I have. She is very punctual, which is very important to me since I have to bring my toddler with me, with whom she is great with as well! Couldn’t recommend her more.", "pics": null, "resp": {"time": 1582582119784, "text": "We appreciate the fantastic review, Ms. Weinstein, and are excited to share your comments with Dr. Reddy. Thank you for your continued trust and support."}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "111823123781686739539", "name": "Donna Maschke", "time": 1580743922180, "rating": 4.0, "text": "Dr. Reddy is very thorough and explains details of treatment well. She is a new physician for my mother and we have seen her twice. Both times I had to call their office because they didn't call in the prescription. Overall we are pleased with our experience", "pics": null, "resp": {"time": 1580762168937, "text": "Thank you for taking the time to leave a review, Ms. Maschke. We're glad to hear that Dr. Reddy has impressed you so far, and we hope to do better in the future regarding your mother's prescriptions. If there's anything else we can do to improve your experience, please call (256) 265-0780 and ask for the Practice Administrator."}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "108120892485025119571", "name": "Troy Biles", "time": 1580138985070, "rating": 5.0, "text": "I’m a patient of Dr. Jindal and I’ve been seeing him approx a year or so. I see these negative reviews and I know after visiting with him during my visits, these reviews are not accurate. His bedside manner is excellent. He’s extremely knowledgable and professional. He listens to me and my concerns and considers what I’m telling him. Someone mentioned that he was only on the room 7 minutes, well I have no idea the circumstances, but there have been times I’ve only seen him a short period because it’s a follow up after getting lab work done etc.. He listens and responds but he does have other patients to see as well.\n\nThe office staff are always very friendly and every appointment that I’ve had has been great as far as wait times. Never over 10 minutes or so.\n\nI highly recommend this physician and his staff.", "pics": null, "resp": {"time": 1580165013370, "text": "Hello, Mr. Biles, and thank you for taking the time to let others know about your experiences with Dr. Jindal and our staff. We're glad to know that our team is meeting your expectations and will pass along your compliments to Dr. Jindal."}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "103546565758565830096", "name": "Jessica Styles", "time": 1572280608978, "rating": 1.0, "text": "My labs are messed up, my ultrasound shows Hashimotos Disease and I was told to lower my carbs and see a psychologist for therapy. I've been sick for FOUR YEARS. If you want a doctor who doesn't listen and suggests you have a psychological issue when you tell him your quality of life is poor, then this is the doctor for you. I was warned before seeing him and decided to give him a chance. Huge mistake. It only prolonged my suffering. Hard pass on this doctor for me.", "pics": null, "resp": {"time": 1572627025341, "text": "We're sorry to hear about this, Ms. Styles. Please call our Practice Administrator so we can work with you to address your concerns. The number is (256) 265-0780. Thank you."}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "101089892653688354833", "name": "Ken Graham", "time": 1543338905633, "rating": 1.0, "text": "I just had my first visit with Dr Jindal and I wanted to share my first impression. He comes in telling me that my medical history doesn't make any sense (all diagnosed by Vanderbilt) and spent most of the time doing all the talking. He spends, at most, 7 minutes in the room and then leaves. I am in shock at how little he asked about my medical history. I'll go back for the results of the lab work and I'll update this if the appointment goes completely different. As of now, he is the worst Dr I have seen in the last 10 years.", "pics": null, "resp": {"time": 1545164952259, "text": "Hello, Mr. Graham. Our practice administrator would be happy to speak with you about your concerns. Please call her at your earliest convenience. The number is (256) 265-0786. Thank you."}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "115992707989493727323", "name": "Shandora Moore", "time": 1547841682929, "rating": 5.0, "text": "Awesome doctor. For first time I felt comfortable about having an Endocrinologist.", "pics": null, "resp": {"time": 1548091716291, "text": "Thank you for the kind words and the great review, Ms. Moore. We're so glad that you've had a five-star experience!"}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "110533569448933972280", "name": "AK Colossus", "time": 1547045769926, "rating": 5.0, "text": "Dr Jindal was great when I saw him. I am borderline needing medication for hypothyroidism/ Hashi and he didn't force me to get a prescription. He gave suggestions for a lifestyle that would promote better thyroid health. Also I had my one year old in the office and the appt couldn't have gone better. I will say he is very concerned and on top of it for women who want to have children and have thyroid issues.", "pics": null, "resp": null, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "111325044508787676878", "name": "Shirley Hobbs", "time": 1597338442149, "rating": 4.0, "text": "Dr Reddy was Great", "pics": null, "resp": {"time": 1597856069568, "text": "Thank you for taking the time to leave a review, Ms. Hobbs! We will make sure Dr. Reddy knows how pleased you are with her care."}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "102346525844950518895", "name": "Daily in The Word", "time": 1508211020017, "rating": 5.0, "text": "Wonderful experience with Dr. Jindal and his staff.  First visit was today.  They were kind, courteous, and attentative to detail.  They asked all the right questions, were thorough and seemed to be interested in finding the best treatment plan possible.", "pics": null, "resp": {"time": 1508421690429, "text": "We appreciate your nice comments and feedback, Mr. Kitchens. It's a privilege to care for people in our community."}, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "112017314760631702903", "name": "lewis jolly", "time": 1567541626752, "rating": 1.0, "text": "Never go to Dr. Jindal. He left paperwork on his desk and did not send it in so my son's drivers license got suspended.", "pics": null, "resp": null, "gmap_id": "0x88626cac9e5152c3:0xf1b64e5bb099fcf5"}
{"user_id": "100188475556070003347", "name": "David Sweet", "time": 1625257916749, "rating": 1.0, "text": "These are some of the rudest people l have ever encountered. You cannot get anywhere with anyone in person, or on the phone. They like to hide behind the phone so they can continue to be rude and then put you on hold for so long in hopes that you will hang up.\n\nI understand there is construction going on, but why would you allow them to park their machinery or put their supplies in the handicap spots. Handicap parking is already limited, especially van accessible spots.", "pics": null, "resp": {"time": 1625674720666, "text": "Hi Mr. Sweet, we would like to discuss this matter further. Will you please call our office at 414-5900 and ask to speak with the operations manager so that we can help resolve any issues that may be. All the best, and we look forward to hearing from you soon."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "114122180049592975248", "name": "Abigail Laird", "time": 1628755521857, "rating": 1.0, "text": "I've had constant pain for years now and because I'm young the doctors feel \"uncomfortable\" trying more serious treatments even though I'm losing my whole life to this pain. For over 2 years I have had to wait 1 to 2 months for my doctors appointments and every appointment they tell me the same thing and go in circles with me, refusing to progress treatment. On top of that when they reply to reviews they copy and paste the same message over and over again. They are not listening to me and they won't listen to you. They don't care.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "100072144027300149007", "name": "V White", "time": 1623944197402, "rating": 1.0, "text": "At first doctor was nice the first few visits. Then the doctor started to act like he did want to be bothered. Came in leaned against the cabinet acting like I was a waste of his time. Yesterday stated he didn’t keep track of my health that I saw specialist for that let them keep track of my seizures and heart. He was only there for general things. But yet he is required by law and my insurance to keep track of who I see and my medical records. To which he demanded I find another doctor all because my disability lawyer asked if he could give his opinion on a form since he was to be talking with all doctors he referred me to. The billing and customer service department of the group believe that I got what I deserve and the doctor is correct. I am a person that has seizures and has AFib and has not been driving since a wreck to where this is the second general practitioner has refused to listen as a doctor should. And force me to find another doctor and the cost of losing everything because of they don’t care.", "pics": null, "resp": {"time": 1624291869282, "text": "We would like to discuss this matter further, so we encourage you to call our office at 414-5900 and ask to speak with the operations manager so that we can help resolve any issues that may be. All the best, and we look forward to hearing from you soon."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "110408389021647933884", "name": "The Sullivans", "time": 1616935158158, "rating": 5.0, "text": "The doctors are very thorough! The nurses, lab techs, and the entire staff are very professional, helpful, friendly.\nThe Follow my Health app that the doctor office use is very helpful to me. I can keep up with all of my lab results and be made aware of any changes in minutes.\nI would highly recommend A.M.G.", "pics": null, "resp": {"time": 1621282650025, "text": "Thank you for the kind words and the 5-star review. Our healthcare team takes great pride in creating an environment where patients receive quality, individualized and compassionate medical care. Thanks again for the feedback!"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "108259019381558190450", "name": "Miss Shauntay", "time": 1618478030563, "rating": 1.0, "text": "If you have a bill you can’t even make an appointment. They are going to constantly push that bill in your face. Not only that Dr. Carlos doesn’t care about his patients. More than once he’s come in seen me for 2 minutes and dumped me out. I didn’t feel that I had answers or anything. He just gets his money and doesn’t care. He doesn’t take your symptoms serious. Over a year ago I saw him about symptoms he told me I just needed to lose weight. Long story short I nearly died because of a appendicitis. He doesn’t investigate anything. He writes prescriptions and referrals wrong also. They will get your money for sure! But care is below average. Nurses are nice and fast though", "pics": null, "resp": {"time": 1621282602343, "text": "We would like to discuss this matter further, so we encourage you to call our office at 414-5900 so that we can help resolve any issues that may be. All the best, and we look forward to hearing from you soon."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "105839049446841841103", "name": "Trevor Bell", "time": 1598745913158, "rating": 1.0, "text": "I am appalled how my mother has been treated and even myself as I was trying to get some answers related to her overall well being. Dr Burch was not concerned about patient care and did not give me the time a day to discuss some concerns I had. After trying to speak with the Practice Administrator, I was given to HR.  If you go here, Do not except phones calls back timely nor compassion regarding your loved ones well being. They should really evaluate their “core values” and conduct some S E R V I C E training within their office and staff.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "106658978299455795244", "name": "Janelle Presnall Barbato", "time": 1597967399917, "rating": 5.0, "text": "Well you might have a little wait time but the doctors are outstanding! I love it! These doctors still come visit you in the hospital!", "pics": null, "resp": {"time": 1598281426049, "text": "Thank you for the kind words and the 5-star review, Janelle. Our healthcare team takes great pride in creating an environment where patients receive quality, individualized and compassionate medical care. Thanks again for the feedback!"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "113802026061945133288", "name": "Terri Gaal", "time": 1596136311687, "rating": 5.0, "text": "My family and myself have seen numerous Dr.'s in this group.  They are caring and help address your health issues.  The entire staff is friendly and helpful.", "pics": null, "resp": {"time": 1597683570940, "text": "Hi Terri, thank you for the kind words and the 5-star review. Our healthcare team takes great pride in creating an environment where patients receive quality, individualized and compassionate medical care. We're glad that we can serve and meet the healthcare needs for you and your family."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "114547424449841324436", "name": "RJ Clark", "time": 1594938400854, "rating": 1.0, "text": "This place is ridiculous. Every time I go I have to wait over an hour for an appointment at 2 that will last maybe 10 minutes. After seeing the doctor finally at around 4:45, I was sent to get lab tests and then an x-ray. Lucky for me after I was able to get my lab done it was 5:15. Which is when the x-ray closes. Waste of time", "pics": null, "resp": {"time": 1596136494822, "text": "We value our patients greatly and ask you and all of our patients to feel free to provide feedback about our services. We really would like to discuss this matter further so that we can help resolve any issues that may be. Would you mind speaking with our operations manager about your experience?"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "114049596922624930484", "name": "Butch Ladner", "time": 1592501351332, "rating": 3.0, "text": "I like all the doctors that I have seen over the years but I quit going there after I scheduled the 1st blood work appointment of the day. After about 15 minutes past my appointment while sitting in the waiting room, I called and knocked on the door... no response. I had to be at work so I left. Later I filled out forms to have my records sent to another facility but they were apparently never transferred.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "117411607479349393115", "name": "Deanna Davis", "time": 1597868154706, "rating": 5.0, "text": "I love the docs n staff and the fact that they are right at my hospital", "pics": null, "resp": {"time": 1606849123022, "text": "Thank you for the kind words and the 5-star review, Deanna. Our healthcare team takes great pride in creating an environment where patients receive quality, individualized and compassionate medical care. Thanks again for the feedback!"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "103597519588746451759", "name": "Kent Busby", "time": 1599001793278, "rating": 5.0, "text": "Fast and efficient!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMDuQ9I70L6wSoG2c4a3s9XRbW8YcHKdw-TiBlb=w150-h150-k-no-p"]}], "resp": {"time": 1606848995468, "text": "Thank you for the kind words and the 5-star review, Mr.Busby. Our healthcare team takes great pride in creating an environment where patients receive quality, individualized and compassionate medical care. Thanks again for the feedback!"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "108999883754558901602", "name": "Sarah S", "time": 1596091461530, "rating": 1.0, "text": "If you want to waste your time using this Dr's office then this is the place for you! I have NEVER in my life dealt with a medical office with such poor service. Whenever you call this office to leave very important information concerning your health, asking for a NURSE to call you, be prepared to wait days (thats even if you get a return phone call) The Dr seemed like a very concerned physician however his nurses like to treat patients like their the Doctor! I had one nurse who called me back after 4 days and she tried to tell me she knew exactly what the Doctor had ordered me to do with a certain medication and when i ask her how she knew, she tried to tell me she was in the room with the Dr. which I called her out on because she wasnt in the room with the dr and I. A lady by the name of Jordan was, this ladies name was Gloria! When I confronted her and told her NO MA'AM you were not in the room Jordan the dr and myself were the only 3 people in there that day, she put le on hold and later came back to the phone with a different attitude, but informed me that my Dr was out of town and guess what HE HAD NO FILL INS.. I have worked in the medical field and bo that Drs cant just leave their patients without ANYONE to help them with their medical needs!! Long story short I went without my medication from Thursday until the following Thursday! 7 FULL DAYS!! It was no big deal to this lady at all!! I have gladly found another physician and I honestly wouldn't take my animals to this office!! So again if you want to deal with getting the run around THIS IS YOUR PLACE, IF NOT DONT BOTHER EVEN MAKING AN APPOINTMENT!! I will be reporting this medical office!! Thanks for wasting my time Alabama Medical Group!! Maybe dr Rubenstein needs to stick with being the mayor and retire at being a physician!!!", "pics": null, "resp": {"time": 1596136407942, "text": "Hi Sarah,we value our patients greatly and ask you and all of our patients to feel free to provide feedback about our services. We really would like to discuss this matter further so that we can help resolve any issues that may be. Would you mind speaking with our operations manager about your experience?"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "109278907505601771623", "name": "Janet Newburn", "time": 1580262751417, "rating": 2.0, "text": "I don’t normally write online reviews, but this group is terrible.  The Doctor’s and staff are nice, but lack professionalism. I see Rubinstein at the Saraland location and Siegel at the Springhill location.\nThe wait times are off the charts. When you ask why you are waiting so long, they either just look at you or push you to another waiting area. My time is just as important as theirs. I was at the Saraland location today for over 2 hours. I saw Rubinstein for approx. 4 minutes. Routine checkup.\nThe staff has not the first clue about what’s going on medically with patients.  I have been called with incorrect information regarding my results, I have had to tell them what they were supposed to be doing per visit with Doctors.  I have been scheduled for a procedure that was ill prepared then I was forgotten.\nOffice Managers, are you reading these reviews?\nPatient care should come first and far most at all times.  The staff in these offices should be more concerned with this than what they are having for lunch.\nI walked out after seeing Rubinstein today after I was left sitting to have blood drawn. (I know how long it takes to draw blood)\nI’m sure they couldn’t care less! Sooner or later this junk is going to catch up with y’all.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "100877325519879114300", "name": "Howard Rhodes", "time": 1594666879937, "rating": 1.0, "text": "They wouldn't call in my blood pressure medication while I was out of town, And had much attitude about it !  So I had to find a new doctor.", "pics": null, "resp": {"time": 1596136522089, "text": "Hi Mr. Rhodes, value our patients greatly and ask you and all of our patients to feel free to provide feedback about our services. We really would like to discuss this matter further so that we can help resolve any issues that may be. Would you mind speaking with our operations manager about your experience?"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "103772813478267092741", "name": "Becky Kidd", "time": 1566764803412, "rating": 5.0, "text": "I am so very thankful to Dr. Jonathan Siegel and his wonderful staff. Each person was extremely helpful, professional, and caring to me, from the initial consultation with Dr. Siegel, to follow up after my procedure.", "pics": null, "resp": {"time": 1566930659186, "text": "Thank you for the kind words, Ms. Kidd. We're glad to have Dr. Siegel as a member of our team and are so glad you shared your feedback with us."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "115645794739993181607", "name": "SHANTA EDWARDS", "time": 1568308488496, "rating": 1.0, "text": "This is the worst group in the Bay Area PERIOD!! I was turned away because I couldn't pay $110 on a previous bill that didn't even belong to the Dr I was seeing! I made arrangements on this bill and have been paying monthly but this DR refused to see me still!! All the money that I've paid and my insurance have paid and this is how I'm treated!!! I'm not asking for special treatment, just trying to be treated!\n\nI am in severe pain and I am ashamed for this group that they would care more about money than they would helping care for their patient! What kind of medical practice does this!!!!! Only money hungry ones. I will NEVER come back to this establishment nor will I recommend them to anyone. I am going to share this story on social media as well, to let people see how these practices are letting patients suffer because of the almighty green dollar. It is not right nor is it fair. I could see if I had NEVER paid them anything, but to pay every month even with me not even working, makes this situation not only sad but despicable and down right disheartening.  Thanks so much Alabama Medical Group and your doctor's for always putting money first over patients!!!!!!!!!!!", "pics": null, "resp": {"time": 1568318194483, "text": "Hi Ms. Edwards, on behalf of Alabama Medical Group I apologize that you feel this way. I've spoken with the customer service rep who assisted you today and I have reviewed your file and there seems to be some inaccuracy's with your statement that I'm hoping we can clarify. If you will please call our office at 414-5900, our operations manager would like to discuss your visit in further detail. Thank you and we look forward to hearing from you soon."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "111948156850650712197", "name": "Kaitlyn Franklin", "time": 1566523939687, "rating": 1.0, "text": "These doctors are the most neglecting, ill mannered doctors I have ever come across and not to mention horrible communication and listening skills. And then they’ll continue to pass you around to many other doctors because they don’t have the means to help. My family and I decided to pull from this doctors office today. Never again.", "pics": null, "resp": {"time": 1566930495208, "text": "Hi Ms. Franklin, we value our patients greatly and ask you and all of our patients to feel free to provide feedback about our services. With that being said, you left no details about your experience that resulted with you leaving us with a 1-star review. We really would like to discuss this matter further, so I would like to encourage you to call our office at 414-5900 so that we can help resolve any issues that may be. All the best, and we look forward to hearing from you soon."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "102470176151313839239", "name": "Karen Bozant", "time": 1516898167158, "rating": 5.0, "text": "The doctors are great and the lab techs work quickly. I'm amazed that I don't have long waits like other places. They get to know you and not just push you through their office.", "pics": null, "resp": {"time": 1517335519319, "text": "Thank you for the feedback Ms. Bozant!"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "102065393161772879398", "name": "Deanna Davis", "time": 1557694251896, "rating": 5.0, "text": "The docs are wonderful caring kind people. The staff are precious. A blessing!", "pics": null, "resp": {"time": 1557752797132, "text": "Thank you for the 5-star review and the positive feedback. We are so pleased to hear such kind words about our staff."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "101834874133775682304", "name": "Cliff Wright, Sr.", "time": 1487116906874, "rating": 5.0, "text": "One stop shop for all things internal. Have seen many of the doctors for various conditions and treatments and all are knowledgeable and professional. My personal favorite is Dr. Don Sanders; you won't find a more caring and compassionate doctor anywhere, especially one that actually listens to (not just hears) his patients. Front desk staff does leave a lot to be desired as they are young and tend to be rude and impatient, but you're not there to see the 'staff' so just blow it off.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "108583936746234276700", "name": "Betty White", "time": 1527424613482, "rating": 5.0, "text": "Hands down the best group I have been with! I would definitely recommend this place as not only the best on the coast, but probably the best in the country!", "pics": null, "resp": {"time": 1531946217349, "text": "Thank you for the kind words, Mrs. White. Our healthcare team at Alabama Medical Group takes great pride in creating an environment where patients receive quality, individualized and compassionate medical care."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "100660206795587994091", "name": "Caitlin Brown", "time": 1565360593343, "rating": 1.0, "text": "The WORST doctors office I’ve ever dealt with. These people are ignorant and incompetent. Horrible horrible staff, do NOT recommend .", "pics": null, "resp": {"time": 1565629726845, "text": "Hi Ms. Brown, we value our patients greatly and ask you and all of our patients to feel free to provide feedback about our services. With that being said, you left no details about your experience that resulted with you leaving us with a 1-star review. We really would like to discuss this matter further, so I would like to encourage you to call our office at 414-5900 so that we can help resolve any issues that may be. All the best, and we look forward to hearing from you soon."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "104845393980734080516", "name": "Lacey McElderry", "time": 1462815853800, "rating": 5.0, "text": "This is a great doctor's office. The staff and the care that you will receive is top notch. I highly recommend the delicious dietitian program.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "112527433897831320353", "name": "Kacey Young", "time": 1559852828371, "rating": 1.0, "text": "Waited two hours for my mother to see a doctor for a scheduled appointment. Then the front desk was very rude. Never apologized for the two hour wait. They are overbooked. Shouldn’t have to wait all day for appointment.", "pics": null, "resp": {"time": 1560178187698, "text": "Hi Ms. Young, we're sorry to hear that your mother's appointment ran late, but unfortunately due to the nature of our business sometimes this happens. With that being said, we never want our patients to be unhappy and we apologize for the unpleasant experience. If you would like to discuss this matter further or if we can reschedule your mothers appointment, please call 414-5900 and ask to speak with our operations manager and she will get her scheduled."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "108876214357831787440", "name": "R.Allen Crowe", "time": 1550779389888, "rating": 1.0, "text": "So I just retired from the United States Navy after 28 years of service.  My family and I moved to Mobile, Alabama for our last move as we intend to live here for the rest of our lives.  Well as in any place you live there are many good things and there are not so good things that you experience.  We just came across a not so good thing and that is the Alabama Medical Group, P.C.  We were only with this PCM and the medical group for 3 or 4 months when we received in the mail a letter from them dismissing one of my family members.  The letter did not state any reason why only that they “need to do this from time to time.”  When asked why our family member was dismissed their representative would not provide a reason and on top of that they were rude during our phone conversation.  As a Navy Captain (retired) who has been to many places in this world along with my family who have been with me through all of that,  this has been the most disappointing experience of my career and was upsetting for my family members.  As a result of this,  my entire family has now changed PCMs.  I hope this feedback will help the management of Alabama Medical Group to self reflect and make some changes for the better. In the meantime,  I would not recommend this facility if you are a veteran as I assume they do not hold the veteran status as important.  That is strictly my impression.", "pics": null, "resp": {"time": 1551286970550, "text": "Capt. Crowe, I've looked into the situation involving your wife's experience at our practice and due to HIPAA compliance regulations there is very little I can comment about her visit and post publicly on the internet. It's unfortunate to hear that she had a negative experience, and I would like to encourage her to call our office at 414-5900 and ask to speak to the operations manager or the marketing director so we can discuss the allegations in your comments above. One comment that I can, and would like to address, is your statement saying that we do not support veterans. That simply is not true. In fact, several of our physicians currently serve in the military, along with members of our staff, as well as their spouses. We appreciate their service to our country along with yours and the other men and women who chose to make that sacrifice to protect and serve our great nation."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "105074773294626981722", "name": "Trevor Clifton", "time": 1521137650713, "rating": 5.0, "text": "I may be partial, but Alabama Medical Group is the best practice in Mobile! I will definitely continue to use my physician and the organization for any needs that they are able to assist with.", "pics": null, "resp": {"time": 1521138312641, "text": "Trevor, we don't think you are being partial at all. We appreciate your 5-star review and positive comments!"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "106422606782648998008", "name": "June Reddix-Stennis", "time": 1538776500624, "rating": 1.0, "text": "Just left the Alabama Medical Clinic Walk In Clinic, I was refused service first because it was 4:15pm but the Facebook page says the close at 5pm and the website says they close at 4:30pm, either way I got there at 4:15pm so she said they couldn’t see me because they cut off at 4:15! Then she asked if my primary doctor was in the group, my response was no but I have two specialist in the group, so she then informed me that they couldn’t see me because I didn’t have a primary doctor there. The website says nothing about having to already have a primary there! Either she was lying or the website is giving out bad information! I just drove all the way from west Mobile to go to the walk in clinic and couldn’t even walk in! Wow! I’m sooo disappointed, someone really needs to correct this problem, it’s so unprofessional and so was she! My visits with my specialists there have been great but the Walk in Clinic needs work!", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "104937206293796425931", "name": "Laurie Watson McKay", "time": 1496175842762, "rating": 5.0, "text": "My surgeon was Dr. Scott. He was fantastic and very down to earth. I would trust him to cut me open anytime! :-)", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "117914164218167977798", "name": "Jennifer Schuller", "time": 1492451124413, "rating": 5.0, "text": "Internal Medicine Center is made up of a group of kind, caring and compassionate physicians who are highly skilled and trained to take care of all of your healthcare needs.", "pics": null, "resp": {"time": 1560264058735, "text": "Thank you for the 5-star review and the positive feedback. We are so pleased to hear such kind words about our staff."}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "108754969109803500157", "name": "Robert Johnson", "time": 1470864349303, "rating": 4.0, "text": "i like Dr Carlos and think he's a good dr but I wish the waiting time wasn't always so long to see him.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "105907220982380648113", "name": "Frances Moore", "time": 1433257481641, "rating": 1.0, "text": "I found that the Doctors at the center are helpful but the staff are horrible.  They are not concerned with the patients health.  They are not helpful and when you are sick you want to be able to see the doctor.  I was told that I could go to their urgent care facility the next morning if I was having a problem.  Horrible staff I would not recommend this facility to a dog.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "109606875225452259763", "name": "Bo Lambert", "time": 1486094853163, "rating": 5.0, "text": "Best doctor...Dr Arnold....nice to know some one cares when you go in...and oh by the way..WDE..DOC!!!", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "108449377063460987318", "name": "Neal Hattenstein", "time": 1490366132515, "rating": 5.0, "text": "Dr Alan Shaine is my Doctor and he is a womdeeful doctor sits with you and exam .just great bed side mannnee", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "112636333242840920295", "name": "tammy beard", "time": 1467068304662, "rating": 1.0, "text": "The facility itself may be ok. Idk. But , in my opinion, Dr. Amy Strasburg is rude, vapid, unprofessional and would be better suited for a career behind a cosmetics counter. If you go there, ask for a different doctor. And be prepared for each and every visit to take two or three hours. Apparently, their system completely collapses on a regular basis.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "109773861361038995364", "name": "Rebekah Graham", "time": 1542482155457, "rating": 5.0, "text": "Everyone is friendly and Dr. Hayden Long is the best.", "pics": null, "resp": {"time": 1547573568593, "text": "Thanks Rebekah, we are so glad to have Dr. Long as a member of the AMG team!"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "100414115519850203702", "name": "Daniel Crocetti", "time": 1417005648420, "rating": 5.0, "text": "Great team of professionals, providing excellent care.", "pics": null, "resp": null, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "114181223864192186992", "name": "Mohamad Sahyouni", "time": 1555080582287, "rating": 1.0, "text": "Horrible.", "pics": null, "resp": {"time": 1560178315712, "text": "Hi Mr. Sahyouni, we're sorry to hear that you had an unpleasant experience at our practice and would like to discuss the details of your experience. Would you mind if our operations manager contacted you to discuss?"}, "gmap_id": "0x889a4d770ee5e43b:0xd962e54504235290"}
{"user_id": "106506008189482969051", "name": "Samuel Steele", "time": 1627353711923, "rating": 1.0, "text": "I had the worst experience with Dr. Habermacher, I had went to ER with a kidney stone and was told it measured 7mm, was told to follow up with Urologist from your clinic,I saw NP on day of appointment which was very nice,I ask for a scan to be done before so we would know if stone was still there. The morning of surgery, Dr. Habermacher came into room I ask if he was going to do scan to make sure stone was gone, he replied no, it will be gone today one way or another. I had passed very small pieces of stone but definitely not a 7mm in prior week.When I awoke from procedure I was told there was no stone, after getting home I was very sick from procedure and very sore. I went for my follow-up, I told the girl that checked me in that I was upset that he did not do KUB to make sure the stone was gone also, that I am a nurse and have had enough of kidney stone patients to know how to check for kidney stones and I definitely had not passed a 7mm. She said I will tell him, she immediately came back in room and said this is a nurse visit, he wants you to do 24 hr urine and come back in 2 months. I have no intentions of ever using him again, why would you not do a KUB or scan to make sure it's gone before putting someone through this, it sounds like it's all about money to me. WILL NEVER use this Dr again.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "107560826844517747305", "name": "Nathan Herrick", "time": 1611344210315, "rating": 1.0, "text": "Received a referral from my insurance company to this clinic to see a Gastroenterologist and I cannot even schedule an appointment. For the last two months, I have called the only available phone number to make an appointment only to be transferred to the gastroenterology clinic appointment line where I have left several messages with the scheduler because that person was not there. No return calls and the office is closed on Friday.", "pics": null, "resp": {"time": 1614290855284, "text": "Nathan, we would value the opportunity to connect with you further. Our patient care team can be reached at (334) 613-7070 at your convenience. If you would prefer to speak with our Patient Advocate, please call (334) 568-4866."}, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "118035772244836917308", "name": "Renae Pemberton", "time": 1604533118108, "rating": 1.0, "text": "I would not recommend anyone to Dr. Habermacher. My husband and I received some news that was scary and the doctor was not empathetic towards us. He does not like for his patients to do any scholarly research to help the patient or families to be knowledgeable on their diagnosis. He will get offended if you ask questions in which he feels a patient is second guessing his medical knowledge. He talked down to us and no doctor should ever talk to people in that way. Listen to your gut or in my case the Holy Spirit if something does not sit right with you about someone taking care of your loved one. I pray Dr. Habermacher is a Christian and if not that he will come to know the love of Jesus.", "pics": null, "resp": {"time": 1606179290463, "text": "Renae, we would value the opportunity to connect with you further. Our patient care team can be reached at (334) 613-7070 at your convenience."}, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "106276702774166680149", "name": "Abby McNeil", "time": 1601472617242, "rating": 5.0, "text": "I’ve been a patient of dr garg for a little over a year and she’s great . Yesterday I came in and I just wanted to call out one of the endocrinology nurses , Jennifer , and tell her how kind and wonderful I thought she was at her job. Jennifer went out of her way to make sure I was comfortable during a really long glucose test I had . Dr garg also takes a whole body approach to your treatment , and it is truly worth my drive from Dothan where all our endos are retiring/booked to come to this clinic .", "pics": null, "resp": {"time": 1601482922083, "text": "Abby, thank you for the kind review. It is our honor to provide excellence in care to the people of Alabama!"}, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "111188159416355907851", "name": "Jaime Denise", "time": 1608335886715, "rating": 3.0, "text": "They schedule way too many people at the same time, so the waiting time is HOURS.", "pics": null, "resp": {"time": 1614290484766, "text": "We understand your concerns and know that your time is valuable. Your feedback has been shared with our team and we thank you for your patience in this intricate season of care."}, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "113464080315346843401", "name": "Tony Boyer", "time": 1545582087126, "rating": 5.0, "text": "At times finding proper care that gives you the feeling your best interest has been top priority can be a challenge in the Montgomery area.  We typically go to Birmingham for peace of mind.  My first visit to UAB Urology clinic was one of the best experiences I've had anywhere.  Professional, engaging, reflective, and not reluctant to challenge the knowledge and awareness of their patients.  Dr. Habermacher understood my level of comprehension to quickly lend understanding to my concerns & how to handle my own personal health going forward.  Without being too long winded, I have to express gratitude for the opening and benefits of this clinic for Montgomery residents & anyone within reasonable distance.  Checks all the boxes both physically and psychologically to assure patients care is their top priority.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "109149654432663969534", "name": "Jeff chappell", "time": 1580739399408, "rating": 1.0, "text": "Apparently negative reviews get taken down quickly?  Dr. Thudi, an endo, has the worst communication skills.  Does not listen, assumes, and is too proud to admit mistakes.  They return calls, but only if you're waiting by the phone.  No voicemails except \"please call us back\" and you never get a live person, so it's voicemail tag over and over and over.  Add that to their \"never on Friday\" rules and you've got a setup for making money with zero customer service, much less patient service.\nAnd DON'T even think of adding a response to this about \"We'd like to talk with you about your experience\".  We spoke, we emailed, and THIS IS my response to your customer care.  Don't act like this is the first you have heard of the problem.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "110810778778295902588", "name": "Evelyn Young", "time": 1529426965919, "rating": 2.0, "text": "I have had zero problems until today. You have one number for the entire clinic. They have several specialists. So it is hard to reach the person you need. I called asking for a specific person and extension. I was asked the person last name .They did not leave a last name. I gave the extension#. I was asked what is the nature of the call. I still did not get the person that left the message. Guess if it's important they will call me back..", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "111193115751902347353", "name": "Tamra Oswalt", "time": 1570210263130, "rating": 1.0, "text": "I'm very disappointed I have been to four doctors in the past month about my foot and my toe I am in excruciating pain mobic is helping and your office closed at noon today because it's Friday well I don't consider an emergency other than I'm excruciating pain and can't walk. So what am I supposed to do?\n\nVery disappointed how the doctor he's never seen me going to know what to do for me", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "114165500896750655586", "name": "Scott Thompson", "time": 1538578909414, "rating": 2.0, "text": "Originally given 1-star: Waited for 6 weeks for an appointment just to have a consult. The Friday before the Monday afternoon appointment I get a call saying Doctor Hablemacker would be out of the office and they had rescheduled me for two weeks later in the morning instead of the original afternoon. They required me to call and confirm to keep the new appointment. No further explanation. No options given for the inconvenience. Attempted to call at 2:30 pm when I got the message, but the office was already closed. Apparently they also don’t work on Friday afternoons...\n\nUPDATE TO POST (10/18): Upgraded to 2-star.The office was able to accomidate a different appointment time since I was going to be out of the country during their first rescheduled time. Initially, they didn't have availability, but were willing to squeeze me in for the short consult given the previous circumstances. I will reconsider again after the appointment/service.", "pics": null, "resp": {"time": 1536593512763, "text": "Mr. Thompson,\nWe are very sorry we did not meet your expectations.  Please do call our office today between 8 AM and 5 PM to find a more convenient time for your appointment."}, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "105513552415487179721", "name": "Grover Wedgeworth", "time": 1555512481353, "rating": 1.0, "text": "Service sucks, no follow up on lab between visits, .Failed to provide consultation notes and labwork to my wife's primary doc.  Dtaff are curt cna rude", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "100199861040353856532", "name": "DeAndre Scott", "time": 1542033819723, "rating": 5.0, "text": "I have been coming to the UAB Specialty clinic to see Rheumatology. Dr. Gadea and his staff are some of the best medical professionals I have ever come across. Having worked in the medical field for 16 years (21year USAF Vet), I have worked with countless professionals. I can only highly recommend Dr Gadea and his team as their patient care exceeds the standard every visit!", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "109337083997686348338", "name": "Wendy Adams", "time": 1545164083529, "rating": 1.0, "text": "This is a poor excuse for a gastroenterology center. My husband is having issues with abdominal pain and other stomach issues and we were told by Dr. Kahn that if my husband continued to have issues that he should go back to the ER and let them call him and see if he could get in for an emergency colonoscopy. Well he went back to the ER and they ran all kinds of test and just because his blood work came back fine, the ER staff and Dr. Kahn refused to admit him and said that he would have to wait until Feb to have a colonoscopy scheduled.  So the doctor lied to both of us. Needless to say my husband is still in very bad pain. So nothing bad better happen to my husband because of their negligence.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "109629967256740502457", "name": "Andrea Curtis", "time": 1536710565402, "rating": 5.0, "text": "The doctors here are excellent.  I especially like Dr. Nina Jo Hibbard, Endocrinologist,  and Dr. Carlos Gadea, Rheumatologist.  They are knowledgable, patient, and very concerned about the pateient's well-being.    I wouldn't trust my healthcare needs to be handleded anywhere else.   😀", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "105124454187813409107", "name": "Jennifer van Arcken", "time": 1504830525964, "rating": 5.0, "text": "My husband had surgery by Dr. Habermacher and we are very pleased that UAB opened this state of the art clinic in Montgomery and brought such great healthcare professionals to our area. The surgery was a success and the follow up visits at the clinic were accomplished very professionally.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "114492014717223503219", "name": "Bill Flick", "time": 1514917554556, "rating": 5.0, "text": "I have seen Dr. Pazona in Urology and found him to be very competent, professional and pleasant.  The staff were also very efficient and pleasant.", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "115584060232493438080", "name": "Tamara Dozier", "time": 1568788922908, "rating": 2.0, "text": "Dr. Mullins was wonderI!!\nI need a new Rheumatologist ...", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "118096554832493583892", "name": "EDDIE SMITH", "time": 1536835072856, "rating": 5.0, "text": "Great doctor took good care of my mother", "pics": null, "resp": null, "gmap_id": "0x888e803f6c3e914f:0xfc53cce348fb4eb7"}
{"user_id": "104918386818312614350", "name": "David Bush", "time": 1620167127460, "rating": 5.0, "text": "This is the most comfortable I have ever felt in a doctor's office. NP Ashley is amazing at truly listening to her patients. She has that gift of being sincere  about your concerns. The rest of the staff are also equally amazing. I highly recommend  this office", "pics": null, "resp": {"time": 1621285733122, "text": "Hi David,\n\nThank you for the feedback. I will be sure to share with Ashley and staff!"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "108574896933598567814", "name": "Lesli Riley", "time": 1624792500074, "rating": 1.0, "text": "My father had a colonoscopy with Dr. Garrett and developed enterococcus faecium. An infection from unsterilized colonoscopy equipment. He died from this", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "102290688366500562960", "name": "Wendy Coleman", "time": 1612579512321, "rating": 5.0, "text": "I can't say that I have a single complaint.  Maybe,  the colonoscopy prep but that is nothing they can help.  Dr. Anderson is top of the line, hands down.  Jackie Shumate, the nurse practitioner, provides a comprehensive review and you are never rushed through an appointment.  She covers all issues with ideas, suggestions and solutions.  You definitely feel important and as if your health matters to them personally.  I highly recommend this office to anyone looking for a great practice.   They also practice social distancing.", "pics": null, "resp": {"time": 1614876817434, "text": "Ms. Coleman,\nThank you for taking the time to leave a review. Your feedback is important to us. I will be sure to share your comments with the team!"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "115385931187461596563", "name": "Shalaya89", "time": 1621278293469, "rating": 4.0, "text": "Hello!\nI can not get anyone to answer the phone or return my call from the voice message I have left several times. It always says you are assisting other patients l, but no one answers at all. Please help.", "pics": null, "resp": {"time": 1621285695689, "text": "Shalaya,\n\nI apologize that we were unable to answer your call today. Our office will return all messages with contact information provided by end of day. If you have not received a call back at this point please give me a call for assistance, I can help. Our office is open from 8am-4pm. 495.2600 ext 1000"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "108110824024872007234", "name": "Yulya Plaia", "time": 1600184208605, "rating": 1.0, "text": "Really dissapointed. I have made an appointments with them 2 times and both had to be canceled the last min on their end. I had to have a breath test done and I drove 40 min only to get there and have them tell me that they can't do the test there. I called and confirmed that I still had the appointment with them a week prior to that. The nurse could have called me or emailed me and tell that. But unfortunately I drove all they way to Montgomery and didnt get anything out of it. I understand that its hard with this corona and stuff but they could have thought about their patients.", "pics": null, "resp": {"time": 1600188783052, "text": "Yulya,\n\nThanks for taking the time to express your experience with our office. While we strive to meet the needs of every patient it’s clear we missed the mark here. I would like to discuss this with you in detail if time allows. 334.239.9257\n\nThanks ,\nC. Butler, Practice Administrator"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "107155080747085253882", "name": "Ove", "time": 1598472233899, "rating": 2.0, "text": "Terrible service. I understand the pandemic, but sitting in your car is ridiculous!! It took forever to get an appointment, only to be called and told the nurse was no longer seeing patients in the afternoon!! I was told to go to the East Trailer, yes a trailer, for a  colonoscopy and an egd! I've yet to see a physician to discuss my problem. Now I'm sitting in the car, had an 8:30 appointment, it is now 8:45. If I could get a referral for another Gastroenterologist, I'd be gone. Only problem, I'd have to start all over. Unless you can deal with pain, go somewhere else because I have been dealing with this issue for three months only to be told everything looks good, then why are my labs abnormal?", "pics": null, "resp": {"time": 1598534297822, "text": "Thank you for your feedback.\n\nThe hospital has purchased trailers to help with UABs social distancing policy’s. These are uncharted waters and while we strive to make everyone comfortable during the pandemic, we understand improvements may be necessary. I would like to discuss your concerns further, when time permits.\n\nPlease give me a call 334.495.2600\nThanks,\nMrs. C. Butler"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "104415627891390382991", "name": "Jon Pridgen", "time": 1578785192218, "rating": 5.0, "text": "I've been a patient of Dr. White's for over 15 years and have always been pleased with his care. I recently had a procedure with Dr. Garrett and she is equally compassionate and thorough as Dr. White. Both Jackie and Ashley have been exemplary as well. My parents also use Capital City Gastroenterology and have always received excellent care.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "103177074996337408796", "name": "Rebecca Thomas", "time": 1572991417105, "rating": 5.0, "text": "Great experience. The nurse practitioner was thorough and listened carefully. She did not waste time, but was professional and friendly. She set up good diagnostic tests and offered a variety of samples of medications to try for my health issues.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "111581267487057767417", "name": "Sandra Gibson", "time": 1564600328887, "rating": 5.0, "text": "Dr. White is awesome.  He is so considerate of my feelings.\nNurse Practitioner Ashley does a great job and is so thorough and personable.\n\nCaitlin is the greatest.  She needs extra pay for being my Psychiatrist\n\nOffice staff is very friendly", "pics": null, "resp": {"time": 1564660629111, "text": "Ms. Gibson,\n\nThank you for taking the time to leave a review. Your feedback is important to us. I will be sure to share your comments with the team!"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "110791280145560601434", "name": "Jeremy Alphord", "time": 1594670866245, "rating": 1.0, "text": "In November of 2019 I was overcharged $300 but have been unable to get my refund. If this were a past due bill I would have been sent to collections but they can just say it was a billing error and not return the money. Very disappointed with the service at this practice.", "pics": null, "resp": {"time": 1594675120746, "text": "Jeremy,\n\nI’m sorry to hear that you’ve had an issue with our billing dept. However Im available to discuss your concerns. If there is an overpayment a refund will be processed. Please contact me when time allows 334.495.2600 ext 1000.\n\nThanks,\nPractice Admin"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "111230769608364079505", "name": "Alex Trott", "time": 1597249786284, "rating": 5.0, "text": "Phenomenal, caring employees. Went above and beyond to make me comfortable, educate me, and make everything as easy as possible.", "pics": null, "resp": {"time": 1598534388416, "text": "Thank you for your feedback! I will be sure share."}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "107344764878884930291", "name": "sandra joiner", "time": 1568938403712, "rating": 5.0, "text": "I highly recommend Jackie the nurse practitioner. She was so thorough, kind and helpful. She took so much time to help my husband with his health problems. I am very thankful for all that she did for us. All the staff was very courteous and helpful.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "116256042973858312509", "name": "Ann Herman", "time": 1613572971716, "rating": 5.0, "text": "Have always had a pleasant visit", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "114073686865546915057", "name": "Kimberly Starke", "time": 1581687400925, "rating": 5.0, "text": "The staff is friendly and comforting.  I usually see Dr. Morrow and she's very easy to talk to for any questions.  I love seeing scripture in the rooms.  I've been using this office since 2017, when I switched from a Jackson Hospital gastroenterologist.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "114129096895040573756", "name": "Judy Mills", "time": 1583986166681, "rating": 5.0, "text": "I have been using Dr Penn White for a very long time. He has taken care of my medical needs and he explains what has to be done if anything is wrong. His staff is always nice. Theyi schedule appointments for other Dr's that he recommends that I go. I have seen Ashley several times and she has always been concerned with whatever is bothering me at the time. She wants to resolve the problem. I have always been pleased with Dr White and his staff.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "107529693555877396905", "name": "Janice Jackson", "time": 1576185311738, "rating": 5.0, "text": "Jackie Shumate is the greatest Nurse Practitioner! She's smart and she listens, then she prescribes what you need. I enjoy my visits with her. I'm glad she's Dr. Garrett's assistant.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "108341931428737357333", "name": "Frank Rivers", "time": 1592427139223, "rating": 5.0, "text": "Ashley Marrow,NP. is seeing Dr. Penn  White patients apparently, but the procedures are at Babtist East Hospital, by Dr.White......\nVery professional and very busy...\nThey work as a team, that's why I give them the 5 stars.\nThe office staff are top notch......", "pics": null, "resp": {"time": 1598534424007, "text": "Thank you for your feedback! I will share with the group."}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "118402246185868902970", "name": "Brenda Pennington", "time": 1578441439142, "rating": 5.0, "text": "NP Ashley Morrow was very thorough with me.  She was very polite and took the time to list to me.  I was very happy with my visit.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "114738683547289436087", "name": "vanessa jones", "time": 1582143223845, "rating": 5.0, "text": "Ashley Morris was wonderful. She took her time explaining things to me. She was very concerned and patient. The staff was very friendly.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "106982969032394223749", "name": "L T", "time": 1553548386190, "rating": 1.0, "text": "I thought I was finally in good hands here. Until I had a test done and I’ve tried calling the office for almost TWO weeks. Not one person has called back with my results or to let me know if my results are in. I even left a message with the office manager and they didn’t call me back. This is the most unprofessional doctors office I’ve ever been to & I finally thought I would get some answers as to what’s going on with my health. The nurse practitioner Amy (forgot her last name) was super sweet and spent time with me listening to me, but whoever answers the phone needs a one on one. Don’t go here if you’re looking for answers. Now I’m going to have to start all over.", "pics": null, "resp": {"time": 1554138485209, "text": "LT,\nMy Name is Mrs. Butler and I am the Practice Administrator. I'm sorry to hear about your experience with our office. We're normally more timely, and I regret that we missed the mark. I would like to discuss this further, please contact me at 334.239.9257."}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "115415076961446903169", "name": "Debra Ashlock", "time": 1582750174486, "rating": 4.0, "text": "I think the service is great, but the office rescheduled my appointment without calling me . As a heathcare worker, (I am a nurse) I understand the need to reschedule, but I have a job also, and would have appreciated a call to make the appointment when I could be off.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "113294538339189464133", "name": "The Gary’s", "time": 1566615453090, "rating": 5.0, "text": "I had a great visit. It was my first time and Jackie made me feel at ease. She was knowledgeable and friendly.", "pics": null, "resp": {"time": 1568060483014, "text": "Thank you for your feedback!"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "102916796466317486453", "name": "Beautiful Stranger 125", "time": 1576647731747, "rating": 5.0, "text": "I had the pleasure of being treated by CRNP Jackie Shumate. She was very kind and informative. She answered all my questions and explained everything very thoroughly. The ladies up front and at checkout are so friendly and efficient.\nI am so glad I was referred here.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "106462105444941085073", "name": "Anita Rice", "time": 1570825426073, "rating": 5.0, "text": "Dr Garrett has been with me through all my issues. In my opinion she's the best and I plan on her being my Gastrointestinal Doctor for as long as she will put up with me. She's traveled rough roads, ups and downs, she's a blessing", "pics": null, "resp": {"time": 1571931124838, "text": "Ms. Rice,\n\nThank you for your feedback. I will be sure to share your review with Dr. Garrett.\n\nYour feedback is appreciated!"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "114053300033888412576", "name": "Harold Schley", "time": 1581469976048, "rating": 5.0, "text": "The Nurse Practitioner Ashley Morrow did a great job explaining my medical situation in a term that I could understand , thanks", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "108395517191854857714", "name": "Lula Clemons", "time": 1582665373825, "rating": 5.0, "text": "Dr. Ashley is awesome she really listens an share her concerns is very professional. You are in an out in no time BLESSINGS TO DR. ASHLEY", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "108146944456628612282", "name": "Heather Terrell", "time": 1564081577605, "rating": 5.0, "text": "NP Ashley Morrow is amazing. She didn't stop until she figured out what was going on with me. Everyone in the office is pleasant to speak with as well.", "pics": null, "resp": {"time": 1564523262868, "text": "Ms. Terrell,\n\nThank you for taking the time to leave a review. Your feedback is important to us."}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "114425878654800969871", "name": "Alice Grayson", "time": 1573087291274, "rating": 5.0, "text": "The staff is phenomenal! I had a 3:00 appointment and was with the doctor on time. I have never been in a more organized and time conscous office. Thank y'all!", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "102984542641239390585", "name": "Donna Prashad", "time": 1582747976496, "rating": 5.0, "text": "Nurse practitioner Ashley is great. Makes you feel like you matter and she cares.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "109307148333935075612", "name": "Michael Hardy", "time": 1568211743237, "rating": 5.0, "text": "Dr Garrett was professional and thorough. I had seen her in the past and had the opportunity to see another gastroenterologist. I chose to wait longer to see Dr Garrett.  Capital City Gastroenterology is the best. 5 🌟.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "104564425414345076456", "name": "Tammy Storms", "time": 1582230204575, "rating": 5.0, "text": "Dr. Echols is a God sent. In November of 2017 she discovered two tumors and that I had colorectal cancer. She then sent me to an amazing surgeon in Birmingham named Dr. Blaine Bishop & he robotically removed them and I've done chemo and I was healed of that but then something else came about and I'm doing chemo again and I know again that I will be healed because my God is awesome!!! Back to the question... Dr. Echols staff and nurses are amazing and I don't know how they do it but they make you feel comfortable and believe me in the area of the body that they desl with that's pretty hard to do.😳", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "102968498440226732513", "name": "Norma Edwards", "time": 1583439656413, "rating": 5.0, "text": "They are awesome and very caring I love ❤️ them all NP Ashley especially", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "108045809738138832918", "name": "Shirley Jones", "time": 1578673444514, "rating": 5.0, "text": "Very personable but professional. Always seen in a timely manner.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "105761224844700742889", "name": "Suzy Alabama", "time": 1582838717182, "rating": 5.0, "text": "I saw the Physicians Assistant who was knowledgeable, patient, and kind.  5 stars", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "111242231592357551588", "name": "Vickie Yates Britt", "time": 1579816815382, "rating": 5.0, "text": "All Staff very knowledgeable and helpful. PA listens and discusses situation.  Thankful to be referred to this group.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "108470089900554390574", "name": "fran mathis", "time": 1571789953299, "rating": 5.0, "text": "I have used Capitol city Gastrointestinal for years and love them they are so professional and kind", "pics": null, "resp": {"time": 1571931067148, "text": "Ms. Mathis,\n\nThank you for your kind words and feedback regarding your ongoing experience.\n\nIt's appreciated!"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "105848234957017260690", "name": "Ron Stanton", "time": 1578600768743, "rating": 5.0, "text": "My second visit to the office was just as impressive as the first visit. The staff was very professional and treated me like a relative, not a faceless customer.", "pics": null, "resp": {"time": 1571931157382, "text": "Mr. Stanton,\n\nThank you for your feedback. Its appreciated!"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "111813518574737538701", "name": "Brenda Key", "time": 1576874140192, "rating": 5.0, "text": "The staff at CCG is very professional, friendly, knowledgeable and helpful.  Jackie was my nurse yesterday and she enlightened me on the name of what my condition was actually called.  If I had heard Esophagitis before yesterday, I didn’t recall it.  I was also concerned about the possibility of having a hiatal hernia and she relieved my worries about that as well by telling me that they saw no signs of that when they did the EGD.  So, I left feeling much better about my condition yesterday and have hopes of getting it “fixed” eventually through medication and their care.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "113025795955300296968", "name": "Janyth Grimes", "time": 1574194384548, "rating": 5.0, "text": "I have always been shown grace and dignity in what some including myself would consider a very uncomfortable office! I am very grateful for CRNP Ashley and Dr. Nelson-Garett! Even the front office staff is amazing! Thank you Capital City Gastro!", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "114802709301595037497", "name": "A P", "time": 1598432706144, "rating": 1.0, "text": "Who cares what the practitioners are like if the front office staff lacks compassion, is blatantly rude, and unwilling to help with scheduling?", "pics": null, "resp": {"time": 1598453852936, "text": "Amanda,\nThank you for sharing your experience. I would like to discuss your feedback when time permits. It is my hope that we will be able to  learn from this experience and address your concerns. Phone: 334.495.2600 ext 1000\n\nMrs. Butler"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "112560590275116012294", "name": "John Midkiff", "time": 1572612373435, "rating": 5.0, "text": "Dr. Echols and her staff are the absolute best !! I was having some medical issues and needed help ASAP, Dr Echols went above and beyond to get me in for a appointment and had me at the Endoscopy Center within a 24 hour period. Dr. Echols immediately diagnosed my situation and began treatment which lead to almost instant relief. She is very thorough and explains your situation where you can understand what is going on and how it will be treated. Highly Recommend Dr. Heather Echols for your Gastro problems !!!", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "108062279936508508623", "name": "Sandra Sevcech", "time": 1582058186260, "rating": 5.0, "text": "Great physician's, Great staff. Highly recommend this place!!!", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "103319104548775669780", "name": "Susan “SuSu” Driver", "time": 1565799744915, "rating": 5.0, "text": "Dr. Penn White and Practitioner, Ashley are knowledgable, caring and address all concerns-\nexcellent experience and group . Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "114843277134914602449", "name": "Philip Howland", "time": 1619356117263, "rating": 5.0, "text": "they are the best  dr garrett and ashley are are very professonal and caring", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "117322722997817707010", "name": "Lamar M", "time": 1537979202430, "rating": 5.0, "text": "I had a great experience with this practice! Staff was friendly and helpful. My mom was treated with care and dignity from beginning to end.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "100842011352448030788", "name": "Hubert Staley", "time": 1564618378858, "rating": 5.0, "text": "Every staff member at CCG has been nothing but the best each time I have contacted the facility (either by telephone or office visit).  My latest appointment with Nurse Practitioner Ashley Morrow verifies my wholehearted satisfaction with CCG.  She was very patient, pleasant, and caring in responding to every question and/or concern I expressed.  I would not hesitate to recommend CCG to anyone, because the medical staff (Dr. Anderson and Ms. Morrow) have my complete confidence and respect, and all members of the office staff have always proven most helpful and friendly.", "pics": null, "resp": {"time": 1564660698169, "text": "Mr. Staley\n\nThank you for taking the time to leave a review. Your feedback is important to us. I will share your comments with the team!"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "104829701258674252955", "name": "Bo Jinright", "time": 1518096106455, "rating": 2.0, "text": "They never answer the phone. They seem more interested in claims than care. It's taken months to get test results. Weeks to get callbacks. I'm still waiting 3 more months 6 total for an initial visit.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "101959987507111431669", "name": "Joyce Wiles", "time": 1568142905813, "rating": 5.0, "text": "I recently had to have an EGD because of a persistent cough and some difficulty swallowing pills. I had a consultation with CRNP, Jackie Shumate before the test and a couple of follow up visits with her to make sure the meds she prescribed were working for me. She is very knowledgeable and knew just what questions to ask me about my symptoms, but she is also very kind and concerned about my health issue. All the staff have been kind and friendly, as well. I would recommend CCG to anyone and would not hesitate to use them again.", "pics": null, "resp": {"time": 1569361415642, "text": "Ms. Wiles,\n\nThank you for your open and honest feedback. I will be sure to share with the team here at CCG!"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "100939570607285973924", "name": "ed mcadory", "time": 1573763617373, "rating": 5.0, "text": "Staff, very good. N.p. Ashley is excellent", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "109369965041051820261", "name": "Jesse Baldwin", "time": 1564773626056, "rating": 5.0, "text": "Everybody was nice and friendly , I was treated well and was concerned about my health.", "pics": null, "resp": {"time": 1565212244509, "text": "Mr. Baldwin,\n\nThank you for taking the time to review your experience. Your feedback is important to us!"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "109079628025399990084", "name": "Carleen Viers", "time": 1566759766599, "rating": 5.0, "text": "The staff and doctors are all very professional and caring.", "pics": null, "resp": {"time": 1568060436449, "text": "Ms. Viers,\n\nThank you for your feedback!"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "110354973951408520287", "name": "HemiLifee Pnfdee", "time": 1589828418092, "rating": 1.0, "text": "I’ve Been Calling For A Month Now Trying To Get In Contact With Someone To Set An Appointment Ive Been In Pain And Need Some Assist And No One Answers But Y’all Are Opened !!!!!", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "103816963460366198650", "name": "Reggie Quimby", "time": 1565209519380, "rating": 5.0, "text": "Staff was very considerate and efficient with my needs and time.", "pics": null, "resp": {"time": 1565211854366, "text": "Mr. Quimby,\n\nThank you for your feedback, its appreciated. I will be sure to share with the team!"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "116193245801191227884", "name": "Johnice Danner", "time": 1568753697197, "rating": 5.0, "text": "Great all around! Staff and Especially greatful for Dr. Nelson Garret.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "117119394513229437378", "name": "Richard Pitts", "time": 1566417841382, "rating": 5.0, "text": "Dr Anderson is excellent.  He takes time to talk to me about my health.", "pics": null, "resp": {"time": 1568060508975, "text": "Mr. Pitts,\n\nThank you for your feedback!"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "114676373312966884585", "name": "Jill Philips", "time": 1572466890529, "rating": 5.0, "text": "Interested, concerned, always learning as well as caring.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "114358184294405944148", "name": "Felicia N.", "time": 1445715518800, "rating": 1.0, "text": "Dr. Anderson,\nTreated my grandmother. She had surgery and died.\nHe told me I had a hernia. Went in to surgery for repair and he cut through my bladder. He had to call in a specialist to take care of it. I had permanent staples in my bladder.\n\nHe is not a good doctor when it comes to diagnosis and surgeries.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "111732975694894911889", "name": "Sherilyn Morgan", "time": 1582143193202, "rating": 5.0, "text": "Ashley, CNP, was very thorough, knowledgeable, actually listened, and was understanding", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "109642266753940860318", "name": "Robin Cutter", "time": 1579032975358, "rating": 3.0, "text": "The staff and doctors are very professional and concern about their patients health", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "113680241266183023471", "name": "leona parker", "time": 1466615517494, "rating": 3.0, "text": "Patient reviews kept me safe. I will not make an appointment.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "100974332690757699402", "name": "Jenny Clark", "time": 1477297695292, "rating": 2.0, "text": "Oh boy!  I had a very awful experience with one of the female doctors at this practice.  Personally, if you are considering this place, I would just run like H3LL.  I had symptoms of acid reflux and had an ENT confirm what I thought it was.  I asked to get an endo done just to ensure my throat did not have Barrett's.  They referred me for the procedure and one of the female doctor's performed the endo.  Prior to this I had never met this doctor.  I explained my acid reflux and she said it could be my gallbladder since I had a child 1.5 years prior.  She recommended an ultrasound and hyda scan.  I went in for both and it was found that I did have a gallstone.  The hyda scan was normal.  The gastro doc immediately referred me to a surgeon to have my gallbladder removed.  I was blown away!  I had never had any typical gallbladder attacks or pain.  After doing more research I found out that having your gallbladder removed can actually cause bile reflux due to the constant free flow of bile into your system once the gallbladder is removed and the bile has no where else to go.  This doctor could not even read details of my ultra sound so I had to rely on some random doctor (over the phone) to tell me that yes, I have a rather large stone.  This female gastro doc never made any follow up appointment with me.  I immediately canceled the surgery.  I have since discussed this decision with other doctors (ENT and family doctor) and they agree with my decision.  My one gallstone while big is not currently causing typical symptoms.  There is absolutely no guarantee that removal of my gallbladder will fix the acid reflux.  And, recently, my acid reflux has been manageable with a proper clean (and green) diet. Folks, after doing much research, I am convinced that probably millions of Americans have gallstones.  Why?  Diet, it's that simple.  Our diet is just too high in fat, salt, and sugar amongst other things.  A lot of people have gallstones without even knowing UNLESS they have a gallbladder attack that lands them in the ER (or in my case was found just by chance).  In my opinion, gallbladder pain and recurrent attacks are reasons to remove the gallbladder.  Yes, you can live without your gallbladder but you can also live without your arm.  Your body functions better with both so unless you are having issues, think really hard about whether it's worth losing an organ.  In very rare cases, gallbladder disease in the form of stones can lead to major illnesses like cancer.  However, IF you drastically improve your diet, I do believe you can control your destiny.  Remember, everything begins in the gut!  Obviously, I am not a medical doctor, so these opinions are my own.  My last words of advice: get 2 or 3 opinions and remember that doctors are in the business to make money.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "105540362225171929045", "name": "tfrank thetank", "time": 1423292132305, "rating": 1.0, "text": "Will NEVER go back to \"Dr.\" Anderson. I hardly had an entire 2 minutes to explain to him what was going on before I was all of a sudden waking up in the recovery room. No courtesy to say \"hey, were starting the anesthesia.\" He was interested in the colonoscopy and getting it over and never asked me the first important question. And the symptoms I tried to tell him with details, kept getting muffled out by him talking to other medical personnel in the room. No chance to let him know that I was interested in having an endoscopy as well because my symptoms don't even pertain to my large intestine and possibly not even the end of my small intestine. So now my symptoms are still present and have no follow up appointment with him. Instead, they tell my wife to make me an appointment with a refered family doctor an entire month away. Not to mention my colonoscopy appointment took almost 2 months until they could do it.  Wouldn't have wasted my 500.00 that my insurance wouldn't cover, if I would have known that it wouldn't help me get my foot in the door to the gastro office. So here I am at square one.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "104214811621985404472", "name": "Pamela Morris", "time": 1576026221692, "rating": 5.0, "text": "Everyone was polite.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "112196467884702042438", "name": "Larry Martin", "time": 1582142862671, "rating": 5.0, "text": "Very efficient and cordial.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "104946275623227909296", "name": "James Rogers", "time": 1466170145724, "rating": 1.0, "text": "How does one get these people on the phone to make an appointment? If there are no services up front, what kind of services can I expect the services to be upon arrival?", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "108986565010601327447", "name": "Zenobia Blackmon", "time": 1581711916385, "rating": 5.0, "text": "Routine follow up visit that went well.", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "112444249737054399194", "name": "Barbara Bryant", "time": 1580505630820, "rating": 5.0, "text": "Ashley was awesome!", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "113782529243657491170", "name": "Suzanne Burns", "time": 1551137804886, "rating": 5.0, "text": "Jackie  has the patients  of an angel.", "pics": null, "resp": {"time": 1554138655647, "text": "Ms. Burns,\n\nThank you for taking the time to leave a review, and mentioning Jackie. You're right, she's always willing to listen and help!"}, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "114390054358064623798", "name": "Frank Rivers", "time": 1569357236647, "rating": 3.0, "text": "Have a appointment, and still wait.....\n......\n.....\n.....\n\n.....", "pics": null, "resp": null, "gmap_id": "0x888c2a680bf0c7d7:0x1d6cad2459ca0d12"}
{"user_id": "109903370887922201950", "name": "Houston Huggins II", "time": 1602008970403, "rating": 1.0, "text": "New to the area. This is, without question- the WORST patient care experience I have ever had! The doctor is completely detached from the patient care process. She is a condescending narcissistic clock watcher. There was no information about my supplies prescription given to me. I am ashamed to say that I waited 6 weeks to reach out to the sleep center to find out where my supplies were-but then I was told who the supplier was and that I had to make contact with them and go get the supplies. DON'T MAKE THE SAME MISTAKE I MADE....DON'T WASTE YOUR VALUABLE TIME.....DON'T GO HERE!", "pics": null, "resp": {"time": 1611249443120, "text": "Hello, Mr. Huggins. We're so sorry to hear that you had a negative experience with one of our physicians. Please consider calling the Patient Advocate so we can learn more about your concerns and work to address them. The advocate can be reached at (256) 265-9449."}, "gmap_id": "0x886266229824aec1:0x1ff17cfb8c48325e"}
{"user_id": "102404628161888105457", "name": "Simeon", "time": 1448007697817, "rating": 5.0, "text": "Staff is very nice and answered all of my questions.", "pics": null, "resp": null, "gmap_id": "0x886266229824aec1:0x1ff17cfb8c48325e"}
{"user_id": "103788935114690151706", "name": "Chris Tarantino", "time": 1616247301054, "rating": 1.0, "text": "Not open on the weekend at all.  Urgent cares are usually open on the weekend as well.", "pics": null, "resp": null, "gmap_id": "0x888e8f423d71bca7:0xb14b5a093e02110a"}
