{"user_id": "117330932784253247321", "name": "N H", "time": 1593448721342, "rating": 5.0, "text": "The previous reviews for Studio G say it all—this is an all-around, top-notch holistic experience for the mind, body, and soul. I just recently met Genevieve and Ryan as leaders in the local health and wellness community; you don’t need to have known either of them long to get a deep appreciation for the expertise, passion, and drive that they individually have and collectively share for movement that brings balance to the mind and body. Check them out in person, or, if you’re interested in the art of pilates and intentional healing and want to learn more first—visit Studio G’s fantastic webpage: pilatesgmethod.com!", "pics": null, "resp": {"time": 1593571249479, "text": "Thank you, Natalie! We look forward to seeing you again soon! 😍"}, "gmap_id": "0x88891965b0a72bcb:0x4ef23b7738b92124"}
{"user_id": "115484642538141739506", "name": "Brooke Mason", "time": 1558544807729, "rating": 5.0, "text": "Ryan and Genevieve are amazing!!  Love this place!  I have been going for over a year and can see and feel what a difference it has made in my life.", "pics": null, "resp": null, "gmap_id": "0x88891965b0a72bcb:0x4ef23b7738b92124"}
{"user_id": "104072870705930072610", "name": "Bob Mitchell", "time": 1581538761830, "rating": 5.0, "text": "At age 64 I decided to remove myself from the day to day operations of my business. Early on in my career I had learned the importance of staying in shape.  I found that being physically in shape kept my mind sharp, a real advantage in business.  So, realizing now that I would have more free time I assumed I would work out even more.  The opposite occurred, without the structure of working every day I began to enjoy a leisurely lifestyle.\n\nIt became very easy to just relax and put off exercise until the next day which became the next day and the next day and so on until I quit going all together.  As time went on I began to gain weight and my mind was no longer as sharp.  One day I said to my wife enough is enough I need to do something about this now.  As a longtime client of Studio G – who along with a chiropractor cured her vertigo- she convinced me to try pilates.  I did not even know what pilates was but I thought something different from what I had always done could be fun.\n\nThe first time I did pilates on the reformer I could not believe the total workout I could do without hurting myself.  In fact, I have been going to Studio G for almost 2 years now, I am now 68 years old and I have never hurt any part of my body.  Something I could not say about my other exercise routines, especially as I aged.\n\nPilates with Genevieve and Ryan at Studio G has changed my life.  I go 2-3 times a week where not only do I have an hour of Pilates but spend another hour being stretched and doing release work.  They even taught me how to walk properly - most people don’t walk correctly and it makes a big difference.\n\nNow, I am considerably stronger, more flexible, have better posture with broader shoulders, I have more energy and mentally I feel GREAT.\n\nGenevieve and Ryan make the experience even more enjoyable as they are just wonderful people who I enjoy being around.  Today, besides my wife and I, my two daughter and son go as well.  Ryan and Genevieve feel like a part of our family as we all spend so much enjoyable time together.\n\nI highly recommend Studio G and their entire team.  Thanks Studio G for getting me back in the game of life.\n\nBob M", "pics": null, "resp": null, "gmap_id": "0x88891965b0a72bcb:0x4ef23b7738b92124"}
{"user_id": "102633105624105290593", "name": "Brice Jackson", "time": 1518187949959, "rating": 5.0, "text": "Yesterday I had my first active isolated stretching session with Genevieve. It was amazing! It’s astounding how much knowledge she has. I feel amazing today! I am a local massage therapist and was in severe need. Studio G is wonderful! I will be back soon!", "pics": null, "resp": null, "gmap_id": "0x88891965b0a72bcb:0x4ef23b7738b92124"}
{"user_id": "112883610549380708396", "name": "Mike M", "time": 1554405583856, "rating": 5.0, "text": "G Studio and its founder, Genevieve, are Genius!\n\nThe discipline of Pilates is already a thoughtful blend of mechanics, philosophy, and personal will. Genevieve has added her insights on soft tissue therapy to precise Pilates practice. The results will amaze you.\n\nHer combination of Active Isolated Stretching (AIS) and Myofascial Release (MFR) in a Pilates framework is unique. The many physical fitness benefits of expertly supervised Pilates are a given. The many physical therapy benefits with G Studio stretching and release work mixed in are a huge plus. Experiencing healing while strengthening is a wonderful gift.\n\nAnd all this is housed in a cozy, multi-room facility in easily accessible Homewood. Don’t delay. Sign Up and Thrive!", "pics": null, "resp": null, "gmap_id": "0x88891965b0a72bcb:0x4ef23b7738b92124"}
{"user_id": "104295195749799653182", "name": "Whitney Lutz", "time": 1550939172566, "rating": 5.0, "text": "I’ve been going to Studio G for a year now. Genevieve and Ryan are wonderful. They are truly dedicated to their clients and dedicated to getting you to your fitness goals. They were able to help me get rid of my diastases after having two children. I finally have my pre-pregnancy body back!", "pics": null, "resp": {"time": 1550942958302, "text": "Thanks, Whitney! We love working with you and are so excited you have achieved great results and feel like you again! 😉"}, "gmap_id": "0x88891965b0a72bcb:0x4ef23b7738b92124"}
{"user_id": "107510735349284091962", "name": "Lynn C", "time": 1551820170529, "rating": 5.0, "text": "Studio G is the best pilates studio in all of Birmingham.  Genevieve and Ryan are both passionate about what they do and are so supportive and dedicated to their clients needs, whatever it may be.  I have been a client for many years and love the continued challenge and results I feel and see with every session.  If you are looking to get started with pilates or have prior experience, give Studio G a try.  You will NOT be disappointed, in fact you will thank me!", "pics": null, "resp": null, "gmap_id": "0x88891965b0a72bcb:0x4ef23b7738b92124"}
{"user_id": "106470003765955309216", "name": "Matt McCants", "time": 1513342170753, "rating": 5.0, "text": "What a great amazing place!! I was suffering from back pain and I also had pain in my feet as well as shoulder pain. My posture was off, and I had many imbalances.Since my first day visiting a few months ago until now I am completely pain free!!! I noticed a difference after the first session and that had me hooked!! When you are in pain it’s as if you are bound by shackles and chains. I’m so thankful for Studio G and there awesome staff for freeing me from my Pain and allowing me to enjoy life without limitations!! This place deserves 10 stars!!!!!!", "pics": null, "resp": null, "gmap_id": "0x88891965b0a72bcb:0x4ef23b7738b92124"}
